// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем ОбщийКэш;

&НаКлиенте
Перем ИдентификаторИнтеграционногоМодуля;

&НаКлиенте
Перем _ВариантыОтветаПоДокументу;

&НаСервере
Перем _ОбработкаОбъект;

// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//**********************************************
//{		ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	Модуль = ОбработкаОбъект();
	
	ПроверяемыеСвойства = Новый Структура;
	ПроверяемыеСвойства.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПроверяемыеСвойства, Модуль);
	
	// BSLLS:UnusedLocalVariable-off
	ЭтоВнешняяОбработка = (ПроверяемыеСвойства.ИспользуемоеИмяФайла <> Неопределено);
	// BSLLS:UnusedLocalVariable-on
КонецПроцедуры

//{		ОбработчикиСобытийФормы


//**********************************************
//{		СЛУЖЕБНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Процедура Инициализировать(ОсновнойМодуль, СуществующийКонтекст) Экспорт
	
	Объект.ОбщийКонтекстКлиентСервер = СуществующийКонтекст;
	
	ПолученныеФормы_ДобавитьОписание("ОсновнойМодуль", ОсновнойМодуль);
	
КонецПроцедуры

//{		СЛУЖЕБНЫЙ ИНТЕРФЕЙС


//**********************************************
//{		СЛУЖЕБНЫЕ

&НаСервере
Функция ПараметрыСтрокой(Параметр0, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5)
	
	Результат		 = "";
	Разделитель		 = "";
	МассивПараметров = ОбработкаОбъект().ПараметрыВМассив(Параметр0, Параметр1, Параметр2, Параметр3, Параметр4);
	
	Для Индекс = 0 По МассивПараметров.ВГраница() Цикл
		
		Если МассивПараметров[Индекс] = NULL Тогда
			Результат = Результат + Разделитель;
		Иначе
			Результат = Результат + Разделитель + "Параметр" + Индекс;
		КонецЕсли;
		
		Разделитель = ", ";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает объект текущей обработки
// 
// Возвращаемое значение:
//  ОбработкаОбъект
//
&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

// Возвращает системную информацию клиента, если есть клиентское приложение.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ВерсияОС - Строка - версия операционной системы
//    * ВерсияПриложения - Строка - версия 1С:Предприятия
//    * ТипПлатформы - Строка - представление типа платформы
//    * ИдентификаторКлиента - УникальныйИдентификатор - уникальный идентификатор клиента
//    * ИнформацияПрограммыПросмотра - Строка - информация о веб-браузере
//    * ИмяКомпьютера - Строка - имя компьютера
//    * ЯзыкСистемы - Строка - используемый системой язык
//    * ЯзыкИнтерфейса - Строка - код языка интерфейса пользователя
//    * ВидКлиента - Строка - см. ВидКлиента()
//
&НаКлиенте
Функция СистемнаяИнформацияНаКлиенте() Экспорт
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Данные = Новый Структура;
	Данные.Вставить("ВерсияОС", СисИнфо.ВерсияОС);
	Данные.Вставить("ВерсияПриложения", СисИнфо.ВерсияПриложения);
	Данные.Вставить("ТипПлатформы", Строка(СисИнфо.ТипПлатформы));
	Данные.Вставить("ИдентификаторКлиента", СисИнфо.ИдентификаторКлиента);
	Данные.Вставить("ИнформацияПрограммыПросмотра", СисИнфо.ИнформацияПрограммыПросмотра);
	Данные.Вставить("ИмяКомпьютера", ИмяКомпьютера());
	Данные.Вставить("ЯзыкСистемы", ТекущийЯзыкСистемы());
	Данные.Вставить("ЯзыкИнтерфейса", ЯзыкИнтерфейсаПользователя());
	Данные.Вставить("ВидКлиента", ВидКлиента());
	
	Результат = Новый ФиксированнаяСтруктура(Данные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЯзыкИнтерфейсаПользователя()
	
	#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
	Результат = ТекущийЯзык().КодЯзыка;
	#Иначе
	Результат = ТекущийЯзык();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидКлиента()
	
	Результат = "<undefined>";
	
	#Если ТонкийКлиент Тогда
		Результат = "Тонкий клиент";
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		Результат = "Толстый клиент обычное приложение";
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		Результат = "Толстый клиент управляемые формы";
	#ИначеЕсли ВебКлиент Тогда
		Результат = "Веб клиент";
	#ИначеЕсли НаСервере Тогда
		Результат = "Сервер";
	#ИначеЕсли ВнешнееСоединение Тогда
		Результат = "Внешнее соединение";
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

//{		СЛУЖЕБНЫЕ


//**********************************************
//{		ОБЩИЙ КОНТЕКСТ

// Возвращает значение из общего контекста.
//
&НаКлиенте
Функция ОбщийКонтекст_Прочитать(ИмяПараметра) Экспорт
	
	Результат = СвойствоСтруктуры(Объект.ОбщийКонтекстКлиентСервер, ИмяПараметра);
	
	Возврат Результат;
	
КонецФункции

// Помещяет в общий контекст новое значение
//
&НаКлиенте
Процедура ОбщийКонтекст_Поместить(Ключ, Значение) Экспорт
	
	Если Объект.ОбщийКонтекстКлиентСервер = Неопределено Тогда
		Объект.ОбщийКонтекстКлиентСервер = Новый Структура;
	КонецЕсли;
	
	Объект.ОбщийКонтекстКлиентСервер.Вставить(Ключ, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийКонтекст_ДополнитьЗначениямиИзОбщихНастроек(Контекст) Экспорт
	
	ОбщийКонтекст_ДополнитьЗначениямиИзОбщихНастроекВызовСервера(Контекст);
	
КонецПроцедуры

&НаСервере
Процедура ОбщийКонтекст_ДополнитьЗначениямиИзОбщихНастроекВызовСервера(Контекст)
	
	Ядро = ОбработкаОбъект();
	Ядро.ОбщийКонтекст_ДополнитьЗначениямиИзОбщихНастроек(Контекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОбщийКонтекст()
	
	Если Не ЗначениеЗаполнено(Объект.ОбщийКонтекстКлиентСервер) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Объект.ОбщийКонтекстКлиентСервер Цикл
		
		Если ЭтоАдресИзВременногоХранилища(Элемент.Значение) Тогда
			ВременноеХранилище_Удалить(Элемент.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.ОбщийКонтекстКлиентСервер.Очистить();
	
КонецПроцедуры

// Возвращает значение идентификатора текущей ИБ из общего контекста
// 
// Возвращаемое значение:
//  Строка - идентификатор ИБ в виде GUID
//
&НаКлиенте
Функция ОбщийКонтекст_ИдентификаторБазы1С()

	Результат = ОбщийКонтекст_Прочитать("ИдентификаторБазы1С");
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение идентификатора Контура текущей ИБ из общего контекста
// 
// Возвращаемое значение:
//  Строка - идентификатор Контура ИБ в виде GUID
//
&НаКлиенте
Функция ОбщийКонтекст_КонтурИдентификаторИБ() Экспорт

	Результат = ОбщийКонтекст_Прочитать("КонтурИдентификаторИБ");
	
	Возврат Результат;
	
КонецФункции

//}		ОБЩИЙ КОНТЕКСТ


//**********************************************
//{		КОНФИГ-ФАЙЛ

// Возвращает путь к конфигурационному файлу из параметров запуска.
//
// Параметры:
//  ПараметрыЗапускаСтрокой - Строка - Параметры запуска приложения
// 
// Возвращаемое значение:
//  Строка - путь к конфигурационному файлу.
//
&НаКлиенте
Функция КонфигурационныйФайл_Путь(Знач ПараметрыЗапускаСтрокой) Экспорт
	Возврат КонфигурационныйФайл_ПутьВызовСервера(ПараметрыЗапускаСтрокой);
КонецФункции

&НаСервере
Функция КонфигурационныйФайл_ПутьВызовСервера(Знач ПараметрыЗапускаСтрокой) Экспорт
	
	Ядро = ОбработкаОбъект();
	Результат = Ядро.КонфигурационныйФайл_Путь(ПараметрыЗапускаСтрокой);
	
	Возврат Результат;
	
КонецФункции

//}		КОНФИГ-ФАЙЛ


//**********************************************
//{		МОДУЛИ

&НаКлиенте
Функция ПодключаемыйМодуль_ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	Модуль_ПМ = Модуль_ПМ(ЭтаФорма);
	
	Если Модуль_ПМ <> Неопределено Тогда
		
		// Определим владельца формы в этом месте, чтобы он был доступен из ПМ в режиме отладки.
		ВладелецНовойФормы = Модуль_ВызовыПМ(ЭтаФорма);
		Модуль_ПМ.ВладелецФормы = ВладелецНовойФормы;
		
		Результат = Модуль_ПМ.ОбработатьСобытие(ИмяСобытия, Параметры);
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	КонтурПлагины_ОбработатьСобытие(ИмяСобытия, Параметры, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодключаемыйМодуль_ОбработатьСобытиеНаСервере(ИмяСобытия, Параметры) Экспорт
	
	Результат = ПодключаемыйМодуль_ОбработатьСобытиеНаСервереВызовСервера(ИмяСобытия, Параметры);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодключаемыйМодуль_ОбработатьСобытиеНаСервереВызовСервера(ИмяСобытия, Параметры)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ПодключаемыйМодуль_ОбработатьСобытие(ИмяСобытия, Параметры);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КонтурПлагины_ЗаписатьОшибкуИнициализацииБиблиотеки()
	
	Ошибка = "Модуль не инициализирован (КонтурПлагины)!";
	Операция = "Диадок.Плагины";
	
	Ошибка_Обработать(Операция, Ошибка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурПлагины_ОбработатьСобытие(ИмяСобытия, Параметры, Результат)
	
	Если Не ИспользоватьПлагины() Тогда
		Возврат;
	КонецЕсли;
	
	МодульКП = Модуль_КонтурПлагины(ЭтаФорма);
	
	Если МодульКП = Неопределено Тогда
		КонтурПлагины_ЗаписатьОшибкуИнициализацииБиблиотеки();
		Возврат;
	КонецЕсли;
	
	ВладелецНовойФормы = Модуль_ВызовыПМ(ЭтаФорма);
	МодульКП.ВладелецФормы = ВладелецНовойФормы;
	
	Контекст = КонтурПлагины_КонтекстВызова();
	
	Попытка
		
		Параметры.Вставить("РезультатОбработки", Результат);
		МодульКП.ОбработатьСобытие(ИмяСобытия, Параметры, Контекст);
		Параметры.Свойство("РезультатОбработки", Результат);
		
	Исключение
		
		ВидОперации = "Обработка события плагинов на клиенте";
		ТекстСообщения = "Не удалось обработать событие";
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Ошибка_Обработать(ВидОперации, ТекстОшибки, ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция Модуль_ПМ(ВызывающийМодуль) Экспорт
	
	Результат = Неопределено;
	
	Если ИспользоватьПМ() Тогда
		
		ИмяМодуля = "ПМ";
		ИмяФормыМодуля = "ПодключаемыйМодуль";
		Результат = СоздатьМодуль(ИмяМодуля, ИмяФормыМодуля); 
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_ИМ()
	
	ИмяМодуля = ИнтеграционныйМодуль_ПолучитьИмяМакета();
	ИмяФормыМодуля = "ПодключаемыйМодуль";
	Результат = СоздатьМодуль(ИмяМодуля, ИмяФормыМодуля);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_ВызовыПМ(ВызывающийМодуль)
	
	ИмяМодуля = "КонтурДиадокВызовыПМ";
	Результат = СоздатьМодуль(ИмяМодуля, "КлиентскиеВызовы");
	
	// Необходимо очистить владельца формы модуля "ВызовыПМ", 
	// для исключения обращений к клиентскому ядру из формы ПМ через обращения вида: 
	// ЭтаФорма.ВладелецФормы.ВладелецФормы
	Результат.ВладелецФормы = Неопределено;
	
	Результат.ИнициализироватьМодуль(ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_ВнешниеСервисы(ВызывающийМодуль) Экспорт
	
	ИмяМодуля = "КонтурДиадокВнешниеСервисы";
	Результат = СоздатьМодуль(ИмяМодуля, "КлиентскиеВызовы");
	
	ИспользоватьВнешнийHTTP = ЗначениеНастройки_ИспользоватьВнешнийHTTPВызовСервера();
	Результат.ИнициализироватьМодуль(ИспользоватьВнешнийHTTP);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_МенеджерКриптографии(ВызывающийМодуль) Экспорт
	
	ИмяФормыОбработки = "Обработка.КонтурДиадокМенеджерКриптографии.Форма.КлиентскиеВызовы";
	Если ЭтоВнешняяОбработка Тогда
		ИмяФормыОбработки = "ВнешняяОбработка.КонтурДиадокМенеджерКриптографии.Форма.КлиентскиеВызовы";
	КонецЕсли;
	
	// BSLLS:GetFormMethod-off
	Результат = ПолучитьФорму(ИмяФормыОбработки);
	// BSLLS:GetFormMethod-on
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_ОнлайнСчета(ВызывающийМодуль) Экспорт
	
	ИмяМодуля = "КонтурДиадокОнлайнСчета";
	Результат = СоздатьМодуль(ИмяМодуля, "КлиентскиеВызовы");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_Плагин(ВызывающийМодуль) Экспорт
	
	ИмяМодуля = "КонтурДиадокПлагин1С";
	Результат = СоздатьМодуль(ИмяМодуля, "КлиентскиеВызовы");
	
	Если ФайловыйРежимРаботы() Тогда
		Результат.ОтключитьКэшПлагина();
	КонецЕсли; 
	
	Результат.ИнициализироватьМодуль(ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_ПарсерJSON(ВызывающийМодуль) Экспорт
	
	ИмяМодуля = "КонтурДиадокПарсерJSON";
	Результат = СоздатьМодуль(ИмяМодуля, "КлиентскиеВызовы");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_РаботаСЛогистикой(ВызывающийМодуль) Экспорт
	
	ИмяМодуля = "КонтурДиадокРаботаСЛогистикой";
	Результат = СоздатьМодуль(ИмяМодуля, "КлиентскиеВызовы");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеМодулейИФункций()
	
	Результат = Новый Структура;
	
	Результат.Вставить("КонтурДиадокВнешниеСервисы", "Модуль_ВнешниеСервисы");
	Результат.Вставить("КонтурДиадокВызовыПМ", "Модуль_ВызовыПМ");
	Результат.Вставить("КонтурДиадокГенерацияXML", "Модуль_ГенерацияXML");
	Результат.Вставить("КонтурДиадокКлиентУведомлений", "Модуль_КлиентУведомлений");
	Результат.Вставить("КонтурДиадокПлагины", "Модуль_КонтурПлагины");
	Результат.Вставить("КонтурДиадокМетодыAPI", "Модуль_МетодыAPI");
	Результат.Вставить("КонтурДиадокОнлайнСчета", "Модуль_ОнлайнСчета");
	Результат.Вставить("КонтурДиадокПарсерJSON", "Модуль_ПарсерJSON");
	Результат.Вставить("КонтурДиадокПечатныеФормы", "Модуль_ПечатныеФормы");
	Результат.Вставить("КонтурДиадокПлагин1С", "Модуль_Плагин");
	Результат.Вставить("КонтурДиадокХранениеДанных", "Модуль_ХранениеДанных");
	Результат.Вставить("КонтурДиадокЦентрПоддержки", "Модуль_ЦентрПоддержки");
	Результат.Вставить("КонтурДиадокШлюзАвторизации", "Модуль_ШлюзАвторизации");
	Результат.Вставить("КонтурДиадокЭмуляторТабДокумента", "Модуль_ЭмуляторТабДокумента");
	Результат.Вставить("КонтурДиадокРаботаСЛогистикой", "Модуль_РаботаСЛогистикой");
	Результат.Вставить("КонтурДиадокРаботаСМаркировкой", "Модуль_РаботаСМаркировкой");
	Результат.Вставить("КонтурДиадокМенеджерКриптографии", "Модуль_МенеджерКриптографии");
	Результат.Вставить("КонтурДиадокЯдро", "Модуль_Ядро");
	
	ФункцияИнтеграции = "Модуль_ИМ";
	
	Результат.Вставить("КонтурДиадокИнтеграцияААА6", ФункцияИнтеграции);
	Результат.Вставить("КонтурДиадокИнтеграцияБГУ20", ФункцияИнтеграции);
	Результат.Вставить("КонтурДиадокИнтеграцияБП30", ФункцияИнтеграции);
	Результат.Вставить("КонтурДиадокИнтеграцияРозница2", ФункцияИнтеграции);
	Результат.Вставить("КонтурДиадокИнтеграцияУНФ16", ФункцияИнтеграции);
	Результат.Вставить("КонтурДиадокИнтеграцияУТ11", ФункцияИнтеграции);
	Результат.Вставить("ПМ", "Модуль_ПМ");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СоздатьМодуль(ИмяМодуля, ИмяНовойФормы, ВладелецНовойФормы = Неопределено)
	
	Результат = КэшМодулей_Прочитать(ИмяМодуля);
	
	Если Результат = Неопределено Тогда
		
		ОписаниеОбработки = ПодключенныеОбработки_Прочитать(ИмяМодуля);
		
		Если НЕ ЗначениеЗаполнено(ОписаниеОбработки) Тогда
			
			ПодключитьМодуль(ИмяМодуля);
			ОписаниеОбработки = ПодключенныеОбработки_Прочитать(ИмяМодуля);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеОбработки) Тогда
			
			Если ВладелецНовойФормы = Неопределено Тогда
				ВладелецНовойФормы = ЭтаФорма;
			КонецЕсли;
			
			ПолноеИмяФормы = ПолноеИмяФормыБиблиотеки(ИмяМодуля, ИмяНовойФормы);
			
			ПредставлениеОшибки = "";
			
			Попытка
				Результат = ПолучитьФорму(ПолноеИмяФормы, , ВладелецНовойФормы);
			Исключение
				ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
			
			Если Результат = Неопределено Тогда
				
				ПодключитьМодуль(ИмяМодуля);
				
				Попытка
					Результат = ПолучитьФорму(ПолноеИмяФормы, , ВладелецНовойФормы);
				Исключение
					ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				КонецПопытки;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПредставлениеОшибки) Тогда
				
				Если ОбязательноНаличиеКлиентскойЧасти(ИмяМодуля) Тогда
					
					ВидОперации = НСтр("ru = 'Подключение модуля'");
					ПодробныйТекстОшибки = "Форма: " + ПолноеИмяФормы + Символы.ПС + ПредставлениеОшибки;
					ТекстСообщения = Общее_ПодставитьПараметрыВСтроку("Не удалось подключить модуль %1!", ПолноеИмяФормы);
					
					Ошибка_Обработать(ВидОперации, ПодробныйТекстОшибки, ТекстСообщения);
					
				КонецЕсли;
				
				Возврат Результат;
				
			КонецЕсли;
			
			КэшМодулей_Поместить(ИмяМодуля, Результат);
			
			ПолученныеФормы_ДобавитьОписание(ИмяМодуля, Результат)
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбязательноНаличиеКлиентскойЧасти(Знач ИмяМодуля)
	
	Возврат ИмяМодуля <> "ПМ";

КонецФункции

&НаКлиенте
Функция ПолноеИмяФормыБиблиотеки(ИмяМодуля, ИмяФормыБиблиотеки = "КлиентскиеВызовы")
	
	ОписаниеОбработки = ПодключенныеОбработки_Прочитать(ИмяМодуля);
	
	Результат = "Обработка." + ОписаниеОбработки.Имя + ".Форма." + ИмяФормыБиблиотеки;
	
	Если ОписаниеОбработки.ИсточникБиблиотеки <> ПодключенныеОбработки_ВозможныеИсточникиБиблиотек().Конфигурация Тогда
		ПрефиксДляВнешнейОбработки = "Внешняя";
		Результат = ПрефиксДляВнешнейОбработки + Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьМодуль(ИмяМодуля)
	
	ОписаниеОбработки = ПодключитьМодульНаСервере(ИмяМодуля);
	ПодключенныеОбработки_Поместить(ИмяМодуля, ОписаниеОбработки);
	
КонецПроцедуры

&НаСервере
Функция ПодключитьМодульНаСервере(ИмяМодуля)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.Модуль_Отключить(ИмяМодуля);
	
	СоответствиеМодулейИФункций = СоответствиеМодулейИФункций();
	
	ИмяФункции = СоответствиеМодулейИФункций[ИмяМодуля];
	
	// BSLLS:UnusedLocalVariable-off
	// BSLLS:ExecuteExternalCode-off
	Модуль = Вычислить("ОбработкаОбъект." + ИмяФункции + "(ОбработкаОбъект)");
	// BSLLS:UsingExternalCodeTools-on
	// BSLLS:ExecuteExternalCode-on
	
	// После подключения модуля нужно передать на клиента новый общий контекст.
	Объект.ОбщийКонтекстКлиентСервер = ОбработкаОбъект.ОбщийКонтекстКлиентСервер;
	
	ПодключенныеОбработки = ОбработкаОбъект.СвойствоСтруктуры(Объект.ОбщийКонтекстКлиентСервер,
			"ПодключенныеОбработки",
			Новый Соответствие);
	
	Результат = ПодключенныеОбработки.Получить(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КэшМодулей_Прочитать(ИмяМодуля)
	
	Результат = Неопределено;
	
	Если РежимОтладкиВключен() Тогда
		Возврат Результат;
	КонецЕсли;
	
	КэшМодулей = Кэш_Прочитать("КэшМодулей");
	
	Если ЗначениеЗаполнено(КэшМодулей) Тогда
		Результат = КэшМодулей[ИмяМодуля];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КэшМодулей_Поместить(ИмяМодуля, Модуль)
	
	Если РежимОтладкиВключен() Тогда
		Возврат;
	КонецЕсли;
	
	КэшМодулей = Кэш_Прочитать("КэшМодулей");
	
	Если КэшМодулей = Неопределено Тогда
		
		КэшМодулей = Новый Соответствие;
		
		Кэш_Поместить("КэшМодулей", КэшМодулей);
		
	КонецЕсли;
	
	КэшМодулей.Вставить(ИмяМодуля, Модуль);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКэшМодулей()
	
	Если РежимОтладкиВключен() Тогда
		Возврат;
	КонецЕсли;
	
	КэшМодулей = Кэш_Прочитать("КэшМодулей");
	
	Если Не ЗначениеЗаполнено(КэшМодулей) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваДляОчистки = Новый Структура;
	СвойстваДляОчистки.Вставить("КонтурДиадокЯдро");
	СвойстваДляОчистки.Вставить("ОсновнойМодуль");
	
	Для Каждого Элемент Из КэшМодулей Цикл
		
		Модуль = Элемент.Значение;
		
		Если Модуль <> Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(Модуль, СвойстваДляОчистки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	КэшМодулей.Очистить();
	
КонецПроцедуры

&НаКлиенте
Функция ОписанияПодключенныхОбработок()
	
	Результат = Неопределено;
	
	Ключ = "ПодключенныеОбработки";
	
	Объект.ОбщийКонтекстКлиентСервер.Свойство(Ключ, Результат);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		Результат = Новый Соответствие;
		Объект.ОбщийКонтекстКлиентСервер.Вставить(Ключ, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодключенныеОбработки_ВозможныеИсточникиБиблиотек()
	
	Ключ = "ПодключенныеОбработки_ВозможныеИсточникиБиблиотек";
	
	Результат = Кэш_Прочитать(Ключ);
	
	Если Результат = Неопределено Тогда
		
		Результат = ПодключенныеОбработки_ВозможныеИсточникиБиблиотекВызовСервера();
		
		Кэш_Поместить(Ключ, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодключенныеОбработки_ВозможныеИсточникиБиблиотекВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ПодключенныеОбработки_ВозможныеИсточникиБиблиотек();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключенныеОбработки_Поместить(ИмяМодуля, ОписаниеОбработки)
	
	ПодключенныеОбработки = ОписанияПодключенныхОбработок();
	
	ПодключенныеОбработки.Вставить(ИмяМодуля, ОписаниеОбработки);
	
КонецПроцедуры

&НаКлиенте
Функция ПодключенныеОбработки_Прочитать(ИмяМодуля)
	
	Результат = Неопределено;
	
	ПодключенныеОбработки = ОписанияПодключенныхОбработок();
	
	Результат = ПодключенныеОбработки[ИмяМодуля];
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолученныеФормы_ДобавитьОписание(ИмяМодуля, ФормаМодуля)
	
	ОписаниеФормы = НовоеОписаниеПолученнойФормы();
	ОписаниеФормы.ИмяМодуля = ИмяМодуля;
	
	ЗаполнитьЗначенияСвойств(ОписаниеФормы, ФормаМодуля);
	
	ПолученныеФормы_Поместить(ИмяМодуля, ОписаниеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученныеФормы_Поместить(ИмяМодуля, ОписаниеФормы)
	
	ПолученныеФормы = Кэш_Прочитать("ПолученныеФормы");
	
	Если ПолученныеФормы = Неопределено Тогда
		
		ПолученныеФормы = Новый Соответствие;
		
		Кэш_Поместить("ПолученныеФормы", ПолученныеФормы);
		
	КонецЕсли;
	
	ПолученныеФормы.Вставить(ИмяМодуля, ОписаниеФормы);
	
КонецПроцедуры

&НаКлиенте
Функция ПолученныеФормы_Прочитать(ИмяМодуля)
	
	Результат = Неопределено;
	
	ПолученныеФормы = Кэш_Прочитать("ПолученныеФормы");
	
	Если ПолученныеФормы <> Неопределено Тогда
		
		Результат = ПолученныеФормы[ИмяМодуля];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовоеОписаниеПолученнойФормы()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяФормы");
	Результат.Вставить("ИмяМодуля");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДоступныеИнтеграционныеМодули() Экспорт
	
	Результат = ДоступныеИнтеграционныеМодулиНаСервере();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДоступныеИнтеграционныеМодулиНаСервере()
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ДоступныеИнтеграционныеМодули();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИспользуетсяТиповойИнтеграционныйМодуль()
	
	ИмяИМ = ИнтеграционныйМодуль_ПолучитьИмяМакета();
	Результат = (ИмяИМ <> ТиповойИнтеграционныйМодульОтсутствует());
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИнтеграционныйМодуль_ПолучитьИмяМакета()
	
	Если Не ЗначениеЗаполнено(ИдентификаторИнтеграционногоМодуля) Тогда
		
		ИдентификаторИнтеграционногоМодуля = ИдентификаторИнтеграционногоМодуляВызовСервера();
		
		Если Не ЗначениеЗаполнено(ИдентификаторИнтеграционногоМодуля) Тогда
			ИдентификаторИнтеграционногоМодуля = ТиповойИнтеграционныйМодульОтсутствует();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИдентификаторИнтеграционногоМодуля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТиповойИнтеграционныйМодульОтсутствует()
	Возврат "Отсутствует";
КонецФункции

&НаСервере
Функция ИдентификаторИнтеграционногоМодуляВызовСервера()
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ИнтеграционныйМодуль_ПолучитьИмяМакета();
	
	Возврат Результат;
	
КонецФункции

// Использовать внешний HTTP транспорт WinHTTP
// 
// Возвращаемое значение:
//  Булево - Возможность использования внешнего HTTP на основании настроек 
//
&НаСервере
Функция ЗначениеНастройки_ИспользоватьВнешнийHTTPВызовСервера() Экспорт
	
	Ядро = ОбработкаОбъект();
	Результат = Ядро.ЗначениеНастройки_ИспользоватьВнешнийHTTP();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИспользоватьВнешнююКриптографиюНаСервере() Экспорт
	
	Ядро = ОбработкаОбъект();
	Результат = Ядро.ИспользоватьВнешнююКриптографию();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИспользоватьВнешнююКриптографию()
	
	Результат = ИспользоватьВнешнююКриптографиюНаСервере();
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ФормироватьКвитанцииОбОтменеФиксации() Экспорт
	
	Результат = ФормироватьКвитанцииОбОтменеФиксацииНаСервере();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ФормироватьКвитанцииОбОтменеФиксацииНаСервере()
	
	Ядро = ОбработкаОбъект();
	Результат = Ядро.ФормироватьКвитанцииОбОтменеФиксации();
	
	Возврат Результат;
	
КонецФункции

//{		МОДУЛИ


//**********************************************
//{		КОНТЕКСТ СЕАНСА С СЕРВИСОМ ДИАДОК

// Возвращает строку контекста по указанному идентификатору ящика Диадока.
//
// Параметры:
//  BoxId              - Строка - Идентификатор ящика Диадока;
//  ВызыватьИсключение - Булево - Истина, если необходимо вызвать исключение
//                                при остутствии строки по указанному BoxId.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. МодельСтрокаКонтекстаСеанса
//
&НаКлиенте
Функция КонтекстСеанса_СтрокаКонтекста(BoxId, ВызыватьИсключение = Истина) Экспорт
	
	Результат = КонтекстСеанса_СтрокаКонтекстаВызовСервера(BoxId, ВызыватьИсключение);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строки контекста сеанса за исключением служебной строки,
// а также за исключением строк где требуется оплата сервиса.
//
// Параметры:
//  ДобавитьНеоплаченные - Булево - Истина, если строки где требуется оплата сервиса
//                                  нужно включить в результат.
//
// Возвращаемое значение:
//   - Соответствие - см. описание СоздатьКонтекстСеанса()
//
&НаКлиенте
Функция КонтекстСеанса_СтрокиКонтекста(ДобавитьНеоплаченные = Ложь) Экспорт
	
	Результат = Новый Соответствие;
	
	ХранилищеКонтекста = ХранилищеКонтекстаСеанса();
	
	Если ЗначениеЗаполнено(ХранилищеКонтекста) Тогда
		
		Для Каждого КлючИЗначение Из ХранилищеКонтекста Цикл
			
			СтрокаКонтекста = КлючИЗначение.Значение;
			
			ТребуетсяОплатаСервиса = СтрокаКонтекста.ТребуетсяОплатаСервиса;
			ЭтоСлужебнаяУчетнаяЗапись = НЕ ЗначениеЗаполнено(СтрокаКонтекста.BoxId);
			
			Если (НЕ ТребуетсяОплатаСервиса ИЛИ ДобавитьНеоплаченные) И НЕ ЭтоСлужебнаяУчетнаяЗапись Тогда
				
				Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ФиксированныеДанныеЛок(Результат);
	
КонецФункции

// Восстанавливает сессию пользователя по сохраненной настройке
//
// Параметры:
//  НастройкаСеанса - ФиксированнаяСтруктура - см. Ядро.Контракт_НастройкаСеанса
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. Ядро.МодельСессияПользователя
//
&НаКлиенте
Функция КонтекстСеанса_ВосстановитьСессию(НастройкаСеанса) Экспорт
	Возврат КонтекстСеанса_ВосстановитьСессиюВызовСервера(НастройкаСеанса);
КонецФункции

// Записывает пустой контекст во временное хранилище.
//
&НаКлиенте
Процедура КонтекстСеанса_Очистить() Экспорт
	
	НовыйКонтекст = ФиксированныеДанныеЛок(Новый Соответствие);
	
	УстановитьНовыйКонтекстСеанса(НовыйКонтекст);
	
КонецПроцедуры

// Возвращает коллекцию контекста сеанса
// 
// Возвращаемое значение:
//   - Соответствие
//
&НаКлиенте
Функция ХранилищеКонтекстаСеанса() Экспорт
	
	АдресКонтекстаСеанса = ОбщийКонтекст_Прочитать("АдресКонтекстаСеанса");
	
	Результат = ВременноеХранилище_Прочитать(АдресКонтекстаСеанса);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтекстСеанса_СтрокаКонтекстаВызовСервера(BoxId, ВызыватьИсключение)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.КонтекстСеанса_СтрокаКонтекста(BoxId, ВызыватьИсключение);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтекстСеанса_ПрочитатьВызовСервера(BoxId, ИмяПоля, ВызыватьИсключение = Истина)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.КонтекстСеанса_Прочитать(BoxId, ИмяПоля, ВызыватьИсключение);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтекстСеанса_ВосстановитьСессиюВызовСервера(Знач НастройкаСеанса) Экспорт
	
	Ядро = ОбработкаОбъект();
	Результат = Ядро.КонтекстСеанса_ВосстановитьСессию(НастройкаСеанса);
	Возврат Результат;
	
КонецФункции

// Записывает новый контекст сеанса во временное хранилище.
//
// Параметры:
//  НовыйКонтекст - Соответствие - см. функцию СоздатьКонтекстСеанса().
//
&НаКлиенте
Процедура УстановитьНовыйКонтекстСеанса(НовыйКонтекст)
	
	АдресКонтекстаСеанса = ОбщийКонтекст_Прочитать("АдресКонтекстаСеанса");
	
	ВременноеХранилище_Поместить(НовыйКонтекст, АдресКонтекстаСеанса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКонтекстИКэшСеанса() Экспорт
	
	ОчиститьКонтекстИКэшСеансаВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКонтекстИКэшСеансаВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.ОчиститьКонтекстИКэшСеанса();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаблокированныеОрганизации_Наличие() Экспорт
	
	Результат = ЗаблокированныеОрганизации_НаличиеНаСервере();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаблокированныеОрганизации_НаличиеНаСервере() Экспорт
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ЗаблокированныеОрганизации_Наличие();
	
	Возврат Результат;
	
КонецФункции

// Получает BoxID по ссылке на организацию из 1С
//
// Параметры:
//  ОрганизацияИБ	 - СправочникСсылка - Ссылка на элемент справочника 1С
//
// Возвращаемое значение:
//  Строка - BoxID сопоставленной организации
//
&НаСервере
Функция Организации_ИдентификаторПоСсылке(ОрганизацияИБ) Экспорт
	
	Ядро = ОбработкаОбъект();
	Результат = Ядро.Организации_ИдентификаторПоСсылке(ОрганизацияИБ);
	
	Возврат Результат;
	
КонецФункции

//}		КОНТЕКСТ СЕАНСА С СЕРВИСОМ ДИАДОК


//**********************************************
//{		КЭШИРОВАНИЕ

// Возвращает значение из общего для всех форм кэша
//
// Параметры:
//  Ключ - Строка - см. процедуру Кэш_Поместить.
//
// Возвращаемое значение: 
//   Произвольный - см. процедуру Кэш_Поместить.
//
&НаКлиенте
Функция Кэш_Прочитать(Ключ) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ОбщийКэш) Тогда
		Результат = ОбщийКэш.Получить(Ключ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Помещает значение в общий для всех форм кэш
//
// Параметры:
//  Ключ     - Строка       - уникальный ключ помещаемого значения.
//  Значение - Произвольный - помещаемое значение.
//
&НаКлиенте
Процедура Кэш_Поместить(Ключ, Значение) Экспорт
	
	Если ОбщийКэш = Неопределено Тогда
		ОбщийКэш = Новый Соответствие;
	КонецЕсли;
	
	ОбщийКэш.Вставить(Ключ, Значение);
	
КонецПроцедуры

// Очищает общий для всех форм кэш.
//
&НаКлиенте
Процедура ОчиститьКэш()
	
	Если Не ЗначениеЗаполнено(ОбщийКэш) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыКоллекций = Новый Соответствие;
	ТипыКоллекций.Вставить(Тип("Массив")		, Истина);
	ТипыКоллекций.Вставить(Тип("Структура")		, Истина);
	ТипыКоллекций.Вставить(Тип("Соответствие")	, Истина);
	ТипыКоллекций.Вставить(Тип("СписокЗначений"), Истина);
	
	Для Каждого КлючИЗначение Из ОбщийКэш Цикл
		
		ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
		
		Если ТипыКоллекций[ТипЗначения] = Истина Тогда
			КлючИЗначение.Значение.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщийКэш.Очистить();
	
КонецПроцедуры

// Обновляет значения переменных в локальном кэше после измненения настроек модуля
//
&НаКлиенте
Процедура ОбновитьКэшПослеИзмененияНастроек() Экспорт
	
	Кэш_Поместить("РежимЛогированияВключен", Неопределено);
	Кэш_Поместить("КоличествоПакетовВГрупповойОперации", Неопределено);
	
КонецПроцедуры

//}		КЭШИРОВАНИЕ


//**********************************************
//{		ВРЕМЕННОЕ ХРАНИЛИЩЕ

// Получает данные из временного хранилища.
// Для 8.1 значение получается из специального соответствия в общем кэше.
//
// Параметры:
//  Адрес - Строка                  - адрес во временном хранилище;
//        - УникальныйИдентификатор - идентификатор в общем кэше;
//
// Возвращаемое значение: 
//   Произвольный - данные из временого хранилища.
//   Неопределено - если по указаному адресу данных нет.
//
&НаКлиенте
Функция ВременноеХранилище_Прочитать(Адрес)
	
	Результат = ПолучитьИзВременногоХранилища(Адрес);
	
	Возврат Результат;
	
КонецФункции

// Помещает значение во временное хранилище.
// Для 8.1 значение помещяется в специальное соответствие в общем кэше.
//
// Параметры:
//  Данные - Произвольный            - данные, которые нужно поместить;
//  Адрес  - Строка                  - адрес во временном хранилище;
//         - УникальныйИдентификатор - идентификатор, по которому нужно создать новый адрес;
//
// Возвращаемое значение: 
//   Строка - адрес во временном хранилище.
//
&НаКлиенте
Функция ВременноеХранилище_Поместить(Значение, Адрес = Неопределено)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		Результат = ПоместитьВоВременноеХранилище(Значение, Адрес);
	Иначе
		Результат = ПоместитьВоВременноеХранилище(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаляет данные из временного хранилища
//
// Параметры:
//  Адрес - Строка - адрес во временном хранилище
//
Процедура ВременноеХранилище_Удалить(Адрес)
	
	УдалитьИзВременногоХранилища(Адрес);
	
КонецПроцедуры

//}		ВРЕМЕННОЕ ХРАНИЛИЩЕ


//**********************************************
//{		ОБЩЕГО НАЗНАЧЕНИЯ

// Сравнивает текущую версию приложения с указанной версией.
// 
// Параметры:
//  Версия - Строка - номер версии, с которой нужно сравнить текущую версию приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая версия приложения старше чем версия параметра.
//            Например, 8.2 старше чем 8.3.
//
&НаКлиенте
Функция ПриложениеСтаршеВерсии(Версия) Экспорт
	
	Результат = (СравнитьВерсии(ОписаниеСистемнойИнформации().ВерсияПриложения, Версия) < 0);
	
	Возврат Результат;
	
КонецФункции

// Возвращает системную информацию
// 
// Возвращаемое значение:
//  СистемнаяИнформация
//
&НаКлиенте
Функция ОписаниеСистемнойИнформации()
	
	Результат = Новый СистемнаяИнформация;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеКонфигурации()
	
	Результат = Новый Структура;
	Результат.Вставить("Имя"	, Метаданные.Имя);
	Результат.Вставить("Версия"	, Метаданные.Версия);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТекущийРежимЗапускаПриложения()
	
	Результат = Строка(ТекущийРежимЗапуска());
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
        Результат = "Фоновое задание";
    КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, запущен ли модуль в режиме тестирования.
// 
// Возвращаемое значение:
//  Булево - Истина, если передан параметр "Автотест"
//
&НаКлиенте
Функция РежимАвтотест() Экспорт
	
	Результат = ОбщийКонтекст_Прочитать("Автотест");
	
	Возврат Результат;
	
КонецФункции

// Читает из общего контекста признак включенного режима отладки.
//
// Возвращаемое значение:
//   Булево - Истина, если режим отладки включен.
//
&НаКлиенте
Функция РежимОтладкиВключен() Экспорт
	
	Результат = ОбщийКонтекст_Прочитать("РежимОтладки") = Истина;
	
	Возврат Результат;
	
КонецФункции

// Читает из общих настроек признак включенного режима логирования.
//
// Возвращаемое значение:
//   Булево - Истина, если режим логирования включен.
//
&НаКлиенте
Функция РежимЛогированияВключен() Экспорт
	
	Результат = Кэш_Прочитать("РежимЛогированияВключен");
	
	Если Результат = Неопределено Тогда
		
		Результат = ОбщиеНастройки_ПрочитатьВызовСервера("РежимЛогирования");
		
		Кэш_Поместить("РежимЛогированияВключен", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Читает из общего контекста признак файлового режима работы.
//
// Возвращаемое значение:
//   Булево - Истина, если база работает в файловом режиме работы.
//
&НаКлиенте
Функция ФайловыйРежимРаботы() Экспорт
	
	Результат = ОбщийКонтекст_Прочитать("ФайловыйРежимРаботы") = Истина;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив переданных параметров в порядке их расположения
// 
// Параметры:
//  Параметр0 - Произвольный - значение, которое будет добавлено в массив по индексу 0
//  Параметр1 - Произвольный - значение, которое будет добавлено в массив по индексу 1
//  Параметр2 - Произвольный - значение, которое будет добавлено в массив по индексу 2
//  Параметр3 - Произвольный - значение, которое будет добавлено в массив по индексу 3
//  Параметр4 - Произвольный - значение, которое будет добавлено в массив по индексу 4
//
// Возвращаемое значение:
//   Массив - массив переданных параметров.
//
&НаКлиенте
Функция ПараметрыВМассив(Параметр0 = NULL
	, Параметр1 = NULL
	, Параметр2 = NULL
	, Параметр3 = NULL
	, Параметр4 = NULL) Экспорт
	
	Результат = Новый Массив(5);
	
	Результат[0] = Параметр0;
	Результат[1] = Параметр1;
	Результат[2] = Параметр2;
	Результат[3] = Параметр3;
	Результат[4] = Параметр4;
	
	Для Сч = -Результат.ВГраница() По 0 Цикл
		
		Если Результат[-Сч] = NULL Тогда
			Результат.Удалить(-Сч);
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Версии типа "1.0.1b" сравнивать нельзя.
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
&НаКлиенте
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(СтрокаВерсии1) ИЛИ НЕ ПустаяСтрока(СтрокаВерсии2) Цикл
		
		Поз = Найти(СтрокаВерсии1, ".");
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(СтрокаВерсии1, Поз - 1));
			СтрокаВерсии1 = Сред(СтрокаВерсии1, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(СтрокаВерсии1), 0, Число(СтрокаВерсии1));
			СтрокаВерсии1 = "";
		КонецЕсли;
		
		Поз = Найти(СтрокаВерсии2, ".");
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(СтрокаВерсии2, Поз - 1));
			СтрокаВерсии2 = Сред(СтрокаВерсии2, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(СтрокаВерсии2), 0, Число(СтрокаВерсии2));
			СтрокаВерсии2 = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗначениеВМассив(Значение) Экспорт 
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		Результат.Добавить(Значение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Полное имя ключа с учетом вложенности структур,
//                                       имена свойств вложенных структур отделяются точкой.
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаКлиенте
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если Значение = Неопределено Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		
		Результат = Истина;
		
	ИначеЕсли ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает копию коллекции значений.
//
// Параметры:
//  Источник - Структура, Соответствие, Массив, СписокЗначений, ТаблицаЗначений - коллекция значений, которую необходимо скопировать.
//
// Возвращаемое значение:
//  Структура, Соответствие, Массив, СписокЗначений, ТаблицаЗначений - копия исходной коллекции значений.
//
&НаКлиенте
Функция КопияКоллекцииЗначений(Источник) Экспорт
	
	Результат = Неопределено;
	
	ТипИсточника = ТипЗнч(Источник);

	Если ТипИсточника = Тип("Структура") Тогда
		Результат = Общее_СкопироватьСтруктуру(Источник);
	ИначеЕсли ТипИсточника = Тип("Соответствие") Тогда
		Результат = Общее_СкопироватьСоответствие(Источник);
	ИначеЕсли ТипИсточника = Тип("Массив") Тогда
		Результат = Общее_СкопироватьМассив(Источник);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Результат = Общее_СкопироватьСписокЗначений(Источник);
	Иначе
		Результат = Источник;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает копию значения типа Структура.
//
// Параметры:
//  Источник - Структура - структура для копирования.
// 
// Возвращаемое значение:
//  Структура - копия исходной структуры.
//
&НаКлиенте
Функция Общее_СкопироватьСтруктуру(Источник)
	
	Результат = Новый Структура;
	
	Для Каждого КлючИЗначение Из Источник Цикл
		Результат.Вставить(КлючИЗначение.Ключ, КопияКоллекцииЗначений(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает копию значения типа Соответствие.
//
// Параметры:
//  Источник - Соответствие - соответствие для копирования.
// 
// Возвращаемое значение:
//  Соответствие - копия исходного соответствия.
//
&НаКлиенте
Функция Общее_СкопироватьСоответствие(Источник)
	
	Результат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из Источник Цикл
		Результат.Вставить(КлючИЗначение.Ключ, КопияКоллекцииЗначений(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Создает копию значения типа Массив.
//
// Параметры:
//  Источник - Массив - массив для копирования.
// 
// Возвращаемое значение:
//  Массив - копия исходного массива.
//
&НаКлиенте
Функция Общее_СкопироватьМассив(Источник)
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Источник Цикл
		Результат.Добавить(КопияКоллекцииЗначений(Элемент));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает копию значения типа СписокЗначений.
//
// Параметры:
//  Источник - СписокЗначений - список значений для копирования.
// 
// Возвращаемое значение:
//  СписокЗначений - копия исходного списка значений.
//
&НаКлиенте
Функция Общее_СкопироватьСписокЗначений(Источник)
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из Источник Цикл
		
		Результат.Добавить(КопияКоллекцииЗначений(ЭлементСписка.Значение), 
							ЭлементСписка.Представление, 
							ЭлементСписка.Пометка, 
							ЭлементСписка.Картинка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Фиксирует Данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// BSLLS:TooManyReturns-off
// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:IfElseIfEndsWithElse-off
// BSLLS:IfConditionComplexity-off
// BSLLS:DuplicateStringLiteral-off
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - коллекции, значения которых являются примитивными типами,
//           хранилищем значения или не могут быть изменены. Поддерживаются типы значений:
//           Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//           ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//           ЛюбаяСсылка.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
// 
&НаКлиентеНаСервереБезКонтекста
Функция ФиксированныеДанныеЛок(Данные)
	
	Если ТипЗнч(Данные) = Тип("Массив")
		Или ТипЗнч(Данные) = Тип("ФиксированныйМассив") Тогда
		Массив = Новый Массив;
		
		Для Каждого Значение Из Данные Цикл
			
			Если ТипЗнч(Значение) = Тип("Структура")
				Или ТипЗнч(Значение) = Тип("Соответствие")
				Или ТипЗнч(Значение) = Тип("Массив")
				Или ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
				
				Массив.Добавить(ФиксированныеДанныеЛок(Значение));
				
			Иначе
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		Или ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Коллекция = Новый Структура;
		Иначе
			Коллекция = Новый Соответствие;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из Данные Цикл
			Значение = КлючИЗначение.Значение;
			
			Если ТипЗнч(Значение) = Тип("Структура")
			 ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			 ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Коллекция.Вставить(
					КлючИЗначение.Ключ, ФиксированныеДанныеЛок(Значение));
			Иначе
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Возврат Новый ФиксированнаяСтруктура(Коллекция);
		Иначе
			Возврат Новый ФиксированноеСоответствие(Коллекция);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Данные;
	
	// BSLLS:TooManyReturns-on
	// BSLLS:CognitiveComplexity-on
	// BSLLS:CyclomaticComplexity-on
	// BSLLS:IfElseIfEndsWithElse-on
	// BSLLS:IfConditionComplexity-on
	// BSLLS:DuplicateStringLiteral-on
	
КонецФункции // ФиксированныеДанные

// Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
// 
// Возвращаемое значение:
//   Массив - массив со строками, которые получились в результате разделения исходной строки.
//
&НаКлиенте
Функция РазделитьСтрокуЛок(Знач Строка, Разделитель = ",", ВключатьПустые = Истина) Экспорт
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// 
// Параметры:
//  Строки - Произвольный - значение тип которого нужно определить.
//  Разделитель - ФиксированныйМассив; Массив - значение тип которого нужно определить.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
&НаКлиенте
Функция СоединитьСтроку(Строки, Разделитель = "") Экспорт
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон содержащий маркеры подстановки вида: "%1..%N"
//                        . Нумерация маркеров начинается с 1.
//                          N не может быть более 5.
//  Параметр<n>  - Строка - подставляемые параметры.
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
&НаКлиенте
Функция Общее_ПодставитьПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено) Экспорт
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции


// Преобразует дату по часовому поясу компьютера в универсальную
// и затем приводит её к строке в формате ISO8601
//
// Параметры
//  ДатаПоМестномуВремени - Дата - дата по часовому поясу компьютера
//
// Возвращаемое значение:
//   Строка - дата строкой
//
&НаКлиенте
Функция УниверсальнаяДатаВФормате_ISO8601(ДатаПоМестномуВремени)
	
	УниверсальнаяДата = УниверсальнаяДата(ДатаПоМестномуВремени);
	
	Результат = Формат(УниверсальнаяДата, "ДФ=yyyy-MM-ddTHH:mm:ss+00:00");
	
	Возврат Результат;
	
КонецФункции

// Преобразует дату по часовому поясу компьютера в универсальную (GMT+00:00).
// Для 8.1 преобразование не выполняется.
//
// Параметры
//  ДатаПоМестномуВремени - Дата - дата по часовому поясу компьютера, которую нужно преобразовать
//
// Возвращаемое значение:
//   Дата - универсальная дата
//
&НаКлиенте
Функция УниверсальнаяДата(ДатаПоМестномуВремени)
	
	Результат = УниверсальноеВремя(ДатаПоМестномуВремени);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Осуществляет поиск значения в указанных колонках таблицы значений,
//  представленной в виде массива структур.
//  Аналог метода ТаблицаЗначений.Найти(<Значение>, <Колонки>)
//
// Параметры:
//  МассивСтруктур - Массив       - Массив структур с одинаковым набором ключей.
//  Значение       - Произвольный - Искомое значение.
//  Ключ           - Строка       - Список ключей структуры, разделенных запятыми,
//                                  по которым производится поиск.
//                                  Либо полное имя ключа с учетом вложенности структур,
//                                  имена свойств вложенных структур отделяются точкой.
//                                  Если параметр не указан, поиск осуществляется по всем свойствам.
// 
// Возвращаемое значение:
//   Структура    - Первый элемент массива, содержащий искомое значение.
//   Неопределено - Если значение не найдено.
//
&НаКлиенте
Функция МассивСтруктур_Найти(МассивСтруктур, Значение, Ключ) Экспорт 
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(МассивСтруктур) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИскатьПоВсемКлючам			 = Ложь;
	ИскатьПоМассивуКлючей		 = Ложь;
	ИскатьВоВложенныхСтруктурах	 = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Ключ) Тогда
		
		ИскатьПоВсемКлючам = Истина;
		
	ИначеЕсли Найти(Ключ, ",") > 0 Тогда
		
		ИскатьПоМассивуКлючей = Истина;
		
	ИначеЕсли Найти(Ключ, ".") > 0 Тогда
		
		ИскатьВоВложенныхСтруктурах = Истина;
		
	КонецЕсли;
	
	Если ИскатьПоМассивуКлючей Тогда
		МассивКлючей = РазделитьСтрокуЛок(Ключ, ",");
	КонецЕсли;
	
	ЭлементНайден = Ложь;
	
	Для Каждого Элемент Из МассивСтруктур Цикл
		
		Если ИскатьПоМассивуКлючей Тогда
			
			Для каждого ТекущийКлюч Из МассивКлючей Цикл
				
				Если Элемент[ТекущийКлюч] = Значение Тогда
					Результат = Элемент;
					ЭлементНайден = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ИскатьПоВсемКлючам Тогда
			
			Для каждого КлючИЗначение Из Элемент Цикл
				
				Если КлючИЗначение.Значение = Значение Тогда
					Результат = Элемент;
					ЭлементНайден = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ИскатьВоВложенныхСтруктурах Тогда
			
			ТекущееЗначение = СвойствоСтруктуры(Элемент, Ключ);
			
			Если ТекущееЗначение = Значение Тогда
				Результат = Элемент;
				ЭлементНайден = Истина;
			КонецЕсли;
			
		Иначе
			
			Если Элемент[Ключ] = Значение Тогда
				Результат = Элемент;
				ЭлементНайден = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭлементНайден Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Осуществляет поиск строк таблицы значений, отвечающих заданным условиям поиска, представленной в виде массива структур.
// Аналог метода ТаблицаЗначений.НайтиСтроки(<ПараметрыОтбора>)
//
// Параметры:
//  МассивСтруктур   - Массив   - Все элементы массива: структуры с одинаковым набором ключей.
//  ПараметрыОтбора   - Структура - Задает условия поиска: ключ структуры определяет имя свойства структуры массива,
//                                 по которой будет осуществляться поиск, а значение структуры - искомое значение.
//
// Возвращаемое значение:
//  Массив - содержит струтуры из массива, соответствующих условиям поиска.
//
&НаКлиенте
Функция МассивСтруктур_НайтиСтроки(МассивСтруктур, ПараметрыОтбора) Экспорт
  
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(МассивСтруктур) Тогда
		
		Для Каждого Структура Из МассивСтруктур Цикл
			
			СтруктураСоответствуетОтбору = Истина;
			
			Для Каждого ЭлементОтбора Из ПараметрыОтбора Цикл
				
				Если Структура[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
					СтруктураСоответствуетОтбору = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтруктураСоответствуетОтбору Тогда
				Результат.Добавить(Структура);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
  
КонецФункции

// Проверяет что указанный адрес является адресом из временного хранилища
// нужен для совместимости с 8.1
//
// Параметры:
//  Адрес - Строка - адрес, который нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если адрес из временного хранилища
//
&НаКлиенте
Функция ЭтоАдресИзВременногоХранилища(Адрес)
	
	Результат = Ложь;
	
	Если ТипЗнч(Адрес) <> Тип("Строка") Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтрокаНачалаАдресаВХ = "e1cib\tempstorage";
	ДлинаНачалаАдресаВХ	 = СтрДлина(СтрокаНачалаАдресаВХ);
	
	Если Лев(Адрес, ДлинаНачалаАдресаВХ) = СтрокаНачалаАдресаВХ Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник      - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник      - Массив - массив, из которого нужно взять значения;
//  ТолькоНовыеЗначения - Булево - (необязательный) Истина, если в применик нужно добавить
//                                 только те значения, которых в нем еще нет;
//
&НаКлиенте
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоНовыеЗначения = Ложь) Экспорт
	
	Если ТолькоНовыеЗначения Тогда
		
		ЗначенияПриемника = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			ЗначенияПриемника.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			
			Если ЗначенияПриемника[Значение] = Неопределено Тогда
				
				МассивПриемник.Добавить(Значение);
				
				ЗначенияПриемника.Вставить(Значение, Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает массив и копирует в него значения, содержащиеся в колонке объекта, для
// которого доступен обход посредством оператора Для каждого … Из.
//
// Параметры:
//  КоллекцияСтрок           - ТаблицаЗначений
//                           - ДеревоЗначений
//                           - СписокЗначений
//                           - ТабличнаяЧасть
//                           - Соответствие
//                           - Структура - коллекция, колонку которой нужно выгрузить в массив.
//                                         А так же другие объекты, для которых доступен обход
//                                         посредством оператора Для каждого … Из … Цикл.
//  ИмяКолонки               - Строка - имя поля коллекции, значения которого нужно выгрузить.
//  ТолькоУникальныеЗначения - Булево - если Истина, то в массив будут включены
//                                      только различающиеся значения.
//
// Возвращаемое значение:
//  Массив - значения колонки.
//
&НаКлиенте
Функция ВыгрузитьКолонку(КоллекцияСтрок, ИмяКолонки, ТолькоУникальныеЗначения = Ложь) Экспорт

	МассивЗначений = Новый Массив;
	
	Если КоллекцияСтрок = Неопределено Тогда
		Возврат МассивЗначений;
	КонецЕсли; 
	
	УникальныеЗначения = Новый Соответствие;
	
	Для каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
		Значение = СтрокаКоллекции[ИмяКолонки];
		Если ТолькоУникальныеЗначения И УникальныеЗначения[Значение] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивЗначений.Добавить(Значение);
		УникальныеЗначения.Вставить(Значение, Истина);
	КонецЦикла; 
	
	Возврат МассивЗначений;
	
КонецФункции

&НаКлиенте
Функция ПорцииДанныхМассива(МассивДанных, РазмерПорции) Экспорт
	
	Результат = Новый Массив;
	
	ВсегоДанных		= МассивДанных.Количество();
	ПорцияДанных	= Новый Массив;
	Сч			 	= 0;
	
	Для Индекс = 0 По ВсегоДанных - 1 Цикл
		
		ПорцияДанных.Добавить(МассивДанных[Индекс]);
		
		Сч = Сч + 1;
		ЭтоПоследниеДанные			= (Сч = ВсегоДанных);
		ЭтоПоследниеДанныеПорции	= (Сч % РазмерПорции = 0);
		
		Если ЭтоПоследниеДанные ИЛИ ЭтоПоследниеДанныеПорции Тогда
			
			Результат.Добавить(ПорцияДанных);
			ПорцияДанных = Новый Массив;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Преобразует идентификатор в адрес ящика в Диадоке
// 
// Параметры:
//  ИД - Строка - идентификатор ящика.
// 
// Возвращаемое значение:
//   Строка - адрес ящика.
//
&НаКлиенте
Функция АдресЯщикаВИдентификатор(АдресЯщика) Экспорт
	
	АдресЯщикаБезПробелов = СокрЛП(АдресЯщика);
	ИД = СтрЗаменить(АдресЯщикаБезПробелов, "@diadoc.ru", "");
	ДлинаИД = СтрДлина(ИД);
	Результат = "";
	
	Если ДлинаИД = 32 Тогда // 00000000000000000000000000000000
		
		Результат = Сред(ИД, 1, 8)
			+ "-" + Сред(ИД, 9, 4)
			+ "-" + Сред(ИД, 13, 4)
			+ "-" + Сред(ИД, 17, 4)
			+ "-" + Сред(ИД, 21, 12);
		
	ИначеЕсли ДлинаИД = 36 Тогда // 00000000-0000-0000-0000-000000000000
		
		Результат = ИД;
		
	Иначе
		
		ТекстОшибки = Общее_ПодставитьПараметрыВСтроку(НСтр(
					"ru = 'Некорректный адрес ящика %1'"), АдресЯщика);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ФамилияИО(СтрокаФИО) Экспорт
	
	Фамилия		 = "";
	Имя			 = "";
	Отчество	 = "";
	
	ФИО = РазделитьСтрокуЛок(СтрокаФИО, " ");
	Если ФИО.Количество() > 0 Тогда
		Фамилия = ФИО[0];
	КонецЕсли;
	
	Если ФИО.Количество() > 1 Тогда
		Имя = Лев(ФИО[1], 1) + ".";
	КонецЕсли;
	
	Если ФИО.Количество() > 2 Тогда
		Отчество = Лев(ФИО[2], 1) + ".";
	КонецЕсли;
	
	Результат = СокрЛП(Общее_ПодставитьПараметрыВСтроку("%1 %2 %3", Фамилия, Имя, Отчество));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбщиеНастройки_ПрочитатьВызовСервера(ИмяНастройки)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ОбщиеНастройки_Прочитать(ИмяНастройки);
	
	Возврат Результат;
	
КонецФункции

// Объединяет части пути через разделитель
//
&НаКлиенте
Функция ОбъединитьПути(П1, П2, П3 = Неопределено, П4 = Неопределено) Экспорт
	
	Результат = П1;
	
	РазделительПути = РазделительПути();
	
	ЧастиПути = Новый Массив;
	ЧастиПути.Добавить(П2);
	ЧастиПути.Добавить(П3);
	ЧастиПути.Добавить(П4);
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> РазделительПути Тогда
			Результат = Результат + РазделительПути;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает разделитель пути, используемого в операционной системе
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция РазделительПути()
	
	СисИнфо = Новый СистемнаяИнформация;
	Если СравнитьВерсии(СисИнфо.ВерсияПриложения, "8.3.3") < 0 Тогда
		
		Результат = "\";
		Если Найти(СисИнфо.ТипПлатформы, "Linux") > 0 Тогда
			Результат = "/";
		КонецЕсли;
		
	Иначе
		Результат = Вычислить("ПолучитьРазделительПути()");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Количество пакетов в одной групповой операции
//
// Возвращаемое значение:
//   Число 
//
&НаКлиенте
Функция КоличествоПакетовВГрупповойОперации() Экспорт
	
	Результат = Кэш_Прочитать("КоличествоПакетовВГрупповойОперации");
	
	Если Результат = Неопределено Тогда
		
		Результат = КоличествоПакетовВГрупповойОперацииВызовСервера();
		
		Кэш_Поместить("КоличествоПакетовВГрупповойОперации", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КоличествоПакетовВГрупповойОперацииВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.КоличествоПакетовВГрупповойОперации();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДесериализоватьПараметрыГиперссылки(СсылкаНаИнтернетРесурс) Экспорт
	
	Результат = ДесериализоватьПараметрыГиперссылкиВызовСервера(СсылкаНаИнтернетРесурс);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДесериализоватьПараметрыГиперссылкиВызовСервера(СсылкаНаИнтернетРесурс)
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ДесериализоватьПараметрыГиперссылки(СсылкаНаИнтернетРесурс);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоСборкаДляПровайдераСервиса() Экспорт
	
	Результат = ЭтоСборкаДляПровайдераСервисаВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоСборкаДляПровайдераСервисаВызовСервера()
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ЭтоСборкаДляПровайдераСервиса();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоАктСверкиИзСервисаВзаиморасчеты(ДокументЭДО) Экспорт
	
	Результат = ЭтоАктСверкиИзСервисаВзаиморасчетыВызовСервера(ДокументЭДО);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоАктСверкиИзСервисаВзаиморасчетыВызовСервера(ДокументЭДО)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ЭтоАктСверкиИзСервисаВзаиморасчеты(ДокументЭДО);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыОповещенияИзСтрокиHTMLСообщения(СтрокаОповещения) Экспорт
	
	// BSLLS:DeprecatedFind-off
	ПозПрефикса = Найти(НРег(СтрокаОповещения), НРег("alert:"));
	ДлинаПрефикса = СтрДлина("alert:");
	
	Если ПозПрефикса = 0 Тогда
		ПозПрефикса = Найти(НРег(СтрокаОповещения), НРег("alertandclose:"));
		ДлинаПрефикса = СтрДлина("alertandclose:");
	КонецЕсли;
	// BSLLS:DeprecatedFind-on
	
	СтрокаОповещенияБезПрефикса = Сред(СтрокаОповещения, ПозПрефикса + ДлинаПрефикса);
	
	ЧастиСтроки = РазделитьСтрокуЛок(СтрокаОповещенияБезПрефикса, "?");
	
	ОбработчикОповещения = ЧастиСтроки[0];
	ЧастиСтроки.Удалить(0);
	
	Если ЗначениеЗаполнено(ЧастиСтроки) Тогда
		РезультатОповещения = СоединитьСтроку(ЧастиСтроки, "?");
	Иначе
		РезультатОповещения = Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ОбработчикОповещения", ОбработчикОповещения);
	Результат.Вставить("РезультатОповещения", РезультатОповещения);
	
	Возврат Результат;
	
КонецФункции

//}		ОБЩЕГО НАЗНАЧЕНИЯ


//**********************************************
//{		ОШИБКИ

// Процедура вызывает регистрацию ошибки в журнал и сообщение пользователю.
//
// Параметры:
//  ВидОперации			 - Строка - вид операции при которой возникла ошибка.
//  Ошибка - ИнформацияОбОшибке, Строка - структурированная информация об ошибке или текст ошибки
//  ТекстСообщения		 - Строка - текст сообщения пользователю.
//  ИдентификаторФормы	 - УникальныйИдентификатор	 - см. процедуру СообщитьПользователю
//  ПолеФормыСообщения	 - Строка					 - см. процедуру СообщитьПользователю
//
&НаКлиенте
Процедура Ошибка_Обработать(ВидОперации,
	Ошибка,
	ТекстСообщения	 = Неопределено,
	ИдентификаторФормы = Неопределено,
	ПолеФормыСообщения = Неопределено
	) Экспорт
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ПодробныйТекстОшибки = СокрЛП(Ошибка);
	КонецЕсли;
	
	Ошибка_ОбработатьВызовСервера(
		ВидОперации,
		ПодробныйТекстОшибки,
		ТекстСообщения,
		ИдентификаторФормы,
		ПолеФормыСообщения
	);
	
КонецПроцедуры

&НаСервере
Процедура Ошибка_ОбработатьВызовСервера(Знач ВидОперации,
	Знач ПодробныйТекстОшибки,
	Знач ТекстСообщения	 = Неопределено,
	Знач ИдентификаторФормы = Неопределено,
	Знач ПолеФормыСообщения = Неопределено)
	
	ПодробныйТекстОшибки = _ЗаменитьНедопустимыеСимволыXML(ПодробныйТекстОшибки, " ");
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Ошибка_Обработать(
		ВидОперации,
		ПодробныйТекстОшибки,
		Неопределено,
		ТекстСообщения,
		ИдентификаторФормы,
		ПолеФормыСообщения
	);
	
КонецПроцедуры

// Заменяет недопустимые символы в XML-строке на заданные символы.
//
// Параметры:
//   Текст - Строка - строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены - Строка - строка, на которую требуется выполнить замену недопустимого символа в XML-строке.
// 
// Возвращаемое значение:
//    Строка
//
&НаКлиентеНаСервереБезКонтекста
Функция _ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ")
	
#Если Не ВебКлиент Тогда
	ПозицияНачала = 1;
	Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	Пока Позиция > 0 Цикл
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		ПозицияНачала = Позиция + СтрДлина(СимволЗамены);
		Если ПозицияНачала > СтрДлина(Текст) Тогда
			Прервать;
		КонецЕсли;
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	КонецЦикла;
	
	Возврат Текст;
#Иначе
	// Коды символов от 0 до 2^16-1, которые метод НайтиНедопустимыеСимволыXML
	// считает недопустимыми: 0-8, 11-12, 14-31, 55296-57343.
	Итог = "";
	ДлинаСтроки = СтрДлина(Текст);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Текст, НомерСимвола, 1);
		КодСимвола = КодСимвола(Символ);
		
		Если КодСимвола < 9
		 Или КодСимвола > 10    И КодСимвола < 13
		 Или КодСимвола > 13    И КодСимвола < 32
		 Или КодСимвола > 55295 И КодСимвола < 57344 Тогда
			
			Символ = СимволЗамены;
		КонецЕсли;
		Итог = Итог + Символ;
	КонецЦикла;
	
	Возврат Итог;
#КонецЕсли
	
КонецФункции

// Формирует и выводит сообщение, которое может быть "привязано" к форме.
//
// Параметры:
//  ТекстСообщения     - Строка                  - текст выводимого сообщения.
//  ИдентификаторФормы - УникальныйИдентификатор - идентификатор формы, к которой должно быть "привязано" сообщение.
//                                                 Если не указан, сообщение привязывается к активному окну.
//  ПолеФормы          - Строка                  - путь к реквизиту формы, для которого нужно вывести сообщение.
//
// Варианты вызова:
//   СообщитьПользователю(НСтр("ru = 'Сообщение об ошибке.'")) - Сообщение будет "привязано" к активной форме.
//
//   СообщитьПользователю(НСтр("ru = 'Сообщение об ошибке.'"),
//   ОбщийКонтекстКлиентСервер.ИдентификаторФормы)       - Сообщение будет "привязано" к основной форме.
//
//   СообщитьПользователю(НСтр("ru = 'Сообщение об ошибке.'"),
//   ОбщийКонтекстКлиентСервер.ИдентификаторФормы,
//   "Объект.СписокДокументов[2]")                             - Сообщение выводится в списке документов основной формы
//                                                               рядом со строкой с индексом 2.
//
&НаКлиенте
Процедура Ошибка_СообщитьПользователю(ТекстСообщения, ИдентификаторФормы = Неопределено, ПолеФормы = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	
	Сообщение.Текст = ТекстСообщения;
	
	Если ЗначениеЗаполнено(ИдентификаторФормы) Тогда
		Сообщение.ИдентификаторНазначения = ИдентификаторФормы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеФормы) Тогда
		Сообщение.Поле = ПолеФормы;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОшибок_Очистить() Экспорт
	
	СписокОшибок_ОчиститьВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура СписокОшибок_ОчиститьВызовСервера() Экспорт
	
	ОбработкаОбъект = ОбработкаОбъект();
	ОбработкаОбъект.СписокОшибок_Очистить();
	
КонецПроцедуры

&НаКлиенте
Функция СписокОшибок_ЕстьОшибкаКонтроляДублированияОтправки() Экспорт
	
	Результат = СписокОшибок_ЕстьОшибкаКонтроляДублированияОтправкиВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СписокОшибок_ЕстьОшибкаКонтроляДублированияОтправкиВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.СписокОшибок_ЕстьОшибкаКонтроляДублированияОтправки();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СписокОшибок_Перечисление_ВидыДействийСпискаОшибок() Экспорт
	
	Результат = СписокОшибок_Перечисление_ВидыДействийСпискаОшибокВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СписокОшибок_Перечисление_ВидыДействийСпискаОшибокВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.СписокОшибок_Перечисление_ВидыДействийСпискаОшибок();
	
	Возврат Результат;
	
КонецФункции

//{		ОШИБКИ


//**********************************************
//{		ВНЕШНИЕ СЕРВИСЫ

&НаКлиенте
Функция ВнешниеСервисы_ПолучитьСписокЛокальныхСертификатов()
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.ПолучитьСписокЛокальныхСертификатов();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_ПолучитьСертификат(ОтпечатокСертификата)
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.ПолучитьСертификат(ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_Контракт_ОписаниеСертификата()
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.Контракт_ОписаниеСертификата();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контракт_ОписаниеСертификата()
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		
		Модуль = Модуль_ВнешниеСервисы(ЭтаФорма);
		
	Иначе
		
		Модуль = Модуль_МенеджерКриптографии(ЭтаФорма);
		
	КонецЕсли;
	
	Результат = Модуль.Контракт_ОписаниеСертификата();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_ОписаниеСертификата(ДанныеСертификата)
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.ОписаниеСертификата(ДанныеСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов)
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_РасшифроватьДанные(ЗашифрованныеДанные)
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.РасшифроватьДанные(ЗашифрованныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи)
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера)
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи)
	
	Модуль_ВнешниеСервисы = Модуль_ВнешниеСервисы(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВнешниеСервисы_ДиагностикаСоединения(URL, НастройкиПрокси) Экспорт
	
	Результат = ВнешниеСервисы_ДиагностикаСоединенияВызовСервера(URL, НастройкиПрокси);
	
	Возврат Результат;
	
КонецФункции

Функция ВнешниеСервисы_ДиагностикаСоединенияВызовСервера(URL, НастройкиПрокси)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ВнешниеСервисы_ДиагностикаСоединения(URL, НастройкиПрокси);
	
	Возврат Результат;
	
КонецФункции

//{		ВНЕШНИЕ СЕРВИСЫ

//**********************************************
//{		Менеджер криптографии

&НаКлиенте
Функция МенеджерКриптографии_ПолучитьСписокЛокальныхСертификатов()
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = МенеджерКриптографии.ПолучитьВсе();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МенеджерКриптографии_НачатьПолучениеЛокальныхСертификатов(ОписаниеОповещенияОЗавершении)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	МенеджерКриптографии.НачатьПолучениеВсех(ОписаниеОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Функция МенеджерКриптографии_ПолучитьСертификат(ОтпечатокСертификата)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = МенеджерКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МенеджерКриптографии_НачатьПолучениеСертификата(ОтпечатокСертификата, ОписаниеОповещенияОЗавершении)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	МенеджерКриптографии.НачатьПоискПоОтпечатку(ОтпечатокСертификата, ОписаниеОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Функция МенеджерКриптографии_ОписаниеСертификата(ДанныеСертификата)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = МенеджерКриптографии.ОписаниеСертификата(ДанныеСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МенеджерКриптографии_ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = МенеджерКриптографии.Зашифровать(ДвоичныеДанные, МассивСертификатов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МенеджерКриптографии_НачатьШифрованиеДанных(ДвоичныеДанные, МассивСертификатов, ОписаниеОповещенияОЗавершении)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	МенеджерКриптографии.НачатьШифрование(ДвоичныеДанные, МассивСертификатов, ОписаниеОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Функция МенеджерКриптографии_РасшифроватьДанные(ЗашифрованныеДанные)
	
	Модуль_ВнешниеСервисы = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = Модуль_ВнешниеСервисы.Расшифровать(ЗашифрованныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МенеджерКриптографии_НачатьРасшифроватьДанные(ЗашифрованныеДанные, ОписаниеОповещенияОЗавершении)
	
	Модуль_ВнешниеСервисы = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Модуль_ВнешниеСервисы.НачатьРасшифровку(ЗашифрованныеДанные, ОписаниеОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Функция МенеджерКриптографии_ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = МенеджерКриптографии.ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МенеджерКриптографии_НачатьПолучениеСертификатаИзПодписи(ДвоичныеДанныеПодписи, ОписаниеОповещения)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	МенеджерКриптографии.НачатьПолучениеСертификатаИзПодписи(ДвоичныеДанныеПодписи, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Функция МенеджерКриптографии_ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = МенеджерКриптографии.Подписать(ДвоичныеДанные, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МенеджерКриптографии_НачатьПодписьДанных(ДвоичныеДанные, ОтпечатокСертификата, ОписаниеОповещения)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	МенеджерКриптографии.НачатьПодпись(ДвоичныеДанные, ОтпечатокСертификата, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Функция МенеджерКриптографии_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	Результат = МенеджерКриптографии.ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МенеджерКриптографии_НачатьПроверкуПодписи(ДвоичныеДанные, ДвоичныеДанныеПодписи, ОписаниеОповещения)
	
	МенеджерКриптографии = Модуль_МенеджерКриптографии(ЭтаФорма);
	
	МенеджерКриптографии.НачатьПроверкуПодписи(ДвоичныеДанные, ДвоичныеДанныеПодписи, ОписаниеОповещения);
	
КонецПроцедуры

// {		Менеджер криптографии

// **********************************************
// {		Онлайн счета

&НаКлиенте
Процедура ОнлайнСчета_ОткрытьФорму(ФормаВладелец) Экспорт
	
	Модуль_ОнлайнСчета = Модуль_ОнлайнСчета(ЭтаФорма);
	Модуль_ОнлайнСчета.ОткрытьФормуСчетовНаОплату(ФормаВладелец);
	
КонецПроцедуры

&НаКлиенте
Функция ОнлайнСчета_ПолучитьСписокСчетов(ФормаВладелец)
	
	Модуль_ОнлайнСчета 		= Модуль_ОнлайнСчета(ЭтаФорма);
	ФормаМодуляОнлайнСчета 	= Модуль_ОнлайнСчета.ПолучитьФормуСчетовНаОплату(ФормаВладелец);
	
	ФормаМодуляОнлайнСчета.ЗаполнитьОнлайнСчетаПоОрганизациям();
	
	СчетаНаОплатуСервиса 	= ФормаМодуляОнлайнСчета.СчетаНаОплатуСервиса;
	ФормаМодуляОнлайнСчета 	= Неопределено;
	
	Возврат СчетаНаОплатуСервиса;
	
КонецФункции

&НаКлиенте
Функция ОнлайнСчета_НаличиеСчетов() Экспорт
	
	Результат = ОнлайнСчета_НаличиеСчетовВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОнлайнСчета_НаличиеСчетовВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ОнлайнСчета_НаличиеСчетов();
	
	Возврат Результат;
	
КонецФункции

//{		Онлайн счета


//**********************************************
//{		КОНТУР.ПЛАГИНЫ

&НаКлиенте
Процедура КонтурПлагины_ОткрытьФорму(ФормаВладелец) Экспорт
	
	Контекст = КонтурПлагины_КонтекстВызова();
	
	Владелец = ОсновнаяФорма();
	
	МодульКП = Модуль_КонтурПлагины(ЭтаФорма);
	МодульКП.ОткрытьОсновнуюФорму(Контекст, Владелец);
	
КонецПроцедуры

&НаКлиенте
Функция КонтурПлагины_КонтекстВызова()
	
	Результат = Новый Структура;
	Результат.Вставить("ВызывающийМодуль", Модуль_ВызовыПМ(ЭтаФорма));
	Результат.Вставить("РежимОтладки", РежимОтладкиВключен());
	Результат.Вставить("КаталогОтладки", КонтурПлагины_КаталогОтладки());
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция КонтурПлагины_КаталогОтладки()
	
	Результат = ОбъединитьПути(
		КаталогОбработки(),
		"nosync",
		"plugins"
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды) Экспорт
	
	КонтурПлагины_ОбработатьСлужебнуюКомандуВызовСервера(ИмяКоманды, ПараметрыКоманды);
	
КонецПроцедуры

&НаСервере
Процедура КонтурПлагины_ОбработатьСлужебнуюКомандуВызовСервера(ИмяКоманды, ПараметрыКоманды)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.КонтурПлагины_ОбработатьСлужебнуюКоманду(
		ИмяКоманды,
		ПараметрыКоманды
	);
	
КонецПроцедуры

&НаКлиенте
Функция КонтурПлагины_ИмяПроекта()
	
	Возврат "Diadoc";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторБиблиотекиКонтурПлагины()
	Возврат "КонтурДиадокПлагины";
КонецФункции

&НаКлиенте
Функция Модуль_КонтурПлагины(ВызывающийМодуль)
	
	ИмяМодуля = ИдентификаторБиблиотекиКонтурПлагины();
	Результат = СоздатьМодуль(ИмяМодуля, "МодульКлиента");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИспользоватьПлагины()
	
	Результат = ОбщийКонтекст_Прочитать("ИспользоватьПлагины");
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИспользоватьПМ()
	
	ИспользоватьПМ = ОбщиеНастройки_ПрочитатьВызовСервера("ИспользоватьПодключаемыйМодуль") = Истина;
	НетОшибкиПодключенияПМ = НЕ (ОбщийКонтекст_Прочитать("ОбнаруженаОшибкаПодключенияПМ") = Истина);
	
	Результат = ИспользоватьПМ И НетОшибкиПодключенияПМ;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурПлагины_СчетВПакете_ТребуетсяВыполнитьПереходСПлагина() Экспорт
	
	Результат = КонтурПлагины_СчетВПакете_ТребуетсяВыполнитьПереходСПлагинаВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтурПлагины_СчетВПакете_ТребуетсяВыполнитьПереходСПлагинаВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.КонтурПлагины_СчетВПакете_ТребуетсяВыполнитьПереходСПлагина();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурПлагины_СчетВПакете_ВыполнитьПереходСПлагина() Экспорт
	
	Результат = КонтурПлагины_СчетВПакете_ВыполнитьПереходСПлагинаВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтурПлагины_СчетВПакете_ВыполнитьПереходСПлагинаВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.КонтурПлагины_СчетВПакете_ВыполнитьПереходСПлагина();
	
	Возврат Результат;
	
КонецФункции

//}		КОНТУР.ПЛАГИНЫ


//**********************************************
//{		КРИПТОГРАФИЯ

&НаКлиенте
Процедура ПроверитьПодключениеКонтурПлагина() Экспорт
	
	Модуль_Плагин = Модуль_Плагин(ЭтаФорма);
	
	Модуль_Плагин.ПодключитьПлагин();
	
	Модуль_Плагин.ПроверитьПлагин();
	
КонецПроцедуры

&НаКлиенте
Функция Сертификаты_СписокСертификатов() Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		
		Результат = ВнешниеСервисы_ПолучитьСписокЛокальныхСертификатов();
		
	Иначе
		
		Результат = МенеджерКриптографии_ПолучитьСписокЛокальныхСертификатов();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Сертификаты_ДанныеСертификата(ОтпечатокСертификата) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		
		Результат = ВнешниеСервисы_ПолучитьСертификат(ОтпечатокСертификата);
		
	Иначе
		
		Результат = МенеджерКриптографии_ПолучитьСертификат(ОтпечатокСертификата);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Сертификаты_Контракт_ОписаниеСертификата() Экспорт
	
	Результат = Контракт_ОписаниеСертификата();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Сертификаты_ОписаниеСертификата(ДанныеСертификата) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		
		Результат = ВнешниеСервисы_ОписаниеСертификата(ДанныеСертификата);
		
	Иначе
		
		Результат = МенеджерКриптографии_ОписаниеСертификата(ДанныеСертификата);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Сертификаты_СертификатВBase64(ОтпечатокСертификата) Экспорт
	
	Попытка
		
		ПараметрыСобытия = Новый Структура;
		ПараметрыСобытия.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
		Результат = ПодключаемыйМодуль_ОбработатьСобытие("ПолучитьСертификатВBase64", ПараметрыСобытия);
		
		Если Результат = Неопределено Тогда
			СвойстваСертификата = Сертификаты_ДанныеСертификата(ОтпечатокСертификата);
			Результат = Base64Строка(СвойстваСертификата.ДвоичныеДанные);
		КонецЕсли;
		
	Исключение
		
		ВидОперации		= "Получение сертификата";
		ТекстОшибки		= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения	= Общее_ПодставитьПараметрыВСтроку(НСтр("ru = '""Не удалось получить сертификат с отпечатком ""%1""'"), 
													ОтпечатокСертификата);
		
		Ошибка_Обработать(ВидОперации, ТекстОшибки, ТекстСообщения);
		
		ВызватьИсключение;
		
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
			
		Результат = ВнешниеСервисы_ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов);
			
	Иначе
			
		Результат = МенеджерКриптографии_ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов);
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РасшифроватьДанные(ЗашифрованныеДанные) Экспорт
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ЗашифрованныеДвоичныеДанные", ЗашифрованныеДанные);
	Результат = ПодключаемыйМодуль_ОбработатьСобытие("РасшифроватьДанные", ПараметрыСобытия);
	
	Если Результат = Неопределено Тогда
		
		Если ИспользоватьВнешнююКриптографию() Тогда
			
			Результат = ВнешниеСервисы_РасшифроватьДанные(ЗашифрованныеДанные);
			
		Иначе
			
			Результат = МенеджерКриптографии_РасшифроватьДанные(ЗашифрованныеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера = Неопределено) Экспорт
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ДвоичныеДанные",			ДвоичныеДанные);
	ПараметрыСобытия.Вставить("ОтпечатокСертификата",	ОтпечатокСертификата);
	ПараметрыСобытия.Вставить("ПарольКонтейнера",		ПарольКонтейнера);
	
	Результат = ПодключаемыйМодуль_ОбработатьСобытие("ПодписатьДанные", ПараметрыСобытия);
	
	Если Результат = Неопределено Тогда 
		
		Если ИспользоватьВнешнююКриптографию() Тогда
			
			Результат = ВнешниеСервисы_ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
			
		Иначе
			
			Результат = МенеджерКриптографии_ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Госключ_ПроверитьЗаданиеОтправкиНаПодпись(ИДЗаданияПодписания, boxId) Экспорт
	
	Результат = Госключ_ПроверитьЗаданиеОтправкиНаПодписьВызовСервера(ИДЗаданияПодписания, boxId);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Госключ_ПроверитьЗаданиеОтправкиНаПодписьВызовСервера(ИДЗаданияПодписания, boxId)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Госключ_ПроверитьЗаданиеОтправкиНаПодпись(ИДЗаданияПодписания, boxId);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Пакеты_ДобавитьПодписиГосключФайловПакета(Пакет, РезультатПодписанияГосключ) Экспорт
	
	Пакеты_ДобавитьПодписиГосключФайловПакетаВызовСервера(Пакет, РезультатПодписанияГосключ);
	
КонецПроцедуры

&НаСервере
Процедура Пакеты_ДобавитьПодписиГосключФайловПакетаВызовСервера(Пакет, РезультатПодписанияГосключ)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.Пакеты_ДобавитьПодписиГосключФайловПакета(Пакет, РезультатПодписанияГосключ);
	
КонецПроцедуры

&НаКлиенте
Функция ПодписьДанных(BoxId, ДвоичныеДанные, Знач ОтпечатокСертификата = "") Экспорт 
	
	Если Не ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
		ОтпечатокСертификата = КонтекстСеанса_ПрочитатьВызовСервера(BoxId, "ОтпечатокСертификата");
	КонецЕсли;
	
	Если ОтпечатокСертификата = "" Тогда 
		ВызватьИсключение "Подписание доступно только при авторизации по сертификату";	
	КонецЕсли;
	
	Результат = ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи) Экспорт
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ДвоичныеДанные"		 , ДвоичныеДанные);
	ПараметрыСобытия.Вставить("ДвоичныеДанныеПодписи", ДвоичныеДанныеПодписи);
	
	ПодписьВерна = ПодключаемыйМодуль_ОбработатьСобытие("ПроверитьПодпись", ПараметрыСобытия);
	
	Если ПодписьВерна = Неопределено Тогда
		
		Попытка
			
			Если ИспользоватьВнешнююКриптографию() Тогда
				
				ОписаниеСертификата = ВнешниеСервисы_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
				
			Иначе
				
				ОписаниеСертификата = МенеджерКриптографии_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
				
			КонецЕсли;
			
			Результат			= ЗначениеЗаполнено(ОписаниеСертификата);
		Исключение
			
			ВидОперации		 = "Проверка подписи";
			ТекстСообщения	 = "Не удалось проверить подпись";
			ТекстОшибки		 = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Ошибка_Обработать(ВидОперации, ТекстОшибки, ТекстСообщения);
			
			Результат = Ложь;
			
		КонецПопытки;
		
	Иначе
		Результат = ПодписьВерна;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатИзПодписи(ЗашифрованныеДанные) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		
		Результат = ВнешниеСервисы_ПолучитьСертификатИзПодписи(ЗашифрованныеДанные);
		
	Иначе
		
		Результат = МенеджерКриптографии_ПолучитьСертификатИзПодписи(ЗашифрованныеДанные);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Сертификаты_ПредставлениеПодписанта(Сертификат, ВыводитьОрганизацию = Истина) Экспорт
	
	Результат = "";
	
	Если НЕ ЗначениеЗаполнено(Сертификат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ВыводитьОрганизацию 
		И ЗначениеЗаполнено(Сертификат.Организация) Тогда
		
		Результат = Результат + Сертификат.Организация + ", ";
		
	КонецЕсли;
	
	Результат = Результат + Сертификат.Наименование;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контракт_СлужебнаяИнформация_СвойстваФайла() Экспорт
	
	Результат = Контракт_СлужебнаяИнформация_СвойстваФайлаВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Контракт_СлужебнаяИнформация_СвойстваФайлаВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Контракт_СлужебнаяИнформация_СвойстваФайла();
	
	Возврат Результат;
	
КонецФункции

//{		КРИПТОГРАФИЯ


//**********************************************
//{		МЕТРИКИ

//#Область Регистрация_поведения

// Добавляет запись в DD_Behavior с категорией, действием, меткой и представлением.
//
// Параметры:
//  Категория - Строка - Path_Category
//  Действие - Строка - Path_Action
//  Метка - Строка - Path_Label
//  ДопПеременные - Структура, Соответствие - (Необязательный) значения дополнительных переменных
//  ПредставлениеМетрики - Строка - Path_View
//  TraceID    - Строка         - локальный идентификатор группы событий;
//             - Неопределено   - использовать общий идентификатор группы событий,
//                                см функцию TraceId();
&НаКлиенте
Процедура Метрика_ДобавитьПоведение(
	Категория,
	Действие,
	Метка = Неопределено,
	ДопПеременные = Неопределено,
	ПредставлениеМетрики = "",
	TraceId = "") Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	ПеременныеМетрики = Новый Соответствие;
	
	ДополнитьПеременныеМетрики_BaseId(ПеременныеМетрики);
	ДополнитьПеременныеМетрики_BoxId(ПеременныеМетрики);
	ДополнитьПеременныеМетрики_ПроизвольныеПараметры(ПеременныеМетрики, ДопПеременные);
	
	ДобавитьСисИнфо = Ложь;
	
	Метрика_ЗаписатьПоведение(
		Категория,
		Действие,
		ПредставлениеМетрики,
		Метка,
		ПеременныеМетрики,
		ДобавитьСисИнфо,
		TraceId
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_Согласования(НазваниеФормы, НазваниеКнопки
	, ЗаголовокФормы
	, ЗаголовокКнопки
	, СтатусСогласования
	, BoxId) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Категория	 = "Основные действия";
	Действие	 = "buttonClick";
	Место		 = НазваниеФормы;
	Событие		 = НазваниеКнопки;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("BoxId"				, АдресЯщикаВИдентификатор(BoxId));
	Переменные.Вставить("СтатусСогласования", СтатусСогласования);
	Переменные.Вставить("Элемент.Заголовок"	, ЗаголовокКнопки);
	Переменные.Вставить("Форма.Заголовок"	, ЗаголовокФормы);
	
	Метрика_ЗаписатьПоведение(Категория, Действие, Место, Событие, Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_ФормыОбновления(НазваниеКнопки, МодульТиповой, МестоХраненияМодуля) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Категория		= "Скачать обновление";
	Метка			= "Нажатие кнопки";
	Представление	= "Форма обновления";
	Действие		= НазваниеКнопки;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("Модуль типовой"		, МодульТиповой);
	Переменные.Вставить("Место хранения модуля"	, МестоХраненияМодуля);
	
	TraceId_Обновить(Представление);
	
	Метрика_ЗаписатьПоведение(Категория, Действие, Представление, Метка, Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, НазваниеКатегории, НазваниеКнопки, НазваниеМетки = "", ПредставлениеМетрики = "", TraceId = "") Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Категория		= НазваниеКатегории;
	Действие		= НазваниеКнопки;
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеМетрики) Тогда
		ПредставлениеМетрики = НазваниеФормы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НазваниеМетки) Тогда
		Метка		= НазваниеМетки;
	Иначе	
		Метка		= "Нажатие кнопки";
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(TraceId) Тогда
		TraceId = TraceId_Обновить(НазваниеФормы);
	КонецЕсли;
	
	Метрика_ЗаписатьПоведение(Категория, Действие, ПредставлениеМетрики, Метка, , , TraceId);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_МассовоеДействиеНажатиеКнопки(НазваниеФормы, 
	НазваниеКатегории, 
	НазваниеКнопки, 
	КоличествоДокументов, 
	НазваниеМетки = "", 
	ПредставлениеМетрики = "",
	TraceId = "") Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Категория		= НазваниеКатегории;
	Действие		= НазваниеКнопки;
	Если НЕ ЗначениеЗаполнено(ПредставлениеМетрики) Тогда
		ПредставлениеМетрики		= НазваниеФормы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НазваниеМетки) Тогда
		Метка		= НазваниеМетки;
	Иначе	
		Метка		= "Нажатие кнопки";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(TraceId) Тогда
		TraceId = TraceId_Обновить(НазваниеФормы);
	КонецЕсли;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("Количество документов",	КоличествоДокументов);
	
	Метрика_ЗаписатьПоведение(Категория, Действие, ПредставлениеМетрики, Метка, Переменные, , TraceId);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_ДействиеСФормой(НазваниеФормы, НазваниеКатегории, Открытие = Истина, НазваниеМетки = "", ПредставлениеМетрики = "", TraceId = "") Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Категория		= НазваниеКатегории;
	Если НЕ ЗначениеЗаполнено(ПредставлениеМетрики) Тогда
		ПредставлениеМетрики		= НазваниеФормы;
	КонецЕсли;
	
	ДействияМетрик	= Метрика_НазваниеДействий();
	Если Открытие Тогда
		Действие = ДействияМетрик.ОткрытиеФормы;
	Иначе
		Действие =  ДействияМетрик.ЗакрытиеФормы;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(TraceId) Тогда
		TraceId = TraceId_Обновить(НазваниеФормы);
	КонецЕсли;
	
	Метрика_ЗаписатьПоведение(Категория, Действие, ПредставлениеМетрики, НазваниеМетки, , , TraceId);
	
КонецПроцедуры

//#КонецОбласти

//#Область Регистрация_статистики

// Добавляет запись в DD_Statistics с категорией, действием, меткой и представлением.
//
// Параметры:
//  Категория - Строка - идентификатор категории ошибки
//  Действие - Строка - идентификатор действия
//  Метка - Строка - заголовок или название;
//  ДопПеременные - Структура, Соответствие - (Необязательный) значения дополнительных переменных
//  ПредставлениеМетрики - Строка - форма, интерфейс события;
//  TraceID    - Строка         - локальный идентификатор группы событий;
//             - Неопределено   - использовать общий идентификатор группы событий,
//                                см функцию TraceId();
&НаКлиенте
Процедура Метрика_ДобавитьСтатистику(
	Категория, 
	Действие, 
	Метка = Неопределено, 
	ДопПеременные = Неопределено, 
	ПредставлениеМетрики = "", 
	TraceId = "") Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	ПеременныеМетрики = Новый Соответствие;
	
	ДополнитьПеременныеМетрики_BaseId(ПеременныеМетрики);
	ДополнитьПеременныеМетрики_BoxId(ПеременныеМетрики);
	ДополнитьПеременныеМетрики_ПроизвольныеПараметры(ПеременныеМетрики, ДопПеременные);
	
	ДобавитьСисИнфо = Истина;
	
	Метрика_ЗаписатьСтатистику(
		Категория, 
		Действие, 
		Метка, 
		ПеременныеМетрики, 
		ДобавитьСисИнфо, 
		TraceId, 
		ПредставлениеМетрики);
	
КонецПроцедуры


&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ПоКонтексту(Категория, Действие, Метка = Неопределено, ДопПеременные = Неопределено, ПредставлениеМетрики = "", TraceId = "") Экспорт
	
	Если НЕ ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторБазы1С = ОбщийКонтекст_ИдентификаторБазы1С();
	СтрокиКонтекста = КонтекстСеанса_СтрокиКонтекста();
	
	Для Каждого Элемент Из СтрокиКонтекста Цикл
		
		СтрокаКонтекста = Элемент.Значение;
		
		Переменные = Новый Соответствие;
		Переменные.Вставить("BoxID", АдресЯщикаВИдентификатор(СтрокаКонтекста.BoxId));
		Переменные.Вставить("UserID", СтрокаКонтекста.ОписаниеПользователя.Id);
		Переменные.Вставить("BaseID", ИдентификаторБазы1С);
		Переменные.Вставить("IsTest", СтрокаКонтекста.Ящик.Организация.Тестовая);
		
		Если ДопПеременные <> Неопределено Тогда
			Для Каждого Переменная Из ДопПеременные Цикл
				Переменные.Вставить(Переменная.Ключ, Переменная.Значение);
			КонецЦикла;
		КонецЕсли;
		
		Метрика_ЗаписатьСтатистику(Категория, Действие, Метка, Переменные, , TraceId, ПредставлениеМетрики);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(КатегорияМетрики, ДействиеМетрики, Метка = Неопределено, ДопПеременные = Неопределено, ПредставлениеМетрики = "", TraceId = "") Экспорт

	КонтекстСеансаЗаполнен = КонтекстСеанса_ЕстьСтроки();
	Если КонтекстСеансаЗаполнен Тогда
		Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, Метка, ДопПеременные, ПредставлениеМетрики, TraceId);
	Иначе
		Метрика_ДобавитьСтатистику_ДляОрганизации("", КатегорияМетрики, ДействиеМетрики, Метка, ДопПеременные, ПредставлениеМетрики, TraceId);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(
	Категория,
	Действие,
	ДокументыДляОбработки,
	ИсточникОткрытия = Неопределено) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторБазы1С = ОбщийКонтекст_ИдентификаторБазы1С();
	
	СоответствиеДокументов = Новый Соответствие;
	
	СоответствиеОрганизаций1С = Новый Соответствие;
	
	Для Каждого Документ Из ДокументыДляОбработки Цикл
		
		СлужебнаяИнформация = СвойствоСтруктуры(Документ, "СлужебнаяИнформация");
		КонтрактМЧД = СвойствоСтруктуры(СлужебнаяИнформация, "КонтрактМЧД");
		РегНомерМЧД = СвойствоСтруктуры(КонтрактМЧД, "Идентификатор", "");
		
		// может прийти как массив строк списка, так и массив документов
		Если Документ.Свойство("Идентификаторы") Тогда
			
			BoxId = Документ.Идентификаторы.BoxId;
			
		Иначе
			
			Организация1С = Документ.Организация;
			BoxId = СоответствиеОрганизаций1С[Организация1С];
			Если BoxId = Неопределено Тогда
				BoxId = Организации_ИдентификаторПоСсылке(Организация1С);
				СоответствиеОрганизаций1С.Вставить(Организация1С, BoxId);
			КонецЕсли;
			
		КонецЕсли;
		
		ЗначениеСоответствия = СоответствиеДокументов[BoxId];
		Если ЗначениеСоответствия = Неопределено Тогда
			ЗначениеСоответствия = Новый Структура();
			ЗначениеСоответствия.Вставить("КоличествоДокументов", 0);
			ЗначениеСоответствия.Вставить("РегНомерМЧД" , РегНомерМЧД);
			ЗначениеСоответствия.Вставить("Документ1С" , "");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЗначениеСоответствия.Документ1С) Тогда
			Документ1С = СвойствоСтруктуры(Документ, "ДокументУчета");
			Если Не ЗначениеЗаполнено(Документ1С) Тогда
				Документ1С = СвойствоСтруктуры(Документ, "Документ");
			КонецЕсли;
			ЗначениеСоответствия.Вставить("Документ1С" , Документ1С);
		КонецЕсли;
		
		КоличествоДокументов = ЗначениеСоответствия.КоличествоДокументов;
		ЗначениеСоответствия.КоличествоДокументов = КоличествоДокументов + 1;
		
		СоответствиеДокументов.Вставить(BoxId, ЗначениеСоответствия);
		
	КонецЦикла;
	
	Для Каждого Элемент Из СоответствиеДокументов Цикл
		
		ЗначениеСоответствия = Элемент.Значение;
		
		Переменные = Новый Соответствие;
		Переменные.Вставить("BoxID", АдресЯщикаВИдентификатор(Элемент.Ключ));
		Переменные.Вставить("Количество документов", ЗначениеСоответствия.КоличествоДокументов);
		Переменные.Вставить("Рег.номер МЧД", ЗначениеСоответствия.РегНомерМЧД);
		Переменные.Вставить("BaseID", ИдентификаторБазы1С);
		
		Если ЗначениеЗаполнено(ЗначениеСоответствия.Документ1С) Тогда
			Переменные.Вставить("doc1CId", СокрЛП(ЗначениеСоответствия.Документ1С.УникальныйИдентификатор()));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИсточникОткрытия) Тогда
			Переменные.Вставить("Источник", СокрЛП(ТипЗнч(ИсточникОткрытия)));
		КонецЕсли;
		
		Метрика_ЗаписатьСтатистику(Категория, Действие, , Переменные);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, Категория, Действие, НазваниеМетки = Неопределено, ДопПеременные = Неопределено, ПредставлениеМетрики = "", TraceId = "") Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Переменные = Новый Соответствие;
	
	Если ЗначениеЗаполнено(BoxId) Тогда
		Переменные.Вставить("BoxID", АдресЯщикаВИдентификатор(BoxId));
	КонецЕсли;
	
	ИдентификаторБазы1С = ОбщиеНастройки_ПрочитатьВызовСервера("ИдентификаторБазы1С");
	Переменные.Вставить("BaseID", ИдентификаторБазы1С);

	Если ДопПеременные <> Неопределено Тогда
		Для каждого Переменная Из ДопПеременные Цикл
			Переменные.Вставить(Переменная.Ключ, Переменная.Значение);
		КонецЦикла; 
	КонецЕсли;
	
	Метрика_ЗаписатьСтатистику(Категория, Действие, НазваниеМетки, Переменные, , TraceId, ПредставлениеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_УспешноеАвтообновлениеМодуля(ДанныеДляОбновленияМодуля)
	
	Метрика_ДобавитьСтатистику_УспешноеАвтообновлениеМодуляВызовСервера(ДанныеДляОбновленияМодуля);
		
КонецПроцедуры

&НаСервере
Процедура Метрика_ДобавитьСтатистику_УспешноеАвтообновлениеМодуляВызовСервера(ДанныеДляОбновленияМодуля)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.Метрика_ДобавитьСтатистику_УспешноеАвтообновлениеМодуля(ДанныеДляОбновленияМодуля);	
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_СкачиваниеДокументов(
	ДействиеМетрики,
	ТекущийДокумент,
	ЗаписатьМетрикиСценария = Ложь,
	ДопПеременные = Неопределено) Экспорт
	
	Метрика_ДобавитьСтатистику_СкачиваниеДокументовВызовСервера(
		ДействиеМетрики,
		ТекущийДокумент,
		ЗаписатьМетрикиСценария,
		ДопПеременные
	);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ДобавитьСтатистику_СкачиваниеДокументовВызовСервера(
	ДействиеМетрики,
	ТекущийДокумент,
	ЗаписатьМетрикиСценария,
	ДопПеременные)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.Метрика_ДобавитьСтатистику_СкачиваниеДокументов(
		ДействиеМетрики,
		ТекущийДокумент,
		ЗаписатьМетрикиСценария,
		ДопПеременные
	);
	
КонецПроцедуры

//#КонецОбласти

//#Область Регистрация_ошибок

&НаКлиенте
Процедура Метрика_ДобавитьОшибку_ПоКонтексту(Категория, Действие, ТекстОшибки, ДопПеременные = Неопределено, Метка = Неопределено) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиКонтекста = КонтекстСеанса_СтрокиКонтекста();
	
	Для Каждого Элемент Из СтрокиКонтекста Цикл
		
		СтрокаКонтекста = Элемент.Значение;
		
		Переменные = Новый Соответствие;
		Переменные.Вставить("BoxId",	АдресЯщикаВИдентификатор(СтрокаКонтекста.BoxId));
		Переменные.Вставить("Причина",	ТекстОшибки);
		
		ИдентификаторБазы1С = ОбщиеНастройки_ПрочитатьВызовСервера("ИдентификаторБазы1С");
		Переменные.Вставить("BaseID", ИдентификаторБазы1С);
		
		Если ДопПеременные <> Неопределено Тогда
			Для каждого Переменная Из ДопПеременные Цикл
				Переменные.Вставить(Переменная.Ключ, Переменная.Значение);
			КонецЦикла; 
		КонецЕсли;
		
		Метрика_ЗаписатьЛог(Категория, Действие, Метка, Переменные);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьОшибку_ДляОрганизации(BoxId, Категория, Действие, ТекстОшибки, ДопПеременные = Неопределено, Метка = Неопределено) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Переменные = Новый Соответствие;
	Если ЗначениеЗаполнено(BoxId) Тогда
		Переменные.Вставить("BoxID",	АдресЯщикаВИдентификатор(BoxId));
	КонецЕсли;
	
	Переменные.Вставить("Причина",	ТекстОшибки);
	
	ИдентификаторБазы1С = ОбщиеНастройки_ПрочитатьВызовСервера("ИдентификаторБазы1С");
	Переменные.Вставить("BaseID", ИдентификаторБазы1С);
	
	Если ДопПеременные <> Неопределено Тогда
		Для каждого Переменная Из ДопПеременные Цикл
			Переменные.Вставить(Переменная.Ключ, Переменная.Значение);
		КонецЦикла; 
	КонецЕсли;	
	
	Метрика_ЗаписатьЛог(Категория, Действие, Метка, Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьОшибку_СУчетомЗаполненияКонтекста(КатегорияМетрики, ДействиеМетрики, ТекстОшибки = Неопределено, ДопПеременные = Неопределено) Экспорт

	КонтекстСеансаЗаполнен = КонтекстСеанса_ЕстьСтроки();
	Если КонтекстСеансаЗаполнен Тогда
		Метрика_ДобавитьОшибку_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, ТекстОшибки, ДопПеременные);
	Иначе
		Метрика_ДобавитьОшибку_ДляОрганизации("", КатегорияМетрики, ДействиеМетрики, ТекстОшибки, ДопПеременные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьОшибку_ОшибкаАвтообновленияМодуля(ДанныеДляОбновленияМодуля)
	
	Метрика_ДобавитьОшибку_ОшибкаАвтообновленияМодуляВызовСервера(ДанныеДляОбновленияМодуля);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ДобавитьОшибку_ОшибкаАвтообновленияМодуляВызовСервера(ДанныеДляОбновленияМодуля)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.Метрика_ДобавитьОшибку_ОшибкаАвтообновленияМодуля(ДанныеДляОбновленияМодуля);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьОшибку_ОпределениеЗначенияПеременнойОкружения(ИмяПеременной, ОписаниеОшибки)
	
	Метрика_ДобавитьОшибку_ОпределениеЗначенияПеременнойОкруженияВызовСервера(ИмяПеременной, ОписаниеОшибки);						
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ДобавитьОшибку_ОпределениеЗначенияПеременнойОкруженияВызовСервера(ИмяПеременной, ОписаниеОшибки)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.Метрика_ДобавитьОшибку_ОпределениеЗначенияПеременнойОкружения(ИмяПеременной, ОписаниеОшибки);
	
КонецПроцедуры

//#КонецОбласти

//#Область Регистрация_замеров

// Замер для нескольких организаций. Создает одну запись замера для всех элементов контекста.
//
// Параметры:
//  КатегорияМетрики - Строка - Наименование категории замера.
//  ЭтоНачалоЗамера  - Булево - Признак начала или окончания замера.
//     * Истина - Начало замера.
//     * Ложь   - Окончание замера.
//  ДопПеременные    - Соответствие - Перечень дополнительных данных для включения в состав переменных замера.
//
&НаКлиенте
Процедура Метрика_ДобавитьЗамер_ПоКонтекстуОднойЗаписью(КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные = Неопределено)

	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыДействий = Метрика_НазваниеДействий();
	
	Если ЭтоНачалоЗамера Тогда
		Действие = ВариантыДействий.Start;
	Иначе
		Действие = ВариантыДействий.Finish;
	КонецЕсли;
	
	СтрокиКонтекста = КонтекстСеанса_СтрокиКонтекста();
	
	КоллекцияBoxId = Новый Массив;
	
	Для Каждого Элемент Из СтрокиКонтекста Цикл
		
		СтрокаКонтекста = Элемент.Значение;
		
		ИдентификаторЯщика = АдресЯщикаВИдентификатор(СтрокаКонтекста.BoxId);
		
		КоллекцияBoxId.Добавить(ИдентификаторЯщика);
		
	КонецЦикла;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("BoxID", КоллекцияBoxId);
	
	Если ДопПеременные <> Неопределено Тогда
		Для каждого Переменная Из ДопПеременные Цикл
			Переменные.Вставить(Переменная.Ключ, Переменная.Значение);			
		КонецЦикла; 
	КонецЕсли;
	
	Метрика_ЗаписатьЗамер(КатегорияМетрики, Действие, , , Переменные);

КонецПроцедуры

// Замер для нескольких организаций. Создает по одной записи замера для каждого элемента контекста.
// 
// Параметры:
//  КатегорияМетрики - Строка - Наименование категории замера.
//  ЭтоНачалоЗамера  - Булево - Признак начала или окончания замера.
//     * Истина - Начало замера.
//     * Ложь   - Окончание замера.
//  ДопПеременные    - Соответствие - Перечень дополнительных данных для включения в состав переменных замера.
// 
&НаКлиенте
Процедура Метрика_ДобавитьЗамер_ПоКонтексту(КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные = Неопределено)

	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыДействий = Метрика_НазваниеДействий();
	
	Если ЭтоНачалоЗамера Тогда
		Действие = ВариантыДействий.Start;
	Иначе
		Действие = ВариантыДействий.Finish;
	КонецЕсли;
	
	СтрокиКонтекста = КонтекстСеанса_СтрокиКонтекста();
	
	Для Каждого Элемент Из СтрокиКонтекста Цикл
		
		СтрокаКонтекста = Элемент.Значение;
	
		Переменные = Новый Соответствие;
		Переменные.Вставить("BoxID", АдресЯщикаВИдентификатор(СтрокаКонтекста.BoxId));
		
		Если ДопПеременные <> Неопределено Тогда
			Для каждого Переменная Из ДопПеременные Цикл
				Переменные.Вставить(Переменная.Ключ, Переменная.Значение);			
			КонецЦикла; 
		КонецЕсли;
		
		Метрика_ЗаписатьЗамер(КатегорияМетрики, Действие, , , Переменные);
		
	КонецЦикла;

КонецПроцедуры

// Замер для одной организации. Создает запись замера при пустом контексте.
// 
// Параметры:
//  КатегорияМетрики - Строка - Наименование категории замера.
//  ЭтоНачалоЗамера  - Булево - Признак начала или окончания замера.
//     * Истина - Начало замера.
//     * Ложь   - Окончание замера.
//  ДопПеременные    - Соответствие - Перечень дополнительных данных для включения в состав переменных замера.
// 
&НаКлиенте
Процедура Метрика_ДобавитьЗамер_ДляОрганизации(BoxId, КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные = Неопределено)

	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыДействий = Метрика_НазваниеДействий();
	
	Если ЭтоНачалоЗамера Тогда
		Действие = ВариантыДействий.Start;
	Иначе
		Действие = ВариантыДействий.Finish;
	КонецЕсли;
	
	Переменные = Новый Соответствие;
	
	Если ЗначениеЗаполнено(BoxId) Тогда
		Переменные.Вставить("BoxID",	АдресЯщикаВИдентификатор(BoxId));
	КонецЕсли;
	
	Если ДопПеременные <> Неопределено Тогда
		Для каждого Переменная Из ДопПеременные Цикл
			Переменные.Вставить(Переменная.Ключ, Переменная.Значение);			
		КонецЦикла; 
	КонецЕсли;
	
	Метрика_ЗаписатьЗамер(КатегорияМетрики, Действие, , , Переменные);

КонецПроцедуры

// Вызывает процедуру записи замера в зависимомсти от наполнения контекста.
//
// Параметры:
//  КатегорияМетрики  - Строка - Наименование категории замера.
//  ЭтоНачалоЗамера   - Булево - Признак начала или окончания замера.
//     * Истина - Начало замера.
//     * Ложь   - Окончание замера.
//  ДопПеременные     - Соответствие - Перечень дополнительных данных для включения в состав переменных замера.
//  ЗамерОднойЗаписью - Булево - Определяет способ записи замера по контексту.
//     * Истина - Одна запись замера для всего контекста;
//     * Ложь   - Запись замера для каждого элемента контекста.
//
&НаКлиенте
Процедура Метрика_ДобавитьЗамер_СУчетомЗаполненияКонтекста(КатегорияМетрики, ЭтоНачалоЗамера = Истина, ДопПеременные = Неопределено, ЗамерОднойЗаписью = Истина) Экспорт

	КонтекстСеансаЗаполнен = КонтекстСеанса_ЕстьСтроки();
	
	Если КонтекстСеансаЗаполнен Тогда
		
		Если ЗамерОднойЗаписью Тогда
			Метрика_ДобавитьЗамер_ПоКонтекстуОднойЗаписью(КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные);
		Иначе
			Метрика_ДобавитьЗамер_ПоКонтексту(КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные);
		КонецЕсли;
		
	Иначе
		Метрика_ДобавитьЗамер_ДляОрганизации("", КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные);
	КонецЕсли;

КонецПроцедуры

// Вызывает процедуру записи начала замера в зависимомсти от наполнения контекста.
//
// Параметры:
//  КатегорияМетрики  - Строка - Наименование категории замера.
//  ДопПеременные     - Соответствие - Перечень дополнительных данных для включения в состав переменных замера.
//
&НаКлиенте
Процедура Метрика_НачатьЗамер_СУчетомЗаполненияКонтекстаПоКонтекстуОднойЗаписью(КатегорияМетрики, ДопПеременные = Неопределено) Экспорт
	
	ЭтоНачалоЗамера = Истина;
	КонтекстСеансаЗаполнен = КонтекстСеанса_ЕстьСтроки();
	
	Если КонтекстСеансаЗаполнен Тогда
		Метрика_ДобавитьЗамер_ПоКонтекстуОднойЗаписью(КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные);
	Иначе
		Метрика_ДобавитьЗамер_ДляОрганизации("", КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает процедуру записи окончания замера в зависимомсти от наполнения контекста.
//
// Параметры:
//  КатегорияМетрики  - Строка - Наименование категории замера.
//  ДопПеременные     - Соответствие - Перечень дополнительных данных для включения в состав переменных замера.
//
&НаКлиенте
Процедура Метрика_ЗавершитьЗамер_СУчетомЗаполненияКонтекстаПоКонтекстуОднойЗаписью(КатегорияМетрики, ДопПеременные = Неопределено) Экспорт
	
	ЭтоНачалоЗамера = Ложь;
	КонтекстСеансаЗаполнен = КонтекстСеанса_ЕстьСтроки();
	
	Если КонтекстСеансаЗаполнен Тогда
		Метрика_ДобавитьЗамер_ПоКонтекстуОднойЗаписью(КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные);
	Иначе
		Метрика_ДобавитьЗамер_ДляОрганизации("", КатегорияМетрики, ЭтоНачалоЗамера, ДопПеременные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьЗамер_СборДанныхДляОбновленияМодуля(МоментНачалаЗамера, КонтекстВыполнения) Экспорт
	
	Метрика_ДобавитьЗамер_СборДанныхДляОбновленияМодуляВызовСервера(МоментНачалаЗамера, КонтекстВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ДобавитьЗамер_СборДанныхДляОбновленияМодуляВызовСервера(МоментНачалаЗамера, КонтекстВыполнения)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.Метрика_ДобавитьЗамер_СборДанныхДляОбновленияМодуля(МоментНачалаЗамера, КонтекстВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьЗамер_ОбновлениеМодуля(МоментНачалаЗамера, РезультатОбновления, ДанныеДляОбновленияМодуля)
	
	Метрика_ДобавитьЗамер_ОбновлениеМодуляВызовСервера(МоментНачалаЗамера, РезультатОбновления, ДанныеДляОбновленияМодуля);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ДобавитьЗамер_ОбновлениеМодуляВызовСервера(МоментНачалаЗамера, РезультатОбновления, ДанныеДляОбновленияМодуля)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.Метрика_ДобавитьЗамер_ОбновлениеМодуля(МоментНачалаЗамера, РезультатОбновления, ДанныеДляОбновленияМодуля);
		
КонецПроцедуры

//#КонецОбласти

//#Область Замеры_длительных_операций

&НаКлиенте
Функция НачатьЗамерДлительнойОперации(КлючеваяОперация, Действие = "") Экспорт
	
	Результат = НачатьЗамерДлительнойОперацииНаСервере(КлючеваяОперация, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НачатьЗамерДлительнойОперацииНаСервере(КлючеваяОперация, Действие)
	
	Результат = ОбработкаОбъект().НачатьЗамерДлительнойОперации(КлючеваяОперация, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, ИмяШага, ДополнительныеПеременные = Неопределено) Экспорт
	
	ЗафиксироватьЗамерДлительнойОперацииНаСервере(ОписаниеЗамера, ИмяШага, ДополнительныеПеременные);
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьЗамерДлительнойОперацииНаСервере(ОписаниеЗамера, ИмяШага, ДополнительныеПеременные)
	
	ОбработкаОбъект().ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, ИмяШага, ДополнительныеПеременные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ИмяШага = "", ДополнительныеПеременные = Неопределено) Экспорт
	
	ЗакончитьЗамерДлительнойОперацииНаСервере(ОписаниеЗамера, ИмяШага, ДополнительныеПеременные);
	
КонецПроцедуры

&НаСервере
Процедура ЗакончитьЗамерДлительнойОперацииНаСервере(ОписаниеЗамера, ИмяШага, ДополнительныеПеременные)
	
	ОбработкаОбъект().ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ИмяШага, ДополнительныеПеременные);
	
КонецПроцедуры

//#КонецОбласти

//#Область Базовые_методы_регистрации

// Записывает событие метрики в топик "Behavior"
//
// Параметры:
//  Категория  - Строка - категория события;
//  Действие   - Строка - выполняемое действие;
//  Место      - Строка - место возникновения события;
//  Событие    - Строка - описание события;
//  Переменные - Структура, Соответствие - произвольная информация;
//  TraceID    - Строка         - локальный идентификатор группы событий;
//             - Неопределено   - использовать общий идентификатор группы событий,
//                                см. функцию TraceId();
//  ДобавитьСистемнуюИнформацию - Булево - Истина, если вместе с событием
//                                         нужно отправить описание окружения;
//
&НаКлиенте
Процедура Метрика_ЗаписатьПоведение(Категория, Действие
	, Представление = Неопределено
	, Метка = Неопределено
	, Переменные = Неопределено
	, ДобавитьСистемнуюИнформацию = Истина
	, TraceID = Неопределено) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Если TraceID = Неопределено Тогда
		TraceID = TraceId();
	КонецЕсли;
	
	СобытиеМетрики = НовоеСобытиеМетрики(Категория, Действие, Метка, Представление);
	
	ЗарегистрироватьСобытиеМетрики(ТопикиМетрики().Behavior, СобытиеМетрики, TraceID, Переменные, ДобавитьСистемнуюИнформацию);
	
КонецПроцедуры

// Записывает событие метрики в топик "Statistics"
//
// Параметры:
//  Категория  - Строка - категория события;
//  Действие   - Строка - выполняемое действие;
//  Событие    - Строка - описание события;
//  Переменные - Структура, Соответствие - произвольная информация;
//  TraceID    - Строка         - локальный идентификатор группы событий;
//             - Неопределено   - использовать общий идентификатор группы событий,
//                                см. функцию TraceId();
//  ДобавитьСистемнуюИнформацию - Булево - Истина, если вместе с событием
//                                         нужно отправить описание окружения;
//
&НаКлиенте
Процедура Метрика_ЗаписатьСтатистику(Категория, Действие
	, Метка	 = Неопределено
	, Переменные = Неопределено
	, ДобавитьСистемнуюИнформацию = Истина
	, TraceID	 = Неопределено
	, ПредставлениеМетрики = Неопределено) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Если TraceID = Неопределено ИЛИ TraceID = "" Тогда
		TraceID = TraceId();
	КонецЕсли;
	
	СобытиеМетрики = НовоеСобытиеМетрики(Категория, Действие, Метка, ПредставлениеМетрики);
	
	ЗарегистрироватьСобытиеМетрики(ТопикиМетрики().Statistics, СобытиеМетрики, TraceID, Переменные, ДобавитьСистемнуюИнформацию);
	
КонецПроцедуры

// Записывает событие метрики в топик "Log"
//
// Параметры:
//  Категория  - Строка - категория события;
//  Действие   - Строка - выполняемое действие;
//  Событие    - Строка - описание события;
//  Переменные - Структура, Соответствие - произвольная информация;
//  ДобавитьСистемнуюИнформацию - Булево - Истина, если вместе с событием
//                                         нужно отправить описание окружения;
//  TraceID    - Строка         - локальный идентификатор группы событий;
//             - Неопределено   - использовать общий идентификатор группы событий,
//                                см. функцию TraceId();
//
&НаКлиенте
Процедура Метрика_ЗаписатьЛог(Категория, Действие
	, Метка	 = Неопределено
	, Переменные = Неопределено
	, TraceID	 = Неопределено
	, ДобавитьСистемнуюИнформацию = Истина) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Если TraceID = Неопределено Тогда
		TraceID = TraceId();
	КонецЕсли;
	
	СобытиеМетрики = НовоеСобытиеМетрики(Категория, Действие, Метка);
	
	ЗарегистрироватьСобытиеМетрики(ТопикиМетрики().Log, СобытиеМетрики, TraceID, Переменные, ДобавитьСистемнуюИнформацию);
	
КонецПроцедуры

// Записывает событие метрики в топик "Health"
//
// Параметры:
//  Категория  - Строка - категория события;
//  Действие   - Строка - выполняемое действие;
//  Событие    - Строка - описание события;
//  Переменные - Структура, Соответствие - произвольная информация;
//  ДобавитьСистемнуюИнформацию - Булево - Истина, если вместе с событием
//                                         нужно отправить описание окружения;
//  TraceID    - Строка         - локальный идентификатор группы событий;
//             - Неопределено   - использовать общий идентификатор группы событий,
//                                см. функцию TraceId();
//
&НаКлиенте
Процедура Метрика_ЗаписатьЗамер(Категория, Действие
	, Представление = Неопределено
	, Метка = Неопределено
	, Переменные = Неопределено
	, ДобавитьСистемнуюИнформацию = Истина
	, TraceID = Неопределено) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Если TraceID = Неопределено Тогда
		TraceID = TraceId();
	КонецЕсли;
	
	ВариантыДействий = Метрика_НазваниеДействий();
	
	Если Действие = ВариантыДействий.Start Тогда
		ЗамерID = ЗаписатьЗамерID(Категория);
	ИначеЕсли Действие = ВариантыДействий.Finish Тогда
		ЗамерID = ПрочитатьЗамерID(Категория);
		
		ИдентификаторБазы1С = ОбщиеНастройки_ПрочитатьВызовСервера("ИдентификаторБазы1С");
		Переменные.Вставить("BaseID", ИдентификаторБазы1С);
	КонецЕсли;
	
	Переменные.Вставить("ЗамерID", ЗамерID);
	
	СобытиеМетрики = НовоеСобытиеМетрики(Категория, Действие, Метка, Представление);
	
	ЗарегистрироватьСобытиеМетрики(ТопикиМетрики().Health, СобытиеМетрики, TraceID, Переменные, ДобавитьСистемнуюИнформацию);
	
КонецПроцедуры

// Записывает событие метрики о начале замера в топик "Health"
//
// Параметры:
//  TraceID    - Строка - идентификатор замера
//  Категория  - Строка - категория события;
//  Место      - Строка - место замера;
//  Переменные - Соответствие, Структура - произвольные данные;
//  ДобавитьСистемнуюИнформацию - Булево    - Истина, если вместе с событием
//                                            нужно отправить описание окружения;
//
&НаКлиенте
Процедура Метрика_НачатьЗамер(TraceID, Категория
	, Место		 = Неопределено
	, Переменные = Неопределено
	, ДобавитьСистемнуюИнформацию = Истина) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Действие = "start";
	
	СобытиеМетрики = НовоеСобытиеМетрики(Категория, Действие, , Место);
	
	ЗарегистрироватьСобытиеМетрики(ТопикиМетрики().Health, СобытиеМетрики, TraceID, Переменные, ДобавитьСистемнуюИнформацию);
	
КонецПроцедуры

// Записывает событие метрики об окончании замера в топик "Health"
//
// Параметры:
//  TraceID    - Строка - идентификатор замера
//  Категория  - Строка - категория события;
//  Место      - Строка - место замера;
//  Переменные - Соответствие, Структура - произвольные данные;
//  ДобавитьСистемнуюИнформацию - Булево - Истина, если вместе с событием
//                                         нужно отправить описание окружения;
//
&НаКлиенте
Процедура Метрика_ЗакончитьЗамер(TraceID, Категория
	, Место		 = Неопределено
	, Переменные = Неопределено
	, ДобавитьСистемнуюИнформацию = Истина) Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Действие = "finish";
	
	СобытиеМетрики = НовоеСобытиеМетрики(Категория, Действие, , Место);
	
	ЗарегистрироватьСобытиеМетрики(ТопикиМетрики().Health, СобытиеМетрики, TraceID, Переменные, ДобавитьСистемнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеКатегории() Экспорт
	
	Результат = Кэш_Прочитать("Метрика_НазваниеКатегорииНаКлиенте");
	
	Если Результат = Неопределено Тогда
		
		Результат = Метрика_НазваниеКатегорииВызовСервера();
		
		Кэш_Поместить("Метрика_НазваниеКатегорииНаКлиенте", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Метрика_НазваниеКатегорииВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Метрика_НазваниеКатегории();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеДействий() Экспорт

	Результат = Кэш_Прочитать("Метрика_НазваниеДействийНаКлиенте");
	
	Если Результат = Неопределено Тогда
		
		Результат = Метрика_НазваниеДействийВызовСервера();
		
		Кэш_Поместить("Метрика_НазваниеДействийНаКлиенте", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Метрика_НазваниеДействийВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Метрика_НазваниеДействий();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеДействияМаршрутизации(Действие) Экспорт
	
	Результат = "";
	
	ДействияЭДО = Перечисление_ДействияЭДО();
	ВозможныеДействияМетрики = Метрика_НазваниеДействий();

	Если Действие = ДействияЭДО.ПередатьНаСогласование Тогда
		Результат = ВозможныеДействияМетрики.ПередатьНаСогласование;
	ИначеЕсли Действие = ДействияЭДО.ПередатьНаПодпись Тогда
		Результат = ВозможныеДействияМетрики.ПередатьНаПодпись;
	ИначеЕсли Действие = ДействияЭДО.ПередатьПоМаршруту Тогда
		Результат = ВозможныеДействияМетрики.ПередатьПоМаршруту;
	ИначеЕсли Действие = ДействияЭДО.Согласование Тогда
		Результат = ВозможныеДействияМетрики.Согласовать;	
	ИначеЕсли Действие = ДействияЭДО.ОтказВСогласовании Тогда
		Результат = ВозможныеДействияМетрики.ОтказатьВСогласовании;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает новый уникальный идентификатор замера и записывает его в общий для всех обработок кэш.
//
// Параметры:
//  КлючЗамера - Строка - Ключ в структуре идентификаторов замеров.
// 
// Возвращаемое значение:
//   Строка	- Уникальный идентификатор замера.
//
&НаКлиенте
Функция ЗаписатьЗамерID(КлючЗамера)
		
	ИдентификаторыЗамера = ОбщийКонтекст_Прочитать("ЗамерID");
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторыЗамера) Тогда
		ИдентификаторыЗамера = Новый Соответствие;
	КонецЕсли;
	
	ИдентификаторЗамера = Новый УникальныйИдентификатор();
	
	ИдентификаторыЗамера.Вставить(КлючЗамера, ИдентификаторЗамера);
	
	ОбщийКонтекст_Поместить("ЗамерID", ИдентификаторыЗамера);
	
	Возврат ИдентификаторЗамера;
	
КонецФункции

// Возвращает уникальный идентификатор замера и удаляет его из структуры идентификаторов.
// Если структура идентификаторов окажется пустой, то элемент кэша ЗамерID будет удален из кэша.
// 
// Параметры:
//  КлючЗамера - Строка - Ключ в структуре идентификаторов замеров.
// 
// Возвращаемое значение:
//   Строка	- Уникальный идентификатор замера из кэша.
//
&НаКлиенте
Функция ПрочитатьЗамерID(КлючЗамера, Очищать = Ложь)
		
	ИдентификаторыЗамера = ОбщийКонтекст_Прочитать("ЗамерID");
	
	Результат = ИдентификаторыЗамера.Получить(КлючЗамера);
	
	Если Очищать Тогда
		ИдентификаторыЗамера.Удалить(КлючЗамера);
		
		ОбщийКонтекст_Поместить("ЗамерID", ИдентификаторыЗамера);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Записывает событие метрики в топик "Feedback"
//
// Параметры:
//  Категория - Строка - Категория событий, к которой относится данное событие
//  Действие - Строка - Действие, породившее данное событие
//  ПроизвольныеПеременные - Структура, Соответствие - (Необязательный) дополнительные параметры, которые нужно добавить в метрику
//  TraceID - Строка - (Необязательные) идентификатор трассировки
//
&НаКлиенте
Процедура Метрика_ЗаписатьОбратнуюСвязь(Категория, Действие, ПроизвольныеПеременные = Неопределено, TraceID = Неопределено) Экспорт
	
	Метрика_ЗаписатьОбратнуюСвязьНаСервере(Категория, Действие, ПроизвольныеПеременные, TraceID);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ЗаписатьОбратнуюСвязьНаСервере(Категория, Действие, ПроизвольныеПеременные = Неопределено, TraceID = Неопределено) Экспорт
	
	Модуль_Ядро = ОбработкаОбъект();
	
	Модуль_Ядро.Метрика_ЗаписатьОбратнуюСвязь(Категория, Действие, ПроизвольныеПеременные, TraceID);
		
КонецПроцедуры

// Дополняет переменные метрики BaseID
//
// Параметры:
//  Переменные	 - Структура - переменные метрики Возможно Неопределено 
//
&НаКлиенте
Процедура ДополнитьПеременныеМетрики_BaseId(Переменные)
	
	BaseID = ОбщийКонтекст_ИдентификаторБазы1С();
	
	Если НЕ ЗначениеЗаполнено(Переменные) Тогда
		Переменные = Новый Соответствие;
	КонецЕсли;
	
	Переменные.Вставить("BaseID", BaseID);

КонецПроцедуры

// Дополняет переменные метрики BoxID
//
// Параметры:
//  Переменные	 - Структура - переменные метрики Возможно Неопределено
//
&НаКлиенте
Процедура ДополнитьПеременныеМетрики_BoxId(Переменные)
	
	СтрокиКонтекста = КонтекстСеанса_СтрокиКонтекста();
	
	КоллекцияBoxId = Новый Массив;
	
	Для Каждого Элемент Из СтрокиКонтекста Цикл
		
		СтрокаКонтекста = Элемент.Значение;
		ИдентификаторЯщика = АдресЯщикаВИдентификатор(СтрокаКонтекста.BoxId);
		КоллекцияBoxId.Добавить(ИдентификаторЯщика);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Переменные) Тогда
		
		Переменные.Вставить("BoxId", КоллекцияBoxId);
		
	Иначе
		
		Переменные = Новый Соответствие;
		Переменные.Вставить("BoxId", КоллекцияBoxId);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет произвольные параметры в переменные метрик.
// Значения параметров преобразуются в XML-представления.
//
// Параметры:
//  Переменные - Структура, Соответствие - коллекция переменных
//  ДопПараметры - Структура, Соответствие - добавляемые параметры
//
&НаКлиенте
Процедура ДополнитьПеременныеМетрики_ПроизвольныеПараметры(Переменные, ДопПараметры)
	
	Если НЕ ЗначениеЗаполнено(ДопПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ДопПараметры Цикл
		
		Ключ = КлючЗначение.Ключ;
		Значение = КлючЗначение.Значение;
		
		Если ТипЗнч(Значение) = Тип("Массив")
			ИЛИ ТипЗнч(Значение) = Тип("Структура") Тогда
			
			Результат = Значение;
			
		Иначе
			
			Результат = XMLСтрокаНаСервереБезКонтекста(Значение);
			
		КонецЕсли;
		
		Переменные.Вставить(Ключ, Результат);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция XMLСтрокаНаСервереБезКонтекста(Значение)
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

//#КонецОбласти

//#Область Конструкторы_объектов_метрики

&НаКлиенте
Функция НовоеСобытиеМетрики(Категория, Действие
	, Метка			 = Неопределено
	, Представление	 = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Category"	, Категория);
	Результат.Вставить("Action"		, Действие);
	
	Если ЗначениеЗаполнено(Метка) Тогда
		Результат.Вставить("Label", Метка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Представление) Тогда
		Результат.Вставить("View", Представление);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НоваяМетрика(СобытиеМетрики
	, TraceID			 = Неопределено
	, ОписаниеПеременных = Неопределено
	, ОписаниеПриложения = Неопределено)
	
	МоментВремени = НовыйМоментВремениМетрики();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Path", СобытиеМетрики);
	Результат.Вставить("Time", МоментВремени);
	
	Если ЗначениеЗаполнено(ОписаниеПриложения) Тогда
		Результат.Вставить("AppContext", ОписаниеПриложения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеПеременных) Тогда
		Результат.Вставить("Variables", ОписаниеПеременных);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(TraceID) Тогда
		Результат.Вставить("TraceID", Строка(TraceID));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйСтекСобытийМетрики()
	
	Топики = Новый Структура;
	
	Для Каждого Элемент Из ТопикиМетрики() Цикл
		Топики.Вставить(Элемент.Ключ, Новый Массив);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Топики", Топики);
	Результат.Вставить("РазмерСтека", 0);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйМоментВремениМетрики()
	
	ТекущаяДатаКомпьютера	 = ТекущаяДата();
	УниверсальнаяДатаСтрокой = УниверсальнаяДатаВФормате_ISO8601(ТекущаяДатаКомпьютера);
	
	Результат = Новый Структура;
	Результат.Вставить("ClientTime"			, УниверсальнаяДатаСтрокой);
	Результат.Вставить("SendFromClientTime"	, УниверсальнаяДатаСтрокой);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовоеОписаниеПриложения(ВерсияМодуля
	, ОписаниеОС						 = Неопределено
	, ОписаниеБраузера					 = Неопределено
	, ОписаниеПрограммы					 = Неопределено
	, ОписаниеАппаратноогоОбеспечения	 = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("AppVersion", ВерсияМодуля);
	
	Если ЗначениеЗаполнено(ОписаниеОС) Тогда
		Результат.Вставить("OS", ОписаниеОС);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеБраузера) Тогда
		Результат.Вставить("Browser", ОписаниеБраузера);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеПрограммы) Тогда
		Результат.Вставить("Platform", ОписаниеПрограммы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеАппаратноогоОбеспечения) Тогда
		Результат.Вставить("Hardware", ОписаниеАппаратноогоОбеспечения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти

//#Область Отправка_накопленных_событий_метрики

// Отправляет все накопленные события сервера в сервис Контур.Метрика
// и очищает стек событий.
//
&НаКлиенте
Процедура Метрики_Отправить() Экспорт
	
	Если Не ИспользоватьМетрики() Тогда
		Возврат;
	КонецЕсли;
	
	Метрики_Отправить_Принудительно();
	
КонецПроцедуры

// Отправляет все накопленные события сервера или толстого клиента
// в сервис Контур.Метрика, игнорируя значение настройки ЗапретитьРаботуСМетриками,
// и затем очищает стек.
//
&НаКлиенте
Процедура Метрики_Отправить_Принудительно()
	
	СтекСобытий = СтекСобытийМетрики();
	
	Если СтекСобытий.РазмерСтека = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НужноСформироватьОписаниеПеременных = СформироватьОписаниеПеременыхДляМетрикиПередОтправкой();
	
	УдалосьОтправить = Метрика_ОтправитьСтекСобытийВызовСервера(СтекСобытий, НужноСформироватьОписаниеПеременных);
	
	Если Не УдалосьОтправить Тогда
		ОтключитьМетрики();
	КонецЕсли;
	
	ОчиститьСтекСобытийМетрики();
	
КонецПроцедуры

&НаСервере
Функция Метрика_ОтправитьСтекСобытийВызовСервера(СтекСобытий, НужноСформироватьОписаниеПеременных)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Метрика_ОтправитьСтекСобытий(СтекСобытий, НужноСформироватьОписаниеПеременных);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти

//#Область Описание_окружения

&НаКлиенте
Функция ОписаниеПриложения()
	
	Результат = Кэш_Прочитать("ОписаниеПриложенияДляМетрикиНаКлиенте");
	
	Если Результат = Неопределено Тогда
		
		ВерсияМодуля		 = ОбщийКонтекст_Прочитать("ВерсияМодуля");
		ОписаниеОС			 = ОписаниеОС();
		ОписаниеБраузера	 = ОписаниеБраузера();
		ОписаниеПрограммы	 = ОписаниеПрограммы();
		ОписаниеАппаратноогоОбеспечения = ОписаниеАппаратноогоОбеспечения();
		
		Результат = НовоеОписаниеПриложения(ВерсияМодуля
		, ОписаниеОС
		, ОписаниеБраузера
		, ОписаниеПрограммы
		, ОписаниеАппаратноогоОбеспечения);
		
		Кэш_Поместить("ОписаниеПриложенияДляМетрикиНаКлиенте", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеОС()
	
	СтрокаТипПлатформы = НРег(ОписаниеСистемнойИнформации().ТипПлатформы);
	
	Если Найти(СтрокаТипПлатформы, "64") > 0 Тогда
		BitSet = "x64";
	Иначе
		BitSet = "x86";
	КонецЕсли;
	
	Если Найти(СтрокаТипПлатформы, НРег("Linux")) <> 0 Тогда
		Name = "Linux";
	ИначеЕсли Найти(СтрокаТипПлатформы, НРег("MacOS")) <> 0 Тогда
		Name = "MacOS";
	ИначеЕсли Найти(СтрокаТипПлатформы, НРег("Windows")) <> 0 Тогда
		Name = "Windows";
	КонецЕсли;
	
	Version = "0.0.0";
	
	Результат = Новый Структура;
	Результат.Вставить("BitSet"	, BitSet);
	Результат.Вставить("Name"	, Name);
	Результат.Вставить("Version", Version);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеПрограммы()
	
	ОписаниеКонфигурации = ОписаниеКонфигурации();
	
	Name = "1С:Предприятие 8";
	RunMode = ТекущийРежимЗапускаПриложения();
	Version = ВерсияВСемантикДляМетрики(ОписаниеСистемнойИнформации().ВерсияПриложения);
	
	Configuration = ОписаниеКонфигурации.Имя;
	ConfigurationVersion = ВерсияВСемантикДляМетрики(ОписаниеКонфигурации.Версия);
	ConfigurationVersion = СтрЗаменить(ConfigurationVersion, "/", "-");
	
	Результат = Новый Структура;
	Результат.Вставить("Name", Name);
	Результат.Вставить("RunMode", RunMode);
	Результат.Вставить("Version", Version);
	
	Результат.Вставить("Configuration", Configuration);
	Результат.Вставить("ConfigurationVersion", ConfigurationVersion);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеБраузера()
	
	Результат = Новый Структура;
	
	UserAgent = ОписаниеСистемнойИнформации().ИнформацияПрограммыПросмотра;
	
	Если ЗначениеЗаполнено(UserAgent) Тогда
		Результат.Вставить("UserAgent", UserAgent);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеАппаратноогоОбеспечения()
	
	TotalMemoryGb = Окр(ОписаниеСистемнойИнформации().ОперативнаяПамять / 1000);
	
	Результат = Новый Структура;
	Результат.Вставить("TotalMemoryGb", TotalMemoryGb);
	
	Возврат Результат; 
	
КонецФункции

//#КонецОбласти

//#Область Отключение_метрик

// Определяет возможность выполнения сбора метрик
// с учетом их принудительного отключения на клиенте.
// 
// Возвращаемое значение:
//   - Булево - Истина, если сбор метрик можно выполнять.
//
&НаКлиенте
Функция ИспользоватьМетрики()
	
	Результат = Ложь;
	
	Если Не МетрикиОтключены() Тогда
		Результат = ОбщийКонтекст_Прочитать("ИспользоватьМетрики") = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, не отключена ли принудительно возможность сбора метрик на клиенте.
//
// 
// Возвращаемое значение:
//   - Булево - Истина, если сбор метрик отключен.
//
&НаКлиенте
Процедура ОтключитьМетрики()
	
	Кэш_Поместить("ОтключитьМетрики", Истина);
	
КонецПроцедуры

// Отключает принудительно возможность сбора метрик на клиенте.
//
&НаКлиенте
Функция МетрикиОтключены()
	
	Результат = Кэш_Прочитать("ОтключитьМетрики") = Истина;
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти

//#Область Служебные_методы

// Добавляет событие в стек событий.
//
// Параметры:
//  Топик          - Строка    - топик, к которому относится событие.
//  СобытиеМетрики - Структура - см. функцию Метрика_НовыйСобытие()
//  TraceID        - Строка    - идентификатор трассировки
//  Переменные     - Структура - произвольная информация
//  ДобавитьСистемнуюИнформацию - Булево - Истина, если в метрику нужно
//                                         добавить описание окружения.
//
&НаКлиенте
Процедура ЗарегистрироватьСобытиеМетрики(Топик, СобытиеМетрики
	, TraceID	 = Неопределено
	, Переменные = Неопределено
	, ДобавитьСистемнуюИнформацию = Ложь)
	
	ОписаниеПеременных = Неопределено;
	ОписаниеПриложения = Неопределено;
	
	Если ДобавитьСистемнуюИнформацию Тогда
		ОписаниеПриложения = ОписаниеПриложения();
	КонецЕсли;

	ДополнитьПеременныеМетрики_BaseId(Переменные);
	
	Если СформироватьОписаниеПеременыхДляМетрикиПередОтправкой() Тогда
		ОписаниеПеременных = Переменные;
	Иначе
		ОписаниеПеременных = ОписаниеПеременыхДляМетрики(Переменные);
	КонецЕсли;
	
	Метрика = НоваяМетрика(СобытиеМетрики, TraceID, ОписаниеПеременных, ОписаниеПриложения);
	
	РазмерСтека = ПоместитьСобытиеМетрикиВСтекСобытий(Топик, Метрика);
	
	Если РазмерСтека >= 100 Тогда
		Метрики_Отправить();
	КонецЕсли;
	
КонецПроцедуры

// Помещает событие в стек для дальнейшей отправки
//
// Параметры:
//  Топик   - Строка       - топик, к которому относится метрика.
//  Метрика - Соответствие - метрика с событием.
//
// Возвращаемое значение:
//   Число - количество событий, помещенных в стек.
//
&НаКлиенте
Функция ПоместитьСобытиеМетрикиВСтекСобытий(Топик, Метрика)
	
	СтекСобытий		= СтекСобытийМетрики();
	МассивСобытий	= СтекСобытий.Топики[Топик];
	
	МассивСобытий.Добавить(Метрика);
	
	СтекСобытий.РазмерСтека = СтекСобытий.РазмерСтека + 1;
	
	Результат = СтекСобытий.РазмерСтека;
	
	Метрика_Логирование(Топик, Метрика);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_Логирование(Топик, Метрика)
	
	Метрика_КаталогЛогирования = Метрика_КаталогЛогирования();
	
	Если ЗначениеЗаполнено(Метрика_КаталогЛогирования) Тогда
	
		СоздатьКаталог(Метрика_КаталогЛогирования);
		ИмяФайлаЛога	 = Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=0") + "_" + Топик + "_" + Метрика.Path.Action + ".json";
		ПутьКФайлуЛога	 = Метрика_КаталогЛогирования + ИмяФайлаЛога;

		ТД = Новый ТекстовыйДокумент;
		ТД.УстановитьТекст(ПарсерJSON_Записать(Метрика));
		ТД.Записать(ПутьКФайлуЛога);
	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция Метрика_КаталогЛогирования()
	
	Результат = ОбщийКонтекст_Прочитать("Метрика_КаталогЛогирования");
	
	Возврат Результат;
	
КонецФункции

// Возвращает каталог, в котором расположен файл текущей обработки.
//
// Возвращаемое значение:
//   Строка - Каталог, в котором расположен файл текущей обработки.
//            Пустая строка, если обработка создана не из файла.
//
&НаКлиенте
Функция КаталогОбработки()

	Результат = КаталогОбработкиНаСервере();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КаталогОбработкиНаСервере()

	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.КаталогОбработки();
	
	Возврат Результат;
	
КонецФункции

// Возвращает из общего контекста
// глобальный идентификатор группировки событий метрики
//
&НаКлиенте
Функция TraceId() Экспорт
	
	Результат = ОбщийКонтекст_Прочитать("TraceId");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция TraceId_Обновить(Префикс)
	
	Результат = Неопределено;
	
	Если ИспользоватьМетрики() Тогда
		
		Результат = Префикс + "_" + Новый УникальныйИдентификатор;
		
		ОбщийКонтекст_Поместить("TraceId", Результат);
		
		TraceId_ОбновитьНаСервере(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура TraceId_ОбновитьНаСервере(TraceId)
	
	ОбработкаОбъект().Кэш_Поместить("TraceId", TraceId);
			
КонецПроцедуры

&НаКлиенте
Процедура TraceId_Сбросить()
	
	ОбщийКонтекст_Поместить("TraceId", Неопределено);
	
КонецПроцедуры

// Определяет необходимость формирования описания переменных в событиях метрики
// непосредственно перед отправкой на сервере, т.к. в веб клиенте
// не поддерживается запись в строку JSON.
//
// Возвращаемое значение:
//   Булево - Истина, если описание переменных нужно сформировать на сервере.
//
&НаКлиенте
Функция СформироватьОписаниеПеременыхДляМетрикиПередОтправкой()
	
	#Если ВебКлиент Тогда
		Результат = Истина;
	#Иначе
		Результат = Ложь;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

// Топики, которые поддерживает Контур.Метрика.
//
// Возвращаемое значение:
//   Структура
//
&НаКлиенте
Функция ТопикиМетрики()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Behavior"	, "Behavior");	// Поведение
	Результат.Вставить("Log"		, "Log");		// Журнал
	Результат.Вставить("Health"		, "Health");	// Здоровье
	Результат.Вставить("Feedback"	, "Feedback");	// ОбратнаяСвязь
	Результат.Вставить("Statistics"	, "Statistics");// Статистика
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВерсияВСемантикДляМетрики(Версия)
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(Версия) Тогда
		Результат = "0.0.0";
	Иначе
		
		МассивРазрядов = РазделитьСтрокуЛок(СокрЛП(Версия), "./");
		
		Для Сч = 1 По 3 - МассивРазрядов.Количество() Цикл
			МассивРазрядов.Добавить("0");
		КонецЦикла;
		
		ТекРазряд	 = "";
		Разделитель	 = "";
		
		Для Сч = 1 По МассивРазрядов.Количество() Цикл
			
			Разряд = СокрЛП(МассивРазрядов[Сч - 1]);
			
			Если Сч < 4 Тогда
				ТекРазряд = ?(ВСтрокеТолькоЦифры(Разряд), Разряд, "0");
			Иначе
				ТекРазряд = СтрЗаменить(Разряд, " ", "");
			КонецЕсли;
			
			Результат = Результат + Разделитель + ТекРазряд;
			
			Если Сч < 3 Тогда
				Разделитель = ".";
			ИначеЕсли Сч = 3 Тогда
				Разделитель = "-";
			Иначе
				Разделитель = "";
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтекСобытийМетрики()
	
	Результат = Кэш_Прочитать("СтекСобытийМетрикиНаКлиенте");
	
	Если Результат = Неопределено Тогда
		
		Результат = НовыйСтекСобытийМетрики();
		
		Кэш_Поместить("СтекСобытийМетрикиНаКлиенте", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьСтекСобытийМетрики()
	
	СтекСобытий = СтекСобытийМетрики();
	
	Для Каждого Элемент Из СтекСобытий.Топики Цикл
		
		Топик			 = Элемент.Ключ;
		МассивСобытий	 = СтекСобытий.Топики[Топик];
		
		МассивСобытий.Очистить();
		
	КонецЦикла;
	
	СтекСобытий.РазмерСтека = 0;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеПеременыхДляМетрики(Переменные)
	
	Результат = Новый Соответствие;
	
	Для Каждого Элемент Из Переменные Цикл
		
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			
			ОписаниеЗначения = ОписаниеЗначенияДляМетрики(Элемент.Значение);
			
			Результат.Вставить(Элемент.Ключ, ОписаниеЗначения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеЗначенияДляМетрики(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Результат = Новый Структура("value, type");
	
	Если ТипЗначения = Тип("Число") Тогда
		
		Результат.type = "number";
		Результат.value = Формат(Значение, "ЧГ=");
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		Результат.type = "string";
		Результат.value = Значение;
		
	ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		
		Результат.type = "uuid";
		Результат.value = Строка(Значение);
		
	ИначеЕсли ТипЗначения = Тип("ДвоичныеДанные") Тогда
		
		Результат.type = "base64";
		Результат.value = Base64Строка(Значение);
		
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		
		Результат.type = "string";
		Результат.value = Формат(Значение, "БЛ=False; БИ=True");
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Результат.type = "string";
		Результат.value = Формат(Значение, "ДФ='dd.MM.yyyy H:mm:ss'; ДП=");
		
	Иначе
		
		Попытка
			Результат.value = ПарсерJSON_Записать(Значение);
			Результат.type = "json";
		Исключение
			Результат.value = "convert_error";
			Результат.type = "string";
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти

//}		МЕТРИКИ


//**********************************************
//{		ОБНОВЛЕНИЕ МОДУЛЯ

&НаКлиенте
Функция ЭтоТиповойМодуль() Экспорт
	
	Результат = Истина;
	
	ЗаполнитьФлагЭтоТиповойМодуль(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьФлагЭтоТиповойМодуль(ЗначениеФлага)
	
	Ядро = ОбработкаОбъект();
	ЗначениеФлага = Ядро.ЭтоТиповойМодуль();
	
КонецПроцедуры

&НаСервере
// Возвращает результат проверки контрольной суммы файла модуля.
// 
// Возвращаемое значение:
//  Строка - результат проверки (см. Перечисление_РезультатПроверкиКонтрольнойСуммыФайлаМодуля)
//
Функция ОбновлениеМодуля_РезультатПроверкиКонтрольнойСуммыВызовСервера()
	
	Результат = ОбработкаОбъект().ОбновлениеМодуля_РезультатПроверкиКонтрольнойСуммы();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДвоичныеДанныеФайла(ПолноеИмяФайла) Экспорт
	
	Результат = Неопределено;
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если Файл.Существует()
		И Файл.ЭтоФайл() Тогда
		
		Результат = Новый ДвоичныеДанные(ПолноеИмяФайла);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ОБНОВЛЕНИЕ МОДУЛЯ

//**********************************************

//{		АВТООБНОВЛЕНИЕ МОДУЛЯ

// сбор данных (2 часть)

&НаКлиенте
Процедура ДополнитьДанныеДляОбновленияМодуля(ДанныеДляОбновленияМодуля) Экспорт
	
	ТестовыйЗапуск = ОбновлениеМодуля_ЭтоТестовыйЗапуск();
	
	ЗаполнитьОписанияОкруженияИОбновленияМодуля(ДанныеДляОбновленияМодуля, ТестовыйЗапуск);	
	
	Если Не ВозможноОбновитьМодульАвтоматически(ДанныеДляОбновленияМодуля) Тогда
		Возврат;
	КонецЕсли;
		
	ОписаниеРасположения = ДанныеДляОбновленияМодуля.ОписаниеРасположенияМодуля;
	МестоположенияМодуля = ДанныеДляОбновленияМодуля.Перечисления.МестоположенияМодуля;
	
	Если ОписаниеРасположения.Местоположение = МестоположенияМодуля.ФайлНаДиске Тогда
		ТекстОшибки = ПроверитьВозможностьОбновленияФайлаМодуля(ОписаниеРасположения.ПутьКФайлу);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ДанныеДляОбновленияМодуля.МожноОбновитьМодуль = Ложь;
			ДанныеДляОбновленияМодуля.КомментарийМодуля = ТекстОшибки;
			Возврат;		
		КонецЕсли;		
	КонецЕсли;	
	
	Если МодульДоработан(ДанныеДляОбновленияМодуля) Тогда
		ДанныеДляОбновленияМодуля.МожноОбновитьМодуль = Ложь;
		ДанныеДляОбновленияМодуля.КомментарийМодуля = "МодульДоработан";
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбновлениеМодуля_ЭтоТестовыйЗапуск()
	
	Результат = Ложь;
	
	Если РежимАвтотест() 
		Или ДоменПользователяКонтур() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет принадлежность пользователя к домену kontur
//
&НаКлиенте
Функция ДоменПользователяКонтур()
	
	ДоменПользователя = ЗначениеПеременнойОкружения("UserDomain");
	
	Результат = (НРег(ДоменПользователя) = НРег("Kontur"));
	
	Возврат Результат;		
	
КонецФункции

&НаКлиенте
Функция ЗначениеПеременнойОкружения(Имя)
	
	Результат = "";
	
	Попытка
		WSH = Новый COMobject("wscript.shell");
		Результат = WSH.ExpandEnvironmentStrings("%" + Имя + "%");
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
		Метрика_ДобавитьОшибку_ОпределениеЗначенияПеременнойОкружения(Имя, _ОписаниеОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОписанияОкруженияИОбновленияМодуля(ДанныеДляОбновленияМодуля, ТестовыйЗапуск)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.ЗаполнитьОписаниеОкруженияМодуля(ДанныеДляОбновленияМодуля, ТестовыйЗапуск);
	
	Ядро.ЗаполнитьОписаниеОбновленияМодуля(ДанныеДляОбновленияМодуля);
	
КонецПроцедуры

&НаКлиенте
Функция ВозможноОбновитьМодульАвтоматически(ДанныеДляОбновленияМодуля)
	
	Результат = Истина;
	
	Если ДанныеДляОбновленияМодуля.МодульЗапущенВпервые 
		 Или ДанныеДляОбновленияМодуля.МодульБылОбновлен
		 Или Не ДанныеДляОбновленияМодуля.МожноОбновитьМодуль
		 Или Не ДанныеДляОбновленияМодуля.ОписаниеОбновленияМодуля.ЕстьНоваяВерсия Тогда
		 
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие файла модуля и возможность записи в его каталог
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу модуля
// 
// Возвращаемое значение:
//  Строка - описание ошибки
//
&НаКлиенте
Функция ПроверитьВозможностьОбновленияФайлаМодуля(ПутьКФайлу)
	
	Результат = "";
	
	Файл = Новый Файл(ПутьКФайлу);
	Каталог	 = Файл.Путь;
	ИмяФайла = Файл.Имя;
	
	Если Не Файл.Существует() Тогда
		Результат = "КаталогФайлаМодуля.НеНайденФайл";
		Возврат Результат;
	КонецЕсли;
	
	Префикс = "Diadoc_WriteTest_";
	Расширение = ".txt";
	УникальнаяЧасть = Строка(Новый УникальныйИдентификатор);
	
	ИмяТестовогоФайла = Префикс + УникальнаяЧасть + Расширение;
	ПутьКТестовомуФайлу	 = ОбъединитьПути(Каталог, ИмяТестовогоФайла);
	
	Попытка
		Запись = Новый ЗаписьТекста(ПутьКТестовомуФайлу);
		Запись.Записать("Тест записи файла перед обновлением " + ИмяФайла);
		Запись.Закрыть();
	Исключение
		
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОшибкуАвтообновленияМодуляВЖурналеРегистрации(ОписаниеОшибки);
		
		Результат = "КаталогФайлаМодуля.ОшибкаПриЗаписи" + " " + ОписаниеОшибки();
		
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ПутьКТестовомуФайлу);
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Записывает в журнал регистрации описания ошибок, происходящих
// 	в процессе автообновления модуля
//
// Параметры:
//  ОписаниеОшибки - Строка - см. функцию ПодробноеПредставлениеОшибки();
//
&НаСервере
Процедура ЗарегистрироватьОшибкуАвтообновленияМодуляВЖурналеРегистрации(ОписаниеОшибки)
	
	ОбработкаОбъект().ЗарегистрироватьОшибкуАвтообновленияМодуляВЖурналеРегистрации(ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
Функция МодульДоработан(ДанныеДляОбновленияМодуля)
	
	Результат = Ложь;
	
	Если ЭтоТиповойМодуль() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Истина;
		
	РезультатПроверки = ОбновлениеМодуля_РезультатПроверкиКонтрольнойСуммыВызовСервера();
	ДанныеДляОбновленияМодуля.ОписаниеОшибки = "ПроверкаХешСуммыМодуля " + РезультатПроверки;
	
	Возврат Результат;
	
КонецФункции

// обновление

&НаКлиенте
Функция ОбновитьМодульАвтоматически(ДанныеДляОбновленияМодуля) Экспорт  
	
	Результат = "";
	
	МоментНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если Не ВозможноОбновитьМодульАвтоматически(ДанныеДляОбновленияМодуля) Тогда
		
		Если НужноЗарегистрироватьОшибкуАвтообновленияМодуля(ДанныеДляОбновленияМодуля) Тогда 
			
			Результат = "CriticalRejection";
			Метрика_ДобавитьЗамер_ОбновлениеМодуля(МоментНачалаЗамера, Результат, ДанныеДляОбновленияМодуля);
			
			Метрика_ДобавитьОшибку_ОшибкаАвтообновленияМодуля(ДанныеДляОбновленияМодуля);
			
		Иначе
			
			Результат = "NormalRejection";
			Метрика_ДобавитьЗамер_ОбновлениеМодуля(МоментНачалаЗамера, Результат, ДанныеДляОбновленияМодуля);		
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		
		ВыполнитьОбновлениеМодуля(ДанныеДляОбновленияМодуля);
		
		Результат = "Success";	
		Метрика_ДобавитьЗамер_ОбновлениеМодуля(МоментНачалаЗамера, Результат, ДанныеДляОбновленияМодуля);
		
		Метрика_ДобавитьСтатистику_УспешноеАвтообновлениеМодуля(ДанныеДляОбновленияМодуля);
		
	Исключение  
		
		Результат = "Error";
		Метрика_ДобавитьЗамер_ОбновлениеМодуля(МоментНачалаЗамера, Результат, ДанныеДляОбновленияМодуля);
		
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОшибкуАвтообновленияМодуляВЖурналеРегистрации(ОписаниеОшибки);
				
		ДанныеДляОбновленияМодуля.ОписаниеОшибки = "ОбновлениеМодуля" + " " + ОписаниеОшибки();
		Метрика_ДобавитьОшибку_ОшибкаАвтообновленияМодуля(ДанныеДляОбновленияМодуля);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НужноЗарегистрироватьОшибкуАвтообновленияМодуля(ДанныеДляОбновленияМодуля)
	
	Результат = Ложь;
	
	Если ДанныеДляОбновленияМодуля.МодульЗапущенВпервые 
		 Или ДанныеДляОбновленияМодуля.МодульБылОбновлен Тогда
		Возврат Результат; // не должно быть процесса обновления -> значит нет ошибок
	КонецЕсли;
	
	НетНовойВерсии = Не ДанныеДляОбновленияМодуля.ОписаниеОбновленияМодуля.ЕстьНоваяВерсия;
	Если НетНовойВерсии Тогда
		СервисВернулПричинуОтказа = ЗначениеЗаполнено(ДанныеДляОбновленияМодуля.КомментарийСервиса);
		ПроизошлаОшибкаПриСбореДанныхДляОбновления = ЗначениеЗаполнено(ДанныеДляОбновленияМодуля.ОписаниеОшибки);
		Если СервисВернулПричинуОтказа Или ПроизошлаОшибкаПриСбореДанныхДляОбновления Тогда
			Результат = Истина;
		КонецЕсли;
		Возврат Результат; // если НетНовойВерсии -> значит нет процесса обновления -> значит уже не важно, что НельзяОбновитьМодуль
	КонецЕсли;
	
	НельзяОбновитьМодуль = Не ДанныеДляОбновленияМодуля.МожноОбновитьМодуль;
	Если НельзяОбновитьМодуль Тогда
		МодульНашелПричинуОтказа = ЗначениеЗаполнено(ДанныеДляОбновленияМодуля.КомментарийМодуля);
		ПроизошлаОшибкаПриСбореДанныхДляОбновления = ЗначениеЗаполнено(ДанныеДляОбновленияМодуля.ОписаниеОшибки);
		Если МодульНашелПричинуОтказа Или ПроизошлаОшибкаПриСбореДанныхДляОбновления Тогда
			Результат = Истина;
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ВыполнитьОбновлениеМодуля(ДанныеДляОбновленияМодуля)
	
	МестоположенияМодуля = ДанныеДляОбновленияМодуля.Перечисления.МестоположенияМодуля;
	РасположениеМодуля   = ДанныеДляОбновленияМодуля.ОписаниеРасположенияМодуля;
	ОписаниеОбновления   = ДанныеДляОбновленияМодуля.ОписаниеОбновленияМодуля;
		
	ПутьКФайлу		 = РасположениеМодуля.ПутьКФайлу;
	СсылкаНаФайл 	 = ОписаниеОбновления.СсылкаНаФайл;
	Местоположение	 = РасположениеМодуля.Местоположение;
	ВнешняяОбработка = РасположениеМодуля.Ссылка;
	
	Если Местоположение = МестоположенияМодуля.ФайлНаДиске Тогда
		
		ВыполнитьОбновлениеМодуляВФайлеНаДиске(ПутьКФайлу, СсылкаНаФайл);
		
	ИначеЕсли Местоположение = МестоположенияМодуля.ЭлементСправочника Тогда
		
		ВыполнитьОбновлениеМодуляВСправочнике(ВнешняяОбработка, СсылкаНаФайл);
		
	ИначеЕсли Местоположение = МестоположенияМодуля.РасширениеКонфигурации Тогда
		
		ВыполнитьОбновлениеРасширенияКонфигурацииДиадок(СсылкаНаФайл);
		
	Иначе // этого сценария не должно быть
		
		ВызватьИсключение "НекорректноеРасположениеМодуля: " + Местоположение;
		
	КонецЕсли;
	
КонецПроцедуры

// Получает новую версию модуля из сервиса обновлений
// 	и записывает его файл на диске
//
// Параметры:
//  ПутьКФайлу		- Строка    - путь к файлу на диске, в который нужно записать новую версию модуля;
//  СсылкаНаФайл    - Строка 	- ссылка на файл в сервисе обновлений;
//
&НаКлиенте
Процедура ВыполнитьОбновлениеМодуляВФайлеНаДиске(ПутьКФайлу, СсылкаНаФайл)
	
	ФайлНовойВерсии = ФайлНовойВерсииМодуляВФайлеНаДискеВызовСервера(СсылкаНаФайл);
	
	ФайлНовойВерсии.Записать(ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Функция ФайлНовойВерсииМодуляВФайлеНаДискеВызовСервера(СсылкаНаФайл)
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ФайлНовойВерсииМодуля(СсылкаНаФайл);
	
	Ядро.ОбновлениеМодуля_ВыполнитьТестовоеПодключениеМодуля(Результат);
	
	Возврат Результат;
	
КонецФункции

// Получает новую версию модуля из сервиса обновлений
// 	и обновляет его в справочнике внешних обработок
//
// Параметры:
//  ВнешняяОбработка 	- СправочникСсылка - элемент в справочнике внешних обработок,
//                                        	 в который нужно записать файл модуля;
//  СсылкаНаФайл    	- Строка 		   - ссылка на файл в сервисе обновлений;
//
&НаСервере
Процедура ВыполнитьОбновлениеМодуляВСправочнике(ВнешняяОбработка, СсылкаНаФайл)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.ВыполнитьОбновлениеМодуляВСправочнике(ВнешняяОбработка, СсылкаНаФайл);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбновлениеРасширенияКонфигурацииДиадок(СсылкаНаФайл)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.ВыполнитьОбновлениеРасширенияКонфигурацииДиадок(СсылкаНаФайл);
	
КонецПроцедуры

//}		Тарификация



//**********************************************
//{		ПАРСЕР JSON

&НаКлиенте
Функция ПарсерJSON_Записать(Значение)
	
	Модуль_ПарсерJSON = Модуль_ПарсерJSON(ЭтаФорма);
	
	Результат = Модуль_ПарсерJSON.Записать(Значение);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПарсерJSON_Прочитать(СтрокаJSON)
	
	Модуль_ПарсерJSON = Модуль_ПарсерJSON(ЭтаФорма);
	
	Результат = Модуль_ПарсерJSON.Прочитать(СтрокаJSON);
	
	Возврат Результат;
	
КонецФункции

//}		ПАРСЕР JSON


//**********************************************
//{		ПОДПИСАНИЕ ПАКЕТА

&НаКлиенте
Процедура Пакеты_ПодписатьПакетНаОтправку(Пакет) Экспорт
	
	Пакеты_ДобавитьПодписиФайловПакета(Пакет); // второй параметр - это пинкод.
	
	ЗашифрованныйПакет = СвойствоСтруктуры(Пакет.СлужебнаяИнформация, "ЗашифрованныйПакет", Ложь);
	
	Если ЗашифрованныйПакет Тогда
		Пакеты_ЗашифроватьФайлыВПакете(Пакет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пакеты_ДобавитьПодписиФайловПакета(Пакет, ПарольКонтейнера = "") Экспорт 
	
	BoxId = Пакет.Идентификаторы.BoxId;
	ОтпечатокСертификата = КонтекстСеанса_ПрочитатьВызовСервера(BoxId, "ОтпечатокСертификата");
	
	Если ОтпечатокСертификата = "" Тогда 
		ВызватьИсключение "Подписание доступно только при авторизации по сертификату";	
	КонецЕсли;
	
	Для Каждого Документ Из Пакет.Документы Цикл
		ДвоичныеДанные = Документ_ДвоичныеДанные(Документ);
		Если ДвоичныеДанные <> Неопределено Тогда
			Документ.Документооборот.ХранилищеКонтента.Подпись.ДанныеПодписи = ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Пакеты_ЗашифроватьФайлыВПакете(Пакет) Экспорт 
	
	МассивСертификатов = Пакеты_СертификатыДляШифрования(Пакет);
	
	Для Каждого Документ Из Пакет.Документы Цикл
		ХранилищеКонтента						= СвойствоСтруктуры(Документ.Документооборот, "ХранилищеКонтента", Контракт_ДанныеХраненияВызовСервера());
		ДвоичныеДанные							= ХранилищеКонтента.Данные;
		ХранилищеКонтента.ЗашифрованныеДанные	= ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция Пакеты_СертификатыДляШифрования(Пакет)
	
	BoxId				 = Пакет.Отправитель.BoxId;
	CounteragentBoxId	 = Пакет.Получатель.BoxId;
	
	КлючКэш = "СертификатыДляШифрования_" + BoxId + "_" + CounteragentBoxId;
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если Результат = Неопределено Тогда
		ПараметрыСобытия = Новый Структура;
		ПараметрыСобытия.Вставить("Пакет", Пакет);
		Результат = ПодключаемыйМодуль_ОбработатьСобытие("ПолучитьСертификатыДляШифрования", ПараметрыСобытия);
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Результат = Документы_СертификатыДляШифрованияИзДиадокаВызовСервера(BoxId, CounteragentBoxId);
		Кэш_Поместить(КлючКэш, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_СертификатыДляШифрованияИзДиадокаВызовСервера(BoxId, CounteragentBoxId)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_СертификатыДляШифрованияИзДиадока(BoxId, CounteragentBoxId);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Пакеты_ОтправитьПакетНаПодписаниеГосключ(Пакет, СНИЛС, OID) Экспорт
	
	Возврат Пакеты_ОтправитьПакетНаПодписаниеГосключВызовСервера(Пакет, СНИЛС, OID);
	
КонецФункции

&НаСервере
Функция Пакеты_ОтправитьПакетНаПодписаниеГосключВызовСервера(Пакет, СНИЛС, OID)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Возврат ОбработкаОбъект.Пакеты_ОтправитьПакетНаПодписаниеГосключ(Пакет, СНИЛС, OID);
	
КонецФункции

// Заполнение реквизитов электронных документов добавленных в ручную по метаданным 
//
// Параметры:
//  Пакет	 - Структура - см. Контракт Новый_Пакет 
//
&НаКлиенте
Процедура Пакеты_ЗаполнитьРеквизитыДокументов(Пакет) Экспорт
	
	Пакеты_ЗаполнитьРеквизитыДокументовНаСервере(Пакет);
	
КонецПроцедуры

&НаСервере
Процедура Пакеты_ЗаполнитьРеквизитыДокументовНаСервере(Пакет)
	
	МодульЯдро = ОбработкаОбъект();
	МодульЯдро.Пакеты_ЗаполнитьРеквизитыДокументов(Пакет);
	
КонецПроцедуры

&НаКлиенте
Функция Пакеты_Сохранить(Пакет) Экспорт
	
	Результат = Пакеты_СохранитьВызовСервера(Пакет);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Пакеты_СохранитьВызовСервера(Пакет)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Пакеты_Сохранить(Пакет);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документ_ДвоичныеДанные(Документ)
	
	ХранилищеКонтента = СвойствоСтруктуры(Документ.Документооборот, "ХранилищеКонтента");
	ДанныеХранилища = СвойствоСтруктуры(ХранилищеКонтента, "Данные");
	
	Если ТипЗнч(ДанныеХранилища) = Тип("ДвоичныеДанные") Тогда
		
		Результат = ДанныеХранилища;
		
	ИначеЕсли ЭтоАдресВременногоХранилища(ДанныеХранилища) Тогда
		
		Результат = ПолучитьИзВременногоХранилища(ДанныеХранилища);
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ПОДПИСАНИЕ ПАКЕТА


//**********************************************
//{		ПОДПИСАНТ

&НаКлиенте
Функция Подписант_ПредставлениеПодписанта(BoxId) Экспорт
	
	Сертификат	= КонтекстСеанса_ПрочитатьВызовСервера(BoxId, "Сертификат");
	Результат	= Сертификаты_ПредставлениеПодписанта(Сертификат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Подписант_ЭтоСотрудникОрганизации(BoxId) Экспорт
	
	Результат = Ложь;
	
	Сертификат = КонтекстСеанса_ПрочитатьВызовСервера(BoxId, "Сертификат");
	
	Если Сертификат <> Неопределено Тогда
		
		ТипыСертификатовКЭП = Перечисление_ТипыСертификатовКЭП();
		
		Результат = Сертификат.Тип <> ТипыСертификатовКЭП.ИП;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ПОДПИСАНТ


//**********************************************
//{		Извещения о получении (ИоП)

&НаКлиенте
Процедура ИоП_ПодписатьИзвещенияОПолучении(ПодготовленныеИзвещенияВсехОрганизаций) Экспорт
	
	Для Каждого ПодготовленныеИзвещенияОрганизации Из ПодготовленныеИзвещенияВсехОрганизаций Цикл
		
		BoxId = ПодготовленныеИзвещенияОрганизации.BoxId;
					
		Для Каждого СтруктураДанных Из ПодготовленныеИзвещенияОрганизации.ИзвещенияОПолучении Цикл
			
			InvoiceReceipt = СтруктураДанных.InvoiceReceipt;
			
			Если InvoiceReceipt <> Неопределено Тогда
			
				ДвоичныеДанныеПодписи = ПодписьДанных(BoxId, InvoiceReceipt);
				СтруктураДанных.Вставить("Signature", ДвоичныеДанныеПодписи);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ИоП_ПодготовитьИзвещенияОПолучении() Экспорт
	
	Результат = ИоП_ПодготовитьИзвещенияОПолученииВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИоП_ПодготовитьИзвещенияОПолученииВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ИоП_ПодготовитьИзвещенияОПолучении();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИоП_ОтправитьИзвещенияОПолучении(ПодготовленныеИзвещения) Экспорт
	
	ИоП_ОтправитьИзвещенияОПолученииВызовСервера(ПодготовленныеИзвещения);
	
КонецПроцедуры

&НаСервере
Процедура ИоП_ОтправитьИзвещенияОПолученииВызовСервера(ПодготовленныеИзвещения)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.ИоП_ОтправитьИзвещенияОПолучении(ПодготовленныеИзвещения);
	
КонецПроцедуры

//}		Извещения о получении (ИоП)

//{		Универсальные сообщения

// Определяет необходимость формирования квитанций в формате универсальных сообщений
//
// Параметры:
//  BoxId	 - Строка - Идентификатор ящика
// 
// Возвращаемое значение:
//   - Булево
//
&НаКлиенте
Функция УС_ДоступноФормированиеУниверсальныхСообщений(BoxId) Экспорт
	
	ФормироватьУС = ОбщийКонтекст_Прочитать("ФормироватьУС");
	
	Если ФормироватьУС = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаКонтекста = КонтекстСеанса_СтрокаКонтекста(BoxId, Ложь);
	
	Если ЗначениеЗаполнено(СтрокаКонтекста) Тогда
		Результат = СвойствоСтруктуры(СтрокаКонтекста.ПраваПользователя, "CanAttachUniversalMessages");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		Универсальные сообщения

//**********************************************
//{		Отмена фиксации ГИСМТ

&НаКлиенте
Процедура ОтменаФиксации_Подписать(ОтпечатокСертификата, ДанныеОтменыФиксации) Экспорт
	
	Для Каждого СтруктураДанных Из ДанныеОтменыФиксации Цикл
		
		ДвоичныеДанныеПодписи = ПодписатьДанные(
			СтруктураДанных.Content,
			ОтпечатокСертификата);
			
		СтруктураДанных.Вставить("Signature", ДвоичныеДанныеПодписи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОтменаФиксации_ПолучитьДанные(BoxId, ИНН) Экспорт
	
	Результат = ОтменаФиксации_ПолучитьДанныеВызовСервера(BoxId, ИНН);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтменаФиксации_ПолучитьДанныеВызовСервера(BoxId, ИНН)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ОтменаФиксации_ПолучитьДанные(BoxId, ИНН);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтменаФиксации_Отправить(BoxId, ДанныеОтменыФиксации) Экспорт
	
	ОтменаФиксации_ОтправитьВызовСервера(BoxId, ДанныеОтменыФиксации);
	
КонецПроцедуры

&НаСервере
Процедура ОтменаФиксации_ОтправитьВызовСервера(BoxId, ДанныеОтменыФиксации)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.ОтменаФиксации_Отправить(BoxId, ДанныеОтменыФиксации);
	
КонецПроцедуры

//}		Отмена фиксации ГИСМТ

//**********************************************
//{		ШИФРОВАНИЕ ДОКУМЕНТА

&НаКлиенте
Функция Документы_Расшифровать(Идентификаторы, ОтправлятьРезультатПроверкиПодписи = Истина) Экспорт
	
	Результат = ХранениеДанных_ДанныеХранилища(Идентификаторы, "ХранилищеКонтента");
	
	ТребуетсяРасшифровка = Результат.ТребуетсяРасшифровка;
	
	Если ТребуетсяРасшифровка Тогда
		
		РасшифрованныеДанные	= РасшифроватьДанные(Результат.ЗашифрованныеДанные);
		Результат.Данные		= РасшифрованныеДанные;
		
		ПодписьВерна = Документы_ПроверитьПодпись(Результат);
		
		Результат.Подпись.ПодписьВерна	= ПодписьВерна;
		Результат.ТребуетсяРасшифровка	= Ложь;
		
		Документы_ОтправитьРезультатПроверкиПодписиВызовСервера(Результат, Идентификаторы, ПодписьВерна, ОтправлятьРезультатПроверкиПодписи);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Документы_ОтправитьРезультатПроверкиПодписиВызовСервера(ДанныеХранилища, Идентификаторы, ПодписьВерна, ОтправлятьРезультатПроверкиПодписи)
	
	Если ОтправлятьРезультатПроверкиПодписи Тогда
		
		ОбработкаОбъект = ОбработкаОбъект();
		
		Попытка
			ОбработкаОбъект.Документы_ОтправитьРезультатПроверкиПодписи(Идентификаторы, ПодписьВерна);
		Исключение
			
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Если Найти(НРег(ТекстОшибки), НРег("InvalidDocumentState")) > 0
				ИЛИ Найти(НРег(ТекстОшибки), НРег("Состояние документа не позволяет выполнить действие")) > 0 Тогда
				// Отметка о проверке подписи уже установлена.
			Иначе
				ВызватьИсключение;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЕсли;
	
	ХранениеДанных_ЗаписатьДанныеХранилищаВызовСервера(ДанныеХранилища, "ХранилищеКонтента", Идентификаторы.ДокументЭДО);
	
КонецПроцедуры

&НаКлиенте
Функция Документы_ПроверитьПодпись(ДанныеХранения)
	
	ДвоичныеДанные			= ДанныеХранения.Данные;
	ДвоичныеДанныеПодписи	= ДанныеХранения.Подпись.ДанныеПодписи;
	
	Результат = ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_ВыполнитьДействиеСДокументами(ДокументыДляОбработки, Знач Действие = "",
	Знач ОтпечатокСертификата = "") Экспорт
	
	Если Действие = Перечисление_ДействияЭДО().АннулироватьШаблон Тогда
		Возврат Документы_АннулироватьШаблоны(ДокументыДляОбработки);
	КонецЕсли;
	
	ПодготовленныеДанные = Документы_ДанныеДляMessagePatchToPostВызовСервера(ДокументыДляОбработки, Действие);
	
	Документы_ПодписатьДанныеДляMessagePatchToPost(ПодготовленныеДанные, ОтпечатокСертификата);
	
	Результат = Документы_ОтправитьДанныеДляMessagePatchToPostВызовСервера(ПодготовленныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ДанныеДляMessagePatchToPostВызовСервера(ДокументыДляОбработки, Действие)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ДанныеДляMessagePatchToPost(ДокументыДляОбработки, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Документы_ПодписатьДанныеДляMessagePatchToPost(ДанныеДляMessagePatchToPost, Знач ОтпечатокСертификата = "") Экспорт
	
	Перем SignedContent;
	
	Для Каждого ДанныеСообщения Из ДанныеДляMessagePatchToPost Цикл
		
		Для Каждого КоллекцияДействия Из ДанныеСообщения.Значение.Коллекции Цикл
			
			Если КоллекцияДействия.Ключ = "UniversalMessages" Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЭлементКоллекции Из КоллекцияДействия.Значение Цикл
				
				BoxId = ЭлементКоллекции.Документ.Идентификаторы.BoxId;
				
				ДанныеПодписи	= ПодписьДанных(BoxId, ЭлементКоллекции.Данные, ОтпечатокСертификата);
				ДанныеПодписи	= Base64Строка(ДанныеПодписи);
				
				Если ЭлементКоллекции.Attachment.Свойство("Signature") Тогда
					
					ЭлементКоллекции.Attachment.Signature = ДанныеПодписи;
					
				ИначеЕсли ЭлементКоллекции.Attachment.Свойство("SignedContent", SignedContent) Тогда
					
					SignedContent.Content	= Base64Строка(ЭлементКоллекции.Данные);
					SignedContent.Signature	= ДанныеПодписи;
					
				Иначе
					ВызватьИсключение "Не найден контейнер размещения подписи данных!";
				КонецЕсли;
				
				ЭлементКоллекции.Данные = Неопределено;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция Документы_ОтправитьДанныеДляMessagePatchToPostВызовСервера(ПодготовленныеДанные)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ОтправитьДанныеДляMessagePatchToPost(ПодготовленныеДанные);
	
	Возврат Результат;
	
КонецФункции

//}		ШИФРОВАНИЕ ДОКУМЕНТА

//**********************************************
//{		ДЕЙСТВИЯ ДОКУМЕНТАМИ

&НаСервере
Функция Документы_АннулироватьШаблоны(МассивДокументов)
	
	Возврат ОбработкаОбъект().Документы_АннулироватьШаблоны(МассивДокументов);
	
КонецФункции

&НаКлиенте
Функция Документы_ФормироватьОтветныйТитул(Документ) Экспорт
	
	Результат = Ложь;
	
	BoxId			= Документ.Идентификаторы.BoxId;
	WorkflowId		= Документ.Тип.WorkflowId;
	Формализованный	= Документ.Тип.Формализованный;
	
	ОтсутствуетWorkflowId = (WorkflowId = 0);
	
	Если ОтсутствуетWorkflowId И Формализованный Тогда
		Результат = Истина;
	Иначе
		
		ОписаниеВидовДокументооборотаAPI = ПредопределенныеСписки_ОписаниеВидовДокументооборотаAPI(BoxId);
		
		ОписаниеДО = ОписаниеВидовДокументооборотаAPI.Получить(WorkflowId);
		
		Если ОписаниеДО <> Неопределено Тогда
			Результат = ОписаниеДО.ТитулПолучателя;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_ДоступныеДействия(Документ) Экспорт
	
	Результат = Документы_ДоступныеДействияВызовСервера(Документ);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ДоступныеДействияВызовСервера(Документ)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ДоступныеДействия(Документ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_ПредставлениеДокументаДляСохранения(Документ) Экспорт
	
	Результат = Документы_ПредставлениеДокументаДляСохраненияВызовСервера(Документ);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ПредставлениеДокументаДляСохраненияВызовСервера(Документ)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ПредставлениеДокументаДляСохранения(Документ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_ДоступныеДляАннулированияДокументы(Документы, Действие) Экспорт
	
	Результат = Документы_ДоступныеДляАннулированияДокументыВызовСервера(Документы, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ДоступныеДляАннулированияДокументыВызовСервера(Документы, Действие)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ДоступныеДляАннулированияДокументы(Документы, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_ВидыДокументовДляПодписания(Документы) Экспорт
	
	Результат = Документы_ВидыДокументовДляПодписанияВызовСервера(Документы);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ВидыДокументовДляПодписанияВызовСервера(Документы)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ВидыДокументовДляПодписания(Документы);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_ДоступныеДляПодписанияВходящие(Документы, Действие) Экспорт
	
	Результат = Документы_ДоступныеДляПодписанияВходящиеВызовСервера(Документы, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ДоступныеДляПодписанияВходящиеВызовСервера(Документы, Действие)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ДоступныеДляПодписанияВходящие(Документы, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПредопределенныеСписки_ОписаниеВидовДокументооборотаAPI(BoxId)
	
	Результат = Кэш_Прочитать("ОписаниеВидовДокументооборотаAPI");
	
	Если Результат = Неопределено Тогда
		
		Результат = ПредопределенныеСписки_ОписаниеВидовДокументооборотаAPIВызовСервера(BoxId);
		
		Кэш_Поместить("ОписаниеВидовДокументооборотаAPI", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПредопределенныеСписки_ОписаниеВидовДокументооборотаAPIВызовСервера(BoxId)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ПредопределенныеСписки_ОписаниеВидовДокументооборотаAPI(BoxId);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Контракт_ТитулПокупателяУПД970() Экспорт

	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Контракт_ТитулПокупателяУПД970();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СгруппироватьДокументыПоПакетам(Документы) Экспорт
	
	Результат = СгруппироватьДокументыПоПакетамВызовСервера(Документы);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СгруппироватьДокументыПоПакетамВызовСервера(Документы)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.СгруппироватьДокументыПоПакетам(Документы);
	
	Возврат Результат;
	
КонецФункции

//}		ДЕЙСТВИЯ ДОКУМЕНТАМИ

//**********************************************
//{		СОЗДАНИЕ УЧЕТНЫХ ДОКУМЕНТОВ

&НаКлиенте
Функция ПодключаемыйМодуль_ИспользоватьФормуСозданияДокументов() Экспорт
	
	Результат = ИспользоватьФормуСозданияДокументов();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИспользоватьФормуСозданияДокументов()
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ПодключаемыйМодуль_ИспользоватьФормуСозданияДокументов();
	
	Возврат Результат;
	
КонецФункции

//}		СОЗДАНИЕ УЧЕТНЫХ ДОКУМЕНТОВ

//{ ДОП СВОЙСТВА ДОКУМЕНТА

&НаСервере
Функция Документы_ПолучитьДополнительныеСведенияПротоКонтента(ПротоКонтент, ТипКонтента) Экспорт
	
	Результат = ОбработкаОбъект().Документы_ПолучитьДополнительныеСведенияПротоКонтента(
		ПротоКонтент,
		ТипКонтента);
		
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Документы_ЗаполнитьДополнительныеСведенияПротоКонтента(ПротоКонтент, ДопСведения, ТипКонтента) Экспорт
	
	ОбработкаОбъект().Документы_ЗаполнитьДополнительныеСведенияПротоКонтента(
		ПротоКонтент,
		ДопСведения,
		ТипКонтента);
	
КонецПроцедуры

//} ДОП СВОЙСТВА ДОКУМЕНТА

//**********************************************
//{		АВТОРИЗАЦИЯ

&НаКлиенте
Функция КонтекстСеанса_ЕстьСтроки() Экспорт
	
	КонтекстСеанса = ХранилищеКонтекстаСеанса();
	
	Результат = ЗначениеЗаполнено(КонтекстСеанса);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Авторизация_ПоСертификату(ОтпечатокСертификата) Экспорт
	
	Результат = Неопределено;
	
	Сертификат = Сертификаты_ДанныеСертификата(ОтпечатокСертификата);
	
	ЗашифрованныйТокен = Токен_ПолучитьПоСертификатуНаСервере(Сертификат.ДвоичныеДанные);
	
	Если ЗначениеЗаполнено(ЗашифрованныйТокен) Тогда
		РасшифрованныйТокен = Токен_Расшифровать(ЗашифрованныйТокен);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РасшифрованныйТокен) Тогда
		
		ТекстОшибки = Общее_ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось выполнить авторизацию по сертификату с отпечатком %1'"), ОтпечатокСертификата);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = Токен_ПодтвердитьАутентификациюНаСервере(РасшифрованныйТокен, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

// Авторизуется на сервере ДД по логину и паролю
//
// Параметры:
//  Логин - Строка
//  Пароль - Строка
//  ТекстОшибки - Строка - параметр в который записывается подробный текст ошибки при неудачной авторизации
// 
// Возвращаемое значение:
//  Строка - токен авторизации
//
&НаКлиенте
Функция Авторизация_ПоПаролю(Логин, Пароль, ТекстОшибки = "") Экспорт
	
	Токен = Неопределено;
	
	Попытка
		Токен = Токен_ПолучитьПоПаролюНаСервере(Логин, Пароль);
	Исключение
		
		ВидОперации		 = "Авторизация по логину";
		ТекстОшибки		 = "Не удалось выполнить авторизацию по логину %1. По причине: %2";
		ТекстОшибки		 = Общее_ПодставитьПараметрыВСтроку(ТекстОшибки, Логин, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Ошибка_Обработать(ВидОперации, ТекстОшибки);
		
		Возврат Токен;
		
	КонецПопытки;
	
	Авторизация_ДобавитьСтрокуПоЛогинуНаСервере(Логин, Токен);
	
	Возврат Токен;
	
КонецФункции

&НаКлиенте
Функция Токен_Расшифровать(ЗашифрованныйТокен)
	
	Результат = РасшифроватьДанные(ЗашифрованныйТокен);
	
	Результат = Base64Строка(Результат);
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Авторизация_ПроверкаАвторизации(Сертификат = Неопределено, Логин = Неопределено, Пароль = Неопределено) Экспорт
	
	Результат = Авторизация_ПроверкаАвторизацииВызовСервера(
		Сертификат,
		Логин,
		Пароль
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Авторизация_ПроверкаАвторизацииВызовСервера(Сертификат, Логин, Пароль)
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.Авторизация_ПроверкаАвторизации(
		Сертификат,
		Логин,
		Пароль
	);
	
	Возврат Результат;
	
КонецФункции

//}		АВТОРИЗАЦИЯ


//**********************************************
//{		КОНТРАКТЫ

&НаСервере
Функция Контракт_ДанныеХраненияВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Контракт_ДанныеХранения();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контракт_Маршрутизация() Экспорт 
	
	Результат = Контракт_МаршрутизацияВызовСервера();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Контракт_МаршрутизацияВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Контракт_Маршрутизация();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контракт_Идентификаторы() Экспорт
	
	Результат = Контракт_ИдентификаторыВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Контракт_ИдентификаторыВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Контракт_Идентификаторы();
	
	Возврат Результат;
	
КонецФункции

//}		КОНТРАКТЫ

//**********************************************
//{		СОПОСТАВЛЕНИЕ ДОКУМЕНТОВ

// Возвращает значение реквизитов номер и дата документа учета
//
// Параметры:
//  Документ		 - Структура - см. Контракт_Документ
//  СсылкаНаОбъект	 - ДокументСсылка - Ссылка на документ учета
// 
// Возвращаемое значение:
// РеквизитыДокументаУчета - Структура - Коллекция в которой находятся реквизиты и их соответствия в случае отсутствия ИМ возвращает Неопределено
// 	- Номер - Строка - номер учетного документа
// 	- Дата - Дата - дата учетного документа
//
&НаКлиенте
Функция Документы_Сопоставление_ПолучитьРеквизитыДляПроверки(СсылкаНаОбъект) Экспорт
	
	Результат = Документы_Сопоставление_ПолучитьРеквизитыДляПроверки_Сервер(СсылкаНаОбъект);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизитов номер и дата документа учета
//
// Параметры:
//  Документ		 - Структура - см. Контракт_Документ
//  СсылкаНаОбъект	 - ДокументСсылка - Ссылка на документ учета
// 
// Возвращаемое значение:
// РеквизитыДокументаУчета - Структура - Коллекция в которой находятся реквизиты и их соответствия в случае отсутствия ИМ возвращает Неопределено
// 	- Номер - Строка - номер учетного документа
// 	- Дата - Дата - дата учетного документа
//
&НаСервере
Функция Документы_Сопоставление_ПолучитьРеквизитыДляПроверки_Сервер(СсылкаНаОбъект)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_Сопоставление_ПолучитьРеквизитыДляПроверки(СсылкаНаОбъект);
	
	Возврат Результат;
	
КонецФункции


// Заполняет значение реквизитов номер и дата документа учета
//
// Параметры:
//  СсылкаНаОбъект	 	- ДокументСсылка - Ссылка на документ учета
//  Номер	 			- Строка - Номер документа учета для заполнения
//  Дата	 			- Дата - Дата документа учета для заполнения
//
&НаКлиенте
Процедура Документы_Сопоставление_ОбновитьРеквизитыУчетногоДокумента(СсылкаНаОбъект, Номер, Дата) Экспорт
	
	Документы_Сопоставление_ОбновитьРеквизитыУчетногоДокумента_Сервер(СсылкаНаОбъект, Номер, Дата);
	
КонецПроцедуры

// Заполняет значение реквизитов номер и дата документа учета
//
// Параметры:
//  СсылкаНаОбъект	 	- ДокументСсылка - Ссылка на документ учета
//  Номер	 			- Строка - Номер документа учета для заполнения
//  Дата	 			- Дата - Дата документа учета для заполнения
//
&НаСервере
Процедура Документы_Сопоставление_ОбновитьРеквизитыУчетногоДокумента_Сервер(СсылкаНаОбъект, Номер, Дата) Экспорт
	
	ОбработкаОбъект = ОбработкаОбъект();	
	ОбработкаОбъект.Документы_Сопоставление_ОбновитьРеквизитыУчетногоДокумента(СсылкаНаОбъект, Номер, Дата);
	
КонецПроцедуры

&НаКлиенте
Функция Документы_ПравилаСопоставленияПоВидуМетаданных(ВидМетаданных) Экспорт
	
	Результат = Документы_ПравилаСопоставленияПоВидуМетаданныхВызовСервера(ВидМетаданных);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ПравилаСопоставленияПоВидуМетаданныхВызовСервера(ВидМетаданных)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ПравилаСопоставленияПоВидуМетаданных(ВидМетаданных);
	
	Возврат Результат;
	
КонецФункции

//}		СОПОСТАВЛЕНИЕ ДОКУМЕНТОВ


//**********************************************
//{		СОЗДАНИЕ УЧЕТНЫХ ДОКУМЕНТОВ

&НаКлиенте
Функция Документы_СписокТиповДокументовДляСоздания(Документ) Экспорт
	
	Результат = Документы_СписокТиповДокументовДляСозданияВызовСервера(Документ);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_СписокТиповДокументовДляСозданияВызовСервера(Документ)
	
	Ядро = ОбработкаОбъект();
	Результат = Ядро.Документы_СписокТиповДокументовДляСоздания(Документ);
	
	Возврат Результат;
	
КонецФункции

//}		СОЗДАНИЕ УЧЕТНЫХ ДОКУМЕНТОВ


//**********************************************
//{		СПРАВОЧНИКИ

&НаКлиенте
Процедура Справочники_ВыполнитьСинхронизацию(ДобавитьКонтрагентовДляПриглашения = Истина) Экспорт
	
	Справочники_ВыполнитьСинхронизациюВызовСервера(ДобавитьКонтрагентовДляПриглашения);
	
КонецПроцедуры

&НаСервере
Процедура Справочники_ВыполнитьСинхронизациюВызовСервера(ДобавитьКонтрагентовДляПриглашения = Истина)
	
	Ядро = ОбработкаОбъект();
	Ядро.Справочники_ВыполнитьСинхронизацию(ДобавитьКонтрагентовДляПриглашения);
	
КонецПроцедуры

//}		СПРАВОЧНИКИ

//**********************************************
//{		ХРАНЕНИЕ ДАННЫХ

&НаКлиенте
Функция ХранениеДанных_ДанныеХранилища(Идентификаторы, ИмяХранилища)
	
	Результат = ХранениеДанных_ДанныеХранилищаВызовСервера(Идентификаторы, ИмяХранилища);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ХранениеДанных_ДанныеХранилищаВызовСервера(Идентификаторы, ИмяХранилища)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ХранениеДанных_ДанныеХранилища(Идентификаторы, ИмяХранилища);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ХранениеДанных_ЗаписатьДанныеХранилищаВызовСервера(ДанныеХранения, ИмяХранилища, ДокументЭДО)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.ХранениеДанных_ЗаписатьДанныеХранилища(ДанныеХранения, ИмяХранилища, ДокументЭДО);
	
КонецПроцедуры

&НаКлиенте
Функция ХранениеДанных_ДанныеДокумента(Идентификаторы) Экспорт
	
	Результат = ХранениеДанных_ДанныеДокументаВызовСервера(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ХранениеДанных_ДанныеДокументаВызовСервера(Идентификаторы)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ХранениеДанных_ДанныеДокумента(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

//}		ХРАНЕНИЕ ДАННЫХ


//}		ГЕНЕРАЦИЯ XML

//**********************************************
//{		ПЕРЕЧИСЛЕНИЯ

&НаКлиенте
Функция Перечисление_СтатусыДокументов() Экспорт
	
	Результат = Кэш_Прочитать("СтатусыДокументов");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_СтатусыДокументовВызовСервера();
	
	Кэш_Поместить("СтатусыДокументов", Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СтатусыДокументовВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_СтатусыДокументов();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ДействияЭДО() Экспорт
	
	Результат = Кэш_Прочитать("ДействияЭДО");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ДействияЭДОВызовСервера();
	
	Кэш_Поместить("ДействияЭДО", Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ДействияЭДОВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_ДействияЭДО();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ПредставленияДействийЭДО() Экспорт
	
	Результат = Кэш_Прочитать("ПредставленияДействийЭДО");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ПредставленияДействийЭДОВызовСервера();
	
	Кэш_Поместить("ПредставленияДействийЭДО", Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ПредставленияДействийЭДОВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_ПредставленияДействийЭДО();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыСертификатовКЭП() Экспорт
	
	Результат = Кэш_Прочитать("ТипыСертификатовКЭП");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ТипыСертификатовКЭПВызовСервера();
	
	Кэш_Поместить("ТипыСертификатовКЭП", Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ТипыСертификатовКЭПВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_ТипыСертификатовКЭП();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_МестоположенияМодуля() Экспорт
	
	Результат = Кэш_Прочитать("Перечисление_МестоположенияМодуля");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_МестоположенияМодуляВызовСервера();
	
	Кэш_Поместить("Перечисление_МестоположенияМодуля", Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_МестоположенияМодуляВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_МестоположенияМодуля();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_АдресаИнтернетРесурсов() Экспорт
	
	Результат = Перечисление_АдресаИнтернетРесурсовВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_АдресаИнтернетРесурсовВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_АдресаИнтернетРесурсов();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВариантыОтветаПоДокументу() Экспорт
	
	Если Не ЗначениеЗаполнено(_ВариантыОтветаПоДокументу) Тогда
		_ВариантыОтветаПоДокументу = Перечисление_ВариантыОтветаПоДокументуВызовСервера();
	КонецЕсли;
	
	Возврат _ВариантыОтветаПоДокументу;
	
КонецФункции

&НаСервере
Функция Перечисление_ВариантыОтветаПоДокументуВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_ВариантыОтветаПоДокументу();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_СценарииМодуляДляОтзывов() Экспорт
	
	Результат = Кэш_Прочитать("СценарииМодуляДляОтзывов");
	
	Если Результат = Неопределено Тогда
		
		Результат = Перечисление_СценарииМодуляДляОтзывовВызовСервера();
		
		Кэш_Поместить("СценарииМодуляДляОтзывов", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СценарииМодуляДляОтзывовВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_СценарииМодуляДляОтзывов();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_СтатусыКонтрагентов() Экспорт
	
	Результат = Кэш_Прочитать("СтатусыКонтрагентов");
	
	Если Результат = Неопределено Тогда
		
		Результат = Перечисление_СтатусыКонтрагентовВызовСервера();
		
		Кэш_Поместить("СтатусыКонтрагентов", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СтатусыКонтрагентовВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Перечисление_СтатусыКонтрагентов();
	
	Возврат Результат;
	
КонецФункции

//}		ПЕРЕЧИСЛЕНИЯ


//**********************************************
//{		АПИ

// см. Модуль_API.НовыйНастройкиПрокси
//
&НаКлиенте
Функция АПИ_РежимыИспользованияПрокси() Экспорт
	
	РежимыПрокси = АПИ_РежимыИспользованияПроксиВызовСервера();
	
	Возврат РежимыПрокси;
	
КонецФункции

&НаСервере
Функция АПИ_РежимыИспользованияПроксиВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.АПИ_РежимыИспользованияПрокси();
	
	Возврат Результат;
	
КонецФункции

// см. Модуль_API.НовыйНастройкиПрокси
//
&НаКлиенте
Функция АПИ_Новый_НастройкиПрокси(Режим = "",
							 	Сервер = "",
							 	Порт = 0,
							 	Логин = "",
							 	Пароль = "") Экспорт
								
	НастройкиПрокси = АПИ_Новый_НастройкиПроксиВызовСервера(Режим, Сервер, Порт, Логин, Пароль);
		
	Возврат НастройкиПрокси;
	
КонецФункции

&НаСервере
Функция АПИ_Новый_НастройкиПроксиВызовСервера(Режим, Сервер, Порт, Логин, Пароль)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.АПИ_Новый_НастройкиПрокси(Режим, Сервер, Порт, Логин, Пароль);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция АПИ_ПроверитьСоединениеDiadocAPI(ПараметрыПрокси = Неопределено, ТекстОшибки = "") Экспорт
	
	Результат = АПИ_ПроверитьСоединениеDiadocAPIВызовСервера(
		ПараметрыПрокси,
		ТекстОшибки
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция АПИ_ПроверитьСоединениеDiadocAPIВызовСервера(ПараметрыПрокси, ТекстОшибки)
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.АПИ_ПроверитьСоединениеDiadocAPI(
		ПараметрыПрокси,
		ТекстОшибки
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Токен_ПолучитьПоСертификатуНаСервере(Сертификат)
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.Токен_ПолучитьИзДиадока(Сертификат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Токен_ПодтвердитьАутентификациюНаСервере(РасшифрованныйТокен, ОтпечатокСертификата)
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.Токен_ПодтвердитьАутентификацию(РасшифрованныйТокен, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Токен_ПолучитьПоПаролюНаСервере(Логин, Пароль)
	
	Сертификат = Неопределено;
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.Токен_ПолучитьИзДиадока(
		Сертификат,
		Логин,
		Пароль
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Авторизация_ДобавитьСтрокуПоЛогинуНаСервере(Логин, Пароль)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.Авторизация_ДобавитьСтрокуПоЛогину(Логин, Пароль);
	
КонецПроцедуры

//}		АПИ

                            
//**********************************************
//{		МЧД

&НаКлиенте
// Возвращает коллекцию действий ЭДО, которые требуют МЧД при постинге
// 
// Возвращаемое значение:
//  Соответствие - Ключ - строка, описывающая действие ЭДО (см. Перечисление_ДействияЭДО)
//					Значение - признак Булево, что действие требует МЧД
//
Функция МЧД_ДействияТребующиеДоверенность() Экспорт
	
	Результат = Кэш_Прочитать("МЧД_ДействияТребующиеДоверенность");
	
	Если Результат = Неопределено Тогда
		
		Результат = МЧД_ДействияТребующиеДоверенностьВызовСервера();
		
		Кэш_Поместить("МЧД_ДействияТребующиеДоверенность", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МЧД_ДействияТребующиеДоверенностьВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.МЧД_ДействияТребующиеДоверенность();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контракт_ПараметрыРегистрацииМЧД() Экспорт
	
	Результат = Контракт_ПараметрыРегистрацииМЧДВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Контракт_ПараметрыРегистрацииМЧДВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Контракт_ПараметрыРегистрацииМЧД();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МЧД_ЗарегистрироватьНовуюДоверенность(ПараметрыРегистрацииМЧД) Экспорт
	
	Результат = МЧД_ЗарегистрироватьНовуюДоверенностьВызовСервера(ПараметрыРегистрацииМЧД);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МЧД_ЗарегистрироватьНовуюДоверенностьВызовСервера(ПараметрыРегистрацииМЧД)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.МЧД_ЗарегистрироватьНовуюДоверенность(ПараметрыРегистрацииМЧД);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_СобытияМЧД_ФайлыДоверенности(СериализованныеПараметрыГиперссылки) Экспорт
	
	Результат = Документы_СобытияМЧД_ФайлыДоверенностиНаСервере(СериализованныеПараметрыГиперссылки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_СобытияМЧД_ФайлыДоверенностиНаСервере(СериализованныеПараметрыГиперссылки)
	
	Результат = ОбработкаОбъект().Документы_СобытияМЧД_ФайлыДоверенности(СериализованныеПараметрыГиперссылки);
	
	Возврат Результат;
	
КонецФункции

// Возвращает из истории по документу события с МЧД
//
// Параметры:
//  ИдентификаторыДокумента	 - Структура - идентификаторы документа
//		BoxId - Строка - идентификатор ящика
//		LetterId - Строка - идентификатор сообщения (пакета)
//		DocumentId - Строка - идентификатор документа
// 
// Возвращаемое значение:
//  Массив - массив структур событиий с данными МЧД
//
&НаКлиенте
Функция Документы_СобытияМЧД(ИдентификаторыДокумента) Экспорт
	
	Результат = Документы_СобытияМЧДНаСервере(ИдентификаторыДокумента);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_СобытияМЧДНаСервере(ИдентификаторыДокумента)
	
	Результат = ОбработкаОбъект().Документы_СобытияМЧД(ИдентификаторыДокумента);
	
	Возврат Результат;
	
КонецФункции

//}		МЧД


//**********************************************
//{		ПЕРЕОПРЕДЕЛЕНИЕ ФОРМ

// Обработчик события НачалоВыбора элемента формы подсистемы.
//
// Параметры:
//  Контекст - Структура - контекст переопределяемого события формы (см. КонтекстСобытияФормыСопоставленияНоменклатуры).
//  Элемент - ЭлементФормы - см. описание параметра события элемента формы.
//  ДанныеВыбора - СписокЗначений - см. описание параметра события элемента формы.
//  СтандартнаяОбработка - Булево - (возвращаемый параметр) Ложь, чтобы отключить стандартную обработку события.
//
&НаКлиенте
Процедура СобытияФорм_ЭлементФормыНачалоВыбора(Контекст, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользуетсяТиповойИнтеграционныйМодуль() Тогда
		Возврат;
	КонецЕсли;
	
	ИМ = Модуль_ИМ();
	ИМ.ПереопределениеФорм_ЭлементФормыНачалоВыбора(
		Контекст,
		Элемент,
		ДанныеВыбора,
		СтандартнаяОбработка
	);
	
КонецПроцедуры

// Обработчик события ОбработкаВыбора элемента формы подсистемы.
//
// Параметры:
//  Контекст - Структура - контекст переопределяемого события формы (см. КонтекстСобытияФормыСопоставленияНоменклатуры).
//  Элемент - ЭлементФормы - см. описание параметра события элемента формы.
//  ВыбранноеЗначение - Произвольный - см. описание параметра события элемента формы.
//  СтандартнаяОбработка - Булево - (возвращаемый параметр) Ложь, чтобы отключить стандартную обработку события.
//
&НаКлиенте
Процедура СобытияФорм_ЭлементФормыОбработкаВыбора(Контекст, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользуетсяТиповойИнтеграционныйМодуль() Тогда
		Возврат;
	КонецЕсли;
	
	ИМ = Модуль_ИМ();
	ИМ.ПереопределениеФорм_ЭлементФормыОбработкаВыбора(
		Контекст,
		Элемент,
		ВыбранноеЗначение,
		СтандартнаяОбработка
	);
	
КонецПроцедуры

// Контекст переопределяемого события для формы сопоставления номенклатуры.
// 
// Возвращаемое значение:
//  Структура:
//    * Форма - ФормаКлиентскогоПриложения - форма, для которой вызвано событие.
//    * Назначение - Строка - назначение формы. Допустимые значения: "СопоставлениеНоменклатуры".
//    * СтандартныйЭлемент - Строка - идентификатор стандартного элемента, для которого вызвано событие.
//                                    Допустимые значения: "Характеристика", "Упаковка".
//                         - Неопределено - событие вызвано для элемента, добавленного в переопределяемой части.
//
&НаКлиентеНаСервереБезКонтекста
Функция КонтекстСобытияФормыСопоставленияНоменклатуры()
	
	Результат = Новый Структура;
	Результат.Вставить("Форма");
	Результат.Вставить("Назначение", "СопоставлениеНоменклатуры");
	Результат.Вставить("СтандартныйЭлемент", Неопределено);
	
	Возврат Результат;
	
КонецФункции

//}		ПЕРЕОПРЕДЕЛЕНИЕ ФОРМ

&НаКлиенте
Функция ИдентификаторТекущегоПользователяСервиса() Экспорт
	
	Результат = ИдентификаторТекущегоПользователяСервисаВызовСервера();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИдентификаторТекущегоПользователяСервисаВызовСервера()
	
	Ядро = ОбработкаОбъект();
	
	Результат = Ядро.ИдентификаторТекущегоПользователяСервиса();
	
	Возврат Результат;
	
КонецФункции

//**********************************************
//{		ЦЕНТР ПОДДЕРЖКИ

&НаКлиенте
Функция Модуль_ЦентрПоддержки(ВызывающийМодуль) Экспорт
	
	ИмяМодуля = "КонтурДиадокЦентрПоддержки";
	
	Результат = СоздатьМодуль(ИмяМодуля, "ЦП_Сервис");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЦП_ОтправитьЗапрос(Запрос) Экспорт
	
	Ядро		 = ОбработкаОбъект();
	Результат	 = Ядро.ЦП_ОтправитьЗапрос(Запрос);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЦП_ЗаписатьJson(Значение) Экспорт
	
	Если ПриложениеСтаршеВерсии("8.3.6") Тогда
		Результат = ПарсерJSON_ЗаписатьВызовСервера(Значение);
	Иначе
		Результат = ПарсерJSON_Записать(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПарсерJSON_ЗаписатьВызовСервера(Значение)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ПарсерJSON_Записать(Значение);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЦП_ПрочитатьJson(Значение) Экспорт
	
	Если ПриложениеСтаршеВерсии("8.3.6") Тогда
		Результат = ПарсерJSON_ПрочитатьВызовСервера(Значение);
	Иначе
		Результат = ПарсерJSON_Прочитать(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПарсерJSON_ПрочитатьВызовСервера(Значение)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ПарсерJSON_Прочитать(Значение);
	
	Возврат Результат;
	
КонецФункции

//}		ЦЕНТР ПОДДЕРЖКИ

&НаКлиенте
Процедура ВнешнееХранение_ВыполнитьОчисткуУстаревшихДокументов() Экспорт
	
	ВнешнееХранение_ВыполнитьОчисткуУстаревшихДокументовВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ВнешнееХранение_ВыполнитьОчисткуУстаревшихДокументовВызовСервера()
	
	Ядро = ОбработкаОбъект();
	
	Ядро.ВнешнееХранение_ВыполнитьОчисткуУстаревшихДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьЗапускаФоновогоЗадания() Экспорт
	
	ПроверитьВозможностьЗапускаФоновогоЗаданияВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьЗапускаФоновогоЗаданияВызовСервера()
	
	Ядро = ОбработкаОбъект();
	
	Ядро.ПроверитьВозможностьЗапускаФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Функция Документы_ДвоичныеДанныеEntity(BoxId, LetterId, EntityId) Экспорт
	
	Результат = Документы_ДвоичныеДанныеEntityВызовСервера(BoxId, LetterId, EntityId);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ДвоичныеДанныеEntityВызовСервера(BoxId, LetterId, EntityId)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_ДвоичныеДанныеEntity(BoxId, LetterId, EntityId);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Документы_СсылкаВБраузере(Документ) Экспорт
	
	Результат = Документы_СсылкаВБраузереВызовСервера(Документ);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_СсылкаВБраузереВызовСервера(Документ)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Документы_СсылкаВБраузере(Документ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Сохранение_ПолучитьАрхивДокументооборота(Идентификаторы) Экспорт
	
	Результат = Сохранение_ПолучитьАрхивДокументооборотаВызовСервера(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Сохранение_ПолучитьАрхивДокументооборотаВызовСервера(Идентификаторы)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Сохранение_ПолучитьАрхивДокументооборота(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Пакеты_НовыйДокумент(Пакет, ТипДокумента, ТипКонтента="", ФункцияДокумента="") Экспорт
	
	Результат = Пакеты_НовыйДокументВызовСервера(
		Пакет,
		ТипДокумента,
		ТипКонтента,
		ФункцияДокумента
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Пакеты_НовыйДокументВызовСервера(Пакет, ТипДокумента, ТипКонтента, ФункцияДокумента)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Пакеты_НовыйДокумент(
		Пакет,
		ТипДокумента,
		ТипКонтента,
		ФункцияДокумента
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Пакеты_ДокументыПакетов(ИдентификаторыПакетов) Экспорт
	
	Результат = Пакеты_ДокументыПакетовВызовСервера(ИдентификаторыПакетов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Пакеты_ДокументыПакетовВызовСервера(ИдентификаторыПакетов)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Пакеты_ДокументыПакетов(ИдентификаторыПакетов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СписокДокументов_ОбновитьДанныеСтрокиПакетаНаОтправку(СтрокаСписка, ОписаниеСвязанногоПакета = Неопределено) Экспорт
	
	Результат = СписокДокументов_ОбновитьДанныеСтрокиПакетаНаОтправкуВызовСервера(СтрокаСписка, ОписаниеСвязанногоПакета);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СписокДокументов_ОбновитьДанныеСтрокиПакетаНаОтправкуВызовСервера(СтрокаСписка, ОписаниеСвязанногоПакета)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.СписокДокументов_ОбновитьДанныеСтрокиПакетаНаОтправку(СтрокаСписка, ОписаниеСвязанногоПакета);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВидыЭлектронныхСчетовНаОплату() Экспорт
	
	Результат = ВидыЭлектронныхСчетовНаОплатуВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВидыЭлектронныхСчетовНаОплатуВызовСервера()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.ВидыЭлектронныхСчетовНаОплату();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Организации_РазрешеноШифрование(BoxId) Экспорт
	
	Результат = Организации_РазрешеноШифрованиеВызовСервера(BoxId);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Организации_РазрешеноШифрованиеВызовСервера(BoxId)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.Организации_РазрешеноШифрование(BoxId);
	
	Возврат Результат;
	
КонецФункции

//}		МОДУЛИ


//**********************************************
//{		ПРОДУКТОВАЯ АНАЛИТИКА

&НаКлиенте
Функция ПродуктоваяАналитика_ПодготовитьДанные(ИдентификаторФормы) Экспорт
	
	Результат = ПродуктоваяАналитика_ПодготовитьДанныеВызовСервера(ИдентификаторФормы);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПродуктоваяАналитика_ПодготовитьДанныеВызовСервера(ИдентификаторФормы) Экспорт
	
	Ядро = РеквизитФормыВЗначение("Объект");
	
	Результат = Ядро.ПродуктоваяАналитика_ПодготовитьДанныеБезопасно(ИдентификаторФормы);
	
	Возврат Результат;
	
КонецФункции

//}		ПРОДУКТОВАЯ АНАЛИТИКА

//**********************************************
//{		ЛОГИСТИКА

// Возвращает признак доступности интеграции с Логистикой
// 
// Возвращаемое значение:
//  Булево - признак доступности интеграции с Логистикой
//
&НаКлиенте
Функция КонтурЛогистика_ИспользуетсяМодульЛогистики() Экспорт
	
	ИспользуетсяМодульЛогистики = ОбщийКонтекст_Прочитать("ИспользуетсяМодульЛогистики");
	
	Результат = (ИспользуетсяМодульЛогистики = Истина);
	
	Возврат Результат;
	
КонецФункции

// Открывает Рабочий стол модуля Логистики
//
// Параметры:
//  Период - СтандартныйПериод - Период для Рабочего стола
//
&НаКлиенте
Процедура КонтурЛогистика_ОткрытьРабочийСтол(Период) Экспорт
	
	РаботаСЛогистикой = Модуль_РаботаСЛогистикой(ЭтаФорма);
	
	ТекстОшибки = РаботаСЛогистикой.ОткрытьРабочийСтол(Период);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Действие = Метрика_НазваниеДействий().ПереходВРабочийСтол;
		КонтурЛогистика_ОбработатьОшибкуВызовСервера(Действие, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму с перевозочными документами
//
// Параметры:
//  ФормаВызова		 - Форма	 - Форма, из которой происходит вызов
//  ДокументыУчета	 - Массив	 - Коллекция ссылок на учетные документы пакета
//
&НаКлиенте
Процедура КонтурЛогистика_ОткрытьПеревозочныеДокументы(ФормаВызова, ДокументыУчета) Экспорт
	
	РаботаСЛогистикой = Модуль_РаботаСЛогистикой(ЭтаФорма);
	
	ТекстОшибки = РаботаСЛогистикой.ОткрытьПеревозочныеДокументы(ФормаВызова, ДокументыУчета);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Действие = Метрика_НазваниеДействий().ПереходВСвязанныеДокументы;
		КонтурЛогистика_ОбработатьОшибкуВызовСервера(Действие, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КонтурЛогистика_ОбработатьОшибкуВызовСервера(Действие, ТекстОшибки)
	
	Ядро = ОбработкаОбъект();
	
	Ядро.КонтурЛогистика_ОбработатьОшибку(Действие, ТекстОшибки);
	
КонецПроцедуры

//}		ЛОГИСТИКА