//@strict-types
//@skip-check bsl-variable-name-invalid
//@skip-check method-too-many-params

////////////////////////////////////////////////////////////////////////////////
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Описание переменных

Перем КоннекторСтдСтрЛок; // ОбработкаОбъект.КоннекторСтдСтр

//////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс

////////////////////////////////////////////////////////////////////////////////
// ЧтениеДанных

// Конструктор ЧтениеДанных.
//  На основании двоичных данных, имени файла или потока (структура типа Поток).
//
// Параметры:
//  ДвоичныеДанныеИмяФайлаСтруктураПоток - ДвоичныеДанные, Строка, Структура: см. СтруктураПоток - Структура типа Поток
//  Двоичные данные или Путь к файлу.
//  Кодировка							 - Строка, КодировкаТекста, Неопределено - Кодировка текста
//  ПорядокБайтов						 - Строка, Неопределено					 - Порядок байтов. BigEndian или LittleEndian
//  РазделительСтрок					 - Строка, Неопределено					 - Разделитель строк
//  КонвертируемыйРазделительСтрок		 - Строка, Неопределено					 - Конвертируемый разделитель строк
// 
// Возвращаемое значение:
//  Структура: См. СтруктураЧтениеДанных - Новый чтение данных
//
Функция ЧтениеДанных(Знач ДвоичныеДанныеИмяФайлаСтруктураПоток, Кодировка = Неопределено,
	ПорядокБайтов = Неопределено, РазделительСтрок = Неопределено, КонвертируемыйРазделительСтрок = Неопределено) Экспорт
	
	Если ТипЗнч(ДвоичныеДанныеИмяФайлаСтруктураПоток) = Тип("ДвоичныеДанные") Тогда
		
		// двоичные данные
		_ИсходныйПоток = СтруктураПоток();
		_ИсходныйПоток._ПредставлениеДвоичныхДанных = ПолучитьПредставлениеДвоичныхДанных(
			ДвоичныеДанныеИмяФайлаСтруктураПоток);
			
	ИначеЕсли ТипЗнч(ДвоичныеДанныеИмяФайлаСтруктураПоток) = Тип("Строка") Тогда
		
		// имя файла
		Попытка
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ДвоичныеДанныеИмяФайлаСтруктураПоток);
			
		Исключение ВызватьИсключение
			КоннекторСтдСтрЛок().ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Ошибка отрытия файла %1 %2'"),
				ДвоичныеДанныеИмяФайлаСтруктураПоток,
				ОписаниеОшибки()
			);
			
		КонецПопытки;
		
		_ИсходныйПоток = СтруктураПоток();
		_ИсходныйПоток._ПредставлениеДвоичныхДанных = ПолучитьПредставлениеДвоичныхДанных(ДвоичныеДанные);
			
	ИначеЕсли ТипЗнч(ДвоичныеДанныеИмяФайлаСтруктураПоток) = Тип("Структура")
		И ДвоичныеДанныеИмяФайлаСтруктураПоток.Свойство("ТипЗнч")
		И ДвоичныеДанныеИмяФайлаСтруктураПоток["ТипЗнч"] = "Поток" Тогда
			
		// Структура типа Поток
		_ИсходныйПоток = СтруктураПоток();
		ЗаполнитьЗначенияСвойств(_ИсходныйПоток, ДвоичныеДанныеИмяФайлаСтруктураПоток);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Несоответствие типа параметра ДвоичныеДанныеИмяФайлаСтруктураПоток'");
		
	КонецЕсли;

	СтруктураЧтениеДанных = СтруктураЧтениеДанных();
	СтруктураЧтениеДанных.КодировкаТекста = ЕстьНеопределено(Кодировка, СтруктураЧтениеДанных.КодировкаТекста);
	СтруктураЧтениеДанных.ПорядокБайтов = ЕстьНеопределено(ПорядокБайтов, СтруктураЧтениеДанных.ПорядокБайтов);
	СтруктураЧтениеДанных.РазделительСтрок = ЕстьНеопределено(РазделительСтрок, СтруктураЧтениеДанных.РазделительСтрок);
	СтруктураЧтениеДанных.КонвертируемыйРазделительСтрок = ЕстьНеопределено(КонвертируемыйРазделительСтрок,
		СтруктураЧтениеДанных.КонвертируемыйРазделительСтрок);
	СтруктураЧтениеДанных._ИсходныйПоток = _ИсходныйПоток;
	
	Возврат СтруктураЧтениеДанных;
	
КонецФункции

// Чтение данных. Прочитать байт.
//  Выполняет чтение одного байта из потока.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
// 
// Возвращаемое значение:
//  Число, Неопределено - Значение байта в десятичном исчислении или Неопределено если конец потока
//
Функция ПрочитатьБайтЧтениеДанных(СтруктураЧтениеДанных) Экспорт
	
	Возврат ПрочитатьЦелоеЧтениеДанных(СтруктураЧтениеДанных, 1);
	
КонецФункции

// Чтение данных. Прочитать целое 16 бит.
//  Считывает 16-битное целое число из потока.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian
//  	Если не задан берется из текущего экземпляра СтруктураЧтениеДанных.
// 
// Возвращаемое значение:
//  Число, Неопределено - Значение байта в десятичном исчислении или Неопределено если конец потока
//
Функция ПрочитатьЦелое16ЧтениеДанных(СтруктураЧтениеДанных, ПорядокБайтов = Неопределено) Экспорт
	
	Возврат ПрочитатьЦелоеЧтениеДанных(СтруктураЧтениеДанных, 2, ПорядокБайтов);
	
КонецФункции

// Чтение данных. Прочитать целое 32 бит.
//  Считывает 32-битное целое число из потока.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian
//  	Если не задан берется из текущего экземпляра СтруктураЧтениеДанных.
// 
// Возвращаемое значение:
//  Число, Неопределено - Значение байта в десятичном исчислении или Неопределено если конец потока
//
Функция ПрочитатьЦелое32ЧтениеДанных(СтруктураЧтениеДанных, ПорядокБайтов = Неопределено) Экспорт
	
	Возврат ПрочитатьЦелоеЧтениеДанных(СтруктураЧтениеДанных, 4, ПорядокБайтов);
	
КонецФункции

// Чтение данных. Прочитать целое 64 бит.
//  Считывает 64-битное целое число из потока.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian
//  	Если не задан берется из текущего экземпляра СтруктураЧтениеДанных.
// 
// Возвращаемое значение:
//  Число, Неопределено - Значение байта в десятичном исчислении или Неопределено если конец потока
//
Функция ПрочитатьЦелое64ЧтениеДанных(СтруктураЧтениеДанных, ПорядокБайтов = Неопределено) Экспорт
	
	Возврат ПрочитатьЦелоеЧтениеДанных(СтруктураЧтениеДанных, 8, ПорядокБайтов);
	
КонецФункции

// Чтение данных. Пропустить.
//  Пропускает при чтении указанное количество байтов в потоке.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
//  Количество				 - Число	 - Количество байтов, которые требуется пропустить.
// 
// Возвращаемое значение:
//  Число - Количество фактически пропущенных данных.
//
Функция ПропуститьЧтениеДанных(СтруктураЧтениеДанных, Количество) Экспорт
	
	ИсходныйПоток = ИсходныйПотокЧтениеДанных(СтруктураЧтениеДанных);
	
	Возврат ПерейтиПоток(ИсходныйПоток, Количество);
	
КонецФункции

// Чтение данных. Исходный поток.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
// 
// Возвращаемое значение:
//  Структура: См. СтруктураПоток - Структура типа Поток
//
Функция ИсходныйПотокЧтениеДанных(СтруктураЧтениеДанных) Экспорт
	
	Возврат СтруктураЧтениеДанных._ИсходныйПоток;
	
КонецФункции

// Чтение данных. КопироватьВ.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
//  ПотокЗаписьДанных		 - Структура: См. СтруктураПоток - ПотокЗаписьДанных или ЗаписьДанных.
//  Количество				 - Число, Неопределено	 - Количество байтов, которые необходимо скопировать
//  	Если не задано, будут скопированы все данные до конца потока.
// 
// Возвращаемое значение:
//  Число - Фактически записанное количество байтов.
//
Функция КопироватьВЧтениеДанных(СтруктураЧтениеДанных, ПотокЗаписьДанных, Знач Количество = Неопределено) Экспорт
	
	БайтСкопировано = Неопределено;
	
	Если ТипЗнч(ПотокЗаписьДанных) = Тип("Структура") И ПотокЗаписьДанных.Свойство("ТипЗнч") Тогда
		
		Если ПотокЗаписьДанных["ТипЗнч"] = "Поток" Или ПотокЗаписьДанных["ТипЗнч"] = "ЗаписьДанных" Тогда
			
			Если ПотокЗаписьДанных["ТипЗнч"] = "Поток" Тогда
				
				// Структура типа Поток
				ПотокДляИзменения = ПотокЗаписьДанных;
				
			ИначеЕсли ПотокЗаписьДанных["ТипЗнч"] = "ЗаписьДанных" Тогда
				
				// Структура типа ЗаписьДанных
				ПотокДляИзменения = ЦелевойПотокЗаписьДанных(ПотокЗаписьДанных);
				
			КонецЕсли;
			
			ИсходныйПотокЧтенияДанных = ИсходныйПотокЧтениеДанных(СтруктураЧтениеДанных);
			
			Если Количество = Неопределено Тогда
				
				ПотокДляИзменения._ПредставлениеДвоичныхДанных = ПотокДляИзменения._ПредставлениеДвоичныхДанных
					+ Сред(ИсходныйПотокЧтенияДанных._ПредставлениеДвоичныхДанных,
						ТекущаяПозицияПоток(ИсходныйПотокЧтенияДанных) * 2 + 1
				);
				
				ПерейтиПоток(ИсходныйПотокЧтенияДанных, РазмерПотока(ИсходныйПотокЧтенияДанных));
				ПерейтиПоток(ПотокДляИзменения, РазмерПотока(ПотокДляИзменения));
				
			Иначе
				
				ПотокДляИзменения._ПредставлениеДвоичныхДанных = ПотокДляИзменения._ПредставлениеДвоичныхДанных
					+ Сред(ИсходныйПотокЧтенияДанных._ПредставлениеДвоичныхДанных,
						ТекущаяПозицияПоток(ИсходныйПотокЧтенияДанных) * 2 + 1, Количество * 2);
					
				ПерейтиПоток(ИсходныйПотокЧтенияДанных, Количество);
				ПерейтиПоток(ПотокДляИзменения, Количество);
				
			КонецЕсли;
			
			БайтСкопировано = РазмерПотока(ПотокДляИзменения);
			
		Иначе
			
			ВызватьИсключение НСтр("ru = 'Несоответствие типа параметра ПотокЗаписьДанных'");
			
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Несоответствие типа параметра ПотокЗаписьДанных'");
		
	КонецЕсли;

	Возврат БайтСкопировано;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЗаписьДанных

// Конструктор ЗаписьДанных.
//  На основании двоичных данных или имени файла.
//
// Параметры:
//  ИмяФайлаСтруктураПоток			 - Строка, Структура: См. СтруктураПоток- Путь к файлу или Структура типа Поток.
//  Кодировка						 - Строка, КодировкаТекста, Неопределено - Кодировка текста
//  ПорядокБайтов					 - Строка, Неопределено					 - Порядок байтов. BigEndian или LittleEndian
//  РазделительСтрок				 - Строка, Неопределено					 - Разделитель строк
//  КонвертируемыйРазделительСтрок	 - Строка, Неопределено					 - Конвертируемый разделитель строк
//  ЗаписатьBOM						 - Булево								 - Записать BOM
// 
// Возвращаемое значение:
//  Структура: См. СтруктураЗаписьДанных - Новый запись данных
//
Функция ЗаписьДанных(Знач ИмяФайлаСтруктураПоток, Кодировка = Неопределено, ПорядокБайтов = Неопределено,
	РазделительСтрок = Неопределено, КонвертируемыйРазделительСтрок = Неопределено, ЗаписатьBOM = Ложь) Экспорт

	_ИмяФайла = "";
	
	Если ТипЗнч(ИмяФайлаСтруктураПоток) = Тип("Строка") Тогда
		
		// имя файла
		Попытка
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаСтруктураПоток);
			
		Исключение
			
			ВызватьИсключение КоннекторСтдСтрЛок().ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Ошибка отрытия файла %1 %2'"),
				ИмяФайлаСтруктураПоток,
				ОписаниеОшибки()
			);
			
		КонецПопытки;
		
		_ИмяФайла = ИмяФайлаСтруктураПоток;
		_ЦелевойПоток = СтруктураПоток();
		_ЦелевойПоток._ПредставлениеДвоичныхДанных = ПолучитьПредставлениеДвоичныхДанных(ДвоичныеДанные);
		
	ИначеЕсли ТипЗнч(ИмяФайлаСтруктураПоток) = Тип("Структура")
		И ИмяФайлаСтруктураПоток.Свойство("ТипЗнч")
		И ИмяФайлаСтруктураПоток["ТипЗнч"] = "Поток" Тогда
			
		// Структура типа Поток
		_ЦелевойПоток = ИмяФайлаСтруктураПоток;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Несоответствие типа параметра ИмяФайлаСтруктураПоток'");
		
	КонецЕсли;

	СтруктураЗаписьДанных = СтруктураЗаписьДанных();
	СтруктураЗаписьДанных.КодировкаТекста = ЕстьНеопределено(Кодировка, СтруктураЗаписьДанных.КодировкаТекста);
	СтруктураЗаписьДанных.ПорядокБайтов = ЕстьНеопределено(ПорядокБайтов, СтруктураЗаписьДанных.ПорядокБайтов);
	СтруктураЗаписьДанных.РазделительСтрок = ЕстьНеопределено(РазделительСтрок, СтруктураЗаписьДанных.РазделительСтрок);
	СтруктураЗаписьДанных.КонвертируемыйРазделительСтрок = ЕстьНеопределено(КонвертируемыйРазделительСтрок,
		СтруктураЗаписьДанных.КонвертируемыйРазделительСтрок);
	СтруктураЗаписьДанных.ЗаписатьBOM = ЕстьНеопределено(ЗаписатьBOM, СтруктураЗаписьДанных.ЗаписатьBOM);

	СтруктураЗаписьДанных._ИмяФайла= _ИмяФайла;
	СтруктураЗаписьДанных._ЦелевойПоток = _ЦелевойПоток;

	Возврат СтруктураЗаписьДанных;
	
КонецФункции

// Запись данных. Целевой поток.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных -
// 
// Возвращаемое значение:
//  Структура: См. СтруктураПоток - Структура типа Поток
//
Функция ЦелевойПотокЗаписьДанных(СтруктураЗаписьДанных) Экспорт
	
	Возврат СтруктураЗаписьДанных._ЦелевойПоток;
	
КонецФункции

// Запись данных. Записать байт.
//  Выполняет запись одного байта в поток.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  Байт					 - Число	 - Целое число, которое будет записано в целевой поток.
//  	Значение числа должно находиться в диапазоне от 0 до 255.
//
Процедура ЗаписатьБайтЗаписьДанных(СтруктураЗаписьДанных, Байт) Экспорт
	
	ЗаписатьЦелоеЗаписьДанных(СтруктураЗаписьДанных, Байт, 1);
	
КонецПроцедуры

// Запись данных. Записать Целое16.
//  Выполняет запись Целое16 в поток.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  Целое16					 - Число	 - Целое число, которое будет записано в целевой поток.
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian
//  	Если не задан берется из текущего экземпляра СтруктураЗаписьДанных.
//
Процедура ЗаписатьЦелое16ЗаписьДанных(СтруктураЗаписьДанных, Целое16, ПорядокБайтов = Неопределено) Экспорт
	
	ЗаписатьЦелоеЗаписьДанных(СтруктураЗаписьДанных, Целое16, 2, ПорядокБайтов);
	
КонецПроцедуры

// Запись данных. Записать Целое32.
//  Выполняет запись Целое32 в поток.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  Целое32					 - Число	 - Целое число, которое будет записано в целевой поток.
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian
//  	Если не задан берется из текущего экземпляра СтруктураЗаписьДанных.
//
Процедура ЗаписатьЦелое32ЗаписьДанных(СтруктураЗаписьДанных, Целое32, ПорядокБайтов = Неопределено) Экспорт
	
	ЗаписатьЦелоеЗаписьДанных(СтруктураЗаписьДанных, Целое32, 4, ПорядокБайтов);
	
КонецПроцедуры

// Запись данных. Записать Целое64.
//  Выполняет запись одного байта в поток.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  Целое64					 - Число	 - Целое число, которое будет записано в целевой поток.
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian
//  	Если не задан берется из текущего экземпляра СтруктураЗаписьДанных.
//
Процедура ЗаписатьЦелое64ЗаписьДанных(СтруктураЗаписьДанных, Целое64, ПорядокБайтов = Неопределено) Экспорт
	
	ЗаписатьЦелоеЗаписьДанных(СтруктураЗаписьДанных, Целое64, 8, ПорядокБайтов);
	
КонецПроцедуры

// Запись данных. Записать строку.
//  Записывает строку в целевой поток.
//  Сначала записываются все символы строки, затем - разделитель строк.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  СтрокаДляЗаписи			 - Строка						 - Строка, которая будет записана в поток.
//  КодировкаТекста			 - Строка, КодировкаТекста, Неопределено - Определяет кодировку текста для записи строки.
//  Если не установлена, используется кодировка, заданная для данного объекта ЗаписьДанных.
//  РазделительСтрок		 - Строка, Неопределено					 - Указывает строку, являющуюся разделителем строк в потоке после записи
//  					символов строк. Если параметр не указан, используется разделитель строк, указанный для текущего экземпляра объекта
//  					ЗаписьДанных.
//
Процедура ЗаписатьСтрокуЗаписьДанных(СтруктураЗаписьДанных, Знач СтрокаДляЗаписи, Знач КодировкаТекста = Неопределено,
	Знач РазделительСтрок = Неопределено) Экспорт

	КодировкаТекста = ЕстьНеопределено(КодировкаТекста, СтруктураЗаписьДанных.КодировкаТекста);
	РазделительСтрок = ЕстьНеопределено(РазделительСтрок, СтруктураЗаписьДанных.РазделительСтрок);

	СтрокаДляЗаписи = СтрокаДляЗаписи + РазделительСтрок;
	
	Если Не СтруктураЗаписьДанных.КонвертируемыйРазделительСтрок = "" Тогда
		
		СтрокаДляЗаписи = СтрЗаменить(СтрокаДляЗаписи, Символы.ПС, СтруктураЗаписьДанных.КонвертируемыйРазделительСтрок);
		
	КонецЕсли;

	ЦелевойПоток = ЦелевойПотокЗаписьДанных(СтруктураЗаписьДанных);

	ЦелевойПоток._ПредставлениеДвоичныхДанных = ЦелевойПоток._ПредставлениеДвоичныхДанных
		+ ПолучитьПредставлениеДвоичныхДанных(ПолучитьДвоичныеДанныеИзСтрокиЛок(СтрокаДляЗаписи, КодировкаТекста, Ложь));
	ПерейтиПоток(ЦелевойПоток, РазмерПотока(ЦелевойПоток));
	
КонецПроцедуры

// Запись данных. Записать Символы.
//  Записывает символы заданной строки в целевой поток.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  СтрокаДляЗаписи			 - Строка						 - Строка, которая будет записана в поток.
//  КодировкаТекста			 - Строка, КодировкаТекста, Неопределено - Определяет кодировку текста для записи строки.
//  Если не установлена, используется кодировка, заданная для данного объекта ЗаписьДанных.
//
Процедура ЗаписатьСимволыЗаписьДанных(СтруктураЗаписьДанных, СтрокаДляЗаписи, Знач КодировкаТекста = Неопределено) Экспорт
	
	ЗаписатьСтрокуЗаписьДанных(СтруктураЗаписьДанных, СтрокаДляЗаписи, КодировкаТекста, "");
	
КонецПроцедуры

// Запись данных. Записать.
//  Записывает в поток данные из объекта типа ДвоичныеДанные.
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  ДвоичныеДанные			 - ДвоичныеДанные	 - ДвоичныеДанные, которые будет записаны в поток.
//
Процедура ЗаписатьЗаписьДанных(СтруктураЗаписьДанных, Знач ДвоичныеДанные) Экспорт

	ЦелевойПоток = ЦелевойПотокЗаписьДанных(СтруктураЗаписьДанных);

	ЦелевойПоток._ПредставлениеДвоичныхДанных = ЦелевойПоток._ПредставлениеДвоичныхДанных
		+ ПолучитьПредставлениеДвоичныхДанных(ДвоичныеДанные);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поток

// Конструктор Поток.
// 
// Возвращаемое значение:
//  Структура: См. СтруктураПоток- Структура типа Поток
//
Функция Поток() Экспорт

	СтруктураПоток = СтруктураПоток();
//	Если НачальнаяЕмкость > 0 Тогда
//		СтруктураПоток._ПредставлениеДвоичныхДанных = ПолучитьСтрокуНулевыхБайт(НачальнаяЕмкость);
//	Иначе
	СтруктураПоток._ПредставлениеДвоичныхДанных = "";
//	КонецЕсли;

	Возврат СтруктураПоток;
	
КонецФункции

// Поток. Получить размер потока.
//  Получает размер данных в байтах.
//
// Параметры:
//  СтруктураПоток	 - Структура: См. СтруктураПоток- Структура типа Поток
// 
// Возвращаемое значение:
//  Число - Размер данных байт.
//
Функция РазмерПотока(СтруктураПоток) Экспорт
	
	Возврат СтрДлина(СтруктураПоток._ПредставлениеДвоичныхДанных) / 2;
	
КонецФункции

//// Поток. Установить размер потока.
//// Устанавливает размер потока.
//// Если текущий размер превышает заданный, поток будет сокращен
//// до заданного размера, а информация, превышающая заданный размер, будет потеряна.
//// Если текущий размер потока меньше заданного, то содержимое потока между старым и новым размером не определено.
//// 
//// Параметры:
////  СтруктураПоток - Структура: См. СтруктураПоток - Структура типа Поток
////  Размер - Число - Новый размер потока
//Процедура УстановитьРазмерПотока(СтруктураПоток, Размер) Экспорт
//	РазмерПотока = РазмерПотока(СтруктураПоток);
//	Если Размер > РазмерПотока Тогда
//		СтруктураПоток._ПредставлениеДвоичныхДанных = СтруктураПоток._ПредставлениеДвоичныхДанных
//			+ ПолучитьСтрокуНулевыхБайт(Размер - РазмерПотока);
//	Иначе
//		СтруктураПоток._ПредставлениеДвоичныхДанных = Сред(СтруктураПоток._ПредставлениеДвоичныхДанных, 1, Размер * 2);
//	КонецЕсли;
//КонецПроцедуры

// Поток. Текущая позиция.
//  Возвращает текущую позицию в потоке.
//
// Параметры:
//  СтруктураПоток	 - Структура: См. СтруктураПоток- Структура типа Поток
// 
// Возвращаемое значение:
//  Число - текущая позиция в потоке.
//
Функция ТекущаяПозицияПоток(СтруктураПоток) Экспорт
	
	Возврат СтруктураПоток.ТекущаяПозиция;
	
КонецФункции

// Поток. Закрыть и получить двоичные данные потока.
//  Возвращает экземпляр объекта ДвоичныеДанные, содержащего данные, записанные в поток.
//
// Параметры:
//  СтруктураПоток	 - Структура: См. СтруктураПоток - Структура типа Поток
// 
// Возвращаемое значение:
//  ДвоичныеДанные - экземпляр объекта ДвоичныеДанные, содержащего данные, записанные в поток.
//
Функция ЗакрытьИПолучитьДвоичныеДанныеПоток(СтруктураПоток) Экспорт
	
	ДвоичныеДанныеПотока = ПолучитьЗначениеДвоичныхДанных(СтруктураПоток._ПредставлениеДвоичныхДанных);
	СтруктураПоток = Неопределено;
	
	Возврат ДвоичныеДанныеПотока;
	
КонецФункции

// Поток. Перейти.
//  Возвращает текущую позицию в потоке.
//
// Параметры:
//  СтруктураПоток	 - Структура: См. СтруктураПоток - Структура типа Поток
//  Смещение		 - Число				 - Количество байтов, на которое нужно передвинуть позицию в потоке.
//  НачальнаяПозиция - Число, Неопределено	 - Начальная позиция, от которой отсчитывается смещение.
// 
// Возвращаемое значение:
//  Число - Новая позиция в потоке.
//
Функция ПерейтиПоток(СтруктураПоток, Смещение, НачальнаяПозиция = Неопределено) Экспорт
	
	// TODO: реализовать НачальнаяПозиция, отрицательное смещение, проверку на выход за пределы потока
	РазмерПотока = РазмерПотока(СтруктураПоток);
	ТекущаяПозицияПотока = ТекущаяПозицияПоток(СтруктураПоток);
	ОсталосьБайтов = РазмерПотока - ТекущаяПозицияПотока;
	
	Если Смещение > ОсталосьБайтов Тогда
		
		СтруктураПоток.ТекущаяПозиция = РазмерПотока;
		
	Иначе
		
		СтруктураПоток.ТекущаяПозиция = СтруктураПоток.ТекущаяПозиция + Смещение;
		
	КонецЕсли;

	Возврат СтруктураПоток.ТекущаяПозиция;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

// Получить двоичные данные из строки.
//
// Параметры:
//  ВходящаяСтрока	 - Строка							 - Входящая строка
//  Кодировка		 - Строка, КодировкаТекста, Неопределено - Кодировка текста
//  ЗаписатьBOM		 - Булево, Неопределено					 - Записать BOM
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Двоичные данные из строки
//
Функция ПолучитьДвоичныеДанныеИзСтрокиЛок(ВходящаяСтрока, Знач Кодировка = "UTF-8", Знач ЗаписатьBOM = Ложь) Экспорт

	Кодировка = ЕстьНеопределено(Кодировка, "UTF-8");
	ЗаписатьBOM = ЕстьНеопределено(ЗаписатьBOM, Ложь);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();

	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, Кодировка, , , "");

	ЗаписьТекста.Записать(ВходящаяСтрока);
	ЗаписьТекста.Закрыть();

	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);

	Попытка
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	Исключение
		
		;
		
	КонецПопытки;

	Если Не ЗаписатьBOM Тогда
		
		// обрезание BOM
		Если Кодировка = "UTF-8" Или Кодировка = КодировкаТекста.UTF8 Тогда

			ПотокБезBOM = Поток();
			Запись = ЗаписьДанных(ПотокБезBOM);

			Чтение = ЧтениеДанных(ДвоичныеДанные);
			ПропуститьЧтениеДанных(Чтение, 3);
			КопироватьВЧтениеДанных(Чтение, Запись);
			
			ДвоичныеДанные = ЗакрытьИПолучитьДвоичныеДанныеПоток(ПотокБезBOM);

		ИначеЕсли Кодировка = "UTF-16"
			Или Кодировка = "UTF-16BE"
			Или Кодировка = "UTF-16LE"
			Или Кодировка = КодировкаТекста.UTF16 Тогда
				
			ПотокБезBOM = Поток();
			Запись = ЗаписьДанных(ПотокБезBOM);

			Чтение = ЧтениеДанных(ДвоичныеДанные);
			ПропуститьЧтениеДанных(Чтение, 2);
			КопироватьВЧтениеДанных(Чтение, Запись);
			
			ДвоичныеДанные = ЗакрытьИПолучитьДвоичныеДанныеПоток(ПотокБезBOM);

		ИначеЕсли Кодировка = "UTF-32"
			Или Кодировка = "UTF-32BE"
			Или Кодировка = "UTF-32LE" Тогда
				
			ПотокБезBOM = Поток();
			Запись = ЗаписьДанных(ПотокБезBOM);

			Чтение = ЧтениеДанных(ДвоичныеДанные);
			ПропуститьЧтениеДанных(Чтение, 4);
			КопироватьВЧтениеДанных(Чтение, Запись);
			
			ДвоичныеДанные = ЗакрытьИПолучитьДвоичныеДанныеПоток(ПотокБезBOM);

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Получить строку из двоичных данных.
//
// Параметры:
//  ВходящиеДвоичныеДанные	 - ДвоичныеДанные			 - Входящие Двоичные данные
//  Кодировка				 - Строка, КодировкаТекста, Неопределено - Кодировка текста файла
// 
// Возвращаемое значение:
//  Строка - Строка из двоичных данных
//
Функция ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Знач Кодировка = "UTF-8") Экспорт

	Кодировка = ЕстьНеопределено(Кодировка, "UTF-8");

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();

	ВходящиеДвоичныеДанные.Записать(ИмяВременногоФайла);

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, Кодировка, "");

	Попытка
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	Исключение
		
		;
		
	КонецПопытки;

	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

// Получить двоичные данные из строки в памяти (без временного файла).
//
// Параметры:
//  ВходящаяСтрока	 - Строка							 - Входящая строка
//  Кодировка		 - Строка, КодировкаТекста, Неопределено - Кодировка текста
//  ЗаписатьBOM		 - Булево, Неопределено					 - Записать BOM
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Двоичные данные из строки
//
Функция ПолучитьДвоичныеДанныеИзСтрокиВПамятиЛок(ВходящаяСтрока, Кодировка = "UTF-8", ЗаписатьBOM = Ложь) Экспорт

	Запрос = Новый HTTPЗапрос;

	Если Не ЗаписатьBOM И (Кодировка = "UTF-8" Или Кодировка = КодировкаТекста.UTF8) Тогда
		
		Запрос.УстановитьТелоИзСтроки(ВходящаяСтрока, "CESU-8");
		
	Иначе
		
		Запрос.УстановитьТелоИзСтроки(ВходящаяСтрока, Кодировка);
		
	КонецЕсли;

	Возврат Запрос.ПолучитьТелоКакДвоичныеДанные();

КонецФункции

// Получить строку из двоичных данных в памяти (без временного файла).
//
// Параметры:
//  ВходящиеДвоичныеДанные	 - ДвоичныеДанные			 - Входящие Двоичные данные
//  Кодировка				 - Строка, КодировкаТекста, Неопределено - Кодировка текста файла
// 
// Возвращаемое значение:
//  Строка - Строка из двоичных данных
//
Функция ПолучитьСтрокуИзДвоичныхДанныхВПамятиЛок(ВходящиеДвоичныеДанные, Знач Кодировка = "UTF-8") Экспорт
	
	Запрос = Новый HTTPЗапрос;
	Запрос.УстановитьТелоИзДвоичныхДанных(ВходящиеДвоичныеДанные);
	
	Возврат Запрос.ПолучитьТелоКакСтроку();
	
КонецФункции

// Получить представление двоичных данных.
//
// Параметры:
//  ДвоичныеДанные	 - ДвоичныеДанные	 - Двоичные данные
// 
// Возвращаемое значение:
//  Строка - Представление двоичных данных. Строка с HEX значениями
//
Функция ПолучитьПредставлениеДвоичныхДанных(Знач ДвоичныеДанные) Экспорт
	
	ЗначениеXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "hexBinary"), ДвоичныеДанные);
	
	Возврат ЗначениеXDTO.ЛексическоеЗначение;
	
КонецФункции

// Получить значение двоичных данных.
//
// Параметры:
//  ПредставлениеДвоичныхДанных	 - Строка	 - Представление двоичных данных. Строка с HEX значениями
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Получить значение двоичных данных
//
Функция ПолучитьЗначениеДвоичныхДанных(Знач ПредставлениеДвоичныхДанных) Экспорт
	
	ЗначениеXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "hexBinary"),
		ПредставлениеДвоичныхДанных);

	Возврат ЗначениеXDTO.Значение;
	
КонецФункции

// Шестнадцатиричное представление в десятичное число.
//
// Параметры:
//  Hex	 - Строка	 - Шестнадцатиричное представление числа LittleEndian
// 
// Возвращаемое значение:
//  Число - Десятичное число
//
Функция Hex2Dec(Знач Hex) Экспорт
	
	Hex = ВРег(Hex);

	Dec = 0;
	Длина = СтрДлина(Hex);
	
	Для Инд = 1 По Длина Цикл
		
		Число10 = Найти("0123456789ABCDEF", Сред(Hex, Инд, 1)) - 1;
		
		Если Число10 >= 0 И Число10 <= 15 Тогда
			
			Dec = Dec + Число10 * Pow(16, Длина - Инд);
			
		Иначе
			
			ВызватьИсключение КоннекторСтдСтрЛок().ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Ошибка перевода в десятичную систему исчисления шеcтнадцатиричного числа %1'"),
				Hex
			);
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Dec;
	
КонецФункции

// Десятичное число в шестнадцатиричное представлении по умолчанию в BigEndian.
//
// Параметры:
//  Dec			 - Число				 - Десятичное число
//  Разрядность	 - Число, Неопределено	 - Разрядность результирующего числа
//  LittleEndian - Булево				 - Представить в формате LittleEndian
// 
// Возвращаемое значение:
//  Строка - шестнадцатиричное представление. Дополняется 0 слева до Разрядность если задано
//
Функция Dec2Hex(Знач Dec, Знач Разрядность = Неопределено, LittleEndian = Ложь) Экспорт
	
	Hex = ИзДесятичнойВДругуюСистемуИсчисления(Dec, 16);

	Если Не Разрядность = Неопределено Тогда
		
		Если СтрДлина(Hex) < Разрядность Тогда
			
			Hex = КоннекторСтдСтрЛок().ДополнитьСтрокуЛок(Hex, Разрядность, "0", "Слева");
			
		ИначеЕсли СтрДлина(Hex) > Разрядность Тогда
			
			ВызватьИсключение КоннекторСтдСтрЛок().ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Переполнение при преобразовании числа %1 в 0x%2 разрядность больше %3'"),
				ПолучитьПредставлениеЧислаЛок(Dec),
				Hex,
				ПолучитьПредставлениеЧислаЛок(Разрядность)
			);
			
		КонецЕсли;
		
	КонецЕсли;

	Если LittleEndian Тогда
		
		Hex = РазвернутьПобайтно(Hex);
		
	КонецЕсли;

	Возврат Hex;
	
КонецФункции

// Из десятичного в другую систему
//
// Параметры:
//  Число10	 - Число - целое число в 10-ной системе
//  База	 - Число - целое число от 2 до 36 (16 для шестнадцатиричной)
// 
// Возвращаемое значение:
//  Строка - представление числа в системе исччисления База
//
Функция ИзДесятичнойВДругуюСистемуИсчисления(Знач Число10, Знач База) Экспорт
	
	ЧислоВСистемеИсчисления = "";
	
	Если База < 2 Или База > 36 Тогда
		
		ВызватьИсключение НСтр("ru = 'Ошибка перевода в другую систему исчисления.
		|База должна быть в диапазоне 2-36'");
		
	КонецЕсли;
	
	СтрокаСимволов = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";

	Если Число10 > База - 1 Тогда
		
		Считать	= Истина;
		
		Пока Считать Цикл
			
			Остаток = Число10 % База;
			Число10 = Цел(Число10 / База);
			ОстатокСтрокойБаза = Сред(СтрокаСимволов, Остаток + 1, 1);
			ЧислоВСистемеИсчисления = ОстатокСтрокойБаза + ЧислоВСистемеИсчисления;
			
			Если Число10 <= База - 1 Тогда
				
				Считать = Ложь;
				ЧислоВСистемеИсчисления = Сред(СтрокаСимволов, Число10 + 1, 1) + ЧислоВСистемеИсчисления;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ЧислоВСистемеИсчисления = Сред(СтрокаСимволов, Число10 + 1, 1);
		
	КонецЕсли;

	Возврат ЧислоВСистемеИсчисления;
	
КонецФункции

// Получить число по битам
//
// Параметры:
//  ЦелоеЧисло		 - Число	 - Число от 0 до 2^Битность
//  	(Не проверяется. Ориентироваться на ФлагПереполнения).
//  Разрядность		 - Число	 - Разрядность числа в двоичном представлении (сколько бит надо получить).
//  	По умолчанию 8 (один байт).
//  ФлагПереполнения - Булево	 - Флаг переполнения.
//  	Устанавливает Истина, если число больше 2^Битность.
// 
// Возвращаемое значение:
//  Массив из Булево - Индекс массива - номера бита и значение - значение бита
//
Функция ПолучитьЧислоПоБитам(Знач ЦелоеЧисло, Знач Разрядность = 8, ФлагПереполнения = Ложь) Экспорт
	
	МассивБитыЧисла = Новый Массив; // массив из булево
	
	Для Индекс = 0 По Разрядность - 1 Цикл
		
		МассивБитыЧисла.Добавить(Булево(ЦелоеЧисло % 2));
		ЦелоеЧисло	= Цел(ЦелоеЧисло / 2);
		
	КонецЦикла;

	ФлагПереполнения = ЦелоеЧисло > 0;

	Возврат МассивБитыЧисла;
	
КонецФункции

// Побитовое исключающее ИЛИ. Меняет значения в массиве Итог
//
// Параметры:
//  Параметр1	 - Массив из Булево -
//  Параметр2	 - Массив из Булево -
//  Итог		 - 	Массив из Булево -
//
Процедура _XOR(Параметр1, Параметр2, Итог) Экспорт
	
	Для Инд = 0 По Итог.ВГраница() Цикл
		
		Итог[Инд] = Параметр1[Инд] <> Параметр2[Инд];
		
	КонецЦикла;
	
КонецПроцедуры

// Побитовое И. Меняет значения в массиве Итог
//
// Параметры:
//  Параметр1 - Массив из Булево - 
//  Параметр2 - Массив из Булево - 
//  Итог - Массив из Булево - 
Процедура _AND(Параметр1, Параметр2, Итог) Экспорт
	
	Для Инд = 0 По Итог.ВГраница() Цикл
		
		Итог[Инд] = Параметр1[инд] И Параметр2[инд];
		
	КонецЦикла;
	
КонецПроцедуры

// Побитовое ИЛИ. Меняет значения в массиве Итог
//
// Параметры:
//  Параметр1 - Массив из Булево - 
//  Параметр2 - Массив из Булево - 
//  Итог - Массив из Булево - 
Процедура _OR(Параметр1, Параметр2, Итог) Экспорт
	
	Для Инд = 0 По Итог.ВГраница() Цикл
		
		Итог[Инд] = Параметр1[инд] Или Параметр2[инд];
		
	КонецЦикла;
	
КонецПроцедуры

// Побитовое Сложение.
//  Меняет значения в массиве Итог.
//
// Параметры:
//  Параметр1 - Массив из Булево - 
//  Параметр2 - Массив из Булево - 
//  Итог - Массив из Булево - 
//  ВозвратПеренос - Булево - Перенос за пределы массива, переполнения
//
Процедура _ADD(Параметр1, Параметр2, Итог, ВозвратПеренос = Ложь) Экспорт
	
	Перенос = Ложь;
	
	Для Инд = 0 По Итог.ВГраница() Цикл
		
		ЗначениеЧисло = Число(Параметр1[Инд]) + Число(Параметр2[Инд]) + Число(Перенос);
		
		Если ЗначениеЧисло = 2 Тогда
			
			Итог[Инд] = Ложь;
			Перенос = Истина;
			
		ИначеЕсли ЗначениеЧисло = 3 Тогда
			
			Итог[Инд] = Истина;
			Перенос = Истина;
			
		Иначе
			
			Итог[Инд] = Булево(ЗначениеЧисло);
			Перенос = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВозвратПеренос = Перенос;
	
КонецПроцедуры

// Побитовое Отрицание, Инверсия. Меняет значения в массиве Итог
//
// Параметры:
//  Параметр1	 - Массив из Булево -
//  Итог		 - Массив из Булево -
//
Процедура _NOT(Параметр1, Итог) Экспорт
	
	Для Инд = 0 По Итог.ВГраница() Цикл
		
		Итог[Инд] = Не Параметр1[Инд];
		
	КонецЦикла;
	
КонецПроцедуры

// Побитовая операция сдвига влево на КоличествоШагов.
//  Меняет значения в массиве Итог
//  Условно 00000010 = _ROL(00000001, 1).
//
// Параметры:
//  Параметр1		 - Массив из Булево -
//  КоличествоШагов	 - Число - КоличествоШагов сдвига
//  Итог			 - Массив из Булево -
//
Процедура _ROL(Параметр1, КоличествоШагов, Итог) Экспорт
	
	Для Инд = 0 По Итог.ВГраница() Цикл
		
		инд1 = Инд + КоличествоШагов;
		
		Если инд1 > Итог.ВГраница() Тогда
			
			инд1 = инд1 - Итог.Количество();
			
		КонецЕсли;
		
		Итог[инд1] = Параметр1[Инд];
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает пустой массив булево.
//
// Параметры:
//  Разрядность	 - Число - 
// 
// Возвращаемое значение:
//  Массив из Булево - Пустой массив булево
//
Функция ПолучитьПустойМассивБулево(Разрядность) Экспорт
	
	Массив = Новый Массив; //Массив из Булево
	
	Для Сч = 0 По Разрядность - 1 Цикл
		
		Массив.Добавить(Ложь);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

// Развернуть побайтно.
//  Используется для преобразования BigEndian в LittleEndian и обратно
//  291 = 0x0123.
//  BigEndian - от старшего к младшему
//  01 23.
//  LittleEndian - от младшего к старшему
//  23 01.
//
// Параметры:
//  СтрокаБайт	 - Строка	 - Строка байт
// 
// Возвращаемое значение:
//  Строка - Развернутая строка
//
Функция РазвернутьПобайтно(Знач СтрокаБайт)
	
	СтрокаРезультат = "";
	ДлинаСтроки = СтрДлина(СтрокаБайт);
	КоличествоПар = ДлинаСтроки / 2;
	
	Для Инд = 1 По КоличествоПар Цикл
		
		СтрокаРезультат = СтрокаРезультат + Сред(СтрокаБайт, ДлинаСтроки - Инд * 2 + 1, 2);
		
	КонецЦикла;
	
	Возврат СтрокаРезультат;
	
КонецФункции

// Запись данных. Записать целое X бит. Универсальная ф-ция
//
// Параметры:
//  СтруктураЗаписьДанных	 - Структура: См. СтруктураЗаписьДанных - 
//  ЦелоеЧисло				 - Число	 - Число для записи в поток
//  КоличествоБайтов		 - Число	 - Количество байтов в которое надо записать ЦелоеЧисло
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian.
//  	Если не задан берется из текущего экземпляра СтруктураЧтениеДанных.
//
Процедура ЗаписатьЦелоеЗаписьДанных(СтруктураЗаписьДанных, ЦелоеЧисло, КоличествоБайтов, ПорядокБайтов = Неопределено)
	ЦелевойПоток = ЦелевойПотокЗаписьДанных(СтруктураЗаписьДанных);

	ПредставлениеЦелое = Dec2Hex(ЦелоеЧисло, КоличествоБайтов * 2);
	
	Если ПорядокБайтов = Неопределено Тогда
		
		Если НРег(СтруктураЗаписьДанных.ПорядокБайтов) = НРег("LittleEndian") Тогда
			
			ПредставлениеЦелое = РазвернутьПобайтно(ПредставлениеЦелое);
			
		КонецЕсли;
		
	ИначеЕсли НРег(ПорядокБайтов) = НРег("LittleEndian") Тогда
		
		ПредставлениеЦелое = РазвернутьПобайтно(ПредставлениеЦелое);
		
	КонецЕсли;

	ЦелевойПоток._ПредставлениеДвоичныхДанных = ЦелевойПоток._ПредставлениеДвоичныхДанных + ПредставлениеЦелое;
	ПерейтиПоток(ЦелевойПоток, КоличествоБайтов);
	
КонецПроцедуры

// Чтение данных. Прочитать целое X бит. Универсальная ф-ция
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
//  КоличествоБайтов		 - Число	 - Количество байтов которое надо прочитать
//  ПорядокБайтов			 - Строка, Неопределено	 - Порядок байтов.
//  	Возможные значения BigEndian или LittleEndian.
//  	Если не задан берется из текущего экземпляра СтруктураЧтениеДанных.
// 
// Возвращаемое значение:
//  Число, Неопределено - Значение байта в десятичном исчислении или Неопределено если конец потока
//
Функция ПрочитатьЦелоеЧтениеДанных(СтруктураЧтениеДанных, КоличествоБайтов, ПорядокБайтов = Неопределено)

	Если МожноПрочитатьБайтовЧтениеДанных(СтруктураЧтениеДанных, КоличествоБайтов) Тогда

		ИсходныйПоток = ИсходныйПотокЧтениеДанных(СтруктураЧтениеДанных);

		ПозицияСимвола = ИсходныйПоток.ТекущаяПозиция * 2 + 1;

		ПредставлениеЦелое = Сред(ИсходныйПоток._ПредставлениеДвоичныхДанных, ПозицияСимвола, КоличествоБайтов * 2);

		ИсходныйПоток.ТекущаяПозиция = ИсходныйПоток.ТекущаяПозиция + КоличествоБайтов;

		Если ПорядокБайтов = Неопределено Тогда
			
			Если НРег(СтруктураЧтениеДанных.ПорядокБайтов) = НРег("LittleEndian") Тогда
				
				ПредставлениеЦелое = РазвернутьПобайтно(ПредставлениеЦелое);
				
			КонецЕсли;
			
		ИначеЕсли НРег(ПорядокБайтов) = НРег("LittleEndian") Тогда
			
			ПредставлениеЦелое = РазвернутьПобайтно(ПредставлениеЦелое);
			
		КонецЕсли;
		
		Возврат Hex2Dec(ПредставлениеЦелое);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Проверка возможности прочитать КоличествоБайтов чтения данных.
//
// Параметры:
//  СтруктураЧтениеДанных	 - Структура: См. СтруктураЧтениеДанных - 
//  КоличествоБайтов		 - Число	 - Количество байтов для чтения
// 
// Возвращаемое значение:
//  Булево - Можно прочитать байты чтения данных
//
Функция МожноПрочитатьБайтовЧтениеДанных(СтруктураЧтениеДанных, КоличествоБайтов)
	
	ИсходныйПоток = ИсходныйПотокЧтениеДанных(СтруктураЧтениеДанных);
	РазмерПотока = РазмерПотока(ИсходныйПоток);
	ТекущаяПозицияПотока = ТекущаяПозицияПоток(ИсходныйПоток);

	Возврат РазмерПотока >= (ТекущаяПозицияПотока + КоличествоБайтов);
	
КонецФункции

// Функция-конструктор структуры запись данных.
// 
// Возвращаемое значение:
//  Структура - Структура запись данных:
//  * ТипЗнч - Строка - Тип Структуры ЧтениеДанных или ЗаписьДанных. Устанавливается в конструкторе
//  * КодировкаТекста - Строка, КодировкаТекста -
//  * ПорядокБайтов - Строка - BigEndian или LittleEndian
//  * РазделительСтрок - Строка -
//  * КонвертируемыйРазделительСтрок - Строка -
//  * _ЦелевойПоток - Структура - См. СтруктураПоток - Структура типа Поток
//  * _ИмяФайла - Строка - Имя файла для записи потока
//
Функция СтруктураЗаписьДанных()
	
	СтруктураЗаписьДанных = Новый Структура;
	СтруктураЗаписьДанных.Вставить("ТипЗнч", "ЗаписьДанных");
	СтруктураЗаписьДанных.Вставить("КодировкаТекста", "UTF-8");
	СтруктураЗаписьДанных.Вставить("ПорядокБайтов", "LittleEndian");
	СтруктураЗаписьДанных.Вставить("РазделительСтрок", Символы.ПС);
	СтруктураЗаписьДанных.Вставить("КонвертируемыйРазделительСтрок", Символы.ВК + Символы.ПС);
	СтруктураЗаписьДанных.Вставить("ЗаписатьBOM", Ложь);

	// приватные свойства
	СтруктураЗаписьДанных.Вставить("_ЦелевойПоток", СтруктураПоток());
	СтруктураЗаписьДанных.Вставить("_ИмяФайла", "");

	Возврат СтруктураЗаписьДанных;
	
КонецФункции

// Функция-конструктор структуры чтение данных.
// 
// Возвращаемое значение:
//  Структура - Структура чтение данных:
//  * ТипЗнч - Строка - Тип Структуры ЧтениеДанных или ЗаписьДанных. Устанавливается в конструкторе
//  * КодировкаТекста - Строка, КодировкаТекста -
//  * ПорядокБайтов - Строка - BigEndian или LittleEndian
//  * РазделительСтрок - Строка -
//  * КонвертируемыйРазделительСтрок - Строка -
//  * _ИсходныйПоток - Структура - См. СтруктураПоток - Структура типа Поток
//
Функция СтруктураЧтениеДанных()
	
	СтруктураЧтениеЗаписьДанных = Новый Структура;
	СтруктураЧтениеЗаписьДанных.Вставить("ТипЗнч", "ЧтениеДанных");
	СтруктураЧтениеЗаписьДанных.Вставить("КодировкаТекста", "UTF-8");
	СтруктураЧтениеЗаписьДанных.Вставить("ПорядокБайтов", "LittleEndian");
	СтруктураЧтениеЗаписьДанных.Вставить("РазделительСтрок", Символы.ПС);
	СтруктураЧтениеЗаписьДанных.Вставить("КонвертируемыйРазделительСтрок", Символы.ВК + Символы.ПС);
	// приватные свойства
	СтруктураЧтениеЗаписьДанных.Вставить("_ИсходныйПоток", СтруктураПоток());

	Возврат СтруктураЧтениеЗаписьДанных;
	
КонецФункции

// Функция-конструктор Поток.
// 
// Возвращаемое значение:
//  Структура - Структура типа Поток:
//  * ТипЗнч - Строка - Тип Структуры Поток
//  * ДоступнаЗапись - Булево - Признак доступности записи в поток
//  * ДоступноИзменениеПозиции - Булево - Признак доступности произвольного изменения позиции чтения/записи в потоке
//  * ДоступноЧтение - Булево - Признак доступности чтения из потока
//  * _ПредставлениеДвоичныхДанных - Строка - строка с HEX значениями данных
//
Функция СтруктураПоток()
	
	СтруктураПоток = Новый Структура;
	СтруктураПоток.Вставить("ТипЗнч", "Поток");
	СтруктураПоток.Вставить("ДоступнаЗапись", Истина);
	СтруктураПоток.Вставить("ДоступноИзменениеПозиции", Истина);
	СтруктураПоток.Вставить("ДоступноЧтение", Истина);
	СтруктураПоток.Вставить("ТекущаяПозиция", 0);
	// приватные свойства
	СтруктураПоток.Вставить("_ПредставлениеДвоичныхДанных", "");

	Возврат СтруктураПоток;
	
КонецФункции

//Функция ПолучитьСтрокуНулевыхБайт(КоличествоБайт)
//	СтрокаБайт = "";
//	Для Инд = 1 По КоличествоБайт Цикл
//		СтрокаБайт = СтрокаБайт + "00";
//	КонецЦикла;
//	Возврат СтрокаБайт
//КонецФункции

// Есть неопределено. Аналог ЕстьNull .
//
// Параметры:
//  Значение				 - Произвольный	 - Значение
//  ЗначениеЕслиНеопределено - Произвольный	 - Значение если неопределено
// 
// Возвращаемое значение:
//  Произвольный - Возвращаемое значение
//
Функция ЕстьНеопределено(Значение, ЗначениеЕслиНеопределено)
	
	Если Значение = Неопределено Тогда
		
		Возврат ЗначениеЕслиНеопределено;
		
	Иначе
		
		Возврат Значение;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПредставлениеЧислаЛок(ЧислоДляПредставления)
	
	Возврат Формат(ЧислоДляПредставления, "ЧРГ=; ЧГ=")
	
КонецФункции

// Коннектор Стд Стр.
// 
// Возвращаемое значение:
//  ОбработкаОбъект.КоннекторСтдСтр, ВнешняяОбработка - КоннекторСтдСтрЛок
Функция КоннекторСтдСтрЛок()

	Если КоннекторСтдСтрЛок = Неопределено Тогда
		
		ПараметрыПроверки = Новый Структура;
		ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
		ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
	
		Если ПараметрыПроверки.ИспользуемоеИмяФайла = Неопределено Тогда
			
			КоннекторСтдСтрЛок = Новый ("DataProcessorObject.КонтурДиадокСтдСтр");
			
		Иначе
			
			КоннекторСтдСтрЛок = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтр");
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат КоннекторСтдСтрЛок;
	
КонецФункции

#КонецЕсли