
&НаКлиенте
Перем Ядро;

&НаКлиенте
Перем Кэш;

//**************************************
//{		ВЕРСИЯ

&НаКлиенте
Функция ВерсияОбработки() Экспорт
	
	Результат = ВерсияОбработкиНаСервере();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВерсияПлагина() Экспорт
	
	Результат = Кэш_Прочитать("ВерсияПлагина");
	
	Если Результат = Неопределено Тогда
		
		Результат = ВерсияПлагинаНаСервере();
		
		Кэш_Поместить("ВерсияПлагина", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВерсияОбработкиНаСервере()
	
	Результат = ОбработкаОбъект().ВерсияОбработки();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВерсияПлагинаНаСервере()
	
	Результат = ОбработкаОбъект().ВерсияПлагина();
	
	Возврат Результат;
	
КонецФункции

//}		ВЕРСИЯ

//{		СЕРВИСНЫЕ МЕТОДЫ

// Инициализирует модуль Плагин
//
// Параметры:
//  Модуль_Ядро - ФормаКлиентскогоПриложения, Неопределено - библиотека Ядро на клиенте
//
&НаКлиенте
Процедура ИнициализироватьМодуль(Модуль_Ядро) Экспорт
	
	Ядро = Модуль_Ядро;
	
КонецПроцедуры

//}		СЕРВИСНЫЕ МЕТОДЫ


//**********************************************
//{		ПРИКЛАДНЫЕ МЕТОДЫ

// Преобразует данные из одного типа в другой, например из двоичных данных в строку.
//
// Параметры:
//	 Контент - ДвоичныеДанные, Строка, Структура - Содержит входящий контент, который нужно преобразовать.
//	 Контент может быть передан в виде структуры с одним элементом, где:
//			Ключ	 - имя типа
//			Значение - контент
//	 Примеры: Новый Структура("base64", СтрокаBase64)
//			  Новый Структура("file", ПолноеИмяФайла)
//			  Новый Структура("ДвоичныеДанные", ДвоичныеДанные)
//
//	 Допустимые имена типов: 
//		ДвоичныеДанные  - Двоичные данные
//		Строка, string	- Строка
//		Файл, file      - Путь к файлу
//		base64 			- Строка в Base64
//		hex				- Строка в HEX
//		
//	 НовыйКонтент - Структура - Содержит тип нового контента, в который нужно преобразовать.
//								Задается по аналогии со структурой Контент но без значения, например Новый Структура("string").
//
//	 Кодировка - Строка - (необязательный) Задается если данные преобразуются в строку, для интерпретации национальных символов.
//
// Возвращаемое значение:
//	 ДвоичныеДанные, Строка	- Новый контент, полученный в результате преобразования.
//
&НаКлиенте
Функция ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка = "") Экспорт
	
	Команда = НоваяКоманда_ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Преобразует данные из одного типа в другой асинхронно.
//
// Параметры:
//	 (см. метод ПреобразоватьКонтент)
//
// Возвращаемое значение:
//	 TaskId - Строка - Идентификатор асинхронной задачи.
//					   По идентификатору можно:
//							Проверить выполнение - метод ПроверитьРезультатАсинхроннойЗадачи
//							Получить результат	 - метод ПолучитьРезультатАсинхроннойЗадачи
//
&НаКлиенте
Функция ПреобразоватьКонтент_Асинхронно(Контент, НовыйКонтент, Кодировка = "") Экспорт
	
	Команда = НоваяКоманда_ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Преобразует данные из одного типа в другой асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения - ОписаниеОповещения - Обработчик, который нужно вызвать по окончанию выполнения задачи.
//						  					   В результат обработчика будет передан ответ от плагина.
//						  					   Ответ нужно разобрать с помощью метода РазобратьОтветПлагина.
//
//	 Остальные параметры - (см. метод ПреобразоватьКонтент)
//
&НаКлиенте
Процедура ПреобразоватьКонтент_НачатьВызов(ОписаниеОповещения, Контент, НовыйКонтент, Кодировка = "") Экспорт
	
	Команда = НоваяКоманда_ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры

// Преобразует данные из одного типа в другой асинхронно, и при этом не возвращает результат в 1С.
// Например можно отправить команду на запись или копирование файла без ожидания её завершения.
//
// Параметры:
//	 (см. метод ПреобразоватьКонтент)
//
// Возвращаемое значение:
//	 Булево - Признак успешного запуска:
//			  Истина - Успешно запущено
//			  Ложь   - Не запущено
//
&НаКлиенте
Функция ПреобразоватьКонтент_БезРезультата(Контент, НовыйКонтент, Кодировка = "") Экспорт
	
	Команда = НоваяКоманда_ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка);
	
	Возврат ВыполнитьКоманду_БезРезультата(Команда);
	
КонецФункции



// Возвращает массив структур с данными найденных сертификатов.
//
// Параметры:
//	 ПараметрыПоиска - Структура - Содержит параметры для поиска сертификатов.
//	 Состав структуры:
//	 	Отпечаток 	     	  - Строка 	  - (необязательный) Отпечаток сертификата
//	 	СерийныйНомер 	 	  - Строка 	  - (необязательный) Серийный номер сертификата
//	 	ЕстьЗакрытыйКлюч 	  - Булево 	  - (необязательный) Признак наличия закрытого ключа:
//								 				- Истина - Возвращать сертификаты у которых есть закрытый ключ.
//								 				- Ложь   - Возвращать сертификаты у которых нет закрытого ключа.
//	 	ТолькоПервый 	 	  - Булево 	  - (необязательный) Возвращать первый найденный сертификат.
//	 	РасположениеХранилища - Строка 	  - (необязательный) Расположение хранилища в котором нужно искать документ, если не указано то поиск выплоняется везде.
//										 	Рекомендуется! На порядок сокращает скорость поиска сертификата.
//										 	Допустимые значения:
//												- "ДанныеКомпьютера"	 - хранилище компьютера (machine)
//												- "ДанныеПользователяОС" - хранилище текущего пользователя (user)
//	 	ТипХранилища 		  - Строка 	  - (необязательный) Тип хранилища в котором нужно искать документ, если не указано то поиск выплоняется везде.
//										 	Рекомендуется! На порядок сокращает скорость поиска сертификата.
//										 	Допустимые значения:
//												- "КорневыеСертификаты" 			 - Корневые сертификаты (Root)
//												- "ПерсональныеСертификаты"          - Персональные сертификаты (My)
//												- "СертификатыПолучателей"           - Сертификаты получателей (AddressBook)
//												- "СертификатыУдостоверяющихЦентров" - Сертификаты удостоверяющих центров(CA)
//	 СвойстваСертификата 	  - Структура - (необязательный) Описывает какие свойства сертификатов нужно вернуть, если не задан то возвращается только отпечаток сертификата.
//											Имя свойства задается указывается в ключе элемента структуры, пример: Новый Структура("Субъект, ДатаОкончания")
//											Структуру со всеми свойствами сертификата можно получить с помощью метода ВсеСвойстваСертификата.
//
// Возвращаемое значение:
//	 Массив - Массив структур с данными найденных сертификатов.
//			  Состав свойств сертификатов определяется параметром СвойстваСертификата.
//	 Состав структуры:
//	 	Отпечаток 			- Строка 		- Содержит данные отпечатка сертификата.
//	 	СерийныйНомер 		- Строка 		- Сериный номер сертификата.
//	 	ДвоичныеДанные 		- Двичныеданные - Двоичные данные сертификата
//	 	Издатель 			- Структура 	- Содержит информацию об издателе.
//	 	Субъект 			- Структура 	- Содержит информацию о субъекте сертификата.
//	 	ДатаНачала 			- Дата 			- Дата начала действия сертификата.
//	 	ДатаОкончания 		- Дата 			- Дата окончания действия сертификата.
//	 	ЕстьЗакрытыйКлюч 	- Булево 		- Признак наличия закрытого ключа.
//	 	РасширенныеСвойства - Структура 	- Расширенные свойства сертификата.
//
&НаКлиенте
Функция ПолучитьСписокСертификатов(ПараметрыПоиска = Неопределено, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Выполняет поиск сертификатов асинхронно.
//
// Параметры:
//	 (см. метод ПолучитьСписокСертификатов)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ПолучитьСписокСертификатов_Асинхронно(ПараметрыПоиска = Неопределено, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Выполняет поиск сертификатов асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ПолучитьСписокСертификатов)
//
&НаКлиенте
Процедура ПолучитьСписокСертификатов_НачатьВызов(ОписаниеОповещения, ПараметрыПоиска = Неопределено, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Возвращает данные сертификата.
//
// Параметры:
//	 Сертификат - Структура, ДвоичныеДанные, Строка - Содержит сертификат или параметры для его поиска на компьютере.
//		ДвоичныеДанные - Двоичные данные сертфиката в DER формате
//		Строка		   - Отпечаток для поиска сертификата во всех доступных хранилищах компьютера.
//		Структура	   - Структура контента (см. параметр Контент метода ПреобразоватьКонтент).
//						 Для более быстрого поиска, можно передать точное расположение сертификата на компьютере.
//	 					 В таком случае состав структуры должен быть таким:
//	 						Отпечаток 	     	  - Строка - Отпечаток сертификата
//	 						ТипХранилища 	      - Строка - (необязательный) (см. параметр метода ПолучитьСписокСертификатов)
//	 						РасположениеХранилища - Строка - (необязательный) (см. параметр метода ПолучитьСписокСертификатов)
//	 СвойстваСертификата - Структура - (необязательный) (см. параметр метода ПолучитьСписокСертификатов).
//
// Возвращаемое значение:
//	 Структура - (см. результат метода ПолучитьСписокСертификатов).
//
&НаКлиенте
Функция ПолучитьДанныеСертификата(Сертификат, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьДанныеСертификата(Сертификат, СвойстваСертификата);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Возвращает данные сертификата, асинхронно.
//
// Параметры:
//	 (см. метод ПолучитьДанныеСертификата)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ПолучитьДанныеСертификата_Асинхронно(Сертификат, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьДанныеСертификата(Сертификат, СвойстваСертификата);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Читает данные сертификата асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ПолучитьДанныеСертификата)
//
&НаКлиенте
Процедура ПолучитьДанныеСертификата_НачатьВызов(ОписаниеОповещения, Сертификат, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьДанныеСертификата(Сертификат, СвойстваСертификата);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Возвращает данные сертификата если подпись верна.
//
// Параметры:
//	 Контент - Структура контента исходных данных (см. параметр Контент метода ПреобразоватьКонтент)
//	 Подпись - Структура контента подписи (см. параметр Контент метода ПреобразоватьКонтент)
//
// Возвращаемое значение:
//	 Структура - данные сертификата (см. результат метода ПолучитьДанныеСертификата).
//
&НаКлиенте
Функция ПроверитьПодпись(Контент, Подпись) Экспорт
	
	Команда = НоваяКоманда_ПроверитьПодпись(Контент, Подпись);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Возвращает данные сертификата если подпись верна, асинхронно.
//
// Параметры:
//	 (см. метод ПроверитьПодпись)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ПроверитьПодпись_Асинхронно(Контент, Подпись) Экспорт
	
	Команда = НоваяКоманда_ПроверитьПодпись(Контент, Подпись);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Проверяет подпись асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ПроверитьПодпись)
//
&НаКлиенте
Процедура ПроверитьПодпись_НачатьВызов(ОписаниеОповещения, Контент, Подпись) Экспорт
	
	Команда = НоваяКоманда_ПроверитьПодпись(Контент, Подпись);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Возвращает данные сертификата из подписи.
//
// Параметры:
//	 Подпись			 - Структура контента подписи (см. параметр Контент метода ПреобразоватьКонтент)
//	 СвойстваСертификата - (необязательный) (см. параметр метода ПолучитьСписокСертификатов).
//
// Возвращаемое значение:
//	 Структура - (см. результат метода ПолучитьСписокСертификатов).
//
&НаКлиенте
Функция ПолучитьСертификатИзПодписи(Подпись, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьСертификатИзПодписи(Подпись, СвойстваСертификата);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Возвращает данные сертификата из подписи, асинхронно.
//
// Параметры:
//	 (см. метод ПолучитьСертификатИзПодписи)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ПолучитьСертификатИзПодписи_Асинхронно(Подпись, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьСертификатИзПодписи(Подпись, СвойстваСертификата);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Получает данные сертификата из подписи асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ПолучитьСертификатИзПодписи)
//
&НаКлиенте
Процедура ПолучитьСертификатИзПодписи_НачатьВызов(ОписаниеОповещения, Подпись, СвойстваСертификата = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ПолучитьСертификатИзПодписи(Подпись, СвойстваСертификата);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Возвращает подпись контента с переданными сертификатами.
//
// Параметры:
//	 Контент	  - Структура контента (см. параметр Контент метода ПреобразоватьКонтент)
//	 НовыйКонтент - (необязательный) (см. параметр НовыйКонтент метода ПреобразоватьКонтент).
//					Если не задан, то тип контента подписи будет такой же как Контент.
//	 Сертификаты  - Структура, ДвоичныеДанные, - Сертификат либо массив сертификатов (см. параметр Сертификат метода ПолучитьДанныеСертификата).
//				    Строка, Массив
//
// Возвращаемое значение:
//	 ДвоичныеДанные, Строка	- Подпись.
//
&НаКлиенте
Функция ПодписатьКонтент(Контент, Сертификаты, НовыйКонтент = Неопределено) Экспорт

	Команда = НоваяКоманда_ПодписатьКонтент(Контент, Сертификаты, НовыйКонтент);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Возвращает подпись контента, асинхронно.
//
// Параметры:
//	 (см. метод ПодписатьКонтент)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ПодписатьКонтент_Асинхронно(Контент, Сертификаты, НовыйКонтент = Неопределено) Экспорт

	Команда = НоваяКоманда_ПодписатьКонтент(Контент, Сертификаты, НовыйКонтент);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Возвращает подпись контента асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ПодписатьКонтент)
//
&НаКлиенте
Процедура ПодписатьКонтент_НачатьВызов(ОписаниеОповещения, Контент, Сертификаты, НовыйКонтент = Неопределено) Экспорт

	Команда = НоваяКоманда_ПодписатьКонтент(Контент, Сертификаты, НовыйКонтент);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Возвращает зашифрованный контент.
//
// Параметры:
//	 Контент	  - Структура контента (см. параметр Контент метода ПреобразоватьКонтент)
//	 НовыйКонтент - (необязательный) (см. параметр НовыйКонтент метода ПреобразоватьКонтент).
//					Если не задан, то тип контента подписи будет такой же как Контент.
//	 Сертификаты  - Структура, ДвоичныеДанные, - Сертификат либо массив сертификатов (см. параметр Сертификат метода ПолучитьДанныеСертификата).
//				    Строка, Массив
//
// Возвращаемое значение:
//	 ДвоичныеДанные, Строка	- Зашифрованный контент.
//
&НаКлиенте
Функция ЗашифроватьКонтент(Контент, Сертификаты, НовыйКонтент = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ЗашифроватьКонтент(Контент, Сертификаты, НовыйКонтент);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Возвращает зашифрованный контент, асинхронно.
//
// Параметры:
//	 (см. метод ЗашифроватьКонтент)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ЗашифроватьКонтент_Асинхронно(Контент, Сертификаты, НовыйКонтент = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ЗашифроватьКонтент(Контент, Сертификаты, НовыйКонтент);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Возвращает зашифрованный контент асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ЗашифроватьКонтент)
//
&НаКлиенте
Процедура ЗашифроватьКонтент_НачатьВызов(ОписаниеОповещения, Контент, Сертификаты, НовыйКонтент = Неопределено) Экспорт
	
	Команда = НоваяКоманда_ЗашифроватьКонтент(Контент, Сертификаты, НовыйКонтент);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Возвращает расшифрованный контент.
// Пытается расшифровывать контент с помощью установленных на компьютер сертификатов с закрытыми ключами.
//
// Параметры:
//	 Контент	  - Структура контента (см. параметр Контент метода ПреобразоватьКонтент)
//	 НовыйКонтент - (необязательный) (см. параметр НовыйКонтент метода ПреобразоватьКонтент).
//					Если не задан, то тип контента подписи будет такой же как Контент.
//
// Возвращаемое значение:
//	 ДвоичныеДанные, Строка	- Расшифрованный контент.
//
&НаКлиенте
Функция РасшифроватьКонтент(Контент, НовыйКонтент = Неопределено) Экспорт
	
	Команда = НоваяКоманда_РасшифроватьКонтент(Контент, НовыйКонтент);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Возвращает расшифрованный контент, асинхронно.
// Пытается расшифровывать контент с помощью установленных на компьютер сертификатов с закрытыми ключами.
//
// Параметры:
//	 (см. метод РасшифроватьКонтент)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция РасшифроватьКонтент_Асинхронно(Контент, НовыйКонтент = Неопределено) Экспорт
	
	Команда = НоваяКоманда_РасшифроватьКонтент(Контент, НовыйКонтент);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Возвращает зашифрованный контент асинхронно, по окончанию выполнения вызывается указанный обработчик.
// Пытается расшифровывать контент с помощью установленных на компьютер сертификатов с закрытыми ключами.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод РасшифроватьКонтент)
//
&НаКлиенте
Процедура РасшифроватьКонтент_НачатьВызов(ОписаниеОповещения, Контент, НовыйКонтент = Неопределено) Экспорт
	
	Команда = НоваяКоманда_РасшифроватьКонтент(Контент, НовыйКонтент);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Выполняет HTTP запрос к серверу.
//
// Параметры:
//	 Метод 			  - Строка 	  - Метод запроса, например: "GET", "POST".
//	 АдресРесурса 	  - Строка 	  - Адрес ресурса, например: "https://diadoc-api.kontur.ru/GetBox"
//	 ПараметрыЗапроса - Структура - Различные параметры запроса
//	 Состав структуры:
//		Параметры		- Соответствие - (необязательный) Параметры строки запроса, где:
//											Ключ 	 - Имя параметра
//											Значение - Значение параметра
//		Заголовки		- Соответствие - (необязательный) Заголовки запроса, где:
//											Ключ 	 - Имя заголовка
//											Значение - Значение заголовка
//		Кодировка		- Строка	   - (необязательный) Кодировка строки тела запроса, если не указана используется кодировка по умолчанию UTF-8.
//		КодировкаОтвета - Строка	   - (необязательный) Кодировка строки тела ответа.
//										 Если кодировка не указана но в теле запроса необходимо получить строку,
//										 то для интерпретации данных используется кодировка из заголовка ответа "Content-Type".
//										 Если кодировку из заголовка ответа получить не удается, используется кодировка по умолчанию UTF-8.
//		Таймаут			- Число 	   - (необязательный) Время ответа в секундах.
//		ТелоЗапроса					   - (необязательный) (см. параметр Контент метода ПреобразоватьКонтент).
//		ТелоОтвета					   - (необязательный) (см. параметр Контент метода ПреобразоватьКонтент).
//		
//
&НаКлиенте
Функция ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса) Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Выполняет HTTP запрос к серверу, асинхронно.
//
// Параметры:
//	 (см. метод ВыполнитьHTTPЗапрос)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ВыполнитьHTTPЗапрос_Асинхронно(Метод, АдресРесурса, ПараметрыЗапроса) Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Выполняет HTTP запрос к серверу асинхронно, и при этом не возвращает результат в 1С.
// Может использоватся например для сбора статистики.
//
// Параметры:
//	 (см. метод ВыполнитьHTTPЗапрос)
//
// Возвращаемое значение:
//	 Булево - Признак успешного запуска:
//			  Истина - Успешно запущено
//			  Ложь   - Не запущено
//
&НаКлиенте
Функция ВыполнитьHTTPЗапрос_БезРезультата(Метод, АдресРесурса, ПараметрыЗапроса) Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса);
	
	Возврат ВыполнитьКоманду_БезРезультата(Команда);
	
КонецФункции

// Выполняет HTTP запрос к серверу асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ВыполнитьHTTPЗапрос)
//
&НаКлиенте
Процедура ВыполнитьHTTPЗапрос_НачатьВызов(ОписаниеОповещения, Метод, АдресРесурса, ПараметрыЗапроса) Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры



// Выполняет HTTP запрос к серверу Диадока (https://diadoc-api.kontur.ru)
// Добавляет необходимые для Диадока заголовки.
//
// Параметры:
//	 Метод 			  - Строка 	  - (см. параметр метода ВыполнитьHTTPЗапрос)
//	 ИмяРесурса 	  - Строка 	  - Имя ресурса как оно задано в документации к API Диадока, пример: "/GetBox"
//	 ПараметрыЗапроса - Структура - (см. параметр метода ВыполнитьHTTPЗапрос)
//	 КлючРазработчика - Строка 	  - (необязательный) Ключ разработчика если этого требует метод API.
//	 Токен			  - Строка 	  - (необязательный) Авторизационный токен если этого требует метод API.
//	 Агент			  - Строка 	  - (необязательный) Описание клиента выполняющего запрос, если не указан то передается синоним конфигурации.
//
&НаКлиенте
Функция ВыполнитьHTTPЗапросДиадок(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика = "", Токен = "", Агент = "") Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапросДиадок(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика, Токен);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции

// Выполняет HTTP запрос к серверу Диадока, асинхронно.
//
// Параметры:
//	 (см. метод ВыполнитьHTTPЗапросДиадок)
//
// Возвращаемое значение:
//	 TaskId - (см. результат метода ПреобразоватьКонтент_Асинхронно).
//
&НаКлиенте
Функция ВыполнитьHTTPЗапросДиадок_Асинхронно(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика = "", Токен = "", Агент = "") Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапросДиадок(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика, Токен);
	
	Возврат ВыполнитьКоманду_Асинхронно(Команда);
	
КонецФункции

// Выполняет HTTP запрос к серверу асинхронно, и при этом не возвращает результат в 1С.
// Может использоватся например для сбора статистики.
//
// Параметры:
//	 (см. метод ВыполнитьHTTPЗапросДиадок)
//
// Возвращаемое значение:
//	 Булево - Признак успешного запуска:
//			  Истина - Успешно запущено
//			  Ложь   - Не запущено
//
&НаКлиенте
Функция ВыполнитьHTTPЗапросДиадок_БезРезультата(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика = "", Токен = "", Агент = "") Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапросДиадок(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика, Токен);
	
	Возврат ВыполнитьКоманду_БезРезультата(Команда);
	
КонецФункции

// Выполняет HTTP запрос к серверу асинхронно, по окончанию выполнения вызывается указанный обработчик.
//
// Параметры:
//	 ОписаниеОповещения  - (см. метод ПреобразоватьКонтент_НачатьВызов)
//	 Остальные параметры - (см. метод ВыполнитьHTTPЗапросДиадок)
//
&НаКлиенте
Процедура ВыполнитьHTTPЗапросДиадок_НачатьВызов(ОписаниеОповещения, Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика = "", Токен = "", Агент = "") Экспорт
	
	Команда = НоваяКоманда_ВыполнитьHTTPЗапросДиадок(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика, Токен);
	
	plugin_Send_НачатьВызов(ОписаниеОповещения, Команда);
	
КонецПроцедуры

// Реализует ожидание с помощью плагина.
// Пытается рассчитать хэш-сумму по необходимому алгоритму хэширования.
//
// Параметры:
//	 ВремяВСекунлдах - Число - Время в секундах, которое будет ждать плагин
//
&НаКлиенте
Функция Таймаут(ВремяВСекундах = 0) Экспорт
	
	Команда = НоваяКоманда_Таймаут(ВремяВСекундах);
	
	Возврат ВыполнитьКоманду(Команда);
	
КонецФункции


	//{		СЕРВИСНЫЕ МЕТОДЫ
	
	// Отключает кэширование внешней компоненты плагина
	//
	&НаКлиенте
	Процедура ОтключитьКэшПлагина() Экспорт
		
		Кэш_Поместить("plugin", Неопределено);
		Кэш_Поместить("КэшПлагинаОтключен", Истина);
		
	КонецПроцедуры
	
	// Проверяет что хост плагина загружен и отвечает,
	// с помощью команды ping
	//
	&НаКлиенте
	Процедура ПроверитьПлагин() Экспорт
		
		Кэш_Поместить("plugin", Неопределено);
		
		Команда = Новый_command("test.ping");
		КомандаXML = Структура_В_СтрокаXML(Команда);
		
		Plugin = СоздатьОбъектПлагина();
		
		ОтветПлагина = Plugin.Send(КомандаXML);
		
		СтруктураОтвета = ОтветПлагина_В_Структуру(ОтветПлагина);
		
		ПроверитьPluginError(СтруктураОтвета);
		
	КонецПроцедуры
	
	// Возвращает признак завершения выполнения асинхронной задачи.
	//
	// Параметры:
	//	 TaskId - Строка - Идентификатор асинхронной задачи.
	//
	// Возвращаемое значение:
	//	 Булево - Признак завершения выполнения:
	//		Истина - Задача выполнена
	//		Ложь   - Задача еще не выполнена
	//
	&НаКлиенте
	Функция ПроверитьРезультатАсинхроннойЗадачи(TaskId) Экспорт
		
		Возврат plugin_HasResult(TaskId);
		
	КонецФункции

	// Возвращает результат выполнения асинхронной задачи.
	// Внимание! Метод ожидает окончания завершения задачи.
	//
	// Параметры:
	//	 TaskId - Строка - Идентификатор асинхронной задачи.
	//
	// Возвращаемое значение:
	//	 Произвольное значение - Результат асинхронной задачи.
	//
	&НаКлиенте
	Функция ПолучитьРезультатАсинхроннойЗадачи(TaskId) Экспорт
		
		Возврат РазобратьОтветПлагина(plugin_GetResult(TaskId));
		
	КонецФункции

	// Возвращает результат выполнения асинхронной задачи, запущенной с помощью конструкции НачатьВызов.
	//
	// Параметры:
	//	 ОтветПлагина - Строка - XML строка, которую возвращает плагин в параметр Результат обработчика оповещения.
	//
	// Возвращаемое значение:
	//	 Произвольное значение - Результат асинхронной задачи.
	//
	&НаКлиенте
	Функция РазобратьОтветПлагина(ОтветПлагина) Экспорт
		
		Результат = Неопределено;
		
		СтруктураОтвета = ОтветПлагина_В_Структуру(ОтветПлагина);
		
		ПроверитьPluginError(СтруктураОтвета);
		
		ТипКоманды = СтруктураОтвета.ДополнительныеПараметры.command_type;
		
		Если ТипКоманды = "io.transfer" Тогда
			
			Результат = РазобратьОтвет_ПреобразоватьКонтент(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "cert.search" Тогда
			
			Результат = РазобратьОтвет_ПолучитьСписокСертификатов(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "cert.parse" Тогда
			
			Результат = РазобратьОтвет_ПолучитьДанныеСертификата(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "crypto.verify" Тогда
			
			Результат = РазобратьОтвет_ПроверитьПодпись(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "crypto.signature.parse" Тогда
			
			Результат = РазобратьОтвет_ПолучитьСертификатИзПодписи(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "crypto.sign" Тогда
			
			Результат = РазобратьОтвет_ПодписатьКонтент(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "crypto.encrypt" Тогда
			
			Результат = РазобратьОтвет_ЗашифроватьКонтент(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "crypto.decrypt" Тогда
			
			Результат = РазобратьОтвет_РасшифроватьКонтент(СтруктураОтвета);
			
		ИначеЕсли ТипКоманды = "http.request" Тогда
			
			Результат = РазобратьОтвет_ВыполнитьHTTPЗапрос(СтруктураОтвета);
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции

	// Принудительно удаляет результат асинхронной задачи.
	// Если задача еще не выполнена, то после её выполнения, результат будет немедленно удален из памяти.
	//
	// Параметры:
	//	 TaskId - Строка - Идентификатор асинхронной задачи.
	//
	&НаКлиенте
	Процедура УдалитьАсинхроннуюЗадачу(TaskId) Экспорт
		
		plugin_DeleteResult(TaskId);
		
	КонецПроцедуры


	&НаКлиенте
	Функция НовыеПараметрыHTTPЗапроса() Экспорт
		
		Результат = Новый Структура;
		
		Результат.Вставить("Заголовки", Новый Соответствие);
		Результат.Вставить("Параметры", Новый Соответствие);
		
		Результат.Вставить("ТелоЗапроса", Новый Структура("string", "")); // ТелоЗапроса пустая строка
		Результат.Вставить("ТелоОтвета" , Новый Структура("string", "")); // ТелоОтвета вернуть строкой в кодировке сервера
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция ВсеСвойстваСертификата(ДобавитьДвоичныеДанные = Ложь) Экспорт
		
		Результат = Новый Структура("СерийныйНомер, Издатель, Субъект, ДатаНачала, ДатаОкончания, ЕстьЗакрытыйКлюч");
		
		Если ДобавитьДвоичныеДанные = Истина Тогда
			Результат.Вставить("ДвоичныеДанные");
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции
	
	&НаКлиенте
	Функция НовыйОписаниеОповещения(ИмяПроцедуры = Неопределено, Модуль = Неопределено, ДополнительныеПараметры = Неопределено)
		
		ПараметрыКонструктора = Новый Массив;
		ПараметрыКонструктора.Добавить(ИмяПроцедуры);
		ПараметрыКонструктора.Добавить(Модуль);
		ПараметрыКонструктора.Добавить(ДополнительныеПараметры);
		
		Результат = Новый("ОписаниеОповещения", ПараметрыКонструктора);
		
		Возврат Результат;
		
	КонецФункции
		
	//}		СЕРВИСНЫЕ МЕТОДЫ

	
	//{		ГЕНЕРАЦИЯ КОМАНД И РАЗБОР РЕЗУЛЬТАТА

	&НаКлиенте
	Функция НоваяКоманда_ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка)
		
		source = Контент_В_Content(Контент	   , Кодировка);
		sink   = Контент_В_Content(НовыйКонтент, Кодировка);
		
		Результат = Команда_io_transfer(source, sink);
		
		Если ТипКонтента(НовыйКонтент) = "ДвоичныеДанные" Тогда
			Результат.command.custom_data.Вставить("ResultBinaryData")
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ПреобразоватьКонтент(Ответ)
		
		Результат = Content_В_Контент(Ответ.response);
		
		Если Ответ.ДополнительныеПараметры.Свойство("ResultBinaryData") И ЗначениеЗаполнено(Результат) Тогда
			Результат = Base64Значение(Результат);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_ПолучитьСписокСертификатов(ПараметрыФильтра, СвойстваСертификата)
		
		filter	   = Новый_cert_filter(ПараметрыФильтра);
		properties = Новый_certificateProperties(СвойстваСертификата);
		
		Результат = Команда_cert_search(filter, properties);
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ПолучитьСписокСертификатов(Ответ)
		
		Результат = Новый Массив;
		
		response = Ответ.response;
		
		Если ЗначениеЗаполнено(response) Тогда
			
			Если ТипЗнч(response) = Тип("Массив") Тогда
				
				Для Каждого item ИЗ response Цикл
					Результат.Добавить(Новый_ОписаниеСертификата(item.certificate_info));
				КонецЦикла;
				
			Иначе
				Результат.Добавить(Новый_ОписаниеСертификата(response.certificate_info));
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_ПолучитьДанныеСертификата(Сертификат, СвойстваСертификата)
		
		cert	   = Новый_certificate(Сертификат);
		properties = Новый_certificateProperties(СвойстваСертификата);
		
		Результат = Команда_cert_parse(cert, properties);
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ПолучитьДанныеСертификата(Ответ)
		
		Результат = Неопределено;
		
		Если ЗначениеЗаполнено(Ответ.response) Тогда
			Результат = Новый_ОписаниеСертификата(Ответ.response);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_ПроверитьПодпись(Контент, Подпись)
		
		source 	  = Контент_В_Content(Контент);
		signature = Контент_В_Content(Подпись);
		
		Результат = Команда_crypto_verify(source, signature);
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ПроверитьПодпись(Ответ)
		
		Результат = Неопределено;
		
		response = Ответ.response;
		
		Если ЗначениеЗаполнено(response.certs) Тогда
			Результат = Новый_ОписаниеСертификата(response.certs);
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(response.certs) Тогда
		//	
		//	Если ТипЗнч(response.certs) = Тип("Массив") Тогда
		//		Результат = Новый_ОписаниеСертификата(response.certs[0].certificate_info);
		//	Иначе
		//		Результат = Новый_ОписаниеСертификата(response.certs.certificate_info);
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		Возврат Результат;
	 	
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_ПолучитьСертификатИзПодписи(Подпись, СвойстваСертификата = Неопределено)
		
		Перем content;
		
		source = Контент_В_Content(Подпись);
		certificateProperties = Новый_certificateProperties(СвойстваСертификата);
		signerInfoProperties = Новый_signerInfoProperties();
		
		Результат = Команда_crypto_signature_parse(source, certificateProperties, signerInfoProperties);
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ПолучитьСертификатИзПодписи(Ответ)
		
		Результат = Неопределено;
		
		response = Ответ.response;
		
		Если ЗначениеЗаполнено(response.certs) Тогда
			
			Если ТипЗнч(response.certs) = Тип("Массив") Тогда
				
				СерийныйНомер = СерийныйНомерСертификатаПодписанта(response.signer_infos);
				Для Каждого cert Из response.certs Цикл
					
					Если cert.certificate_info.serialNumber.data = СерийныйНомер Тогда
						Результат = Новый_ОписаниеСертификата(cert.certificate_info);
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если Результат = Неопределено Тогда
					Результат = Новый_ОписаниеСертификата(response.certs[0].certificate_info);
				КонецЕсли;
				
			Иначе
				Результат = Новый_ОписаниеСертификата(response.certs.certificate_info);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Результат;
	 	
	КонецФункции

	&НаКлиенте
	Функция СерийныйНомерСертификатаПодписанта(SignerInfos)
		
		Результат = Неопределено;
		
		Если ТипЗнч(SignerInfos) = Тип("Массив") Тогда
			Результат = SignerInfos[0].signer_info.serialNumber.data;
		Иначе
			Результат = SignerInfos.signer_info.serialNumber.data;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_ПодписатьКонтент(Контент, Сертификаты, НовыйКонтент)
		
		source = Контент_В_Content(Контент);
		
		Если НовыйКонтент = Неопределено Тогда
			sink = Новый_content(source.type);
			ВернутьДвоичныеДанные = ТипКонтента(Контент) = "ДвоичныеДанные";
		Иначе
			sink = Контент_В_Content(НовыйКонтент);
			ВернутьДвоичныеДанные = ТипКонтента(НовыйКонтент) = "ДвоичныеДанные";
		КонецЕсли;
		
		certs = Новый_certs(Сертификаты);
		
		Результат = Команда_crypto_sign(source, sink, certs);
		
		Если ВернутьДвоичныеДанные Тогда
			Результат.command.custom_data.Вставить("ResultBinaryData");
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ПодписатьКонтент(Ответ)
		
		Возврат РазобратьОтвет_ПреобразоватьКонтент(Ответ);
		
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_ЗашифроватьКонтент(Контент, Сертификаты, НовыйКонтент)
		
		source = Контент_В_Content(Контент);
		
		Если НовыйКонтент = Неопределено Тогда
			sink = Новый_content(source.type);
			ВернутьДвоичныеДанные = ТипКонтента(Контент) = "ДвоичныеДанные";
		Иначе
			sink = Контент_В_Content(НовыйКонтент);
			ВернутьДвоичныеДанные = ТипКонтента(НовыйКонтент) = "ДвоичныеДанные";
		КонецЕсли;

		certs = Новый_certs(Сертификаты);
		
		Результат = Команда_crypto_encrypt(source, sink, certs);
		
		Если ВернутьДвоичныеДанные Тогда
			Результат.command.custom_data.Вставить("ResultBinaryData");
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ЗашифроватьКонтент(Ответ)
		
		Возврат РазобратьОтвет_ПреобразоватьКонтент(Ответ);
		
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_РасшифроватьКонтент(Контент, НовыйКонтент)
		
		source = Контент_В_Content(Контент);
		
		Если НовыйКонтент = Неопределено Тогда
			sink = Новый_content(source.type);
			ВернутьДвоичныеДанные = ТипКонтента(Контент) = "ДвоичныеДанные";
		Иначе
			sink = Контент_В_Content(НовыйКонтент);
			ВернутьДвоичныеДанные = ТипКонтента(НовыйКонтент) = "ДвоичныеДанные";
		КонецЕсли;

		Результат = Команда_crypto_decrypt(source, sink);
		
		Если ВернутьДвоичныеДанные Тогда
			Результат.command.custom_data.Вставить("ResultBinaryData");
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_РасшифроватьКонтент(Ответ)
		
		Возврат РазобратьОтвет_ПреобразоватьКонтент(Ответ);
		
	КонецФункции


	&НаКлиенте
	Функция НоваяКоманда_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса)
		
		Перем query, headers, requestBody, responseBody, timeout;
		
		// Кодировка запроса
		Кодировка = "utf-8";
		Если ПараметрыЗапроса.Свойство("Кодировка") Тогда
			Кодировка = ПараметрыЗапроса.Кодировка;
		КонецЕсли;
		
		// Имеет смысл только для тела ответа в виде строки.
		// Позволяет получить текст ответа без дополнительного преобразования контента в строку
		// после расчета кодировки из заголовка ответа.
		КодировкаОтвета = "";
		Если ПараметрыЗапроса.Свойство("КодировкаОтвета") Тогда
			КодировкаОтвета = ПараметрыЗапроса.КодировкаОтвета;
		КонецЕсли;
		
		// Параметры, автоматически добавляются плагином в URI запроса.
		// Нельзя использовать совместно с параметрами в адресе ресурса.
		Если ПараметрыЗапроса.Свойство("Параметры") Тогда
			query = Соответствие_В_NameValueCollection(ПараметрыЗапроса.Параметры);
		КонецЕсли;
		
		// Заголовки запроса
		Если ПараметрыЗапроса.Свойство("Заголовки") Тогда
			headers = Соответствие_В_NameValueCollection(ПараметрыЗапроса.Заголовки);
		КонецЕсли;
		
		// Тело запроса
		Если ПараметрыЗапроса.Свойство("ТелоЗапроса") Тогда
			requestBody = Контент_В_Content(ПараметрыЗапроса.ТелоЗапроса, Кодировка);
		КонецЕсли;
		
		ДопОбработкаОтвета = "";
		
		// Тело ответа
		Если ПараметрыЗапроса.Свойство("ТелоОтвета") Тогда
			
			responseBody = Контент_В_Content(ПараметрыЗапроса.ТелоОтвета, КодировкаОтвета);
			
			Если responseBody.type = "string" И НЕ ЗначениеЗаполнено(КодировкаОтвета) Тогда
				
				responseBody = Новый_content("base64");
				
				ДопОбработкаОтвета = "AutoEncoding";
				
			ИначеЕсли responseBody.type = "base64" И ТипКонтента(ПараметрыЗапроса.ТелоОтвета) = "ДвоичныеДанные" Тогда
				
				ДопОбработкаОтвета = "ResultBinaryData";
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Время ожидания ответа
		ПараметрыЗапроса.Свойство("Таймаут", timeout);
		
		Результат = Команда_http_request(Метод, АдресРесурса, query, headers, requestBody, responseBody, timeout);
		
		Если ЗначениеЗаполнено(ДопОбработкаОтвета) Тогда
			Результат.command.custom_data.Вставить(ДопОбработкаОтвета);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции

	&НаКлиенте
	Функция НоваяКоманда_ВыполнитьHTTPЗапросДиадок(Метод, ИмяРесурса, ПараметрыЗапроса, КлючРазработчика = "", Токен = "", Агент = "")
		
		АдресРесурса = "https://diadoc-api.kontur.ru" + ИмяРесурса;
		
		// Кодировка для заголовка
		Кодировка = "utf-8";
		Если ПараметрыЗапроса.Свойство("Кодировка") Тогда
			Кодировка = ПараметрыЗапроса.Кодировка;
		КонецЕсли;
		
		// Добавляем обязательные заголовки
		Если НЕ ПараметрыЗапроса.Свойство("Заголовки") Тогда
			ПараметрыЗапроса.Вставить("Заголовки", Новый Соответствие);
		КонецЕсли;
		
		ПараметрыЗапроса.Заголовки.Вставить("Accept"	  , "application/json");
		ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json" + ?(ЗначениеЗаполнено(Кодировка), ";charset=" + Кодировка, ""));
		
		Если ЗначениеЗаполнено(Агент) Тогда
			UserAgent = "Plugin1C v" + ВерсияПлагина() + " 1C v" + ОписаниеПриложения().ВерсияПриложения + "/" + Агент;
		Иначе
			UserAgent = "Plugin1C v" + ВерсияПлагина() + " 1C v" + ОписаниеПриложения().ВерсияПриложения + "/" + ОписаниеПриложения().СинонимКонфигурации;
		КонецЕсли;
		ПараметрыЗапроса.Заголовки.Вставить("User-Agent",  UserAgent);
		
		Если ЗначениеЗаполнено(КлючРазработчика) Тогда
			ПараметрыЗапроса.Заголовки.Вставить("Authorization", "DiadocAuth ddauth_api_client_id=" + КлючРазработчика + ?(ЗначениеЗаполнено(Токен), ",ddauth_token=" + Токен, ""));
		КонецЕсли;
		
		Возврат НоваяКоманда_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса);
		
	КонецФункции

	&НаКлиенте
	Функция РазобратьОтвет_ВыполнитьHTTPЗапрос(Ответ)
		
		Результат = Новый Структура("КодСостояния, ТелоОтвета, Заголовки", "", Неопределено, Новый Соответствие);
		
		response = Ответ.response;
		
		Если response.Свойство("statusCode") Тогда
			Результат.КодСостояния = response.statusCode;
		КонецЕсли;
		
		Если response.Свойство("headers") Тогда
			Результат.Вставить("Заголовки", NameValueCollection_В_Соответствие(response.headers));
		КонецЕсли;
		
		Если response.Свойство("Content") Тогда
			
			Результат.ТелоОтвета = Content_В_Контент(response.Content);
			
			Если ЗначениеЗаполнено(Результат.ТелоОтвета) Тогда
				
				Если Ответ.ДополнительныеПараметры.Свойство("ResultBinaryData") Тогда
					
					Результат.ТелоОтвета = Base64Значение(Результат.ТелоОтвета);
					
				ИначеЕсли Ответ.ДополнительныеПараметры.Свойство("AutoEncoding") Тогда
					
					Кодировка = КодировкаHTTPЗаголовка(Результат.Заголовки);
					Если НЕ ЗначениеЗаполнено(Кодировка) Тогда
						Кодировка = "utf-8"; // Кодировка по умолчанию
					КонецЕсли;
					
					Результат.ТелоОтвета = ПреобразоватьКонтент(Новый Структура("base64", Результат.ТелоОтвета), Новый Структура("string"), Кодировка);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции
	
	&НаКлиенте
	Функция НоваяКоманда_Таймаут(ВремяОжиданияВСекундах)
		
		ПустаяДата = Дата(1,1,1,0,0,0);
		
		ВремяОжидания = ПустаяДата + ВремяОжиданияВСекундах;
		
		СтрокаВремениISO = Формат(ВремяОжидания,"ДФ=HH:mm:ss");
		
		Результат = Команда_test_wait(СтрокаВремениISO);
		
		Возврат Результат;
		
	КонецФункции

	//}		ГЕНЕРАЦИЯ КОМАНД И РАЗБОР РЕЗУЛЬТАТА
	
	
//}		ПРИКЛАДНЫЕ МЕТОДЫ


//**********************************************
//{		СИНХРОННЫЕ ПРИКЛАДНЫЕ МЕТОДЫ API Диадока

&НаКлиенте
Функция DD_API_Authenticate(КлючРазработчика, Сертификат = "", Логин = "", Пароль = "") Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Сертификат) Тогда
		
		ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
		ПараметрыЗапроса.ТелоЗапроса = Новый Структура("base64", Сертификат);
		ПараметрыЗапроса.ТелоОтвета  = Новый Структура("base64");
		
		Ответ = ВыполнитьHTTPЗапросДиадок("POST", "/Authenticate", ПараметрыЗапроса, КлючРазработчика);
		
		ПроверитьHTTPКодСостояния200(Ответ);
		
		Результат = РасшифроватьКонтент(Новый Структура("base64", Ответ.ТелоОтвета));
		
	Иначе
		
		ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
		ПараметрыЗапроса.Параметры.ВставитЬ("login"   , Логин);
		ПараметрыЗапроса.Параметры.ВставитЬ("password", Пароль);
		ПараметрыЗапроса.Параметры.ВставитЬ("КодировкаОтвета", "utf-8");
		
		Ответ = ВыполнитьHTTPЗапросДиадок("POST", "/Authenticate", ПараметрыЗапроса, КлючРазработчика);
		
		ПроверитьHTTPКодСостояния200(Ответ);
		
		Результат = Ответ.ТелоОтвета;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция DD_API_GetBox(КлючРазработчика, boxId) Экспорт
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	ПараметрыЗапроса.Вставить("КодировкаОтвета", "utf-8");
	
	Ответ = ВыполнитьHTTPЗапросДиадок("GET", "/GetBox", ПараметрыЗапроса, КлючРазработчика);
	
	ПроверитьHTTPКодСостояния200(Ответ);
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

&НаКлиенте
Функция DD_API_GetCounteragentCertificates(КлючРазработчика, Токен, myOrgId, counteragentOrgId) Экспорт
	
	Параметры = НовыеПараметрыHTTPЗапроса();
	Параметры.Параметры.Вставить("myOrgId", myOrgId);
	Параметры.Параметры.Вставить("counteragentOrgId", counteragentOrgId);
	Параметры.Вставить("КодировкаОтвета", "utf-8");
	
	Ответ = ВыполнитьHTTPЗапросДиадок("GET", "/GetCounteragentCertificates", Параметры, КлючРазработчика, Токен);
	
	ПроверитьHTTPКодСостояния200(Ответ);
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

//}		СИНХРОННЫЕ ПРИКЛАДНЫЕ МЕТОДЫ API Диадока


//**********************************************
//{		ВЗАИМОДЕЙСТВИЕ С Kontur.Plugin

&НаКлиенте
Функция plugin()
	
	// В веб-клиенте подключение выполняется асинхронно,
	// с помощью метода НачатьУстановкуПлагинаВебКлиент
	
	Результат = Неопределено;
	
	КэшПлагинаОтключен = Кэш_Прочитать("КэшПлагинаОтключен");
	
	Если КэшПлагинаОтключен = Истина Тогда
		
		Результат = ПодключитьПлагин();
		
	Иначе
		
		Результат = Кэш_Прочитать("plugin");
		
		Если Результат = Неопределено Тогда
			
			Результат = ПодключитьПлагин();
			
			Кэш_Поместить("plugin", Результат);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция plugin_Send(Команда)
	
	КомандаXML = Структура_В_СтрокаXML(Команда);
	
	Логирование_ЗаписатьСтроку("Диадок.Плагин.КомандаSend", КомандаXML);
	
	Результат = plugin().Send(КомандаXML);
	
	Логирование_ЗаписатьСтроку("Диадок.Плагин.КомандаSend.Ответ", Результат);
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Функция plugin_SendAsync(TaskId, Команда)
	
	КомандаXML = Структура_В_СтрокаXML(Команда);
	
	Логирование_ЗаписатьСтроку("Диадок.Плагин.КомандаSendAsyn", КомандаXML);
	
	Возврат plugin().SendAsync(TaskId, КомандаXML);
	
КонецФункции

&НаКлиенте
Функция plugin_CallAsync(Команда)
	
	КомандаXML = Структура_В_СтрокаXML(Команда);
	
	Логирование_ЗаписатьСтроку("Диадок.Плагин.КомандаCallAsync", КомандаXML);
	
	Возврат plugin().CallAsync(КомандаXML);
	
КонецФункции

&НаКлиенте
Процедура plugin_Send_НачатьВызов(ОписаниеОповещения, Команда)
	
	КомандаXML = Структура_В_СтрокаXML(Команда);
	
	Логирование_ЗаписатьСтроку("Диадок.Плагин.НачатьВызовSend", КомандаXML);
	
	ОповещениеОЗавершении = НовыйОписаниеОповещения("plugin_Send_ЗавершитьВызов", ЭтаФорма, ОписаниеОповещения);
	
	plugin().НачатьВызовSend(ОповещениеОЗавершении, КомандаXML);
	
КонецПроцедуры

&НаКлиенте
Процедура plugin_Send_ЗавершитьВызов(Результат, Команда, ОписаниеОповещения) Экспорт
	
	Логирование_ЗаписатьСтроку("Диадок.Плагин.КомандаSend.НачатьВызовSendОтвет", Результат);
	
	РазобранныйРезультат = РазобратьОтветПлагина(Результат);
	
	ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, РазобранныйРезультат);
	
КонецПроцедуры

&НаКлиенте
Функция plugin_HasResult(TaskId)
	
	Возврат plugin().HasResult(TaskId) = Истина;
	
КонецФункции

&НаКлиенте
Функция plugin_GetResult(TaskId)
	
	Result = plugin().GetResult(TaskId);
	
	plugin().DeleteResult(TaskId);
	
	Логирование_ЗаписатьСтроку("Диадок.Плагин.GetResult.Ответ", Result);
	
	Возврат Result;
	
КонецФункции

&НаКлиенте
Процедура plugin_DeleteResult(TaskId)
	
	plugin().DeleteResult(TaskId);
	
КонецПроцедуры


&НаКлиенте
Функция Команда_http_request(method, uri, query = Неопределено, headers = Неопределено,
		requestBody = Неопределено, responseBody = Неопределено, timeout = Неопределено)
	
	Результат = Новый_command("http.request");
	
	Результат.command.Вставить("uri"   , uri);
	Результат.command.Вставить("method", method);
	
	Если ЗначениеЗаполнено(query) Тогда
		Результат.command.Вставить("query", query);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(headers) Тогда
		Результат.command.Вставить("headers", headers);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(requestBody) Тогда
		Результат.command.Вставить("requestBody", requestBody);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(timeout) Тогда
		Результат.command.Вставить("timeout", timeout);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(responseBody) Тогда
		Результат.command.Вставить("responseBody", responseBody);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_io_transfer(source, sink)
	
	Результат = Новый_command("io.transfer");
	
	Результат.command.Вставить("source", source);
	Результат.command.Вставить("sink"  , sink);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_cert_search(filter, properties = Неопределено)
	
	Результат = Новый_command("cert.search");
	
	Результат.command.Вставить("filter", filter);
	
	Если ЗначениеЗаполнено(properties) Тогда
		Результат.command.Вставить("properties", properties);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_cert_parse(cert, properties)
	
	Результат = Новый_command("cert.parse");
	
	Результат.command.Вставить("cert", cert);
	
	Если ЗначениеЗаполнено(properties) Тогда
		Результат.command.Вставить("properties", properties);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_sign(source, sink, certs)
	
	Результат = Новый_command("crypto.sign");
	
	Результат.command.Вставить("source", source);
	Результат.command.Вставить("sink"  , sink);
	Результат.command.Вставить("certs" , certs);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_verify(source, signature, certs = Неопределено)
	
	Результат = Новый_command("crypto.verify");
	
	Результат.command.Вставить("source"	  , source);
	Результат.command.Вставить("signature", signature);
	
	Если ЗначениеЗаполнено(certs) Тогда
		Результат.command.Вставить("certs", certs);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_signature_parse(source, certificateProperties = Неопределено, signerInfoProperties = Неопределено)
	
	Результат = Новый_command("crypto.signature.parse");
	
	Результат.command.Вставить("source", source);
	
	Если ЗначениеЗаполнено(certificateProperties) Тогда
		Результат.command.Вставить("properties", certificateProperties);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(signerInfoProperties) Тогда
		Результат.command.Вставить("signerInfo", signerInfoProperties);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_encrypt(source, sink, certs)
	
	Результат = Новый_command("crypto.encrypt");
	
	Результат.command.Вставить("source", source);
	Результат.command.Вставить("sink"  , sink);
	Результат.command.Вставить("certs" , certs);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_crypto_decrypt(source, sink)
	
	Результат = Новый_command("crypto.decrypt");
	
	Результат.command.Вставить("source", source);
	Результат.command.Вставить("sink"  , sink);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Команда_test_wait(wait_for)
	
	Результат = Новый_command("test.wait");
	
	Результат.command.Вставить("wait_for", wait_for);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_command(type)
	
	Результат = Новый Структура;
	Результат.Вставить("command", Новый Структура);
	Результат.command.Вставить("type", type);
	
	Результат.command.Вставить("custom_data", Новый Структура);
	Результат.command.custom_data.Вставить("command_type", type);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_content(ТипДанных, Данные = Неопределено, Кодировка = "")
	
	Результат = Новый Структура;
	Результат.Вставить("type", нрег(ТипДанных));
	
	Если Результат.type = "двоичныеданные" Тогда
		Результат.type = "base64";
	ИначеЕсли Результат.type = "строка" Тогда
		Результат.type = "string";
	ИначеЕсли Результат.type = "файл" Тогда
		Результат.type = "file";
	КонецЕсли;
	
	Если Результат.type = "string" И ЗначениеЗаполнено(Кодировка) Тогда
		Результат.Вставить("encoding", Кодировка);
	КонецЕсли;
	
	Если Данные <> Неопределено Тогда
		
		Если Результат.type = "file" Тогда
			Результат.Вставить("path", XMLСтрока_Обертка(Данные));
		Иначе
			Результат.Вставить("data", XMLСтрока_Обертка(Данные));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_certs(Сертификаты)
	
	Результат = Новый Массив;
	
	Если ТипЗнч(Сертификаты) = Тип("Массив") Тогда
		МассивСертификатов = Сертификаты;
	Иначе
		МассивСертификатов = Новый Массив;
		МассивСертификатов.Добавить(Сертификаты);
	КонецЕсли;
	
	Для Каждого Сертификат Из МассивСертификатов Цикл
		Результат.Добавить(Новый Структура("certificate", Новый_certificate(Сертификат)));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_cert_filter(ПараметрыФильтра)
						  
	Результат = Новый Структура;
	
	Если ПараметрыФильтра.Свойство("Отпечаток") Тогда
		Результат.Вставить("hash", Новый_content("hex", ПараметрыФильтра.Отпечаток));
	КонецЕсли;
	
	Если ПараметрыФильтра.Свойство("СерийныйНомер") Тогда
		Результат.Вставить("serialNumber", Новый_content("hex", ПараметрыФильтра.СерийныйНомер));
	КонецЕсли;
	
	Если ПараметрыФильтра.Свойство("ЕстьЗакрытыйКлюч") Тогда
		Результат.Вставить("hasPrivateKey", ПараметрыФильтра.ЕстьЗакрытыйКлюч = Истина);
	КонецЕсли;
	
	Если ПараметрыФильтра.Свойство("ТолькоПервый") Тогда
		Результат.Вставить("firstOnly", Истина);
	КонецЕсли;
	
	Результат.Вставить("store", Новый_cert_store(ПараметрыФильтра));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_cert_store(ПараметрыФильтра)
	
	Результат = Новый Структура;
	
	Если ТипЗнч(ПараметрыФильтра) = Тип("Структура") Тогда
		
		Если ПараметрыФильтра.Свойство("ТипХранилища") Тогда
			Результат.Вставить("storeName", Новый_cert_storeName(ПараметрыФильтра.ТипХранилища));
		КонецЕсли;
		
		Если ПараметрыФильтра.Свойство("РасположениеХранилища") Тогда
			Результат.Вставить("storeLocation", Новый_cert_storeLocation(ПараметрыФильтра.РасположениеХранилища));
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("storeType", "cryptoApi");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_cert_storeName(ТипХранилища)
	
	ТипыХранилища = Новый Соответствие;
	ТипыХранилища.Вставить(нрег("КорневыеСертификаты"), 			 "Root");
	ТипыХранилища.Вставить(нрег("ПерсональныеСертификаты"), 		 "My");
	ТипыХранилища.Вставить(нрег("СертификатыПолучателей"), 		     "AddressBook");
	ТипыХранилища.Вставить(нрег("СертификатыУдостоверяющихЦентров"), "CA");
	
	Результат = ТипыХранилища[нрег(ТипХранилища)];
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		ВызватьИсключение "Неизвестный тип хранилища сертификатов" + Символы.ПС + ТипХранилища;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
&НаКлиенте
Функция Новый_cert_storeLocation(РасположениеХранилища)
	
	РасположенияХранилища = Новый Соответствие;
	РасположенияХранилища.Вставить(нрег("ДанныеКомпьютера"),	 "machine");
	РасположенияХранилища.Вставить(нрег("ДанныеПользователяОС"), "user");
	
	Результат = РасположенияХранилища[нрег(РасположениеХранилища)];
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		ВызватьИсключение "Неизвестное расположение хранилища сертификатов" + Символы.ПС + РасположениеХранилища;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_certificate(Сертификат)
	
	Результат = Новый Структура;
	
	СертификатТип = ТипЗнч(Сертификат);
	
	Если СертификатТип = Тип("Строка") Тогда // Сертификат из любого хранилища по отпечатку
		
		Результат.Вставить("hash", Новый_content("hex", Сертификат));
		
	ИначеЕсли СертификатТип = Тип("ДвоичныеДанные") Тогда // Файл сертификата
		
		Результат.Вставить("content", Новый_content("base64", Сертификат));
		
	ИначеЕсли СертификатТип = Тип("Структура") Тогда
		
		Если Сертификат.Свойство("Отпечаток") Тогда
			
			 // Сертификат из указанного хранилища по отпечатку
			Результат.Вставить("hash", Новый_content("hex", Сертификат.Отпечаток));
			
			Если Сертификат.Свойство("ТипХранилища") Тогда
				Результат.Вставить("storeName", Новый_cert_storeName(Сертификат.ТипХранилища));
			КонецЕсли;
			
			Если Сертификат.Свойство("РасположениеХранилища") Тогда
				Результат.Вставить("storeLocation", Новый_cert_storeLocation(Сертификат.РасположениеХранилища));
			КонецЕсли;
			
		Иначе
			 // Контент сертификата
			 Результат.Вставить("content", Контент_В_Content(Сертификат));
		КонецЕсли;
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_certificateProperties(СвойстваСертификата) 
	
	Результат = Новый Структура;
	
	СоответствиеСвойств = Новый Соответствие;
	СоответствиеСвойств.Вставить(нрег("Отпечаток"),	 	  	  	"hash");
	СоответствиеСвойств.Вставить(нрег("СерийныйНомер"),	  	  	"serialNumber");
	СоответствиеСвойств.Вставить(нрег("ДвоичныеДанные"),  	 	"content");
	СоответствиеСвойств.Вставить(нрег("Издатель"),			  	"issuer");
	СоответствиеСвойств.Вставить(нрег("Субъект"),			  	"subject");
	СоответствиеСвойств.Вставить(нрег("ДатаНачала"),	  	  	"validFrom");
	СоответствиеСвойств.Вставить(нрег("ДатаОкончания"),	  	  	"validTo");
	СоответствиеСвойств.Вставить(нрег("ЕстьЗакрытыйКлюч"),	  	"hasPrivateKey");
	СоответствиеСвойств.Вставить(нрег("РасширенныеСвойства"),	"extensions");
	СоответствиеСвойств.Вставить(нрег("АлгоритмКлюча"),			"keyAlgorithm");
	
	Если ЗначениеЗаполнено(СвойстваСертификата) Тогда
		
		Для Каждого КлючИЗначение ИЗ СвойстваСертификата Цикл
			
			ИмяСвойства = КлючИЗначение.Ключ;
			
			Property = СоответствиеСвойств[нрег(ИмяСвойства)];
			
			Если НЕ ЗначениеЗаполнено(Property) Тогда
				ВызватьИсключение "Неизвестное свойство сертификата" + Символы.ПС + ИмяСвойства;
			КонецЕсли;
			
			Результат.Вставить(Property, Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Свойство("content") Тогда
		Результат.Вставить("content", Новый_content("base64"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_signerInfoProperties()
	
	Результат = Новый Структура;
	Результат.Вставить("serialNumber", Истина);
	
	Возврат Результат;
	
КонецФункции

//}		ВЗАИМОДЕЙСТВИЕ С Kontur.Plugin


//**********************************************
//{		СЛУЖЕБНЫЕ МЕТОДЫ Kontur.Plugin

&НаКлиенте
Функция ВыполнитьКоманду(Команда)
	
	Ответ = plugin_Send(Команда);
	Результат = РазобратьОтветПлагина(Ответ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьКоманду_Асинхронно(Команда)
	
	TaskId = Строка(Новый УникальныйИдентификатор);
	
	РезультатЗапуска = plugin_SendAsync(TaskId, Команда);
	
	Если РезультатЗапуска <> Истина Тогда
		ВызватьИсключение "Ошибка запуска асинхронной задачи" + Символы.ПС + РезультатЗапуска;
	КонецЕсли;
	
	Возврат TaskId;
		
КонецФункции

&НаКлиенте
Функция ВыполнитьКоманду_БезРезультата(Команда)
	
	УспешноЗапущена = plugin_CallAsync(Команда);
	
	Возврат УспешноЗапущена;
	
КонецФункции


&НаКлиенте
Процедура ПроверитьHTTPКодСостояния200(Ответ)
	
	Если Ответ.КодСостояния <> "200" Тогда
		
		ОписаниеОшибки = "Ошибка HTTP запроса"
		+ ?(ЗначениеЗаполнено(Ответ.КодСостояния), Символы.ПС + Ответ.КодСостояния, "")
		+ ?(ЗначениеЗаполнено(Ответ.ТелоОтвета)  , Символы.ПС + Ответ.ТелоОтвета  , "");

	Иначе
		Возврат;
	КонецЕсли;
	
	ВызватьИсключение ОписаниеОшибки;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьPluginError(Ответ)
	
	Если Не Ответ.Свойство("error") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "Ошибка Kontur.1C.Plugin.Host";
	
	Для Каждого КлючИЗначение Из Ответ.error Цикл
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + КлючИЗначение.Ключ + " : " + КлючИЗначение.Значение;
	КонецЦикла;
	
	ВызватьИсключение ОписаниеОшибки;
	
КонецПроцедуры

&НаКлиенте
Функция ТипКонтента(Контент)
	
	Результат = Неопределено;
	
	КонтентТип = ТипЗнч(Контент);
	
	Если КонтентТип = Тип("ДвоичныеДанные") Тогда
		
		Результат = "ДвоичныеДанные";
		
	ИначеЕсли КонтентТип = Тип("Строка") Тогда
		
		Результат = "string";
		
	ИначеЕсли КонтентТип = Тип("Структура") Тогда
		
		ТипыКонтента = Новый Структура;
		
		ТипыКонтента.Вставить("ДвоичныеДанные", "ДвоичныеДанные");
		ТипыКонтента.Вставить("Строка"		  ,	"string");
		ТипыКонтента.Вставить("Файл"		  ,	"file");
		
		ТипыКонтента.Вставить("string"		  ,	"string");
		ТипыКонтента.Вставить("base64"		  ,	"base64");
		ТипыКонтента.Вставить("hex"			  ,	"hex");
		ТипыКонтента.Вставить("file"		  , "file");
		
		Для Каждого КлючИЗначение ИЗ Контент Цикл
			
			Если НЕ ТипыКонтента.Свойство(КлючИЗначение.Ключ, Результат) Тогда
				ВызватьИсключение "Недопустимый тип контента" + Символы.ПС + КлючИЗначение.Ключ;
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Content_В_Контент(content)
	
	Результат = Неопределено;
	
	Если content.type = "file" Тогда
		Результат = content.path;
	Иначе
		Результат = content.data;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контент_В_Content(Контент, Кодировка = "")
	
	Результат = Неопределено;
	
	ТипКонтента = ТипКонтента(Контент);
	
	Если ТипЗнч(Контент) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение ИЗ Контент Цикл
			Данные = КлючИЗначение.Значение;
			Прервать;
		КонецЦикла;
	Иначе
		Данные = Контент;
	КонецЕсли;
	
	Результат = Новый_content(ТипКонтента, Данные, Кодировка);
	
	Возврат Результат;
		
КонецФункции

&НаКлиенте
Функция Соответствие_В_NameValueCollection(Коллекция)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Коллекция) Тогда
		
		Для Каждого КлючИЗначение ИЗ Коллекция Цикл
			
			НовыйЭлемент = Новый Структура("item", Новый Структура);
			НовыйЭлемент.item.Вставить("name" , КлючИЗначение.Ключ);
			НовыйЭлемент.item.Вставить("value", КлючИЗначение.Значение);
			
			Результат.Добавить(НовыйЭлемент);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция NameValueCollection_В_Соответствие(NameValueCollection)
	
	Результат = Новый Соответствие;
	
	Если ЗначениеЗаполнено(NameValueCollection) Тогда
		
		Для Каждого NameValue ИЗ NameValueCollection Цикл
			
			Результат.Вставить(NameValue.item.name, NameValue.item.value);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КодировкаHTTPЗаголовка(Заголовки)
	
	Результат = "";
	
	ЗначениеЗаголовка = Заголовки["Content-Type"];
	
	Если ЗначениеЗаголовка = Неопределено Тогда
		ЗначениеЗаголовка = Заголовки["content-type"];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеЗаголовка) Тогда
		
		Позиция = Найти(ЗначениеЗаголовка, "charset=");
		Позиция = ?(Позиция > 0, Позиция + 8, 0);
		
		Если Позиция > 0 Тогда
			Результат = Сред(ЗначениеЗаголовка, Позиция);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_ОписаниеСертификата(certificate_info)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отпечаток", Content_В_Контент(certificate_info.hash));
	
	Если certificate_info.Свойство("serialNumber") Тогда
		Результат.Вставить("СерийныйНомер", Content_В_Контент(certificate_info.serialNumber));
	КонецЕсли;
	
	Если certificate_info.Свойство("issuer") Тогда
		Результат.Вставить("Издатель", certificate_info.issuer);
	КонецЕсли;
	
	Если certificate_info.Свойство("subject") Тогда
		Результат.Вставить("Субъект", certificate_info.subject);
	КонецЕсли;
	
	Если certificate_info.Свойство("content") Тогда
		Результат.Вставить("ДвоичныеДанные", Base64Значение(certificate_info.content.data));
	КонецЕсли;
	
	Если certificate_info.Свойство("validFrom") Тогда
		Результат.Вставить("ДатаНачала", XMLЗначение(Тип("Дата"), certificate_info.validFrom));
	КонецЕсли;
	
	Если certificate_info.Свойство("validTo") Тогда
		Результат.Вставить("ДатаОкончания", XMLЗначение(Тип("Дата"), certificate_info.validTo));
	КонецЕсли;
	
	Если certificate_info.Свойство("hasPrivateKey") Тогда
		Результат.Вставить("ЕстьЗакрытыйКлюч", XMLЗначение(Тип("Булево"), certificate_info.hasPrivateKey));
	КонецЕсли;
	
	Если certificate_info.Свойство("extensions") Тогда
		Результат.Вставить("РасширенныеСвойства", certificate_info.extensions);
	КонецЕсли;
	
	Если certificate_info.Свойство("keyAlgorithm") Тогда
		Результат.Вставить("АлгоритмКлюча", certificate_info.keyAlgorithm);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		СЛУЖЕБНЫЕ МЕТОДЫ Kontur.Plugin


//**********************************************
//{		СЕРИАЛИЗАЦИЯ


#Если ВебКлиент Тогда
	
&НаКлиенте
Функция XMLЗначение(Тип, Значение)
	
	Если Тип = Тип("Дата") Тогда
		// 2017-08-04T08:44:35Z
		Результат = Сред(Значение, 1, 19);
		Результат = СтрЗаменить(Результат, "-", "");
		Результат = СтрЗаменить(Результат, "T", "");
		Результат = СтрЗаменить(Результат, ":", "");
		Возврат Дата(Результат);
		
	ИначеЕсли Тип = Тип("Булево") Тогда
		
		Возврат (Значение = "true");
		
	Иначе
		
		ВызватьИсключение "Не реализовано";
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция XMLСтрока(Значение)
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Возврат Формат(Значение, "БЛ=true; БИ=false");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка")  Тогда
		
		Возврат Значение;
		
	ИначеЕсли Значение = Неопределено  Тогда
		
		Возврат "";
		
	Иначе
		
		Возврат XmlСтрокаНаСервереБезКонтекста(Значение);
		//ВызватьИсключение "Не реализовано";
		
	КонецЕсли;
	
КонецФункции

#КонецЕсли
	
// для веб-клиента
Функция XmlСтрокаНаСервереБезКонтекста(ЗНАЧ Значение)
	Возврат XMLСтрока(Значение);
КонецФункции

&НаКлиенте
Функция Структура_В_СтрокаXML(Структура)
	
	#Если ВебКлиент Тогда
		Возврат Структура_В_СтрокаXML_НаСервереБезКонтекста(Структура);
	#Иначе
		Возврат Структура_В_СтрокаXML_НаКлиенте(Структура);
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Функция Структура_В_СтрокаXML_НаКлиенте(Структура)
	
	#Если Не ВебКлиент Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		Значение_В_ЗаписьXML(Структура, ЗаписьXML);
		
		Возврат ЗаписьXML.Закрыть();
		
	#КонецЕсли
	
КонецФункции

&НаСервереБезКонтекста
Функция Структура_В_СтрокаXML_НаСервереБезКонтекста(Структура)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	Значение_В_ЗаписьXML_НаСервереБезКонтекста(Структура, ЗаписьXML);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

&НаКлиенте
Процедура Значение_В_ЗаписьXML(Значение, ЗаписьXML)

	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначение ИЗ Значение Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента(КлючИЗначение.Ключ);
			
			Значение_В_ЗаписьXML(КлючИЗначение.Значение, ЗаписьXML);
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		
		Для Каждого ЭлементМассива ИЗ Значение Цикл
			
			Значение_В_ЗаписьXML(ЭлементМассива, ЗаписьXML);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		Если Лев(Значение, 1) = "<" Тогда
			ЗаписьXML.ЗаписатьСекциюCDATA(Значение);
		Иначе
			ЗаписьXML.ЗаписатьТекст(Значение);
		КонецЕсли;
		
	Иначе
		
		ЗаписьXML.ЗаписатьТекст(XMLСтрока_Обертка(Значение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Значение_В_ЗаписьXML_НаСервереБезКонтекста(Значение, ЗаписьXML)

	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначение ИЗ Значение Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента(КлючИЗначение.Ключ);
			
			Значение_В_ЗаписьXML_НаСервереБезКонтекста(КлючИЗначение.Значение, ЗаписьXML);
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		
		Для Каждого ЭлементМассива ИЗ Значение Цикл
			
			Значение_В_ЗаписьXML_НаСервереБезКонтекста(ЭлементМассива, ЗаписьXML);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		Если Лев(Значение, 1) = "<" Тогда
			ЗаписьXML.ЗаписатьСекциюCDATA(Значение);
		Иначе
			ЗаписьXML.ЗаписатьТекст(Значение);
		КонецЕсли;
		
	Иначе
		
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Значение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОтветПлагина_В_Структуру(СтрокаXML)
	
	#Если Не ВебКлиент Тогда
		Возврат ОтветПлагина_В_Структуру_НаКлиенте(СтрокаXML);
	#Иначе
		Возврат ОтветПлагина_В_Структуру_НаСервереБезКонтекста(СтрокаXML);
	#КонецЕсли	
	
КонецФункции

&НаКлиенте
Функция ОтветПлагина_В_Структуру_НаКлиенте(СтрокаXML)
	
	#Если Не ВебКлиент Тогда
	
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		
		// Помещаем туда <custom_data>
		ДополнительныеПараметры = Неопределено;
		
		Результат = СтрокаXML_В_Значение(ЧтениеXML, ДополнительныеПараметры);
		
		// Результат всегда структура
		Результат.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		
		Возврат Результат;
		
	#КонецЕсли
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтветПлагина_В_Структуру_НаСервереБезКонтекста(СтрокаXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	// Помещаем туда <custom_data>
	ДополнительныеПараметры = Неопределено;
	
	Результат = СтрокаXML_В_Значение_НаСервереБезКонтекста(ЧтениеXML, ДополнительныеПараметры);
	
	// Результат всегда структура
	Результат.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтрокаXML_В_Значение(ЧтениеXML, ДополнительныеПараметры)
	
	#Если Не ВебКлиент Тогда
		
	Результат = Новый Структура;
	
	Если ЧтениеXML.Прочитать() Тогда
		
		Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				Ключ 	 = СтрЗаменить(ЧтениеXML.Имя, ".", "_");
				Значение = СтрокаXML_В_Значение(ЧтениеXML, ДополнительныеПараметры);
				
				Если Ключ = "custom_data" Тогда
					
					ДополнительныеПараметры = Значение;
					
				Иначе
					
					Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство(Ключ) Тогда
						
						НовыйМассив = Новый Массив;
						НовыйМассив.Добавить(Результат);
						Результат = НовыйМассив;
						
					КонецЕсли;
					
					Если ТипЗнч(Результат) = Тип("Структура") Тогда
						
						Результат.Вставить(Ключ, Значение);
						
					ИначеЕсли ТипЗнч(Результат) = Тип("Массив") Тогда
						
						Результат.Добавить(Новый Структура(Ключ, Значение));
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				
				Результат = ЧтениеXML.Значение;
				
			КонецЕсли;
			
			Если НЕ ЧтениеXML.Прочитать() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
	#КонецЕсли
	
КонецФункции


&НаСервереБезКонтекста
Функция СтрокаXML_В_Значение_НаСервереБезКонтекста(ЧтениеXML, ДополнительныеПараметры)
	
		Результат = Новый Структура;
		
		Если ЧтениеXML.Прочитать() Тогда
			
			Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
				
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					
					Ключ 	 = СтрЗаменить(ЧтениеXML.Имя, ".", "_");
					Значение = СтрокаXML_В_Значение_НаСервереБезКонтекста(ЧтениеXML, ДополнительныеПараметры);
					
					Если Ключ = "custom_data" Тогда
						
						ДополнительныеПараметры = Значение;
						
					Иначе
						
						Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство(Ключ) Тогда
							
							НовыйМассив = Новый Массив;
							НовыйМассив.Добавить(Результат);
							Результат = НовыйМассив;
							
						КонецЕсли;
						
						Если ТипЗнч(Результат) = Тип("Структура") Тогда
							
							Результат.Вставить(Ключ, Значение);
							
						ИначеЕсли ТипЗнч(Результат) = Тип("Массив") Тогда
							
							Результат.Добавить(Новый Структура(Ключ, Значение));
							
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
					
					Результат = ЧтениеXML.Значение;
					
				КонецЕсли;
				
				Если НЕ ЧтениеXML.Прочитать() Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат Результат;
		
КонецФункции

&НаКлиенте
Функция XMLСтрока_Обертка(Значение)
	
	Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		
		// Удаляем символы перевода строки и возврата каретки, которые платформа добавляет в base64 строку.
		Результат = СтрЗаменить(СтрЗаменить(XMLСтрока(Значение), Символы.ПС, ""), Символы.ВК, "");
		
	Иначе
		
		Результат = XMLСтрока(Значение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		СЕРИАЛИЗАЦИЯ


//**********************************************
//{		ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ОбработкаОбъект()
	
	Попытка
		Результат = Вычислить("РеквизитФормыВЗначение(""Объект"")");
	Исключение
		Результат = Вычислить("ЭтотОбъект");
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьМакетОбработки(ИмяМакета)
	
	Результат = ОбработкаОбъект().ПолучитьМакет(ИмяМакета);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СинонимКонфигурации()
	
	Возврат Метаданные.Синоним;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРазрядностьПлатформы()
	
	Результат = 32;
	
	Если Найти(ОписаниеПриложения().ТипПлатформы, "64") > 0 Тогда
		Результат = 64;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьРазрядностьПлатформы

&НаКлиенте
Функция ПолучитьТипПлатформы()
	
	Результат = СистемнаяИнформация().ТипПлатформы;
	
	Возврат Результат;
	
КонецФункции // ПолучитьТипПлатформы

&НаКлиенте
Функция ОписаниеПриложения()
	
	Результат = Кэш_Прочитать("ОписаниеПриложения");
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("СинонимКонфигурации", СинонимКонфигурации());
		
		Результат.Вставить("ВерсияОС");
		Результат.Вставить("ВерсияПриложения");
		Результат.Вставить("ИдентификаторКлиента");
		Результат.Вставить("ИнформацияПрограммыПросмотра");
		Результат.Вставить("ОперативнаяПамять");
		Результат.Вставить("Процессор");
		Результат.Вставить("ТипПлатформы");
		
		ЗаполнитьЗначенияСвойств(Результат, Новый СистемнаяИнформация);
		Результат.ТипПлатформы		   = Строка(Результат.ТипПлатформы);
		Результат.ИдентификаторКлиента = Строка(Результат.ИдентификаторКлиента);
		
		Кэш_Поместить("ОписаниеПриложения", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СистемнаяИнформация()
	
	Возврат Новый СистемнаяИнформация;
	
КонецФункции

// Записывает переданный текст в лог
// Предварительно должно быть указано Ядро. 
// см. ИнициализироватьМодуль()
//
// Параметры:
//  ВидОперации - Строка - идентификатор операции
//  СтрокаДляЛогирования - Строка
//
&НаКлиенте
Процедура Логирование_ЗаписатьСтроку(ВидОперации, СтрокаДляЛогирования)
	
	Если Ядро = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ядро.РежимЛогированияВключен() Тогда
		Ядро.Ошибка_Обработать(ВидОперации, СтрокаДляЛогирования);
	КонецЕсли;
	
КонецПроцедуры  

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, Результат)
	
	#Если ВебКлиент Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);
		
	#Иначе
		
		Если НЕ ЭтоСтруктура(ОписаниеОповещения) Тогда
			Выполнить("ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат)");
		Иначе 
			// Если модальность не запрещена, то в ОписаниеОповещения у нас будет Структура
			Выполнить("ОписаниеОповещения.Модуль." + ОписаниеОповещения.ИмяПроцедуры + "(Результат, ОписаниеОповещения.ДополнительныеПараметры)");
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

//}		ОБЩЕГО НАЗНАЧЕНИЯ


//**********************************************
//{		УСТАНОВКА ПЛАГИНА

&НаКлиенте
Функция СоздатьОбъектПлагина()
	
	Попытка
		
		Результат = Новый("AddIn.KonturPlugin.Kontur.1C.Plugin.SA");
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодключитьПлагин() Экспорт
	
	ВерсияПлагина		= ВерсияПлагина();
	
	АдресКомпоненты 	= ПолучитьПолныйПутьКомпоненты();
	
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(АдресКомпоненты, ИмяВнешнейКомпоненты(), ТипВнешнейКомпоненты.Native);
	
	Если Не КомпонентаПодключена Тогда 
		
		ОписаниеОш = НСтр("ru = 'Не удалось подключить внешнюю компоненту %ИмяВК% (%ИмяФайлаВК%)'");
		ОписаниеОш = СтрЗаменить(ОписаниеОш
						, "%ИмяВК%"
						, ИмяВнешнейКомпоненты());
		ОписаниеОш = СтрЗаменить(ОписаниеОш
						, "%ИмяФайлаВК%"
						, АдресКомпоненты);
		
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
	Результат = СоздатьОбъектПлагина();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПолныйПутьКомпоненты()
	
	ВерсияПлагина = ВерсияПлагина();
	ТипПлатформыОС = ПолучитьТипПлатформы();
	ВремКаталог = КаталогВременныхФайлов();
	
	ИмяФайлаСохранения = "";
	
	Если ТипПлатформыОС = ТипПлатформы.Linux_x86_64 Тогда
		
		ИмяЭлементаАрхива	 = "kontur.1c.plugin.napi64." + ВерсияПлагина +".so";
		ИмяФайлаСохранения	 = ВремКаталог + ИмяЭлементаАрхива;
		
	ИначеЕсли ТипПлатформыОС = ТипПлатформы.Windows_x86_64 Тогда	
		
		ИмяЭлементаАрхива	 = "kontur.1c.plugin.napi64." + ВерсияПлагина +".dll";
		ИмяФайлаСохранения	 = ВремКаталог + ИмяЭлементаАрхива;
		
	Иначе
		
		ИмяЭлементаАрхива	 = "kontur.1c.plugin.napi32." + ВерсияПлагина +".dll";
		ИмяФайлаСохранения	 = ВремКаталог + ИмяЭлементаАрхива;
		
	КонецЕсли;
	
	ФайлВК		 = Новый Файл(ИмяФайлаСохранения);
	Если НЕ ФайлВК.Существует() Тогда
		РазархивироватьКомпоненту(ИмяЭлементаАрхива);
	КонецЕсли;
	
	Возврат ИмяФайлаСохранения;
	
КонецФункции

&НаКлиенте
Процедура РазархивироватьКомпоненту(ИмяЭлементаАрхива)
	
	ВремКаталог 	= КаталогВременныхФайлов();
	ИмяZIP 			= "Plugin.zip";
	ПолныйПутьZip 	= ВремКаталог + ИмяZIP;
	
	Макет = ПолучитьМакетОбработки("Plugin");
	Макет.Записать(ПолныйПутьZip);
	
	ЧтениеЗип = Новый ЧтениеZipФайла(ПолныйПутьZip);
	
	ЭлементФайла = ЧтениеЗип.Элементы.Найти(ИмяЭлементаАрхива);
	Если Не ЭлементФайла = Неопределено Тогда
		
		ЧтениеЗип.Извлечь(ЭлементФайла, ВремКаталог);
		
	КонецЕсли;
	
	ЧтениеЗип.Закрыть();
	
	УдалитьФайлы(ПолныйПутьZip);
	
КонецПроцедуры

&наКлиенте
Функция ПроверитьВозможностьПереустановки(АдресКомпоненты, ИмяКомпоненты, ТипКомпоненты)
	
	Результат = Истина;
	
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
	АдресКомпоненты,
	ИмяКомпоненты,
	ТипКомпоненты);
	
	Если КомпонентаПодключена Тогда
		
		plugin = СоздатьОбъектПлагина();
		Если СокрЛП(plugin.Version) = ВерсияПлагина() Тогда
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеУстановкиКомпоненты(Результат) Экспорт
	

	
КонецПроцедуры

&НаСервере
Функция ЗапрещенаМодальность()
	
	Результат = Метаданные.РежимИспользованияМодальности <> Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.Использовать;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресКомпоненты() Экспорт
	
	МакетКомпоненты = ОбработкаОбъект().ПолучитьМакет("Plugin");
	АдресКомпоненты = ПоместитьВоВременноеХранилище(МакетКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресКомпоненты;
	
КонецФункции

&НаКлиенте
Функция НачатьУстановкуПлагинаВебКлиент(ОповещениеОЗавершении) Экспорт
	
	#Если ВебКлиент Тогда
		
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			УстановитьРасширениеРаботыСФайлами();
			ПодключитьРасширениеРаботыСФайлами();
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		
		ВерсияПлагина	 = ВерсияПлагина();
		
		ОбъектПлагина = СоздатьОбъектПлагина();
		
		Если ОбъектПлагина <> Неопределено Тогда
			
			ДопПараметры.Вставить("ОбъектПлагина", ОбъектПлагина);
			
			ОбработчикЗавершенияУстановкиПлагина(ДопПараметры);
			
		Иначе
			
			ОбработчикЗавершенияЗаписиФайлаХостаНаДиск(ДопПараметры);
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗавершенияЗаписиФайлаХостаНаДиск(ДопПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		
		АдресФайлаВК = АдресФайлаВКДляВебКлиента();
		
		ВКПодключена = ПодключитьВнешнююКомпоненту(АдресФайлаВК, ИмяВнешнейКомпоненты(), ТипВнешнейКомпоненты.Native);
		
		Если ВКПодключена Тогда
			
			ДопПараметры.Вставить("ВКПодключена", ВКПодключена);
			
			ОбработчикЗавершенияУстановкиПлагина(ДопПараметры);
			
		Иначе
			
			ДопПараметры.Вставить("АдресФайлаВК", АдресФайлаВК);
			
			ОписаниеОповещения = НовыйОписаниеОповещения("ОбработчикЗавершенияУстановкиВК", ЭтаФорма, ДопПараметры);
			
			НачатьУстановкуВнешнейКомпоненты(ОписаниеОповещения, АдресФайлаВК);
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияУстановкиВК(ДопПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		
		АдресФайлаВК = ДопПараметры.АдресФайлаВК;
		
		ВКПодключена = ПодключитьВнешнююКомпоненту(АдресФайлаВК, ИмяВнешнейКомпоненты(), ТипВнешнейКомпоненты.Native);
		
		ДопПараметры.Вставить("ВКПодключена", ВКПодключена);
		
		ОбработчикЗавершенияУстановкиПлагина(ДопПараметры);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияУстановкиПлагина(ДопПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		
		ОбъектПлагина	 = Неопределено;
		ВКПодключена	 = Неопределено;
		
		ДопПараметры.Свойство("ОбъектПлагина"	, ОбъектПлагина);
		ДопПараметры.Свойство("ВКПодключена"	, ВКПодключена);
		
		Если ОбъектПлагина = Неопределено И ВКПодключена = Истина Тогда
			ОбъектПлагина = СоздатьОбъектПлагина();
		КонецЕсли;
		
		Если ОбъектПлагина = Неопределено Тогда
			
			ТекстОшибки = НСтр("ru = 'Не удалось подключить ""Kontur.1C.Plugin""'");
			
			ВызватьИсключение ТекстОшибки;
			
			
		Иначе
			
			Кэш_Поместить("plugin", ОбъектПлагина);
			
			ВыполнитьОбработкуОповещенияПереопределенная(ДопПараметры.ОповещениеОЗавершении);
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция АдресФайлаВКДляВебКлиента()
	
	Отладка = Ложь;
	
	Если Отладка Тогда
		
		КаталогПлагина = ".\";
		Файлы = НайтиФайлы(КаталогПлагина + "bundle_web\", "*");
		Запись = Новый ЗаписьZipФайла(КаталогПлагина + "bundle_web.zip");
		
		Для Каждого Файл Из Файлы Цикл
			Запись.Добавить(Файл.ПолноеИмя, РежимСохраненияПутейZIP.НеСохранятьПути);
		КонецЦикла;
		Запись.Записать();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(КаталогПлагина + "bundle_web.zip");
		
	Иначе
		
		ДвоичныеДанные = ПолучитьМакетОбработки("Plugin_web_zip");
		
	КонецЕсли;
	
	Результат = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИмяВнешнейКомпоненты()
	Возврат "KonturPlugin";
КонецФункции

//}		УСТАНОВКА ПЛАГИНА


//**********************************************
//{		КЭШИРОВАНИЕ

&НаКлиенте
Функция Кэш_Прочитать(ИмяЗначения)
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Возврат Кэш[ИмяЗначения];
	
КонецФункции

&НаКлиенте
Процедура Кэш_Поместить(ИмяЗначения, Значение)
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Кэш.Вставить(ИмяЗначения, Значение);
	
КонецПроцедуры

//}		КЭШИРОВАНИЕ
