////////////////////////////////////////////////////////////////////////////////
// Методы для работы с коллекциями:
// - работа с массивами
// - работа со структурами
// - работа с соответствиями
// - работа со списками значениями
// - работа с таблицами значений
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Модуль содержит процедуры и функции из Библиотеки стандартных подсистем,
// распространяемой под лицензией Attribution 4.0 International (CC BY 4.0)
// https://creativecommons.org/licenses/by/4.0/legalcode производны от нее
// или вдохновлены ею, является ООО 1С-Софт (https://1c.ru/).
// Авторские права 2024 г. принадлежат ООО 1С-Софт. Все права защищены.
//
// Процедуры и функции из Библиотеки стандартных подсистем:
// - УдалитьЗначениеИзМассиваЛок
// - УдалитьВсеВхожденияЗначенияИзМассиваЛок
// - ДополнитьТаблицуЛок
// - ДополнитьМассивЛок
// - ДополнитьСтруктуруЛок
// - ДополнитьСоответствиеЛок
// - СкопироватьРекурсивноЛок
// - СвернутьМассивЛок
// - ЗначениеВМассивеЛок
// - СвойствоСтруктурыЛок
// - ФиксированныеДанныеЛок
// - ПроверкаФиксированностиДанных
// - СкопироватьЗначенияТаблицыЗначенийЛок
// - СкопироватьЗначенияСтрокиДереваЗначенийЛок
// - СкопироватьСтруктуруЛок
// - СкопироватьСоответствиеЛок
// - СкопироватьМассивЛок
// - СкопироватьСписокЗначенийЛок
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
&НаКлиенте
Перем СтдКлиентЛок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// БСП

// Удаляет значение из массива, если оно в нем есть
//
// Параметры:
//  Массив - Массив - массив, из которого нужно удалить значение;
//  Значение - Значение - значение, которое нужно удалить;
//
&НаКлиенте
Процедура УдалитьЗначениеИзМассиваЛок(Массив, Значение) Экспорт
	
	ИндексЗначения = Массив.Найти(Значение);
	
	Если ИндексЗначения <> Неопределено Тогда
		Массив.Удалить(ИндексЗначения);
	КонецЕсли;
	
КонецПроцедуры // УдалитьЗначениеИзМассиваЛок

// Удаляет все вхождения переданного значения из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Произвольный - удаляемое значение из массива.
//
&НаКлиенте
Процедура УдалитьВсеВхожденияЗначенияИзМассиваЛок(Массив, Значение) Экспорт
	
	КоличествоЭлементовВМассиве = Массив.Количество();
	
	Для НомерЭлемента = 1 По КоличествоЭлементовВМассиве Цикл
		
		ИндексЭлемента = КоличествоЭлементовВМассиве - НомерЭлемента;
		
		Если Массив[ИндексЭлемента] = Значение Тогда
			
			Массив.Удалить(ИндексЭлемента);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УдалитьВсеВхожденияЗначенияИзМассиваЛок

// Дополняет таблицу значений - приемник данными из таблицы значений - источника.
// Типы ТаблицаЗначений, ДеревоЗначений, ТабличнаяЧасть не доступны на клиенте.
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений
//                  - ДеревоЗначений
//                  - ТабличнаяЧасть
//                  - ДанныеФормыКоллекция - таблица, из которой будут
//                    браться строки для заполнения;
//  ТаблицаПриемник - ТаблицаЗначений
//                  - ДеревоЗначений
//                  - ТабличнаяЧасть
//                  - ДанныеФормыКоллекция - таблица, в которую будут
//                    добавлены строки из таблицы-источника.
//
&НаКлиенте
Процедура ДополнитьТаблицуЛок(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры // ДополнитьТаблицуЛок

// Дополняет массив значениями из другого массива
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник - Массив - массив, из которого нужно взять значения;
//  ТолькоНовые - Булево - (необязательный) Истина, если в приемник
//					нужно добавить только те значения, которых там еще нет;
//
&НаКлиенте
Процедура ДополнитьМассивЛок(МассивПриемник, МассивИсточник, ТолькоНовые = Ложь) Экспорт
	
	Если ТолькоНовые Тогда
		
		ЗначенияПриемника = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			ЗначенияПриемника.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			
			Если ЗначенияПриемника[Значение] = Неопределено Тогда
				
				МассивПриемник.Добавить(Значение);
				
				ЗначенияПриемника.Вставить(Значение, Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ДополнитьМассивЛок

// Дополняет структуру значениями из другой структуры.
//
// Параметры:
//   СтруктураПриемник - Структура - коллекция, в которую будут добавляться новые значения.
//   СтруктураИсточник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь   - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
&НаКлиенте
Процедура ДополнитьСтруктуруЛок(СтруктураПриемник, СтруктураИсточник, Заменять = Неопределено) Экспорт
	
	Для Каждого Элемент Из СтруктураИсточник Цикл
		
		Если Заменять <> Истина И СтруктураПриемник.Свойство(Элемент.Ключ) Тогда
			
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ОписаниеИсключения = НСтр("ru = 'Пересечение ключей источника и приемника: ""%1"".'");
				
				ВызватьИсключение СтдКлиентЛок.Стр().ПодставитьПараметрыВСтрокуЛок(ОписаниеИсключения, Элемент.Ключ);
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураПриемник.Вставить(Элемент.Ключ, Элемент.Значение);
		
	КонецЦикла;
	
КонецПроцедуры // ДополнитьСтруктуруЛок

// Дополняет соответствие значениями из другой соответствия.
//
// Параметры:
//   СоответствиеПриемник - Соответствие - коллекция, в которую будут добавляться новые значения.
//   СоответствиеИсточник - Соответствие - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
&НаКлиенте
Процедура ДополнитьСоответствиеЛок(СоответствиеПриемник, СоответствиеИсточник, Заменять = Неопределено) Экспорт
	
	Для Каждого Элемент Из СоответствиеИсточник Цикл
		
		Если Заменять <> Истина И СоответствиеПриемник[Элемент.Ключ] <> Неопределено Тогда
			
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ОписаниеИсключения = НСтр("ru = 'Пересечение ключей источника и приемника: ""%1"".'");
				
				ВызватьИсключение СтдКлиентЛок.Стр().ПодставитьПараметрыВСтрокуЛок(ОписаниеИсключения, Элемент.Ключ);
			КонецЕсли;
			
		КонецЕсли;
		
		СоответствиеПриемник.Вставить(Элемент.Ключ, Элемент.Значение);
		
	КонецЦикла;
	
КонецПроцедуры // ДополнитьСоответствиеЛок

// Создает полную копию структуры, соответствия, массива, таблицы значений или списка, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// Параметры:
//  Источник - Структура, ФиксированнаяСтруктура - объект, который необходимо скопировать
//           - Соответствие, ФиксированноеСоответствие - объект, который необходимо скопировать
//           - Массив, ФиксированныйМассив - объект, который необходимо скопировать
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево - Истина/Ложь Зафиксировать/снять фиксацию
//                    - Неопределено - Не изменять (По умолчанию)
//
// Возвращаемое значение:
//  - Структура, ФиксированнаяСтруктура - Копия объекта, переданного в параметре Источник
//  - Соответствие, ФиксированноеСоответствие - Копия объекта, переданного в параметре Источник
//  - Массив, ФиксированныйМассив - Копия объекта, переданного в параметре Источник
//  - СписокЗначений - Копия объекта, переданного в параметре Источник
//
&НаКлиенте
Функция СкопироватьРекурсивноЛок(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("Структура")
		ИЛИ ТипИсточника = Тип("ФиксированнаяСтруктура") Тогда
		Приемник = СкопироватьСтруктуруЛок(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Соответствие")
		ИЛИ ТипИсточника = Тип("ФиксированноеСоответствие") Тогда
		Приемник = СкопироватьСоответствиеЛок(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Массив")
		ИЛИ ТипИсточника = Тип("ФиксированныйМассив") Тогда
		Приемник = СкопироватьМассивЛок(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = СкопироватьСписокЗначенийЛок(Источник, ФиксироватьДанные);
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции // СкопироватьРекурсивноЛок

// Возвращает массив уникальных значений (аналогия множества)
//
// Параметры:
//  Массив - Массив, ФиксированныйМассив - массив, который необходимо свернуть;
//
// Возвращаемое значение:
//  Массив, ФиксированныйМассив - свернутый массив
//
&НаКлиенте
Функция СвернутьМассивЛок(Знач Массив) Экспорт
	
	Результат = Новый Массив;
	
	ДополнитьМассивЛок(Результат, Массив, Истина);
	
	Возврат Результат;
	
КонецФункции // СвернутьМассивЛок

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив - массив из одного элемента.
//
&НаКлиенте
Функция ЗначениеВМассивеЛок(Знач Значение) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
	
КонецФункции // ЗначениеВМассивеЛок

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
//
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры
//  Ключ                - Строка       - Имя ключа структуры
//  ЗначениеПоУмолчанию - Произвольный - возвращается в случае если в структуре
//                                       нет указанного свойства (необязательный)
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаКлиенте
Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если Структура = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Результат = ЗначениеПоУмолчанию;
	Если Структура.Свойство(Ключ, Результат) Тогда
		Возврат Результат;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции // СвойствоСтруктурыЛок

// Фиксирует данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - Коллекции, значения которых являются примитивными типами,
//                    хранилищем значения или не могут быть изменены. Поддерживаются типы значений
//                    Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//                    ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//                    ЛюбаяСсылка
//  ВызыватьИсключение - Булево
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
//
&НаКлиенте
Функция ФиксированныеДанныеЛок(Данные, ВызыватьИсключение = Истина) Экспорт
	
	ТипДанных = ТипЗнч(Данные);
	Если ТипДанных = Тип("Массив") Тогда
		Результат = ФиксированныеДанныеМассив(Данные, ВызыватьИсключение);
	ИначеЕсли ТипДанных = Тип("Структура") ИЛИ ТипДанных = Тип("Соответствие") Тогда
		Результат = ФиксированныеДанныеКлючиИЗначения(Данные, ВызыватьИсключение);
	ИначеЕсли ВызыватьИсключение Тогда
		ПроверкаФиксированностиДанных(Данные);
		Результат = Данные;
	Иначе
		Результат = Данные;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФиксированныеДанныеЛок

// КОНСТРУКТОРЫ

// Создает структуру на основании переданного источника
//
// Параметры:
//  Источник - Структура, ФиксированнаяСтруктура - структура, копию которой необходимо создать
//
// Возвращаемое значение:
//  Структура - структура, созданная из переданной в параметре Источник
//
&НаКлиенте
Функция Структура(Источник) Экспорт
	
	ТипЗначения = ТипЗнч(Источник);
	Если ТипЗначения = Тип("Структура")
		ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Результат = СтруктураИзСтруктура(Источник);
	Иначе
		ВызватьИсключение "Ошибка типа: " + ТипЗначения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // Структура

// Создает соответствие на основании переданного соответствия
//
// Параметры:
//  СоответствиеИсточник - Соответствие, ФиксированноеСоответствие - соответствие, копию которого необходимо создать;
//
// Возвращаемое значение:
//  Соответствие - соответствие, созданное из переданного в параметре СоответствиеИсточник
//
&НаКлиенте
Функция Соответствие(СоответствиеИсточник) Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		
		Ключ = КлючИЗначение.Ключ;
		Значение = КлючИЗначение.Значение;
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // Соответствие

// МАССИВ

// Удаляет все пустые значения из массива. ЗначениеЗаполнено() = Ложь
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение.
//
&НаКлиенте
Процедура УдалитьПустыеЗначенияМассива(Массив) Экспорт
	
	КоличествоЭлементовВМассиве = Массив.Количество();
	
	Для НомерЭлемента = 1 По КоличествоЭлементовВМассиве Цикл
		
		ИндексЭлемента = КоличествоЭлементовВМассиве - НомерЭлемента;
		ПроверяемыйЭлемент = Массив[ИндексЭлемента];
		
		Если НЕ ЗначениеЗаполнено(ПроверяемыйЭлемент) И ПроверяемыйЭлемент <> 0 Тогда
			
			Массив.Удалить(ИндексЭлемента);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УдалитьПустыеЗначенияМассива

// Ищет в массиве структур по паре ключ-значение,
// возвращает результат поиска в виде массива структур
//
// Параметры:
//  МассивСтруктур - Массив - массив содержит структуры;
//  ПараметрыОтбора - Структура - ключ - поле структуры, значение - значение, которое надо найти;
//
// Возвращаемое значение:
//  Массив - массив структур удовлетворяющих отбору
//
&НаКлиенте
Функция НайтиСтрокиМассиваСтруктур(МассивСтруктур, ПараметрыОтбора) Экспорт
	
	Свойства = Новый Массив;
	Для Каждого КлючИЗначение Из ПараметрыОтбора Цикл
		Свойства.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	ОтборСвойств = СтдКлиентЛок.Стр().СтрСоединитьЛок(Свойства, ",");
	
	Результат = Новый Массив;
	Для Каждого Элемент Из МассивСтруктур Цикл
		Если СравнитьКоллекции(Элемент, ПараметрыОтбора, ОтборСвойств) = 0 Тогда
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // НайтиСтрокиМассиваСтруктур

// Выгружает значения поля из массива структур в новый массив
//
// Параметры:
//  МассивСтруктур - Массив - массив содержит структуры;
//  ИмяПоля - Строка - поле, значения которого нужно выгрузить;
//
// Возвращаемое значение:
//  Массив - массив значений из структур
//
&НаКлиенте
Функция ВыгрузитьЗначенияМассиваСтруктур(МассивСтруктур, ИмяПоля) Экспорт
	
	Результат = Новый Массив;
	Для Каждого Элемент Из МассивСтруктур Цикл
		Результат.Добавить(Элемент[ИмяПоля]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВыгрузитьЗначенияМассиваСтруктур

// ПРОЧЕЕ

// Удаляет строки из таблицы
//
// Параметры:
//  Таблица - ДанныеФормыКоллекция, ДанныеФормыСтруктураСКоллекцией - Таблица
//  ПараметрыОтбора - Структура - Задает условия поиска ключ структуры определяет имя колонки, по которой
//                                будет осуществляться поиск, а значение структуры - искомое значение.
//
&НаКлиенте
Процедура УдалитьСтрокиТаблицы(Таблица, ПараметрыОтбора) Экспорт
	
	Строки = Таблица.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Строка Из Строки Цикл
		Таблица.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры // УдалитьСтрокиТаблицы

// Сортирует переданную коллекцию значений
//
// Параметры:
//  Значение  - Массив, ТаблицаЗначений, СписокЗначений - Коллекция для сортировки
//  Сравнение - Строка - Задается аналогично перечислению колонок метода сортировать ТаблицыЗначений
//            - НаправлениеСортировки - (значение по умолчанию = Возр) при использовании Убыв,
//                                      результат будет инвертирован
//
&НаКлиенте
Процедура СортироватьКоллекцию(Значение, Сравнение = Неопределено) Экспорт
	
	СравнениеТипЗнч = ТипЗнч(Сравнение);
	
	Если СравнениеТипЗнч = Тип("Строка") Тогда
		ОписаниеСравнения = РазобратьСтрокуСравнение(Сравнение);
	ИначеЕсли Сравнение = Неопределено Тогда
		ОписаниеСравнения = НаправлениеСортировки.Возр;
	ИначеЕсли СравнениеТипЗнч = Тип("НаправлениеСортировки") Тогда
		ОписаниеСравнения = Сравнение;
	Иначе
		ВызватьИсключение "Ошибка типа: " + СравнениеТипЗнч;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Массив") Тогда
		СортироватьМассив(Значение, ОписаниеСравнения);
	ИначеЕсли ТипЗначения = Тип("СписокЗначений") Тогда
		СортироватьСписокЗначений(Значение, ОписаниеСравнения);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // СортироватьКоллекцию

// Возвращает отсортированную копию переданной коллекции
//
// Параметры:
//  Значение  - Массив, ТаблицаЗначений, СписокЗначений - Коллекция для копирования и сортировки
//  Сравнение - Строка - Задается аналогично перечислению колонок метода сортировать ТаблицыЗначений
//            - НаправлениеСортировки - (значение по умолчанию = Возр) при использовании Убыв,
//                                      результат будет инвертирован
//
// Возвращаемое значение:
//  Массив, ТаблицаЗначений, СписокЗначений - Отсортированная копия исходной коллекции
//
&НаКлиенте
Функция СортированнаяКоллекция(Значение, Сравнение = Неопределено) Экспорт
	
	Результат = СкопироватьРекурсивноЛок(Значение, Ложь);
	
	СортироватьКоллекцию(Результат, Сравнение);
	
	Возврат Результат;
	
КонецФункции // СортированнаяКоллекция

// Сравнивает два значения
//
// Параметры:
//  Значение1 - Произвольный - Коллекция или иное значение
//  Значение2 - Произвольный - Коллекция или иное значение
//  Сравнение - Строка - Задается аналогично перечислению колонок метода сортировать ТаблицыЗначений
//            - НаправлениеСортировки - (значение по умолчанию = Возр) при использовании Убыв,
//                                      результат будет инвертирован
//
// Возвращаемое значение:
//  Число - Результат < 0 - первое значение меньше второго.
//          Результат > 0 - первое значение больше второго.
//          Результат = 0 - первое значение равно второму
//
&НаКлиенте
Функция СравнитьКоллекции(Значение1, Значение2, Сравнение = Неопределено) Экспорт
	
	СравнениеТипЗнч = ТипЗнч(Сравнение);
	
	Если СравнениеТипЗнч = Тип("Строка") Тогда
		ОписаниеСравнения = РазобратьСтрокуСравнение(Сравнение);
	ИначеЕсли Сравнение = Неопределено Тогда
		ОписаниеСравнения = НаправлениеСортировки.Возр;
	ИначеЕсли СравнениеТипЗнч = Тип("НаправлениеСортировки") Тогда
		ОписаниеСравнения = Сравнение;
	Иначе
		ВызватьИсключение "Ошибка типа: " + СравнениеТипЗнч;
	КонецЕсли;
	
	Значение1ТипЗнч = ТипЗнч(Значение1);
	Значение2ТипЗнч = ТипЗнч(Значение2);
	
	Если СравнениеМассивовЛок(Значение1ТипЗнч, Значение2ТипЗнч) Тогда
		Результат = СравнитьМассивы(Значение1, Значение2, ОписаниеСравнения);
	ИначеЕсли СравнениеКлючейИЗначений(Значение1ТипЗнч, Значение2ТипЗнч) Тогда
		Результат = СравнитьКлючиИЗначения(Значение1, Значение2, ОписаниеСравнения);
	ИначеЕсли Значение1ТипЗнч = Тип("СписокЗначений") И Значение2ТипЗнч = Тип("СписокЗначений") Тогда
		Результат = СравнитьМассивы(Значение1.ВыгрузитьЗначения(), Значение2.ВыгрузитьЗначения(), ОписаниеСравнения);
	Иначе
		Результат = СравнитьЗначения(Значение1, Значение2, ОписаниеСравнения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СравнитьКоллекции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция Инит(СтдКлиент) Экспорт
	
	СтдКлиентЛок = СтдКлиент;
	
	Возврат ЭтаФорма;
	
КонецФункции // Инит

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// БСП

&НаКлиенте
Процедура ПроверкаФиксированностиДанных(Данные, ДанныеВЗначенииФиксированныхТипов = Ложь)
	
	Возврат;
	
КонецПроцедуры // ПроверкаФиксированностиДанных

&НаКлиенте
Функция СкопироватьСтруктуруЛок(СтруктураИсточник, ФиксироватьДанные = Неопределено)
	
	Результат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		Результат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивноЛок(КлючИЗначение.Значение, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина
		ИЛИ ФиксироватьДанные = Неопределено
		И ТипЗнч(СтруктураИсточник) = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Новый ФиксированнаяСтруктура(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СкопироватьСтруктуруЛок

&НаКлиенте
Функция СкопироватьСоответствиеЛок(СоответствиеИсточник, ФиксироватьДанные = Неопределено)
	
	Результат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		
		Ключ = КлючИЗначение.Ключ;
		Значение = СкопироватьРекурсивноЛок(КлючИЗначение.Значение, ФиксироватьДанные);
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина
		ИЛИ ФиксироватьДанные = Неопределено
		И ТипЗнч(СоответствиеИсточник) = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = Новый ФиксированноеСоответствие(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СкопироватьСоответствиеЛок

&НаКлиенте
Функция СкопироватьМассивЛок(МассивИсточник, ФиксироватьДанные = Неопределено)
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		
		НовыйЭлемент = СкопироватьРекурсивноЛок(Элемент, ФиксироватьДанные);
		Результат.Добавить(НовыйЭлемент);
		
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина
		ИЛИ ФиксироватьДанные = Неопределено
		И ТипЗнч(МассивИсточник) = Тип("ФиксированныйМассив") Тогда
		
		Результат = Новый ФиксированныйМассив(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СкопироватьМассивЛок

&НаКлиенте
Функция СкопироватьСписокЗначенийЛок(СписокИсточник, ФиксироватьДанные = Неопределено)
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		
		НовыйЭлемент = СкопироватьРекурсивноЛок(ЭлементСписка.Значение, ФиксироватьДанные);
		
		Результат.Добавить(НовыйЭлемент, ЭлементСписка.Представление, ЭлементСписка.Пометка, ЭлементСписка.Картинка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СкопироватьСписокЗначенийЛок

// СОРТИРОВКИ

&НаКлиенте
Процедура СортироватьМассив(Коллекция, Сравнение)
	
	ТипЗначенияСравнение = ТипЗнч(Сравнение);
	Если ТипЗначенияСравнение = Тип("Строка") Тогда
		СортироватьМассив(Коллекция, РазобратьСтрокуСравнение(Сравнение));
	ИначеЕсли ТипЗначенияСравнение = Тип("НаправлениеСортировки") Тогда
		СортироватьПоЗначениюМассив(Коллекция, Сравнение);
	ИначеЕсли ТипЗначенияСравнение = Тип("Массив") Тогда
		СортироватьПоСвойствамМассив(Коллекция, Сравнение);
	Иначе
		ВызватьИсключение "Ошибка типа: " + Строка(ТипЗначенияСравнение);
	КонецЕсли;
	
КонецПроцедуры // СортироватьМассив

&НаКлиенте
Процедура СортироватьПоСвойствамМассив(Массив, Сравнение)
	
	Размер = Массив.Количество();
	Для Сч = 0 По Сравнение.ВГраница() Цикл
		Элемент = Сравнение[Сравнение.ВГраница() - Сч];
		Для I = 0 По Размер - 1 Цикл
			Для J = 0 По Размер - 1 - I - 1 Цикл
				Если СравнитьКоллекции(Массив[J][Элемент.Поле], Массив[J + 1][Элемент.Поле], Элемент.Направление) > 0 Тогда
					ВременнаяПеременная = Массив[J];
					Массив[J] = Массив[J + 1];
					Массив[J + 1] = ВременнаяПеременная;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // СортироватьПоСвойствамМассив

&НаКлиенте
Процедура СортироватьПоЗначениюМассив(Массив, Сравнение)
	
	Размер = Массив.Количество();
	Для I = 0 По Размер - 1 Цикл
		Для J = 0 По Размер - 1 - I - 1 Цикл
			Если СравнитьКоллекции(Массив[J], Массив[J + 1], Сравнение) > 0 Тогда
				ВременноеЗначение = Массив[J];
				Массив[J] = Массив[J + 1];
				Массив[J + 1] = ВременноеЗначение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // СортироватьПоЗначениюМассив

&НаКлиенте
Процедура СортироватьСписокЗначений(СписокЗначений, Сравнение)
	
	ТипЗначенияСравнение = ТипЗнч(Сравнение);
	Если ТипЗначенияСравнение = Тип("НаправлениеСортировки") Тогда
		СписокЗначений.СортироватьПоЗначению(Сравнение);
	Иначе
		ВызватьИсключение "Ошибка типа: " + Строка(ТипЗначенияСравнение);
	КонецЕсли;
	
КонецПроцедуры // СортироватьСписокЗначений

&НаКлиенте
Процедура СортироватьПоСвойствамСписокЗначений(СписокЗначений, Сравнение)
	
	Размер = СписокЗначений.Количество();
	Для Сч = 0 По Сравнение.ВГраница() Цикл
		Элемент = Сравнение[Сравнение.ВГраница() - Сч];
		Для I = 0 По Размер - 1 Цикл
			Для J = 0 По Размер - 1 - I - 1 Цикл
				Если СравнитьКоллекции(СписокЗначений[J].Значение[Элемент.Поле],
						СписокЗначений[J + 1].Значение[Элемент.Поле], Элемент.Направление) > 0 Тогда
					ВременнаяПеременная = СписокЗначений[J];
					СписокЗначений[J] = СписокЗначений[J + 1];
					СписокЗначений[J + 1] = ВременнаяПеременная;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // СортироватьПоСвойствамСписокЗначений

// СРАВНЕНИЯ

&НаКлиенте
Процедура ЗаполнитьМассивКлючейСравнение(МассивКлючей1, МассивКлючей2, ОтборКлючей, КартаКлючей,
		Коллекция1, Коллекция2, Ключи)
	
	Значение1ТипЗнч = ТипЗнч(Коллекция1);
	Значение2ТипЗнч = ТипЗнч(Коллекция1);
	
	ЗависимыеКлючи = Ложь;
	
	ЗаполнитьОтборКлючей(Значение1ТипЗнч, Значение2ТипЗнч, ЗависимыеКлючи,
		ОтборКлючей, КартаКлючей, Ключи);
	
	Для Каждого КлючИЗначение Из Коллекция1 Цикл
		Если НЕ ЗависимыеКлючи Тогда
			Ключ = ВРег(КлючИЗначение.Ключ);
		Иначе
			Ключ = КлючИЗначение.Ключ;
		КонецЕсли;
		Если ОтборКлючей.Количество() = 0 ИЛИ ОтборКлючей.Найти(Ключ) <> Неопределено Тогда
			МассивКлючей1.Добавить(Ключ);
		КонецЕсли;
	КонецЦикла;
	
	МассивКлючей2 = Новый Массив;
	Для Каждого КлючИЗначение Из Коллекция2 Цикл
		Если НЕ ЗависимыеКлючи Тогда
			Ключ = ВРег(КлючИЗначение.Ключ);
		Иначе
			Ключ = КлючИЗначение.Ключ;
		КонецЕсли;
		Если ОтборКлючей.Количество() = 0 ИЛИ ОтборКлючей.Найти(Ключ) <> Неопределено Тогда
			МассивКлючей2.Добавить(Ключ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьМассивКлючейСравнение

&НаКлиенте
Процедура ЗаполнитьМассивКолонокСравнение(МассивКолонок1, МассивКолонок2, ОтборКолонок, КартаКолонок,
		ТаблицаЗначений1, ТаблицаЗначений2, Колонки)
	
	Если ТипЗнч(Колонки) = Тип("Массив") Тогда
		Для Каждого Элемент Из Колонки Цикл
			ОтборКолонок.Добавить(ВРег(Элемент.Поле));
			КартаКолонок.Вставить(ВРег(Элемент.Поле), Элемент.Направление);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
		Если ОтборКолонок.Количество() = 0 ИЛИ ОтборКолонок.Найти(ВРег(Колонка.Имя)) <> Неопределено Тогда
			МассивКолонок1.Добавить(ВРег(Колонка.Имя));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
		Если ОтборКолонок.Количество() = 0 ИЛИ ОтборКолонок.Найти(ВРег(Колонка.Имя)) <> Неопределено Тогда
			МассивКолонок2.Добавить(ВРег(Колонка.Имя));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьМассивКолонокСравнение

&НаКлиенте
Процедура ЗаполнитьОтборКлючей(Значение1ТипЗнч, Значение2ТипЗнч, ЗависимыеКлючи, ОтборКлючей, КартаКлючей, Ключи)
	
	ЗависимыеКлючи = (Значение1ТипЗнч = Тип("Соответствие") ИЛИ Значение1ТипЗнч = Тип("ФиксированноеСоответствие"))
		И (Значение2ТипЗнч = Тип("Соответствие") ИЛИ Значение2ТипЗнч = Тип("ФиксированноеСоответствие"));
	
	Если ТипЗнч(Ключи) = Тип("Массив") Тогда
		Для Каждого Элемент Из Ключи Цикл
			Если НЕ ЗависимыеКлючи Тогда
				Ключ = ВРег(Элемент.Поле);
			Иначе
				Ключ = Элемент.Поле;
			КонецЕсли;
			ОтборКлючей.Добавить(Ключ);
			КартаКлючей.Вставить(Ключ, Элемент.Направление);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьОтборКлючей

&НаКлиенте
Функция СравнитьЗначения(Значение1, Значение2, ОписаниеСравнения = Неопределено)
	
	Если Значение1 = Значение2 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ОписаниеСравнения = НаправлениеСортировки.Убыв Тогда
		Множитель = -1;
	Иначе
		Множитель = 1;
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ОбъектСравнения = Новый СравнениеЗначений;
	Результат = ОбъектСравнения.Сравнить(Значение1, Значение2) * Множитель;
	#Иначе
	Если Значение1 > Значение2 Тогда
		Результат = 1 * Множитель;
	ИначеЕсли Значение1 < Значение2 Тогда
		Результат = -1 * Множитель;
	Иначе
		Результат = 0;
	КонецЕсли;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции // СравнитьЗначения

&НаКлиенте
Функция СравнитьМассивы(Массив1, Массив2, Сравнение = Неопределено)
	
	МинимальнаяДлина = Мин(Массив1.Количество(), Массив2.Количество());
	
	Для Индекс = 0 По МинимальнаяДлина - 1 Цикл
		Результат = СравнитьКоллекции(Массив1[Индекс], Массив2[Индекс], Сравнение);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СравнитьКоллекции(Массив1.Количество(), Массив2.Количество());
	
КонецФункции // СравнитьМассивы

&НаКлиенте
Функция СравнитьКлючиИЗначения(Коллекция1, Коллекция2, Ключи = Неопределено)
	
	МассивКлючей1 = Новый Массив;
	МассивКлючей2 = Новый Массив;
	ОтборКлючей = Новый Массив;
	КартаКлючей = Новый Соответствие;
	
	ЗаполнитьМассивКлючейСравнение(МассивКлючей1, МассивКлючей2, ОтборКлючей, КартаКлючей, Коллекция1, Коллекция2, Ключи);
	
	// т.к. ключи коллекции не упорядочены
	
	СортироватьМассив(МассивКлючей1, НаправлениеСортировки.Возр);
	СортироватьМассив(МассивКлючей2, НаправлениеСортировки.Возр);
	
	Результат = СравнитьКоллекции(МассивКлючей1, МассивКлючей2);
	Если Результат <> 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	//
	
	НаправлениеПоУмолчанию = НаправлениеСортировки.Возр;
	Если ТипЗнч(Ключи) = Тип("НаправлениеСортировки") Тогда
		НаправлениеПоУмолчанию = Ключи;
	КонецЕсли;
	
	Для Каждого Ключ Из МассивКлючей1 Цикл
		
		Направление = КартаКлючей.Получить(Ключ);
		Если Направление = Неопределено Тогда
			Направление = НаправлениеПоУмолчанию;
		КонецЕсли;
		
		Результат = СравнитьКоллекции(Коллекция1[Ключ], Коллекция2[Ключ], Направление);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // СравнитьКлючиИЗначения

&НаКлиенте
Функция СравнениеКлючейИЗначений(Значение1ТипЗнч, Значение2ТипЗнч)
	
	Результат = (Значение1ТипЗнч = Тип("Структура")
			ИЛИ Значение1ТипЗнч = Тип("ФиксированнаяСтруктура")
			ИЛИ Значение1ТипЗнч = Тип("Соответствие")
			ИЛИ Значение1ТипЗнч = Тип("ФиксированноеСоответствие"))
		И (Значение2ТипЗнч = Тип("Структура")
			ИЛИ Значение2ТипЗнч = Тип("ФиксированнаяСтруктура")
			ИЛИ Значение2ТипЗнч = Тип("Соответствие")
			ИЛИ Значение2ТипЗнч = Тип("ФиксированноеСоответствие"));
	
	Возврат Результат;
	
КонецФункции // СравнениеКлючейИЗначений

&НаКлиенте
Функция СравнениеМассивовЛок(Значение1ТипЗнч, Значение2ТипЗнч)
	
	Результат = (Значение1ТипЗнч = Тип("Массив") ИЛИ Значение1ТипЗнч = Тип("ФиксированныйМассив"))
		И (Значение2ТипЗнч = Тип("Массив") ИЛИ Значение2ТипЗнч = Тип("ФиксированныйМассив"));
	
	Возврат Результат;
	
КонецФункции // СравнениеМассивов

// ПРОЧЕЕ

&НаКлиенте
Функция СтруктураИзСтруктура(СтруктураИсточник) Экспорт
	
	Результат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		
		Ключ = КлючИЗначение.Ключ;
		Значение = КлючИЗначение.Значение;
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СтруктураИзСтруктура

&НаКлиенте
Функция СтруктураИзСтрокиТЗ(СтрокаТЗ) Экспорт
	
	Результат = Новый Структура;
	Колонки = СтрокаТЗ.Владелец().Колонки;
	
	Для Каждого Колонка Из Колонки Цикл
		Результат.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СтруктураИзСтрокиТЗ

&НаКлиенте
Функция СтруктураИзТаблицыЗначений(ТаблицаЗначений) Экспорт
	
	Результат = Новый Структура;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Результат.Вставить(Колонка.Имя, Колонка.ТипЗначения.ПривестиЗначение());
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СтруктураИзТаблицыЗначений

&НаКлиенте
Функция РазобратьСтрокуСравнение(Строка)
	
	КартаНаправлений = Новый Соответствие;
	КартаНаправлений.Вставить("ВОЗР", НаправлениеСортировки.Возр);
	КартаНаправлений.Вставить("УБЫВ", НаправлениеСортировки.Убыв);
	КартаНаправлений.Вставить("ASK", НаправлениеСортировки.Возр);
	КартаНаправлений.Вставить("DESC", НаправлениеСортировки.Убыв);
	КартаНаправлений.Вставить("", НаправлениеСортировки.Возр);
	
	ПростоНаправление = КартаНаправлений.Получить(ВРЕГ(Строка));
	Если ПростоНаправление <> Неопределено Тогда
		Возврат ПростоНаправление;
	КонецЕсли;
	
	ПеречислениеПолей = СтдКлиентЛок.Стр().СтрРазделитьЛок(Строка, ",");
	Если НЕ ПеречислениеПолей.Количество() Тогда
		ВызватьИсключение "Ошибка значения: " + Строка;
	КонецЕсли;
	
	Сравнение = Новый Массив;
	Для Каждого Поле Из ПеречислениеПолей Цикл
		ПолеСортировки = Новый Структура("Поле,Направление", Неопределено, НаправлениеСортировки.Возр);
		ИмяПоляНаправление = СтдКлиентЛок.Стр().СтрРазделитьЛок(Поле, " ", Ложь);
		Если ИмяПоляНаправление.Количество() > 0 Тогда
			ПолеСортировки.Поле = СокрЛП(ИмяПоляНаправление[0]);
		КонецЕсли;
		Если ИмяПоляНаправление.Количество() > 1 Тогда
			Направление = КартаНаправлений.Получить(ВРЕГ(СокрЛП(ИмяПоляНаправление[1])));
			Если Направление <> Неопределено Тогда
				ПолеСортировки.Направление = Направление;
			КонецЕсли;
		КонецЕсли;
		Сравнение.Добавить(ПолеСортировки);
	КонецЦикла;
	
	Возврат Сравнение;
	
КонецФункции // РазобратьСтрокуСравнение

&НаКлиенте
Функция СобратьСтрокуСравнение(Сравнение)
	
	МассивСтрок = Новый Массив;
	
	Для Каждого Элемент Из Сравнение Цикл
		ПолеСравнения = СокрЛП(Элемент.Поле + " " + Строка(Элемент.Направление));
		МассивСтрок.Добавить(ПолеСравнения);
	КонецЦикла;
	
	Возврат СтдКлиентЛок.Стр().СтрСоединитьЛок(МассивСтрок, ",");
	
КонецФункции // СобратьСтрокуСравнение

&НаКлиенте
Функция ФиксированныеДанныеМассив(Данные, ВызыватьИсключение)
	
	Массив = Новый Массив;
	
	Для Каждого Значение Из Данные Цикл
		
		ТипЗначения = ТипЗнч(Значение);
		
		Если ТипЗначения = Тип("Структура") ИЛИ ТипЗначения = Тип("Соответствие") ИЛИ ТипЗначения = Тип("Массив") Тогда
			Массив.Добавить(ФиксированныеДанныеЛок(Значение));
		ИначеЕсли ВызыватьИсключение Тогда
			ПроверкаФиксированностиДанных(Значение);
			Массив.Добавить(Значение);
		Иначе
			Массив.Добавить(Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Массив);
	
КонецФункции // ФиксированныеДанныеМассив

&НаКлиенте
Функция ФиксированныеДанныеКлючиИЗначения(Данные, ВызыватьИсключение)
	
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных = Тип("Структура") Тогда
		Коллекция = Новый Структура;
	Иначе
		Коллекция = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из Данные Цикл
		
		Значение = КлючИЗначение.Значение;
		ТипЗначения = ТипЗнч(Значение);
		
		Если ТипЗначения = Тип("Структура") ИЛИ ТипЗначения = Тип("Соответствие") ИЛИ ТипЗначения = Тип("Массив") Тогда
			Коллекция.Вставить(КлючИЗначение.Ключ, ФиксированныеДанныеЛок(Значение));
		ИначеЕсли ВызыватьИсключение Тогда
			ПроверкаФиксированностиДанных(Значение);
			Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
		Иначе
			Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипДанных = Тип("Соответствие") Тогда
		Результат = Новый ФиксированноеСоответствие(Коллекция);
	Иначе
		Результат = Новый ФиксированнаяСтруктура(Коллекция);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФиксированныеДанныеКлючиИЗначения