////////////////////////////////////////////////////////////////////////////////
// Служебные методы общего назначения для 1С:Предприятие 8.3
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияЛок(ВыполняемоеОповещение, Результат = Неопределено) Экспорт
	
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Результат);
	
КонецПроцедуры // ВыполнитьОбработкуОповещенияЛок