////////////////////////////////////////////////////////////////////////////////
// Заголовок модуля:
// - TODO написать
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Описание переменных

// ФиксированнаяСтруктура - Программное перечисление (коллекция категорий ошибок)
Перем КатегорииОшибок Экспорт;

// Служебные АПИ
Перем КоннекторЛок, Стр;

// Служебный конекст
Перем СессияЛок, Локация;

// Перечисления
Перем ПеречислениеТипыПродуктов, ПеречислениеТипыОбъектов;

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Конструктор

// Инициализирует клиент сервиса обновлений
//
// Параметры:
//   Параметры - Структура - см. АпдейтКлиентПараметры
//
// Возвращаемое значение:
//   ОбработкаОбъект.АпдейтКлиент - Настроенный клиент
//
Функция АпдейтКлиент(Знач Параметры = Неопределено) Экспорт
	
	АпдейтКлиентПараметры = АпдейтКлиентПараметры();
	Если Параметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(АпдейтКлиентПараметры, Параметры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АпдейтКлиентПараметры.Локация) Тогда
		Локация = СокрЛП(АпдейтКлиентПараметры.Локация);
		
		Если Прав(Локация, 1) = "/" Тогда
			Локация = Лев(Локация, СтрДлина(Локация) - 1);
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяСессия = Сессия();
	Если ЗначениеЗаполнено(АпдейтКлиентПараметры.КлючАПИ) Тогда
		ТекущаяСессия.Заголовки.Вставить("X-Kontur-Apikey", АпдейтКлиентПараметры.КлючАПИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АпдейтКлиентПараметры.КлючИБ) Тогда
		ТекущаяСессия.Заголовки.Вставить("X-Customer-Secret-Key", АпдейтКлиентПараметры.КлючИБ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АпдейтКлиентПараметры.Токен) Тогда
		ТекущаяСессия.Заголовки.Вставить("Authorization", АпдейтКлиентПараметры.Токен);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции // АпдейтКлиент

// Описание параметров конструктора
//
// Возвращаемое значение:
//  Структура - Параметры клиента
//     * Локация - Строка - (необязательный) Локация сервиса
//     * КлючАПИ - Строка - (необязательный) X-Kontur-Apikey
//     * КлючИБ - Строка - (необязательный) X-Kontur-Secret-Key
//     * Токен - Строка - (необязательный) Authorization
//
Функция АпдейтКлиентПараметры() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Локация", "https://update.kontur.ru/1c");
	Модель.Вставить("КлючАПИ");
	Модель.Вставить("КлючИБ");
	Модель.Вставить("Токен");
	
	Возврат Модель;
	
КонецФункции // АпдейтКлиентПараметры

// Определения

// Контекст текущей версии и среды испольнения
//
// Возвращаемое значение:
//   Структура - Определение
//
Функция КонтекстВерсии() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Версия");
	Модель.Вставить("ИдБазы");
	Модель.Вставить("ПолучатьБетаВерсии", Истина);
	Модель.Вставить("ПроизвольныеДанные", Новый Соответствие);
	
	Возврат Модель;
	
КонецФункции // КонтекстВерсии

// Исключения

// Проверяет, что ошибка принадлежит к указанной категории
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке - ИнформацияОбОшибке
//  Категория		   - Строка - Текст ошибки
//
// Возвращаемое значение:
//  Булево - возвращает Истина если описание ошибки начинается на текст категории
//
Функция ЯвляетсяОшибкойКатегории(ИнформацияОбОшибке, Категория) Экспорт
	
	Возврат Найти(ИнформацияОбОшибке.Описание, Категория.Описание) = 1;
	
КонецФункции // ЯвляетсяОшибкойКатегории

// Методы по работе с продуктами (products)

// Выбирает продукты по заданному отбору
//
// Параметры:
//   Отбор - Структура - см. ОтборПродуктов - (необязательный)
//   Порядок - Строка - возможные значения: Убыв, Возр - (необязательный)
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. ВыборкаЭлементов
//
Функция ВыбратьПродукты(Отбор = Неопределено, Порядок = Неопределено) Экспорт
	
	ТипОбъекта = ПеречислениеТипыОбъектов.Продукт;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура();
	
	ОтборПродуктов = ОтборПродуктов();  
	Если НЕ Отбор = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ОтборПродуктов, Отбор);
	КонецЕсли;     
	ОтборПродуктов = Новый ФиксированнаяСтруктура(ОтборПродуктов);
	
	Возврат ВыбратьЭлементыСлужебный(ТипОбъекта, ПараметрыПути, ОтборПродуктов, Порядок);
	
КонецФункции

// Возвращает продукт по имени
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. Продукт
//
Функция ПолучитьПродукт(ИмяПродукта) Экспорт

	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта));

	ТипОбъекта = ПеречислениеТипыОбъектов.Продукт;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name", ИмяПродукта);
	
	Возврат ПолучитьОбъектСлужебный(ТипОбъекта, ПараметрыПути);

КонецФункции

// Методы по работе с информационными базами (customers)

// Регистрирует новую информационную базу
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ЗапросРегистрацииИБ - Структура - см. ЗапросРегистрацииИБ
// 
// Возвращаемое значение:
//  Структура - см. РезультатРегистрацииИБ
//
Функция ЗарегистрироватьИнформационнуюБазу(ИмяПродукта, ЗапросРегистрацииИБ) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта));
	
	ДанныеЗапроса = Новый Соответствие;
	ДанныеЗапроса.Вставить("customer_id", ЗапросРегистрацииИБ.Идентификатор);
	
	Ответ = PostJson("/v4/products/" + ИмяПродукта + "/customers", ДанныеЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат _РазобратьРезультатРегистрацииИБ(Данные);
	
КонецФункции

// Возвращает данные информационной базы по идентификатору
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор ИБ
// 
// Возвращаемое значение:
//  Структура - см. ИнформационнаяБаза
//
Функция ПолучитьИнформационнуюБазу(ИмяПродукта, ИдентификаторИБ) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ));
	
	Ответ = Get("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ);
	ПроверитьСостояниеHTTP(Ответ);
	
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат _РазобратьИБ(Данные);

КонецФункции

// Добавляет права новому пользователю
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор ИБ
//  ЗапросИзмененияИБ - Структура - см. ЗапросИзмененияИБ
// 
// Возвращаемое значение:
//  Структура - см. ИнформационнаяБаза
//
Функция ИзменитьИнформационнуюБазу(ИмяПродукта, ИдентификаторИБ, ЗапросИзмененияИБ) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ));
		
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ИдентификаторИБ, "Строка"),
		НесоответствиеТипов(ЗапросИзмененияИБ, "Структура"));
		
	ДанныеЗапроса = Новый Соответствие;
	ДанныеЗапроса.Вставить("portal_user_id", ЗапросИзмененияИБ.ИдентификаторПользователя);
	
	Ответ = PostJson("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ, ДанныеЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат _РазобратьИБ(Данные);

КонецФункции

// Методы по работе с ключами АПИ (keys)

// Возвращает список ключей АПИ информационной базы
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор ИБ
// 
// Возвращаемое значение:
//  Массив - см. КлючАПИ
//
Функция ПолучитьКлючиАПИ(ИмяПродукта, ИдентификаторИБ) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ));
		
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ИдентификаторИБ, "Строка"));
	
	Ответ = Get("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/keys");
	ПроверитьСостояниеHTTP(Ответ);
	
	Данные = КоннекторЛок.КакJson(Ответ);
	
	МассивКлючей = Новый Массив;
	Для Каждого Эл Из Данные.Получить("keys") Цикл
		МассивКлючей.Добавить(_РазобратьКлючАПИ(Эл));
	КонецЦикла;
	
	Возврат МассивКлючей;
	
КонецФункции

// Возвращает данные ключа АПИ
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор ИБ 
//  ИдентификаторКлючаАПИ - Число - Идентификатор ключа АПИ
// 
// Возвращаемое значение:
//  Массив - см. КлючАПИ
//
Функция ПолучитьКлючАПИ(ИмяПродукта, ИдентификаторИБ, ИдентификаторКлючаАПИ) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ),
		НеЗаполнено(ИдентификаторКлючаАПИ));
		
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ИдентификаторИБ, "Строка"),
		НесоответствиеТипов(ИдентификаторКлючаАПИ, "Число"));
		
	ИдентификаторСтрокой = Формат(ИдентификаторКлючаАПИ, "ЧН=0; ЧГ=");  
		
	Ответ = Get("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/keys/" + ИдентификаторСтрокой);
	ПроверитьСостояниеHTTP(Ответ);
	
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат _РазобратьКлючАПИ(Данные);
	
КонецФункции

// Создает новый ключ АПИ
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор ИБ 
//  ЗапросНовогоКлючаАПИ - Структура - см. ЗапросНовогоКлючаАПИ
// 
// Возвращаемое значение:
//  Структура - см. КлючАПИ
//
Функция СоздатьКлючАПИ(ИмяПродукта, ИдентификаторИБ, ЗапросНовогоКлючаАПИ) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ));
		
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ИдентификаторИБ, "Строка"));
	
	ДанныеЗапроса = Новый Соответствие;
	ДанныеЗапроса.Вставить("description", ЗапросНовогоКлючаАПИ.Описание);
	
	Ответ = PostJson("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/keys", ДанныеЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат _РазобратьКлючАПИ(Данные);
	
КонецФункции

// Удаляет ключ АПИ
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор ИБ 
//  ИдентификаторКлючаАПИ - Число - Идентификатор ключа АПИ
// 
// Возвращаемое значение:
//   Отсутствует
//
Функция УдалитьКлючАПИ(ИмяПродукта, ИдентификаторИБ, ИдентификаторКлючаАПИ) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ),
		НеЗаполнено(ИдентификаторКлючаАПИ));
		
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ИдентификаторИБ, "Строка"),
		НесоответствиеТипов(ИдентификаторКлючаАПИ, "Число"));
		
	ИдентификаторСтрокой = Формат(ИдентификаторКлючаАПИ, "ЧН=0; ЧГ=");
	
	Ответ = Delete("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/keys/" + ИдентификаторСтрокой);
	
	Возврат Неопределено;

КонецФункции

// Методы по работе с плагинами

Функция ВыбратьПлагины(ИмяПродукта, ИдентификаторИБ, ОтборПлагинов = Неопределено, Порядок = Неопределено) Экспорт

	ТипОбъекта = ПеречислениеТипыОбъектов.Плагин;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name, customer_id", ИмяПродукта, ИдентификаторИБ);

	Отбор = ОтборПлагинов();
	Если НЕ ОтборПлагинов = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Отбор, ОтборПлагинов);
	КонецЕсли;
	Отбор = Новый ФиксированнаяСтруктура(Отбор);
	
	Возврат ВыбратьЭлементыСлужебный(ТипОбъекта, ПараметрыПути, Отбор, Порядок);
	
КонецФункции

// Создает новый плагин (подключаемый модуль)
//
// Параметры:
//  ИмяПродукта - Строка - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор базы
//  ЗапросСозданияПлагина - Структура - см. ЗапросСозданияПлагина
// 
// Возвращаемое значение:
//  Структура - см. Плагин
//
Функция СоздатьПлагин(ИмяПродукта, ИдентификаторИБ, ЗапросСозданияПлагина) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта), 
		НеЗаполнено(ИдентификаторИБ));
		
	ДанныеПлагина = ЗапросСозданияПлагина.Данные;
	Если ТипЗнч(ДанныеПлагина) = Тип("ДвоичныеДанные") Тогда
		ДанныеПлагина = Base64Строка(ДанныеПлагина);
	КонецЕсли;
		
	ДанныеЗапроса = Новый Соответствие;
	ДанныеЗапроса.Вставить("content_data", ДанныеПлагина);
	ДанныеЗапроса.Вставить("description", ЗапросСозданияПлагина.Описание);
	ДанныеЗапроса.Вставить("filename", ЗапросСозданияПлагина.ИмяФайла);
	ДанныеЗапроса.Вставить("plugin_type", ЗапросСозданияПлагина.Тип);
	ДанныеЗапроса.Вставить("hash_ext", НРег(ЗапросСозданияПлагина.ХешРасширения));
	
	Если ЗначениеЗаполнено(ЗапросСозданияПлагина.ХешРодителя) Тогда
		ДанныеЗапроса.Вставить("parent_md5hash", ЗапросСозданияПлагина.ХешРодителя);
	КонецЕсли;
	
	Ответ = PostJson("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/plugins", ДанныеЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);

	Возврат _РазобратьПлагин(Данные);
	
КонецФункции // СоздатьПлагин

// Изменяет существующий плагин (подключаемый модуль)
//
// Параметры:
//  ИмяПродукта - Строка - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор базы
//  ИдентификаторПлагина - Строка - Идентификатор плагина
//  ЗапросСозданияПлагина - Структура - см. ЗапросСозданияПлагина
// 
// Возвращаемое значение:
//  Структура - см. Плагин
//
Функция ИзменитьПлагин(ИмяПродукта, ИдентификаторИБ, ИдентификаторПлагина, ЗапросСозданияПлагина) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта), 
		НеЗаполнено(ИдентификаторИБ), 
		НеЗаполнено(ИдентификаторПлагина));
		
	ДанныеПлагина = ЗапросСозданияПлагина.Данные;
	Если ТипЗнч(ДанныеПлагина) = Тип("ДвоичныеДанные") Тогда
		ДанныеПлагина = Base64Строка(ДанныеПлагина);
	КонецЕсли;
		
	ДанныеЗапроса = Новый Соответствие;
	ДанныеЗапроса.Вставить("content_data", ДанныеПлагина);
	ДанныеЗапроса.Вставить("description", ЗапросСозданияПлагина.Описание);
	ДанныеЗапроса.Вставить("filename", ЗапросСозданияПлагина.ИмяФайла);
	ДанныеЗапроса.Вставить("plugin_type", ЗапросСозданияПлагина.Тип);
	ДанныеЗапроса.Вставить("hash_ext", НРег(ЗапросСозданияПлагина.ХешРасширения));
	
	Если ЗначениеЗаполнено(ЗапросСозданияПлагина.ХешРодителя) Тогда
		ДанныеЗапроса.Вставить("parent_md5hash", ЗапросСозданияПлагина.ХешРодителя);
	КонецЕсли;
	
	АдресЗапроса = "/v4/products/" + ИмяПродукта 
					+ "/customers/" + ИдентификаторИБ 
					+ "/plugins/" + ИдентификаторПлагина;
	
	Ответ = PostJson(АдресЗапроса, ДанныеЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);

	Возврат _РазобратьПлагин(Данные);
	
КонецФункции // СоздатьПлагин

// Возвращает контент версии продукта продукта по имени
//
// Параметры:
//  ИмяПродукта - Строка - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор базы
//  ИдентификаторПлагина - Строка - Идентификатор плагина
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. Плагин
//
Функция ПолучитьПлагин(ИмяПродукта, ИдентификаторИБ, ИдентификаторПлагина) Экспорт

	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ),
		НеЗаполнено(ИдентификаторПлагина));

	ТипОбъекта = ПеречислениеТипыОбъектов.Плагин;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура(
							"product_name, customer_id, plugin_id", 
							ИмяПродукта, ИдентификаторИБ, ИдентификаторПлагина);
	
	Возврат ПолучитьОбъектСлужебный(ТипОбъекта, ПараметрыПути);

КонецФункции

// Скачать данные плагина (подключаемого модуля)
//
// Параметры:
//  ИмяПродукта - Строка - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор базы
//  ИдентификаторПлагина - Строка - Идентификатор плагина
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Данные плагина
//
Функция СкачатьПлагин(ИмяПродукта, ИдентификаторИБ, ИдентификаторПлагина) Экспорт

	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта), 
		НеЗаполнено(ИдентификаторИБ),
		НеЗаполнено(ИдентификаторПлагина));
		
	АдресРесурса = "/v4/products/" + ИмяПродукта 
					+ "/customers/" + ИдентификаторИБ 
					+ "/plugins/" + ИдентификаторПлагина 
					+ "/download"; 
		
	Ответ = Get(АдресРесурса);
	ПроверитьСостояниеHTTP(Ответ);
	
	Возврат КоннекторЛок.КакДвоичныеДанные(Ответ);
	
КонецФункции // СкачатьПлагин

// Удаляет плагин
//
// Параметры:
//  ИмяПродукта - Строка    - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор ИБ 
//  ИдентификаторПлагина - Строка - Идентификатор плагина
// 
// Возвращаемое значение:
//   Отсутствует
//
Функция УдалитьПлагин(ИмяПродукта, ИдентификаторИБ, ИдентификаторПлагина) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторИБ),
		НеЗаполнено(ИдентификаторПлагина));
		
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ИдентификаторИБ, "Строка"),
		НесоответствиеТипов(ИдентификаторПлагина, "Строка"));
	
	Ответ = Delete("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/plugins/" + ИдентификаторПлагина);
	
	Возврат Неопределено;

КонецФункции

// Методы по работе с настройками

// Записывает массив настроек ИБ в удаленное хранилище
//
// Параметры:
//  ИмяПродукта - Строка - Имя продукта
//  ИдентификаторИБ - Строка - Идентификатор информационной базы 
//  Настройки - Массив - см. НастройкаИБ, может быть Структурой
// 
// Возвращаемое значение:
//  Массив - см. СохраненнаяНастройкаИБ
//
Функция ЗаписатьНастройкиИБ(ИмяПродукта, ИдентификаторИБ, Настройки) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта), 
		НеЗаполнено(ИдентификаторИБ));

	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"), 
		НесоответствиеТипов(ИдентификаторИБ, "Строка"));
		
	КоллекцияНастроек = НастройкиПроверитьИПрочитать(Настройки);

	ДанныеЗапроса = Новый Соответствие;	
	ДанныеЗапроса.Вставить("settings", КоллекцияНастроек); 

	Ответ = PostJson("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/settings", ДанныеЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат _РазобратьСохраненныеНастройкиИБ(Данные.Получить("settings"));
	
КонецФункции

// Выбирает настройки по заданному отбору
//
// Параметры:
//  ИмяПродукта - Строка - имя продукта
//  ИдентификаторИБ - Строка - идентификатор информационной базы
//  ОтборНастроек - Структура - см. ОтборНастроек - (необязательный)
//  Порядок - Строка - "ДатаИзменения", "ДатаИзменения Убыв", "КлючНастроек", "КлючНастроек Убыв"- (необязательный)
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. ВыборкаЭлементов
//
Функция ВыбратьНастройкиИБ(ИмяПродукта, ИдентификаторИБ, ОтборНастроек = Неопределено, Порядок = Неопределено) Экспорт
	
	ТипОбъекта = ПеречислениеТипыОбъектов.Настройка;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name, customer_id", ИмяПродукта, ИдентификаторИБ);

	Отбор = ОтборНастроек();
	Если НЕ ОтборНастроек = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Отбор, ОтборНастроек);
	КонецЕсли;
	Отбор = Новый ФиксированнаяСтруктура(Отбор);
	
	Возврат ВыбратьЭлементыСлужебный(ТипОбъекта, ПараметрыПути, Отбор, Порядок);
	
КонецФункции

// Удаляет настройку по ключу, заданному в отборе
//
// Параметры:  
//  ИмяПродукта - Строка - имя продукта
//  ИдентификаторИБ - Строка - идентификатор информационной базы
//  ОтборНастроек - Структура - см. ОтборНастроек
//
// Возвращаемое значение:
//  Отсутствует
//
Функция УдалитьНастройкиИБ(ИмяПродукта, ИдентификаторИБ, ОтборНастроек) Экспорт

	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта), 
		НеЗаполнено(ИдентификаторИБ));

	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"), 
		НесоответствиеТипов(ИдентификаторИБ, "Строка"));
	
	ПараметрыЗапроса = Новый Структура;	
	ПараметрыЗапроса.Вставить("key", СокрЛП(ОтборНастроек.КлючНастроек));

	Ответ = Delete("/v4/products/" + ИмяПродукта + "/customers/" + ИдентификаторИБ + "/settings", , ПараметрыЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	
	Возврат Неопределено;
	
КонецФункции

// Методы по чтению ленты событий

// Выбирает события по заданному отбору
//
// Параметры:
//  ИмяПродукта - Строка - имя продукта
//  ИдентификаторИБ - Строка - идентификатор информационной базы
//  ОтборСобытий - Структура - см. ОтборСобытий - (необязательный)
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. ВыборкаЭлементов
//
Функция ВыбратьСобытия(ИмяПродукта, ИдентификаторИБ = Неопределено, ОтборСобытий = Неопределено) Экспорт
	
	ТипОбъекта = ПеречислениеТипыОбъектов.Событие;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name", ИмяПродукта);

	Отбор = ОтборСобытий();
	Если НЕ ОтборСобытий = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Отбор, ОтборСобытий);
	КонецЕсли;
	
	Отбор.Вставить("ИдентификаторИБ", ИдентификаторИБ);
	
	Отбор = Новый ФиксированнаяСтруктура(Отбор);
	
	Возврат ВыбратьЭлементыСлужебный(ТипОбъекта, ПараметрыПути, Отбор, Неопределено);
	
КонецФункции

// Возвращает событие по идентификатору
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//   ИдентификаторСобытия - Строка - Идентификатор события
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. Событие
//
Функция ПолучитьСобытие(ИмяПродукта, ИдентификаторСобытия) Экспорт

	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИдентификаторСобытия));

	ТипОбъекта = ПеречислениеТипыОбъектов.Событие;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name, event_id", ИмяПродукта, ИдентификаторСобытия);
	
	Возврат ПолучитьОбъектСлужебный(ТипОбъекта, ПараметрыПути);

КонецФункции // ПолучитьСобытие

// Методы по работе с уведомлениями (notifications)

// Запрашивает уведомления в сервисе
//
// Параметры:
//  ИмяПродукта - Строка - Имя продукта в сервисе
//  ЗапросУведомлений - Структура - см. ЗапросУведомлений
//
// Возвращаемое значение:
//  Структура - см. ОтветУведомления
//
Функция ПолучитьУведомления(ИмяПродукта, ЗапросУведомлений) Экспорт
	
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ЗапросУведомлений, "Структура"));
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта));
		
	Возврат ПолучитьУведомленияСлужебный(ИмяПродукта, ЗапросУведомлений);
		
КонецФункции

// Методы по проверке и скачиванию обновлений (check)

// Проверяет обновления для переденной версии
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//   ИмяВерсии - Структура - см. КонтекстВерсии
//   ДопПараметры - Произвольный - (необязательный)
//
// Возвращаемое значение:
//   Структура - см. РезультатПроверки
//
Функция ПроверитьОбновление(ИмяПродукта, ИмяВерсии, ДопПараметры = Неопределено) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИмяВерсии));
	
	ПроверитьПараметры(
		НесоответствиеТипов(ИмяПродукта, "Строка"),
		НесоответствиеТипов(ИмяВерсии, "Структура, ФиксированнаяСтруктура"));
	
	Результат = ПроверитьОбновлениеСлужебный(НРег(ИмяПродукта), ИмяВерсии, ДопПараметры);
	
	Возврат ФиксированныеДанные(Результат);
	
КонецФункции // ПроверитьОбновление

// Скачивает контент согласно результату проверки
//
// Параметры:
//   РезультатПроверки - Структура - см. РезультатПроверки
//   ТипКонтента - Строка - Тип контент, например data-processor
//   ДопПараметры - Произвольный - (необязательный)
//
// Возвращаемое значение:
//   ДвоичныеДанные - Контент
//
Функция СкачатьОбновление(РезультатПроверки, ТипКонтента, ДопПараметры = Неопределено) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(РезультатПроверки),
		НеЗаполнено(ТипКонтента));
	
	ПроверитьПараметры(
		НесоответствиеТипов(РезультатПроверки, "Структура, ФиксированнаяСтруктура"),
		НесоответствиеТипов(ТипКонтента, "Строка"));
	
	Возврат СкачатьОбновлениеСлужебный(РезультатПроверки, ТипКонтента, ДопПараметры);
	
КонецФункции // СкачатьОбновление

// Методы по работе с версиями продуктов (versions)

// Выбирает версии продуктов по заданному отбору
//
// Параметры:          
//   ИмяПродукта - Строка - Имя продукта
//   Отбор - Структура - см. ОтборВерсий - (необязательный)
//   Порядок - Строка - возможные значения: Убыв, Возр - (необязательный)
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. ВыборкаЭлементов
//
Функция ВыбратьВерсии(ИмяПродукта, Отбор = Неопределено, Порядок = Неопределено) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта));

	ТипОбъекта = ПеречислениеТипыОбъектов.Версия;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name", ИмяПродукта);
	
	ОтборВерсий = ОтборВерсий();
	Если НЕ Отбор = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ОтборВерсий, Отбор);
	КонецЕсли;
	ОтборВерсий = Новый ФиксированнаяСтруктура(ОтборВерсий);
	
	Возврат ВыбратьЭлементыСлужебный(ТипОбъекта, ПараметрыПути, ОтборВерсий, Порядок);
	
КонецФункции

// Возвращает версию продукта по имени
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//   ИмяВерсии - Строка - Имя версии
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. Версия
//
Функция ПолучитьВерсию(ИмяПродукта, ИмяВерсии) Экспорт

	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИмяВерсии));

	ТипОбъекта = ПеречислениеТипыОбъектов.Версия;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name, version_name", ИмяПродукта, ИмяВерсии);
	
	Возврат ПолучитьОбъектСлужебный(ТипОбъекта, ПараметрыПути);

КонецФункции

// Методы по работе с контентом (contents)

// Выбирает контенты версий продукта по заданному отбору
//
// Параметры:  
//   ИмяПродукта - Строка - Имя продукта
//   ИмяВерсии - Строка - Имя версии продукта
//   Отбор - Структура - см. ОтборКонтентов - (необязательный)
//   Порядок - Строка - возможные значения: Убыв, Возр - (необязательный)
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. ВыборкаЭлементов
//
Функция ВыбратьКонтентыВерсии(ИмяПродукта, ИмяВерсии, Отбор = Неопределено, Порядок = Неопределено) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИмяВерсии));

	ТипОбъекта = ПеречислениеТипыОбъектов.Контент;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура("product_name, version_name", ИмяПродукта, ИмяВерсии);

	ОтборКонтентов = ОтборКонтентов();
	Если НЕ Отбор = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ОтборКонтентов, Отбор);
	КонецЕсли;
	ОтборКонтентов = Новый ФиксированнаяСтруктура(ОтборКонтентов);
	
	Возврат ВыбратьЭлементыСлужебный(ТипОбъекта, ПараметрыПути, ОтборКонтентов, Порядок);
	
КонецФункции

// Возвращает контент версии продукта продукта по имени
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//   ИмяВерсии - Строка - Имя версии
//   ИмяКонтента - Строка - Имя контента
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - см. Контент
//
Функция ПолучитьКонтент(ИмяПродукта, ИмяВерсии, ИмяКонтента) Экспорт

	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИмяВерсии),
		НеЗаполнено(ИмяКонтента));

	ТипОбъекта = ПеречислениеТипыОбъектов.Контент;
	
	ПараметрыПути = Новый ФиксированнаяСтруктура(
							"product_name, version_name, content_name", 
							ИмяПродукта, ИмяВерсии, ИмяКонтента);
	
	Возврат ПолучитьОбъектСлужебный(ТипОбъекта, ПараметрыПути);

КонецФункции

// Скачивает контент версии продукта продукта по имени
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//   ИмяВерсии - Строка - Имя версии
//   ИмяКонтента - Строка - Имя контента
//
// Возвращаемое значение:
//   ДвоичныеДанные - Контент
//
Функция СкачатьКонтент(ИмяПродукта, ИмяВерсии, ИмяКонтента) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИмяВерсии),
		НеЗаполнено(ИмяКонтента));
	
	ПараметрыПути = Новый ФиксированнаяСтруктура(
							"product_name, version_name, content_name", 
							ИмяПродукта, ИмяВерсии, ИмяКонтента);

	Возврат СкачатьКонтентСлужебный(ПараметрыПути);
	
КонецФункции

// Методы по работе с функциональными опциями (adjustments)

// Возвращает параметры списка функциональных опций продукта
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//   ЗапросФункциональныхОпций - Структура - см. ЗапросФункциональныхОпций
//
// Возвращаемое значение:
//   Массив - массив структур ПараметрФункциональнойОпции
//
Функция ПолучитьСписокФункциональныхОпцийПродукта(ИмяПродукта, ЗапросФункциональныхОпций = Неопределено) Экспорт
	
	ПроверитьПараметры(НеЗаполнено(ИмяПродукта));

	АдресРесурса = "/v4/products/" + ИмяПродукта + "/features";
	
	ПараметрыЗапроса = Новый Соответствие;
	Если НЕ ЗапросФункциональныхОпций = Неопределено Тогда
		ПараметрыЗапроса.Вставить("customer_id", ЗапросФункциональныхОпций.ИдентификаторКлиента);
	КонецЕсли;
	
	Ответ = Get(АдресРесурса, ПараметрыЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат СписокФункциональныхОпцийРазобратьОтвет(Данные);
	
КонецФункции

// Возвращает параметры функциональной опции продукта
//
// Параметры:
//   ИмяПродукта - Строка - Имя продукта
//   ИмяФункциональнойОпции - Строка - Имя функциональной опции
//   ЗапросФункциональныхОпций - Структура - см. ЗапросФункциональныхОпций
//
// Возвращаемое значение:
//   Массив - массив структур ПараметрФункциональнойОпции
//
Функция ПолучитьФункциональнуюОпциюПродукта(ИмяПродукта, 
											ИмяФункциональнойОпции, 
											ЗапросФункциональныхОпций = Неопределено) Экспорт
	
	ПроверитьПараметры(
		НеЗаполнено(ИмяПродукта),
		НеЗаполнено(ИмяФункциональнойОпции));
		
	АдресРесурса = "/v4/products/" + ИмяПродукта + "/features/" + ИмяФункциональнойОпции;
	
	ПараметрыЗапроса = Новый Соответствие;
	Если НЕ ЗапросФункциональныхОпций = Неопределено Тогда
		ПараметрыЗапроса.Вставить("customer_id", ЗапросФункциональныхОпций.ИдентификаторКлиента);
	КонецЕсли;
	
	Ответ = Get(АдресРесурса, ПараметрыЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат РазобратьПараметрыФункциональнойОпции(Данные);
	
КонецФункции

// Вспомогательные методы

// Увеличивает итератор выборки элементов или сообщает об окончании выборки,
// самостоятельно запрашивает следующую порцию данных при необходимости.
//
// Параметры:  
//   Выборка - ФиксированнаяСтруктура - см. ВыборкаЭлементов
//
// Возвращаемое значение:
//   Булево - Истина (если увеличили итератор), Ложь (если выборка закончилась)
//
Функция Следующий(Выборка) Экспорт
	
	Если Выборка._ИндексБуфера >= Выборка._Буфер.ВГраница() Тогда
		Результат = Ложь;
		Если НЕ (Выборка._РазмерБуфера < Выборка._Отбор.РазмерПорции) Тогда // не последняя порция
			
			Выборка = ВыбратьЭлементыСлужебный(Выборка._ТипОбъекта, 
												Выборка._ПараметрыПути, 
												Выборка._Отбор, 
												Выборка._Порядок, 
												Выборка._Сдвиг + Выборка._РазмерБуфера);
			
			Если Выборка._РазмерБуфера > 0 Тогда
				ИндексБуфера = 0;
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ИндексБуфера = Выборка._ИндексБуфера + 1;
		Результат = Истина;
	КонецЕсли; 
	
	Если Результат Тогда
		
		ВыборкаСтруктура = ВыборкаЭлементов();
		ЗаполнитьЗначенияСвойств(ВыборкаСтруктура, Выборка);
		
		ВыборкаСтруктура.ТекущийЭлемент = Выборка._Буфер[ИндексБуфера]; 
		ВыборкаСтруктура._ИндексБуфера = ИндексБуфера; 
		
		Выборка = Новый ФиксированнаяСтруктура(ВыборкаСтруктура);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  

////////////////////////////////////////////////////////////////////////////////
// Служебный программный интерфейс

Процедура УстановитьКоннектор(Значение) Экспорт
	
	КоннекторЛок = Значение;
	
КонецПроцедуры // УстановитьКоннектор

Процедура УстановитьСтр(Значение) Экспорт
	
	Стр = Значение;
	
КонецПроцедуры // УстановитьСтр

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Функция ПроверитьОбновлениеСлужебный(ИмяПродукта, КонтекстВерсии, ДопПараметры)
	
	ДанныеЗапроса = СобратьЗапросПроверки(КонтекстВерсии, ДопПараметры);
	Ответ = PostJson("/v3/" + ИмяПродукта + "/check", ДанныеЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Результат = РазобратьРезультатПроверки(Данные);
	Результат.Продукт = ИмяПродукта;
	
	Возврат Результат;
	
КонецФункции // ПроверитьОбновлениеСлужебный

Функция СкачатьОбновлениеСлужебный(РезультатПроверки, ТипКонтента, ДопПараметры)
	
	Если НЕ РезультатПроверки.ЕстьОбновление Тогда
		// TODO переделать в ошибку значения
		ВызватьИсключение "Результат проверки не содержит обновления";
	КонецЕсли;
	
	Ресурс = "content";
	Ссылка = Неопределено;
	Для Каждого Элемент Из РезультатПроверки.Ссылки Цикл
		Если Элемент.Ресурс = Ресурс
			И Элемент.ТипКонтента = ТипКонтента Тогда
			Ссылка = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Ссылка = Неопределено Тогда
		// TODO переделать в ошибку значения
		ВызватьИсключение "Результат проверки не содержит контента " + ТипКонтента;
	КонецЕсли;
	
	Ответ = Get(Ссылка.АдресРесурса);
	
	ПроверитьСостояниеHTTP(Ответ);
	
	Возврат КоннекторЛок.КакДвоичныеДанные(Ответ);
	
КонецФункции // СкачатьОбновлениеСлужебный

Функция ПолучитьОбъектСлужебный(ТипОбъекта, ПараметрыПути = Неопределено) 
	
	НачалоАдреса = "/v4/products";

	Если ТипОбъекта = ПеречислениеТипыОбъектов.Продукт Тогда
		
		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name;
		
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Версия Тогда
		
		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						+ "/versions/" + ПараметрыПути.version_name;
		
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Контент Тогда
		
		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						+ "/versions/" + ПараметрыПути.version_name
						+ "/contents/" + ПараметрыПути.content_name;
		
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Плагин Тогда
		
		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						+ "/customers/" + ПараметрыПути.customer_id
						+ "/plugins/" + ПараметрыПути.plugin_id;
		
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Событие Тогда
		
		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						+ "/events/" + Формат(ПараметрыПути.event_id, "ЧН=0; ЧГ=");
		
	Иначе
		ВызватьИсключение "Попытка получения данных неизвестного типы объекта: " + ТипОбъекта;
	КонецЕсли;

	Ответ = Get(АдресРесурса);
	ПроверитьСостояниеHTTP(Ответ);
	
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Возврат _РазобратьЭлемент(ТипОбъекта, Данные);
	
КонецФункции

Функция СкачатьКонтентСлужебный(ПараметрыПути) 
	
	АдресРесурса = "/v4/products/" + ПараметрыПути.product_name
					+ "/versions/" + ПараметрыПути.version_name
					+ "/contents/" + ПараметрыПути.content_name
					+ "/download";

	Ответ = Get(АдресРесурса);    
	ПроверитьСостояниеHTTP(Ответ);
	
	Возврат КоннекторЛок.КакДвоичныеДанные(Ответ);
	
КонецФункции

Функция ВыбратьЭлементыСлужебный(ТипОбъекта, ПараметрыПути, Отбор, Порядок, Сдвиг = 0)

	ПараметрыЗапроса = СобратьПараметрыЗапроса(ТипОбъекта, Отбор, Порядок, Сдвиг);
	
	НачалоАдреса = "/v4/products";
	
	Если ТипОбъекта = ПеречислениеТипыОбъектов.Продукт Тогда

		АдресРесурса = НачалоАдреса;
		ИмяНабораДанных = "products";

	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Версия Тогда

		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						+ "/versions";
		ИмяНабораДанных = "versions";
		
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Контент Тогда

		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						+ "/versions/" + ПараметрыПути.version_name
						+ "/contents";
		ИмяНабораДанных = "contents";

	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Плагин Тогда

		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						 + "/customers/" + ПараметрыПути.customer_id
						 + "/plugins";
		ИмяНабораДанных = "plugins";

	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Настройка Тогда

		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name
						 + "/customers/" + ПараметрыПути.customer_id
						 + "/settings";
		ИмяНабораДанных = "settings";

	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Событие Тогда

		АдресРесурса = НачалоАдреса + "/" + ПараметрыПути.product_name + "/events";
		ИмяНабораДанных = "events";

	Иначе
		ВызватьИсключение "Попытка получения набора данных неизвестного типы объекта: " + ТипОбъекта;
	КонецЕсли;
	
	Ответ = Get(АдресРесурса, ПараметрыЗапроса);
	ПроверитьСостояниеHTTP(Ответ);
	
	Данные = КоннекторЛок.КакJson(Ответ);
	
	МассивЭлементов = Новый Массив;
	Для Каждого Элемент Из Данные.Получить(ИмяНабораДанных) Цикл
		МассивЭлементов.Добавить(_РазобратьЭлемент(ТипОбъекта, Элемент));
	КонецЦикла;
	
	Выборка = ВыборкаЭлементов();
	
	Выборка.ТекущийЭлемент = Неопределено;
	Выборка.Количество = Данные.Получить("total");

	Выборка._ТипОбъекта = ТипОбъекта;
	Выборка._ПараметрыПути = ПараметрыПути;
	Выборка._Отбор = Отбор;
	Выборка._Порядок = Порядок;
	Выборка._Сдвиг = Данные.Получить("offset");
	Выборка._Буфер = Новый ФиксированныйМассив(МассивЭлементов);
	Выборка._РазмерБуфера = Данные.Получить("count"); 
	Выборка._ИндексБуфера = -1;
	
	Возврат Новый ФиксированнаяСтруктура(Выборка);
	
КонецФункции

Процедура ЗаполнитьПараметрыЗапросаВыборкиПродуктов(ПараметрыЗапроса, Отбор)
	
	Если ЗначениеЗаполнено(Отбор.ТипПродукта) Тогда
		ПараметрыЗапроса.Вставить("product_type", _РазобратьТипПродукта(Отбор.ТипПродукта));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.Родитель) Тогда
		ПараметрыЗапроса.Вставить("parent_name", СокрЛП(Отбор.Родитель)); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ПодстрокаПоиска) Тогда
		ПараметрыЗапроса.Вставить("search", СокрЛП(Отбор.ПодстрокаПоиска));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗапросаВыборкиВерсий(ПараметрыЗапроса, Отбор)

	Если ЗначениеЗаполнено(Отбор.ОтВерсии) Тогда
		ПараметрыЗапроса.Вставить("from_version", Отбор.ОтВерсии);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗапросаВыборкиНастроек(ПараметрыЗапроса, Отбор)

	Если ЗначениеЗаполнено(Отбор.КлючНастроек) Тогда
		ПараметрыЗапроса.Вставить("key", СокрЛП(Отбор.КлючНастроек));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ДатаИзмененияС) Тогда
		ПараметрыЗапроса.Вставить("updated_from", Iso8601(Отбор.ДатаИзмененияС));
	КонецЕсли;
	
	Если Отбор.ПоказыватьУдаленные = Истина Тогда
		ПараметрыЗапроса.Вставить("show_deleted", "True");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПараметрыЗапросаВыборкиПлагинов(ПараметрыЗапроса, Отбор)
	
	Если ЗначениеЗаполнено(Отбор.Тип) Тогда
		ПараметрыЗапроса.Вставить("plugin_type", СокрЛП(Отбор.Тип));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ХешРодителя) Тогда
		ПараметрыЗапроса.Вставить("parent_md5hash", СокрЛП(Отбор.ХешРодителя));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ДатаИзмененияС) Тогда
		ПараметрыЗапроса.Вставить("updated_from", Iso8601(Отбор.ДатаИзмененияС));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ДатаИзмененияПо) Тогда
		ПараметрыЗапроса.Вставить("updated_to", Iso8601(Отбор.ДатаИзмененияПо));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ДатаСозданияС) Тогда
		ПараметрыЗапроса.Вставить("created_from", Iso8601(Отбор.ДатаСозданияС));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ДатаСозданияПо) Тогда
		ПараметрыЗапроса.Вставить("created_to", Iso8601(Отбор.ДатаСозданияПо));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗапросаВыборкиСобытий(ПараметрыЗапроса, Отбор)
	
	Если ЗначениеЗаполнено(Отбор.ИдентификаторИБ) Тогда
		ПараметрыЗапроса.Вставить("client_id", СокрЛП(Отбор.ИдентификаторИБ));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ИдентификаторСобытияС) Тогда
		ПараметрыЗапроса.Вставить("from_event_id", СокрЛП(Отбор.ИдентификаторСобытияС));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ДатаСобытияС) Тогда
		ПараметрыЗапроса.Вставить("from_timestamp", Iso8601(Отбор.ДатаСобытияС));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСоответствиеПорядка(ТипОбъекта)
	
	СоответствиеПорядка = Новый Соответствие;
	
	// BSLLS:Typo-off
	Если ТипОбъекта = ПеречислениеТипыОбъектов.Настройка Тогда
		СоответствиеПорядка.Вставить("датаизменения", "updated_asc");
		СоответствиеПорядка.Вставить("датаизменения возр", "updated_asc");
		СоответствиеПорядка.Вставить("датаизменения убыв", "updated_desc");
		СоответствиеПорядка.Вставить("ключнастроек", "key_asc");
		СоответствиеПорядка.Вставить("ключнастроек возр", "key_asc");
		СоответствиеПорядка.Вставить("ключнастроек убыв", "key_desc");
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Плагин Тогда
		СоответствиеПорядка.Вставить("датаизменения", "updated asc");
		СоответствиеПорядка.Вставить("датаизменения возр", "updated asc");
		СоответствиеПорядка.Вставить("датаизменения убыв", "updated desc");
	Иначе
		СоответствиеПорядка.Вставить("убыв", "desc");
		СоответствиеПорядка.Вставить("возр", "asc");
	КонецЕсли;
	// BSLLS:Typo-on
	
	Возврат СоответствиеПорядка;
	
КонецФункции

Функция СобратьПараметрыЗапроса(ТипОбъекта, Отбор, Порядок, Сдвиг)
	
	ПараметрыЗапроса = Новый Соответствие;
	
	Если ТипОбъекта = ПеречислениеТипыОбъектов.Продукт Тогда
		ЗаполнитьПараметрыЗапросаВыборкиПродуктов(ПараметрыЗапроса, Отбор);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Версия Тогда
		ЗаполнитьПараметрыЗапросаВыборкиВерсий(ПараметрыЗапроса, Отбор);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Плагин Тогда
		ЗаполнитьПараметрыЗапросаВыборкиПлагинов(ПараметрыЗапроса, Отбор);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Настройка Тогда
		ЗаполнитьПараметрыЗапросаВыборкиНастроек(ПараметрыЗапроса, Отбор);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Событие Тогда
		ЗаполнитьПараметрыЗапросаВыборкиСобытий(ПараметрыЗапроса, Отбор);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Контент Тогда
		
	Иначе
		ВызватьИсключение "В подготовку параметров запроса передан неизвестный тип объекта: " + ТипОбъекта;
	КонецЕсли;
	
	РазмерПорции = Отбор.РазмерПорции;
	
	Если НЕ Порядок = Неопределено Тогда
		
		СоответствиеПорядка = ПолучитьСоответствиеПорядка(ТипОбъекта);
		
		ЗначениеПорядка = СоответствиеПорядка.Получить(НРег(Порядок));
		Если ЗначениеЗаполнено(ЗначениеПорядка) Тогда
			ПараметрыЗапроса.Вставить("order", ЗначениеПорядка);
		Иначе
			ВызватьИсключение "В выборку элементов передан неверный порядок сортировки: " + Порядок;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("count", Формат(РазмерПорции, "ЧН=0; ЧГ="));
	ПараметрыЗапроса.Вставить("offset", Формат(Сдвиг, "ЧН=0; ЧГ="));
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПолучитьУведомленияСлужебный(ИмяПродукта, ЗапросУведомлений)
	
	Адрес = "/v4/products/" + ИмяПродукта + "/notifications";
	Ответ = PostJson(Адрес, УведомленияСобратьЗапрос(ЗапросУведомлений));
	ПроверитьСостояниеHTTP(Ответ);
	Данные = КоннекторЛок.КакJson(Ответ);
	
	Модель = УведомленияРазобратьОтвет(Данные);
	
	Возврат ФиксированныеДанные(Модель);
	
КонецФункции

Функция УведомленияСобратьЗапрос(ЗапросУведомлений)
	
	Запрос = Новый Соответствие;
	Запрос.Вставить("client_id", ЗапросУведомлений.ИдИБ);
	Запрос.Вставить("version", ЗапросУведомлений.Версия);
	
	Если НЕ ЗапросУведомлений.ДопПараметры = Неопределено Тогда
		Для Каждого Элемент Из ЗапросУведомлений.ДопПараметры Цикл
			Запрос.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции // _УведомленияСобратьЗапрос

Функция УведомленияРазобратьОтвет(Данные)
	
	Уведомления = ОтветУведомления();
	
	СписокУведомлений = Данные.Получить("notifications");
	Если СписокУведомлений <> Неопределено Тогда
		Для Каждого Элемент Из СписокУведомлений Цикл
			Уведомление = УведомлениеРазобратьОтвет(Элемент);
			Уведомления.Список.Добавить(Уведомление);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Уведомления;
	
КонецФункции // _УведомленияРазобратьОтвет

Функция УведомлениеРазобратьОтвет(Данные)
	
	Уведомление = ОтветУведомление();
	Уведомление.Ид = Данные.Получить("id");
	Уведомление.Контент = Данные.Получить("content");
	Уведомление.Приоритет = Данные.Получить("priority");
	Уведомление.ДатаНачала = Стр.СтрокаВДатуЛок(Данные.Получить("date_from"));
	Уведомление.ДатаОкончания = Стр.СтрокаВДатуЛок(Данные.Получить("date_to"));
	
	Возврат Уведомление;
	
КонецФункции // _УведомлениеРазобратьОтвет

Функция ЗначениеПростогоТипа(Значение)
	
	ПростыеТипы = Новый Соответствие;
	ПростыеТипы.Вставить(Тип("Строка"), Истина);
	ПростыеТипы.Вставить(Тип("Число"), Истина);
	ПростыеТипы.Вставить(Тип("Булево"), Истина);	
	
	Возврат ПростыеТипы.Получить(ТипЗнч(Значение)) = Истина;
	
КонецФункции

Функция ПроверитьПреобразоватьНастройку(НастройкаИБ)
	
	МаксДлинаКлючаНастройки = 255;
	
	ПроверитьПараметры(НеЗаполнено(НастройкаИБ.КлючНастроек));
	ПроверитьПараметры(НесоответствиеТипов(НастройкаИБ.КлючНастроек, "Строка"));
	
	Если СтрДлина(НастройкаИБ.КлючНастроек) > МаксДлинаКлючаНастройки Тогда
		ВызватьИсключение "Длина ключа настройки не может превышать 255 символов";
	КонецЕсли;
	
	Если НЕ ЗначениеПростогоТипа(НастройкаИБ.Настройки) Тогда
		ВызватьИсключение "Значение сохраняемой настройки может быть только простым (Строка, Число, Булево)";   
	КонецЕсли;
	
	ДанныеНастройки = Новый Соответствие;
	ДанныеНастройки.Вставить("key", НастройкаИБ.КлючНастроек); 
	ДанныеНастройки.Вставить("value", НастройкаИБ.Настройки);
	
	Возврат ДанныеНастройки;

КонецФункции

Функция НастройкиПроверитьИПрочитать(Настройки)
	
	КоллекцияНастроек = Новый Массив;
	
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		КоллекцияНастроек.Добавить(ПроверитьПреобразоватьНастройку(Настройки));
	ИначеЕсли ТипЗнч(Настройки) = Тип("Массив") Тогда
		Для Каждого ЭлементНастройка Из Настройки Цикл
			КоллекцияНастроек.Добавить(ПроверитьПреобразоватьНастройку(ЭлементНастройка));
		КонецЦикла;
	Иначе
		ПроверитьПараметры(
			НесоответствиеТипов(Настройки, "Массив")); 
	КонецЕсли;
		
	Возврат КоллекцияНастроек;
	
КонецФункции

Функция СписокФункциональныхОпцийРазобратьОтвет(Данные)
	
    МассивФО = Новый Массив;
	
	Для Каждого Эл ИЗ Данные Цикл
		ПараметрыФО = РазобратьПараметрыФункциональнойОпции(Эл);
		МассивФО.Добавить(ПараметрыФО);
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивФО);
	
КонецФункции

// Определения

Функция РезультатПроверки()
	
	Модель = Новый Структура;
	Модель.Вставить("ЕстьОбновление");
	Модель.Вставить("Продукт");
	Модель.Вставить("Версия");
	Модель.Вставить("Ссылки");
	
	Возврат Модель;
	
КонецФункции // РезультатПроверки

Функция ОписаниеСсылки() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Ресурс");
	Модель.Вставить("АдресРесурса");
	
	// Используется только для ресурса "content"
	
	Модель.Вставить("ТипКонтента");
	
	Возврат Модель;
	
КонецФункции // ОписаниеСсылки

// Билдеры

Функция СобратьЗапросПроверки(КонтекстВерсии, ДопПараметры)
	
	Предопределенные = Новый Массив;
	Предопределенные.Добавить("version");
	Предопределенные.Добавить("client_id");
	Предопределенные.Добавить("set_experimental");
	
	ДанныеЗапроса = Новый Соответствие;
	ДанныеЗапроса.Вставить("version", КонтекстВерсии.Версия);
	ДанныеЗапроса.Вставить("client_id", КонтекстВерсии.ИдБазы);
	
	Если КонтекстВерсии.ПолучатьБетаВерсии = Ложь Тогда
		ДанныеЗапроса.Вставить("set_experimental", Ложь);
	КонецЕсли;
	
	Для Каждого Элемент Из КонтекстВерсии.ПроизвольныеДанные Цикл
		Если Предопределенные.Найти(Элемент.Ключ) = Неопределено Тогда
			ДанныеЗапроса.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеЗапроса;
	
КонецФункции // СобратьЗапросПроверки

// Модели

Функция ВыборкаЭлементов()

	Результат = Новый Структура();
	
	Результат.Вставить("ТекущийЭлемент");
	Результат.Вставить("Количество");
	
	Результат.Вставить("_ТипОбъекта");
	Результат.Вставить("_ПараметрыПути");
	Результат.Вставить("_Порядок");
	Результат.Вставить("_Отбор");
	Результат.Вставить("_Сдвиг");
	Результат.Вставить("_Буфер");
	Результат.Вставить("_РазмерБуфера");
	Результат.Вставить("_ИндексБуфера");

	Возврат Результат;
	
КонецФункции

Функция Продукт()
	
	Модель = Новый Структура;
	Модель.Вставить("Имя"); // name
	Модель.Вставить("Синоним"); // synonym
	Модель.Вставить("Описание"); // description
	Модель.Вставить("Родитель"); // parent_name
	Модель.Вставить("Тип"); // product_type
	Модель.Вставить("АдресДокументации"); // homepage
	
	Возврат Модель;
	
КонецФункции

Функция НастройкаИБ(КлючНастроек = Неопределено, Настройки = Неопределено) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("КлючНастроек", КлючНастроек);
	Результат.Вставить("Настройки", Настройки);
	
	Возврат Результат;

КонецФункции // НастройкаИБ

Функция СохраненнаяНастройкаИБ()
	
	Результат = НастройкаИБ();
	
	Результат.Вставить("ПометкаУдаления");
	Результат.Вставить("ДатаСоздания");
	Результат.Вставить("ДатаСозданияЧислом");
	Результат.Вставить("ДатаИзменения");
	Результат.Вставить("ДатаИзмененияЧислом");
	
	Возврат Результат;
	
КонецФункции // СохраненнаяНастройкаИБ

Функция ИнформационнаяБаза()
	
	Модель = Новый Структура;
	Модель.Вставить("Идентификатор"); // customer_id
	Модель.Вставить("Владельцы"); // portal_users
	
	Возврат Модель;
	
КонецФункции

// Результат регистрации ИБ
//
// Возвращаемое значение:
//   Структура - Определение
//
Функция РезультатРегистрацииИБ()

	Модель = Новый Структура;
	Модель.Вставить("Идентификатор");
	Модель.Вставить("Токен");
	
	Возврат Модель;
	
КонецФункции // РезультатРегистрацииИБ

Функция ВладелецИнформационнойБазы()
	
	Модель = Новый Структура;
	Модель.Вставить("Имя"); // friendlyName
	Модель.Вставить("Идентификатор"); // id
	Модель.Вставить("Тип"); // type
	
	Возврат Модель;
	
КонецФункции

Функция Версия()

	Модель = Новый Структура;
	Модель.Вставить("Имя"); // version
	Модель.Вставить("Дата"); // release_date
	Модель.Вставить("Описание"); // description
	Модель.Вставить("Контент");
	
	Возврат Модель;
	
КонецФункции

Функция Контент()
	
	Модель = Новый Структура;
	Модель.Вставить("Имя"); // name
	Модель.Вставить("ИмяФайла"); // filename
	Модель.Вставить("Ссылка"); // drive_public_link  
	Модель.Вставить("MD5Хеш"); // md5hash  
	Модель.Вставить("КонтрольнаяСумма"); // src_checksum  
	
	Возврат Модель;
	
КонецФункции

Функция КлючАПИ()
	
	Модель = Новый Структура;
	Модель.Вставить("ДатаРегистрации"); // created
	Модель.Вставить("ДатаРегистрацииЧислом"); // created
	Модель.Вставить("Описание"); // description
	Модель.Вставить("Идентификатор"); // id
	Модель.Вставить("Токен"); // token
	
	Возврат Модель;
	
КонецФункции

Функция Плагин()

	Модель = Новый Структура;
	Модель.Вставить("ДатаСоздания"); // created
	Модель.Вставить("ДатаСозданияЧислом"); // created
	Модель.Вставить("ДатаИзменения"); // updated
	Модель.Вставить("ДатаИзмененияЧислом"); // updated
	Модель.Вставить("Идентификатор"); // id
	Модель.Вставить("Тип"); // plugin_type
	Модель.Вставить("Описание"); // description
	Модель.Вставить("ИмяФайла"); // filename
	Модель.Вставить("ХешMd5"); // hash_md5
	Модель.Вставить("РодительХешMd5"); // parent_md5hash
	Модель.Вставить("ХешРасширения"); // hash_ext
	
	Возврат Модель; 
	
КонецФункции // Плагин

Функция Событие()

	Модель = Новый Структура;    
	Модель.Вставить("ИдентификаторКлиента"); // client_id
	Модель.Вставить("Контент"); // content
	Модель.Вставить("Тип"); // event_type
	Модель.Вставить("Идентификатор"); // id
	Модель.Вставить("ИмяПродукта"); // product_name
	Модель.Вставить("ДатаСобытия"); // timestamp
	Модель.Вставить("ДатаСобытияЧислом"); // timestamp
	
	Возврат Модель;
	
КонецФункции // Событие

Функция ОтборПродуктов() Экспорт
	
	РазмерПорцииПоУмолчанию = 1000;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТипПродукта");
	Результат.Вставить("Родитель");
	Результат.Вставить("ПодстрокаПоиска");
	Результат.Вставить("РазмерПорции", РазмерПорцииПоУмолчанию);
	
	Возврат Результат;

КонецФункции

Функция ОтборВерсий() Экспорт
	
	РазмерПорцииПоУмолчанию = 1000;

	Результат = Новый Структура;
	
	Результат.Вставить("ОтВерсии");
	Результат.Вставить("РазмерПорции", РазмерПорцииПоУмолчанию);
	
	Возврат Результат;

КонецФункции

Функция ОтборКонтентов() Экспорт
	
	РазмерПорцииПоУмолчанию = 1000;

	Результат = Новый Структура;
	Результат.Вставить("РазмерПорции", РазмерПорцииПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция ОтборНастроек() Экспорт
	
	РазмерПорцииПоУмолчанию = 100;
	
	Результат = Новый Структура;
	Результат.Вставить("КлючНастроек", Неопределено);
	Результат.Вставить("ДатаИзмененияС", Неопределено);
	Результат.Вставить("ПоказыватьУдаленные", Ложь);
	Результат.Вставить("РазмерПорции", РазмерПорцииПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция ОтборПлагинов() Экспорт
	
	РазмерПорцииПоУмолчанию = 100;

	Результат = Новый Структура;
	Результат.Вставить("Тип", Неопределено);
	Результат.Вставить("ХешРодителя", Неопределено);
	Результат.Вставить("ДатаИзмененияС", Неопределено);
	Результат.Вставить("ДатаИзмененияПо", Неопределено);
	Результат.Вставить("ДатаСозданияС", Неопределено);
	Результат.Вставить("ДатаСозданияПо", Неопределено);
	Результат.Вставить("РазмерПорции", РазмерПорцииПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСобытий() Экспорт
	
	РазмерПорцииПоУмолчанию = 100;

	Результат = Новый Структура;
	Результат.Вставить("ДатаСобытияС", Неопределено);
	Результат.Вставить("ИдентификаторСобытияС", Неопределено);
	Результат.Вставить("РазмерПорции", РазмерПорцииПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

// Описание запроса уведомлений, содержит информацию о текущей ИБ и продукте
//
// Возвращаемое значение:
//  Структура - ЗапросУведомлений
//
Функция ЗапросУведомлений() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("ИдИБ", "");
	Модель.Вставить("Версия", "");
	Модель.Вставить("ДопПараметры", Новый Структура);
	
	Возврат Модель;
	
КонецФункции // ЗапросУведомлений

// Описание запроса функциональных опций
//
// Возвращаемое значение:
//  Структура - ЗапросФункциональныхОпций
//
Функция ЗапросФункциональныхОпций() Экспорт

	Модель = Новый Структура;
	Модель.Вставить("ИдентификаторКлиента");
	
	Возврат Модель;
	
КонецФункции

// Описание контейнера уведомлений
//
// Возвращаемое значение:
//  Структура - Контейнер уведомлений
//
Функция ОтветУведомления() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Список", Новый Массив);
	
	Возврат Модель;
	
КонецФункции // ОтветУведомления

// Описание контейнера уведомления
//
// Возвращаемое значение:
//  Структура - Контейнер уведомления
//
Функция ОтветУведомление() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Контент");
	Модель.Вставить("ДатаНачала");
	Модель.Вставить("ДатаОкончания");
	Модель.Вставить("Ид");
	Модель.Вставить("Приоритет");
	
	Возврат Модель;
	
КонецФункции // ОтветУведомление

// Описание параметра функциональной опции
//
// Возвращаемое значение:
//  Структура - контейнер параметра функциональной опции
//
Функция ПараметрыФункциональнойОпции() 
	
	Модель = Новый Структура;
	Модель.Вставить("ИмяФункциональнойОпции"); // feature
	Модель.Вставить("Значение"); // value
	
	Возврат Модель;
	
КонецФункции

// Запрос регистрации ИБ
//
// Возвращаемое значение:
//   Структура - Определение
//
Функция ЗапросРегистрацииИБ() Экспорт

	Модель = Новый Структура;
	Модель.Вставить("Идентификатор");
	
	Возврат Модель;
	
КонецФункции // ЗапросРегистрацииИБ

Функция ЗапросИзмененияИБ() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("ИдентификаторПользователя");
	
	Возврат Модель;
	
КонецФункции

Функция ЗапросНовогоКлючаАПИ() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Описание");
	
	Возврат Модель;
	
КонецФункции

// Описание запроса создания плагина
//
// Возвращаемое значение:
//   Структура - Определение
//
Функция ЗапросСозданияПлагина() Экспорт

	Модель = Новый Структура;
	Модель.Вставить("Данные"); // content_data
	Модель.Вставить("Описание"); // description
	Модель.Вставить("ИмяФайла"); // filename
	Модель.Вставить("Тип", "plugin"); // plugin_type
	Модель.Вставить("ХешРодителя"); // parent_md5hash
	Модель.Вставить("ХешРасширения"); // hash_ext
	
	Возврат Модель; 
	
КонецФункции // ЗапросСоздатьПлагин

Функция ПеречислениеТипыПродуктов() Экспорт

	Результат = СобратьПеречислениеСлужебный("Продукт, Плагин, Библиотека");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;

КонецФункции

Функция ПеречислениеТипыОбъектов() 

	Результат = СобратьПеречислениеСлужебный("Продукт, Версия, Контент, Плагин, Настройка, Событие");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;

КонецФункции

Функция СобратьПеречислениеСлужебный(Строка)
	
	Результат = Новый Структура(Строка);
	Для Каждого Эл Из Результат Цикл
		Результат[Эл.Ключ] = Эл.Ключ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Парсеры

Функция _РазобратьЭлемент(ТипОбъекта, Данные)
	
	Если ТипОбъекта = ПеречислениеТипыОбъектов.Продукт Тогда
		Возврат _РазобратьПродукт(Данные);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Версия Тогда
		Возврат _РазобратьВерсию(Данные);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Контент Тогда
		Возврат _РазобратьКонтент(Данные);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Настройка Тогда
		Возврат _РазобратьНастройкуИБ(Данные);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Плагин Тогда
		Возврат _РазобратьПлагин(Данные);
	ИначеЕсли ТипОбъекта = ПеречислениеТипыОбъектов.Событие Тогда
		Возврат _РазобратьСобытие(Данные);
	Иначе
		ВызватьИсключение "Не поддерживается разбор элементы с типом " + ТипОбъекта;
	КонецЕсли;
	
КонецФункции

Функция _РазобратьПродукт(Данные)
	
	ТипПродукта = СокрЛП(Данные.Получить("product_type"));
	
	Если ТипПродукта = "product" Тогда
		Тип = "Продукт";
	ИначеЕсли ТипПродукта = "common_plugin" Тогда
		Тип = "Плагин";
	ИначеЕсли ТипПродукта = "library" Тогда
		Тип = "Библиотека";
	Иначе
		Тип = Неопределено;
	КонецЕсли;
		
	Результат = Продукт();
	Результат.Имя = СокрЛП(Данные.Получить("name"));
	Результат.Синоним = СокрЛП(Данные.Получить("synonym"));
	Результат.Описание = СокрЛП(Данные.Получить("description"));
	Результат.Родитель = СокрЛП(Данные.Получить("parent_name"));
	Результат.Тип = Тип;
	Результат.АдресДокументации = СокрЛП(Данные.Получить("homepage"));
		
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция _РазобратьВерсию(Данные)
	
	Результат = Версия();
	
	Результат.Имя = СокрЛП(Данные.Получить("version"));
	Результат.Дата = Стр.СтрокаВДатуЛок(Данные.Получить("release_date"));
	Результат.Описание = СокрЛП(Данные.Получить("description"));
	
	МассивКонтента = Новый Массив;
	
	Контент = Данные.Получить("content");
	Если ТипЗнч(Контент) = Тип("Соответствие") Тогда
			
		ТипКонтент = ПеречислениеТипыОбъектов.Контент;
		
		Для Каждого Эл Из Контент Цикл
			МассивКонтента.Добавить(_РазобратьЭлемент(ТипКонтент, Эл.Значение));
		КонецЦикла;
			
	КонецЕсли;
	
	Результат.Контент = Новый ФиксированныйМассив(МассивКонтента);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция _РазобратьКонтент(Данные)
	
	Результат = Контент();
	
	Результат.Имя = СокрЛП(Данные.Получить("name"));
	Результат.ИмяФайла = СокрЛП(Данные.Получить("filename"));
	Результат.Ссылка = СокрЛП(Данные.Получить("drive_public_link"));
	Результат.MD5Хеш = СокрЛП(Данные.Получить("md5hash"));
	Результат.КонтрольнаяСумма = СокрЛП(Данные.Получить("src_checksum"));
		
	Возврат Новый ФиксированнаяСтруктура(Результат);

КонецФункции

Функция _РазобратьТипПродукта(ТипПродукта)
	
	Если ТипПродукта = ПеречислениеТипыПродуктов.Продукт Тогда
		Возврат "product";
	ИначеЕсли ТипПродукта = ПеречислениеТипыПродуктов.Плагин Тогда
		Возврат "common_plugin";
	ИначеЕсли ТипПродукта = ПеречислениеТипыПродуктов.Библиотека Тогда
		Возврат "library";
	Иначе
		ВызватьИсключение "Неизвестный тип продукта для разбора: " + ТипПродукта;
	КонецЕсли;
	
КонецФункции

Функция _РазобратьРезультатРегистрацииИБ(Данные) Экспорт
	
	Результат = РезультатРегистрацииИБ();
	Результат.Идентификатор = Данные["customer_id"];

	// Выдается только при первичной регистрации
	// Если токен пустой, значит база уже зарегистрирована
	// и вам нужно запросить новый токен, соответствующим методом
	
	Токен = Данные.Получить("token");
	Если ЗначениеЗаполнено(Токен) Тогда
		Результат.Токен = Токен;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // _РазобратьРезультатРегистрации

Функция _РазобратьИБ(Данные)
	
	Результат = ИнформационнаяБаза();
	Результат.Идентификатор = Данные.Получить("customer_id"); 
	
	МассивВладельцев = Новый Массив;
	
	СписокВладельцев = Данные.Получить("portal_users");
	Если ТипЗнч(СписокВладельцев) = Тип("Массив") Тогда
		Для Каждого Эл Из СписокВладельцев Цикл
			МассивВладельцев.Добавить(_РазобратьВладельцаИБ(Эл));
		КонецЦикла;
	КонецЕсли;
	
	Результат.Владельцы = МассивВладельцев;
	
	Возврат Результат;
	
КонецФункции

Функция _РазобратьВладельцаИБ(Данные)
	
	Результат = ВладелецИнформационнойБазы();
	Результат.Имя = Данные.Получить("friendlyName");
	Результат.Идентификатор = Данные.Получить("id");
	Результат.Тип = Данные.Получить("type");
	
	Возврат Результат;
	
КонецФункции

Функция _РазобратьКлючАПИ(Данные)
	
	Результат = КлючАПИ();
	Результат.Идентификатор = Данные.Получить("id");
	Результат.ДатаРегистрации = ДатаIso8601(Данные.Получить("created"));
	Результат.ДатаРегистрацииЧислом = ЧислоIso8601(Данные.Получить("created"));
	Результат.Описание = Данные.Получить("description");
	Результат.Токен = Данные.Получить("token");
	
	Возврат Результат;

КонецФункции

Функция _РазобратьСохраненныеНастройкиИБ(Данные)

	Массив = Новый Массив;
	Для Каждого Элемент Из Данные Цикл
		Массив.Добавить(_РазобратьНастройкуИБ(Элемент));
	КонецЦикла;

	Возврат Массив;
	
КонецФункции

Функция _РазобратьНастройкуИБ(Данные) Экспорт

	ПростыеТипы = Новый Соответствие;
	ПростыеТипы.Вставить(Тип("Строка"), Истина);
	ПростыеТипы.Вставить(Тип("Число"), Истина);
	ПростыеТипы.Вставить(Тип("Булево"), Истина);	
	
	Результат = СохраненнаяНастройкаИБ();
	Результат.ПометкаУдаления = Данные.Получить("deleted") = Истина;
	Результат.КлючНастроек = Строка(Данные.Получить("key"));
	
	Значение = Данные.Получить("value");
	ПростойТип = ПростыеТипы.Получить(ТипЗнч(Значение)) = Истина;
	Если ПростойТип Тогда
		Результат.Настройки = Значение;
	Иначе
		Результат.Настройки = Строка(Значение);
	КонецЕсли;
	
	ДатаИзмененияISO = Данные["updated_at"];
	ДатаСозданияISO = Данные["created_at"];
	
	Результат.ДатаИзменения = ДатаIso8601(ДатаИзмененияISO);
	Результат.ДатаИзмененияЧислом = ЧислоIso8601(ДатаИзмененияISO);
	Результат.ДатаСоздания = ДатаIso8601(ДатаСозданияISO);
	Результат.ДатаСозданияЧислом = ЧислоIso8601(ДатаСозданияISO);
	
	Возврат Результат;
	
КонецФункции

Функция _РазобратьПлагин(Данные) Экспорт
	
	Плагин = Плагин();
	Плагин.ДатаСоздания = ДатаIso8601(Данные.Получить("created"));
	Плагин.ДатаСозданияЧислом = ЧислоIso8601(Данные.Получить("created"));
	Плагин.ДатаИзменения = ДатаIso8601(Данные.Получить("updated"));
	Плагин.ДатаИзмененияЧислом = ЧислоIso8601(Данные.Получить("updated"));
	Плагин.Идентификатор = Данные.Получить("id");
	Плагин.Тип = Данные.Получить("plugin_type");
	Плагин.Описание = Данные.Получить("description");
	Плагин.ИмяФайла = Данные.Получить("filename");
	Плагин.ХешMd5 = НРег(Данные.Получить("hash_md5"));
	Плагин.РодительХешMd5 = НРег(Данные.Получить("parent_md5hash"));
	Плагин.ХешРасширения = НРег(Данные.Получить("hash_ext"));
	
	Возврат Плагин;
	
КонецФункции // _РазобратьПлагин

Функция _РазобратьСобытие(Данные) Экспорт
	
	Результат = Событие();
	Результат.ИдентификаторКлиента = Данные.Получить("client_id");
	Результат.Идентификатор = Данные.Получить("id");
	Результат.Контент = Данные.Получить("content");
	Результат.Тип = Данные.Получить("event_type");
	Результат.ДатаСобытия = ДатаIso8601(Данные.Получить("timestamp"));
	Результат.ДатаСобытияЧислом = ЧислоIso8601(Данные.Получить("timestamp"));

	Возврат Результат;
	
КонецФункции

Функция РазобратьРезультатПроверки(Данные)
	
	Результат = РезультатПроверки();
	Результат.ЕстьОбновление = Данные.Получить("contain_update") = Истина;
	Результат.Версия = Данные.Получить("name");
	Результат.Ссылки = Новый Массив;
	
	МассивСсылок = Данные.Получить("links");
	Если ТипЗнч(МассивСсылок) <> Тип("Массив") Тогда
		МассивСсылок = Новый Массив;
	КонецЕсли;
	
	Для Каждого Элемент Из МассивСсылок Цикл
		Результат.Ссылки.Добавить(РазобратьОписаниеСсылки(Элемент));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // РазобратьРезультатПроверки

Функция РазобратьОписаниеСсылки(Данные)
	
	Результат = ОписаниеСсылки();
	Результат.Ресурс = Строка(Данные.Получить("rel"));
	Результат.АдресРесурса = Строка(Данные.Получить("href"));
	Результат.ТипКонтента = Строка(Данные.Получить("content_type"));
	
	Возврат Результат;
	
КонецФункции // РазобратьОписаниеСсылки

Функция РазобратьПараметрыФункциональнойОпции(Данные)
	
	НоваяФО = ПараметрыФункциональнойОпции();
	НоваяФО.ИмяФункциональнойОпции = Данные.Получить("feature");
	НоваяФО.Значение = Данные.Получить("value");
	
	Возврат Новый ФиксированнаяСтруктура(НоваяФО);
	
КонецФункции

// Дополнительный разбор даты

// Получает строку ISO 8601:2019 из значения
//
// Параметры:
//  Значение - Дата, Число - Число секунд или Дата
//
// Возвращаемое значение:
//  Стррока - Строка формата yyyy-mm-ddThh:mm:ss.fffffffZ
//
Функция Iso8601(Значение) 
	
	Точность = 7;
	Дата = Дата(1, 1, 1);
	Доли = 0;
	Зона = "Z";
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Секунды = Цел(Значение);
		Доли = Окр(Значение - Секунды, Точность);
		Дата = Дата(1, 1, 1) + Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Дата = Значение;
		Доли = 0;
	Иначе
		ВызватьИсключение "Не предполагаемый тип значения";
	КонецЕсли;
	
	Данные = Новый Массив;
	
	Если Дата = Дата(1, 1, 1) Тогда
		Данные.Добавить("0001-01-01T00:00:00");
	Иначе
		Данные.Добавить(Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss"));
	КонецЕсли;
	
	Если Доли > 0 И Доли < 1 Тогда
		НачалоДоли = 2;
		СтрокаДоли = Сред(Формат(Доли, "ЧРД=.; ЧГ=0"), НачалоДоли);
		Пока СтрДлина(СтрокаДоли) < Точность + 1 Цикл
			СтрокаДоли = СтрокаДоли + "0";
		КонецЦикла;
		Данные.Добавить(СтрокаДоли);
	КонецЕсли;
	
	Данные.Добавить(Зона);
	
	Возврат Стр.СтрСоединитьЛок(Данные, "");
	
КонецФункции // Iso8601

// Получает Дату из строки поддерживамого формата
//
// Параметры:
//  Строка - Строка - Форматы "yyyy-mm-ddThh:mm:ss±hh:mm",
//                            "yyyy-mm-ddThh:mm:ssZ",
//                            "yyyy-mm-ddThh:mm:ss.fffffff±hh:mm",
//                            "yyyy-mm-ddThh:mm:ss.fffffffZ"
//
// Возвращаемое значение:
//  Дата - Дата с точностю до yyyy-mm-ddThh:mm:ss
//
Функция ДатаIso8601(Строка) 
	
	МоментВремени = _ОписаниеМоментВремени(Строка);
	
	Возврат _МоментВремениВДату(МоментВремени);
	
КонецФункции // ДатаIso8601

// Получает число секунд из строки
//
// Параметры:
//  Строка - Строка - Форматы см. ДатаIso8601
//
// Возвращаемое значение:
//  Число - Число секунд начиная с 01.01.0001 00:00:00
//
Функция ЧислоIso8601(Строка) Экспорт
	
	МоментВремени = _ОписаниеМоментВремени(Строка);
	
	Возврат _МоментВремениВЧисло(МоментВремени);
	
КонецФункции // ЧислоIso8601

Функция _ОписаниеМоментВремени(Строка = Неопределено) 
	
	Описание = Новый Структура;
	Описание.Вставить("Год", 1);
	Описание.Вставить("Месяц", 1);
	Описание.Вставить("День", 1);
	Описание.Вставить("Час", 0);
	Описание.Вставить("Минута", 0);
	Описание.Вставить("Секунда", 0);
	Описание.Вставить("Доля", 0);
	Описание.Вставить("Зона", "");
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат Описание;
	КонецЕсли;
	
	_Строка = ВРег(Строка);
	
	ИндексВремя = Найти(_Строка, "T");
	Если ИндексВремя = 0 Тогда
		
		ЗаполнитьЗначенияСвойств(Описание, _ОписаниеДата(_Строка));
		
	Иначе
		
		Дата = _ОписаниеДата(Лев(_Строка, ИндексВремя - 1));
		Время = _ОписаниеВремя(Сред(_Строка, ИндексВремя + 1));
		
		ЗаполнитьЗначенияСвойств(Описание, Дата);
		ЗаполнитьЗначенияСвойств(Описание, Время);
		
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции // _ОписаниеМоментВремени

Функция _ОписаниеДата(Строка) 
	
	Описание = Новый Структура;
	Описание.Вставить("Год", 1);
	Описание.Вставить("Месяц", 1);
	Описание.Вставить("День", 1);
	
	Если Строка = Неопределено Тогда
		Возврат Описание;
	КонецЕсли;
	
	ДатаXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "date"), Строка);
	
	Описание.Год = Год(ДатаXDTO.Значение);
	Описание.Месяц = Месяц(ДатаXDTO.Значение);
	Описание.День = День(ДатаXDTO.Значение);
	
	Возврат Описание;
	
КонецФункции // _ОписаниеДата

Функция _ОписаниеВремя(Строка) 
	
	Описание = Новый Структура;
	Описание.Вставить("Час", 0);
	Описание.Вставить("Минута", 0);
	Описание.Вставить("Секунда", 0);
	Описание.Вставить("Доля", 0);
	Описание.Вставить("Зона", "");
	
	Если Строка = Неопределено Тогда
		Возврат Описание;
	КонецЕсли;
	
	ИндексДоля = Найти(Строка, ".");
	ИндексЗона = Найти(Строка, "+") + Найти(Строка, "-") + Найти(Строка, "Z");
	
	Если ИндексЗона И ИндексДоля > ИндексЗона Тогда
		ВызватьИсключение "Не предполагаемый формат времени: " + Строка;
	КонецЕсли;
	
	Если ИндексДоля И ИндексЗона Тогда
		
		СтрокаВремя = Лев(Строка, ИндексДоля - 1);
		СтрокаДоля = Сред(Строка, ИндексДоля + 1, ИндексЗона - ИндексДоля - 1);
		СтрокаЗона = Сред(Строка, ИндексЗона);
		
	ИначеЕсли ИндексДоля И НЕ ИндексЗона <> 0 Тогда
		
		СтрокаВремя = Лев(Строка, ИндексДоля - 1);
		СтрокаДоля = Сред(Строка, ИндексДоля + 1);
		СтрокаЗона = Неопределено;
		
	ИначеЕсли НЕ ИндексДоля И ИндексЗона <> 0 Тогда
		
		СтрокаВремя = СокрЛП(Строка);
		СтрокаДоля = Неопределено;
		СтрокаЗона = Сред(Строка, ИндексЗона + 1);
		
	Иначе
		
		СтрокаВремя = СокрЛП(Строка);
		СтрокаДоля = Неопределено;
		СтрокаЗона = Неопределено;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаВремя) Тогда
		
		ДатаXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "time"), СтрокаВремя);
		
		Описание.Час = Час(ДатаXDTO.Значение);
		Описание.Минута = Минута(ДатаXDTO.Значение);
		Описание.Секунда = Секунда(ДатаXDTO.Значение);
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаДоля) Тогда
		Описание.Доля = Число_("0." + СтрокаДоля);
	КонецЕсли;
	
	Описание.Зона = СокрЛП(СтрокаЗона);
	
	Возврат Описание;
	
КонецФункции // _ОписаниеВремя

Функция _МоментВремениВДату(Момент) 
	
	Значение = Дата(Момент.Год, Момент.Месяц, Момент.День, Момент.Час, Момент.Минута, Момент.Секунда);
	
	Если НЕ ПустаяСтрока(Момент.Зона) И Момент.Зона <> "Z" Тогда
		Дата = УниверсальноеВремя(Значение, "GMT" + Момент.Зона);
	Иначе
		Дата = Значение;
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции // _МоментВремениВДату

Функция _МоментВремениВЧисло(Момент) 
	
	Дата = _МоментВремениВДату(Момент);
	Секунды = (Дата - Дата(1, 1, 1)) + Момент.Доля;
	
	Возврат Секунды;
	
КонецФункции // _МоментВремениВЧисло

// Приводит значение к числу
//
// Параметры:
//  Значение - Произвольный - приводимое значение
//
// Возвращаемое значение:
//  Число - приведенные значение
//
Функция Число_(Значение)
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Возврат ОписаниеТипов.ПривестиЗначение(Значение);
	
КонецФункции // Число_

// Клиент АПИ базовый, TODO вынести в отдельный модуль в составе Коннектор

Процедура ЗаполнитьЗаголовки(Приемник, Источник)
	
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Источник Цикл
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьЗаголовки

Процедура ПроверитьСостояниеHTTP(Ответ)
	
	НегативноеСостояние = Ответ.КодСостояния >= КоннекторЛок.КодыСостоянияHTTP().ПеремещеноНавсегда_301;
	Если НегативноеСостояние Тогда
		Ошибка = ОшибкаСостоянияHTTP(Ответ.КодСостояния, Ответ);
		ВызватьИсключение Ошибка.Описание;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСостояниеHTTP

Функция ОшибкаСостоянияHTTP(КодСостояния = Неопределено, Ответ = Неопределено)
	
	Ошибка = ОшибкаЛок();
	Ошибка.Описание = НСтр("ru = 'Ошибка состояния'; sys = 'HTTPError'");
	
	Разделитель = Символы.ПС;
	
	Если НЕ КодСостояния = Неопределено Тогда
		
		Шаблон = СтрЗаменить("ru = '%2Код состояния: %1'; sys = '%1'", "%2", Разделитель);
		Ошибка.Описание = Ошибка.Описание + НСтр(СтрЗаменить(Шаблон, "%1", Формат(КодСостояния, "ЧГ=0"))); 
		
	КонецЕсли;
	
	Если НЕ Ответ = Неопределено Тогда
		
		TraceId = ПолучитьTraceId(Ответ);
		Если ЗначениеЗаполнено(TraceId) Тогда
			Шаблон = СтрЗаменить("ru = '%2TraceId: %1'; sys = ''", "%2", Разделитель);
			Ошибка.Описание = Ошибка.Описание + НСтр(СтрЗаменить(Шаблон, "%1", TraceId)); 
		КонецЕсли;
		
		РасширенноеОписание = ПолучитьРасширенноеОписаниеОшибкиHTTP(Ответ);
		Если ЗначениеЗаполнено(РасширенноеОписание) Тогда
			Шаблон = СтрЗаменить("ru = '%2Описание: %1'; sys = ''", "%2", Разделитель);
			Ошибка.Описание = Ошибка.Описание + НСтр(СтрЗаменить(Шаблон, "%1", РасширенноеОписание)); 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции // ОшибкаСостоянияHTTP

Функция ПолучитьTraceId(Ответ)
	
	TraceId = Ответ.Заголовки.Получить("X-Kontur-Trace-Id");  
	
	Если ЗначениеЗаполнено(TraceId) Тогда  
		Возврат TraceId;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции // ПолучитьTraceIdОшибкиHTTP

Функция ПолучитьРасширенноеОписаниеОшибкиHTTP(Ответ)
	
	РасширенноеОписаниеОшибки = "";
	
	ContentType = Ответ.Заголовки.Получить("Content-Type");
	
	Если ContentType = "application/json" Тогда
		Данные = КоннекторЛок.КакJson(Ответ);
		ТекстОшибки = Данные.Получить("message");
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			РасширенноеОписаниеОшибки = ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РасширенноеОписаниеОшибки;
	
КонецФункции // ПолучитьРасширенноеОписаниеОшибкиHTTP

Функция Сессия() Экспорт
	
	Если СессияЛок = Неопределено Тогда
		СессияЛок = КоннекторЛок.СоздатьСессию();
	КонецЕсли;
	
	Возврат СессияЛок;
	
КонецФункции // Сессия

Функция URL(Ресурс)
	
	Если Найти(Ресурс, "http") ИЛИ Найти(Ресурс, "https") Тогда
		Возврат Ресурс;
	Иначе
		Возврат Локация + Ресурс;
	КонецЕсли;
	
КонецФункции // URL

Функция PostJson(Ресурс, Json = Неопределено, ПараметрыЗапроса = Неопределено, Заголовки = Неопределено)
	
	АдресРесурса = URL(Ресурс);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Заголовки", Новый Соответствие);
	ДопПараметры.Вставить("Json", Json);
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		ДопПараметры.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	КонецЕсли;
	
	ЗаполнитьЗаголовки(ДопПараметры.Заголовки, Заголовки);
	
	Ответ = КоннекторЛок.Post(
			АдресРесурса,
			Неопределено,
			ДопПараметры,
			Сессия());
	
	Возврат Ответ;
	
КонецФункции // PostJson

Функция Post(Ресурс, Тело = Неопределено, ПараметрыЗапроса = Неопределено, Заголовки = Неопределено)
	
	АдресРесурса = URL(Ресурс);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Заголовки", Новый Соответствие);
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		ДопПараметры.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	КонецЕсли;
	
	ЗаполнитьЗаголовки(ДопПараметры.Заголовки, Заголовки);
	
	Ответ = КоннекторЛок.Post(
			АдресРесурса,
			Тело,
			ДопПараметры,
			Сессия());
	
	Возврат Ответ;
	
КонецФункции // PostJson

Функция Get(Ресурс, ПараметрыЗапроса = Неопределено, Заголовки = Неопределено)
	
	АдресРесурса = URL(Ресурс);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Заголовки", Новый Соответствие);
	
	ЗаполнитьЗаголовки(ДопПараметры.Заголовки, Заголовки);
	
	Ответ = КоннекторЛок.Get(
			АдресРесурса,
			ПараметрыЗапроса,
			ДопПараметры,
			Сессия());
	
	Возврат Ответ;
	
КонецФункции // Get

Функция Delete(Ресурс, Данные = Неопределено, ПараметрыЗапроса = Неопределено)
	
	АдресРесурса = URL(Ресурс);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Заголовки", Новый Соответствие);
	ДопПараметры.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	Ответ = КоннекторЛок.Delete(АдресРесурса, Данные, ДопПараметры, Сессия());
	
	Возврат Ответ;
	
КонецФункции // _Delete

// Работа с исключениями, TODO вынести в отдельный модуль в составе СТД

Процедура ПроверитьПараметры(Параметр1 = Неопределено, Параметр2 = Неопределено, // BSLLS:NumberOfOptionalParams-off
		Параметр3 = Неопределено, Параметр4 = Неопределено,
		Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено)
	
	Ошибка = ОшибкаПараметра(Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7);
	Если Ошибка <> Неопределено Тогда
		ВызватьИсключение Ошибка.Описание;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПараметры

Функция НесоответствиеТипов(Значение, ОписаниеТипов, ЗначениеПоУмолчанию = "!?I?*H") // BSLLS:DuplicateStringLiteral-off
	
	ОписаниеТиповСтрокой = ТипЗнч(ОписаниеТипов) = Тип("Строка");
	
	// Проверка умолчания
	
	Если ЗначениеПоУмолчанию = "!?I?*H"
		И ОписаниеТиповСтрокой
		И Найти(ОписаниеТиповСтрокой, "Неопределено") Тогда
		ЗначениеПоУмолчанию_ = Неопределено;
	Иначе
		ЗначениеПоУмолчанию_ = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеПоУмолчанию <> "!?I?*H"
		И Значение = ЗначениеПоУмолчанию Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверка типа
	
	Если ТипЗнч(ОписаниеТипов) = Тип("Строка") Тогда
		ТипыСтрокой = Стр.СтрРазделитьЛок(ОписаниеТипов, ",");
		ТипыМассив = Новый Массив;
		Для Каждого Элемент Из ТипыСтрокой Цикл
			ТипыМассив.Добавить(Тип(СокрЛП(Элемент)));
		КонецЦикла;
		ОписаниеТипов_ = Новый ОписаниеТипов(ТипыМассив);
	Иначе
		ОписаниеТипов_ = ОписаниеТипов;
	КонецЕсли;
	
	Если НЕ ОписаниеТипов_.СодержитТип(ТипЗнч(Значение)) Тогда
		Ошибка = ОшибкаТипа();
	Иначе
		Ошибка = Неопределено;
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции // НесоответствиеТипов

Функция НеЗаполнено(Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Ошибка = ОшибкаЗначения();
	Иначе
		Ошибка = Неопределено;
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции // НеЗаполнено

Функция ОшибкаЛок()
	
	Возврат Новый Структура("Описание");
	
КонецФункции // Ошибка

Функция ОшибкаТипа()
	
	Ошибка = ОшибкаЛок();
	Ошибка.Описание = НСтр("ru = 'Несоответствие типов'; sys = 'TypeError'");
	
	Возврат Ошибка;
	
КонецФункции // ОшибкаТипа

Функция ОшибкаЗначения()
	
	Ошибка = ОшибкаЛок();
	Ошибка.Описание = НСтр("ru = 'Недопустимое значение параметра'; sys = 'ValueError'");
	
	Возврат Ошибка;
	
КонецФункции // ОшибкаЗначения

Функция ОшибкаПараметра(Параметр1 = Неопределено, Параметр2 = Неопределено, // BSLLS:NumberOfOptionalParams-off
		Параметр3 = Неопределено, Параметр4 = Неопределено,
		Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено)
	
	Параметры = Новый Массив;
	Параметры.Добавить(Параметр1);
	Параметры.Добавить(Параметр2);
	Параметры.Добавить(Параметр3);
	Параметры.Добавить(Параметр4);
	Параметры.Добавить(Параметр5);
	Параметры.Добавить(Параметр6);
	Параметры.Добавить(Параметр7);
	
	Шаблон = "ru = ' (параметр номер %1)'";
	
	Для Сч = 0 По Параметры.ВГраница() Цикл
		
		Параметр = Параметры[Сч];
		Если Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Параметр.Описание = Параметр.Описание + НСтр(СтрЗаменить(Шаблон, "%1", Строка(Сч + 1)));
		
		Возврат Параметр;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ОшибкаПараметра

// Прочее

Функция ЭтоВнешняяОбработка()
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
	
	Возврат ПараметрыПроверки.ИспользуемоеИмяФайла <> Неопределено;
	
КонецФункции // ЭтоВнешняяОбработка

Процедура ЗаполнитьПоляКоллекции(Данные, Коллекция, ТипыКоллекций)
	
	Для Каждого КлючИЗначение Из Данные Цикл
		Значение = КлючИЗначение.Значение;
		Если ТипыКоллекций.Получить(ТипЗнч(Значение)) = Неопределено Тогда
			Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
		Иначе
			Коллекция.Вставить(КлючИЗначение.Ключ, ФиксированныеДанные(Значение));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ФиксированныеДанные(Данные)
	
	ТипМассив = "Массив";
	ТипСтруктура = "Структура";
	ТипСоответствие = "Соответствие";
	
	ТипыКоллекций = Новый Соответствие();
	ТипыКоллекций.Вставить(Тип(ТипМассив), ТипМассив);
	ТипыКоллекций.Вставить(Тип(ТипСтруктура), ТипСтруктура);
	ТипыКоллекций.Вставить(Тип(ТипСоответствие), ТипСоответствие);
	
	ТипКоллекции = ТипыКоллекций.Получить(ТипЗнч(Данные));
	
	Если ТипКоллекции = ТипМассив Тогда
		
		Массив = Новый Массив;
		
		Для Каждого Значение Из Данные Цикл
			Если ТипыКоллекций.Получить(ТипЗнч(Значение)) = Неопределено Тогда
				Массив.Добавить(Значение);
			Иначе
				Массив.Добавить(ФиксированныеДанные(Значение));
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипКоллекции = ТипСтруктура Тогда
		
		Коллекция = Новый Структура;
		
		ЗаполнитьПоляКоллекции(Данные, Коллекция, ТипыКоллекций);
		
		Возврат Новый ФиксированнаяСтруктура(Коллекция);
	
	ИначеЕсли ТипКоллекции = ТипСоответствие Тогда
		
		Коллекция = Новый Соответствие;
		
		ЗаполнитьПоляКоллекции(Данные, Коллекция, ТипыКоллекций);
		
		Возврат Новый ФиксированноеСоответствие(Коллекция);
		
	Иначе
		
		Возврат Данные;
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции // ФиксированныеДанные

////////////////////////////////////////////////////////////////////////////////
// Инициализация

Процедура __Инит__(Мета)
	
	Состояние404 = 404;
	СтаршийРазрядОшибокКлиента = "4";
	СтаршийРазрядОшибокСервера = "5";
	
	ЗначенияКатегорий = Новый Структура;
	ЗначенияКатегорий.Вставить("ОшибкаТипа", ОшибкаТипа());
	ЗначенияКатегорий.Вставить("ОшибкаЗначения", ОшибкаЗначения());
	ЗначенияКатегорий.Вставить("ОшибкаСостоянияHTTP", ОшибкаСостоянияHTTP());
	ЗначенияКатегорий.Вставить("ОшибкаСостоянияHTTP404", ОшибкаСостоянияHTTP(Состояние404));
	ЗначенияКатегорий.Вставить("ОшибкаСостоянияHTTPОшибкаКлиента", ОшибкаСостоянияHTTP(СтаршийРазрядОшибокКлиента));
	ЗначенияКатегорий.Вставить("ОшибкаСостоянияHTTPОшибкаСервера ", ОшибкаСостоянияHTTP(СтаршийРазрядОшибокСервера));
	
	КатегорииОшибок = ФиксированныеДанные(ЗначенияКатегорий);
	
	Если ЭтоВнешняяОбработка() Тогда
		Стр = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтр");
		КоннекторЛок = Новый("ExternalDataProcessorObject.КонтурДиадокКоннекторHTTP");
	Иначе
		Стр = Новый("DataProcessorObject.КонтурДиадокСтдСтр");
		КоннекторЛок = Новый("DataProcessorObject.КонтурДиадокКоннекторHTTP");
	КонецЕсли;
	
	ПеречислениеТипыПродуктов = ПеречислениеТипыПродуктов();
	ПеречислениеТипыОбъектов = ПеречислениеТипыОбъектов();
	
КонецПроцедуры // __Инит__

__Инит__(Метаданные());