// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем ОсновнойМодуль Экспорт;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//{ СлужебныйПрограммныйИнтерфейс

// Событие возникает перед выполнением запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить выражения полей запроса для получения данных шапки.
//
// Параметры:
//  Реквизиты			 - Структура		 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение;
//  МетаданныеИсточника	 - ОбъектМетаданных	 - Метаданные документа-источника;
//  ВидЭД 				 - Строка			 - вид подгатавливаемого электронного документа (см. Перечисление_ВидыЭД());
//
// Пример:
//		Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузоотправитель") Тогда 
//			
//			Реквизиты.Грузоотправитель = 
//			"ВЫБОР
//			|	КОГДА Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//			|		ТОГДА Организация
//			|	ИНАЧЕ Грузоотправитель
//			|КОНЕЦ";
//			
//		КонецЕсли;
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника, ВидЭД) Экспорт
	
	Если Реквизиты.Свойство("БанковскийСчетОрганизации")
		И Не ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеИсточника, "БанковскийСчетОрганизации")
		И ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеИсточника, "СтруктурнаяЕдиница") Тогда
		
		Реквизиты.БанковскийСчетОрганизации = 
		"ВЫБОР 
		|	КОГДА СтруктурнаяЕдиница ССЫЛКА Справочник.БанковскиеСчета
		|		ТОГДА СтруктурнаяЕдиница
		|	ИНАЧЕ НЕОПРЕДЕЛЕНО
		|КОНЕЦ";
		
	КонецЕсли;
	
	Если Реквизиты.Свойство("ДополнительныеУсловия")
		И ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеИсточника, "УсловиеПродаж") Тогда
		Реквизиты.ДополнительныеУсловия = "ПРЕДСТАВЛЕНИЕ(УсловиеПродаж)";
	КонецЕсли;
	
КонецПроцедуры

// Событие возникает после выполнения запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить или дополнить данные шапки документа.
//
// Параметры:
//  Шапка - Структура - Структура со значениями реквизитов документа.
//
// Пример:
//   Шапка.БанковскийСчетОрганизации = СчетОрганизации(Шапка.Организация);
//
Процедура ПослеПолученияДанныхШапкиДокумента(Шапка) Экспорт
	
	
	
КонецПроцедуры

// Событие возникает при получении сведений об организации, контрагенте или физическом лице.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие возникает при получении реквизитов договора, соглашения
// или иного основания передачи/перехода прав собственности.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие возникает при определении фактического места хранения контактной информации объекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации")
//			И СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
//			
//			СтандартнаяОбработка = Ложь;
//			ХранилищеКИ = СсылкаНаОбъект.ИндивидуальныйПредприниматель;
//			
//		КонецЕсли;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие позволяет переопределить алгоритм вычисления вида контактной информации,
// соответствующего юр./физ. лицу и указанному типу контактной информации.
//
// Параметры:
//  ВидКИ - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации;
//  ЮрФизЛицо - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  ТипКИ - Строка - тип контактной информации (см. Перечисление_ВидыКИ);
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		
//		Если ТипКИ = Перечисление_ВидыКИ().ЮридическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
//		ИначеЕсли ТипКИ = Перечисление_ВидыКИ().ФактическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресФактический;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ВидКИ) Тогда
//			СтандартнаяОбработка = Ложь;
//		КонецЕсли;
//
Процедура ПриПолученииВидаКонтактнойИнформации(ВидКИ, ЮрФизЛицо, ТипКИ, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		ПринадлежностьАдреса = "Организации";
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ПринадлежностьАдреса = "Контрагента";
	КонецЕсли;
	
	Если ТипКИ = Перечисление_ВидыКИ().ЮридическийАдрес Тогда
		ВидаАдреса = "ЮрАдрес";
	ИначеЕсли ТипКИ = Перечисление_ВидыКИ().ФактическийАдрес Тогда
		ВидаАдреса = "ФактАдрес";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидаАдреса) И ЗначениеЗаполнено(ПринадлежностьАдреса) Тогда
		ИмяВидаКИ	 = ВидаАдреса + ПринадлежностьАдреса;
		ВидКИ		 = Справочники.ВидыКонтактнойИнформации[ИмяВидаКИ];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидКИ) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Загружает сведения о маркировке из товарной части ЭД в информационную базу.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов.
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить загрузку средствами библиотеки интеграции ИС МП.
//
Процедура ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет список правил создания и заполнения документов учета.
//
// Параметры:
//  ПравилаСоздания - СписокЗначений - (возвращаемый параметр) идентификаторы правил создания и их представления.
//  ФорматЭД - Структура - см. ОсновнойМодуль.НовоеОписаниеФорматаЭлектронногоДокумента.
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения правил.
//
Процедура ПриЗаполненииПравилСозданияДокументовУчета(ПравилаСоздания, ФорматЭД, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФорматыЭД = МодульФорматыЭлектронныхДокументов();
	
	Если ФорматыЭД.ЭтоУниверсальныйПередаточныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоПередаточныйДокумент(ФорматЭД) Тогда
		
		Операция = ОперацияПоступлениеТоваровУслуг();
		Представление = "Поступление товаров и услуг";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияПоступлениеДопРасходов();
		Представление = "Поступление доп. расходов";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияВозвратОтПокупателя();
		Представление = "Возврат от покупателя";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоУниверсальныйКорректировочныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоСоглашениеОбИзмененииСтоимости(ФорматЭД) Тогда
		
		Операция = ОперацияКорректировкаПоступления();
		Представление = "Корректировка поступления";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоСчетФактура(ФорматЭД) Тогда
		
		Операция = ОперацияСчетФактураПолученный();
		Представление = "Счет-фактура полученный";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоКорректировочныйСчетФактура(ФорматЭД) Тогда
		
		Операция = ОперацияКорректировочныйСчетФактураПолученный();
		Представление = "Счет-фактура полученный (корректировочный)";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка создания и заполнения документа учета по указанному правилу.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - (возвращаемый параметр) Заполняемый объект.
//  ИдентификаторОпераци - Строка - идентификатор правила создания и заполнения документа учета.
//  ПараметрыСоздания - Структура - см. ОсновнойМодуль.ПараметрыСозданияДокументаИнформационнойБазы.
//  ДанныеЭД - Структура - разобранное содержимое электронного документа (см. ОсновнойМодуль.ДанныеЭлектронногоДокумента)
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения объекта.
//
Процедура ПриСозданииДокументаУчета(ДокументОбъект, ИдентификаторОперации, ПараметрыСоздания, ДанныеЭД, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФорматЭД = ДанныеЭД.Формат;
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТабличнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	Если ИдентификаторОперации = ОперацияПоступлениеТоваровУслуг() Тогда
		
		ДокументОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		ЗаполнитьШапкуПоступленияТоваровУслуг(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьПоступленияТоваровУслуг(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияКорректировкаПоступления() Тогда
		
		ПроверитьЗаполнитьОснованиеКорректировкиПоступления(ПараметрыСоздания, ШапкаЭД, ФорматЭД);
		
		ДокументОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
		ЗаполнитьШапкуКорректировкиПоступления(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьКорректировкиПоступления(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияСчетФактураПолученный() Тогда
		
		ДокументОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		ЗаполнитьШапкуСчетаФактурыПолученного(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьОсновныеРеквизитыСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияКорректировочныйСчетФактураПолученный() Тогда
		
		ДокументОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		ЗаполнитьШапкуСчетаФактурыПолученного(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьОсновныеРеквизитыКорректировочногоСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияПоступлениеДопРасходов() Тогда
		
		ДокументОбъект = Документы.ПоступлениеДопРасходов.СоздатьДокумент();
		ЗаполнитьШапкуПоступленияДопРасходов(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьШапкуПоступленияДопРасходовПоТабличнойЧасти(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияВозвратОтПокупателя() Тогда
		
		ДокументОбъект = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
		ЗаполнитьШапкуВозвратОтПокупателя(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьВозвратОтПокупателя(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияАктСверкиВзаиморасчетов() Тогда
		
		ДокументОбъект = Документы.АктСверкиВзаиморасчетов.СоздатьДокумент();
		ЗаполнитьШапкуАктаСверкиВзаиморасчетов(ДокументОбъект, ПараметрыСоздания, ШапкаЭД, ИтогиЭД);
		ЗаполнитьТабличнуюЧастьАктаСверкиВзаиморасчетов(ДокументОбъект, ТабличнаяЧастьЭД);
		
	Иначе
		
		Ошибка = "Неизвестный идентификатор операции (%1)";
		Ошибка = СтрЗаменить(Ошибка, "%1", ИдентификаторОперации);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ВладелецНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Идентификатор Из ИдентификаторыНоменклатуры Цикл
		
		НоменклатураИБ = ПолучитьНоменклатуруИнформационнойБазы(ВладелецНоменклатуры, Идентификатор);
		
		Если НЕ ЗначениеЗаполнено(НоменклатураИБ) Тогда
			// Миграция данных из устаревшего хранилища по требованию
			НоменклатураИБ = ПеренестиСопоставлениеНоменклатуры_НоменклатураКонтрагентов(ВладелецНоменклатуры, Идентификатор);
		КонецЕсли;
		
		Результат.Вставить(Идентификатор, НоменклатураИБ);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Номенклатура = НоменклатураИБ.Номенклатура;
	Характеристика = НоменклатураИБ.Характеристика;
	
	ВладелецНоменклатуры = НоменклатураКонтрагента.Владелец;
	ИдентификаторНоменклатуры = НоменклатураКонтрагента.Идентификатор;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Удалить старые записи во избежание дублирования идентификаторов и номенклатуры
		УдалитьСопоставлениеНоменклатуры_НоменклатураКонтрагентов(ВладелецНоменклатуры, ИдентификаторНоменклатуры);
		ДобавитьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура, Характеристика);
		
		// Запись дублируется в устаревшее хранилище для обратной совместимости
		ДобавитьСопоставлениеНоменклатуры_НоменклатураКонтрагентов(НоменклатураКонтрагента, Номенклатура, Характеристика);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Ошибка = ИнформацияОбОшибке();
		ЗаписатьОшибкуСопоставленияНоменклатуры(ИдентификаторНоменклатуры, ВладелецНоменклатуры, Ошибка);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальнаяЛогика.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура	- ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат		 	= Неопределено;
	ДоговорКонтрагента 	= Неопределено;
	
	Если ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(СчетФактура, "ДоговорКонтрагента", ДоговорКонтрагента)
		И ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		
		ВидДоговора = Неопределено; 
		
		Если ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(ДоговорКонтрагента, "ВидДоговора", ВидДоговора) Тогда
			
			Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером") Тогда
				
				Результат = "4";
				
			ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом") Тогда
				
				Результат = "6";
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает ссылку на документ, на который оформлена корректировка.
//
// Параметры:
//  КорректировочныйДокумент - ЛюбаяСсылка - Корректировочный документ (корректировка реализации или корректировочный счет-фактура)
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, Неопределено - ссылка на корректируемый документ.
//
Функция КорректируемыйДокумент(КорректировочныйДокумент) Экспорт
	
	ТипДокумента = ТипЗнч(КорректировочныйДокумент);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ИмяРеквизита = "ИсправляемыйСчетФактура";
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КорректировочныйДокумент, ИмяРеквизита);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ИмяРеквизита = "ИсправляемыйДокументРеализации";
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КорректировочныйДокумент, ИмяРеквизита);
		
	Иначе
		
		КонтекстПроверки = "ИнтеграционныйМодуль.КорректируемыйДокумент";
		ПараметрИмя = "КорректировочныйДокумент";
		ПараметрПредставление = Строка(КорректировочныйДокумент);
		Если КорректировочныйДокумент = Неопределено Тогда
			ПараметрПредставление = "Неопределено";
		КонецЕсли;
		
		Ошибка = ОсновнойМодуль.ПодставитьПараметрыВСтроку(
			"Недопустимое значение параметра %1 (передано значение: %2) в %3",
			ПараметрИмя,
			ПараметрПредставление,
			КонтекстПроверки
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента 
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы переопределить стандартный обработчик
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//  НаборНоменклатуры - Массив из ЛюбаяСсылка - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(СвойстваНоменклатурИБ, НаборНоменклатуры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ВестиУчетПоХарактеристикам КАК ИспользованиеХарактеристик,
		|	Ложь КАК ИспользоватьУпаковки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&НаборНоменклатуры)";
	
	Запрос.УстановитьПараметр("НаборНоменклатуры", НаборНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ИспользоватьХарактеристикиНоменклатуры = Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
	
	Пока Выборка.Следующий() Цикл
		
		ИспользоватьХарактеристики = ИспользоватьХарактеристикиНоменклатуры И Выборка.ИспользованиеХарактеристик;
		ИспользоватьУпаковки = Выборка.ИспользоватьУпаковки;
		
		СвойстваНоменклатуры = МенеджерИнтеграции_НовыеСвойстваНоменклатурыИБ();
		СвойстваНоменклатуры.Вставить("ИспользоватьХарактеристики", ИспользоватьХарактеристики);
		СвойстваНоменклатуры.Вставить("ОбязательноеЗаполнениеХарактеристики", Ложь);
		СвойстваНоменклатуры.Вставить("ИспользоватьУпаковки", ИспользоватьУпаковки);
		
		СвойстваНоменклатурИБ.Вставить(Выборка.Номенклатура, СвойстваНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

//} СлужебныйПрограммныйИнтерфейс

//{ СлужебныеПроцедурыИФункции

Функция ОперацияПоступлениеТоваровУслуг()
	Возврат "ПоступлениеТоваровУслуг";
КонецФункции

Функция ОперацияВозвратОтПокупателя()

	Возврат "ВозвратОтПокупателя";

КонецФункции

Функция ОперацияКорректировкаПоступления()
	Возврат "КорректировкаПоступления";
КонецФункции

Функция ОперацияСчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

Функция ОперацияКорректировочныйСчетФактураПолученный()
	Возврат "КорректировочныйСчетФактураПолученный";
КонецФункции

Функция ОперацияПоступлениеДопРасходов()
	Возврат "ПоступлениеДопРасходов";
КонецФункции

Функция ОперацияАктСверкиВзаиморасчетов()
	Возврат "АктСверкиВзаиморасчетов";
КонецФункции

Процедура ЗаполнитьШапкуПоступленияТоваровУслуг(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	УстановитьТипЦенДокумента(ДокументОбъект);
	
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	
	УстановитьПараметрыОтраженияДокументаВУчете(ДокументОбъект);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьПодразделениеДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьСкладДокумента(ДокументОбъект);
	
КонецПроцедуры

Функция НоменклатураЯвляетсяУслугойВЭД(ВидНоменклатурыЭД)
	
	Результат = Ложь;
	
	Если ВидНоменклатурыЭД = "2" Или ВидНоменклатурыЭД = "3" Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьПоступленияТоваровУслуг(ДокументОбъект, ТабличнаяЧасть)
	
	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ДокументОбъект.Дата);
	
	МетаданныеОбъекта = ДокументОбъект.Метаданные();
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура = НоменклатураИБ.Номенклатура;
			Характеристика = НоменклатураИБ.Характеристика;
		Иначе
			Номенклатура = Неопределено;
			Характеристика = Неопределено;
		КонецЕсли;
		
		РеквизитыНоменклатуры = РеквизитыНоменклатурыИнформационнойБазы(Номенклатура);
		
		НоменклатураЯвляетсяУслугойВЭД = НоменклатураЯвляетсяУслугойВЭД(СтрокаДанных.ВидНоменклатуры);
		
		Если (Номенклатура <> Неопределено И РеквизитыНоменклатуры.Услуга) ИЛИ 
			(Номенклатура = Неопределено И НоменклатураЯвляетсяУслугойВЭД) Тогда
			
			СтрокаТЧ = ДокументОбъект.Услуги.Добавить();
			СтрокаТЧ.Номенклатура = Номенклатура;
			СтрокаТЧ.Содержание = СтрокаДанных.Наименование;
			СтрокаТЧ.СтатьяЗатрат = РеквизитыНоменклатуры.СтатьяЗатрат;
			СтрокаТЧ.НоменклатурнаяГруппа = РеквизитыНоменклатуры.НоменклатурнаяГруппа;
			Количество = СтрокаДанных.Количество;
			Если Не ЗначениеЗаполнено(Количество) Тогда
				Количество = 1;
			КонецЕсли;
			СтрокаТЧ.Количество = Количество;
			
		Иначе
			
			СтрокаТЧ = ДокументОбъект.Товары.Добавить();
			СтрокаТЧ.Номенклатура = Номенклатура;
			СтрокаТЧ.ХарактеристикаНоменклатуры = Характеристика;
			СтрокаТЧ.ЕдиницаИзмерения = ЕдиницаИзмеренияНоменклатуры(Номенклатура, СтрокаДанных.КодЕдИзм);
			
			Коэффициент = СтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
			Если Не ЗначениеЗаполнено(Коэффициент) Тогда
				Коэффициент = 1;
			КонецЕсли;
			СтрокаТЧ.Коэффициент = Коэффициент;
			
			Количество = СтрокаДанных.Количество;
			Если Не ЗначениеЗаполнено(Количество) Тогда
				Количество = 1;
			КонецЕсли;
			СтрокаТЧ.Количество = Количество;
			
			СтранаПроисхождения = НайтиСоздатьСтрануПроисхождения(СтрокаДанных.КодСтраны);
			
			
			Параметры = Новый Структура;
			Параметры.Вставить("ИспользуетсяУчетПрослеживаемыхТоваров",	ИспользуетсяУчетПрослеживаемыхТоваров);
			Параметры.Вставить("СтранаПроисхождения",					СтранаПроисхождения);
			Параметры.Вставить("ДокументОбъект",						ДокументОбъект);
			Параметры.Вставить("СтрокаДанных",							СтрокаДанных);
			Параметры.Вставить("СтрокаТЧ",								СтрокаТЧ);
			Параметры.Вставить("ЗаполнятьСуммуПрослеживаемости",		Ложь);
			
			ЗаполнитьСведенияОПрослеживаемости(Параметры);
			
			ЗаполнитьСтрануПроисхождения(СтрокаТЧ, СтранаПроисхождения);
			
		КонецЕсли;
		
		Сумма = СтрокаДанных.СуммаБезНДС;
		Цена = СтрокаДанных.Цена;
		
		Если ДокументОбъект.СуммаВключаетНДС Тогда
			Сумма = СтрокаДанных.СуммаСНДС;
			Цена = Сумма / СтрокаТЧ.Количество;
		КонецЕсли;
		
		СтрокаТЧ.Цена = Цена;
		СтрокаТЧ.Сумма = Сумма;
		СтрокаТЧ.СуммаНДС = СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС = ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуВозвратОтПокупателя(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)

	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьДоговорСПокупателем(ДокументОбъект);
	УстановитьТипЦенДокумента(ДокументОбъект);
	
	УстановитьПараметрыОтраженияДокументаВУчете(ДокументОбъект);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьПодразделениеДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьСкладДокумента(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьВозвратОтПокупателя(ДокументОбъект, ТабличнаяЧасть)

	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ДокументОбъект.Дата);
	
	МетаданныеОбъекта = ДокументОбъект.Метаданные();
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура	= НоменклатураИБ.Номенклатура;
			Характеристика	= НоменклатураИБ.Характеристика;
		Иначе
			Номенклатура	= Неопределено;
			Характеристика	= Неопределено;
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.Товары.Добавить();
		СтрокаТЧ.Номенклатура				= Номенклатура;
		СтрокаТЧ.ХарактеристикаНоменклатуры	= Характеристика;
		СтрокаТЧ.ЕдиницаИзмерения			= ЕдиницаИзмеренияНоменклатуры(Номенклатура, СтрокаДанных.КодЕдИзм);
		СтрокаТЧ.Коэффициент				= 1;
		
		Количество = СтрокаДанных.Количество;
		
		Если Не ЗначениеЗаполнено(Количество) Тогда
			Количество = 1;
		КонецЕсли;
		
		СтрокаТЧ.Количество = Количество;
		
		СтранаПроисхождения = НайтиСоздатьСтрануПроисхождения(СтрокаДанных.КодСтраны);
		
		Параметры = Новый Структура;
		Параметры.Вставить("ИспользуетсяУчетПрослеживаемыхТоваров",	ИспользуетсяУчетПрослеживаемыхТоваров);
		Параметры.Вставить("СтранаПроисхождения",					СтранаПроисхождения);
		Параметры.Вставить("ДокументОбъект",						ДокументОбъект);
		Параметры.Вставить("СтрокаДанных",							СтрокаДанных);
		Параметры.Вставить("СтрокаТЧ",								СтрокаТЧ);
		Параметры.Вставить("ЗаполнятьСуммуПрослеживаемости",		Истина);
		
		ЗаполнитьСведенияОПрослеживаемости(Параметры);
		
		ЗаполнитьСтрануПроисхождения(СтрокаТЧ, СтранаПроисхождения);
		
		Сумма	= СтрокаДанных.СуммаБезНДС;
		Цена	= СтрокаДанных.Цена;
		
		Если ДокументОбъект.СуммаВключаетНДС Тогда
			Сумма	= СтрокаДанных.СуммаСНДС;
			Цена	= Сумма / Количество;
		КонецЕсли;
		
		СтрокаТЧ.Цена		= Цена;
		СтрокаТЧ.Сумма		= Сумма;
		СтрокаТЧ.СуммаНДС	= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС	= ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуКорректировкиПоступления(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	ЗаполнитьПоДокументуОснованию(ДокументОбъект, ПараметрыСоздания.ДокументОснование);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВидКорректировки(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьКорректировкиПоступления(ДокументОбъект, ТабличнаяЧасть)
	
	ТабличныеЧастиДляЗаполнения = Новый Структура("Товары, Услуги", "Товары", "Услуги");

	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ДокументОбъект.Дата);
	Если ИспользуетсяУчетПрослеживаемыхТоваров Тогда
		
		ОписаниеЧисло	 = Новый ОписаниеТипов("Число");
		
		СведенияПрослеживаемости = ДокументОбъект.СведенияПрослеживаемости.ВыгрузитьКолонки();
		СведенияПрослеживаемости.Колонки.Добавить("КоличествоУвеличение", ОписаниеЧисло);
		СведенияПрослеживаемости.Колонки.Добавить("КоличествоУменьшение", ОписаниеЧисло);
		
	КонецЕсли;
	
	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	
	ОбработанныеСтроки = Новый Массив;
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		НоменклатураНаименование = СтрокаДанных.Наименование;
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура = НоменклатураИБ.Номенклатура;
			Характеристика= НоменклатураИБ.Характеристика;
		КонецЕсли;
		
		Если Характеристика = Неопределено Тогда
			Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли; 
		
		Если Номенклатура = Неопределено Тогда
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		РеквизитыНоменклатуры	 = РеквизитыНоменклатурыИнформационнойБазы(Номенклатура);
		ЭтоУслуга				 = РеквизитыНоменклатуры.Услуга;
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Номенклатура"					, Номенклатура);
		СтруктураЗаполнения.Вставить("Количество"					, СтрокаДанных.Количество);
		СтруктураЗаполнения.Вставить("КоличествоДоИзменения"		, СтрокаДанных.Количество_До);
		СтруктураЗаполнения.Вставить("Цена"							, СтрокаДанных.Цена);
		СтруктураЗаполнения.Вставить("ЦенаДоИзменения"				, СтрокаДанных.Цена_До);
		СтруктураЗаполнения.Вставить("Сумма"						, СтрокаДанных.СуммаБезНДС);
		СтруктураЗаполнения.Вставить("СуммаДоИзменения"				, СтрокаДанных.СуммаБезНДС_До);
		СтруктураЗаполнения.Вставить("СуммаНДС"						, СтрокаДанных.СуммаНДС);
		СтруктураЗаполнения.Вставить("СуммаНДСДоИзменения"			, СтрокаДанных.СуммаНДС_До);
		СтруктураЗаполнения.Вставить("СтавкаНДС"					, ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС_До));
		СтруктураЗаполнения.Вставить("СтавкаНДСДоИзменения"			, ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС_До));
		СтруктураЗаполнения.Вставить("Коэффициент"					, 1);
		
		ПоляПоиска = "Номенклатура, СтавкаНДС";
		
		Если ЭтоУслуга Тогда
			
			ИмяТЧ = "Услуги";
			СтруктураЗаполнения.Вставить("Содержание"				, НоменклатураНаименование);
			СтруктураЗаполнения.Вставить("СодержаниеДоИзменения"	, НоменклатураНаименование);
			
		Иначе
			
			ИмяТЧ = "Товары";
			ПоляПоиска = ПоляПоиска + ",ХарактеристикаНоменклатуры,ЕдиницаИзмерения";
			
			СтруктураЗаполнения.Вставить("ХарактеристикаНоменклатуры"	, Характеристика);
			СтруктураЗаполнения.Вставить("ЕдиницаИзмерения"				, ЕдиницаИзмеренияНоменклатуры(Номенклатура, СтрокаДанных.КодЕдИзм));
			
			Коэффициент = СтруктураЗаполнения.ЕдиницаИзмерения.Коэффициент;
			Если ЗначениеЗаполнено(Коэффициент) Тогда
				СтруктураЗаполнения.Коэффициент = Коэффициент;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТЧ = Неопределено;
		
		//Найдем исходную строку в документе корректировки
		СтруктураПоиска = Новый Структура(ПоляПоиска);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтруктураЗаполнения);
		
		ТабличнаяЧастьДокумента = ДокументОбъект[ИмяТЧ];
		СтрокиДокумента = ТабличнаяЧастьДокумента.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаДокумента Из СтрокиДокумента Цикл
			
			Если ОбработанныеСтроки.Найти(СтрокаДокумента) = Неопределено Тогда
				СтрокаТЧ = СтрокаДокумента;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		// Такой строки в документе корректировки нет - добавляем.
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ТабличнаяЧастьДокумента.Добавить();
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);
		
		// Проослеживаемость
		Если ИспользуетсяУчетПрослеживаемыхТоваров
			И НЕ ЭтоУслуга Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ИдентификаторСтроки) Тогда
				СтрокаТЧ.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			КонецЕсли;
			
			Для Каждого СведПрослеж Из СтрокаДанных.СведенияПрослеживаемости Цикл
				
				СтрокаПрослеживаемости = СведенияПрослеживаемости.Добавить();
				СтрокаПрослеживаемости.РНПТ							= НайтиСоздатьРНПТ(СведПрослеж.НомТовПрослеж);
				СтрокаПрослеживаемости.КоличествоПрослеживаемости	= СведПрослеж.ИзмКолЕдПТ.КолТовЕдПТПосле;
				СтрокаПрослеживаемости.КоличествоУвеличение			= СведПрослеж.ИзмКолЕдПТ.КолТовЕдПТУвел;
				СтрокаПрослеживаемости.КоличествоУменьшение			= СведПрослеж.ИзмКолЕдПТ.КолТовЕдПТУм;
				СтрокаПрослеживаемости.ИдентификаторСтроки			= СтрокаТЧ.ИдентификаторСтроки;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ОбработанныеСтроки.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
	Если ИспользуетсяУчетПрослеживаемыхТоваров Тогда
		ЗаполнитьСведенияОПрослеживаемостиДляДокументаИБ_УКД(ДокументОбъект.СведенияПрослеживаемости, СведенияПрослеживаемости, ДокументОбъект.Товары);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуСчетаФактурыПолученного(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	ЗаполнитьПоДокументуОснованию(ДокументОбъект, ПараметрыСоздания.ДокументОснование);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьРеквизитыИсправленияВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьОбщиеРеквизитыСчетаФактуры(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьОсновныеРеквизитыСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД)

	ЭтоСчетФактураНаАванс	= ДанныеЭД.ЭтоАванс;
	Итоги					= ДанныеЭД.Итоги;

	ДокументОбъект.СуммаДокумента		= Итоги.СуммаВсего;
	ДокументОбъект.СуммаНДСДокумента	= Итоги.СуммаНДС;
	
	Если ЭтоСчетФактураНаАванс Тогда
		
		Для Каждого СтрокаСФ Из ДанныеЭД.ТабличнаяЧасть Цикл
			
			НоваяСтрокаАвансы = ДокументОбъект.Авансы.Добавить();
			
			НоваяСтрокаАвансы.Сумма		= СтрокаСФ.СуммаСНДС;
			НоваяСтрокаАвансы.СуммаНДС	= СтрокаСФ.СуммаНДС;
			НоваяСтрокаАвансы.СтавкаНДС	= ПолучитьСтавкуНДСДиадок(СтрокаСФ.СтавкаНДС);
			
		КонецЦикла;
		
		ДокументОбъект.КодВидаОперации = "02";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс;
		
	Иначе
		
		ДокументОбъект.КодВидаОперации = "01";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОсновныеРеквизитыКорректировочногоСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД)

	ЭтоСчетФактураНаАванс	= ДанныеЭД.ЭтоАванс;	
	ИтогиУменьшение			= ДанныеЭД.ИтогиУменьшение;
	ИтогиУвеличение			= ДанныеЭД.ИтогиУвеличение;
	
	ДокументОбъект.СуммаУменьшение		= ИтогиУменьшение.СуммаВсего;
	ДокументОбъект.СуммаНДСУменьшение	= ИтогиУменьшение.СуммаНДС;
	
	ДокументОбъект.СуммаУвеличение		= ИтогиУвеличение.СуммаВсего;
	ДокументОбъект.СуммаНДСУвеличение	= ИтогиУвеличение.СуммаНДС;
	
	Если ЭтоСчетФактураНаАванс Тогда
		ДокументОбъект.КодВидаОперации = "02";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.КорректировочныйНаАванс;
	Иначе
		ДокументОбъект.КодВидаОперации = "01";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбщиеРеквизитыСчетаФактуры(ДокументОбъект)

	ДокументОбъект.КодСпособаПолучения = 2;
	
	Если ДокументОбъект.ДокументыОснования.Количество() = 0 Тогда
		ДокументОбъект.ДокументыОснования.Добавить().ДокументОснование = Неопределено;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьШапкуПоступленияДопРасходов(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	
	УстановитьВидОперацииПоступленияДопРасходов(ДокументОбъект);
	УстановитьПараметрыОтраженияДокументаВУчете(ДокументОбъект);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьПодразделениеДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьШапкуПоступленияДопРасходовПоТабличнойЧасти(ДокументОбъект, ТабличнаяЧастьЭД)
	
	Если Не ЗначениеЗаполнено(ТабличнаяЧастьЭД) Тогда
		Возврат;
	КонецЕсли;
	
	СуммаСНалогом = 0;
	СуммаНалога = 0;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Для Каждого СтрокаДанных Из ТабличнаяЧастьЭД Цикл
		
		СуммаСНалогом = СуммаСНалогом + ТипЧисло.ПривестиЗначение(СтрокаДанных.СуммаСНДС);
		СуммаНалога = СуммаНалога + ТипЧисло.ПривестиЗначение(СтрокаДанных.СуммаНДС);
		
	КонецЦикла;
	
	СуммаБезНалога = СуммаСНалогом - СуммаНалога;
	
	ПерваяСтрокаТЧ = ТабличнаяЧастьЭД[0];
	ДокументОбъект.СтавкаНДС = ПолучитьСтавкуНДСДиадок(ПерваяСтрокаТЧ.СтавкаНДС);
	ДокументОбъект.Содержание = ПерваяСтрокаТЧ.Наименование;
	ДокументОбъект.СуммаДокумента = СуммаСНалогом;
	ДокументОбъект.СуммаНДС = СуммаНалога;
	ДокументОбъект.Сумма = СуммаБезНалога;
	
	Если ДокументОбъект.СуммаВключаетНДС Тогда
		ДокументОбъект.Сумма = СуммаСНалогом;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуАктаСверкиВзаиморасчетов(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента, ИтогиТЧ)
	
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	
	УстановитьРеквизитыСверкиВзаиморасчетов(ДокументОбъект, РеквизитыЭлектронногоДокумента, ИтогиТЧ);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьАктаСверкиВзаиморасчетов(ДокументОбъект, ТабличнаяЧастьЭД)
	
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		
		ДоговорКонтрагента = ДоговорПоСтрокеАктаСверки(ДокументОбъект, СтрокаДоговора);
		
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ДокументОбъект.ПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.ДоговорКонтрагента = ДоговорКонтрагента;
				СтрокаПоДаннымКонтрагента.Дата = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.Представление = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.Дебет = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.Кредит = СтрокаОперации.СуммаКредит;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьРеквизитыСверкиВзаиморасчетов(ДокументОбъект, РеквизитыЭлектронногоДокумента, ИтогиТЧ)
	
	ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета();
	ДокументОбъект.ОстатокНаНачало = ИтогиТЧ.СальдоНачДеб - ИтогиТЧ.СальдоНачКр;
	ДокументОбъект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ДокументОбъект.СверкаСогласована = Ложь;
	
	ДокументОбъект.ДатаНачала = РеквизитыЭлектронногоДокумента.ДатаНачала;
	ДокументОбъект.Датаокончания = РеквизитыЭлектронногоДокумента.Датаокончания;
	
КонецПроцедуры

Функция ДоговорПоСтрокеАктаСверки(ДокументОбъект, ДанныеДоговора)
	
	Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Организация = ДокументОбъект.Организация;
	Контрагент = ДокументОбъект.Контрагент;
	НомерДоговора = ДанныеДоговора.Номер;
	ДатаДоговора = ДанныеДоговора.Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ДоговорПоСтрокеАктаСверки();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дата", ДатаДоговора);
	Запрос.УстановитьПараметр("Номер", НомерДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДоговорПоСтрокеАктаСверки()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТаблицаДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ТаблицаДоговорыКонтрагентов
	|ГДЕ
	|	ТаблицаДоговорыКонтрагентов.Организация = &Организация
	|	И ТаблицаДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ТаблицаДоговорыКонтрагентов.Дата = &Дата
	|	И ТаблицаДоговорыКонтрагентов.Номер = &Номер
	|	И НЕ ТаблицаДоговорыКонтрагентов.ПометкаУдаления";
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыНоменклатурыИнформационнойБазы(Номенклатура)
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Услуга");
	ТребуемыеРеквизиты.Вставить("СтатьяЗатрат");
	ТребуемыеРеквизиты.Вставить("НоменклатурнаяГруппа");
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, ТребуемыеРеквизиты);
	Иначе
		Результат = ТребуемыеРеквизиты;
		Результат.Услуга = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕдиницаИзмеренияПоКлассификатору(КодЕИ)
	
	Результат = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодЕИ);
	Возврат Результат;
	
КонецФункции

Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура, КодЕИ)
	
	ЕдиницаПоОКЕИ = ЕдиницаИзмеренияПоКлассификатору(КодЕИ);
	
	Результат = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту(
		"ЕдиницаПоКлассификатору",
		ЕдиницаПоОКЕИ,
		Неопределено,
		Номенклатура
	);
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСоздатьСтрануПроисхождения(КодСтраны)
	
	ДлинаКода = Метаданные.Справочники.КлассификаторСтранМира.ДлинаКода;
	
	Если Не ЗначениеЗаполнено(КодСтраны)
		ИЛИ СтрДлина(СокрЛП(КодСтраны)) <> ДлинаКода Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КлассификаторСтранМира.Ссылка
		|ИЗ
		|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
		|ГДЕ
		|	КлассификаторСтранМира.Код = &КодСтраны";
	
	Запрос.УстановитьПараметр("КодСтраны", КодСтраны);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Неопределено;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПоДокументуОснованию(ДокументОбъект, ДокументОснование)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.Заполнить(ДокументОснование);
	
КонецПроцедуры

Процедура УстановитьОрганизациюДокумента(ДокументОбъект, Знач Организация)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ДокументОбъект.Организация = Организация;
	
КонецПроцедуры

Процедура УстановитьКонтрагентаДокумента(ДокументОбъект, Знач Контрагент)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = ПоставщикПоУмолчанию();
	КонецЕсли;
	
	ДокументОбъект.Контрагент = Контрагент;
	
КонецПроцедуры

Процедура УстановитьПодразделениеДокумента(ДокументОбъект)
	
	ДокументОбъект.Подразделение = ПодразделениеПоУмолчанию();
	
КонецПроцедуры

Процедура УстановитьСкладДокумента(ДокументОбъект)
	
	ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	ДокументОбъект.СкладОрдер = СкладПоУмолчанию();
	
КонецПроцедуры

Процедура УстановитьВидОперацииПоступленияДопРасходов(ДокументОбъект)
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДопРасходов.УслугаСтороннейОрганизации;
	
КонецПроцедуры

Процедура УстановитьПараметрыОтраженияДокументаВУчете(ДокументОбъект)
	
	ДокументОбъект.ОтражатьВУправленческомУчете	= ОтражатьДокументыВУправленческомУчетеПоУмолчанию();
	ДокументОбъект.ОтражатьВБухгалтерскомУчете	= ОтражатьДокументыВБухгалтерскомУчетеПоУмолчанию();
	ДокументОбъект.ОтражатьВНалоговомУчете		= ОтражатьДокументыВНалоговомУчетеПоУмолчанию();
	
КонецПроцедуры

Процедура УстановитьВалютуДокумента(ДокументОбъект)
	
	ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета();
	ДокументОбъект.КурсВзаиморасчетов = 1;
	ДокументОбъект.КратностьВзаиморасчетов = 1;
	
КонецПроцедуры

Процедура УстановитьОсновныеРеквизитыДокумента(ДокументОбъект)
	
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Ответственный = ТекущийПользователь();
	
КонецПроцедуры

Процедура УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента)
	
	ДокументОбъект.ДатаВходящегоДокумента	= РеквизитыЭлектронногоДокумента.Дата;
	ДокументОбъект.НомерВходящегоДокумента	= РеквизитыЭлектронногоДокумента.Номер;
	
КонецПроцедуры

Процедура УстановитьРеквизитыИсправленияВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента)

	ДокументОбъект.НомерИсправления	= РеквизитыЭлектронногоДокумента.НомерИсправления;
	ДокументОбъект.ДатаИсправления	= РеквизитыЭлектронногоДокумента.ДатаИсправления;
	
	Если ЗначениеЗаполнено(ДокументОбъект.НомерИсправления)
		И ЗначениеЗаполнено(ДокументОбъект.ДатаИсправления) Тогда
		ДокументОбъект.Исправление = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДоговорСПоставщиком(ДокументОбъект)
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(
		ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент,
		ДокументОбъект.Организация,
		ВидыДоговоров
	);
	
КонецПроцедуры

Процедура УстановитьТипЦенДокумента(ДокументОбъект)
	
	Если НЕ ЕстьРеквизитМетаданных(ДокументОбъект.Метаданные(), "ДоговорКонтрагента") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДокументОбъект.ДоговорКонтрагента, "ТипЦен");
	
КонецПроцедуры

Процедура УстановитьДоговорСПокупателем(ДокументОбъект)
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(
		ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент,
		ДокументОбъект.Организация,
		ВидыДоговоров
	);
	
КонецПроцедуры

Процедура УстановитьПараметрыУчетаНДС(ДокументОбъект, ЦенаВключаетНДС)
	
	ДокументОбъект.УчитыватьНДС = Истина;
	ДокументОбъект.СуммаВключаетНДС = ЦенаВключаетНДС;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьОснованиеКорректировкиПоступления(ПараметрыСоздания, ШапкаЭД, ФорматЭД)
	
	Если ЗначениеЗаполнено(ПараметрыСоздания.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ФорматыЭД = МодульФорматыЭлектронныхДокументов();
	
	ТипыОснований = Новый Массив;
	
	Если ФорматыЭД.ЭтоУниверсальныйКорректировочныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоКорректировочныйСчетФактура(ФорматЭД) Тогда
		
		ТипыОснований.Добавить("СчетФактураПолученный");
		
	ИначеЕсли ФорматыЭД.ЭтоСоглашениеОбИзмененииСтоимости(ФорматЭД) Тогда
		
		ТипыОснований.Добавить("ПоступлениеТоваровУслуг");
		ТипыОснований.Добавить("ПоступлениеДопРасходов");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипыОснований) Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ПараметрыСоздания.Организация;
	Контрагент = ПараметрыСоздания.Контрагент;
	НомерЭД = ШапкаЭД.Номер;
	ДатаЭД = ШапкаЭД.Дата;
	
	Для Каждого ВидДокумента Из ТипыОснований Цикл
		
		СсылкаНаОбъект = НайтиДокументПоРеквизитам(
			ВидДокумента,
			Организация,
			Контрагент,
			ДатаЭД,
			НомерЭД
		);
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			
			Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
				СсылкаНаОбъект = СсылкаНаОбъект.ДокументОснование;
			КонецЕсли;
			
			ПараметрыСоздания.ДокументОснование = СсылкаНаОбъект;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиДокументПоРеквизитам(ВидДокумента, Организация, Контрагент, ДатаВходящегоДокумента, НомерВходящегоДокумента)
	
	ШаблонЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Дата КАК Дата
	|ИЗ
	|	&ПолноеИмяТаблицы КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ПометкаУдаления
	|	И Таблица.Организация = &Организация
	|	И Таблица.Контрагент = &Контрагент
	|	И Таблица.ДатаВходящегоДокумента = &ДатаДокумента
	|	И Таблица.НомерВходящегоДокумента = &НомерДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	ПолноеИмяТаблицы = "Документ." + ВидДокумента;
	ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаВходящегоДокумента);
	Запрос.УстановитьПараметр("НомерДокумента", НомерВходящегоДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаРегламентированногоУчета()
	
	Результат = Константы.ВалютаРегламентированногоУчета.Получить();
	Возврат Результат;
	
КонецФункции

Функция ТекущийПользователь()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

Функция ОрганизацияПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнаяОрганизация");
	
	Возврат Результат;
	
КонецФункции

Функция ПоставщикПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойПоставщик");
	
	Возврат Результат;
	
КонецФункции

Функция ПодразделениеПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновноеПодразделение");
	
	Возврат Результат;
	
КонецФункции

Функция СкладПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойСклад");
	
	Возврат Результат;
	
КонецФункции

Функция ОтражатьДокументыВУправленческомУчетеПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОтражатьДокументыВУправленческомУчете");
	
	Возврат Результат;
	
КонецФункции

Функция ОтражатьДокументыВБухгалтерскомУчетеПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОтражатьДокументыВБухгалтерскомУчете");
	
	Возврат Результат;
	
КонецФункции

Функция ОтражатьДокументыВНалоговомУчетеПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОтражатьДокументыВНалоговомУчете");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНоменклатуруИнформационнойБазы(Владелец, ИдентификаторНоменклатуры)
	
	ТаблицаСопоставленияНоменклатуры = ПолучитьТаблицуСопоставленияИзХранилища(Владелец);
	
	СтрокаПоиска = ТаблицаСопоставленияНоменклатуры.Найти(ИдентификаторНоменклатуры, "Идентификатор");
	
	Если НЕ СтрокаПоиска = Неопределено
		И НЕ ОбщегоНазначения.СсылкаСуществует(СтрокаПоиска.Номенклатура) Тогда
		ТаблицаСопоставленияНоменклатуры.Удалить(СтрокаПоиска);
		СтрокаПоиска = Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Если НЕ СтрокаПоиска = Неопределено Тогда
		
		Результат = НоваяНоменклатураИнформационнойБазы(
				СтрокаПоиска.Номенклатура,
				СтрокаПоиска.Характеристика,
				СтрокаПоиска.Упаковка
			);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура, Характеристика)
	
	Владелец = НоменклатураКонтрагента.Владелец;
	
	ТаблицаСопоставленияНоменклатуры = ПолучитьТаблицуСопоставленияИзХранилища(Владелец);
	Идентификатор = НоменклатураКонтрагента.Идентификатор;
	
	СтрокаТаблицы = ТаблицаСопоставленияНоменклатуры.Найти(Идентификатор, "Идентификатор");
	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = ТаблицаСопоставленияНоменклатуры.Добавить();
	КонецЕсли;
	
	СтрокаТаблицы.Идентификатор = Идентификатор;
	СтрокаТаблицы.Номенклатура = Номенклатура;
	СтрокаТаблицы.Характеристика = Характеристика;
	
	ЗаписатьСопоставлениеНоменклатурыВХранилище(Владелец, ТаблицаСопоставленияНоменклатуры);
	
КонецПроцедуры

Процедура ЗаписатьСопоставлениеНоменклатурыВХранилище(Владелец, ТаблицаСопоставленияНоменклатуры)
	
	ХранилищеСопоставления = НайтиСоздатьХранилищеСопоставленияНоменклатуры(Владелец);
	
	ХранилищеСопоставленияОбъект = ХранилищеСопоставления.ПолучитьОбъект();
	ХранилищеСопоставленияОбъект.Хранилище = Новый ХранилищеЗначения(ТаблицаСопоставленияНоменклатуры);
	ХранилищеСопоставленияОбъект.Записать();
	
КонецПроцедуры

Функция ПолучитьТаблицуСопоставленияИзХранилища(Владелец)
	
	ХранилищеСопоставления = НайтиСоздатьХранилищеСопоставленияНоменклатуры(Владелец);
	ТаблицаСопоставленияНоменклатуры = ХранилищеСопоставления.Хранилище.Получить();
	
	Если НЕ ЗначениеЗаполнено(ТаблицаСопоставленияНоменклатуры) Тогда
		ТаблицаСопоставленияНоменклатуры = Контракт_ХранениеТаблицыСопоставленияНоменклатуры();
	КонецЕсли;
	
	Если НЕ ТипЗнч(ТаблицаСопоставленияНоменклатуры) = Тип("ТаблицаЗначений") Тогда
		ШаблонОшибки = "Не удалось прочитать файл сопоставления номенклатуры по контрагенту """"%1"""". 
			|Подробности см. в журнале регистрации.";
		
		ТекстОшибки = СтрЗаменить(ШаблонОшибки, "%1", СокрЛП(Владелец));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ТаблицаСопоставленияНоменклатуры;
	
КонецФункции

Функция Контракт_ХранениеТаблицыСопоставленияНоменклатуры()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Идентификатор");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Упаковка");
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьСопоставлениеНоменклатуры_НоменклатураКонтрагентов(Владелец, ИдентификаторНоменклатуры)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.НоменклатураКонтрагентов КАК Т
		|ГДЕ
		|	Т.Контрагент = &Владелец
		|	И Т.Идентификатор = &Идентификатор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерТаблицы = РегистрыСведений.НоменклатураКонтрагентов;
	
	Пока Выборка.Следующий() Цикл
		Запись = МенеджерТаблицы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОшибкуСопоставленияНоменклатуры(ИдентификаторНоменклатуры, ВладелецНоменклатуры, Ошибка)
	
	ПодробностиОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	
	ТекстОшибки = "Не удалось записать сопоставление номенклатуры (Идентификатор = %1, контрагент = %2)";
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", ИдентификаторНоменклатуры);
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%2", ВладелецНоменклатуры);
	ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробностиОшибки;
	
	ЗаписьЖурналаРегистрации(
		"Диадок.Сопоставление номенклатуры",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.РегистрыСведений.НоменклатураКонтрагентов,
		Неопределено,
		ТекстОшибки
	);
	
КонецПроцедуры

Функция НайтиСоздатьХранилищеСопоставленияНоменклатуры(Контрагент)
	
	Наименование = НаименованиеСлужебногоХранилищаСопоставления();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК Т
		|ГДЕ
		|	Т.Объект = &Объект
		|	И НЕ Т.ПометкаУдаления
		|	И Т.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Объект", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
		НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
		НовыйОбъект.Объект = Контрагент;
		НовыйОбъект.ИмяФайла = Контрагент;
		НовыйОбъект.Наименование = Наименование;
		НовыйОбъект.Записать();
		
		Результат = НовыйОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеСлужебногоХранилищаСопоставления()
	Возврат "Диадок_СопоставлениеНоменклатуры";
КонецФункции

// Получает сопоставление номенклатуры из устаревшего хранилища и переносит в актуальное.
//
// Параметры:
//  ВладелецНоменклатуры - СправочникСсылка.Контрагенты - контрагент-владелец номенклатуры;
//  ИдентификаторНоменклатуры - Строка - идентификатор номенклатуры контрагента;
// 
// Возвращаемое значение:
//  Структура - номенклатура информационной базы (сведения из устаревшего хранилища);
//  Неопределено - если сопоставление не найдено.
//
Функция ПеренестиСопоставлениеНоменклатуры_НоменклатураКонтрагентов(ВладелецНоменклатуры, ИдентификаторНоменклатуры)
	
	НоменклатураИБ = ПолучитьНоменклатуруИнформационнойБазы_НоменклатураКонтрагентов(
			ВладелецНоменклатуры,
			ИдентификаторНоменклатуры);
	
	Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
		
		КлючевыеПоля = Новый Структура;
		КлючевыеПоля.Вставить("Владелец", ВладелецНоменклатуры);
		КлючевыеПоля.Вставить("Идентификатор", ИдентификаторНоменклатуры);
		
		ДобавитьСопоставлениеНоменклатуры(
			КлючевыеПоля,
			НоменклатураИБ.Номенклатура,
			НоменклатураИБ.Характеристика
		);
		
	КонецЕсли;
	
	Возврат НоменклатураИБ;
	
КонецФункции

Функция ПолучитьНоменклатуруИнформационнойБазы_НоменклатураКонтрагентов(Владелец, ИдентификаторНоменклатуры)
	
	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.ХарактеристикаНоменклатуры КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК Упаковка
		|ИЗ
		|	РегистрСведений.НоменклатураКонтрагентов КАК Т
		|ГДЕ
		|	Т.Контрагент = &Владелец
		|	И Т.Идентификатор = &Идентификатор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	
	Если Выборка.Следующий() Тогда
		
		Результат = НоваяНоменклатураИнформационнойБазы(
				Выборка.Номенклатура,
				Выборка.Характеристика,
				Выборка.Упаковка
			);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСопоставлениеНоменклатуры_НоменклатураКонтрагентов(НоменклатураКонтрагента, Номенклатура, Характеристика)
	
	НовыйОбъект = РегистрыСведений.НоменклатураКонтрагентов.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(НовыйОбъект, НоменклатураКонтрагента);
	
	НовыйОбъект.Контрагент = НоменклатураКонтрагента.Владелец;
	НовыйОбъект.КодНоменклатурыКонтрагента = НоменклатураКонтрагента.Код;
	НовыйОбъект.АртикулНоменклатурыКонтрагента = НоменклатураКонтрагента.Артикул;
	НовыйОбъект.НаименованиеНоменклатурыКонтрагента = НоменклатураКонтрагента.Наименование;
	
	НовыйОбъект.Номенклатура = Номенклатура;
	НовыйОбъект.ХарактеристикаНоменклатуры = Характеристика;
	
	НовыйОбъект.Записать(Истина);
	
КонецПроцедуры

Функция НоваяНоменклатураИнформационнойБазы(Номенклатура, Характеристика = Неопределено, Упаковка = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Номенклатура);
	Результат.Вставить("Характеристика");
	Результат.Вставить("Упаковка");
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Результат.Характеристика = Характеристика;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Результат.Упаковка = Упаковка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МодульФорматыЭлектронныхДокументов()
	
	ИмяМодуля = "ФорматыЭД";
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМодульПрог(ИмяМодуля)
	
	Возврат ОсновнойМодуль.ПолучитьМодульПрог(ИмяМодуля);
	
КонецФункции 

Функция ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, дляСФ = Истина) Экспорт 
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, дляСФ);
КонецФункции 

Функция МенеджерИнтеграции_НовыеСвойстваНоменклатурыИБ()
	
	Модуль_ИнтеграцияУниверсальнаяЛогика = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика");
	Возврат Модуль_ИнтеграцияУниверсальнаяЛогика.НовыеСвойстваНоменклатурыИБ();
	
КонецФункции

Функция ПолучитьНомерНаПечатьДиадок(ДокументСсылка) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомерНаПечатьДиадок(ДокументСсылка);
КонецФункции

Функция ЭтоСчетФактуранаАванс(СФ) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСчетФактуранаАванс(СФ);
КонецФункции	

Функция ПолучитьСуммуДокументаВВалютеРегламентированногоУчета_Диадок(ДокументСсылка) Экспорт 
	Возврат ДокументСсылка.СуммаДокумента;
КонецФункции

Процедура ПерезаполнитьСуммыПоУЕвРублях(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки) Экспорт
	
	Если ДанныеШапки.Свойство("СчетФактура") Тогда
		
		ПересчетВалюты_УПД(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
		
	ИначеЕсли ТипЗнч(ТекущееОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда 
		
		ПересчетВалюты_ВозвратТоваровПоставщику(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
		
	ИначеЕсли ТипЗнч(ТекущееОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ДанныеШапки.Свойство("ЭтоАкт") Тогда 
		
		ПересчетВалюты_Акт(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
		
	ИначеЕсли ТипЗнч(ТекущееОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		
		ПересчетВалюты_РеализацияТоваровУслуг(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчетВалюты_Акт(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки)
	
	ПересчетВалюты_ПоПараметрам(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
	
	ДанныеШапки.ВалютаДокумента = ПолучитьВалютуРегламентированногоУчета();
	
КонецПроцедуры

Процедура ПересчетВалюты_ВозвратТоваровПоставщику(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки)
	
	Курс		= ТекущееОснование.КурсВзаиморасчетов;
	Кратность	= ТекущееОснование.КратностьВзаиморасчетов;
	
	ПересчетВалюты_ПоКурсуДокумента(ТабличнаяЧасть, Курс, Кратность);	
	
	ДанныеШапки.ВалютаДокумента = ПолучитьВалютуРегламентированногоУчета();
	
КонецПроцедуры

Процедура ПересчетВалюты_РеализацияТоваровУслуг(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки)
	
	Пересчет = ДанныеШапки.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом;
	ПересчетВалюты_ПоПараметрам(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки, Пересчет);
	
	ДанныеШапки.ВалютаДокумента = ПолучитьВалютуРегламентированногоУчета();
	
КонецПроцедуры

Процедура ПересчетВалюты_УПД(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки)
	
	ПересчетВалюты_ПоПараметрам(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
	
КонецПроцедуры

Процедура ПересчетВалюты_ПоКурсуДокумента(ТабличнаяЧасть, Курс, Кратность)
	
	Для Каждого ТекСтрокаТЧ Из ТабличнаяЧасть Цикл
		
		СуммаСНДС = ТекСтрокаТЧ.Сумма;
		Если Не ТекСтрокаТЧ.СуммаВключаетНДС Тогда
			СуммаСНДС = СуммаСНДС + ТекСтрокаТЧ.СуммаНДС;
		КонецЕсли;
		СуммаСНДС = Окр(СуммаСНДС * Курс / Кратность, 2);
		СуммаНДС = Окр(ТекСтрокаТЧ.СуммаНДС * Курс / Кратность, 2);
		Сумма = СуммаСНДС - СуммаНДС;
		
		ТекСтрокаТЧ.Сумма		= ?(ТекСтрокаТЧ.СуммаВключаетНДС, СуммаСНДС, Сумма);
		ТекСтрокаТЧ.СуммаНДС	= СуммаНДС;
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType);
	
КонецФункции

Функция ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType);
	
КонецФункции 

Функция ДокументБезНДС(СсылкаНаОбъект) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ДокументБезНДС(СсылкаНаОбъект);
	
КонецФункции

Функция ПустаяСсылкаНаНомерГТД() Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПустаяСсылкаНаНомерГТД(); 
	
КонецФункции

Функция НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка) Экспорт

	Возврат Ложь;  // не поддерживается в данной конфигурации

КонецФункции // НДСПоДокументуИсчисляетсяНалоговымАгентом()

//} ТЕЛО МОДУЛЯ

//{ ПОЛУЧЕНИЕ ДАННЫХ

//{ Получить...

Функция ПолучитьНаименованиеКолонкиКодаТовара() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНаименованиеКолонкиКодаТовара();
КонецФункции

Функция ПолучитьВалютуРегламентированногоУчета()
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьВалютуРегламентированногоУчета();
	
КонецФункции

Функция ПолучитьДатуНомерДокументовОплаты(СчетФактура) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДатуНомерДокументовОплаты(СчетФактура);
КонецФункции

Функция ПолучитьНомерГТД(НомерГТД) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомерГТД(НомерГТД);
	
КонецФункции

Функция ПолучитьСсылкуНомерГТД(НомерГТД, СоздатьНовый = Ложь) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуНомерГТД(НомерГТД, СоздатьНовый);
	
КонецФункции

Функция ПолучитьСсылкуСерииНоменклатуры(Номенклатура, НомерГТД, СтранаПроисхождения = "", СоздатьНовый = Ложь) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуСерииНоменклатуры(Номенклатура, НомерГТД, СтранаПроисхождения, СоздатьНовый);
	
КонецФункции

Функция ПолучитьДатуНомерДоговора(ДокументСсылка) Экспорт
	Договор = ДокументСсылка.ДоговорКонтрагента;
	Возврат Новый Структура("ДоговорНомер, ДоговорДата", Договор.Номер, Договор.Дата);
КонецФункции

Функция ПолучитьФИОРуководителяДляСчета(ДанныеШапки, ПараметрыОтправкиНаСогласование) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьФИОРуководителяДляСчета(ДанныеШапки, ПараметрыОтправкиНаСогласование);
	
КонецФункции

Функция ПолучитьГрузоотправителяГрузополучателя1С(Параметры) Экспорт
	
	Возврат Неопределено;	
	
КонецФункции

Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ДокументыОснованияСчетаФактуры(СчетФактура);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапроса(Документ, СчетФактура, ЭтоКСФ)
	
	ТекстЗапроса=	"";
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаРеализацияТоваровУслуг(НЕ СчетФактура = Неопределено);
		
	ИначеЕсли ЭтоКСФ = Ложь И Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Возврат	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаКорректировкаРеализации();
		
	ИначеЕсли ЭтоКСФ = Истина И Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Если Строка(Документ.ВидОперации) = "Исправление в первичных документах" Тогда
			Возврат	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаИКСФ();
		ИначеЕсли Строка(Документ.ВидОперации) = "Корректировка по согласованию сторон" Тогда
			Возврат	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаКСФ();
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаОтчетКомиссионераОПродажах();
		
	ИначеЕсли ТипЗнч(Документ)= Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда 
		
		Возврат ТЧПолучитьТекстЗапросаОтчетКомитентуОПродажах();
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Возврат	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаВозвратТоваровПоставщику();
		
	ИначеЕсли ТипЗнч(Документ) = тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ") Тогда 
		
		Возврат ТЧПолучитьТекстЗапросаВозвратТоваровПоставщикуИзНТТ();
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС") Тогда
		
		Возврат	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаОтражениеРеализацииТоваровИУслугНДС();
		
	ИначеЕсли ЭтоСчетФактуранаАванс(СчетФактура)  Тогда
		
		Возврат	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаСчетФактураВыданный();
		
	ИначеЕсли ТипЗнч(Документ) = тип("ДокументСсылка.СчетНаоплатуПокупателю") Тогда
		
		Возврат 	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаСчетНаоплатуПокупателю();
		
	ИначеЕсли ТипЗнч(Документ) = тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Возврат 	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТЧПолучитьТекстЗапросаЗаказПокупателя();
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
	ВызватьИсключение "Не удалось сформировать текст запроса к табличной части документа " + Документ;
	
КонецФункции

Функция ПолучитьРезультатЗапросаТЧ(ДокументСсылка, СчетФактура, ЭтоКСФ) Экспорт
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст=	ТЧПолучитьТекстЗапроса(ДокументСсылка, СчетФактура, ЭтоКСФ);
	ЗапросТЧ.УстановитьПараметр("СчетФактура", СчетФактура);
	ЗапросТЧ.УстановитьПараметр("Ссылка", ДокументСсылка);
	Возврат ЗапросТЧ.Выполнить();
	
КонецФункции

Функция ПолучитьКодНоменклатурыДляТорг12(ТекущийКод, НоменклатураСсылка) Экспорт 
	КолонкаКодаТовара=	ПолучитьНаименованиеКолонкиКодаТовара();
	Если ЗначениеЗаполнено(НоменклатураСсылка) И КолонкаКодаТовара <> "Код" Тогда
		Возврат НоменклатураСсылка[КолонкаКодаТовара];
	Иначе 
		Возврат ТекущийКод;
	КонецЕсли;
КонецФункции

Функция ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокументРеализации, СчетФактура = Неопределено, ФормированиеСФ = Ложь, ЭтоАкт = Ложь) Экспорт
	
	Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Возврат Ложь;
	Иначе
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокументРеализации, СчетФактура, ФормированиеСФ, ЭтоАкт);
	КонецЕсли;
	
КонецФункции	

Функция ШапкаПолучитьТекстЗапроса(ДокументСсылка, СчетФактура)
	
	Если ЭтоСчетФактуранаАванс(СчетФактура) = Истина Тогда
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ШапкаПолучитьТекстЗапросаСФ();
	Иначе 
		Возврат ШапкаПолучитьТекстЗапросаОсновной();
	КонецЕсли;
КонецФункции

Функция ШапкаПолучитьРезультатЗапроса(ДокументСсылка, СчетФактура = Неопределено) 
	
	Запрос= Новый Запрос;
	Запрос.Текст=	ШапкаПолучитьТекстЗапроса(ДокументСсылка, СчетФактура);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса=	Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьВалютуДокумента(ВалютаДокумента, СчетФактура)
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьВалютуДокумента(ВалютаДокумента, СчетФактура);
	
КонецФункции 

Функция ПолучитьСтруктуруШапки(ДокументСсылка, СчетФактура = Неопределено)   Экспорт 
	
	РезультатЗапроса =	ШапкаПолучитьРезультатЗапроса(ДокументСсылка, СчетФактура);
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Ошибка получения данных шапки, ДокументСсылка - " + ДокументСсылка + ", СчетФактура - " + СчетФактура;
	КонецЕсли;
	
	ТаблицаДанныхШапки = РезультатЗапроса.Выгрузить();
	ДанныеШапки =		ТаблицаДанныхШапки[0];
	
	СтруктураШапки =	Новый Структура();
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураШапки.Вставить(Колонка.Имя, ДанныеШапки[Колонка.Имя]);
	КонецЦикла;
	
	СтруктураШапки.Вставить("ДопИнфо", 			Новый Массив);
				
	Если СчетФактура = Неопределено Тогда
		
		СтруктураШапки.Вставить("Дата", ДокументСсылка.Дата);
		СтруктураШапки.Вставить("Номер", ДокументСсылка.Номер);
		
	Иначе
		
		СтруктураШапки.Вставить("Дата", СчетФактура.Дата);
		СтруктураШапки.Вставить("Номер", СчетФактура.Номер);
		СтруктураШапки.ВалютаДокумента  =  ПолучитьВалютуДокумента(СтруктураШапки.ВалютаДокумента, СчетФактура);
		
		Если СчетФактура.Метаданные().Реквизиты.Найти("ИдентификаторГосконтракта") <> Неопределено Тогда
			СтруктураШапки.Вставить("ИдентификаторГосконтракта", СчетФактура.ИдентификаторГосконтракта);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если СтруктураШапки.Свойство("АдресДоставки")
		И ЗначениеЗаполнено(СтруктураШапки.АдресДоставки) Тогда
		
		СтруктураШапки.АдресДоставки = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(СтруктураШапки.АдресДоставки);
		
	КонецЕсли;
	
	Возврат СтруктураШапки;
	
КонецФункции

//} ПолучитьДанныеШапки...

//{ ПолучитьДанныеСФ...

Функция ПолучитьНомераДляКСФ(СчетФактура) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомераДляКСФ(СчетФактура);
КонецФункции

Функция ПолучитьНомераДляСФ(СчетФактура)  Экспорт 
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомераДляСФ(СчетФактура);
КонецФункции

Функция ПолучитьКПППродавца(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьКПППокупателя(СчетФактура) Экспорт 
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьКПППокупателя(СчетФактура);
КонецФункции

//} ПолучитьДанныеСФ...

//} ПОЛУЧЕНИЕ ДАННЫХ

//{ ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

Функция ОчиститьГрузополучателя(СтрокаТаблицы) Экспорт
	
	Возврат ЗначениеЗаполнено(СтрокаТаблицы.Грузополучатель) И СтрокаТаблицы.Грузополучатель.ИНН <> СтрокаТаблицы.Покупатель.ИНН;
	
КонецФункции

Функция ПроверитьТипДокумента(ДокСсылка, НаименованиеТипа)
	Возврат (Метаданные.Документы.Найти(НаименованиеТипа) <> Неопределено)
		И (ТипЗнч(ДокСсылка) = Тип("ДокументСсылка."+НаименованиеТипа));
КонецФункции

Функция ПолучитьТипДокумента(Док, ТаблицаНастроекПечати, ЭтоСчет, ФункцияУПД) Экспорт
	
	Если ЗначениеЗаполнено(ФункцияУПД) Тогда
		
		ТипДокумента = ОсновнойМодуль.ТипДокументаУПД(ФункцияУПД);
		
		Если ЗначениеЗаполнено(ТипДокумента) Тогда
			Возврат ТипДокумента;
		Иначе
			ТипДокумента = ОсновнойМодуль.ТипДокументаУКД(ФункцияУПД);
			Если ЗначениеЗаполнено(ТипДокумента) Тогда
				Возврат ТипДокумента;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоСчет ИЛИ ТипЗнч(Док) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Возврат "Счет на оплату";
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
		ЭтоКСФ = (Док.метаданные().Реквизиты.Найти("ВидСчетаФактуры") <> Неопределено)
		И (Строка(Док.ВидСчетаФактуры) = "Корректировочный"); 
		Если ЭтоКСФ Тогда
			Возврат ?(Док.Исправление, "Исправление КСФ", "Корректировочный СФ");
		Иначе
			Возврат ?(Док.метаданные().Реквизиты.Найти("Исправление") <> Неопределено
			И Док.исправление, "Исправление СФ", "Счет-фактура");
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда 
		СтрокиНастроек = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("Организация", Док.Организация));
		Возврат ?(СтрокиНастроек.количество() = 0, "Торг-12", ?(ЗначениеЗаполнено(СтрокиНастроек[0].ПечатнаяФормаДляТоваров) = Ложь, "Торг-12", СтрокиНастроек[0].ПечатнаяФормаДляТоваров));
	ИначеЕсли (ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
		Или ПроверитьТипДокумента(Док, "КорректировкаРеализации") Тогда 
		//Настройка = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьНастройкиПечатныхФормДляОрганизацииДиадок(Док.Организация);
		РНК = Док;
		СтрокиНастроек = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("Организация", РНК.Организация));
		Если СтрокиНастроек.количество() = 0 Тогда 
			ФормаДляУслуг = "Акт";
			ФормаДляТоваров = "Торг-12";
		Иначе 
			ФормаДляТоваров =  ?(ЗначениеЗаполнено(СтрокиНастроек[0].ПечатнаяФормаДляТоваров) = Ложь, "Торг-12" , СтрокиНастроек[0].ПечатнаяФормаДляТоваров);
			ФормаДляУслуг  =   ?(ЗначениеЗаполнено(СтрокиНастроек[0].ПечатнаяФормаДляУслуг) = Ложь, "Акт"		, СтрокиНастроек[0].ПечатнаяФормаДляУслуг);
		КонецЕсли;	
		Возврат ?(РНК.товары.количество() = 0 И (РНК.Услуги.Количество() > 0), ФормаДляУслуг, ФормаДляТоваров);
	ИначеЕсли (ТипЗнч(Док) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах"))  Тогда 
		СтрокиНастроек = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("Организация", Док.Организация));
		Возврат ?(СтрокиНастроек.количество() = 0, "Акт", ?(ЗначениеЗаполнено(СтрокиНастроек[0].ПечатнаяФормаДляУслуг) = Ложь, "Акт"	, СтрокиНастроек[0].ПечатнаяФормаДляУслуг));
	ИначеЕсли ТипЗнч(Док)=Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Возврат "Счет на оплату"; 		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда 
		Возврат "Акт сверки"
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыСФ(Док) Экспорт
	
	Результат = Неопределено;
	
	УчетНДС.ПолучитьПараметрыСчетаФактуры(Док, ПолучитьВалютуРегламентированногоУчета(), Результат);
	
	Если Не ЗначениеЗаполнено(Результат.СуммаНДСДокумента) Тогда
		Результат.СуммаНДСДокумента = Док.СуммаНДСДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//{ Подготовка временных таблиц для списка отправки документов...

Функция ПодготовитьВТ_СпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц= Новый Массив;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 1 ИЛИ ТипыДокументов = 2 ИЛИ ТипыДокументов = 5 ИЛИ ТипыДокументов = 6 Тогда
		ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
		ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
		ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 1 Тогда
		ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 2 Тогда
		ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 3 Тогда
		ПодготовитьВТ_СчетаНаОплату(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 4 Тогда
		ПодготовитьВТ_АктыСверки(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Возврат МассивВременныхТаблиц;
	
КонецФункции


Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	
КонецПроцедуры

Процедура ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	
КонецПроцедуры

Процедура ПодготовитьВТ_АктыСверки(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_АктыСверки(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры


Процедура ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_ВозвратТоваровПоставщику(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_ОтчетКомитентуОПродажах(Запрос, МассивВременныхТаблиц);
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено Тогда
		ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ВозвратТоваровПоставщику(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_ВозвратТоваровПоставщику(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ОтчетКомитентуОПродажах(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_ОтчетКомитентуОПродажах(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры


Процедура ПодготовитьВТ_СчетаНаОплату(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_СчетаНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетаНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетаНаОплату_ЗаказПокупателя(Запрос, МассивВременныхТаблиц);
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено Тогда
		ПодготовитьВТ_СчетаНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_ЗаказПокупателя(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаНаОплату_ЗаказПокупателя(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

//} Подготовка временных таблиц для списка отправки документов...

//} ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

//////////////////////////////////////////////////////
//функции генерации структуры для ФУФ счета-фактуры
///////////////////////////////////////////////////////

Функция ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(Организация) Экспорт
	
	Если ЗначениеЗаполнено(Организация.СвидетельствоСерияНомер)
		И ЗначениеЗаполнено(Организация.СвидетельствоДатавыдачи) Тогда
		Возврат Организация.СвидетельствоСерияНомер + " от " + Формат(Организация.СвидетельствоДатавыдачи, "ДФ=dd.MM.yyyy");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

//Функция по ИСФ/КСФ возвращает сф-основание
Функция ПолучитьСФОснованиеДляИСФДиадок(ИСФ) Экспорт
	
	результат = Новый Структура;
	
	ДокОснование = ИСФ.ДокументыОснования[0].ДокументОснование;
	Если ДокОснование.Видоперации = перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
		Докоснование = ДокОснование.ДокументРеализации
	Иначе
		Пока (ТипЗнч(Докоснование) = Тип("ДокументСсылка.КорректировкаРеализации"))
			И (ДокОснование.ВидОперации = перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) Цикл 
			ДокОснование = ДокОснование.ДокументРеализации
		КонецЦикла;
	КонецЕсли;	
	
	результат.Вставить("ПервичныйДокументОснование",  ДокОснование);
	//ищем СФ
	запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование,
	|	СчетФактураВыданныйДокументыОснования.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления = Ложь
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("Документоснование", ДокОснование);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда 
		Возврат  выборка.ссылка;
	КонецЕсли;	
	
	Возврат Неопределено;
КонецФункции	

Функция СФОтправлена(ДокСсылка)
	ЗапросСФ = Новый Запрос;
	ЗапросСФ.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокСсылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Док
	|ГДЕ
	|	Док.ДокументОснование = &ДокОснование";
	ЗапросСФ.УстановитьПараметр("ДокОснование", ДокСсылка);
	ВыборкаСФ = ЗапросСФ.Выполнить().Выбрать();
	Пока ВыборкаСФ.Следующий() Цикл
		DocumentId = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").Документ_2_DocumentID(ВыборкаСФ.ДокСсылка);
		Если ЗначениеЗаполнено(DocumentId) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ПолучитьПоследнееИсправление(КоррСтарт, ПоследнееОтправленное) Экспорт
	текКор = КоррСтарт;
	
	Пока Истина Цикл
		// получаем следующего кандидата, проверям его
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Док.Ссылка ДокСсылка
		|ИЗ
		|	Документ.КорректировкаРеализации КАК Док
		|ГДЕ
		|	Док.ДокументРеализации = &ДокСсылка
		|	И Док.ВидОперации = &ВидОперации";
		Запрос.УстановитьПараметр("ДокСсылка", текКор);
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			// Проверяем кандидата
			Если ПоследнееОтправленное И НЕ СФОтправлена(Выборка.ДокСсылка) Тогда
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
		текКор = Выборка.ДокСсылка;
	КонецЦикла;
	
	Возврат текКор;
КонецФункции

Функция ПолучитьДочернееИсправление(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокССылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Док
	|ГДЕ
	|	Док.ДокументРеализации = &ДокСсылка
	|	И Док.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокССылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьНеотправленнуюКорректировку(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокССылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Док
	|ГДЕ
	|	Док.ДокументРеализации = &ДокСсылка
	|	И Док.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ СФОтправлена(Выборка.ДокССылка) Тогда
			Возврат Выборка.ДокССылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьКорректировкуОбъект(ТипНовогоДокумента, КорректировкаРеализацииОснование) Экспорт
	КорректировкаОбъект = Документы.КорректировкаРеализации.СоздатьДокумент();
	Если ТипНовогоДокумента = "InvoiceRevision" ИЛИ ТипНовогоДокумента = "InvoiceCorrectionRevision" Тогда
		КорректировкаОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
	Иначе
		КорректировкаОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	КонецЕсли;
	
	КорректировкаОбъект.Заполнить(КорректировкаРеализацииОснование);
	
	Возврат КорректировкаОбъект;
КонецФункции

Функция СчетФактураПолученныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СчетФактураПолученныйПоДокументуОснование(ДокументОснование);
	
КонецФункции

Функция СчетФактураВыданныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СчетФактураВыданныйПоДокументуОснование(ДокументОснование);	
	
КонецФункции

Функция ПолучитьПредставлениеАдресаДляДиадок(записьрегистра) Экспорт 
	Возврат УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(записьрегистра);
КонецФункции	

Функция ПолучитьВидЮрАдресаКонтрагента() Экспорт 
	Возврат Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
КонецФункции

Процедура ЗаполнитьСтруктуруАдреса(AddressInfo, ЮрФизЛицо, ИспользоватьЮрАдрес = Ложь, АдресСтрокой = "") Экспорт 
		
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗаполнитьСтруктуруАдреса(AddressInfo, ЮрФизЛицо, ИспользоватьЮрАдрес, АдресСтрокой);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруГрузоПолучателяОтправителя(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, АдресСтрокой = "") Экспорт 
	
	СведенияОбОрганизации =  ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента);
	Если стрДлина(СведенияОбОрганизации.ИНН)<>12 Тогда 
		НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ЭтоИП = Ложь;
	Иначе 
		Если типЗнч(юрФизЛицо) = тип("СправочникСсылка.Организации") Тогда 
			//для нашей организации - данные берем из нормализованного представления физлица
			НаименованиеОрганизации  = юрФизЛицо.наименованиеПолное;
		Иначе 
			НаименованиеОрганизации  = СведенияОбОрганизации.ПолноеНаименование 
		КонецЕсли;	  
		ЭтоИП = Истина;
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.IsSoleProprietor  =  ЭтоИП;
	OrganizationInfo.Ссылка = ЮрФизЛицо;
	OrganizationInfo.SameAsSellerOrBuyer = Ложь;
	
	ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ЮрФизЛицо, Ложь, АдресСтрокой);
	
КонецПроцедуры	

Функция ПолучитьГоловноеЮрлицо(ЮрФизЛицо)
	
	ГоловноеЮрЛицо = "";
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ГоловноеЮрЛицо = ЮрФизЛицо.ГоловнойКонтрагент;
	КонецЕсли;

	Если ЗначениеЗаполнено(ГоловноеЮрЛицо)
		И (ЮрФизЛицо.Метаданные().Реквизиты.Найти("ОбособленноеПодразделение") <> Неопределено)
		И (ЮрФизЛицо.ОбособленноеПодразделение = Истина) Тогда
		
		Возврат ГоловноеЮрЛицо;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьСтруктурируЮрФизЛица(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации = Неопределено,  ЮрАдрес, АдресДляСФ = Ложь, АдресСтрокой = "")  Экспорт

	ГоловноеЮрЛицо = "";
	
	Если АдресДляСФ = Истина Тогда
				
		ГоловноеЮрЛицо = ПолучитьГоловноеЮрлицо( ЮрФизЛицо);
		Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		
			СведенияОПодразделении 	= ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			СведенияОбОрганизации	= ПолучитьСведенияОбОрганизации(ГоловноеЮрЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			
			СведенияОбОрганизации.КПП = СведенияОПодразделении.КПП;
		Иначе
			СведенияОбОрганизации = ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
		КонецЕсли;	
	Иначе
		СведенияОбОрганизации = ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
	КонецЕсли;
	
	Если стрДлина(СведенияОбОрганизации.ИНН) <> 12 Тогда 
		НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ЭтоИП = Ложь;
	Иначе 
		Если типЗнч(юрФизЛицо) = тип("СправочникСсылка.Организации") Тогда 
			//для нашей организации - данные берем из нормализованного представления физлица
			НаименованиеОрганизации  = юрФизЛицо.наименованиеПолное;
		Иначе 
			НаименованиеОрганизации  = СведенияОбОрганизации.ПолноеНаименование 
		КонецЕсли;	  
		ЭтоИП = Истина;
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.Inn  = СведенияОбОрганизации.ИНН;
	Если ЗначениеЗаполнено(ЮрФизЛицо.ЮрФизЛицо) Тогда
		OrganizationInfo.Kpp  = СведенияОбОрганизации.КПП;
	Иначе
		OrganizationInfo.Kpp  = ЮрФизЛицо.КПП;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ГоловноеЮрЛицо, ЮрАдрес, АдресСтрокой);	
	Иначе
		ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ЮрФизЛицо, ЮрАдрес, АдресСтрокой);
	КонецЕсли;
	
	OrganizationInfo.IsSoleProprietor  =  ЭтоИП;
	
	Если АдресДляСФ = Ложь Тогда
		OrganizationInfo.Okpo  = СведенияОбОрганизации.КодПоОкпо;
		
		Если найти(СведенияОбОрганизации.Телефоны, "факс:") > 0 Тогда 
			телефон = СокрЛП(Лев(СведенияОбОрганизации.Телефоны, Найти(СведенияОбОрганизации.Телефоны, "факс:") - 1));
			Если прав(телефон, 1) = ","  Тогда
				телефон = Лев(телефон, стрДлина(телефон) - 1);
			КонецЕсли;
			факс = СокрЛП(прав(СведенияОбОрганизации.Телефоны, СтрДлина(СведенияОбОрганизации.Телефоны) - найти(СведенияОбОрганизации.Телефоны, "факс:") - 5));
		Иначе 
			Телефон = СведенияОбОрганизации.Телефоны;
			Факс = "";
		КонецЕсли;	
		OrganizationInfo.Phone = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СократитьПредставлениеТелефона(Телефон);
		OrganizationInfo.Fax   = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СократитьПредставлениеТелефона(Факс);
		OrganizationInfo.BankAccountNumber = ?(ЗначениеЗаполнено(СведенияОбОрганизации.НомерСчета),  СведенияОбОрганизации.НомерСчета, "");
		OrganizationInfo.BankName  =   ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк), СведенияОбОрганизации.Банк.наименование, "");
		OrganizationInfo.BankId =  ?(ЗначениеЗаполнено(СведенияОбОрганизации.БИК),  СокрЛП(СведенияОбОрганизации.БИК), "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		OrganizationInfo.вставить("Ссылка", ГоловноеЮрЛицо);
	Иначе
		OrganizationInfo.вставить("Ссылка", ЮрФизЛицо);
	КонецЕсли;
	
КонецПроцедуры	

Процедура Заполнить_ExtendedOrganizationInfo(ExtendedOrganizationInfo, ЮрФизЛицо, ДатаДокумента, ИспользоватьЮрАдрес, БанковскийСчет= Неопределено, АдресСтрокой = "") Экспорт
	
	СведенияОбОрганизации= ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчет);
	СведенияОбОрганизации.Вставить("Ссылка", ЮрФизЛицо);
	
	Если ИспользоватьЮрАдрес Тогда
		
		ГоловноеЮрЛицо= ПолучитьГоловноеЮрлицо(ЮрФизЛицо);
		
		Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
			
			СведенияОПодразделении= ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента,  БанковскийСчет);
			СведенияОбОрганизации=  ПолучитьСведенияОбОрганизации(ГоловноеЮрЛицо, ДатаДокумента, БанковскийСчет);
			
			СведенияОбОрганизации.Вставить("Ссылка", ГоловноеЮрЛицо);
			СведенияОбОрганизации.Вставить("КПП"   , СведенияОПодразделении.КПП);
			
		КонецЕсли;
		
	КонецЕсли;

	ЭтоОрганизация= ТипЗнч(СведенияОбОрганизации.Ссылка) = Тип("СправочникСсылка.Организации");
	ЭтоИП= СтрДлина(СведенияОбОрганизации.ИНН) = 12;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбОрганизации.КПП) И НЕ ЗначениеЗаполнено(СведенияОбОрганизации.Ссылка.ЮрФизЛицо) Тогда
		СведенияОбОрганизации.КПП= СведенияОбОрганизации.Ссылка.КПП;
	КонецЕсли;
	
	ExtendedOrganizationInfo.Name= 					СведенияОбОрганизации.ПолноеНаименование;
	ExtendedOrganizationInfo.Inn=  					СведенияОбОрганизации.ИНН;
	ExtendedOrganizationInfo.Kpp=  					СведенияОбОрганизации.КПП;
	ExtendedOrganizationInfo.Okpo= 					СведенияОбОрганизации.КодПоОкпо;
	ExtendedOrganizationInfo.CorrespondentAccount=	СведенияОбОрганизации.КоррСчет;
	
	ExtendedOrganizationInfo.BankAccountNumber= ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Значение1C_В_СтрокаCOM(СведенияОбОрганизации.НомерСчета);
	ExtendedOrganizationInfo.BankName=   		ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Значение1C_В_СтрокаCOM(СведенияОбОрганизации.Банк);
	ExtendedOrganizationInfo.BankId=  			ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Значение1C_В_СтрокаCOM(СведенияОбОрганизации.БИК);
	ExtendedOrganizationInfo.Phone= 			ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПредставлениеТелефона(СведенияОбОрганизации.Телефоны, "Телефон", 255);
	ExtendedOrganizationInfo.Okpo= 				СведенияОбОрганизации.КодПоОКПО;
	
	Если ЭтоИП Тогда
		ExtendedOrganizationInfo.Type= "IndividualEntity";
	ИначеЕсли ЭтоОрганизация Тогда
		ExtendedOrganizationInfo.Type= "LegalEntity";
	Иначе
		
		Если СведенияОбОрганизации.Ссылка.НеЯвляетсяРезидентом
			И ПустаяСтрока(СведенияОбОрганизации.ИНН) Тогда
			// В контрагенте может быть указано, что он не является резидентом,
			//   но если у него указан ИНН, значит, он встал на учет в России.
			// Будем считать его иностранным только в том случае, если не указан ИНН.
			ExtendedOrganizationInfo.Type= "ForeignEntity";
		Иначе
			ExtendedOrganizationInfo.Type= "LegalEntity";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ExtendedOrganizationInfo.Type = "IndividualEntity" Тогда
		
		Если ДатаДокумента >= ДатаРедакции425() Тогда
			
			ДатаРегистрации = "";
			
			ExtendedOrganizationInfo.IndividualEntityRegistrationCertificate = СтрокаНомерСВ_2026(
				СведенияОбОрганизации.ОГРН,
				ДатаРегистрации
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбОрганизации.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ExtendedOrganizationInfo.Email = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").АдресЭлектроннойПочты(СведенияОбОрганизации.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами);
	КонецЕсли;
	
	ЗаполнитьСтруктуруАдреса(ExtendedOrganizationInfo.Address, СведенияОбОрганизации.Ссылка, ИспользоватьЮрАдрес, АдресСтрокой);	
	
	ExtendedOrganizationInfo.Вставить("Ссылка", СведенияОбОрганизации.Ссылка);
	
КонецПроцедуры	

Функция ДатаРедакции425()
	
	Возврат '20260101';
	
КонецФункции

Функция СтрокаНомерСВ_2026(ОГРН, ДатаРегистрации)
	
	Результат = "%1;%2";
	Результат = СтрЗаменить(Результат, "%1", ОГРН);
	Результат = СтрЗаменить(Результат, "%2", ДатаРегистрации);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруОснования(ДокСсылка, ЭтоАкт = Ложь, ЭтоУПД = Ложь) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСтруктуруОснования(ДокСсылка, ЭтоАкт, ЭтоУПД);
	
КонецФункции	

Функция ПолучитьСтруктуруОснованияУПД(ДокументСсылка, ДанныеШапки)  Экспорт
	
	ЭтоАкт	= Ложь;
	ЭтоУПД	= Истина;
	
	Результат = ПолучитьСтруктуруОснования(ДокументСсылка, ЭтоАкт, ЭтоУПД);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьБанковскийСчетПоДокументу(ДокТоварный) Экспорт 
	
	БанковскийСчетОрганизации =
		?(ДокТоварный.Метаданные().Реквизиты.Найти("БанковскийСчетОрганизации")
			= Неопределено, Неопределено, ДокТоварный.БанковскийСчетОрганизации);
	Если (ДокТоварный.Метаданные().Реквизиты.Найти("СтруктурнаяЕдиница") <> Неопределено)
		И (ТипЗнч(ДокТоварный.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета")) Тогда
		БанковскийСчетОрганизации = ДокТоварный.СтруктурнаяЕдиница;
	ИначеЕсли (ДокТоварный.Метаданные().Реквизиты.Найти("БанковскийСчет") <> Неопределено)
		И (ТипЗнч(ДокТоварный.БанковскийСчет) = Тип("СправочникСсылка.БанковскиеСчета")) Тогда
		БанковскийСчетОрганизации = ДокТоварный.БанковскийСчет;
	КонецЕсли;
	Если (ЗначениеЗаполнено(БанковскийСчетОрганизации) = Ложь)
		И ЗначениеЗаполнено(ДокТоварный.Организация.ОсновнойБанковскийСчет) Тогда
		БанковскийСчетОрганизации = ДокТоварный.Организация.ОсновнойБанковскийСчет
	КонецЕсли;
	Возврат БанковскийСчетОрганизации;
	
КонецФункции

Функция ПолучитьСведенияОбОрганизации(Организация, Дата, БанковскийСчет = Неопределено) 
	Возврат УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата, , БанковскийСчет);
КонецФункции	

/////////////////////////////////////////////////////////////////////////////
// функции генерации сотруктуры для генерации торг-12 или акта выполненных работ
//////////////////////////////////////////////////////////////////////////////

Функция ПолучитьОписаниеОрганизацииДляСчетаНаОплату(Контрагент, датаОперации, БанковскийСчет = Неопределено) Экспорт 
	СведенияОбОрганизации 	  = ПолучитьСведенияОбОрганизации(Контрагент, датаОперации, БанковскийСчет);
	Возврат ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
КонецФункции	

Функция ПолучитьРеквизитыОрганизацииДляСчетаНаОплату(контрагент, ДатаОперации) Экспорт 
	СведенияОбОрганизации 	  = ПолучитьСведенияОбОрганизации(Контрагент, датаОперации);
	Возврат Новый Структура("Наименование, ИНН, КПП", СведенияОбОрганизации.ПолноеНаименование, СведенияОбОрганизации.ИНН, СведенияОбОрганизации.КПП);
КонецФункции

Функция ПолучитьСтруктуруБанковскогоСчета(Организация, БанковскийСчетОрганизации) Экспорт
	
	Если ЗначениеЗаполнено(БанковскийСчетОрганизации) Тогда
		БанкССылка = БанковскийСчетОрганизации;
		Если БанкСсылка <> Неопределено Тогда 
			мБанк = ?(НЕ ЗначениеЗаполнено(БанкСсылка.БанкДляРасчетов), БанкСсылка.Банк, БанкСсылка.БанкДляРасчетов);
			мГородБанка = мБанк.Город;
			мКоррСчет   = мБанк.КоррСчет;
			мБИК        = мБанк.Код;
			мНомерСчета = ?(БанкСсылка.БанкДляРасчетов.Пустая(), БанкСсылка.НомерСчета, БанкСсылка.Банк.КоррСчет);
			
			Если ПустаяСтрока(БанкСсылка.ТекстКорреспондента) Тогда
				мТекстПолучателя = Организация.НаименованиеПолное;
				Если ЗначениеЗаполнено(БанкСсылка.БанкДляРасчетов) Тогда
					мТекстПолучателя = мТекстПолучателя + " р/с " + БанкСсылка.НомерСчета + " в " + БанкСсылка.Банк + " " + БанкСсылка.Банк.Город;
				КонецЕсли;	
			Иначе
				мТекстПолучателя = БанкСсылка.ТекстКорреспондента;
			КонецЕсли;		
			
		КонецЕсли;
		Возврат Новый Структура ("Банк,БИК,КоррСчет,ГородБанка,НомерМсета,ТекстПолучателя,НомерСчета", мБанк, мБИК, мКоррСчет, мГородБанка, мНомерСчета, мТекстПолучателя, мНомерСчета);
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции


Функция ПолучитьПодразделениеИзДокумента(ДокСсылка) Экспорт
	
	Результат = "";
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЕстьРеквизитИлиСвойствоОбъектаЛок(
		ДокСсылка,
		"Подразделение",
		Результат
	);
	
	Возврат Строка(Результат);
	
КонецФункции

Функция ПолучитьПредставлениеХарактеристикиИСерии(Выборка) Экспорт

	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьПредставлениеХарактеристикиИСерии(Выборка);

КонецФункции

Функция Документ_Организация(Документ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Документ_Организация(Документ);
	
КонецФункции

Функция Организация_КПП(Организация) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Организация_КПП(Организация);
	
КонецФункции

Функция ПолучитьДатуНомерВходящейНакладной(ДокСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДатуНомерВходящейНакладной(ДокСсылка)
	
КонецФункции

Функция ПолучитьДатуНомерВходящегоСчетаФактуры(ДокСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДатуНомерВходящегоСчетаФактуры(ДокСсылка)
	
КонецФункции

Процедура УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры

Процедура УстановитьДатуНомерВходящегоСчетаФактуры(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящегоСчетаФактуры(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_НомерИДатаВходящегоДокумента"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Структура			- коллекция переопределяемых реквизитов 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента(Результат, ДокСсылка) Экспорт
	
	//По умолчанию используем результат из "Модуль_ИнтеграцияУниверсальнаяЛогика" 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента()

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_КодСпособаПолучения"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Строка			- имя переопределяемого реквизита 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_КодСпособаПолучения(Результат, ДокСсылка) Экспорт
	
	//По умолчанию используем результат из "Модуль_ИнтеграцияУниверсальнаяЛогика" 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_КодСпособаПолучения()

//Возвращает именя реквизита "Склад" у документа поступления
//так как оно заданно в текущей конфигурации
//
//Возвращаемое значение:
//	Строка
Функция ИменаРеквизитов_Склад() Экспорт

	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИменаРеквизитов_Склад();
	
	Возврат Результат;
	
КонецФункции //ИменаРеквизитов_Склад()

//////////////////////////////////////////////////////////
// функции генерации структуры акта сверки
////////////////////////////////////////////////////////////

Функция  ПолучитьПредставителяОрганизацииДляАктаСверки(ДокСсылка)
	
	Если ЗначениеЗаполнено(ДокСсылка.ПредставительОрганизации) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
		|		&КонДата,
		|		СтруктурнаяЕдиница = &Организация
		|			И ФизическоеЛицо = &ФизическоеЛицо) КАК ОтветственныеЛицаОрганизацииСрезПоследних";
		
		Запрос.УстановитьПараметр("Организация", ДокСсылка.Организация);
		Запрос.УстановитьПараметр("ФизическоеЛицо", ДокСсылка.ПредставительОрганизации);
		Запрос.УстановитьПараметр("КонДата", ДокСсылка.Дата);
		
		Попытка
			Рез = Запрос.Выполнить();
			Если Рез.Пустой() Тогда
				ДолжностьПредставителяОрганизации = "";
			Иначе
				Выборка = Рез.Выбрать();
				Выборка.Следующий();
				ДолжностьПредставителяОрганизации = СокрЛП(Выборка.Должность);
			КонецЕсли;
		Исключение
			ДолжностьПредставителяОрганизации = "";	
		КонецПопытки;
	Иначе
		ДолжностьПредставителяОрганизации = "";
	КонецЕсли;
	
	
	
	ПредставительОрганизации = Новый Структура;
	ПредставительОрганизации.Вставить("ФИО", сокрЛП(ДокСсылка.ПредставительОрганизации.Наименование));
	ПредставительОрганизации.Вставить("Должность", Строка(ДолжностьПредставителяОрганизации));
	
	Возврат ПредставительОрганизации;
КонецФункции

Функция  ПолучитьПредставителяКонтрагентаДляАктаСверки(ДокСсылка)
	ПредставительКонтрагента = Новый Структура;
	ПредставительКонтрагента.Вставить("ФИО", ДокСсылка.ПредставительКонтрагента.наименование);
	ПредставительКонтрагента.Вставить("Должность", ДокСсылка.ПредставительКонтрагента.Должность);
	
	Возврат ПредставительКонтрагента;
КонецФункции

Функция ИнициализироватьТЧДляСверки()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата");
	ТЗ.Колонки.Добавить("ПредставлениеДокумента");
	ТЗ.Колонки.Добавить("Дебет");
	ТЗ.Колонки.Добавить("Кредит");
	
	Возврат ТЗ;
КонецФункции		

Функция ПолучитьСтруктуруДанныхТекущегоДоговораАктаСверки(МассивДанныхПоДоговорам, ДоговорСсылка)
	
	Для Каждого элемент Из МассивДанныхПоДоговорам Цикл
		Если Элемент.ДоговорСсылка = ДоговорСсылка Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("ДанныеОрганизации", ИнициализироватьТЧДляСверки());
	СтруктураДанных.Вставить("ДанныеКонтрагента", ИнициализироватьТЧДляСверки());
	СтруктураДанных.Вставить("ДоговорСсылка"    , ДоговорСсылка);
	
	МассивДанныхПоДоговорам.Добавить(СтруктураДанных);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьДанныеТЧАктаСверки(ДокСсылка)
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.ДоговорКонтрагента КАК Договор,
	|	Истина КАК ЭтоДанныеОрганизации
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Дата,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Представление,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Дебет,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Кредит,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.ДоговорКонтрагента,
	|	Ложь
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК АктСверкиВзаиморасчетовПоДаннымКонтрагента
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Выборка = запрос.Выполнить().Выбрать();
	МассивДанныхПоДоговорам = Новый Массив;
	
	Пока выборка.Следующий() Цикл 
		СтруктураДанныхПоДоговору = ПолучитьСтруктуруДанныхТекущегоДоговораАктаСверки(МассивДанныхПоДоговорам,  Неопределено );
		ТаблицаДанных = ?(выборка.ЭтоДанныеОрганизации, СтруктураДанныхПоДоговору.ДанныеОрганизации,  СтруктураДанныхПоДоговору.ДанныеКонтрагента);
		стр = ТаблицаДанных.Добавить();
		Стр.Дата = выборка.Дата;
		Стр.представлениеДокумента = выборка.Представление;
		стр.Дебет = Выборка.Дебет;
		стр.Кредит = выборка.кредит;
	КонецЦикла;	 
	
	
	Возврат МассивДанныхПоДоговорам;
КонецФункции	

Функция ПолучитьНаименованиеОрганизацииДляАктаСверки(ОрганизацияКонтрагент)
	Возврат ?(ЗначениеЗаполнено(ОрганизацияКонтрагент.НаименованиеПолное), ОрганизацияКонтрагент.НаименованиеПолное, ОрганизацияКонтрагент.Наименование);
КонецФункции	 

Функция ПолучитьДанныеДляФормированияАктаСверки(ДокСсылка) Экспорт 
	
	ДанныеДляАктаСверки = Новый Структура();
	
	ДанныеДляАктаСверки.вставить("Дата", ДокСсылка.Дата);
	ДанныеДляАктаСверки.Вставить("Номер", ДокСсылка.Номер);
	ДанныеДляАктаСверки.Вставить("ДоговорКонтрагента", ДокСсылка.ДоговорКонтрагента);
	
	ДанныеДляАктаСверки.вставить("ДатаНачалаСверки", ДокСсылка.ДатаНачала);
	ДанныеДляАктаСверки.Вставить("ДатаокончанияСверки", ДокСсылка.Датаокончания);
	
	ДанныеДляАктаСверки.Вставить("ПредставлениеОрганизации", ПолучитьНаименованиеОрганизацииДляАктаСверки(ДокСсылка.Организация));
	ДанныеДляАктаСверки.Вставить("ПредставлениеКонтрагента", ПолучитьНаименованиеОрганизацииДляАктаСверки(ДокСсылка.Контрагент));
	
	ДанныеДляАктаСверки.Вставить("ПредставительОрганизации",  ПолучитьПредставителяОрганизацииДляАктаСверки(ДокСсылка));
	ДанныеДляАктаСверки.Вставить("ПредставительКонтрагента",  ПолучитьПредставителяКонтрагентаДляАктаСверки(ДокСсылка));
	
	ДанныеДляАктаСверки.вставить("ВалютаДокумента", ДокСсылка.ВалютаДокумента);
	ДанныеДляАктаСверки.вставить("МассивДанныхПоДоговорам",  ПолучитьДанныеТЧАктаСверки(ДокСсылка));
	
	ДанныеДляАктаСверки.Вставить("СальдоНачальное",  ДокСсылка.ОстатокНаНачало);
	ДанныеДляАктаСверки.Вставить("СверкаСогласована", ДокСсылка.СверкаСогласована);
	ДанныеДляАктаСверки.Вставить("Расхождение", ДокСсылка.Расхождение);
	
	Возврат ДанныеДляАктаСверки;
	
КонецФункции



//////////////////////////////////////////////////////////
// функции для работы с формами 1С
//////////////////////////////////////////////////////////

Функция ПолучитьФормуВыбораДоговораКонтрагента(Элемент, Организация, ДатаДокумента, Контрагент, ВидыДоговоров, ДоговорКонтрагента) Экспорт
	
	ФрмВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(,Элемент);
	ФрмВыбора.ПараметрОтборПоВладельцу = Контрагент;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.ВидСравнения                    = ВидСравнения.ВСписке;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Значение                            = ВидыДоговоров;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Использование                       = Истина;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидДоговора.Доступность = Ложь;
	
	ФрмВыбора.СправочникСписок.Отбор.Организация.Значение                            = Организация;
	ФрмВыбора.СправочникСписок.Отбор.Организация.Использование                       = Истина;
	ФрмВыбора.СправочникСписок.Отбор.Организация.ВидСравнения                        = ВидСравнения.Равно;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Организация.Доступность = Ложь;
	
	ФрмВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
	Возврат ФрмВыбора;
	
КонецФункции


/////////////////////////////////////////////////////////////
// функции создания новых доков на основании данных ДД
/////////////////////////////////////////////////////////////

Функция СоздатьДокументПоступлениеТоваровУслуг(параметры, стВероятныеПоля, ЭДОбъект, ТабличнаяЧасть = Неопределено, СуммаВключаетНДС = Истина, видОперации, ЗаполнениеГТД = Ложь) Экспорт
	
	Если видОперации = "ВозвратОтПокупателя" Тогда 
		ДокОбъект = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
	ИначеЕсли видОперации = "ПоступлениеДопРасходов" Тогда
		ДокОбъект = Документы.ПоступлениеДопРасходов.СоздатьДокумент();
	Иначе 	
		ДокОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	КонецЕсли;
	
	ДокОбъектМетаданные = ДокОбъект.Метаданные(); 
	
	Если видОперации <> "ВозвратОтПокупателя" Тогда 
		ДокОбъект.ДатаВходящегоДокумента	= параметры.ДатаВходящегоДокумента;
		ДокОбъект.НомерВходящегоДокумента	= параметры.НомерВходящегоДокумента;
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") И ЗначениеЗаполнено(Параметры.Дата) Тогда
		ДокОбъект.Дата = Параметры.Дата;
	КонецЕсли;
		
	ДокОбъект.ДоговорКонтрагента = параметры.ДоговорКонтрагента;
	Если ЗначениеЗаполнено(ДокОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов) Тогда
		ДокОбъект.ВалютаДокумента = ДокОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	Иначе
		ДокОбъект.ВалютаДокумента = ПолучитьВалютуРегламентированногоУчета();
	КонецЕсли;
	ДокОбъект.КратностьВзаиморасчетов	= 1;
	ДокОбъект.КурсВзаиморасчетов 		= 1;
	
	//заполним склад и подразделение
	Склад = Неопределено;
	Если ЕстьРеквизитМетаданных(ДокОбъектМетаданные, "СкладОрдер") Тогда
		ДокОбъект.ВидПоступления = перечисления.ВидыПоступленияТоваров.НаСклад;
		Если ЗначениеЗаполнено(параметры.Склад) Тогда
			ДокОбъект.СкладОрдер = параметры.Склад;
		Иначе
			Попытка
				ДокОбъект.СкладОрдер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
			Исключение
			КонецПопытки;
		КонецЕсли;
		Склад = ДокОбъект.СкладОрдер;
	КонецЕсли;	
	
	Если ЕстьРеквизитМетаданных(ДокОбъектМетаданные, "Подразделение") Тогда 
		Если ЗначениеЗаполнено(параметры.Подразделение) Тогда
			ДокОбъект.Подразделение = параметры.Подразделение;
		Иначе
			Попытка
				ДокОбъект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделение");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	// Заполнение возможных полей
	Если стВероятныеПоля.Организация = Неопределено Тогда
		Сообщить("Организация в системе Диадок: """ + ЭДОбъект.Organization.Name + """, ИНН/КПП: " + ЭДОбъект.Organization.Inn + "/" + ЭДОбъект.Organization.Kpp + " не ассоциирована с организацией в 1С");
	Иначе
		ДокОбъект.Организация = стВероятныеПоля.Организация;
	КонецЕсли;
	Если стВероятныеПоля.Контрагент = Неопределено Тогда
		Сообщить("Контрагент в системе Диадок: """ + ЭДОбъект.counterAgent.Name + """, ИНН/КПП: " + ЭДОбъект.counterAgent.Inn + "/" + ЭДОбъект.counterAgent.Kpp + " не ассоциирован с контрагентом в 1С");
	Иначе
		ДокОбъект.Контрагент = стВероятныеПоля.Контрагент;
		
		//Заполним договор
		мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();
		ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокОбъект, мСтруктураПараметровДляПолученияДоговора);
	КонецЕсли;
	Если ВидОперации = "ПоступлениеДопРасходов"  Тогда
		ДокОбъект.Сумма 	= ?(СуммаВключаетНДС, ЭДОбъект.total, ЭДОбъект.total - ЭДОбъект.vat);
		ДокОбъект.СуммаНДС 	= ЭДОбъект.vat;
	Иначе
		
		Если ТабличнаяЧасть <> Неопределено Тогда
			
			ДатаПроверки = ?(ЗначениеЗаполнено(ДокОбъект.Дата), ДокОбъект.Дата, ТекущаяДата());
			ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ДатаПроверки);
			
			Для каждого СтрокаДанных Из ТабличнаяЧасть Цикл
				
				ЭтоТовар = СтрокаДанных.Тип = "Товар";
				
				Если ЭтоТовар Тогда
					
					СтрокаТЧ = ДокОбъект.Товары.Добавить();
					
					СтрокаТЧ.ЕдиницаИзмерения 	= СтрокаДанных.ЕдиницаИзмерения;
					СтрокаТЧ.Коэффициент		= СтрокаДанных.ЕдиницаИзмерения.Коэффициент;
					
					Если ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения) 
						И ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения.Коэффициент) Тогда
						
						СтрокаТЧ.Коэффициент = СтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
					КонецЕсли;
					
					Если ТабличнаяЧасть.Колонки.Найти("Серия") <> Неопределено Тогда
						СтрокаТЧ.СерияНоменклатуры = СтрокаДанных.Серия;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Склад)
						Или ЕстьРеквизитМетаданных(ДокОбъектМетаданные.ТабличныеЧасти.Товары, "Склад") Тогда
						
						СтрокаТЧ.Склад = Склад;
					КонецЕсли;
										
				Иначе
					
					СтрокаТЧ = ДокОбъект.Услуги.Добавить();
					
					СтрокаТЧ.Содержание	= СтрокаДанных.НоменклатураИзЭД;
					СтрокаТЧ.Номенклатура	= СтрокаДанных.Номенклатура;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтатьяЗатрат) Тогда
						СтрокаТЧ.СтатьяЗатрат = СтрокаТЧ.Номенклатура.СтатьяЗатрат;
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатурнаяГруппа) Тогда
						СтрокаТЧ.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппаЗатрат;
					КонецЕсли;
					
					Если ЕстьРеквизитМетаданных(ДокОбъектМетаданные, "Подразделение") Тогда 
						СтрокаТЧ.Подразделение = ДокОбъект.Подразделение;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТЧ.Номенклатура 	= СтрокаДанных.Номенклатура;
				СтрокаТЧ.Количество 	= СтрокаДанных.Количество;
				СтрокаТЧ.Цена		 	= СтрокаДанных.Цена;
				СтрокаТЧ.Сумма 			= СтрокаДанных.Сумма;
				СтрокаТЧ.СуммаНДС 		= СтрокаДанных.СуммаНДС;
				СтрокаТЧ.СтавкаНДС	 	= СтрокаДанных.СтавкаНДС;
				
				Если ЭтоТовар Тогда
					
					СтранаПроисхождения = СтрокаДанных.СтранаПроисхождения;
					
					Параметры = Новый Структура;
					Параметры.Вставить("ИспользуетсяУчетПрослеживаемыхТоваров",	ИспользуетсяУчетПрослеживаемыхТоваров);
					Параметры.Вставить("СтранаПроисхождения",					СтранаПроисхождения);
					Параметры.Вставить("ДокументОбъект",						ДокОбъект);
					Параметры.Вставить("СтрокаДанных",							СтрокаДанных);
					Параметры.Вставить("СтрокаТЧ",								СтрокаТЧ);
					Параметры.Вставить("ЗаполнятьСуммуПрослеживаемости",		Ложь);
					
					ЗаполнитьСведенияОПрослеживаемости(Параметры);
					ЗаполнитьСтрануПроисхождения(СтрокаТЧ, СтранаПроисхождения);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(ДокОбъектМетаданные, "ОтражатьВБухгалтерскомУчете") Тогда
		ДокОбъект.ОтражатьВБухгалтерскомУчете =	УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОтражатьДокументыВБухгалтерскомУчете");
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(ДокОбъектМетаданные, "ОтражатьВУправленческомУчете") Тогда
		ДокОбъект.ОтражатьВУправленческомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОтражатьДокументыВУправленческомУчете");
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(ДокОбъектМетаданные, "ОтражатьВНалоговомУчете") Тогда
		ДокОбъект.ОтражатьВНалоговомУчете =	УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОтражатьДокументыВНалоговомУчете");
	КонецЕсли;
	
	ДокОбъект.СуммаВключаетНДС	= СуммаВключаетНДС;
	ДокОбъект.УчитыватьНДС 		= Истина;
	
	Возврат ДокОбъект;
	
КонецФункции

Функция СоздатьДокументВозвратТоваровОтПокупателя(параметры, стВероятныеПоля, ЭДОбъект) Экспорт
	ДокОбъект = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
	//ДокОбъект.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
	
	ДокОбъект.КратностьВзаиморасчетов = 1;
	
	// Заполнение возможных полей
	Если стВероятныеПоля.Организация = Неопределено Тогда
		Сообщить("Организация в системе Диадок: """ + ЭДОбъект.Organization.Name + """, ИНН/КПП: " + ЭДОбъект.Organization.Inn + "/" + ЭДОбъект.Organization.Kpp + " не ассоциирована с организацией в 1С");
	Иначе
		ДокОбъект.Организация = стВероятныеПоля.Организация;
	КонецЕсли;
	Если стВероятныеПоля.Контрагент = Неопределено Тогда
		Сообщить("Контрагент в системе Диадок: """ + ЭДОбъект.counterAgent.Name + """, ИНН/КПП: " + ЭДОбъект.counterAgent.Inn + "/" + ЭДОбъект.counterAgent.Kpp + " не ассоциирован с контрагентом в 1С");
	Иначе
		ДокОбъект.Контрагент = стВероятныеПоля.Контрагент;
	КонецЕсли;
	
	мСписокВидовДоговоров = Новый СписокЗначений;
	мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	//Если ДокОбъект.ВидОперации <> Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Оборудование Тогда
	//мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	//КонецЕсли;
	СтруктураПараметровДляПолученияДоговора=	Новый Структура();
	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", мСписокВидовДоговоров);
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокОбъект, СтруктураПараметровДляПолученияДоговора);
	
	Возврат ДокОбъект;
КонецФункции

Процедура ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения) Экспорт
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения);
	
КонецПроцедуры

Функция СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения);
	
КонецФункции

Функция СоздатьДокумент_СчетФактураВыданный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СоздатьДокумент_СчетФактураВыданный(Document, ДокументОснование, ПараметрыЗаполнения);
	
КонецФункции

Процедура УстановитьДоговорВСчетеФактуреДляДиадокПР(СчетФактура) Экспорт
	мСписокВидовДоговоров = Новый СписокЗначений;
	Если ТипЗнч(СчетФактура) = тип("ДокументОбъект.СчетФактураПолученный") Тогда
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		Если СчетФактура.Метаданные().Реквизиты.Найти("ВидСчетаФактуры") <> Неопределено  Тогда
			СчетФактура.ВидСчетаФактуры = перечисления.ВидСчетаФактурыПолученного.НаПоступление;
		КонецЕсли;
	Иначе 
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		Если СчетФактура.Метаданные().Реквизиты.Найти("ВидСчетаФактуры") <> Неопределено  Тогда
			СчетФактура.ВидСчетаФактуры = перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
		КонецЕсли;
	КонецЕсли;	
	СтруктураПараметровДляПолученияДоговора = Новый Структура;
	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", мСписокВидовДоговоров);
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(СчетФактура, СтруктураПараметровДляПолученияДоговора);
	
КонецПроцедуры

Функция ПолучитьСписокВидовДоговоров(ВидОперации = Неопределено) Экспорт
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	
	Если ВидОперации = "ВозвратОтПокупателя" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	КонецЕсли;
	
	Возврат СписокВидовДоговоров;
КонецФункции

Функция ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, СписокВидовДоговоров) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, СписокВидовДоговоров);
	
КонецФункции

//} Прослеживаемость_Создание

//} Прослеживаемость


/////////////////////////////////////////////////////////////
// Связи объектов
/////////////////////////////////////////////////////////////

Функция ПолучитьСтавкуНДСДиадок(TaxRate) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСтавкуНДСДиадок(TaxRate);
	
КонецФункции

Функция ПолучитьЕдиницуИзмерения(Код, Наименование, Номенклатура) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.Ссылка,
	|	Классификатор.Наименование,
	|	Классификатор.Код
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК Классификатор
	|		ПО Т.ЕдиницаПоКлассификатору = Классификатор.Ссылка
	|ГДЕ
	|	Т.Владелец = &Номенклатура");
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса= Запрос.Выполнить();
	Запрос= Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка= РезультатЗапроса.Выбрать();
		РезультатЗапроса= Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Если СокрЛП(Выборка.Код) = Код ИЛИ СокрЛП(Выборка.Наименование) = Наименование Тогда 
				Возврат Выборка.Ссылка;
			КонецЕсли;	
		КонецЦикла;
		
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			КоэффициентПересчета= ОсновнойМодуль.ПолучитьКоэффициентПересчета(Код, Выборка.Код);
			Если ЗначениеЗаполнено(КоэффициентПересчета) Тогда 
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьКоэффициентПересчета(КодЕИ, НаименованиеЕИ, НоваяЕдиницаИзмерения) Экспорт 
	
	Если НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = КодЕИ ИЛИ НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование = НаименованиеЕИ Тогда 
		Возврат 1;
	КонецЕсли;	
	
	Коэф = ОсновнойМодуль.ПолучитьКоэффициентПересчета(КодЕИ, НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код);
	
	Возврат ?(Коэф = Неопределено, 1, Коэф);
	
КонецФункции
//{ Прослеживаемость_Создание

Процедура ЗаполнитьСведенияОПрослеживаемости(Параметры)

	СтрокаДанных = Параметры.СтрокаДанных;
	
	СведенияПрослеживаемости = СтрокаДанных.СведенияПрослеживаемости;
	
	Если Параметры.ИспользуетсяУчетПрослеживаемыхТоваров И ЗначениеЗаполнено(СведенияПрослеживаемости) Тогда
		
		ЗаполнитьСведенияОПрослеживаемостиДляСтрокиДокументаИБ_УПД(
			Параметры.ДокументОбъект.СведенияПрослеживаемости,
			СведенияПрослеживаемости,
			Параметры.СтрокаТЧ,
			Параметры.ЗаполнятьСуммуПрослеживаемости
		);
		
	ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.НомерГТД) Тогда
		
		СтранаПроисхождения = Параметры.СтранаПроисхождения;
		Если НЕ ЗначениеЗаполнено(СтранаПроисхождения)
			И ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаДанных, "КодСтраны") Тогда
			СтранаПроисхождения = НайтиСоздатьСтрануПроисхождения(СтрокаДанных.КодСтраны);
		КонецЕсли;
		
		ЗаполнитьСериюВСтрокеПоступленияТоваров(Параметры.СтрокаТЧ, СтрокаДанных.НомерГТД, СтранаПроисхождения);
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСтрануПроисхождения(СтрокаТовара, СтранаПроисхождения)
	
	// До релиза с прослеживаемостью такого реквизита в ТЧ Товары не было
	// и страна происхождения товара хранилась только в сериях.
	// Будем заполнять колонку только
	
	СтруктураСтраны = Новый Структура("СтранаПроисхождения", СтранаПроисхождения);
	ЗаполнитьЗначенияСвойств(СтрокаТовара, СтруктураСтраны);
	
КонецПроцедуры

Процедура ЗаполнитьСериюВСтрокеПоступленияТоваров(СтрокаТЧ, ГТД, СтранаПроисхождения)
	
	Номенклатура = СтрокаТЧ.Номенклатура;
	ВестиУчетПоСериям = (Номенклатура.ВестиУчетПоСериям = Истина);
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.СерияНоменклатуры)
		И ЗначениеЗаполнено(СтранаПроисхождения)
		И ЗначениеЗаполнено(ГТД)
		И ЗначениеЗаполнено(Номенклатура)
		И ВестиУчетПоСериям Тогда
		СтрокаТЧ.СерияНоменклатуры = ПолучитьСсылкуСерииНоменклатуры(Номенклатура, ГТД, СтранаПроисхождения, Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПоследнююКорректировкуПоступления(ПоследняяКорректировка) Экспорт
	
	Пока Истина Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Док.Ссылка ДокКорректировка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК Док
		|ГДЕ
		|	Док.ДокументПоступления = &ДокСсылка
		|	И Док.ВидОперации = &ВидОперации";
		Запрос.УстановитьПараметр("ДокСсылка", ПоследняяКорректировка);
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПоследняяКорректировка = Выборка.ДокКорректировка;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоследняяКорректировка;
	
КонецФункции

Функция получитьДокументОснованиеДляКорректировкиПоступления(Document) Экспорт 
	Если Document.type =  "InvoiceRevision" Тогда 
		запрос = Новый запрос;
		запрос.Текст = "ВЫБРАТЬ
		|	СчетФактураПолученныйДокументыОснования.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И СчетФактураПолученныйДокументыОснования.Ссылка.Исправление = Ложь";
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalDocumentNumber);		
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalDocumentdate));		
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Док =  результат.ДокументОснование;
			Возврат 	ПолучитьПоследнююКорректировкуПоступления(Док); 
		Иначе 
			Возврат Неопределено 
		КонецЕсли;	
	ИначеЕсли Document.type = "InvoiceCorrection"  Тогда 
		запрос = Новый Запрос;
		Если ЗначениеЗаполнено(Document.OriginalInvoicerevisionNumber) = Ложь Тогда 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетФактураПолученныйДокументыОснования.ДокументОснование
			|ИЗ
			|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|ГДЕ
			|	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
			|	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента
			|	И (СчетФактураПолученныйДокументыОснования.Ссылка.Исправление = Ложь)";
		Иначе 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетФактураПолученныйДокументыОснования.ДокументОснование,
			|	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаИсправления,
			|	СчетФактураПолученныйДокументыОснования.Ссылка.Исправление,
			|	СчетФактураПолученныйДокументыОснования.Ссылка.НомерИсправления
			|ИЗ
			|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|ГДЕ
			|	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
			|	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента
			|	И СчетФактураПолученныйДокументыОснования.Ссылка.Исправление
			|	И СчетФактураПолученныйДокументыОснования.Ссылка.ДатаИсправления = &ДатаИсправления
			|	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерИсправления = &НомерИсправления";
			Запрос.УстановитьПараметр("НомерИсправления", число(Document.OriginalInvoicerevisionNumber));		
			Запрос.УстановитьПараметр("ДатаИсправления", НачалоДня(Document.OriginalInvoicerevisionDate));		
		КонецЕсли;				
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalDocumentNumber);		
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalDocumentdate));
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Возврат результат.ДокументОснование;
		Иначе 
			Возврат Неопределено
		КонецЕсли;
	ИначеЕсли Document.type = "InvoiceCorrectionRevision"  Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СчетФактураПолученныйДокументыОснования.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента";
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalInvoiceCorrectionDate));
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalInvoiceCorrectionNumber);
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Возврат результат.ДокументОснование;
		Иначе 
			Возврат Неопределено
		КонецЕсли;
	Иначе 
		Возврат Неопределено
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьСуммуПрописьюДиадок(Total, ВалютаДокумента) Экспорт 
	Возврат ОбщегоНазначения.СформироватьСуммуПрописью(Total, ВалютаДокумента);
КонецФункции	

Функция ДобавитьРазделитель(Стр, Префикс = "") 
	Возврат ?(ЗначениеЗаполнено(стр), Префикс + сокрЛП(Стр) + ", ", "");
КонецФункции

Функция ОтрезатьПравуюЗапятую(стр)
	результат = сокрЛП(стр);
	Пока Прав(результат, 1) = "," Цикл 
		Результат = Лев(результат, СтрДлина(результат) - 1);
	КонецЦикла;	
	
	Возврат результат;
КонецФункции

Функция ПолучитьПредставлениеКонтрагентаДляАкта(Контрагент, ДатаОперации) Экспорт
	СведенияОбОрганизации = ПолучитьСведенияОбОрганизации(Контрагент, ДатаОперации);
	Возврат ОтрезатьПравуюЗапятую(ДобавитьРазделитель(СведенияОбОрганизации.ПолноеНаименование) + ДобавитьРазделитель(СведенияОбОрганизации.ИНН, "ИНН: ") + ДобавитьРазделитель(СведенияОбОрганизации.КПП, "КПП: "));
КонецФункции

Функция ЕстьВозможностьЗаполненияГТД(Видоперации, ЭДОбъект) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЕстьВозможностьЗаполненияГТД(Видоперации, ЭДОбъект);	
КонецФункции

Функция ЕстьВозможностьЗаполненияСерий(Видоперации, ЭДОбъект) Экспорт
	
	Результат = МенеджерИнтеграции().ЕстьВозможностьЗаполненияСерий(Видоперации, ЭДОбъект);
	
	Возврат Результат;
	
КонецФункции

//{ Прослеживаемость

// Возвращает признак применения Федерального Закона 
// который вводит понятие прослеживаемости для определенных групп товаров
// Параметры
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ применяется
//           Ложь   - ФЗ не применяется
Функция ИспользуетсяУчетПрослеживаемыхТоваров(Дата) Экспорт
		
	Результат = Ложь;
	
	ЕстьПрослеживаемостьВКонфигурации = КонфигурацияСПрослеживаемостью();
	Если ЕстьПрослеживаемостьВКонфигурации Тогда
		
		Если ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров") Тогда
		
			ДатаНачалаУчета = ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров();
			Если Дата > ДатаНачалаУчета Тогда
				Результат = Истина;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции 

Функция КонфигурацияСПрослеживаемостью()

	Результат = ОсновнойМодуль.СуществуетОбъектМетаданных("Константа.ВестиУчетПрослеживаемыхТоваров")
	            И ОсновнойМодуль.СуществуетОбъектМетаданных("Константа.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров")
				И ОсновнойМодуль.СуществуетОбъектМетаданных("ФункциональнаяОпция.ВестиУчетПрослеживаемыхТоваров");
	
	Возврат Результат;

КонецФункции

Функция ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров()
	
	Результат = Константы.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров.Получить();
	
	Возврат Результат;
	
КонецФункции

// Заполняет колонки "ДанныеПрослеживаемости" и "ПрослеживаемыйТовар" в строках таблицы товаров
// если колонок нет, то они добавляются
// Параметры:
// ТаблицаТоваров - ТаблицаЗначений - в данном параметре передается
// СсылкаНаОбъект - ДокументСсылка.РеализацияТоваровУслуг,
//					 ДокументСсылка.КорректировкаРеализации - владелец таблицы товаров
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправки(ТаблицаТоваров, СсылкаНаОбъект) Экспорт
	
	Если ИспользуетсяУчетПрослеживаемыхТоваров(СсылкаНаОбъект.Дата) Тогда
		
		Если ТаблицаТоваров.Колонки.Найти("ДанныеПрослеживаемости") = Неопределено Тогда
			ТаблицаТоваров.Колонки.Добавить("ДанныеПрослеживаемости");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("ПрослеживаемыйТовар") = Неопределено Тогда
			ТаблицаТоваров.Колонки.Добавить("ПрослеживаемыйТовар");
		КонецЕсли;
		
		Если ЭтоРТУ_ДД(СсылкаНаОбъект)
			ИЛИ ЭтоКорректировкаИсправление(СсылкаНаОбъект) Тогда
			
			ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(ТаблицаТоваров, СсылкаНаОбъект);
			
		ИначеЕсли ЭтоКорректировкаРеализации(СсылкаНаОбъект) Тогда
			
			ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(ТаблицаТоваров, СсылкаНаОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


//{ СвязиМеждуДокументами

Функция НайтиПодходящийСчетФактуруИзРНК(МассивСсылокРНК) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").НайтиПодходящийСчетФактуруИзРНК(МассивСсылокРНК);
	
КонецФункции

Функция ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект);
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект);
	
КонецФункции

Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СсылкаНаОбъект) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьМассивСсылокРТУПоСчетуНаОплату(СсылкаНаОбъект);
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект);
	
КонецФункции

Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьИсправляемыйДокументРеализации(ДокРеализации);
	
КонецФункции

Функция СФПоМассивуДокументовОснованийИдентичны(МассивСсылок) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СФПоМассивуДокументовОснованийИдентичны(МассивСсылок);
	
КонецФункции

//} СвязиМеждуДокументами

//{ Приглашение Контрагентов

Функция ЕстьНовыеКонтрагентыДляПриглашения(МассивОрганизаций1С, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусКонтрагентаНеПодходит
	|ГДЕ
	|	СтатусКонтрагентаНеПодходит.Объект В(&МассивОрганизаций1С)
	|	И СтатусКонтрагентаНеПодходит.Свойство = &ПриглашенияДатаСтатусНеПодходит
	|	И ТИПЗНАЧЕНИЯ(СтатусКонтрагентаНеПодходит.Значение) = ТИП(ДАТА)
	|	И СтатусКонтрагентаНеПодходит.Значение > &ПериодАнализаДокументов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И Т.ОтражатьВБухгалтерскомУчете
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И Т.ОтражатьВБухгалтерскомУчете
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL ");
	
	Запрос.УстановитьПараметр("МассивОрганизаций1С"			   , МассивОрганизаций1С);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"		   , ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"  					   , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ПриглашенияДатаСтатусНеПодходит", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДиадокПриглашенияДатаСтатусНеПодходит"));

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ТаблицаКонтрагентовДляПриглашения(BoxID, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	ЯщикиОрганизаций.Значение КАК BoxID
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиОрганизаций
	|		ПО Организации.Ссылка = ЯщикиОрганизаций.Объект
	|			И (ЯщикиОрганизаций.Свойство = &ЯщикДиадокДляОрганизации)
	|			И (ЯщикиОрганизаций.Значение В (&BoxID))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.BoxID,
	|	ВложенныйЗапрос.Контрагент,
	|	СУММА(ВложенныйЗапрос.КоличествоДокументов) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ_СтатистикаДокументов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Организации.BoxID КАК BoxID,
	|		Т.Контрагент КАК Контрагент,
	|		1 КАК КоличествоДокументов
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Организации.BoxID,
	|		Т.Контрагент,
	|		1
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.BoxID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Организации.BoxID,
	|	ВТ_Организации.ИНН
	|ПОМЕСТИТЬ ВТ_BoxID
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент1С,
	|	Контрагенты.Код КАК Контрагент1С_Код,
	|	Контрагенты.ИНН КАК Контрагент1С_ИНН,
	|	Контрагенты.КПП КАК Контрагент1С_КПП,
	|	ЕСТЬNULL(ЯщикиКонтрагентов.Значение, """") КАК КонтрагентЭДО_ID,
	|	ЕСТЬNULL(ВТ_СтатистикаДокументов.КоличествоДокументов, 0) КАК КоличествоДокументов,
	|	ВТ_BoxID.BoxID КАК ОрганизацияЭДО_ID,
	|	ВЫБОР
	|		КОГДА ЯщикиКонтрагентов.Значение ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Сопоставлен
	|ИЗ
	|	ВТ_BoxID КАК ВТ_BoxID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_BoxID.ИНН <> Контрагенты.ИНН
	|			И (НЕ Контрагенты.ЭтоГруппа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатистикаДокументов КАК ВТ_СтатистикаДокументов
	|		ПО ВТ_BoxID.BoxID = ВТ_СтатистикаДокументов.BoxID
	|			И (Контрагенты.Ссылка = ВТ_СтатистикаДокументов.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО (Контрагенты.Ссылка = ЯщикиКонтрагентов.Объект)
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)");
	
	Запрос.УстановитьПараметр("BoxID"					, BoxID);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"	, ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"				, ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ЯщикДиадокДляОрганизации", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ЯщикДиадокДляОрганизации"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//{ Приглашение Контрагентов

//{ Внешние обработки

Функция ВнешняяОбработкаПоGUID(GUID) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВнешняяОбработкаПоGUID(GUID);
	
КонецФункции

//} Внешние обработки

//{ ИдентификацияДокументов

Функция ЭтоЗаказПокупателя(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоЗаказПокупателя(ДокументСсылка);
	
КонецФункции	

Функция ЭтоКорректировкаРеализации(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКорректировкаРеализации(ДокументСсылка);
	
КонецФункции

Функция ЭтоКорректировкаИсправление(ДокументСсылка) Экспорт
	
	Результат = ЭтоКорректировкаРеализации(ДокументСсылка)
		И ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКСФ(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКСФ(ДокументСсылка);
	
КонецФункции

Функция ЭтоРТУ_ДД(ДокументСсылка) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоРТУ_ДД(ДокументСсылка);
	
КонецФункции 

Функция ЭтоСФ(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФ(ДокументСсылка);
	
КонецФункции	

Функция ЭтоСФПолученный(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФПолученный(ДокументСсылка);
	
КонецФункции	

Функция ЭтоСчетНаОплату(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСчетНаОплату(ДокументСсылка);
	
КонецФункции	

//} ИдентификацияДокументов

//{ ОтправкаДокументов

Функция ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент);
	
КонецФункции	

Процедура УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок);
	
КонецПроцедуры

//} ОтправкаДокументов

//{ ПолучениеДанныхДляФУФ

Функция ГрузополучательПоДокументу(ДокументСсылка) Экспорт 
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ГрузополучательПоДокументу(ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция КонтрагентПоДокументу(ДокументСсылка) Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").КонтрагентПоДокументу(ДокументСсылка);
					
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоговорПоДокументу(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДоговорПоДокументу(ДокументСсылка);
	
КонецФункции	

Функция ПолучитьСуммуДокумента(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуДокумента(ДокументСсылка);
	
КонецФункции	

Функция ПолучитьСуммуНДС(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуНДС(ДокументСсылка);
	
КонецФункции	

//} ПолучениеДанныхДляФУФ

//{ СвязиМеждуДокументами

Функция ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент);
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка);
	
КонецФункции

Функция ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента);
	
КонецФункции

//} СвязиМеждуДокументами

Функция ТекстЗапросаПодборНакладных(Direction) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборНакладных(Direction);
	
КонецФункции

Функция ТекстЗапросаПодборСчетовФактур(Direction) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборСчетовФактур(Direction);
	
КонецФункции

Процедура УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры	

//{Внешние печатные формы

Функция ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ);
	
КонецФункции

Функция ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции);
	
КонецФункции

Функция ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ);
	
КонецФункции

Функция ВПФ_ДополнительныеПараметры(ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_ДополнительныеПараметры(ИдентификаторВПФ);
	
КонецФункции

Функция ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ);
	
КонецФункции

//}Внешние печатные формы

//{Обертки

Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь)
	
	Результат = ОсновнойМодуль.ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты)
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

//}Обертки

// Устаревшие

//Устарел в релизе 5.30.01. Необходимо использовать метод "ГрузополучательПоДокументу"
Функция ПолучитьГрузополучателяПоДокументу(ДокументСсылка) Экспорт 
	
	Результат = ГрузополучательПоДокументу(ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции

// Заполняет колонки "ДанныеПрослеживаемости" и "ПрослеживаемыйТовар" в строках таблицы товаров
// 
// Параметры:
// ТаблицаТоваров - ТаблицаЗначений - в данном параметре передается
// СсылкаНаОбъект - ДокументСсылка.РеализацияТоваровУслуг - владелец таблицы товаров
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(ТаблицаТоваров, СсылкаНаОбъект)
	
	СтрокиТоваров			 = ТаблицаТоваров.НайтиСтроки(Новый Структура("ЭтоУслуга", Ложь)); 
	ИдентификаторыСтрок		 = ОсновнойМодуль.ВыгрузитьКолонку(СтрокиТоваров, "ИдентификаторСтроки");
	ОсновнойМодуль.УдалитьВсеВхожденияЗначенияИзМассива(ИдентификаторыСтрок, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяЕИ"				 , Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка"					 , СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИдентификаторыСтрок"		 , ИдентификаторыСтрок);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТТаблицаПрослеживаемостиОснования
	|ИЗ
	|	&ИмяМетаданныхТаблицыПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка
	|	И СведенияПрослеживаемости.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НомераГТД.Код, """") КАК НомерГТДРегистрационныйНомер,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПоРНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТСведенияПрослеживаемостиБезИЕ
	|ИЗ
	|	&ИмяМетаданныхТаблицыТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаПрослеживаемостиОснования КАК СведенияПрослеживаемости
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|			ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
	|		ПО ТаблицаТоваров.Ссылка = СведенияПрослеживаемости.Ссылка
	|			И ТаблицаТоваров.ИдентификаторСтроки = СведенияПрослеживаемости.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|	И ТаблицаТоваров.ИдентификаторСтроки <> """"
	|	И ТаблицаТоваров.ПрослеживаемыйТовар = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерГТДРегистрационныйНомер КАК НомерГТДРегистрационныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, &ПустаяЕИ) = &ПустаяЕИ
	|			ТОГДА """"
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияПрослеживаемости,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, &ПустаяЕИ) = &ПустаяЕИ
	|			ТОГДА """"
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Код
	|	КОНЕЦ КАК КодЕдиницыИзмеренияПрослеживаемости,
	|	ТаблицаТоваров.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТСведенияПрослеживаемостиБезИЕ КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|				ПО КлассификаторТНВЭД.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|			ПО СправочникНоменклатура.КодТНВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО ТаблицаТоваров.Номенклатура = СправочникНоменклатура.Ссылка";
	
	ИмяДокумента = СсылкаНаОбъект.Метаданные().Имя;
	ИмяМетаданныхТаблицыТоваров = СтрЗаменить("Документ.%ИмяДокумента%.Товары", "%ИмяДокумента%", ИмяДокумента);
	ИмяМетаданныхТаблицыПрослеживаемости = СтрЗаменить("Документ.%ИмяДокумента%.СведенияПрослеживаемости", "%ИмяДокумента%", ИмяДокумента);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхТаблицыТоваров"				, ИмяМетаданныхТаблицыТоваров);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхТаблицыПрослеживаемости"	, ИмяМетаданныхТаблицыПрослеживаемости);
	
	СведенияПрослеживаемости = Запрос.Выполнить().Выгрузить();
	СведенияПрослеживаемости.Индексы.Добавить("ИдентификаторСтроки");
	
	Для Каждого СтрокаТЧ Из СтрокиТоваров Цикл
		
		СтрокиПрослеживаемости = СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки));
		
		Если СтрокиПрослеживаемости.Количество() > 0 Тогда
		
			СтрокаТЧ.ДанныеПрослеживаемости	 = Новый Массив;
			СтрокаТЧ.ПрослеживаемыйТовар	 = Истина;
			
			Для каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
				
				ЭлементПрослеживаемости = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").НовыеСвойстваЭлементаПрослеживаемости();
				ЗаполнитьЗначенияСвойств(ЭлементПрослеживаемости, СтрокаПрослеживаемости);
				СтрокаТЧ.ДанныеПрослеживаемости.Добавить(ЭлементПрослеживаемости);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонки "ДанныеПрослеживаемости" и "ПрослеживаемыйТовар" в строках таблицы товаров
// 
// Параметры:
// ТаблицаТоваров - ТаблицаЗначений - в данном параметре передается
// СсылкаНаОбъект - ДокументСсылка.КорректировкаРеализации - владелец таблицы товаров
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(ТаблицаТоваров, СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.ИдентификаторСтроки,
	|	МАКСИМУМ(Товары.КодТНВЭД.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ЕдиницыИзмерения
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СУММА(СведенияПрослеживаемости.Количество) КАК Количество,
	|	СУММА(СведенияПрослеживаемости.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.Ссылка.ДокументРеализации КАК ДокументОснование,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка
	|	И СведенияПрослеживаемости.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияПрослеживаемости.РНПТ,
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.Ссылка.ДокументРеализации,
	|	СведенияПрослеживаемости.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СУММА(СведенияПрослеживаемости.Количество) КАК Количество,
	|	СУММА(СведенияПрослеживаемости.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ДанныеОснований
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.РНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.РНПТ,
	|	СУММА(СведенияПрослеживаемости.Количество),
	|	СУММА(СведенияПрослеживаемости.КоличествоПрослеживаемости),
	|	СведенияПрослеживаемости.ИдентификаторСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.РНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаДокумента.РНПТ, ДанныеОснований.РНПТ) КАК НомерГТДРегистрационныйНомер,
	|	ЕСТЬNULL(ТаблицаДокумента.Количество, 0) КАК КоличествоПослеИзменения,
	|	ЕСТЬNULL(ДанныеОснований.Количество, 0) КАК КоличествоДоИзменения,
	|	ЕСТЬNULL(ТаблицаДокумента.ИдентификаторСтроки, ДанныеОснований.ИдентификаторСтроки) КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеОснований КАК ДанныеОснований
	|		ПО ТаблицаДокумента.РНПТ = ДанныеОснований.РНПТ
	|			И ТаблицаДокумента.ДокументОснование = ДанныеОснований.Ссылка
	|			И ТаблицаДокумента.ИдентификаторСтроки = ДанныеОснований.ИдентификаторСтроки
	|ИТОГИ
	|	СУММА(КоличествоПослеИзменения),
	|	СУММА(КоличествоДоИзменения)
	|ПО
	|	ИдентификаторСтроки,
	|	НомерГТДРегистрационныйНомер";

	СтрокиТоваров			 = ТаблицаТоваров.НайтиСтроки(Новый Структура("ЭтоУслуга", Ложь)); 
	ИдентификаторыСтрок		 = ОсновнойМодуль.ВыгрузитьКолонку(СтрокиТоваров, "ИдентификаторСтроки");
	Запрос.УстановитьПараметр("Ссылка"				 , СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИдентификаторыСтрок"	 , ИдентификаторыСтрок);
	Запрос.УстановитьПараметр("ДокументОснование"	 , СсылкаНаОбъект.ДокументРеализации);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИдентификаторСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификаторСтроки.Следующий() Цикл
		
		СтрокаТовара = ТаблицаТоваров.Найти(ВыборкаИдентификаторСтроки.ИдентификаторСтроки, "ИдентификаторСтроки");
		
		Если СтрокаТовара = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовара.ДанныеПрослеживаемости		 = Новый Массив;
		СтрокаТовара.ПрослеживаемыйТовар		 = Истина;
		
		ВыборкаРегистрационныйНомер = ВыборкаИдентификаторСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаРегистрационныйНомер.Следующий() Цикл

			СтрокаПрослеживаемости =  ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке();
			ЗаполнитьЗначенияСвойств(СтрокаПрослеживаемости, ВыборкаРегистрационныйНомер);
			СтрокаПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости = СтрокаТовара.КодЕдиницыИзмерения;
			
			ЭтоУменьшение = СтрокаПрослеживаемости.КоличествоДоИзменения > СтрокаПрослеживаемости.КоличествоПослеИзменения; 
			Если ЭтоУменьшение Тогда
				КоличествоУменьшение = СтрокаПрослеживаемости.КоличествоДоИзменения - СтрокаПрослеживаемости.КоличествоПослеИзменения;
				СтрокаПрослеживаемости.КоличествоУменьшение = КоличествоУменьшение;
			КонецЕсли; 
			
			ЭтоУвеличение = СтрокаПрослеживаемости.КоличествоПослеИзменения > СтрокаПрослеживаемости.КоличествоДоИзменения;
			Если ЭтоУвеличение Тогда
				КоличествоУвеличение = СтрокаПрослеживаемости.КоличествоПослеИзменения - СтрокаПрослеживаемости.КоличествоДоИзменения;
				СтрокаПрослеживаемости.КоличествоУвеличение = КоличествоУвеличение;
			КонецЕсли; 
			
			СтрокаТовара.ДанныеПрослеживаемости.Добавить(СтрокаПрослеживаемости);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет СведенияОПрослеживаемости документа по данным строки товара электронного документа
//
// Параметры
//  Приемник				- ТабличнаяЧасть		- таблица СведенияОПрослеживаемости документа 1С
//  Источник				- Массив				- массив элементов СведПрослеж
//  СтрокаТовара			- СтрокаТабличнойЧасти 	- строка товара документа
//  ЗаполнятьСумму			- Булево				- признак необходимости заполнения суммы в сведениях прослеживаемости
//
Процедура ЗаполнитьСведенияОПрослеживаемостиДляСтрокиДокументаИБ_УПД(Приемник, Источник, СтрокаТовара, ЗаполнятьСумму)
	
	СтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрокаТовара.ПрослеживаемыйТовар = Истина;
	
	СведенияПрослеживаемостиИБ = Приемник.ВыгрузитьКолонки();
	
	ЕстьПолеСуммы = (СведенияПрослеживаемостиИБ.Колонки.Найти("Сумма") <> Неопределено);
	
	Для Каждого СтрокаПрослеживаемости Из Источник Цикл
		
		НомерТовара = СтрокаПрослеживаемости.НомТовПрослеж;
		
		НоваяСтрока = СведенияПрослеживаемостиИБ.Добавить();
		НоваяСтрока.ИдентификаторСтроки = СтрокаТовара.ИдентификаторСтроки;
		НоваяСтрока.РНПТ = НайтиСоздатьРНПТ(НомерТовара);
		НоваяСтрока.КоличествоПрослеживаемости = СтрокаПрослеживаемости.КолВЕдПрослеж;
		НоваяСтрока.Количество = Неопределено;
		
		Если ЕстьПолеСуммы И ЗаполнятьСумму Тогда
			НоваяСтрока.Сумма = СтрокаПрослеживаемости.СтТовБезНДСПрослеж;
		КонецЕсли;
		
	КонецЦикла;
	
	ПроизвестиРасчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемостиИБ, СтрокаТовара.Количество);
	
	ОсновнойМодуль.ДополнитьТаблицу(Приемник, СведенияПрослеживаемостиИБ);
	
КонецПроцедуры

// Заполняет СведенияОПрослеживаемости документа по данным строки товара электронного документа
//
// Параметры
//  Приемник				- ТабличнаяЧасть		- таблица СведенияОПрослеживаемости документа 1С
//  Источник				- Массив				- массив элементов СведПрослеж
//  Товары 					- ТаблицаЗначений	 	- таблица товаров документа
//
Процедура ЗаполнитьСведенияОПрослеживаемостиДляДокументаИБ_УКД(Приемник, Источник, Товары)

	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Приемник.ВыгрузитьКолонки();
	
	СведПрослежИБ = Приемник.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СведПрослежИБ", СведПрослежИБ);
	Запрос.УстановитьПараметр("СведПрослежЭД", Источник);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ КАК РНПТ,
		|	СведПрослежИБ.Количество КАК Количество,
		|	СведПрослежИБ.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ СведПрослежИБ
		|ИЗ
		|	&СведПрослежИБ КАК СведПрослежИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежЭД.КоличествоУвеличение КАК КоличествоУвеличение,
		|	СведПрослежЭД.КоличествоУменьшение КАК КоличествоУменьшение,
		|	СведПрослежЭД.РНПТ КАК РНПТ,
		|	СведПрослежЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ СведПрослежЭД
		|ИЗ
		|	&СведПрослежЭД КАК СведПрослежЭД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ КАК РНПТ,
		|	СведПрослежИБ.КоличествоПрослеживаемости - СведПрослежЭД.КоличествоУменьшение + СведПрослежЭД.КоличествоУвеличение КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ СкорректированныеСтрокиПоДаннымЭД
		|ИЗ
		|	СведПрослежИБ КАК СведПрослежИБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СведПрослежЭД КАК СведПрослежЭД
		|		ПО СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки
		|			И СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ,
		|	СведПрослежИБ.КоличествоПрослеживаемости
		|ИЗ
		|	СведПрослежИБ КАК СведПрослежИБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведПрослежЭД КАК СведПрослежЭД
		|		ПО СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки
		|			И СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ
		|ГДЕ
		|	СведПрослежЭД.ИдентификаторСтроки ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежЭД.РНПТ КАК РНПТ,
		|	СведПрослежЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ НовыеСтрокиПоДаннымЭД
		|ИЗ
		|	СведПрослежЭД КАК СведПрослежЭД
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведПрослежИБ КАК СведПрослежИБ
		|		ПО (СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки)
		|			И (СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ)
		|ГДЕ
		|	СведПрослежИБ.РНПТ ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СкорректированныеСтрокиПоДаннымЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СкорректированныеСтрокиПоДаннымЭД.РНПТ КАК РНПТ,
		|	0 КАК Количество,
		|	СкорректированныеСтрокиПоДаннымЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ИЗ
		|	СкорректированныеСтрокиПоДаннымЭД КАК СкорректированныеСтрокиПоДаннымЭД
		|ГДЕ
		|	СкорректированныеСтрокиПоДаннымЭД.КоличествоПрослеживаемости <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НовыеСтрокиПоДаннымЭД.ИдентификаторСтроки,
		|	НовыеСтрокиПоДаннымЭД.РНПТ,
		|	0,
		|	НовыеСтрокиПоДаннымЭД.КоличествоПрослеживаемости
		|ИЗ
		|	НовыеСтрокиПоДаннымЭД КАК НовыеСтрокиПоДаннымЭД
		|ИТОГИ ПО
		|	ИдентификаторСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИдентификаторСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификаторСтроки.Следующий() Цикл
		
		СведенияПрослеживаемости = Результат.СкопироватьКолонки();
		
		Выборка = ВыборкаИдентификаторСтроки.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СведенияПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
		СтрокиТоваров = Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаИдентификаторСтроки.ИдентификаторСтроки));
		Для каждого СтрокаТовара Из СтрокиТоваров Цикл
			СтрокаТовара.ПрослеживаемыйТовар = Истина;
		КонецЦикла;
		
		ПроизвестиРасчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, СтрокиТоваров[0].Количество);
		ОсновнойМодуль.ДополнитьТаблицу(Результат, СведенияПрослеживаемости);
		
	КонецЦикла;
	
	Приемник.Загрузить(Результат);
	
КонецПроцедуры

Процедура ПроизвестиРасчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, КоличествоТовара)
	
	// Обрабатываем по аналогии с типовой БП.
	// Возможные варианты:
	
	// 1. Учетное количество было заполнено из данных электронного документа. Рассчитывать не нужно.
	// Данный сценарий на текущий момент не поддерживается.
	Если СведенияПрослеживаемости.Итог("Количество") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоКоличествоПрослеживаемости = СведенияПрослеживаемости.Итог("КоличествоПрослеживаемости");
	
	// 2. Если общее количество прослеживаемости совпадает с количеством товара, то предполагаем, что единица измерения прослеживаемости совпадает
	// с учетной единицей измерения. В этом случае количество учетное приравниваем количеству прослеживаемости.
	Если ВсегоКоличествоПрослеживаемости = КоличествоТовара Тогда
		Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
			ЭлементКоллекции.Количество = ЭлементКоллекции.КоличествоПрослеживаемости;
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	// 3. Требуется произвести пропорциональное распределение
	СведенияПрослеживаемости.Колонки.Добавить("Порядок");
	
	Порядок = 0;
	Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
		Порядок = Порядок + 1;
		ЭлементКоллекции.Порядок = Порядок;
	КонецЦикла;
	
	СведенияПрослеживаемости.Сортировать("КоличествоПрослеживаемости");
	Распределено = 0;
	Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
		Если СведенияПрослеживаемости.Индекс(ЭлементКоллекции) + 1 = СведенияПрослеживаемости.Количество() Тогда
			ЭлементКоллекции.Количество = КоличествоТовара - Распределено;
		Иначе 
			ЭлементКоллекции.Количество = ?(ВсегоКоличествоПрослеживаемости = 0, 0,
				ЭлементКоллекции.КоличествоПрослеживаемости * КоличествоТовара / ВсегоКоличествоПрослеживаемости);
			Распределено = Распределено + ЭлементКоллекции.Количество;
		КонецЕсли;
	КонецЦикла;
	
	СведенияПрослеживаемости.Сортировать("Порядок");
		
КонецПроцедуры

Функция НайтиСоздатьРНПТ(РегистрационныйНомер)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		
		Результат = НайтиСсылкуНаОбъектПоРеквизиту(Метаданные.Справочники.НомераГТД, "РегистрационныйНомер", РегистрационныйНомер);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = НайтиСсылкуНаОбъектПоРеквизиту(Метаданные.Справочники.НомераГТД, "Код", РегистрационныйНомер);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			НовыйРНПТ = Справочники.НомераГТД.СоздатьЭлемент();
			НовыйРНПТ.Код = РегистрационныйНомер;
			НовыйРНПТ.РегистрационныйНомер = РегистрационныйНомер;
			НовыйРНПТ.Записать();
			Результат = НовыйРНПТ.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция НайтиСсылкуНаОбъектПоРеквизиту(ОбъектМетаданных, ИмяРеквизита, ЗначРеквизита)
	
	Результат = МенеджерИнтеграции().НайтиСсылкуНаОбъектПоРеквизиту(ОбъектМетаданных, ИмяРеквизита, ЗначРеквизита);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьВидКорректировки(ДокументОбъект)
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	
КонецПроцедуры

//} СлужебныеПроцедурыИФункции

//{ ТЕЛО МОДУЛЯ

Функция МенеджерИнтеграции()
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика");
	
	Возврат Результат;
	
КонецФункции

Процедура ПересчетВалюты_ПоПараметрам(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки, Пересчет = Истина)
	
	ДокументОбъект = ТекущееОснование.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	УниверсальныеМеханизмы.ОпределитьКурсыДокументаДляПечати(ДокументОбъект, Запрос);
	
	Курс      = Запрос.Параметры.Курс;
	Кратность = Запрос.Параметры.Кратность;
	
	ПересчетВалюты_ПоКурсуДокумента(ТабличнаяЧасть, Курс, Кратность);
	
	Если Пересчет Тогда
		
		ПараметрыПересчета = УчетНДС.СтруктураПараметровДляПересчетаСуммВРубли();
		ПараметрыПересчета.СуммаАвансаВалИт     = Запрос.Параметры.СуммаАвансаВал;
		ПараметрыПересчета.СуммаАвансаРубИт     = Запрос.Параметры.СуммаАвансаРуб;
		ПараметрыПересчета.СуммаРеализацииВалИт = УчетНДС.ПолучитьСуммуДокументаСНДС(ТекущееОснование);
		ПараметрыПересчета.ВалютаВзаиморасчетов = ТекущееОснование.ВалютаДокумента;
		ПараметрыПересчета.КурсРеализации       = ЗаполнениеДокументов.КурсДокумента(ТекущееОснование, ПолучитьВалютуРегламентированногоУчета());
		ПараметрыПересчета.КратностьРеализации  = ЗаполнениеДокументов.КратностьДокумента(ТекущееОснование, ПолучитьВалютуРегламентированногоУчета());
		ПараметрыПересчета.СуммаВключаетНДС     = ДанныеШапки.СуммаВключаетНДС;
		ПараметрыПересчета.ЦенаВключаетНДС      = Ложь;
		ПараметрыПересчета.ДатаПересчета        = ДанныеШапки.Дата;
		УчетНДС.ПерезаполнитьСуммыПоУЕвРублях(ТабличнаяЧасть, ПараметрыПересчета);
		
	КонецЕсли;
	
	ПересчетВалюты_Округление(ТабличнаяЧасть, ДанныеШапки);	
	
КонецПроцедуры

Процедура ПересчетВалюты_Округление(ТабличнаяЧасть, ДанныеШапки)
	
	Если ДанныеШапки.Свойство("СуммаДокумента") Тогда 
		СуммаДокумента = ТабличнаяЧасть.Итог("Сумма") + ?(ДанныеШапки.СуммаВключаетНДС, 0, ТабличнаяЧасть.Итог("СуммаНДС"));
		ДанныеШапки.СуммаДокумента = Окр(СуммаДокумента, 2);
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("СуммаНДСДокумента") Тогда 
		СуммаНДСДокумента = ТабличнаяЧасть.Итог("СуммаНДС");
		ДанныеШапки.СуммаНДСДокумента = Окр(СуммаНДСДокумента, 2);
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("СуммаБезНДСДокумента") Тогда
		СуммаБезНДСДокумента = ДанныеШапки.СуммаДокумента - ДанныеШапки.СуммаНДСДокумента;
		ДанныеШапки.СуммаБезНДСДокумента = Окр(СуммаБезНДСДокумента, 2);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТабличнаяЧасть Цикл
		ТекСтрока.Сумма = Окр(ТекСтрока.Сумма, 2);
		ТекСтрока.СуммаНДС = Окр(ТекСтрока.СуммаНДС, 2);
	КонецЦикла;
	
КонецПроцедуры

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКИ()
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Перечисление_ВидыКИ();
	
КонецФункции

//} Получить...

//{ ТЧПолучитьТекстЗапроса...

Функция ТЧПолучитьТекстЗапросаВозвратТоваровПоставщикуИзНТТ()
	
	Возврат "ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуИзНТТТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ВозвратТоваровПоставщикуИзНТТТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ВозвратТоваровПоставщикуИзНТТТовары.Номенклатура.Наименование
	|		ИНАЧЕ ВозвратТоваровПоставщикуИзНТТТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	ВозвратТоваровПоставщикуИзНТТТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ВозвратТоваровПоставщикуИзНТТТовары.СерияНоменклатуры КАК Серия,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Количество,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Цена,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Сумма,
	|	ВозвратТоваровПоставщикуИзНТТТовары.СтавкаНДС,
	|	ВозвратТоваровПоставщикуИзНТТТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	ВозвратТоваровПоставщикуИзНТТТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуИзНТТТовары.СуммаНДС,
	|	ВозвратТоваровПоставщикуИзНТТТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|	ВозвратТоваровПоставщикуИзНТТТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|	ВозвратТоваровПоставщикуИзНТТТовары.ЕдиницаИзмеренияМест КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуИзНТТТовары.Коэффициент = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВозвратТоваровПоставщикуИзНТТТовары.ЕдиницаИзмеренияМест.Коэффициент / ВозвратТоваровПоставщикуИзНТТТовары.Коэффициент
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|	ВозвратТоваровПоставщикуИзНТТТовары.КоличествоМест КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуИзНТТТовары.КоличествоМест > 0
	|			ТОГДА ВозвратТоваровПоставщикуИзНТТТовары.КоличествоМест * ВозвратТоваровПоставщикуИзНТТТовары.ЕдиницаИзмеренияМест.Вес
	|		ИНАЧЕ ВозвратТоваровПоставщикуИзНТТТовары.Количество * ВозвратТоваровПоставщикуИзНТТТовары.ЕдиницаИзмерения.Вес
	|	КОНЕЦ КАК Масса,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ВозвратТоваровПоставщикуИзНТТТовары.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ.Товары КАК ВозвратТоваровПоставщикуИзНТТТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуИзНТТТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтчетКомитентуОПродажах() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	подзапрос.Сумма,
	|	подзапрос.СуммаНДС,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.ЕдиницаИзмерения,
	|	"""" КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	"""" КАК Масса,
	|	"""" КАК Характеристика,
	|	"""" КАК Серия,
	|	подзапрос.ЭтоУслуга,
	|	""Комиссионное вознаграждение"" КАК Номенклатура,
	|	"""" КАК НоменклатураСсылка,
	|	"""" КАК КодНоменклатуры,
	|	подзапрос.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	подзапрос.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК Сумма,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|		0 КАК Количество,
	|		"""" КАК Цена,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		ИСТИНА КАК СуммаВключаетНДС,
	|		"""" КАК ЕдиницаИзмерения,
	|		ИСТИНА КАК ЭтоУслуга
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомитентуОПродажахТовары.Ссылка) КАК подзапрос";
	
КонецФункции

//} ТЧПолучитьТекстЗапроса...

//{ ПолучитьДанныеШапки...

Функция ШапкаПолучитьТекстЗапросаОсновной()
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
		|			Тогда ""он же""
		|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
		|	КОНЕЦ КАК Грузоотправитель,
		|	РеализацияТоваровУслуг.Контрагент,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
		|			Тогда РеализацияТоваровУслуг.Контрагент
		|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
		|	КОНЕЦ КАК Грузополучатель,
		|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
		|	РеализацияТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
		|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	РеализацияТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтражениеРеализацииТоваровИУслугНДС.Организация,
		|	ВЫБОР
		|		КОГДА ОтражениеРеализацииТоваровИУслугНДС.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
		|			Тогда ""он же""
		|		ИНАЧЕ ОтражениеРеализацииТоваровИУслугНДС.Грузоотправитель
		|	КОНЕЦ,
		|	ОтражениеРеализацииТоваровИУслугНДС.Контрагент,
		|	ВЫБОР
		|		КОГДА ОтражениеРеализацииТоваровИУслугНДС.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
		|			Тогда ОтражениеРеализацииТоваровИУслугНДС.Контрагент
		|		ИНАЧЕ ОтражениеРеализацииТоваровИУслугНДС.Грузополучатель
		|	КОНЕЦ,
		|	NULL,
		|	ОтражениеРеализацииТоваровИУслугНДС.ВалютаДокумента,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ОтражениеРеализацииТоваровИУслугНДС.ДоговорКонтрагента
		|ИЗ
		|	Документ.ОтражениеРеализацииТоваровИУслугНДС КАК ОтражениеРеализацииТоваровИУслугНДС
		|ГДЕ
		|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Организация,
		|	ВЫБОР
		|		КОГДА ВозвратТоваровПоставщику.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
		|			Тогда ""он же""
		|		ИНАЧЕ ВозвратТоваровПоставщику.Грузоотправитель
		|	КОНЕЦ,
		|	ВозвратТоваровПоставщику.Контрагент,
		|	ВЫБОР
		|		КОГДА ВозвратТоваровПоставщику.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
		|			Тогда ВозвратТоваровПоставщику.Контрагент
		|		ИНАЧЕ ВозвратТоваровПоставщику.Грузополучатель
		|	КОНЕЦ,
		|	NULL,
		|	ВозвратТоваровПоставщику.ВалютаДокумента,
		|	ВозвратТоваровПоставщику.СуммаВключаетНДС,
		|	ВозвратТоваровПоставщику.УчитыватьНДС,
		|	ВозвратТоваровПоставщику.ДоговорКонтрагента
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	ВозвратТоваровПоставщику.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщикуИзНТТ.Организация,
		|	""он же"",
		|	ВозвратТоваровПоставщикуИзНТТ.Контрагент,
		|	ВЫБОР
		|		КОГДА ВозвратТоваровПоставщикуИзНТТ.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
		|			Тогда ВозвратТоваровПоставщикуИзНТТ.Контрагент
		|		ИНАЧЕ ВозвратТоваровПоставщикуИзНТТ.Грузополучатель
		|	КОНЕЦ,
		|	NULL,
		|	ВозвратТоваровПоставщикуИзНТТ.ВалютаДокумента,
		|	ВозвратТоваровПоставщикуИзНТТ.СуммаВключаетНДС,
		|	ВозвратТоваровПоставщикуИзНТТ.УчитыватьНДС,
		|	ВозвратТоваровПоставщикуИзНТТ.ДоговорКонтрагента
		|ИЗ
		|	Документ.ВозвратТоваровПоставщикуИзНТТ КАК ВозвратТоваровПоставщикуИзНТТ
		|ГДЕ
		|	ВозвратТоваровПоставщикуИзНТТ.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажах.Организация,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажах.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
		|			Тогда ""он же""
		|		ИНАЧЕ ОтчетКомиссионераОПродажах.Грузоотправитель
		|	КОНЕЦ,
		|	ВложенныйЗапрос.Ссылка.Контрагент,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажах.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
		|			Тогда ВЫБОР
		|					КОГДА ВложенныйЗапрос.Ссылка.Контрагент = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
		|						Тогда ОтчетКомиссионераОПродажах.Контрагент
		|					ИНАЧЕ ВложенныйЗапрос.Ссылка.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ ОтчетКомиссионераОПродажах.Грузополучатель
		|	КОНЕЦ,
		|	"""",
		|	ОтчетКомиссионераОПродажах.ВалютаДокумента,
		|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС,
		|	ОтчетКомиссионераОПродажах.УчитыватьНДС,
		|	ВложенныйЗапрос.Ссылка.ДоговорКонтрагента
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах,
		|	(ВЫБРАТЬ
		|		СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
		|		СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
		|	ИЗ
		|		Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|	ГДЕ
		|		СчетФактураВыданныйДокументыОснования.Ссылка = &СчетФактура) КАК ВложенныйЗапрос
		|ГДЕ
		|	ОтчетКомиссионераОПродажах.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомитентуОПродажах.Организация,
		|	"""",
		|	ОтчетКомитентуОПродажах.Контрагент,
		|	"""",
		|	"""",
		|	ОтчетКомитентуОПродажах.ВалютаДокумента,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ОтчетКомитентуОПродажах.ДоговорКонтрагента
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		|ГДЕ
		|	ОтчетКомитентуОПродажах.Ссылка = &ДокументСсылка";
		
		Если Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено Тогда 
			
			ТекстЗапроса = ТекстЗапроса + "
			|ОБЪЕДИНИТЬ ВСЕ  
			|" + "ВЫБРАТЬ
			|	КорректировкаРеализации.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА КорректировкаРеализации.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
			|			Тогда ""он же""
			|		ИНАЧЕ КорректировкаРеализации.Грузоотправитель
			|	КОНЕЦ КАК Грузоотправитель,
			|	КорректировкаРеализации.Контрагент,
			|	ВЫБОР
			|		КОГДА КорректировкаРеализации.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
			|			Тогда КорректировкаРеализации.Контрагент
			|		ИНАЧЕ КорректировкаРеализации.Грузополучатель
			|	КОНЕЦ КАК Грузополучатель,
			|	КорректировкаРеализации.АдресДоставки КАК АдресДоставки,
			|	КорректировкаРеализации.ВалютаДокумента КАК ВалютаДокумента,
			|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
			|	КорректировкаРеализации.УчитыватьНДС КАК УчитыватьНДС,
			|	КорректировкаРеализации.ДоговорКонтрагента
			|ИЗ
			|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
			|ГДЕ
			|	КорректировкаРеализации.Ссылка = &ДокументСсылка";
		КонецЕсли;	
		
		Если Метаданные.Документы.Найти("СчетНаОплатуПокупателю") <> Неопределено Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СчетНаОплату.Организация,
			|	"""",
			|	СчетНаОплату.Контрагент,
			|	"""",
			|	"""",
			|	СчетНаОплату.ВалютаДокумента,
			|	СчетНаОплату.СуммаВключаетНДС,
			|	СчетНаОплату.УчитыватьНДС,
			|	СчетНаОплату.ДоговорКонтрагента
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплату
			|ГДЕ
			|	СчетНаОплату.Ссылка = &ДокументСсылка";
			
		КонецЕсли;
		
		Если Метаданные.Документы.Найти("ЗаказПокупателя") <> Неопределено Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказПокупателя.Организация,
			|	"""",
			|	ЗаказПокупателя.Контрагент,
			|	"""",
			|	"""",
			|	ЗаказПокупателя.ВалютаДокумента,
			|	ЗаказПокупателя.СуммаВключаетНДС,
			|	ЗаказПокупателя.УчитыватьНДС,
			|	ЗаказПокупателя.ДоговорКонтрагента
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|ГДЕ
			|	ЗаказПокупателя.Ссылка = &ДокументСсылка";
			
		КонецЕсли;
		
		Возврат ТекстЗапроса;
	КонецФункции	

Функция ЭтоПБОЮЛ(Организация)
	
	Возврат ?(ЗначениеЗаполнено(Организация) , (Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо), Ложь) ;
	
КонецФункции
