////////////////////////////////////////////////////////////////////////////////
// Методы для работы со строками на сервере:
// - Поиск, замена, разделения, соединения строк;
// - сравнения версий;
// - работа с почтовыми адресами;
// - прочее.
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Модуль содержит процедуры и функции из Библиотеки стандартных подсистем,
// распространяемой под лицензией Attribution 4.0 International (CC BY 4.0)
// https://creativecommons.org/licenses/by/4.0/legalcode производны от нее
// или вдохновлены ею, является ООО 1С-Софт (https://1c.ru/).
// Авторские права 2024 г. принадлежат ООО 1С-Софт. Все права защищены.
//
// Процедуры и функции из Библиотеки стандартных подсистем:
// - РазложитьСтрокуВМассивПодстрокЛок
// - ЭтоРазделительСловЛок
// - РазложитьСтрокуВМассивСловЛок
// - ПодставитьПараметрыВСтрокуЛок
// - ПодставитьПараметрыВСтрокуИзМассиваЛок
// - ВставитьПараметрыВСтрокуЛок
// - ПараметрыИзСтрокиЛок
// - ТолькоЦифрыВСтрокеЛок
// - ТолькоЛатиницаВСтрокеЛок
// - СократитьДвойныеКавычкиЛок
// - УдалитьПоследнийСимволВСтрокеЛок
// - ЭтоУникальныйИдентификаторЛок
// - СформироватьСтрокуСимволовЛок
// - ДополнитьСтрокуЛок
// - УдалитьПовторяющиесяСимволыЛок
// - ЗаменитьОдниСимволыДругимиЛок
// - ПреобразоватьЧислоВРимскуюНотациюЛок
// - ПреобразоватьЧислоВАрабскуюНотациюЛок
// - ИзвлечьТекстИзHTMLЛок
// - СтрокаВЧислоЛок
// - СтрокаВДатуЛок
// - СравнитьВерсииЛок
// - СравнитьВерсииБезНомераСборкиЛок
// - ВерсияКонфигурацииБезНомераСборкиЛок
// - АдресаЭлектроннойПочтыИзСтрокиЛок
// - АдресЭлектроннойПочтыСоответствуетТребованиямЛок
// - РазобратьСтрокуСПочтовымиАдресамиЛок
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
Перем СтроковыеФункцииДоступныЛок, СтрСлужебный83Лок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// МЕТОДЫ ГК

// Находит первое вхождение искомой строки как подстроки в исходной строке
//
// Параметры:
//  Строка				- Строка					- Исходная строка
//  Подстрока			- Строка					- Искомая подстрока
//  Направление			- НаправлениеПоиска,Строка	- Направление поиска, СНачала или СКонца
//  НачальнаяПозиция	- Число						- Указывает позицию в строке, с которой начинается поиск.
//														По умолчанию 1 или СтрДлина(Строка)
//  НомерВхождения		- Число						- Указывает номер вхождения искомой подстроки в исходной строке. По умолчанию - 1
//
// Возвращаемое значение:
//
// Число - Позиция первого знака найденной подстроки. Если строка не содержит указанной подстроки, то возвращается 0.
//
Функция СтрНайтиЛок(Знач Строка,
		Знач Подстрока,
		Знач Направление = "СНачала",
		Знач НачальнаяПозиция = Неопределено,
		Знач НомерВхождения = 1) Экспорт
	
	Возврат СтрНайтиРеализация(Строка, Подстрока, Направление, НачальнаяПозиция, НомерВхождения);
	
КонецФункции // СтрНайтиЛок

// Подставляет параметры в строку по номеру
//
// Параметры:
//	Шаблон	- Строка		- Строка, содержащая маркеры подстановки вида: "%1..%N".
//								Нумерация маркеров начинается с 1. N не может быть больше 10.
//  Параметр1   - Строка 	- значение подставляемого параметра.
//  Параметр2   - Строка
//  Параметр3   - Строка
//  Параметр4   - Строка
//  Параметр5   - Строка
//  Параметр6   - Строка
//  Параметр7   - Строка
//  Параметр8   - Строка
//  Параметр9   - Строка
//  Параметр10	- Строка
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
Функция СтрШаблонЛок(Знач Шаблон,
		Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
		Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
		Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено,
		Знач Параметр10 = Неопределено) Экспорт
	
	Возврат СтрШаблонРеализация(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7,
		Параметр8, Параметр9, Параметр10);
	
КонецФункции // СтрШаблонЛок

// Выполняет сравнение строк без учета регистра, аналогичное сравнению строк с помощью объекта
//
// Параметры:
// 	Строка1	-	Строка 	- Первая строка для сравнения
// 	Строка2	-	Строка	- Вторая строка для сравнения
//
// Возвращаемое значение:
// 	Число	-	1 - первая строка больше второй, -1 - первая строка меньше второй, 0 - первая строка равна второй
//
Функция СтрСравнитьЛок(Строка1, Строка2) Экспорт
	
	Возврат СтрСравнитьРеализация(Строка1, Строка2);
	
КонецФункции // СтрСравнитьЛок

// Определяет, что строка начинается с указанной подстроки.
// Определение выполняется с учетом регистра, аналогично функции Найти
//
// Параметры:
//	Строка			- Строка	- Строка, начало которой проверяется на совпадение с подстрокой поиска
//	СтрокаПоиска	- Строка	- Строка, содержащая предполагаемое начало строки
//
// Возвращаемое значение:
//	Булево			- Истина - строка начинается с указанной подстроки, Ложь - в противном случае
//
Функция СтрНачинаетсяСЛок(Строка, СтрокаПоиска) Экспорт
	
	Возврат СтрНачинаетсяСРеализация(Строка, СтрокаПоиска);
	
КонецФункции // СтрНачинаетсяСЛок

// Определяет, что строка заканчивается подстрокой. Определение выполняется с учетом регистра, аналогично функции Найти
//
// Параметры:
//	Строка			- Строка	- Строка, окончание которой проверяется на совпадение с подстрокой поиска
//	СтрокаПоиска	- Строка	- Строка, содержащая предполагаемое окончание строки
//
// Возвращаемое значение:
//	Булево			- Истина - строка заканчивается с указанной подстроки, Ложь - в противном случае
//
Функция СтрЗаканчиваетсяНаЛок(Строка, СтрокаПоиска) Экспорт
	
	Возврат СтрЗаканчиваетсяНаРеализация(Строка, СтрокаПоиска);
	
КонецФункции // СтрЗаканчиваетсяНаЛок

// Находит первое вхождение искомой строки как подстроки в исходной строке
//
// Параметры:
//  Строка			- Строка	- Исходная строка
//  Разделитель		- Строка	- Строка символов, каждый из которых является индивидуальным разделителем. По умолчанию = ","
//  ВключатьПустые	- Булево	- Указывает необходимость включать в результат пустые строки, которые могут образоваться в
//									результате разделения исходной строки. По умолчанию = Истина
//
// Возвращаемое значение:
// Массив - Массив со строками, которые получились в результате разделения исходной строки.
//
Функция СтрРазделитьЛок(Знач Строка, Знач Разделитель, ВключатьПустые = Истина) Экспорт
	
	Возврат СтрРазделитьРеализация(Строка, Разделитель, ВключатьПустые);
	
КонецФункции // СтрРазделитьЛок

// Соединяет массив переданных строк в одну строку с указанным разделителем
//
// Параметры:
// 	Строки		- Массив, ФиксированныйМассив	- Массив, содержащий объединяемые строки
//	Разделитель	- Строка	- Строка, которая будет вставлена между объединяемыми строками.
//								Если параметр не задан, строки будут объединены слитно друг с другом
// Возвращаемое значение:
// 	Строка - Строка, содержащая соединенные исходные строки с разделителем между ними
//
Функция СтрСоединитьЛок(Знач Строки, Знач Разделитель = Неопределено) Экспорт
	
	Возврат СтрСоединитьРеализация(Строки, Разделитель);
	
КонецФункции // СтрСоединитьЛок

// Разбивает строку на несколько строк по указанному разделителю. Разделитель может иметь любую длину.
// В случаях, когда разделителем является строка из одного символа, и не используется параметр
// СокращатьНепечатаемыеСимволы, рекомендуется использовать функцию платформы СтрРазделить.
//
// Параметры:
//  Значение               - Строка - текст с разделителями.
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ.
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     > для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат;
//     > если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив из Строка
//
// Пример:
//  РазложитьСтрокуВМассивПодстрокЛок(",один,,два,", ",")
//  - возвратит массив из 5 элементов, три из которых  - пустые: "", "один", "", "два", "";
//  РазложитьСтрокуВМассивПодстрокЛок(",один,,два,", ",", Истина)
//  - возвратит массив из двух элементов: "один", "два";
//  РазложитьСтрокуВМассивПодстрокЛок(" один   два  ", " ")
//  - возвратит массив из двух элементов: "один", "два";
//  РазложитьСтрокуВМассивПодстрокЛок("")
//  - возвратит пустой массив;
//  РазложитьСтрокуВМассивПодстрокЛок("",,Ложь)
//  - возвратит массив с одним элементом: ""(пустая строка);
//  РазложитьСтрокуВМассивПодстрокЛок("", " ")
//  - возвратит массив с одним элементом: "" (пустая строка).
//
Функция РазложитьСтрокуВМассивПодстрокЛок(Знач Значение,
		Знач Разделитель = ",",
		Знач ПропускатьПустыеСтроки = Неопределено,
		СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Возврат РазложитьСтрокуВМассивПодстрокРеализация(Значение, Разделитель,
		ПропускатьПустыеСтроки, СокращатьНепечатаемыеСимволы);
	
КонецФункции // РазложитьСтрокуВМассивПодстрокЛок

// Определяет, является ли символ разделителем.
//
// Параметры:
//  КодСимвола      - Число  - код проверяемого символа;
//  РазделителиСлов - Строка - символы разделителей. Если параметр не указан, то
//                             разделителем считаются все символы, не являющиеся цифрами,
//                             латинскими и кириллическими буквами, а также знаком подчеркивания.
//
// Возвращаемое значение:
//  Булево - Истина, если символ с кодом КодСимвола является разделителем.
//
Функция ЭтоРазделительСловЛок(КодСимвола, РазделителиСлов = Неопределено) Экспорт
	
	Возврат ЭтоРазделительСловРеализация(КодСимвола, РазделителиСлов);
	
КонецФункции // ЭтоРазделительСловЛок

// Разбивает строку на несколько строк, используя заданный набор разделителей.
// Если параметр РазделителиСлов не задан, то разделителем слов считается любой из символов,
// не относящихся к символам латиницы, кириллицы, цифры, подчеркивания.
//
// Параметры:
//  Значение        - Строка - исходная строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - перечень символов-разделителей. Например, ".,;".
//
// Возвращаемое значение:
//  Массив - список слов.
//
// Пример:
//  РазложитьСтрокуВМассивСловЛок("один-@#два2_!три") возвратит массив значений: "один",
//  "два2_", "три"; РазложитьСтрокуВМассивСловЛок("один-@#два2_!три", "#@!_") возвратит массив
//  значений: "один-", "два2", "три".
//
Функция РазложитьСтрокуВМассивСловЛок(Знач Значение, РазделителиСлов = Неопределено) Экспорт
	
	Возврат РазложитьСтрокуВМассивСловРеализация(Значение, РазделителиСлов);
	
КонецФункции // РазложитьСтрокуВМассивСловЛок

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  ШаблонСтроки  - Строка - шаблон строки с параметрами (вхождениями вида "%<номер параметра>",
//                           например "%1 пошел в %2");
//  Параметр1   - Строка - значение подставляемого параметра.
//  Параметр2   - Строка
//  Параметр3   - Строка
//  Параметр4   - Строка
//  Параметр5   - Строка
//  Параметр6   - Строка
//  Параметр7   - Строка
//  Параметр8   - Строка
//  Параметр9   - Строка
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
Функция ПодставитьПараметрыВСтрокуЛок(Знач ШаблонСтроки,
		Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
		Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
		Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Возврат ПодставитьПараметрыВСтрокуРеализация(ШаблонСтроки, Параметр1, Параметр2, Параметр3, Параметр4,
		Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции // ПодставитьПараметрыВСтрокуЛок

// Подставляет параметры в строку. Число параметров в строке не ограничено.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров
// начинается с единицы.
//
// Параметры:
//  ШаблонСтроки  - Строка - шаблон строки с параметрами (вхождениями вида "%<номер параметра>",
//                           например "%1 пошел в %2");
//  Параметры     - Массив - значения параметров в строке ШаблонСтроки.
//
// Возвращаемое значение:
//   Строка - строка с подставленными значениями параметрами.
//
// Пример:
//  ЗначенияПараметров = Новый Массив;
//  ЗначенияПараметров.Добавить("Вася");
//  ЗначенияПараметров.Добавить("Зоопарк");
//  Результат = ПодставитьПараметрыВСтрокуИзМассиваЛок(НСтр("ru='%1 пошел в %2'"), ЗначенияПараметров);
//  - вернет строку "Вася пошел в Зоопарк".
//
Функция ПодставитьПараметрыВСтрокуИзМассиваЛок(Знач ШаблонСтроки, Знач Параметры) Экспорт
	
	Возврат ПодставитьПараметрыВСтрокуИзМассиваРеализация(ШаблонСтроки, Параметры);
	
КонецФункции // ПодставитьПараметрыВСтрокуИзМассиваЛок

// Заменяет в шаблоне строки имена параметров на их значения. Параметры в строке выделяются с двух сторон квадратными
// скобками.
//
// Параметры:
//  ШаблонСтроки - Строка    - строка, в которую необходимо вставить значения.
//  Параметры    - Структура - подставляемые значения параметров, где ключ - имя параметра без спецсимволов,
//                             значение - вставляемое значение.
//
// Возвращаемое значение:
//  Строка - строка со вставленными значениями.
//
// Пример:
//  Значения = Новый Структура("Фамилия,Имя", "Пупкин", "Вася");
//  Результат = ВставитьПараметрыВСтрокуЛок("Здравствуй, [Имя] [Фамилия].", Значения);
//  - возвращает: "Здравствуй, Вася Пупкин".
//
Функция ВставитьПараметрыВСтрокуЛок(Знач ШаблонСтроки, Знач Параметры) Экспорт
	
	Возврат ВставитьПараметрыВСтрокуРеализация(ШаблонСтроки, Параметры);
	
КонецФункции // ВставитьПараметрыВСтрокуЛок

// Получает значения параметров из строки.
//
// Параметры:
//  СтрокаПараметров - Строка - строка, содержащая параметры, каждый из которых представляет собой
//                              фрагмент вида <Имя параметра>=<Значение>, где:
//                                Имя параметра - имя параметра;
//                                Значение - его значение.
//                              Фрагменты отделяются друг от друга символами ';'.
//                              Если значение содержит пробельные символы, то оно должно быть заключено в двойные
//                              кавычки (").
//                              Например:
//                               "File=""c:\InfoBases\Trade""; Usr=""Director"";"
//  Разделитель - Строка - символ, которым фрагменты отделяются друг от друга.
//
// Возвращаемое значение:
//  Структура - значения параметров, где ключ - имя параметра, значение - значение параметра.
//
// Пример:
//  Результат = ПараметрыИзСтрокиЛок("File=""c:\InfoBases\Trade""; Usr=""Director"";""", ";");
//  - вернет структуру:
//     ключ "File" и значение "c:\InfoBases\Trade"
//     ключ "Usr"  и значение "Director".
//
Функция ПараметрыИзСтрокиЛок(Знач СтрокаПараметров, Знач Разделитель = ";") Экспорт
	
	Возврат ПараметрыИзСтрокиРеализация(СтрокаПараметров, Разделитель);
	
КонецФункции // ПараметрыИзСтрокиЛок

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  Устаревший       - Булево - устаревший параметр, не используется.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
// Пример:
//  Результат = ТолькоЦифрыВСтрокеЛок("0123"); // Истина
//  Результат = ТолькоЦифрыВСтрокеЛок("0123abc"); // Ложь
//  Результат = ТолькоЦифрыВСтрокеЛок("01 2 3",, Ложь); // Истина
//
Функция ТолькоЦифрыВСтрокеЛок(Знач Значение, Знач Устаревший = Истина, Знач ПробелыЗапрещены = Истина) Экспорт
	
	Возврат ТолькоЦифрыВСтрокеРеализация(Значение, Устаревший, ПробелыЗапрещены);
	
КонецФункции // ТолькоЦифрыВСтрокеЛок

// Проверяет, содержит ли строка только символы латинского алфавита.
//
// Параметры:
//  СтрокаПроверки - Строка - проверяемая строка.
//  УчитыватьРазделителиСлов - Булево - учитывать ли разделители слов или они являются исключением.
//  ДопустимыеСимволы - Строка - дополнительные разрешенные символы, кроме латиницы.
//
// Возвращаемое значение:
//  Булево - Истина, если строка содержит только латинские (или допустимые) символы;
//           Ложь, если строка содержит иные символы.
//
Функция ТолькоЛатиницаВСтрокеЛок(Знач СтрокаПроверки,
		Знач УчитыватьРазделителиСлов = Истина,
		ДопустимыеСимволы = "") Экспорт
	
	Возврат ТолькоЛатиницаВСтрокеРеализация(СтрокаПроверки, УчитыватьРазделителиСлов, ДопустимыеСимволы);
	
КонецФункции // ТолькоЛатиницаВСтрокеЛок

// Удаляет двойные кавычки с начала и конца строки, если они есть.
//
// Параметры:
//  Значение - Строка - входная строка.
//
// Возвращаемое значение:
//  Строка - строка без двойных кавычек.
//
Функция СократитьДвойныеКавычкиЛок(Знач Значение) Экспорт
	
	Возврат СократитьДвойныеКавычкиРеализация(Значение);
	
КонецФункции // СократитьДвойныеКавычкиЛок

// Удаляет из строки указанное количество символов справа.
//
// Параметры:
//  Текст         - Строка - строка, в которой необходимо удалить последние символы;
//  ЧислоСимволов - Число  - количество удаляемых символов.
//
// Возвращаемое значение:
//  Строка - строка без последних символов.
//
Функция УдалитьПоследнийСимволВСтрокеЛок(Текст, ЧислоСимволов = 1) Экспорт
	
	Возврат УдалитьПоследнийСимволВСтрокеРеализация(Текст, ЧислоСимволов);
	
КонецФункции // УдалитьПоследнийСимволВСтрокеЛок

// Проверяет, является ли строка уникальным идентификатором.
// В качестве уникального идентификатора предполагается строка вида
// "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX", где X = [0..9,a..f].
//
// Параметры:
//  Значение - Строка - проверяемая строка.
//
// Возвращаемое значение:
//  Булево - Истина, если переданная строка является уникальным идентификатором.
//
Функция ЭтоУникальныйИдентификаторЛок(Знач Значение) Экспорт
	
	Возврат ЭтоУникальныйИдентификаторРеализация(Значение);
	
КонецФункции // ЭтоУникальныйИдентификаторЛок

// Формирует строку повторяющихся символов заданной длины.
//
// Параметры:
//  Символ      - Строка - символ, из которого будет формироваться строка.
//  ДлинаСтроки - Число  - требуемая длина результирующей строки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из повторяющихся символов.
//
Функция СформироватьСтрокуСимволовЛок(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Возврат СформироватьСтрокуСимволовРеализация(Символ, ДлинаСтроки);
	
КонецФункции // СформироватьСтрокуСимволовЛок

// Дополняет строку символами слева или справа до заданной длины и возвращает ее.
// При этом удаляются незначащие символы слева и справа (подробнее про незначащие символы
// см. синтаксис-помощник к методу платформы СокрЛП).
// По умолчанию функция дополняет строку символами "0" (ноль) слева.
//
// Параметры:
//  Значение    - Строка - исходная строка, которую необходимо дополнить символами;
//  ДлинаСтроки - Число  - требуемая результирующая длина строки;
//  Символ      - Строка - символ, которым необходимо дополнить строку;
//  Режим       - Строка - "Слева" или "Справа" - вариант добавления символов к исходной строке.
//
// Возвращаемое значение:
//  Строка - строка, дополненная символами.
//
// Пример:
//  1. Результат = ДополнитьСтрокуЛок("1234", 10, "0", "Слева");
//  Возвращает: "0000001234".
//
//  2. Результат = ДополнитьСтрокуЛок(" 1234  ", 10, "#", "Справа");
//  Строка = " 1234  "; ДлинаСтроки = 10; Символ = "#"; Режим = "Справа"
//  Возвращает: "1234######".
//
Функция ДополнитьСтрокуЛок(Знач Значение, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева") Экспорт
	
	Возврат ДополнитьСтрокуРеализация(Значение, ДлинаСтроки, Символ, Режим);
	
КонецФункции // ДополнитьСтрокуЛок

// Удаляет крайние повторяющиеся символы слева или справа в строке.
//
// Параметры:
//  Значение        - Строка - исходная строка, из которой необходимо удалить крайние повторяющиеся символы;
//  УдаляемыйСимвол - Строка - искомый символ для удаления;
//  Режим           - Строка - "Слева" или "Справа" - режим удаления символов в исходной строке.
//
// Возвращаемое значение:
//  Строка - обрезанная строка.
//
Функция УдалитьПовторяющиесяСимволыЛок(Знач Значение, Знач УдаляемыйСимвол, Знач Режим = "Слева") Экспорт
	
	Возврат УдалитьПовторяющиесяСимволыРеализация(Значение, УдаляемыйСимвол, Режим);
	
КонецФункции // УдалитьПовторяющиесяСимволыЛок

// Выполняет замену символов в строке.
// Предназначена для простых случаев - например, для замены латиницы на похожие кириллические символы.
//
// Параметры:
//  ЗаменяемыеСимволы - Строка - строка символов, каждый из которых требует замены;
//  Значение          - Строка - исходная строка, в которой требуется замена символов;
//  СимволыЗамены     - Строка - строка символов, на каждый из которых нужно заменить символы параметра
//                               ЗаменяемыеСимволы.
//
// Возвращаемое значение:
//  Строка - строка после замены символов.
//
Функция ЗаменитьОдниСимволыДругимиЛок(ЗаменяемыеСимволы, Значение, СимволыЗамены) Экспорт
	
	Возврат ЗаменитьОдниСимволыДругимиРеализация(ЗаменяемыеСимволы, Значение, СимволыЗамены);
	
КонецФункции // ЗаменитьОдниСимволыДругимиЛок

// Выполняет преобразование арабского числа в римское.
//
// Параметры:
//  АрабскоеЧисло - Число - число, целое, от 0 до 999;
//  ИспользоватьКириллицу - Булево - использовать в качестве арабских цифр кириллицу или латиницу.
//
// Возвращаемое значение:
//  Строка - число в римской нотации.
//
// Пример:
//  ПреобразоватьЧислоВРимскуюНотациюЛок(17) = "XVII".
//
Функция ПреобразоватьЧислоВРимскуюНотациюЛок(АрабскоеЧисло, ИспользоватьКириллицу = Истина) Экспорт
	
	Возврат ПреобразоватьЧислоВРимскуюНотациюРеализация(АрабскоеЧисло, ИспользоватьКириллицу);
	
КонецФункции // ПреобразоватьЧислоВРимскуюНотациюЛок

// Выполняет преобразование римского числа в арабское.
//
// Параметры:
//  РимскоеЧисло - Строка - число, записанное римскими цифрами;
//  ИспользоватьКириллицу - Булево - использовать в качестве арабских цифр кириллицу или латиницу.
//
// Возвращаемое значение:
//  Число - преобразованное число.
//
// Пример:
//  ПреобразоватьЧислоВАрабскуюНотациюЛок("XVII") = 17.
//
Функция ПреобразоватьЧислоВАрабскуюНотациюЛок(РимскоеЧисло, ИспользоватьКириллицу = Истина) Экспорт
	
	Возврат ПреобразоватьЧислоВАрабскуюНотациюРеализация(РимскоеЧисло, ИспользоватьКириллицу);
	
КонецФункции // ПреобразоватьЧислоВАрабскуюНотациюЛок

// Очищает текст в формате HTML от тегов и возвращает неформатированный текст.
//
// Параметры:
//  ИсходныйТекст - Строка - текст в формате HTML.
//
// Возвращаемое значение:
//  Строка - текст, очищенный от тегов, скриптов и заголовков.
//
Функция ИзвлечьТекстИзHTMLЛок(Знач ИсходныйТекст) Экспорт
	
	Возврат ИзвлечьТекстИзHTMLРеализация(ИсходныйТекст);
	
КонецФункции // ИзвлечьТекстИзHTMLЛок

// Преобразует исходную строку в число без вызова исключений.
//
// Параметры:
//   Значение - Строка - строка, которую необходимо привести к числу.
//                       Например, "10", "+10", "010", вернет 10;
//                                 "(10)", "-10",вернет -10;
//                                 "10,2", "10.2",вернет 10.2;
//                                 "000", " ", "",вернет 0;
//                                 "10текст", вернет Неопределено.
//
// Возвращаемое значение:
//   Число, Неопределено - полученное число, либо Неопределено, если строка не является числом.
//
Функция СтрокаВЧислоЛок(Знач Значение) Экспорт
	
	Возврат СтрокаВЧислоРеализация(Значение);
	
КонецФункции // СтрокаВЧислоЛок

// Преобразует исходную строку в дату.
// Если дату не удалось распознать, то возвращается пустая дата (01.01.01 00:00:00).
//
// Параметры:
//  Значение - Строка - строка, которую необходимо привести к дате.
//                      Формат даты должен быть в виде "ДД.ММ.ГГГГ" или "ДД/ММ/ГГ" или "ДД-ММ-ГГ ЧЧ:ММ:CC",
//                      Например, "23.02.1980" или "23/02/80 09:15:45".
//  ЧастьДаты - ЧастиДаты - определяет допустимые части даты. По умолчанию, ЧастиДаты.Дата.
//
// Возвращаемое значение:
//  Дата
//
Функция СтрокаВДатуЛок(Знач Значение, ЧастьДаты = Неопределено) Экспорт
	
	Возврат СтрокаВДатуРеализация(Значение, ЧастьДаты);
	
КонецФункции // СтрокаВДатуЛок

// БСП: ВЕРСИОНИРОВАНИЕ

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсия1  - Строка - номер версии.
//  СтрокаВерсия2  - Строка - номер сравниваемой версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
Функция СравнитьВерсииЛок(Знач СтрокаВерсия1, Знач СтрокаВерсия2) Экспорт
	
	Возврат СравнитьВерсииРеализация(СтрокаВерсия1, СтрокаВерсия2);
	
КонецФункции // СравнитьВерсииЛок

// Сравнить две строки версий. Номером сборки считается 4 разряд версии
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
Функция СравнитьВерсииБезНомераСборкиЛок(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Возврат СравнитьВерсииБезНомераСборкиРеализация(СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции // СравнитьВерсииБезНомераСборкиЛок

// Получает номер версии конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС - номер сборки, который будет удален.
//
// Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
Функция ВерсияКонфигурацииБезНомераСборкиЛок(Знач Версия) Экспорт
	
	Возврат ВерсияКонфигурацииБезНомераСборкиРеализация(Версия);
	
КонецФункции // ВерсияКонфигурацииБезНомераСборкиЛок

// БСП: EMAIL АДРЕСА

// Разбирает строку с адресами электронной почты. При разборе проверяет корректность адресов.
//
// Параметры:
//  СписокАдресов - Строка - адреса электронной почты, разделитель - запятая, либо точка с запятой:
//                           Получатель1 <Адрес1>, Получатель 2 <Адрес2>,...
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Псевдоним      - Строка - представление адресата.
//   * Адрес          - Строка - найденный и соответствующий требованиям почтовый адрес.
//                               Если текст, похожий на адрес найден, но не соответствует требованиям
//                               стандартов, то такой текст записывается в поле "Псевдоним".
//   * ОписаниеОшибки - Строка - текстовое представление ошибки, либо пустая строка, если ошибок нет.
//
Функция АдресаЭлектроннойПочтыИзСтрокиЛок(Знач СписокАдресов) Экспорт
	
	Возврат АдресаЭлектроннойПочтыИзСтрокиРеализация(СписокАдресов);
	
КонецФункции // АдресаЭлектроннойПочтыИзСтрокиЛок

// Проверяет email-адрес на соответствие требованиям стандартов RFC 5321, RFC 5322,
// а также RFC 5335, RFC 5336 и RFC 3696.
// Кроме того, функция ограничивает использование спецсимволов.
//
// Параметры:
//  Адрес - Строка - проверяемый email.
//  РазрешитьЛокальныеАдреса - Булево - не выдавать ошибку в случае отсутствия зоны домена в адресе.
//
// Возвращаемое значение:
//  Булево - Истина, если ошибок нет.
//
Функция АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Знач Адрес, РазрешитьЛокальныеАдреса = Ложь) Экспорт
	
	Возврат АдресЭлектроннойПочтыСоответствуетТребованиямРеализация(Адрес, РазрешитьЛокальныеАдреса);
	
КонецФункции // АдресЭлектроннойПочтыСоответствуетТребованиямЛок

// Проверяет, что введенная строка с email-адресами введена правильно.
//
// Формат строки:
//  Z = ИмяПользователя|[Имя Пользователя] [<]пользователь@почтовый_сервер[>], Строка = Z[<разделитель*>Z].
//
//  Прим.: разделитель* - имеется ввиду любой разделитель адресов.
//
// Параметры:
//  СтрокаПереданныхАдресов - Строка - правильная строка с почтовыми адресами.
//  ВызыватьИсключение - Булево - передать Ложь, чтобы в случае неуспешного разбора не выдавалось исключение.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Адрес - Строка - e-mail получателя.
//   * Представление - Строка - имя получателя.
//
Функция РазобратьСтрокуСПочтовымиАдресамиЛок(Знач СтрокаПереданныхАдресов, ВызыватьИсключение = Истина) Экспорт
	
	Возврат РазобратьСтрокуСПочтовымиАдресамиРеализация(СтрокаПереданныхАдресов, ВызыватьИсключение);
	
КонецФункции // РазобратьСтрокуСПочтовымиАдресамиЛок

// ПРОЧЕЕ

// Сравнивает текущую версию платформы с переданной версией.
// Параметры:
//  Версия - Строка - номер сравниваемой версии
//
// Возвращаемое значение:
//   Число   - Истина - версия платформы больше чем переданная, иначе - Ложь
//
Функция ВерсияПлатформыБольшеИлиРавна(Знач Версия) Экспорт
	
	Возврат ВерсияПлатформыБольшеИлиРавнаРеализация(Версия);
	
КонецФункции // ВерсияПлатформыБольшеИлиРавна

// Получает значения параметров из строки.
//
// Параметры:
//  СтрокаПараметров - Строка - строка, содержащая параметры, каждый из которых представляет собой
//                              фрагмент вида <Имя параметра>=<Значение>, где:
//                                Имя параметра - имя параметра;
//                                Значение - его значение.
//                              Фрагменты отделяются друг от друга символами ';'.
//                              Если значение содержит пробельные символы, то оно должно быть заключено в двойные
//                              кавычки (").
//                              Например:
//                               "File=""c:\InfoBases\Trade""; Usr=""Director"";"
//  Разделитель - Строка - символ, которым фрагменты отделяются друг от друга.
//
// Возвращаемое значение:
//  Соответствие - значения параметров, где ключ - имя параметра, значение - значение параметра.
//
// Пример:
//  Результат = РазобратьСтрокуПараметров("File=""c:\InfoBases\Trade""; Usr=""Director"";""", ";");
//  - вернет соответствие:
//     ключ "File" и значение "c:\InfoBases\Trade"
//     ключ "Usr"  и значение "Director".
//
Функция РазобратьСтрокуПараметров(Знач СтрокаПараметров, Знач Разделитель = ";") Экспорт
	
	Если ТипЗнч(СтрокаПараметров) <> Тип("Строка") Тогда
		Ошибка = "Несоответствие типов (параметр номер 1)";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Если ТипЗнч(Разделитель) <> Тип("Строка") Тогда
		Ошибка = "Несоответствие типов (параметр номер 2)";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Если ПустаяСтрока(Разделитель) Тогда
		Ошибка = "Недопустимое значение параметра (параметр номер 2)";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ЧитатьВСоответствие = Истина;
	Возврат ПараметрыИзСтрокиРеализация(СтрокаПараметров, Разделитель, ЧитатьВСоответствие);
	
КонецФункции // РазобратьСтрокуПараметров

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// БСП: ВЕРСИОНИРОВАНИЕ

Функция ВерсияКонфигурацииБезНомераСборкиРеализация(Версия)
	
	Массив = СтрРазделитьЛок(Версия, ".");
	КоличествоРазрядов = 3;
	Два = 2;
	
	Если Массив.Количество() < КоличествоРазрядов Тогда
		Возврат Версия;
	КонецЕсли;
	
	Результат = "[Редакция].[Подредакция].[Релиз]";
	Результат = СтрЗаменить(Результат, "[Редакция]", Массив[0]);
	Результат = СтрЗаменить(Результат, "[Подредакция]", Массив[1]);
	Результат = СтрЗаменить(Результат, "[Релиз]", Массив[Два]);
	
	Возврат Результат;
	
КонецФункции // ВерсияКонфигурацииБезНомераСборкиРеализация

Функция СравнитьВерсииРеализация(Знач СтрокаВерсия1, Знач СтрокаВерсия2)
	
	Результат = 0;
	Если СокрЛП(СтрокаВерсия1) = СокрЛП(СтрокаВерсия2) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Версия1 = СтрРазделитьЛок(СтрокаВерсия1, ".");
	Версия2 = СтрРазделитьЛок(СтрокаВерсия2, ".");
	
	КоличествоИтераций = Мин(Версия1.Количество(), Версия2.Количество()) - 1;
	Для Разряд = 0 По КоличествоИтераций Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат (Результат > 0) - (Результат < 0);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СравнитьВерсииРеализация

Функция СравнитьВерсииБезНомераСборкиРеализация(СтрокаВерсия1, СтрокаВерсия2)
	
	Результат = 0;
	Два = 2;
	Если СокрЛП(СтрокаВерсия1) = СокрЛП(СтрокаВерсия2) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Версия1 = СтрРазделитьЛок(СтрокаВерсия1, ".");
	Версия2 = СтрРазделитьЛок(СтрокаВерсия2, ".");
	
	КоличествоИтераций = Мин(Версия1.Количество(), Версия2.Количество()) - 1;
	КоличествоИтераций = Мин(КоличествоИтераций, Два);
	Для Разряд = 0 По КоличествоИтераций Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат (Результат > 0) - (Результат < 0);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СравнитьВерсииБезНомераСборкиРеализация

// БСП: EMAIL АДРЕСА

Процедура АдресаЭлектроннойПочтыИзСтрокиОбработатьСтроку(Результат, Строка)
	
	ЧастиПредставления = Новый Массив;
	Для Каждого АдресСПредставлением Из СтрРазделитьЛок(СокрЛП(Строка), ",", Ложь) Цикл
		Если НЕ ЗначениеЗаполнено(АдресСПредставлением) Тогда
			ЧастиПредставления.Добавить(АдресСПредставлением);
			Продолжить;
		КонецЕсли;
		
		ЧастиСтроки = СтрРазделитьЛок(СокрП(АдресСПредставлением), " ", Истина);
		Адрес = СокрЛП(ЧастиСтроки[ЧастиСтроки.ВГраница()]);
		Псевдоним = "";
		ОписаниеОшибки = "";
		
		Если НайтиСимволыВАдресеЭлектроннойПочты(Адрес) Тогда
			Адрес = СтрСоединитьЛок(СтрРазделитьЛок(Адрес, "<>", Ложь), "");
			Если АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Адрес) Тогда
				ЧастиСтроки.Удалить(ЧастиСтроки.ВГраница());
			Иначе
				ОписаниеОшибки = ПодставитьПараметрыВСтрокуЛок("Некорректный адрес электронной почты ""%1""", Адрес);
				Адрес = "";
			КонецЕсли;
			
			Псевдоним = СокрЛП(СтрСоединитьЛок(ЧастиПредставления, ",") + СтрСоединитьЛок(ЧастиСтроки, " "));
			ЧастиПредставления.Очистить();
			СтруктураАдреса = Новый Структура("Псевдоним, Адрес, ОписаниеОшибки", Псевдоним, Адрес, ОписаниеОшибки);
			Результат.Добавить(СтруктураАдреса);
		Иначе
			ЧастиПредставления.Добавить(АдресСПредставлением);
		КонецЕсли;
	КонецЦикла;
	
	Псевдоним = СтрСоединитьЛок(ЧастиПредставления, ",");
	Если ЗначениеЗаполнено(Псевдоним) Тогда
		Адрес = "";
		ОписаниеОшибки = ПодставитьПараметрыВСтрокуЛок("Некорректный адрес электронной почты ""%1""", Псевдоним);
		СтруктураАдреса = Новый Структура("Псевдоним, Адрес, ОписаниеОшибки", Псевдоним, Адрес, ОписаниеОшибки);
		Результат.Добавить(СтруктураАдреса);
	КонецЕсли;
	
КонецПроцедуры // АдресаЭлектроннойПочтыИзСтрокиОбработатьСтроку

Функция АдресаЭлектроннойПочтыИзСтрокиРеализация(СтрокаАдресов)
	
	Результат = Новый Массив;
	СимволыСкобок = "()[]";
	СтрокаАдресов_ = СтрСоединитьЛок(СтрРазделитьЛок(СтрокаАдресов, СимволыСкобок + " ", Ложь), " ");
	СтрокаАдресов_ = СтрЗаменить(СтрокаАдресов_, ">", ">;");
	СписокАдресов = СтрРазделитьЛок(СтрокаАдресов_, ";", Ложь);
	
	Для Каждого Строка Из СписокАдресов Цикл
		АдресаЭлектроннойПочтыИзСтрокиОбработатьСтроку(Результат, Строка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // АдресаЭлектроннойПочтыИзСтрокиРеализация

Функция АдресЭлектроннойПочтыСоответствуетТребованиямРеализация(Знач Адрес, РазрешитьЛокальныеАдреса)
	
	Буквы = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	АдресНеВалиден = АдресЭлектроннойПочтыНеВалиден(Адрес);
	
	Если АдресНеВалиден Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Приводим строку адреса к нижнему регистру.
	Адрес = НРег(Адрес);
	
	// Разбираем адрес на local-part и domain.
	Позиция = СтрНайтиЛок(Адрес, "@");
	ЛокальноеИмя = Лев(Адрес, Позиция - 1);
	Домен = Сред(Адрес, Позиция + 1);
	
	// Проверяем на заполненность и допустимость длины.
	ДлинаЛокальногоИмени = 64;
	ДлинаДомена = 255;
	ДанныеНеЗаполнены = ПустаяСтрока(ЛокальноеИмя)
		ИЛИ ПустаяСтрока(Домен)
		ИЛИ СтрДлина(ЛокальноеИмя) > ДлинаЛокальногоИмени
		ИЛИ СтрДлина(Домен) > ДлинаДомена;
	
	ДоменНеВалиден = ДоменНеВалиден(Домен, РазрешитьЛокальныеАдреса);
	
	Если ДоменНеВалиден ИЛИ ДанныеНеЗаполнены Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Выделяем зону (TLD) из имени домена.
	Зона = Домен;
	Позиция = СтрНайтиЛок(Зона, ".");
	Пока Позиция > 0 Цикл
		Зона = Сред(Зона, Позиция + 1);
		Позиция = СтрНайтиЛок(Зона, ".");
	КонецЦикла;
	
	МинимумДваСимвола = 2;
	// Проверяем зону домена (минимум 2 символа, только буквы).
	Возврат РазрешитьЛокальныеАдреса ИЛИ СтрДлина(Зона) >= МинимумДваСимвола И СтрокаСодержитТолькоДопустимыеСимволы(
		Зона, Буквы);
	
КонецФункции // АдресЭлектроннойПочтыСоответствуетТребованиямРеализация

Функция РазобратьСтрокуСПочтовымиАдресамиРеализация(СтрокаПереданныхАдресов, ВызыватьИсключение)
	
	Результат = Новый Массив;
	ОписанияОшибок = Новый Массив;
	Адресаты = АдресаЭлектроннойПочтыИзСтрокиЛок(СтрокаПереданныхАдресов);
	
	Для Каждого Адресат Из Адресаты Цикл
		Если ЗначениеЗаполнено(Адресат.ОписаниеОшибки) Тогда
			ОписанияОшибок.Добавить(Адресат.ОписаниеОшибки);
		КонецЕсли;
		Результат.Добавить(Новый Структура("Адрес, Представление", Адресат.Адрес, Адресат.Псевдоним));
	КонецЦикла;
	
	Если ВызыватьИсключение И ЗначениеЗаполнено(ОписанияОшибок) Тогда
		ТекстОшибки = СтрСоединитьЛок(ОписанияОшибок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // РазобратьСтрокуСПочтовымиАдресамиРеализация

Функция НайтиСимволыВАдресеЭлектроннойПочты(Адрес)
	
	Возврат СтрНайтиЛок(Адрес, "@")
	ИЛИ СтрНайтиЛок(Адрес, "<")
	ИЛИ СтрНайтиЛок(Адрес, ">");
	
КонецФункции // НайтиСимволыВАдресеЭлектроннойПочты

Функция АдресЭлектроннойПочтыНеВалиден(Адрес)
	
	Буквы = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	Цифры = "0123456789";
	СпецСимволы = ".@_-:+";
	
	Возврат СтрЧислоВхождений(Адрес, "@") <> 1 // проверяем символ @
	ИЛИ СтрЧислоВхождений(Адрес, ":") > 1 // Разрешаем двоеточие только один раз
	ИЛИ СтрНайтиЛок(Адрес, "..") > 0 // проверяем две точки подряд
	ИЛИ НЕ СтрокаСодержитТолькоДопустимыеСимволы(НРег(Адрес), Буквы + Цифры + СпецСимволы);
	
КонецФункции // АдресЭлектроннойПочтыНеВалиден

Функция ДоменНеВалиден(Домен, РазрешитьЛокальныеАдреса = Ложь)
	
	СпецСимволы = ".@_-:+";
	
	Возврат ЕстьСимволыВНачалеВКонце(Домен, СпецСимволы) // Проверяем наличие спецсимволов в начале и в конце домена.
	ИЛИ РазрешитьЛокальныеАдреса И СтрНайтиЛок(Домен, ".") = 0 // В домене должна быть минимум одна точка
		ИЛИ СтрНайтиЛок(Домен, "_") > 0 // В домене не должно быть символа подчеркивания
		ИЛИ СтрНайтиЛок(Домен, ":") > 0 // В домене не должно быть символа двоеточие.
		ИЛИ СтрНайтиЛок(Домен, "+") > 0; // В домене не должно быть символа "плюс"
	
КонецФункции // ДоменНеВалиден

// МЕТОДЫ ГК

Функция СтрНайтиРеализация(Строка, Подстрока, Направление, Знач НачальнаяПозиция, НомерВхождения)
	
	Если СтрДлина(Подстрока) > СтрДлина(Строка) ИЛИ (СтрДлина(Подстрока) = СтрДлина(Строка) И Подстрока <> Строка) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Подстрока = "" Тогда
		Возврат 1;
	КонецЕсли;
	
	Если НачальнаяПозиция = Неопределено Тогда
		Если Направление = "СНачала" ИЛИ Строка(Направление) = "С начала" Тогда
			НачальнаяПозиция = 1;
		Иначе
			НачальнаяПозиция = СтрДлина(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Если СтроковыеФункцииДоступны() Тогда
		Результат = СтрСлужебный83().СтрНайтиЛок(Строка, Подстрока, Направление, НачальнаяПозиция, НомерВхождения);
	Иначе
		Результат = СтрНайтиСовместимость(Строка, Подстрока, Направление, НачальнаяПозиция, НомерВхождения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтрНайтиРеализация

Функция СтрНайтиСовместимость(Знач Строка, Знач Подстрока, Направление, НачальнаяПозиция, НомерВхождения)
	
	Позиция = НачальнаяПозиция;
	Если Направление = "СКонца" Тогда
		Строка = СтрРазвернутьРеализация(Строка);
		Подстрока = СтрРазвернутьРеализация(Подстрока);
		Позиция = 1;
	КонецЕсли;
	
	Результат = 0;
	Вхождение = 0;
	ДлинаСтроки = СтрДлина(Строка);
	ДлинаПодстроки = СтрДлина(Подстрока);
	
	Пока Позиция <> ДлинаСтроки + 1 Цикл
		Если Сред(Строка, Позиция, ДлинаПодстроки) = Подстрока Тогда
			Результат = Позиция;
			Вхождение = Вхождение + 1;
			Если Вхождение = НомерВхождения Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		Позиция = Позиция + 1;
	КонецЦикла;
	
	Если Направление = "СКонца" Тогда
		Сдвиг = 2;
		Результат = ДлинаСтроки - ДлинаПодстроки - Результат + Сдвиг;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтрНайтиСовместимость

Функция СтрШаблонРеализация(Знач Шаблон, Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено,
		Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено,
		Параметр8 = Неопределено, Параметр9 = Неопределено, Параметр10 = Неопределено)
	
	Если СтроковыеФункцииДоступны() Тогда
		Результат = СтрСлужебный83().СтрШаблонЛок(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6,
				Параметр7, Параметр8, Параметр9, Параметр10);
	Иначе
		Результат = СтрШаблонСовместимость(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6,
				Параметр7, Параметр8, Параметр9, Параметр10);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтрШаблонРеализация

Функция СтрШаблонСовместимость(Знач Шаблон, Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено,
		Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено,
		Параметр8 = Неопределено, Параметр9 = Неопределено, Параметр10 = Неопределено)
	
	ЕстьПараметрыСПроцентом = СтрНайтиЛок(Параметр1, "%")
		ИЛИ СтрНайтиЛок(Параметр2, "%")
		ИЛИ СтрНайтиЛок(Параметр3, "%")
		ИЛИ СтрНайтиЛок(Параметр4, "%")
		ИЛИ СтрНайтиЛок(Параметр5, "%")
		ИЛИ СтрНайтиЛок(Параметр6, "%")
		ИЛИ СтрНайтиЛок(Параметр7, "%")
		ИЛИ СтрНайтиЛок(Параметр8, "%")
		ИЛИ СтрНайтиЛок(Параметр9, "%")
		ИЛИ СтрНайтиЛок(Параметр10, "%");
	
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат СтрШаблонСовместимостьСПроцентом(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6,
			Параметр7, Параметр8, Параметр9, Параметр10);
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Параметр1);
	МассивПараметров.Добавить(Параметр2);
	МассивПараметров.Добавить(Параметр3);
	МассивПараметров.Добавить(Параметр4);
	МассивПараметров.Добавить(Параметр5);
	МассивПараметров.Добавить(Параметр6);
	МассивПараметров.Добавить(Параметр7);
	МассивПараметров.Добавить(Параметр8);
	МассивПараметров.Добавить(Параметр9);
	МассивПараметров.Добавить(Параметр10);
	
	ВсегоПараметров = 11;
	Для М = 1 По 10 Цикл
		
		НомерПараметра = Строка(ВсегоПараметров - М);
		
		Шаблон = СтрЗаменить(Шаблон, "%" + НомерПараметра, МассивПараметров.Получить(НомерПараметра - 1));
		Шаблон = СтрЗаменить(Шаблон, "%(" + НомерПараметра + ")", МассивПараметров.Получить(НомерПараметра - 1));
		
	КонецЦикла;
	
	Возврат Шаблон;
	
КонецФункции // СтрШаблонСовместимость

Функция СтрШаблонСовместимостьСПроцентом(Знач Шаблон, Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено,
		Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено,
		Параметр8 = Неопределено, Параметр9 = Неопределено, Параметр10 = Неопределено)
	
	Результат = "";
	Позиция = СтрНайтиЛок(Шаблон, "%");
	
	КартаПараметров = Новый Соответствие;
	КартаПараметров.Вставить("1", Параметр1);
	КартаПараметров.Вставить("(1)", Параметр1);
	КартаПараметров.Вставить("2", Параметр2);
	КартаПараметров.Вставить("(2)", Параметр2);
	КартаПараметров.Вставить("3", Параметр3);
	КартаПараметров.Вставить("(3)", Параметр3);
	КартаПараметров.Вставить("4", Параметр4);
	КартаПараметров.Вставить("(4)", Параметр4);
	КартаПараметров.Вставить("5", Параметр5);
	КартаПараметров.Вставить("(5)", Параметр5);
	КартаПараметров.Вставить("6", Параметр6);
	КартаПараметров.Вставить("(6)", Параметр6);
	КартаПараметров.Вставить("7", Параметр7);
	КартаПараметров.Вставить("(7)", Параметр7);
	КартаПараметров.Вставить("8", Параметр8);
	КартаПараметров.Вставить("(8)", Параметр8);
	КартаПараметров.Вставить("9", Параметр9);
	КартаПараметров.Вставить("(9)", Параметр9);
	КартаПараметров.Вставить("10", Параметр10);
	КартаПараметров.Вставить("(10)", Параметр10);
	
	Пока Позиция > 0 Цикл
		Результат = Результат + Лев(Шаблон, Позиция - 1);
		СимволПослеПроцента = Сред(Шаблон, Позиция + 1, 1);
		Если СимволПослеПроцента = "(" Тогда
			СимволПослеПроцента = Сред(Шаблон, Позиция + 1, СтрНайтиЛок(Шаблон, ")", , Позиция) - Позиция);
		КонецЕсли;
		Если Сред(Шаблон, Позиция + 1 + 1, 1) = "0" Тогда
			СимволПослеПроцента = СимволПослеПроцента + "0";
		КонецЕсли;
		ПодставляемыйПараметр = КартаПараметров.Получить(СимволПослеПроцента);
		Если ПодставляемыйПараметр = Неопределено Тогда
			Шаблон = Сред(Шаблон, Позиция + СтрДлина(СимволПослеПроцента) + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			Шаблон = Сред(Шаблон, Позиция + СтрДлина(СимволПослеПроцента) + 1);
		КонецЕсли;
		Позиция = СтрНайтиЛок(Шаблон, "%");
	КонецЦикла;
	
	Результат = Результат + Шаблон;
	Возврат Результат;
	
КонецФункции // СтрШаблонСовместимостьСПроцентом

Функция СтрСравнитьРеализация(Строка1, Строка2)
	
	Если СтроковыеФункцииДоступны() Тогда
		Результат = СтрСлужебный83().СтрСравнитьЛок(Строка1, Строка2);
	Иначе
		Результат = СтрСравнитьСовместимость(Строка1, Строка2);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтрСравнитьРеализация

Функция СтрСравнитьСовместимость(Строка1, Строка2)
	
	Результат = 0;
	КоличествоИтераций = Макс(СтрДлина(Строка1), СтрДлина(Строка2));
	
	Для Номер = 1 По КоличествоИтераций Цикл
		Если НРег(Сред(Строка1, Номер, 1)) < НРег(Сред(Строка2, Номер, 1)) Тогда
			Результат = -1;
			Прервать;
		ИначеЕсли НРег(Сред(Строка1, Номер, 1)) > НРег(Сред(Строка2, Номер, 1)) Тогда
			Результат = 1;
			Прервать;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СтрСравнитьСовместимость

Функция СтрРазделитьРеализация(Строка, Разделитель, ВключатьПустые)
	
	Если СтроковыеФункцииДоступны() Тогда
		Результат = СтрСлужебный83().СтрРазделитьЛок(Строка, Разделитель, ВключатьПустые);
	Иначе
		Результат = СтрРазделитьСовместимость(Строка, Разделитель, ВключатьПустые);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтрРазделитьРеализация

Функция СтрРазделитьСовместимость(Знач Строка, Знач Разделитель, ВключатьПустые)
	
	ПропускатьПустыеСтроки = НЕ ВключатьПустые;
	Результат = Новый Массив;
	
	НачалоСтроки = 1;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Позиция, 1);
		Если СтрНайтиЛок(Разделитель, Символ) > 0 Тогда
			Значение = Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки);
			Если НЕ ПропускатьПустыеСтроки ИЛИ НЕ ПустаяСтрока(Значение) Тогда
				Результат.Добавить(Значение);
			КонецЕсли;
			НачалоСтроки = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Значение = Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки);
	Если НЕ ПропускатьПустыеСтроки ИЛИ НЕ ПустаяСтрока(Значение) Тогда
		Результат.Добавить(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтрРазделитьСовместимость

Функция СтрСоединитьРеализация(Строки, Разделитель)
	
	Если СтроковыеФункцииДоступны() Тогда
		Результат = СтрСлужебный83().СтрСоединитьЛок(Строки, Разделитель);
	Иначе
		Результат = СтрСоединитьСовместимость(Строки, Разделитель);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтрСоединитьРеализация

Функция СтрСоединитьСовместимость(Строки, Разделитель)
	
	Результат = "";
	РазделительСтрока = Строка(Разделитель);
	
	ЭтоПерваяСтрока = Истина;
	
	Для Каждого Строка Из Строки Цикл
		
		Если ЭтоПерваяСтрока = Истина Тогда
			ЭтоПерваяСтрока = Ложь;
			Результат = Результат + Строка;
		Иначе
			Результат = Результат + РазделительСтрока + Строка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СтрСоединитьСовместимость

Функция СтрНачинаетсяСРеализация(Строка, СтрокаПоиска)
	
	Возврат Лев(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска;
	
КонецФункции // СтрНачинаетсяСРеализация

Функция СтрЗаканчиваетсяНаРеализация(Строка, СтрокаПоиска)
	
	Возврат Прав(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска;
	
КонецФункции // СтрЗаканчиваетсяНаРеализация

// ПРОЧЕЕ

Процедура СтрокаВДатуРеализацияЗаполнитьЗначенияДатаВремя(ОписаниеТипаДата, Значение,
		ЗначениеДата, ЗначениеВремя, Результат)
	
	НаборЦифр = "1234567890";
	ЗначениеМассивом = СтрРазделитьЛок(Значение, " ");
	Элемент = ЗначениеМассивом[ЗначениеМассивом.ВГраница()];
	Если ЗначениеМассивом.Количество() > 1 Тогда
		
		Два = 2;
		Четыре = 4;
		
		Если СтрДлина(Элемент) = Два ИЛИ СтрДлина(Элемент) = Четыре Тогда
			
			ЭтоТолькоЦифры = СтрРазделитьЛок(Элемент, НаборЦифр, Ложь).Количество() = 0;
			Если ЭтоТолькоЦифры Тогда
				ЗначениеДата = Значение;
				ЗначениеВремя = "";
			Иначе
				ЗначениеВремя = Элемент;
				ЗначениеМассивом.Удалить(ЗначениеМассивом.ВГраница());
				ЗначениеДата = СтрСоединитьЛок(ЗначениеМассивом, " ");
			КонецЕсли;
		Иначе
			
			ЗначениеВремя = Элемент;
			ЗначениеМассивом.Удалить(ЗначениеМассивом.ВГраница());
			ЗначениеДата = СтрСоединитьЛок(ЗначениеМассивом, " ");
		КонецЕсли;
		
	Иначе
		
		ЭтоТолькоЦифры = СтрРазделитьЛок(Элемент, НаборЦифр, Ложь).Количество() = 0;
		Если ЭтоТолькоЦифры Тогда
			СтрокаВДатуРеализацияЗаполнитьЗначенияДатаВремяТолькоЦифры(ОписаниеТипаДата, Элемент, Результат);
		ИначеЕсли СтрНайтиЛок(Элемент, ":") > 0 Тогда
			ЗначениеДата = "";
			ЗначениеВремя = Элемент;
		Иначе
			ЗначениеДата = Элемент;
			ЗначениеВремя = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СтрокаВДатуРеализацияЗаполнитьЗначенияДатаВремя

Процедура СтрокаВДатуРеализацияЗаполнитьЗначенияДатаВремяТолькоЦифры(ОписаниеТипаДата, Элемент, Результат)
	
	Результат = ОписаниеТипаДата.ПривестиЗначение(Элемент);
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		Два = 2;
		Три = 3;
		Пять = 5;
		Шесть = 6;
		Семь = 7;
		ДвадцатьДевять = 29;
		
		Если СтрДлина(Элемент) = Шесть Тогда
			
			ПеревернутаяДата = Сред(Элемент, Пять) + Сред(Элемент, Три, Два) + Лев(Элемент, Два);
			Год = СтрокаВЧислоЛок(Лев(ПеревернутаяДата, Два));
			Если Год <> Неопределено Тогда
				Если Год > ДвадцатьДевять Тогда
					ПеревернутаяДата = "19" + ПеревернутаяДата;
				Иначе
					ПеревернутаяДата = "20" + ПеревернутаяДата;
				КонецЕсли;
				Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрДлина(Элемент) > Семь Тогда
			
			ПеревернутаяДата = Сред(Элемент, Пять) + Сред(Элемент, Три, Два) + Лев(Элемент, Два);
			Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СтрокаВДатуРеализацияЗаполнитьЗначенияДатаВремяТолькоЦифры

Процедура СтрокаВДатуРеализацияОбработатьЗначениеДата(ОписаниеТипаДата, ЗначениеДата, ЧастьДаты)
	
	Если НЕ ЗначениеЗаполнено(ЗначениеДата) ИЛИ ЧастьДаты = ЧастиДаты.Время Тогда
		ЗначениеДата = "00010101";
		Возврат;
	КонецЕсли;
	
	НаборЦифр = "1234567890";
	НаборРазделителей = СтрСоединитьЛок(СтрРазделитьЛок(ЗначениеДата, НаборЦифр, Ложь), "");
	ЗначениеДатаМассивом = СтрРазделитьЛок(ЗначениеДата, НаборРазделителей, Ложь);
	
	ЭтоТолькоЦифры = СтрРазделитьЛок(ЗначениеДата, НаборЦифр, Ложь).Количество() = 0;
	Если НЕ ЭтоТолькоЦифры Тогда
		СтрокаВДатуРеализацияОбработатьЗначениеДатаЭтоНеТолькоЦифры(ЗначениеДата, ЗначениеДатаМассивом);
	Иначе
		СтрокаВДатуРеализацияОбработатьЗначениеДатаЭтоТолькоЦифры(ОписаниеТипаДата, ЗначениеДата);
	КонецЕсли;
	
КонецПроцедуры // СтрокаВДатуРеализацияОбработатьЗначениеДата

Процедура СтрокаВДатуРеализацияОбработатьЗначениеДатаЭтоНеТолькоЦифры(ЗначениеДата, ЗначениеДатаМассивом)
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	Год = 1;
	Месяц = 1;
	День = 1;
	Два = 2;
	Три = 3;
	Четыре = 4;
	
	Если СтрДлина(ЗначениеДатаМассивом[0]) = Четыре Тогда
		Год = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[0]);
		ГодВНачале = Истина;
	Иначе
		День = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[0]);
		ГодВНачале = Ложь;
	КонецЕсли;
	
	Если ЗначениеДатаМассивом.Количество() = Два Тогда
		Месяц = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[1]);
	КонецЕсли;
	
	Если ЗначениеДатаМассивом.Количество() > Два Тогда
		Месяц = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[1]);
		Если ГодВНачале Тогда
			День = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[Два]);
		Иначе
			Год = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[Два]);
		КонецЕсли;
	КонецЕсли;
	
	Если СтрДлина(Год) < Три Тогда
		ГодЧислом = ОписаниеТипаЧисло.ПривестиЗначение(Год);
		Тридцать = 30;
		Если ГодЧислом < Тридцать Тогда
			ДвеТысячи = 2000;
			Год = ДвеТысячи + ГодЧислом;
		Иначе
			ТысячаДевятьсот = 1900;
			Год = ТысячаДевятьсот + ГодЧислом;
		КонецЕсли;
	Иначе
		Год = ОписаниеТипаЧисло.ПривестиЗначение(Год);
	КонецЕсли;
	
	ЗначениеДата = Формат(Год, "ЧЦ=4; ЧН=0001; ЧВН=; ЧГ=0")
		+ Формат(Месяц, "ЧЦ=2; ЧН=01; ЧВН=; ЧГ=0")
		+ Формат(День, "ЧЦ=2; ЧН=01; ЧВН=; ЧГ=0");
	
КонецПроцедуры // СтрокаВДатуРеализацияОбработатьЗначениеДатаЭтоНеТолькоЦифры

Процедура СтрокаВДатуРеализацияОбработатьЗначениеДатаЭтоТолькоЦифры(ОписаниеТипаДата, ЗначениеДата)
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	Два = 2;
	Три = 3;
	Шесть = 6;
	Восемь = 8;
	Тридцать = 30;
	
	Если СтрДлина(ЗначениеДата) = Шесть Тогда
		
		Год = Прав(ЗначениеДата, Два);
		ГодЧислом = ОписаниеТипаЧисло.ПривестиЗначение(Год);
		Если ГодЧислом < Тридцать Тогда
			ДвеТысячи = 2000;
			ЗначениеДата = ДвеТысячи + Год + Сред(ЗначениеДата, Три, Два) + Лев(ЗначениеДата, Два);
		Иначе
			ТысячаДевятьсот = 1900;
			ЗначениеДата = ТысячаДевятьсот + Год + Сред(ЗначениеДата, Три, Два) + Лев(ЗначениеДата, Два);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрДлина(ЗначениеДата) = Восемь Тогда
		
		Результат = ОписаниеТипаДата.ПривестиЗначение(ЗначениеДата);
		Пять = 5;
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			ПеревернутаяДата = Сред(ЗначениеДата, Пять) + Сред(ЗначениеДата, Три, Два) + Лев(ЗначениеДата, Два);
			Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
			Если ЗначениеЗаполнено(Результат) Тогда
				ЗначениеДата = ПеревернутаяДата;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СтрокаВДатуРеализацияОбработатьЗначениеДатаЭтоТолькоЦифры

Процедура СтрокаВДатуРеализацияОбработатьЗначениеВремя(ЗначениеВремя, ЧастьДаты)
	
	Если НЕ ЗначениеЗаполнено(ЗначениеВремя) ИЛИ ЧастьДаты = ЧастиДаты.Дата Тогда
		ЗначениеВремя = "000000";
		Возврат;
	КонецЕсли;
	
	НаборЦифр = "1234567890";
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	ЭтоТолькоЦифры = СтрРазделитьЛок(ЗначениеВремя, НаборЦифр, Ложь).Количество() = 0;
	Если НЕ ЭтоТолькоЦифры Тогда
		
		НаборРазделителей = СтрСоединитьЛок(СтрРазделитьЛок(ЗначениеВремя, НаборЦифр, Ложь), "");
		ЗначениеВремяМассивом = СтрРазделитьЛок(ЗначениеВремя, НаборРазделителей, Ложь);
		
		Час = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[0]);
		Два = 2;
		Минута = 0;
		Секунда = 0;
		
		Если ЗначениеВремяМассивом.Количество() = Два Тогда
			Минута = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[1]);
		КонецЕсли;
		Если ЗначениеВремяМассивом.Количество() > Два Тогда
			Минута = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[1]);
			Секунда = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[Два]);
		КонецЕсли;
		
		ШаблонФормата = "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0";
		ЗначениеВремя = Формат(Час, ШаблонФормата)
			+ Формат(Минута, ШаблонФормата)
			+ Формат(Секунда, ШаблонФормата);
		
	КонецЕсли;
	
КонецПроцедуры // СтрокаВДатуРеализацияОбработатьЗначениеВремя

Функция СтрокаВДатуРеализация(Знач Значение, Знач ЧастьДаты = Неопределено)
	
	НаборЦифр = "1234567890";
	Два = 2;
	
	Если ТипЗнч(ЧастьДаты) <> Тип("ЧастиДаты") Тогда
		ЧастьДаты = ЧастиДаты.Дата;
	КонецЕсли;
	
	ОписаниеТипаДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастьДаты));
	Значение = ВРег(СтрСоединитьЛок(СтрРазделитьЛок(СокрЛП(Значение), Символы.НПП + Символы.ПС + Символы.Таб), " "));
	Результат = ОписаниеТипаДата.ПривестиЗначение(Значение);
	
	Для НомерМесяца = 1 По 12 Цикл
		Значение = СтрЗаменить(Значение, ВРег(Формат(Дата(1, НомерМесяца, Два), "ДФ=ММММ")),
				Формат(НомерМесяца, "ЧЦ=2; ЧВН="));
		Значение = СтрЗаменить(Значение, ВРег(Формат(Дата(1, НомерМесяца, Два), "ДФ=MMM")),
				Формат(НомерМесяца, "ЧЦ=2; ЧВН="));
	КонецЦикла;
	
	МассивНеЦифр = СтрРазделитьЛок(Значение, НаборЦифр);
	Если МассивНеЦифр.Количество() < Два Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПозицияПервойЦифры = СтрДлина(МассивНеЦифр[0]);
	ПозицияПоследнейЦифры = СтрДлина(Значение) - СтрДлина(МассивНеЦифр[МассивНеЦифр.ВГраница()]);
	Значение = Сред(Значение, ПозицияПервойЦифры, ПозицияПоследнейЦифры - ПозицияПервойЦифры);
	Если ПустаяСтрока(Значение) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Неопределено;
	ЗначениеДата = "";
	ЗначениеВремя = "";
	
	СтрокаВДатуРеализацияЗаполнитьЗначенияДатаВремя(ОписаниеТипаДата, Значение, ЗначениеДата, ЗначениеВремя, Результат);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтрокаВДатуРеализацияОбработатьЗначениеДата(ОписаниеТипаДата, ЗначениеДата, ЧастьДаты);
	СтрокаВДатуРеализацияОбработатьЗначениеВремя(ЗначениеВремя, ЧастьДаты);
	
	Результат = ОписаниеТипаДата.ПривестиЗначение(ЗначениеДата + ЗначениеВремя);
	
	Возврат Результат;
	
КонецФункции // СтрокаВДатуРеализация

Функция ВерсияПлатформыБольшеИлиРавнаРеализация(Версия)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	РезультатСравнения = СравнитьВерсииЛок(СистемнаяИнформация.ВерсияПриложения, Версия);
	Результат = РезультатСравнения > 0 ИЛИ РезультатСравнения = 0;
	
	Возврат Результат;
	
КонецФункции // ВерсияПлатформыБольшеИлиРавнаРеализация

Функция РазложитьСтрокуВМассивПодстрокСтандартно(
		Значение, Разделитель, ПропускатьПустыеСтроки, СокращатьНепечатаемыеСимволы)
	
	Результат = Неопределено;
	
	Если СтрДлина(Разделитель) = 1
		И ПропускатьПустыеСтроки = Неопределено
		И СокращатьНепечатаемыеСимволы Тогда
		
		Результат = СтрРазделитьЛок(Значение, Разделитель, Ложь);
		Для Индекс = 0 По Результат.ВГраница() Цикл
			Результат[Индекс] = СокрЛП(Результат[Индекс]);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // РазложитьСтрокуВМассивПодстрокСтандартно

Функция РазложитьСтрокуВМассивПодстрокПоПозиции(
		Знач Значение, Разделитель, ПропускатьПустыеСтроки, СокращатьНепечатаемыеСимволы)
	
	Результат = Новый Массив;
	
	Позиция = СтрНайтиЛок(Значение, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Значение, Позиция - 1);
		Если НЕ ПропускатьПустыеСтроки ИЛИ НЕ ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайтиЛок(Значение, Разделитель);
	КонецЦикла;
	
	Если НЕ ПропускатьПустыеСтроки ИЛИ НЕ ПустаяСтрока(Значение) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Значение));
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // РазложитьСтрокуВМассивПодстрокПоПозиции

Функция КодЦифрыНГраница()
	
	Возврат 48;
	
КонецФункции // КодЦифрыНГраница

Функция КодЦифрыВГраница()
	
	Возврат 57;
	
КонецФункции // КодЦифрыВГраница

Функция КодЛатВРегНГраница()
	
	Возврат 65;
	
КонецФункции // КодЛатВРегНГраница

Функция КодЛатВРегВГраница()
	
	Возврат 90;
	
КонецФункции // КодЛатВРегВГраница

Функция КодЛатНРегНГраница()
	
	Возврат 97;
	
КонецФункции // КодЛатНРегНГраница

Функция КодЛатНРегВГраница()
	
	Возврат 122;
	
КонецФункции // КодЛатНРегВГраница

Функция СтрСлужебный83()
	
	Если СтрСлужебный83Лок = Неопределено Тогда
		Структура = Новый Структура("ИспользуемоеИмяФайла", Неопределено);
		ЗаполнитьЗначенияСвойств(Структура, ЭтотОбъект);
		Если Структура.ИспользуемоеИмяФайла = Неопределено Тогда
			СтрСлужебный83Лок = Новый("DataProcessorObject.КонтурДиадокСтдСтрСлужебный83");
		Иначе
			СтрСлужебный83Лок = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтрСлужебный83");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрСлужебный83Лок;
	
КонецФункции // СтрСлужебный83

Функция МассивБезПоддержки836()
	
	РежимыБезПоддержки = Новый Структура;
	РежимыБезПоддержки.Вставить("Версия8_1");
	РежимыБезПоддержки.Вставить("Версия8_2_13");
	РежимыБезПоддержки.Вставить("Версия8_2_16");
	РежимыБезПоддержки.Вставить("Версия8_3_1");
	РежимыБезПоддержки.Вставить("Версия8_3_2");
	РежимыБезПоддержки.Вставить("Версия8_3_3");
	РежимыБезПоддержки.Вставить("Версия8_3_4");
	РежимыБезПоддержки.Вставить("Версия8_3_5");
	
	ЗаполнитьЗначенияСвойств(РежимыБезПоддержки, Метаданные.СвойстваОбъектов.РежимСовместимости);
	
	Результат = Новый Массив;
	Для Каждого Элемент Из РежимыБезПоддержки Цикл
		Если Элемент.Значение <> Неопределено Тогда
			Результат.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // МассивБезПоддержки836

Функция ПроверитьСтроковыеФункцииДоступны()
	
	РежимСовместимостиБезПоддержки = МассивБезПоддержки836().Найти(Метаданные.РежимСовместимости) <> Неопределено;
	Если РежимСовместимостиБезПоддержки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивВерсий = Новый Массив;
	МассивВерсий.Добавить("8.2.");
	МассивВерсий.Добавить("8.3.1.");
	МассивВерсий.Добавить("8.3.2.");
	МассивВерсий.Добавить("8.3.3.");
	МассивВерсий.Добавить("8.3.4.");
	МассивВерсий.Добавить("8.3.5.");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Для Каждого Элемент Из МассивВерсий Цикл
		Если Найти(СистемнаяИнформация.ВерсияПриложения, Элемент) = 1 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ПроверитьСтроковыеФункцииДоступны

Функция СтроковыеФункцииДоступны()
	
	Если СтроковыеФункцииДоступныЛок = Неопределено Тогда
		СтроковыеФункцииДоступныЛок = ПроверитьСтроковыеФункцииДоступны();
	КонецЕсли;
	
	Возврат СтроковыеФункцииДоступныЛок;
	
КонецФункции // СтроковыеФункцииДоступны

Функция СтрРазвернутьРеализация(Знач Строка)
	
	Результат = "";
	ВторойСимвол = 2;
	Для Сч = 1 По СтрДлина(Строка) Цикл
		Результат = Лев(Строка, 1) + Результат;
		Строка = Сред(Строка, ВторойСимвол);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СтрРазвернутьРеализация

Функция РазложитьСтрокуВМассивПодстрокРеализация(
		Знач Значение,
		Разделитель,
		Знач ПропускатьПустыеСтроки,
		СокращатьНепечатаемыеСимволы)
	
	Результат = РазложитьСтрокуВМассивПодстрокСтандартно(
			Значение, Разделитель, ПропускатьПустыеСтроки, СокращатьНепечатаемыеСимволы);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = (Разделитель = " ");
		Если ПустаяСтрока(Значение) Тогда
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Результат = РазложитьСтрокуВМассивПодстрокПоПозиции(
			Значение, Разделитель, ПропускатьПустыеСтроки, СокращатьНепечатаемыеСимволы);
	
	Возврат Результат;
	
КонецФункции // РазложитьСтрокуВМассивПодстрокРеализация

Функция РазложитьСтрокуВМассивСловРеализация(Значение, РазделителиСлов)
	
	Слова = Новый Массив;
	
	РазмерТекста = СтрДлина(Значение);
	НачалоСлова = 1;
	Для Позиция = 1 По РазмерТекста Цикл
		КодСимвола = КодСимвола(Значение, Позиция);
		Если ЭтоРазделительСловЛок(КодСимвола, РазделителиСлов) Тогда
			Если Позиция <> НачалоСлова Тогда
				Слова.Добавить(Сред(Значение, НачалоСлова, Позиция - НачалоСлова));
			КонецЕсли;
			НачалоСлова = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Позиция <> НачалоСлова Тогда
		Слова.Добавить(Сред(Значение, НачалоСлова, Позиция - НачалоСлова));
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции // РазложитьСтрокуВМассивСловРеализация

Функция ПодставитьПараметрыВСтрокуРеализация(Знач ШаблонСтроки,
		Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
		Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
		Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	ЕстьПараметрыСПроцентом = СтрНайтиЛок(Параметр1, "%")
		ИЛИ СтрНайтиЛок(Параметр2, "%")
		ИЛИ СтрНайтиЛок(Параметр3, "%")
		ИЛИ СтрНайтиЛок(Параметр4, "%")
		ИЛИ СтрНайтиЛок(Параметр5, "%")
		ИЛИ СтрНайтиЛок(Параметр6, "%")
		ИЛИ СтрНайтиЛок(Параметр7, "%")
		ИЛИ СтрНайтиЛок(Параметр8, "%")
		ИЛИ СтрНайтиЛок(Параметр9, "%");
	
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПодставитьПараметрыСПроцентом(ШаблонСтроки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	КонецЕсли;
	
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%2", Параметр2);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%3", Параметр3);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%4", Параметр4);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%5", Параметр5);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%6", Параметр6);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%7", Параметр7);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%8", Параметр8);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%9", Параметр9);
	
	Возврат ШаблонСтроки;
	
КонецФункции // ПодставитьПараметрыВСтрокуРеализация

Функция ПодставитьПараметрыВСтрокуИзМассиваРеализация(ШаблонСтроки, Параметры)
	
	СтрокаРезультата = ШаблонСтроки;
	
	Индекс = Параметры.Количество();
	Пока Индекс > 0 Цикл
		Значение = Параметры[Индекс - 1];
		Если НЕ ПустаяСтрока(Значение) Тогда
			СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "%" + Формат(Индекс, "ЧГ="), Значение);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат СтрокаРезультата;
	
КонецФункции // ПодставитьПараметрыВСтрокуИзМассиваРеализация

Функция ЭтоРазделительСловРеализация(КодСимвола, РазделителиСлов)
	
	Если РазделителиСлов <> Неопределено Тогда
		Возврат СтрНайтиЛок(РазделителиСлов, Символ(КодСимвола)) > 0;
	КонецЕсли;
	
	Диапазон = "Мин, Макс";
	ЦифрыМин = 48;
	ЦифрыМакс = 57;
	
	ЛатиницаВРегМин = 65;
	ЛатиницаВРегМакс = 90;
	
	ЛатиницаНРегМин = 97;
	ЛатиницаНРегМакс = 122;
	
	КириллицаМин = 1040;
	КириллицаМакс = 1103;
	
	СимволВРегЕ = 1025;
	СимволНРегЕ = 1105;
	
	Символ_ = 95;
	
	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура(Диапазон, ЦифрыМин, ЦифрыМакс)); // цифры
	Диапазоны.Добавить(Новый Структура(Диапазон, ЛатиницаВРегМин, ЛатиницаВРегМакс)); // латиница большие
	Диапазоны.Добавить(Новый Структура(Диапазон, ЛатиницаНРегМин, ЛатиницаНРегМакс)); // латиница маленькие
	Диапазоны.Добавить(Новый Структура(Диапазон, КириллицаМин, КириллицаМакс)); // кириллица
	Диапазоны.Добавить(Новый Структура(Диапазон, СимволВРегЕ, СимволВРегЕ)); // символ "Ё"
	Диапазоны.Добавить(Новый Структура(Диапазон, СимволНРегЕ, СимволНРегЕ)); // символ "ё"
	Диапазоны.Добавить(Новый Структура(Диапазон, Символ_, Символ_)); // символ "_"
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ЭтоРазделительСловРеализация

Функция ПодставитьПараметрыСПроцентом(Знач СтрокаПодстановки,
		Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
		Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
		Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = СтрНайтиЛок(СтрокаПодстановки, "%");
	
	Пока Позиция > 0 Цикл
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = Неопределено;
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр = Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр = Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр = Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр = Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр = Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр = Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр = Параметр7;
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр = Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр = Параметр9;
		Иначе
			ПодставляемыйПараметр = Неопределено;
		КонецЕсли;
		Если ПодставляемыйПараметр = Неопределено Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1 + 1);
		КонецЕсли;
		Позиция = СтрНайтиЛок(СтрокаПодстановки, "%");
	КонецЦикла;
	
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
	
КонецФункции // ПодставитьПараметрыСПроцентом

Функция ВставитьПараметрыВСтрокуРеализация(ШаблонСтроки, Параметры)
	
	Результат = ШаблонСтроки;
	Для Каждого Параметр Из Параметры Цикл
		Результат = СтрЗаменить(Результат, "[" + Параметр.Ключ + "]", Параметр.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВставитьПараметрыВСтрокуРеализация

Функция ПараметрыИзСтрокиРеализация(СтрокаПараметров, Разделитель, ЧитатьВСоответствие = Ложь)
	
	Если ЧитатьВСоответствие Тогда
		Результат = Новый Соответствие;
	Иначе
		Результат = Новый Структура;
	КонецЕсли;
	
	ОписаниеПараметра = "";
	НайденоНачалоСтроки = Ложь;
	НомерПоследнегоСимвола = СтрДлина(СтрокаПараметров);
	Для НомерСимвола = 1 По НомерПоследнегоСимвола Цикл
		Символ = Сред(СтрокаПараметров, НомерСимвола, 1);
		Если Символ = """" Тогда
			НайденоНачалоСтроки = НЕ НайденоНачалоСтроки;
		КонецЕсли;
		Если Символ <> Разделитель ИЛИ НайденоНачалоСтроки Тогда
			ОписаниеПараметра = ОписаниеПараметра + Символ;
		КонецЕсли;
		Если Символ = Разделитель И НЕ НайденоНачалоСтроки ИЛИ НомерСимвола = НомерПоследнегоСимвола Тогда
			Позиция = СтрНайтиЛок(ОписаниеПараметра, "=");
			Если Позиция > 0 Тогда
				ИмяПараметра = СокрЛП(Лев(ОписаниеПараметра, Позиция - 1));
				ЗначениеПараметра = СокрЛП(Сред(ОписаниеПараметра, Позиция + 1));
				ЗначениеПараметра = СократитьДвойныеКавычкиЛок(ЗначениеПараметра);
				Результат.Вставить(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
			ОписаниеПараметра = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПараметрыИзСтрокиРеализация

Функция ТолькоЦифрыВСтрокеРеализация(Знач Значение, Знач Устаревший, Знач ПробелыЗапрещены)
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
	
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	
	Значение = СтрЗаменить(Значение, "0", "");
	Значение = СтрЗаменить(Значение, "1", "");
	Значение = СтрЗаменить(Значение, "2", "");
	Значение = СтрЗаменить(Значение, "3", "");
	Значение = СтрЗаменить(Значение, "4", "");
	Значение = СтрЗаменить(Значение, "5", "");
	Значение = СтрЗаменить(Значение, "6", "");
	Значение = СтрЗаменить(Значение, "7", "");
	Значение = СтрЗаменить(Значение, "8", "");
	Значение = СтрЗаменить(Значение, "9", "");
	
	Возврат СтрДлина(Значение) = 0;
	
КонецФункции // ТолькоЦифрыВСтрокеРеализация

Функция ТолькоЛатиницаВСтрокеРеализация(СтрокаПроверки, УчитыватьРазделителиСлов, ДопустимыеСимволы)
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	
	Для Индекс = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		КодыДопустимыхСимволов.Добавить(КодСимвола(Сред(ДопустимыеСимволы, Индекс, 1)));
	КонецЦикла;
	
	Результат = Истина;
	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		НеПодходит = ((КодСимвола < КодЛатВРегНГраница())
				ИЛИ (КодСимвола > КодЛатВРегВГраница() И КодСимвола < КодЛатНРегНГраница())
				ИЛИ (КодСимвола > КодЛатНРегВГраница()))
			И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено)
			И НЕ (НЕ УчитыватьРазделителиСлов И ЭтоРазделительСловЛок(КодСимвола));
		Если НеПодходит Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ТолькоЛатиницаВСтрокеРеализация

Функция СократитьДвойныеКавычкиРеализация(Знач Значение)
	
	Два = 2;
	Пока СтрНачинаетсяСЛок(Значение, """") Цикл
		Значение = Сред(Значение, Два);
	КонецЦикла;
	
	Пока СтрЗаканчиваетсяНаЛок(Значение, """") Цикл
		Значение = Лев(Значение, СтрДлина(Значение) - 1);
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции // СократитьДвойныеКавычкиРеализация

Функция УдалитьПоследнийСимволВСтрокеРеализация(Текст, ЧислоСимволов)
	
	Возврат Лев(Текст, СтрДлина(Текст) - ЧислоСимволов);
	
КонецФункции // УдалитьПоследнийСимволВСтрокеРеализация

Функция ЭтоУникальныйИдентификаторРеализация(Значение)
	
	Шаблон = "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX";
	
	Если СтрДлина(Шаблон) <> СтрДлина(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодСимволаИксВРег = 88;
	КодСимволаФНРег = 102;
	КодСимволаФВРег = 70;
	КодСимволаТире = 45;
	
	Для Позиция = 1 По СтрДлина(Значение) Цикл
		КодСимвола = КодСимвола(Значение, Позиция);
		НеПодходит = КодСимвола(Шаблон, Позиция) = КодСимволаИксВРег // X
			И ((КодСимвола < КодЦифрыНГраница() ИЛИ КодСимвола > КодЦифрыВГраница()) // 0..9
				И (КодСимвола < КодЛатНРегНГраница() ИЛИ КодСимвола > КодСимволаФНРег) // a..f
				И (КодСимвола < КодЛатВРегНГраница() ИЛИ КодСимвола > КодСимволаФВРег)) // A..F
			ИЛИ КодСимвола(Шаблон, Позиция) = КодСимволаТире И КодСимвола <> КодСимволаТире; // -
		Если НеПодходит Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ЭтоУникальныйИдентификаторРеализация

Функция СформироватьСтрокуСимволовРеализация(Символ, ДлинаСтроки)
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СформироватьСтрокуСимволовРеализация

Функция ДополнитьСтрокуРеализация(Знач Значение, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева")
	
	// Длина символа не должна превышать единицы.
	Символ = Лев(Символ, 1);
	
	// Удаляем крайние пробелы слева и справа строки.
	Значение = СокрЛП(Значение);
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Значение);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = СформироватьСтрокуСимволовЛок(Символ, КоличествоСимволовНадоДобавить);
		Если ВРег(Режим) = "СЛЕВА" Тогда
			Значение = СтрокаДляДобавления + Значение;
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			Значение = Значение + СтрокаДляДобавления;
		Иначе
			ВызватьИсключение "не предполагаемый режим";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ДополнитьСтрокуРеализация

Функция УдалитьПовторяющиесяСимволыРеализация(Знач Значение, УдаляемыйСимвол, Режим = "Слева")
	
	Два = 2;
	Если ВРег(Режим) = "СЛЕВА" Тогда
		Пока Лев(Значение, 1) = УдаляемыйСимвол Цикл
			Значение = Сред(Значение, Два);
		КонецЦикла;
	ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
		Пока Прав(Значение, 1) = УдаляемыйСимвол Цикл
			Значение = Лев(Значение, СтрДлина(Значение) - 1);
		КонецЦикла;
	Иначе
		ВызватьИсключение "не предполагаемый режим";
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // УдалитьПовторяющиесяСимволыРеализация

Функция ЗаменитьОдниСимволыДругимиРеализация(ЗаменяемыеСимволы, Значение, СимволыЗамены)
	
	Результат = Значение;
	
	Для НомерСимвола = 1 По СтрДлина(ЗаменяемыеСимволы) Цикл
		Результат = СтрЗаменить(Результат, Сред(ЗаменяемыеСимволы, НомерСимвола, 1), Сред(СимволыЗамены, НомерСимвола, 1));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ЗаменитьОдниСимволыДругимиРеализация

Функция ПреобразоватьЧислоВРимскуюНотациюРеализация(Знач АрабскоеЧисло, ИспользоватьКириллицу)
	
	РимскоеЧисло = "";
	Три = 3;
	Два = 2;
	АрабскоеЧисло = ДополнитьСтрокуЛок(АрабскоеЧисло, Три);
	
	Если ИспользоватьКириллицу Тогда
		
		c1 = "1";
		c5 = "У";
		c10 = "Х";
		c50 = "Л";
		c100 = "С";
		c500 = "Д";
		c1000 = "М";
		
	Иначе
		
		c1 = "I";
		c5 = "V";
		c10 = "X";
		c50 = "L";
		c100 = "C";
		c500 = "D";
		c1000 = "M";
		
	КонецЕсли;
	
	Единицы = Число(Сред(АрабскоеЧисло, Три, 1));
	Десятки = Число(Сред(АрабскоеЧисло, Два, 1));
	Сотни = Число(Сред(АрабскоеЧисло, 1, 1));
	
	РимскоеЧисло = РимскоеЧисло + ПреобразоватьЦифруВРимскуюНотациюЛок(Сотни, c100, c500, c1000);
	РимскоеЧисло = РимскоеЧисло + ПреобразоватьЦифруВРимскуюНотациюЛок(Десятки, c10, c50, c100);
	РимскоеЧисло = РимскоеЧисло + ПреобразоватьЦифруВРимскуюНотациюЛок(Единицы, c1, c5, c10);
	
	Возврат РимскоеЧисло;
	
КонецФункции // ПреобразоватьЧислоВРимскуюНотациюРеализация

Функция ПреобразоватьЦифруВРимскуюНотациюЛок(Цифра, РимскаяЕдиница, РимскаяПятерка, РимскаяДесятка)
	
	Один = 1;
	Два = 2;
	Три = 3;
	Четыре = 4;
	Пять = 5;
	Шесть = 6;
	Семь = 7;
	Восемь = 8;
	Девять = 9;
	
	РимскаяЦифра = "";
	Если Цифра = Один Тогда
		РимскаяЦифра = РимскаяЕдиница;
	КонецЕсли;
	Если Цифра = Два Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяЕдиница;
	КонецЕсли;
	Если Цифра = Три Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяЕдиница + РимскаяЕдиница;
	КонецЕсли;
	Если Цифра = Четыре Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяПятерка;
	КонецЕсли;
	Если Цифра = Пять Тогда
		РимскаяЦифра = РимскаяПятерка;
	КонецЕсли;
	Если Цифра = Шесть Тогда
		РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница;
	КонецЕсли;
	Если Цифра = Семь Тогда
		РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница + РимскаяЕдиница;
	КонецЕсли;
	Если Цифра = Восемь Тогда
		РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница + РимскаяЕдиница + РимскаяЕдиница;
	КонецЕсли;
	Если Цифра = Девять Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяДесятка;
	КонецЕсли;
	
	Возврат РимскаяЦифра;
	
КонецФункции // ПреобразоватьЦифруВРимскуюНотациюЛок

Процедура ПреобразоватьЧислоВАрабскуюНотациюРеализацияОбработатьСимвол(Сч, ЧислоСимволов, АрабскоеЧисло, РимскоеЧисло,
		c1, c5, c10, c50, c100, c500, c1000)
	
	Тысяча = 1000;
	Пятьсот = 500;
	Сто = 100;
	Пятьдесят = 50;
	Десять = 10;
	Пять = 5;
	
	СоответствиеЧисел = Новый Соответствие;
	СоответствиеЧисел.Вставить(c1000, Тысяча);
	СоответствиеЧисел.Вставить(c500, Пятьсот);
	СоответствиеЧисел.Вставить(c100, Сто);
	СоответствиеЧисел.Вставить(c50, Пятьдесят);
	СоответствиеЧисел.Вставить(c10, Десять);
	СоответствиеЧисел.Вставить(c5, Пять);
	СоответствиеЧисел.Вставить(c1, 1);
	
	ТекущееЧисло = ВРег(Сред(РимскоеЧисло, Сч, 1));
	ТекущееАрабскоеЧисло = СоответствиеЧисел[ТекущееЧисло];
	Если ТекущееАрабскоеЧисло = Неопределено Тогда
		ВызватьИсключение "Ошибка значения: " + ТекущееЧисло;
	КонецЕсли;
	
	Если Сч >= ЧислоСимволов Тогда
		АрабскоеЧисло = АрабскоеЧисло + СоответствиеЧисел[ТекущееЧисло];
		Возврат;
	КонецЕсли;
	
	СледующееЧисло = ВРег(Сред(РимскоеЧисло, Сч + 1, 1));
	Если ПреобразоватьЧислоВАрабскуюНотациюОтрицательныйСдвиг(ТекущееЧисло, СледующееЧисло,
			c1, c5, c10, c50, c100, c500, c1000) Тогда
		Множитель = -1;
	Иначе
		Множитель = 1;
	КонецЕсли;
	
	АрабскоеЧисло = АрабскоеЧисло + (СоответствиеЧисел[ТекущееЧисло] * Множитель);
	
КонецПроцедуры // ПреобразоватьЧислоВАрабскуюНотациюРеализацияОбработатьСимвол

Функция ПреобразоватьЧислоВАрабскуюНотациюОтрицательныйСдвиг(ТекущееЧисло, СледующееЧисло,
		c1, c5, c10, c50, c100, c500, c1000)
	
	Возврат (ТекущееЧисло = c100 И (СледующееЧисло = c500 ИЛИ СледующееЧисло = c1000))
		ИЛИ (ТекущееЧисло = c10 И (СледующееЧисло = c50 ИЛИ СледующееЧисло = c100))
		ИЛИ (ТекущееЧисло = c1 И (СледующееЧисло = c5 ИЛИ СледующееЧисло = c10));
	
КонецФункции // ПреобразоватьЧислоВАрабскуюНотациюОтрицательныйСдвиг

Функция ПреобразоватьЧислоВАрабскуюНотациюРеализация(Знач РимскоеЧисло, ИспользоватьКириллицу = Истина)
	
	АрабскоеЧисло = 0;
	
	Если ИспользоватьКириллицу Тогда
		c1 = "1";
		c5 = "У";
		c10 = "Х";
		c50 = "Л";
		c100 = "С";
		c500 = "Д";
		c1000 = "М";
	Иначе
		c1 = "I";
		c5 = "V";
		c10 = "X";
		c50 = "L";
		c100 = "C";
		c500 = "D";
		c1000 = "M";
	КонецЕсли;
	
	РимскоеЧисло = СтрЗаменить(СокрЛП(РимскоеЧисло), " ", "");
	ЧислоСимволов = СтрДлина(РимскоеЧисло);
	
	Для Сч = 1 По ЧислоСимволов Цикл
		ПреобразоватьЧислоВАрабскуюНотациюРеализацияОбработатьСимвол(Сч, ЧислоСимволов, АрабскоеЧисло, РимскоеЧисло,
			c1, c5, c10, c50, c100, c500, c1000);
	КонецЦикла;
	
	Возврат АрабскоеЧисло;
	
КонецФункции // ПреобразоватьЧислоВАрабскуюНотациюРеализация

Функция ИзвлечьТекстИзHTMLРеализация(Знач ИсходныйТекст)
	
	Результат = "";
	Текст = НРег(ИсходныйТекст);
	
	Пять = 5;
	Восемь = 8;
	Девять = 9;
	// отрезаем все что не body
	Позиция = СтрНайтиЛок(Текст, "<body");
	Если Позиция > 0 Тогда
		Текст = Сред(Текст, Позиция + Пять);
		ИсходныйТекст = Сред(ИсходныйТекст, Позиция + Пять);
		Позиция = СтрНайтиЛок(Текст, ">");
		Если Позиция > 0 Тогда
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		КонецЕсли;
	КонецЕсли;
	
	Позиция = СтрНайтиЛок(Текст, "</body>");
	Если Позиция > 0 Тогда
		Текст = Лев(Текст, Позиция - 1);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1);
	КонецЕсли;
	
	// вырезаем скрипты
	Позиция = СтрНайтиЛок(Текст, "<script");
	Пока Позиция > 0 Цикл
		ПозицияЗакрывающегоТега = СтрНайтиЛок(Текст, "</script>");
		Если ПозицияЗакрывающегоТега = 0 Тогда
			// Не найден закрывающий тег - вырезаем оставшийся текст.
			ПозицияЗакрывающегоТега = СтрДлина(Текст);
		КонецЕсли;
		Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + Девять);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + Девять);
		Позиция = СтрНайтиЛок(Текст, "<script");
	КонецЦикла;
	
	// вырезаем стили
	Позиция = СтрНайтиЛок(Текст, "<style");
	Пока Позиция > 0 Цикл
		ПозицияЗакрывающегоТега = СтрНайтиЛок(Текст, "</style>");
		Если ПозицияЗакрывающегоТега = 0 Тогда
			// Не найден закрывающий тег - вырезаем оставшийся текст.
			ПозицияЗакрывающегоТега = СтрДлина(Текст);
		КонецЕсли;
		Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + Восемь);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + Восемь);
		Позиция = СтрНайтиЛок(Текст, "<style");
	КонецЦикла;
	
	// вырезаем все теги
	Позиция = СтрНайтиЛок(Текст, "<");
	Пока Позиция > 0 Цикл
		Результат = Результат + Лев(ИсходныйТекст, Позиция - 1);
		Текст = Сред(Текст, Позиция + 1);
		ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		Позиция = СтрНайтиЛок(Текст, ">");
		Если Позиция > 0 Тогда
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		КонецЕсли;
		Позиция = СтрНайтиЛок(Текст, "<");
	КонецЦикла;
	Результат = Результат + ИсходныйТекст;
	МассивСтрок = РазложитьСтрокуВМассивПодстрокЛок(Результат, Символы.ПС, Истина, Истина);
	
	Возврат СокрЛП(СтрСоединитьЛок(МассивСтрок, Символы.ПС));
	
КонецФункции // ИзвлечьТекстИзHTMLРеализация

Функция СтрокаВЧислоРеализация(Знач Значение)
	
	Значение = СтрЗаменить(Значение, " ", "");
	Если СтрНачинаетсяСЛок(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) ИЛИ СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Если Результат <> 0 И НЕ ПустаяСтрока(СтрокаБезНулей) Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // СтрокаВЧислоРеализация

Функция СтрокаСодержитТолькоДопустимыеСимволы(Строка, ДопустимыеСимволы)
	
	МассивСимволов = Новый Массив;
	Для Позиция = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		МассивСимволов.Добавить(Сред(ДопустимыеСимволы, Позиция, 1));
	КонецЦикла;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		Если МассивСимволов.Найти(Сред(Строка, Позиция, 1)) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // СтрокаСодержитТолькоДопустимыеСимволы

Функция ЕстьСимволыВНачалеВКонце(Строка, ПроверяемыеСимволы)
	
	Для Позиция = 1 По СтрДлина(ПроверяемыеСимволы) Цикл
		Символ = Сред(ПроверяемыеСимволы, Позиция, 1);
		СимволНайден = (Лев(Строка, 1) = Символ) ИЛИ (Прав(Строка, 1) = Символ);
		Если СимволНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ЕстьСимволыВНачалеВКонце