////////////////////////////////////////////////////////////////////////////////
// Заголовок модуля:
// - TODO написать
// - TODO написать
//
////////////////////////////////////////////////////////////////////////////////

// Публичные
Перем
Приоритет Экспорт,
КатегорииОшибок Экспорт;

// Служебные
Перем
_Сессия Экспорт,
_Локация Экспорт,
_Коннектор Экспорт;

// Инициализирует клиент уведомлений
//
// Параметры:
//   Параметры - Структура - см. ПараметрыКлиента
//
// Возвращаемое значение:
//   ОбработкаОбъект.КлиентУведомлений - Настроенный клиент
//
Функция Инит(Параметры = Неопределено) Экспорт
	
	ПараметрыКлиента = ПараметрыКлиента();
	Если Параметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыКлиента, Параметры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыКлиента.Локация) Тогда
		_Локация = ПараметрыКлиента.Локация;
	КонецЕсли;
	
	Если ПараметрыКлиента.HTTP = Неопределено Тогда
		_Коннектор = Новый(___Коннектор);
	Иначе
		_Коннектор = ПараметрыКлиента.HTTP;
	КонецЕсли;
	
	Сессия = _Сессия();
	Если ЗначениеЗаполнено(ПараметрыКлиента.КлючАПИ) Тогда
		Сессия.Заголовки.Вставить("X-Kontur-Apikey", ПараметрыКлиента.КлючАПИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыКлиента.КлючИБ) Тогда
		Сессия.Заголовки.Вставить("X-Kontur-Secret-Key", ПараметрыКлиента.КлючАПИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыКлиента.Токен) Тогда
		Сессия.Заголовки.Вставить("Authorization", ПараметрыКлиента.Токен);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции // Инит

// Определения

// Описание параметров клиента уведомлений
//
// Возвращаемое значение:
//  Структура - Параметры клиента
//     * Локация - Строка - (необязательный) Локация сервиса
//     * КлючАПИ - Строка - (необязательный) X-Kontur-Apikey
//     * КлючИБ - Строка - (необязательный) X-Kontur-Secret-Key
//     * Токен - Строка - (необязательный) Authorization
//
Функция ПараметрыКлиента() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Локация", "https://update.kontur.ru/1c/v4");
	Модель.Вставить("КлючАПИ");
	Модель.Вставить("КлючИБ");
	Модель.Вставить("Токен");
	Модель.Вставить("HTTP");
	
	Возврат Модель;
	
КонецФункции // ПараметрыКлиента

// Описание запроса уведомлений, содержит иноформацию о текущей ИБ и продукте
//
// Возвращаемое значение:
//  Структура - ЗапросУведомлений
//
Функция ЗапросУведомлений() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("ИдИБ", "");
	Модель.Вставить("Версия", "");
	Модель.Вставить("ДопПараметры", Новый Структура);
	
	Возврат Модель;
	
КонецФункции // ЗапросУведомлений

// Описание контейнера уведомлений
//
// Возвращаемое значение:
//  Структура - Контейнер уведомлений
//
Функция ОтветУведомления() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Список", Новый Массив);
	
	Возврат Модель;
	
КонецФункции // ОтветУведомления

// Описание контейнера уведомления
//
// Возвращаемое значение:
//  Структура - Контейнер уведомления
//
Функция ОтветУведомление() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Контент");
	Модель.Вставить("ДатаНачала");
	Модель.Вставить("ДатаОкончания");
	Модель.Вставить("Ид");
	Модель.Вставить("Приоритет");
	
	Возврат Модель;
	
КонецФункции // ОтветУведомление

// Методы

// Запрашивает уведомления в сервисе
//
// Параметры:
//  Продукт - Строка - Имя продукта в сервисе
//  Запрос - Строка - см. ЗапросУведомлений
//
// Возвращаемое значение:
//  Структура - см. ОтветУведомления
//
Функция Уведомления(Продукт, Запрос) Экспорт
	
	_ПроверитьПараметры(
		_НесоответствиеТипов(Продукт, "Строка"),
		_НесоответствиеТипов(Запрос, "Структура"));
	
	_ПроверитьПараметры(
		_НеЗаполнено(Продукт));
	
	Возврат _Уведомления(Продукт, Запрос);
	
КонецФункции // Уведомления

// Вспомогательные

// Проверяет, что ошибка принадлежит к указанной категории
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке - ИнформацияОбОшибке
//  Категория		   - Строка - Текст ошибки
//
// Возвращаемое значение:
//  Булево - возвращает Истина если описание ошибки начинается на текст категории
//
Функция ЯвляетсяОшибкойКатегории(ИнформацияОбОшибке, Категория) Экспорт
	
	ЯвляетсяОшибкойКатегории = СтрНачинаетсяСЛок(ИнформацияОбОшибке.Описание, Категория);
	Возврат ЯвляетсяОшибкойКатегории;
	
КонецФункции // ЯвляетсяОшибкойКатегории

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, НоваяТаблицаКоманд());
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаКоманд()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Представление"			, Новый ОписаниеТипов("Строка")); 
	Результат.Колонки.Добавить("Идентификатор"			, Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Использование"			, Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПоказыватьОповещение"	, Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Модификатор"			, Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Результат = "0.0.1";
	
	Возврат Результат;
	
КонецФункции

Функция _Уведомления(Продукт, Запрос) Экспорт
	
	Адрес = "/products/" + Продукт + "/notifications";
	Ответ = _PostJson(Адрес, _УведомленияСобратьЗапрос(Запрос));
	Если НЕ _ПроверитьСостояние(Ответ) Тогда
		ВызватьИсключение _ТелоОписаниеОшибки(Ответ);
	КонецЕсли;
	
	Данные = _ТелоJson(Ответ);
	Модель = _УведомленияРазобратьОтвет(Данные);
	
	Возврат _ФиксированныеДанные(Модель);
	
КонецФункции // _Уведомления

Функция _УведомленияСобратьЗапрос(ЗапросУведомлений) Экспорт
	
	Запрос = Новый Соответствие;
	Запрос.Вставить("client_id", ЗапросУведомлений.ИдИБ);
	Запрос.Вставить("version", ЗапросУведомлений.Версия);
	
	Если ЗапросУведомлений.ДопПараметры <> Неопределено Тогда
		Для Каждого Элемент Из ЗапросУведомлений.ДопПараметры Цикл
			Запрос.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции // _УведомленияСобратьЗапрос

Функция _УведомленияРазобратьОтвет(Данные) Экспорт
	
	Уведомления = ОтветУведомления();
	
	СписокУведомлений = Данные.Получить("notifications");
	Если СписокУведомлений <> Неопределено Тогда
		Для Каждого Элемент Из СписокУведомлений Цикл
			Уведомление = _УведомлениеРазобратьОтвет(Элемент);
			Уведомления.Список.Добавить(Уведомление);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Уведомления;
	
КонецФункции // _УведомленияРазобратьОтвет

Функция _УведомлениеРазобратьОтвет(Данные) Экспорт
	
	Уведомление = ОтветУведомление();
	Уведомление.Ид = Данные.Получить("id");
	Уведомление.Контент = Данные.Получить("content");
	Уведомление.Приоритет = Данные.Получить("priority");
	Уведомление.ДатаНачала = _РазобратьДату(Данные.Получить("date_from"));
	Уведомление.ДатаОкончания = _РазобратьДату(Данные.Получить("date_to"));
	
	Возврат Уведомление;
	
КонецФункции // _УведомлениеРазобратьОтвет

// HTTP

Процедура _УдалитьНедопустимыеСимволыXML(Строка) Экспорт
	
	Если ТипЗнч(Строка) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Сдвиг = 1;
	НедопустимыйСимвол = НайтиНедопустимыеСимволыXML(Строка, Сдвиг);
	Пока НедопустимыйСимвол <> 0 Цикл
		Символ = Сред(Строка, НедопустимыйСимвол, 1);
		Строка = СтрЗаменить(Строка, Символ, "");
		Сдвиг = НедопустимыйСимвол - 1;
		НедопустимыйСимвол = НайтиНедопустимыеСимволыXML(Строка, Сдвиг);
	КонецЦикла;
	
КонецПроцедуры // _УдалитьНедопустимыеСимволыXML

Функция _URL(URL) Экспорт
	
	Если Найти(URL, "http") ИЛИ Найти(URL, "https") Тогда
		Возврат URL;
	Иначе
		Возврат _Локация + URL;
	КонецЕсли;
	
КонецФункции // _URL

Функция _PostJson(Ресурс, Json, ПараметрыЗапроса = Неопределено, ЗаголовкиЗапроса = Неопределено) Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Заголовки", Новый Соответствие);
	ДопПараметры.Вставить("Json", Json);
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		ДопПараметры.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	КонецЕсли;
	
	Ответ = _Коннектор.Post(_URL(Ресурс), Неопределено, ДопПараметры, _Сессия());
	Возврат Ответ;
	
КонецФункции // _PostJson

Функция _ТелоJson(Ответ) Экспорт
	
	Возврат _Коннектор.КакJson(Ответ);
	
КонецФункции // _ТелоJson

Функция _ТелоОписаниеОшибки(Ответ, ПодробныеИсключения = Истина) Экспорт
	
	КраткоеОписание = КатегорииОшибок.ОшибкаСостояния + " "
		+ Строка(Ответ.КодСостояния) + " "
		+ Строка(Ответ.URL);
	Если ПодробныеИсключения = Ложь Тогда
		Возврат КраткоеОписание;
	КонецЕсли;
	
	Подробно = Новый Массив;
	Подробно.Добавить(КраткоеОписание);
	
	Для Каждого Элемент Из Ответ.Заголовки Цикл
		Подробно.Добавить(Строка(Элемент.Ключ) + ": " + Строка(Элемент.Значение));
	КонецЦикла;
	
	Если ТипЗнч(Ответ.Тело) = Тип("ДвоичныеДанные") И Ответ.Тело.Размер() Тогда
		Подробно.Добавить(_Коннектор.КакТекст(Ответ, "utf-8"));
	КонецЕсли;
	
	ПодробноеОписание = СтрСоединитьЛок(Подробно, Символы.ПС);
	
	_УдалитьНедопустимыеСимволыXML(ПодробноеОписание);
	
	Возврат ПодробноеОписание;
	
КонецФункции // _ТелоОписаниеОшибки

Функция _ПроверитьСостояние(Ответ) Экспорт
	
	НегативноеСостояние = Ответ.КодСостояния >= _Коннектор.КодыСостоянияHTTP().ПеремещеноНавсегда_301;
	Возврат НЕ НегативноеСостояние;
	
КонецФункции // _ПроверитьСостояние

Функция _Сессия() Экспорт
	
	Если _Сессия = Неопределено Тогда
		_Сессия = _Коннектор.СоздатьСессию();
	КонецЕсли;
	
	Возврат _Сессия;
	
КонецФункции // _Сессия

// Проверка параметров

Процедура _ПроверитьПараметры(Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено,
		Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено) Экспорт
	
	Ошибка = _ОшибкаПараметра(Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7);
	Если Ошибка <> Неопределено Тогда
		ВызватьИсключение Ошибка.Описание;
	КонецЕсли;
	
КонецПроцедуры // _ПроверитьПараметры

Функция _НесоответствиеТипов(Значение, ОписаниеТипов, ЗначениеПоУмолчанию = "!?I?*H") Экспорт
	
	ОписаниеТиповСтрокой = ТипЗнч(ОписаниеТипов) = Тип("Строка");
	
	// Проверка умолчания
	
	Если ЗначениеПоУмолчанию = "!?I?*H"
		И ОписаниеТиповСтрокой
		И Найти(ОписаниеТиповСтрокой, "Неопределено") Тогда
		ЗначениеПоУмолчанию_ = Неопределено;
	Иначе
		ЗначениеПоУмолчанию_ = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеПоУмолчанию <> "!?I?*H"
		И Значение = ЗначениеПоУмолчанию Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверка типа
	
	Если ТипЗнч(ОписаниеТипов) = Тип("Строка") Тогда
		ОписаниеТипов_ = Новый ОписаниеТипов(ОписаниеТипов);
	Иначе
		ОписаниеТипов_ = ОписаниеТипов;
	КонецЕсли;
	
	Если НЕ ОписаниеТипов_.СодержитТип(ТипЗнч(Значение)) Тогда
		Ошибка = _ОшибкаТипа();
	Иначе
		Ошибка = Неопределено;
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции // _НесоответствиеТипов

Функция _НеЗаполнено(Значение) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Ошибка = _ОшибкаЗначения();
	Иначе
		Ошибка = Неопределено;
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции // _НеЗаполнено

// Ошибки

Функция _Ошибка() Экспорт
	
	Возврат Новый Структура("Описание");
	
КонецФункции // _Ошибка

Функция _ОшибкаТипа() Экспорт
	
	Ошибка = _Ошибка();
	Ошибка.Описание = НСтр("ru = 'Несоответствие типов'");
	
	Возврат Ошибка;
	
КонецФункции // _ОшибкаТипа

Функция _ОшибкаЗначения() Экспорт
	
	Ошибка = _Ошибка();
	Ошибка.Описание = НСтр("ru = 'Недопустимое значение параметра'");
	
	Возврат Ошибка;
	
КонецФункции // _ОшибкаЗначения

Функция _ОшибкаПараметра(Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено,
		Параметр4 = Неопределено, Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено) Экспорт
	
	Параметры = Новый Массив;
	Параметры.Добавить(Параметр1);
	Параметры.Добавить(Параметр2);
	Параметры.Добавить(Параметр3);
	Параметры.Добавить(Параметр4);
	Параметры.Добавить(Параметр5);
	Параметры.Добавить(Параметр6);
	Параметры.Добавить(Параметр7);
	
	Шаблон = "ru = ' (параметр номер %1)'";
	
	Для Сч = 0 По Параметры.ВГраница() Цикл
		
		Параметр = Параметры[Сч];
		Если Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Параметр.Описание = Параметр.Описание + НСтр(СтрЗаменить(Шаблон, "%1", Строка(Сч + 1)));
		
		Возврат Параметр;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // _ОшибкаПараметра

// Прочие

Функция СтрНачинаетсяСЛок(Строка, СтрокаПоиска)
	
	Попытка
		Результат = Вычислить("СтрНачинаетсяС(Строка, СтрокаПоиска)");
	Исключение
		Результат = Найти(Строка, СтрокаПоиска) = 1;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СтрСоединитьЛок(Строки, Разделитель = "")
	
	Попытка
		
		Результат = Вычислить("СтрСоединить(Строки, Разделитель)");
		
	Исключение
		
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		
		ЭтоПерваяСтрока = Истина;
		Для Каждого Элемент Из Строки Цикл
			
			Строка = Элемент;
			Если ЭтоПерваяСтрока Тогда
				Запись.ЗаписатьБезОбработки(Строка);
				ЭтоПерваяСтрока = Ложь;
			Иначе
				Запись.ЗаписатьБезОбработки(Разделитель);
				Запись.ЗаписатьБезОбработки(Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		Результат = Запись.Закрыть();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // СтрСоединитьЛок

Функция СтрРазделитьЛок(Строка, Разделитель, ВключатьПустые = Истина) // BSLLS:CognitiveComplexity-off
	
	Попытка
		Результат = Вычислить("СтрРазделить(Строка, Разделитель, ВключатьПустые)");
	Исключение
		Результат = Новый Массив;
		Значение = Строка;
		ПропускатьПустыеСтроки = НЕ ВключатьПустые;
		СокращатьНепечатаемыеСимволы = Ложь;
		
		// Для обеспечения обратной совместимости.
		Если ПропускатьПустыеСтроки = Неопределено Тогда
			ПропускатьПустыеСтроки = (Разделитель = " ");
			Если ПустаяСтрока(Значение) Тогда
				Если Разделитель = " " Тогда
					Результат.Добавить("");
				КонецЕсли;
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
		//
		
		Позиция = Найти(Значение, Разделитель);
		Пока Позиция > 0 Цикл
			Подстрока = Лев(Значение, Позиция - 1);
			Если НЕ ПропускатьПустыеСтроки ИЛИ НЕ ПустаяСтрока(Подстрока) Тогда
				Если СокращатьНепечатаемыеСимволы Тогда
					Результат.Добавить(СокрЛП(Подстрока));
				Иначе
					Результат.Добавить(Подстрока);
				КонецЕсли;
			КонецЕсли;
			Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
			Позиция = Найти(Значение, Разделитель);
		КонецЦикла;
		
		Если НЕ ПропускатьПустыеСтроки ИЛИ НЕ ПустаяСтрока(Значение) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Значение));
			Иначе
				Результат.Добавить(Значение);
			КонецЕсли;
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // СтрРазделитьЛок

Функция _РазобратьДату(Строка) Экспорт
	
	Результат = Дата(1, 1, 1);
	Массив = СтрРазделитьЛок(Строка(Строка), "-");
	Частей = 3;
	Если НЕ ЗначениеЗаполнено(Строка)
		ИЛИ Массив.Количество() <> Частей Тогда
		Возврат Результат;
	КонецЕсли;
	
	Год = 0;
	Месяц = 1;
	День = 2;
	
	Попытка
		Результат = Дата(Число(Массив[Год]), Число(Массив[Месяц]), Число(Массив[День])); // BSLLS:TryNumber-off
	Исключение
		Результат = Дата(1, 1, 1);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // _РазобратьДату

// BSLLS:CyclomaticComplexity-off
// BSLLS:CognitiveComplexity-off

Функция _ФиксированныеДанные(Данные) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		
		Массив = Новый Массив;
		
		Для Каждого Значение Из Данные Цикл
			Если ТипЗнч(Значение) = Тип("Структура")
				ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
				ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				Массив.Добавить(_ФиксированныеДанные(Значение));
			Иначе
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		Результат = Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		ИЛИ ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Коллекция = Новый Структура;
		Иначе
			Коллекция = Новый Соответствие;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из Данные Цикл
			
			Значение = КлючИЗначение.Значение;
			Если ТипЗнч(Значение) = Тип("Структура")
				ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
				ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				Коллекция.Вставить(КлючИЗначение.Ключ, _ФиксированныеДанные(Значение));
			Иначе
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Результат = Новый ФиксированнаяСтруктура(Коллекция);
		Иначе
			Результат = Новый ФиксированноеСоответствие(Коллекция);
		КонецЕсли;
		
	Иначе
		Результат = Данные;
	КонецЕсли;
	
	Возврат Результат;
	
	// BSLLS:CyclomaticComplexity-on
	// BSLLS:CognitiveComplexity-on
	
КонецФункции // _ФиксированныеДанные

Процедура __Удал__() Экспорт
	
КонецПроцедуры // __Удал__

Процедура __Инит__(Мета) Экспорт
	
	КатегорииОшибок = Новый Структура;
	КатегорииОшибок.Вставить("ОшибкаСостояния", "Ошибка состояния HTTP:");
	КатегорииОшибок.Вставить("ОшибкаСостояния404", КатегорииОшибок.ОшибкаСостояния + " 404");
	
	Приоритет = Новый Структура;
	Приоритет.Вставить("Низкий", "low");
	Приоритет.Вставить("Средний", "medium");
	Приоритет.Вставить("Высокий", "high");
	
	Имя = "КлиентУведомлений";
	Если Имя <> Мета.Имя Тогда
		ПространствоИмен = Лев(Мета.Имя, СтрДлина(Мета.Имя) - СтрДлина(Имя));
	Иначе
		ПространствоИмен = Имя;	
	КонецЕсли;
	
	___Коннектор = СтрЗаменить(Мета.Реквизиты.___Коннектор.Комментарий, ".", "." + ПространствоИмен);
	
КонецПроцедуры // __Инит__

__Инит__(Метаданные());
