
#Область ПЕРЕМЕННЫЕ_ПЛАТФОРМЫ
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Манифест 				Экспорт;
Перем ОбработкаОбъект 		Экспорт;
Перем ПараметрыКлиентСервер Экспорт;

Перем НомерИтерацииВызоваМодуля;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
#КонецОбласти

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ПЛАТФОРМЫ

Функция МетодСервера(ИмяМодуля = "", ИмяМетода, 
		Параметр0 = NULL, Параметр1 = NULL, Параметр2 = NULL, Параметр3 = NULL, Параметр4 = NULL, 
		Параметр5 = NULL, Параметр6 = NULL, Параметр7 = NULL, Параметр8 = NULL, Параметр9 = NULL)
	
	Возврат ОбработкаОбъект.МетодСервера(ИмяМодуля, ИмяМетода, 
	Параметр0, Параметр1, Параметр2, Параметр3, Параметр4, 
	Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля= 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ОбработкаОбъект.ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект= 	   Неопределено;
		ПараметрыКлиентСервер= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриглашениеОтладки() Экспорт
	
	//// Удалите комментарий напротив оператора "ВызватьИсключение", чтобы получить приглашение для начала отладки модуля.
	//ВызватьИсключение "Нажмите кнопку ""Подробно"", а затем ""Конфигуратор"", чтобы начать отладку модуля!"; 
	
КонецПроцедуры

#КонецОбласти

#Область МАНИФЕСТ

// Все функции и процедуры тела модуля должны быть экспортными и добавлены в соответствующую структуру!

Функция ФункцииМодуля() Экспорт
	
	Результат = Новый Структура;
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьВидКИ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииАктаСверки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуАктаВыполненныхРабот");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуАктаСверки");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьГрузополучателя");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПодготовитьВТДляСпискаОтправкиДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПодготовитьДопДанныеДляСозданияНакладной");
		
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьМассивСсылокРТУПоСчетуНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДокОснованиеКорректировкиРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСчетНаОплатуНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьЗаказПокупателяНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСФОснованиеПоИСФ_КСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВалютаРегламентированногоУчета", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплатуСредствамиДиадок");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаФактуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаНаОплату");
	
	// Признаки
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоСчетНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоЗаказПокупателя");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКорректировкаРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоИсправление");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоНакладная");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СчетФактуранаАванс");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВозвратТоваровОтКлиента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВыбытиеИзОборотаМаркируемойПродукции");
	
	// Устарели
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДанныеТЧ");

	// Машиночитаемые доверенности
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ИмяСправочникаВИнформационнойБазе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ДанныеДоверенности");

	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьОбстоятельствоФормированияСчетФактуры");

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента
//
// Параметры:
//  ТребуемыеРеквизиты	 - Структура	 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - ссылка на объект, описание которого надо получить.
//
Процедура ПриПолученииОписанияПрикладногоДокумента(ТребуемыеРеквизиты, СсылкаНаОбъект) Экспорт
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ПсевдонимОсновнойТаблицы = "";
	
	Если МетаданныеОбъекта = Метаданные.Документы.КорректировкаРеализации Тогда
		
		ТребуемыеРеквизиты.ЭтоКорректировка = ТекстЗапроса_КРТУ_ЭтоКорректировка(ПсевдонимОсновнойТаблицы);
		ТребуемыеРеквизиты.ЭтоИсправление = ТекстЗапроса_КРТУ_ЭтоИсправление(ПсевдонимОсновнойТаблицы);
		
	ИначеЕсли МетаданныеОбъекта = Метаданные.Документы.СчетФактура Тогда
		
		ТребуемыеРеквизиты.ЭтоКорректировка = ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимОсновнойТаблицы);
		ТребуемыеРеквизиты.ЭтоИсправление = ТекстЗапроса_СчетФактура_ЭтоИсправление(ПсевдонимОсновнойТаблицы);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидДокументаИнформационнойБазы
//
// Параметры:
//  ВидДокумента	 - Строка - (возвращаемый параметр) вид документа с точки зрения ЭДО (см. ВидыЭлектронныхДокументов);
//  СсылкаНаОбъект	 - ЛюбаяСсылка - объект информационной базы, вид которого необходимо определить;
//  ЭтоКорректировка - Булево - Истина, если объект отражает операцию корректировки;
//
Процедура ОпределитьВидДокумента(ВидДокумента, СсылкаНаОбъект, ЭтоКорректировка) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	МетаданныеДокументов = Метаданные.Документы;
	
	Если МетаданныеОбъекта = МетаданныеДокументов.СчетФактура И Не ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.СчетФактура;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.СчетФактура И ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.КорректировочныйСчетФактура;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.РасходнаяНакладная
		Или (МетаданныеОбъекта = МетаданныеДокументов.КорректировкаРеализации И Не ЭтоКорректировка) Тогда
		
		ТолькоУслуги = ДокументРеализацииСодержитТолькоУслуги(СсылкаНаОбъект);
		
		Если ТолькоУслуги Тогда
			ВидДокумента = ВидыЭД.АктОбОказанииУслуг;
		Иначе
			ВидДокумента = ВидыЭД.ТоварнаяНакладная;
		КонецЕсли;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.КорректировкаРеализации И ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.СоглашениеОбИзмененииСтоимости;
		
	Иначе
		
		СоответствиеМетаданных = Новый Соответствие;
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.СверкаВзаиморасчетов, ВидыЭД.АктСверки);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.СчетНаОплату, ВидыЭД.СчетНаОплату);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.ЗаказПокупателя, ВидыЭД.СчетНаОплату);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.АктВыполненныхРабот, ВидыЭД.АктОбОказанииУслуг);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.ОтчетОПереработке, ВидыЭД.ТоварнаяНакладная);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.ОтчетКомитенту, ВидыЭД.АктОбОказанииУслуг);
		
		ВидДокумента = СоответствиеМетаданных.Получить(МетаданныеОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт
	
	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;

	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Номер");
	РеквизитыДокумента.Вставить("Дата");
	
	Если ЭтоИсправление Тогда
		
		// Переопределим номер документа
		РеквизитыДокумента.Номер = "НомерИсходногоДокумента";
		РеквизитыДокумента.Дата	 = "ДатаИсходногоДокумента";
		
		// И добавим получение номера и даты исправления
		РеквизитыДокумента.Вставить("НомерИсправления");
		РеквизитыДокумента.Вставить("ДатаИсправления", "Дата");
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактура")
		И ИспользуетсяНомерНаПечатьСчетаФактуры() Тогда
		
		РеквизитыДокумента.Вставить("НомерНаПечать");
		РеквизитыДокумента.Вставить("ОтредактированНомерСчетаФактуры");
		
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыДокумента);
	
	Если ЗначенияРеквизитов.Свойство("ОтредактированНомерСчетаФактуры")
		И ЗначенияРеквизитов.ОтредактированНомерСчетаФактуры 
		И ЗначениеЗаполнено(ЗначенияРеквизитов.НомерНаПечать) Тогда
		
		Результат.НомерДокумента = ЗначенияРеквизитов.НомерНаПечать;
	Иначе
		Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	КонецЕсли;
	
	Результат.ДатаДокумента	 = ЗначенияРеквизитов.Дата;
	
	Если ЭтоИсправление Тогда
		Результат.НомерИсправления	 = Формат(ЗначенияРеквизитов.НомерИсправления, "ЧГ=0");
		Результат.ДатаИсправления	 = ЗначенияРеквизитов.ДатаИсправления;
	КонецЕсли;
	
	ДополнитьНомерЦифровымИндексомОП(Результат, ЦифровойИндексОП, СсылкаНаОбъект);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку820
//
// Параметры:
//  ДокументыОбОтгрузке	- Массив - (возвращаемый параметр) Массив элементов "Новый_DocumentShipment";
//  СсылкаНаОбъект		- ДокументСсылка.СчетФактураВыданный - СФ для которой определяем реквизиты документов отгрузки.
//
Процедура ПриПолученииДанныхДокументовОбОтгрузке(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереКорректировочногоДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт
	
	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактура") Тогда
		ЗначенияРеквизитов = РеквизитыКорректировочногоСчетаФактуры(СсылкаНаОбъект, ЭтоИсправление);
		УчитыватьИсправлениеИсходногоДокумента = ЗначенияРеквизитов.УчитыватьИсправлениеИсходногоДокумента;
	Иначе
		ЗначенияРеквизитов = РеквизитыКорректировкиРеализации(СсылкаНаОбъект, ЭтоИсправление);
		УчитыватьИсправлениеИсходногоДокумента = ЗначениеЗаполнено(ЗначенияРеквизитов.ДатаИсправленияИсходногоДокумента);
	КонецЕсли;
	
	Если ЗначенияРеквизитов.Свойство("ОтредактированНомерСчетаФактуры")
		И ЗначенияРеквизитов.ОтредактированНомерСчетаФактуры
		И ЗначениеЗаполнено(ЗначенияРеквизитов.НомерНаПечать) Тогда
		
		Результат.НомерДокумента = ЗначенияРеквизитов.НомерНаПечать;
	Иначе
		Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	КонецЕсли;
	
	Результат.ДатаДокумента	 = ЗначенияРеквизитов.Дата;
	
	Если ЭтоИсправление Тогда
		Результат.НомерИсправления	 = Формат(ЗначенияРеквизитов.НомерИсправления, "ЧГ=0");
		Результат.ДатаИсправления	 = ЗначенияРеквизитов.ДатаИсправления;
	КонецЕсли;
	
	ОписаниеРеквизитов = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ДатаНомерДокументаОснования");
	ОписаниеРеквизитов.НомерИсходногоДокумента = Формат(ЗначенияРеквизитов.НомерИсходногоДокумента, "ЧГ=0");
	ОписаниеРеквизитов.ДатаИсходногоДокумента  = ЗначенияРеквизитов.ДатаИсходногоДокумента;
	ОписаниеРеквизитов.УчитыватьИсправлениеИсходногоДокумента = УчитыватьИсправлениеИсходногоДокумента;
	
	Если УчитыватьИсправлениеИсходногоДокумента Тогда
		ОписаниеРеквизитов.НомерИсправленияИсходногоДокумента	 = Формат(ЗначенияРеквизитов.НомерИсправленияИсходногоДокумента, "ЧГ=0");
		ОписаниеРеквизитов.ДатаИсправленияИсходногоДокумента	 = ЗначенияРеквизитов.ДатаИсправленияИсходногоДокумента;
	КонецЕсли;
	
	Результат.ДатаНомерДокументовОснований.Добавить(ОписаниеРеквизитов);
	
	ДополнитьНомерЦифровымИндексомОП(Результат, ЦифровойИндексОП, СсылкаНаОбъект);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//
// Параметры:
//  Реквизиты			 - Структура		 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  МетаданныеИсточника	 - ОбъектМетаданных	 - Метаданные документа-источника
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника) Экспорт
	
	#Область Организация
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Организация") Тогда 
		
		Реквизиты.Организация =
		"ВЫБОР
		|	КОГДА Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			И НЕ Организация = Организация.ГоловнаяОрганизация
		|		ТОГДА Организация.ГоловнаяОрганизация
		|	ИНАЧЕ Организация
		|КОНЕЦ";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Контрагент
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Контрагент") Тогда 
		
		Реквизиты.Контрагент =
		"ВЫБОР
		|	КОГДА Контрагент.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			И Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|		ТОГДА Контрагент.ГоловнойКонтрагент
		|	ИНАЧЕ Контрагент
		|КОНЕЦ";
		
		Реквизиты.КонтрагентКПП = "Контрагент.КПП";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Грузоотправитель
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузоотправитель")
		И ЕстьРеквизитМетаданных(МетаданныеИсточника, "Подразделение") Тогда
		
		Реквизиты.Грузоотправитель =
		"ВЫБОР
		|	КОГДА Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		ТОГДА Грузоотправитель
		|	КОГДА Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			И НЕ Организация = Организация.ГоловнаяОрганизация
		|		ТОГДА Организация
		|	КОГДА Подразделение.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			И Подразделение.ГоловнаяОрганизация = Организация
		|		ТОГДА Подразделение
		|	ИНАЧЕ """"
		|КОНЕЦ";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ЦифровойИндексОбособленногоПодразделения
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Организация")
		И ЕстьРеквизитМетаданных(МетаданныеИсточника, "Подразделение") Тогда
		
		Реквизиты.ЦифровойИндексОбособленногоПодразделения =
		"ВЫБОР
		|	КОГДА Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			И НЕ Организация = Организация.ГоловнаяОрганизация
		|		ТОГДА Организация.ЦифровойИндексОбособленногоПодразделения
		|	КОГДА Подразделение.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			И Подразделение.ГоловнаяОрганизация = Организация
		|		ТОГДА Подразделение.ЦифровойИндексОбособленногоПодразделения
		|	ИНАЧЕ """"
		|КОНЕЦ";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ОбособленноеПодразделение
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Подразделение") Тогда
		
		Реквизиты.ОбособленноеПодразделение =
		"ВЫБОР
		|	КОГДА Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			И НЕ Организация = Организация.ГоловнаяОрганизация
		|		ТОГДА Организация
		|	КОГДА Подразделение.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			И Подразделение.ГоловнаяОрганизация = Организация
		|		ТОГДА Подразделение
		|	ИНАЧЕ Организация
		|КОНЕЦ";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Грузополучатель
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузополучатель") Тогда
		
		Реквизиты.Грузополучатель =
		"ВЫБОР
		|	КОГДА Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		ТОГДА Контрагент
		|	ИНАЧЕ Грузополучатель
		|КОНЕЦ";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ВалютаИКурсы
	
	Если Не ЕстьРеквизитМетаданных(МетаданныеИсточника, "ВалютаДокумента") 
		И ЕстьРеквизитМетаданных(МетаданныеИсточника, "Валюта") Тогда 
		
		Реквизиты.ВалютаДокумента = "Валюта";
		
	КонецЕсли;
	
	Реквизиты.КурсДокумента		 = "Курс";
	Реквизиты.КратностьДокумента = "Кратность";
	
	#КонецОбласти
	
	#Область Прочее
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Договор") Тогда 
		Реквизиты.РасчетыВУсловныхЕдиницах = "ЕСТЬNULL(Договор.РасчетыВУсловныхЕдиницах, ЛОЖЬ)";
	Иначе 
		Реквизиты.РасчетыВУсловныхЕдиницах = "ЛОЖЬ";
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "БанковскийСчет") Тогда 
		Реквизиты.БанковскийСчетОрганизации = "БанковскийСчет";
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "СуммаВключаетНДС") Тогда 
		Реквизиты.ЦенаВключаетНДС = "СуммаВключаетНДС";
	ИначеЕсли Не ЕстьРеквизитМетаданных(МетаданныеИсточника, "ЦенаВключаетНДС") Тогда 
		Реквизиты.ЦенаВключаетНДС = "ИСТИНА";
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки
// после формирования структуры шапки документа.
//
// Параметры:
//  ЗначенияРеквизитов - Структура - Структура со значениями реквизита документа
//
Процедура ПослеПолученияДанныхШапкиДокумента(ДанныеШапки) Экспорт
	
	СсылкаНаОбъект = ДанныеШапки.ОписаниеДокумента.Ссылка;
	
	Если СчетФактураНаАванс(СсылкаНаОбъект) Тогда 
		ДанныеШапки.БанковскийСчетОрганизации = БанковскийСчетСчетаФактурыНаАванс(СсылкаНаОбъект);
	ИначеЕсли ЭтоСчетФактура(СсылкаНаОбъект) Тогда 
		ДополнитьШапкуСчетаФактурыПоДокументуОснованию(ДанныеШапки);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  МетаданныеОбъекта	 - ОбъектМетаданных - объект метаданных.
//  ТабличныеЧасти		 - Массив - массив, в который необходимо добавить имена табличных частей, из которых нужно получить данные.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииИменТабличныхЧастей(МетаданныеОбъекта, ТабличныеЧасти, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИмяДокумента = ВРег(МетаданныеОбъекта.Имя);
	
	Если ИмяДокумента = ВРег("АктВыполненныхРабот") Тогда 
		
		ТабличныеЧасти.Добавить("РаботыИУслуги");
		
	ИначеЕсли ИмяДокумента = ВРег("ОтчетОПереработке") Тогда 
		
		ТабличныеЧасти.Добавить("Продукция");
		
	ИначеЕсли ИмяДокумента = ВРег("ЗаказПокупателя") Тогда 
		
		ТабличныеЧасти.Добавить("Запасы");
		ТабличныеЧасти.Добавить("Работы");
		
	ИначеЕсли ИмяДокумента = ВРег("СчетФактура") Тогда 
		
		Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.ТабличнаяЧасть.Авансы") Тогда 
			ТабличныеЧасти.Добавить("Авансы");
		КонецЕсли;
		
		Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.ТабличнаяЧасть.Запасы") Тогда 
			ТабличныеЧасти.Добавить("Запасы");
		КонецЕсли;
		
		Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.ТабличнаяЧасть.УдалитьЗапасы") Тогда 
			ТабличныеЧасти.Добавить("УдалитьЗапасы");
		КонецЕсли;
		
	ИначеЕсли МетодСервера(, "СуществуетОбъектМетаданных", "Документ." + ИмяДокумента + ".ТабличнаяЧасть.Запасы") Тогда 
		
		ТабличныеЧасти.Добавить("Запасы");
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка				 - Структура - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//  ИмяТабличнойЧасти	 - Строка	 - имя табличной части объекта.
//  РеквизитыТЧ			 - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                     псевдоним поля, а в качестве значения (опционально) фактическое имя поля в таблице или произвольное выражение.
//                                     Если значение не определено, то имя поля берется из ключа.
//  ПараметрыЗапроса	 - Структура - дополнительные параметры, будут переданы в исполняемый запрос.
//
Процедура ПриПодготовкеЗапросаПоТоварнойЧастиДокумента(Шапка, ИмяТабличнойЧасти, РеквизитыТЧ, ПараметрыЗапроса) Экспорт
	
	СсылкаНаОбъект = Шапка.ОписаниеДокумента.Ссылка;
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	МетаданныеТЧ = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	
	Если ЕстьРеквизитМетаданных(МетаданныеТЧ, "ЕдиницаИзмерения") Тогда
		
		НастройкаПользовательскаяЕИ = Константы.ПечатьПользовательскихЕдиницИзмерения.Получить();
		ЗначениеПользовательскаяЕИ = Перечисления.ПечатьПользовательскихЕдиницИзмерения.ФормироватьПечатныйДокументВПользовательскойЕдинице;
		ИспользоватьБазовыеЕИ = (НастройкаПользовательскаяЕИ = ЗначениеПользовательскаяЕИ);
		ИспользоватьБазовыеЕИ = Формат(ИспользоватьБазовыеЕИ, "БИ='ИСТИНА'; БЛ='ЛОЖЬ'");
		
		РеквизитыТЧ.Упаковка =
		"ВЫБОР
		|	КОГДА ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
		|		И " + ИспользоватьБазовыеЕИ + "
		|		И ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
		|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|КОНЕЦ";
		
		РеквизитыТЧ.ЕдиницаИзмерения =
		"ВЫБОР
		|	КОГДА ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
		|		И " + ИспользоватьБазовыеЕИ + "
		|		И ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
		|	ИНАЧЕ Номенклатура.ЕдиницаИзмерения
		|КОНЕЦ";
		
		РеквизитыТЧ.ЕдиницаИзмеренияКод =
		"ВЫБОР
		|	КОГДА ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
		|		И " + ИспользоватьБазовыеЕИ + "
		|		И ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> Значение(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
		|	ИНАЧЕ Номенклатура.ЕдиницаИзмерения.Код
		|КОНЕЦ";
		
		РеквизитыТЧ.Количество =
		"ВЫБОР
		|	КОГДА ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
		|		И НЕ " + ИспользоватьБазовыеЕИ + "
		|			ТОГДА Количество * ЕдиницаИзмерения.Коэффициент
		|	ИНАЧЕ Количество
		|КОНЕЦ";
		
		Если ЕстьРеквизитМетаданных(МетаданныеТЧ, "КоличествоДоИзменения") Тогда
			
			РеквизитыТЧ.КоличествоДоИзменения =
			"ВЫБОР
			|	КОГДА ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
			|		И НЕ " + ИспользоватьБазовыеЕИ + "
			|			ТОГДА КоличествоДоИзменения * ЕдиницаИзмерения.Коэффициент
			|	ИНАЧЕ КоличествоДоИзменения
			|КОНЕЦ";
			
		КонецЕсли;

	Иначе
		
		РеквизитыТЧ.Упаковка = "ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
		РеквизитыТЧ.ЕдиницаИзмерения = "ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)";
		РеквизитыТЧ.ЕдиницаИзмеренияКод = "";
		
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеТЧ, "СуммаАкциза") Тогда
		РеквизитыТЧ.СуммаАкциза =
			"ВЫБОР
			|		КОГДА Номенклатура.ПодакцизныйТовар
			|			ТОГДА СуммаАкциза
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ";
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеТЧ, "СуммаАкцизаДоИзменения") Тогда
		РеквизитыТЧ.СуммаАкцизаДоИзменения =
			"ВЫБОР
			|		КОГДА Номенклатура.ПодакцизныйТовар
			|			ТОГДА СуммаАкцизаДоИзменения
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ";
	КонецЕсли;
	
	#Область СуммаСНДС
	
	// Стандартное имя реквизита суммы с налогами - "Всего"
	РеквизитыТЧ.СуммаСНДС			 = "Всего";
	РеквизитыТЧ.СуммаСНДСДоИзменения = "ВсегоДоИзменения";
	
	Если Не ЕстьРеквизитМетаданных(МетаданныеТЧ, "Всего") И ВРег(ИмяТабличнойЧасти) = ВРег("Авансы") Тогда
		// У авансового СФ в ТЧ "Авансы" хранится сумма с НДС.
		РеквизитыТЧ.СуммаСНДС = "Сумма";
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РеквизитыКоторыеНеИзменяютсяКорректировочнымиДокументами
	
	// Следующие реквизиты не могут быть скорректированы:
	// изменение любого из них можно считать удалением старой строки и добавлением новой
	
	РеквизитыТЧ.СтранаПроисхожденияДоИзменения		 = "СтранаПроисхождения";
	РеквизитыТЧ.СтранаПроисхожденияДоИзмененияКод	 = "СтранаПроисхожденияКод";
	РеквизитыТЧ.НомерГТДДоИзменения					 = "НомерГТД";
	РеквизитыТЧ.КодТНВЭДДоИзменения					 = "КодТНВЭД";
	
	РеквизитыТЧ.УпаковкаДоИзменения = РеквизитыТЧ.Упаковка;
	РеквизитыТЧ.ЕдиницаИзмеренияДоИзменения = РеквизитыТЧ.ЕдиницаИзмерения;
	РеквизитыТЧ.ЕдиницаИзмеренияДоИзмененияКод = РеквизитыТЧ.ЕдиницаИзмеренияКод;
	
	#КонецОбласти
	
	#Область РеквизитыИсправленийКорректировочныхДокументов
	
	ЭтоИКСФ = Ложь;
	Если Истина
		И ЗначениеЗаполнено(Шапка.ХозяйственнаяОперация)
		И Шапка.ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозяйственныеОперации.ИсправлениеОшибки")
		Тогда 
		ЭтоИКСФ = Истина;
	КонецЕсли;
	
	Если ЭтоИКСФ Тогда
		
		// Для обычного исправления (ИСФ или УПД) значения до изменения не важны,
		// т.к. всегда выводится только новая версия документа.
		// Для корректировочного документа (КСФ или УКД) значения до изменения берем из реквизитов "<ИмяРеквизита>ДоИзменения".
		// А вот для исправления корректировочного документа (ИКСФ/ИУПД) все немного сложнее:
		// значения до изменения хранятся в реквизитах "<ИмяРеквизита>ДоКорректировки", а не в "<ИмяРеквизита>ДоИзменения"
		РеквизитыТЧ.КоличествоДоИзменения	 = "КоличествоДоКорректировки";
		РеквизитыТЧ.ЦенаДоИзменения			 = "ЦенаДоКорректировки";
		РеквизитыТЧ.СуммаДоИзменения		 = "СуммаДоКорректировки";
		РеквизитыТЧ.СуммаНДСДоИзменения		 = "СуммаНДСДоКорректировки";
		РеквизитыТЧ.СуммаСНДСДоИзменения	 = "ВсегоДоКорректировки";
		
		// Реквизит "СтавкаНДСДоКорректировки" отсутствуют, поэтому берем значение из поля "СтавкаНДСДоИзменения"
		РеквизитыТЧ.СтавкаНДСДоИзменения				 = "СтавкаНДСДоИзменения";
		РеквизитыТЧ.СтавкаНДСДоИзмененияПредставление	 = "СтавкаНДСДоИзмененияПредставление";
		
		Если ЕстьРеквизитМетаданных(МетаданныеТЧ, "СуммаАкцизаДоКорректировки") Тогда
			РеквизитыТЧ.СуммаАкцизаДоИзменения =
				"ВЫБОР
				|		КОГДА Номенклатура.ПодакцизныйТовар
				|			ТОГДА СуммаАкцизаДоКорректировки
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ";
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РеквизитыСчетаФактурыНаАванс
	
	Если СчетФактуранаАванс(СсылкаНаОбъект) Тогда 
		РеквизитыТЧ.Количество	 = "НЕОПРЕДЕЛЕНО";
		РеквизитыТЧ.Цена		 = "НЕОПРЕДЕЛЕНО";
		РеквизитыТЧ.Сумма		 = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОпределениеТипаНоменклатуры
	
	Если СчетФактураНаАванс(СсылкаНаОбъект) Тогда
		
		РеквизитыТЧ.ПризнакТоварРаботаУслуга = "Service";
		РеквизитыТЧ.ЭтоУслуга = "ИСТИНА";
		
	Иначе
		
		РеквизитыТЧ.ПризнакТоварРаботаУслуга = 
		"ВЫБОР
		|	КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|		ТОГДА ""Property""
		|	КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|		ТОГДА ""Service""
		|	КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|		ТОГДА ""Job""
		|	ИНАЧЕ ""Other""
		|КОНЕЦ";
		
		РеквизитыТЧ.ЭтоУслуга = 
		"ВЫБОР
		|	КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|		ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|		ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		|КОНЕЦ";
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Прочее
	
	РеквизитыТЧ.ВидУпаковки = РеквизитыТЧ.ЕдиницаИзмерения;
	
	Если ЕстьРеквизитМетаданных(МетаданныеТЧ, "НомерГТД") Тогда
		
		Если МетодСервера(,"СравнитьВерсии", ПараметрыКлиентСервер.ВерсияКонфигурации, "1.6.13") >= 0 Тогда
			
			РеквизитыТЧ.НомерГТДПредставление = "НомерГТД.РегистрационныйНомер";
			
		Иначе
			РеквизитыТЧ.НомерГТДПредставление = "НомерГТД";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЕстьРеквизитМетаданных(МетаданныеТЧ, "ИдентификаторСтроки") Тогда
		РеквизитыТЧ.ИдентификаторСтроки = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;

	РеквизитыТЧ.ДокументОтгрузки = "Ссылка";
	
	Если ЕстьРеквизитМетаданных(МетаданныеТЧ, "КлючСвязи") Тогда
		РеквизитыТЧ.Вставить("КлючСвязи", "КлючСвязи");
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка			 - Структура	 - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей.
//
Процедура ПослеПолученияТоварнойЧастиДокумента(Шапка, ТабличнаяЧасть) Экспорт
	
	ЗаполненоПоОснованию = ЗаполнитьТабличнуюЧастьПоДаннымДокументовОснований(Шапка, ТабличнаяЧасть);
	
	ДополнитьДаннымиПоДоставке(ТабличнаяЧасть, Шапка);
	
	УдалитьНеизмененныеСтрокиКорректировочногоДокумента(Шапка, ТабличнаяЧасть);
	УдалитьОтмененныеСтрокиИсправительногоДокумента(Шапка, ТабличнаяЧасть);
	УдалитьСтрокиОтчетКомиссионераОтДругихСчетФактур(Шапка, ТабличнаяЧасть);
	
	ТочностьЦены = ПараметрыКлиентСервер.ТочностьЦены;
	
	Если Не ЗаполненоПоОснованию 
		И Шапка.РасчетыВУсловныхЕдиницах 
		И Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета() Тогда
		
		ПересчитатьСуммыВВалютуРегл(Шапка, ТабличнаяЧасть);
		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл 
		
		// Некоторые колонки требуют ручной обработки
		СтрокаТЧ.СтавкаНДСПредставление = ПредставлениеСтавкиНДС(СтрокаТЧ.СтавкаНДС);
		СтрокаТЧ.СтавкаНДСДоИзмененияПредставление = ПредставлениеСтавкиНДС(СтрокаТЧ.СтавкаНДСДоИзменения);
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПредставление) Тогда 
			СтрокаТЧ.НоменклатураПредставление = ПредставлениеНоменклатуры(СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика);
		КонецЕсли;
		
		СтрокаТЧ.НомерГТД = СтрокаТЧ.НомерГТДПредставление;
		
		Если Шапка.ЦенаВключаетНДС 
			И ЗначениеЗаполнено(СтрокаТЧ.СуммаНДС)
			И ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
			
			СтрокаТЧ.Цена = Окр((СтрокаТЧ.СуммаСНДС - СтрокаТЧ.СуммаНДС) / СтрокаТЧ.Количество, ТочностьЦены);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Шапка.ОписаниеДокумента.ЭтоКорректировка Тогда
	
		ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(ТабличнаяЧасть, Шапка.ОписаниеДокумента.Ссылка);
		
	Иначе
		
		ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(ТабличнаяЧасть, Шапка.ОписаниеДокумента.Ссылка);
		
	КонецЕсли;
	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РасчетноеПредставлениеНомера()
//
// Параметры:
//  НомерОбъекта		 - Строка - номер или код объекта, который преобразуется для вывода на печать.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	НомерОбъекта = ПредставлениеНомера(НомерОбъекта);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяКолонкиКодТовара()
//
// Параметры:
//  ИмяКолонки			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов(ИмяКолонки, СтандартнаяОбработка) Экспорт
	
	Если Не МетодСервера(, "СуществуетОбъектМетаданных", "Константа.ПредставлениеКодовВПечатныхФормах") Тогда 
		// Актуально для 1.6.11 и выше: https://its.1c.ru/db/updinfo#content:524:1:issogl2_14
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЗначениеКонстанты	 = Константы.ПредставлениеКодовВПечатныхФормах.Получить();
	
	Если ЗначениеКонстанты = ПредопределенноеЗначение("Перечисление.КодыНоменклатурыВДокументах.Код") Тогда 
		ИмяКолонки = "Код";
		
	ИначеЕсли ЗначениеКонстанты = ПредопределенноеЗначение("Перечисление.КодыНоменклатурыВДокументах.Артикул") Тогда 
		ИмяКолонки = "Артикул";
		
	Иначе
		ИмяКолонки = "";
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВалютаРегламентированногоУчета()
//
Процедура ПриОпределенииВалютыРегламентированногоУчета(ВалютаРеглУчета, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ВалютаРеглУчета		 = ВалютаРегламентированногоУчета();
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыЮрФизЛица.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  ЮрФизЛицо			 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период				 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет		 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                         Если не передан, будут включены реквизиты основного банковского счета.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ИспользуетсяПодсистема_1_6_26() Тогда
		МодульПечатьДокументовУНФ = ОбщегоНазначения.ОбщийМодуль("ПечатьДокументовУНФ");
	Иначе
		МодульПечатьДокументовУНФ = ОбщегоНазначения.ОбщийМодуль("УправлениеНебольшойФирмойСервер");
	КонецЕсли;
	
	ДляФизЛицаТолькоИнициалы = Ложь;
	
	Буфер = МодульПечатьДокументовУНФ.СведенияОЮрФизЛице(
		ЮрФизЛицо,
		Период,
		ДляФизЛицаТолькоИнициалы,
		БанковскийСчет
	);
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Буфер);
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	

	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыДоговора.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  Шапка				 - Структура - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки).
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЭтапыГрафикаОплатПоДокументу.
//
// Параметры:
//  ЭтапыОплаты			 - ТаблицаЗначений	 - возвращаемые сведения;
//  Шапка				 - Структура		 - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки);
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииЭтаповГрафикаОплат(ЭтапыОплаты, Шапка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПредставлениеНоменклатуры.
//
// Параметры:
//  Представление			 - Строка - параметр, в который возвращается полученное представление номенклатуры;
//  Номенклатура			 - Строка, СправочникСсылка.Номенклатура				 - ссылка на номенклатуру;
//  Характеристика			 - Строка, СправочникСсылка.ХарактеристикиНоменклатуры	 - характеристика номенклатуры;
//  ДополнительныеПараметры	 - Неопределено, Структура								 - см. функцию Модуль_ИнтеграцияУниверсальный.ДополнительныеПараметрыПредставленияНоменклатуры;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииПредставленияНоменклатуры(Представление, Номенклатура, Характеристика, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Представление = ПредставлениеНоменклатуры(Номенклатура, Характеристика);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыУчетаНоменклатуры.
//
// Параметры:
//  ПараметрыНоменклатуры	 - Структура - Коллекция параметров учета номенклатуры в текущей ИБ;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииПараметровУчетаНоменклатуры(ПараметрыНоменклатуры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ХранилищеКонтактнойИнформацииОбъекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов;
//
Процедура ПриПолученииВидовИсходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ПсевдонимТаблицы = "ОсновнаяТаблица";
	ОтборКорректировочныхСчетовФактур = ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимТаблицы);
	ОтборКорректировокРеализаций = ТекстЗапроса_КРТУ_ЭтоКорректировка(ПсевдонимТаблицы);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактура
		, ВидыЭД.СчетФактура
		, "НЕ "+ОтборКорректировочныхСчетовФактур);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетНаОплату
		, ВидыЭД.СчетНаОплату
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.РасходнаяНакладная
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.КорректировкаРеализации
		, ВидыЭД.ТоварнаяНакладная
		, "НЕ "+ОтборКорректировокРеализаций);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.РасходнаяНакладная
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.АктВыполненныхРабот
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактура
		, ВидыЭД.КорректировочныйСчетФактура
		, ОтборКорректировочныхСчетовФактур);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.КорректировкаРеализации
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, ОтборКорректировокРеализаций);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов;
//
Процедура ПриПолученииВидовВходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетНаОплатуПоставщика
		, ВидыЭД.СчетНаОплату
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПриходнаяНакладная
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПриходнаяНакладная
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.КорректировочныйСчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.КорректировкаПоступления
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, Неопределено);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПриПолученииВладельцаОбщихНастроекМодуля.
//
// Параметры:
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект, выступающий в качестве константы для хранения дополнительных свойств;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииВладельцаОбщихНастроекМодуля(СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаНаОбъект = Константы.ВалютаУчета.Получить();
	
КонецПроцедуры


#Область СопоставлениеНоменклатуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СвойстваНоменклатурыИнформационнойБазы.
// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  НаборНоменклатуры - Массив из ОпределяемыйТип.НоменклатураБЭД - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. Модуль_ИнтеграцияУниверсальный.НовыеСвойстваНоменклатурыИБ.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(Знач НаборНоменклатуры, СвойстваНоменклатурИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|	ИСТИНА КАК ИспользоватьУпаковки,
	|	Номенклатура.ПроверятьЗаполнениеХарактеристики КАК ОбязательноеЗаполнениеХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&НаборНоменклатуры)";
	
	Запрос.УстановитьПараметр("НаборНоменклатуры", НаборНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ФОИспользоватьУпаковки = ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения");
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваНоменклатуры = НовыеСвойстваНоменклатурыИБ();
		ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, Выборка);
		
		СвойстваНоменклатуры.ИспользоватьХарактеристики = Выборка.ИспользоватьХарактеристики И ФОИспользоватьХарактеристикиНоменклатуры;
		СвойстваНоменклатуры.ИспользоватьУпаковки = ФОИспользоватьУпаковки;
		
		СвойстваНоменклатурИБ.Вставить(Выборка.Номенклатура, СвойстваНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняется при подборе недостающих данных о номенклатуре информационной базы по уже имеющимся,
// а также номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//
Процедура ПриПодбореНоменклатурыИнформационнойБазы(Знач НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	// См. ОбменСКонтрагентамиПереопределяемый.ПриПодбореНоменклатурыИнформационнойБазы
	
	ФОИспользоватьУпаковки = ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения");
	Если Не ЗначениеЗаполнено(НоменклатураИБ.Упаковка) И ФОИспользоватьУпаковки Тогда
		Номенклатура = НоменклатураИБ.Номенклатура;
		Если ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмеренияКод) Тогда
			НоменклатураИБ.Упаковка = Справочники.ЕдиницыИзмерения.НайтиПоКоду(
				НоменклатураКонтрагента.ЕдиницаИзмеренияКод, , , Номенклатура);
		ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
			НоменклатураИБ.Упаковка = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(
				НоменклатураКонтрагента.ЕдиницаИзмерения, Истина, , Номенклатура);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураИБ.Упаковка) Тогда
		Если ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмеренияКод) Тогда
			НоменклатураИБ.Упаковка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(
				НоменклатураКонтрагента.ЕдиницаИзмеренияКод);
		ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
			НоменклатураИБ.Упаковка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(
				НоменклатураКонтрагента.ЕдиницаИзмерения, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураИБ.Упаковка) Тогда
		ЕдиницаИзмерения = ЕдиницаИзмеренияНоменклатуры(НоменклатураИБ.Номенклатура);
		Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			НоменклатураИБ.Упаковка = ЕдиницаИзмерения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ЗаполнитьСоответствиеПолейВходящегоДокумента(ОбъектМетаданных, ИменаПолей) Экспорт
	
	
	
КонецПроцедуры

// Заполняет таблицу правил обработки входящих электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - правила обработки документов (см. ПравилаОбработкиВходящихДокументов);
//
// Пример:
//	Если ПолучитьФункциональнуюОпцию("ВедетсяПроизводственнаяДеятельность") Тогда
//		
//		ДобавитьПравилоОбработкиДокументов(ПравилоОбработки
//			, "ПоступлениеВПереработку" // Описание правила задается в процедуре ПриПолученииПравилаОбработкиЭлектронногоДокумента
//			, "ТоварнаяНакладная" 		// Используется для накладных
//			, Ложь); 					// Для исправлений не используется, только для первичных документов
//		
//	КонецЕсли;
//
Процедура ЗаполнитьПравилаОбработкиВходящихДокументов(ПравилаОбработки) Экспорт
	
	ЗаполнитьПравилаОбработкиПервичныхДокументов(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиДокументовОРасхождении(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиАктовСверки(ПравилаОбработки);
	
КонецПроцедуры

// Обработчик получения правила отражения электронного документа в учетной системе.
// Вызывается из Модуль_ИнтеграцияУниверсальный.ПравилоОбработкиЭлектронныхДокументов.
//
// Параметры:
//  ПравилоОбработки	 - Структура - описание способа обработки электронного документа (см. ПравилоОбработкиЭлектронныхДокументов);
//  СтандартнаяОбработка - Булево - Истина, если специальная обработка не требуется,
//                                  а идентификатор совпадает с именем метаданных документа;
//
// Пример:
//
//	Если ПравилоОбработки.Идентификатор = "ПоступлениеВПереработку" Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		ДополнительныеПараметры = Новый Структура;
//		ДополнительныеПараметры.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
//		
//		ПравилоОбработки.Представление = "Поступление материалов в переработку";
//		ПравилоОбработки.ОбъектМетаданных = Метаданные.Документы.ПоступлениеТоваровУслуг.ПолноеИмя();
//		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
//		
//	КонецЕсли;
//
Процедура ПриПолученииПравилаОбработкиЭлектронногоДокумента(ПравилоОбработки, СтандартнаяОбработка) Экспорт
	
	ИдентификаторПравила = ПравилоОбработки.Идентификатор;
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	Если ИдентификаторПравила = ИдентификаторыПравил.ПриходнаяНакладная_ВозвратОтПокупателя Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидОперации", Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя);
		
		ПравилоОбработки.Представление = "Возврат от покупателя";
		ПравилоОбработки.ОбъектМетаданных = Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя();
		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.НовыйДокументИнформационнойБазы.
//
// Параметры:
//  ДокументОбъект		 - ДокументОбъект	 - новый, еще не записанный, документ-объект;
//  ДанныеЭД			 - Структура		 - содержит данные электронного документа
//                                             (см. Модуль_ИнтеграцияУниверсальный.ДанныеЭлектронногоДокумента);
//  ПараметрыЗаполнения	 - Структура		 - содержит дополнительные параметры заполнения;
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриСозданииДокументаИнформационнойБазы(ДокументОбъект, ДанныеЭД, ПараметрыЗаполнения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если МетаданныеДокумента = Метаданные.Документы.ПриходнаяНакладная Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияДляУПД(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПриходнуюНакладную(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ДополнительныеРасходы Тогда 
		
		СтруктураЗаполнения = СтруктураЗаполненияДляУПД(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьДополнительныеРасходы(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.КорректировкаПоступления Тогда 
		
		СтруктураЗаполнения = СтруктураЗаполненияКорректировкиПоступления(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьКорректировкуПоступления(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.СчетФактураПолученный Тогда 
		
		ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
		
		Если ФорматЭД.ЭтоКорректировка Тогда
			СтруктураЗаполнения = СтруктураЗаполненияКорректировочногоСчетаФактуры(ДанныеЭД, ПараметрыЗаполнения);
		Иначе
			СтруктураЗаполнения = СтруктураЗаполненияДляУПД(ДанныеЭД, ПараметрыЗаполнения);
		КонецЕсли;
		
		ЗаполнитьСчетФактуруПолученный(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.АктОРасхожденияхПолученный Тогда 
		
		СтруктураЗаполнения = СтруктураЗаполненияАктаОРасхожденияхПолученного(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьАктОРасхожденияхПолученный(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.СверкаВзаиморасчетов Тогда
		
		Если ИспользуетсяСверкаВзаиморасчетов3_0_2() Тогда
			
			СтруктураЗаполнения = СтруктураЗаполненияСверкиВзаиморасчетов3_0_2(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьСверкуВзаиморасчетов3_0_2(ДокументОбъект, СтруктураЗаполнения);
			
		Иначе
			
			СтруктураЗаполнения = СтруктураЗаполненияСверкиВзаиморасчетов(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьСверкуВзаиморасчетов(ДокументОбъект, СтруктураЗаполнения);
			
		КонецЕсли;
		
	Иначе
		
		// Специальная обработка заполнения не реализована
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяСправочникаВладельцаНоменклатуры.
//
// Параметры:
//  ИмяСправочника		 - Строка - имя справочника, которому подчинен справочник "НоменклатураПоставщиков";
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииИмениСправочникаВладельцаНоменклатуры(ИмяСправочника, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.МетаданныеПрикладногоСправочника.
//
// Параметры:
//  СоответствиеСправочников	- Соответствие	- ключом является имя справочника в терминах сервиса, а значением - метаданные прикладного справочника;
//  СтандартнаяОбработка		- Булево		- Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСоответствияСправочников(СоответствиеСправочников, СтандартнаяОбработка) Экспорт 
	
	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СсылкаОбъектаПоПолямПоиска.
//
// Параметры:
//  СсылкаНаОбъект		 - Произвольный - ссылка на искомый объект;
//  ПоляПоиска			 - Структура - содержит параметры поиска;
//  ОбъектМетаданных	 - ОбъектМетаданных - метаданные искомого объекта;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//
//  НаименованиеПолное = Неопределено;
//  Если ПоляПоиска.Свойство("НаименованиеПолное", НаименованиеПолное) 
//      И Не ЕстьРеквизитМетаданных(ОбъектМетаданных, "НаименованиеПолное") 
//      И ЕстьРеквизитМетаданных(ОбъектМетаданных, "ПолноеНаименование") Тогда
//          
//          ПоляПоиска.Удалить("НаименованиеПолное");
//          ПоляПоиска.Вставить("ПолноеНаименование", НаименованиеПолное);
//          
//  КонецЕсли;
//
Процедура ПриПолученииСсылкиПоПолямПоиска(СсылкаНаОбъект, ПоляПоиска, ОбъектМетаданных, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СчетаФактурыПоОснованию.
//
// Параметры:
//  НайденныеДокументы	 - Массив	 - Ссылки на найденные счета-фактуры;
//  ПараметрыРегистрации - Структура - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСчетовФактурПоОснованию(НайденныеДокументы, ПараметрыРегистрации, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ИспользуетсяПодсистема_1_6_26() Тогда
		МодульСчетаФактурыУНФ = ОбщегоНазначения.ОбщийМодуль("СчетаФактурыУНФ");
	Иначе
		МодульСчетаФактурыУНФ = ОбщегоНазначения.ОбщийМодуль("УправлениеНебольшойФирмойСервер");
	КонецЕсли;
	
	ОснованиеСФ = ПараметрыРегистрации.Ссылка;
	ИскатьПолученныйСФ = Истина;
	ДанныеСчетаФактуры = МодульСчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(ОснованиеСФ, ИскатьПолученныйСФ);
	
	Если ЗначениеЗаполнено(ДанныеСчетаФактуры) Тогда
		НайденныеДокументы.Добавить(ДанныеСчетаФактуры.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактурыПоОснованию.
//
// Параметры:
//  ПараметрыРегистрации - Структура	 - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  ДокументОснование	 - ЛюбаяСсылка	 - документ, на основании которого необходимо получить параметры;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПодготовкеПараметровРегистрацииСчетаФактуры(ПараметрыРегистрации, ДокументОснование, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СборПротоконтента

Процедура ЗаполнитьКонтентXmlUTD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ФункцияУПД = ПараметрыФормирования.ФункцияДокумента;
	
	ДанныеДляПечати	= ПолучитьДанныеДляФормированияУПД(ДокСсылка, ФункцияУПД);
	ДанныеШапки 	= ДанныеДляПечати.ДанныеШапки;
	ТаблицаТоваров 	= ДанныеДляПечати.ТаблицаТоваров;
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеШапки.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("СчетФактураСсылка") Тогда
		content.СчетФактураСсылка = ДанныеШапки.СчетФактураСсылка;
	КонецЕсли;
	
	Заполнить_ExtendedOrganizationInfo(Content.Buyer, ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента, Истина, ДанныеШапки.БанковскийСчетКонтрагента);
	Если ПараметрыФормирования.Свойство("Получатель_FnsParticipantId") Тогда
		Content.Buyer.FnsParticipantId = ПараметрыФормирования.Получатель_FnsParticipantId;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ДанныеШапки.КонтрагентКПП;
	КонецЕсли;
	
	КППГрузоотправителя = "";
	
	Если ДанныеШапки.ЕстьТовары Тогда
	
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) И НЕ ТипЗнч(ДанныеШапки.Грузоотправитель) = Тип("Строка") Тогда
			
			ПодставлятьКППГрузоотправителя = МетодСервера(,"ПолучитьЗначениеСвойства", ДанныеШапки.Организация, МетодСервера(,"ИдентификаторСвойстваПодставлятьКППГрузоотправителя"));
			
			Если (НЕ ПодставлятьКППГрузоотправителя = Неопределено И ПодставлятьКППГрузоотправителя) Тогда
				КППГрузоотправителя = ?(ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель.КПП), ДанныеШапки.Грузоотправитель.КПП, "");
			КонецЕсли;
			
			Если ДанныеШапки.ОбособленноеПодразделение <> ДанныеШапки.Организация Тогда
				КППГрузоотправителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.ОбособленноеПодразделение, "КПП");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда 
			Заполнить_ExtendedOrganizationInfo(Content.Shipper.OrganizationInfo, ДанныеШапки.Грузоотправитель, ДатаНомер.ДатаДокумента, Ложь, ДанныеШапки.БанковскийСчетГрузоотправителя, КППГрузоотправителя);
			Content.Shipper.SameAsSeller = Ложь;
		Иначе 
			Content.Shipper.SameAsSeller = Истина;
		КонецЕсли;
		
		ГрузополучательСсылка = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
		Заполнить_ExtendedOrganizationInfo(Content.Consignee, ГрузополучательСсылка, ДатаНомер.ДатаДокумента, Ложь, , , ДанныеШапки.АдресДоставки);
		
	КонецЕсли;
		
	Заполнить_ExtendedOrganizationInfo(Content.Seller, ДанныеШапки.Организация, ДатаНомер.ДатаДокумента, Истина, ДанныеШапки.БанковскийСчетОрганизации, КППГрузоотправителя);
	Если ПараметрыФормирования.Свойство("Отправитель_FnsParticipantId") Тогда
		Content.Seller.FnsParticipantId = ПараметрыФормирования.Отправитель_FnsParticipantId;
	КонецЕсли;
	
	Content.Creator = Content.seller.name + ", ИНН/КПП " + МетодСервера(, "ПредставлениеИННКПП", Content.seller);
	Content.Function = ДанныеШапки.Функция;
	
	Если ДанныеШапки.Свойство("ДатаНомерДокументовОплаты") Тогда
		
		СтруктураPaymentDocuments= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_PaymentDocument");
		
		Для Каждого ПРД Из ДанныеШапки.ДатаНомерДокументовОплаты Цикл
			ЗаполненнаяСтруктураPaymentDocuments = СкопироватьСтруктуру(СтруктураPaymentDocuments);
			ЗаполненнаяСтруктураPaymentDocuments.Number = ПРД.НомерПлатежноРасчетногоДокумента;
			ЗаполненнаяСтруктураPaymentDocuments.Date = ПРД.ДатаПлатежноРасчетногоДокумента;
			content.PaymentDocuments.Добавить(ЗаполненнаяСтруктураPaymentDocuments);
		КонецЦикла;
		
	КонецЕсли;
	
	Content.currency = ДанныеШапки.ВалютаДокумента.Код;
	Content.ВалютаСсылка = ДанныеШапки.ВалютаДокумента;
	
	ДанныеШапки.Свойство("ИдентификаторГосконтракта", Content.GovernmentContractInfo);
	
	ЗаполнитьStructedAdditionalInfos(Content.AdditionalInfoId.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	СтруктураItems 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ExtendedInvoiceItem");
	СтруктураГТД 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CustomDeclaration");
	
	TotalNet 	= 0;
	Total 		= 0;
	Vat 		= 0;
	TotalWithVatExcluded = 0;
	
	СФНаАванс = ДанныеШапки.Свойство("СФНаАванс") И ДанныеШапки.СФНаАванс;
	ЕстьСтрокаСНДС = Ложь;
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItems);
		
		Item.Product 		= СтрокаТаблицы.НоменклатураПредставление;
		Item.VendorCode 	= СтрокаТаблицы.НоменклатураКод;
		Item.ItemMark 		= СтрокаТаблицы.ПризнакТоварРаботаУслуга;
		Item.TaxRate 		= СтрокаТаблицы.СтавкаНДСПредставление;
		Item.Subtotal 		= СтрокаТаблицы.СуммаСНДС;
		
		Если Не СФНаАванс Тогда
			Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаСНДС - СтрокаТаблицы.СуммаНДС;
		КонецЕсли;
		
		Если Не МенеджерИнтеграции_ЭтоСтавкаБезНДС(СтрокаТаблицы.СтавкаНДС) Тогда
			Item.Vat = СтрокаТаблицы.СуммаНДС;
			ЕстьСтрокаСНДС = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			Item.Quantity = ?(СФНаАванс И СтрокаТаблицы.Количество = 0, Неопределено, СтрокаТаблицы.Количество); //для отображения прочерка в вэбе
			
			Если ДанныеШапки.ЦенаВключаетНДС И ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДС) Тогда 
				// Расчет цены без НДС
				Item.Price = ?(ЗначениеЗаполнено(Item.Quantity), Окр(Item.SubtotalWithVatExcluded / Item.Quantity, Точность), Неопределено);
			Иначе
				// Без пересчета, т.к. цена уже без НДС
				Item.Price = СтрокаТаблицы.Цена;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
				
				Item.UnitCode = МетодСервера(, "XML_КодЕдиницыИзмерения", СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод));
				Item.UnitName = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
				Item.ЕдиницаИзмеренияСсылка = СтрокаТаблицы.ЕдиницаИзмерения;
				
			Иначе
				
				Номенклатура = СтрокаТаблицы.Номенклатура;
				ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
								
				Item.UnitCode = МетодСервера(, "XML_КодЕдиницыИзмерения", СокрЛП(ЕдиницаИзмерения.Код));
				Item.UnitName = СокрЛП(ЕдиницаИзмерения);
				Item.ЕдиницаИзмеренияСсылка = ЕдиницаИзмерения;
				
			КонецЕсли;
			
		КонецЕсли;
		
		TotalNet = TotalNet + ?(ЗначениеЗаполнено(СтрокаТаблицы.Количество), СтрокаТаблицы.Количество, 0);
		Total 	 = Total 	+ Item.Subtotal;
		Vat 	 = Vat 		+ СтрокаТаблицы.СуммаНДС;
		Если Не СФНаАванс Тогда
			TotalWithVatExcluded = TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхождения) Тогда
				
			ЗаполненнаяСтруктураГТД = СкопироватьСтруктуру(СтруктураГТД);
			Item.CustomDeclarations.Добавить(ЗаполненнаяСтруктураГТД);
									
			ЗаполненнаяСтруктураГТД.CountryCode = СтрокаТаблицы.СтранаПроисхожденияКод;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД) Тогда
				
				ЗаполненнаяСтруктураГТД.DeclarationNumber = СокрЛП(СтрокаТаблицы.НомерГТД);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД) И НЕ МетодСервера(, "СтранаЧленТС", СтрокаТаблицы.СтранаПроисхожденияКод) Тогда
				ЗаполненнаяСтруктураГТД.СтранаПроисхожденияСсылка = СтрокаТаблицы.СтранаПроисхождения;
			Иначе
				ЗаполненнаяСтруктураГТД.СтранаПроисхожденияСсылка = Справочники.СтраныМира.ПустаяСсылка();
			КонецЕсли;
									
		КонецЕсли;
							
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.InvoiceTable.items.добавить(Item);
		
	КонецЦикла;
	
	content.InvoiceTable.TotalNet 	= TotalNet;
	content.InvoiceTable.Total 		= Total;
	content.InvoiceTable.Vat 		= ?(ЕстьСтрокаСНДС, Vat, Неопределено);
	
	Если Не СФНаАванс Тогда
		content.InvoiceTable.TotalWithVatExcluded = TotalWithVatExcluded;
	КонецЕсли;
	
	content.TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	//TransferDate заполняем только если дата отгрузки не совпадает с датой счета-фактуры.
	Если ДанныеШапки.Свойство("ДатаОтгрузки") И НачалоДня(ДанныеШапки.ДатаОтгрузки) <> НачалоДня(ДатаНомер.ДатаДокумента) Тогда
		content.TransferInfo.TransferDate = ДанныеШапки.ДатаОтгрузки;
	КонецЕсли;
	
	СведенияОТранспортировкеИГрузе = "";
	Если ЗначениеЗаполнено(ДанныеШапки.Вес) Тогда
		СведенияОТранспортировкеИГрузе = "масса брутто: " + ЧислоПрописью(ДанныеШапки.Вес, "ДП=Истина", "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеШапки.Объем) Тогда
		СведенияОТранспортировкеИГрузе = СведенияОТранспортировкеИГрузе + ?(ПустаяСтрока(СведенияОТранспортировкеИГрузе), "", ", ")
										+ "объем: " + Формат(ДанныеШапки.Объем, "ЧГ=0") + " м3";
	КонецЕсли;
	
	Если Не ПустаяСтрока(СведенияОТранспортировкеИГрузе) Тогда
		content.TransferInfo.TransferTextInfo = СведенияОТранспортировкеИГрузе;
	КонецЕсли;
	
	ЗаполнитьСведенияОПередаче(Content, ДокСсылка, ФункцияУПД, ПараметрыФормирования);
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный",
		"ЗаполнитьСведенияОЛицеПередавшемТовар",
		Content,
		ДанныеШапки,
		ПараметрыФормирования);
	
	Если ДанныеШапки.Функция = "InvoiceAndBasic" Тогда
		content.Name = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ИначеЕсли ДанныеШапки.Функция = "Basic" Тогда
		content.Name = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	КонецЕсли;
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	ДобавитьДокументыОснованияВСлужебнуюИнформацию(Content);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlUCD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ФункцияУПД = ПараметрыФормирования.ФункцияДокумента;
	
	ДанныеДляПечати = ДанныеДляФормированияУКД(ДокСсылка, Новый Структура("ФункцияУПД", ФункцияУПД));
	
	ШапкаУКД 		= ДанныеДляПечати.Шапка;
	ТаблицаТоваров  = ДанныеДляПечати.ТабличнаяЧасть;
	
	ДатаНомер = ШапкаУКД.ДатаНомерДокумента;
	ОписаниеДокумента = ШапкаУКД.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	Для каждого ДатаНомерДокументаОснования Из ДатаНомер.ДатаНомерДокументовОснований Цикл
		ЗаполнитьInvoiceForCorrectionInfo(Content.Invoices, ДатаНомерДокументаОснования);
	КонецЦикла;
	
	Content.Function = ШапкаУКД.Функция;
	
	Если ШапкаУКД.Функция = "InvoiceAndBasic" Тогда
		Content.Name = "Корректировочный счет-фактура и документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	ИначеЕсли ШапкаУКД.Функция = "Basic" Тогда
		Content.Name = "Документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	КонецЕсли;
	
	Заполнить_ExtendedOrganizationInfo(Content.Seller, ШапкаУКД.Организация, ДатаНомер.ДатаДокумента, Истина, ШапкаУКД.БанковскийСчетОрганизации);
	Если ПараметрыФормирования.Свойство("Отправитель_FnsParticipantId") Тогда
		Content.Seller.FnsParticipantId = ПараметрыФормирования.Отправитель_FnsParticipantId;
	КонецЕсли;
	
	Если ШапкаУКД.Свойство("ДоговорАгента") И ЗначениеЗаполнено(ШапкаУКД.ДоговорАгента) Тогда
										
		Content.Creator  	= ШапкаУКД.Агент.НаименованиеПолное + ", " + МетодСервера(, "СформироватьПредставлениеИННКПП", ШапкаУКД.Агент.ИНН, ШапкаУКД.Агент.КПП);
		Content.CreatorBase = ШапкаУКД.ДоговорАгента.Наименование;
		
	Иначе
		Content.Creator = Content.Seller.Name + ", ИНН/КПП: " + МетодСервера(, "ПредставлениеИННКПП", Content.Seller);
	КонецЕсли;
	
	Заполнить_ExtendedOrganizationInfo(Content.Buyer, ШапкаУКД.Контрагент, ДатаНомер.ДатаДокумента, Истина);
	Если ПараметрыФормирования.Свойство("Получатель_FnsParticipantId") Тогда
		Content.Buyer.FnsParticipantId = ПараметрыФормирования.Получатель_FnsParticipantId;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШапкаУКД.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ШапкаУКД.КонтрагентКПП;
	КонецЕсли;
									
	Content.ВалютаСсылка 	= ШапкаУКД.ВалютаДокумента;
	Content.Currency		= Строка(Content.ВалютаСсылка.Код);
	
	ШапкаУКД.Свойство("ИдентификаторГосконтракта", Content.GovernmentContractInfo);
	
	ЗаполнитьStructedAdditionalInfos(Content.AdditionalInfoId.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	ЗаполнитьInvoiceCorrectionTable(Content.InvoiceCorrectionTable, ТаблицаТоваров);
	
	ЗаполнитьEventContent(Content.EventContent, ШапкаУКД);
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ШапкаУКД);
	
	Content.СлужебнаяИнформация.Вставить("ПередаточныеДокументы", ШапкаУКД.ПередаточныеДокументы);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlTorg12(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров	 = ДанныеТабличныхЧастей(ДанныеШапки);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	Content.Number = ДатаНомер.НомерДокумента;
	Content.Date = ДатаНомер.ДатаДокумента;
	
	БанковскийСчетОрганизации = ДанныеШапки.БанковскийСчетОрганизации;
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеШапки.Организация, ДатаНомер.ДатаДокумента, БанковскийСчетОрганизации, Истина);
	
	ГрузоотправительССылка = ?(ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель), ДанныеШапки.Грузоотправитель, ДанныеШапки.Организация);
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Shipper, ГрузоотправительССылка, ДатаНомер.ДатаДокумента, БанковскийСчетОрганизации, Ложь);
	
	Content.ShipperDepartment = ПолучитьПодразделениеИзДокумента(ДокСсылка);
	
	ГрузополучательСсылка = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Consignee, ГрузополучательСсылка, ДатаНомер.ДатаДокумента, , Ложь, , , ДанныеШапки.АдресДоставки);
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента, , Истина);
	
	НомерЗаказа = ПараметрыФормирования.НомерЗаказа;
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда 
		Content.GroundName =		"Заказ";
		Content.GroundNumber =	СокрЛП(НомерЗаказа);
	Иначе	
		СтруктураДоговора =		СтруктурированноеПредставлениеОснования(ДокСсылка);
		Content.GroundName =		СтруктураДоговора.GroundName;
		Content.GroundDate =		СтруктураДоговора.GroundDate;
		Content.GroundNumber =	СтруктураДоговора.GroundNumber;
	КонецЕсли;	
	
	ИдКонтрагента= 	МетодСервера(,"Контрагент_2_CounteragentBoxID", ДанныеШапки.Контрагент);
	
	ДопСведения = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	Если МетодСервера(,"НужноФормироватьДопИнфоПоШаблону", ИдКонтрагента) = Истина Тогда
		Content.AdditionalInfo= МетодСервера(,"СформироватьСтрокуДопИнфоПоШаблону", ДопСведения);
	Иначе
		Content.AdditionalInfo= ДопСведения;
	КонецЕсли;
	
	TotalParcelsQuantity 	= 0;
	TotalGrossQuantity 		= 0;
	TotalNetQuantity 		= 0;
	TotalMassQuantity 		= 0;
	TotalWithVatExcluded 	= 0;
	Total 					= 0;
	Vat 					= 0;

	СтруктураItems = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_Torg12Item");
	ЕстьСтрокиСНДС = Ложь;
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItems);
		
		Item.Product =		СтрокаТаблицы.НоменклатураПредставление;
		Item.ProductCode = 	СтрокаТаблицы.НоменклатураКод;
		Item.UnitCode = 		МетодСервера(, "Item_UnitCode", СтрокаТаблицы.ЕдиницаИзмерения, СтрокаТаблицы.ЕдиницаИзмеренияКод);
		Item.UnitName =		СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
		Item.Quantity =		СтрокаТаблицы.Количество;
		Item.TaxRate =		СтрокаТаблицы.СтавкаНДСПредставление;
		
		Если ЗначениеЗаполнено(Item.TaxRate) И НЕ МенеджерИнтеграции_ЭтоСтавкаБезНДС(Item.TaxRate) Тогда
			ЕстьСтрокиСНДС = Истина;	
		КонецЕсли;
		
		Item.Vat					= СтрокаТаблицы.СуммаНДС;
		Item.Total					= СтрокаТаблицы.СуммаСНДС;
		Item.TotalWithVatExcluded 	= Item.Total - Item.Vat;
		Item.Price 					= Окр(Item.TotalWithVatExcluded / ?(Item.Quantity = 0, 1, Item.Quantity), 2);
		
		Item.СсылкаНаЕИ=	СтрокаТаблицы.ЕдиницаИзмерения;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.КоличествоМест) Тогда
			
			Item.ParcelsQuantity =	СтрокаТаблицы.КоличествоМест;
			Item.ParcelCapacity =	СтрокаТаблицы.КоличествоВОдномМесте;
			Item.ParcelType =		?(ЗначениеЗаполнено(СтрокаТаблицы.ВидУпаковки), СтрокаТаблицы.ВидУпаковки.Наименование, "");
			Item.GrossQuantity =		СтрокаТаблицы.Масса;
			TotalGrossQuantity =		TotalGrossQuantity + ?(ЗначениеЗаполнено(Item.GrossQuantity), Item.GrossQuantity, 0);
			TotalNetQuantity = 		TotalNetQuantity + ?(ЗначениеЗаполнено(СтрокаТаблицы.МассаНетто), СтрокаТаблицы.МассаНетто, 0);
			TotalParcelsQuantity = 	TotalParcelsQuantity + Item.ParcelsQuantity;
								
		КонецЕсли;	
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.items.Добавить(Item);
		
		TotalMassQuantity = 		TotalMassQuantity + Item.Quantity;
		TotalWithVatExcluded = 	TotalWithVatExcluded + Item.TotalWithVatExcluded;
		Total = 					Total + Item.Total;
		Vat = 					Vat + Item.Vat;
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Item.TaxRate) Тогда
			Item.Vat = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Content.Totals.ParcelsQuantity 		= TotalParcelsQuantity;
	Content.Totals.GrossQuantity 		= TotalGrossQuantity;
	Content.Totals.Quantity 			= TotalMassQuantity;
	Content.Totals.TotalWithVatExcluded	= TotalWithVatExcluded;
	Content.Totals.Total 				= Total;
	Content.Totals.Vat 					= ?(ЕстьСтрокиСНДС, Vat, Неопределено);
	Content.SupplyDate 					= Content.Date; 
	
	Content.commons.TotalSumInWords = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Total, ВалютаРегламентированногоУчета());
	Если ЗначениеЗаполнено(TotalParcelsQuantity) Тогда
		Content.commons.TotalParcelsQuantityInWords
			= СтрЗаменить(ЧислоПрописью(TotalParcelsQuantity, "ДП = Ложь"), "  00", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(TotalGrossQuantity) Тогда 
		Content.commons.TotalGrossQuantityInWords
			= СтрЗаменить(ЧислоПрописью(TotalGrossQuantity,  "ДП = Истина", "кг, кг, кг, м, г, г, г, м,3"), " ноль г", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(TotalNetQuantity) Тогда 
		Content.commons.TotalQuantityInWords
			= СтрЗаменить(ЧислоПрописью(TotalNetQuantity,  "ДП = Истина", "кг, кг, кг, м, г, г, г, м,3"), " ноль г", "");
	КонецЕсли;
	
	ФИОСогласователя = "";
	ДолжностьСогласователя = "";
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОСогласователя = ПараметрыОтправкиНаСогласование.ФИОПодписанта;
			ДолжностьСогласователя = ПараметрыОтправкиНаСогласование.ДолжностьПодписанта;
		Иначе
			Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПолучателя) Тогда 
				ФИОСогласователя = ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			КонецЕсли;
			ДолжностьСогласователя = ПараметрыОтправкиНаСогласование.ДолжностьПолучателя;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ФИОСогласователя = "" Тогда
		
		ПараметрыПодписания = МетодСервера(,"ПолучитьПараметрыПодписанияТ12вДиадок", ДанныеШапки.Организация);
		
		Если ПараметрыПодписания.СпособПодписания = "4" Тогда
			
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyPerformedBy,	МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyAllowedBy, 	МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
			
			ПараметрыПодписания.ДолжностьПодписанта= "Главный (старший) бухгалтер";
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.ChiefAccountant,	МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
			
		ИначеЕсли ПараметрыПодписания.СпособПодписания = "2" Тогда 
			
			ПараметрыПодписания.ДолжностьПодписанта= "Главный (старший) бухгалтер";
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.ChiefAccountant,  МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
			
		ИначеЕсли ПараметрыПодписания.СпособПодписания = "3" Тогда
			
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyPerformedBy,  МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
			
		Иначе
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyAllowedBy,  МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
		КонецЕсли;
		
	Иначе 
		МетодСервера(,"ЗаполнитьФИОПодписанта", Content.SupplyAllowedBy, ФИОСогласователя);
		Content.SupplyAllowedBy.JobTitle = СокрЛП(?(НЕ ПустаяСтрока(ДолжностьСогласователя), ДолжностьСогласователя, "_"));
	КонецЕсли;
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlAcceptanceCertificate(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров	 = ДанныеТабличныхЧастей(ДанныеШапки);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	Content.Number = ДатаНомер.НомерДокумента;
	Content.Date = ДатаНомер.ДатаДокумента;
	
	//поставщик: организация-продавец
	БанковскийСчетОрганизации = ДанныеШапки.БанковскийСчетОрганизации;
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеШапки.Организация, ДатаНомер.ДатаДокумента, БанковскийСчетОрганизации, Истина);
	
	ПредставлениеИсполнителя = 	СформироватьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Организация, ДатаНомер.ДатаДокумента);
	ПредставлениеЗаказчика = 	СформироватьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента);
	
	СтруктураДоговора = 			СтруктурированноеПредставлениеОснования(ДокСсылка, Истина);
	
	НомерДоговора = 	?(СтруктураДоговора.GroundNumber = "", "", " по договору № " + СтруктураДоговора.GroundNumber);
	ДатаДоговора = 	?(СтруктураДоговора.GroundDate = Дата(1, 1, 1), "", " от " + Формат(СтруктураДоговора.GroundDate, "ДФ=dd.MM.yyyy"));
	ДатаДоговора = 	?((СтруктураДоговора.GroundNumber = "" И СтруктураДоговора.GroundDate <> Дата(1, 1, 1)), " по договору " + ДатаДоговора,ДатаДоговора); 
	
	ТекстАкта= "Мы, нижеподписавшиеся, представитель " + ПредставлениеИсполнителя + " (далее «Исполнитель»), с одной стороны, и представитель " + ПредставлениеЗаказчика + " (далее «Заказчик»), с другой стороны," +
	" составили настоящий акт о том, что «Исполнитель» выполнил, а «Заказчик» принял следующие работы (услуги)" + НомерДоговора + ДатаДоговора + ":";
	
	Content.Title = ТекстАкта;
	
	ДопСведения = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ИдКонтрагента= МетодСервера(, "Контрагент_2_CounteragentBoxID", ДанныеШапки.Контрагент);
	Если МетодСервера(, "НужноФормироватьДопИнфоПоШаблону", ИдКонтрагента) = Истина Тогда
		Content.AdditionalInfo = МетодСервера(, "СформироватьСтрокуДопИнфоПоШаблону", ДопСведения);
	Иначе
		Content.AdditionalInfo = ДопСведения;
	КонецЕсли;
	
	Content.SignatureDate = Content.Date;

	СтруктураItems = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AcceptanceCertificateItem");
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItems);
		Если (ЗначениеЗаполнено(СтрокаТаблицы.Количество) = Ложь) ИЛИ (ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмеренияКод) = Ложь) Тогда
			Item.Description = СтрокаТаблицы.НоменклатураПредставление;
		Иначе 
			Item.Name = СтрокаТаблицы.НоменклатураПредставление;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			Item.UnitCode= МетодСервера(, "Item_UnitCode", СтрокаТаблицы.ЕдиницаИзмерения, СтрокаТаблицы.ЕдиницаИзмеренияКод);
			Если Item.UnitCode = "" И ЗначениеЗаполнено(Item.Name) Тогда
				Item.Description = 	Item.Name;
				Item.Name = 			Неопределено;
			КонецЕсли;
		Иначе
			Item.UnitCode = "";
		КонецЕсли;
							
		Item.UnitName =  	СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
		Если ЗначениеЗаполнено(Item.Name) Тогда
			Item.Quantity = СтрокаТаблицы.Количество;
		КонецЕсли;
		
		Item.Vat 					= СтрокаТаблицы.СуммаНДС;
		Item.Total					= СтрокаТаблицы.СуммаСНДС;
		Item.TotalWithVatExcluded 	= Item.Total - Item.Vat;
		Item.Price 					= ?(НЕ ЗначениеЗаполнено(item.Quantity), Неопределено, СтрокаТаблицы.Цена);
		Item.СсылкаНаЕИ 			= СтрокаТаблицы.ЕдиницаИзмерения;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.items.Добавить(Item);
		
	КонецЦикла;
	
	ПараметрыПодписания = МетодСервера(, "ПолучитьПараметрыПодписанияТ12вДиадок", ДанныеШапки.Организация);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ПараметрыПодписания.ФИОПодписанта = 			ПараметрыОтправкиНаСогласование.ФИОПодписанта;
			ПараметрыПодписания.ДолжностьПодписанта = 	ПараметрыОтправкиНаСогласование.ДолжностьПодписанта;
		Иначе
			ФИОПолучателя = 								ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			ПараметрыПодписания.ФИОПодписанта = 			ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			ПараметрыПодписания.ДолжностьПодписанта = 	ПараметрыОтправкиНаСогласование.ДолжностьПолучателя;
		КонецЕсли;
	КонецЕсли;
					
	МетодСервера(, "ЗаполнитьПодписантаДляXmlTorg12", Content.Official, МетодСервера(, "ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoiceCorrection(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ДанныеДляПечати = СформироватьДанныеДляПечати(ДокСсылка, Истина);
	
	ДатаНомер = ДанныеДляПечати.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеДляПечати.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.InvoiceCorrectionNumber	 = ДатаНомер.НомерДокумента;
	Content.InvoiceCorrectionDate	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	ДанныеОснований = ДатаНомер.ДатаНомерДокументовОснований;
	
	Если ЗначениеЗаполнено(ДанныеОснований) Тогда
		
		ДанныеОснования = ДанныеОснований[0];
		
		OriginalInvoices = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_OriginalInvoice");
		OriginalInvoices.Number	 = ДанныеОснования.НомерИсходногоДокумента;
		OriginalInvoices.Date	 = ДанныеОснования.ДатаИсходногоДокумента;
		
		Если ДанныеОснования.УчитыватьИсправлениеИсходногоДокумента Тогда
			OriginalInvoices.InvoiceRevisionNumber	 = ДанныеОснования.НомерИсправленияИсходногоДокумента;
			OriginalInvoices.InvoiceRevisionDate	 = ДанныеОснования.ДатаИсправленияИсходногоДокумента;
		КонецЕсли;
		Content.OriginalInvoices.Добавить(OriginalInvoices);
	
	КонецЕсли;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент, ДатаНомер.ДатаДокумента, , Истина, Истина);
	
	Если ЗначениеЗаполнено(ДанныеДляПечати.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ДанныеДляПечати.КонтрагентКПП;
	КонецЕсли;
	
	КППГрузоотправителя = "";
	Если ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель) И НЕ ТипЗнч(ДанныеДляПечати.Грузоотправитель) = Тип("Строка") Тогда
		ПодставлятьКППГрузоотправителя = МетодСервера(, "ПолучитьЗначениеСвойства", ДанныеДляПечати.Организация, МетодСервера(, "ИдентификаторСвойстваПодставлятьКППГрузоотправителя"));
		Если (НЕ ПодставлятьКППГрузоотправителя = Неопределено И ПодставлятьКППГрузоотправителя) Тогда
			КППГрузоотправителя= ?(ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель.КПП), ДанныеДляПечати.Грузоотправитель.КПП, "");
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеДляПечати.Организация, ДатаНомер.ДатаДокумента, , Истина, Истина, КППГрузоотправителя);
	
	content.currency 		= ДанныеДляПечати.ВалютаДокументаКод;
	content.ВалютаСсылка 	= ДанныеДляПечати.ВалютаДокумента;
	
	ЗаполнитьStructedAdditionalInfos(Content.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);

	СтруктураItemInvoiceCorrection = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceCorrectionItem");

	Для каждого СтрокаДанных Из ДанныеДляпечати.ТабличнаяЧасть Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItemInvoiceCorrection);
		Item.AmountsDec 		= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.AmountsInc 		= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.OriginalValues 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		Item.CorrectedValues 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		
		Item.Product= СтрокаДанных.НоменклатураПредставление;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения) Тогда
			Item.OriginalValues.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаДанных.ЕдиницаИзмеренияДоИзменения, СтрокаДанных.ЕдиницаИзмеренияДоИзмененияКод);
		Иначе
			Item.OriginalValues.UnitCode = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
			Item.CorrectedValues.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаДанных.ЕдиницаИзмерения, СтрокаДанных.ЕдиницаИзмеренияКод);
		Иначе
			Item.CorrectedValues.UnitCode = "";	
		КонецЕсли;
		
		Item.OriginalValues. ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмеренияДоИзменения;
		Item.CorrectedValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмерения;
		
		Item.OriginalValues. TotalWithVatExcluded = СтрокаДанных.СуммаСНДСДоИзменения - СтрокаДанных.СуммаНДСДоИзменения;
		Item.CorrectedValues.TotalWithVatExcluded = СтрокаДанных.СуммаСНДС 			  - СтрокаДанных.СуммаНДС;
		
		Item.OriginalValues. Quantity = СтрокаДанных.КоличествоДоИзменения;
		Item.CorrectedValues.Quantity = СтрокаДанных.Количество;
		
		Item.OriginalValues. Price= Строка(?(Item.OriginalValues. Quantity = 0, 0, Окр(Item.OriginalValues. TotalWithVatExcluded / Item.OriginalValues. Quantity, Точность)));
		Item.CorrectedValues.Price= Строка(?(Item.CorrectedValues.Quantity = 0, 0, Окр(Item.CorrectedValues.TotalWithVatExcluded / Item.CorrectedValues.Quantity, Точность)));
		
		Item.OriginalValues. TaxRate = СтрокаДанных.СтавкаНДСДоИзмененияПредставление;
		Item.CorrectedValues.TaxRate = СтрокаДанных.СтавкаНДСПредставление;
		
		Item.OriginalValues. Vat = СтрокаДанных.СуммаНДСДоИзменения;
		Item.CorrectedValues.Vat = СтрокаДанных.СуммаНДС;
		
		Item.OriginalValues. Total = СтрокаДанных.СуммаСНДСДоИзменения;
		Item.CorrectedValues.Total = СтрокаДанных.СуммаСНДС;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		
		Content.items.Добавить(Item);
		
	КонецЦикла;
	
	стПодписант = МетодСервера(, "СформироватьПараметрыПодписанта", ПараметрыФормирования.ФИОПодписанта);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОПолучателя = ПараметрыОтправкиНаСогласование.ФИОПодписанта;
		Иначе
			ФИОПолучателя = ПараметрыОтправкиНаСогласование.ФИОПолучателя;
		КонецЕсли;
		
		ПодписантФамилия 	= ВыделитьСлово(ФИОПолучателя);
		ПодписантИмя 		= ВыделитьСлово(ФИОПолучателя);
		ПодписантОтчество 	= ВыделитьСлово(ФИОПолучателя);
		стПодписант.ПодписантФамилия 	= ?(НЕ ПустаяСтрока(ПодписантФамилия), ПодписантФамилия, " ");
		стПодписант.ПодписантИмя 		= ?(НЕ ПустаяСтрока(ПодписантИмя), ПодписантИмя, " ");
		стПодписант.ПодписантОтчество 	= ?(НЕ ПустаяСтрока(ПодписантОтчество), ПодписантОтчество, "");
		
	КонецЕсли;
	
	Content.Signer.Surname 			= стПодписант.ПодписантФамилия;
	Content.Signer.FirstName 		= стПодписант.ПодписантИмя;
	Content.Signer.Patronymic 		= стПодписант.ПодписантОтчество;
	Content.Signer.Inn 				= Content.seller.inn;
	Content.Signer.IsSoleProprietor = Content.seller.IsSoleProprietor;
	Content.Signer.SoleProprietorRegistrationCertificate = ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляПечати.Организация);
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеДляПечати);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoice(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ДанныеДляПечати = СформироватьДанныеДляПечати(ДокСсылка, Ложь);
	
	ДатаНомер = ДанныеДляПечати.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеДляПечати.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.InvoiceRevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.InvoiceRevisionDate		 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	СтруктураPaymentDocuments= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_PaymentDocument");
	
	Для Каждого ПРД Из ДанныеДляПечати.ДатаНомерДокументовОплаты Цикл
		
		PaymentDocumentContent=	СкопироватьСтруктуру(СтруктураPaymentDocuments);
		
		PaymentDocumentContent.Number= 	ПРД.НомерПлатежноРасчетногоДокумента;
		PaymentDocumentContent.Date= 	ПРД.ДатаПлатежноРасчетногоДокумента;
		
		Content.PaymentDocuments.Добавить(PaymentDocumentContent);
		
	КонецЦикла;	
	
	Content.currency= 		ДанныеДляПечати.ВалютаДокумента.Код;
	Content.ВалютаСсылка= 	ДанныеДляПечати.ВалютаДокумента;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент, ДатаНомер.ДатаДокумента, , Истина, Истина);
	Если ЗначениеЗаполнено(ДанныеДляПечати.КонтрагентКПП) Тогда
		Content.Buyer.kpp= ДанныеДляПечати.КонтрагентКПП;
	КонецЕсли;
	
	КППГрузоотправителя= "";
	Если ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель) И НЕ ТипЗнч(ДанныеДляПечати.Грузоотправитель) = Тип("Строка") Тогда
		ПодставлятьКППГрузоотправителя=	МетодСервера(,"ПолучитьЗначениеСвойства", ДанныеДляПечати.Организация, МетодСервера(,"ИдентификаторСвойстваПодставлятьКППГрузоотправителя"));
		Если (НЕ ПодставлятьКППГрузоотправителя = Неопределено И ПодставлятьКППГрузоотправителя) Тогда
			КППГрузоотправителя= ?(ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель.КПП), ДанныеДляПечати.Грузоотправитель.КПП, "");
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеДляПечати.Организация, ДатаНомер.ДатаДокумента, , Истина, Истина, КППГрузоотправителя);
	
	// Грузоотправителя и грузополучателя заполняем только если в ТЧ есть товары
	Если ДанныеДляПечати.ЕстьТовары Тогда 
		
		Если ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель) Тогда 
			ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(Content.Shipper, ДанныеДляПечати.Грузоотправитель, ДатаНомер.ДатаДокумента);
			Content.Shipper.SameAsSellerOrBuyer= Ложь;
		Иначе
			Content.Shipper.SameAsSellerOrBuyer= Истина;
		КонецЕсли;
		
		ГрузополучательСсылка = ?(ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель), ДанныеДляПечати.Грузополучатель, ДанныеДляПечати.Контрагент);
		ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(Content.Consignee, ГрузополучательСсылка, ДатаНомер.ДатаДокумента, ДанныеДляПечати.АдресДоставки); 
		
	КонецЕсли;
	
	ЗаполнитьStructedAdditionalInfos(Content.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);

	СтруктураItemInvoice=	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItem");

	Vat= 					0;
	TotalWithVatExcluded= 	0;
	Total= 					0;
	
	ЭтоСФНаАванс = СчетФактураНаАванс(ДокСсылка);
	
	Для каждого Стр Из ДанныеДляПечати.ТабличнаяЧасть Цикл
		
		Item= СкопироватьСтруктуру(СтруктураItemInvoice);
		
		Item.Product= 	Стр.НоменклатураПредставление;
		
		Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Item.UnitCode= МетодСервера(, "Item_UnitCode", Стр.ЕдиницаИзмерения, Стр.ЕдиницаИзмеренияКод);
		Иначе
			Item.UnitCode= "";
		КонецЕсли;
							
		Item.ЕдиницаИзмеренияСсылка= Стр.ЕдиницаИзмерения;
		
		Если Не ЭтоСФНаАванс Тогда 
			Item.TotalWithVatExcluded= Стр.СуммаСНДС - Стр.СуммаНДС;
		КонецЕсли;	
		
		Если Не ЭтоСФНаАванс И ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) И ЗначениеЗаполнено(Стр.ЕдиницаИзмеренияКод) Тогда
			Item.Quantity=	Стр.Количество;
			Item.price= 	Строка(?(Item.Quantity = 0, Неопределено, Окр(Item.TotalWithVatExcluded/Item.Quantity, Точность)));
		Иначе 
			//Item.Quantity = 0;
			//Item.price =  0;
		КонецЕсли; 
		
		Если Не МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДСПредставление) Тогда
			Item.Vat = Стр.СуммаНДС;
		КонецЕсли;
		
		Item.Total 						= Стр.СуммаСНДС;
		Item.TaxRate 					= Стр.СтавкаНДСПредставление;
		Item.CountriesOfOrigin 			= ?(ЗначениеЗаполнено(Стр.СтранаПроисхожденияКод), Стр.СтранаПроисхожденияКод, "");
		Item.СтранаПроисхожденияСсылка 	= ?(ЗначениеЗаполнено(Стр.СтранаПроисхождения), Стр.СтранаПроисхождения, Справочники.СтраныМира.ПустаяСсылка());
		Item.CustomsDeclarationNumbers 	= СокрЛП(Стр.НомерГТД);
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, Стр);
		
		Content.items.добавить(Item);
		
		Vat= 					Vat	+ Стр.СуммаНДС;
		TotalWithVatExcluded= 	TotalWithVatExcluded + ?(Item.TotalWithVatExcluded = Неопределено, 0, Item.TotalWithVatExcluded);
		Total= 					Total + Item.Total;
		
	КонецЦикла;	
	
	Content.Totals.Vat= 					Vat;
	Content.Totals.TotalWithVatExcluded= 	TotalWithVatExcluded;
	Content.Totals.Total= 					Total;
	
	стПодписант = МетодСервера(, "СформироватьПараметрыПодписанта", ПараметрыФормирования.ФИОПодписанта);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОПолучателя= ПараметрыОтправкиНаСогласование.ФИОПодписанта;
		Иначе	
			ФИОПолучателя= ПараметрыОтправкиНаСогласование.ФИОПолучателя;
		КонецЕсли;
		
		ПодписантФамилия=				ВыделитьСлово(ФИОПолучателя);
		ПодписантИмя= 					ВыделитьСлово(ФИОПолучателя);
		ПодписантОтчество= 				ВыделитьСлово(ФИОПолучателя);
		
		стПодписант.ПодписантФамилия=	?(НЕ ПустаяСтрока(ПодписантФамилия), ПодписантФамилия, " ");
		стПодписант.ПодписантИмя= 		?(НЕ ПустаяСтрока(ПодписантИмя), ПодписантИмя, " ");
		стПодписант.ПодписантОтчество= 	?(НЕ ПустаяСтрока(ПодписантОтчество), ПодписантОтчество, "");
		
	КонецЕсли;
					
	Content.Signer.Surname= 			стПодписант.ПодписантФамилия;
	Content.Signer.FirstName= 			стПодписант.ПодписантИмя;
	Content.Signer.Patronymic= 			стПодписант.ПодписантОтчество;
	Content.Signer.Inn= 				Content.seller.inn;
	Content.Signer.IsSoleProprietor= 	Content.seller.IsSoleProprietor;
	Content.Signer.SoleProprietorRegistrationCertificate= ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляПечати.Организация);	
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеДляПечати);
	
КонецПроцедуры

#КонецОбласти

#Область МашиночитаемыеДоверенности
 
Функция МЧД_ИмяСправочникаВИнформационнойБазе(СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенности(Ссылка, СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОберткиДляВызоваУниверсальныхМетодов

Функция ДанныеШапки(Ссылка)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеШапки", Ссылка);
	
КонецФункции

Функция ДанныеТабличныхЧастей(Шапка) 
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеТабличныхЧастей", Шапка);
	
КонецФункции

Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьРеквизитМетаданных", ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты);
	
КонецФункции

Функция СкопироватьСтруктуру(Знач СтруктураИсходник)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "СкопироватьСтруктуру", СтруктураИсходник);
	
КонецФункции

Процедура ДополнитьТаблицу(ТаблицаПриемник, ТаблицаИсточник)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьТаблицу", ТаблицаПриемник, ТаблицаИсточник);
	
КонецПроцедуры

Функция РеквизитыЮрФизЛица(ЮрФизЛицо, Период = '00010101', Знач БанковскийСчет = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "РеквизитыЮрФизЛица", ЮрФизЛицо, Период, БанковскийСчет);
	
КонецФункции

Функция ПредставлениеЮрФизЛица(Реквизиты, ШаблонПредставления = "", СПрефиксом = Истина)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеЮрФизЛица", Реквизиты, ШаблонПредставления, СПрефиксом);
	
КонецФункции

Процедура ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти", Шапка, ТабличнаяЧасть);
	
КонецПроцедуры

// Формирует представление номенклатуры с помощью программного интерфейса актуальной версии конфигурации.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура, Строка - Номенклатура или её наименование
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Строка - Характеристика или её наименование
// 
// Возвращаемое значение:
//  Строка - представление номенклатуры.
//
Функция ПредставлениеНоменклатурыУНФ(Номенклатура, Характеристика = Неопределено)
	
	Если ТипЗнч(Номенклатура) = Тип("Строка") Тогда
		
		ПараметрыНоменклатуры = Новый Структура;
		ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры"		, Номенклатура);
		ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики"	, Характеристика);
		ПараметрыНоменклатуры.Вставить("ПредставлениеСерииНоменклатуры"	, "");
		
		МодульПечатьДокументовУНФ = ОбщегоНазначения.ОбщийМодуль("ПечатьДокументовУНФ");
		Представление = МодульПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры);
		
	Иначе
		
		МодульТабличныеЧастиУНФ = ОбщегоНазначения.ОбщийМодуль("ТабличныеЧастиУНФ");
		Представление = МодульТабличныеЧастиУНФ.ТекстСодержания(Номенклатура, Характеристика);
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Формирует представление номенклатуры с помощью программного интерфейса конфигурации до версии 1.6.25 включительно.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура, Строка - Номенклатура или её наименование
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Строка - Характеристика или её наименование
// 
// Возвращаемое значение:
//  Строка - представление номенклатуры.
//
Функция ПредставлениеНоменклатурыУНФ_1_6_25(Номенклатура, Характеристика = Неопределено)
	
	МодульУНФ = ОбщегоНазначения.ОбщийМодуль("УправлениеНебольшойФирмойСервер");
	
	Если ТипЗнч(Номенклатура) = Тип("Строка") Тогда
		Представление = МодульУНФ.ПолучитьПредставлениеНоменклатурыДляПечати(Номенклатура, Характеристика);
	Иначе
		Представление = МодульУНФ.ПолучитьТекстСодержания(Номенклатура, Характеристика);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Формирует представление номенклатуры с помощью программного интерфейса конфигурации.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура, Строка - Номенклатура или её наименование
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Строка - Характеристика или её наименование
// 
// Возвращаемое значение:
//  Строка - представление номенклатуры.
//
Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика = Неопределено)
	
	ИспользуетсяПодсистема_1_6_26 =  ИспользуетсяПодсистема_1_6_26();
	
	Если ИспользуетсяПодсистема_1_6_26 Тогда
		
		Представление = ПредставлениеНоменклатурыУНФ(
			Номенклатура,
			Характеристика
		);
		
	Иначе
		
		Представление = ПредставлениеНоменклатурыУНФ_1_6_25(
			Номенклатура,
			Характеристика
		);
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Процедура ДополнитьКонтентДокументаСлужебнойИнформацией(Контент, ДанныеШапки)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентДокументаСлужебнойИнформацией"
				, Контент
				, ДанныеШапки);
	
КонецПроцедуры

Процедура ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Контент, СтрокаТЧ)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией"
				, Контент
				, СтрокаТЧ);
	
КонецПроцедуры

Процедура ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(Контент, СтрокаТЧ)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией"
				, Контент
				, СтрокаТЧ);
	
КонецПроцедуры

Функция ХранилищеКонтактнойИнформацииОбъекта(СсылкаНаОбъект)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ХранилищеКонтактнойИнформацииОбъекта", СсылкаНаОбъект);
	
КонецФункции

Функция АдресЮрФизЛица(ЮрФизЛицо, ВидАдреса, Дата = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "АдресЮрФизЛица", ЮрФизЛицо, ВидАдреса, Дата);
	
КонецФункции

Функция СведенияОбАдресе(Адрес, ДополнительныеПараметры = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "СведенияОбАдресе", Адрес, ДополнительныеПараметры);
	
КонецФункции

Функция ПредставлениеКонтактнойИнформацииОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации, Разделитель = ",", Дата = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеКонтактнойИнформацииОбъекта"
		, СсылкаИлиОбъект
		, ВидКонтактнойИнформации
		, Разделитель
		, Дата
		, ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

Процедура Заполнить_AddressInfo(AddressInfo, СтруктураАдреса)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Заполнить_AddressInfo", AddressInfo, СтруктураАдреса);
	
КонецПроцедуры

Функция ВидыЭлектронныхДокументов()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ВидыЭлектронныхДокументов");
	
КонецФункции

Процедура ДобавитьВидДокументаДляОбмена(ВидыДокументов, ОбъектМетаданных, ВидЭД, Ограничения = Неопределено, ПравилоКонвертацииСвойств = Неопределено)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьВидДокументаДляОбмена"
				, ВидыДокументов
				, ОбъектМетаданных
				, ВидЭД
				, Ограничения
				, ПравилоКонвертацииСвойств);
	
КонецПроцедуры

Функция НовоеПравилоКонвертацииСвойствЭД()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовоеПравилоКонвертацииСвойствЭД");
	
КонецФункции

Функция ЕстьНезаполненныйРеквизитОбъекта(ИмяРеквизита, Объект, МетаданныеОбъекта)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьНезаполненныйРеквизитОбъекта"
					, ИмяРеквизита
					, Объект
					, МетаданныеОбъекта);
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоСтруктуры(СложнаяСтруктура, ПолныйКлюч, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СвойствоСтруктуры"
					, СложнаяСтруктура
					, ПолныйКлюч
					, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных, ОднозначноеСоответствие = Истина)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СсылкаОбъектаПоПолямПоиска"
					, ПоляПоиска
					, ОписаниеОбъектаМетаданных
					, ОднозначноеСоответствие);
	
	Возврат Результат;
	
КонецФункции

Функция СопоставленныеУчетныеДокументы(ИдентификаторЭД)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СопоставленныеУчетныеДокументы", ИдентификаторЭД);
	
	Возврат Результат;
	
КонецФункции

Функция ПустыеЗначенияРеквизита(ИмяРеквизита)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПустыеЗначенияРеквизита", ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Возврат МетодСервера(, "СравнитьВерсии", СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции

// Добавляет новую запись в таблицу правил обработки электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - см. ПравилаОбработкиВходящихДокументов;
//  ИдентификаторПравила - Строка - идентификатор правила обработки документов;
//  ВидДокумента		 - Строка - вид документа, к которому относится правило (см. ВидыЭлектронныхДокументов);
//  ДляИсправлений		 - Булево, Неопределено - Ложь, если правило действует только для первичной версии документа;
//                                            Истина, если правило действует для только для исправленной версии документа;
//                                            Неопределено, если правило действует только для первичной и исправительной версий документа;
//
Процедура ДобавитьПравилоОбработкиДокументов(ПравилаОбработки, ИдентификаторПравила, ВидДокумента, ДляИсправлений)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьПравилоОбработкиДокументов"
		, ПравилаОбработки
		, ИдентификаторПравила
		, ВидДокумента
		, ДляИсправлений);
	
КонецПроцедуры

Функция НоваяТаблицаШтрихкодыУпаковок()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяТаблицаШтрихкодыУпаковок");
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, СведенияОМаркировке, GTIN = "")
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьТаблицуШтрихкодов"
		, ШтрихкодыУпаковок
		, СведенияОМаркировке
		, GTIN);
	
КонецПроцедуры

Функция НовыеСвойстваНоменклатурыИБ() Экспорт
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваНоменклатурыИБ");
	
	Возврат Результат;
	
КонецФункции

Функция XML_КодЕдиницыИзмерения(КодЕдиницыИзмерения)
	
	Результат = МетодСервера(, "XML_КодЕдиницыИзмерения", КодЕдиницыИзмерения);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(КодОКЕИ)
	
	Результат = МетодСервера(, "НаименованиеЕдиницыИзмеренияПоКодуОКЕИ", КодОКЕИ);
	
	Возврат Результат;
	
КонецФункции

Функция НовыеСвойстваЭлементаПрослеживаемости()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваЭлементаПрослеживаемости");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтавкиНДС

Функция МенеджерИнтеграции_ЭтоСтавкаБезНДС(Ставка)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЭтоСтавкаБезНДС", Ставка);
	Возврат Результат;
	
КонецФункции

Функция ЗначениеСтавкиНДС(ПредставлениеСтавки)
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = "без НДС";
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("5/105", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5/105";
		ИначеЕсли СтрНайти("7/107", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7/107";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиНДС(ЗначениеСтавки)
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = "##";
		
	ИначеЕсли ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СокрЛП(ЗначениеСтавки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	Результат.Вставить("0", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("10", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("18", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("20", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("10/110", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("18/118", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("20/120", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("5", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("7", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("22", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("5/105", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("7/107", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("22/122", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("без НДС", Справочники.СтавкиНДС.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	""0"" КАК Ставка,
	|	СтавкиНДС.Ссылка КАК Значение
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 0
	|	И НЕ СтавкиНДС.НеОблагается
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""10"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 10
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""18"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 18
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""20"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 20
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""10/110"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 10
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""18/118"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 18
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""20/120"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 20
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""5"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 5
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""7"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 7
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""22"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 22
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""5/105"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 5
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""7/107"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 7
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""22/122"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 22
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""без НДС"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 0
	|	И СтавкиНДС.НеОблагается";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ставка, Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПредставлениеНомера(НомерОбъекта)
	
	БезПрефиксаИнформационнойБазы = Константы.ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы.Получить();
	БезПрефиксаПользователя = Константы.ПредставлениеНомераДокументаБезПрефиксаПользователя.Получить();
	
	Результат = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерОбъекта
		, БезПрефиксаИнформационнойБазы
		, БезПрефиксаПользователя);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНомераОбъекта(СсылкаНаОбъект)
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	
	РеквизитыОбъекта = Новый Структура;
	РеквизитыОбъекта.Вставить("Номер");
	
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ПредставлениеНомера") Тогда
		РеквизитыОбъекта.Вставить("ПредставлениеНомера");
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыОбъекта);
	
	Если ЗначенияРеквизитов.Свойство("ПредставлениеНомера") Тогда
		Результат = ЗначенияРеквизитов.ПредставлениеНомера;
	Иначе
		НомерОбъекта = ЗначенияРеквизитов.Номер;
		Результат = ПредставлениеНомера(НомерОбъекта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьНомерЦифровымИндексомОП(ДатаНомер, ЦифровойИндексОП, СсылкаНаОбъект)

	Если ЭтоСчетФактура(СсылкаНаОбъект) Тогда
		МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьНомерЦифровымИндексомОП", ДатаНомер, ЦифровойИндексОП);
	КонецЕсли;
	
КонецПроцедуры

// Формирует сводную таблицу, содержащую сведения о товарной части каждого документа из переданного списка.
//
// Параметры:
//  ДокументИлиМассив - ДокументСсылка, Массив - содержит ссылки на документы, табличные части которых нужно получить.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
Функция ДанныеТабличныхЧастейМассиваДокументов(ДокументИлиМассив)
	
	Если ТипЗнч(ДокументИлиМассив) = Тип("Массив") Тогда
		МассивДокументов = ДокументИлиМассив;
	Иначе
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(ДокументИлиМассив);
	КонецЕсли;
	
	ДанныеТЧ = Неопределено;
	
	Для Каждого Ссылка Из МассивДокументов Цикл 
		
		Шапка = ДанныеШапки(Ссылка);
		Буфер = ДанныеТабличныхЧастей(Шапка);
		
		Если ДанныеТЧ = Неопределено Тогда 
			ДанныеТЧ = Буфер.Скопировать();
		Иначе 
			ДополнитьТаблицу(ДанныеТЧ, Буфер);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеТЧ;
	
КонецФункции

Процедура ДобавитьДокументыОснованияВСлужебнуюИнформацию(Контент)
	
	СсылкаНаОбъект = Контент.СлужебнаяИнформация.Ссылка;
	
	Если Не ЭтоСчетФактура(СсылкаНаОбъект)
		Или СчетФактураНаАванс(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОснования = ВсеДокументыОснования(СсылкаНаОбъект);
	Контент.СлужебнаяИнформация.Вставить("ДокументыОснования", ДокументыОснования);
	
КонецПроцедуры

Функция ВсеДокументыОснования(СсылкаНаОбъект)
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ИмяДокумента = МетаданныеОбъекта.Имя;
	
	ИмяМетаданныхТаблицыОснований = СтрЗаменить("Документ.%ИмяДокумента%.ТабличнаяЧасть.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
	
	Результат = Новый Массив;
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", ИмяМетаданныхТаблицыОснований) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	&ПолноеИмяТаблицы КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
		
		ПолноеИмяТаблицы = СтрЗаменить("Документ.%ИмяДокумента%.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ДокументОснование") Тогда
		
		Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОснование");
		Результат.Добавить(Основание);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает документ-основание произвольного документа.
// Если оснований несколько, берется только первое.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - произвольный документ, основание которого требуется получить.
// 
// Возвращаемое значение:
//  ДокументСсылка - документ-основание.
//
Функция ПервыйДокументОснование(СсылкаНаДокумент)
	
	Результат = Неопределено;
	
	МетаданныеДокумента	 = СсылкаНаДокумент.Метаданные();
	ИмяДокумента		 = МетаданныеДокумента.Имя;
	
	ПолноеИмяТаблицыОснований = СтрЗаменить("Документ.%ИмяДокумента%.ТабличнаяЧасть.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", ПолноеИмяТаблицыОснований) Тогда 
	
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.%ИмяДокумента%.ДокументыОснования КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяДокумента%", ИмяДокумента);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Результат = Выборка.ДокументОснование;
		КонецЕсли;
		
	ИначеЕсли ЕстьРеквизитМетаданных(МетаданныеДокумента, "ДокументОснование") Тогда 
		
		Результат = МетодСервера(, "ЗначениеРеквизитаОбъекта", СсылкаНаДокумент, "ДокументОснование");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет реквизиты шапки счета-фактуры значениями реквизитов документа-основания.
// Для печати счета-фактуры многие реквизиты берутся из его документа-основания.
//
// Параметры:
//  ДанныеСчетаФактуры - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуСчетаФактурыПоДокументуОснованию(ДанныеСчетаФактуры)
	
	СсылкаНаОбъект = ДанныеСчетаФактуры.ОписаниеДокумента.Ссылка;
	ДокументОснование = ПервыйДокументОснование(СсылкаНаОбъект);
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеДокументаОснования = ДанныеШапки(ДокументОснование);
	
	КопируемыеРеквизиты = Новый Массив;
	КопируемыеРеквизиты.Добавить("ХозяйственнаяОперация");
	КопируемыеРеквизиты.Добавить("Грузополучатель");
	КопируемыеРеквизиты.Добавить("Грузоотправитель");
	КопируемыеРеквизиты.Добавить("БанковскийСчетОрганизации");
	КопируемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
	КопируемыеРеквизиты.Добавить("БанковскийСчетГрузоотправителя");
	КопируемыеРеквизиты.Добавить("БанковскийСчетГрузополучателя");
	КопируемыеРеквизиты.Добавить("ЦенаВключаетНДС");
	КопируемыеРеквизиты.Добавить("АдресДоставки");
	КопируемыеРеквизиты.Добавить("ОбособленноеПодразделение");
	КопируемыеРеквизиты.Добавить("ЦифровойИндексОбособленногоПодразделения");
	
	Для Каждого ИмяРеквизита Из КопируемыеРеквизиты Цикл 
		
		Если ЗначениеЗаполнено(ДанныеДокументаОснования[ИмяРеквизита]) Тогда 
			ДанныеСчетаФактуры.Вставить(ИмяРеквизита, ДанныеДокументаОснования[ИмяРеквизита]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументРеализацииСодержитТолькоУслуги(СсылкаНаОбъект)
	
	Результат = Ложь;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТЧ.ТипНоменклатурыЗапас, Ложь)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ), Ложь) КАК ЕстьТовары,
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ТЧ.ТипНоменклатурыЗапас
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ), Ложь) КАК ЕстьУслуги
	|ИЗ
	|	&ПолноеИмяТаблицы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект";
	
	ПолноеИмяТаблицы = СтрШаблон("%1.%2"
		, СсылкаНаОбъект.Метаданные().ПолноеИмя()
		, "Запасы");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Запрос.Текст = СтрЗаменить(ШаблонЗапроса
		, "&ПолноеИмяТаблицы"
		, ПолноеИмяТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЕстьУслуги И Не Выборка.ЕстьТовары;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет существование объекта метаданных по его полному имени.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - полное имя объекта метаданных.
// 
// Возвращаемое значение:
//  Булево - Истина, если объект с заданным именем существует.
//
// Пример:
//   ЕстьКорректировкиРТУ	 = СуществуетОбъектМетаданных("Документ.КорректировкаРеализации");
//   ЕстьГрузооотправитель	 = СуществуетОбъектМетаданных("Документ.РеализацияТоваровУслуг.Реквизит.Грузоотправитель");
//   ЕстьРеквизитКодТНВЭД	 = СуществуетОбъектМетаданных("Документ.РасходнаяНакладная.ТабличнаяЧасть.Запасы.Реквизит.КодТНВЭД");
//
Функция СуществуетОбъектМетаданных(ПолноеИмяОбъекта)
	
	Возврат МетодСервера(, "СуществуетОбъектМетаданных", ПолноеИмяОбъекта);
	
КонецФункции

Функция ЭтоСчетФактура(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.СчетФактура") Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТабличнуюЧастьПоДаннымДокументовОснований(Шапка, ТабличнаяЧасть)
	
	Результат = Ложь;
	
	СсылкаНаОбъект = Шапка.ОписаниеДокумента.Ссылка;
	
	// В старых версиях конфигурации товарная часть СФ хранилась в самом СФ.
	// Это также может быть справедливо и для документов, сформированных до
	// обновления конфигурации до версии 1.6.14+
	Если Не ЗначениеЗаполнено(ТабличнаяЧасть) 
		И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактура")
		И (Шапка.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Продажа Или Шапка.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка)
		Тогда // Пробуем достать товарную часть из документов-оснований
		
		Основания		 = ОснованияСчетаФактуры(СсылкаНаОбъект);
		ТабличнаяЧасть	 = ДанныеТабличныхЧастейМассиваДокументов(Основания); // Заполним товарную часть по данным всех документов-оснований
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуммыДокументаРегл(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СуммыДокументовРегл.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	СуммыДокументовРегл.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	СуммыДокументовРегл.Всего КАК Всего,
	|	СуммыДокументовРегл.НДС КАК НДС
	|ИЗ
	|	РегистрСведений.СуммыДокументовРегламентированныйУчет КАК СуммыДокументовРегл
	|ГДЕ
	|	СуммыДокументовРегл.Регистратор = &СсылкаНаОбъект
	|	И СуммыДокументовРегл.Активность";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("ТабличнаяЧастьДокумента, НомерСтрокиДокумента");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторТабличнойЧасти(ИмяТабличнойЧасти)
	
	Результат = Перечисления.ТабличныеЧастиДокументов[ИмяТабличнойЧасти];
	
	Возврат Результат;
	
КонецФункции

Процедура ПересчитатьСуммыВВалютуРегл(Шапка, ТабличнаяЧасть)
	
	СсылкаНаОбъект = Шапка.ОписаниеДокумента.Ссылка;
	ВладелецТЧ = СсылкаНаОбъект;
	
	Если ЭтоСчетФактура(СсылкаНаОбъект) Тогда
		ВладелецТЧ = ПервыйДокументОснование(СсылкаНаОбъект);
	КонецЕсли;
	
	ПересчитатьПоКурсу = Ложь;
	СуммыРегл = СуммыДокументаРегл(ВладелецТЧ);
	
	Если Не ЗначениеЗаполнено(СуммыРегл) Тогда
		ПересчитатьПоКурсу = Истина;
		КоэффициентПересчета = Шапка.КурсДокумента / Шапка.КратностьДокумента;
	КонецЕсли;
	
	ТочностьЦены = ПараметрыКлиентСервер.ТочностьЦены;
	
	ЭтоКорректировка = Шапка.ОписаниеДокумента.ЭтоКорректировка;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если ПересчитатьПоКурсу Тогда
			
			ВсегоРегл = Окр(СтрокаТЧ.СуммаСНДС * КоэффициентПересчета, ТочностьЦены);
			НДСРегл = Окр(СтрокаТЧ.СуммаНДС * КоэффициентПересчета, ТочностьЦены);
			
			Если ЭтоКорректировка Тогда
				
				ВсегоДоИзмененияРегл = Окр(СтрокаТЧ.СуммаСНДСДоИзменения * КоэффициентПересчета, ТочностьЦены);
				НДСДоИзмененияРегл = Окр(СтрокаТЧ.СуммаНДСДоИзменения * КоэффициентПересчета, ТочностьЦены);
				
			КонецЕсли;
			
		Иначе
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ТабличнаяЧастьДокумента", ИдентификаторТабличнойЧасти(СтрокаТЧ.ИмяТабличнойЧасти));
			ПараметрыОтбора.Вставить("НомерСтрокиДокумента", СтрокаТЧ.НомерСтроки);
			
			НайденныеСтроки = СуммыРегл.НайтиСтроки(ПараметрыОтбора);
			
			Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
				Продолжить;
			КонецЕсли;
			
			ВсегоРегл = НайденныеСтроки[0].Всего;
			НДСРегл = НайденныеСтроки[0].НДС;
			
		КонецЕсли;
		
		СтрокаТЧ.СуммаСНДС = ВсегоРегл;
		СтрокаТЧ.СуммаНДС = НДСРегл;
		СтрокаТЧ.Сумма = ВсегоРегл - НДСРегл;
				
		Если ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
			СтрокаТЧ.Цена = Окр(СтрокаТЧ.Сумма / СтрокаТЧ.Количество, ТочностьЦены);
		КонецЕсли;
		
		Если ЭтоКорректировка Тогда
			
			СтрокаТЧ.СуммаСНДСДоИзменения 	= ВсегоДоИзмененияРегл;
			СтрокаТЧ.СуммаНДСДоИзменения 	= НДСДоИзмененияРегл;
			СтрокаТЧ.СуммаДоИзменения		= ВсегоДоИзмененияРегл - НДСДоИзмененияРегл;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.КоличествоДоИзменения) Тогда
				СтрокаТЧ.ЦенаДоИзменения = Окр(СтрокаТЧ.СуммаДоИзменения / СтрокаТЧ.КоличествоДоИзменения, ТочностьЦены);
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНеизмененныеСтрокиКорректировочногоДокумента(Шапка, ТабличнаяЧасть)
	
	Если Шапка.ВидОперации <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение 
		И Шапка.ВидОперации <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда 
		Возврат;
	КонецЕсли;
	
	КорректируемыеПоля = Новый Структура;
	КорректируемыеПоля.Вставить("Количество", "КоличествоДоИзменения");
	КорректируемыеПоля.Вставить("Цена"		, "ЦенаДоИзменения");
	КорректируемыеПоля.Вставить("Сумма"		, "СуммаДоИзменения");
	КорректируемыеПоля.Вставить("СуммаНДС"	, "СуммаНДСДоИзменения");
	КорректируемыеПоля.Вставить("СуммаСНДС"	, "СуммаСНДСДоИзменения");
	
	Индекс = 0;
	Пока Индекс < ТабличнаяЧасть.Количество() Цикл 
		
		Стр = ТабличнаяЧасть[Индекс];
		
		ЕстьИзменения = Ложь;
		Для Каждого ИменаПолей Из КорректируемыеПоля Цикл 
			
			ЗначениеТекущее		 = Стр[ИменаПолей.Ключ];
			ЗначениеДоИзменения	 = Стр[ИменаПолей.Значение];
			
			Если ЗначениеТекущее <> ЗначениеДоИзменения Тогда 
				ЕстьИзменения = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьИзменения Тогда 
			ТабличнаяЧасть.Удалить(Индекс);
		Иначе 
			Индекс = Индекс + 1; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьОтмененныеСтрокиИсправительногоДокумента(Шапка, ТабличнаяЧасть)
	
	Если Шапка.ВидОперации <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда 
		Возврат;
	КонецЕсли;
	
	Индекс = 0;
	Пока Индекс < ТабличнаяЧасть.Количество() Цикл 
		
		Стр = ТабличнаяЧасть[Индекс];
		
		Если Стр.СуммаСНДС = 0 И Стр.СуммаСНДСДоИзменения = 0 Тогда 
			ТабличнаяЧасть.Удалить(Индекс);
		Иначе 
			Индекс = Индекс + 1; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтрокиОтчетКомиссионераОтДругихСчетФактур(Шапка, ТабличнаяЧасть)
	
	Если НЕ ЭтоСчетФактура(Шапка.ОписаниеДокумента.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетКомиссионераПокупатели.КлючСвязи КАК КлючСвязи,
		|	ОтчетКомиссионераПокупатели.СчетФактура КАК СчетФактура
		|ИЗ
		|	Документ.СчетФактура КАК ДокументСчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
		|		ПО ДокументСчетФактура.Ссылка = ОтчетКомиссионераПокупатели.СчетФактура
		|ГДЕ
		|	ДокументСчетФактура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Шапка.ОписаниеДокумента.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ТаблицаСФ = РезультатЗапроса.Выгрузить();
		ТаблицаСФ.Свернуть("КлючСвязи");
		СписокРазрешенныхКлючей = ТаблицаСФ.ВыгрузитьКолонку("КлючСвязи");
		
		Индекс = 0;
		Пока Индекс < ТабличнаяЧасть.Количество() Цикл 
			
			Стр = ТабличнаяЧасть[Индекс];
			
			Если СписокРазрешенныхКлючей.Найти(Стр.КлючСвязи) = Неопределено Тогда 
				ТабличнаяЧасть.Удалить(Индекс);
			Иначе 
				Индекс = Индекс + 1; 
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Функция РеквизитыКорректировкиРеализации(СсылкаНаОбъект, ЭтоИсправление)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Номер");
	Реквизиты.Вставить("Дата");
	Реквизиты.Вставить("НомерИсходногоДокумента");
	Реквизиты.Вставить("ДатаИсходногоДокумента");
	Реквизиты.Вставить("НомерИсправленияИсходногоДокумента");
	Реквизиты.Вставить("ДатаИсправленияИсходногоДокумента");
	
	Если ЭтоИсправление Тогда
		
		// Переопределим номер документа
		Реквизиты.Номер	 = "НомерИсправляемогоКорректировочногоДокумента";
		Реквизиты.Дата	 = "ДатаИсправляемогоКорректировочногоДокумента";
		
		// И добавим получение номера и даты исправления
		Реквизиты.Вставить("НомерИсправления");
		Реквизиты.Вставить("ДатаИсправления", "Дата");
		
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыКорректировочногоСчетаФактуры(СсылкаНаОбъект, ЭтоИсправление)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ПолеНомерДокумента КАК Номер,
	|	&ПолеДатаДокумента КАК Дата,
	|	&ПолеНомерИсправления КАК НомерИсправления,
	|	&ПолеДатаИсправления КАК ДатаИсправления,
	|	&ПолеНомерНаПечать КАК НомерНаПечать,
	|	&ПолеОтредактированНомерСчетаФактуры КАК ОтредактированНомерСчетаФактуры,
	|	Таблица.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
	|	Таблица.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	Таблица.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	Таблица.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
	|	Таблица.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
	|	Таблица.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ПолеНомерДокумента = "Таблица.Ссылка.Номер";
	ПолеДатаДокумента = "Таблица.Ссылка.Дата";
	ПолеНомерИсправления = "НЕОПРЕДЕЛЕНО";
	ПолеДатаИсправления	 = "НЕОПРЕДЕЛЕНО";
	ПолеНомерНаПечать = "НЕОПРЕДЕЛЕНО";
	ПолеОтредактированНомерСчетаФактуры	 = "ЛОЖЬ";
	
	Если ЭтоИсправление Тогда
		
		ПолеНомерДокумента	 = "Таблица.Ссылка.НомерИсправляемогоКорректировочногоДокумента";
		ПолеДатаДокумента	 = "Таблица.Ссылка.ДатаИсправляемогоКорректировочногоДокумента";
		ПолеНомерИсправления = "Таблица.Ссылка.НомерИсправления";
		ПолеДатаИсправления	 = "Таблица.Ссылка.Дата";
		
	КонецЕсли;
	
	Если ИспользуетсяНомерНаПечатьСчетаФактуры() Тогда
		ПолеНомерНаПечать = "Таблица.Ссылка.НомерНаПечать";
		ПолеОтредактированНомерСчетаФактуры	 = "Таблица.Ссылка.ОтредактированНомерСчетаФактуры";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерДокумента"	, ПолеНомерДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДатаДокумента" 	, ПолеДатаДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерИсправления", ПолеНомерИсправления);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДатаИсправления"	, ПолеДатаИсправления);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерНаПечать"	, ПолеНомерНаПечать);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеОтредактированНомерСчетаФактуры"	, ПолеОтредактированНомерСчетаФактуры);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает шаблон текста для объединения запросов.
//
// Параметры:
//  ТолькоНовые - Булево - Истина, если из результата присоединяемого запроса нужно получить
//                         только те строки, которых еще нет в общем результате.
// 
// Возвращаемое значение:
//   Строка
//
Функция РазделительОбъединенияЗапросов(ТолькоНовые = Ложь)
	
	Если ТолькоНовые Тогда
		
		Результат = "
		|
		|ОБЪЕДИНИТЬ
		|
		|";
		
	Иначе
		
		Результат = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазделительПакетаЗапросов()
	
	Возврат
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

// Добавляет в ТабличнаяЧасть строку с услугой доставки,
// информация о которой хранится в реквизитах документа информационной базы
//
// Параметры:
//  Шапка			 - Структура		 - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей.
//
Процедура ДополнитьДаннымиПоДоставке(ТабличнаяЧасть, Шапка)
	
	СсылкаНаДокумент = Шапка.ОписаниеДокумента.Ссылка;
	
	Если Не ЕстьРеквизитыДоставки(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДоставки = ВыбратьДанныеДоставкиИзШапкиДокумента(Шапка.ОписаниеДокумента);
	
	Если ДанныеДоставки.ЕстьДоставка Тогда
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДоставки);
		
		НоваяСтрока.ЭтоУслуга					= Истина;
		НоваяСтрока.ПризнакТоварРаботаУслуга 	= "Service";
		НоваяСтрока.НомерСтроки 				= ТабличнаяЧасть.Количество();
		НоваяСтрока.ИмяТабличнойЧасти			= ИмяТабличнойЧастиДоставка();
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет наличие у документа реквизитов доставки
//
// Параметры:
//  СсылкаНаДокумент - Ссылка - ссылка на проверяемый документ
// 
// Возвращаемое значение:
//  Булево 
//
Функция ЕстьРеквизитыДоставки(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	МетаданныеДокумента = СсылкаНаДокумент.Метаданные();
	
	Если ЕстьРеквизитМетаданных(МетаданныеДокумента, "НоменклатураДоставки") Тогда 
		
		Результат = Истина;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Проверяет наличие у документа реквизитов способа доставки
//
// Параметры:
//  СсылкаНаДокумент - Ссылка - ссылка на проверяемый документ
// 
// Возвращаемое значение:
//  Булево 
//
Функция ЕстьРеквизитыСпособаДоставки(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	МетаданныеДокумента = СсылкаНаДокумент.Метаданные();
	
	Если ЕстьРеквизитМетаданных(МетаданныеДокумента, "СпособДоставки") Тогда 
		
		Результат = Истина;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Возвращает данные по услуге доставки, указанной в реквизитах (шапке) документа.
//
// Параметры:
//  ОписаниеДокумента		 - Структура 	- см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента
//  МаксНомерСтрокиТаблицы	 - Число 		- количество строк в табличной части, в которую добавляется услуга доставки
// 
// Возвращаемое значение:
//  Структура - содержит значения реквизитов доставки документа.
//				Имена ключей приведены к именам колонок табличной части (см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей)
//				Также добавлено поле "ЕстьДоставка": Истина, если есть данные о доставке, Ложь - нет.
//
Функция ВыбратьДанныеДоставкиИзШапкиДокумента(ОписаниеДокумента)
	
	СсылкаНаДокумент = ОписаниеДокумента.Ссылка;
	
	МетаданныеДокумента 	= СсылкаНаДокумент.Метаданные();
	ИмяДокумента 			= МетаданныеДокумента.Имя; 
	
	ЭтоКорректировка 	= ОписаниеДокумента.ЭтоКорректировка;
	ЭтоИсправление 		= ОписаниеДокумента.ЭтоИсправление;
	ЕстьСпособДостаки	= ЕстьРеквизитыСпособаДоставки(СсылкаНаДокумент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ДанныеПоДоставке(ИмяДокумента, ЭтоКорректировка, ЭтоИсправление, ЕстьСпособДостаки);
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Результат = НовоеОписаниеПолейЗапросаДанныхПоДоставке();
	Результат.ЕстьДоставка = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Возвращает текст запроса выборки данных о доставке из реквизитов документа
//
// Параметры:
//  ИмяДокумента	 - Строка	- имя документа как оно задано в конфигураторе.
//  ЭтоКорректировка - Булево	- Истина, если документ "Корректировка реализации", в противном случае - Ложь.
//  ЭтоИсправление	 - Булево	- Истина, если вид 
// 
// Возвращаемое значение:
//  Строка - строка текста запроса по реквизитам документов 
//
Функция ТекстЗапроса_ДанныеПоДоставке(ИмяДокумента, ЭтоКорректировка = Ложь, ЭтоИсправление = Ложь, ЕстьСпособДостаки = Ложь)
	
	ОписаниеПолей = НовоеОписаниеПолейЗапросаДанныхПоДоставке();
	
	ОписаниеПолей.Номенклатура 				= "НоменклатураДоставки";
	ОписаниеПолей.НоменклатураКод 			= "НоменклатураДоставки.Код";
	ОписаниеПолей.НоменклатураПредставление = "НоменклатураДоставки.НаименованиеПолное";
	
	ОписаниеПолей.ЕдиницаИзмерения 			= "НоменклатураДоставки.ЕдиницаИзмерения";
	ОписаниеПолей.ЕдиницаИзмеренияКод 		= "НоменклатураДоставки.ЕдиницаИзмерения.Код";

	ОписаниеПолей.СтавкаНДС					= "СтавкаНДСДоставки";
	
	Если ЭтоКорректировка Тогда
		
		ПолеОтменаДоставки = "ОтменаДоставки";
		
		Если Не ЕстьФункцияОтменыДоставки() Тогда
			ПолеОтменаДоставки = "СтоимостьДоставки = 0";
		КонецЕсли;
		
		ШаблонПоляНовыеЗначения = 
		"ВЫБОР
		|	КОГДА " + ПолеОтменаДоставки + "
		|		ТОГДА 0
		|	ИНАЧЕ %1
		|КОНЕЦ";
		
		ОписаниеПолей.Количество 	= СтрШаблон(ШаблонПоляНовыеЗначения, "1");
		ОписаниеПолей.Цена 			= СтрШаблон(ШаблонПоляНовыеЗначения, "СтоимостьДоставки");
		ОписаниеПолей.Сумма 		= СтрШаблон(ШаблонПоляНовыеЗначения, "СтоимостьДоставки");
		ОписаниеПолей.СуммаНДС 		= СтрШаблон(ШаблонПоляНовыеЗначения, "СуммаНДСДоставки");
		ОписаниеПолей.СуммаСНДС 	= СтрШаблон(ШаблонПоляНовыеЗначения, "СтоимостьДоставки");

		ШаблонПоляЕдиницаИзмеренияДоИзменения =
		"ВЫБОР
		|	КОГДА ИсправляемыйДокументРеализации ССЫЛКА Документ.РасходнаяНакладная
		|			ИЛИ ИсправляемыйДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
		|		ТОГДА ИсправляемыйДокументРеализации.НоменклатураДоставки.%1
		|	ИНАЧЕ НЕОПРЕДЕЛЕНО
		|КОНЕЦ";
		
		ОписаниеПолей.ЕдиницаИзмеренияДоИзменения 		= СтрШаблон(ШаблонПоляЕдиницаИзмеренияДоИзменения, "ЕдиницаИзмерения");
		ОписаниеПолей.ЕдиницаИзмеренияДоИзмененияКод 	= СтрШаблон(ШаблонПоляЕдиницаИзмеренияДоИзменения, "ЕдиницаИзмерения.Код");

		ОписаниеПолей.КоличествоДоИзменения = 
		"ВЫБОР
		|	КОГДА ИсправляемыйДокументРеализации.НоменклатураДоставки = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА 0
		|	ИНАЧЕ 1
		|КОНЕЦ";

		Если ЭтоИсправление Тогда
			ПостфиксИмениПоля = "ДоКорректировки";
		Иначе
			ПостфиксИмениПоля = "ДоИзменения";
		КонецЕсли;
		
		ОписаниеПолей.ЦенаДоИзменения 		= СтрШаблон("СтоимостьДоставки%1", ПостфиксИмениПоля);
		ОписаниеПолей.СуммаДоИзменения 		= СтрШаблон("СтоимостьДоставки%1", ПостфиксИмениПоля);
		ОписаниеПолей.СтавкаНДСДоИзменения 	= СтрШаблон("СтавкаНДСДоставки%1", ПостфиксИмениПоля);
		ОписаниеПолей.СуммаНДСДоИзменения 	= СтрШаблон("СуммаНДСДоставки%1", ПостфиксИмениПоля);
		ОписаниеПолей.СуммаСНДСДоИзменения 	= СтрШаблон("СтоимостьДоставки%1", ПостфиксИмениПоля);
		
		ОписаниеПолей.ЕстьДоставка =
		"ВЫБОР
		|	КОГДА СтоимостьДоставки = 0
		|		И СтоимостьДоставкиДоИзменения = 0
		|		И СтоимостьДоставкиДоКорректировки = 0
		|		И НоменклатураДоставки = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		И ЕСТЬNULL(ИсправляемыйДокументРеализации.НоменклатураДоставки, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА ЛОЖЬ
		|	ИНАЧЕ ИСТИНА
		|КОНЕЦ";
		
	Иначе
		
		ОписаниеПолей.ЕдиницаИзмеренияДоИзменения 		= "НоменклатураДоставки.ЕдиницаИзмерения";
		ОписаниеПолей.ЕдиницаИзмеренияДоИзмененияКод 	= "НоменклатураДоставки.ЕдиницаИзмерения.Код";
		
		ОписаниеПолей.Количество 	= "1";
		ОписаниеПолей.СуммаНДС 		= "СуммаНДСДоставки";
		ОписаниеПолей.СуммаСНДС 	= "СтоимостьДоставки";
		ОписаниеПолей.Цена 			= "СтоимостьДоставки";
		ОписаниеПолей.Сумма 		= "СтоимостьДоставки";
		
		ЗначениеОтсутствующихПолей = "НЕОПРЕДЕЛЕНО";
		
		ОписаниеПолей.КоличествоДоИзменения = ЗначениеОтсутствующихПолей;
		ОписаниеПолей.ЦенаДоИзменения 		= ЗначениеОтсутствующихПолей;
		ОписаниеПолей.СуммаДоИзменения 		= ЗначениеОтсутствующихПолей;
		ОписаниеПолей.СтавкаНДСДоИзменения 	= ЗначениеОтсутствующихПолей;
		ОписаниеПолей.СуммаНДСДоИзменения 	= ЗначениеОтсутствующихПолей;
		ОписаниеПолей.СуммаСНДСДоИзменения 	= ЗначениеОтсутствующихПолей;
		
		ОписаниеПолей.ЕстьДоставка =
		"ВЫБОР
		|	КОГДА НоменклатураДоставки = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА ЛОЖЬ
		|	ИНАЧЕ ИСТИНА
		|КОНЕЦ";
		
	КонецЕсли;
	
	Если ЕстьСпособДостаки Тогда
		
		ОписаниеПолей.ЕстьДоставка = ОписаниеПолей.ЕстьДоставка + 
		"	И (СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка))
		|	И (СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз))";
		
	КонецЕсли; 
	
	ТекстЗапроса = "";
	
	Для Каждого ЭлементОписания Из ОписаниеПолей Цикл
		
		ВыражениеПоляЗапроса = ЭлементОписания.Значение;
		ПсевдонимПоляЗапроса = ЭлементОписания.Ключ;
		
		ВыражениеЗапроса = ВыражениеПоляЗапроса + " КАК " + ПсевдонимПоляЗапроса;
		
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = "ВЫБРАТЬ " + ВыражениеЗапроса;
		Иначе
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "," + ВыражениеЗапроса;	
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	Документ." + ИмяДокумента + "
	|ГДЕ
	|	Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает описание полей запроса данных по доставке
//
// Возвращаемое значение:
//  Структура - содержит описание полей для формирования текста запросаэ
//			  - в качестве ключа передается псевдоним поля запроса, а в качестве
//              значения (опционально) фактическое имя поля в таблице или выражение на языке запроса. 
//
Функция НовоеОписаниеПолейЗапросаДанныхПоДоставке()
	
	ОписаниеПолей = Новый Структура;

	ОписаниеПолей.Вставить("Номенклатура");
	ОписаниеПолей.Вставить("НоменклатураКод");
	ОписаниеПолей.Вставить("НоменклатураПредставление");
	
	ОписаниеПолей.Вставить("ЕдиницаИзмерения");
	ОписаниеПолей.Вставить("ЕдиницаИзмеренияКод");
	
	ОписаниеПолей.Вставить("ЕдиницаИзмеренияДоИзменения");
	ОписаниеПолей.Вставить("ЕдиницаИзмеренияДоИзмененияКод");

	ОписаниеПолей.Вставить("Количество");
	ОписаниеПолей.Вставить("Цена");
	ОписаниеПолей.Вставить("Сумма");
	ОписаниеПолей.Вставить("СтавкаНДС");
	ОписаниеПолей.Вставить("СуммаНДС");
	ОписаниеПолей.Вставить("СуммаСНДС");
	
	ОписаниеПолей.Вставить("КоличествоДоИзменения");
	ОписаниеПолей.Вставить("ЦенаДоИзменения");
	ОписаниеПолей.Вставить("СуммаДоИзменения");
	ОписаниеПолей.Вставить("СтавкаНДСДоИзменения");
	ОписаниеПолей.Вставить("СуммаНДСДоИзменения");
	ОписаниеПолей.Вставить("СуммаСНДСДоИзменения");

	ОписаниеПолей.Вставить("ЕстьДоставка");
	
	Возврат ОписаниеПолей;
	
КонецФункции

// Возвращает имя табличной части документа для услуги по доставке.
// Имя табличной части используется при записи сумм в РС "СуммыДокументовРегламентированныйУчет",
// в пересчете по курсу национальной валюты.
//
// Возвращаемое значение:
//  Строка - содержит имя табличной части с услугами.
//
Функция ИмяТабличнойЧастиДоставка()
	
	Возврат "Запасы";
	
КонецФункции

// Проверяет наличие реквизита ОтменаДоставки у документа Корректировка реализации.
// Данный реквизит был добавлен в 1.6.24.
// 
// Возвращаемое значение:
//  Булево - Истина, если есть реквизит, Ложь - нет реквизита. 
//
Функция ЕстьФункцияОтменыДоставки()
	
	МинимальнаяВерсия 	= "1.6.24";
	ТекущаяВерсия 		= ВерсияПодсистемыУНФ();
	
	Результат = (СравнитьВерсии(ТекущаяВерсия, МинимальнаяВерсия) >= 0); 
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяУчетПрослеживаемыхТоваров()
	
	Результат = Ложь;
	
	ЕстьПрослеживаемостьВКонфигурации = МетодСервера(, "СуществуетОбъектМетаданных", "ФункциональнаяОпция.ВестиУчетПрослеживаемыхТоваров");
	Если ЕстьПрослеживаемостьВКонфигурации Тогда
		
		Результат = ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяНомерНаПечатьСчетаФактуры()
	
	Результат = Ложь;
	
	ВерсияПодсистемыУНФ = ВерсияПодсистемыУНФ();
	
	Если СравнитьВерсии(ВерсияПодсистемыУНФ, "3.0.9") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ЗагрузкаДанных

// Список возможных идентификаторов способов обработки входящих документов.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ИдентификаторыПравилОбработкиДокументов()
	
	ЗначенияПеречисления = Новый Массив;
	ЗначенияПеречисления.Добавить("ПриходнаяНакладная");
	ЗначенияПеречисления.Добавить("ПриходнаяНакладная_ВозвратОтПокупателя");
	ЗначенияПеречисления.Добавить("ДополнительныеРасходы");
	ЗначенияПеречисления.Добавить("КорректировкаПоступления");
	ЗначенияПеречисления.Добавить("СчетФактураПолученный");
	ЗначенияПеречисления.Добавить("АктОРасхожденияхПолученный");
	ЗначенияПеречисления.Добавить("СверкаВзаиморасчетов");
	
	Результат = Новый Структура;
	Для Каждого Элемент Из ЗначенияПеречисления Цикл
		Результат.Вставить(Элемент, Элемент);
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Дополняет таблицу правил обработки товарных накладных.
//
Процедура ЗаполнитьПравилаОбработкиПервичныхДокументов(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхДокументов = Ложь;
	ДляИсправительныхДокументов = Истина;
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Приходная накладная (поступление от поставщика)
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПриходнаяНакладная
		, ВидыЭД.ТоварнаяНакладная
		, ДляПервичныхДокументов);
	
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПриходнаяНакладная
		, ВидыЭД.АктОбОказанииУслуг
		, ДляПервичныхИИсправительныхДокументов);
	
	// Приходная накладная (возврат от покупателя)
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПриходнаяНакладная_ВозвратОтПокупателя
		, ВидыЭД.ТоварнаяНакладная
		, ДляПервичныхИИсправительныхДокументов);
	
	// Дополнительные расходы
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ДополнительныеРасходы
		, ВидыЭД.АктОбОказанииУслуг
		, ДляПервичныхИИсправительныхДокументов);
	
	// Исправление накладных, актов
	Если ИспользоватьКорректировкиПоступлений() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.КорректировкаПоступления
			, ВидыЭД.ТоварнаяНакладная
			, ДляИсправительныхДокументов);
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.КорректировкаПоступления
			, ВидыЭД.АктОбОказанииУслуг
			, ДляИсправительныхДокументов);
	
		// Корректировка поступления
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.КорректировкаПоступления
			, ВидыЭД.СоглашениеОбИзмененииСтоимости
			, ДляПервичныхИИсправительныхДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

// Дополняет таблицу правил обработки счетов-фактур и корректировочных счетов-фактур.
//
Процедура ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, ДляПервичныхИИсправительныхДокументов);
	
	// Корректировочный счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.КорректировочныйСчетФактура
		, ДляПервичныхИИсправительныхДокументов);
	
КонецПроцедуры

// Дополняет таблицу правил обработки Актов о расхождениях (полученных).
//
Процедура ЗаполнитьПравилаОбработкиДокументовОРасхождении(ПравилаОбработки)

	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Акт о расхождениях
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.АктОРасхожденияхПолученный
		, ВидыЭД.ДокументОРасхождениях
		, ДляПервичныхИИсправительныхДокументов);

КонецПроцедуры

Процедура ЗаполнитьПравилаОбработкиАктовСверки(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Акт сверки
	ДобавитьПравилоОбработкиДокументов(
		ПравилаОбработки,
		ИдентификаторыПравил.СверкаВзаиморасчетов,
		ВидыЭД.АктСверки,
		ДляПервичныхИИсправительныхДокументов
	);

КонецПроцедуры

Функция ВидОперацииПриходнойНакладнойПоУмолчанию()
	
	МетаданныеРеквизита = Метаданные.Документы.ПриходнаяНакладная.Реквизиты.ВидОперации;
	
	Результат = МетаданныеРеквизита.ЗначениеЗаполнения;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаполненияУчетногоДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("ВидОперации", ВидОперацииПриходнойНакладнойПоУмолчанию());
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ДокументОснование", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаполненияАктаОРасхожденияхПолученного()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияДляУПД(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияУчетногоДокумента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	ШапкаЭД	 = ДанныеЭД.Шапка;
	ИтогиТЧ	 = ДанныеЭД.Итоги;
	
	Запасы	= Документы.ПриходнаяНакладная.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	Расходы = Документы.ПриходнаяНакладная.ПустаяСсылка().Расходы.ВыгрузитьКолонки();
	Расходы.Колонки.Добавить("Характеристика");
	
	СведенияПрослеживаемости = НоваяТаблицаСведенияПрослеживаемостиДокументаИБ(Документы.ПриходнаяНакладная.ПустаяСсылка());
	
	ШтрихкодыУпаковок = НоваяТаблицаШтрихкодыУпаковок();
	
	Шапка = Новый Структура;
	Шапка.Вставить("Дата"		, ТекущаяДата());
	Шапка.Вставить("Организация", ШапкаЭД.Покупатель.Ссылка);
	Шапка.Вставить("Контрагент"	, ШапкаЭД.Продавец.Ссылка);
	Шапка.Вставить("Валюта"		, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("Курс"		, ШапкаЭД.Курс);
	Шапка.Вставить("Кратность"	, ШапкаЭД.Кратность);
	
	Шапка.Вставить("ВидОперации"		, ПараметрыЗаполнения.ВидОперации);
	Шапка.Вставить("СуммаВключаетНДС"	, ПараметрыЗаполнения.ЦенаВключаетНДС);
	Шапка.Вставить("Корректировка"		, Ложь);
	
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	Шапка.Вставить("НомерИсходногоДокумента", СвойствоСтруктуры(ШапкаЭД, "НомерИсходногоДокумента"));
	Шапка.Вставить("ДатаИсходногоДокумента"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсходногоДокумента"));
	
	Шапка.Вставить("Исправление", ФорматЭД.ЭтоИсправление);
	Если ФорматЭД.ЭтоИсправление Тогда 
		Шапка.Вставить("НомерИсправления"	, ШапкаЭД.НомерИсправления);
		Шапка.Вставить("ДатаИсправления"	, ШапкаЭД.ДатаИсправления);
	КонецЕсли;
	
	Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	Шапка.Вставить("ПередачаТовараКомитентом", Ложь);
	
	ЭтоАванс = ДанныеЭД.ЭтоАванс;
	
	Если ЭтоАванс Тогда
		Шапка.Вставить("ВидСчетаФактуры", Перечисления.ВидыОперацийСчетФактураПолученный.Аванс);
	Иначе
		Шапка.Вставить("ВидСчетаФактуры", Перечисления.ВидыОперацийСчетФактураПолученный.Поступление);
	КонецЕсли;
	
	Шапка.Вставить("КодСпособаВыставления", 2); // 1 - на бумаге, 2 - в электронном виде
	Шапка.Вставить("ВыставленСтатус", 2); // 1 - не выставляется, 2 - выставлен
	
	//Заполняем документы-основания
	ДокументыОснования = ПараметрыЗаполнения.ДокументОснование;
	Если Не ЗначениеЗаполнено(ДокументыОснования) Тогда
		ИдентификаторЭД = ДанныеЭД.ЭлектронныйДокумент.Идентификатор;
		ДокументыОснования = СопоставленныеУчетныеДокументы(ИдентификаторЭД);
	КонецЕсли;
	Шапка.Вставить("ДокументОснование", ДокументыОснования);
	
	Шапка.Вставить("ПоложениеЗаказаПоставщику", Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти);
	
	Если Не ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		Шапка.Вставить("СтруктурнаяЕдиница", Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	КонецЕсли;
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	Подразделение = ПодразделениеПользователя(Пользователь);
	
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл
		
		НоменклатураИБ = Стр.Номенклатура;
		НоменклатураКонтрагента = Стр.НоменклатураКонтрагента;
						
		Если ЭтоНоменклатураЗапас(НоменклатураИБ.Номенклатура)
			Или ЗначениеЗаполнено(Стр.ДанныеГТД) Тогда
			
			НоваяСтрока = Запасы.Добавить();
						
		Иначе
			
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.Содержание			= НоменклатураКонтрагента.Наименование;
			НоваяСтрока.СтруктурнаяЕдиница	= Подразделение;
			
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = НоменклатураИБ.Номенклатура;
		НоваяСтрока.Характеристика = НоменклатураИБ.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = НоменклатураИБ.Упаковка;
		
		ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
		НоваяСтрока.Количество	 = Стр.Количество;
		НоваяСтрока.Цена		 = Стр.Цена;
		НоваяСтрока.Сумма		 = Стр.СуммаБезНДС;
		НоваяСтрока.СуммаНДС	 = Стр.СуммаНДС;
		НоваяСтрока.Всего		 = Стр.СуммаСНДС;
		
		ПроверитьЗаполнитьЦенуКоличество(НоваяСтрока);
		ПроверитьЗаполнитьЕдиницуИзмерения(НоваяСтрока);
		ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, Стр.СведенияОМаркировке, НоменклатураКонтрагента.GTIN);
		
		ЕстьСведенияПрослеживаемости = ВТабличнойЧастиЭДЕстьСведенияПрослеживаемости(Стр);
		
		Если ИспользуетсяУчетПрослеживаемыхТоваров И ЕстьСведенияПрослеживаемости Тогда
			
			ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УПД(СведенияПрослеживаемости, Стр.СведенияОПрослеживаемости, НоваяСтрока);
			
			ЗаполнятьСтрануПроисхождения = ЗначениеЗаполнено(Стр.ДанныеГТД)
											И Стр.ДанныеГТД.Количество() = 1
											И ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "СтранаПроисхождения");
			
			Если ЗаполнятьСтрануПроисхождения Тогда
				СведенияТД = Стр.ДанныеГТД[0];
		 		НоваяСтрока.СтранаПроисхождения = СведенияТД.СтранаПроисхождения.Ссылка;
		 	КонецЕсли;
																	
		ИначеЕсли ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "НомерГТД") Тогда
											
			ЗаполнитьСведенияТаможеннойДекларации(НоваяСтрока, Стр.ДанныеГТД);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	ДанныеОбъекта.Вставить("Запасы"	, Запасы);
	ДанныеОбъекта.Вставить("Расходы", Расходы);
	ДанныеОбъекта.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	ДанныеОбъекта.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция СтруктураЗаполненияКорректировкиПоступления(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияУчетногоДокумента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	ШапкаЭД	 = ДанныеЭД.Шапка;
	ИтогиТЧ	 = ДанныеЭД.Итоги;

	ПустаяСсылкаНаДокумент = Документы.КорректировкаПоступления.ПустаяСсылка();
	Запасы	= ПустаяСсылкаНаДокумент.Запасы.ВыгрузитьКолонки();
	Расходы = ПустаяСсылкаНаДокумент.Расходы.ВыгрузитьКолонки();
	Расходы.Колонки.Добавить("Характеристика");
	СведенияПрослеживаемости = НоваяТаблицаСведенияПрослеживаемостиДокументаИБ(ПустаяСсылкаНаДокумент, Истина);
	
	Шапка = Новый Структура;
	Шапка.Вставить("Дата"				, ТекущаяДата());
	Шапка.Вставить("Организация"		, ШапкаЭД.Покупатель.Ссылка);
	Шапка.Вставить("Контрагент"			, ШапкаЭД.Продавец.Ссылка);
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсДокумента"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьДокумента"	, ШапкаЭД.Кратность);
	Шапка.Вставить("СуммаВключаетНДС"	, ПараметрыЗаполнения.ЦенаВключаетНДС);
	
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	Шапка.Вставить("НомерИсходногоДокумента", СвойствоСтруктуры(ШапкаЭД, "НомерИсходногоДокумента"));
	Шапка.Вставить("ДатаИсходногоДокумента"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсходногоДокумента"));
	
	Если ФорматЭД.ЭтоИсправление Тогда 
		Шапка.Вставить("ВидОперацииЭД"		, Перечисления.ВидыОперацийЭД.Исправление);
		Шапка.Вставить("Исправление"		, Истина);
		Шапка.Вставить("НомерИсправления"	, ШапкаЭД.НомерИсправления);
		Шапка.Вставить("ДатаИсправления"	, ШапкаЭД.ДатаИсправления);
	Иначе 
		Шапка.Вставить("ВидОперацииЭД"	, Перечисления.ВидыОперацийЭД.Корректировка);
		Шапка.Вставить("Исправление"	, Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойствоСтруктуры(ШапкаЭД, "НомерИсправленияИсходногоДокумента")) Тогда
		Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента"	, Истина);
		Шапка.Вставить("НомерИсправленияИсходногоДокумента"		, СвойствоСтруктуры(ШапкаЭД, "НомерИсправленияИсходногоДокумента"));
		Шапка.Вставить("ДатаИсправленияИсходногоДокумента"		, СвойствоСтруктуры(ШапкаЭД, "ДатаИсправленияИсходногоДокумента"));
	Иначе
		Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента"	, Ложь);
	КонецЕсли;
	
	Шапка.Вставить("ОтражатьВУчете", Истина);
	
	// Основание корректировочного документа
	ДокументОснование = Неопределено;
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров();
	
	Если ФорматЭД.ЭтоКорректировка Тогда
		
		СвойстваОснования = ШапкаЭД.КорректируемыйДокумент;
		ДокументОснование = СвойствоСтруктуры(СвойстваОснования, "ПервичныйДокумент");
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ДокументОснование = ДокументОснование.ДокументОснование;
		КонецЕсли;
		
	КонецЕсли;
	
	Шапка.Вставить("Основание", ДокументОснование);
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоменклатураИБ = Стр.Номенклатура;
		
		ЭтоЗапас = ЭтоНоменклатураЗапас(НоменклатураИБ.Номенклатура);
		
		Если ЭтоЗапас Тогда 
			НоваяСтрока = Запасы.Добавить();
		Иначе
			НоваяСтрока = Расходы.Добавить();
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = НоменклатураИБ.Номенклатура;
		НоваяСтрока.Характеристика = НоменклатураИБ.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = НоменклатураИБ.Упаковка;
		
		ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
		НоваяСтрока.Количество	= Стр.Количество;
		НоваяСтрока.Цена		= Стр.Цена;
		НоваяСтрока.СуммаНДС 	= Стр.СуммаНДС;
		НоваяСтрока.Сумма 		= Стр.СуммаБезНДС;
		НоваяСтрока.Всего 		= Стр.СуммаСНДС;
		
		Если ФорматЭД.ЭтоКорректировка Тогда
			
			НоваяСтрока.КоличествоДоИзменения	= Стр.Количество_До;
			НоваяСтрока.ЦенаДоИзменения			= Стр.Цена_До;
			НоваяСтрока.СуммаНДСДоИзменения		= Стр.СуммаНДС_До;
			НоваяСтрока.СуммаДоИзменения		= Стр.СуммаБезНДС_До;
			НоваяСтрока.ВсегоДоИзменения		= Стр.СуммаСНДС_До;
			
		КонецЕсли;
		
		Если ИспользуетсяУчетПрослеживаемыхТоваров И ЭтоЗапас Тогда
			
			ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УКД(СведенияПрослеживаемости, Стр.СведенияОПрослеживаемости, НоваяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	ДанныеОбъекта.Вставить("Запасы"	, Запасы);
	ДанныеОбъекта.Вставить("Расходы", Расходы);
	ДанныеОбъекта.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция СтруктураЗаполненияКорректировочногоСчетаФактуры(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияУчетногоДокумента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	ШапкаЭД	 = ДанныеЭД.Шапка;
	ИтогиТЧ	 = ДанныеЭД.Итоги;
	
	ДанныеОбъекта = Новый Структура;
	
	Шапка = Новый Структура;
	
	Шапка.Вставить("Дата", ТекущаяДата());
	
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	Шапка.Вставить("НомерИсходногоДокумента", СвойствоСтруктуры(ШапкаЭД, "НомерИсходногоДокумента"));
	Шапка.Вставить("ДатаИсходногоДокумента"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсходногоДокумента"));
	
	Если ФорматЭД.ЭтоИсправление Тогда
		Шапка.Вставить("Исправление", Истина);
		Шапка.Вставить("НомерИсправления", ШапкаЭД.НомерИсправления);
		Шапка.Вставить("ДатаИсправления",  ШапкаЭД.ДатаИсправления);
	КонецЕсли;
	
	НомерИсправленияИсходногоДокумента = СвойствоСтруктуры(ШапкаЭД, "НомерИсправленияИсходногоДокумента");
	ДатаИсправленияИсходногоДокумента  = СвойствоСтруктуры(ШапкаЭД, "ДатаИсправленияИсходногоДокумента");
	
	Если ЗначениеЗаполнено(НомерИсправленияИсходногоДокумента) Тогда
		Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента", Истина);
		Шапка.Вставить("НомерИсправленияИсходногоДокумента", НомерИсправленияИсходногоДокумента);
		Шапка.Вставить("ДатаИсправленияИсходногоДокумента",  ДатаИсправленияИсходногоДокумента);
	Иначе
		Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	КонецЕсли;
	
	Шапка.Вставить("Организация", ШапкаЭД.Покупатель.Ссылка);
	Шапка.Вставить("Контрагент"	, ШапкаЭД.Продавец.Ссылка);
	
	Шапка.Вставить("ВидСчетаФактуры", Перечисления.ВидыОперацийСчетФактураПолученный.Корректировка);
	
	//Заполняем документы-основания
	ИдентификаторЭД = ДанныеЭД.ЭлектронныйДокумент.Идентификатор;
	МассивДокументовОснований = СопоставленныеУчетныеДокументы(ИдентификаторЭД);
	Шапка.Вставить("ДокументОснование", МассивДокументовОснований);
	
	Шапка.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("ИтогиТЧ", ИтогиТЧ);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция СтруктураЗаполненияАктаОРасхожденияхПолученного(ДанныеЭД, ДополнительныеПараметры)

	ПараметрыЗаполнения = ПараметрыЗаполненияАктаОРасхожденияхПолученного();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	
	Запасы = Документы.АктОРасхожденияхПолученный.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	
	// Маркировка
	ШтрихкодыУпаковок = НоваяТаблицаШтрихкодыУпаковок();
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ИтогиТЧ = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Участники сделки
	Шапка.Вставить("Организация"		, ШапкаЭД.Покупатель.Ссылка);
	Шапка.Вставить("Контрагент"			, ШапкаЭД.Продавец.Ссылка);
	Шапка.Вставить("Грузоотправитель"	, ШапкаЭД.Грузоотправитель.Ссылка);
	Шапка.Вставить("Грузополучатель"	, ШапкаЭД.Грузополучатель.Ссылка);
	
	// Валюта, суммы
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("СуммаВключаетНДС"	, ПараметрыЗаполнения.ЦенаВключаетНДС);
	
	// Даты, номера
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	Шапка.Вставить("НомерАкта"				, ПредставлениеНомера(ШапкаЭД.Номер));
	
	// Основание документа о расхождениях
	Организация		= Шапка.Организация;
	ДатаДокумента	= НачалоДня(ДанныеЭД.Шапка.Основание.Дата);
	НомерДокумента	= ДанныеЭД.Шапка.Основание.Номер;
	
	НомерДокументаБезПрефиксов = НомерДокументаБезПрефикса(НомерДокумента);
	НомерДокументаБезПрефиксов = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерДокументаБезПрефиксов, 6, "0");
	
	ДокументОснование = НайтиОснованиеДокументаОРасхождениях(Организация, ДатаДокумента, НомерДокументаБезПрефиксов);
		
	ДополнитьПараметрыЗаполненияАктаОРасхожденияхПоДокументуОснованию(ДокументОснование, Шапка);
	
	СуммаВключаетНДС = Шапка.СуммаВключаетНДС;
	
	// Табличная часть
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоменклатураИБ = Стр.Номенклатура;
		НоменклатураКонтрагента = Стр.НоменклатураКонтрагента;
		 
		НоваяСтрока = Запасы.Добавить();
		
		НоваяСтрока.Номенклатура = НоменклатураИБ.Номенклатура;
		НоваяСтрока.Характеристика = НоменклатураИБ.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = НоменклатураИБ.Упаковка;
		
		ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
		НоваяСтрока.Количество	= Стр.Количество;
		НоваяСтрока.Цена		= Стр.Цена;
		НоваяСтрока.СуммаНДС 	= Стр.СуммаНДС;
		НоваяСтрока.Сумма 		= ?(СуммаВключаетНДС, Стр.СуммаСНДС, Стр.СуммаСНДС - Стр.СуммаНДС);
		НоваяСтрока.Всего 		= Стр.СуммаСНДС;
		
		НоваяСтрока.КоличествоДоИзменения	= Стр.Количество_До;
		НоваяСтрока.ЦенаДоИзменения			= Стр.Цена_До;
		НоваяСтрока.СуммаНДСДоИзменения		= Стр.СуммаНДС_До;
		НоваяСтрока.СуммаДоИзменения		= ?(СуммаВключаетНДС, Стр.СуммаСНДС_До, Стр.СуммаСНДС_До - Стр.СуммаНДС_До);
		НоваяСтрока.ВсегоДоИзменения		= Стр.СуммаСНДС_До;
		
		ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, Стр.СведенияОМаркировке);
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	ДанныеОбъекта.Вставить("Запасы"	, Запасы);
	ДанныеОбъекта.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	Возврат ДанныеОбъекта;

КонецФункции

Функция СтруктураЗаполненияСверкиВзаиморасчетов3_0_2(ДанныеЭД, ДополнительныеПараметры)
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Даты, номера
	Шапка.Вставить("НачалоПериода", ШапкаЭД.ДатаНачала);
	Шапка.Вставить("КонецПериода", ШапкаЭД.ДатаОкончания);
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента", ШапкаЭД.Дата);
	
	// Участники сделки
	Шапка.Вставить("Организация", ШапкаЭД.Получатель.Ссылка);
	Шапка.Вставить("Контрагент", ШапкаЭД.Отправитель.Ссылка);
	
	// Валюта, суммы
	ОстатокНаНачалоПоДаннымКонтрагента = ИтогиЭД.СальдоНачДеб - ИтогиЭД.СальдоНачКр;
	
	Шапка.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("ОстатокНаНачалоПоДаннымКонтрагента", ОстатокНаНачалоПоДаннымКонтрагента);
	
	// Прочие реквизиты шапки
	Шапка.Вставить("ЭтоЭлектронныйДокумент", Истина);
	Шапка.Вставить("ЭтоДокументКонтрагента", Истина);
	Шапка.Вставить("РазбитьПоДоговорам", Истина);
	
	ТаблицаПоДаннымКонтрагента = Новый ТаблицаЗначений;
	Для Каждого Реквизит Из Метаданные.Документы.СверкаВзаиморасчетов.ТабличныеЧасти.ДанныеКонтрагента.Реквизиты Цикл
		ТаблицаПоДаннымКонтрагента.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	ТаблицаПоДаннымКонтрагента = Документы.СверкаВзаиморасчетов.ПустаяСсылка().ДанныеКонтрагента.Выгрузить();
	
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ТаблицаПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.Договор = ДоговорПоСтрокеАктаСверки(Шапка, СтрокаДоговора);
				СтрокаПоДаннымКонтрагента.ДатаОперации = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.НаименованиеОперации = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.ОписаниеДокумента = СтрокаДокумента.Наименование;
				СтрокаПоДаннымКонтрагента.СуммаДолгКонтрагента = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.СуммаДолгОрганизации = СтрокаОперации.СуммаКредит;
				СтрокаПоДаннымКонтрагента.ВхНомерДокумента = СтрокаДокумента.Номер;
				СтрокаПоДаннымКонтрагента.ВхДатаДокумента = СтрокаДокумента.Дата;
				СтрокаПоДаннымКонтрагента.ВалютаДокумента = СтрокаПоДаннымКонтрагента.Договор.ВалютаРасчетов;
				
				Если НЕ ЗначениеЗаполнено(СтрокаПоДаннымКонтрагента.ВалютаДокумента) Тогда
					СтрокаПоДаннымКонтрагента.ВалютаДокумента = Шапка.ВалютаДокумента;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура();
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("ДанныеКонтрагента", ТаблицаПоДаннымКонтрагента);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция СтруктураЗаполненияСверкиВзаиморасчетов(ДанныеЭД, ДополнительныеПараметры)
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Даты, номера
	Шапка.Вставить("НачалоПериода", ШапкаЭД.ДатаНачала);
	Шапка.Вставить("КонецПериода", ШапкаЭД.ДатаОкончания);
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента", ШапкаЭД.Дата);
	
	// Участники сделки
	Шапка.Вставить("Организация", ШапкаЭД.Получатель.Ссылка);
	Шапка.Вставить("Контрагент", ШапкаЭД.Отправитель.Ссылка);
	
	// Валюта, суммы
	ОстатокНаНачалоПоДаннымКонтрагента = ИтогиЭД.СальдоНачДеб - ИтогиЭД.СальдоНачКр;
	
	Шапка.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("ОстатокНаНачалоПоДаннымКонтрагента", ОстатокНаНачалоПоДаннымКонтрагента);
	
	ТаблицаПоДаннымКонтрагента = Новый ТаблицаЗначений;
	Для Каждого Реквизит Из Метаданные.Документы.СверкаВзаиморасчетов.ТабличныеЧасти.ДанныеКонтрагента.Реквизиты Цикл
		ТаблицаПоДаннымКонтрагента.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	ТаблицаПоДаннымКонтрагента = Документы.СверкаВзаиморасчетов.ПустаяСсылка().ДанныеКонтрагента.Выгрузить();
	
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ТаблицаПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.Договор = ДоговорПоСтрокеАктаСверки(Шапка, СтрокаДоговора);
				СтрокаПоДаннымКонтрагента.ОписаниеДокумента = СтрокаДокумента.Наименование;
				СтрокаПоДаннымКонтрагента.СуммаДолгКонтрагента = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.СуммаДолгОрганизации = СтрокаОперации.СуммаКредит;
				СтрокаПоДаннымКонтрагента.ВхНомерДокумента = СтрокаДокумента.Номер;
				СтрокаПоДаннымКонтрагента.ВхДатаДокумента = СтрокаДокумента.Дата;
				СтрокаПоДаннымКонтрагента.ВалютаДокумента = СтрокаПоДаннымКонтрагента.Договор.ВалютаРасчетов;
				
				Если НЕ ЗначениеЗаполнено(СтрокаПоДаннымКонтрагента.ВалютаДокумента) Тогда
					СтрокаПоДаннымКонтрагента.ВалютаДокумента = Шапка.ВалютаДокумента;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура();
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("ДанныеКонтрагента", ТаблицаПоДаннымКонтрагента);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ДоговорПоСтрокеАктаСверки(ДанныеДокумента, РеквизитыДоговора)
	
	ОтборПоВалюте = Новый Структура("ЗначениеОтбора", ДанныеДокумента.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	
	Если РеквизитыДоговора.Описание = "С покупателем" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.СПоставщиком);
	ИначеЕсли РеквизитыДоговора.Описание = "С поставщиком" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.СПокупателем);
	Иначе
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.СПоставщиком);
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.СПокупателем);
	КонецЕсли;
	
	ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПоКонтрагентуПоОрганизации(
		ДанныеДокумента.Контрагент,
		ДанныеДокумента.Организация,
		СписокВидовДоговоров,
		ДанныеДокумента.ВалютаДокумента
	);
	
	Возврат ДоговорКонтрагента;
	
КонецФункции

Функция НомерДокументаБезПрефикса(НомерДокумента)
	
	УдалитьПрефиксИнформационнойБазы	= Истина;
	УдалитьПользовательскийПрефикс		= Истина;
	
	НомерДокументаБезПрефиксов = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерДокумента, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
	
	Возврат НомерДокументаБезПрефиксов;

КонецФункции

Процедура ДополнитьПараметрыЗаполненияАктаОРасхожденияхПоДокументуОснованию(ДокументОснование, Шапка)

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Шапка.Вставить("ДокументОснование", ДокументОснование);
	Шапка.СуммаВключаетНДС = РазрешенноеЗначениеРеквизитаОбъекта(ДокументОснование, "СуммаВключаетНДС");

КонецПроцедуры

Функция НайтиОснованиеДокументаОРасхождениях(Организация, ДатаДокумента, НомерДокумента)

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокументРасходнаяНакладная.Ссылка КАК Документ
	|ИЗ
	|	Документ.РасходнаяНакладная КАК ДокументРасходнаяНакладная
	|ГДЕ
	|	ДокументРасходнаяНакладная.Организация = &Организация
	|	И ДокументРасходнаяНакладная.Номер ПОДОБНО &НомерДокумента
	|	И НАЧАЛОПЕРИОДА(ДокументРасходнаяНакладная.Дата, ДЕНЬ) = &ДатаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураДокументыОснования.ДокументОснование
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
	|ГДЕ
	|	СчетФактураДокументыОснования.ДокументОснование.Организация = &Организация
	|	И СчетФактураДокументыОснования.ДокументОснование.Номер ПОДОБНО &НомерДокумента
	|	И НАЧАЛОПЕРИОДА(СчетФактураДокументыОснования.ДокументОснование.Дата, ДЕНЬ) = &ДатаДокумента";
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаДокумента",	НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("НомерДокумента",	"%" + НомерДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Документ;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция РазрешенноеЗначениеРеквизитаОбъекта(Ссылка, Реквизиты)

	ВыбратьРазрешенныеЗначения	= Истина;
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенныеЗначения);
	
	Возврат Результат;

КонецФункции

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗначенияРеквизитовОбъектаЛокальная", Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПриходнуюНакладную(ДокументОбъект, ДанныеДляЗагрузки)
	
	ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ВидОперации = СвойствоСтруктуры(ДанныеДляЗагрузки.Шапка, "ВидОперации");
	Если ВидОперации = Неопределено Тогда
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	Иначе
		ДокументОбъект.ВидОперации = ВидОперации;
	КонецЕсли;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.УстановитьНовыйНомер();
	
	// Заполним реквизиты шапки на основании структуры данных заполнения
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	// Загрузим табличные части
	ДокументОбъект.Запасы.Загрузить(ДанныеДляЗагрузки.Запасы);
	ДокументОбъект.Расходы.Загрузить(ДанныеДляЗагрузки.Расходы);
	Если ДанныеДляЗагрузки.Свойство("ШтрихкодыУпаковок")
		И ЕстьШтрихкодыУпаковок(ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДляЗагрузки.ШтрихкодыУпаковок);
	КонецЕсли;
	
	ПересчитатьЦеныСУчетомНДС(ДокументОбъект, "Запасы");
	ПересчитатьЦеныСУчетомНДС(ДокументОбъект, "Расходы");
	
	// Заполним курс и кратность
	КурсВалюты				 = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
	ДокументОбъект.Курс		 = КурсВалюты.Курс;
	ДокументОбъект.Кратность = КурсВалюты.Кратность;
	
	НациональнаяВалюта = ВалютаРегламентированногоУчета();
	Если ДокументОбъект.ВалютаДокумента <> НациональнаяВалюта Тогда
		ПересчитатьЦеныТабличнойЧастиПоВалюте(ДокументОбъект, НациональнаяВалюта, "Запасы");
		ПересчитатьЦеныТабличнойЧастиПоВалюте(ДокументОбъект, НациональнаяВалюта, "Расходы");
	КонецЕсли;
	
	// Установим вручную некоторые реквизиты шапки
	ЗаполнитьДоговорКонтрагента(ДокументОбъект);
	
	ЭтоЗачет = Истина;
	
	ДокументОбъект.СпособЗачетаПредоплаты = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособЗачетаДляДоговора(
		ДокументОбъект.Договор,
		ДокументОбъект.Контрагент,
		ЭтоЗачет
	);
	
	Если ДанныеЗаполнения.Свойство("СуммаНДС")
		И ДанныеЗаполнения.СуммаНДС > 0
		ИЛИ ДокументОбъект.Запасы.Итог("СуммаНДС") > 0
		ИЛИ ДокументОбъект.Расходы.Итог("СуммаНДС") > 0 Тогда
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Иначе
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	КонецЕсли;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего") + ДокументОбъект.Расходы.Итог("Всего");
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		ДокументОбъект.ВалютаДокумента = НациональнаяВалюта;
	КонецЕсли;
	
	Если ДанныеДляЗагрузки.Свойство("СведенияПрослеживаемости")
		И ДанныеДляЗагрузки.СведенияПрослеживаемости <> Неопределено
		И ЕстьМетаданныеСведенияПрослеживаемости(ДокументОбъект.Метаданные()) Тогда
		
		ДокументОбъект.СведенияПрослеживаемости.Очистить();
		ДокументОбъект.СведенияПрослеживаемости.Загрузить(ДанныеДляЗагрузки.СведенияПрослеживаемости);
		
	КонецЕсли;

	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеРасходы(ДокументОбъект, ДанныеДляЗагрузки)
	
	ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.УстановитьНовыйНомер();
	
	// Заполним реквизиты шапки на основании структуры данных заполнения
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	// Загрузим табличные части
	ДокументОбъект.Расходы.Загрузить(ДанныеДляЗагрузки.Расходы);
	
	ПересчитатьЦеныСУчетомНДС(ДокументОбъект, "Расходы");
	
	// Заполним курс и кратность
	КурсВалюты				 = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
	ДокументОбъект.Курс		 = КурсВалюты.Курс;
	ДокументОбъект.Кратность = КурсВалюты.Кратность;
	
	НациональнаяВалюта = ВалютаРегламентированногоУчета();
	Если ДокументОбъект.ВалютаДокумента <> НациональнаяВалюта Тогда
		ПересчитатьЦеныТабличнойЧастиПоВалюте(ДокументОбъект, НациональнаяВалюта, "Расходы");
	КонецЕсли;
	
	// Установим вручную некоторые реквизиты шапки
	ЗаполнитьДоговорКонтрагента(ДокументОбъект);
	
	Если ДанныеЗаполнения.Свойство("СуммаНДС")
		И ДанныеЗаполнения.СуммаНДС > 0
		ИЛИ ДокументОбъект.Расходы.Итог("СуммаНДС") > 0 Тогда
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Иначе
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	КонецЕсли;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.Расходы.Итог("Всего");
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		ДокументОбъект.ВалютаДокумента = НациональнаяВалюта;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКорректировкуПоступления(ДокументОбъект, ДанныеДокумента)
	
	ДанныеЗаполнения = ДанныеДокумента.Шапка;
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ЭтоИсправление = (ДанныеЗаполнения.ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Исправление);
	ЕстьДанныеПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости <> Неопределено;
	
	Если ЭтоИсправление Тогда
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
	Иначе
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	КонецЕсли;
	
	//ДокументОбъект.ЗаполнитьСвойстваШапки();
	
	Если ЭтоИсправление Тогда
		ДокументОбъект.НомерИсправления = ДанныеЗаполнения.НомерИсправления;
		ДокументОбъект.ДатаИсправления = ДанныеЗаполнения.ДатаИсправления;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("НомерИсходногоДокумента")
		И ЗначениеЗаполнено(ДанныеЗаполнения.НомерИсходногоДокумента) Тогда
		ДокументОбъект.НомерИсходногоДокумента = ДанныеЗаполнения.НомерИсходногоДокумента;
		ДокументОбъект.ДатаИсходногоДокумента  = ДанныеЗаполнения.ДатаИсходногоДокумента;
		Если ДанныеЗаполнения.УчитыватьИсправлениеИсходногоДокумента Тогда
			ДокументОбъект.НомерИсправленияИсходногоДокумента = ДанныеЗаполнения.НомерИсправленияИсходногоДокумента;
			ДокументОбъект.ДатаИсправленияИсходногоДокумента  = ДанныеЗаполнения.ДатаИсправленияИсходногоДокумента;
		КонецЕсли;
	КонецЕсли;
	
	ДокументПоступления = ДокументОбъект.ДокументОснование;
	Если Не ЗначениеЗаполнено(ДокументПоступления) И ДанныеЗаполнения.Свойство("Основание") Тогда
		ДокументПоступления = ДанныеЗаполнения.Основание;
	КонецЕсли;
	
	// Заполним корректировку поступления данными основания
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
		ДокументОбъект.Заполнить(ДокументПоступления);
	КонецЕсли;
	
	// Заполним табличные части данными корректировки
	ТабличныеЧастиДляЗаполения = Новый Структура("Запасы, Расходы");
	СтрокиТабличнойЧастиДляПерезаполнения = Новый Структура("Запасы, Расходы",
															"Количество, Цена, Сумма, СуммаНДС, Всего", 
															"Количество, Цена, Сумма, СуммаНДС, Всего, Содержание");
			
	Если ДанныеЗаполнения.ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Исправление Тогда
		СтрокиТабличнойЧастиДляПерезаполненияНового = Новый Структура("Запасы, Расходы", "", "");
	Иначе
		СтрокиТабличнойЧастиДляПерезаполненияНового = Новый Структура("Запасы, Расходы",
				"КоличествоДоИзменения, ЦенаДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения, ВсегоДоИзменения", 
				"КоличествоДоИзменения, ЦенаДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения, ВсегоДоИзменения, СодержаниеДоИзменения");
	КонецЕсли;
			
	Для Каждого ТабличнаяЧасть Из ТабличныеЧастиДляЗаполения Цикл
		
		ИмяТЧ = ТабличнаяЧасть.Ключ;
			
		СтруктураПоиска = Новый Структура("Номенклатура, СтавкаНДС");
		
		Для Каждого СтрокаДокумента Из ДокументОбъект[ИмяТЧ] Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
			РезультатПоискаДанныхЗаполнения = ДанныеДокумента[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
			
			Если РезультатПоискаДанныхЗаполнения.Количество() > 0 Тогда
				
				СтрокаДанныхЗаполнения = РезультатПоискаДанныхЗаполнения[0];
				ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаДанныхЗаполнения, СтрокиТабличнойЧастиДляПерезаполнения[ИмяТЧ]);
				
				Если ИмяТЧ = "Запасы" И ЕстьДанныеПрослеживаемости Тогда
					ОбновитьИдентификаторыСтрокПрослеживаемости(ДанныеДокумента, СтрокаДанныхЗаполнения.ИдентификаторСтроки, СтрокаДокумента.ИдентификаторСтроки);
				КонецЕсли;
				
				// Удалим обработанную строку из данных заполнения
				ДанныеДокумента[ИмяТЧ].Удалить(СтрокаДанныхЗаполнения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Добавим новые строки в документ
		Если ДанныеДокумента[ИмяТЧ].Количество() > 0 Тогда
			
			Для Каждого СтрокаДанныхЗаполнения Из ДанныеДокумента[ИмяТЧ] Цикл
				
				НоваяСтрока = ДокументОбъект[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхЗаполнения, , СтрокиТабличнойЧастиДляПерезаполненияНового[ИмяТЧ]);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПересчитатьЦеныСУчетомНДС(ДокументОбъект, "Запасы");
	ПересчитатьЦеныСУчетомНДС(ДокументОбъект, "Расходы");
	
	Если ДанныеЗаполнения.Свойство("СуммаНДС")
		И ДанныеЗаполнения.СуммаНДС > 0
		ИЛИ ДокументОбъект.Запасы.Итог("СуммаНДС") > 0
		ИЛИ ДокументОбъект.Расходы.Итог("СуммаНДС") > 0 Тогда
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Иначе
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета();
	КонецЕсли;
	
	Если ЕстьДанныеПрослеживаемости Тогда
		
		ЗаполнитьСведенияОПрослеживаемостиВходящегоКорректировочногоДокумента(
					ДокументОбъект.СведенияПрослеживаемости, 
					ДанныеДокумента.СведенияПрослеживаемости, 
					ДокументОбъект.Запасы);
					
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСчетФактуруПолученный(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	
	// вручную переопределим, если требуется
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, Шапка);
	
	// Заполнение документа-основания
	ДокументОснование = Неопределено;
	Если ЗначениеЗаполнено(Шапка.ДокументОснование) Тогда
		ДокументОснование = Шапка.ДокументОснование[0];
	КонецЕсли;
	
	РеквизитыОснования = Новый Структура;
	РеквизитыОснования.Вставить("ДокументОснование", ДокументОснование);
	РеквизитыОснования.Вставить("НомерИсходногоДокумента", Шапка.НомерИсходногоДокумента);
	РеквизитыОснования.Вставить("ДатаИсходногоДокумента", Шапка.ДатаИсходногоДокумента);
	
	Если Шапка.ВидСчетаФактуры = Перечисления.ВидыОперацийСчетФактураПолученный.Корректировка Тогда
		
		УчитыватьИсправлениеИсходногоДокумента = Шапка.Свойство("УчитыватьИсправлениеИсходногоДокумента") И Шапка.УчитыватьИсправлениеИсходногоДокумента;
		
		РеквизитыОснования.Вставить("УчитыватьИсправлениеИсходногоДокумента", УчитыватьИсправлениеИсходногоДокумента);
		
		Если УчитыватьИсправлениеИсходногоДокумента Тогда
			РеквизитыОснования.Вставить("НомерИсправленияИсходногоДокумента", Шапка.НомерИсправленияИсходногоДокумента);
			РеквизитыОснования.Вставить("ДатаИсправленияИсходногоДокумента", Шапка.ДатаИсправленияИсходногоДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если ОснованиеСчетаФактурыУказываетсяВТабличнойЧасти() Тогда
			НоваяСтрока = ДокументОбъект.ДокументыОснования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыОснования);
		Иначе
			ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыОснования);
		КонецЕсли;
		
		ДокументОбъект.Заполнить(ДокументОснование);
		
	КонецЕсли;
	
	ДокументОбъект.ВидОперации = Шапка.ВидСчетаФактуры;
	ДокументОбъект.НомерВходящегоДокумента = Шапка.НомерВходящегоДокумента;
	ДокументОбъект.ДатаВходящегоДокумента  = Шапка.ДатаВходящегоДокумента;
	
	Если ДанныеДокумента.Свойство("Запасы") Тогда
		
		ДокументОбъект.СуммаНДСДокумента =
		(ДанныеДокумента.Запасы.Итог("СуммаНДС") + ДанныеДокумента.Расходы.Итог("СуммаНДС"));
		ДокументОбъект.СуммаДокумента =
		(ДанныеДокумента.Запасы.Итог("Всего") + ДанныеДокумента.Расходы.Итог("Всего")) - ДокументОбъект.СуммаНДСДокумента;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДанныеДокумента.ИтогиТЧ.СуммаНДСУвеличение) Тогда
			СуммаНДСДокумента = ДанныеДокумента.ИтогиТЧ.СуммаНДСУвеличение;
			СуммаДокумента = ДанныеДокумента.ИтогиТЧ.СуммаБезНДСУвеличение;
		Иначе
			СуммаНДСДокумента = ДанныеДокумента.ИтогиТЧ.СуммаНДСУменьшение;
			СуммаДокумента = ДанныеДокумента.ИтогиТЧ.СуммаБезНДСУменьшение;
		КонецЕсли;
		
		ДокументОбъект.СуммаНДСДокумента = СуммаНДСДокумента;
		ДокументОбъект.СуммаДокумента = СуммаДокумента;
		
	КонецЕсли;
		
	Если Шапка.Свойство("Исправление") И Шапка.Исправление Тогда
		ДокументОбъект.Исправление       = Шапка.Исправление;
		ДокументОбъект.НомерИсправления  = Шапка.НомерИсправления;
		ДокументОбъект.ДатаИсправления   = Шапка.ДатаИсправления;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Договор)
		И ЗначениеЗаполнено(ДокументОснование)
		И ЗначениеЗаполнено(ДокументОснование.Договор) Тогда
		
		ДокументОбъект.Договор = ДокументОснование.Договор;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьАктОРасхожденияхПолученный(ДокументОбъект, ДанныеДокумента)

	ДанныеЗаполнения = ДанныеДокумента.Шапка;
	
	Если ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		ДокументОбъект.Заполнить(ДанныеЗаполнения.ДокументОснование);
	Иначе
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
	КонецЕсли;
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.УстановитьНовыйНомер();
	
	// Заполним табличные части данными о расхождениях
	ЗаполнитьТабличнуюЧасть_ДокументОРасхождениях(ДокументОбъект, ДанныеДокумента);
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета();
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("ШтрихкодыУпаковок")
		И ЕстьШтрихкодыУпаковок(ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДокумента.ШтрихкодыУпаковок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть_ДокументОРасхождениях(ДокументОбъект, ДанныеДокумента)
	
	РеквизитыТабличнойЧастиДляПерезаполнения = "Количество, Цена, Сумма, СуммаНДС, Всего, НомерГТД, СтранаПроисхождения";
	ТабличнаяЧастьЗапасы = Новый Структура("Запасы", РеквизитыТабличнойЧастиДляПерезаполнения);
	
	СтруктураПоиска = Новый Структура("Номенклатура, СтавкаНДС");
	
	Для Каждого СтрокаДокумента Из ТабличнаяЧастьЗапасы Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
		РезультатПоискаДанныхЗаполнения = ДанныеДокумента.Запасы.НайтиСтроки(СтруктураПоиска);
		
		Если РезультатПоискаДанныхЗаполнения.Количество() > 0 Тогда
			
			СтрокаДанныхЗаполнения = РезультатПоискаДанныхЗаполнения[0];
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаДанныхЗаполнения, РеквизитыТабличнойЧастиДляПерезаполнения);
			
			// Удалим обработанную строку из данных заполнения
			ДанныеДокумента.Запасы.Удалить(СтрокаДанныхЗаполнения);
			
			СтрокаДокумента.ЕстьВДокументеРеализации = Истина;
			
		КонецЕсли;
		
		// Добавим новые строки в документ
		Если ДанныеДокумента.Запасы.Количество() > 0 Тогда
			
			Для Каждого СтрокаДанныхЗаполнения Из ДанныеДокумента.Запасы Цикл
				
				НоваяСтрока = ДокументОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхЗаполнения);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПересчитатьЦеныСУчетомНДС(ДокументОбъект, "Запасы");

КонецПроцедуры

Процедура ЗаполнитьСверкуВзаиморасчетов3_0_2(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.УстановитьНовыйНомер();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДоговорыИзДокументаУчета = ДанныеДокумента.ДанныеКонтрагента.ВыгрузитьКолонку("Договор");
	
	Для каждого ДоговорИзСтрокиТЧ Из ДоговорыИзДокументаУчета Цикл
		СтрокаТаблицы = ДокументОбъект.ДоговорыКонтрагентов.Добавить();
		СтрокаТаблицы.Отметка = Истина;
		СтрокаТаблицы.Договор = ДоговорИзСтрокиТЧ;
	КонецЦикла;
	
	ДокументОбъект.Статус = Перечисления.СтатусыСверокВзаиморасчетов.Создана;
	
	Документы.СверкаВзаиморасчетов.НачальноеСальдоПоДоговорам(
		ДокументОбъект.Организация, 
		ДокументОбъект.НачалоПериода,
		ДокументОбъект.ДоговорыКонтрагентов,
		ДокументОбъект.ВалютаДокумента,
		ДокументОбъект.СальдоНачалоПериода
	);
	
	ЗаполнятьПоВходящимДатам = Истина;
	
	РеквизитыДокументаСверки = Документы.СверкаВзаиморасчетов.ПолучитьСтруктуруДанныхДокумента(
		ДокументОбъект,
		ЗаполнятьПоВходящимДатам
	);
	
	РеквизитыДокументаСверки.Вставить("Ссылка", Неопределено);
	
	Документы.СверкаВзаиморасчетов.ЗаполнитьДанныеПоОрганизации(
		РеквизитыДокументаСверки,
		ДокументОбъект.ДанныеОрганизации
	);
	
	ДокументОбъект.ДанныеКонтрагента.Загрузить(ДанныеДокумента.ДанныеКонтрагента);
	
КонецПроцедуры

Процедура ЗаполнитьСверкуВзаиморасчетов(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.УстановитьНовыйНомер();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Статус = Перечисления.СтатусыСверокВзаиморасчетов.Создана;
	
	РеквизитыДокументаСверки = ПолучитьРеквизитыДокументаСверкаВзаиморасчетов(ДокументОбъект);
	
	Документы.СверкаВзаиморасчетов.ЗаполнитьДанныеПоОрганизации(РеквизитыДокументаСверки, ДокументОбъект.ДанныеОрганизации);
	
	ДокументОбъект.ДанныеКонтрагента.Загрузить(ДанныеДокумента.ДанныеКонтрагента);
	
КонецПроцедуры

Функция ПолучитьРеквизитыДокументаСверкаВзаиморасчетов(ДокументОбъект)
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Дата", ДокументОбъект.Дата);
	ДанныеДокумента.Вставить("НачалоПериода", ДокументОбъект.НачалоПериода);
	ДанныеДокумента.Вставить("КонецПериода", ДокументОбъект.КонецПериода);
	ДанныеДокумента.Вставить("Организация", Константы.УчетПоКомпании.Компания(ДокументОбъект.Организация));
	ДанныеДокумента.Вставить("Ссылка", Неопределено);
	ДанныеДокумента.Вставить("СортироватьПоДоговорам", ДокументОбъект.СортироватьПоДоговорам);
	ДанныеДокумента.Вставить("ВалютаДокумента", ДокументОбъект.ВалютаДокумента);
	ДанныеДокумента.Вставить("ОрганизациюВПредставление", ДокументОбъект.ДобавлятьОрганизациюВПредставлениеДокумента);
	ДанныеДокумента.Вставить("УказатьСчетФактуру", ДокументОбъект.ДобавлятьСчетФактуруВПредставлениеДокумента);
	ДанныеДокумента.Вставить("ВхНомерВПоступлениеНаСчет", ДокументОбъект.ВходящийНомерВПредставлениеПоступленияНаСчет);
	ДанныеДокумента.Вставить("ВхНомерВРасходСоСчета", ДокументОбъект.ВходящийНомерВПредставлениеРасходаСоСчета);
	ДанныеДокумента.Вставить("ПоВходящимДатам", Истина);
	ДанныеДокумента.Вставить("Контрагент", ДокументОбъект.Контрагент);
	ДанныеДокумента.Вставить("ВестиРасчетыПоДоговорам", Истина);
	ДанныеДокумента.Вставить("ДоговорыКонтрагентов", ДокументОбъект.ДоговорыКонтрагентов.Выгрузить());
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ЭтоНоменклатураРасход(Номенклатура)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры");
		Результат = ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
				ИЛИ ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНоменклатураЗапас(Номенклатура)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры");
		Результат = (ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодразделениеПользователя(Пользователь)
	
	Результат = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьЦенуКоличество(СтрокаТабличнойЧасти)
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
		СтрокаТабличнойЧасти.Количество = 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена) Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьЕдиницуИзмерения(СтрокаТабличнойЧасти)
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ЕдиницаИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПересчитатьЦеныСУчетомНДС(ДокументОбъект, ИмяТабличнойЧасти)
	
	Если Не ДокументОбъект.СуммаВключаетНДС Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитыватьЦенуДоКорректировки = Ложь;
	Если ДокументОбъект.Метаданные() = Метаданные.Документы.КорректировкаПоступления
		И ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		ПересчитыватьЦенуДоКорректировки = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧасти] Цикл
		
		Если СтрокаТЧ.Количество = 0 Тогда
			СтрокаТЧ.Цена	= 0;
			СтрокаТЧ.Сумма	= 0;
		Иначе
			СтрокаТЧ.Цена	= СтрокаТЧ.Всего / СтрокаТЧ.Количество;
			СтрокаТЧ.Сумма	= СтрокаТЧ.Всего;
		КонецЕсли;
		
		Если Не ПересчитыватьЦенуДоКорректировки Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЧ.КоличествоДоИзменения = 0 Тогда
			СтрокаТЧ.ЦенаДоИзменения 	= 0;
			СтрокаТЧ.СуммаДоИзменения 	= 0;
		Иначе
			СтрокаТЧ.ЦенаДоИзменения	= СтрокаТЧ.ВсегоДоИзменения / СтрокаТЧ.КоличествоДоИзменения;
			СтрокаТЧ.СуммаДоИзменения	= СтрокаТЧ.ВсегоДоИзменения;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьЦеныТабличнойЧастиПоВалюте(Документ, ПредыдущаяВалюта, ИмяТабличнойЧасти)
	
	ИспользуетсяПодсистема_1_6_26 = ИспользуетсяПодсистема_1_6_26();
	
	Если ИспользуетсяПодсистема_1_6_26() Тогда
		МодульЦенообразованиеСервер = ОбщегоНазначения.ОбщийМодуль("ЦенообразованиеСервер");
	Иначе
		МодульЦенообразованиеСервер = ОбщегоНазначения.ОбщийМодуль("УправлениеНебольшойФирмойСервер");
	КонецЕсли;
	
	СтруктураКурсы = МодульЦенообразованиеСервер.ПолучитьКурсыВалют(
		ПредыдущаяВалюта,
		Документ.ВалютаДокумента,
		Документ.Дата
	);
	
	Для каждого СтрокаТабличнойЧасти Из Документ[ИмяТабличнойЧасти] Цикл
		
		СтрокаТабличнойЧасти.Цена = МодульЦенообразованиеСервер.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.Цена,
			СтруктураКурсы.КурсНач,
			СтруктураКурсы.Курс,
			СтруктураКурсы.КратностьНач,
			СтруктураКурсы.Кратность
		);
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
		Если Документ.СуммаВключаетНДС Тогда
			СтрокаТабличнойЧасти.СуммаНДС = ?(
				Документ.СуммаВключаетНДС, 
				СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
				СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100
			);
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Документ.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		Иначе
			СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100;
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДоговорКонтрагента(ДокументОбъект)

	Если Не ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		Возврат;
	ИначеЕсли Не ДокументОбъект.Контрагент.ВестиРасчетыПоДоговорам Тогда
		ДокументОбъект.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(ДокументОбъект.Контрагент);
		Возврат;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	МетаданныеОбъекта = ДокументОбъект.Метаданные();
	
	ВидОперации = Неопределено;
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ВидОперации") Тогда
		ВидОперации = ДокументОбъект.ВидОперации;
	КонецЕсли;
	
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(ДокументОбъект.Ссылка, ВидОперации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ВалютаРасчетов = &ВалютаРасчетов
	|	И ДоговорыКонтрагентов.ВидДоговора В(&СписокВидовДоговора)
	|	И (ДоговорыКонтрагентов.ДатаДоговора <= &ДатаДоговора
	|			ИЛИ ДоговорыКонтрагентов.ДатаДоговора = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДоговорыКонтрагентов.СрокДействия >= &ДатаДоговора
	|			ИЛИ ДоговорыКонтрагентов.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Контрагент", ДокументОбъект.Контрагент);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговоров);
	Запрос.УстановитьПараметр("ВалютаРасчетов", ДокументОбъект.ВалютаДокумента);
	Запрос.УстановитьПараметр("ДатаДоговора", ДокументОбъект.Дата); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Договор = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнениеЗначенийРеквизитовШапки(ТекущийОбъект, ДанныеЗаполнения)
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ОбъектМетаданных = ТекущийОбъект.Метаданные();
	
	Для Каждого Строка Из ДанныеЗаполнения Цикл
		
		Если ЗначениеЗаполнено(Строка.Ключ) И ЕстьРеквизитМетаданных(ОбъектМетаданных, Строка.Ключ, Истина) Тогда
			Если ТекущийОбъект[Строка.Ключ] <> Строка.Значение Тогда
				ТекущийОбъект[Строка.Ключ] = Строка.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, заполнен ли номер таможенной декларации. Номер декларации
// считается пустым, если содержит только из незначащие символы.
//
// Параметры:
//  НомерДекларации - Строка - номер таможенной декларации.
// 
// Возвращаемое значение:
//  Булево - Истина, если номер не заполнен или состоит только из разделителей.
//
Функция ЭтоПустойНомерТаможеннойДекларации(НомерДекларации)
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(НомерДекларации) Тогда
		Возврат Результат;
	КонецЕсли;
	
	РазделительДекларации = РазделительТаможеннойДекларации();
	
	Для Индекс = 1 По СтрДлина(НомерДекларации) Цикл
		
		Символ = Сред(НомерДекларации, Индекс, 1);
		
		Если Символ <> РазделительДекларации Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает символ, использующийся в качестве разделителя в номере ГТД.
// 
// Возвращаемое значение:
//  Строка.
//
Функция РазделительТаможеннойДекларации()
	
	Возврат "/";
	
КонецФункции

// Заменяет в номере ГТД вторичные символы-разделители на основной разделитель.
//
// Параметры:
//  НомерДекларации - Строка - номер таможенной декларации.
//
Процедура НормализоватьНомерТаможеннойДекларации(НомерДекларации)
	
	РазделительДекларации = РазделительТаможеннойДекларации();
	
	ДопустимыеРазделители = Новый Массив;
	ДопустимыеРазделители.Добавить("-");
	ДопустимыеРазделители.Добавить("\");
	ДопустимыеРазделители.Добавить("|");
	ДопустимыеРазделители.Добавить("~");
	
	Для Каждого ВторичныйРазделитель Из ДопустимыеРазделители Цикл
		
		НомерДекларации = СтрЗаменить(НомерДекларации, ВторичныйРазделитель, РазделительДекларации);
		
	КонецЦикла;
	
КонецПроцедуры

// Находит ссылку на элемент справочника номеров ГТД по номеру таможенной декларации.
// Если подходящий элемент не найден, будет создан новый. Для заполнения его реквизитов
// будут использованы данные из номера таможенной декларации.
//
// Параметры:
//  НомерТаможеннойДекларации - Строка - номер таможенной декларации.
// 
// Возвращаемое значение:
//  СправочникСсылка.НомераГТД - если номер таможенной декларации не пустой;
//  Неопределено - если не указан номер таможенной декларации.
//
Функция НайтиСоздатьНомерГТД(НомерТаможеннойДекларации)
	
	НормализоватьНомерТаможеннойДекларации(НомерТаможеннойДекларации);
	
	Если ЭтоПустойНомерТаможеннойДекларации(НомерТаможеннойДекларации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Ссылка = Справочники.НомераГТД.НайтиПоКоду(НомерТаможеннойДекларации);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Результат = Ссылка;
		
	Иначе
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Код", НомерТаможеннойДекларации);
		ЗначенияЗаполнения.Вставить("Комментарий", НСтр("ru = 'Загружен из Диадок'"));
		ЗначенияЗаполнения.Вставить("ДопускаетсяЗаписьСОшибкой", Истина);
		
		Объект = Справочники.НомераГТД.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Объект, ЗначенияЗаполнения);
		
		Объект.Записать();
		
		Результат = Объект.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет номер ГТД и страну происхождения в строке табличной части документа.
//
// Параметры:
//  НоваяСтрока			 - СтрокаТабличнойЧасти - заполняемая строка документа;
//  КоллекцияСведенийТД	 - Массив - содержит структуры с ключами:
//    * СтранаПроисхождения - Структура - см. НовыйКлючевыеСвойстваСтранаМира;
//    * НомерГТД - Структура - см. НовыйКлючевыеСвойстваНомерГТД;
//
Процедура ЗаполнитьСведенияТаможеннойДекларации(НоваяСтрока, КоллекцияСведенийТД)
	
	Если Не ЗначениеЗаполнено(КоллекцияСведенийТД) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияТД = КоллекцияСведенийТД[0];
	НоваяСтрока.СтранаПроисхождения = СведенияТД.СтранаПроисхождения.Ссылка;
	
	НоваяСтрока.НомерГТД = СведенияТД.НомерГТД.Ссылка;
	Если Не ЗначениеЗаполнено(НоваяСтрока.НомерГТД) Тогда
		РегНомерГТД = СведенияТД.НомерГТД.РегистрационныйНомер;
		НоваяСтрока.НомерГТД = НайтиСоздатьНомерГТД(РегНомерГТД);
	КонецЕсли;
	
КонецПроцедуры

Функция НомерГТДИзСведенийПрослеживаемости(РегистрационныйНомер)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		Результат = НайтиСоздатьНомерГТД(РегистрационныйНомер);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прослеживаемость_Создание

Функция НоваяТаблицаСведенияПрослеживаемостиДокументаИБ(ПустаяСсылкаНаДокумент, ДляУКД = Ложь)
	
	Результат = Неопределено;
		
	Если ЕстьМетаданныеСведенияПрослеживаемости(ПустаяСсылкаНаДокумент.Метаданные()) Тогда
		Результат = ПустаяСсылкаНаДокумент.СведенияПрослеживаемости.ВыгрузитьКолонки();
		
		Если ДляУКД Тогда
			ОписаниеЧисло	 = Новый ОписаниеТипов("Число");
			Результат.Колонки.Добавить("КоличествоУвеличение", ОписаниеЧисло);
			Результат.Колонки.Добавить("КоличествоУменьшение", ОписаниеЧисло);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет СведенияОПрослеживаемости документа по данным строки товара электронного документа
// Аналог ОбменСконтрагентамиБП.ЗаполнитьСведенияОПрослеживаемостиВДокументеИБ_УКД()
//
// Параметры
//  Приемник				- ТабличнаяЧасть		- таблица СведенияОПрослеживаемости документа 1С
//  Источник				- ТаблицаЗначений		- см ПрочитатьСвойства_СведенияОПрослеживаемостиКорректировочногоДокумента()
//  Товары 					- ТаблицаЗначений	 	- таблица товаров документа
//
Процедура ЗаполнитьСведенияОПрослеживаемостиВходящегоКорректировочногоДокумента(Приемник, Источник, Товары)
	
	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Приемник.ВыгрузитьКолонки();
	
	СведПрослежИБ = Приемник.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СведПрослежИБ", СведПрослежИБ);
	Запрос.УстановитьПараметр("СведПрослежЭД", Источник);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ КАК РНПТ,
		|	СведПрослежИБ.Количество КАК Количество,
		|	СведПрослежИБ.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ СведПрослежИБ
		|ИЗ
		|	&СведПрослежИБ КАК СведПрослежИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежЭД.КоличествоУвеличение КАК КоличествоУвеличение,
		|	СведПрослежЭД.КоличествоУменьшение КАК КоличествоУменьшение,
		|	СведПрослежЭД.РНПТ КАК РНПТ,
		|	СведПрослежЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ СведПрослежЭД
		|ИЗ
		|	&СведПрослежЭД КАК СведПрослежЭД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ КАК РНПТ,
		|	СведПрослежИБ.КоличествоПрослеживаемости - СведПрослежЭД.КоличествоУменьшение + СведПрослежЭД.КоличествоУвеличение КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ СкорректированныеСтрокиПоДаннымЭД
		|ИЗ
		|	СведПрослежИБ КАК СведПрослежИБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СведПрослежЭД КАК СведПрослежЭД
		|		ПО СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки
		|			И СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ,
		|	СведПрослежИБ.КоличествоПрослеживаемости
		|ИЗ
		|	СведПрослежИБ КАК СведПрослежИБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведПрослежЭД КАК СведПрослежЭД
		|		ПО СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки
		|			И СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ
		|ГДЕ
		|	СведПрослежЭД.ИдентификаторСтроки ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежЭД.РНПТ КАК РНПТ,
		|	СведПрослежЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ НовыеСтрокиПоДаннымЭД
		|ИЗ
		|	СведПрослежЭД КАК СведПрослежЭД
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведПрослежИБ КАК СведПрослежИБ
		|		ПО (СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки)
		|			И (СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ)
		|ГДЕ
		|	СведПрослежИБ.РНПТ ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СкорректированныеСтрокиПоДаннымЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СкорректированныеСтрокиПоДаннымЭД.РНПТ КАК РНПТ,
		|	0 КАК Количество,
		|	СкорректированныеСтрокиПоДаннымЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
		|ИЗ
		|	СкорректированныеСтрокиПоДаннымЭД КАК СкорректированныеСтрокиПоДаннымЭД
		|ГДЕ
		|	СкорректированныеСтрокиПоДаннымЭД.КоличествоПрослеживаемости <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НовыеСтрокиПоДаннымЭД.ИдентификаторСтроки,
		|	НовыеСтрокиПоДаннымЭД.РНПТ,
		|	0,
		|	НовыеСтрокиПоДаннымЭД.КоличествоПрослеживаемости
		|ИЗ
		|	НовыеСтрокиПоДаннымЭД КАК НовыеСтрокиПоДаннымЭД
		|ИТОГИ ПО
		|	ИдентификаторСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаИдентификаторСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификаторСтроки.Следующий() Цикл
		
		СведенияПрослеживаемости = Результат.СкопироватьКолонки();
		
		Выборка = ВыборкаИдентификаторСтроки.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СведенияПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
		СтрокиТоваров = Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаИдентификаторСтроки.ИдентификаторСтроки));
		Для каждого СтрокаТовара Из СтрокиТоваров Цикл
			СтрокаТовара.ПрослеживаемыйТовар = Истина;
		КонецЦикла;
		
		ПроизвестиРассчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, СтрокиТоваров[0].Количество);
		ДополнитьТаблицу(Результат, СведенияПрослеживаемости);
		
		
	КонецЦикла;
	
	Приемник.Загрузить(Результат);
	
КонецПроцедуры

// Дополняет таблицу прослеживаемости данными ЭД для переданной строки товара
//
// Параметры
//  Приемник					- ТаблицаЗначений			- см НоваяТаблицаСведенияПрослеживаемости()
//  ДанныеЭД					- Массив	 				- массив структур, СведенияОПрослеживаемости электронного документа
//  СтрокаТовары				- СтрокаТаблицыЗначений		- старый ИдентификаторСтроки
//
Процедура ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УКД(Приемник, ДанныеЭД, СтрокаТовары)
	
	СтрокаТовары.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	
	СведенияПрослеживаемости = Приемник.СкопироватьКолонки();
	Для Каждого СтрокаДанных Из ДанныеЭД Цикл
		СтрокаПрослеживаемости = СведенияПрослеживаемости.Добавить();
		СтрокаПрослеживаемости.РНПТ							= НомерГТДИзСведенийПрослеживаемости(СтрокаДанных.НомерГТДРегистрационныйНомер);
		СтрокаПрослеживаемости.КоличествоПрослеживаемости	= СтрокаДанных.КоличествоПослеИзменения;
		СтрокаПрослеживаемости.КоличествоУвеличение			= СтрокаДанных.КоличествоУвеличение;
		СтрокаПрослеживаемости.КоличествоУменьшение			= СтрокаДанных.КоличествоУменьшение;
		СтрокаПрослеживаемости.ИдентификаторСтроки			= СтрокаТовары.ИдентификаторСтроки;
	КонецЦикла;
	
	ДополнитьТаблицу(Приемник, СведенияПрослеживаемости);
	
КонецПроцедуры

// Дополняет таблицу прослеживаемости данными ЭД для переданной строки товара
//
// Параметры
//  Приемник					- ТаблицаЗначений			- см НоваяТаблицаСведенияПрослеживаемости()
//  ДанныеЭД 					- Массив	 				- массив структур, СведенияОПрослеживаемости электронного документа
//  СтрокаТовары				- СтрокаТаблицыЗначений		- старый ИдентификаторСтроки
//
Процедура ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УПД(Приемник, ДанныеЭД, СтрокаТовары)
	
	Если Приемник = Неопределено
		Или ДанныеЭД.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.ИдентификаторСтроки) Тогда
		ИдентификаторСтроки = СтрокаТовары.ИдентификаторСтроки;
	Иначе
		ИдентификаторСтроки = Новый УникальныйИдентификатор;
		СтрокаТовары.ИдентификаторСтроки = ИдентификаторСтроки;
	КонецЕсли;
	
	СтрокаТовары.ПрослеживаемыйТовар = Истина;
	
	СведенияПрослеживаемости = Приемник.СкопироватьКолонки();
	
	Для Каждого ЭлементИсточника Из ДанныеЭД Цикл
				
		НоваяПрослеживаемость = СведенияПрослеживаемости.Добавить();
		
		НоваяПрослеживаемость.ИдентификаторСтроки 			= ИдентификаторСтроки;
		НоваяПрослеживаемость.РНПТ 							= НомерГТДИзСведенийПрослеживаемости(ЭлементИсточника.НомерГТДРегистрационныйНомер);
		НоваяПрослеживаемость.КоличествоПрослеживаемости 	= ЭлементИсточника.КоличествоПоРНПТ;

	КонецЦикла;
	
	ПроизвестиРассчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, СтрокаТовары.Количество);
	
	ДополнитьТаблицу(Приемник, СведенияПрослеживаемости);
	
КонецПроцедуры

Процедура ПроизвестиРассчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, КоличествоТовара)
	
	// Обрабатываем по аналогии с типовой БП.
	// Возможные варианты:
	
	// 1. Учетное количество было заполнено из данных электронного документа. Рассчитывать не нужно.
	// Данный сценарий на текущий момент не поддерживается.
	Если СведенияПрослеживаемости.Итог("Количество") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоКоличествоПрослеживаемости = СведенияПрослеживаемости.Итог("КоличествоПрослеживаемости");
	
	// 2. Если общее количество прослеживаемости совпадает с количеством товара, то предполагаем, что единица измерения прослеживаемости совпадает
	// с учетной единицей измерения. В этом случае количество учетное приравниваем количеству прослеживаемости.
	Если ВсегоКоличествоПрослеживаемости = КоличествоТовара Тогда
		Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
			ЭлементКоллекции.Количество = ЭлементКоллекции.КоличествоПрослеживаемости;
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	// 3. Требуется произвести пропорциональное распределение
	СведенияПрослеживаемости.Колонки.Добавить("Порядок");
	
	Порядок = 0;
	Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
		Порядок = Порядок + 1;
		ЭлементКоллекции.Порядок = Порядок;
	КонецЦикла;
	
	СведенияПрослеживаемости.Сортировать("КоличествоПрослеживаемости");
	Распределено = 0;
	Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
		Если СведенияПрослеживаемости.Индекс(ЭлементКоллекции) + 1 = СведенияПрослеживаемости.Количество() Тогда
			ЭлементКоллекции.Количество = КоличествоТовара - Распределено;
		Иначе 
			ЭлементКоллекции.Количество = ?(ВсегоКоличествоПрослеживаемости = 0, 0,
				ЭлементКоллекции.КоличествоПрослеживаемости * КоличествоТовара / ВсегоКоличествоПрослеживаемости);
			Распределено = Распределено + ЭлементКоллекции.Количество;
		КонецЕсли;
	КонецЦикла;
	
	СведенияПрослеживаемости.Сортировать("Порядок");
		
КонецПроцедуры

// Обновляет ИдентификаторСтроки в ДанныеДокумента и ДанныеДокумента.СведенияПрослеживаемости
// Для корректной связи при перезаполнение ИдентификаторСтроки по дпнным исходной строки корректировки
//
// Параметры
//  ДанныеДокумента			- Структура		- строка ДанныеЗаполнения.Товары
//  СтарыйИДСтроки			- Строка		- старый ИдентификаторСтроки
//  НовыйИДСтроки 			- Строка	 	- новый ИдентификаторСтроки
//
Процедура ОбновитьИдентификаторыСтрокПрослеживаемости(ДанныеДокумента, СтарыйИДСтроки, НовыйИДСтроки)
	
	Если СтарыйИДСтроки <> НовыйИДСтроки Тогда
	
		Если ДанныеДокумента.Свойство("СведенияПрослеживаемости")
			И ДанныеДокумента.СведенияПрослеживаемости <> Неопределено Тогда
			
			Отбор = Новый Структура("ИдентификаторСтроки", СтарыйИДСтроки);
			
			СтрокиСоСтарымИД = ДанныеДокумента.СведенияПрослеживаемости.НайтиСтроки(Отбор);
			Для каждого СтрокаСоСтарымИД Из СтрокиСоСтарымИД Цикл
				СтрокаСоСтарымИД.ИдентификаторСтроки = НовыйИДСтроки;
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Функция ВТабличнойЧастиЭДЕстьСведенияПрослеживаемости(СтрокаТЧ)
	
	Результат = СтрокаТЧ.СведенияОПрослеживаемости <> Неопределено
				И СтрокаТЧ.СведенияОПрослеживаемости.Количество() > 0;
				
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПараметрыИНастройкиИнформационнойБазы

Функция МенеджерИнтеграции_ОписанияПодсистемКонфигурации()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОписанияПодсистемКонфигурации");
	Возврат Результат;
	
КонецФункции

// Возвращает версию подсистемы УНФ
//
// Возвращаемое значение:
//  Строка - Версия конфигурации (подсистемы) в формате "x.x.x.x"
//
Функция ВерсияПодсистемыУНФ()
	
	Результат = "0.0.0.0";
	
	ВозможныеИменаПодсистем = Новый Массив;
	ВозможныеИменаПодсистем.Добавить("УправлениеНебольшойФирмой");
	ВозможныеИменаПодсистем.Добавить("УправлениеНебольшойФирмойБазовая");
	ВозможныеИменаПодсистем.Добавить("ПОЛИГРАФИЯ"); // отраслевое решение на базе УНФ
	ВозможныеИменаПодсистем.Добавить("УправлениеСервиснымЦентром"); // отраслевое решение на базе УНФ
	
	ПодсистемыКонфигурации = МенеджерИнтеграции_ОписанияПодсистемКонфигурации();
	
	Для Каждого ИмяПодсистемы Из ВозможныеИменаПодсистем Цикл
		
		ПодсистемаУНФ = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
		Если ПодсистемаУНФ <> Неопределено Тогда
			Результат = ПодсистемаУНФ.Версия;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат = "0.0.0.0" Тогда
		ВерсияРозницы = "0.0.0.0";
		ВерсияРозницы = ВерсияПодсистемыРозница();
		Если СравнитьВерсии(ВерсияРозницы, "3.0") >= 0 Тогда
			Результат = ВерсияРозницы;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияПодсистемыРозница()
	
	Результат = "0.0.0.0";
	
	ВозможныеИменаПодсистем = Новый Массив;
	ВозможныеИменаПодсистем.Добавить("Розница");
	ВозможныеИменаПодсистем.Добавить("РозницаБазовая");
	ВозможныеИменаПодсистем.Добавить("РозницаМагазинОдеждыИОбуви"); // отраслевое решение на базе Розница 3.0
	
	ПодсистемыКонфигурации = МенеджерИнтеграции_ОписанияПодсистемКонфигурации();
	
	Для Каждого ИмяПодсистемы Из ВозможныеИменаПодсистем Цикл
		
		ПодсистемаРозница = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
		Если ПодсистемаРозница <> Неопределено Тогда
			Результат = ПодсистемаРозница.Версия;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Определяет, где заполняется информация о документе-основании счета-фактуры:
// в шапке или в табличной части. Табличная часть для указания оснований
// появилась в версии УНФ 1.6.18.
// 
// Возвращаемое значение:
//  Булево - Истина, если основание указывается в ТЧ.
//
Функция ОснованиеСчетаФактурыУказываетсяВТабличнойЧасти()
	
	Результат = Ложь;
	
	Если СравнитьВерсии(ВерсияПодсистемыУНФ(), "1.6.18") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяКорректировкаСчетаФактурыНаАванс()
	
	Результат = Истина; // TODO: Добавить проверку на версию конфигурации
	
	Возврат Результат;
	
КонецФункции

Функция ИспользоватьКорректировкиПоступлений()
	
	Результат = ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиПоступлений");
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяНоменклатураКонтрагентовБЭД()
	
	Результат = Ложь;
	
	ВерсияУНФ = ВерсияПодсистемыУНФ();
	
	Если СравнитьВерсии(ВерсияУНФ, "1.6.18") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьШтрихкодыУпаковок(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ЕстьМетаданныеСведенияПрослеживаемости(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("СведенияПрослеживаемости") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяПодсистема_1_6_26()

	Результат = Ложь;
	
	ВерсияУНФ = ВерсияПодсистемыУНФ();
	
	Если СравнитьВерсии(ВерсияУНФ, "1.6.26") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяСверкаВзаиморасчетов3_0_2()
	
	Результат = Ложь;
	
	ВерсияПодсистемыБП = ВерсияПодсистемыУНФ();
	
	Если СравнитьВерсии(ВерсияПодсистемыБП, "3.0.2") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прослеживаемость_Отправка

Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(ТаблицаТоваров, СсылкаНаОбъект)
	
	Если НЕ ИспользуетсяУчетПрослеживаемыхТоваров()
		ИЛИ НЕ МожноЗаполнитьПрослеживаемость(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТоваров.Колонки.Добавить("ДанныеПрослеживаемости");
	ТаблицаТоваров.Колонки.Добавить("ПрослеживаемыйТовар");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТТаблицаПрослеживаемостиОснования
	|ИЗ
	|	&ИмяМетаданныхТаблицыПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка
	|	И СведенияПрослеживаемости.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|	И &ДопУсловиеТаблицыПрослеживаемости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Ссылка, &ПустойНомерГТД) = &ПустойНомерГТД
	|			ТОГДА """"
	|		ИНАЧЕ НомераГТД.Код
	|	КОНЕЦ КАК НомерГТДРегистрационныйНомер,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПоРНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТСведенияПрослеживаемостиБезИЕ
	|ИЗ
	|	&ИмяМетаданныхТаблицыТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаПрослеживаемостиОснования КАК СведенияПрослеживаемости
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|			ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
	|		ПО ТаблицаТоваров.Ссылка = СведенияПрослеживаемости.Ссылка
	|			И ТаблицаТоваров.ИдентификаторСтроки = СведенияПрослеживаемости.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|	И ТаблицаТоваров.ИдентификаторСтроки <> """"
	|	И ТаблицаТоваров.ПрослеживаемыйТовар = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерГТДРегистрационныйНомер КАК НомерГТДРегистрационныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, &ПустаяЕИ) = &ПустаяЕИ
	|			ТОГДА """"
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияПрослеживаемости,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, &ПустаяЕИ) = &ПустаяЕИ
	|			ТОГДА """"
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Код
	|	КОНЕЦ КАК КодЕдиницыИзмеренияПрослеживаемости,
	|	ТаблицаТоваров.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТСведенияПрослеживаемости
	|ИЗ
	|	ВТСведенияПрослеживаемостиБезИЕ КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|				ПО КлассификаторТНВЭД.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|			ПО СправочникНоменклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО ТаблицаТоваров.Номенклатура = СправочникНоменклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСведенияПрослеживаемости.НомерГТДРегистрационныйНомер КАК НомерГТДРегистрационныйНомер,
	|	ВТСведенияПрослеживаемости.ЕдиницаИзмеренияПрослеживаемости КАК ЕдиницаИзмеренияПрослеживаемости,
	|	ВТСведенияПрослеживаемости.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ВТСведенияПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости КАК КодЕдиницыИзмеренияПрослеживаемости,
	|	ВТСведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТСведенияПрослеживаемости КАК ВТСведенияПрослеживаемости";
	
	ИмяДокумента = СсылкаНаОбъект.Метаданные().Имя;
	ИмяМетаданныхТаблицыТоваров = СтрЗаменить("Документ.%ИмяДокумента%.Запасы", "%ИмяДокумента%", ИмяДокумента);
	ИмяМетаданныхТаблицыПрослеживаемости = СтрЗаменить("Документ.%ИмяДокумента%.СведенияПрослеживаемости", "%ИмяДокумента%", ИмяДокумента);
	
	ДопУсловиеТаблицыПрослеживаемости = "Истина";
	Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ." + ИмяДокумента + ".ТабличнаяЧасть.СведенияПрослеживаемости.Реквизит.ЭтоСтрокаСИсходнымиРНПТ") Тогда
		ДопУсловиеТаблицыПрослеживаемости = ДопУсловиеТаблицыПрослеживаемости + " И СведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ = Ложь"; 	
	КонецЕсли;	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловиеТаблицыПрослеживаемости"		, ДопУсловиеТаблицыПрослеживаемости);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхТаблицыТоваров"				, ИмяМетаданныхТаблицыТоваров);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхТаблицыПрослеживаемости"	, ИмяМетаданныхТаблицыПрослеживаемости);
	
	СтрокиТоваров		 = ТаблицаТоваров.НайтиСтроки(Новый Структура("ИмяТабличнойЧасти, ЭтоУслуга", "Запасы", Ложь)); 
	ИдентификаторыСтрок	 = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиТоваров, "ИдентификаторСтроки");
	
	Запрос.УстановитьПараметр("ПустаяЕИ"			 , Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойНомерГТД"		 , Справочники.НомераГТД.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка"				 , СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИдентификаторыСтрок"	 , ИдентификаторыСтрок);
	
	СведенияПрослеживаемости = Запрос.Выполнить().Выгрузить();
	СведенияПрослеживаемости.Индексы.Добавить("ИдентификаторСтроки");
	
	Для Каждого СтрокаТЧ Из СтрокиТоваров Цикл
		
		СтрокиПрослеживаемости = СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки));
		
		Если СтрокиПрослеживаемости.Количество() > 0 Тогда
			
			СтрокаТЧ.ДанныеПрослеживаемости	 = Новый Массив;
			СтрокаТЧ.ПрослеживаемыйТовар	 = Истина;
			
			Для каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
				
				ЭлементПрослеживаемости = НовыеСвойстваЭлементаПрослеживаемости();
				ЗаполнитьЗначенияСвойств(ЭлементПрослеживаемости, СтрокаПрослеживаемости);
				СтрокаТЧ.ДанныеПрослеживаемости.Добавить(ЭлементПрослеживаемости);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизит ДанныеПрослеживаемости и ПрослеживаемыйТовар в ТаблицеТоваров
//
// Параметры
//  ТаблицаТоваров	- ТаблицаЗначений	 	- см. ИнициализацияТаблицыСтрокТовары()
//  СведенияОПрослеживаемости	- ТаблицаЗначений	
//  СсылкаНаОбъект	- ДоументСсылка	 		- ссылка документ
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(ТаблицаТоваров, СсылкаНаОбъект)
	
	Если НЕ ИспользуетсяУчетПрослеживаемыхТоваров()
		ИЛИ НЕ МожноЗаполнитьПрослеживаемость(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТоваров.Колонки.Добавить("ДанныеПрослеживаемости");
	ТаблицаТоваров.Колонки.Добавить("ПрослеживаемыйТовар");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СУММА(СведенияПрослеживаемости.Количество) КАК Количество,
	|	СУММА(СведенияПрослеживаемости.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.Ссылка.ДокументОснование КАК ДокументОснование,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка
	|	И СведенияПрослеживаемости.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияПрослеживаемости.РНПТ,
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.ИдентификаторСтроки,
	|	СведенияПрослеживаемости.Ссылка.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СУММА(СведенияПрослеживаемости.Количество) КАК Количество,
	|	СУММА(СведенияПрослеживаемости.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ДанныеОснований
	|ИЗ
	|	Документ.РасходнаяНакладная.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.РНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.РНПТ,
	|	СУММА(СведенияПрослеживаемости.Количество),
	|	СУММА(СведенияПрослеживаемости.КоличествоПрослеживаемости),
	|	СведенияПрослеживаемости.ИдентификаторСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияПрослеживаемости.Ссылка,
	|	СведенияПрослеживаемости.РНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаДокумента.РНПТ, ДанныеОснований.РНПТ) КАК НомерГТДРегистрационныйНомер,
	|	ЕСТЬNULL(ТаблицаДокумента.Количество, 0) КАК КоличествоПослеИзменения,
	|	ЕСТЬNULL(ДанныеОснований.Количество, 0) КАК КоличествоДоИзменения,
	|	ЕСТЬNULL(ТаблицаДокумента.ИдентификаторСтроки, ДанныеОснований.ИдентификаторСтроки) КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеОснований КАК ДанныеОснований
	|		ПО ТаблицаДокумента.РНПТ = ДанныеОснований.РНПТ
	|			И ТаблицаДокумента.ДокументОснование = ДанныеОснований.Ссылка
	|			И ТаблицаДокумента.ИдентификаторСтроки = ДанныеОснований.ИдентификаторСтроки
	|ИТОГИ
	|	СУММА(КоличествоПослеИзменения),
	|	СУММА(КоличествоДоИзменения)
	|ПО
	|	ИдентификаторСтроки,
	|	НомерГТДРегистрационныйНомер";
	
	ИдентификаторыСтрок	 = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаТоваров, "ИдентификаторСтроки");
	Запрос.УстановитьПараметр("Ссылка"				 , СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИдентификаторыСтрок"	 , ИдентификаторыСтрок);
	Запрос.УстановитьПараметр("ДокументОснование"	 , СсылкаНаОбъект.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИдентификаторСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификаторСтроки.Следующий() Цикл
		
		СтрокаТовара = ТаблицаТоваров.Найти(ВыборкаИдентификаторСтроки.ИдентификаторСтроки, "ИдентификаторСтроки");
		
		Если СтрокаТовара = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовара.ДанныеПрослеживаемости		 = Новый Массив;
		СтрокаТовара.ПрослеживаемыйТовар		 = Истина;
		
		ВыборкаРегистрационныйНомер = ВыборкаИдентификаторСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРегистрационныйНомер.Следующий() Цикл
			
			СтрокаПрослеживаемости = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке");
			ЗаполнитьЗначенияСвойств(СтрокаПрослеживаемости, ВыборкаРегистрационныйНомер);
			СтрокаПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости = СтрокаТовара.ЕдиницаИзмеренияКод;
			
			ЭтоУменьшение = СтрокаПрослеживаемости.КоличествоДоИзменения > СтрокаПрослеживаемости.КоличествоПослеИзменения; 
			Если ЭтоУменьшение Тогда
				КоличествоУменьшение = СтрокаПрослеживаемости.КоличествоДоИзменения - СтрокаПрослеживаемости.КоличествоПослеИзменения;
				СтрокаПрослеживаемости.КоличествоУменьшение = КоличествоУменьшение;
			КонецЕсли; 
			
			ЭтоУвеличение = СтрокаПрослеживаемости.КоличествоПослеИзменения > СтрокаПрослеживаемости.КоличествоДоИзменения;
			Если ЭтоУвеличение Тогда
				КоличествоУвеличение = СтрокаПрослеживаемости.КоличествоПослеИзменения - СтрокаПрослеживаемости.КоличествоДоИзменения;
				СтрокаПрослеживаемости.КоличествоУвеличение = КоличествоУвеличение;
			КонецЕсли; 
			
			СтрокаТовара.ДанныеПрослеживаемости.Добавить(СтрокаПрослеживаемости);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция МожноЗаполнитьПрослеживаемость(СсылкаНаОбъект)
	
	Результат = ЭтоНакладная(СсылкаНаОбъект) ИЛИ ЭтоКорректировкаРеализации(СсылкаНаОбъект);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПодготовкаСпискаИсходящихДокументов

Функция ПодготовитьВТДляСпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц= Новый Массив;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" ИЛИ ТипыДокументов = "2" ИЛИ ТипыДокументов = "5" ИЛИ ТипыДокументов = "6" Тогда
		ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
		ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
		ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" Тогда
		ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "2" Тогда
		ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "3" Тогда
		ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "4" Тогда
		ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Возврат МассивВременныхТаблиц;
	
КонецФункции

Процедура ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_Накладные_РасходнаяНакладная(Запрос, МассивВременныхТаблиц);
	Если НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено Тогда
		ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	ПодготовитьВТ_Накладные_ВозвратПоставщику(Запрос, МассивВременныхТаблиц);
	//ПодготовитьВТ_Накладные_ОтчетКомитенту(Запрос, МассивВременныхТаблиц); //закрыт до реализации агентской схемы в УФ
	ПодготовитьВТ_Накладные_АктВыполненныхРабот(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_ОтчетОПереработке(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РасходнаяНакладная(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.Заказ КАК Заказ,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)))
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТЧ.ТипНоменклатурыЗапас
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьТовары,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТЧ.ТипНоменклатурыЗапас
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьУслуги,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Заказ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_РасходнаяНакладная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ
	|	И НЕ ВТ_Основная.Заказ В (&ПустыеЗначенияЗаказ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.ДокументОснование
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И НЕ ВТ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""РасходнаяНакладная"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РасходнаяНакладная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И (ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) = 0
	|					ИЛИ ВТ_Основная.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ТипыНоменклатурыУслуги"			, ТипыНоменклатурыУслуги());
	Запрос.УстановитьПараметр("ПустыеЗначенияЗаказ"				, ПустыеЗначенияРеквизита("Документ.РасходнаяНакладная.Реквизит.Заказ"));
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование"	, ПустыеЗначенияРеквизита("Документ.РасходнаяНакладная.Реквизит.ДокументОснование"));
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияЗаказ");
	Запрос.Параметры.Удалить("ТипыНоменклатурыУслуги");
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснование");
	
	МассивВременныхТаблиц.Добавить("Накладные_РасходнаяНакладная");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_РасходнаяНакладная");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	&ЭтоИсправление КАК ЭтоИсправление,
	|	&ЭтоКорректировка КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС_ДокументыОснования КАК УКД_КСЧФДИС_ДокументыОснования
	|		ПО Документ.Ссылка = УКД_КСЧФДИС_ДокументыОснования.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УКД_КСЧФДИС_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТЧ.ТипНоменклатурыЗапас
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьТовары,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТЧ.ТипНоменклатурыЗапас
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьУслуги,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВТ_Основная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_СоглашениеОбИзмененииСтоимости
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""КорректировкаРеализации"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсправление", ТекстЗапроса_КРТУ_ЭтоИсправление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКорректировка", ТекстЗапроса_КРТУ_ЭтоКорректировка());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_КорректировкаРеализации");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_КорректировкаРеализации");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ВозвратПоставщику(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику))
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТЧ.ТипНоменклатурыЗапас
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьТовары,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТЧ.ТипНоменклатурыЗапас
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьУслуги,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_ВозвратПоставщику
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.ДокументОснование
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_ТоварнаяНакладная КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""ВозвратТоваровПоставщику"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_ВозвратПоставщику
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ВозвратПоставщику");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_ВозвратПоставщику");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ОтчетКомитенту(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.ОтчетКомитенту КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (Документ.СуммаДокумента <> 0 ИЛИ Документ.УдержатьКомиссионноеВознаграждение)
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	ИСТИНА КАК ЕстьУслуги,
	|	СУММА(ТЧ.СуммаНДСВознаграждения) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктОбОказанииУслуг КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""ОтчетКомитентуОПродажах"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_ОтчетКомитенту
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ОтчетКомитенту");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_АктВыполненныхРабот(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	ИСТИНА КАК ЕстьУслуги,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.РаботыИУслуги КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.ЗаказПокупателя КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_АктВыполненныхРабот
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ
	|	И НЕ ВТ_Основная.ЗаказПокупателя В (&ПустыеЗначенияЗаказПокупателя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.ДокументОснование
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И НЕ ВТ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктОбОказанииУслуг КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""АктВыполненныхРабот"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_АктВыполненныхРабот
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.УстановитьПараметр("ПустыеЗначенияЗаказПокупателя"	, ПустыеЗначенияРеквизита("Документ.АктВыполненныхРабот.Реквизит.ЗаказПокупателя"));
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование"	, ПустыеЗначенияРеквизита("Документ.АктВыполненныхРабот.Реквизит.ДокументОснование"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияЗаказПокупателя");
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснование");
	
	МассивВременныхТаблиц.Добавить("Накладные_АктВыполненныхРабот");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_АктВыполненныхРабот");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ОтчетОПереработке(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.ЗаказПокупателя КАК Заказ,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.ОтчетОПереработке КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	ИСТИНА КАК ЕстьТовары,
	|	ЛОЖЬ КАК ЕстьУслуги,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОПереработке.Продукция КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Заказ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_ОтчетОПереработке
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ
	|	И НЕ ВТ_Основная.Заказ В (&ПустыеЗначенияЗаказ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_ТоварнаяНакладная КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""ОтчетОПереработке"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_ОтчетОПереработке
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияЗаказ", ПустыеЗначенияРеквизита("Документ.ОтчетОПереработке.Реквизит.ЗаказПокупателя"));
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияЗаказ");
	
	МассивВременныхТаблиц.Добавить("Накладные_ОтчетОПереработке");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_ОтчетОПереработке");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Документ.Ссылка 			КАК Документ,
	|	&ЭтоКорректировка КАК ЭтоКорректировка,
	|	&ЭтоИсправление КАК ЭтоИсправление,
	|	&ЭтоАванс КАК ЭтоАванс,
	|	Документ.Организация 		КАК Организация,
	|	Документ.Контрагент 		КАК Контрагент,
	|	&СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента 	КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") 	КАК ID,
	|	"""" 						КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен 			КАК Проведен,
	|	Документ.Дата 				КАК Дата,
	|	Документ.Номер 				КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетФактура КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|ГДЕ
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_Основная.*,
	|	ДокументыОснования.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ДокументОснованиеID
	|ПОМЕСТИТЬ ДанныеДокументаИДокументыОснования
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК ДокументыОснования
	|		ПО ВТ_Основная.Документ = ДокументыОснования.Ссылка
	|			И ДокументыОснования.ДокументОснование <> НЕОПРЕДЕЛЕНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (ДокументыОснования.ДокументОснование = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	""СчетФактураВыданный"" КАК Тип
	|ПОМЕСТИТЬ СуммыДокОснованийЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокументаИДокументыОснования.Документ КАК Документ,
	|		Запасы.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ДанныеДокументаИДокументыОснования КАК ДанныеДокументаИДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК Запасы
	|			ПО ДанныеДокументаИДокументыОснования.ДокументОснование = Запасы.Ссылка
	|";
	
	Если НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + РазделительОбъединенияЗапросов() +
		"	ВЫБРАТЬ
		|		ДанныеДокументаИДокументыОснования.Документ КАК Документ,
		|		Запасы.СуммаНДС КАК СуммаНДС
		|	ИЗ
		|		ДанныеДокументаИДокументыОснования КАК ДанныеДокументаИДокументыОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Запасы КАК Запасы
		|			ПО ДанныеДокументаИДокументыОснования.ДокументОснование = Запасы.Ссылка";
		
	КонецЕсли;
	
	Если НЕ Метаданные.Документы.Найти("ОтчетОПереработке") = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + РазделительОбъединенияЗапросов() +
		"	ВЫБРАТЬ
		|		ДанныеДокументаИДокументыОснования.Документ КАК Документ,
		|		Запасы.СуммаНДС КАК СуммаНДС
		|	ИЗ
		|		ДанныеДокументаИДокументыОснования КАК ДанныеДокументаИДокументыОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОПереработке.Продукция КАК Запасы
		|			ПО ДанныеДокументаИДокументыОснования.ДокументОснование = Запасы.Ссылка";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + РазделительОбъединенияЗапросов() +
	"	ВЫБРАТЬ
	|		ДанныеДокументаИДокументыОснования.Документ КАК Документ,
	|		РаботыИУслуги.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ДанныеДокументаИДокументыОснования КАК ДанныеДокументаИДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.РаботыИУслуги КАК РаботыИУслуги
	|			ПО ДанныеДокументаИДокументыОснования.ДокументОснование = РаботыИУслуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ДанныеДокументаИДокументыОснования.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ДанныеДокументаИДокументыОснования.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	ДанныеДокументаИДокументыОснования.ЭтоИсправление КАК ЭтоИсправление,
	|	ДанныеДокументаИДокументыОснования.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ДанныеДокументаИДокументыОснования.ЭтоАванс КАК ЭтоАванс,
	|	ДанныеДокументаИДокументыОснования.Организация КАК Организация,
	|	ДанныеДокументаИДокументыОснования.Контрагент КАК Контрагент,
	|	ДанныеДокументаИДокументыОснования.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ДанныеДокументаИДокументыОснования.Валюта КАК Валюта,
	|	ДанныеДокументаИДокументыОснования.ID КАК ID_,
	|	ДанныеДокументаИДокументыОснования.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ДанныеДокументаИДокументыОснования.Проведен КАК Проведен,
	|	ДанныеДокументаИДокументыОснования.Дата КАК Дата,
	|	ДанныеДокументаИДокументыОснования.Номер КАК Номер,
	|	ЕСТЬNULL(СуммыДокОснованийЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""СчетФактураВыданный"" КАК Тип,
	|	ДанныеДокументаИДокументыОснования.ФормироватьУПД КАК ФормироватьУПД,
	|	ДанныеДокументаИДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ДанныеДокументаИДокументыОснования.ДокументОснованиеID КАК ДокументОснованиеID,
	|	ДанныеДокументаИДокументыОснования.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	ДанныеДокументаИДокументыОснования КАК ДанныеДокументаИДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыДокОснованийЗначение КАК СуммыДокОснованийЗначение
	|		ПО ДанныеДокументаИДокументыОснования.Документ = СуммыДокОснованийЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДокументаИДокументыОснования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммыДокОснованийЗначение";
	
	// До какой-то версии в реквизите "СуммаДокумента" была сумма с НДС.
	// Позднее был добавлен реквизит "СуммаНДСДокумента", а из суммы документа исключили сумму НДС.
	ВыражениеСумма = "Документ.СуммаДокумента + Документ.СуммаНДСДокумента";
	Если Не МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.Реквизит.СуммаНДСДокумента") Тогда 
		ВыражениеСумма = "Документ.СуммаДокумента";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДокумента", ВыражениеСумма);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоАванс", ТекстЗапроса_СчетФактура_ЭтоАванс());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсправление", ТекстЗапроса_СчетФактура_ЭтоИсправление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКорректировка", ТекстЗапроса_СчетФактура_ЭтоКорректировка());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	ПодготовитьВТ_Связь_СчетаФактуры(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Связь_СчетаФактуры(Запрос, МассивВременныхТаблиц)
	
	Разделитель					 = РазделительОбъединенияЗапросов(Истина);
	ЕстьОтчетОПереработке		 = СуществуетОбъектМетаданных("Документ.ОтчетОПереработке");
	ЕстьКорректировкаРеализации	 = СуществуетОбъектМетаданных("Документ.КорректировкаРеализации");
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	СчетНаОплату.Ссылка КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетаФактуры
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату КАК СчетНаОплату
	|		ПО СЧФ_Основная.ДокументОснование = СчетНаОплату.ДокументОснование
	|ГДЕ
	|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И НЕ СЧФ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснованиеСЧФ)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СЧФ_Основная.Документ,
	|	РасходнаяНакладная.ДокументОснование
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО СЧФ_Основная.ДокументОснование = РасходнаяНакладная.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.ДокументОснование
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	НЕ СЧФ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснованиеСЧФ)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СЧФ_Основная.Документ,
	|	РасходнаяНакладная.Заказ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО СЧФ_Основная.ДокументОснование = РасходнаяНакладная.Ссылка
	|ГДЕ
	|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СЧФ_Основная.Документ,
	|	АктВыполненныхРабот.ЗаказПокупателя
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ПО СЧФ_Основная.ДокументОснование = АктВыполненныхРабот.Ссылка
	|ГДЕ
	|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ";
	
	Если ЕстьКорректировкаРеализации Тогда
		
		ТекстЗапроса = ТекстЗапроса + Разделитель +
		
		"ВЫБРАТЬ
		|	СЧФ_Основная.Документ КАК Документ,
		|	КорректировкаРеализации.Заказ КАК Заказ
		|ИЗ
		|	СЧФ_Основная КАК СЧФ_Основная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|		ПО СЧФ_Основная.ДокументОснование = КорректировкаРеализации.Ссылка
		|ГДЕ
		|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ";
		
	КонецЕсли;
	
	Если ЕстьОтчетОПереработке Тогда
		
		ТекстЗапроса = ТекстЗапроса + Разделитель +
		
		"ВЫБРАТЬ
		|	СЧФ_Основная.Документ КАК Документ,
		|	ОтчетОПереработке.ЗаказПокупателя КАК ЗаказПокупателя
		|ИЗ
		|	СЧФ_Основная КАК СЧФ_Основная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОПереработке КАК ОтчетОПереработке
		|		ПО СЧФ_Основная.ДокументОснование = ОтчетОПереработке.Ссылка
		|ГДЕ
		|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснованиеСЧФ", ПустыеЗначенияРеквизита(
	"Документ.СчетФактура.ТабличнаяЧасть.ДокументыОснования.Реквизит.ДокументОснование"));
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснованиеСЧФ");
	
	МассивВременныхТаблиц.Добавить("Связь_СчетаФактуры");
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|	И НЕ СЧФ_Основная.ЭтоКорректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID_ = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетФактура КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоАванс
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_СЧФДОП
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УПД_СЧФДОП
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|ГДЕ
	|	НЕ СЧФ_Основная.ЭтоАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ УПД_СЧФДОП_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "5" Тогда
		МассивВременныхТаблиц.Добавить("УПД_СЧФДОП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|	И СЧФ_Основная.ЭтоКорректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID_ = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	&ВидыЭД_КорректировочныйСчетФактура КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	&ФункцияЭД_КСЧФДИС КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УКД_КСЧФДИС
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ УКД_КСЧФДИС_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "6" Тогда
		МассивВременныхТаблиц.Добавить("УКД_КСЧФДИС");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|				И СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ФункцияЭД_КСЧФ
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ СчетФактураВыданный
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО СЧФ_Основная.Документ = УПД_СЧФДОП.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС КАК УКД_КСЧФДИС
	|		ПО СЧФ_Основная.Документ = УКД_КСЧФДИС.Документ
	|ГДЕ
	|	УПД_СЧФДОП.Документ ЕСТЬ NULL
	|	И УКД_КСЧФДИС.Документ ЕСТЬ NULL";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетФактураВыданный");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_СчетНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетНаОплату_РасходнаяНакладная(Запрос, МассивВременныхТаблиц);
	Если НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено Тогда
		ПодготовитьВТ_СчетНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	ПодготовитьВТ_СчетНаОплату_АктВыполненныхРабот(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетНаОплату_ЗаказПокупателя(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетНаОплату_ОтчетОПереработке(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетНаОплату КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_СчетНаОплатуПокупателю
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_СчетНаОплатуПокупателю
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование", ПустыеЗначенияРеквизита("Документ.СчетНаОплату.Реквизит.ДокументОснование"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснование");
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_СчетНаОплатуПокупателю");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_СчетНаОплатуПокупателю");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_РасходнаяНакладная(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_ДокументПродажи
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_РасходнаяНакладная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_РасходнаяНакладная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_РасходнаяНакладная");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_РасходнаяНакладная");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	&ЭтоИсправление КАК ЭтоИсправление,
	|	&ЭтоКорректировка КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_ДокументПродажи
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсправление", ТекстЗапроса_КРТУ_ЭтоИсправление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКорректировка", ТекстЗапроса_КРТУ_ЭтоКорректировка());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_КорректировкаРеализации");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_КорректировкаРеализации");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_АктВыполненныхРабот(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_ДокументПродажи
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.РаботыИУслуги КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_АктВыполненныхРабот
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_АктВыполненныхРабот
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_АктВыполненныхРабот");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_АктВыполненныхРабот");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_ОтчетОПереработке(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.ОтчетОПереработке КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_ДокументПродажи
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОПереработке.Продукция КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_ОтчетОПереработке
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_ОтчетОПереработке
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_ОтчетОПереработке");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_ОтчетОПереработке");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_ЗаказПокупателя(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_Заказ
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Запасы КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_ЗаказПокупателя
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_ЗаказПокупателя
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_ЗаказПокупателя");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_ЗаказПокупателя");
	
КонецПроцедуры

Процедура ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	0 КАК СуммаДокументаЗначение,
	|	&ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СверкаВзаиморасчетов КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|ГДЕ
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктСверки КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""АктСверкиВзаиморасчетов"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ АктСверкиВзаиморасчетов
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВалютаДокумента", ТекстЗапроса_СверкаВзаиморасчетов_ВалютаДокумента());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("АктСверкиВзаиморасчетов");
	
КонецПроцедуры

Функция ТекстЗапросаВременнаяТаблица_ЕстьСЧФ()
	
	Результат =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|ГДЕ
	|	СЧФ.Ссылка ЕСТЬ НЕ NULL 
	|	И НЕ СЧФ.ПометкаУдаления
	|	И (СЧФ.Проведен
	|			ИЛИ ВТ_Основная.ОтправлятьНепроведенные = ИСТИНА)";
	
	Возврат Результат;
	
КонецФункции

Функция ТипыНоменклатурыУслуги()
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	Результат.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ФункцияПервичногоДокумента(ПсевдонимТаблицы = "ВТ_Основная")
	
	Результат = 
	"	ВЫБОР
	|		КОГДА ПсевдонимТаблицы.ЭтоКорректировка
	|				И ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДИС
	|		КОГДА ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДОП
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КРТУ_ЭтоИсправление(ПсевдонимТаблицы = "Документ")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ИсправлениеОшибки)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КРТУ_ЭтоКорректировка(ПсевдонимТаблицы = "Документ")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.СогласованноеИзменение)
	|		ИЛИ ПсевдонимТаблицы.ИсправляемыйДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоАванс(ПсевдонимТаблицы = "Документ")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.Аванс)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоИсправление(ПсевдонимТаблицы = "Документ")
	
	Результат = "ПсевдонимТаблицы.Исправление";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимТаблицы = "Документ")
	
	ВидыКСФ = Новый Массив;
	ВидыКСФ.Добавить("ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.Корректировка)");
	Если ИспользуетсяКорректировкаСчетаФактурыНаАванс() Тогда
		ВидыКСФ.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактура.КорректировкаАванса)");
	КонецЕсли;
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозяйственнаяОперация В (&ВидыКСФ)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидыКСФ", СтрСоединить(ВидыКСФ, ","));
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СверкаВзаиморасчетов_ВалютаДокумента()
	
	МетаданныеОбъекта = Метаданные.Документы.СверкаВзаиморасчетов;
	
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ВалютаДокумента") Тогда
		Результат = "Документ.ВалютаДокумента";
	Иначе
		Результат = "Документ.Договор.ВалютаРасчетов";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы)
	
	ПодстрокаПоиска = "ПсевдонимТаблицы";
	Если Не ЗначениеЗаполнено(ПсевдонимТаблицы) Тогда
		ПодстрокаПоиска = ПодстрокаПоиска + ".";
	КонецЕсли;
	
	Выражение = СтрЗаменить(Выражение, ПодстрокаПоиска, ПсевдонимТаблицы);
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного() Экспорт
	
	Результат =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокОснований.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК СписокОснований
	|ГДЕ
	|	СписокОснований.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//{ СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОтрезатьПравуюЗапятую(стр)
	
	Результат = СокрЛП(стр);
	
	Пока СтрЗаканчиваетсяНа(Результат, ",") Цикл
		Результат = Лев(Результат, СтрДлина(Результат) - 1);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьРазделитель(Стр, Префикс = "")
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Стр) Тогда
		Результат = Префикс + СокрЛП(Стр) + ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКСФ(СсылкаНаОбъект) Экспорт
	
	Если НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено
		И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактура") Тогда
		
		Возврат СсылкаНаОбъект.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Корректировка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоИсправление(СсылкаНаОбъект) Экспорт
	
	Возврат НЕ СчетФактураНаАванс(СсылкаНаОбъект) И СсылкаНаОбъект.Исправление;
	
КонецФункции	

Функция ЭтоНакладная(СсылкаНаОбъект) Экспорт
	
	Возврат ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РасходнаяНакладная");
	
КонецФункции	

Функция ЭтоСчетНаОплату(СсылкаНаОбъект) Экспорт
	
	Возврат (НЕ Метаданные.Документы.Найти("СчетНаОплату") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетНаОплату"));
КонецФункции

Функция ЭтоЗаказПокупателя(СсылкаНаОбъект) Экспорт
	
	Возврат (НЕ Метаданные.Документы.Найти("ЗаказПокупателя") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказПокупателя"));
			  
КонецФункции

Функция ЭтоКорректировкаРеализации(СсылкаНаОбъект) Экспорт
	
	Возврат (НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации"));
	
КонецФункции

Функция СчетФактуранаАванс(СФ) Экспорт
	
	Если ТипЗнч(СФ) = Тип("ДокументСсылка.СчетФактура") Тогда
		Возврат СФ.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

Функция ЭтоВозвратТоваровОтКлиента(СсылкаНаОбъект) Экспорт
	
	Возврат (НЕ Метаданные.Документы.Найти("ПриходнаяНакладная") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПриходнаяНакладная")
			  И СсылкаНаОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя"));
	
КонецФункции

Функция ЭтоВыбытиеИзОборотаМаркируемойПродукции(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ТаблицаЗначений_2_МассивСтруктур(ТаблЗнач)
	
	Результат = Новый Массив;
	СтрокаКлючей = "";
	Для Каждого Колонка Из ТаблЗнач.Колонки Цикл
		СтрокаКлючей = СтрокаКлючей + ?(ПустаяСтрока(СтрокаКлючей), "", ",") + Колонка.Имя;
	КонецЦикла;
	
	Если ТипЗнч(ТаблЗнач) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого Стр Из ТаблЗнач Цикл
			ЭлементСписка = Новый Структура(СтрокаКлючей);
			ЗаполнитьЗначенияСвойств(ЭлементСписка, Стр);
			Результат.Добавить(ЭлементСписка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция СократитьПредставлениеТелефона(телефонСтрока)
	
	Если (СтрДлина(телефонСтрока) <= 20) Или (Найти(ТелефонСтрока, ";") = 0) Тогда
		//резать нечего
		Возврат ТелефонСтрока;
	КонецЕсли;	
	
	НовыйТелефон = "";
	СтарыйТелефон = ТелефонСтрока;
	Пока Найти(СтарыйТелефон, ";") > 0 Цикл
		Если (НовыйТелефон = "") Или (СтрДлина(НовыйТелефон) + Найти(СтарыйТелефон, ";") <= 20) Тогда
			//добавим кусок
			НовыйТелефон = ?(НовыйТелефон = "", "",  НовыйТелефон + ";") + Лев(СтарыйТелефон, Найти(СтарыйТелефон, ";") - 1);
			СтарыйТелефон = Прав(СтарыйТелефон, СтрДлина(СтарыйТелефон) - Найти(СтарыйТелефон, ";"));
		Иначе 
			СтарыйТелефон = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйТелефон;
	
КонецФункции	

// Сворачивает таблицу товаров по всем несуммовым колонкам
//
// Параметры:
//  Товары - ТаблицаЗначений - сворачиваемая таблица
//
Процедура СвернутьТаблицуТовары(Товары)
	
	КолонкиГруппировокСтрокой 		= "";
	КолонкиСуммированияСтрокой 		= "Количество, КоличествоМест, СуммаНДС, Сумма, СуммаСНДС, Масса, МассаНетто";
	КолонкиСуммированияСтруктурой 	= Новый Структура(КолонкиСуммированияСтрокой);
	
	Разделитель = "";
	Для каждого Колонка Из Товары.Колонки Цикл
		Если НЕ КолонкиСуммированияСтруктурой.Свойство(Колонка.Имя) Тогда
			КолонкиГруппировокСтрокой = КолонкиГруппировокСтрокой + Разделитель + Колонка.Имя;
			Разделитель = ", ";
		КонецЕсли; 
	КонецЦикла;
	
	Товары.Свернуть(КолонкиГруппировокСтрокой, КолонкиСуммированияСтрокой);
	
КонецПроцедуры

Функция ПодготовитьДопДанныеДляСозданияНакладной(СтруктураВходящиеДанные) Экспорт
	
	ВозвращаемаяСтруктура= Новый Структура();
	
	ДоговорКонтрагента= СтруктураВходящиеДанные.ДоговорКонтрагента;
	ВозвращаемаяСтруктура.Вставить("ТипЦен", МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПолучитьТипЦенПоДоговору", ДоговорКонтрагента));
	ВозвращаемаяСтруктура.Вставить("ВалютаРасчетов", ДоговорКонтрагента.ВалютаРасчетов);
	ВозвращаемаяСтруктура.Вставить("УчетВалютныхОпераций", Константы.ФункциональнаяУчетВалютныхОпераций.Получить());
	
	Возврат ВозвращаемаяСтруктура; 
	
КонецФункции

Функция СписокПолейОписанияОрганизации(СтруктураСведенияОбОрганизации) 
	
	СписокПолей= "";
	
	Если СтруктураСведенияОбОрганизации.Свойство("НаименованиеДляПечатныхФорм") Тогда
		СписокПолей= "НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет"; 
	Иначе
		СписокПолей= "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	КонецЕсли;
	
	Возврат СписокПолей;
	
КонецФункции

Функция ПривестиКЧислуЛок(Значение)
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

//} СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ ПОЛУЧЕНИЕ ДАННЫХ

Функция ПолучитьВидКИ(ЮрФизЛицо, Юрадрес) Экспорт
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		
		Если Юрадрес Тогда
			ВидАдреса = "ЮрАдресОрганизации";
		Иначе
			ВидАдреса = "ФактАдресОрганизации";
		КонецЕсли
		
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Если ЮрАдрес Тогда
			ВидАдреса = "ЮрАдресКонтрагента";
		Иначе
			ВидАдреса = "ФактАдресКонтрагента";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		
		ВидАдреса = "ФактАдресСтруктурнойЕдиницы";
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Некорректный параметр функции ""ПолучитьВидКИ""'");
		
	КонецЕсли;
	
	Результат = Справочники.ВидыКонтактнойИнформации[ВидАдреса];
	
	Возврат Результат;
	
КонецФункции

// Получает по счету-фактуре список документов-оснований.
//
// Параметры:
//  СФ - ДокументСсылка.СчетФактура - счет-фактура, основания которого требуется получить.
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на документы-основания счета-фактуры.
//
Функция ОснованияСчетаФактуры(СФ)
	
	Результат = Неопределено;
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.ТабличнаяЧасть.ДокументыОснования") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.СчетФактура.ДокументыОснования КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СФ);
		
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОснование");
		
	Иначе
		Результат = Новый Массив;
		Результат.Добавить(МетодСервера(, "ЗначениеРеквизитаОбъекта", СФ, "ДокументОснование"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПодразделениеИзДокумента(ДокСсылка)
	Возврат ДокСсылка.Подразделение.Наименование;
КонецФункции

Функция ПолучитьГрузополучателя(Документ) Экспорт
	
	Если Метаданные.Документы.Найти("РасходнаяНакладная") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Если Документ.Метаданные().Реквизиты.Найти("Грузополучатель") <> Неопределено Тогда
			Грузополучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Грузополучатель");
		Иначе
			Грузополучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Контрагент");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактура") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Грузополучатель");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(ДокументСсылка) Экспорт
			
	МассивРТУ = Новый Массив;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетНаОплату") 
		И НЕ ДокументСсылка.Метаданные().Реквизиты.Найти("ДокументОснование") = Неопределено Тогда
		
		Если  ЗначениеЗаполнено(ДокументСсылка.ДокументОснование)
			И ТипЗнч(ДокументСсылка.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			
			// счет создан на основании расходной накладной
			МассивРТУ.Добавить(ДокументСсылка.ДокументОснование);
			
		Иначе
			
			// расходная накладная создана на основании счета
			Запрос = Новый Запрос;
			
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасходнаяНакладная.Ссылка КАК РеализацияСсылка
				|ИЗ
				|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
				|ГДЕ
				|	РасходнаяНакладная.ДокументОснование = &ЭтотСчет
				|	И РасходнаяНакладная.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ЭтотСчет", ДокументСсылка);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			МассивРТУ = РезультатЗапроса.ВыгрузитьКолонку("РеализацияСсылка");
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка КАК РеализацияСсылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Заказ = &Заказ
			|	И РасходнаяНакладная.ПометкаУдаления = ЛОЖЬ";
			
		Запрос.УстановитьПараметр("Заказ", ДокументСсылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		МассивРТУ = РезультатЗапроса.ВыгрузитьКолонку("РеализацияСсылка");
		
	КонецЕсли;
	
	Возврат МассивРТУ;
	
КонецФункции

Функция ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(СчетФактура) Экспорт
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Договор КАК Договор
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Договор
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Договор
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОПереработке КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Договор
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура";
	
	Если МетодСервера(,"СуществуетОбъектМетаданных", "Документ.КорректировкаРеализации") Тогда
	
		ТекстЗапроса = ТекстЗапроса + МетодСервера(,"РазделительОбъединенияЗапросов") +
		
		"ВЫБРАТЬ
		|	Документ.Ссылка,
		|	Документ.Дата,
		|	Документ.Договор
		|ИЗ
		|	Документ.СчетФактура.ДокументыОснования КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Документ
		|		ПО Таблица.ДокументОснование = Документ.Ссылка
		|ГДЕ
		|	Таблица.Ссылка = &СчетФактура";
		
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ДокументСсылка) Экспорт
	
	СФСсылка= 	Неопределено;
	Запрос= 	Новый Запрос;
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.ТабличнаяЧасть.ДокументыОснования") Тогда
		Запрос.Текст= 
			"ВЫБРАТЬ
			|	СчетФактураВыданныйДокументыОснования.Ссылка
			|ИЗ
			|	Документ.СчетФактура.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
			|ГДЕ
			|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
			|	И СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Иначе 
		Запрос.Текст= 
			"ВЫБРАТЬ
			|	СчетФактураВыданный.Ссылка
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|ГДЕ
			|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
			|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СФСсылка= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат СФСсылка;
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализации(ДокументСсылка) Экспорт
	
	ДокументОснование= Неопределено;
	
	Если НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено
		И НЕ ДокументСсылка.Метаданные().Реквизиты.Найти("ДокументОснование") = Неопределено Тогда
		
		ДокументОснование= ДокументСсылка.ДокументОснование;
					
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(ДокументСсылка) Экспорт
	
	Запрос= Новый Запрос;
	
	Запрос.Текст=
		"ВЫБРАТЬ
		|	СчетНаОплату.Ссылка
		|ИЗ
		|	Документ.СчетНаОплату КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.ДокументОснование = &ДокументОснование
		|	И СчетНаОплату.ПометкаУдаления = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	
	Выборка= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;			
	
КонецФункции

Функция ПолучитьЗаказПокупателяНаОснованииРТУ(ДокументСсылка) Экспорт
	
	Если НЕ Метаданные.Документы.РасходнаяНакладная.Реквизиты.Найти("Заказ") = Неопределено
		  И ТипЗнч(ДокументСсылка.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		  
		Возврат ДокументСсылка.Заказ;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСФОснованиеПоИСФ_КСФ(ИСФ_КСФ) Экспорт
	
	Если НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено Тогда
	
		ДокОснование= ИСФ_КСФ.ДокументыОснования[0].ДокументОснование;
		Если ДокОснование.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
			ДокОснование= ДокОснование.ДокументОснование;
		Иначе 	
			Пока  ТипЗнч(ДокОснование) = Тип("ДокументСсылка.КорректировкаРеализации") 
				И ДокОснование.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Цикл 
				
				ДокОснование= ДокОснование.ДокументОснование;
				
			КонецЦикла;
		КонецЕсли;	
		
		Запрос= Новый Запрос;
		Запрос.Текст= 
			"ВЫБРАТЬ
            |	СчетФактураВыданныйДокументыОснования.Ссылка
            |ИЗ
            |	Документ.СчетФактура.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
            |ГДЕ
			|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
			|	И СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления = ЛОЖЬ";
            			
		Запрос.УстановитьПараметр("Документоснование", ДокОснование);
		Выборка= Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ПолучитьДанныеДляФормированияУПД(ДокСсылка, ФункцияУПД)
	
	Если ФункцияУПД = "СЧФДОП" ИЛИ ФункцияУПД = "СЧФ" Тогда
		
		ДанныеДляФормированияСчетФактуры = СформироватьДанныеДляПечати(ДокСсылка, Ложь);
		
		ДанныеДляФормированияУПД = Новый Структура("ДанныеШапки", Новый Структура);
		
		Для Каждого КлючИЗначение Из ДанныеДляФормированияСчетФактуры Цикл
			
			Если КлючИЗначение.Ключ = "ТабличнаяЧасть" Тогда
				ДанныеДляФормированияУПД.Вставить("ТаблицаТоваров", КлючИЗначение.Значение);
			Иначе
				ДанныеДляФормированияУПД.ДанныеШапки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ФункцияУПД = "СЧФДОП" Тогда 
			ТаблицаНакладных = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокСсылка);
			Если ЗначениеЗаполнено(ТаблицаНакладных) Тогда
				ДанныеДляФормированияУПД.ДанныеШапки.Вставить("ДатаОтгрузки", ТаблицаНакладных[0].Дата);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ДанныеШапки	 = ДанныеШапки(ДокСсылка);
		ДанныеТЧ	 = ДанныеТабличныхЧастей(ДанныеШапки);
		ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ДанныеТЧ);
		
		ДанныеДляФормированияУПД = Новый Структура;
		ДанныеДляФормированияУПД.Вставить("ДанныеШапки"		, ДанныеШапки);
		ДанныеДляФормированияУПД.Вставить("ТаблицаТоваров"	, ДанныеТЧ);
		
	КонецЕсли;
	
	ЭтоСФНаАванс = СчетФактураНаАванс(ДокСсылка);
	Если ДанныеДляФормированияУПД.ДанныеШапки.РасчетыВУсловныхЕдиницах ИЛИ ЭтоСФНаАванс Тогда
		
		//счета-фактуры в уе и на аванс - выставляются только в рублях
		ВалютаРегл = ВалютаРегламентированногоУчета();
		ДанныеДляФормированияУПД.ДанныеШапки.ВалютаДокумента	 = ВалютаРегл;
		ДанныеДляФормированияУПД.ДанныеШапки.ВалютаДокументаКод	 = ВалютаРегл.Код;
		
	КонецЕсли;
	
	Если ФункцияУПД = "СЧФДОП" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "InvoiceAndBasic");
	ИначеЕсли ФункцияУПД = "ДОП" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "Basic");
	ИначеЕсли ФункцияУПД = "СЧФ" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "Invoice");
	КонецЕсли;
	ДанныеДляФормированияУПД.ДанныеШапки.Вставить("ДатаНомерСвидетельстваОРегистрации", ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляФормированияУПД.ДанныеШапки.Организация));
	
	Возврат ДанныеДляФормированияУПД;
	
КонецФункции

Функция ДанныеДляФормированияУКД(ДокСсылка, ДопПараметры)
	
	Если ДопПараметры.ФункцияУПД = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияУПД = "КСЧФ" Тогда
		
		СчетФактура 	 = ДокСсылка;
		ТаблицаНакладных = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокСсылка);
		Накладная		 = ТаблицаНакладных[0].Ссылка;
		
	Иначе
		
		СчетФактура = Неопределено;
		Накладная 	= ДокСсылка;
		
		ТаблицаНакладных = Новый ТаблицаЗначений;
		ТаблицаНакладных.Колонки.Добавить("Ссылка");
		ТаблицаНакладных.Колонки.Добавить("Дата");
		ТаблицаНакладных.Колонки.Добавить("Договор");
		
		НоваяСтрока = ТаблицаНакладных.Добавить();
		НоваяСтрока.Ссылка	 = Накладная;
		НоваяСтрока.Дата	 = Накладная.Дата;
		НоваяСтрока.Договор	 = Накладная.Договор;
		
	КонецЕсли;
	
	Накладные = ТаблицаНакладных.ВыгрузитьКолонку("Ссылка");
	
	Шапка			 = ДанныеШапки(ДокСсылка);
	ТабличнаяЧасть	 = ДанныеТабличныхЧастей(Шапка); // ДанныеТабличныхЧастейМассиваДокументов(Накладные);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	Шапка.Вставить("Функция", ?(ДопПараметры.ФункцияУПД = "КСЧФДИС", "InvoiceAndBasic", ?(ДопПараметры.ФункцияУПД = "КСЧФ", "Invoice", "Basic")));
	
	Если ДопПараметры.ФункцияУПД = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияУПД = "ДИС" Тогда
		ДатаУведомления = ТаблицаНакладных[0].Дата;
		Если ДатаУведомления <> Шапка.ДатаНомерДокумента.ДатаДокумента Тогда
			Шапка.Вставить("ДатаУведомления", ДатаУведомления);
		КонецЕсли;
	КонецЕсли;
	
	РасчетыВУЕ = Шапка.РасчетыВУсловныхЕдиницах;
	Если РасчетыВУЕ Тогда
		
		//счета-фактуры в уе и на аванс - выставляются только в рублях
		ВалютаРегл = ВалютаРегламентированногоУчета();
		
		Шапка.ВалютаДокумента = ВалютаРегл;
		Шапка.ВалютаДокументаКод = ВалютаРегл.Код;
		
	КонецЕсли;
	
	Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(Накладная), "СопроводительныеДокументы") Тогда
		Шапка.Вставить("ИныеСведенияОбИзмененииСтоимости", Накладная.СопроводительныеДокументы);
	КонецЕсли;
	
	РеквизитыПередаточныхДокументов		= Новый Массив;
	ДобавленныеПередаточныеДокументы	= Новый Соответствие;
	
	ТипПередаточногоДокумента = "УПД "; 
	
	Шапка.Вставить("ОснованияПередачи", Новый Массив);
	Шапка.Вставить("ПередаточныеДокументы", Новый Массив);
	
	ДобавленныеОснования = Новый Соответствие;
	
	Для Каждого СтрокаТЗ Из ТаблицаНакладных Цикл
		
		СтруктураОснования = ЗаполнитьСтруктуруОснования(СтрокаТЗ.Договор, Истина);
	
		Если ЗначениеЗаполнено(СтруктураОснования.GroundDate) И ЗначениеЗаполнено(СтруктураОснования.GroundName) Тогда
			
			Если ДобавленныеОснования[СтруктураОснования.Основание] <> Истина Тогда
				
				ДобавленныеОснования.Вставить(СтруктураОснования.Основание, Истина);
				
				ItemCorrectionBases = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CorrectionBase");
				ItemCorrectionBases.BaseDocumentName   = СтруктураОснования.GroundName;
				ItemCorrectionBases.BaseDocumentNumber = СокрЛП(СтруктураОснования.GroundNumber);
				ItemCorrectionBases.BaseDocumentDate   = СтруктураОснования.GroundDate;
				
				Шапка.ОснованияПередачи.Добавить(ItemCorrectionBases);
				
			КонецЕсли;
			
		КонецЕсли;
	
		ИсправляемыйДокументРеализации = ПолучитьИсправляемыйДокументРеализации(СтрокаТЗ.Ссылка);
		Если ДопПараметры.ФункцияУПД = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияУПД = "КСЧФ" Тогда 
			ПередаточныйДокумент = ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ИсправляемыйДокументРеализации);
		Иначе
			ПередаточныйДокумент = ИсправляемыйДокументРеализации;
		КонецЕсли;
		
		Шапка.ПередаточныеДокументы.Добавить(ПередаточныйДокумент);
		
		Если ДобавленныеПередаточныеДокументы[ПередаточныйДокумент] <> Истина Тогда
			
			ДобавленныеПередаточныеДокументы.Вставить(ПередаточныйДокумент, Истина);
			
			Новый_BaseDocument = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_BaseDocumentName");
		
			Новый_BaseDocument.BaseDocumentName		= ТипПередаточногоДокумента;
			Новый_BaseDocument.BaseDocumentNumber 	= ПредставлениеНомераОбъекта(ПередаточныйДокумент);
			Новый_BaseDocument.BaseDocumentDate 	= Формат(ПередаточныйДокумент.Дата, "ДФ=dd.MM.yyyy");
			
			РеквизитыПередаточныхДокументов.Добавить(Новый_BaseDocument);
											
		КонецЕсли;
		
	КонецЦикла;
	
	Шапка.Вставить("РеквизитыПередаточныхДокументов", РеквизитыПередаточныхДокументов); 
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", 			Шапка);
	Результат.Вставить("ТабличнаяЧасть", 	ТабличнаяЧасть);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСтруктуруОснования(ДоговорКонтрагента, ЭтоУПД)
	
	Ground = Новый Структура;
	Ground.Вставить("GroundName", 	"");
	Ground.Вставить("GroundNumber", "");
	Ground.Вставить("GroundDate", 	"");
	Ground.Вставить("Основание", 	"");
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			
		Если ЭтоУПД Тогда
			ПредставлениеДоговора= "Договор";
		Иначе
			ПредставлениеДоговора= ДоговорКонтрагента.Наименование;
		КонецЕсли;
			
		Ground.Вставить("GroundName", 	ПредставлениеДоговора);
		Ground.Вставить("GroundNumber", ДоговорКонтрагента.НомерДоговора);
		Ground.Вставить("GroundDate", 	ДоговорКонтрагента.ДатаДоговора);
		Ground.Вставить("Основание", 	ДоговорКонтрагента);
		
	КонецЕсли;
	
	Возврат Ground;
	
КонецФункции

Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации)
	
	Если ЗначениеЗаполнено(ДокРеализации) 
		И (ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") 
		ИЛИ ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.АктОРасхожденияхПолученный")) Тогда
		
		Возврат ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументОснование);
		
	Иначе
		
		Возврат ДокРеализации;
		
	КонецЕсли;
	
КонецФункции

Функция БанковскийСчетСчетаФактурыНаАванс(СчетФактура)
	
	Результат = Неопределено;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ПоступлениеДС.БанковскийСчет, НЕОПРЕДЕЛЕНО) КАК БанковскийСчет
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК СФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаСчет КАК ПоступлениеДС
	|		ПО СФ.ДокументОснование = ПоступлениеДС.Ссылка
	|ГДЕ
	|	СФ.Ссылка = &СчетФактура";
	
	Если Не МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.ТабличнаяЧасть.ДокументыОснования") Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.СчетФактура.ДокументыОснования КАК СФ", "Документ.СчетФактура КАК СФ");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.БанковскийСчет;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаРегламентированногоУчета() Экспорт
	
	Результат = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	
	Возврат Результат; 
	
КонецФункции

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
	//
	// Параметры:
	//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
	//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
	//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
				
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.СчетНаОплату");
							
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= "СчетНаОплату";
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
	ПараметрыОтправки = Новый Структура;
	
	ПараметрыОтправки.Вставить("Получатель"	, "");
	ПараметрыОтправки.Вставить("Тема"		, "");
	ПараметрыОтправки.Вставить("Текст"		, "");
							
	ПараметрыМетодаПечати.ПараметрыВывода.Вставить("ДоступнаПечатьПоКомплектно"	, Ложь);
	ПараметрыМетодаПечати.ПараметрыВывода.Вставить("ПараметрыОтправки"			, ПараметрыОтправки);
			
КонецПроцедуры //ПередФормированиемПечатнойФормыСчетаНаОплату()

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ДокументСчетЗапасы.СуммаНДС) КАК СуммаНДС,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА СправочникСтавкиНДС.НеОблагается
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ) КАК ЕстьСтавкиСНДС
		|ИЗ
		|	Документ.СчетНаОплату.Запасы КАК ДокументСчетЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СправочникСтавкиНДС
		|			ПО ДокументСчетЗапасы.СтавкаНДС = СправочникСтавкиНДС.Ссылка
		|ГДЕ
		|	ДокументСчетЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СчетНаОплату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Мета.СуммаНДС 		= Выборка.СуммаНДС;
		Мета.ДокументБезНДС = НЕ Выборка.ЕстьСтавкиСНДС;
		
	КонецЕсли;
	
	Мета.Сумма = СчетНаОплату.СуммаДокумента; 
	
КонецПроцедуры //ПриЗаполненииМетыНеформализованногоСчетаНаОплату()

// См. метод "ПередФормированиемПечатнойФормыСверкиВзаиморасчетов" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПередФормированиемПечатнойФормыСверкиВзаиморасчетов(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.СверкаВзаиморасчетов");
							
	НоваяПФ = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	
	НоваяПФ.ИмяМакета 	= "АктБезРасхождений";
	НоваяПФ.ИмяВРЕГ		= ВРЕГ(НоваяПФ.ИмяМакета);
	НоваяПФ.Экземпляров = 1;
	
	ПараметрыОтправки = Новый Структура;
	
	ПараметрыОтправки.Вставить("Получатель"	, "");
	ПараметрыОтправки.Вставить("Тема"		, "");
	ПараметрыОтправки.Вставить("Текст"		, "");
				
	ПараметрыМетодаПечати.ПараметрыВывода.Вставить("ДоступнаПечатьПоКомплектно"	, Ложь);
	ПараметрыМетодаПечати.ПараметрыВывода.Вставить("ПараметрыОтправки"			, ПараметрыОтправки);			

КонецПроцедуры // ПередФормированиемПечатнойФормыСверкиВзаиморасчетов()

Функция ПараметрыСчетаФактуры(СчетФактура) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПараметрыСчетаНаОплату(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура			 - ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат		 = Неопределено;
	
	Возврат Результат;
	
КонецФункции

//} ПОЛУЧЕНИЕ ДАННЫХ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ РАБОТА С КОНТЕНТОМ

////////////////////////////////////////////////////////////////////////////////
//{ ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьСтруктурированноеОписаниеАдреса(AddressContent, СведенияОбОрганизации, ЮрФизЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса = "")
	
	ВладелецКИ	 = ХранилищеКонтактнойИнформацииОбъекта(ЮрФизЛицо);
	ВидАдреса	 = ПолучитьВидКИ(ВладелецКИ, Юрадрес);
	Адрес		 = АдресЮрФизЛица(ВладелецКИ, ВидАдреса, ДатаДокумента);
	
	Если Не ЗначениеЗаполнено(Адрес.ЗначенияПолей) Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураАдреса = СведенияОбАдресе(Адрес.ЗначенияПолей);
	
	// Обертка для корректного заполнения адреса доставки (грузополучателя) по данным документа:
	// код страны определяем по фактическому адресу грузополучателя, а представление подставляем из документа
	Если ЗначениеЗаполнено(ПредставлениеАдреса) Тогда 
		СтруктураАдреса.СохраненноеПредставление = ПредставлениеАдреса;
	// используем пользовательское представление адреса	
	Иначе
		СтруктураАдреса.СохраненноеПредставление = ?(ЮрАдрес, СведенияОбОрганизации.ЮридическийАдрес, СведенияОбОрганизации.ФактическийАдрес);	
	КонецЕсли;
	
	Заполнить_AddressInfo(AddressContent, СтруктураАдреса);
	
КонецПроцедуры

Функция ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(Организация)

	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП", Организация);

КонецФункции

Функция СформироватьПредставлениеКонтрагентаДляАкта(Организация, ДатаОперации)
	
	СведенияОбОрганизации= РеквизитыЮрФизЛица(Организация, ДатаОперации);
	
	Возврат ОтрезатьПравуюЗапятую(ДобавитьРазделитель(СведенияОбОрганизации.ПолноеНаименование) + ДобавитьРазделитель(СведенияОбОрганизации.ИНН, "ИНН: ") + ДобавитьРазделитель(СведенияОбОрганизации.КПП, "КПП: "));
	
КонецФункции

// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату. 
// Табличный документ формируется средствами Диадок
//
// Параметры:
//  ДокСсылка - ДокументСсылка	- документ, на основании которого формируем печатную форму 
// 
// Возвращаемое значение:
//   Структура
//
Функция РезультатВизуализацииСчетаНаОплатуСредствамиДиадок(ДокСсылка, ПараметрыОтправкиНаСогласование =  Неопределено, ФИОПодписанта = "") Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров	 = ДанныеТабличныхЧастей(ДанныеШапки);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	
	Таб = Новый ТабличныйДокумент;
	
	Макет	= ОбработкаОбъект.ПолучитьМакет("СчетНаОплату");
	Шапка1	= Макет.ПолучитьОбласть("ШапкаСчета1");
	
	СведенияОбОрганизации = РеквизитыЮрФизЛица(ДанныеШапки.Организация, ДатаНомер.ДатаДокумента);
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.Банк) Тогда
		Шапка1.Параметры.БанкПолучателя			= СведенияОбОрганизации.Банк;
		Шапка1.Параметры.БИКБанкаПолучателя		= СведенияОбОрганизации.БИК;
		Шапка1.Параметры.СчетБанкаПолучателя	= СведенияОбОрганизации.КоррСчет;
		Шапка1.Параметры.СчетПолучателя			= СведенияОбОрганизации.НомерСчета;
		Шапка1.Параметры.ИННПолучателя			= СведенияОбОрганизации.ИНН;
		Шапка1.Параметры.КПППолучателя			= СведенияОбОрганизации.КПП;
		Если СведенияОбОрганизации.Свойство("НаименованиеДляПечатныхФорм") Тогда
			Шапка1.Параметры.Получатель	= СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
		Иначе
			Шапка1.Параметры.Получатель	= СведенияОбОрганизации.ПолноеНаименование;
		КонецЕсли;
	КонецЕсли;	
	Таб.Вывести(Шапка1);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	ДатаДокумента = ДатаНомер.ДатаДокумента;
	НомерДокумента = ДатаНомер.НомерДокумента;
	
	Шапка2 = Макет.ПолучитьОбласть("ШапкаСчета2");
	Шапка2.Параметры.Заголовок = СтрШаблон("Счет на оплату № %1 от %2"
		, НомерДокумента
		, Формат(ДатаДокумента,"ДФ=dd.MM.yyyy"));
		
	Таб.Вывести(Шапка2);
	
	СписокПолей			= СписокПолейОписанияОрганизации(СведенияОбОрганизации);
	ОписаниеОрганизации	= ПредставлениеЮрФизЛица(СведенияОбОрганизации, СписокПолей);
	
	Шапка3 = Макет.ПолучитьОбласть("ШапкаСчета3");
	Шапка3.Параметры.Поставщик = ОписаниеОрганизации;
	Таб.Вывести(Шапка3);
	
	СведенияОбКонтрагенте	= РеквизитыЮрФизЛица(ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента);
	СписокПолей				= СписокПолейОписанияОрганизации(СведенияОбКонтрагенте);
	ОписаниеКонтрагента		= ПредставлениеЮрФизЛица(СведенияОбКонтрагенте, СписокПолей);
	
	Шапка4 = Макет.ПолучитьОбласть("ШапкаСчета4");
	Шапка4.Параметры.Покупатель = ОписаниеКонтрагента;
	Таб.Вывести(Шапка4);
	
	ЕстьСтавкаБезНДС	= Ложь;
	
	ОбластьНомерСтроки 	= Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКолонкаКодов = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьДанные 		= Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОбластьСкидка		= Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСумма		= Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
	
	Таб.Вывести(ОбластьНомерСтроки);
	Таб.Присоединить(ОбластьДанные);
	Таб.Присоединить(ОбластьСумма);
	
	ОбластьКолонкаТовар = Макет.Область("Товар");
	// Делаем по аналогии с типовым механизмом
	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки + Макет.Область("Скидка").ШиринаКолонки;
						
	ОбластьНомерСтроки 	= Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьКолонкаКодов = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
	ОбластьДанные 		= Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидка		= Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСумма		= Макет.ПолучитьОбласть("Строка|Сумма");
	
	СуммаВсего 			= 0;
	СуммаВсегоНДС 		= 0;
	НомерПП 			= 0;
	
	ЦенаВключаетНДС		= ДанныеШапки.ЦенаВключаетНДС;
						
	Для Каждого Стр Из ТаблицаТоваров Цикл
		
		НомерПП = НомерПП + 1;
		ОбластьНомерСтроки.Параметры.НомерСтроки = НомерПП;
		Таб.Вывести(ОбластьНомерСтроки);
		
		Если ЦенаВключаетНДС
			И ЗначениеЗаполнено(Стр.СуммаСНДС)
			И ЗначениеЗаполнено(Стр.Количество) Тогда
			
			Стр.Цена = Окр(Стр.СуммаСНДС / ?(Стр.Количество = 0, 1, Стр.Количество), 2);
			
		КонецЕсли;
		
		ПараметрыЗаполнения = Новый Структура("Товар, Количество, ЕдиницаИзмерения, Цена", Стр.НоменклатураПредставление, Стр.Количество, Стр.ЕдиницаИзмерения, Стр.Цена);
		ОбластьДанные.Параметры.Заполнить(ПараметрыЗаполнения);
		Таб.Присоединить(ОбластьДанные);
		
		ОбластьСумма.Параметры.Сумма= Стр.Сумма;
		Таб.Присоединить(ОбластьСумма);
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДСПредставление) Тогда
			ЕстьСтавкаБезНДС = Истина;
		КонецЕсли;
		
		СуммаВсего		= СуммаВсего 		+ Стр.сумма;
		СуммаВсегоНДС	= СуммаВсегоНДС 	+ Стр.СуммаНДС;
		
	КонецЦикла;
	
	СуммаВсегоСНДС = СуммаВсего + ?(ЦенаВключаетНДС, 0, СуммаВсегоНДС);
				
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Таб.Вывести(Подвал);
							
	ПодвалИтого = Макет.ПолучитьОбласть("ПодвалИтого");
	ПодвалИтого.Параметры.Всего = СуммаВсего; 
	Таб.Вывести(ПодвалИтого);
			
	ПодвалНДС = Макет.ПолучитьОбласть("ПодвалНДС");
	Если СуммаВсегоНДС <> 0 Тогда
		ПодвалНДС.Параметры.НДС			= ?(ЦенаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
		ПодвалНДС.Параметры.ВсегоНДС	= Формат(СуммаВсегоНДС, "ЧЦ=15; ЧДЦ=2");
	Иначе
		ПодвалНДС.Параметры.НДС			= "Без налога (НДС)";
		ПодвалНДС.Параметры.ВсегоНДС	= "-";
	КонецЕсли;
	Таб.Вывести(ПодвалНДС);
	
	ПодвалИтого = Макет.ПолучитьОбласть("ПодвалИтогоКОплате");
	ПодвалИтого.Параметры.ИтогоКОплате = СуммаВсегоСНДС;
	Таб.Вывести(ПодвалИтого);
	
	ПодвалСуммаПрописью = Макет.ПолучитьОбласть("ПодвалСуммаПрописью");
	ПодвалСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТаблицаТоваров.Количество() 
													+ ", на сумму "+ Формат(СуммаВсегоСНДС,"ЧЦ=15; ЧДЦ=2") + " " + СокрП(ДанныеШапки.ВалютаДокумента);
	
	ПодвалСуммаПрописью.Параметры.СуммаПрописью = ЧислоПрописью(СуммаВсегоСНДС, , МетодСервера("ПечатныеФормы", "ПараметрыИсчисленияВалюты", ДанныеШапки.ВалютаДокумента.Код));
	Таб.Вывести(ПодвалСуммаПрописью);
	
	ПодвалСчета = Макет.ПолучитьОбласть("ПодвалСчета");
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		ПодвалСчета.Параметры.ФИОРуководителя = ?(ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта), ПараметрыОтправкиНаСогласование.ФИОПодписанта,
												?(ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПолучателя), ПараметрыОтправкиНаСогласование.ФИОПолучателя, "_"));
	Иначе 	
		ПодвалСчета.Параметры.ФИОРуководителя = ФИОПодписанта;
	КонецЕсли;	
	Таб.Вывести(ПодвалСчета);
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыйРезультатВизуализацииСчетаНаОплату");
	
	Результат.Таблица 			= Таб;
	Результат.СписокОшибок 		= "";
	Результат.ИмяФайла 			= МетодСервера("Модуль_ИнтеграцияУниверсальный", "ИмяФайлаПечатнойФормы", "Счет", НомерДокумента, ДатаДокумента);
	Результат.Дата 				= ДатаДокумента;
	Результат.Номер 			= НомерДокумента;
	Результат.Сумма 			= СуммаВсегоСНДС;
	Результат.СуммаНДС 			= СуммаВсегоНДС;
	Результат.ДокументБезНДС	= ?(ЕстьСтавкаБезНДС И СуммаВсегоНДС = 0, Истина, Ложь);
							
	Возврат Результат;	
	
КонецФункции //РезультатВизуализацииСчетаНаОплатуСредствамиДиадок()

Функция СформироватьМетуСчетаНаОплату(ДокументСсылка) Экспорт
	
	Шапка			 = ДанныеШапки(ДокументСсылка);
	ТабличнаяЧасть	 = ДанныеТабличныхЧастей(Шапка);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	ДатаНомер = Шапка.ДатаНомерДокумента;
	
	МетаСчетаНаОплату=	Новый Структура;
	МетаСчетаНаОплату.Вставить("Дата", 		ДатаНомер.ДатаДокумента);
	МетаСчетаНаОплату.Вставить("Номер", 	ДатаНомер.НомерДокумента);
	МетаСчетаНаОплату.Вставить("Сумма", 	Шапка.СуммаДокумента);
	
	СуммаНДС = Шапка.СуммаНДС; //ТабличнаяЧасть.Итог("СуммаНДС"); 
	МетаСчетаНаОплату.Вставить("СуммаНДС", СуммаНДС);
	
	ЕстьСтавкаБезНДС= Ложь;
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(СтрокаТЧ.СтавкаНДС) Тогда
			ЕстьСтавкаБезНДС= Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	МетаСчетаНаОплату.Вставить("ДокументБезНДС", ?(ЕстьСтавкаБезНДС И СуммаНДС = 0, Истина, Ложь));
	
	Возврат МетаСчетаНаОплату;
	
КонецФункции

Функция СформироватьМетуАктаВыполненныхРабот(ДокументСсылка) Экспорт
	
	Шапка = ДанныеШапки(ДокументСсылка);
	ТабличнаяЧасть = ДанныеТабличныхЧастей(Шапка);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	ДатаНомер = Шапка.ДатаНомерДокумента;
	
	МетаАктаВыполненныхРабот=	Новый Структура;
	МетаАктаВыполненныхРабот.Вставить("Дата", 	ДатаНомер.ДатаДокумента);
	МетаАктаВыполненныхРабот.Вставить("Номер", 	ДатаНомер.НомерДокумента);
	МетаАктаВыполненныхРабот.Вставить("Сумма", 	Шапка.СуммаДокумента);
	
	ИтогСуммаНДС	 = ТабличнаяЧасть.Итог("СуммаНДС");
	ЕстьСтавкаБезНДС = Ложь;
	
	Для Каждого Стр Из ТабличнаяЧасть Цикл
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДСПредставление) Тогда
			ЕстьСтавкаБезНДС = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	МетаАктаВыполненныхРабот.Вставить("СуммаНДС", ИтогСуммаНДС);
	МетаАктаВыполненныхРабот.Вставить("ДокументБезНДС", ?(ЕстьСтавкаБезНДС И ИтогСуммаНДС = 0, Истина, Ложь));
	
	Возврат МетаАктаВыполненныхРабот;
	
КонецФункции

Функция СформироватьМетуАктаСверки(ДокументСсылка) Экспорт
	
	МетаАктаСверки=	Новый Структура;
	МетаАктаСверки.Вставить("Дата", 	ДокументСсылка.Дата);
	МетаАктаСверки.Вставить("Номер", 	ПредставлениеНомераОбъекта(ДокументСсылка));
			
	Возврат МетаАктаСверки;
	
КонецФункции

Функция СтруктурированноеПредставлениеОснования(ДокСсылка, ЭтоАкт = Ложь)
	
	ДоговорКонтрагента= ДокСсылка.Договор;
	
	Ground= Новый Структура;
	Ground.Вставить("GroundName", "");
	Ground.Вставить("GroundNumber", "");
	Ground.Вставить("GroundDate", "");
	
	Если Не ЭтоАкт И (ДокСсылка.Метаданные().Реквизиты.Найти("Основание") <> Неопределено) И (ЗначениеЗаполнено(ДокСсылка.Основание)) Тогда
		
		Ground.Вставить("GroundName", ДокСсылка.Основание);
		Если НЕ ДокСсылка.Метаданные().Реквизиты.Найти("ОснованиеНомер") = Неопределено Тогда
			Ground.Вставить("GroundNumber", ДокСсылка.ОснованиеНомер);
			Ground.Вставить("GroundDate", 	ДокСсылка.ОснованиеДата);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		
		Ground.Вставить("GroundName", 	ДоговорКонтрагента.Наименование);
		Ground.Вставить("GroundNumber", ДоговорКонтрагента.НомерДоговора);
		Ground.Вставить("GroundDate", 	ДоговорКонтрагента.ДатаДоговора);
		
	КонецЕсли;
	
	Возврат  Ground;
	
КонецФункции

Функция СтруктурированноеПредставлениеОснованияУПД(ДокументСсылка)
	
	Результат = Новый Структура;
	Результат.Вставить("GroundName", 	"");
	Результат.Вставить("GroundNumber", 	"");
	Результат.Вставить("GroundDate", 	Дата(1, 1, 1));
	
	Результат.Вставить("ОснованиеСсылка");
	Результат.Вставить("ПредставлениеВТекстеОшибки"	, "основании");
	
	Договор	= Неопределено;
	
	Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(ДокументСсылка), "Договор") Тогда 
		Договор = ДокументСсылка.Договор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		Результат.GroundName		= "Договор"; 	
		Результат.GroundNumber		= Договор.НомерДоговора;
		Результат.GroundDate		= Договор.ДатаДоговора; 
		Результат.ОснованиеСсылка	= Договор;
		
	КонецЕсли;
	
	Возврат  Результат;
	
КонецФункции

Процедура ЗаполнитьСведенияОПередаче(Content, ДокументСсылка, ФункцияУПД, ДопПараметры)
	
	КоллекцияДокументНосительОснования	= Новый Массив;
	
	ДобавленныеОснования = Новый Массив;
	
	Если ФункцияУПД = "СЧФДОП" ИЛИ ФункцияУПД = "СЧФ" Тогда
		// в этом случае параметр ДокументСсылка это Счет фактура выданный
		Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактура.ТабличнаяЧасть.ДокументыОснования") Тогда
			Для Каждого СтрокаТЧ Из ДокументСсылка.ДокументыОснования Цикл
				КоллекцияДокументНосительОснования.Добавить(СтрокаТЧ.ДокументОснование);	
			КонецЦикла;			
		Иначе
			Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(ДокументСсылка), "ДокументОснование") Тогда
				КоллекцияДокументНосительОснования.Добавить(ДокументСсылка.ДокументОснование);
			КонецЕсли;					
		КонецЕсли;
		
	Иначе
		// в этом случае параметр ДокументСсылка это документ реализации
		КоллекцияДокументНосительОснования.Добавить(ДокументСсылка);
	КонецЕсли;
	
	УказыватьОтсутствиеОснованияУПД = СвойствоСтруктуры(ДопПараметры, "УказыватьОтсутствиеОснованияУПД", Ложь);
	
	Для Каждого ДокументМассива Из КоллекцияДокументНосительОснования Цикл
		
		СтруктураОснования = СтруктурированноеПредставлениеОснованияУПД(ДокументМассива);
			
		Если ЗначениеЗаполнено(СтруктураОснования.GroundName) Тогда
			
			Если ДобавленныеОснования.Найти(СтруктураОснования.ОснованиеСсылка) = Неопределено Тогда
				
				ДобавленныеОснования.Добавить(СтруктураОснования.ОснованиеСсылка);
				
				TransferBase = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_TransferBase");
				Content.TransferInfo.TransferBases.Добавить(TransferBase);
				
				Если Не ЗначениеЗаполнено(СтруктураОснования.GroundDate) И УказыватьОтсутствиеОснованияУПД Тогда
					ЗаполнитьTransferBaseКакОтсутствует(TransferBase);
				Иначе
					ЗаполнитьTransferBaseПоДаннымОснования(TransferBase, СтруктураОснования);
				КонецЕсли;
				
				СлужебнаяИнформация = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяСлужебнаяИнформацияОснованияПередачи");
				СлужебнаяИнформация.ОснованиеСсылка				= СтруктураОснования.ОснованиеСсылка;
				СлужебнаяИнформация.ПредставлениеВТекстеОшибки	= СтруктураОснования.ПредставлениеВТекстеОшибки;
				
				ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(TransferBase, СлужебнаяИнформация);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДобавленныеОснования.Количество() = 0 Тогда
				
		TransferBase = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_TransferBase");
		Content.TransferInfo.TransferBases.Добавить(TransferBase);
		
		ЗаполнитьTransferBaseКакОтсутствует(TransferBase);
				
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьTransferBaseПоДаннымОснования(TransferBase, СтруктураОснования)
	
	TransferBase.DocumentName	= СтруктураОснования.GroundName;
	TransferBase.DocumentNumber	= СтруктураОснования.GroundNumber;
	TransferBase.DocumentDate	= СтруктураОснования.GroundDate;
	TransferBase.DocumentInfo	= "";
	
КонецПроцедуры

Процедура ЗаполнитьTransferBaseКакОтсутствует(TransferBase)
	
	TransferBase.DocumentName	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДокументОснованиеОтгрузкиОтсутствует");
	TransferBase.DocumentNumber	= "";
	TransferBase.DocumentDate	= Дата(1, 1, 1);
	TransferBase.DocumentInfo	= "";

КонецПроцедуры

Процедура ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, ПредставлениеАдреса = "")
	
	СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента);
	
	Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ЮрФизЛицо, "СтранаРегистрации") Тогда
		СведенияОбОрганизации.Вставить("СтранаРегистрации", ЮрФизЛицо.СтранаРегистрации);
	КонецЕсли;
	
	Если стрДлина(СведенияОбОрганизации.ИНН) <> 12 Тогда
		НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ЭтоИП = Ложь;
	Иначе
		Если ТипЗнч(юрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			//для нашей организации - данные берем из нормализованного представления физлица
			НаименованиеОрганизации = юрФизЛицо.наименованиеПолное;
		Иначе
			НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		КонецЕсли;
		
		ЭтоИП = Истина;
		
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.IsSoleProprietor = ЭтоИП;
	OrganizationInfo.SameAsSellerOrBuyer = Ложь;
	OrganizationInfo.Ссылка = ЮрФизЛицо;
	
	ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, Ложь, ДатаДокумента, ПредставлениеАдреса);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации = Неопределено, ЮрАдрес, АдресДляСФ = Ложь, КППГрузоотправителя = "", ПредставлениеАдреса = "")

	ГоловноеЮрЛицо = "";

	Если АдресДляСФ = Истина Тогда
						
		Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
			
			СведенияОПодразделении= РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			СведенияОбОрганизации= 	РеквизитыЮрФизЛица(ГоловноеЮрЛицо, ДатаДокумента, БанковскийСчетОрганизации);
								
			Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ЮрФизЛицо, "СтранаРегистрации") Тогда
				СведенияОПодразделении.Вставить("СтранаРегистрации", ЮрФизЛицо.СтранаРегистрации);
			КонецЕсли;
			Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ГоловноеЮрЛицо, "СтранаРегистрации") Тогда
				СведенияОбОрганизации.Вставить("СтранаРегистрации", ГоловноеЮрЛицо.СтранаРегистрации);
			КонецЕсли;
			
			СведенияОбОрганизации.КПП = СведенияОПодразделении.КПП;
			
		Иначе
			
			СведенияОбОрганизации= РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			
			Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ЮрФизЛицо, "СтранаРегистрации") Тогда
				СведенияОбОрганизации.Вставить("СтранаРегистрации", ЮрФизЛицо.СтранаРегистрации);
			КонецЕсли;

		КонецЕсли;	
	Иначе
		
		СведенияОбОрганизации= РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
		
		Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ЮрФизЛицо, "СтранаРегистрации") Тогда
			СведенияОбОрганизации.Вставить("СтранаРегистрации", ЮрФизЛицо.СтранаРегистрации);
		КонецЕсли;

	КонецЕсли;
	
	Если СтрДлина(СведенияОбОрганизации.ИНН)<>12 Тогда 
		НаименованиеОрганизации= СведенияОбОрганизации.ПолноеНаименование;
		ЭтоИП= Ложь;
	Иначе 
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда 
			НаименованиеОрганизации= ЮрФизЛицо.НаименованиеПолное;
		Иначе 
			НаименованиеОрганизации= СведенияОбОрганизации.ПолноеНаименование 
		КонецЕсли;	  
		ЭтоИП= Истина;
	КонецЕсли;
	
	OrganizationInfo.Name= 	НаименованиеОрганизации;
	OrganizationInfo.Inn= 	СведенияОбОрганизации.ИНН;
	Если ЗначениеЗаполнено(КППГрузоотправителя) Тогда
		OrganizationInfo.Kpp= КППГрузоотправителя;
	Иначе
		OrganizationInfo.Kpp= СведенияОбОрганизации.КПП;
	КонецЕсли;

	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address, СведенияОбОрганизации, ГоловноеЮрЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса);
	Иначе
		ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса);
	КонецЕсли;
	OrganizationInfo.IsSoleProprietor= ЭтоИП;

	Если АдресДляСФ = Ложь Тогда
		OrganizationInfo.Okpo= СведенияОбОрганизации.КодПоОкпо;
		
		Если Найти(СведенияОбОрганизации.Телефоны, "факс:") > 0 Тогда 
			Телефон= СокрЛП(Лев(СведенияОбОрганизации.Телефоны, Найти(СведенияОбОрганизации.Телефоны, "факс:") - 1));
			Если Прав(Телефон, 1) = "," Тогда
				Телефон= Лев(Телефон, СтрДлина(Телефон) - 1);
			КонецЕсли;
			Факс= СокрЛП(Прав(СведенияОбОрганизации.Телефоны, СтрДлина(СведенияОбОрганизации.Телефоны) - Найти(СведенияОбОрганизации.Телефоны, "факс:") - 5));
		Иначе 
			Телефон= 	СведенияОбОрганизации.Телефоны;
			Факс= 		"";
		КонецЕсли;	
		OrganizationInfo.Phone = 			СократитьПредставлениеТелефона(Телефон);
		OrganizationInfo.Fax = СократитьПредставлениеТелефона(Факс) ;
		OrganizationInfo.BankAccountNumber = ?(ЗначениеЗаполнено(СведенияОбОрганизации.НомерСчета),  СведенияОбОрганизации.НомерСчета, "");
		OrganizationInfo.BankName =			?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк), СведенияОбОрганизации.Банк, "");
		OrganizationInfo.BankId =			?(ЗначениеЗаполнено(СведенияОбОрганизации.БИК),  СокрЛП(СведенияОбОрганизации.БИК), "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		OrganizationInfo.Вставить("Ссылка", ГоловноеЮрЛицо);
	Иначе
		OrganizationInfo.Вставить("Ссылка", ЮрФизЛицо);
	КонецЕсли;
	
КонецПроцедуры

Процедура Заполнить_ExtendedOrganizationInfo(ExtendedOrganizationInfo, ЮрФизЛицо, ДатаДокумента, ИспользоватьЮрАдрес= Ложь, БанковскийСчет= Неопределено, КППГрузоотправителя = "", ПредставлениеАдреса = "")
	
	СтранаРегистрацииКод = "";
		
	СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчет);
	Если МетодСервера( , "ЕстьРеквизитИлиСвойствоОбъектаЛок", ЮрФизЛицо, "СтранаРегистрации") Тогда
		СведенияОбОрганизации.Вставить("СтранаРегистрации", ЮрФизЛицо.СтранаРегистрации);
		СтранаРегистрацииКод = ЮрФизЛицо.СтранаРегистрации.Код;
	КонецЕсли;
	
	ЭтоОрганизация = ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации");
	ЭтоИП = СтрДлина(СведенияОбОрганизации.ИНН) = 12;
	
	Если ЭтоИП И ЭтоОрганизация Тогда
		// Для нашей организации, полное наименование берем из нормализованного представления физлица
		Если Не ПустаяСтрока(ЮрФизЛицо.ФизическоеЛицо.Наименование) Тогда
			СведенияОбОрганизации.ПолноеНаименование = ЮрФизЛицо.ФизическоеЛицо.Наименование;
		КонецЕсли;
	КонецЕсли;
	
	ExtendedOrganizationInfo.Name = 					СведенияОбОрганизации.ПолноеНаименование;
	ExtendedOrganizationInfo.Inn =  					СведенияОбОрганизации.ИНН;
	Если ЗначениеЗаполнено(КППГрузоотправителя) Тогда
		ExtendedOrganizationInfo.Kpp = 				КППГрузоотправителя;
	Иначе
		ExtendedOrganizationInfo.Kpp = 				СведенияОбОрганизации.КПП;
	КонецЕсли;
	ExtendedOrganizationInfo.Okpo = 					СведенияОбОрганизации.КодПоОкпо;
	ExtendedOrganizationInfo.CorrespondentAccount =  СведенияОбОрганизации.КоррСчет;
	
	ExtendedOrganizationInfo.BankAccountNumber = СокрЛП(СведенияОбОрганизации.НомерСчета);
	ExtendedOrganizationInfo.BankId =  			СокрЛП(СведенияОбОрганизации.БИК);
	ExtendedOrganizationInfo.BankName =   		?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк), Строка(СведенияОбОрганизации.Банк.Наименование), ""); // в некоторых случаях Банк возвращается как ссылка на справочник и компонента игнорирует такое значение, теряя данные, поэтому значение Банк преобразовано к строке 
	
	Если найти(СведенияОбОрганизации.Телефоны, "факс:") > 0 Тогда 
		телефон = СокрЛП(Лев(СведенияОбОрганизации.Телефоны, найти(СведенияОбОрганизации.Телефоны, "факс:") - 1));
		Если Прав(телефон, 1) = "," Тогда
			телефон = Лев(телефон, стрДлина(телефон) - 1);
		КонецЕсли;
	Иначе 
		Телефон = СведенияОбОрганизации.Телефоны;
	КонецЕсли;	
	
	ExtendedOrganizationInfo.Phone = СократитьПредставлениеТелефона(Телефон);
	
	Если ЭтоОрганизация И Метаданные.Справочники.Организации.Реквизиты.Найти("КодОКВЭД") <> Неопределено Тогда
		ExtendedOrganizationInfo.Okdp = ЮрФизЛицо.КодОКВЭД;
	КонецЕсли;
	
	Если ЭтоИП Тогда
		
		ExtendedOrganizationInfo.Type= "IndividualEntity";
		
		Если ДатаДокумента >= ДатаРедакции425() Тогда
			
			Если ЕстьРеквизитМетаданных(ЮрФизЛицо.Метаданные(), "ОГРН") Тогда
				ОГРНОрганизации = ЗначенияРеквизитовОбъектаЛокальная(ЮрФизЛицо, "ОГРН").ОГРН;
			Иначе
				ОГРНОрганизации = "";
			КонецЕсли;
			
			ExtendedOrganizationInfo.IndividualEntityRegistrationCertificate = СтрокаНомерСВ_2026(
				ОГРНОрганизации,
				СведенияОбОрганизации.ДатаРегистрации
			);
			
		Иначе
			ExtendedOrganizationInfo.IndividualEntityRegistrationCertificate = СведенияОбОрганизации.Свидетельство;
		КонецЕсли;
		
	Иначе
		Если Не ПустаяСтрока(СтранаРегистрацииКод) И СтранаРегистрацииКод <> "643" Тогда
			ТипОрганизации = "ForeignEntity";  
	    Иначе
			ТипОрганизации = "LegalEntity";  
		КонецЕсли;
		ExtendedOrganizationInfo.Type= ТипОрганизации;
	КонецЕсли;
	
	ExtendedOrganizationInfo.Email = ЮрФизЛицо_АдресЭлектроннойПочты(ЮрФизЛицо, ДатаДокумента, ЭтоОрганизация);
	
	ЗаполнитьСтруктурированноеОписаниеАдреса(ExtendedOrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, ИспользоватьЮрАдрес, ДатаДокумента, ПредставлениеАдреса);
	
	ExtendedOrganizationInfo.Вставить("Ссылка", ЮрФизЛицо);
	
КонецПроцедуры

Функция ДатаРедакции425()
	
	Возврат '20260101';
	
КонецФункции

Функция СтрокаНомерСВ_2026(ОГРН, ДатаРегистрации)
	
	ШаблонСтрокиНомерСВ = "%1;%2";
	
	Результат = СтрШаблон(
		ШаблонСтрокиНомерСВ,
		ОГРН,
		ДатаСтрокойЛок(ДатаРегистрации)
	);
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСтрокойЛок(ДатаСтрока)
	
	ПустоеЗначение = "";
	
	Если ПустаяСтрока(ДатаСтрока) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Попытка
		Значение = Дата(ДатаСтрока);
	Исключение
		Значение = ДатаСтрока;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
	
КонецФункции

// Заполняет массив структур поля StructedAdditionalInfos
//
// Параметры:
//  StructedAdditionalInfos - Массив - Коллекция дополнительных сведений
//  ДопСведения             - Строка - Дополнительные сведения в формате "ключ1=значение1;ключ2=значение2"
//
Процедура ЗаполнитьStructedAdditionalInfos(StructedAdditionalInfos, ДопСведения)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗаполнитьStructedAdditionalInfos", StructedAdditionalInfos, ДопСведения);
	
КонецПроцедуры

Функция ЮрФизЛицо_АдресЭлектроннойПочты(ЮрФизЛицо, ДатаДокумента, ЭтоОрганизация)
	
	ВидКИ = ?(ЭтоОрганизация
				, Справочники.ВидыКонтактнойИнформации.EmailОрганизации
				, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
	
	Результат = ПредставлениеКонтактнойИнформацииОбъекта(ЮрФизЛицо, ВидКИ, , ДатаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьДанныеДляПечати(СсылкаНаОбъект, ЭтоКСФ)
	
	ВалютаРегламентированногоУчета= ВалютаРегламентированногоУчета();
	
	//сформируем список документов-оснований
	ЭтоСФ = ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактура");
	ЭтоСФНаАванс = СчетФактураНаАванс(СсылкаНаОбъект);
	
	ДанныеДляПечати	 = ДанныеШапки(СсылкаНаОбъект); // Шапку всегда заполняем по переданному объекту
	ДанныеТЧ		 = ДанныеТабличныхЧастей(ДанныеДляПечати);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеДляПечати, ДанныеТЧ);
	
	Если Не ЗначениеЗаполнено(ДанныеТЧ) Тогда 
		
		ОписаниеОш = НСтр("ru = 'Нет данных по товарной части документа %1'");
		ОписаниеОш = СтрЗаменить(ОписаниеОш, "%1", Строка(СсылкаНаОбъект));
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
	Если ЭтоСФ Тогда
		ДанныеДляПечати.Вставить("СФНаАванс", ЭтоСФНаАванс);
	КонецЕсли;
	
	//формируем ТЧ
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", ТаблицаЗначений_2_МассивСтруктур(ДанныеТЧ));
				
	//формируем список ПРС
	Запрос= Новый Запрос;
	
	Запрос.Текст= "ВЫБРАТЬ
		|	ПРС.ДатаПлатежноРасчетногоДокумента 	КАК ДатаПлатежноРасчетногоДокумента,
		|	ПРС.НомерПлатежноРасчетногоДокумента 	КАК НомерПлатежноРасчетногоДокумента
		|ИЗ
		|	Документ.СчетФактура.ДатаНомерДокументовОплаты КАК ПРС
		|ГДЕ
		|	ПРС.Ссылка = &Ссылка
		|	И ПРС.НомерПлатежноРасчетногоДокумента 	<> """"
		|	И ПРС.ДатаПлатежноРасчетногоДокумента	<> ДАТАВРЕМЯ(1, 1, 1)";
		
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	ТаблицаДатаНомерДокументовОплаты= Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПечати.Вставить("ДатаНомерДокументовОплаты", ТаблицаЗначений_2_МассивСтруктур(ТаблицаДатаНомерДокументовОплаты));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

// Возвращает информацию о стране происхождения товара в виде структуры.
//
// Параметры:
//  СтрокаДанных - СтрокаТаблицыЗначений - Строка табличной части Товары.
//
// Возвращаемое значение:
//   Структура - Сведения о стране происхождения товара для поля StructedAdditionalInfo:
//      * СтранаПроисхождения - СправочникСсылка.СтраныМира - Страна происхождения товара.
//      * НомерГТД            - СправочникСсылка.НомераГТД - Номер грузовой таможенной декларации.
//
Функция КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных)
	
	Результат = Новый Структура;
	Результат.Вставить("СтранаПроисхождения"	, СтрокаДанных.СтранаПроисхождения);
	Результат.Вставить("НомерГТД"				, СтрокаДанных.НомерГТД);
	
	Возврат Результат;

КонецФункции

//} ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ Get content

////////////////////////////////////////////////////////////////////////////////
//{ Get UniversalCorrectionDocument content


Процедура ЗаполнитьInvoiceForCorrectionInfo(Invoices, ДатаНомерДокумента)
	
	Item_InvoiceForCorrectionInfo = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceForCorrectionInfo");
	
	Item_InvoiceForCorrectionInfo.InvoiceNumber	 = ДатаНомерДокумента.НомерИсходногоДокумента;
	Item_InvoiceForCorrectionInfo.InvoiceDate	 = ДатаНомерДокумента.ДатаИсходногоДокумента;
	
	Если ДатаНомерДокумента.УчитыватьИсправлениеИсходногоДокумента Тогда 
		
		Item_InvoiceRevisionInfo = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceRevisionInfo");
		
		Item_InvoiceRevisionInfo.RevisionNumber	 = ДатаНомерДокумента.НомерИсправленияИсходногоДокумента;
		Item_InvoiceRevisionInfo.RevisionDate	 = ДатаНомерДокумента.ДатаИсправленияИсходногоДокумента;
		
		Item_InvoiceForCorrectionInfo.InvoiceRevisions.Добавить(Item_InvoiceRevisionInfo);
		
	КонецЕсли;
	
	Invoices.Добавить(Item_InvoiceForCorrectionInfo);
	
КонецПроцедуры

Процедура ЗаполнитьInvoiceCorrectionTable(InvoiceCorrectionTable, ТаблицаТоваров)
	
	ВсеСтроки_СтавкаНДС_БезНДС	 = Истина;
	ВсеСтроки_СтавкаНДС_ИсчНалАг = Истина;
	
	ЕстьУвеличение = Ложь;
	ЕстьУменьшение = Ложь;
	
	TotalsDec_Total 				= 0;
	TotalsDec_TotalWithVatExcluded 	= 0;
	TotalsDec_Vat 					= 0;
	TotalsDec_ЕстьСтрокаСНДС 		= Ложь;
	
	TotalsInc_Total 				= 0;
	TotalsInc_TotalWithVatExcluded 	= 0;
	TotalsInc_Vat 					= 0;
	TotalsInc_ЕстьСтрокаСНДС 		= Ложь;
	
	СтруктураItemInvoiceCorrection = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ExtendedInvoiceCorrectionItem");
	
	СтавкаНДС_БезНДС   = МетодСервера(, "СтавкаНДС_БезНДС");
	СтавкаНДС_ИсчНалАг = МетодСервера(, "СтавкаНДС_ИсчНалАг");
	
	Для каждого СтрокаДанных Из ТаблицаТоваров Цикл
		
		Item = СкопироватьСтруктуру(СтруктураItemInvoiceCorrection);
		
		Item.AmountsDec 		= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.AmountsInc 		= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.OriginalValues 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		Item.CorrectedValues 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		
		Item.Product		= СтрокаДанных.НоменклатураПредставление;
		Item.ItemVendorCode	= СтрокаДанных.НоменклатураКод;
		
		СтавкаДоИзменения = СтрокаДанных.СтавкаНДСДоИзменения;
		Если Не ЗначениеЗаполнено(СтавкаДоИзменения) Тогда
			СтавкаДоИзменения = СтрокаДанных.СтавкаНДС;
		КонецЕсли;
		
		Item.CorrectedValues.TaxRate = ПредставлениеСтавкиНДС(СтрокаДанных.СтавкаНДС);
		Item.OriginalValues.TaxRate  = ПредставлениеСтавкиНДС(СтавкаДоИзменения);
		
		Если Item.CorrectedValues.TaxRate <> СтавкаНДС_БезНДС Тогда
			ВсеСтроки_СтавкаНДС_БезНДС = Ложь;
		КонецЕсли;
		Если Item.CorrectedValues.TaxRate <> СтавкаНДС_ИсчНалАг Тогда
			ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
		КонецЕсли;
		
		Item.OriginalValues. TotalWithVatExcluded = СтрокаДанных.СуммаСНДСДоИзменения - СтрокаДанных.СуммаНДСДоИзменения;
		Item.CorrectedValues.TotalWithVatExcluded = СтрокаДанных.СуммаСНДС 			  - СтрокаДанных.СуммаНДС;
		
		Если  ЗначениеЗаполнено(СтрокаДанных.КоличествоДоИзменения)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзмененияКод) Тогда
			
			Item.OriginalValues.Quantity = СтрокаДанных.КоличествоДоИзменения;
			Item.OriginalValues.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.ЕдиницаИзмеренияДоИзмененияКод));
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Наименование) Тогда
				Item.OriginalValues.UnitName = СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Наименование;
			Иначе
				Item.OriginalValues.UnitName = НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(Item.OriginalValues.UnitCode);
			КонецЕсли;
			
			Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(СтрокаДанных.СтавкаНДСДоИзмененияПредставление) Тогда
				Item.OriginalValues.Price = СтрокаДанных.ЦенаДоИзменения;
			Иначе
				Item.OriginalValues.Price = Окр(Item.OriginalValues.TotalWithVatExcluded / Item.OriginalValues.Quantity, 2);
			КонецЕсли;
			
			Item.OriginalValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмеренияДоИзменения;
			
		Иначе
			// по аналогии с модулем ОФ
			// не инициируем поля UnitCode, UnitName, Quantity, Price, чтобы в печатной форме ЭД были прочерки   
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(СтрокаДанных.Количество)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) 
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияКод) Тогда
			
			Item.CorrectedValues.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.ЕдиницаИзмеренияКод));
									
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения.Наименование) Тогда
				Item.CorrectedValues.UnitName = СтрокаДанных.ЕдиницаИзмерения.Наименование;
			Иначе
				Item.CorrectedValues.UnitName = НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(Item.CorrectedValues.UnitCode);
			КонецЕсли;
			
			// если до количество было, а теперь его не стало - заполняем 0, а не "-"!!!
			Если ЗначениеЗаполнено(СтрокаДанных.КоличествоДоИзменения) И НЕ ЗначениеЗаполнено(СтрокаДанных.Количество) Тогда
				Item.CorrectedValues.Quantity 	= 0;
			Иначе
				Item.CorrectedValues.Quantity 	= СтрокаДанных.Количество;
				
				Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(СтрокаДанных.СтавкаНДС) Тогда
					Item.CorrectedValues.Price	= СтрокаДанных.Цена;	
				Иначе
					Item.CorrectedValues.Price 	= Окр(Item.CorrectedValues.TotalWithVatExcluded / СтрокаДанных.Количество, 2);
				КонецЕсли;
			КонецЕсли;
			
			Item.CorrectedValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмерения;
			
		Иначе
			// по аналогии с модулем ОФ
			// не инициируем поля UnitCode, UnitName, Quantity, Price, чтобы в печатной форме ЭД были прочерки   
		КонецЕсли;
		
		// НДС и сумма с НДС до изменения
		Если Item.OriginalValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.OriginalValues.Vat = 0;
			Item.OriginalValues.Total = 0;
		Иначе
			
			Если Item.OriginalValues.TaxRate = СтавкаНДС_БезНДС Тогда
				Item.OriginalValues.Vat = Неопределено;
			Иначе
				Item.OriginalValues.Vat = СтрокаДанных.СуммаНДСДоИзменения;
			КонецЕсли;
			
			Item.OriginalValues.Total   = СтрокаДанных.СуммаСНДСДоИзменения;
			
		КонецЕсли;
		
		// НДС и сумма с НДС после изменения
		Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.CorrectedValues.Vat = 0;
			Item.CorrectedValues.Total = 0;
		Иначе
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
				Item.CorrectedValues.Vat = Неопределено;
			Иначе
				Item.CorrectedValues.Vat = СтрокаДанных.СуммаНДС;
			КонецЕсли;
			
			Item.CorrectedValues.Total = СтрокаДанных.СуммаСНДС;
			
		КонецЕсли;
		
		Если Item.CorrectedValues.TotalWithVatExcluded >= Item.OriginalValues.TotalWithVatExcluded Тогда
			
			// Увеличение
			ЕстьУвеличение = Истина;
			
			Item.AmountsDec.TotalWithVatExcluded = Неопределено;
			Item.AmountsDec.Vat = Неопределено;
			Item.AmountsDec.Total = Неопределено;
			
			Item.AmountsInc.TotalWithVatExcluded = Item.CorrectedValues.TotalWithVatExcluded - Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsInc.Vat = Неопределено;
				Item.AmountsInc.Total = Неопределено;
			Иначе
				
				Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
					Item.AmountsInc.Vat = 0;
				Иначе
					Item.AmountsInc.Vat = МетодСервера(, "ПривестиКЧислу", Item.CorrectedValues.Vat) - МетодСервера(, "ПривестиКЧислу", Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsInc.Total = Item.CorrectedValues.Total - Item.OriginalValues.Total;
				
			КонецЕсли;
			
		Иначе
			
			// Уменьшение
			ЕстьУменьшение = Истина;
			
			Item.AmountsInc.TotalWithVatExcluded = Неопределено;
			Item.AmountsInc.Vat = Неопределено;
			Item.AmountsInc.Total = Неопределено;
			
			Item.AmountsDec.TotalWithVatExcluded = - Item.CorrectedValues.TotalWithVatExcluded + Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsDec.Vat = Неопределено;
				Item.AmountsDec.Total = Неопределено;
			Иначе
				
				Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
					Item.AmountsDec.Vat = 0;
				Иначе
					Item.AmountsDec.Vat = - МетодСервера(, "ПривестиКЧислу", Item.CorrectedValues.Vat) + МетодСервера(, "ПривестиКЧислу", Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsDec.Total = -Item.CorrectedValues.Total + Item.OriginalValues.Total;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Item.CorrectedValues.Excise = СтрокаДанных.СуммаАкциза;
		Item.OriginalValues.Excise = СтрокаДанных.СуммаАкцизаДоИзменения;
		
		Если Item.OriginalValues.Excise <> Неопределено Или Item.CorrectedValues.Excise <> Неопределено Тогда
			
			ВеличинаИзменения =
				ПривестиКЧислуЛок(Item.CorrectedValues.Excise)
				- ПривестиКЧислуЛок(Item.OriginalValues.Excise);
			
			Если ВеличинаИзменения >= 0 Тогда
				Item.AmountsInc.Excise = ВеличинаИзменения;
				Item.AmountsDec.Excise = Неопределено;
			Иначе
				Item.AmountsInc.Excise = Неопределено;
				Item.AmountsDec.Excise = - ВеличинаИзменения;
			КонецЕсли;
			
		КонецЕсли;
		
		TotalsDec_Total 				= TotalsDec_Total + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.Total);
		TotalsDec_TotalWithVatExcluded 	= TotalsDec_TotalWithVatExcluded + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.TotalWithVatExcluded);
		TotalsDec_Vat 					= TotalsDec_Vat + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.Vat);
		
		TotalsInc_Total 				= TotalsInc_Total + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.Total);
		TotalsInc_TotalWithVatExcluded 	= TotalsInc_TotalWithVatExcluded + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.TotalWithVatExcluded);
		TotalsInc_Vat 					= TotalsInc_Vat + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.Vat);
			
		СведенияОСтранеПроисхожденияТовара	= КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных);
		ДопИнформацияОСтранеПроисхождения	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "СведенияОСтранеПроисхожденияСтрокой", СведенияОСтранеПроисхожденияТовара);
		
		ЗаполнитьStructedAdditionalInfos(Item.StructedAdditionalInfos, ДопИнформацияОСтранеПроисхождения);
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		
		InvoiceCorrectionTable.Items.Добавить(Item);
		
	КонецЦикла;
	
	Если ЕстьУвеличение Тогда
		InvoiceCorrectionTable.TotalsInc.Total 					= TotalsInc_Total; 
		InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded	= TotalsInc_TotalWithVatExcluded; 
		InvoiceCorrectionTable.TotalsInc.Vat 					= ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, TotalsInc_Vat)); 
	КонецЕсли;
	
	Если ЕстьУменьшение Тогда
		InvoiceCorrectionTable.TotalsDec.Total					= TotalsDec_Total; 
		InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded	= TotalsDec_TotalWithVatExcluded; 
		InvoiceCorrectionTable.TotalsDec.Vat 					= ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, TotalsDec_Vat)); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьEventContent(EventContent, ШапкаУКД)
	
	Для Каждого ПередаточныйДокумент Из ШапкаУКД.РеквизитыПередаточныхДокументов Цикл	
		Новый_BaseDocument = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_BaseDocumentName");
		ЗаполнитьЗначенияСвойств(Новый_BaseDocument, ПередаточныйДокумент);
		EventContent.TransferDocDetails736.Добавить(Новый_BaseDocument);	
	КонецЦикла;
	Если ШапкаУКД.Свойство("ИныеСведенияОбИзмененииСтоимости") Тогда
		EventContent.CostChangeInfo = ШапкаУКД.ИныеСведенияОбИзмененииСтоимости;
	КонецЕсли;
	Если ШапкаУКД.Свойство("ДатаУведомления") Тогда
		EventContent.NotificationDate = ШапкаУКД.ДатаУведомления;
	КонецЕсли;
	
	EventContent.OperationContent = "Изменение стоимости товаров и услуг";
	
	CorrectionBases 				= Новый Массив;
	СтруктураItemCorrectionBases 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CorrectionBase");
	
	ОснованияПередачи = ШапкаУКД.ОснованияПередачи;
	Если ОснованияПередачи.Количество() > 0 Тогда
		СкопироватьСтруктуру(СтруктураItemCorrectionBases);
		Для Каждого ОснованиеПередачи Из ОснованияПередачи Цикл
			ItemCorrectionBases = СкопироватьСтруктуру(СтруктураItemCorrectionBases);
			ЗаполнитьЗначенияСвойств(ItemCorrectionBases, ОснованиеПередачи);
			CorrectionBases.Добавить(ItemCorrectionBases);
		КонецЦикла;
	Иначе
		СтруктураItemCorrectionBases.BaseDocumentName = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОснованиеПередачи_БезДокументаОснования");
		CorrectionBases.Добавить(СтруктураItemCorrectionBases);
	КонецЕсли;
	
	EventContent.CorrectionBases = CorrectionBases;
	
КонецПроцедуры

//} Get UniversalCorrectionDocument content
////////////////////////////////////////////////////////////////////////////////

//} Get content
////////////////////////////////////////////////////////////////////////////////

//} РАБОТА С КОНТЕНТОМ
////////////////////////////////////////////////////////////////////////////////

//{ ОБЕРТКИ

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита, ЗначениеРеквизита = Неопределено)
	
	Результат = МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", Объект, ИмяРеквизита, ЗначениеРеквизита);
	
	Возврат Результат;
	
КонецФункции

//} ОБЕРТКИ

////////////////////////////////////////////////////////////////////////////////
//{ УСТАРЕЛИ

	// Устарела. Следует использовать ДанныеТабличныхЧастей()
	//
	Функция ПолучитьДанныеТЧ(Документы, ВалютаРегламентированногоУчета, КолонкаКодаТовара = "Код", ФормированиеСФ = Неопределено, СчетФактура = Неопределено, РасчетыВУЕ = Ложь) Экспорт
		
		Если Не ЗначениеЗаполнено(Документы) И Не ЗначениеЗаполнено(СчетФактура) Тогда 
			ОписаниеОш = НСтр("ru = 'Метод ""ПолучитьДанныеТЧ"" получил неверные параметры!
	                           |Обратитесь в тех. поддержку.'");
			ВызватьИсключение ОписаниеОш;
		КонецЕсли;
		
		Если ТипЗнч(Документы) = Тип("Массив") Тогда
			МассивДокументов = Документы;
		ИначеЕсли ТипЗнч(Документы) = Тип("СписокЗначений") Тогда
			МассивДокументов = Документы.ВыгрузитьЗначения();
		Иначе 
			МассивДокументов = Новый Массив;                               
			МассивДокументов.Добавить(Документы);
		КонецЕсли;
		
		Если СчетФактураНаАванс(СчетФактура) Тогда 
			МассивДокументов.Добавить(СчетФактура);
		КонецЕсли;
		
		Результат = Новый Соответствие;
		
		Для Каждого Ссылка Из МассивДокументов Цикл 
			Шапка	 = ДанныеШапки(Ссылка);
			ДанныеТЧ = ДанныеТабличныхЧастей(Шапка);
			ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ДанныеТЧ);
			Результат.Вставить(Ссылка, ДанныеТЧ);
		КонецЦикла;
		
		Возврат Результат;
		
	КонецФункции

//} УСТАРЕЛИ
////////////////////////////////////////////////////////////////////////////////
