//@strict-types
//@skip-check bsl-variable-name-invalid
//@skip-check method-too-many-params

////////////////////////////////////////////////////////////////////////////////
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Служебный программный интерфейс

// Версия совместимости больше или равна 8.3.6.
// 
// Возвращаемое значение:
//  Булево - Версия совместимости больше или равна 8.3.6
Функция ВерсияСовместимостиБольшеРавно8_3_6Лок() Экспорт
	
	Возврат ВерсияСовместимостиБольшеРавноЛок("8.3.6");
	
КонецФункции

// Версия совместимости больше или равна.
// 
// Параметры:
//  ВерсияСтрокой - Строка - Версия строкой в формате 8.3.6
// 
// Возвращаемое значение:
//  Булево - Версия совместимости больше или равна версии в параметре
Функция ВерсияСовместимостиБольшеРавноЛок(ВерсияСтрокой) Экспорт
	
	ВерсияСовместимостиБольшеРавно = Истина;
	Если Метаданные.РежимСовместимости = Неопределено
		Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
			
		ВерсияСовместимостиБольшеРавно =
			КонтурДиадокСтдСтрКлиентСервер.СравнитьВерсииЛок(ВерсияПриложенияЛок(), ВерсияСтрокой) >= 0;
			
	Иначе
		
		РежимСовместимости = Строка(Метаданные.РежимСовместимости);
		РежимСовместимости = СтрЗаменить(РежимСовместимости, "Версия", "");
		РежимСовместимости = СтрЗаменить(РежимСовместимости, "Version", ""); // для англ варианта
		РежимСовместимости = СтрЗаменить(РежимСовместимости, "_", ".");
		ВерсияСовместимостиБольшеРавно =
			КонтурДиадокСтдСтрКлиентСервер.СравнитьВерсииЛок(РежимСовместимости, ВерсияСтрокой) >= 0;
			
	КонецЕсли;
	
	Возврат ВерсияСовместимостиБольшеРавно;
	
КонецФункции

Функция ВерсияПриложенияЛок() Экспорт
	
	СистемнаяИнфо = Новый СистемнаяИнформация;
	
	Возврат СистемнаяИнфо.ВерсияПриложения;
	
КонецФункции
