// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем ОсновнойМодуль Экспорт;

// Кэш ссылок на служебные прайс-листы, используемые при чтении/записи сопоставления номенклатуры
Перем СоответствиеПрайсЛистовПоставщиков;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//{ СлужебныйПрограммныйИнтерфейс

// Событие возникает при определении фактического места хранения контактной информации объекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации")
//			И СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
//			
//			СтандартнаяОбработка = Ложь;
//			ХранилищеКИ = СсылкаНаОбъект.ИндивидуальныйПредприниматель;
//			
//		КонецЕсли;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие позволяет переопределить алгоритм вычисления вида контактной информации,
// соответствующего юр./физ. лицу и указанному типу контактной информации.
//
// Параметры:
//  ВидКИ - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации;
//  ЮрФизЛицо - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  ТипКИ - Строка - тип контактной информации (см. Перечисление_ВидыКИ);
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		
//		Если ТипКИ = Перечисление_ВидыКИ().ЮридическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
//		ИначеЕсли ТипКИ = Перечисление_ВидыКИ().ФактическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресФактический;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ВидКИ) Тогда
//			СтандартнаяОбработка = Ложь;
//		КонецЕсли;
//
Процедура ПриПолученииВидаКонтактнойИнформации(ВидКИ, ЮрФизЛицо, ТипКИ, СтандартнаяОбработка) Экспорт
	
	Если ТипКИ = "ЮридическийАдрес" Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
	ИначеЕсли ТипКИ = "ФактическийАдрес" Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидКИ) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Событие возникает при получении сведений об организации, контрагенте или физическом лице.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ДокументыПередачи = ДокументыВладельцыКодовМаркировки(СсылкаНаОбъект);
	
	Для Каждого ДокументПередачи Из ДокументыПередачи Цикл
		ДополнитьТаблицуКодовМаркировки(Результат, ДокументПередачи);
	КонецЦикла;
	
КонецПроцедуры

// Загружает сведения о маркировке из товарной части ЭД в информационную базу.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов.
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить загрузку средствами библиотеки интеграции ИС МП.
//
Процедура ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, СтандартнаяОбработка) Экспорт
	
	// Коды загружаются в при создании документа ПоступлениеТоваров (см. СоздатьДокументПоступлениеТоваровУслуг)
	// Это необходимо делать там, чтобы связать строки табличных частей КодыМаркировки и Товары
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Заполняет список правил создания и заполнения документов учета.
//
// Параметры:
//  ПравилаСоздания - СписокЗначений - (возвращаемый параметр) идентификаторы правил создания и их представления.
//  ФорматЭД - Структура - см. ОсновнойМодуль.НовоеОписаниеФорматаЭлектронногоДокумента.
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения правил.
//
Процедура ПриЗаполненииПравилСозданияДокументовУчета(ПравилаСоздания, ФорматЭД, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФорматыЭД = МодульФорматыЭлектронныхДокументов();
	
	Если ФорматыЭД.ЭтоУниверсальныйПередаточныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоПередаточныйДокумент(ФорматЭД) Тогда
		
		Операция = ОперацияПоступлениеТоваров();
		Представление = "Поступление товаров";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоСчетФактура(ФорматЭД)
		ИЛИ ФорматыЭД.ЭтоКорректировочныйСчетФактура(ФорматЭД) Тогда
		
		Операция = ОперацияСчетФактураПолученный();
		Представление = "Счет-фактура полученный";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка создания и заполнения документа учета по указанному правилу.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - (возвращаемый параметр) Заполняемый объект.
//  ИдентификаторОпераци - Строка - идентификатор правила создания и заполнения документа учета.
//  ПараметрыСоздания - Структура - см. ОсновнойМодуль.ПараметрыСозданияДокументаИнформационнойБазы.
//  ДанныеЭД - Структура - разобранное содержимое электронного документа (см. ОсновнойМодуль.ДанныеЭлектронногоДокумента)
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения объекта.
//
Процедура ПриСозданииДокументаУчета(ДокументОбъект, ИдентификаторОперации, ПараметрыСоздания, ДанныеЭД, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФорматЭД = ДанныеЭД.Формат;
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТабличнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	Если ИдентификаторОперации = ОперацияПоступлениеТоваров() Тогда
		
		ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
		ЗаполнитьШапкуПоступленияТоваровУслуг(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьПоступленияТоваровУслуг(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияАктСверкиВзаиморасчетов() Тогда
		
		ДокументОбъект = Документы.АктСверкиВзаиморасчетов.СоздатьДокумент();
		ЗаполнитьШапкуАктаСверкиВзаиморасчетов(ДокументОбъект, ПараметрыСоздания, ШапкаЭД, ИтогиЭД);
		ЗаполнитьТабличнуюЧастьАктаСверкиВзаиморасчетов(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияСчетФактураПолученный() Тогда
		
		Ошибка = "Создание счетов-фактур в текущей конфигурации не поддерживается.";
		ВызватьИсключение Ошибка;
		
	Иначе
		
		Ошибка = "Неизвестный идентификатор операции (%1)";
		Ошибка = СтрЗаменить(Ошибка, "%1", ИдентификаторОперации);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Идентификатор Из ИдентификаторыНоменклатуры Цикл
		
		НоменклатураИБ = ПолучитьНоменклатуруИнформационнойБазы(ВладелецНоменклатуры, Идентификатор);
		
				
		Если НЕ ЗначениеЗаполнено(НоменклатураИБ) Тогда
			// Миграция данных из устаревшего хранилища по требованию
			НоменклатураИБ = ПеренестиСопоставлениеНоменклатуры_ПрайсЛистыКонтрагентов(ВладелецНоменклатуры, Идентификатор);
		КонецЕсли;

		
		Результат.Вставить(Идентификатор, НоменклатураИБ);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Номенклатура = НоменклатураИБ.Номенклатура;
	Характеристика = НоменклатураИБ.Характеристика;
	
	ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура, Характеристика);
	
КонецПроцедуры

// Заполняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента 
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы переопределить стандартный обработчик
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//  НаборНоменклатуры - Массив из ЛюбаяСсылка - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(СвойстваНоменклатурИБ, НаборНоменклатуры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Возвращает признак применения Федерального Закона 
// который вводит понятие прослеживаемости для определенных групп товаров
// Параметры:
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ применяется
//           Ложь   - ФЗ не применяется
Функция ИспользуетсяУчетПрослеживаемыхТоваров(Дата) Экспорт
	
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальнаяЛогика.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура	- ДокументСсылка.СчетФактураВыданный	- счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат = Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Получает ссылку на документ, на который оформлена корректировка.
//
// Параметры:
//  КорректировочныйДокумент - ЛюбаяСсылка - Корректировочный документ (корректировка реализации или корректировочный счет-фактура)
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, Неопределено - ссылка на корректируемый документ.
//
Функция КорректируемыйДокумент(КорректировочныйДокумент) Экспорт
	
	ТипДокумента = ТипЗнч(КорректировочныйДокумент);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ДокументыОснования = ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(КорректировочныйДокумент);
		ИсправляемыйДокументРеализации = ПолучитьИсправляемыйДокументРеализации(ДокументыОснования[0]);
		Результат = ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ИсправляемыйДокументРеализации);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ИсправляемыйДокументРеализации = ПолучитьИсправляемыйДокументРеализации(КорректировочныйДокумент);
		Результат = ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ИсправляемыйДокументРеализации);
		
	Иначе
		
		КонтекстПроверки = "ИнтеграционныйМодуль.КорректируемыйДокумент";
		ПараметрИмя = "КорректировочныйДокумент";
		ПараметрПредставление = Строка(КорректировочныйДокумент);
		Если КорректировочныйДокумент = Неопределено Тогда
			ПараметрПредставление = "Неопределено";
		КонецЕсли;
		
		Ошибка = ОсновнойМодуль.ПодставитьПараметрыВСтроку(
			"Недопустимое значение параметра %1 (передано значение: %2) в %3",
			ПараметрИмя,
			ПараметрПредставление,
			КонтекстПроверки
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} СлужебныйПрограммныйИнтерфейс

//{ СлужебныеПроцедурыИФункции

Функция МодульФорматыЭлектронныхДокументов()
	
	ИмяМодуля = "ФорматыЭД";
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция ОперацияПоступлениеТоваров()
	Возврат "ПоступлениеТоваров";
КонецФункции

Функция ОперацияСчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

Функция ОперацияАктСверкиВзаиморасчетов()
	Возврат "АктСверкиВзаиморасчетов";
КонецФункции

Процедура ЗаполнитьШапкуПоступленияТоваровУслуг(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьПодразделениеДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	
	УстановитьПараметрыОтраженияДокументаВУчете(ДокументОбъект);
	УстановитьОперациюПоступлениеТоваров(ДокументОбъект);
	УстановитьСкладДокумента(ДокументОбъект);
	УстановитьТипЦенДокумента(ДокументОбъект);
	
КонецПроцедуры

// Генерирует идентификатор строки табличной части документа.
// 
// Возвращаемое значение:
//  Строка - строковое представление уникального идентификатора.
//
Функция НовыйИдентификаторСтрокиТЧ()
	
	Результат = Строка(Новый УникальныйИдентификатор);
	Возврат Результат;
	
КонецФункции

// Формирует структуру для безопасного заполнения идентификатора строки табличной части учетного документа.
//
// Параметры:
//  ИдентификаторСтроки - Строка - (Необязательный) идентификатор строки табличной части.
//                                 Если не задан, формируется новый.
// 
// Возвращаемое значение:
//  Структура - содержит возможные имена свойств для записи идентификатора строки.
//
Функция ЗначенияЗаполненияИдентификатораСтрокиТЧ(Знач ИдентификаторСтроки = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		ИдентификаторСтроки = НовыйИдентификаторСтрокиТЧ();
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторТовара", ИдентификаторСтроки);
	Результат.Вставить("ИдентификаторАвтомобиля", ИдентификаторСтроки);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьПоступленияТоваровУслуг(ДокументОбъект, ТабличнаяЧасть)
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	ЕстьКодыМаркировки = ЕстьШтрихкодыУпаковок(ОбъектМетаданных);
	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		ИдентификаторСтроки = НовыйИдентификаторСтрокиТЧ();
		ЗначениеСвойстваИдентификатор = ЗначенияЗаполненияИдентификатораСтрокиТЧ(ИдентификаторСтроки);
		
		Номенклатура = Неопределено;
		Характеристика = Неопределено;
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура = НоменклатураИБ.Номенклатура;
			Характеристика = НоменклатураИБ.Характеристика;
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЗначениеСвойстваИдентификатор);
		
		СтрокаТЧ.Номенклатура= Номенклатура;
		СтрокаТЧ.ХарактеристикаНоменклатуры = Характеристика;
		СтрокаТЧ.ЕдиницаИзмерения = ЕдиницаИзмеренияНоменклатуры(Номенклатура, СтрокаДанных.КодЕдИзм);
		СтрокаТЧ.Коэффициент = 1;
		
		СтрокаТЧ.СтавкаНДС = ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
		СтрокаТЧ.Количество			= СтрокаДанных.Количество;
		СтрокаТЧ.КоличествоБазовое 	= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		СтрокаТЧ.Цена				= СтрокаДанных.Цена;
		СтрокаТЧ.Сумма				= СтрокаДанных.СуммаБезНДС;
		СтрокаТЧ.СуммаНДС			= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СуммаВсего			= СтрокаДанных.СуммаСНДС;
		
		ДокументОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаТЧ);
		
		Если ЗначениеЗаполнено(СтрокаДанных.НомерГТД) Тогда
			СтранаПроисхождения = СтранаПоКлассификатору(СтрокаДанных.КодСтраны);
			СтрокаТЧ.ГТД = НайтиИлиСоздатьГТД(СтрокаДанных.НомерГТД, СтранаПроисхождения);
		КонецЕсли;
		
		Если ЕстьКодыМаркировки Тогда
			
			ДополнитьКодыМаркировки(
				ДокументОбъект.КодыМаркировки,
				СтрокаДанных.СведенияОМаркировке,
				ИдентификаторСтроки,
				СтрокаДанных.НоменклатураДокумента.GTIN
			);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуСчетаФактурыПолученного(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	ЗаполнитьПоДокументуОснованию(ДокументОбъект, ПараметрыСоздания.ДокументОснование);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьШапкуАктаСверкиВзаиморасчетов(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента, ИтогиТЧ)
	
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	
	УстановитьПодразделениеДокумента(ДокументОбъект);
	
	УстановитьРеквизитыСверкиВзаиморасчетов(ДокументОбъект, РеквизитыЭлектронногоДокумента, ИтогиТЧ);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьАктаСверкиВзаиморасчетов(ДокументОбъект, ТабличнаяЧастьЭД)
	
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		
		ДоговорВзаиморасчетов = ДоговорПоСтрокеАктаСверки(ДокументОбъект, СтрокаДоговора);
		
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ДокументОбъект.ПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
				СтрокаПоДаннымКонтрагента.Дата = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.Представление = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.УвеличениеДолга = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.УменьшениеДолга = СтрокаОперации.СуммаКредит;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьРеквизитыСверкиВзаиморасчетов(ДокументОбъект, РеквизитыЭлектронногоДокумента, ИтогиТЧ)
	
	ДатаДокумента = ТекущаяДата();
	
	ВалютаРегл = ВалютаРегламентированногоУчета();
	КурсыРегл = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаДокумента, Новый Структура("Валюта", ВалютаРегл));
	
	ВалютаУпр = ВалютаУправленческогоУчета();
	КурсыУпр = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаДокумента, Новый Структура("Валюта", ВалютаУпр));
	
	ДокументОбъект.Дата = ДатаДокумента;
	ДокументОбъект.Автор = ТекущийПользователь();
	ДокументОбъект.ВалютаДокумента = ВалютаРегл;
	ДокументОбъект.КурсДокумента = КурсыРегл.Курс;
	ДокументОбъект.КурсВалютыУпр = КурсыУпр.Курс;
	ДокументОбъект.ОстатокНаНачало = ИтогиТЧ.СальдоНачДеб - ИтогиТЧ.СальдоНачКр;
	ДокументОбъект.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	ДокументОбъект.ХозОперация = Справочники.ХозОперации.АктСверкиВзаиморасчетов;
	ДокументОбъект.СверкаСогласована = Ложь;
	
	ДокументОбъект.ДатаНачала = РеквизитыЭлектронногоДокумента.ДатаНачала;
	ДокументОбъект.Датаокончания = РеквизитыЭлектронногоДокумента.Датаокончания;
	
КонецПроцедуры

Функция ДоговорПоСтрокеАктаСверки(ДокументОбъект, ДанныеДоговора)
	
	Результат = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Организация = ДокументОбъект.Организация;
	Контрагент = ДокументОбъект.Контрагент;
	НомерДоговора = ДанныеДоговора.Номер;
	ДатаДоговора = ДанныеДоговора.Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ДоговорПоСтрокеАктаСверки();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дата", ДатаДоговора);
	Запрос.УстановитьПараметр("Номер", НомерДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДоговорПоСтрокеАктаСверки()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТаблицаДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ТаблицаДоговорыВзаиморасчетов
	|ГДЕ
	|	ТаблицаДоговорыВзаиморасчетов.Организация = &Организация
	|	И ТаблицаДоговорыВзаиморасчетов.Владелец = &Контрагент
	|	И ТаблицаДоговорыВзаиморасчетов.ДатаНачала = &Дата
	|	И ТаблицаДоговорыВзаиморасчетов.НомерДоговора = &Номер
	|	И НЕ ТаблицаДоговорыВзаиморасчетов.ПометкаУдаления";
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПоДокументуОснованию(ДокументОбъект, ДокументОснование)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.Заполнить(ДокументОснование);
	
КонецПроцедуры

Процедура УстановитьОрганизациюДокумента(ДокументОбъект, Знач Организация)
	
	ДокументОбъект.Организация = Организация;
	
КонецПроцедуры

Процедура УстановитьКонтрагентаДокумента(ДокументОбъект, Знач Контрагент)
	
	ДокументОбъект.Контрагент = Контрагент;
	
КонецПроцедуры

Процедура УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента)
	
	ДокументОбъект.ВхДокДата = РеквизитыЭлектронногоДокумента.Дата;
	ДокументОбъект.ВхДокНомер = РеквизитыЭлектронногоДокумента.Номер;
	
КонецПроцедуры

Процедура УстановитьВалютуДокумента(ДокументОбъект)
	
	ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета();
	ДокументОбъект.КурсДокумента = 1;
	ДокументОбъект.КурсВалютыУпр = 1;
	ДокументОбъект.КурсВалютыВзаиморасчетов = 1;
	
КонецПроцедуры

Процедура УстановитьСкладДокумента(ДокументОбъект)
	
	ВыводитьОшибки = Истина;
	
	Склад = обПраво(
		"ОсновнойСкладКомпании",
		ДокументОбъект.Права,
		ВыводитьОшибки,
		ДокументОбъект
	);
	
	ДокументОбъект.СкладКомпании = Склад;
	
КонецПроцедуры

Процедура УстановитьТипЦенДокумента(ДокументОбъект)
	
	ВыводитьОшибки = Истина;
	
	ТипЦен = обПраво(
		"ОсновнойТипЦенЗакупки",
		ДокументОбъект.Права,
		ВыводитьОшибки,
		ДокументОбъект
	);
	
	ДокументОбъект.ТипЦен = ТипЦен;
	
КонецПроцедуры

Процедура УстановитьПараметрыОтраженияДокументаВУчете(ДокументОбъект)
	
	ДокументОбъект.РегламентированныйУчет = Истина;
	
КонецПроцедуры

Процедура УстановитьОперациюПоступлениеТоваров(ДокументОбъект)
	
	ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	
КонецПроцедуры

Процедура УстановитьОсновныеРеквизитыДокумента(ДокументОбъект)
	
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Автор = ТекущийПользователь();
	
	ЗначенияЗаполненияАА5 = Новый Структура;
	ЗначенияЗаполненияАА5.Вставить("ДатаСоздания", ТекущаяДата());
	ЗначенияЗаполненияАА5.Вставить("ДатаОперации", ДокументОбъект.ВхДокДата);
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияЗаполненияАА5);
	
КонецПроцедуры

Процедура УстановитьДоговорСПоставщиком(ДокументОбъект)
	
	Договор = Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(
		ДокументОбъект.Контрагент,
		Перечисления.ВидыДоговоров.Покупка,
		ДокументОбъект
	);
	
	ДокументОбъект.ДоговорВзаиморасчетов = Договор;
	
КонецПроцедуры

Процедура УстановитьПодразделениеДокумента(ДокументОбъект)
	
	СвойствоПодразделениеКомпании = Новый Структура("ПодразделениеКомпании");
	ЗаполнитьЗначенияСвойств(СвойствоПодразделениеКомпании, ПараметрыСеанса);
	
	ДокументОбъект.ПодразделениеКомпании = СвойствоПодразделениеКомпании.ПодразделениеКомпании;
	
КонецПроцедуры

Функция СтранаПоКлассификатору(КодСтраны)
	
	Результат = Справочники.КлассификаторСтранМира.НайтиПоКоду(КодСтраны);
	Возврат Результат;
	
КонецФункции

Функция ЕдиницаИзмеренияПоКлассификатору(КодЕИ)
	
	Результат = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодЕИ);
	Возврат Результат;
	
КонецФункции

Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура, КодЕИ)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыНоменклатуры = ЗначенияРеквизитовОбъектаЛокальная(
			Номенклатура,
			"ТипНоменклатуры, ОсновнаяЕдиницаИзмерения");
	
	РеквизитыЕдиницыИзмерения = ЗначенияРеквизитовОбъектаЛокальная(
			РеквизитыНоменклатуры.ОсновнаяЕдиницаИзмерения,
			"ЕдиницаПоКлассификатору");
	
	ЕдиницаПоОКЕИ = ЕдиницаИзмеренияПоКлассификатору(КодЕИ);
	
	НайденнаяЕИ = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту(
		"ЕдиницаПоКлассификатору",
		ЕдиницаПоОКЕИ,
		Неопределено,
		РеквизитыНоменклатуры.ТипНоменклатуры
		);
	
	Если РеквизитыЕдиницыИзмерения.ЕдиницаПоКлассификатору = ЕдиницаПоОКЕИ Тогда
		
		Результат = РеквизитыНоменклатуры.ОсновнаяЕдиницаИзмерения;
		
	ИначеЕсли ЗначениеЗаполнено(НайденнаяЕИ) Тогда
		
		Результат = НайденнаяЕИ;
		
	Иначе
		
		Результат = РеквизитыНоменклатуры.ОсновнаяЕдиницаИзмерения;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяНоменклатураИнформационнойБазы(Номенклатура, Характеристика = Неопределено, Упаковка = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Номенклатура);
	Результат.Вставить("Характеристика");
	Результат.Вставить("Упаковка");
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Результат.Характеристика = Характеристика;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Результат.Упаковка = Упаковка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНоменклатуруИнформационнойБазы_ПрайсЛистыКонтрагентов(Владелец, ПолныйИдентификаторНоменклатуры)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Упаковка
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК Т
	|ГДЕ
	|	Т.ПрайсЛист = &ПрайсЛист
	|	И Т.НаименованиеИностранное = &Идентификатор
	|	И Т.Номенклатура <> &ПустаяНоменклатура";
	
	СлужебныйПрайсЛист = ПолучитьСсылкуНаПрайсЛистПоставщика(Владелец);
	ИдентификаторНоменклатуры = ЗначениеИдентификатораНоменклатурыВИнформационнойБазе(ПолныйИдентификаторНоменклатуры);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПрайсЛист", СлужебныйПрайсЛист);
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНоменклатуры);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	
	Если Выборка.Следующий() Тогда
		
		Результат = НоваяНоменклатураИнформационнойБазы(
			Выборка.Номенклатура,
			Выборка.Характеристика,
			Выборка.Упаковка
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура, Характеристика)
	
	ВладелецНоменклатуры = НоменклатураКонтрагента.Владелец;
	ПолныйИдентификаторНоменклатуры = НоменклатураКонтрагента.Идентификатор;
	
	НачатьТранзакцию();
	
	Попытка
		
		УдалитьСопоставлениеНоменклатуры_ПрайсЛистыКонтрагентов(ВладелецНоменклатуры, ПолныйИдентификаторНоменклатуры);
		ДобавитьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура, Характеристика);
		
		// Запись дублируется в устаревшее хранилище для обратной совместимости
		ДобавитьСопоставлениеНоменклатуры_ПрайсЛистыКонтрагентов(НоменклатураКонтрагента, Номенклатура);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Ошибка = ИнформацияОбОшибке();
		ЗаписатьОшибкуСопоставленияНоменклатуры(ПолныйИдентификаторНоменклатуры, ВладелецНоменклатуры, Ошибка);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьСопоставлениеНоменклатуры_ПрайсЛистыКонтрагентов(Владелец, ПолныйИдентификаторНоменклатуры)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК Т
	|ГДЕ
	|	Т.ПрайсЛист = &ПрайсЛист
	|	И &ПолеИдентификатор = &Идентификатор";
	
	ПолеИдентификатор = ИмяПоляИдентификаторНоменклатуры();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеИдентификатор", "Т." + ПолеИдентификатор);
	
	СлужебныйПрайсЛист = ПолучитьСсылкуНаПрайсЛистПоставщика(Владелец);
	ИдентификаторНоменклатуры = ЗначениеИдентификатораНоменклатурыВИнформационнойБазе(ПолныйИдентификаторНоменклатуры);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПрайсЛист", СлужебныйПрайсЛист);
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНоменклатуры);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерТаблицы = РегистрыСведений.ПрайсЛистыКонтрагентов;
	
	Пока Выборка.Следующий() Цикл
		Запись = МенеджерТаблицы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСопоставлениеНоменклатуры_ПрайсЛистыКонтрагентов(НоменклатураКонтрагента, Номенклатура)
	
	ВладелецНоменклатуры = НоменклатураКонтрагента.Владелец;
	ПолныйИдентификаторНоменклатуры = НоменклатураКонтрагента.Идентификатор;
	
	СлужебныйПрайсЛист = ПолучитьСсылкуНаПрайсЛистПоставщика(ВладелецНоменклатуры);
	ИдентификаторНоменклатуры = ЗначениеИдентификатораНоменклатурыВИнформационнойБазе(ПолныйИдентификаторНоменклатуры);
	ПолеИдентификатор = ИмяПоляИдентификаторНоменклатуры();
	
	НовыйОбъект = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьМенеджерЗаписи();
	
	НовыйОбъект.Контрагент	 = ВладелецНоменклатуры;
	НовыйОбъект.ПрайсЛист	 = СлужебныйПрайсЛист;
	НовыйОбъект.Номенклатура = Номенклатура;
	НовыйОбъект.Артикул		 = НоменклатураКонтрагента.Артикул;
	НовыйОбъект.Наименование = НоменклатураКонтрагента.Наименование;
	НовыйОбъект[ПолеИдентификатор] = ИдентификаторНоменклатуры;
	
	НовыйОбъект.АртикулДляПоиска = НоменклатураКонтрагента.Код;
	
	НовыйОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаписатьОшибкуСопоставленияНоменклатуры(ИдентификаторНоменклатуры, ВладелецНоменклатуры, Ошибка)
	
	ПодробностиОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	
	ТекстОшибки = "Не удалось записать сопоставление номенклатуры (Идентификатор = %1, контрагент = %2)";
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", ИдентификаторНоменклатуры);
	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%2", ВладелецНоменклатуры);
	ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробностиОшибки;
	
	ЗаписьЖурналаРегистрации(
		"Диадок.Сопоставление номенклатуры",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов,
		Неопределено,
		ТекстОшибки
	);
	
КонецПроцедуры

Функция ЗначениеИдентификатораНоменклатурыВИнформационнойБазе(ИдентификаторНоменклатуры)
	
	ПолеИдентификатор = МетаданныеПоляДляЗаписиИдентификатораНоменклатуры();
	МаксимальнаяДлина = ПолеИдентификатор.Тип.КвалификаторыСтроки.Длина;
	
	Результат = Прав(ИдентификаторНоменклатуры, МаксимальнаяДлина);
	
	Возврат Результат;
	
КонецФункции

Функция МетаданныеПоляДляЗаписиИдентификатораНоменклатуры()
	
	Результат = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов.Ресурсы.НаименованиеИностранное;
	Возврат Результат;
	
КонецФункции

Функция ИмяПоляИдентификаторНоменклатуры()
	
	ПолеИдентификатор = МетаданныеПоляДляЗаписиИдентификатораНоменклатуры();
	Результат = ПолеИдентификатор.Имя;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеСлужебногоПрайсЛиста()
	Возврат "СЛУЖЕБНЫЙ_ДИАДОК_СопоставлениеНоменклатуры";
КонецФункции

Функция НайтиСлужебныйПрайсЛист(Контрагент)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка,
	|	Т.Наименование КАК Наименование,
	|	Т.Код КАК Код
	|ИЗ
	|	Справочник.ПрайсЛистыКонтрагентов КАК Т
	|ГДЕ
	|	Т.Владелец = &Владелец
	|	И Т.Наименование = &Наименование
	|	И НЕ Т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ");
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Наименование", НаименованиеСлужебногоПрайсЛиста());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьСлужебныйПрайсЛист(Контрагент)
	
	НовыйПрайс = Справочники.ПрайсЛистыКонтрагентов.СоздатьЭлемент();
	НовыйПрайс.Владелец = Контрагент;
	НовыйПрайс.Наименование = НаименованиеСлужебногоПрайсЛиста();
	НовыйПрайс.ОбменДанными.Загрузка = Истина;
	
	НовыйПрайс.Записать();
	
	Результат = НовыйПрайс.Ссылка;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуНаПрайсЛистПоставщика(Контрагент)
	
	Результат = СоответствиеПрайсЛистовПоставщиков.Получить(Контрагент);
	
	Если Результат = Неопределено Тогда
		
		Результат = НайтиСлужебныйПрайсЛист(Контрагент);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = СоздатьСлужебныйПрайсЛист(Контрагент);
		КонецЕсли;
		
		СоответствиеПрайсЛистовПоставщиков.Вставить(Контрагент, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНоменклатуруИнформационнойБазы(Владелец, ИдентификаторНоменклатуры)
	
	Результат = Неопределено;
	
	ТаблицаСопоставленияНоменклатуры = ПолучитьТаблицуСопоставленияИзХранилища(Владелец);
	
	СтрокаПоиска = ТаблицаСопоставленияНоменклатуры.Найти(ИдентификаторНоменклатуры, "Идентификатор");
	
	Если СтрокаПоиска = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Номенклатура = СтрокаПоиска.Номенклатура;
	Если НЕ ЗначениеЗаполнено(Номенклатура)
		ИЛИ НЕ Общее_СсылкаСуществует(Номенклатура) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Характеристика = СтрокаПоиска.Характеристика;
	Если НЕ ЗначениеЗаполнено(Характеристика)
		ИЛИ НЕ Общее_СсылкаСуществует(Характеристика) Тогда
		Характеристика = Неопределено;
	КонецЕсли;
	
	
	Результат = НоваяНоменклатураИнформационнойБазы(
		Номенклатура,
		Характеристика
	);
	
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура, Характеристика = Неопределено)
	
	Владелец = НоменклатураКонтрагента.Владелец;
	
	ТаблицаСопоставленияНоменклатуры = ПолучитьТаблицуСопоставленияИзХранилища(Владелец);
	Идентификатор = НоменклатураКонтрагента.Идентификатор;
	
	СтрокаТаблицы = ТаблицаСопоставленияНоменклатуры.Найти(Идентификатор, "Идентификатор");
	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = ТаблицаСопоставленияНоменклатуры.Добавить();
	КонецЕсли;
	
	СтрокаТаблицы.Идентификатор = Идентификатор;
	СтрокаТаблицы.Номенклатура = Номенклатура;
	СтрокаТаблицы.Характеристика = Характеристика;
	
	ЗаписатьСопоставлениеНоменклатурыВХранилище(Владелец, ТаблицаСопоставленияНоменклатуры);
	
КонецПроцедуры

Процедура ЗаписатьСопоставлениеНоменклатурыВХранилище(Владелец, ТаблицаСопоставленияНоменклатуры)
	
	Идентификатор = ИдентификаторСлужебногоХранилищаСопоставления();
	ХранилищеСопоставления = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	ХранилищеСопоставления.Объект = Владелец;
	ХранилищеСопоставления.ИмяФайла = Владелец;
	ХранилищеСопоставления.Идентификатор = Идентификатор;
	ХранилищеСопоставления.Данные = Новый ХранилищеЗначения(ТаблицаСопоставленияНоменклатуры);
	ХранилищеСопоставления.Записать();
	
КонецПроцедуры

Функция ПолучитьТаблицуСопоставленияИзХранилища(Владелец)
	
	ТаблицаСопоставленияНоменклатуры = ПолучитьТаблицуСопоставленияНоменклатуры(Владелец);
	
	Если НЕ ЗначениеЗаполнено(ТаблицаСопоставленияНоменклатуры) Тогда
		ТаблицаСопоставленияНоменклатуры = Контракт_ХранениеТаблицыСопоставленияНоменклатуры();
	КонецЕсли;
	
	Если НЕ ТипЗнч(ТаблицаСопоставленияНоменклатуры) = Тип("ТаблицаЗначений") Тогда
		ШаблонОшибки = "Не удалось прочитать файл сопоставления номенклатуры по контрагенту """"%1"""". 
			|Подробности см. в журнале регистрации.";
		
		ТекстОшибки = СтрЗаменить(ШаблонОшибки, "%1", СокрЛП(Владелец));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ТаблицаСопоставленияНоменклатуры;
	
КонецФункции

Функция Контракт_ХранениеТаблицыСопоставленияНоменклатуры()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Идентификатор");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Упаковка");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуСопоставленияНоменклатуры(Контрагент)
	
	Результат = Контракт_ХранениеТаблицыСопоставленияНоменклатуры();
	Идентификатор = ИдентификаторСлужебногоХранилищаСопоставления();
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.КартинкиИФайлы КАК Т
	|ГДЕ
	|	Т.Объект = &Контрагент
	|	И Т.Идентификатор = &Идентификатор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Данные.Получить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторСлужебногоХранилищаСопоставления()
	Возврат "Диадок_СопоставлениеНоменклатуры";
КонецФункции

// Получает сопоставление номенклатуры из устаревшего хранилища и переносит в актуальное.
//
// Параметры:
//  ВладелецНоменклатуры - СправочникСсылка.Контрагенты - контрагент-владелец номенклатуры;
//  ИдентификаторНоменклатуры - Строка - идентификатор номенклатуры контрагента;
// 
// Возвращаемое значение:
//  Структура - номенклатура информационной базы (сведения из устаревшего хранилища);
//  Неопределено - если сопоставление не найдено.
//
Функция ПеренестиСопоставлениеНоменклатуры_ПрайсЛистыКонтрагентов(ВладелецНоменклатуры, ИдентификаторНоменклатуры)
	
	НоменклатураИБ = ПолучитьНоменклатуруИнформационнойБазы_ПрайсЛистыКонтрагентов(
			ВладелецНоменклатуры,
			ИдентификаторНоменклатуры);
	
	Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
		
		КлючевыеПоля = Новый Структура;
		КлючевыеПоля.Вставить("Владелец", ВладелецНоменклатуры);
		КлючевыеПоля.Вставить("Идентификатор", ИдентификаторНоменклатуры);
		
		ДобавитьСопоставлениеНоменклатуры(
			КлючевыеПоля,
			НоменклатураИБ.Номенклатура,
			НоменклатураИБ.Характеристика
		);
		
	КонецЕсли;
	
	Возврат НоменклатураИБ;
	
КонецФункции

Функция ТекущийПользователь()
	
	Возврат ПараметрыСеанса.Пользователь;
	
КонецФункции

Функция ВалютаРегламентированногоУчета()
	
	Результат = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Возврат Результат;
	
КонецФункции

Функция ВалютаУправленческогоУчета()
	
	Результат = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Возврат Результат;
	
КонецФункции

Функция ДокументыВладельцыКодовМаркировки(СсылкаНаОбъект)
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ДокументПередачи = СсылкаНаОбъект.ДокументОснование;
	Иначе
		ДокументПередачи = СсылкаНаОбъект;
	КонецЕсли;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументПередачи);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, есть ли у объекта метаданных табличная часть с штрихкодами упаковок товаров.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - проверяемый объект метаданных.
// 
// Возвращаемое значение:
//  Булево - Истина, если у объекта есть табличная часть "КодыМаркировки".
//
Функция ЕстьШтрихкодыУпаковок(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("КодыМаркировки") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаРазвернутаяТаблицаКодов(ПолноеИмяТаблицы)
	
	Результат =
	"ВЫБРАТЬ
	|	КМ.Ссылка КАК Ссылка,
	|	КМ.ИдентификаторТовара КАК ИдентификаторТовара,
	|	КМ.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ КодыМаркировки
	|ИЗ
	|	&ТЧКодыМаркировки КАК КМ
	|ГДЕ
	|	КМ.Ссылка В(&ДокументыПередачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Т.ИдентификаторТовара КАК ИдентификаторТовара
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ТЧТовары КАК Т
	|ГДЕ
	|	Т.Ссылка В(&ДокументыПередачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	КодыМаркировки.КодМаркировки КАК ЗначениеШтрихкода,
	|	&УпаковкаПотребительская КАК ВидУпаковки
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодыМаркировки КАК КодыМаркировки
	|		ПО Товары.Ссылка = КодыМаркировки.Ссылка
	|			И Товары.ИдентификаторТовара = КодыМаркировки.ИдентификаторТовара";
	
	Результат = СтрЗаменить(Результат, "&ТЧКодыМаркировки", ПолноеИмяТаблицы + ".КодыМаркировки");
	Результат = СтрЗаменить(Результат, "&ТЧТовары", ПолноеИмяТаблицы + ".Товары");
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьТаблицуКодовМаркировки(ТаблицаКодов, ДокументПередачи)
	
	МетаданныеОбъекта = ДокументПередачи.Метаданные();
	
	Если Не ЕстьШтрихкодыУпаковок(МетаданныеОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыНоменклатуры = ПараметрыУчетаНоменклатуры();
	
	ТекстЗапроса = ТекстЗапросаРазвернутаяТаблицаКодов(МетаданныеОбъекта.ПолноеИмя());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументыПередачи", ДокументПередачи);
	Запрос.УстановитьПараметр("УпаковкаПотребительская", "Потребительская");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаКодов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатуры.ИспользоватьХарактеристики;
		НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатуры.ИспользоватьСерии;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьКодыМаркировки(КодыМаркировки, СведенияОМаркировке, ИдентификаторСтроки, GTIN = "")
	
	Если Не ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(GTIN)
		И ЗначениеЗаполнено(СведенияОМаркировке.КоличествоТовараВУпаковке) Тогда
		
		КоличествоТовараВУпаковке = СведенияОМаркировке.КоличествоТовараВУпаковке;

		ЗначениеШтрихкода = НовыйКодОСУ(GTIN, КоличествоТовараВУпаковке);
		
		НоваяСтрока = КодыМаркировки.Добавить();
		НоваяСтрока.КодМаркировки = ЗначениеШтрихкода;
		НоваяСтрока.ИдентификаторТовара = ИдентификаторСтроки;

	КонецЕсли;

	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
		НоваяСтрока = КодыМаркировки.Добавить();
		НоваяСтрока.КодМаркировки = ЗначениеШтрихкода;
		НоваяСтрока.ИдентификаторТовара = ИдентификаторСтроки;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
		НоваяСтрока = КодыМаркировки.Добавить();
		НоваяСтрока.КодМаркировки = ЗначениеШтрихкода;
		НоваяСтрока.ИдентификаторТовара = ИдентификаторСтроки;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
		НоваяСтрока = КодыМаркировки.Добавить();
		НоваяСтрока.КодМаркировки = ЗначениеШтрихкода;
		НоваяСтрока.ИдентификаторТовара = ИдентификаторСтроки;
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйКодОСУ(GTIN, Количество)
	
	КоличествоСтрокой = XMLСтрока(Цел(Количество));
	
	Результат = "02" + GTIN + "37" + КоличествоСтрокой;
	
	Возврат Результат;
	
КонецФункции

// Возвращает параметры учета номенклатуры в текущей информационной базе.
// 
// Возвращаемое значение:
//  ФикисированнаяСтруктура - содержит ключи:
//    * ИспользоватьХарактеристики - Булево - Истина, если используются характеристики номенклатуры
//    * ИспользоватьСерии - Булево - Истина, если используются серии номенклатуры
//
Функция ПараметрыУчетаНоменклатуры()
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьХарактеристики", Ложь);
	Результат.Вставить("ИспользоватьСерии", Ложь);
	
	Если Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьХарактеристики = Истина;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("СерииНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьСерии = Истина;
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Проверяет физическое наличие записи в информационной базе данных о переданном значении ссылки.
//
// Параметры:
//  ЛюбаяСсылка - значение любой ссылки информационной базы данных.
// 
// Возвращаемое значение:
//  Булево.
//
Функция Общее_СсылкаСуществует(ЛюбаяСсылка) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	[ИмяТаблицы]
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяТаблицы]", ЛюбаяСсылка.Метаданные().ПолноеИмя());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ЛюбаяСсылка);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПреобразоватьСтрокуВМассивПодстрок(Знач Строка, Разделитель = ",", ПропускатьПустыеСтроки = Ложь, ПрименятьСокрЛП = Ложь) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПреобразоватьСтрокуВМассивПодстрок(Строка, Разделитель, ПропускатьПустыеСтроки, ПрименятьСокрЛП);
	
КонецФункции

// Извлекает из строки номер и дату
//
// Параметры:
//  ИсходнаяСтрока - Строка - Строка в формате "[Что-то] [№]<Номер> от <dd.MM.yyyy>"
// 
// Возвращаемое значение:
//  Структура:
//   * Номер - Строка - номер документа
//   * Дата - Дата - дата документа
//
Функция ВыделитьНомерДатуИзСтроки(ИсходнаяСтрока)
	
	Подстроки = ПреобразоватьСтрокуВМассивПодстрок(ИсходнаяСтрока, "№");
	СтрокаНомерДата = СокрЛП(Подстроки[Подстроки.ВГраница()]);
	
	Подстроки = ПреобразоватьСтрокуВМассивПодстрок(СтрокаНомерДата, " от ");
	Номер = СокрЛП(Подстроки[0]);
	
	СтрокаДата = "";
	Если Подстроки.Количество() > 1 Тогда
		СтрокаДата = СокрЛП(Подстроки[1]);
	КонецЕсли;
	
	Подстроки =  ПреобразоватьСтрокуВМассивПодстрок(СтрокаДата, ".");
	
	День = 1;
	Если Подстроки.Количество() > 0 Тогда
		День = СокрЛП(Подстроки[0]);
	КонецЕсли;
	
	Месяц = 1;
	Если Подстроки.Количество() > 1 Тогда
		Месяц = СокрЛП(Подстроки[1]);
	КонецЕсли;
	
	Год = 1;
	Если Подстроки.Количество() > 2 Тогда
		Год = Подстроки[2];
		Год = СтрЗаменить(Год, "г.", "");
		Год = СтрЗаменить(Год, "г", "");
		Год = СокрЛП(Год);
	КонецЕсли;
	
	Попытка
		Дата = Дата(Год, Месяц, День);
	Исключение
		Дата = Дата(1, 1, 1);
	КонецПопытки;
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("Дата", Дата);
	
	Возврат Результат;
	
КонецФункции

Функция СтрНайтиЛок(Строка, ПодстрокаПоиска)
	
	// BSLLS:DeprecatedFind-off
	Результат = Найти(Строка, ПодстрокаПоиска);
	// BSLLS:DeprecatedFind-on
	
	Возврат Результат;
	
КонецФункции

//} СлужебныеПроцедурыИФункции


//{ ТЕЛО МОДУЛЯ

Функция ПолучитьМодульПрог(ИмяМодуля)
	
	Возврат ОсновнойМодуль.ПолучитьМодульПрог(ИмяМодуля);
	
КонецФункции 

Функция ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, ЭтоСФ = Ложь) Экспорт
	
	Если СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
		Возврат "без НДС"
	ИначеЕсли ЗначениеЗаполнено(СтавкаНДС) = Ложь Тогда
		Возврат "";
	Иначе
		Возврат Формат(СтавкаНДС.Ставка, "ЧН=0");
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьНомерНаПечатьДиадок(ДокументСсылка) Экспорт
	Возврат дкПолучитьНомерДляПечати(ДокументСсылка);
КонецФункции

Функция ЭтоСчетФактуранаАванс(СФ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СФТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК СФТовары
	|ГДЕ
	|	СФТовары.Ссылка = &СчетФактура
	|	И СФТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Предоплата)"
	);
	Запрос.УстановитьПараметр("СчетФактура", СФ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = НЕ РезультатЗапроса.Пустой();
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьСуммуДокументаВВалютеРегламентированногоУчета_Диадок(ДокументСсылка) Экспорт 
	Возврат ДокументСсылка.СуммаДокумента;
КонецФункции

Процедура ПерезаполнитьСуммыПоУЕвРублях(СтрокиСчетаФактуры, ТекущееОснование, ДанныеШапки) Экспорт 
	
КонецПроцедуры

Функция ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокументРеализации, СчетФактура = Неопределено, ФормированиеСФ = Ложь, ЭтоАкт = Ложь) Экспорт
	Возврат Ложь;
КонецФункции	

Функция ПолучитьПредставлениеХарактеристикиИСерии(Выборка) Экспорт 
	
	Возврат ?(ЗначениеЗаполнено(Выборка.Характеристика), ", " + Выборка.Характеристика.Наименование, "");
	
КонецФункции

Функция Документ_Организация(Документ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Документ_Организация(Документ);
	
КонецФункции

Функция Организация_КПП(Организация) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Организация_КПП(Организация);
	
КонецФункции

Функция ПолучитьДатуНомерВходящейНакладной(ДокСсылка) Экспорт 
	
	Результат= Новый Структура("ДатаВходящегоДокумента, НомерВходящегоДокумента");
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда 
		Результат.ДатаВходящегоДокумента=  ДокСсылка.ВхДокДата;
		Результат.НомерВходящегоДокумента= ДокСсылка.ВхДокНомер;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуНомерВходящегоСчетаФактуры(ДокСсылка) Экспорт 
	
	Результат = Новый Структура("ДатаВходящегоДокумента, НомерВходящегоДокумента");
	
	МетаданныеДокумента= ДокСсылка.Метаданные();

	Если  МетаданныеДокумента.Реквизиты.Найти("ВхДокДата")  <> Неопределено 
		И МетаданныеДокумента.Реквизиты.Найти("ВхДокНомер") <> Неопределено Тогда
	
		Результат.ДатаВходящегоДокумента=  ДокСсылка.ВхДокДата;
		Результат.НомерВходящегоДокумента= ДокСсылка.ВхДокНомер;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПоступлениеТоваров")
		И (ДокСсылка.ВхДокДата <> ДатаВходящегоДокумента
		ИЛИ ДокСсылка.ВхДокНомер <> НомерВходящегоДокумента) Тогда
		
		Объект= ДокСсылка.ПолучитьОбъект();
		Объект.ВхДокДата =  ДатаВходящегоДокумента;
		Объект.ВхДокНомер = НомерВходящегоДокумента;
		
		Попытка
			Объект.Записать();
			Сообщить("Изменены следующие реквизиты: " + СписокОтличающихсяРеквизитов + " 
			|у документа: " + докСсылка);
		Исключение
			Сообщить("Не удалось изменить следующие реквизиты: " + СписокОтличающихсяРеквизитов + "
			|у документа: " + докСсылка);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатуНомерВходящегоСчетаФактуры(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт
	
	Если ДокСсылка.ВхДокДата <> ДатаВходящегоДокумента ИЛИ ДокСсылка.ВхДокНомер <> НомерВходящегоДокумента Тогда
		
		Объект= ДокСсылка.ПолучитьОбъект();
		Объект.ВхДокДата =  ДатаВходящегоДокумента;
		Объект.ВхДокНомер = НомерВходящегоДокумента;
		
		Попытка
			Объект.Записать();
			Сообщить("Изменены следующие реквизиты: " + СписокОтличающихсяРеквизитов+" 
			|у документа: " + докСсылка);
		Исключение
			Сообщить("Не удалось изменить следующие реквизиты: " + СписокОтличающихсяРеквизитов+"
			|у документа: " + докСсылка);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_НомерИДатаВходящегоДокумента"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Структура			- коллекция переопределяемых реквизитов 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента(Результат, ДокСсылка) Экспорт
	
	МетаданныеДокумента = ДокСсылка.Метаданные();
	
	Если ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеДокумента, "ВхДокНомер") Тогда
		
		Результат.Вставить("НомерВходящегоДокумента", "ВхДокНомер"); 
		
	КонецЕсли;
	
	Если ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеДокумента, "ВхДокДата") Тогда
		
		Результат.Вставить("ДатаВходящегоДокумента", "ВхДокДата"); 
		
	КонецЕсли; 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента()

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_КодСпособаПолучения"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Строка			- имя переопределяемого реквизита 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_КодСпособаПолучения(Результат, ДокСсылка) Экспорт
	
	//По умолчанию используем результат из "Модуль_ИнтеграцияУниверсальнаяЛогика" 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_КодСпособаПолучения()

//Возвращает именя реквизита "Склад" у документа поступления
//так как оно заданно в текущей конфигурации
//
//Возвращаемое значение:
//	Строка
Функция ИменаРеквизитов_Склад() Экспорт

	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИменаРеквизитов_Склад();
	
	Возврат Результат;
	
КонецФункции //ИменаРеквизитов_Склад()

Функция ЭтоАвторабота(НоменклатураСсылка) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(НоменклатураСсылка) = Тип("СправочникСсылка.Автоработы") Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоУслуга(НоменклатураСсылка) Экспорт
	
	Если НоменклатураСсылка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ВернутьСсылкуНаНоменклатуру(НоменклатураСсылка) Экспорт
	
	Если ТипЗнч(НоменклатураСсылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат НоменклатураСсылка;
	ИначеЕсли ТипЗнч(НоменклатураСсылка) = Тип("СправочникСсылка.Автоработы") Тогда
		Возврат НоменклатураСсылка.Номенклатура;
	Иначе
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType);
	
КонецФункции

Функция ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType);
	
КонецФункции 

Функция ДокументБезНДС(СсылкаНаОбъект) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ПустаяСсылкаНаНомерГТД() Экспорт
	
	Возврат Справочники.ГТД.ПустаяСсылка();
	
КонецФункции

Функция НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка) Экспорт

	Возврат Ложь;  // не поддерживается в данной конфигурации

КонецФункции // НДСПоДокументуИсчисляетсяНалоговымАгентом()

//} ТЕЛО МОДУЛЯ

//{ ПОЛУЧЕНИЕ ДАННЫХ

//{ Получить...

Функция ПолучитьНаименованиеКолонкиКодаТовара() Экспорт
	Возврат "Код"
КонецФункции

Функция ПолучитьВалютуРегламентированногоУчета() Экспорт 
	
	Результат = ОсновнойМодуль.ЭДО_Кэш_Прочитать("ВалютаРегламентированногоУчета");
	
	Если Результат = Неопределено Тогда
		
		Результат = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		
		ОсновнойМодуль.ЭДО_Кэш_Поместить("ВалютаРегламентированногоУчета", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуНомерДокументовОплаты(СчетФактура) Экспорт
	
	Результат = Новый Массив;
	
	РеквизитПлатежноРасчетныйДокумент = СчетФактура.ПлатежноРасчетныеДокументы;
	ПлатежноРасчетныеДокументы = ПреобразоватьСтрокуВМассивПодстрок(РеквизитПлатежноРасчетныйДокумент, ";");
	
	Для Каждого ПредставлениеПРД Из ПлатежноРасчетныеДокументы Цикл
		
		Если ПустаяСтрока(ПредставлениеПРД) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерДата = ВыделитьНомерДатуИзСтроки(ПредставлениеПРД);
		
		ПлатежныйДокумент = Новый Структура;
		ПлатежныйДокумент.Вставить("НомерПлатежноРасчетногоДокумента", НомерДата.Номер);
		ПлатежныйДокумент.Вставить("ДатаПлатежноРасчетногоДокумента", НомерДата.Дата);
		
		Результат.Добавить(ПлатежныйДокумент);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомерГТД(НомерГТД) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(НомерГТД) Тогда
		
		Если ТипЗнч(НомерГТД) = Тип("Строка") Тогда
			
			Результат = НомерГТД;
			
		Иначе
			
			Результат = НомерГТД.Наименование;
			
		КонецЕсли; 
		
		Результат = СокрЛП(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуСерииНоменклатуры(Номенклатура, НомерГТД, СтранаПроисхождения = "", СоздатьНовый = Ложь) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуСерииНоменклатуры(Номенклатура, НомерГТД, СтранаПроисхождения, СоздатьНовый);
	
КонецФункции

Функция ПолучитьДатуНомерДоговора(ДокументСсылка) Экспорт
	Договор = ДокументСсылка.ДоговорВзаиморасчетов;
	Возврат Новый Структура("ДоговорНомер, ДоговорДата", Договор.НомерДоговора, Договор.ДатаНачала);
КонецФункции

Функция ПолучитьФИОРуководителяДляСчета(ДанныеШапки, ПараметрыОтправкиНаСогласование) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьФИОРуководителяДляСчета(ДанныеШапки, ПараметрыОтправкиНаСогласование);
	
КонецФункции

Функция ПолучитьГрузоотправителяГрузополучателя1С(Параметры) Экспорт
	
	Возврат Неопределено;	
	
КонецФункции

//} Получить...

//{ ТЧПолучитьТекстЗапроса...

Функция ВыражениеУпаковка(ПсевдонимТаблицы = "", ПсевдонимПоляЕдиница = "ЕдиницаИзмерения")
	
	Результат =
	"ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|		ТОГДА ПсевдонимТаблицы.ЕдиницаИзмерения
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "ПсевдонимТаблицы.ЕдиницаИзмерения", "ПсевдонимТаблицы." + ПсевдонимПоляЕдиница);
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеПустаяУпаковка()
	Возврат "ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
КонецФункции

Процедура ЗаполнитьВыражениеПустаяУпаковка(ТекстЗапроса)
	
	ПодстрокаПоиска = "&ПустаяУпаковка";
	ПодстрокаЗамены = ВыражениеПустаяУпаковка();
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		ПодстрокаПоиска,
		ПодстрокаЗамены
	);
	
КонецПроцедуры

Процедура ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы)
	
	ПодстрокаПоиска = "ПсевдонимТаблицы";
	Если Не ЗначениеЗаполнено(ПсевдонимТаблицы) Тогда
		ПодстрокаПоиска = ПодстрокаПоиска + ".";
	КонецЕсли;
	
	Выражение = СтрЗаменить(Выражение, ПодстрокаПоиска, ПсевдонимТаблицы);
	
КонецПроцедуры

Функция ПолучитьДанныеТЧ_СФ(СсылкаНаОбъект, ЭтоКСФ)
	
	Запрос = Новый Запрос;
	
	Если ЭтоКСФ Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.ДокументОснование КАК КорректировкаРеализации
		|ПОМЕСТИТЬ СчФ
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка = &Ссылка
		|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ТЧ.Номенклатура.НаименованиеПолное, 1, 1) = """"
		|			ТОГДА ТЧ.Номенклатура.Наименование
		|		ИНАЧЕ ТЧ.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	ТЧ.Номенклатура КАК НоменклатураСсылка,
		|	ТЧ.Номенклатура.Артикул КАК КодНоменклатуры,
		|	ТЧ.Количество,
		|	ТЧ.КоличествоПоДокументуРеализации КАК КоличествоДоИзменения,
		|	ТЧ.ЕдиницаИзмерения,
		|	ТЧ.ЕдиницаИзмеренияПоДокументуРеализации КАК ЕдиницаИзмеренияДоИзменения,
		|	ТЧ.Цена,
		|	ТЧ.СтавкаНДС,
		|	ТЧ.СтавкаНДСПоДокументуРеализации КАК СтавкаНДСДоИзменения,
		|	ТЧ.СуммаНДС,
		|	ТЧ.СуммаНДСПоДокументуРеализации КАК СуммаНДСДоИзменения,
		|	ТЧ.СуммаВсего КАК Сумма,
		|	ТЧ.СуммаВсегоПоДокументуРеализации КАК СуммаДоИзменения,
		|	ИСТИНА КАК СуммаВключаетНДС,
		|	ТЧ.ЕдиницаИзмерения КАК Упаковка,
		|	ТЧ.ЕдиницаИзмеренияПоДокументуРеализации КАК УпаковкаДоИзменения,
		|	ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
		|	ТЧ.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмеренияДоИзменения,
		|	ВЫБОР
		|		КОГДА ТЧ.КоличествоПоДокументуРеализации = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((ТЧ.СуммаВсегоПоДокументуРеализации - ТЧ.СуммаНДСПоДокументуРеализации) / ТЧ.КоличествоПоДокументуРеализации КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК ЦенаДоИзменения,
		|	ТЧ.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ТЧ.Ссылка КАК ДокументОтгрузки
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|	И (ТЧ.КоличествоРазница <> 0
		|			ИЛИ ТЧ.СуммаВсегоРазница <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ТЧ.Работа.НаименованиеПолное, 1, 1) = """"
		|			ТОГДА ТЧ.Работа.Наименование
		|		ИНАЧЕ ТЧ.Работа.НаименованиеПолное
		|	КОНЕЦ,
		|	ТЧ.Работа,
		|	ТЧ.Работа.Артикул,
		|	ТЧ.Количество,
		|	ТЧ.КоличествоПоДокументуРеализации,
		|	ТЧ.Нормочас,
		|	ТЧ.Нормочас,
		|	ТЧ.Цена,
		|	ТЧ.СтавкаНДС,
		|	ТЧ.СтавкаНДСПоДокументуРеализации,
		|	ТЧ.СуммаНДС,
		|	ТЧ.СуммаНДСПоДокументуРеализации,
		|	ТЧ.СуммаВсего,
		|	ТЧ.СуммаВсегоПоДокументуРеализации,
		|	ИСТИНА,
		|	&ПустаяУпаковка КАК Упаковка,
		|	&ПустаяУпаковка КАК УпаковкаДоИзменения,
		|	ТЧ.Нормочас,
		|	ТЧ.Нормочас,
		|	ВЫБОР
		|		КОГДА ТЧ.КоличествоПоДокументуРеализации = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((ТЧ.СуммаВсегоПоДокументуРеализации - ТЧ.СуммаНДСПоДокументуРеализации) / ТЧ.КоличествоПоДокументуРеализации КАК ЧИСЛО(15, 2))
		|	КОНЕЦ,
		|	"""",
		|	ТЧ.Ссылка
		|ИЗ
		|	Документ.КорректировкаРеализации.Работы КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|	И (ТЧ.КоличествоРазница <> 0
		|			ИЛИ ТЧ.СуммаВсегоРазница <> 0)";
		
		ЗаполнитьВыражениеПустаяУпаковка(Запрос.Текст);
		
		Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда // в случае УКД Дис
			Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);			   
		Иначе
			Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект.ДокументОснование);			   
		КонецЕсли;
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ТЧ.Номенклатура.НаименованиеПолное, 1, 10) = """"
		|			ТОГДА ТЧ.Номенклатура.Наименование
		|		ИНАЧЕ ТЧ.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	ТЧ.Номенклатура КАК НоменклатураСсылка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ТЧ.Номенклатура) <> ТИП(Справочник.Автомобили)
		|			ТОГДА ТЧ.Номенклатура.Артикул
		|	КОНЕЦ КАК КодНоменклатуры,
		|	&Упаковка КАК Упаковка,
		|	ЕСТЬNULL(ОКЕИ.Ссылка, ЕдиницыИзмерения_ОКЕИ.Ссылка) КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(ОКЕИ.Код, ЕдиницыИзмерения_ОКЕИ.Код) КАК КодЕдиницыИзмерения,
		|	ТЧ.Цена,
		|	ТЧ.Количество,
		|	0 КАК КоличествоМест,
		|	0 КАК КоличествоВОдномМесте,
		|	ТЧ.СуммаВсего КАК Сумма,
		|	ТЧ.СтавкаНДС,
		|	ТЧ.СуммаНДС,
		|	ИСТИНА КАК СуммаВключаетНДС,
		|	ТЧ.ГТД КАК НомерГТД,
		|	Спр_ГТД.Страна КАК СтранаПроисхождения,
		|	ТЧ.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ТЧ.Ссылка.ДокументОснование КАК ДокументОтгрузки
		|ИЗ
		|	Документ.СчетФактураВыданный.Товары КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК Спр_ГТД
		|		ПО ТЧ.ГТД = Спр_ГТД.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ОКЕИ
		|		ПО ТЧ.ЕдиницаИзмерения = ОКЕИ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО ТЧ.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения_ОКЕИ
		|		ПО (ЕдиницыИзмерения.ЕдиницаПоКлассификатору = ЕдиницыИзмерения_ОКЕИ.Ссылка)
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка";
		
		ПолеУпаковка = ВыражениеУпаковка("ТЧ", "ЕдиницаИзмерения");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Упаковка", ПолеУпаковка);
		
		Если Метаданные.Документы.СчетФактураВыданный.ТабличныеЧасти.Товары.Реквизиты.Найти("Цена") = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТЧ.Цена,", "0 КАК Цена,");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьДанныеТЧ_ТоварныйДок(ДокСсылка)
	
	ТабличнаяЧасть = ИнициализироватьТабличнуюЧасть(Ложь);
	
	СуммаНДС = 0;
	Если Метаданные.Документы.Найти("РеализацияАвтомобилей") <> Неопределено
		И ТипЗнч(ДокСсылка)= тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияАвтомобилейАвтомобили.Автомобиль.Наименование КАК Номенклатура,
		|	РеализацияАвтомобилейАвтомобили.Автомобиль.Ссылка КАК НоменклатураСсылка,
		|	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN КАК КодНоменклатуры,
		|	&ПустаяУпаковка КАК Упаковка,
		|	ЗНАЧЕНИЕ(справочник.КлассификаторЕдиницИзмерения.шт) КАК ЕдиницаИзмерения,
		|	""796"" КАК КодЕдиницыИзмерения,
		|	1 КАК Количество,
		|	1 КАК КоличествоМест,
		|	1 КАК КоличествоВОдномМесте,
		|	РеализацияАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
		|	РеализацияАвтомобилейАвтомобили.СуммаНДС,
		|	РеализацияАвтомобилейАвтомобили.СуммаВсего - РеализацияАвтомобилейАвтомобили.СуммаНДС КАК Цена,
		|	РеализацияАвтомобилейАвтомобили.СуммаВсего КАК Сумма,
		|	ИСТИНА КАК суммаВключаетНДС,
		|	РеализацияАвтомобилейАвтомобили.Ссылка КАК ДокументОтгрузки
		|ИЗ
		|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|ГДЕ
		|	РеализацияАвтомобилейАвтомобили.Ссылка = &Ссылка";
		
		ЗаполнитьВыражениеПустаяУпаковка(Запрос.Текст);
		
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		Возврат Запрос.Выполнить();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(РеализацияТоваровТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
		|			ТОГДА РеализацияТоваровТовары.Номенклатура.Наименование
		|		ИНАЧЕ РеализацияТоваровТовары.Номенклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	РеализацияТоваровТовары.Номенклатура КАК НоменклатураСсылка,
		|	РеализацияТоваровТовары.Номенклатура.Код КАК КодНоменклатуры,
		|	&Упаковка КАК Упаковка,
		|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
		|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
		|	РеализацияТоваровТовары.Цена,
		|	РеализацияТоваровТовары.Количество,
		|	РеализацияТоваровТовары.Количество КАК КоличествоМест,
		|	1 КАК КоличествоВОдномМесте,
		|	РеализацияТоваровТовары.Коэффициент,
		|	РеализацияТоваровТовары.СтавкаНДС,
		|	РеализацияТоваровТовары.СуммаНДС,
		|	РеализацияТоваровТовары.СуммаВсего КАК сумма,
		|	ИСТИНА КАК СуммаВключаетНДС,
		|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
		|	РеализацияТоваровТовары.Ссылка КАК ДокументОтгрузки
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|ГДЕ
		|	РеализацияТоваровТовары.Ссылка = &Ссылка";
		
		ПолеУпаковка = ВыражениеУпаковка("РеализацияТоваровТовары", "ЕдиницаИзмерения");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Упаковка", ПолеУпаковка);
		
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		
		Возврат Запрос.Выполнить();
		
	КонецЕсли;
	
	Возврат ТабличнаяЧасть;
	
КонецФункции

Функция  ПолучитьДанныеТЧ_СчетНаОплату(ДокументСсылка)
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ТЧ.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ТЧ.Номенклатура.Наименование
	|		ИНАЧЕ ТЧ.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ТЧ.Номенклатура КАК НоменклатураСсылка,
	|	ТЧ.Номенклатура.Код КАК КодНоменклатуры,
	|	&Упаковка КАК Упаковка,
	|	ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|	ТЧ.Цена,
	|	ТЧ.Количество,
	|	ТЧ.Коэффициент,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.СуммаНДС,
	|	ТЧ.СуммаВсего КАК сумма,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ТЧ.ХарактеристикаНоменклатуры КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОтгрузки
	|ИЗ
	|	Документ.СчетНаОплату.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &ДокументСсылка");
	
	ПолеУпаковка = ВыражениеУпаковка("ТЧ", "ЕдиницаИзмерения");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Упаковка", ПолеУпаковка);
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции	

Функция ПолучитьДанныеТЧ(ДокументСсылка, СчетФактура, ЭтоКСФ)
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		
		Возврат ПолучитьДанныеТЧ_СФ(СчетФактура, ЭтоКСФ);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		Возврат ПолучитьДанныеТЧ_СчетНаОплату(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда // в случае УКД Дис
		
		Возврат ПолучитьДанныеТЧ_СФ(ДокументСсылка, Истина);
		
	Иначе 
		
		Возврат ПолучитьДанныеТЧ_ТоварныйДок(ДокументСсылка);
		
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьРезультатЗапросаТЧ(ДокументСсылка, СчетФактура, ЭтоКСФ) Экспорт
	Возврат 	ПолучитьДанныеТЧ(ДокументСсылка, СчетФактура, ЭтоКСФ);
КонецФункции

Функция ПолучитьКодНоменклатурыДляТорг12(ТекущийКод, НоменклатураСсылка) Экспорт 
	Возврат ТекущийКод
КонецФункции

//} ТЧПолучитьТекстЗапроса...

//{ ПолучитьДанныеШапки...

Функция ПолучитьСтруктуруШапки(ДокументСсылка, СчетФактура = Неопределено)   Экспорт 
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	СтруктураШапки = Новый Структура;
	СтруктураШапки.Вставить("Организация"	  , ДокументСсылка.Организация);
	СтруктураШапки.Вставить("Контрагент"	  , ДокументСсылка.Контрагент);
	СтруктураШапки.Вставить("ВалютаДокумента" , ДокументСсылка.ВалютаДокумента);
	СтруктураШапки.Вставить("СуммаВключаетНДС", Истина);
	СтруктураШапки.Вставить("ДопИнфо"		  , Новый Массив);
	СтруктураШапки.Вставить("АдресДоставки"	  , "");
		
	Если СчетФактура = Неопределено Тогда 
		
		СтруктураШапки.Вставить("Дата" , ДокументСсылка.Дата);
		СтруктураШапки.Вставить("Номер", ДокументСсылка.Номер);
		
		СтруктураШапки.Вставить("Грузоотправитель", СтруктураШапки.Организация);
		СтруктураШапки.Вставить("Грузополучатель" , СтруктураШапки.Контрагент);
		
	Иначе 
		
		СтруктураШапки.Вставить("Дата" , СчетФактура.Дата);
		СтруктураШапки.Вставить("Номер", СчетФактура.Номер);
		
		СтруктураШапки.Вставить("Грузоотправитель", "он же");
		
		Грузополучатель = СчетФактура.Грузополучатель;
		СтруктураШапки.Вставить("Грузополучатель", ?(ЗначениеЗаполнено(Грузополучатель), Грузополучатель, СтруктураШапки.Контрагент));
		
		
		МетаданныеСФ = СчетФактура.Метаданные();
		
		Если МетаданныеСФ.Реквизиты.Найти("ИдентификаторГосударственногоКонтракта") <> Неопределено Тогда
			СтруктураШапки.Вставить("ИдентификаторГосконтракта", СчетФактура.ИдентификаторГосударственногоКонтракта);
		КонецЕсли;
		
	КонецЕсли;	
	
	
	Если МетаданныеДокумента.Реквизиты.Найти("ПодразделениеКомпании") <> Неопределено 
		И ЗначениеЗаполнено(ДокументСсылка.ПодразделениеКомпании)
		И ЗначениеЗаполнено(ДокументСсылка.ПодразделениеКомпании.КПП) Тогда
		
		СтруктураШапки.Вставить("КПППродавца", ДокументСсылка.ПодразделениеКомпании.КПП);
		
	КонецЕсли;
	
	Возврат СтруктураШапки;
	
КонецФункции

//} ПолучитьДанныеШапки...

//{ ПолучитьДанныеСФ...

Функция ПолучитьНомераДляКСФ(ДокСсылка) Экспорт
	
	МетаданныеДокумента = ДокСсылка.Метаданные();
	
	ДанныеДляПечати = Новый Структура;
	Если (МетаданныеДокумента.Реквизиты.Найти("Исправление") <> Неопределено) И (ДокСсылка.Исправление) Тогда 
		//это ксф с исправлением
		ДанныеДляПечати.вставить("НомерКСФ", ДокСсылка.НомерИсправляемогоКорректировочногоДокумента);
		ДанныеДляПечати.вставить("ДатаКСФ",  ДокСсылка.ДатаИсправляемогоКорректировочногоДокумента);
		ДанныеДляПечати.вставить("ЭтоИКСФ", Истина);
		
		ДанныеДляПечати.вставить("НомерИКСФ", формат(ДокСсылка.НомерИсправления, "ЧДЦ=0; ЧГ=0"));
		ДанныеДляПечати.вставить("ДатаИКСФ",  ДокСсылка.Дата);
	Иначе 
		//это ксф без исправлений
		ДанныеДляПечати.вставить("НомерКСФ", ОсновнойМодуль.Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ДокСсылка));
		ДанныеДляПечати.вставить("ДатаКСФ",  ДокСсылка.Дата);
		ДанныеДляПечати.вставить("ЭтоИКСФ", Ложь);
	КонецЕсли;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ИсправляемыйДокументРеализации = ОсновнойМодуль.Модуль_Интеграция.ПолучитьИсправляемыйДокументРеализации(ДокСсылка);
		ДатаИсходногоДокумента 	= ИсправляемыйДокументРеализации.Дата;
		НомерИсходногоДокумента = ОсновнойМодуль.Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ИсправляемыйДокументРеализации);
		УчитыватьИсправлениеИсходногоДокумента 	= Ложь;
		НомерИсправленияИсходногоДокумента 		=  "";
		ДатаИсправленияИсходногоДокумента 		= Дата(1, 1, 1);
	Иначе
		ДатаИсходногоДокумента = ДокСсылка.ДатаИсходногоДокумента;
		НомерИсходногоДокумента = ДокСсылка.НомерИсходногоДокумента;
		ДатаИсправленияИсходногоДокумента = ДокСсылка.ДатаИсправленияИсходногоДокумента;
		НомерИсправленияИсходногоДокумента = ДокСсылка.НомерИсправленияИсходногоДокумента;
		УчитыватьИсправлениеИсходногоДокумента = ДокСсылка.УчитыватьИсправлениеИсходногоДокумента;
	КонецЕсли;
	
	ДанныеДляПечати.вставить("ДатаИсходногоДокумента",				  	ДатаИсходногоДокумента);
	ДанныеДляПечати.вставить("НомерИсходногоДокумента", 				НомерИсходногоДокумента);
	ДанныеДляПечати.вставить("УчитыватьИсправлениеИсходногоДокумента",  УчитыватьИсправлениеИсходногоДокумента);
	ДанныеДляПечати.вставить("НомерИсправленияИсходногоДокумента",  	НомерИсправленияИсходногоДокумента);
	ДанныеДляПечати.вставить("ДатаИсправленияИсходногоДокумента",  		ДатаИсправленияИсходногоДокумента);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ПолучитьНомераДляСФ(СсылкаНаОбъект)  Экспорт 
	ДанныеДляПечати = Новый Структура;
	Если СсылкаНаОбъект.метаданные().реквизиты.найти("Исправление") <> Неопределено И СсылкаНаОбъект.исправление Тогда
		ДанныеДляПечати.вставить("НомерДокумента", СсылкаНаОбъект.НомерИсходногоДокумента);
		ДанныеДляПечати.Вставить("ДатаДокумента", СсылкаНаОбъект.ДатаИсходногоДокумента);
		ДанныеДляПечати.Вставить("ЭтоИСФ", Истина);
		ДанныеДляПечати.Вставить("НомерИсправления", строка(СсылкаНаОбъект.НомерИсправления));
		ДанныеДляПечати.Вставить("ДатаИсправления",  СсылкаНаОбъект.Дата);
	Иначе 
		ДанныеДляПечати.вставить("НомерДокумента", ПолучитьНомерНаПечатьДиадок(СсылкаНаОбъект));
		ДанныеДляПечати.Вставить("ДатаДокумента",  СсылкаНаОбъект.Дата);
		ДанныеДляПечати.Вставить("ЭтоИСФ", Ложь);
	КонецЕсли;	
	Возврат ДанныеДляПечати;
КонецФункции

Функция ПолучитьКПППродавца(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьКПППокупателя(СчетФактура) Экспорт 
	Возврат "";
КонецФункции

//} ПолучитьДанныеСФ...

//} ПОЛУЧЕНИЕ ДАННЫХ

//{ ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

Функция ОчиститьГрузополучателя(СтрокаТаблицы) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьТипДокумента(ДокСсылка, НаименованиеТипа)
	Возврат (метаданные.документы.найти(НаименованиеТипа) <> Неопределено) И (ТипЗнч(ДокСсылка) = Тип("ДокументСсылка." + НаименованиеТипа))
КонецФункции

Функция ПолучитьТипДокумента(Док, ТаблицаНастроекПечати, ЭтоСчет, ФункцияУПД) Экспорт
	
	Если ЗначениеЗаполнено(ФункцияУПД) Тогда
		
		ТипДокумента = ОсновнойМодуль.ТипДокументаУПД(ФункцияУПД);
		
		Если ЗначениеЗаполнено(ТипДокумента) Тогда
			Возврат ТипДокумента;
		Иначе
			ТипДокумента = ОсновнойМодуль.ТипДокументаУКД(ФункцияУПД);
			Если ЗначениеЗаполнено(ТипДокумента) Тогда
				Возврат ТипДокумента;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
		
		Справочники_ХозОпераци_СчетФактураВыданныйКорректировка= ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПредопределенныйЭлемент(Справочники.ХозОперации, "СчетФактураВыданныйКорректировка");
		
		Если Справочники_ХозОпераци_СчетФактураВыданныйКорректировка <> Неопределено И Док.ХозОперация = Справочники_ХозОпераци_СчетФактураВыданныйКорректировка Тогда
			Если Док.Исправление Тогда
				Если ЗначениеЗаполнено(Док.НомерИсправляемогоКорректировочногоДокумента) Тогда
					Возврат "Исправление КСФ";
				Иначе
					Возврат "Исправление СФ";
				КонецЕсли;
			Иначе
				Возврат "Корректировочный СФ";
			КонецЕсли;
		Иначе
			Возврат "Счет-фактура";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваров")
		Или ПроверитьТипДокумента(Док, "КорректировкаРеализации") Тогда 
		
		//Настройка = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьНастройкиПечатныхФормДляОрганизацииДиадок(Док.Организация);
		СтрокиНастроек = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("Организация", Док.Организация));
		Если СтрокиНастроек.количество() = 0 Тогда 
			ФормаДляУслуг = "Акт";
			ФормаДляТоваров = "Торг-12";
		Иначе 
			ФормаДляТоваров = ?(СтрокиНастроек[0].ПечатнаяФормаДляТоваров = "", "Торг-12", СтрокиНастроек[0].ПечатнаяФормаДляТоваров);
			ФормаДляУслуг = ?(СтрокиНастроек[0].ПечатнаяФормаДляУслуг = "", "Акт", СтрокиНастроек[0].ПечатнаяФормаДляУслуг);
		КонецЕсли;	
		
		Если Док.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Или 
			(
				Найти(Метаданные.Синоним, "Альфа-Авто") > 0 И
				Найти(Метаданные.Синоним, "5") И
				Док.ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг
			) Тогда
			
			Возврат ФормаДляУслуг;
		Иначе
			Возврат ФормаДляТоваров;
		КонецЕсли;
		
	ИначеЕсли Метаданные.Документы.Найти("РеализацияАвтомобилей") <> Неопределено И ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		Возврат   "Торг-12";
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		Возврат "Счет на оплату";
	Иначе 
		Возврат "";
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыСФ(СчетФактура) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаДокумента", 0);
	Результат.Вставить("СуммаУвеличение", 0);
	Результат.Вставить("СуммаУменьшение", 0);
	Результат.Вставить("СуммаНДСДокумента", 0);
	Результат.Вставить("СуммаНДСУвеличение", 0);
	Результат.Вставить("СуммаНДСУменьшение", 0);
	
	ЗначенияРеквизитов = ОсновнойМодуль.ЗначенияРеквизитовОбъекта(
	СчетФактура, "СуммаДокумента, СуммаНДСДокумента");
	
	ЗаполнитьЗначенияСвойств(Результат, ЗначенияРеквизитов);
	
	Возврат Результат;
	
КонецФункции

//{ Подготовка временных таблиц

Функция ПодготовитьВТ_СпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц= Новый Массив;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 1 ИЛИ ТипыДокументов = 2 ИЛИ ТипыДокументов = 5 ИЛИ ТипыДокументов = 6 Тогда
		ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
		ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
		ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 1 Тогда
		ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 2 Тогда
		ПодготовитьВТ_СчетаФактуры_СчетФактураВыданный(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 3 Тогда
		ПодготовитьВТ_СчетаНаОплату_СчетНаОплату(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Возврат МассивВременныхТаблиц;
	
КонецФункции

Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц) Экспорт
	
	Если Метаданные.Документы.СчетФактураВыданный.Реквизиты.Найти("СуммаНДСДокумента") = Неопределено Тогда
		ПодготовитьВТ_СЧФ_Основная_НетРеквизитаСуммаНДСДокумента(Запрос, МассивВременныхТаблиц);
	Иначе
		ПодготовитьВТ_СЧФ_Основная_ЕстьРеквизитСуммаНДСДокумента(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СЧФ_Основная_ЕстьРеквизитСуммаНДСДокумента(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.СуммаНДСДокумента КАК СуммаНДСЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ХозОперация,
	|	Т.Исправление,
	|	Т.НомерИсправляемогоКорректировочногоДокумента,
	|	Т.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадокДокументОснование.Значение, """") КАК ДокументОснованиеID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСф)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадокДокументОснование
	|		ПО (Т.ДокументОснование = ИдентификаторДокументаВДиадокДокументОснование.Объект)
	|			И (ИдентификаторДокументаВДиадокДокументОснование.Свойство = &ИдентификаторДокументаВДиадок)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.СуммаНДСДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ХозОперация,
	|	Т.Исправление,
	|	Т.НомерИсправляемогоКорректировочногоДокумента,
	|	Т.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадокДокументОснование.Значение, """"),
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД)
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСф)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадокДокументОснование
	|		ПО (Т.ДокументОснование = ИдентификаторДокументаВДиадокДокументОснование.Объект)
	|			И (ИдентификаторДокументаВДиадокДокументОснование.Свойство = &ИдентификаторДокументаВДиадок)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВТ_СЧФ_Основная_НетРеквизитаСуммаНДСДокумента(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ХозОперация,
	|	Т.Исправление,
	|	Т.НомерИсправляемогоКорректировочногоДокумента,
	|	Т.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадокДокументОснование.Значение, """") КАК ДокументОснованиеID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД
	|ПОМЕСТИТЬ СЧФ_Основная_Шаг1
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСф)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадокДокументОснование
	|		ПО (Т.ДокументОснование = ИдентификаторДокументаВДиадокДокументОснование.Объект)
	|			И (ИдентификаторДокументаВДиадокДокументОснование.Свойство = &ИдентификаторДокументаВДиадок)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ХозОперация,
	|	Т.Исправление,
	|	Т.НомерИсправляемогоКорректировочногоДокумента,
	|	Т.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадокДокументОснование.Значение, """"),
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД)
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСф)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадокДокументОснование
	|		ПО (Т.ДокументОснование = ИдентификаторДокументаВДиадокДокументОснование.Объект)
	|			И (ИдентификаторДокументаВДиадокДокументОснование.Свойство = &ИдентификаторДокументаВДиадок)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СЧФ_Основная_Шаг1.Документ,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	СЧФ_Основная_Шаг1 КАК СЧФ_Основная_Шаг1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Товары КАК Товары
	|		ПО СЧФ_Основная_Шаг1.Документ = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная_Шаг1.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СЧФ_Основная_Шаг1.*,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	СЧФ_Основная_Шаг1 КАК СЧФ_Основная_Шаг1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО СЧФ_Основная_Шаг1.Документ = ВТ_СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СЧФ_Основная_Шаг1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &СЧФДОП
	|	И НЕ СЧФ_Основная.Исправление
	|	И СЧФ_Основная.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданный)
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.Продавец,
	|	СЧФ_Основная.Покупатель,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСЗначение,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID,
	|	СЧФ_Основная.CounteragentID,
	|	&СЧФДОП КАК ФункцияУПД,
	|	СЧФ_Основная.ДокументОснование,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УПД_СЧФДОП
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Выполнить();
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 5 Тогда
		МассивВременныхТаблиц.Добавить("УПД_СЧФДОП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &СЧФДОП
	|	И НЕ СЧФ_Основная.Исправление
	|	И СЧФ_Основная.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.Продавец,
	|	СЧФ_Основная.Покупатель,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСЗначение,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID,
	|	СЧФ_Основная.CounteragentID,
	|	&КСЧФДИС КАК ФункцияУПД,
	|	СЧФ_Основная.ДокументОснование,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УКД_КСЧФДИС
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Выполнить();
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 6 Тогда
		МассивВременныхТаблиц.Добавить("УКД_КСЧФДИС");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры_СчетФактураВыданный(Запрос, МассивВременныхТаблиц, ТипыДокументов) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.Продавец,
	|	СЧФ_Основная.Покупатель,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСЗначение,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID,
	|	СЧФ_Основная.CounteragentID,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СЧФ_Основная.ФормироватьУПД В (&СФ, &СФТОРГ12АКТ)
	|						ТОГДА 
	|							ВЫБОР
	|								КОГДА СЧФ_Основная.Исправление И СЧФ_Основная.НомерИсправляемогоКорректировочногоДокумента = """"
	|									ТОГДА &СФ
	|								ИНАЧЕ &КСФ
	|							КОНЕЦ
	|					КОГДА НЕ СЧФ_Основная.Исправление И СЧФ_Основная.ФормироватьУПД В (&СЧФДОП, &СЧФ, &СЧФ_ДОП)
	|						ТОГДА &КСЧФ
	|					ИНАЧЕ """"
	|				КОНЕЦ 
	|		КОГДА СЧФ_Основная.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданный)
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СЧФ_Основная.ФормироватьУПД В (&СФ, &СФТОРГ12АКТ)
	|						ТОГДА &СФ
	|					КОГДА НЕ СЧФ_Основная.Исправление И СЧФ_Основная.ФормироватьУПД В (&СЧФДОП, &СЧФ, &СЧФ_ДОП)
	|						ТОГДА &СЧФ
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ СчетаФактуры_СчетФактураВыданный
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО СЧФ_Основная.Документ = УПД_СЧФДОП.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС КАК УКД_КСЧФДИС
	|		ПО СЧФ_Основная.Документ = УКД_КСЧФДИС.Документ
	|ГДЕ
	|	УПД_СЧФДОП.Документ ЕСТЬ NULL
	|	И УКД_КСЧФДИС.Документ ЕСТЬ NULL
	|	И ВЫБОР
	|		КОГДА СЧФ_Основная.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)
	|			И НЕ СЧФ_Основная.Исправление И СЧФ_Основная.ФормироватьУПД = &ДОП
	|				ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СЧФ_Основная";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетаФактуры_СчетФактураВыданный");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_СчетНаОплату(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	ИСТИНА КАК Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	(ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	СУММА(Т.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату.Товары КАК Т
	|		ПО ВТ_Основная.Документ = Т.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	"""" КАК ФункцияУПД,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ СчетаНаОплату_СчетНаОплату
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетаНаОплату_СчетНаОплату");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПодготовитьВТ_Накладные_РеализацияТоваров(Запрос, МассивВременныхТаблиц);
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено Тогда
		ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Если Метаданные.Документы.Найти("РеализацияАвтомобилей") <> Неопределено Тогда
		ПодготовитьВТ_Накладные_РеализацияАвтомобилей(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияТоваров(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО (Т.Ссылка = УПД_СЧФДОП.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО (Т.Ссылка = УПД_СЧФДОП.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК Товары
	|		ПО ВТ_Основная.Документ = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_РеализацияТоваров
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &СЧФДОП
	|				И ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияТоваров");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			И Т.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон)
	|				ТОГДА &ДИС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС КАК УКД_КСЧФДИС
	|		ПО (Т.Ссылка = УКД_КСЧФДИС.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УКД_КСЧФДИС.ДокументОснование ЕСТЬ NULL
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА Т.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			И Т.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон)
	|				ТОГДА &ДИС
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС КАК УКД_КСЧФДИС
	|		ПО (Т.Ссылка = УКД_КСЧФДИС.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УКД_КСЧФДИС.ДокументОснование ЕСТЬ NULL
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА Т.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Т.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК Т
	|			ПО ВТ_Основная.Документ = Т.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Т.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Работы КАК Т
	|			ПО ВТ_Основная.Документ = Т.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &СЧФДОП
	|				И ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_КорректировкаРеализации");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияАвтомобилей(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО (Т.Ссылка = УПД_СЧФДОП.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО (Т.Ссылка = УПД_СЧФДОП.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Т.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Товары КАК Т
	|			ПО ВТ_Основная.Документ = Т.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Т.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК Т
	|			ПО ВТ_Основная.Документ = Т.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_РеализацияАвтомобилей
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &СЧФДОП
	|				И ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияАвтомобилей");
	
КонецПроцедуры

//} Подготовка временных таблиц

//} ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

///////////////////////////////////////
// функции для генерации контента 
/////////////////////////////////////////

Функция ПолучитьБанковскийСчетПоДокументу(ДокСсылка) Экспорт
	
	Если (докСсылка.Метаданные().Реквизиты.Найти("РасчетныйСчетОрганизации") <> Неопределено)
		И (ТипЗнч(ДокСсылка.РасчетныйСчетОрганизации) = Тип("СправочникСсылка.БанковскиеСчета")) Тогда
		Возврат ДокСсылка.РасчетныйСчетОрганизации;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////
// функции генерации сотруктуры для генерации торг-12 или акта выполненных работ
//////////////////////////////////////////////////////////////////////////////

Функция ПолучитьПредставлениеАдресаДляДиадок(записьрегистра) Экспорт 
	Возврат киПолучитьПредставлениеАдреса(записьрегистра) 
КонецФункции

Функция ПолучитьВидЮрАдресаКонтрагента() Экспорт 
	Возврат Справочники.ВидыКонтактнойИнформации.АдресЮридический;
КонецФункции

Процедура ЗаполнитьСтруктуруАдреса(AddressInfo, ЮрФизЛицо, ИспользоватьЮрАдрес = Ложь, АдресСтрокой = "") Экспорт
			
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗаполнитьСтруктуруАдреса(AddressInfo, ЮрФизЛицо, ИспользоватьЮрАдрес, АдресСтрокой);
 
КонецПроцедуры

Функция ПолучитьСтруктурированноеОписаниеЮрФизЛица( ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации = Неопределено,  ЮрАдрес)
	результат = Новый Структура("Name, Inn, Kpp, IsSoleProprietor, Okpo, Phone, Fax, BankAccountNumber, BankName, BankId, Address");
	НаименованиеОрганизации = юрФизЛицо.НаименованиеПолное;
	ЭтоИП = (юрФизЛицо.ФормаСобственности <> Перечисления.ФормыСобственности.ЮридическоеЛицо) ;
	
	результат.Name = НаименованиеОрганизации;
	результат.Inn = СокрЛП(юрФизЛицо.ИНН);
	результат.Kpp= СокрЛП(юрФизЛицо.КПП);
	результат.IsSoleProprietor = ЭтоИП;
	результат.Okpo = юрФизЛицо.КодПоОкпо;
	результат.Phone = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СократитьПредставлениеТелефона(  спПолучитьПредставление(юрФизЛицо, Новый Структура("ТелефонРабочий", ""))   );
	результат.Fax =   "" ;
	результат.BankAccountNumber =    спПолучитьПредставление(юрФизЛицо, Новый Структура("БанковскийСчет", ""));
	результат.BankName  =   спПолучитьПредставление(юрФизЛицо, Новый Структура("Банк", ""));
	результат.BankId =    СокрЛП(спПолучитьПредставление(юрФизЛицо, Новый Структура("БИК", "")));
	
	Возврат результат;
КонецФункции

Процедура ЗаполнитьСтруктурируЮрФизЛица(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации = Неопределено, ЮрАдрес, АдресДляСФ = Ложь, АдресСтрокой = "")  Экспорт 

	НаименованиеОрганизации = юрФизЛицо.НаименованиеПолное;
	ЭтоИП = (юрФизЛицо.ФормаСобственности <> Перечисления.ФормыСобственности.ЮридическоеЛицо) ;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.Inn = СокрЛП(юрФизЛицо.ИНН);
	OrganizationInfo.Kpp = СокрЛП(юрФизЛицо.КПП);
	ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ЮрФизЛицо, ЮрАдрес, АдресСтрокой);
	OrganizationInfo.IsSoleProprietor = ЭтоИП;
	
	Если АдресДляСФ = Ложь Тогда
		
		OrganizationInfo.Okpo = юрФизЛицо.КодПоОкпо;
		OrganizationInfo.Phone = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СократитьПредставлениеТелефона(спПолучитьПредставление(юрФизЛицо, Новый Структура("ТелефонРабочий", "")));
		OrganizationInfo.Fax = "" ;
		OrganizationInfo.BankAccountNumber = спПолучитьПредставление(юрФизЛицо, Новый Структура("БанковскийСчет", ""));
		OrganizationInfo.BankName = спПолучитьПредставление(юрФизЛицо, Новый Структура("Банк", ""));
		OrganizationInfo.BankId = СокрЛП(спПолучитьПредставление(юрФизЛицо, Новый Структура("БИК", "")));
	КонецЕсли;
	
	OrganizationInfo.вставить("Ссылка", ЮрФизЛицо);
	
КонецПроцедуры	

Процедура Заполнить_ExtendedOrganizationInfo(ExtendedOrganizationInfo, ЮрФизЛицо, ДатаДокумента, ИспользоватьЮрАдрес, БанковскийСчет= Неопределено, АдресСтрокой = "") Экспорт
	
	ЭтоОрганизация= ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации");
	
	ExtendedOrganizationInfo.Name= спПолучитьПредставление(ЮрФизЛицо, Новый Структура("Наименование"));
	ExtendedOrganizationInfo.Inn=  СокрЛП(спПолучитьПредставление(ЮрФизЛицо, Новый Структура("ИНН")));
	ExtendedOrganizationInfo.Kpp=  спПолучитьПредставление(ЮрФизЛицо, Новый Структура("КПП"));
	
	ExtendedOrganizationInfo.CorrespondentAccount= спПолучитьПредставление(ЮрФизЛицо, Новый Структура("КоррСчет"));
	
	ФормаСобственности = ЮрФизЛицо.ФормаСобственности;
	
	ЭтоЮрЛицо = ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЮридическоеЛицо")
	Или ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ОбособленноеПодразделение");
	
	ExtendedOrganizationInfo.Type= ?(ЭтоЮрЛицо, "LegalEntity", "IndividualEntity");
	
	ExtendedOrganizationInfo.Okpo=  			спПолучитьПредставление(ЮрФизЛицо, Новый Структура("ОКПО"));
	ExtendedOrganizationInfo.BankAccountNumber= спПолучитьПредставление(ЮрФизЛицо, Новый Структура("БанковскийСчет"));
	ExtendedOrganizationInfo.BankName=   		спПолучитьПредставление(ЮрФизЛицо, Новый Структура("Банк"));
	ExtendedOrganizationInfo.BankId=    		СокрЛП(спПолучитьПредставление(ЮрФизЛицо, Новый Структура("БИК")));
	ExtendedOrganizationInfo.Phone= 			ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПредставлениеТелефона(спПолучитьПредставление(ЮрФизЛицо, Новый Структура("ТелефонРабочий")), "Телефон", 255);
	
	ExtendedOrganizationInfo.Email = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").АдресЭлектроннойПочты(ЮрФизЛицо, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	
	ЗаполнитьСтруктуруАдреса(ExtendedOrganizationInfo.Address, ЮрФизЛицо, ИспользоватьЮрАдрес, АдресСтрокой);
	
	ExtendedOrganizationInfo.Вставить("Ссылка",  ЮрФизЛицо);
	
	Если ExtendedOrganizationInfo.Type = "IndividualEntity"
		И ДатаДокумента >= ДатаРедакции425() Тогда
		
		Если ЮрФизЛицо.Метаданные().Реквизиты.Найти("ОГРН") <> Неопределено Тогда
			ОГРНОрганизации = ЗначенияРеквизитовОбъектаЛокальная(ЮрФизЛицо, "ОГРН").ОГРН;
		Иначе
			ОГРНОрганизации = "";
		КонецЕсли;
		
		Если ЮрФизЛицо.Метаданные().Реквизиты.Найти("ДатаРегистрации") <> Неопределено Тогда
			ДатаРегистрацииОрганизации = ЗначенияРеквизитовОбъектаЛокальная(ЮрФизЛицо, "ДатаРегистрации").ДатаРегистрации;
		Иначе
			ДатаРегистрацииОрганизации = "";
		КонецЕсли;
		
		ExtendedOrganizationInfo.IndividualEntityRegistrationCertificate = СтрокаНомерСВ_2026(
			ОГРНОрганизации,
			ДатаРегистрацииОрганизации
		);
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ДатаРедакции425()
	
	Возврат '20260101';
	
КонецФункции

Функция СтрокаНомерСВ_2026(ОГРН, ДатаРегистрации)
	
	Результат = "%1;%2";
	Результат = СтрЗаменить(Результат, "%1", ОГРН);
	Результат = СтрЗаменить(Результат, "%2", ДатаСтрокойЛок(ДатаРегистрации));
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСтрокойЛок(ДатаСтрока)
	
	ПустоеЗначение = "";
	
	Если ПустаяСтрока(ДатаСтрока) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Попытка
		Значение = Дата(ДатаСтрока);
	Исключение
		Значение = ДатаСтрока;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьРеквизитыОрганизацииДляСчетаНаОплату(контрагент, ДатаОперации)  Экспорт 
	НаименованиеОрганизации = контрагент.НаименованиеПолное;
	Возврат Новый Структура("Наименование, ИНН, КПП", НаименованиеОрганизации, СокрЛП(контрагент.ИНН),  СокрЛП(контрагент.КПП));
КонецФункции

Функция ДобавитьРазделитель(Стр, Префикс = "") 
	Возврат ?(ЗначениеЗаполнено(стр), Префикс + сокрЛП(Стр) + ", ", "");
КонецФункции

Функция СформироватьПредставлениеАдреса(СведенияОбАдресе)
	
	Если СведенияОбАдресе.IsForeign = Ложь Тогда
		
		КодРегиона 	= СведенияОбАдресе.RegionCode;
		Индекс 		= СведенияОбАдресе.ZipCode;
		Район 		= СведенияОбАдресе.Territory;
		Город 		= СведенияОбАдресе.City;
		НаселПункт  = СведенияОбАдресе.Locality;
		Улица       = СведенияОбАдресе.Street;
		Дом         = СведенияОбАдресе.Building;
		Корпус      = СведенияОбАдресе.Block;
		Кварт       = СведенияОбАдресе.Apartment;
		
		ПредставлениеАдреса = ДобавитьРазделитель(Индекс)
							+ ДобавитьРазделитель(ОсновнойМодуль.НаименованиеРегиона(КодРегиона))
							+ ДобавитьРазделитель(Район)
							+ ДобавитьРазделитель(Город)
							+ ДобавитьРазделитель(НаселПункт)
							+ ДобавитьРазделитель(Улица)
							+ ДобавитьРазделитель(Дом, "дом №")
							+ ДобавитьРазделитель(Корпус, "корпус ")
							+ ДобавитьРазделитель(Кварт, "кв ");
		
		Возврат Лев(ПредставлениеАдреса, СтрДлина(ПредставлениеАдреса)-2);
		
	Иначе
		Возврат ?(ЗначениеЗаполнено(СведенияОбАдресе.AddressText), СведенияОбАдресе.AddressText, "");
	КонецЕсли;
	
КонецФункции	

Функция ОписаниеЮрЛица_ВСтроку(СведенияОбОрганизации, СведенияОбАдресе = Неопределено)
	СтрОписаниеЮрлица = "";
	СтрОписаниеЮрлица = СтрОписаниеЮрлица + СведенияОбОрганизации.Name;
	СтрОписаниеЮрлица = СтрОписаниеЮрлица + ", ИНН " + СведенияОбОрганизации.Inn;
	СтрОписаниеЮрлица = СтрОписаниеЮрлица +", " + "КПП " + СведенияОбОрганизации.Kpp;
	
	Если СведенияОбАдресе <> Неопределено Тогда 
		СтрОписаниеЮрлица = СтрОписаниеЮрлица + ", " + СформироватьПредставлениеАдреса(СведенияОбАдресе);
	КонецЕсли;
	
	Возврат СтрОписаниеЮрлица;
КонецФункции

Функция ПолучитьОписаниеОрганизацииДляСчетаНаОплату(Контрагент, датаОперации, БанковскийСчет = Неопределено) Экспорт 
	
	СведенияОбОрганизации = ПолучитьСтруктурированноеОписаниеЮрФизЛица( Контрагент, датаОперации, БанковскийСчет,  Истина);
	
	СведенияОбАдресе = ОсновнойМодуль.Новый_AddressInfo();
	ЗаполнитьСтруктуруАдреса(СведенияОбАдресе, Контрагент, Истина);
	
	Возврат ОписаниеЮрЛица_ВСтроку(СведенияОбОрганизации, СведенияОбАдресе)
	
КонецФункции

Функция ПолучитьПредставлениеКонтрагентаДляАкта(Контрагент, ДатаОперации)   Экспорт 
	СведенияОбОрганизации 	  = ПолучитьСтруктурированноеОписаниеЮрФизЛица( Контрагент, датаОперации, Неопределено,  Истина);
	Возврат ОписаниеЮрЛица_ВСтроку(СведенияОбОрганизации)
	
КонецФункции	

Функция ПолучитьСтруктуруБанковскогоСчета(Организация, БанковскийСчетОрганизации)  Экспорт 
	
	Если ЗначениеЗаполнено(БанковскийСчетОрганизации) Тогда
		БанкССылка = БанковскийСчетОрганизации;
		Если БанкСсылка <> Неопределено Тогда 
			мБанк = ?(НЕ ЗначениеЗаполнено(БанкСсылка.БанкДляРасчетов), БанкСсылка.Банк, БанкСсылка.БанкДляРасчетов);
			мГородБанка = мБанк.Город;
			мКоррСчет   = мБанк.КоррСчет;
			мБИК        = мБанк.Код;
			мНомерСчета = ?(БанкСсылка.БанкДляРасчетов.Пустая(), БанкСсылка.НомерСчета, БанкСсылка.Банк.КоррСчет);
			
			мТекстПолучателя = Организация.НаименованиеПолное;
			Если ЗначениеЗаполнено(БанкСсылка.БанкДляРасчетов) Тогда
				мТекстПолучателя = мТекстПолучателя + " р/с " + БанкСсылка.НомерСчета + " в " + БанкСсылка.Банк + " " + БанкСсылка.Банк.Город;
			КонецЕсли;
			
		КонецЕсли;
		Возврат Новый Структура ("Банк,БИК,КоррСчет,ГородБанка,НомерМсета,ТекстПолучателя,НомерСчета", мБанк, мБИК, мКоррСчет, мГородБанка, мНомерСчета, мТекстПолучателя, мНомерСчета);
	Иначе 
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруОснования(ДокСсылка, ЭтоАкт = Ложь, ЭтоУПД = Ложь)  Экспорт 
	ДоговорКонтрагента = ДокСсылка.ДоговорВзаиморасчетов;
	
	Ground = Новый Структура;
	Ground.Вставить("GroundName", 	"");
	Ground.Вставить("GroundNumber", "");
	Ground.Вставить("GroundDate", 	"");
	Ground.Вставить("Основание", 	"");
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда 
			
		Если ЭтоУПД Тогда
			ПредставлениеДоговора= "Договор";
		Иначе
			ПредставлениеДоговора= ДоговорКонтрагента.Наименование;
		КонецЕсли;
			
		Ground.Вставить("GroundName", 	ПредставлениеДоговора);
		Ground.Вставить("GroundNumber", ДоговорКонтрагента.НомерДоговора);
		Ground.Вставить("GroundDate", 	ДоговорКонтрагента.ДатаНачала);
		Ground.Вставить("Основание", 	ДоговорКонтрагента);
		
	КонецЕсли;	 
	
	Возврат  Ground;
КонецФункции	

Функция ПолучитьСтруктуруОснованияУПД(ДокументСсылка, ДанныеШапки)  Экспорт
	
	ЭтоАкт	= Ложь;
	ЭтоУПД	= Истина;
	
	Результат = ПолучитьСтруктуруОснования(ДокументСсылка, ЭтоАкт, ЭтоУПД);
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьТабличнуюЧасть(ЭтоКСФ)
	
	ТабличнаяЧасть = Новый таблицаЗначений;
	ТабличнаяЧасть.Колонки.Добавить("Номенклатура");
	ТабличнаяЧасть.Колонки.Добавить("КодНоменклатуры");
	ТабличнаяЧасть.Колонки.Добавить("КодЕдиницыИзмерения");
	ТабличнаяЧасть.Колонки.Добавить("ЕдиницаИзмерения");
	ТабличнаяЧасть.Колонки.Добавить("ВидУпаковки");
	ТабличнаяЧасть.Колонки.Добавить("КоличествоВОдномМесте");
	ТабличнаяЧасть.Колонки.Добавить("КоличествоМест");
	ТабличнаяЧасть.Колонки.Добавить("масса");
	ТабличнаяЧасть.Колонки.Добавить("Количество");
	ТабличнаяЧасть.Колонки.Добавить("Цена");
	ТабличнаяЧасть.Колонки.Добавить("СтавкаНДС");
	ТабличнаяЧасть.Колонки.Добавить("СуммаНДС");
	ТабличнаяЧасть.Колонки.Добавить("Сумма");
	ТабличнаяЧасть.Колонки.Добавить("СуммаВключаетНДС");
	ТабличнаяЧасть.Колонки.Добавить("СтранаПроисхождения");
	ТабличнаяЧасть.Колонки.Добавить("НомерГТД");
	
	Если ЭтоКСФ Тогда 
		ТабличнаяЧасть.Колонки.Добавить("СтранаПроисхожденияДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("НомерГТДДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("КоличествоДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("ЕдиницаИзмеренияДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("КодЕдиницыИзмеренияДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("ЦенаДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("СтавкаНДСДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("СуммаНДСДоИзменения");
		ТабличнаяЧасть.Колонки.Добавить("СуммаДоИзменения");
	КонецЕсли;	
	
	
	Возврат табличнаяЧасть;
КонецФункции

Функция ПолучитьЕИПоКлассификатору(ЕдиницаИзмерения)
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения)
		И (ТипЗнч(ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения")) Тогда
		Возврат ЕдиницаИзмерения.ЕдиницаПоКлассификатору;
	Иначе
		Возврат ЕдиницаИзмерения
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОтветственноеЛицо(ДатаДокумента, Организация, ВидОтвественногоЛица)
	
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДатаДокумента, Новый Структура("Организация, Объект", Организация, ВидОтвественногоЛица));
	Возврат СтруктураСведений.Значение;
	
КонецФункции

/////////////////////////////////////////////////////////////
// функции создания новых доков на основании данных ДД
/////////////////////////////////////////////////////////////

Функция ДобавитьВедущиеНули(стр, длина)
	
	результат = стр;
	Пока СтрДлина(результат) < длина Цикл 
		результат = "0" + результат
	КонецЦикла;
	
	Возврат результат;
	
КонецФункции	

Функция СвернутьтаблицуПоКлючам(ТабличнаяЧасть)
	
	ТабличнаяЧасть.Колонки.удалить(ТабличнаяЧасть.Колонки.XmlTorg12_Item);
	СписокКлючей = Новый СписокЗначений();
	СтрокаСвертки = "";
	Для Каждого колонка Из ТабличнаяЧасть.колонки Цикл 
		Если найти("Количество, Сумма, СуммаНДС, Всего, XmlTorg12_ItemSubtotal, XmlTorg12_ItemSubtotalWithVatExcluded,  НомерСтроки", колонка.имя) = 0 Тогда
			СписокКлючей.Добавить(колонка.имя);
			СтрокаСвертки = ?(СтрокаСвертки = "", "", СтрокаСвертки + ", ") + колонка.имя;
		КонецЕсли;	
	КонецЦикла;
	
	Результат = ТабличнаяЧасть.скопировать();
	Результат.свернуть(СтрокаСвертки, "Количество, Сумма, СуммаНДС, Всего, XmlTorg12_ItemSubtotal, XmlTorg12_ItemSubtotalWithVatExcluded,  НомерСтроки");
	
	Если результат.количество() = ТабличнаяЧасть.количество() Тогда
		Возврат ТабличнаяЧасть
	КонецЕсли;
	
	//расставим номера в свернутой таблице
	Для каждого стр Из результат Цикл 
		Ключ = Новый Структура;
		Для каждого колонка Из СписокКлючей Цикл 
			Ключ.Вставить(колонка.Значение, стр[колонка.Значение]);
		КонецЦикла;
		
		выборка = ТабличнаяЧасть.НайтиСтроки(Ключ);
		стр.номерСтроки = ДобавитьВедущиеНули(выборка[0].НомерСтроки, 4);
	КонецЦикла;	
	
	результат.сортировать("НомерСтроки");
	Возврат результат;
	
КонецФункции

Функция СоздатьДокументПоступлениеТоваровУслуг(параметры, стВероятныеПоля, ЭДОбъект, ТабличнаяЧасть = Неопределено, СуммаВключаетНДС = Истина, ВидОперации, ЗаполнениеГТД = Ложь) Экспорт
	
	Если ВидОперации = "ПоступлениеДопРасходов" Тогда
		ДокОбъект = Документы.ПоступлениеДопРасходов.СоздатьДокумент();
	ИначеЕсли ВидОперации = "ПоступлениеАвтомобилей" Тогда
		ДокОбъект = Документы.ПоступлениеАвтомобилей.СоздатьДокумент();	
	Иначе
		ДокОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	КонецЕсли;
	
	// Заполнение возможных полей
	Если ВидОперации = "ПоступлениеДопРасходов" Тогда
		ДокОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеДопРасходов;
	ИначеЕсли ВидОперации = "ПоступлениеАвтомобилей" Тогда
		ДокОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;
	ИначеЕсли ВидОперации = "УслугиСтороннихОрганизаций" Тогда
		ДокОбъект.ХозОперация = Справочники.ХозОперации.УслугиСтороннихОрганизаций;
	Иначе
		ДокОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	КонецЕсли;
		
	Если стВероятныеПоля.Организация = Неопределено Тогда
		Сообщить("Организация в системе Диадок: """ + ЭДОбъект.Organization.BoxInfo.Name + """, ИНН/КПП: " + ЭДОбъект.Organization.Inn + "/" + ЭДОбъект.Organization.Kpp + " не ассоциирована с организацией в 1С");
	Иначе
		ДокОбъект.Организация = стВероятныеПоля.Организация;
	КонецЕсли;
	Если стВероятныеПоля.Контрагент = Неопределено Тогда
		Сообщить("Контрагент в системе Диадок: """ + ЭДОбъект.counterAgent.Name + """, ИНН/КПП: " + ЭДОбъект.counterAgent.Inn + "/" + ЭДОбъект.counterAgent.Kpp + " не ассоциирован с контрагентом в 1С");
	Иначе
		ДокОбъект.Контрагент = стВероятныеПоля.Контрагент;
		
		Если ЗначениеЗаполнено(параметры.ДоговорКонтрагента) Тогда 
			ДокОбъект.ДоговорВзаиморасчетов= параметры.ДоговорКонтрагента;
			ДокОбъект.ВалютаДокумента= ДокОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперации <> "ПоступлениеДопРасходов" Тогда
		ДокОбъект.СкладКомпании = Параметры.Склад;
	КонецЕсли;
	
	МетаданныеОбъекта = ДокОбъект.Метаданные();
	
	ЕстьКодыМаркировки = ЕстьШтрихкодыУпаковок(МетаданныеОбъекта);
	ЕстьЯчейкиХранения = Ложь;
	
	Если ВидОперации <> "ПоступлениеАвтомобилей" Тогда
		ЕстьЯчейкиХранения = МетаданныеОбъекта.ТабличныеЧасти.Товары.Реквизиты.Найти("Ячейка") <> Неопределено;
	КонецЕсли;
	
	дкФормаПриОткрытии(ДокОбъект.ПолучитьФорму());
		
	ДокОбъект.ВхДокДата		= Параметры.ДатаВходящегоДокумента;
	ДокОбъект.ВхДокНомер	= Параметры.НомерВходящегоДокумента;
	
	Если ТабличнаяЧасть <> Неопределено Тогда
		
		Для каждого Стр Из ТабличнаяЧасть Цикл
			
			ИдентификаторСтроки = НовыйИдентификаторСтрокиТЧ();
			ЗначениеСвойстваИдентификатор = ЗначенияЗаполненияИдентификатораСтрокиТЧ(ИдентификаторСтроки);
			
			Если ВидОперации = "ПоступлениеАвтомобилей" Тогда
				СтрОбъект = ДокОбъект.Автомобили.Добавить();
				СтрОбъект.Автомобиль 				= Стр.Номенклатура;
				СтрОбъект.АвтомобильБезЗаказа 		= Истина;
				СтрОбъект.Количество 				= 1;
			Иначе
				
				СтрОбъект = ДокОбъект.Товары.Добавить();
				СтрОбъект.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
				Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
					СтрОбъект.Коэффициент = Стр.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
				
				СтрОбъект.Номенклатура	= Стр.Номенклатура;
				СтрОбъект.Количество	= Стр.Количество;
				Если ВидОперации = "ПоступлениеДопРасходов" Тогда
					СтрОбъект.ЕдиницаИзмерения = СтрОбъект.Номенклатура.ОсновнаяЕдиницаИзмерения;
					Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
						СтрОбъект.Коэффициент = СтрОбъект.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
					КонецЕсли;
				Иначе
					СтрОбъект.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
					Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
						СтрОбъект.Коэффициент = Стр.ЕдиницаИзмерения.Коэффициент;
					КонецЕсли;
					СтрОбъект.КоличествоБазовое = Стр.Количество * СтрОбъект.Коэффициент;
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрОбъект, ЗначениеСвойстваИдентификатор);
			
			СтрОбъект.СуммаНДС		= Стр.СуммаНДС;
			СтрОбъект.СуммаВсего	= Стр.Всего;
			СтрОбъект.СтавкаНДС		= Стр.СтавкаНДС;

			Если ДокОбъект.Организация.ОсвобожденОтНДС И СтрОбъект.СтавкаНДС <> Справочники.СтавкиНДС.БезНДС Тогда 
				СтрОбъект.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				СтрОбъект.СуммаНДС	= 0;
			КонецЕсли;	
			
			Если СуммаВключаетНДС Тогда
				СтрОбъект.Сумма = СтрОбъект.СуммаВсего;
			Иначе
				СтрОбъект.Сумма = СтрОбъект.СуммаВсего - СтрОбъект.СуммаНДС;
			КонецЕсли;
			
			Если ЗаполнениеГТД Тогда
				СтрОбъект.ГТД = НайтиИлиСоздатьГТД(Стр.ГТД, Стр.СтранаПроисхождения);
			КонецЕсли;
			
			СтрОбъект.Цена = СтрОбъект.Сумма / ?(СтрОбъект.Количество = 0, 1, СтрОбъект.Количество);
			
			СтрОбъект.СуммаНДС 		= Стр.СуммаНДС;
			СтрОбъект.СуммаВсего 	= Стр.Всего;
			СтрОбъект.СтавкаНДС 	= Стр.СтавкаНДС;
			
			Если ЕстьЯчейкиХранения Тогда
				СтрОбъект.Ячейка = Справочники.Номенклатура.ПолучитьЯчейкуХранения(
				СтрОбъект.Номенклатура, ДокОбъект.СкладКомпании);
			КонецЕсли;
			
			Если ЕстьКодыМаркировки Тогда
				
				ДополнитьКодыМаркировки(
					ДокОбъект.КодыМаркировки,
					Стр.СведенияОМаркировке,
					ИдентификаторСтроки,
					Стр.НоменклатураДокумента.GTIN
				);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДокОбъект;
	
КонецФункции

Функция СоздатьДокументВозвратТоваровОтПокупателя(параметры, стВероятныеПоля, ЭДОбъект) Экспорт
	
	ДокОбъект = Документы.ВозвратОтПокупателя.СоздатьДокумент();
	
	// Заполнение возможных полей
	Если стВероятныеПоля.Организация = Неопределено Тогда
		Сообщить("Организация в системе Диадок: """ + ЭДОбъект.Organization.Name + """, ИНН/КПП: " + ЭДОбъект.Organization.Inn + "/" + ЭДОбъект.Organization.Kpp + " не ассоциирована с организацией в 1С");
	Иначе
		ДокОбъект.Организация = стВероятныеПоля.Организация;
	КонецЕсли;
	Если стВероятныеПоля.Контрагент = Неопределено Тогда
		Сообщить("Контрагент в системе Диадок: """ + ЭДОбъект.counterAgent.Name + """, ИНН/КПП: " + ЭДОбъект.counterAgent.Inn + "/" + ЭДОбъект.counterAgent.Kpp + " не ассоциирован с контрагентом в 1С");
	Иначе
		ДокОбъект.Контрагент = стВероятныеПоля.Контрагент;
	КонецЕсли;
	
	ДокОбъект.ОбработкаРеквизита("Контрагент");
	
	Возврат ДокОбъект;
	
КонецФункции

Процедура ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения) Экспорт
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения);
	
КонецПроцедуры

Функция СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения);
	
КонецФункции

Функция СоздатьДокумент_СчетФактураВыданный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СоздатьДокумент_СчетФактураВыданный(Document, ДокументОснование, ПараметрыЗаполнения);
	
КонецФункции

Функция НайтиИлиСоздатьГТД(номерГТД, СтранаПроисхождения)
	
	Если значениеЗаполнено(НомерГТД) = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГТД.Ссылка
		|ИЗ
		|	Справочник.ГТД КАК ГТД
		|ГДЕ
		|	ГТД.Страна = &СтранаПроисхождения
		|	И ГТД.Наименование = &НомерГТД";
	
	Запрос.УстановитьПараметр("СтранаПроисхождения", СтранаПроисхождения );
	Запрос.УстановитьПараметр("НомерГТД", НомерГТД );
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ссылка;
	Иначе
		элементГТДОбъект = Справочники.ГТД.СоздатьЭлемент();
		элементГТДОбъект.Наименование = номерГТД;
		элементГТДОбъект.Страна = СтранаПроисхождения;
		элементГТДОбъект.УстановитьНовыйКод();
		Попытка
			элементГТДОбъект.Записать();
			Возврат элементГТДОбъект.Ссылка;
		Исключение
			Сообщить("Ошибка при записи ГТД:
			|"+ ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Процедура УстановитьДоговорВСчетеФактуреДляДиадокПР(СчетФактура) Экспорт
	
КонецПроцедуры

Функция ПолучитьЕдиницуИзмерения(КодЕИ, НаименованиеЕИ, Номенклатура) Экспорт
	
	//перебираем все ИЕ для номенклатуры, и ищем по полному совпадению, либо по наличию коэффициента пересчета
		
	ПодходящаяЕИ = Неопределено;
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда 
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "
			|ВЫБРАТЬ
			|	ЕИ.Ссылка
			|ИЗ
			|	Справочник.ЕдиницыИзмерения ЕИ
			|ГДЕ
			|	ЕИ.Владелец = &Номенклатура";
			
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура.ТипНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЕИ_ПоКлассификатору = Выборка.Ссылка.ЕдиницаПоКлассификатору;
			Если ЕИ_ПоКлассификатору.Код = КодЕИ ИЛИ ЕИ_ПоКлассификатору.Наименование = НаименованиеЕИ Тогда 
				Возврат Выборка.Ссылка;
			КонецЕсли;	
			Коэф = ОсновнойМодуль.ПолучитьКоэффициентПересчета(КодЕИ, ЕИ_ПоКлассификатору.Код);
			Если Коэф <> Неопределено Тогда 
				ПодходящаяЕИ = Выборка.Ссылка;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ?(ПодходящаяЕИ = Неопределено, Справочники.ЕдиницыИзмерения.ПустаяСсылка(), ПодходящаяЕИ);
	
КонецФункции

Функция ПолучитьКоэффициентПересчета(КодЕИ, НаименованиеЕИ, НоваяЕдиницаИзмерения) Экспорт
	
	Если (НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.код = КодЕИ) 
		Или (НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.наименование = НаименованиеЕИ) Тогда
		Возврат  1;
	КонецЕсли;	
	
	Коэф = ОсновнойМодуль.ПолучитьКоэффициентПересчета(КодЕИ, НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.код);
	Возврат ?(коэф = Неопределено, 1, коэф);
	
КонецФункции

Функция ПолучитьСтавкуНДСДиадок(TaxRate) Экспорт
	
	Если НЕ ЗначениеЗаполнено(TaxRate) ИЛИ НРег(TaxRate) = "без ндс" Тогда
		Возврат Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = "";
	
	Если Лев(TaxRate, 1) = "0" Тогда
		ТекстУсловия = "Наименование ПОДОБНО ""0\%"" СПЕЦСИМВОЛ ""\"" И Ставка = 0";
	ИначеЕсли СтрНайтиЛок(TaxRate, "5") > 0 Тогда
		Если СтрНайтиЛок(TaxRate, "/") > 0 Тогда
			ТекстУсловия = "Наименование ПОДОБНО ""%/%"" И Ставка = 5";
		Иначе
			ТекстУсловия = "НЕ Наименование ПОДОБНО ""%/%"" И Ставка = 5";
		КонецЕсли;
	ИначеЕсли СтрНайтиЛок(TaxRate, "7") > 0 Тогда
		Если СтрНайтиЛок(TaxRate, "/") > 0 Тогда
			ТекстУсловия = "Наименование ПОДОБНО ""%/%"" И Ставка = 7";
		Иначе
			ТекстУсловия = "НЕ Наименование ПОДОБНО ""%/%"" И Ставка = 7";
		КонецЕсли;
	ИначеЕсли СтрНайтиЛок(TaxRate, "18") > 0 Тогда
		Если СтрНайтиЛок(TaxRate, "/") > 0 Тогда
			ТекстУсловия = "Наименование ПОДОБНО ""%/%"" И Ставка = 18";
		Иначе
			ТекстУсловия = "НЕ Наименование ПОДОБНО ""%/%"" И Ставка = 18";
		КонецЕсли;
	ИначеЕсли СтрНайтиЛок(TaxRate, "10") > 0 Тогда
		Если СтрНайтиЛок(TaxRate, "/") > 0 Тогда
			ТекстУсловия = "Наименование ПОДОБНО ""%/%"" И Ставка = 10";
		Иначе
			ТекстУсловия = "НЕ Наименование ПОДОБНО ""%/%"" И Ставка = 10";
		КонецЕсли;
	ИначеЕсли СтрНайтиЛок(TaxRate, "20") > 0 Тогда
		Если СтрНайтиЛок(TaxRate, "/") > 0 Тогда
			ТекстУсловия = "Наименование ПОДОБНО ""%/%"" И Ставка = 20";
		Иначе
			ТекстУсловия = "НЕ Наименование ПОДОБНО ""%/%"" И Ставка = 20";
		КонецЕсли;
	ИначеЕсли СтрНайтиЛок(TaxRate, "22") > 0 Тогда
		Если СтрНайтиЛок(TaxRate, "/") > 0 Тогда
			ТекстУсловия = "Наименование ПОДОБНО ""%/%"" И Ставка = 22";
		Иначе
			ТекстУсловия = "НЕ Наименование ПОДОБНО ""%/%"" И Ставка = 22";
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстУсловия) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.СтавкиНДС ГДЕ " + ТекстУсловия;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокВидовДоговоров(ВидОперации = Неопределено) Экспорт
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.Покупка);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.Прочее);
	Возврат СписокВидовДоговоров;
КонецФункции

Функция ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, СписокВидовДоговоров) Экспорт
	
	Если Метаданные.Справочники.ДоговорыВзаиморасчетов.Реквизиты.Найти("Основной") = Неопределено Тогда
		
		Запрос = Новый Запрос( 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.ОсновнойДоговорВзаиморасчетов КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|		ПО Контрагенты.ОсновнойДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
		|			И (ДоговорыВзаиморасчетов.Организация = &Организация)
		|			И (НЕ ДоговорыВзаиморасчетов.ПометкаУдаления)
		|			И (ДоговорыВзаиморасчетов.ВидДоговора В (&СписокДоговоров))
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент");
		
	Иначе
		
		Запрос = Новый Запрос( 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыВзаиморасчетов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Владелец = &Контрагент
		|	И ДоговорыВзаиморасчетов.Организация = &Организация
		|	И ДоговорыВзаиморасчетов.Основной
		|	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
		|	И ДоговорыВзаиморасчетов.ВидДоговора В(&СписокДоговоров)");
		
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокВидовДоговоров);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка
	КонецЕсли;
		
КонецФункции

//////////////////////////////////////////////////////////
// функции для работы с формами 1С
//////////////////////////////////////////////////////////

Функция ПолучитьФормуВыбораДоговораКонтрагента(Элемент, Организация, ДатаДокумента, Контрагент, ВидыДоговоров, ДоговорКонтрагента) Экспорт
	
	ФрмВыбора = Справочники.ДоговорыВзаиморасчетов.ПолучитьФормуСписка(, Элемент);
	ФрмВыбора.ПараметрОтборПоВладельцу = Контрагент;
	ФрмВыбора.РежимВыбора = Истина;
	
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.ВидСравнения = ВидСравнения.ВСписке;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Значение = ВидыДоговоров;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Использование = Истина;
	
	ФрмВыбора.СправочникСписок.Отбор.Организация.Значение = Организация;
	ФрмВыбора.СправочникСписок.Отбор.Организация.Использование = Истина;
	ФрмВыбора.СправочникСписок.Отбор.Организация.ВидСравнения = ВидСравнения.Равно;
	
	ФрмВыбора.СправочникСписок.Отбор.ДатаНачала.Значение = ТекущаяДата();
	ФрмВыбора.СправочникСписок.Отбор.ДатаНачала.Использование = Истина;
	ФрмВыбора.СправочникСписок.Отбор.ДатаНачала.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
	
	ФрмВыбора.СправочникСписок.Отбор.ДатаКонца.Значение = ДатаДокумента;
	ФрмВыбора.СправочникСписок.Отбор.ДатаКонца.Использование = Ложь;
	ФрмВыбора.СправочникСписок.Отбор.ДатаКонца.ВидСравнения = ВидСравнения.БольшеИлиРавно;
	
	ФрмВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
	Возврат ФрмВыбора;
	
КонецФункции

//////////////////////////////////////////////////////
//функции генерации структуры для ФУФ счета-фактуры
///////////////////////////////////////////////////////

Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция ПолучитьСФОснованиеДляИСФДиадок(ИСФ)   Экспорт 
	результат = Новый Структура;
	
	ДокОснование = ИСФ.ДокументОснование;
	Если ДокОснование.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон Тогда 
		Докоснование = ДокОснование.ДокументОснование;
	Иначе 	
		Пока (ТипЗнч(Докоснование) = Тип("ДокументСсылка.КорректировкаРеализации")) 
			И (ДокОснование.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах) Цикл
			ДокОснование = ДокОснование.ДокументОснование;
		КонецЦикла;
	КонецЕсли;	
	
	результат.Вставить("ПервичныйДокументОснование",  ДокОснование);
	//ищем СФ
	запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование,
	|	СчетФактураВыданныйДокументыОснования.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления = Ложь
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("Документоснование", ДокОснование);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда 
		Возврат  выборка.ссылка;
	КонецЕсли;	
	
	Возврат Неопределено;
КонецФункции	

Функция СформироватьСведенияОПодписанте(юрФизЛицо)
	СведенияОПодписанте = Новый Структура;
	
	ОбъектДляОтбора = ЮрФизЛицо;
	
	//формируем данные для элемента ИдСвед
	Если стрДлина(СокрЛП(юрФизЛицо.ИНН)) = 12 Тогда 
		//это физлицо 
		СведенияФЛ = Новый Структура;
		СведенияФЛ.Вставить("ИННФЛ", СокрЛП(юрФизЛицо.ИНН));
		
		Если типЗнч(юрФизЛицо) = тип("СправочникСсылка.Организации") Тогда 
			//для нашей организации - данные берем из нормализованного представления физлица
			ПредставлениеФИО  = юрФизЛицо.наименованиеПолное;
			ОбъектДляОтбора = юрФизЛицо;
			//сформируем сведения, необходимые для формирования данных о подписанте 
			ИП = Новый Структура;
			ИП.Вставить("ИННФЛ", СокрЛП(юрФизЛицо.ИНН));
			СведенияОПодписанте.Вставить("ИП", ИП);
		Иначе 
			ПредставлениеФИО  = юрФизЛицо.НаименованиеПолное 
		КонецЕсли;	  
		ФИО = Новый Структура;
		ФИО.Вставить("Фамилия", ВыделитьСлово(ПредставлениеФИО));
		ФИО.Вставить("Имя", ВыделитьСлово(ПредставлениеФИО));
		ФИО.Вставить("Отчество", ВыделитьСлово(ПредставлениеФИО));
		СведенияФЛ.Вставить("ФИОИП", ФИО);
	Иначе 
		//это юрлицо 
		СведенияЮЛ = Новый Структура;
		СведенияЮЛ.Вставить("НаимОрг", юрФизЛицо.НаименованиеПолное); 
		СведенияЮЛ.Вставить("ИННЮЛ", СокрЛП(юрФизЛицо.ИНН));
		СведенияЮЛ.Вставить("КПП", юрФизЛицо.КПП);
		
		//формируем сведения, необходимые для тэга Подписант
		ЮЛ = Новый Структура;
		ЮЛ.Вставить("ИННЮЛ",  СокрЛП(юрФизЛицо.ИНН));
		СведенияОПодписанте.Вставить("ЮЛ", ЮЛ);
	КонецЕсли;
	
	Возврат СведенияОПодписанте;
	
КонецФункции

Функция сформироватьДанныеДляПечати(СсылкаНаОбъект, ЭтоКСФ) Экспорт
	ДанныеДляПечати = Новый Структура;
	ДанныеДляпечати.Вставить("Дата"				, СсылкаНаОбъект.Дата);
	ДанныеДляПечати.Вставить("Номер"			, ССылкаНаОбъект.Номер);
	
	Если  ЭтоКСФ = Ложь Тогда
		ДанныеДляПечати.Вставить("ДатаНомерДокументовОплаты", Новый массив);
		ДанныеДляПечати.Вставить("Валюта", СсылкаНаОбъект.ВалютаДокумента);
		ДанныеДляПечати.Вставить("Покупатель", СсылкаНаОбъект.Контрагент);
		ДанныеДляПечати.Вставить("Поставщик", СсылкаНаОбъект.Организация);
		ДанныеДляПечати.Вставить("Грузоотправитель", ?(СсылкаНаОбъект.Организация = СсылкаНаОбъект.ПодразделениеКомпании.Организация, "он же", СсылкаНаОбъект.ПодразделениеКомпании.Организация));
		ДанныеДляПечати.Вставить("Грузополучатель", СсылкаНаОбъект.Грузополучатель);
		ДанныеДляПечати.Вставить("ТабличнаяЧасть", ПолучитьДанныеТЧ(СсылканаОбъект, ЭтоКСФ, Истина));
	Иначе 
		ДанныеДляПечати.Вставить("ДатаНомерДокументовОплаты", Новый массив);
		ДанныеДляПечати.Вставить("Валюта", СсылкаНаОбъект.ВалютаДокумента);
		ДанныеДляПечати.Вставить("Покупатель", СсылкаНаОбъект.Контрагент);
		ДанныеДляПечати.Вставить("Поставщик", СсылкаНаОбъект.Организация);
		ДанныеДляПечати.Вставить("ТабличнаяЧасть", ПолучитьДанныеТЧ(СсылканаОбъект, ЭтоКСФ, Истина));
	КонецЕсли;
	
	Возврат ДанныеДляПечати;
КонецФункции

Процедура ЗаполнитьСтруктуруГрузоПолучателяОтправителя(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, АдресСтрокой = "") Экспорт 
	
	Если стрДлина(СокрЛП(юрФизЛицо.ИНН)) = 12 Тогда 
		Если типЗнч(юрФизЛицо) = тип("СправочникСсылка.Организации") Тогда 
			НаименованиеОрганизации  = юрФизЛицо.ИндивидуальныйПредприниматель.Наименование;
		Иначе 
			НаименованиеОрганизации  = юрФизЛицо.НаименованиеПолное 
		КонецЕсли;	  
		ЭтоИП = Истина;
	Иначе 
		НаименованиеОрганизации =    юрФизЛицо.НаименованиеПолное;
		ЭтоИП = Ложь;
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.IsSoleProprietor  =  ЭтоИП;
	OrganizationInfo.Ссылка = ЮрФизЛицо;
	OrganizationInfo.SameAsSellerOrBuyer = Ложь;
	
	ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ЮрФизЛицо, Ложь, АдресСтрокой);
	
КонецПроцедуры

Функция СФОтправлена(ДокСсылка)
	ЗапросСФ = Новый Запрос;
	ЗапросСФ.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокСсылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Док
	|ГДЕ
	|	Док.ДокументОснование = &ДокОснование";
	ЗапросСФ.УстановитьПараметр("ДокОснование", ДокСсылка);
	ВыборкаСФ = ЗапросСФ.Выполнить().Выбрать();
	Пока ВыборкаСФ.Следующий() Цикл
		DocumentId = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").Документ_2_DocumentID(ВыборкаСФ.ДокСсылка);
		Если ЗначениеЗаполнено(DocumentId) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ПолучитьПоследнееИсправление(КоррСтарт, ПоследнееОтправленное) Экспорт
	текКор = КоррСтарт;
	
	Пока Истина Цикл
		// получаем следующего кандидата, проверям его
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Док.Ссылка ДокСсылка
		|ИЗ
		|	Документ.КорректировкаРеализации КАК Док
		|ГДЕ
		|	Док.ДокументОснование = &ДокСсылка
		|	И Док.ХозОперация = &ВидОперации";
		Запрос.УстановитьПараметр("ДокСсылка", текКор);
		Запрос.УстановитьПараметр("ВидОперации", Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			// Проверяем кандидата
			Если ПоследнееОтправленное И НЕ СФОтправлена(Выборка.ДокСсылка) Тогда
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
		текКор = Выборка.ДокСсылка;
	КонецЦикла;
	
	Возврат текКор;
КонецФункции

Функция ПолучитьДочернееИсправление(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокССылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Док
	|ГДЕ
	|	Док.ДокументОснование = &ДокСсылка
	|	И Док.ХозОперация = &ВидОперации";
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ВидОперации", Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокССылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьКорректировкуОбъект(ТипНовогоДокумента, КорректировкаРеализацииОснование) Экспорт
	КорректировкаОбъект = Документы.КорректировкаРеализации.СоздатьДокумент();
	Если ТипНовогоДокумента = "InvoiceRevision" ИЛИ ТипНовогоДокумента = "InvoiceCorrectionRevision" Тогда
		КорректировкаОбъект.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах;
	Иначе
		КорректировкаОбъект.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон;
	КонецЕсли;
	
	КорректировкаОбъект.ДокументОснование = КорректировкаРеализацииОснование;
	
	Возврат КорректировкаОбъект;
КонецФункции

Функция СчетФактураПолученныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Т
	|ГДЕ
	|	Т.ДокументОснование = &ДокументОснование И НЕ Т.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции

Функция СчетФактураВыданныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СчетФактураВыданныйПоДокументуОснование(ДокументОснование);	
	
КонецФункции

Функция ПолучитьНеотправленнуюКорректировку(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокССылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Док
	|ГДЕ
	|	Док.ДокументОснование = &ДокСсылка
	|	И Док.ХозОперация = &ВидОперации";
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ВидОперации", Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ СФОтправлена(Выборка.ДокССылка) Тогда
			Возврат Выборка.ДокССылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьПоследнююКорректировкуПоступления(ПоследняяКорректировка) Экспорт
	
	Если ЗначениеЗаполнено(ПоследняяКорректировка) Тогда
		
		XMLИмяТипа= XMLТипЗнч(ПоследняяКорректировка).ИмяТипа;
		
		Запрос= Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КорректировкаПоступления
		|ГДЕ
		|	ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах)
		|	И ДокументОснование = &ДокументОснование");
		
		Если 	XMLИмяТипа = "DocumentRef.ПоступлениеАвтомобилей"
			ИЛИ XMLИмяТипа = "DocumentRef.КорректировкаПоступленияАвтомобилей" Тогда
			Запрос.Текст= СтрЗаменить(Запрос.Текст, "КорректировкаПоступления", "КорректировкаПоступленияАвтомобилей");
		КонецЕсли;
		
		Пока Истина Цикл
			
			Запрос.УстановитьПараметр("ДокументОснование", ПоследняяКорректировка);
			
			РезультатЗапроса= Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Возврат ПоследняяКорректировка;
			Иначе
				Выборка= РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				ПоследняяКорректировка= Выборка.Ссылка;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПоследняяКорректировка;
	
КонецФункции

Функция получитьДокументОснованиеДляКорректировкиПоступления(Document) Экспорт 
	Если Document.type =  "InvoiceRevision" Тогда 
		запрос = Новый запрос;
		запрос.Текст = "ВЫБРАТЬ
		|	СчетФактураПолученный.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ВхДокДата = &ДатаВходящегоДокумента
		|	И СчетФактураПолученный.ВхДокНомер = &НомерВходящегоДокумента
		|	И СчетФактураПолученный.Исправление = Ложь";
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalDocumentNumber);		
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalDocumentdate));		
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Док =  результат.ДокументОснование;
			Возврат 	ПолучитьПоследнююКорректировкуПоступления(Док); 
		Иначе 
			Возврат Неопределено 
		КонецЕсли;	
	ИначеЕсли Document.type = "InvoiceCorrection"  Тогда 
		запрос = Новый Запрос;
		Если ЗначениеЗаполнено(Document.OriginalInvoicerevisionNumber) = Ложь Тогда 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетФактураПолученный.ДокументОснование
			|ИЗ
			|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
			|ГДЕ
			|	СчетФактураПолученный.ВхДокДата = &ДатаВходящегоДокумента
			|	И СчетФактураПолученный.ВхДокНомер = &НомерВходящегоДокумента
			|	И СчетФактураПолученный.Исправление = Ложь";
		Иначе 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетФактураПолученный.ДокументОснование
			|ИЗ
			|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
			|ГДЕ
			|	СчетФактураПолученный.ВхДокДата = &ДатаВходящегоДокумента
			|	И СчетФактураПолученный.ВхДокНомер = &НомерВходящегоДокумента
			|	И СчетФактураПолученный.Исправление
			|	И СчетФактураПолученный.НомерИсправления = &НомерИсправления";
			Запрос.УстановитьПараметр("НомерИсправления", число(Document.OriginalInvoicerevisionNumber));		
		КонецЕсли;				
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalDocumentNumber);		
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalDocumentdate));
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Возврат результат.ДокументОснование;
		Иначе 
			Возврат Неопределено
		КонецЕсли;
	ИначеЕсли Document.type = "InvoiceCorrectionRevision"  Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СчетФактураПолученный.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ВхДокДата = &ДатаВходящегоДокумента
		|	И СчетФактураПолученный.ВхДокНомер = &НомерВходящегоДокумента";
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalInvoiceCorrectionDate));
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalInvoiceCorrectionNumber);
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Возврат результат.ДокументОснование;
		Иначе 
			Возврат Неопределено
		КонецЕсли;
	Иначе 
		Возврат Неопределено
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьСуммуПрописьюДиадок(Total, ВалютаДокумента) Экспорт 
	Возврат обЧислоПрописью(Total, ВалютаДокумента)
КонецФункции	

Функция ПолучитьПодразделениеИзДокумента(ДокССылка) Экспорт 
	Возврат ""
КонецФункции	

Функция ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(Организация) Экспорт 
	Возврат ""
КонецФункции	

Функция ЕстьВозможностьЗаполненияГТД(Видоперации, ЭДОбъект) Экспорт
	
	Если Видоперации = "ПокупкаКомиссия"
		ИЛИ Видоперации = "ПоступлениеОборудования"
		ИЛИ Видоперации = "ВозвратОтПокупателя"
		ИЛИ Видоперации = "ПоступлениеАвтомобилей" Тогда
		
		Если ОсновнойМодуль.ПолучитьФорму("Форма_Диадок_ЭД").ДляDocumentЕстьГТД(ЭДОбъект) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ЕстьВозможностьЗаполненияСерий(Видоперации, ЭДОбъект) Экспорт
	Возврат Ложь;
КонецФункции

//{ СвязиМеждуДокументами

Функция НайтиПодходящийСчетФактуруИзРНК(МассивСсылокРНК) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка 
	|ИЗ
	|	Документ.СчетФактураПолученный
	|ГДЕ
	|	ДокументОснование В (&МассивСсылокРНК)");
	
	МассивСодержитРТУ= Ложь;
	Для Каждого СсылкаРНК Из МассивСсылокРНК Цикл
		Если ТипЗнч(СсылкаРНК) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			МассивСодержитРТУ= Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСодержитРТУ Тогда
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "СчетФактураПолученный", "СчетФактураВыданный");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивСсылокРНК", МассивСсылокРНК);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка; 
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументОснование КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный
	|ГДЕ
	|	Ссылка = &СсылкаНаОбъект");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный
	|ГДЕ
	|	ДокументОснование = &СсылкаНаОбъект");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.РеализацияТоваров
	|ГДЕ
	|	НЕ ПометкаУдаления И ДокументОснование = &СсылкаНаОбъект");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект) Экспорт 
	
	Возврат СсылкаНаОбъект.ДокументОснование;
	
КонецФункции

Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации) Экспорт
	
	Если ЗначениеЗаполнено(ДокРеализации) 
		И ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Возврат ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументОснование);
	Иначе
		Возврат ДокРеализации;
	КонецЕсли;	
	
КонецФункции

Функция СФПоМассивуДокументовОснованийИдентичны(МассивСсылок) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СФПоМассивуДокументовОснованийИдентичны(МассивСсылок);
	
КонецФункции

//} СвязиМеждуДокументами

//{ Приглашение Контрагентов

Функция ЕстьНовыеКонтрагентыДляПриглашения(МассивОрганизаций1С, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусКонтрагентаНеПодходит
	|ГДЕ
	|	СтатусКонтрагентаНеПодходит.Объект В(&МассивОрганизаций1С)
	|	И СтатусКонтрагентаНеПодходит.Свойство = &ПриглашенияДатаСтатусНеПодходит
	|	И ТИПЗНАЧЕНИЯ(СтатусКонтрагентаНеПодходит.Значение) = ТИП(ДАТА)
	|	И СтатусКонтрагентаНеПодходит.Значение > &ПериодАнализаДокументов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваров КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL ");
	
	Если Метаданные.Документы.Найти("РеализацияАвтомобилей") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").РазделительОбъединенияЗапросов(Истина) +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Документ.РеализацияАвтомобилей КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
		|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
		|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
		|			И (ЯщикиКонтрагентов.Значение <> """")
		|ГДЕ
		|	Т.Дата >= &ПериодАнализаДокументов
		|	И Т.Организация В(&МассивОрганизаций1С)
		|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL"; 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОрганизаций1С"			   , МассивОрганизаций1С);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"		   , ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"  					   , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ПриглашенияДатаСтатусНеПодходит", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДиадокПриглашенияДатаСтатусНеПодходит"));

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ТаблицаКонтрагентовДляПриглашения(BoxID, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	ЯщикиОрганизаций.Значение КАК BoxID
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиОрганизаций
	|		ПО Организации.Ссылка = ЯщикиОрганизаций.Объект
	|			И (ЯщикиОрганизаций.Свойство = &ЯщикДиадокДляОрганизации)
	|			И (ЯщикиОрганизаций.Значение В (&BoxID))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.BoxID,
	|	ВложенныйЗапрос.Контрагент,
	|	СУММА(ВложенныйЗапрос.КоличествоДокументов) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ_СтатистикаДокументов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Организации.BoxID КАК BoxID,
	|		Т.Контрагент КАК Контрагент,
	|		1 КАК КоличествоДокументов
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)";
	
	Если Метаданные.Документы.Найти("РеализацияАвтомобилей") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").РазделительОбъединенияЗапросов() +
		"	ВЫБРАТЬ
		|		ВТ_Организации.BoxID,
		|		Т.Контрагент,
		|		1
		|	ИЗ
		|		ВТ_Организации КАК ВТ_Организации
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей КАК Т
		|			ПО ВТ_Организации.Организация = Т.Организация
		|				И (Т.Дата >= &ПериодАнализаДокументов)";
	КонецЕсли;

    Запрос.Текст= Запрос.Текст + ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").РазделительОбъединенияЗапросов() +
	"	ВЫБРАТЬ
	|		ВТ_Организации.BoxID,
	|		Т.Контрагент,
	|		1
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.BoxID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Организации.BoxID,
	|	ВТ_Организации.ИНН
	|ПОМЕСТИТЬ ВТ_BoxID
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент1С,
	|	Контрагенты.Код КАК Контрагент1С_Код,
	|	Контрагенты.ИНН КАК Контрагент1С_ИНН,
	|	Контрагенты.КПП КАК Контрагент1С_КПП,
	|	ЕСТЬNULL(ЯщикиКонтрагентов.Значение, """") КАК КонтрагентЭДО_ID,
	|	ЕСТЬNULL(ВТ_СтатистикаДокументов.КоличествоДокументов, 0) КАК КоличествоДокументов,
	|	ВТ_BoxID.BoxID КАК ОрганизацияЭДО_ID,
	|	ВЫБОР
	|		КОГДА ЯщикиКонтрагентов.Значение ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Сопоставлен
	|ИЗ
	|	ВТ_BoxID КАК ВТ_BoxID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_BoxID.ИНН <> Контрагенты.ИНН
	|			И (НЕ Контрагенты.ЭтоГруппа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатистикаДокументов КАК ВТ_СтатистикаДокументов
	|		ПО ВТ_BoxID.BoxID = ВТ_СтатистикаДокументов.BoxID
	|			И (Контрагенты.Ссылка = ВТ_СтатистикаДокументов.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО (Контрагенты.Ссылка = ЯщикиКонтрагентов.Объект)
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)";
	
	Запрос.УстановитьПараметр("BoxID"					, BoxID);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"	, ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"				, ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ЯщикДиадокДляОрганизации", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ЯщикДиадокДляОрганизации"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//{ Приглашение Контрагентов

//{ Внешние обработки

Функция ВнешняяОбработкаПоGUID(GUID) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВнешняяОбработкаПоGUID(GUID);
	
КонецФункции

//} Внешние обработки

//{ ИдентификацияДокументов

Функция ЭтоЗаказПокупателя(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоЗаказПокупателя(ДокументСсылка);
	
КонецФункции	

Функция ЭтоКорректировкаРеализации(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКорректировкаРеализации(ДокументСсылка);
	
КонецФункции

Функция ЭтоКСФ(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКСФ(ДокументСсылка);
	
КонецФункции

Функция ЭтоРТУ_ДД(ДокументСсылка) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоРТУ_ДД(ДокументСсылка);
	
КонецФункции 

Функция ЭтоСФ(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФ(ДокументСсылка);
	
КонецФункции	

Функция ЭтоСФПолученный(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФПолученный(ДокументСсылка);
	
КонецФункции	

Функция ЭтоСчетНаОплату(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСчетНаОплату(ДокументСсылка);
	
КонецФункции	

//} ИдентификацияДокументов

//{ ОтправкаДокументов

Функция ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент);
	
КонецФункции	

Процедура УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок);
	
КонецПроцедуры

//} ОтправкаДокументов

//{ ПолучениеДанныхДляФУФ

Функция ГрузополучательПоДокументу(ДокументСсылка) Экспорт 
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ГрузополучательПоДокументу(ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция КонтрагентПоДокументу(ДокументСсылка) Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").КонтрагентПоДокументу(ДокументСсылка);
				
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоговорПоДокументу(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДоговорПоДокументу(ДокументСсылка);
	
КонецФункции	

Функция ПолучитьСуммуДокумента(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуДокумента(ДокументСсылка);
	
КонецФункции	

Функция ПолучитьСуммуНДС(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуНДС(ДокументСсылка);
	
КонецФункции	

//} ПолучениеДанныхДляФУФ

//{ СвязиМеждуДокументами

Функция ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент);
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка);
	
КонецФункции

Функция ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента);
	
КонецФункции

//} СвязиМеждуДокументами

Функция ТекстЗапросаПодборНакладных(Direction) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборНакладных(Direction);
	
КонецФункции

Функция ТекстЗапросаПодборСчетовФактур(Direction) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборСчетовФактур(Direction);
	
КонецФункции

Процедура УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры	

//{Внешние печатные формы

Функция ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ);
	
КонецФункции

Функция ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции);
	
КонецФункции

Функция ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ);
	
КонецФункции

Функция ВПФ_ДополнительныеПараметры(ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_ДополнительныеПараметры(ИдентификаторВПФ);
	
КонецФункции

Функция ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ);
	
КонецФункции

//}Внешние печатные формы

//{Обертки

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты)
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

//}Обертки

// Устаревшие 

//Устарел в релизе 5.30.01. Необходимо использовать метод "ГрузополучательПоДокументу"
Функция ПолучитьГрузополучателяПоДокументу(ДокументСсылка) Экспорт 
	
	Результат = ГрузополучательПоДокументу(ДокументСсылка);
	
	Возврат Результат; 
	
КонецФункции

СоответствиеПрайсЛистовПоставщиков = Новый Соответствие;
