////////////////////////////////////////////////////////////////////////////////
// Методы для работы с хранилищем аутентификатора 
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Выбирает сессии из хранилища.
//
// Параметры:
//   Отбор - Структура - см. Авторизатор.ОтборСессий
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса - выборка с данными сессий.
Функция ВыбратьСессии(Отбор) Экспорт
	
	Сессия = ХранилищеОбщихНастроек.Загрузить(Отбор.КлючОбъекта, Отбор.КлючНастроек,, Отбор.Пользователь);	
	Таблица = ТаблицаЗначенийСессии();
	Если Сессия <> Неопределено Тогда
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Сессия);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВременнаяТаблица", Таблица);	
	Запрос.Текст = ТекстЗапросаВыбратьСессии();
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();	
	
КонецФункции

// Находит сессию по идентификатору.
//
// Параметры:
//	Отбор 		- Структура - см. Авторизатор.ОтборСессий
//  Значение 	- Строка - тип сессии
//
// Возвращаемое значение:
// 	Структура 	- см. Авторизатор.МодельОтветТокен, или Неопределено, если сессия не найдена
//
Функция НайтиСессиюПоТипу(Отбор, Значение) Экспорт
	
	Возврат НайтиСессиюПоРеквизиту(Отбор, "Тип", Значение);
	
КонецФункции

// Находит сессию по идентификатору поратльного пользователя
//
// Параметры:
//	Отбор - Структура - см. Авторизатор.ОтборСессий
//  Значение - Строка - идентификатор портального пользователя
//
// Возвращаемое значение:
//  Структура - см. Авторизатор.МодельОтветТокен, или Неопределено, если сессия не найдена
//
Функция НайтиСессиюПоИдПользователя(Отбор, Значение) Экспорт
	
	Возврат НайтиСессиюПоРеквизиту(Отбор, "Ид", Значение);
	
КонецФункции

// Находит сессию по почтовому адресу
//
// Параметры:
//	Отбор 		- Структура - см. Авторизатор.ОтборСессий
// 	Значение 	- Строка - почтовый адрес
//
// Возвращаемое значение:
//  Структура 	- см. Авторизатор.МодельОтветТокен, или Неопределено, если сессия не найдена
//
Функция НайтиСессиюПоПочте(Отбор, Значение) Экспорт
	
	Возврат НайтиСессиюПоРеквизиту(Отбор, "Почта", Значение);
	
КонецФункции

// Находит сессию по указанному реквизиту и его значению.
//
// Параметры:
//	Отбор				- Структура - см. Авторизатор.ОтборСессий
//  ИмяРеквизита 		- Строка - имя реквизита (например, "Тип", "Ид")
//  ЗначениеРеквизита 	- Произвольный - значение реквизита
//
// Возвращаемое значение:
// 	Структура - см. Авторизатор.МодельОтветТокен
//
Функция НайтиСессиюПоРеквизиту(Отбор, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Результат = Неопределено;
	СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(Отбор.КлючОбъекта);
	
	Для Каждого Настройка Из СписокНастроек Цикл
		Сессия = ХранилищеОбщихНастроек.Загрузить(Отбор.КлючОбъекта, Настройка.Значение,, Отбор.Пользователь);
		Если Сессия[ИмяРеквизита] <> ЗначениеРеквизита Тогда
			Продолжить;	
		КонецЕсли;
		Результат = Сессия;
		Прервать;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Сохраняет сессию в хранилище общих настроек
//
// Параметры:
//	Отбор 	- Структура - см. Авторизатор.ОтборСессий
//	Сессия	- Структура - см. Авторизатор.МодельОтветТокен
//			Если указан пользователь, не являющийся текущим пользователем, 
//			т.е. делается попытка обратиться к настройкам, не принадлежащим текущему пользователю, 
//			то требуется наличие у текущего пользователя права АдминистрированиеДанных.
//
Процедура СохранитьСессию(Отбор, Сессия) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(Отбор.КлючОбъекта, Отбор.КлючНастроек, Сессия,, Отбор.Пользователь);
	
КонецПроцедуры

// Удаляет сессию в хранилище общих настроек
//
// Параметры:
//	Отбор 	- Структура - см. Авторизатор.ОтборСессий
//
Процедура УдалитьСессию(Отбор) Экспорт
	
	ХранилищеОбщихНастроек.Удалить(Отбор.КлючОбъекта, Отбор.КлючНастроек, Отбор.Пользователь);
	
КонецПроцедуры

// Удаляет сессию по значению токена доступа
//
// Параметры:
//	Отбор 		- Структура - см. Авторизатор.ОтборСессий
//  Значение	- Строка - значение токена доступа
//
Процедура УдалитьСессиюПоТокенуДоступа(Отбор, Значение) Экспорт                

	УдалитьСессиюПоРеквизиту(Отбор, "ТокенДоступа", Значение);
	
КонецПроцедуры

// Удаляет сессию по указанному реквизиту и его значению.
//
// Параметры:
//	Отбор 				- Структура - см. Авторизатор.ОтборСессий
//  ИмяРеквизита 		- Строка - имя реквизита (например, "ТокенДоступа").
//  ЗначениеРеквизита 	- Произвольный - значение реквизита.
//
Процедура УдалитьСессиюПоРеквизиту(Отбор, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Если Отбор.Свойство("Пользователь") = Ложь 
			Или (Отбор.Свойство("Пользователь") И Отбор.Пользователь = Неопределено) Тогда
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Иначе
		Пользователь = Отбор.Пользователь;
	КонецЕсли;
	
	КлючНастроек = Неопределено;
	СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(Отбор.КлючОбъекта);
	
	Для Каждого Настройка Из СписокНастроек Цикл
		Сессия = ХранилищеОбщихНастроек.Загрузить(Отбор.КлючОбъекта, Настройка.Значение,, Отбор.Пользователь);
		Если Сессия[ИмяРеквизита] <> ЗначениеРеквизита Тогда
			Продолжить;	
		КонецЕсли;
		КлючНастроек = Настройка.Значение;
		Прервать;
	КонецЦикла;
	
	Если КлючНастроек <> Неопределено Тогда
		ХранилищеОбщихНастроек.Сохранить(Отбор.КлючОбъекта, КлючНастроек, Неопределено,, Пользователь);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ТаблицаЗначенийСессии()

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ТокенДоступа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТокенОбновления", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВремяЖизни", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("УниверсальнаяДатаОкончания", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("УниверсальнаяДатаОкончанияМС", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПортальныйИд", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Телефон", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Почта", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;

КонецФункции

Функция ТекстЗапросаВыбратьСессии()

	Возврат "ВЫБРАТЬ
	|	ВременнаяТаблица.ТокенДоступа КАК ТокенДоступа,
	|	ВременнаяТаблица.ТокенОбновления КАК ТокенОбновления,
	|	ВременнаяТаблица.ВремяЖизни КАК ВремяЖизни,
	|	ВременнаяТаблица.УниверсальнаяДатаОкончания КАК УниверсальнаяДатаОкончания,
	|	ВременнаяТаблица.УниверсальнаяДатаОкончанияМС КАК УниверсальнаяДатаОкончанияМС,
	|	ВременнаяТаблица.Тип КАК Тип,
	|	ВременнаяТаблица.ПортальныйИд КАК ПортальныйИд,
	|	ВременнаяТаблица.Имя КАК Имя,
	|	ВременнаяТаблица.Фамилия КАК Фамилия,
	|	ВременнаяТаблица.Отчество КАК Отчество,
	|	ВременнаяТаблица.ФИО КАК ФИО,
	|	ВременнаяТаблица.Телефон КАК Телефон,
	|	ВременнаяТаблица.Почта КАК Почта
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВременнаяТаблица КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ТокенДоступа КАК ТокенДоступа,
	|	ВТ.ТокенОбновления КАК ТокенОбновления,
	|	ВТ.ВремяЖизни КАК ВремяЖизни,
	|	ВТ.УниверсальнаяДатаОкончания КАК УниверсальнаяДатаОкончания,
	|	ВТ.УниверсальнаяДатаОкончанияМС КАК УниверсальнаяДатаОкончанияМС,
	|	ВТ.Тип КАК Тип,
	|	ВТ.ПортальныйИд КАК ПортальныйИд,
	|	ВТ.Имя КАК Имя,
	|	ВТ.Фамилия КАК Фамилия,
	|	ВТ.Отчество КАК Отчество,
	|	ВТ.ФИО КАК ФИО,
	|	ВТ.Телефон КАК Телефон,
	|	ВТ.Почта КАК Почта
	|ИЗ
	|	ВТ КАК ВТ";
	
КонецФункции