// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем СчетаНаОплатуСервиса Экспорт;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
//{ Сервисные методы

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

// Возвращает модуль синхронных/модальных вызовов
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция смв() Экспорт
	
	Результат = ОсновнаяФорма().смв();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МетодСервераБезКонтекста(ВозвращатьРезультат, 
								ИмяМетода, 
								Параметр0 = Неопределено, 
								Параметр1 = Неопределено,
								Параметр2 = Неопределено, 
								Параметр3 = Неопределено, 
								Параметр4 = Неопределено) Экспорт
	
	Возврат ОсновнаяФорма().МетодСервераБезКонтекста(ВозвращатьРезультат,
														ИмяМетода,
														Параметр0,
														Параметр1,
														Параметр2,
														Параметр3,
														Параметр4);
	
КонецФункции

//} Сервисные методы


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Картинки = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().БиблиотекаКартинок");

	ЗаполнитьОнлайнСчетаПоОрганизациям();
	
	HTMLСписокОнлайнСчетов(); 
	
	Метрика_ДобавитьСтатистику_ОнлайнСчетаПослеОткрытия();

КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	АдресСсылки 			= Неопределено;
	
	Если НЕ ДанныеСобытия.Свойство("href", АдресСсылки) Тогда  
		Возврат;
	КонецЕсли;
	
	Если Найти(АдресСсылки, "ОбработчикОткрытьЦентрПоддержки") > 0 Тогда
		
		ОбработатьНажатие_ОткрытьЦентрПоддержки();
		
	ИначеЕсли Найти(АдресСсылки, "СохранитьФайлОнлайнСчетаНаДиск") > 0 Тогда
		
		ОбработатьНажатие_СкачатьСчет(АдресСсылки); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеСуммыОнлайнСчета(Сумма)
	Валюта = " руб.";
	Результат = Формат(Сумма, "ЧДЦ=2") + Валюта; 
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПредставлениеСчета(Номер)
	Префикс = "Счет № ";
	Результат = Префикс + Номер; 
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПредставлениеОплаченногоПериода(ДатаОкончания)
	Результат = "";	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Префикс = "Оплаченный период заканчивается ";
		Результат = Префикс + Формат(ДатаОкончания, "ДФ='д ММММ'"); 
	КонецЕсли;
	Возврат Результат;
КонецФункции  

&НаКлиенте
Функция ПредставлениеОповещенияОСкачивании(АдресФайла, НомерСчета, BoxID)
	Префикс = ПрефиксОповещенияСохранитьФайОнлайнСчетаНаДиск();
	Результат = Префикс + АдресФайла + "&" + НомерСчета + "&" + BoxID; 
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПрефиксОповещенияСохранитьФайОнлайнСчетаНаДиск() 
	Возврат "Оповещение:СохранитьФайлОнлайнСчетаНаДиск?";
КонецФункции

&НаКлиенте
Функция ПредставлениеОповещенияОткрытьЦентрПоддержки()
	Результат = "Оповещение:ОбработчикОткрытьЦентрПоддержки"; 
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура HTMLСписокОнлайнСчетов()
	
	HTMLДокумент = ИнициализироватьHTMLДокумент();
	
	Для каждого Организация Из СчетаНаОплатуСервиса Цикл
		
		ДополнитьHTMLДокументСчетамиОрганизации(HTMLДокумент, Организация);
		
	КонецЦикла;
	
	HTMLДокумент = HTMLДокумент + ПодвалДокумента(); 
	
КонецПроцедуры

&НаКлиенте
Функция ИнициализироватьHTMLДокумент()
	Результат = 
	
	"<html><head> " 
	+ ТаблицаСтилей() + "
	|</head>
	|<body>
	|	<p class=head>Мы подготовили документы. Скачайте и оплатите счет</p>"
	+ ШапкаТаблицы();
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДополнитьHTMLДокументСчетамиОрганизации(HTMLДокумент, Организация) 
	
	Для Каждого ИнформацияПоСчету Из Организация.МассивСчетов Цикл
		
		HTMLДокумент = HTMLДокумент + СтрокаСчетаHTML(	Организация, 
														ИнформацияПоСчету.Номер, 
														ИнформацияПоСчету.Сумма, 
														ИнформацияПоСчету.СсылкаНаФайл);
		
		ДобавитьТарифныеПланыHTML(	HTMLДокумент, 
									ИнформацияПоСчету.ТарифныеПланы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ШапкаТаблицы()
	
	Результат = "
	|	<table>
	|	<tr class=head>
	|		<td class=head width=270>Организация</TD>
	|		<td class=head width=370 style=""padding-left: 20px"">Счет и тарифный план</TD>
	|		<td class=head width=120 style=""text-align: center"">Сумма</TD>
	|		<td class=head></TD>
	|	</tr>"; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодвалДокумента()
	
	Результат = "
	|</table>
	|<div class=footer>
	|	<nobr><a class=support href=" + ПредставлениеОповещенияОткрытьЦентрПоддержки() + "><img class=support src=""data:image/png;base64," + КартинкаОнлайнКонсультантBase64() + """>Нужна помощь</a><nobr>
	|</div>
	|</body></html>";
	
	Возврат Результат;  
	
КонецФункции

&НаКлиенте
Процедура ДобавитьТарифныеПланыHTML(HTMLДокумент, 
									ТарифныеПланы)
	Для Каждого ТарифныйПлан Из ТарифныеПланы Цикл 
		HTMLДокумент = HTMLДокумент + СтрокаТарифногоПланаHTML(ТарифныйПлан.Name);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция СтрокаСчетаHTML(Организация, 
						НомерСчета, 
						Сумма, 
						СсылкаНаФайл)
	Результат = " 
	|<tr class=invoice>
	|	<td class=invoice>"				+ СокрЛП(Организация.Наименование) +	"</TD>
	|	<td class=invoicenumber >"		+ ПредставлениеСчета(НомерСчета) + 	"</TD>
	|	<td class=invoiceprice >"		+ ПредставлениеСуммыОнлайнСчета(Сумма) +		"</TD>
	|	<td class=invoice><a href="""	+ ПредставлениеОповещенияОСкачивании(СсылкаНаФайл, НомерСчета, Организация.BoxID) + """><img class=invoice alt=""Скачать"" src=""data:image/png;base64," + КартинкаСкачатьBase64() + """>Скачать</a></TD>
	|</tr>";
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Функция СтрокаТарифногоПланаHTML(ТарифныйПлан)
	Результат = "
	|<tr class=plan> 
	|	<td class=invoice></TD>
	|	<TD class=invoicenumber> ● " + ТарифныйПлан + " </TD>
	|</tr>";
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция КартинкаСкачатьBase64()
	ДвоичныеДанныеКартинки = Картинки.КартинкаСкачать.ПолучитьДвоичныеДанные();
	Base64СтрокаКартинки = Base64Строка(ДвоичныеДанныеКартинки);
	Возврат Base64СтрокаКартинки;
КонецФункции

&НаКлиенте
Функция КартинкаОнлайнКонсультантBase64()
	ДвоичныеДанныеКартинки = Картинки.КартинкаОнлайнКонсультант.ПолучитьДвоичныеДанные();
	Base64СтрокаКартинки = Base64Строка(ДвоичныеДанныеКартинки);
	Возврат Base64СтрокаКартинки;
КонецФункции

&НаКлиенте
Функция ТаблицаСтилей() 
	
	Стили = "
	|	<style type=text/css>
	|		body {font-family: Segoe UI}
	|		table {width: 100%; overflow: visible; border-collapse: collapse}
	|		p.head {font-SIZE: 14pt; color: #808080}
	|		tr.head {font-SIZE: 11pt; color: #808080}
	|		td.head {padding-bottom: 5px; border-bottom: #959595 1px solid}
	|		tr.invoice {font-SIZE: 11pt; vertical-align: top; color: #000000}
	|		td.invoice {padding-top: 10px}
	|		td.invoicenumber {padding-top: 10px; padding-left: 20px}
	|		td.invoiceprice {padding-top: 10px; text-align: center}
	|		img.invoice {border: 0; vertical-align: bottom}
	|		tr.plan {font-SIZE: 11pt; vertical-align: top; color: #808080}
	|		div.footer {position: absolute; bottom: 0; width: 100%; margin-bottom: 10px; font-SIZE: 11pt; text-align: left}
	|		img.support {border: 0; margin-right: 3px; vertical-align: bottom}
	|		a.support {margin-right: 10px}
	|	</style>";
	
	Возврат Стили;
	
КонецФункции

&НаКлиенте
Функция РазложитьПараметрыСсылкиНаСкачивание(АдресСсылки)
	
	Результат = ПараметрыСсылки_НовыйКонтракт();  
	
	АдресСсылки = СтрЗаменить(АдресСсылки, ПрефиксОповещенияСохранитьФайОнлайнСчетаНаДиск(), "");
	
	МассивПараметров = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().РазделитьСтрокуЛок", АдресСсылки, "&");
	
	АктуальноеКоличествоПараметров = 3;
	
	Если НЕ МассивПараметров = Неопределено
		И МассивПараметров.Количество() = АктуальноеКоличествоПараметров Тогда 
		
		Результат.СсылкаНаФайл 	= МассивПараметров[0];
		Результат.НомерСчета 	= МассивПараметров[1];
		Результат.BoxID 		= МассивПараметров[2];
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции  

&НаКлиенте
Функция ПараметрыСсылки_НовыйКонтракт() 
	
	Результат = Новый Структура;
	
	Результат.Вставить("СсылкаНаФайл", "");
	Результат.Вставить("НомерСчета", "");
	Результат.Вставить("BoxId", "");
	
	Возврат Результат;  
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайлОнлайнСчетаНаДиск(ПараметрыСервиса, BoxID, СсылкаНаФайл, НомерСчета) Экспорт 
	
	Организация = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().МассивСтруктур_Найти", СчетаНаОплатуСервиса, BoxID, "BoxID");
	
	ОписаниеПеременных = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().МассивСтруктур_Найти", Организация.МассивСчетов, СсылкаНаФайл, "СсылкаНаФайл");
	
	Попытка	 
		
		ФайлСчета = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().КонтурАПИ_GetPortalBillsContent", ПараметрыСервиса, СсылкаНаФайл);
		
		ИмяФайла 			= "Счет № " + НомерСчета + ".pdf";
		
		Модуль_смв = смв();
		ИмяВременногоФайла = Модуль_смв.СохранитьДвоичныеДанныеВоВременныйФайл(ФайлСчета, ИмяФайла);
		
		ОсновнаяФорма().Обработчик_КопироватьФайл(ИмяВременногоФайла, ИмяФайла);
		
		ВременныеФайлыКУдалению.Добавить(ИмяВременногоФайла);
		
		Если ЗначениеЗаполнено(ОписаниеПеременных) Тогда
			Метрики_ДобавитьСтатистику_СкачатьОнлайнСчет(BoxID, ОписаниеПеременных.ИДЛицевогоСчета, ОписаниеПеременных.ИДТарифа); 
		КонецЕсли;
		
	Исключение
		
		ОписаниеОшибки 	= НСтр("ru = 'Документ не был сохранен. Проверьте каталог, куда сохраняете документ и соединение с интернетом'");
		Подробности 	= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Ошибка_Обработать(ОписаниеОшибки, Подробности);
		
	КонецПопытки;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьОнлайнСчетаПоОрганизациям() Экспорт
	
	СчетаНаОплатуСервиса = Новый Массив;
	
	КонтекстДиадока = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().ХранилищеКонтекстаСеанса");
	
	Для каждого ЭлементКонтекстаДиадок Из КонтекстДиадока Цикл
		
		ЭлементКонтекста 					= ЭлементКонтекстаДиадок.Значение;
		BoxID 								= ЭлементКонтекста.BoxId; 
		
		АвторизационныйТокен				= ЭлементКонтекста.Токен;
		ПараметрыСервиса_Диадок 			= МетодСервераБезКонтекста(Истина, "Модуль_Ядро().ПараметрыСервиса_Диадок", BoxID);
		AccountID 							= МетодСервераБезКонтекста(Истина, "Модуль_Ядро().АПИ_ИдентификаторЛицевогоСчетаДиадок", ПараметрыСервиса_Диадок, BoxID);
		
		Если Не ЗначениеЗаполнено(AccountID) Тогда
			Продолжить;
		КонецЕсли;

		СтруктураОрганизации 				= Новый Структура("Наименование, BoxId, МассивСчетов");
		СтруктураОрганизации.Наименование 	= ЭлементКонтекста.ОрганизацияНаименование;
		СтруктураОрганизации.BoxId 			= ЭлементКонтекста.BoxId; 
		СтруктураОрганизации.МассивСчетов	= СчетаНаОплатуСервиса(BoxID, AccountID);
		
		Если ЗначениеЗаполнено(СтруктураОрганизации.МассивСчетов) Тогда
			СчетаНаОплатуСервиса.Добавить(СтруктураОрганизации);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Функция СчетаНаОплатуСервиса(BoxID, AccountId)
	
	Результат = Новый Массив;
	
	ПараметрыСервиса_Контур = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().ПараметрыСервиса_Контур", BoxID);
	ОтветСервиса 			= МетодСервераБезКонтекста(Истина, "Модуль_Ядро().КонтурАПИ_GetPortalBills", ПараметрыСервиса_Контур, AccountId);
	
	РазобранныйОтвет = ЗначениеИзСтрокиJSON(ОтветСервиса);
	
	Если РазобранныйОтвет = Неопределено Тогда 
		РазобранныйОтвет = Результат;
	КонецЕсли;
	
	Для каждого Предложение Из РазобранныйОтвет Цикл
		
		МассивСчетов = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().СвойствоСтруктуры", Предложение, "bills");
		
		Для Каждого Счет Из МассивСчетов Цикл
			СтруктураСчета = Счета_НовыйКонтракт();
			
			СтруктураСчета.Номер				= Счет.billNumber;
			СтруктураСчета.Сумма				= Счет.amount;
			СтруктураСчета.ТарифныеПланы		= Счет.tariffsDetails;	
			СтруктураСчета.СсылкаНаФайл			= Предложение.offerId + "/bills/" + Счет.billId + "/pdf";
			СтруктураСчета.ИДЛицевогоСчета		= AccountId;
			СтруктураСчета.ИДТарифа				= Счет.billId;
			
			Результат.Добавить(СтруктураСчета); 
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ЗначениеИзСтрокиJSON(СтрокаJSON)
	
	Результат = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().ПарсерJSON_Прочитать", СтрокаJSON);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Счета_НовыйКонтракт()
	
	Результат = Новый Структура;
	
	Результат.Вставить("BoxId", "");
	Результат.Вставить("Номер", "");
	Результат.Вставить("Сумма", "");
	Результат.Вставить("КодОшибки", "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Организация", "");
	Результат.Вставить("ТарифныеПланы", "");
	Результат.Вставить("СсылкаНаФайл", "");
	Результат.Вставить("ДатаОкончанияПодписки", "");
	Результат.Вставить("ИДЛицевогоСчета", "");
	Результат.Вставить("ИДТарифа", "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Для Каждого ФайлКУдалению Из ВременныеФайлыКУдалению Цикл
		УдалитьФайлы(ФайлКУдалению.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатие_ОткрытьЦентрПоддержки() Экспорт
	
	НазваниеФормы	= Метрика_НазваниеФормы();
	Категория		= Метрика_НазваниеКатегории();
	
	ОсновнаяФорма().ЦентрПоддержки_Открыть(Категория, НазваниеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатие_СкачатьСчет(АдресСсылки)
	
	Метрики_ДобавитьПоведение_НажатиеСкачатьОнлайнСчет();
	
	ПараметрыСкачивания = РазложитьПараметрыСсылкиНаСкачивание(АдресСсылки);
	
	ПараметрыСервиса_Контур = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().ПараметрыСервиса_Контур", ПараметрыСкачивания.BoxID);
	
	СохранитьФайлОнлайнСчетаНаДиск(
	ПараметрыСервиса_Контур,
	ПараметрыСкачивания.BoxID,
	ПараметрыСкачивания.СсылкаНаФайл, 
	ПараметрыСкачивания.НомерСчета);
	
КонецПроцедуры 

&НаКлиенте
Процедура Ошибка_Обработать(ОписаниеОшибки, Подробности)
	
	Ошибка_СообщитьПользователю(ОписаниеОшибки);
	
	МетодСервераБезКонтекста(Ложь, "Модуль_Ядро().Ошибка_Обработать", ОписаниеОшибки, Подробности);
	
КонецПроцедуры

&НаКлиенте
Процедура Ошибка_СообщитьПользователю(ТекстСообщения, ИдентификаторФормы = Неопределено, ПолеФормы = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	
	Сообщение.Текст = ТекстСообщения + Символы.ПС + НСтр("ru ='Подробности см. в журнале регистрации.'");
	
	Если ЗначениеЗаполнено(ИдентификаторФормы) Тогда
		Сообщение.ИдентификаторНазначения = ИдентификаторФормы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеФормы) Тогда
		Сообщение.Поле = ПолеФормы;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Метрики    

&НаКлиенте
Процедура Метрики_ДобавитьПоведение_НажатиеСкачатьОнлайнСчет()
	
	НазваниеФормы		= Метрика_НазваниеФормы();
	КатегорияМетрики	= Метрика_НазваниеКатегории();
	ДействиеМетрики		= Метрика_СкачатьСчет();
	
	МетодСервераБезКонтекста(Ложь, "Модуль_Ядро().Метрика_ДобавитьПоведение_НажатиеКнопки", НазваниеФормы, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ДобавитьСтатистику_СкачатьОнлайнСчет(BoxId, ИДЛицевогоСчета, ИДТарифа)
	
	Категория				= Метрика_НазваниеКатегории();
	ДействиеМетрики			= Метрика_СкачатьСчет();

		
	Переменные = Новый Соответствие;
	Переменные.Вставить("BoxID"					, BoxId);
	Переменные.Вставить("AccountId"				, ИДЛицевогоСчета);
	Переменные.Вставить("BillId"				, ИДТарифа);
	
	МетодСервераБезКонтекста(Ложь, "Модуль_Ядро().Метрика_ДобавитьСтатистику_ДляОрганизации", boxId, Категория, ДействиеМетрики, , Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ОнлайнСчетаПослеОткрытия()

	Категория	 		= Метрика_НазваниеКатегории();
	Действие	 		= "Оплатить счет";
	ИдентификаторБазы1С = МетодСервераБезКонтекста(Ложь, "Модуль_Ядро().ОбщиеНастройки_Прочитать", "ИдентификаторБазы1С");
		
	Для Каждого Организация Из СчетаНаОплатуСервиса Цикл
		
		BoxID = МетодСервераБезКонтекста(Ложь, "Модуль_Ядро().АдресЯщикаВИдентификатор", Организация.BoxId);
		
		Для Каждого ОписаниеСчета Из Организация.МассивСчетов Цикл
			
			AccountId			= ОписаниеСчета.ИДЛицевогоСчета;
			BillId				= ОписаниеСчета.ИДТарифа;
			SubscriptionEndDate	= ОписаниеСчета.ДатаОкончанияПодписки;
			
			Переменные = Новый Соответствие;
			Переменные.Вставить("BoxID",				BoxId);
			Переменные.Вставить("AccountId",			AccountId);
			Переменные.Вставить("BillId",				BillId);
			Переменные.Вставить("SubscriptionEndDate",	SubscriptionEndDate);
			Переменные.Вставить("BaseID", 				ИдентификаторБазы1С);
			
			МетодСервераБезКонтекста(Ложь, "Модуль_Ядро().Метрика_ДобавитьСтатистику_ДляОрганизации", boxId, Категория, Действие, , Переменные);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеКатегории()
	
	Возврат "Онлайн счета";
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеФормы()
	
	Возврат "Продление обслуживания";
	
КонецФункции

&НаКлиенте
Функция Метрика_СкачатьСчет()
	
	Возврат "Скачать";
	
КонецФункции

&НаКлиенте
Функция Метрика_ОткрытьЦентрПоддержки() 
	
	Возврат "Задать вопрос онлайн-консультанту";
	
КонецФункции

