
#Область ПЕРЕМЕННЫЕ_ПЛАТФОРМЫ
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Манифест 				Экспорт;
Перем ОбработкаОбъект 		Экспорт;
Перем ПараметрыКлиентСервер Экспорт;

Перем НомерИтерацииВызоваМодуля;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
#КонецОбласти

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ПЛАТФОРМЫ

Функция МетодСервера(ИмяМодуля = "", ИмяМетода, 
		Параметр0 = NULL, Параметр1 = NULL, Параметр2 = NULL, Параметр3 = NULL, Параметр4 = NULL, 
		Параметр5 = NULL, Параметр6 = NULL, Параметр7 = NULL, Параметр8 = NULL, Параметр9 = NULL)
	
	Возврат ОбработкаОбъект.МетодСервера(ИмяМодуля, ИмяМетода, 
	Параметр0, Параметр1, Параметр2, Параметр3, Параметр4, 
	Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля= 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ОбработкаОбъект.ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект= 	   Неопределено;
		ПараметрыКлиентСервер= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриглашениеОтладки() Экспорт
	
	//// Удалите комментарий напротив оператора "ВызватьИсключение", чтобы получить приглашение для начала отладки модуля.
	//ВызватьИсключение "Нажмите кнопку ""Подробно"", а затем ""Конфигуратор"", чтобы начать отладку модуля!"; 
	
КонецПроцедуры

#КонецОбласти

#Область МАНИФЕСТ

// Все функции и процедуры тела модуля должны быть экспортными и добавлены в соответствующую структуру!

Функция ФункцииМодуля() Экспорт
	
	Результат = Новый Структура;
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоНакладная");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НовыйРезультатВизуализацииСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НовыйРезультатВизуализацииАктаСверки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплатуСредствамиКонфигурации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииАктаСверки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуВнешнейПечатнойФормы");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуАктаСверки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуАктаВыполненныхРабот");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Torg12SellerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Torg12BuyerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_AcceptanceCertificateSellerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_AcceptanceCertificateBuyerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceCorrectionContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_UtdSellerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_UtdBuyerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_UcdSellerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_UcdBuyerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TovTorgSellerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TovTorgBuyerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Act552SellerContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Act552BuyerContent");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_OrganizationInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ExtendedOrganizationInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ExtendedOrganizationInfo820");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Shipper");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Shipper820");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ShipperOrConsigneeInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_AddressInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_AdditionalInfoId");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_StructedAdditionalInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceForCorrectionInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceRevisionInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_OriginalInvoice");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_PaymentDocument");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Torg12Item");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_AcceptanceCertificateItem");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceItem");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceCorrectionItem");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceTable");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ExtendedInvoiceItem");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceCorrectionTable");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ExtendedInvoiceCorrectionItem");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TovTorgTable");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TovTorgItem");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Act552WorkDescription");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Act552WorkItem");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_CustomDeclaration");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_CustomDeclaration820");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceItemFields");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TransferInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TovTorgTransferInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Act552TransferInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TransferBase");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_TransferBase820");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ItemTracingInfo");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ItemIdentificationNumber");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Waybill");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_EventContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_CorrectionBase");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_BaseDocumentName");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_GroundInfo");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Signer");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ExtendedSigner");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ExtendedSignerDetails");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Signature");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_PersonalCertificate");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ExtendedSignerDetailsToPost");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Official");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Employee");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_OtherIssuer");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Attorney");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Torg12Commons");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Torg12Totals");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_InvoiceTotals");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_AmountsDiff");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_NonformalizedDocumentToSend");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ServiceDetails");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_NonformalizedProforma");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_PriceList");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_AcceptanceCertificate");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_Contract");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьГрузополучателя");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьПодразделениеПолучателя");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьТаблицыДляВыгрузкиВДиадок");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСтрокуКлючЗначение");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НайтиСтрануПоКодуВКлассификаторе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НайтиСтрануПоКоду");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НайтиСтрануПроисхожденияПоДаннымДопИнфо");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВернутьТаблицуОКСМ", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВернутьСсылкуНаГТД");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТипЦенПоДоговору");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьМассивСсылокРТУПоСчетуНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПустыеЗначенияРеквизита", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоСчетНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоЗаказПокупателя");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКорректировкаРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДокОснованиеКорректировкиРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСчетНаОплатуНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьЗаказПокупателяНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСФОснованиеПоИСФ_КСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СоответствиеРеквизитовПолямВходящегоДокумента", "СсылкаНаОбъект");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииАктаСверки", "ДокССылка, ПараметрыОтправкиНаСогласование, ФИОПодписанта");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ИмяФайлаПечатнойФормы", "ИмяДокумента, НомерДокумента, ДатаДокумента", "НаВремяСеанса");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат,	"ВладелецОбщихНастроекМодуля", , "НаВремяСеанса");
	
	// Сопоставление номенклатуры
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СвойстваНоменклатурыИнформационнойБазы");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НовыеСвойстваНоменклатурыИБ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НоваяНоменклатураКонтрагента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НоваяНоменклатураИнформационнойБазы");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НоменклатураИнформационнойБазыПоИдентификатору");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПрочитатьСопоставлениеНоменклатуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НоменклатураЭлектронногоДокумента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МетаданныеСопоставленияНоменклатуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВариантыСопоставленияНоменклатуры");
	
	#Область СтроковыеФункции
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЗаменитьНедопустимыеСимволы", "НомерДокумента");
	#КонецОбласти

	#Область ОбщегоНазначения
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЕстьРеквизитМетаданных");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЕстьОбщийРеквизит");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СвойствоСтруктуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СкопироватьСтруктуру");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СсылкаОбъектаПоПолямПоиска");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДокументОснованиеОтгрузкиОтсутствует", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЗначенияРеквизитовОбъектаЛокальная");
	#КонецОбласти
	
	#Область РаботаСДаннымиИБ
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДанныеШапки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДанныеТабличныхЧастей");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НомерНаПечать");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ИмяКолонкиКодТовара");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВалютаРегламентированногоУчета", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РеквизитыЮрФизЛица");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПредставлениеЮрФизЛица");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПредставлениеНоменклатуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НайтиСсылкиПоЗначениямРеквизитов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДополнительныеПараметрыПредставленияНоменклатуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПрикладноеЗначениеСтавкиНДС", , "НаВремяСеанса");
	#КонецОбласти
	
	#Область ЗагрузкаДанных
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПравилаОбработкиВидаДокументов", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПравилаОбработкиПервичныхДокументов", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПравилаОбработкиСчетовФактур", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НовыйДокументИнформационнойБазы");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЕстьНезаполненныйРеквизитОбъекта");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДанныеЭлектронногоДокумента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СопоставленныеУчетныеДокументы");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НоменклатураНаКонтроле");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СчетаФактурыПоОснованию");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДокументыОснованияСчетаФактуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СсылкаНаУчастникаЭДО");
	#КонецОбласти
	
	#Область ВыгрузкаДанных
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "КонтентФормализованногоДокумента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДополнительныеПараметрыПолученияКонтента");
	#КонецОбласти
	
	#Область РаботаСКонтактнойИнформацией
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СведенияОбАдресе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "АдресЮрФизЛица");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ХранилищеКонтактнойИнформацииОбъекта");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПредставлениеКонтактнойИнформацииОбъекта");
	#КонецОбласти
	
	#Область Служебные
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВидыИсходящихДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВидыВходящихДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПравилаЗагрузкиПоВидуЭД");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВидыЭлектронныхДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ФункцииЭлектронныхДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ТипыЮрФизЛиц");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НовоеПравилоКонвертацииСвойствЭД");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ОписаниеФорматаЭлектронногоДокумента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолноеОписаниеФорматаЭлектронногоДокумента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ОснованиеПередачи_БезДокументаОснования");
	#КонецОбласти
	
	#Область ДляОбеспеченияОбратнойСовместимости
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьXmlAcceptanceCertificateContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьInvoiceCorrectionContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьInvoiceContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьXmlTorg12Content");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьXmlUTDContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьXmlUCDContent");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьXmlProformaInvoiceSellerContent");
	#КонецОбласти

	#Область ЗаполнениеКонтента
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НоваяСлужебнаяИнформацияОснованияПередачи");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ИмяСвойстваСлужебнаяИнформация");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СведенияОСтранеПроисхожденияСтрокой");
	#КонецОбласти
	
	// Автотесты
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Тест_ТаблицаИсходящихДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Тест_ПравилаОбработкиДокументов");
	
	// Маркировка
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НоваяТаблицаШтрихкодыУпаковок");
	
	// Устарели
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьПечатнуюФормуСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьПечатнуюФормуАктаСверки");
	
	// Параметры конфигурации
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ОписанияПодсистемКонфигурации");
	
	// Ставки НДС
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПредставлениеПрикладнойСтавкиНДС");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПрикладнаяСтавкаНДС");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоСтавкаБезНДС");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоСтавкаНДСИНА");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СтавкаБезНДС");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ОбщаяСтавкаНДС");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ОбщаяРасчетнаяСтавкаНДС");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ОписаниеПрикладногоДокумента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ДатаНомерДокумента");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НовыеСвойстваЭлементаПрослеживаемости");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке");
	
	// Машиночитаемые доверенности
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ИмяСправочникаВИнформационнойБазе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ДанныеДоверенностиИнформационнойБазы");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ЕстьСправочникМашиночитаемыхДоверенностей");

	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "Новый_ДатаНомерДокументаОснования");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область СборПротоконтента

// Инициализирует структуру дополнительных параметров для методов сбора контента.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * ИспользоватьСервисКонтурМаркировка - Булево - Истина, если для получения сведений о маркировке следует
//                                                    использовать данные подсистемы Контур.Маркировка.
//    * УказыватьОтсутствиеОснованияУПД - Булево - Истина, если при незаполненном основании передачи
//                                                 товаров (услуг, работ) в поле GroundName следует
//                                                 в указывать строку, определенную форматом для пустого
//                                                 основания передачи (например, "Отсутствует" для 155@
//                                                 или "Без документа-основания" для 820@).
//    * ФункцияДокумента - Строка - функция документа для формирования XML. Используется для UtdSellerContent и UcdSellerContent.
//    * ДополнительныеСведенияСтрокой - Строка - (Устарел) Список доп. полей в формате "ИмяПоля = Значение".
//                                               Доп. поля указываются через точку с запятой.
//    * ФИОПодписанта - Строка - (Устарел) Фамилия, имя и отчество  подписанта.
//    * ПараметрыСогласования - Структура - Заполняется при передаче документа на согласование/подпись:
//       ** ФИОПодписанта - Строка - Фамилия, имя и отчетство подписанта;
//       ** ДолжностьПодписанта - Строка - должность подписанта;
//       ** ФИОПолучателя - Строка - Фамилия, имя и отчество получателя;
//       ** ДолжностьПолучателя - Строка - должность получателя;
//    * Отправитель_FnsParticipantId - Строка - идентификатор участника ЭДО отправителя документа;
//    * Получатель_FnsParticipantId - Строка - идентификатор участника ЭДО получателя документа;
//    * НомерЗаказа - Строка - номер заказа (используется только для формата 172@);
//    * ДанныеСотрудника - Структура - (Необязательный) Сведения о работнике организации продавца (РабОргПрод):
//       ** Фамилия - Строка - фамилия сотрудника.
//       ** Имя - Строка - имя сотрудника.
//       ** Отчество - Строка - отчество сотрудника.
//       ** Должность - Строка - должность сотрудника.
//
Функция ДополнительныеПараметрыПолученияКонтента() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("УказыватьОтсутствиеОснованияУПД", Ложь);
	Результат.Вставить("ДополнительныеСведенияСтрокой", "");
	Результат.Вставить("ФункцияДокумента", Неопределено);
	Результат.Вставить("ПараметрыСогласования", Неопределено);
	Результат.Вставить("ФИОПодписанта", Неопределено);
	Результат.Вставить("НомерЗаказа", Неопределено);
	Результат.Вставить("Отправитель_FnsParticipantId", Неопределено);
	Результат.Вставить("Получатель_FnsParticipantId", Неопределено);
	Результат.Вставить("ПараметрыФормированияФайла", Неопределено);
	Результат.Вставить("ДанныеСотрудника", Неопределено);
	Результат.Вставить("ИспользоватьСервисКонтурМаркировка", Ложь);
	Результат.Вставить("ФорматОтправки", Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Формирует протоструктуру для отправки электронного документа в заданном формате.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ФорматОтправки	 - Структура - содержит свойства:
//    * ИмяТипа			 - Строка - имя типа документа (typeNameId);
//    * ФункцияДокумента - Строка - функция документа (Function);
//    * ВерсияФормата	 - Строка - версия формата контента (Version);
//  ДополнительныеПараметры - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентФормализованногоДокумента(СсылкаНаДокумент, ФорматОтправки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	ОписаниеФормата = ПолноеОписаниеФорматаЭлектронногоДокумента(ФорматОтправки);
	
	БазовыеФорматы = БазовыеФорматы();
	БазовыйФормат = ОписаниеФормата.БазовыйФормат;
	
	ПараметрыФормирования.ФорматОтправки = ОписаниеФормата;
	ПараметрыФормирования.ФункцияДокумента = ФункцияУниверсальногоДокумента(ОписаниеФормата);
	
	Если БазовыйФормат = БазовыеФорматы.utd820 Тогда
		
		Результат = КонтентУПД820(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.utd Тогда
		
		Результат = КонтентУПД155(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.ucd736 Тогда 	
		
		Результат = КонтентУКД736(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.ucd Тогда
		
		Результат = КонтентУКД189(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.torg12 Тогда
		
		Результат = КонтентНакладной172(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.act Тогда
		
		Результат = КонтентАкта172(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.invoice Тогда
		
		Результат = КонтентСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.invoicecor Тогда
		
		Результат = КонтентКорректировочногоСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.proformainvoice Тогда
		
		Результат = КонтентФормализованногоСчета(СсылкаНаДокумент, ПараметрыФормирования);
		
	Иначе
		
		ТекстОшибки = СтрШаблон("Формат отправки не поддерживается!
			|Тип документа: %1
			|Функция документа: %2
			|Версия документа: %3"
			, ОписаниеФормата.ИмяТипа
			, ОписаниеФормата.ФункцияДокумента
			, ОписаниеФормата.ВерсияФормата);
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации()
			, УровеньЖурналаРегистрации.Ошибка
			, СсылкаНаДокумент.Метаданные()
			, СсылкаНаДокумент
			, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаДанных

// Дополняет структуру шапки документа данными, которые
// рассчитываются по табличной части документа.
//
// TODO: Убрать ключевое слово "Экспорт" и перенести в раздел "СлужебныеПроцедурыИФункции".
//       Это можно сделать только после полного перевода всех модулей интеграции на новые алгоритмы получения данных ТЧ.
//
// Параметры:
//  Шапка			 - Структура		 - см. функцию ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. функцию ДанныеТабличныхЧастей
//
Процедура ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть) Экспорт
	
	Шапка.Вставить("ЕстьТовары"	, ТабличнаяЧасть.НайтиСтроки(Новый Структура("ЭтоУслуга", Ложь	)).Количество() > 0);
	Шапка.Вставить("ЕстьУслуги"	, ТабличнаяЧасть.НайтиСтроки(Новый Структура("ЭтоУслуга", Истина)).Количество() > 0);
	
	// TODO: Добавить расчет следующих показателей
	//   * ВсегоНДС, ВсегоСНДС - вычислять нужно в цикле по ТЧ, использовать метод Итог(<Колонка>)
	//                           нельзя, т.к. в строках могут быть не только числа (например, Неопределено)
	//   * ТипНалогообложения - в качестве возможных значений предлагается использовать имена значений
	//                          перечисления ТипыНалогообложенияНДС из УТ/КА/ERP. 
	//                          На текущий момент важны 3 значения:
	//                            ** ОблагаетсяНДС - ВсегоНДС > 0
	//                            ** НеОблагаетсяНДС - все строки по ставке "Без НДС"
	//                            ** ОблагаетсяНДСУПокупателя - все строки по ставке "НДС исчисляется налоговым агентом"
	
КонецПроцедуры

// Универсальный метод для получения сведений по шапке документов.
// Состав полей и их значений может быть переопределен в интеграционном модуле 
// конфигурации или в подключаемом модуле с помощью событий:
//  - ПриПодготовкеЗапросаПоШапкеДокумента
//  - ПослеПолученияДанныхШапкиДокумента
//
// Параметры:
//  Ссылка - ДокументСсылка - документ, данные шапки которого нужно получить.
// 
// Возвращаемое значение:
//  Структура - реквизиты шапки документа:
//    * ОписаниеДокумента - Структура - Основные параметры документа информационной базы (см. ОписаниеПрикладногоДокумента)
//    * ДатаНомерДокумента - Структура - сведения о дате и номере документа (см. ДатаНомерДокумента)
//    * Представление					 - Строка			 - Представление документа для отображения в пользовательском интерфейсе.
//    * ХозяйственнаяОперация			 - Ссылка			 - элемент перечисления или справочника "ХозяйственныеОперации"
//    * ВидОперации						 - Ссылка			 - вид операции документа.
//    * СуммаДокумента					 - Число			 - сумма документа с НДС.
//    * ЦенаВключаетНДС					 - Булево			 - Истина, если цены указаны с учетом НДС.
//    * ВалютаДокумента					 - СправочникСсылка	 - валюта документа.
//    * ВалютаДокументаКод				 - Строка			 - код валюты документа.
//    * КурсДокумента					 - Число			 - курс валюты документа.
//    * КратностьДокумента				 - Число			 - кратность валюты документа.
//    * РасчетыВУсловныхЕдиницах		 - Булево			 - Истина, если расчеты ведутся в условных единицах.
//    * ИдентификаторГосКонтракта		 - Строка			 - Идентификатор государственного контракта, договора (соглашения)
//    * Организация						 - СправочникСсылка	 - организация документа.
//    * ОрганизацияРеквизиты			 - Структура		 - см. функцию РеквизитыЮрФизЛица.
//    * БанковскийСчетОрганизации		 - СправочникСсылка	 - банковский счет организации документа.
//    * ЦифровойИндексОбособленногоПодразделения - Строка, Число - цифровой индекс обособленного подразделения.
//    * Грузоотправитель				 - СправочникСсылка	 - грузоотправитель.
//    * ГрузоотправительРеквизиты		 - Структура		 - см. функцию РеквизитыЮрФизЛица.
//    * БанковскийСчетГрузоотправителя	 - СправочникСсылка	 - банковский счет грузоотправителя.
//    * Контрагент						 - СправочникСсылка	 - контрагент документа.
//    * КонтрагентРеквизиты				 - Структура		 - см. функцию РеквизитыЮрФизЛица.
//    * КонтрагентИНН					 - Строка			 - ИНН контрагента.
//    * КонтрагентКПП					 - Строка			 - КПП контрагента.
//    * БанковскийСчетКонтрагента		 - СправочникСсылка	 - банковский счет контрагента.
//    * Грузополучатель					 - СправочникСсылка	 - грузополучатель.
//    * ГрузополучательРеквизиты		 - Структура		 - см. функцию РеквизитыЮрФизЛица.
//    * БанковскийСчетГрузополучателя	 - СправочникСсылка	 - банковский счет грузополучателя.
//    * АдресДоставки					 - Строка			 - адрес доставки груза.
//
Функция ДанныеШапки(Ссылка) Экспорт 
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда 
		
		ОписаниеОш = НСтр("ru = 'Не заполнено значение первого параметра <Ссылка>!'");
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
	ОписаниеДокумента = ОписаниеПрикладногоДокумента(Ссылка);
	
	МетаданныеДокумента = Ссылка.Метаданные();
	
	// Готовим описание итоговой структуры
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ХозяйственнаяОперация");
	Реквизиты.Вставить("ВидОперации");
	Реквизиты.Вставить("Организация");
	Реквизиты.Вставить("БанковскийСчетОрганизации");
	Реквизиты.Вставить("Контрагент");
	Реквизиты.Вставить("БанковскийСчетКонтрагента");
	Реквизиты.Вставить("Грузоотправитель");
	Реквизиты.Вставить("БанковскийСчетГрузоотправителя");
	Реквизиты.Вставить("Грузополучатель");
	Реквизиты.Вставить("БанковскийСчетГрузополучателя");
	Реквизиты.Вставить("ИдентификаторГосКонтракта");
	Реквизиты.Вставить("РасчетыВУсловныхЕдиницах");
	Реквизиты.Вставить("ВалютаДокумента");
	Реквизиты.Вставить("ВалютаДокументаКод");
	Реквизиты.Вставить("КурсДокумента");
	Реквизиты.Вставить("КратностьДокумента");
	Реквизиты.Вставить("ЦенаВключаетНДС");
	Реквизиты.Вставить("СуммаДокумента");
	Реквизиты.Вставить("СуммаНДСДокумента");
	Реквизиты.Вставить("НДСИсчисляетсяНалоговымАгентом");
	
	Реквизиты.Вставить("Объем");
	Реквизиты.Вставить("Вес");
	
	Реквизиты.Вставить("АдресДоставки");
	Реквизиты.Вставить("СведенияОТранспортировкеИГрузе");
	
	Реквизиты.Вставить("ОбособленноеПодразделение");
	Реквизиты.Вставить("ЦифровойИндексОбособленногоПодразделения", "НЕОПРЕДЕЛЕНО");
	
	#Область СчетНаОплату
	Реквизиты.Вставить("ОрганизацияПолучатель");
	Реквизиты.Вставить("Плательщик");
	Реквизиты.Вставить("СуммаСкидки");
	Реквизиты.Вставить("НазначениеПлатежа");
	Реквизиты.Вставить("ДополнительныеУсловия");
	Реквизиты.Вставить("ДополнительнаяИнформация");
	Реквизиты.Вставить("ИдентификаторПлатежа");
	Реквизиты.Вставить("СрокОплаты");
	#КонецОбласти
	
	// В более-менее свежих версиях конфигураций УТ, КА, ERP и БП
	// ИНН и КПП контрагента сохраняются прямо в документе (например, СФ).
	Реквизиты.Вставить("КонтрагентИНН", "ИННКонтрагента");
	Реквизиты.Вставить("КонтрагентКПП", "КППКонтрагента");
	
	// Вызовем обработчик события, переопределенный в модуле интеграции
	ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеДокумента);
	
	// Проверим существование всех необходимых реквизитов и заполним
	// выражения для полей с зарезервированными именами (ИмяПоляСсылка, ИмяПоляПредставление и т.д.)
	ЗаполнитьВыраженияПолейЗапроса(Реквизиты, МетаданныеДокумента);
	
	// Сформируем и выполним запрос по реквизитам
	Шапка = МетодСервера(, "ЗначенияРеквизитовОбъекта", Ссылка, Реквизиты);
	
	// Дополним итоговую структуру вспомогательными данными
	Шапка.Вставить("ОписаниеДокумента", ОписаниеДокумента);
	Шапка.Вставить("ИмяМетаданных"	, МетаданныеДокумента.Имя); // TODO: Удалить
	Шапка.Вставить("ОшибкиВДанных"	, Новый Массив);
	
	// Вызовем обработчик события, переопределенный в модуле интеграции
	ПослеПолученияДанныхШапкиДокумента(Шапка);
	
	ДатаНомерДокумента = ДатаНомерДокумента(ОписаниеДокумента, Шапка.ЦифровойИндексОбособленногоПодразделения);
	Шапка.Вставить("ДатаНомерДокумента", ДатаНомерДокумента);
	
	// Добавим в шапку сведения о юридических и физических лицах
	ДополнитьШапкуРеквизитамиЮрФизЛиц(Шапка);
	
	// Если ИНН и КПП контрагента не хранятся в самом документе,
	// то возьмем их из карточки контрагента
	ПроверитьЗаполнитьИННКППКонтрагента(Шапка);
	
	ЗаполнитьПредставлениеДокумента(Шапка);
	
	Возврат Шапка;
	
КонецФункции

// Универсальный метод для получения товарной части документа.
//
// Параметры:
//  Шапка - Структура - см. функцию ДанныеШапки
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит информацию о товарной части документа:
//     * ИмяТабличнойЧасти - Строка, Неопределено - имя табличной части документа;
//     * НомерСтроки - Число - номер строки документа;
//     * Номенклатура - СправочникСсылка - номенклатура документа;
//     * НоменклатураПредставление - Строка - представление номенклатуры;
//     * НоменклатураКод - Строка - код или артикул номенклатуры;
//     * ЭтоУслуга - Булево - Истина, если номенклатура является услугой;
//     * ПризнакТоварРаботаУслуга - Строка - тип номенклатуры в терминах сервиса {NotSpecified, Property, Job, Service, PropertyRights, Other};
//     * Характеристика - СправочникСсылка, Неопределено - характеристика номенклатуры;
//     * Серия - СправочникСсылка, Неопределено - серия номенклатуры;
//     * Упаковка - СправочникСсылка - упаковка (единица измерения) номенклатуры;
//     * ЕдиницаИзмерения - СправочникСсылка - единица измерения номенклатуры;
//     * ЕдиницаИзмеренияКод - Строка - код единицы измерения по ОКЕИ;
//     * ВидУпаковки - СправочникСсылка, Неопределено - (устарел, удалить);
//     * СтранаПроисхождения - СправочникСсылка, Неопределено - страна происхождения;
//     * СтранаПроисхожденияКод - Строка - код страны происхождения по ОКСМ;
//     * НомерГТД - СправочникСсылка, Неопределено - номер ГТД;
//     * КодТНВЭД - СправочникСсылка, Неопределено - код ТН ВЭД;
//     * СтавкаНДС - ПеречислениеСсылка, СправочникСсылка - ставка НДС;
//     * СтавкаНДСПредставление - Строка - представление ставки НДС (см. ПредставлениеСтавкиНДС);
//     * Количество - Число - количество упаковок;
//     * КоличествоВОдномМесте - Число - коэффициент упаковки;
//     * Цена - Число - цена за упаковку (без НДС и скидок/наценок);
//     * Сумма - Число - сумма без НДС;
//     * СуммаНДС - Число - сумма налога;
//     * СуммаСНДС - Число - сумма с учетом НДС;
//     * Масса - Число, Неопределено - масса;
//     * МассаНетто - Число, Неопределено - масса (нетто);
//
Функция ДанныеТабличныхЧастей(Шапка) Экспорт 
	
	Если Не ЗначениеЗаполнено(Шапка) Тогда 
		
		ОписаниеОш = НСтр("ru = 'Не заполнено значение первого параметра <Данные шапки документа>!'");
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
	Если ИспользуетсяМетодПолучитьДанныеТЧ() Тогда // данные ТЧ собираем "по-старому"
		Возврат ПолучитьДанныеТЧ(Шапка);
	КонецЕсли;
	
	ТабличныеЧасти = ИменаТабличныхЧастейДокумента(Шапка);
	
	ДанныеТЧ = Неопределено;
	
	Для Каждого ИмяТабличнойЧасти Из ТабличныеЧасти Цикл 
		
		Буфер = ТабличнаяЧастьДокумента(Шапка, ИмяТабличнойЧасти);
		
		Если ДанныеТЧ = Неопределено Тогда 
			ДанныеТЧ = Буфер.Скопировать();
		Иначе 
			ДополнитьТаблицу(ДанныеТЧ, Буфер);
		КонецЕсли;
		
	КонецЦикла;
	
	ПослеПолученияТоварнойЧастиДокумента(Шапка, ДанныеТЧ);
	
	Возврат ДанныеТЧ;
	
КонецФункции

// Устарела.
// Получает номер документа для вывода на печать; из номера удаляются префиксы и лидирующие нули.
//
// Параметры:
//  СсылкаИлиСтруктура - ДокументСсылка	 - документ, номер которого нужно получить.
//                     - Структура		 - структура с ключом "Номер".
// 
// Возвращаемое значение:
//  Строка - Номер на печать.
//
Функция НомерНаПечать(СсылкаИлиСтруктура) Экспорт
	
	НомерОбъекта = Неопределено;
	Если ТипЗнч(СсылкаИлиСтруктура) = Тип("Структура") Тогда 
		НомерОбъекта = СсылкаИлиСтруктура.Номер;
	Иначе
		НомерОбъекта = МетодСервера(, "ЗначениеРеквизитаОбъекта", СсылкаИлиСтруктура, "Номер");
	КонецЕсли;
	
	Результат = РасчетноеПредставлениеНомера(НомерОбъекта);
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя реквизита номенклатуры, который нужно использовать в качестве кода товара в печатных формах.
// 
// Возвращаемое значение:
//  Строка - имя реквизита с представлением кода номенклатуры. Например, "Код" или "Артикул".
//
Функция ИмяКолонкиКодТовара() Экспорт
	
	СтандартнаяОбработка = Истина;
	ИмяКолонки			 = Неопределено;
	
	ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов(ИмяКолонки, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		ИмяКолонки = "Код";
	КонецЕсли;
	
	Возврат ИмяКолонки;
	
КонецФункции

// Возвращает валюту регламентированного учета.
// 
// Возвращаемое значение:
//  СправочникСсылка.Валюты - валюта регл. учета.
//
Функция ВалютаРегламентированногоУчета() Экспорт
	
	СтандартнаяОбработка = Истина;
	Результат = Неопределено;
	
	ПриОпределенииВалютыРегламентированногоУчета(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		Если Метаданные.Константы.Найти("ВалютаРегламентированногоУчета") <> Неопределено Тогда
			Результат = Константы.ВалютаРегламентированногоУчета.Получить();
		ИначеЕсли Метаданные.Константы.Найти("ВалютаУчета") <> Неопределено Тогда
			Результат = Константы.ВалютаУчета.Получить();
		ИначеЕсли Метаданные.Константы.Найти("ВалютаРегламентированногоУчетаОрганизаций") <> Неопределено Тогда
			Результат = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Формирует пользовательское представление документа для отображения в интерфейсе и сообщениях
// в формате "<Представление вида документа> <Номер> от <Дата> (<Операция>)"
//
// Параметры:
//  Шапка - Структура - см. функцию ДанныеШапки
//
Процедура ЗаполнитьПредставлениеДокумента(Шапка)
	
	Результат = "";
	
	ОписаниеДокумента = Шапка.ОписаниеДокумента;
	ОбъектМетаданных = ОписаниеДокумента.Ссылка.Метаданные();
	
	ПредставлениеОбъектаМетаданных = ОбъектМетаданных.ПредставлениеОбъекта;
	Если Не ЗначениеЗаполнено(ПредставлениеОбъектаМетаданных) Тогда
		ПредставлениеОбъектаМетаданных = ОбъектМетаданных.Представление();
	КонецЕсли;
	
	ПредставлениеДаты = Формат(ОписаниеДокумента.Дата, "ДЛФ=D");
	ПредставлениеНомера = ОписаниеДокумента.Номер;
	
	Результат = ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 от %3'")
		, ПредставлениеОбъектаМетаданных
		, ПредставлениеНомера
		, ПредставлениеДаты
		);
	
	Операция = ?(ЗначениеЗаполнено(Шапка.ХозяйственнаяОперация), Шапка.ХозяйственнаяОперация, Шапка.ВидОперации);
	
	Если ЗначениеЗаполнено(Операция) Тогда 
		Результат = ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"), Результат, Операция);
	КонецЕсли;
	
	Шапка.Вставить("Представление", Результат);
	
КонецПроцедуры

// Предоставляет реквизиты компании (юридического лица или предпринимателя), например, для вывода в печатной форме.
//
// Параметры:
//  ЮрФизЛицо		 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период			 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет	 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                     Если не передан, будут включены реквизиты основного банковского счета.
// 
// Возвращаемое значение:
// см. НовыйРеквизитыКомпании() - коллекция общепринятых реквизитов компании.
//
Функция РеквизитыЮрФизЛица(ЮрФизЛицо, Период = '00010101', Знач БанковскийСчет = Неопределено) Экспорт
	
	Результат = НовыйРеквизитыЮрФизЛица();
	
	Если Не ЗначениеЗаполнено(ЮрФизЛицо) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Если Период = "--" Тогда
		Период = '00010101';
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	ПриПолученииРеквизитовЮрФизЛица(Результат, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка);
	
	ДополнитьРеквизитыЮрФизЛицаАдреснойИнформацией(Результат, ЮрФизЛицо, Период);
	
	СкопироватьЗначенияJSONВЗначенияПолей(Результат);
	
	Если Результат.Свойство("НаименованиеДляПечатныхФорм") 
		И НЕ ЗначениеЗаполнено(Результат.НаименованиеДляПечатныхФорм) Тогда
		
		Результат.НаименованиеДляПечатныхФорм = Результат.ПолноеНаименование;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое описание юридического или физического лица.
//
// Параметры:
//  Реквизиты		 - Структура - см. функцию РеквизитыЮрФизЛица.
//  ШаблонОписания	 - Строка	 - задает формат результирующей строки с описанием организации.
//  СПрефиксом		 - Булево	 - Истина, если требуется выводить заголовки реквизитов.
//
// Возвращаемое значение:
//  Строка - описатель организации / контрагента / физ.лица.
//
Функция ПредставлениеЮрФизЛица(Реквизиты, ШаблонПредставления = "", СПрефиксом = Истина) Экспорт
	
	Перем Префикс, СтрокаДополнения;

	Результат = Новый Массив;

	СоответствиеПараметров = Новый Структура;
	СоответствиеПараметров.Вставить("ПолноеНаименование",			" ");
	СоответствиеПараметров.Вставить("СокращенноеНаименование",		" ");
	СоответствиеПараметров.Вставить("НаименованиеДляПечатныхФорм",	" ");
	СоответствиеПараметров.Вставить("ИНН",							" ИНН ");
	СоответствиеПараметров.Вставить("КПП",							" КПП ");
	СоответствиеПараметров.Вставить("Свидетельство",				" ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",		" от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",				" ");
	СоответствиеПараметров.Вставить("ФактическийАдрес",				" ");
	СоответствиеПараметров.Вставить("Телефоны",						" тел.: ");
	СоответствиеПараметров.Вставить("Факс",							" факс: ");
	СоответствиеПараметров.Вставить("НомерСчета",					" р/с ");
	СоответствиеПараметров.Вставить("Банк",               			" в банке ");
	СоответствиеПараметров.Вставить("БИК",                			" БИК ");
	СоответствиеПараметров.Вставить("КоррСчет",           			" к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО",          			" Код по ОКПО ");
	
	Если ПустаяСтрока(ШаблонПредставления) Тогда

		ШаблонПредставления = "ИНН,Свидетельство,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
		Если Не Реквизиты.Свойство("НаименованиеДляПечатныхФорм") Или Не ЗначениеЗаполнено(Реквизиты.НаименованиеДляПечатныхФорм) Тогда
			ШаблонПредставления = "НаименованиеПолное," + ШаблонПредставления;
		Иначе
			ШаблонПредставления = "НаименованиеДляПечатныхФорм," + ШаблонПредставления;
		КонецЕсли;

	КонецЕсли;
	
	СписокПараметров = РазложитьСтрокуВМассивПодстрок(ШаблонПредставления, ",", Истина);
	
	Для каждого ИмяПараметра Из СписокПараметров Цикл
		
		Если Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения) Тогда
			
			Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения);
			Если ПустаяСтрока(СтрокаДополнения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СПрефиксом = Истина И СоответствиеПараметров.Свойство(ИмяПараметра, Префикс) Тогда
				Результат.Добавить(Префикс + СтрокаДополнения);
			Иначе
				Результат.Добавить(СтрокаДополнения);
			КонецЕсли; 
			
		Иначе
			
			//ТекстСообщения = НСТр("ru = 'Не удалось определить значение параметра организации:'") + " " + ИмяПараметра;
			//
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

			//ЗаписьЖурналаРегистрации(
			//	НСтр("ru = 'Формирование сведений об организации'", КодОсновногоЯзыка()), 
			//	УровеньЖурналаРегистрации.Ошибка,
			//	Метаданные.Справочники.Организации, , 
			//	ТекстСообщения + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		КонецЕсли;
		
	КонецЦикла; 

	СтрокаРезультата = СтрокаИзМассиваПодстрок(Результат, ",");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "  ", " ");
	
	Возврат СокрЛП(СтрокаРезультата);
	
КонецФункции

// Возвращает представление номенклатуры для печати.
//
// Параметры:
//  Номенклатура - Строка, СправочникСсылка.Номенклатура - номенклатура;
//  Характеристика - Строка, СправочникСсылка.ХарактеристикиНоменклатуры - (необязательный) характеристика номенклатуры;
//  ДополнительныеПараметры - Структура - (необязательный) см. функцию ДополнительныеПараметрыПредставленияНоменклатуры.
// 
// Возвращаемое значение:
//  Строка - представление номенклатуры.
//
Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Результат			 = "";
	СтандартнаяОбработка = Истина;
	
	Если ДополнительныеПараметры = Неопределено Тогда 
		ДополнительныеПараметры = ДополнительныеПараметрыПредставленияНоменклатуры();
	КонецЕсли;
	
	ПриПолученииПредставленияНоменклатуры(Результат, Номенклатура, Характеристика, ДополнительныеПараметры, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		Результат = СокрЛП(Номенклатура);
		Если ЗначениеЗаполнено(Характеристика) Тогда 
			Результат = ПодставитьПараметрыВСтроку("%1 (%2)", Результат, СокрЛП(Характеристика));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополнительные параметры функции ПредставлениеНоменклатуры.
// 
// Возвращаемое значение:
//  Структура - со свойствами:
//  * Упаковка	 - Строка, СправочникСсылка - упаковка / единица измерения номенклатуры;
//  * Серия		 - Строка, СправочникСсылка - серия номенклатуры;
//  * КодТНВЭД	 - Строка, СправочникСсылка - Код ТН ВЭД;
//  * Префикс - Строка - если указан, то к представлению будет добавлен префикс перед наименованием номенклатуры.
//  * КодОсновногоЯзыка - Строка - указывается для уточнения кода основного языка при выводе локализуемых строк.
//
Функция ДополнительныеПараметрыПредставленияНоменклатуры() Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("Содержание", "");
	Результат.Вставить("ВозвратнаяТара", Ложь);
	Результат.Вставить("Серия");
	Результат.Вставить("Упаковка");
	Результат.Вставить("КодТНВЭД");
	Результат.Вставить("КодОсновногоЯзыка", КодОсновногоЯзыка());
	Результат.Вставить("Префикс", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

// Возвращает список различных правил обработки, которые подходят для указанного вида документов.
// Виды документов можно передавать массивом. Например, для УПД можно передать массив из двух элементов:
//  * ТоварнаяНакладная
//  * АктОбОказанииУслуг
//
// Параметры:
//  * ВидЭД - Строка - вид документа (см. ВидыЭлектронныхДокументов);
//          - Массив - список видов документов.
//  * ЭтоИсправление - Булево - Истина, если требуется получить правила обработки исправления документа;
// 
// Возвращаемое значение:
//  СписокЗначений - где Значение - это идентификатор правила обработки (см. ПравилоОбработкиЭлектронныхДокументов),
//                   Представление - представление правила для пользовательского интерфейса.
//
Функция ПравилаОбработкиВидаДокументов(ВидЭД, ЭтоИсправление = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидЭД) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если ТипЗнч(ВидЭД) = Тип("Массив") Тогда
		КоллекцияВидовЭД = ВидЭД;
	Иначе
		КоллекцияВидовЭД = Новый Массив;
		КоллекцияВидовЭД.Добавить(ВидЭД);
	КонецЕсли;
	
	Результат = Новый СписокЗначений;
	ДобавленныеИдентификаторы = Новый Соответствие;
	
	ТаблицаПравил = ПравилаОбработкиВходящихДокументов();
	
	Для Каждого ВидДокумента Из КоллекцияВидовЭД Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидДокумента", ВидДокумента);
		ПараметрыОтбора.Вставить("ЭтоИсправление", ЭтоИсправление);
		
		НайденныеСтроки = ТаблицаПравил.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого Запись Из НайденныеСтроки Цикл
			
			ИдентификаторПравила = Запись.ИдентификаторПравила;
			
			Если ДобавленныеИдентификаторы[ИдентификаторПравила] = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавленныеИдентификаторы.Вставить(ИдентификаторПравила, Истина);
			
			Попытка
				
				ПравилоОбработки = ПравилоОбработкиЭлектронныхДокументов(ИдентификаторПравила);
				Результат.Добавить(ПравилоОбработки, ПравилоОбработки.Представление);
				
			Исключение
				
				Ошибка = ИнформацияОбОшибке();
				ПодробнаяИнформация = КраткоеПредставлениеОшибки(Ошибка);
				ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать правило обработки электронных документов %1 при причине: %2'");
				КомментарийЖР = СтрШаблон(ШаблонКомментария, ИдентификаторПравила, ПодробнаяИнформация);
				СобытиеЖР = СобытиеЖурналаРегистрации();
				
				ЗаписьЖурналаРегистрации(
					СобытиеЖР,
					УровеньЖурналаРегистрации.Ошибка,
					Неопределено,
					ИдентификаторПравила,
					КомментарийЖР
				);
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает правила обработки обработки электронного документа, который
// выступает в роли первичного документа.
//
// Параметры:
//  ФорматЭД - Структура - описание формата (см. НовоеОписаниеФорматаЭлектронногоДокумента).
// 
// Возвращаемое значение:
//  СписокЗначений - см. ПравилаОбработкиВидаДокументов.
//
Функция ПравилаОбработкиПервичныхДокументов(ФорматЭД) Экспорт
	
	ВидДокумента = ФорматЭД.ВидПервичногоДокумента;
	ЭтоИсправление = ФорматЭД.ЭтоИсправление;
	Результат = ПравилаОбработкиВидаДокументов(ВидДокумента, ЭтоИсправление);
	
	Возврат Результат;
	
КонецФункции

// Получает правила обработки обработки электронного документа, который
// выступает в роли счета-фактуры.
//
// Параметры:
//  ФорматЭД - Структура - описание формата (см. НовоеОписаниеФорматаЭлектронногоДокумента).
// 
// Возвращаемое значение:
//  СписокЗначений - см. ПравилаОбработкиВидаДокументов.
//
Функция ПравилаОбработкиСчетовФактур(ФорматЭД) Экспорт
	
	ВидДокумента = ФорматЭД.ВидСчетаФактуры;
	ЭтоИсправление = ФорматЭД.ЭтоИсправление;
	Результат = ПравилаОбработкиВидаДокументов(ВидДокумента, ЭтоИсправление);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру с данными электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент	 - Структура - описание документа (см. НовыйЭлектронныйДокумент);
//  Контент				 - Структура - протоструктура;
// 
// Возвращаемое значение:
//  Структура - см. НовыйДанныеЭлектронногоДокумента;
//
Функция ДанныеЭлектронногоДокумента(ЭлектронныйДокумент, Контент) Экспорт
	
	ЭтоКорректировка	= ЭлектронныйДокумент.Формат.ЭтоКорректировка;
	ТипДокумента		= ЭлектронныйДокумент.Формат.ТипДокумента;
	Результат			= НовыйДанныеЭлектронногоДокумента();
	
	Если ТипДокумента = ТипДокумента_ДокументОРасхождениях() Тогда
		
		Шапка = ШапкаЭлектронногоДокумента423(Контент);
		
		ЗаполнитьКлючевыеСвойстваДокумента423(Шапка, Контент);
		
		СведенияТЧ = ДанныеТоварнойЧастиЭлектронногоДокумента423(Контент);
		
		Результат.Шапка = Шапка;
		Результат.ТоварнаяЧасть = СведенияТЧ;
		
		ЗаполнитьОрганизациюКонтрагентаИнформационнойБазы(Шапка, ЭлектронныйДокумент);
		
	ИначеЕсли ТипДокумента = ТипДокумента_АктСверки() Тогда
		
		Шапка = ШапкаАктаСверки405(Контент);
		
		СведенияТЧ = ДанныеТабличнойЧастиЭлектронногоДокумента405(Контент);
		
		Результат.Шапка = Шапка;
		Результат.ТоварнаяЧасть = СведенияТЧ.СверкаПоДаннымКонтрагента;
		Результат.Итоги = СведенияТЧ.ИтоговыеСуммы;
		
		ЗаполнитьОрганизациюКонтрагентаИнформационнойБазы405(Шапка, ЭлектронныйДокумент);
		
	ИначеЕсли ТипДокумента = ТипДокумента_СчетНаОплату() Тогда
		
		Шапка = ШапкаСчетаНаОплату(Контент);
		
		СведенияТЧ = ДанныеТоварнойЧастиЭлектронногоДокумента29(Контент, ЭтоКорректировка);
		
		Результат.Шапка = Шапка;
		Результат.Итоги = СведенияТЧ.ИтоговыеСуммы;
		Результат.ТоварнаяЧасть = СведенияТЧ.ТоварнаяЧасть;
		
		ЗаполнитьОрганизациюКонтрагентаИнформационнойБазы(Шапка, ЭлектронныйДокумент);
		
	Иначе
		
		Шапка = ШапкаЭлектронногоДокумента(Контент);
		
		Если ЭтоКорректировка Тогда
			ЗаполнитьКлючевыеСвойстваКорректируемогоДокумента(Шапка, Контент);
		КонецЕсли;
		
		СведенияТЧ = ДанныеТоварнойЧастиЭлектронногоДокумента(Контент, ЭтоКорректировка);
		
		Результат.Шапка = Шапка;
		Результат.Итоги = СведенияТЧ.ИтоговыеСуммы;
		Результат.ТоварнаяЧасть = СведенияТЧ.ТоварнаяЧасть;
		Результат.ЭтоАванс = ЭтоЭлектронныйСчетФактураНаАванс(Контент, Результат);
		
		ЗаполнитьОрганизациюКонтрагентаИнформационнойБазы(Шапка, ЭлектронныйДокумент);
		
	КонецЕсли;
	
	Результат.ЭлектронныйДокумент = ЭлектронныйДокумент;
	
	Возврат Результат;
	
КонецФункции

// Обогощает универсальную структуру электронного документа
// ссылками на объекты информационной базы.
//
// Параметры:
//  ДанныеЭД - Структура - см. функцию НовыйДанныеЭлектронногоДокумента;
//
Процедура ДополнитьОписаниеЭлектронногоДокументаДаннымиИБ(ДанныеЭД) Экспорт
	
	ШапкаЭД = ДанныеЭД.Шапка;

	НайтиОрганизацию(ШапкаЭД.Покупатель);
	НайтиКонтрагента(ШапкаЭД.Продавец);
	НайтиКонтрагента(ШапкаЭД.Грузоотправитель);
	НайтиКонтрагента(ШапкаЭД.Грузополучатель);
	
	НайтиВалюту(ШапкаЭД.Валюта);
	
	Организация	 = СсылкаНаУчастникаЭДО(ШапкаЭД.Покупатель);
	Контрагент	 = СсылкаНаУчастникаЭДО(ШапкаЭД.Продавец);
	
	УстановитьСвойствоСтруктуры(ДанныеЭД, "Шапка.Партнер.Контрагент", Контрагент);
	НайтиПартнера(ШапкаЭД.Партнер);
	
	ВладелецНоменклатуры = ВладелецНоменклатураПоставщиков(ШапкаЭД);
	
	ФорматЭД		= ДанныеЭД.ЭлектронныйДокумент.Формат;
	ТипДокумента	= ДанныеЭД.ЭлектронныйДокумент.Формат.ТипДокумента;
	
	Если ТипДокумента = ТипДокумента_Корректировочный() Тогда
		
		УстановитьСвойствоСтруктуры(ДанныеЭД, "Шапка.КорректируемыйДокумент.Организация", Организация);
		УстановитьСвойствоСтруктуры(ДанныеЭД, "Шапка.КорректируемыйДокумент.Контрагент", Контрагент);
		
		Если ФорматЭД.ЕстьФункцияСФ Тогда
			НайтиКорректируемыйСчетФактуру(ДанныеЭД.Шапка.КорректируемыйДокумент);
		КонецЕсли;
		
		НайтиКорректируемуюНакладную(ДанныеЭД.Шапка.КорректируемыйДокумент);
		
	КонецЕсли;
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		Стр.НоменклатураКонтрагента.Владелец = ВладелецНоменклатуры;
		
		НайтиНоменклатуруИнформационнойБазы(Стр.Номенклатура, Стр.НоменклатураКонтрагента);
		
		Если Стр.Свойство("ДанныеГТД") Тогда 
			
			Для Каждого Элемент Из Стр.ДанныеГТД Цикл 
				
				НайтиСтрану(Элемент.СтранаПроисхождения);
				НайтиНомерГТД(Элемент.НомерГТД);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обогощает структуру электронного документа в фромате 405@
// ссылками на объекты информационной базы.
//
// Параметры:
//  ДанныеЭД - Структура - см. функцию НовыйДанныеЭлектронногоДокумента;
//
Процедура ДополнитьОписаниеЭлектронногоДокументаДаннымиИБ405(ДанныеЭД)
	
	ШапкаЭД = ДанныеЭД.Шапка;

	НайтиОрганизацию(ШапкаЭД.Получатель);
	НайтиКонтрагента(ШапкаЭД.Отправитель);
	
	НайтиВалюту(ШапкаЭД.Валюта);
	
	Контрагент = СсылкаНаУчастникаЭДО(ШапкаЭД.Отправитель);
	
	УстановитьСвойствоСтруктуры(ДанныеЭД, "Шапка.Партнер.Контрагент", Контрагент);
	
	НайтиПартнера(ШапкаЭД.Партнер);
	
КонецПроцедуры

// Создает новый экземпляр документа информационной базы и заполняет его
// по данным электронного документа. Созданный объект при этом не записывается.
//
// Параметры:
//  ДанныеЭД - Структура - Данные электронного документа (см. ДанныеЭлектронногоДокумента);
//  ИдентификаторПравилаОбработки - Строка - Идентификатор правила создания и заполнения документа информационной базы:
//                                  1. Имя метаданных документа:
//                                     правило обработки формируется автоматически по имени и представлению метаданного
//                                  2. Произвольная строка:
//                                     правило обработки требуется описать в событии ПриПолученииПравилаОбработкиЭлектронногоДокумента
// 
// Возвращаемое значение:
//  ДокументОбъект - заполненный, но еще не записанный, документ-объект.
//
// Пример:
// ПараметрыСозданияСФ = Новый Структура;
// ПараметрыСозданияСФ.Вставить("ДокументОснование", ДокументОснование);
// СчетФактураОбъект = МенеджерИнтеграции.НовыйДокументИнформационнойБазы(ДанныеЭД, "СчетФактураПолученный", ПараметрыСозданияСФ);
//
Функция НовыйДокументИнформационнойБазы(ДанныеЭД, ИдентификаторПравилаОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТипДокумента = ДанныеЭД.ЭлектронныйДокумент.Формат.ТипДокумента;
	
	Если ТипДокумента = ТипДокумента_АктСверки() Тогда
		ДополнитьОписаниеЭлектронногоДокументаДаннымиИБ405(ДанныеЭД);
	Иначе
		ДополнитьОписаниеЭлектронногоДокументаДаннымиИБ(ДанныеЭД);
	КонецЕсли;
	
	ПравилоОбработки = ПравилоОбработкиЭлектронныхДокументов(ИдентификаторПравилаОбработки);
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ПравилоОбработки.ОбъектМетаданных);
	МенеджерОбъекта	 = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
	
	ПараметрыЗаполнения = Новый Структура;
	
	Если ЗначениеЗаполнено(ПравилоОбработки.ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыЗаполнения, ПравилоОбработки.ДополнительныеПараметры, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыЗаполнения, ДополнительныеПараметры, Истина);
	КонецЕсли;
	
	НовыйОбъект = МенеджерОбъекта.СоздатьДокумент();
	
	СтандартнаяОбработка = Истина;
	ПриСозданииДокументаИнформационнойБазы(НовыйОбъект, ДанныеЭД, ПараметрыЗаполнения, СтандартнаяОбработка);
	
	// Стандартный механизм, как правило, заполняет документ так:
	// - реквизиты, в метаданных которых установлен флаг "ЗаполнятьИзДанныхЗаполнения"
	// - некоторые реквизиты заполняются значениями по умолчанию
	Если СтандартнаяОбработка Тогда 
		
		ЗначенияЗаполнения = ЗначенияЗаполненияДокументаИБ(ДанныеЭД); // Структура с найденными ссылками
		НовыйОбъект.Заполнить(ЗначенияЗаполнения);
		
		Если ЕстьРеквизитМетаданных(ОбъектМетаданных, "Комментарий")
			И Не ЗначениеЗаполнено(НовыйОбъект.Комментарий) Тогда
			НовыйОбъект.Комментарий = "Загружен из системы Диадок";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НовыйОбъект.Дата) Тогда
			НовыйОбъект.Дата = ТекущаяДата();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НовыйОбъект.Номер) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйОбъект;
	
КонецФункции

// Выполняет поиск ссылок на объекты информационной базы по значениям реквизитов
//
// Параметры:
//  ОбластьПоиска	 - ОбъектМетаданных, Массив - метаданные объектов, по которым осуществляется поиск;
//  ПоляПоиска		 - Структура - содержит имена и значения реквизитов поиска;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на найденные объекты.
//
Функция НайтиСсылкиПоЗначениямРеквизитов(ОбластьПоиска, ПоляПоиска) Экспорт
	
	Если ТипЗнч(ОбластьПоиска) = Тип("Массив") Тогда 
		КоллекцияМетаданных = ОбластьПоиска;
	Иначе 
		КоллекцияМетаданных = Новый Массив;
		КоллекцияМетаданных.Добавить(ОбластьПоиска);
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Для Каждого ОписаниеОбъектаМетаданных Из КоллекцияМетаданных Цикл 
		
		ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
		
		ЕстьРеквизитыПоиска = Истина;
		Для Каждого Поле Из ПоляПоиска Цикл 
			
			Если Не ЕстьРеквизитМетаданных(ОбъектМетаданных, Поле.Ключ) Тогда 
				ЕстьРеквизитыПоиска = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьРеквизитыПоиска Тогда 
			Продолжить;
		КонецЕсли;
		
		Буфер = ВыборкаОбъектовПоПараметрамПоиска(ОбъектМетаданных, ПоляПоиска);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, Буфер, Истина);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Позволяет определить заполнен ли реквизит в документе.
//
// Параметры:
//  ИмяРеквизита - Строка - Строковое имя искомого реквизита.
//  Объект - ДокументОбъект - Объект, в котором проверяется заполненность реквизита.
//  МетаданныеОбъекта - Метаданные - Объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьНезаполненныйРеквизитОбъекта(ИмяРеквизита, Объект, МетаданныеОбъекта) Экспорт

	Результат = Ложь;
	
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, ИмяРеквизита)
		И Не ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает массив учетных документов, сопоставленных с электронным документом.
//
// Параметры:
//  ИдентификаторЭД - Структура - полный идентификатор документа (см. Модуль_Клиент.ИдентификаторЭлектронногоДокумента)
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на документы учета (первичные документы и СФ).
//
Функция СопоставленныеУчетныеДокументы(ИдентификаторЭД) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ИдентификаторЭД) Тогда
		
		Результат = МетодСервера(, "DocumentID_2_МассивДокументов"
			, ИдентификаторЭД.СоставнойИдентификатор
			, ИдентификаторЭД.ИдентификаторОрганизации);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает номенклатуру электронного документа, которая 
// требует сопоставления с данными информационной базы.
//
// Параметры:
//  ДанныеЭД - Структура - Данные электронного документа;
// 
// Возвращаемое значение:
//  Соответствие - ключ - ключ строки документа, значение - номенклатура контрагента (см. НовыйКлючевыеСвойстваНоменклатураПоставщика).
//
Функция НоменклатураНаКонтроле(ДанныеЭД) Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		ДанныеНоменклатуры = Стр.Номенклатура;
		
		Если Не ЗначениеЗаполнено(ДанныеНоменклатуры.Номенклатура) Тогда 
			
			Результат.Вставить(Стр.КлючСтроки, Стр.НоменклатураКонтрагента);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция находит счета-фактуры заданного документа.
//
// Параметры:
//  ДокументОснование	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СчетаФактурыПоОснованию(ДокументОснование) Экспорт 
	
	НайденныеДокументы	 = Новый Массив;
	СтандартнаяОбработка = Истина;
	ПараметрыРегистрации = ПараметрыРегистрацииСчетаФактурыПоОснованию(ДокументОснование);
	
	ПриПолученииСчетовФактурПоОснованию(НайденныеДокументы, ПараметрыРегистрации, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
	КонецЕсли;
	
	Возврат НайденныеДокументы;
	
КонецФункции

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка - счет-фактура, основание которой нужно найти;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура) Экспорт
	
	Результат = Новый Массив;
	
	Если Не ЭтоСчетФактура(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ОбъектМетаданных = СчетФактура.Метаданные();
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", ПолноеИмяОбъекта+".ТабличнаяЧасть.ДокументыОснования") Тогда 
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	&ПолноеИмяТаблицы КАК Т
		|ГДЕ
		|	Т.Ссылка = &СчетФактура";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяОбъекта + ".ДокументыОснования");
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			Результат.Добавить(Выборка.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ЕстьРеквизитМетаданных(ОбъектМетаданных, "ДокументОснование") Тогда 
		
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "ДокументОснование");
		Результат.Добавить(ДокументОснование);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеКонтента

// Заполняет объект AddressInfo по структуре сведений об адресе.
//
// Параметры:
//  AddressInfo		 - Структура - соответствует объекту https://diadocsdk-1c.readthedocs.io/ru/latest/AddressInfo.html;
//  СтруктураАдреса	 - Структура - см. функцию СведенияОбАдресе или урезанный вариант (КодСтраны и Представление);
//
Процедура Заполнить_AddressInfo(AddressInfo, СтруктураАдреса) Экспорт
	
	ЗаполнятьАдрРФ = Ложь;
	Если СохраненноеПредставлениеАдресаСовпадаетСРассчитанным(СтруктураАдреса) // проверка на консистентность адреса
		И ЭтоРоссийскийАдрес(СтруктураАдреса)
		И АдресСоответствуетФорматуКЛАДР(СтруктураАдреса) Тогда
		ЗаполнятьАдрРФ = Истина;
	КонецЕсли;
	
	Если ЗаполнятьАдрРФ Тогда 
		
		AddressInfo.IsForeign	 = Ложь;
		AddressInfo.ZipCode		 = СтруктураАдреса.Индекс;
		AddressInfo.RegionCode	 = СтруктураАдреса.КодРегиона;
		AddressInfo.Territory	 = ПолеАдресаССокращением(СтруктураАдреса.Район, СтруктураАдреса.РайонСокращение);
		AddressInfo.City		 = ПолеАдресаССокращением(СтруктураАдреса.Город, СтруктураАдреса.ГородСокращение);
		AddressInfo.Locality	 = ПолеАдресаССокращением(СтруктураАдреса.НаселенныйПункт, СтруктураАдреса.НаселенныйПунктСокращение);
		AddressInfo.Street		 = ПолеАдресаССокращением(СтруктураАдреса.Улица, СтруктураАдреса.УлицаСокращение);
		
		Если ЗначениеЗаполнено(СтруктураАдреса.Здание) Тогда 
			СтруктураАдреса.Здание.Свойство("Номер", AddressInfo.Building);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураАдреса.Корпуса) Тогда 
			СтруктураАдреса.Корпуса[0].Свойство("Номер", AddressInfo.Block);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураАдреса.Помещения) Тогда 
			СтруктураАдреса.Помещения[0].Свойство("Номер", AddressInfo.Apartment);
		КонецЕсли;
		
	Иначе 
		
		// Для российских адресов не по КЛАДР тоже установим флаг в значение Истина,
		// чтобы обойти некорректную проверку адреса в компоненте
		AddressInfo.IsForeign	 = Истина;
		AddressInfo.CountryCode	 = СтруктураАдреса.КодСтраны;
		AddressInfo.AddressText	 = СтруктураАдреса.СохраненноеПредставление;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет массив структур поля StructedAdditionalInfos
//
// Параметры:
//  StructedAdditionalInfos - Массив - Коллекция дополнительных сведений
//  ДопСведения             - Строка - Дополнительные сведения в формате "ключ1=значение1;ключ2=значение2"
//
Процедура ЗаполнитьStructedAdditionalInfos(StructedAdditionalInfos, ДопСведения) Экспорт

	МетодСервера(, "ЗаполнитьStructedAdditionalInfos", StructedAdditionalInfos, ДопСведения);

КонецПроцедуры

#КонецОбласти

#Область ОбщегоНазначения

// Добавляет в указанный массив новую структуру с ключами "Ключ" и "Значение".
//
// Параметры:
//  Коллекция	 - Массив - коллекция структур;
//  Ключ		 - Строка - произвольная строка;
//  Значение	 - Произвольный - произвольное значение.
//
Процедура ДобавитьКлючЗначение(Коллекция, Ключ, Значение) Экспорт
	
	ЭлементКоллекции = Новый Структура;
	ЭлементКоллекции.Вставить("Ключ", Ключ);
	ЭлементКоллекции.Вставить("Значение", Значение);
	
	Коллекция.Добавить(ЭлементКоллекции);
	
КонецПроцедуры

// Дополняет таблицу значений-приемник данными из таблицы значений-источник.
//
// Параметры:
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую будут добавлены строки из таблицы-источника.
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой будут браться строки для заполнения;
//  
Процедура ДополнитьТаблицу(ТаблицаПриемник, ТаблицаИсточник) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет существование реквизита метаданных.
//
// Параметры:
//  ОбъектМетаданных				 - ОбъектМетаданных	 - метаданные произвольного объекта.
//  ИмяРеквизита					 - Строка			 - имя проверяемого реквизита.
//  ПроверятьСтандартныеРеквизиты	 - Булево			 - Истина, если при проверке следует учитывать стандартные реквизиты (Код, Наименование и т.д.)
// 
// Возвращаемое значение:
//  Булево - Истина, если реквизит с заданным именем существует.
//
Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь) Экспорт
	
	Если ОбъектМетаданных = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьРеквизит = ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
	
	Если Не ЕстьРеквизит И ПроверятьСтандартныеРеквизиты Тогда 
		
		КоллекцияРеквизитов = ОбъектМетаданных.СтандартныеРеквизиты;
		
		Для Каждого СтандартныйРеквизит Из КоллекцияРеквизитов Цикл 
			
			Если ВРег(СтандартныйРеквизит.Имя) = ВРег(ИмяРеквизита) Тогда 
				ЕстьРеквизит = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЕстьРеквизит;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты) Экспорт
	
	Результат = МетодСервера(, "ЗначенияРеквизитовОбъекта", Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

// Проверяет существование и использование общего реквизита для объекта метаданных.
//
// Параметры:
//  ОбъектМетаданных				 - ОбъектМетаданных	 - метаданные произвольного объекта.
//  ИмяРеквизита					 - Строка			 - имя проверяемого реквизита.
// 
// Возвращаемое значение:
//  Булево - Истина, если реквизит с заданным именем существует.
//
Функция ЕстьОбщийРеквизит(ОбъектМетаданных, ИмяРеквизита) Экспорт
	
	Если ОбъектМетаданных = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьРеквизит = Ложь;
		
	КоллекцияРеквизитов = Метаданные.ОбщиеРеквизиты;
	
	Для Каждого ОбщийРеквизит Из КоллекцияРеквизитов Цикл
		
		Если ВРег(ОбщийРеквизит.Имя) = ВРег(ИмяРеквизита) Тогда
			
			ИспользованиеОбщегоРеквизита = ОбщийРеквизит.Состав.Найти(ОбъектМетаданных);
			
			Если ИспользованиеОбщегоРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
				ЕстьРеквизит = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьРеквизит;
	
КонецФункции

// Возвращает таблицу значений с данными табличной части объекта.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - ЛюбаяСсылка - элемент справочника, документ, ...
//  ИмяТЧ     - Строка - имя табличной части.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//  ДополнительныеПараметры - Структура, Неопределено - параметры, которые нужно передать в запрос.
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит затребованные данные табличной части.
//
Функция ЗначенияРеквизитовТабличнойЧасти(Ссылка, ИмяТЧ, Реквизиты, ДополнительныеПараметры = Неопределено)
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
		Строка(ТипЗнч(Реквизиты)));
		
	КонецЕсли;
	
	Результат	 = Новый ТаблицаЗначений;
	ТекстПолей	 = "";
	
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		СокрЛП(КлючИЗначение.Значение),
		СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей 
		+ 	?(ЗначениеЗаполнено(ТекстПолей), ",", "")
		+ 	"
			|	" + ИмяПоля + " КАК " + Псевдоним;
		
		Результат.Колонки.Добавить(Псевдоним);
		
	КонецЦикла;
	
	ПолноеИмяТаблицы = Ссылка.Метаданные().ПолноеИмя() + "." + ИмяТЧ;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		
		Для Каждого Параметр Из ДополнительныеПараметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	" + ТекстПолей + "
	|ИЗ
	|	" + ПолноеИмяТаблицы + " КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.НомерСтроки
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если указанное свойство не существует. 
// 
// Параметры:
//   СложнаяСтруктура    - Структура   - Структура, которая может содержать вложенные структуры.
//   ИерархияСвойств     - Строка     - Полное имя ключа с учетом вложенности структур
//                         (имена свойств вложенных структур отделяются точкой);
//   ЗначениеПоУмолчанию - Произвольный   - Необязательный. Возвращается когда в структуре нет значения по указанному
//                         ключу. Для скорости рекомендуется передавать только быстро вычисляемые 
//                         значения (например примитивные типы),а инициализацию более тяжелых значений
//                         выполнять после проверки полученного значения (только если это требуется);
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
//
Функция СвойствоСтруктуры(СложнаяСтруктура, ИерархияСвойств, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Результат = ЗначениеПоУмолчанию;
	
	Если Не ЗначениеЗаполнено(ИерархияСвойств) Или СложнаяСтруктура = Неопределено Тогда // ЗначениеЗаполнено не применять, т.к. это может быть объект ДанныеФормыСтруктура
		Возврат Результат;
	КонецЕсли;
	
	ПростыеКлючи = РазложитьСтрокуВМассивПодстрок(ИерархияСвойств, ".", Ложь);
	
	ЗначениеПолучено = Ложь;
	ТекущееЗначение   = Неопределено;
	ТекущаяСтруктура = СложнаяСтруктура;
	
	ВГраница = ПростыеКлючи.ВГраница();
	
	Для Сч = 0 По ВГраница Цикл
		
		ТекущийКлюч = ПростыеКлючи[Сч];
		
		Если ТекущаяСтруктура.Свойство(ТекущийКлюч, ТекущееЗначение) Тогда
			
			Если Сч = ВГраница Тогда
				
				// Это последний ПолныйКлюч в массиве
				ЗначениеПолучено = Истина;
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("Структура") Тогда
				
				// Есть подчиненная СложнаяСтруктура для получения следующего значения
				ТекущаяСтруктура = ТекущееЗначение;
				
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеПолучено Тогда
		Результат = ТекущееЗначение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Установить свойство структуры
//
// Параметры:
//  Структура		 - Структура - Структура, которая может содержать вложенные структуры;
//  ИерархияСвойств	 - Строка - Полное имя ключа с учетом вложенности структур
//                     (имена свойств вложенных структур отделяются точкой);
//  Значение		 - Произвольный - значение устанавливаемого свойства;
//
Процедура УстановитьСвойствоСтруктуры(Структура, Знач ИерархияСвойств, Знач Значение) Экспорт
	
	Если ТипЗнч(ИерархияСвойств) = Тип("Строка") Тогда
		ИерархияСвойств = РазложитьСтрокуВМассивСлов(ИерархияСвойств, ".");
	КонецЕсли;
	
	ТекущееСвойство = ИерархияСвойств[0];
	
	Если ИерархияСвойств.Количество() = 1 Тогда
		
		Структура.Вставить(ТекущееСвойство, Значение);
		
	Иначе
		
		ТекущееЗначение = Неопределено;
		Если Не Структура.Свойство(ТекущееСвойство, ТекущееЗначение) Тогда
			ТекущееЗначение = Новый Структура;
		КонецЕсли;
		ИерархияСвойств.Удалить(0);
		УстановитьСвойствоСтруктуры(ТекущееЗначение, ИерархияСвойств, Значение);
		Структура.Вставить(ТекущееСвойство, ТекущееЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СкопироватьСтруктуру(Знач СтруктураИсходник) Экспорт
	
	СтруктураПриемник=	Новый Структура;
	Для каждого ЭлементИсходник Из СтруктураИсходник Цикл
		Если ТипЗнч(ЭлементИсходник.Значение) = Тип("Массив") Тогда
			СтруктураПриемник.Вставить(ЭлементИсходник.Ключ, Новый Массив);	
		Иначе
			СтруктураПриемник.Вставить(ЭлементИсходник.Ключ, Неопределено);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПриемник;
	
КонецФункции

// Находит ссылку на объект ИБ по различным комбинациям свойств объекта.
//
// Параметры:
//  СвойстваОбъекта	 - Структура - содержит имена и значения реквизитов искомого объекта;
//  ВариантыПоиска	 - Массив	 - содержит строки с именами реквизитов, по которым выполняется поиск;
//  ОписаниеОбъектаМетаданных - ОбъектМетаданных, Тип, Строка
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на найденный объект ИБ;
//  Неопределено - если объект не найден;
//
Функция СсылкаОбъектаПоСвойствам(СвойстваОбъекта, ВариантыПоиска, ОписаниеОбъектаМетаданных) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ВариантыПоиска) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	
	Для Каждого КомбинацияПолей Из ВариантыПоиска Цикл 
		
		ПоляПоиска = Новый Структура(КомбинацияПолей);
		ЗаполнитьЗначенияСвойств(ПоляПоиска, СвойстваОбъекта);
		
		// Вариант поиска является полноценным, если заполнены все поля.
		// В противном случае должен сработать другой вариант поиска.
		Если Не ВсеПоляКоллекцииЗаполнены(ПоляПоиска) Тогда 
			Продолжить;
		КонецЕсли;
		
		Результат = СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных);
		
		Если ЗначениеЗаполнено(Результат) Тогда 
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Находит ссылку на объект ИБ по различным комбинациям полей поиска.
//
// Параметры:
//  НаборПолейПоиска			 - Массив - содержит структуры с полями поиска;
//  ОписаниеОбъектаМетаданных	 - ОбъектМетаданных, Тип, Строка - объект метаданных, тип или полное имя объекта метаданных;
//  ОднозначноеСоответствие		 - Булево - Истина, если требуется найти единственную подходящую ссылку;
// 
// Возвращаемое значение:
//  ЛюбаяСсылка	 - ссылка на найденный объект ИБ;
//  Неопределено - если объект не найден;
//
Функция СсылкаОбъектаПоНаборуПолейПоиска(НаборПолейПоиска, ОписаниеОбъектаМетаданных, ОднозначноеСоответствие = Истина)
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(НаборПолейПоиска) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	
	Для Каждого ПоляПоиска Из НаборПолейПоиска Цикл 
		
		// Вариант поиска является полноценным, если заполнены все поля.
		// В противном случае должен сработать другой вариант поиска.
		Если Не ВсеПоляКоллекцииЗаполнены(ПоляПоиска) Тогда 
			Продолжить;
		КонецЕсли;
		
		Результат = СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных, ОднозначноеСоответствие);
		
		Если ЗначениеЗаполнено(Результат) Тогда 
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Находит ссылку на объект информационной базы по значениям полей
//
// Параметры:
//  ПоляПоиска					 - Структура - содержит имена и значения полей;
//  ОписаниеОбъектаМетаданных	 - ОбъектМетаданных, Тип, Строка - объект метаданных, тип или полное имя объекта метаданных;
//  ОднозначноеСоответствие		 - Булево - Истина, если требуется найти единственную подходящую ссылку;
// 
// Возвращаемое значение:
//  ЛюбаяСсылка	 - ссылка на найденный объект ИБ;
//  Неопределено - если объект не найден;
//
Функция СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных, ОднозначноеСоответствие = Истина) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ПоляПоиска) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	ЭтоДокумент		 = Метаданные.Документы.Содержит(ОбъектМетаданных);
	ЭтоСправочник	 = Метаданные.Справочники.Содержит(ОбъектМетаданных);
	
	СтандартнаяОбработка = Истина;
	ПриПолученииСсылкиПоПолямПоиска(Результат, ПоляПоиска, ОбъектМетаданных, СтандартнаяОбработка);
	
	Если Не СтандартнаяОбработка Тогда 
		Возврат Результат;
	КонецЕсли;
	
	// Если есть возможность, используем платформенные методы поиска
	Если ЭтоДокумент
		И ПоляПоиска.Количество() = 2
		И ПоляПоиска.Свойство("Дата")
		И ПоляПоиска.Свойство("Номер") Тогда
		
		МенеджерОбъекта = Документы[ОбъектМетаданных.Имя];
		Результат = МенеджерОбъекта.НайтиПоНомеру(ПоляПоиска.Номер, ПоляПоиска.Дата);
		
	ИначеЕсли ЭтоСправочник 
		И ПоляПоиска.Количество() = 1
		И ПоляПоиска.Свойство("Наименование") Тогда 
		
		МенеджерОбъекта = Справочники[ОбъектМетаданных.Имя];
		Результат = МенеджерОбъекта.НайтиПоНаименованию(ПоляПоиска.Наименование, Истина);
		
	ИначеЕсли ЭтоСправочник 
		И ПоляПоиска.Количество() = 1
		И ПоляПоиска.Свойство("Код") Тогда 
		
		МенеджерОбъекта = Справочники[ОбъектМетаданных.Имя];
		Результат = МенеджерОбъекта.НайтиПоКоду(ПоляПоиска.Код);
		
	ИначеЕсли ПоляПоиска.Количество() = 1
		И ПоляПоиска.Свойство("ИдентификаторОрганизации") Тогда
		
		Результат = СсылкаПоИдентификаторуОрганизации(ПоляПоиска.ИдентификаторОрганизации, ОбъектМетаданных);
		
	ИначеЕсли ПоляПоиска.Количество() = 1
		И ПоляПоиска.Свойство("ИдентификаторУчастникаЭДО") Тогда // TODO: поиск по fnsParticipantId
		
	Иначе // Поиск запросом
		
		НайденныеСсылки = ВыборкаОбъектовПоПараметрамПоиска(ОбъектМетаданных, ПоляПоиска, Ложь);
		
		Если НайденныеСсылки.Количество() = 1 Тогда 
			Результат = НайденныеСсылки[0];
		ИначеЕсли НайденныеСсылки.Количество() > 1 И Не ОднозначноеСоответствие Тогда 
			Результат = НайденныеСсылки[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		Результат = Неопределено; // поиск платформенными методами может возвращать пустые ссылки
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает произвольное значение в число.
//
// Параметры:
//  Значение - Произвольный - произвольное значение.
// 
// Возвращаемое значение:
//  Число - результат преобразования.
//
// Пример:
//   Цена = ПривестиКЧислу("1 000,50"); // результат 1000.5
//
Функция ПривестиКЧислу(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда // нечего преобразовывать
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда // удалим пробелы
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

// Значение возвращаемое в "DocumentName" объекта "TransferBase" в случае отсутствия 
// документа основания отгрузки
Функция ДокументОснованиеОтгрузкиОтсутствует() Экспорт
	
	Возврат "Отсутствует";
	
КонецФункции

Функция СтруктураЗаполнена(Структура)
	
	Результат = Ложь;
	
	Для Каждого КлючИЗначение Из Структура Цикл
		
		ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
		
		Если ТипЗначения = Тип("Структура") Тогда
			Результат = СтруктураЗаполнена(КлючИЗначение.Значение);
		ИначеЕсли ТипЗначения = Тип("Булево") Тогда
			Результат = КлючИЗначение.Значение = Истина;
		Иначе
			Результат = ЗначениеЗаполнено(КлючИЗначение.Значение);
		КонецЕсли;
		
		Если Результат = Истина Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтроковыеФункции

// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//     - если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив - массив строк.
//
// Примеры:
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",") - возвратит массив из 5 элементов, три из которых  - пустые строки;
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина) - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок(" один   два  ", " ") - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок("") - возвратит пустой массив;
//  РазложитьСтрокуВМассивПодстрок("",,Ложь) - возвратит массив с одним элементом "" (пустой строкой);
//  РазложитьСтрокуВМассивПодстрок("", " ") - возвратит массив с одним элементом "" (пустой строкой);
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь)
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Объединяет строки из массива в строку с разделителями.
//
// Параметры:
//  Массив      - Массив - массив строк которые необходимо объединить в одну строку;
//  Разделитель - Строка - любой набор символов, который будет использован в качестве разделителя.
//
// Возвращаемое значение:
//  Строка - строка с разделителями.
// 
Функция СтрокаИзМассиваПодстрок(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь)
	
	Результат = "";
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		Подстрока = Массив[Индекс];
		
		Если СокращатьНепечатаемыеСимволы Тогда
			Подстрока = СокрЛП(Подстрока);
		КонецЕсли;
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Если Индекс > 0 Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Подстрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли символ разделителем.
//
// Параметры:
//  КодСимвола      - Число  - код проверяемого символа;
//  РазделителиСлов - Строка - символы разделителей.
//
// Возвращаемое значение:
//  Булево - истина, если символ является разделителем.
//
Функция ЭтоРазделительСлов(КодСимвола, РазделителиСлов = Неопределено)
	
	Если РазделителиСлов <> Неопределено Тогда
		Возврат Найти(РазделителиСлов, Символ(КодСимвола)) > 0;
	КонецЕсли;
		
	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 		// цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 		// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 		// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103)); 	// кириллица
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1025, 1025)); 	// символ "Ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1105, 1105)); 	// символ "ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95)); 		// символ "_"
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Разбивает строку на несколько строк, используя заданный набор разделителей.
// Если параметр РазделителиСлов не задан, то разделителем слов считается любой из символов, 
// не относящихся к символам латиницы, кириллицы, цифры, подчеркивания.
//
// Параметры:
//  Строка          - Строка - строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - строка, содержащая символы-разделители.
//
//  Возвращаемое значение:
//      массив значений, элементы которого - отдельные слова
//
// Пример:
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три") возвратит массив значений: "один", "два2_", "три";
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три", "#@!_") возвратит массив значений: "один-", "два2", "три".
//
Функция РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов = Неопределено)
	
	Слова = Новый Массив;
	
	РазмерТекста = СтрДлина(Строка);
	НачалоСлова = 1;
	Для Позиция = 1 По РазмерТекста Цикл
		КодСимвола = КодСимвола(Строка, Позиция);
		Если ЭтоРазделительСлов(КодСимвола, РазделителиСлов) Тогда
			Если Позиция <> НачалоСлова Тогда
				Слова.Добавить(Сред(Строка, НачалоСлова, Позиция - НачалоСлова));
			КонецЕсли;
			НачалоСлова = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Позиция <> НачалоСлова Тогда
		Слова.Добавить(Сред(Строка, НачалоСлова, Позиция - НачалоСлова));
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки  - Строка - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра");
//  Параметр<n>        - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	ИспользоватьАльтернативныйАлгоритм = 
		Найти(Параметр1, "%")
		Или Найти(Параметр2, "%")
		Или Найти(Параметр3, "%")
		Или Найти(Параметр4, "%")
		Или Найти(Параметр5, "%")
		Или Найти(Параметр6, "%")
		Или Найти(Параметр7, "%")
		Или Найти(Параметр8, "%")
		Или Найти(Параметр9, "%");
		
	Если ИспользоватьАльтернативныйАлгоритм Тогда
		СтрокаПодстановки = ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(СтрокаПодстановки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	Иначе
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	КонецЕсли;
	
	Возврат СтрокаПодстановки;
КонецФункции

// Формирует строку повторяющихся символов заданной длины.
//
// Параметры:
//  Символ      - Строка - символ, из которого будет формироваться строка.
//  ДлинаСтроки - Число  - требуемая длина результирующей строки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из повторяющихся символов.
//
Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки)
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Дополняет строку символами слева или справа до заданной длины и возвращает ее.
// Незначащие символы слева и справа удаляются. По умолчанию функция дополняет строку символами "0" (ноль) слева.
//
// Параметры:
//  Строка      - Строка - исходная строка, которую необходимо дополнить символами;
//  ДлинаСтроки - Число  - требуемая результирующая длина строки;
//  Символ      - Строка - символ, которым необходимо дополнить строку;
//  Режим       - Строка - "Слева" или "Справа" - режим добавления символов к исходной строке.
// 
// Возвращаемое значение:
//  Строка - строка, дополненная символами.
//
// Пример 1:
// Строка = "1234"; ДлинаСтроки = 10; Символ = "0"; Режим = "Слева"
// Возврат: "0000001234"
//
// Пример 2:
// Строка = " 1234  "; ДлинаСтроки = 10; Символ = "#"; Режим = "Справа"
// Возврат: "1234######"
//
Функция ДополнитьСтроку(Знач Строка, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева")
	
	// длина символа не должна превышать единицы
	Символ = Лев(Символ, 1);
	
	// удаляем крайние пробелы слева и справа строки
	Строка = СокрЛП(Строка);
	
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Строка);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = СформироватьСтрокуСимволов(Символ, КоличествоСимволовНадоДобавить);
		
		Если ВРег(Режим) = "СЛЕВА" Тогда
			
			Строка = СтрокаДляДобавления + Строка;
			
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			
			Строка = Строка + СтрокаДляДобавления;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

// Определяет, заканчивается ли строка указанной подстрокой.
//
// Параметры:
//  Строка			 - Строка - Строка, окончание которой проверяется на совпадение с подстрокой поиска.
//  СтрокаПоиска	 - Строка - Строка, содержащая предполагаемое окончание строки. 
//                              В случае если переданное значение является пустой строкой генерируется исключение.
//  УчитыватьРегистр - Булево - Истина, если проверять совпадение следует с учетом регистра.
// 
// Возвращаемое значение:
//  Булево - Истина, если строка заканчивается указанной подстрокой.
//
Функция СтрокаЗаканчиваетсяНа(Знач Строка, Знач СтрокаПоиска, УчитыватьРегистр = Истина)
	
	Если Не ЗначениеЗаполнено(СтрокаПоиска) Или Не ТипЗнч(СтрокаПоиска) = Тип("Строка") Тогда 
		ТекстИсключения = НСтр("ru = 'Ошибка при вызове метода контекста (СтрокаЗаканчиваетсяНа): 
                                |Недопустимое значение параметра (параметр номер ''2'')'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если Не УчитыватьРегистр Тогда 
		Строка		 = ВРег(Строка);
		СтрокаПоиска = ВРег(СтрокаПоиска);
	КонецЕсли;
	
	Результат = Ложь;
	Если Прав(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаляет с конца строки заданное количество символов.
//
// Параметры:
//  Строка				 - Строка	 - исходная строка.
//  КоличествоСимволов	 - Число	 - количество удаляемых символов.
// 
// Возвращаемое значение:
//  Строка - обрезанная строка.
//
Функция ОбрезатьСтрокуСправа(Строка, КоличествоСимволов = 1)
	
	Результат = Лев(Строка, СтрДлина(Строка) - КоличествоСимволов);
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий.
//
// Параметры
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Результат = МетодСервера(, "СравнитьВерсии", СтрокаВерсии1, СтрокаВерсии2);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСКонтактнойИнформацией

// Возвращает сведения об адресе в виде отдельных частей адреса и различных кодов (код региона, ОКТМО и др.).
//
// Параметры:
//   Адрес                  - Строка	 - адрес во внутреннем формате JSON;
//                          - Строка	 - адрес в формате XML, соответствующем XDTO пакету Адрес;
//                          - Строка	 - адрес в формате "9 запятых" (КЛАДР);
//                          - ОбъектXDTO - XDTO объект, соответствующий XDTO пакету Адрес;
//   ДополнительныеПараметры - Структура - для уточнения возвращаемого значения:
//       * БезПредставлений - Булево - Если Истина, то поле Представление будет отсутствовать. По умолчанию, Ложь.
//       * КодыАдреса       - Булево - Если Истина, то результат содержит поля ИдентификаторАдресногоОбъекта, ИдентификаторДома
//                                     и структура с кодами адреса(Идентификаторы, ДополнительныеКоды, КодыКЛАДР).
//                                     Подробнее см. в возвращаемом значении структуры Идентификаторы и ДополнительныеКоды. По умолчанию, Ложь.
//                                     Если в адресе отсутствуют идентификаторы и в программу не загружены идентификаторы адресных объектов адреса,
//                                     то получение идентификаторов может инициировать http запрос к веб-сервису 1С orgaddress.
//       * КодыКЛАДР        - Булево - Если Истина, то возвращается структура КодыКЛАДР. По умолчанию, Ложь.
//                                     Если в адресе отсутствуют коды и в программу не загружены адресные объекты адреса,
//                                     Получение кодов может инициировать http запрос к веб-сервису 1С orgaddress.
//       * ПолныеНаименованияСокращений - Булево - Если Истина, то возвращается полное наименование адресных объектов.
//       * НаименованиеВключаетСокращение - Булево - Если Истина, то поля содержат сокращениям в наименованиях адресных объектов.
//       * ПроверитьАдрес   - Булево - Если Истина, то адрес будет проверен на соответствие ФИАС. По умолчанию, Ложь.
//                                     Если в программу не загружены проверяемые адресные объекты,
//                                     то проверка адреса может инициировать http запрос к веб-сервису 1С orgaddress.
//
// Возвращаемое значение:
//   Структура - сведения об адресе:
//        * СохраненноеПредставление  - Строка - Представление адреса, отображаемое в формах:
//                                      тег "value" в JSON или атрибут "Представление" для XML.
//        * Представление    - Строка - текстовое представление адреса по административно-территориальному делению.
//                                      Это представление формируется динамически по значениям адресообразующих полей.
//        * МуниципальноеПредставление - Строка - текстовое представление адреса по муниципальному делению.
//        * ТипАдреса        - Строка - основной тип адреса (только для адресов РФ).
//                                      Варианты: "Муниципальный", "Административно-территориальный".
//        * Страна           - Строка - текстовое представление страны.
//        * КодСтраны        - Строка - код страны по ОКСМ.
//        * Индекс           - Строка - почтовый индекс.
//        * КодРегиона       - Строка - код региона РФ.
//        * Регион           - Строка - текстовое представление региона РФ.
//        * РегионСокращение - Строка - сокращение региона.
//        * Округ            - Строка - (устарело) текстовое представление округа;
//        * ОкругСокращение  - Строка - (устарело) сокращение округа;
//        * Район            - Строка - текстовое представление района у адресов по административно-территориальному делению.
//        * РайонСокращение  - Строка - сокращение района у адресов по административно-территориальному делению.
//        * МуниципальныйРайон - Строка - текстовое представление муниципального района у адресов по муниципальному делению.
//        * МуниципальныйРайонСокращение - Строка - сокращение муниципального района у адресов по муниципальному делению.
//        * Город            - Строка - текстовое представление города у адресов по административно-территориальному делению.
//        * ГородСокращение  - Строка - сокращение города  у адресов по административно-территориальному делению.
//        * Поселение            - Строка - текстовое представление поселения у адресов по муниципальному делению.
//        * ПоселениеСокращение  - Строка - сокращение поселения у адресов по муниципальному делению.
//        * ВнутригородскойРайон - Строка - текстовое представление внутригородского района.
//        * ВнутригородскойРайонСокращение  - Строка - сокращение внутригородского района.
//        * НаселенныйПункт  - Строка - текстовое представление населенного пункта.
//        * НаселенныйПунктСокращение - Строка - сокращение населенного пункта.
//        * Территория            - Строка - текстовое представление территории.
//        * ТерриторияСокращение  - Строка - сокращение территории.
//        * Улица            - Строка - текстовое представление улицы.
//        * УлицаСокращение  - Строка - сокращение улицы.
//        * ДополнительнаяТерритория - Строка - (устарело) текстовое представление дополнительной территории;
//        * ДополнительнаяТерриторияСокращение - Строка - (устарело)сокращение дополнительной территории;
//        * ЭлементДополнительнойТерритории - Строка - (устарело) текстовое представление элемента дополнительной территории;
//        * ЭлементДополнительнойТерриторииСокращение - Строка - (устарело)сокращение элемента дополнительной территории;
//        * Здание - Структура - структура с информацией о здании адреса.
//            ** ТипЗдания - Строка  - тип объекта адресации адреса РФ согласно приказу Минфина России от 5.11.2015 г. N
//                                     171н.
//            ** Номер - Строка  - текстовое представление номера дома (только для адресов РФ).
//        * Корпуса   - Массив - содержит структуры(поля структуры: ТипКорпуса, Номер) с перечнем корпусов адреса.
//        * Помещения - Массив - содержит структуры(поля структуры: ТипПомещения, Номер) с перечнем помещений адреса.
//        * Комментарий - Строка - комментарий об адресе.
//        * ИдентификаторАдресногоОбъекта - УникальныйИдентификатор - Идентификационный код последнего адресного объекта
//                                        в иерархи адреса. Например, для адреса: Москва г., Дмитровское ш., д.9 это
//                                        будет идентификатор улицы.
//                                        Поле отсутствует, если дополнительный параметр КодыАдреса равен Ложь.
//        * ИдентификаторДома             - УникальныйИдентификатор - Идентификационный код дома(строения) адресного объекта.
//                                        Поле отсутствует, если дополнительный параметр КодыАдреса равен Ложь.
//        * Идентификаторы - Структура - Идентификаторы адресных объектов адреса, если установлен параметр КодыАдреса или КодыКЛАДР.
//                                       Поле отсутствует, если дополнительный параметр КодыАдреса или КодыКЛАДР равен Ложь.
//            ** Регион               - УникальныйИдентификатор - идентификатор региона.
//            ** Район                - УникальныйИдентификатор - идентификатор района.
//            ** МуниципальныйРайон   - УникальныйИдентификатор - идентификатор муниципального района.
//            ** Город                - УникальныйИдентификатор - идентификатор города.
//            ** Поселение            - УникальныйИдентификатор - идентификатор поселения.
//            ** ВнутригородскойРайон - УникальныйИдентификатор - идентификатор внутригородского района.
//            ** Территория           - УникальныйИдентификатор - идентификатор территории.
//            ** Улица                - УникальныйИдентификатор - идентификатор улица.
//        * КодыКЛАДР           - Структура - Коды КЛАДР, если установлен параметр КодыКЛАДР в Истина.
//           ** Регион          - Строка    - Код КЛАДР региона.
//           ** Район           - Строка    - Код КЛАДР район.
//           ** Город           - Строка    - Код КЛАДР города.
//           ** НаселенныйПункт - Строка    - Код КЛАДР населенного пункта.
//           ** Улица           - Строка    - Код КЛАДР улица.
//        * ДополнительныеКоды  - Структура - Коды ОКТМО, ОКТМО, ОКАТО, КодИФНСФЛ, КодИФНСЮЛ, КодУчасткаИФНСФЛ, КодУчасткаИФНСЮЛ.
//                                            Поле отсутствует, если дополнительный параметр КодыАдреса равен Ложь.
//        * РезультатПроверкиАдреса - Строка - "Успех", если адрес корректный, "Ошибка" - при наличии ошибок проверки,
//                                             "Отказ", если не удалось проверить адрес, т.к. не доступен классификатор.
//                                             Пустая строка, если в параметре ДополнительныеПараметры.ПроверитьАдрес не
//                                             установлен флаг ПроверитьАдрес.
//        * ОшибкиПроверкиАдреса - Строка  - описание ошибок в адресе, выявленных в ходе проверки.
//
Функция СведенияОбАдресе(Адрес, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыЗапросаСведений = Новый Структура;
	ПараметрыЗапросаСведений.Вставить("БезПредставлений", Ложь);
	ПараметрыЗапросаСведений.Вставить("КодыАдреса", Ложь);
	ПараметрыЗапросаСведений.Вставить("КодыКЛАДР", Ложь);
	ПараметрыЗапросаСведений.Вставить("ПолныеНаименованияСокращений", Ложь);
	ПараметрыЗапросаСведений.Вставить("НаименованиеВключаетСокращение", Ложь);
	ПараметрыЗапросаСведений.Вставить("ПроверитьАдрес", Ложь);
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыЗапросаСведений, ДополнительныеПараметры);
	КонецЕсли;
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	Если МетодСервера(, "СравнитьВерсии", ВерсияБСП, "2.4") >= 0 Тогда
		ИмяМодуля = "РаботаСАдресами";
	Иначе 
		ИмяМодуля = "УправлениеКонтактнойИнформацией";
	КонецЕсли;
	
	МодульРаботаСАдресами = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Результат = МодульРаботаСАдресами.СведенияОбАдресе(Адрес, ДополнительныеПараметры);
	
	ПроверитьИсправитьКодСтраныВСведенияхОбАдресе(Результат); // Исправление ошибки БСП 00-00174180
	
	// Свойство "ТипАдреса" появилось только в БСП 2.4
	Если Не Результат.Свойство("ТипАдреса") Тогда
		
		// до БСП 3.0 российские адреса могли быть введены только по административно-территориальному делению
		ТипАдреса = ?(ЭтоРоссийскийАдрес(Результат)
						, АдминистративноТерриториальныйАдрес()
						, ИностранныйАдрес());
		
		Результат.Вставить("ТипАдреса", ТипАдреса);
		
	КонецЕсли;
	
	Если Не Результат.Свойство("Представление") Тогда 
		Результат.Вставить("Представление");
		УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеАдреса(Результат, Результат.Представление);
	КонецЕсли;
	
	СохраненноеПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(Адрес);
	Результат.Вставить("СохраненноеПредставление", СохраненноеПредставление);
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление адреса и значения полей во внутреннем формате JSON (для БСП 3.0 и выше) или XML (для БСП 2.4 и ниже).
//
// Параметры:
//  ЮрФизЛицо	 - ЛюбаяСсылка - владелец контактной информации (организация, контрагент, партнер и т.д.);
//  ВидАдреса	 - СправочникСсылка.ВидыКонтактнойИнформации - вид запрашиваемого адреса;
//  Дата		 - Дата - (необязательный) дата с которой действует запись контактной информации,
//  					  используется при хранении истории изменения контактной информации;
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//     * Представление - Строка - строковое представление адреса;
//     * ЗначенияПолей - Строка - значения полей адреса во внутреннем формате JSON или XML;
//
Функция АдресЮрФизЛица(ЮрФизЛицо, ВидАдреса, Дата = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Представление");
	Результат.Вставить("ЗначенияПолей");
	
	ТаблицаКИ = КонтактнаяИнформацияОбъекта(ЮрФизЛицо, ВидАдреса, Дата);
	
	Если ЗначениеЗаполнено(ТаблицаКИ) Тогда 
		
		СтрокаКИ = ТаблицаКИ[0];
		
		Если ТаблицаКИ.Колонки.Найти("Значение") <> Неопределено Тогда // JSON, для БСП 3.0.x
			Результат.ЗначенияПолей = СтрокаКИ.Значение;
		ИначеЕсли ТаблицаКИ.Колонки.Найти("ЗначенияПолей") <> Неопределено Тогда // XML
			Результат.ЗначенияПолей = СтрокаКИ.ЗначенияПолей;
		КонецЕсли;
		
		Результат.Представление = СтрокаКИ.Представление;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на фактического владельца контактной информации объекта.
// Например, контактная информация контрагента - физ.лица хранится в карточке
// связанного с контрагентом физического лица, а не в карточке самого контрагента.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект (контрагента/организацию/подразделение);
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на объект, который является фактическим владельцем контактной информации.
//
Функция ХранилищеКонтактнойИнформацииОбъекта(СсылкаНаОбъект) Экспорт 
	
	ХранилищеКИ = Неопределено;
	
	СтандартнаяОбработка = Истина;
	ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		ХранилищеКИ = СсылкаНаОбъект;
	КонецЕсли;
	
	Возврат ХранилищеКИ;
	
КонецФункции

// Возвращает представление контактной информации объекта.
//
// Параметры:
//  СсылкаИлиОбъект         - Произвольный - Владелец контактной информации.
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации.
//  Разделитель             - Строка - Разделитель, который добавляется в представление между записями контактной информации.
//                                     По умолчанию это запятая с последующем пробелом, для исключения
//                                     пробела необходимо использовать признак БезПробелов у параметра ДополнительныеПараметры.
//  Дата                    - Дата - Дата с которой действует запись контактной информации. Если контактная информация
//                                   хранит историю изменения, то передача даты обязательна.
//  ДополнительныеПараметры - Структура - Необязательные параметры для формирования представления контактной информации.
//   * ТолькоПервая         - Булево - Если Истина, то будет возвращено представление только основной(первой) записи
//                                     контактной информации. По умолчанию - Ложь;
//   * БезПробелов          - Булево - Если Истина, то после разделителя не будет автоматически добавляется пробел.
//                                     По умолчанию - Ложь;
// 
// Возвращаемое значение:
//  Строка - Сформированное представление контактной информации.
//
Функция ПредставлениеКонтактнойИнформацииОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации, Разделитель = ",", Дата = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТолькоПервая = Ложь;
	БезПробелов = Ложь;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ТолькоПервая") Тогда
			ТолькоПервая = ДополнительныеПараметры.ТолькоПервая;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("БезПробелов") Тогда
			БезПробелов = ДополнительныеПараметры.БезПробелов;
		КонецЕсли;
	КонецЕсли;
	РазделительВПредставлении = ?(БезПробелов, Разделитель, Разделитель + " ");
	
	ПервыйПроход = Истина;
	КонтактнаяИнформация = КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации, Дата);
	Для каждого ЗаписьКонтактнойИнформации Из КонтактнаяИнформация Цикл
		Если ПервыйПроход Тогда
			Представление = ЗаписьКонтактнойИнформации.Представление;
			Если ТолькоПервая Тогда
				Возврат Представление;
			КонецЕсли;
			ПервыйПроход = Ложь;
		Иначе
			Представление = Представление + РазделительВПредставлении + ЗаписьКонтактнойИнформации.Представление;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

Процедура ЗаполнитьАдресУчастникаЭДО(AddressInfo, ПредставлениеАдреса, ЗначенияПолейАдреса) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗначенияПолейАдреса) Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураАдреса = СведенияОбАдресе(ЗначенияПолейАдреса);
	СтруктураАдреса.СохраненноеПредставление = ПредставлениеАдреса;
	
	Заполнить_AddressInfo(AddressInfo, СтруктураАдреса);
	
КонецПроцедуры

#КонецОбласти

#Область Окружение

// Возвращает номер версии библиотеки электронных документов.
//
// Возвращаемое значение:
//  Строка - номер сборки (РР.ПП.ВВ.СС).
//
Функция ВерсияБиблиотекиЭлектронныхДокументов()
	
	Результат = ОбновлениеИнформационнойБазыБЭД.ВерсияБиблиотеки();
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяБЭД19()
	
	Результат = Ложь;
	
	ВерсияБЭД = ВерсияБиблиотекиЭлектронныхДокументов();
	
	Если СравнитьВерсии(ВерсияБЭД, "1.9") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяБЭД191422ИВыше()
	
	Результат = Ложь;
	
	ВерсияБЭД = ВерсияБиблиотекиЭлектронныхДокументов();
	
	Если СравнитьВерсии(ВерсияБЭД, "1.9.14.22") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляОбеспеченияОбратнойСовместимости

// Устарела. Следует использовать функцию КонтентУПД155()
//
// Параметры:
//  СсылкаНаДокумент			 - ДокументСсылка - Источник данных для сбора контента;
//  ДопПараметры				 - Структура - дополнительные параметры;
//  ДопСведения					 - Строка - имена и значения дополнительных полей;
//  НеИспользуется_ФИОПодписанта - Строка - фамилия, имя и отчество подписанта;
//  ФункцияУПД					 - Строка - функция электронного документа для формирования XML;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьXmlUTDContent(Знач СсылкаНаДокумент, Знач ДопПараметры = Неопределено
							, Знач ДопСведения = Неопределено
							, НеИспользуется_ФИОПодписанта = Неопределено
							, ФункцияУПД) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДопПараметры);
	КонецЕсли;
	ПараметрыФормирования.ФункцияДокумента = ФункцияУПД;
	ПараметрыФормирования.ДополнительныеСведенияСтрокой = ДопСведения;
	
	Результат = КонтентУПД155(СсылкаНаДокумент, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать функцию КонтентУКД189()
//
// Параметры:
//  СсылкаНаДокумент			 - ДокументСсылка - Источник данных для сбора контента;
//  ДопПараметры				 - Структура - дополнительные параметры;
//  ДопСведения					 - Строка - имена и значения дополнительных полей;
//  НеИспользуется_ФИОПодписанта - Строка - фамилия, имя и отчество подписанта;
//  ФункцияУПД					 - Строка - функция электронного документа для формирования XML;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьXmlUCDContent(СсылкаНаДокумент, ДопПараметры = Неопределено
								, ДопСведения = Неопределено
								, НеИспользуется_ФИОПодписанта = Неопределено
								, ФункцияУПД) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДопПараметры);
	КонецЕсли;
	ПараметрыФормирования.ФункцияДокумента = ФункцияУПД;
	ПараметрыФормирования.ДополнительныеСведенияСтрокой = ДопСведения;
	
	Результат = КонтентУКД189(СсылкаНаДокумент, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать функцию КонтентФормализованногоСчета()
//
// Параметры:
//  СсылкаНаДокумент		 - ДокументСсылка - Источник данных для сбора контента;
//  ДополнительныеПараметры	 - Структура - дополнительные параметры;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьXmlProformaInvoiceSellerContent(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = КонтентФормализованногоСчета(СсылкаНаДокумент, ДополнительныеПараметры);
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать функцию КонтентНакладной172()
//
// Параметры:
//  СсылкаНаДокумент			 - ДокументСсылка - Источник данных для сбора контента;
//  ПараметрыСогласования		 - Структура - дополнительные параметры;
//  НомерЗаказа					 - Строка - номер заказа;
//  ДопСведения					 - Строка - имена и значения дополнительных полей;
//  НеИспользуется_ФИОПодписанта - Строка - фамилия, имя и отчество подписанта;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьXmlTorg12Content(СсылкаНаДокумент, ПараметрыСогласования = Неопределено
								, НомерЗаказа = Неопределено
								, ДопСведения = Неопределено
								, НеИспользуется_ФИОПодписанта = Неопределено) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	ПараметрыФормирования.ПараметрыСогласования = ПараметрыСогласования;
	ПараметрыФормирования.ДополнительныеСведенияСтрокой = ДопСведения;
	
	Результат = КонтентНакладной172(СсылкаНаДокумент, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать функцию КонтентАкта172()
//
// Параметры:
//  СсылкаНаДокумент			 - ДокументСсылка - Источник данных для сбора контента;
//  ПараметрыСогласования		 - Структура - дополнительные параметры;
//  ДопСведения					 - Строка - имена и значения дополнительных полей;
//  НеИспользуется_ФИОПодписанта - Строка - фамилия, имя и отчество подписанта;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьXmlAcceptanceCertificateContent(СсылкаНаДокумент, ПараметрыСогласования = Неопределено
				, ДопСведения = Неопределено
				, НеИспользуется_ФИОПодписанта = Неопределено) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	ПараметрыФормирования.ПараметрыСогласования = ПараметрыСогласования;
	ПараметрыФормирования.ДополнительныеСведенияСтрокой = ДопСведения;
	
	Результат = КонтентАкта172(СсылкаНаДокумент, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать функцию КонтентСчетаФактуры93()
//
// Параметры:
//  СсылкаНаДокумент		 - ДокументСсылка - Источник данных для сбора контента;
//  ПараметрыСогласования	 - Структура - дополнительные параметры;
//  ДопСведения				 - Строка - имена и значения дополнительных полей;
//  ФИОПодписанта			 - Строка - фамилия, имя и отчество подписанта;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьInvoiceContent(СсылкаНаДокумент, ПараметрыСогласования = Неопределено
								, ДопСведения = Неопределено
								, ФИОПодписанта = Неопределено) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	ПараметрыФормирования.ПараметрыСогласования = ПараметрыСогласования;
	ПараметрыФормирования.ДополнительныеСведенияСтрокой = ДопСведения;
	ПараметрыФормирования.ФИОПодписанта = ФИОПодписанта;
	
	Результат = КонтентСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать функцию КонтентКорректировочногоСчетаФактуры93()
//
// Параметры:
//  СсылкаНаДокумент		 - ДокументСсылка - Источник данных для сбора контента;
//  ПараметрыСогласования	 - Структура - дополнительные параметры;
//  ДопСведения				 - Строка - имена и значения дополнительных полей;
//  ФИОПодписанта			 - Строка - фамилия, имя и отчество подписанта;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьInvoiceCorrectionContent(СсылкаНаДокумент, ПараметрыСогласования = Неопределено
										, ДопСведения = Неопределено
										, ФИОПодписанта = Неопределено) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	ПараметрыФормирования.ПараметрыСогласования = ПараметрыСогласования;
	ПараметрыФормирования.ДополнительныеСведенияСтрокой = ДопСведения;
	ПараметрыФормирования.ФИОПодписанта = ФИОПодписанта;
	
	Результат = КонтентКорректировочногоСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область МашиночитаемыеДоверенности

Функция МЧД_ИмяСправочникаВИнформационнойБазе() Экспорт
	
	Перем Результат;
	
	СтандартнаяОбработка = Истина;
	
	Результат = МЧД_ИмяСправочникаВИнформационнойБазеПереопределяемый(СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		//TODO git-1486: возможно стоит перенести все в переопределяемый метод и сделать проверку на версию конфигурации
		ИмяСправочника = "МашиночитаемыеДоверенностиФНС";
		
		Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено Тогда
			Результат = ИмяСправочника;	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенностиИнформационнойБазы(Ссылка) Экспорт
	
	Перем Результат;
	
	Если Не МЧД_ЕстьСправочникМашиночитаемыхДоверенностей() Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	
	Результат = МЧД_ДанныеДоверенностиИнформационнойБазыПереопределеяемый(Ссылка, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		Результат = МЧД_ДанныеДоверенности(Ссылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ИмяСправочникаВИнформационнойБазеПереопределяемый(СтандартнаяОбработка)
	
	Перем Результат;
	
	МетодСервера(ИмяМодуляИнтеграции(), "МЧД_ИмяСправочникаВИнформационнойБазе", СтандартнаяОбработка);
		
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенностиИнформационнойБазыПереопределеяемый(СсылкаНаДоверенность, СтандартнаяОбработка)
	
	Перем Результат;
	
	МетодСервера(ИмяМодуляИнтеграции(), "МЧД_ДанныеДоверенности", СсылкаНаДоверенность, СтандартнаяОбработка);
		
	Возврат Результат;
	
КонецФункции

Функция МЧД_ЕстьСправочникМашиночитаемыхДоверенностей() Экспорт

	// TODO git-1486: вынести проверку в интеграционники
	Результат = (Метаданные.Справочники.Найти("МашиночитаемыеДоверенностиФНС") <> Неопределено); 
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенности(СсылкаНаДоверенность)
	
	// TODO git-1486: дополнить данными
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МЧД.Наименование КАК Наименование,
	|	МЧД.НомерДоверенности КАК НомерДоверенности,
	|	МЧД.ДатаВыдачи КАК ДатаВыдачи,
	|	МЧД.ДатаОкончания КАК ДатаОкончания,
	|	МЧД.СрокДействия КАК СрокДействия,
	|	МЧД.Организация КАК Организация,
	|	МЧД.ДоверительЮЛ_НаимОрг КАК ДоверительНаименование,
	|	МЧД.ДоверительЮЛ_ИНН КАК ДоверительИНН,
	|	МЧД.ДоверительЮЛ_КПП КАК ДоверительКПП,
	|	МЧД.ДоверительЮЛ_ОГРН КАК ДоверительОГРН,
	|	МЧД.Представитель КАК Представитель,
	|	ВЫБОР
	|		КОГДА МЧД.Представитель ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(МЧД.Представитель КАК Справочник.ФизическиеЛица).ФИО
	|		ИНАЧЕ МЧД.ПредставительЮЛ_НаимОрг
	|	КОНЕЦ КАК ПредставительНаименование,
	|	ВЫБОР
	|		КОГДА МЧД.Представитель ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА МЧД.ПредставительФЛ_ИНН
	|		ИНАЧЕ МЧД.ПредставительЮЛ_ИНН
	|	КОНЕЦ КАК ПредставительИНН,
	|	ВЫБОР
	|		КОГДА МЧД.Представитель ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА """"
	|		ИНАЧЕ МЧД.ПредставительЮЛ_КПП
	|	КОНЕЦ КАК ПредставительКПП,
	|	ВЫБОР
	|		КОГДА МЧД.Представитель ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА """"
	|		ИНАЧЕ МЧД.ПредставительЮЛ_ОГРН
	|	КОНЕЦ КАК ПредставительОГРН,
	|	ВЫБОР
	|		КОГДА МЧД.Представитель ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА МЧД.ПредставительФЛ_СНИЛС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставительСНИЛС,
	|	МЧД.Статус КАК Статус
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиФНС КАК МЧД
	|ГДЕ
	|	МЧД.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДоверенность);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		// TODO git-1486: возможно, стоит перенести в отдельный метод создания контракта
		Результат = Новый Структура;
		Результат.Вставить("Идентификатор", Выборка.НомерДоверенности);
		Результат.Вставить("СрокДействия", Выборка.СрокДействия);
		
		Результат.Вставить("Доверитель", Новый Структура);
		Результат.Доверитель.Вставить("Наименование", Выборка.ДоверительНаименование);
		Результат.Доверитель.Вставить("ИНН"			, Выборка.ДоверительИНН);
		Результат.Доверитель.Вставить("КПП"			, Выборка.ДоверительКПП);
		Результат.Доверитель.Вставить("ОГРН"		, Выборка.ДоверительОГРН);
		
		Результат.Вставить("Представитель", Новый Структура);
		Результат.Представитель.Вставить("Наименование"	, Выборка.ПредставительНаименование);		
		Результат.Представитель.Вставить("ИНН"			, Выборка.ПредставительИНН);
		Результат.Представитель.Вставить("КПП"			, Выборка.ПредставительКПП);
		Результат.Представитель.Вставить("СНИЛС"		, Выборка.ПредставительСНИЛС);
		Результат.Представитель.Вставить("ОГРН"			, Выборка.ПредставительОГРН);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает таблицу видов документов, доступных для отправки по ЭДО.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию НоваяТаблицаВидовДокументовДляОбмена;
//
Функция ВидыИсходящихДокументов() Экспорт
	
	ВидыДокументов = НоваяТаблицаВидовДокументовДляОбмена();
	
	ПриПолученииВидовИсходящихДокументов(ВидыДокументов);
	
	Возврат ВидыДокументов;
	
КонецФункции

// Возвращает таблицу видов документов, доступных для приема по ЭДО.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию НоваяТаблицаВидовДокументовДляОбмена;
//
Функция ВидыВходящихДокументов() Экспорт
	
	ВидыДокументов = НоваяТаблицаВидовДокументовДляОбмена();
	
	ПриПолученииВидовВходящихДокументов(ВидыДокументов);
	
	Возврат ВидыДокументов;
	
КонецФункции

// Возвращает список метаданных с правилами сопоставления реквизитов, 
// в которые можно загрузить электронный документ.
//
// Параметры:
//  ВидЭД - Строка - см. функцию ВидыЭлектронныхДокументов;
// 
// Возвращаемое значение:
//  Соответствие - в качестве ключа используется объект метаданных, в который можно конвертировать ЭД,
//                 в качестве значения передается структура с правилами конвертации свойств (см. НовоеПравилоКонвертацииСвойствЭД).
//
Функция ПравилаЗагрузкиПоВидуЭД(ВидЭД) Экспорт
	
	Результат = Новый Соответствие;
	
	ВсеПравила = ВидыВходящихДокументов();
	
	ПараметрыОтбора	 = Новый Структура("ВидЭД", ВидЭД);
	НайденныеПравила = ВсеПравила.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого Правило Из НайденныеПравила Цикл 
		Результат.Вставить(Правило.ОбъектМетаданных, Правило.ПравилоКонвертацииСвойств);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Список видов электронных документов.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ВидыЭлектронныхДокументов() Экспорт
	
	ВозможныеЗначения = Новый Массив;
	ВозможныеЗначения.Добавить("ТоварнаяНакладная");
	ВозможныеЗначения.Добавить("АктОбОказанииУслуг");
	ВозможныеЗначения.Добавить("СчетФактура");
	ВозможныеЗначения.Добавить("СоглашениеОбИзмененииСтоимости");
	ВозможныеЗначения.Добавить("КорректировочныйСчетФактура");
	ВозможныеЗначения.Добавить("СчетНаОплату");
	ВозможныеЗначения.Добавить("АктСверки");
	ВозможныеЗначения.Добавить("Произвольный");
	ВозможныеЗначения.Добавить("ДокументОРасхождениях");
	
	Возврат НовоеПрограммноеПеречисление(ВозможныеЗначения);
	
КонецФункции

// Описывает значения псевдоперечисления ЮрФизЛицо.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция ТипыЮрФизЛиц() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ЮридическоеЛицо", 		"ЮридическоеЛицо");
	Результат.Вставить("ФизическоеЛицо", 		"ФизическоеЛицо");
	Результат.Вставить("ИндивидуальныйПредприниматель", "ИндивидуальныйПредприниматель");
	Результат.Вставить("ИностраннаяКомпания",	"ИностраннаяКомпания");
	
	Возврат Результат;
	
КонецФункции

// Дополняет таблицу видов документов для обмена.
//
// Параметры:
//  ВидыДокументов	 - ТаблицаЗначений	 - см. функцию ВидыИсходящихДокументов;
//  ОбъектМетаданных - ОбъектМетаданных	 - метаданные объекта учета;
//  ВидЭД			 - Строка			 - вид электронного документа (см. ВидыЭлектронныхДокументов);
//  Ограничения		 - Неопределено		 - // TODO: Дописать позже. Пока видится, что это будет структура отборов;
//  ПравилоКонвертацииСвойств - Структура - см. функцию НовоеПравилоКонвертацииСвойствЭД;
//
// Пример:
//  Модуль_ИнтеграцияУниверсальный.ДобавитьВидДокументаДляОбмена(ВидыДокументов
//  	, Метаданные.Документы.СчетФактураВыданный
//  	, ВидыЭлектронныхДокументов().СчетФактура);
//
Процедура ДобавитьВидДокументаДляОбмена(ВидыДокументов, ОбъектМетаданных, ВидЭД, Ограничения = Неопределено, ПравилоКонвертацииСвойств = Неопределено) Экспорт
	
	ПКС = НовоеПравилоКонвертацииСвойствЭД();
	Если ЗначениеЗаполнено(ПравилоКонвертацииСвойств) Тогда 
		ЗаполнитьЗначенияСвойств(ПКС, ПравилоКонвертацииСвойств);
	КонецЕсли;
	
	НоваяСтрока = ВидыДокументов.Добавить();
	НоваяСтрока.ОбъектМетаданных = ОбъектМетаданных;
	НоваяСтрока.ВидЭД = ВидЭД;
	НоваяСтрока.Ограничения = Ограничения;
	НоваяСтрока.ПравилоКонвертацииСвойств = ПКС;
	
КонецПроцедуры

// Инициализирует правило конвертации свойств электронного документа в реквизиты учетного документа.
// Ключ структуры - имя поля электронного документа, значение - имя реквизита прикладного документа.
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//     * Организация - Строка - имя реквизита, содержащего ссылку на организацию (по умолчанию - "Организация");
//     * Контрагент	 - Строка - имя реквизита, содержащего ссылку на контрагента (по умолчанию - "Контрагент");
//     * Номер		 - Строка - имя реквизита, содержащего номер входящего документа (по умолчанию - "НомерВходящегоДокумента");
//     * Дата		 - Дата	  - имя реквизита, содержащего дату входящего документа (по умолчанию - "ДатаВходящегоДокумента");
//
Функция НовоеПравилоКонвертацииСвойствЭД() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация", "Организация");
	Результат.Вставить("Контрагент"	, "Контрагент");
	Результат.Вставить("Номер"		, "НомерВходящегоДокумента");
	Результат.Вставить("Дата"		, "ДатаВходящегоДокумента");
	
	Возврат Результат;
	
КонецФункции

// Добавляет новую запись в таблицу правил обработки электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - см. ПравилаОбработкиВходящихДокументов;
//  ИдентификаторПравила - Строка - идентификатор правила обработки документов;
//  ВидДокумента		 - Строка - вид документа, к которому относится правило (см. ВидыЭлектронныхДокументов);
//  ДляИсправлений		 - Булево, Неопределено - Ложь, если правило действует только для первичной версии документа;
//                                            Истина, если правило действует для только для исправленной версии документа;
//                                            Неопределено, если правило действует только для первичной и исправительной версий документа;
//
Процедура ДобавитьПравилоОбработкиДокументов(ПравилаОбработки, ИдентификаторПравила, ВидДокумента, ДляИсправлений) Экспорт
	
	ЗначенияФлага = Новый Массив;
	
	Если ДляИсправлений = Неопределено Тогда
		ЗначенияФлага.Добавить(Ложь);
		ЗначенияФлага.Добавить(Истина);
	Иначе
		ЗначенияФлага.Добавить(ДляИсправлений);
	КонецЕсли;
	
	Для Каждого ЭтоИсправление Из ЗначенияФлага Цикл
		
		НовоеПравило = ПравилаОбработки.Добавить();
		НовоеПравило.ВидДокумента = ВидДокумента;
		НовоеПравило.ЭтоИсправление = ЭтоИсправление;
		НовоеПравило.ИдентификаторПравила = ИдентификаторПравила;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоответствиеРеквизитовПолямВходящегоДокумента(ОбъектМетаданных) Экспорт
	
	ИменаПолей = Новый Структура;
	ИменаПолей.Вставить("Номер", "НомерВходящегоДокумента");
	ИменаПолей.Вставить("Дата", "ДатаВходящегоДокумента");
	ИменаПолей.Вставить("НомерИсправления", "НомерИсправления");
	ИменаПолей.Вставить("ДатаИсправления", "ДатаИсправления");
	
	ПроверятьСтандартныеРеквизиты = Истина;
	МетаданныеОбъекта = ОбъектМетаданныхПоОписанию(ОбъектМетаданных);
	ЗаполнитьСоответствиеПолейВходящегоДокумента(МетаданныеОбъекта, ИменаПолей);
	
	Результат = Новый Структура;
	
	Для Каждого Элемент Из ИменаПолей Цикл
		
		ИмяПоляЭлектронногоДокумента = Элемент.Ключ;
		ИмяПоляДокументаИБ = Элемент.Значение;
		
		Если ЗначениеЗаполнено(ИмяПоляДокументаИБ)
			И ЕстьРеквизитМетаданных(МетаданныеОбъекта, ИмяПоляДокументаИБ, ПроверятьСтандартныеРеквизиты) Тогда
			Результат.Вставить(ИмяПоляЭлектронногоДокумента, ИмяПоляДокументаИБ);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Определяет ссылку на объекта, который будет выступать в качестве константы для дополнительных сведений
//
// Возвращаемое значение:
//	ЛюбаяСсылка, Неопределено
Функция ВладелецОбщихНастроекМодуля() Экспорт
	
	Результат 				= Неопределено;
	СтандартнаяОбработка 	= Истина;
	
	Если Не МаркерКонфигурацииОпределен() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПриПолученииВладельцаОбщихНастроекМодуля(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		Результат = ВалютаРегламентированногоУчета();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает описания всех библиотек конфигурации, включая
// описание самой конфигурации.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка - имя подсистемы, например, "СтандартныеПодсистемы".
//   * Значение - Структура - описание подсистемы:
//     ** Имя - Строка - имя подсистемы.
//     ** Версия - Строка - версия подсистемы.
//     ** ЭтоКонфигурация - Булево - Истина, если данная подсистема является основной конфигурацией.
//     ** ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах интернет-поддержки.
//
Функция ОписанияПодсистемКонфигурации() Экспорт
	
	// Используем служебный интерфейс БСП, т.к. метод ОписанияПодсистем добавлен в
	// программный интерфейс модуля ОбщегоНазначения только в версии БСП 3.0.2 и выше
	Результат = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
	Возврат Результат;
	
КонецФункции

#Область СопоставлениеНоменклатуры

Функция МетаданныеСопоставленияНоменклатуры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВладелецНоменклатурыТип");
	Результат.Вставить("ВладелецНоменклатурыПредставлениеОбъекта");
	
	Результат.Вставить("НоменклатураТип");
	Результат.Вставить("НоменклатураПредставлениеОбъекта");
	
	Результат.Вставить("ХарактеристикаТип");
	Результат.Вставить("ХарактеристикаПредставлениеОбъекта");
	
	Результат.Вставить("УпаковкаТип");
	Результат.Вставить("УпаковкаПредставлениеОбъекта");
	
	Результат.Вставить("ИмяПараметраСвязиХарактеристики", "Отбор.Владелец");
	Результат.Вставить("ИмяПараметраСвязиУпаковки", "Отбор.Владелец");
	
	СтандартнаяОбработка = Истина;
	ЗаполнитьМетаданныеСопоставленияНоменклатурыКонфигурация(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ЗаполнитьМетаданныеСопоставленияНоменклатурыБЭД(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает номенклатуру информационной базы, соответствующую идентификаторам номенклатуры контрагента.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип.ВладелецНоменклатурыБЭД - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Строка, Массив из Строка - идентификаторы номенклатуры контрагента.
// 
// Возвращаемое значение:
//  Соответствие - содержит:
//    * Ключ - Строка - идентификатор номенклатуры контрагента.
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ВладелецНоменклатуры, ИдентификаторыНоменклатуры) Экспорт
	
	Результат = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(ИдентификаторыНоменклатуры) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ИдентификаторыНоменклатуры) = Тип("Массив") Тогда
		КоллекцияИдентификаторов = ИдентификаторыНоменклатуры;
	Иначе
		КоллекцияИдентификаторов = Новый Массив;
		КоллекцияИдентификаторов.Добавить(ИдентификаторыНоменклатуры);
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	ПрочитатьСоответствиеНоменклатурыПереопределяемый(Результат, ВладелецНоменклатуры, КоллекцияИдентификаторов, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ПрочитатьСоответствиеНоменклатурыБЭД(Результат, ВладелецНоменклатуры, КоллекцияИдентификаторов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Записывает соответствие номенклатуры информационной базы с номенклатурой поставщика.
//
// Параметры:
//  НоменклатураКонтрагента	 - Структура - сведения о номенклатуре контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ			 - Структура - сведения о номенклатуре информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//
Процедура ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	ЗаполнитьИдентификаторНоменклатурыКонтрагента(НоменклатураКонтрагента); // Для вызова из ФормаВводаНакладной
	
	СтандартнаяОбработка = Истина;
	ЗаписатьСоответствиеНоменклатурыПереопределяемый(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ЗаписатьСоответствиеНоменклатурыБЭД(НоменклатураКонтрагента, НоменклатураИБ);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает свойства набора номенклатур информационной базы.
// Определяет обязательность использования характеристики и упаковки.
//
// Параметры:
//  СсылкаИлиМассив - Массив из ОпределяемыйТип.НоменклатураБЭД, ОпределяемыйТип.НоменклатураБЭД
//    - ссылки на номенклатуру ИБ, для которой требуется определить свойства. Если передается ссылка, преобразуется в массив.
//
// Возвращаемое значение:
// Соответствие, Неопределено - в случае незаполненного набора номенклатуры возвращается Неопределено. Соответствие содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//
Функция СвойстваНоменклатурыИнформационнойБазы(Знач СсылкаИлиМассив) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаИлиМассив) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваНоменклатурИБ = Новый Соответствие;
	
	Если ТипЗнч(СсылкаИлиМассив) <> Тип("Массив") Тогда
		НаборНоменклатуры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаИлиМассив);
	Иначе
		НаборНоменклатуры = СсылкаИлиМассив;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаборНоменклатуры) Тогда
		ПриОпределенииСвойствНоменклатурыИнформационнойБазы(НаборНоменклатуры, СвойстваНоменклатурИБ);
	КонецЕсли;
	
	Возврат СвойстваНоменклатурИБ;
	
КонецФункции

// Возвращает структуру свойств номенклатуры ИБ.
//
// Возвращаемое значение:
//  Структура - свойства номенклатуры информационной базы:
//   * ИспользоватьХарактеристики           - Булево - признак использования характеристик. По умолчанию Ложь.
//   * ИспользоватьУпаковки                 - Булево - признак использования упаковок. По умолчанию Ложь.
//   * ОбязательноеЗаполнениеХарактеристики - Булево - признак обязательного заполнения характеристик при их использовании. По умолчанию Истина.
//
Функция НовыеСвойстваНоменклатурыИБ() Экспорт
	
	СвойствоНоменклатуры = Новый Структура;
	СвойствоНоменклатуры.Вставить("ИспользоватьХарактеристики"          , Ложь);
	СвойствоНоменклатуры.Вставить("ИспользоватьУпаковки"                , Ложь);
	СвойствоНоменклатуры.Вставить("ОбязательноеЗаполнениеХарактеристики", Истина);
	
	Возврат СвойствоНоменклатуры;
	
КонецФункции

// Возвращает набор данных, представляющий номенклатуру контрагента.
//
// Параметры:
//  Владелец      - ОпределяемыйТип.ВладелецНоменклатурыБЭД - значение для инициализации выходного свойства Владелец.
//  Идентификатор - Строка                                  - значение для инициализации выходного свойства Идентификатор.
//
// Возвращаемое значение:
//  Структура - данные, представляющие номенклатуру контрагента:
//   * Владелец				 - ОпределяемыйТип.ВладелецНоменклатурыБЭД, Неопределено - владелец номенклатуры. Неопределено, если не инициализировано.
//   * Идентификатор		 - Строка - идентификатор записи по комбинации: номенклатура#характеристика#упаковка.
//   * Наименование			 - Строка - наименование номенклатуры.
//   * Характеристика		 - Строка - наименование характеристики номенклатуры.
//   * ЕдиницаИзмерения		 - Строка - единица измерения номенклатуры.
//   * ЕдиницаИзмеренияКод	 - Строка - код единицы измерения номенклатуры.
//   * Код					 - Строка - код номенклатуры.
//   * Артикул				 - Строка - артикул номенклатуры.
//   * Сорт					 - Строка - сорт номенклатуры.
//   * Описание				 - Строка - описание работы, услуги.
//   * СтавкаНДС			 - Строка - ставка НДС номенклатуры.
//   * Штрихкод				 - Строка - штрихкоды номенклатуры через запятую.
//
Функция НоваяНоменклатураКонтрагента(Знач Владелец = Неопределено, Знач Идентификатор = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Владелец", Владелец);
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("Код");
	Результат.Вставить("Артикул");
	Результат.Вставить("Сорт");
	Результат.Вставить("Наименование");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Описание");
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("ЕдиницаИзмеренияКод");
	Результат.Вставить("Штрихкод", "");
	Результат.Вставить("ШтрихкодыНоменклатуры", "");
	Результат.Вставить("GTIN", "");
	Результат.Вставить("Тип", "");
	
	Возврат Результат;
	
КонецФункции

// Возвращает набор данных, представляющий номенклатуру информационной базы.
//
// Параметры:
//  Номенклатура   - ОпределяемыйТип.НоменклатураБЭД               - значение для инициализации выходного свойства Номенклатура.
//  Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - значение для инициализации выходного свойства Характеристика.
//  Упаковка       - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - значение для инициализации выходного свойства Упаковка.
//
// Возвращаемое значение:
//  Структура - данные, представляющие номенклатуру информационной базы:
//   * Номенклатура   - ОпределяемыйТип.НоменклатураБЭД, Неопределено               - номенклатура ИБ. Неопределено, если не инициализировано.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД, Неопределено - характеристика номенклатуры ИБ. Неопределено, если не инициализировано.
//   * Упаковка       - ОпределяемыйТип.УпаковкаНоменклатурыБЭД, Неопределено       - упаковка номенклатуры информационной базы. Неопределено, если не инициализировано.
//
Функция НоваяНоменклатураИнформационнойБазы(Номенклатура = Неопределено, Характеристика = Неопределено, Упаковка = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура"	, Номенклатура);
	Результат.Вставить("Характеристика"	, Характеристика);
	Результат.Вставить("Упаковка"		, Упаковка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает сведения для передачи в помощник сопоставления номенклатуры
// (форма "ФормаГрупповоеСопоставлениеНоменклатуры")
//
// Параметры:
//  ДанныеЭД - Структура - см. НовыйДанныеЭлектронногоДокумента.
// 
// Возвращаемое значение:
//  Массив из Структура - сведения номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//
Функция НоменклатураЭлектронногоДокумента(ДанныеЭД, ТолькоНесопоставленная = Ложь) Экспорт
	
	Контрагент = ДанныеЭД.Шапка.Продавец.Ссылка;
	ВладелецНоменклатуры = ПартнерПоКонтрагенту(Контрагент);
	
	Результат = Новый Массив;
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоменклатураИБ = Стр.Номенклатура;
		
		Если ЗначениеЗаполнено(НоменклатураИБ.Номенклатура)
			И ТолькоНесопоставленная Тогда
			Продолжить;
		КонецЕсли;
		
		НоменклатураКонтрагента = Стр.НоменклатураКонтрагента;
		
		ЗаполнитьИдентификаторНоменклатурыКонтрагента(НоменклатураКонтрагента);
		Если Не ЗначениеЗаполнено(НоменклатураКонтрагента.Владелец) Тогда
			НоменклатураКонтрагента.Владелец = ВладелецНоменклатуры;
		КонецЕсли;
		
		Результат.Добавить(НоменклатураКонтрагента);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает сведения о номенклатуре информационной базы, сопоставленной
// с идентификатором номенклатуры контрагента.
//
// Параметры:
//  Владелец      - ОпределяемыйТип.ВладелецНоменклатурыБЭД - владелец номенклатуры контрагента.
//  Идентификатор - Строка                                  - идентификатор номенклатуры контрагента.
// 
// Возвращаемое значение:
//  Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  Неопределено - если номенклатура не сопоставлена
//
Функция НоменклатураИнформационнойБазыПоИдентификатору(Владелец, Идентификатор) Экспорт
	
	СопоставленнаяНоменклатура = ПрочитатьСопоставлениеНоменклатуры(Владелец, Идентификатор);
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(СопоставленнаяНоменклатура) Тогда
		Результат = СопоставленнаяНоменклатура.Получить(Идентификатор);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НайтиНоменклатуруИнформационнойБазы(НоменклатураИБ, НоменклатураКонтрагента) Экспорт
	
	ЗаполнитьИдентификаторНоменклатурыКонтрагента(НоменклатураКонтрагента);
	
	ВладелецНоменклатуры = НоменклатураКонтрагента.Владелец;
	ИдентификаторНоменклатуры = НоменклатураКонтрагента.Идентификатор;
	
	НоменклатураИБ = НоменклатураИнформационнойБазыПоИдентификатору(ВладелецНоменклатуры, ИдентификаторНоменклатуры);
	
	Если Не ЗначениеЗаполнено(НоменклатураИБ) Тогда
		НоменклатураИБ = НоваяНоменклатураИнформационнойБазы();
	КонецЕсли;
	
КонецПроцедуры

// Подбирает недостающие данные о номенклатуре информационной базы по уже имеющимся,
// а также номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//
Процедура ПодобратьНоменклатуруИнформационнойБазы(Знач НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	Если Не ЗначениеЗаполнено(НоменклатураИБ.Номенклатура) Тогда
		НоменклатураИБ.Характеристика = Неопределено;
		НоменклатураИБ.Упаковка = Неопределено;
		Возврат;
	КонецЕсли;
	
	МодульИнтеграции_ПриПодбореНоменклатурыИнформационнойБазы(НоменклатураКонтрагента, НоменклатураИБ);
	
КонецПроцедуры

// Ищет варианты сопоставления номенклатуры по номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - см. Контракт_НоменклатураКонтрагента
// 
// Возвращаемое значение:
//  Массив из Контракт_НоменклатураКонтрагента
//
Функция ВариантыСопоставленияНоменклатуры(НоменклатураКонтрагента) Экспорт
	
	Результат = Новый Массив;
	
	СтандартнаяОбработка = Истина;
	
	Результат = Новый Массив;
	
	МетодСервера(ИмяМодуляИнтеграции(), 
		"ПриЗаполненииВариантовСопоставленияНоменклатуры",
		Результат, 
		НоменклатураКонтрагента,
		СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		ЗаполнитьВариантыСопоставленияНоменклатурыПоУмолчанию(
			Результат,
			НоменклатураКонтрагента
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента 
//
Процедура ЗаполнитьВариантыСопоставленияНоменклатурыПоУмолчанию(Результат, НоменклатураКонтрагента) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ИменаВТ = Новый Массив;
	
	ДобавитьЗапросПоАртикулу(МенеджерВТ, ИменаВТ, НоменклатураКонтрагента.Артикул);
	ДобавитьЗапросПоАртикулу(МенеджерВТ, ИменаВТ, НоменклатураКонтрагента.Код);
	ДобавитьЗапросПоНаименованию(МенеджерВТ, ИменаВТ, НоменклатураКонтрагента.Наименование);
	
	Если НЕ ЗначениеЗаполнено(ИменаВТ) Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗапросов = Новый Массив;
	Для Каждого ИмяВТ Из ИменаВТ Цикл
		МассивЗапросов.Добавить("ВЫБРАТЬ * ИЗ " + ИмяВТ);
	КонецЦикла;
	Разделитель = " ОБЪЕДИНИТЬ ";
	
	ИтоговыйТекст = СтрСоединить(МассивЗапросов, Разделитель);
	
	Запрос = Новый Запрос(ИтоговыйТекст);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоменклатураИБ = НоваяНоменклатураИнформационнойБазы(ВыборкаДетальныеЗаписи.НоменклатураСсылка);
		
		Результат.Добавить(НоменклатураИБ);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавить запрос по артикулу
//
// Параметры:
//  МенеджерВТ	 - МенеджерВременныхТаблиц - менеджер временных таблиц запроса на варианты сопоставления номенклатуры 
//  ИменаВТ		 - Массив - Массив имен временных таблиц
//  Артикул		 - Строка - Искомый артикул
//
Процедура ДобавитьЗапросПоАртикулу(МенеджерВТ, ИменаВТ, Артикул)
	
	Если Не ЗначениеЗаполнено(Артикул) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВТ = "ВТ_ПоАртикулу" + XMLСтрока(ИменаВТ.Количество());
	
	Текст = 
	"ВЫБРАТЬ
	|  Т.Ссылка КАК НоменклатураСсылка
	|ПОМЕСТИТЬ ИмяВТ
	|ИЗ
	|  Справочник.Номенклатура КАК Т
	|ГДЕ
	|  Т.Артикул = &Артикул
	|  И НЕ Т.ЭтоГруппа
	|  И НЕ Т.ПометкаУдаления";
	
	Запрос = Новый Запрос(Текст);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяВТ", ИмяВТ);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Параметры.Вставить("Артикул", Артикул); 
	
	Запрос.Выполнить();
	
	ИменаВТ.Добавить(ИмяВТ);
	
КонецПроцедуры

// Добавить запрос по наименованию
//
// Параметры:
//  МенеджерВТ	 - МенеджерВременныхТаблиц - менеджер временных таблиц запроса на варианты сопоставления номенклатуры 
//  ИменаВТ		 - Массив - Массив имен временных таблиц
//  Наименование - Строка - Искомое наименование
//
Процедура ДобавитьЗапросПоНаименованию(МенеджерВТ, ИменаВТ, Наименование)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВТ = "ВТ_ПоНаименованию" + XMLСтрока(ИменаВТ.Количество());
	
	Текст =
		"ВЫБРАТЬ
		|  Т.Ссылка КАК НоменклатураСсылка
		|ПОМЕСТИТЬ ИмяВТ
		|ИЗ
		|  Справочник.Номенклатура КАК Т
		|ГДЕ
		|  Т.Наименование = ВЫРАЗИТЬ(&Наименование КАК Строка(1024))
		|  И НЕ Т.ЭтоГруппа
		|  И НЕ Т.ПометкаУдаления";
	
	Запрос = Новый Запрос(Текст);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяВТ", ИмяВТ);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Параметры.Вставить("Наименование", Наименование);
	
	Запрос.Выполнить();
	
	ИменаВТ.Добавить(ИмяВТ);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКонтента

// Заполняет коллекцию DocumentShipments в протоструктуре формата 820@.
// В случае, если электронный документ содержит функцию документа о передаче, в коллекцию
// добавляется один элемент с реквизитами самого УПД. В остальных случаях коллекция
// заполняется реквизитами каждого документа-основания.
//
// Параметры:
//  Контент820 - Структура - см. Новый_Utd820SellerContent.
//  ДокументыОснования - Массив, Неопределено - документы информационной базы, которыми отражена фактическая отгрузка.
//
Процедура ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку820(Контент820, ДокументыОснования) Экспорт
	
	ДокПодтвОтгр = Контент820.DocumentShipments;
	ФункцияДокумента = Контент820.Function;
	СтрокиТаблицы = Контент820.Table.Items;
	
	НаименованиеДокумента = НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОснования, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияПрото_Invoice() Тогда
		
		СтандартнаяОбработка = Истина;
		
		ПриПолученииДанныхДокументовОбОтгрузке(ДокПодтвОтгр, Контент820.СлужебнаяИнформация.Ссылка, СтандартнаяОбработка);
					
		Если СтандартнаяОбработка Тогда
			
			Если Не ЗначениеЗаполнено(ДокументыОснования) Тогда
				Возврат;
			КонецЕсли;
			
			Для Каждого Основание Из ДокументыОснования Цикл
				
				ОписаниеДокумента = ОписаниеПрикладногоДокумента(Основание);
				ДатаНомер = ДатаНомерДокумента(ОписаниеДокумента, "");
				
				ОбъектМетаданных = Основание.Метаданные();
				
				РеквизитыДокумента = Новый_DocumentShipment();
				РеквизитыДокумента.Name = НаименованиеДокумента;
				РеквизитыДокумента.Number = ДатаНомер.НомерДокумента;
				РеквизитыДокумента.Date = ДатаНомер.ДатаДокумента;
				
				ДокПодтвОтгр.Добавить(РеквизитыДокумента);
											 
			КонецЦикла;
			
		КонецЕсли;
	
	Иначе
		
		ДокументыОснования = Новый Массив;
		
		РеквизитыДокумента = Новый_DocumentShipment();
		РеквизитыДокумента.Name = НаименованиеДокумента;
		РеквизитыДокумента.Number = Контент820.DocumentNumber;
		РеквизитыДокумента.Date = Контент820.DocumentDate;
		
		ДокПодтвОтгр.Добавить(РеквизитыДокумента);

	КонецЕсли;
	
КонецПроцедуры

Функция НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияПрото_InvoiceAndBasic() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

Функция ВДокументеЕстьТовары(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВДокументеЕстьУслуги(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ItemMarks()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Имущество", "Property");
	Результат.Вставить("Работа", "Job");
	Результат.Вставить("Услуга", "Service");
	Результат.Вставить("ИмущественныеПрава", "PropertyRights");
	Результат.Вставить("Иное", "Other");
	
	Возврат Результат;
	
КонецФункции

// Заполняет в табличной части протоконтента сведения о маркировке.
// @СлужебныйПрограммныйИнтерфейс
//
// Параметры:
//  Контент - Структура - Протоконтент в формате приказа 820@.
//  СсылкаНаДокумент - ЛюбаяСсылка - Ссылка основание электронного документа.
//  ИспользоватьКонтурМаркировку - Булево - Истина, если получать сведения о маркировке
//                                          нужно с помощью подсистемы "Контур.Маркировка"
//
Процедура ЗаполнитьСведенияОМаркировке820(Контент, СсылкаНаОбъект, ИспользоватьКонтурМаркировку = Ложь) Экспорт
	
	Если ИспользоватьКонтурМаркировку Тогда
		
		ЗаполнитьСведенияОМаркировке820_КонтурМаркировка(Контент, СсылкаНаОбъект);
		
	ИначеЕсли ИспользоватьИнтеграционныйМодульДляЗаполненияСведенийОМаркировке() Тогда
		
		ЗаполнитьСведенияОМаркировке820_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект);
		
	Иначе
		
		ЗаполнитьСведенияОМаркировке820_ИСМП(Контент, СсылкаНаОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировке736(Контент, СсылкаНаОбъект, ИспользоватьКонтурМаркировку = Ложь) Экспорт
	
	ИсходныйДокумент = Неопределено;
	ПередаточныеДокументы = Неопределено;
	ИсправляемыеДокументы = Неопределено;
	
	Если Контент.СлужебнаяИнформация.Свойство("ИсправляемыеДокументы", ИсправляемыеДокументы)
		И ЗначениеЗаполнено(ИсправляемыеДокументы) Тогда
		ИсходныйДокумент = ИсправляемыеДокументы[0];
	ИначеЕсли Контент.СлужебнаяИнформация.Свойство("ПередаточныеДокументы", ПередаточныеДокументы)
		И ЗначениеЗаполнено(ПередаточныеДокументы) Тогда 
		ИсходныйДокумент = ПередаточныеДокументы[0];
	КонецЕсли;
	
	Если ИспользоватьКонтурМаркировку Тогда
		
		ЗаполнитьСведенияОМаркировке736_КонтурМаркировка(Контент, СсылкаНаОбъект, ИсходныйДокумент);
		
	ИначеЕсли ИспользоватьИнтеграционныйМодульДляЗаполненияСведенийОМаркировке() Тогда
		
		ЗаполнитьСведенияОМаркировке736_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект, ИсходныйДокумент);
		
	Иначе
		
		ЗаполнитьСведенияОМаркировке736_ИСМП(Контент, СсылкаНаОбъект, ИсходныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры


Функция ОписаниеТиповЗначения(Значение)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(Значение));
	
	Результат = Новый ОписаниеТипов(МассивТипов);
	
	Возврат Результат;
	
КонецФункции

// Поддержано только часть сценария оформления УКД на основании возврата: документ реализации -> возврат товара.
// Не поддержан сценарий, при котором в цепочке документа присутсвуют корректрировки реализациим или несколько возвратов.
// требуется инверсия заполнения, т.к. в ТЧ Возврата тот товар, которого в коллекции "После" не должно быть
Процедура ЗаполнитьКодыМаркировкиДляВозвратаОтКлиента(СтрокаТЧ, ДанныеШтрихкодовУпаковок, ДанныеШтрихкодовУпаковокДоИзменения)
	
	ДанныеШтрихкодовУпаковокИнверсия = ДанныеШтрихкодовУпаковокДоИзменения.Скопировать();
	// колонка "ссылка" теперь указывает не на возврат, а на корректируемый документ!
	ДанныеШтрихкодовУпаковокИнверсия.ЗаполнитьЗначения(Ложь, "Обработан");
	
	ЗаполнитьДанныеШтрихкодовУпаковокИнверсией(ДанныеШтрихкодовУпаковок, ДанныеШтрихкодовУпаковокИнверсия);
	
	ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity - СтрокаТЧ.CorrectedValues.Quantity;
	
	Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
		
		// Инициализировать промежуточную структуру с коллекциями кодов маркировки
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		// Найти подходящие кодами маркировки
		ПодобратьКодыМаркировки(КодыМаркировки, ДанныеШтрихкодовУпаковокИнверсия, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
		
		// Перенести найденные коды маркировки в строку протоконтента
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКодыМаркировкиДляВозвратаОтКлиента_ИСМП10127(
	СтрокаТЧ,
	ДанныеШтрихкодовУпаковок,
	ДанныеШтрихкодовУпаковокДоИзменения)
	
	Если ВозвращаетсяКодОСУ(ДанныеШтрихкодовУпаковок) Тогда
		
		ДанныеШтрихкодовУпаковокИнверсия = ДанныеШтрихкодовУпаковокДоИзменения.Скопировать();
		// колонка "ссылка" теперь указывает не на возврат, а на корректируемый документ!
		ДанныеШтрихкодовУпаковокИнверсия.ЗаполнитьЗначения(Ложь, "Обработан");
		
		ЗаполнитьДанныеШтрихкодовУпаковокИнверсией_ИСМП10127(ДанныеШтрихкодовУпаковок, ДанныеШтрихкодовУпаковокИнверсия);
		
		ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity - СтрокаТЧ.CorrectedValues.Quantity;
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки_ИСМП10127(
				КодыМаркировки,
				ДанныеШтрихкодовУпаковокИнверсия,
				СтрокаТЧ.СлужебнаяИнформация,
				ТребуемоеКоличество
			);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
	Иначе
		
		СтрокаТЧ.OriginalItemIdentificationNumbers = Новый Массив;
		
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		ПодобратьКодыМаркировки_ИСМП10127(
			КодыМаркировки,
			ДанныеШтрихкодовУпаковок,
			СтрокаТЧ.СлужебнаяИнформация,
			СтрокаТЧ.OriginalValues.Quantity
		);
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировки);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВозвращаетсяКодОСУ(ДанныеШтрихкодовУпаковок)
	
	Результат = Ложь;
	
	Для Каждого СтрокаУпаковкиВозврата Из ДанныеШтрихкодовУпаковок Цикл
		Если СтрокаУпаковкиВозврата.ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПолныйВозвратТовара(СтрокаТЧ)

	Результат = ЗначениеЗаполнено(СтрокаТЧ.OriginalValues.Quantity)
		И Не ЗначениеЗаполнено(СтрокаТЧ.CorrectedValues.Quantity); 
		
	Возврат Результат;

КонецФункции // ()

Процедура ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект)
	
	ЭтоПервичныйДокумент = ЕстьФункцияПервичногоДокумента(Контент.Function);
	
	Если ЭтоПервичныйДокумент Тогда
		
		ВыбытиеИзОборота = ЭтоВыбытиеИзОборотаМаркируемойПродукции(СсылкаНаОбъект);
		
		Если ВыбытиеИзОборота Тогда	
			
			ИдентификаторПризнакаВыбытия = "СвВыбытияМАРК";
			ДополнитьМассивKeyValue(Контент.AdditionalInfoId.StructedAdditionalInfos, ИдентификаторПризнакаВыбытия, 1);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоВыбытиеИзОборотаМаркируемойПродукции(СсылкаНаОбъект)

	Результат = МетодСервера(ИмяМодуляИнтеграции(), "ЭтоВыбытиеИзОборотаМаркируемойПродукции", СсылкаНаОбъект);
	
	Если Результат = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеШтрихкодовУпаковокИнверсией(ДанныеШтрихкодовУпаковок, ДанныеШтрихкодовУпаковокИнверсия)
	
	Для Каждого СтрокаУпаковкиВозврата Из ДанныеШтрихкодовУпаковок Цикл
		
		КлючиПараметровОтбора = "Номенклатура, Характеристика, Серия, ЗначениеШтрихкода, ВидУпаковки, ИспользоватьХарактеристики, ИспользоватьСерии";
	
		ПараметрыОтбора = Новый Структура(КлючиПараметровОтбора);
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаУпаковкиВозврата);
	
		УдаляемыеСтроки = ДанныеШтрихкодовУпаковокИнверсия.НайтиСтроки(ПараметрыОтбора);
		
		Пока УдаляемыеСтроки.Количество() > 0 Цикл
			
			УдаляемаяСтрока = УдаляемыеСтроки.Получить(0);
							
			ДанныеШтрихкодовУпаковокИнверсия.Удалить(УдаляемаяСтрока);
			
			УдаляемыеСтроки.Удалить(0);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеШтрихкодовУпаковокИнверсией_ИСМП10127(ДанныеШтрихкодовУпаковок, ДанныеШтрихкодовУпаковокИнверсия)
	
	Для Каждого СтрокаУпаковкиВозврата Из ДанныеШтрихкодовУпаковок Цикл
		
		Если СтрокаУпаковкиВозврата.ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
			Продолжить;
		КонецЕсли;
		
		КлючиПараметровОтбора = "Номенклатура, Характеристика, Серия, ЗначениеШтрихкода, ВидУпаковки, ИспользоватьХарактеристики, ИспользоватьСерии";
	
		ПараметрыОтбора = Новый Структура(КлючиПараметровОтбора);
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаУпаковкиВозврата);
	
		УдаляемыеСтроки = ДанныеШтрихкодовУпаковокИнверсия.НайтиСтроки(ПараметрыОтбора);
		
		Пока УдаляемыеСтроки.Количество() > 0 Цикл
			
			УдаляемаяСтрока = УдаляемыеСтроки.Получить(0);
							
			ДанныеШтрихкодовУпаковокИнверсия.Удалить(УдаляемаяСтрока);
			
			УдаляемыеСтроки.Удалить(0);
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияПрослеживаемости820(Контент)
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		Если СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ПрослеживаемыйТовар", Ложь) = Истина Тогда
			
			ДанныеПрослеживаемости = СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ДанныеПрослеживаемости", Новый Массив);
			
			Если ДанныеПрослеживаемости <> Неопределено Тогда
				
				Для каждого СтрокаДанныхПрослеживаемости Из ДанныеПрослеживаемости Цикл
					
					ItemTracingInfo					 = Новый_ItemTracingInfo();
					
					ItemTracingInfo.Unit			 = СтрокаДанныхПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости;
					ItemTracingInfo.UnitName		 = СокрЛП(СтрокаДанныхПрослеживаемости.ЕдиницаИзмеренияПрослеживаемости);
					ItemTracingInfo.Quantity		 = СтрокаДанныхПрослеживаемости.КоличествоПоРНПТ;
					ItemTracingInfo.RegNumberUnit	 = СокрЛП(СтрокаДанныхПрослеживаемости.НомерГТДРегистрационныйНомер);
					
					Если ЗначениеЗаполнено(ItemTracingInfo.RegNumberUnit) Тогда
						СтрокаТЧ.ItemTracingInfos.Добавить(ItemTracingInfo);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(СтрокаТЧ.CustomDeclarations) Тогда
					
					Для каждого CustomDeclaration Из СтрокаТЧ.CustomDeclarations Цикл
						CustomDeclaration.DeclarationNumber = "Прослеж";
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет ItemTracingInfos в строках Items по данным реквизита СлужебнаяИнформация.ДанныеПрослеживаемости
//
// Параметры
//  Контент - Структура - Протоконтент в формате приказа 736@.
//
Процедура ЗаполнитьСведенияПрослеживаемости736(Контент)
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		Если СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ПрослеживаемыйТовар", Ложь) = Истина Тогда
			
			ДанныеПрослеживаемости = СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ДанныеПрослеживаемости", Новый Массив);
			
			Если ДанныеПрослеживаемости <> Неопределено Тогда
				
				ЕстьУвеличение = ЕстьДельта(СтрокаТЧ.AmountsInc);
				ЕстьУменьшение = ЕстьДельта(СтрокаТЧ.AmountsDec);
				
				Для каждого СтрокаДанныхПрослеживаемости Из ДанныеПрослеживаемости Цикл
					
					QuantityDiff = Новый_QuantityDiff();
					QuantityDiff.CorrectedQuantity	 = СтрокаДанныхПрослеживаемости.КоличествоПослеИзменения;
					QuantityDiff.OriginalQuantity	 = СтрокаДанныхПрослеживаемости.КоличествоДоИзменения;
					QuantityDiff.QuantityInc		 = СтрокаДанныхПрослеживаемости.КоличествоУвеличение;
					QuantityDiff.QuantityDec		 = СтрокаДанныхПрослеживаемости.КоличествоУменьшение;
				
					Если НЕ ЗначениеЗаполнено(QuantityDiff.QuantityDec) 
						И НЕ ЗначениеЗаполнено(QuantityDiff.QuantityInc) Тогда
						
						Если ЕстьУвеличение Тогда
							QuantityDiff.QuantityInc = 0;
							QuantityDiff.QuantityDec = Неопределено;
						ИначеЕсли ЕстьУменьшение Тогда
							QuantityDiff.QuantityInc = Неопределено;
							QuantityDiff.QuantityDec = 0;
						КонецЕсли;
						
					КонецЕсли;
					
					ItemTracingInfo					 = Новый_ItemTracingInfo736();
					ItemTracingInfo.Unit			 = СтрокаДанныхПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости;
					ItemTracingInfo.QuantityDiff	 = QuantityDiff;
					ItemTracingInfo.RegNumberUnit	 = СокрЛП(СтрокаДанныхПрослеживаемости.НомерГТДРегистрационныйНомер);
					
					СтрокаТЧ.ItemTracingInfos.Добавить(ItemTracingInfo);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает структуру свойств строки прослеживаемости
//
// Возвращаемое значение:
//  Структура
//
Функция НовыеСвойстваЭлементаПрослеживаемости() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодЕдиницыИзмеренияПрослеживаемости");
	Результат.Вставить("ЕдиницаИзмеренияПрослеживаемости");
	Результат.Вставить("КоличествоПоРНПТ");
	Результат.Вставить("СтоимостьБезНДСПрослеживаемости");
	Результат.Вставить("НомерГТДРегистрационныйНомер");
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру свойств строки прослеживаемости для корректировки
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * НомерТовара
//   * ЕдиницаИзмеренияКод
//   * ЕдиницаИзмеренияНаименование
//   * КоличествоТовараДоИзменения
//   * КоличествоТовараПослеИзменения
//   * КоличествоТовараУвеличение
//   * КоличествоТовараУменьшение
//   * КоличествоУчетноеДоИзменения
//   * КоличествоУчетноеПослеИзменения
//
Функция НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НомерГТДРегистрационныйНомер");
	Результат.Вставить("КодЕдиницыИзмеренияПрослеживаемости");
	Результат.Вставить("КоличествоДоИзменения");
	Результат.Вставить("КоличествоПослеИзменения");
	Результат.Вставить("КоличествоУвеличение");
	Результат.Вставить("КоличествоУменьшение");
	
	Возврат Результат;
	
КонецФункции

// Создает новую таблицу значений для штрихкодов упаковок.
// В прикладных документах должна существовать табличная часть с аналогичным набором колонок.
// См. ЭлектронноеВзаимодействиеИСМП.НоваяТаблицаШтрихкодыУпаковок()
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений штрихкодов упаковок:
//    * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкод упаковки
//    * ЗначениеШтрихкода - Строка - Значение штрихкода
//
Функция НоваяТаблицаШтрихкодыУпаковок() Экспорт
	
	//МодульЭлектронноеВзаимодействиеИСМП = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеВзаимодействиеИСМП");
	//Результат = МодульЭлектронноеВзаимодействиеИСМП.НоваяТаблицаШтрихкодыУпаковок();
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ШтрихкодУпаковки");
	Результат.Колонки.Добавить("ЗначениеШтрихкода");
	
	Возврат Результат;
	
КонецФункции

// Считывает коды маркировки из строки электронного документа и
// добавляет их в общую таблицу штрихкодов.
//
// Параметры:
//  ШтрихкодыУпаковок	 - ТаблицаЗначений - таблица с кодами маркировки (см НоваяТаблицаШтрихкодыУпаковок)
//  СведенияОМаркировке	 - Структура - сведения о маркировке (см. НовыйСведенияОМаркировке)
//  GTIN				 - Строка - Глобальный идентификационный номер товарной продукции
//
Процедура ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, СведенияОМаркировке, GTIN = "") Экспорт
	
	//Если ИспользоватьКонтурМаркировку() Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(GTIN)
		И ЗначениеЗаполнено(СведенияОМаркировке.КоличествоТовараВУпаковке) Тогда
		
		КоличествоТовараВУпаковке = СведенияОМаркировке.КоличествоТовараВУпаковке;

		ЗначениеШтрихкода = НовыйКодОСУ(GTIN, КоличествоТовараВУпаковке);
		
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;

	КонецЕсли;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйКодОСУ(GTIN, Количество)
	
	КоличествоСтрокой = XMLСтрока(Цел(Количество));
	
	ЧастиКодаОСУ = Новый Массив;
	ЧастиКодаОСУ.Добавить("02");
	ЧастиКодаОСУ.Добавить(GTIN);
	ЧастиКодаОСУ.Добавить("37");
	ЧастиКодаОСУ.Добавить(КоличествоСтрокой);
	
	Результат = СтрСоединить(ЧастиКодаОСУ);
	
	Возврат Результат;
	
КонецФункции

// Возвращает зарезервированное имя свойства для передачи произвольных данных в структуру контента.
// Например, ссылки на источники, по которым сформирована структура контента,
// или любые иные сведения, определенные в событии ПМ "ПослеЗаполненияКонтента".
// 
// Возвращаемое значение:
//  Строка.
//
Функция ИмяСвойстваСлужебнаяИнформация() Экспорт
	
	Возврат "СлужебнаяИнформация";
	
КонецФункции

// Дополняет структуру контента документа служебной информацией об источнике заполнения контента:
// ссылками на сам документ, контрагента, организацию и т.д.
//
// Параметры:
//  Протоструктура	 - Структура - формируемый контент документа;
//  ДанныеШапки		 - Структура - см. функцию ДанныеШапки;
//
Процедура ДополнитьКонтентДокументаСлужебнойИнформацией(Контент, ДанныеШапки) Экспорт 
	
	СлужебнаяИнформация = НоваяСлужебнаяИнформацияШапки();
	ЗаполнитьЗначенияСвойств(СлужебнаяИнформация, ДанныеШапки);
	СлужебнаяИнформация.Ссылка = ДанныеШапки.ОписаниеДокумента.Ссылка;
	
	Контент.Вставить(ИмяСвойстваСлужебнаяИнформация(), СлужебнаяИнформация);
	
КонецПроцедуры

// Дополняет структуру контента строки табличной части служебной информацией об источнике заполнения контента:
// ссылками на номенклатуру, характеристику, упаковку (единицу измерения) и т.д.
//
// Параметры:
//  Протоструктура	 - Структура - структура, содержащая контент по строке табличной части;
//  СтрокаТЧ		 - СтрокаТаблицыЗначений - см. функцию ДанныеТабличныхЧастей;
//
Процедура ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Контент, СтрокаТЧ) Экспорт 
	
	СлужебнаяИнформация = НоваяСлужебнаяИнформацияСтроки();
	ЗаполнитьЗначенияСвойств(СлужебнаяИнформация, СтрокаТЧ);
	
	// Упаковки (единицы) номенклатуры из учетного документа
	СлужебнаяИнформация.Упаковка = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "Упаковка");
	СлужебнаяИнформация.УпаковкаДоИзменения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "УпаковкаДоИзменения");
	
	// Единицы измерения по классификатору
	СлужебнаяИнформация.ЕдиницаИзмерения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "ЕдиницаИзмерения");
	СлужебнаяИнформация.ЕдиницаИзмеренияДоИзменения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "ЕдиницаИзмеренияДоИзменения");
	
	СлужебнаяИнформация.Номенклатура		 = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "Номенклатура");
	СлужебнаяИнформация.Характеристика		 = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "Характеристика");
	СлужебнаяИнформация.Серия				 = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "Серия");
	СлужебнаяИнформация.СтранаПроисхождения	 = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "СтранаПроисхождения");
	СлужебнаяИнформация.СтавкаНДС			 = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "СтавкаНДС");
	СлужебнаяИнформация.СтавкаНДСДоИзменения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТЧ, "СтавкаНДСДоИзменения");
	СлужебнаяИнформация.ДокументОтгрузки	 = СтрокаТЧ.ДокументОтгрузки;
	
	Если Не ЗначениеЗаполнено(СлужебнаяИнформация.ПрослеживаемыйТовар) Тогда
		СлужебнаяИнформация.ПрослеживаемыйТовар = Ложь;
	КонецЕсли;
	Если ТипЗнч(СлужебнаяИнформация.ДанныеПрослеживаемости) <> Тип("Массив") Тогда
		СлужебнаяИнформация.ДанныеПрослеживаемости = Новый Массив;
	КонецЕсли;
	
	Контент.Вставить(ИмяСвойстваСлужебнаяИнформация(), СлужебнаяИнформация);
	
КонецПроцедуры

// Создает структуру параметров для заполнения служебной информации об основании передачи,
// которая будет передана в протоструктуру контента документа.
// 
// Возвращаемое значение:
//  Структура.
//
Функция НоваяСлужебнаяИнформацияОснованияПередачи() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОснованиеСсылка");
	Результат.Вставить("ПредставлениеВТекстеОшибки");
	
	Возврат Результат;
	
КонецФункции

// Дополняет структуру контента строки оснований передачи служебной информацией об источнике заполнения контента:
// ссылкой на основание передачи, представление ссылки в тексте ошибки валидации и т.д.
//
// Параметры:
//  Контент	 			- Структура - структура, содержащая контент по строке оснований передачи;
//  СлужебнаяИнформация - Структура - см. функцию МодульИнтеграции.ЗаполнитьСведенияОПередаче
//
Процедура ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(Контент, СлужебнаяИнформация) Экспорт 
	
	Контент.Вставить(ИмяСвойстваСлужебнаяИнформация(), СлужебнаяИнформация);
	
КонецПроцедуры

// Заполняет сведения о работнике организации продавца, передавшем товар (груз).
//
// Параметры:
//  Контент - Структура - протоконтент в формате приказа 155@.
//  Шапка - Структура - данные шапки документа-источника (см. ДанныеШапки).
//  ПараметрыФормирования - Структура - параметры получения контента (см. ДополнительныеПараметрыПолученияКонтента)
//
Процедура ЗаполнитьСведенияОЛицеПередавшемТовар(Контент, Шапка, ПараметрыФормирования) Экспорт
	
	Сотрудник = ПараметрыФормирования.ДанныеСотрудника;
	
	Если Не ЗначениеЗаполнено(Сотрудник)
		Или Не ЗначениеЗаполнено(Сотрудник.Должность) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьФункцияПД = (Шапка.Функция = "InvoiceAndBasic" ИЛИ Шапка.Функция = "Basic");
	
	Если Не Шапка.ЕстьТовары
		Или Не ЕстьФункцияПД Тогда
		Возврат;
	КонецЕсли;
	
	Контент.TransferInfo.Employee.Surname		   = Сотрудник.Фамилия;
	Контент.TransferInfo.Employee.FirstName		   = Сотрудник.Имя;
	Контент.TransferInfo.Employee.Patronymic	   = Сотрудник.Отчество;
	Контент.TransferInfo.Employee.EmployeePosition = Сотрудник.Должность;
	
КонецПроцедуры

// Заполняет поля "Name" и "Function" протоструктуры в формате приказа 155@
//
// Параметры:
//  Прото - Структура - протоконтент.
//  ФорматОтправки - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
Процедура ЗаполнитьНаименованиеФункцию155(Прото, ФорматОтправки) Экспорт
	
	ТипыЭД = ИдентификаторыТиповДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	ИмяТипа = ФорматОтправки.ИмяТипа;
	ФункцияДокумента = ФорматОтправки.ФункцияДокумента;
	
	Если ФункцияДокумента = ФункцииЭД.ПоУмолчанию Тогда
		
		ТипыСЧФ = Новый Массив;
		ТипыСЧФ.Добавить(ТипыЭД.Invoice);
		ТипыСЧФ.Добавить(ТипыЭД.InvoiceRevision);
		
		ЭтоСчетФактура = (ТипыСЧФ.Найти(ИмяТипа) <> Неопределено);
		Если ЭтоСчетФактура Тогда
			ФункцияПрото = ФункцияПрото_Invoice();
		Иначе
			ФункцияПрото = ФункцияПрото_Basic();
		КонецЕсли;
		
	Иначе
		
		ЗначенияФункций = Новый Соответствие;
		ЗначенияФункций.Вставить(ФункцииЭД.СЧФДОП, ФункцияПрото_InvoiceAndBasic());
		ЗначенияФункций.Вставить(ФункцииЭД.СЧФ, ФункцияПрото_Invoice());
		ЗначенияФункций.Вставить(ФункцииЭД.ДОП, ФункцияПрото_Basic());
		
		ФункцияПрото = ЗначенияФункций.Получить(ФункцияДокумента);
		
	КонецЕсли;
	
	Если ФункцияПрото = ФункцияПрото_InvoiceAndBasic() Тогда
		НаименованиеЭД = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ИначеЕсли ФункцияПрото = ФункцияПрото_Basic() Тогда
		НаименованиеЭД = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ИначеЕсли ФункцияПрото = ФункцияПрото_Invoice() Тогда
		НаименованиеЭД = Неопределено;
	Иначе
		
		Ошибка = СтрШаблон("Недопустимое значение функции протоструктуры (%1) (ИмяТипа = %2, ФункцияДокумента = %3)",
			ФункцияПрото,
			ФорматОтправки.ИмяТипа,
			ФорматОтправки.ФункцияДокумента);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Прото.Function = ФункцияПрото;
	Прото.Name = НаименованиеЭД;
	
КонецПроцедуры

// Возвращает информацию о стране происхождения товара в формате строки.
//
// Параметры:
//  КоллекцияСведений - Структура - Коллекция сведений о стране происхождения:
//      * СтранаПроисхождения - СправочникСсылка.СтраныМира - Страна происхождения товара.
//      * НомерГТД            - СправочникСсылка.НомераГТД - Номер грузовой таможенной декларации.
//
// Возвращаемое значение:
//   Строка - Сведения о стране происхождения товара для поля StructedAdditionalInfo в формате Ключ=Значение.
//
Функция СведенияОСтранеПроисхожденияСтрокой(КоллекцияСведений) Экспорт
	
	ПараметрыСтроки = Новый Массив;
	
	Если ЗначениеЗаполнено(КоллекцияСведений.СтранаПроисхождения) Тогда
		
		КодСтраныПроисхождения = ПривестиКЧислу(СокрЛП(КоллекцияСведений.СтранаПроисхождения.Код));
		
		ШаблонКодСтраныПроисхождения	= НСтр("ru = 'цифровой код страны происхождения=%1'");
		ПараметрКодСтраныПроисхождения	= ПодставитьПараметрыВСтроку(ШаблонКодСтраныПроисхождения, КодСтраныПроисхождения);
		
		ШаблонСтранаПроисхождения	= НСтр("ru = 'краткое наименование страны происхождения=%1'");
		ПараметрСтранаПроисхождения	= ПодставитьПараметрыВСтроку(ШаблонСтранаПроисхождения, КоллекцияСведений.СтранаПроисхождения);
		
		ПараметрыСтроки.Добавить(ПараметрКодСтраныПроисхождения);
		ПараметрыСтроки.Добавить(ПараметрСтранаПроисхождения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоллекцияСведений.НомерГТД) Тогда
		
		ШаблонНомерГТД = НСтр("ru = 'регистрационный номер декларации на товары=%1'");
		ПараметрНомерГТД = ПодставитьПараметрыВСтроку(ШаблонНомерГТД, СокрЛП(КоллекцияСведений.НомерГТД));
		
		ПараметрыСтроки.Добавить(ПараметрНомерГТД);
		
	КонецЕсли;
	
	СведенияОстранеПроисхождения = СтрокаИзМассиваПодстрок(ПараметрыСтроки, ";");
	
	Возврат СведенияОстранеПроисхождения;

КонецФункции

Процедура ЗаполнитьОбстФормСЧФ820(Контент, СчетФактура, ФункцияУПД)
	
	ФункцииЭлектронныхДокументов	 = ФункцииЭлектронныхДокументов();
	ЭтоФункцияДОП					 = ФункцияУПД = ФункцииЭлектронныхДокументов.ДОП;
	ЭтоФункцияСЧФДОП				 = ФункцияУПД = ФункцииЭлектронныхДокументов.СЧФДОП;
	
	Если ЭтоФункцияДОП ИЛИ ЭтоФункцияСЧФДОП Тогда
		
		Результат = МетодСервера(ИмяМодуляИнтеграции(), "ПолучитьОбстоятельствоФормированияСчетФактуры"
			, СчетФактура);
		
		Контент.CircumFormatInvoice = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийИнтеграционныхМодулей

Процедура ПриПолученииОписанияПрикладногоДокумента(Реквизиты, СсылкаНаОбъект)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииОписанияПрикладногоДокумента"
		, Реквизиты
		, СсылкаНаОбъект);
	
КонецПроцедуры

Функция ВидДокументаИнформационнойБазы(СсылкаНаОбъект, ЭтоКорректировка)
	
	Результат = Неопределено;
	
	МетодСервера(ИмяМодуляИнтеграции(), "ОпределитьВидДокумента"
		, Результат
		, СсылкаНаОбъект
		, ЭтоКорректировка);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ВидыЭД = ВидыЭлектронныхДокументов();
		Результат = ВидыЭД.Произвольный;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Событие возникает при получении данных табличной части ДокументыОбОтгрузуке документа СчетФактураВыданный
//
// Параметры:
//  ДокументыОбОтгрузке		- Массив - Массив элементов "Новый_DocumentShipment";
//  СчетФактураСсылка		- ДокументСсылка.СчетФактураВыданный - СчетФактура для которой определяем реквизиты документов отгрузки;
//  СтандартнаяОбработка	- Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииДанныхДокументовОбОтгрузке(ДокументыОбОтгрузке, СчетФактураСсылка, СтандартнаяОбработка)

	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииДанныхДокументовОбОтгрузке"
		, ДокументыОбОтгрузке
		, СчетФактураСсылка
		, СтандартнаяОбработка);

КонецПроцедуры

// Событие возникает перед выполнением запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить выражения полей запроса для получения данных шапки.
//
// Параметры:
//  Реквизиты			 - Структура - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  МетаданныеИсточника	 - ОбъектМетаданных - Метаданные документа-источника.
//
// Пример:
//		Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузоотправитель") Тогда 
//			
//			Реквизиты.Вставить("Грузоотправитель", 
//			"ВЫБОР
//			|	КОГДА Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//			|		ТОГДА Организация
//			|	ИНАЧЕ Грузоотправитель
//			|КОНЕЦ");
//			
//		КонецЕсли;
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПодготовкеЗапросаПоШапкеДокумента"
		, Реквизиты
		, МетаданныеИсточника);
	
КонецПроцедуры

// Событие возникает после выполнения запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить или дополнить данные шапки документа.
//
// Параметры:
//  ДанныеШапки - Структура - Структура со значениями реквизитов документа.
//
// Пример:
//   ДанныеШапки.БанковскийСчетОрганизации = СчетОрганизации(ДанныеШапки.Организация);
//
Процедура ПослеПолученияДанныхШапкиДокумента(ДанныеШапки)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПослеПолученияДанныхШапкиДокумента"
		, ДанныеШапки);
	
КонецПроцедуры

// Событие возникает при получении списка табличных частей документа, 
// содержащих сведения о товарном составе документа.
//
// Параметры:
//  МетаданныеОбъекта	 - ОбъектМетаданных - объект метаданных.
//  ТабличныеЧасти		 - Массив	 - массив, в который необходимо добавить имена табличных частей, из которых нужно получить данные.
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события.
//
// Пример:
//   Если Шапка.ИмяМетаданных = "АктВыполненныхРабот" Тогда
//       ТабличныеЧасти.Добавить("Услуги");
//   Иначе
//       ТабличныеЧасти.Добавить("Товары");
//   КонецЕсли;
//
Процедура ПриПолученииИменТабличныхЧастей(МетаданныеОбъекта, ТабличныеЧасти, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииИменТабличныхЧастей"
		, МетаданныеОбъекта
		, ТабличныеЧасти
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает перед выполнением запроса по табличной части документа (см. ТабличнаяЧастьДокумента).
// Позволяет переопределить выражения полей запроса для получения данных табличной части.
//
// Параметры:
//  Шапка				 - Структура - см. функцию ДанныеШапки
//  ИмяТабличнойЧасти	 - Строка	 - имя табличной части.
//  РеквизитыТЧ			 - Структура - коллекция описаний полей запроса: ключ - имя (псевдоним) поля, значение - выражение.
//  ПараметрыЗапроса	 - Структура - дополнительные параметры, будут переданы в исполняемый запрос.
//
// Пример:
//   ПараметрыЗапроса.Вставить("СуммаВключаетНДС", Шапка.ЦенаВключаетНДС);
//   РеквизитыТЧ.СуммаСНДС = 
//   "ВЫБОР 
//       КОГДА &СуммаВключаетНДС 
//          ТОГДА Сумма
//       ИНАЧЕ Сумма + СуммаНДС
//    КОНЕЦ";
//
Процедура ПриПодготовкеЗапросаПоТоварнойЧастиДокумента(Шапка, ИмяТабличнойЧасти, РеквизитыТЧ, ПараметрыЗапроса)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПодготовкеЗапросаПоТоварнойЧастиДокумента"
		, Шапка
		, ИмяТабличнойЧасти
		, РеквизитыТЧ
		, ПараметрыЗапроса);
	
КонецПроцедуры

// Событие возникает после получения данных табличных частей документа (см. ДанныеТабличныхЧастей).
//
// Параметры:
//  Шапка			 - Структура		 - см. функцию ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. функцию ДанныеТабличныхЧастей.
//
// Пример:
//   Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл 
//       СтрокаТЧ.СуммаСНДС = Окр(СтрокаТЧ.СуммаСНДС * Шапка.КурсДокумента / Шапка.КратностьДокумента, 2);
//   КонецЦикла;
//
Процедура ПослеПолученияТоварнойЧастиДокумента(Шапка, ТабличнаяЧасть)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПослеПолученияТоварнойЧастиДокумента"
		, Шапка
		, ТабличнаяЧасть);
	
КонецПроцедуры

// Событие возникает перед стандартной обработкой получения номера.
// В обработчике можно переопределить стандартное поведение системы при формировании номера на печать.
//
// Параметры:
//  НомерОбъекта		 - Строка - номер или код объекта, который преобразуется для вывода на печать.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
// Пример:
//   СтандартнаяОбработка = Ложь;
//   ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерОбъекта, Истина, Ложь);
//
Процедура ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииНомераНаПечать"
		, НомерОбъекта
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при определении имени реквизита номенклатуры,
//  из которого нужно получить представление кода в печатных формах.
//
// Параметры:
//  ИмяКолонки			 - Строка - параметр, в который возвращается имя колонки с кодом товара.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов(ИмяКолонки, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов"
		, ИмяКолонки
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при получении значения валюты регл. учета.
//
// Параметры:
//  ВалютаРеглУчета		 - СправочникСсылка.Валюты	 - параметр, в который возвращается значение валюты регл. учета.
//  СтандартнаяОбработка - Булево					 - Ложь, чтобы отключить стандартную обработку события.
//
// Пример:
//    СтандартнаяОбработка	 = Ложь;
//    ВалютаРеглУчета		 = Константы.ВалютыРегламентированногоУчета.Получить();
//
Процедура ПриОпределенииВалютыРегламентированногоУчета(ВалютаРеглУчета, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриОпределенииВалютыРегламентированногоУчета"
		, ВалютаРеглУчета
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при получении сведений об организации, контрагенте или физическом лице.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииРеквизитовЮрФизЛица"
		, Реквизиты
		, ЮрФизЛицо
		, Период
		, БанковскийСчет
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при формировании строкового описания организации, контрагента или физического лица.
//
// Параметры:
//  Представление		 - Строка	 - параметр, в который возвращается полученное представление юридического или физического лица.
//  Реквизиты			 - Структура - см. функцию РеквизитыЮрФизЛица.
//  ШаблонПредставления	 - Строка	 - содержит имена реквизитов, перечисленные через запятую, которые нужно включить в представление.
//  СЗаголовками		 - Булево	 - следует ли перед значениями реквизитов добавлять их заголовки.
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииПредставленияЮрФизЛица(Представление, Реквизиты, ШаблонПредставления, СЗаголовками, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииПредставленияЮрФизЛица"
		, Представление
		, Реквизиты
		, ШаблонПредставления
		, СЗаголовками
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при формировании строкового представления номенклатуры.
//
// Параметры:
//  Представление			 - Строка - параметр, в который возвращается полученное представление номенклатуры.
//  Номенклатура			 - Строка, СправочникСсылка.Номенклатура				 - ссылка на номенклатуру;
//  Характеристика			 - Строка, СправочникСсылка.ХарактеристикиНоменклатуры	 - характеристика номенклатуры;
//  ДополнительныеПараметры	 - Неопределено, Структура								 - см. функцию ДополнительныеПараметрыПредставленияНоменклатуры;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииПредставленияНоменклатуры(Представление, Номенклатура, Характеристика, ДополнительныеПараметры, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииПредставленияНоменклатуры"
		, Представление
		, Номенклатура
		, Характеристика
		, ДополнительныеПараметры
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает перед стандартной обработкой получения параметров учета номенклатуры.
// В обработчике можно переопределить стандартное поведение системы при формировании параметров учета номенклатуры.
//
// Параметры:
//  ПараметрыНоменклатуры - Структура - Коллекция параметров учета номенклатуры в текущей ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииПараметровУчетаНоменклатуры(ПараметрыНоменклатуры, СтандартнаяОбработка)
	
	МетодСервера(
		ИмяМодуляИнтеграции(),
		"ПриЗаполненииПараметровУчетаНоменклатуры",
		ПараметрыНоменклатуры,
		СтандартнаяОбработка
	);
	
КонецПроцедуры

// Событие возникает при определении фактического места хранения контактной информации объекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта"
		, ХранилищеКИ
		, СсылкаНаОбъект
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при получении таблицы видов документов,
// которые можно отправить по ЭДО.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию ВидыИсходящихДокументов;
//
Процедура ПриПолученииВидовИсходящихДокументов(ВидыДокументов)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииВидовИсходящихДокументов", ВидыДокументов);
	
КонецПроцедуры

// Событие возникает при получении таблицы видов документов,
// которые можно принять по ЭДО.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию ВидыИсходящихДокументов;
//
Процедура ПриПолученииВидовВходящихДокументов(ВидыДокументов)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииВидовВходящихДокументов", ВидыДокументов);
	
КонецПроцедуры

Процедура ПриПолученииСоответствияСправочников(СоответствиеСправочников, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииСоответствияСправочников"
		, СоответствиеСправочников
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при определении объекта, который будет выступать в качестве константы
// для дополнительных сведений.
//
// Параметры:
//  СсылкаНаОбъект 			- ЛюбаяСсылка, Неопределено - объект, выступающий в качестве константы для хранения дополнительных свойств;
//  СтандартнаяОбработка 	- Булево			 		- Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииВладельцаОбщихНастроекМодуля(СсылкаНаОбъект, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииВладельцаОбщихНастроекМодуля"
		, СсылкаНаОбъект
		, СтандартнаяОбработка);
	
КонецПроцедуры	

#Область СопоставлениеНоменклатуры

// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  НаборНоменклатуры - Массив из ОпределяемыйТип.НоменклатураБЭД - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(Знач НаборНоменклатуры, СвойстваНоменклатурИБ)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриОпределенииСвойствНоменклатурыИнформационнойБазы"
		, НаборНоменклатуры
		, СвойстваНоменклатурИБ);
		
КонецПроцедуры

// Выполняется при подборе недостающих данных о номенклатуре информационной базы по уже имеющимся,
// а также номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//
Процедура МодульИнтеграции_ПриПодбореНоменклатурыИнформационнойБазы(Знач НоменклатураКонтрагента, НоменклатураИБ)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПодбореНоменклатурыИнформационнойБазы"
		, НоменклатураКонтрагента
		, НоменклатураИБ);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ПриСозданииДокументаИнформационнойБазы(ДокументОбъект, ДанныеЭД, ПараметрыЗаполнения, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриСозданииДокументаИнформационнойБазы"
		, ДокументОбъект
		, ДанныеЭД
		, ПараметрыЗаполнения
		, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриОпределенииИмениСправочникаВладельцаНоменклатуры(ИмяСправочника, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриОпределенииИмениСправочникаВладельцаНоменклатуры"
		, ИмяСправочника
		, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриПолученииСсылкиПоПолямПоиска(СсылкаНаОбъект, ПоляПоиска, ОбъектМетаданных, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииСсылкиПоПолямПоиска"
		, СсылкаНаОбъект
		, ПоляПоиска
		, ОбъектМетаданных
		, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриПолученииСчетовФактурПоОснованию(НайденныеДокументы, ПараметрыРегистрацииСФ, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииСчетовФактурПоОснованию"
		, НайденныеДокументы
		, ПараметрыРегистрацииСФ
		, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриПодготовкеПараметровРегистрацииСчетаФактуры(ПараметрыРегистрации, ДокументОснование, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПодготовкеПараметровРегистрацииСчетаФактуры"
		, ПараметрыРегистрации
		, ДокументОснование
		, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ЗаполнитьСоответствиеПолейВходящегоДокумента(ОбъектМетаданных, ИменаПолей)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ЗаполнитьСоответствиеПолейВходящегоДокумента"
		, ОбъектМетаданных
		, ИменаПолей);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СборПротоконтента

// Формирует и заполняет структуру Utd820SellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУПД820(СсылкаНаДокумент, ПараметрыФормирования)
	
	Контент155 = КонтентУПД155(СсылкаНаДокумент, ПараметрыФормирования);
	
	Результат = Конвертировать155в820(Контент155);
	
	ДокументыОснования = СвойствоСтруктуры(Контент155.СлужебнаяИнформация, "ДокументыОснования");
	ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку820(Результат, ДокументыОснования);
	
	ИспользоватьКМ = ПараметрыФормирования.ИспользоватьСервисКонтурМаркировка;
	ЗаполнитьСведенияОМаркировке820(Результат, СсылкаНаДокумент, ИспользоватьКМ);
	
	ЗаполнитьСведенияПрослеживаемости820(Результат);
	
	Если ЭтоЭлектронныйУПД(ПараметрыФормирования.ФорматОтправки.ИмяТипа) Тогда
		ЗаполнитьОбстФормСЧФ820(Результат, СсылкаНаДокумент, ПараметрыФормирования.ФункцияДокумента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конвертирует протоконтент из формата 155@ в формат 820@.
//
// @СлужебныйПрограммныйИнтерфейс
//
// Параметры:
//  Контент155 - Структура - см. Новый_UtdSellerContent.
// 
// Возвращаемое значение:
//  Структура - см. Новый_Utd820SellerContent.
//
Функция Конвертировать155в820(Контент155) Экспорт
	
	Результат = Новый_Utd820SellerContent();
	ЗаполнитьКонтент820ПоДаннымКонтент155(Результат, Контент155);
	
	Возврат Результат;
	
КонецФункции

// Мапит структуру UtdSellerContent в структуру Utd820SellerContent
//
// Параметры:
//	Контент820	- Структура - см. метода Новый_Utd820SellerContent()
//	Контент155	- Структура	- заполненная структура Новый_Utd820SellerContent() 
//
// ВозвращаемоеЗначение:
//	Структура - См. тело метода
Процедура ЗаполнитьКонтент820ПоДаннымКонтент155(Контент820, Контент155)
	
	// Наименование, дата и номер документа
	Контент820.DocumentName	 = Контент155.Name;
	Контент820.DocumentDate	 = Контент155.Date;
	Контент820.DocumentNumber = Контент155.Number;
	
	// Дата и номер исправления
	Контент820.RevisionDate		= Контент155.RevisionDate;
	Контент820.RevisionNumber	= Контент155.RevisionNumber;
	
	Контент820.Function = Контент155.Function;
	
	// Валюта
	Контент820.Currency 		= Контент155.Currency;
	Контент820.CurrencyRate 	= Контент155.CurrencyRate;
	
	// Составитель документа и его полномочия
	Контент820.DocumentCreator		 = Контент155.Creator;
	Контент820.DocumentCreatorBase	 = Контент155.CreatorBase;
	
	// Идентификатор государственного контракта
	Контент820.GovernmentContractInfo = Контент155.GovernmentContractInfo;
	
	// Участники сделки
	Buyer		 = Новый_ExtendedOrganizationInfo820();
	Seller		 = Новый_ExtendedOrganizationInfo820();
	Consignee	 = Новый_ExtendedOrganizationInfo820();
	
	ЗаполнитьЗначенияСвойств(Buyer		, Контент155.Buyer);
	ЗаполнитьЗначенияСвойств(Seller		, Контент155.Seller);
	ЗаполнитьЗначенияСвойств(Consignee	, Контент155.Consignee);
	
	Если СтруктураЗаполнена(Consignee) Тогда
		Consignee.HyphenInn = НЕ ЗначениеЗаполнено(Consignee.Inn);
	КонецЕсли;
	
	Shipper = Новый_Shipper820();
	Shipper.SameAsSeller = Контент155.Shipper.SameAsSeller;
	ЗаполнитьЗначенияСвойств(Shipper.OrganizationInfo, Контент155.Shipper.OrganizationInfo);
	
	Если СтруктураЗаполнена(Shipper.OrganizationInfo) Тогда
		Shipper.OrganizationInfo.HyphenInn = НЕ ЗначениеЗаполнено(Shipper.OrganizationInfo.Inn);
	КонецЕсли;
	
	Контент820.Buyers.Добавить(Buyer);
	Контент820.Sellers.Добавить(Seller);
	Контент820.Shippers.Добавить(Shipper);
	Контент820.Consignees.Добавить(Consignee);
	
	Контент820.AdditionalInfoId = Контент155.AdditionalInfoId;
	
	// Сведения о платежно-расчетном документе
	Для Каждого PaymentDocument155 Из Контент155.PaymentDocuments Цикл
	
		PaymentDocument820 = Новый_PaymentDocumentInfo();
		
		ЗаполнитьЗначенияСвойств(PaymentDocument820, PaymentDocument155);
		
		Контент820.PaymentDocuments.Добавить(PaymentDocument820);
		
	КонецЦикла;
	
	// Основания передачи
	ЗаполнитьTransferBase820ПоДаннымКонтент155(Контент820.TransferInfo, Контент155.TransferInfo);
			
	// Табличная часть
	ЗаполнитьUtd820TableПоДаннымКонтент155(Контент820, Контент155);
	
	// Подписанты
	ЗаполнитьSigners820ПоДаннымКонтент155(Контент820.Signers, Контент155.Signers);
						
	Контент820.ОшибкиВДанных = Контент155.ОшибкиВДанных;
	
	КлючСлужебнаяИнформация = ИмяСвойстваСлужебнаяИнформация();
	Если Контент155.Свойство(КлючСлужебнаяИнформация) Тогда
		
		СлужебнаяИнформация820 = Контент820[КлючСлужебнаяИнформация];
		СлужебнаяИнформация155 = Контент155[КлючСлужебнаяИнформация];
		ЗаполнитьЗначенияСвойств(СлужебнаяИнформация820, СлужебнаяИнформация155);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьTransferBase820ПоДаннымКонтент155(TransferInfo820, TransferInfo155)
	
	TransferInfo820.OperationInfo 		= TransferInfo155.OperationInfo;
	TransferInfo820.OperationType 		= TransferInfo155.OperationType;
	
	TransferInfo820.TransferTextInfo	= TransferInfo155.TransferTextInfo;
	TransferInfo820.TransferDate		= TransferInfo155.TransferDate;
	
	TransferInfo820.CreatedThingInfo	= TransferInfo155.CreatedThingInfo;
	TransferInfo820.CreatedThingTransferDate 	= TransferInfo155.CreatedThingTransferDate;
	
	Для Каждого Waybills155 Из TransferInfo155.Waybills Цикл
		
		Waybills820 = Новый_Waybill();
		
		ЗаполнитьЗначенияСвойств(Waybills820, Waybills155);
		
		TransferInfo820.Waybills.Добавить(Waybills820);
		
	КонецЦикла;
	
	КлючСлужебнаяИнформация = ИмяСвойстваСлужебнаяИнформация();
	Для каждого TransferBase155 Из TransferInfo155.TransferBases Цикл
		
		TransferBase820 = Новый_TransferBase820();
		
		ЗаполнитьЗначенияСвойств(TransferBase820, TransferBase155);
		
		Если TransferBase820.DocumentName = "Отсутствует" Тогда
			TransferBase820.DocumentName = "Без документа-основания";
		КонецЕсли;
		
		Если TransferBase155.Свойство(КлючСлужебнаяИнформация) Тогда
			
			СлужебнаяИнформацияОснования155 = TransferBase155[КлючСлужебнаяИнформация];
			ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(TransferBase820, СлужебнаяИнформацияОснования155);
			
		КонецЕсли;
		
		TransferInfo820.TransferBases.Добавить(TransferBase820);
				
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(TransferInfo820.Carrier	, TransferInfo155.Carrier);
	
	ЗаполнитьЗначенияСвойств(TransferInfo820.Employee	, TransferInfo155.Employee);
	ЗаполнитьЗначенияСвойств(TransferInfo820.OtherIssuer, TransferInfo155.OtherIssuer);
	
	ЗаполнитьЗначенияСвойств(TransferInfo820.AdditionalInfoId, TransferInfo155.AdditionalInfoId);
				
КонецПроцедуры

Процедура ЗаполнитьUtd820TableПоДаннымКонтент155(Контент820, Контент155)
	
	ТабличнаяЧасть = Контент820.Table;
	ЗаполнитьЗначенияСвойств(ТабличнаяЧасть, Контент155.InvoiceTable, , "Items");
	
	ВсеСтрокиБезНДС = Истина;
	
	Для Каждого Item155 Из Контент155.InvoiceTable.Items Цикл
		
		СтрокаТЧ = Новый_Utd820Item();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Item155, , "CustomDeclarations");
		
		СтрокаТЧ.Unit			 = Item155.UnitCode;
		СтрокаТЧ.ItemVendorCode	 = Item155.VendorCode;
		СтрокаТЧ.ItemToRelease	 = Item155.ToRelease;
		СтрокаТЧ.WithoutVat		 = "false";
		
		Если ЗначениеЗаполнено(Item155.CustomDeclarations) Тогда
			Для каждого СтрокаТЗ Из Item155.CustomDeclarations Цикл
				CustomDeclaration = Новый_CustomDeclaration820();
				ЗаполнитьЗначенияСвойств(CustomDeclaration, СтрокаТЗ);
				СтрокаТЧ.CustomDeclarations.Добавить(CustomDeclaration);
			КонецЦикла;
		КонецЕсли;
		
		Если СтрокаТЧ.TaxRate = "без НДС" Тогда
			СтрокаТЧ.WithoutVat = "true";
		Иначе
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		ТабличнаяЧасть.Items.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
	ТабличнаяЧасть.WithoutVat = ?(ВсеСтрокиБезНДС, "true", "false");
	
КонецПроцедуры

Процедура ЗаполнитьSigners820ПоДаннымКонтент155(Signers820, Signers155)
	
	Для Каждого Signer155 Из Signers155 Цикл
		
		Signer820 = Новый_ExtendedSigner();
		
		Signer820.BoxId 				= Signer155.BoxId;
		Signer820.CertificateThumbprint = Signer155.CertificateThumbprint;
		
		ЗаполнитьЗначенияСвойств(Signer820.SignerDetails, Signer155.SignerDetails);
		
		Signers820.Добавить(Signer820);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует и заполняет структуру UtdSellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУПД155(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = Новый_UtdSellerContent();
	
	МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЗаполнитьКонтентXmlUTD"
				, Результат
				, СсылкаНаДокумент
				, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру UcdSellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУКД189(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = КонтентУКД736(СсылкаНаДокумент, ПараметрыФормирования);
	Результат.FormatVersion = БазовыеФорматы().ucd;
	
	ЗаполнитьКонтент189ПоДаннымКонтент736(Результат);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру UcdSellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент 		- ДокументСсылка 	- ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования 	- Структура 		- см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУКД736(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = Новый_UcdSellerContent();
	
	Результат.FormatVersion = БазовыеФорматы().ucd736;
	
	МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЗаполнитьКонтентXmlUCD"
				, Результат
				, СсылкаНаДокумент
				, ПараметрыФормирования);
	
	ПроверитьЗаполнитьАтрибутWithoutVat736(Результат);
	ПроверитьЗаполнитьItemOriginalNumber736(Результат);
	
	ИспользоватьКМ = ПараметрыФормирования.ИспользоватьСервисКонтурМаркировка;
	ЗаполнитьСведенияОМаркировке736(Результат, СсылкаНаДокумент, ИспользоватьКМ);
	
	ЗаполнитьСведенияПрослеживаемости736(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьДельта(Amounts)
	
	Результат = Ложь;
	
	Если Amounts.TotalWithVatExcluded <> Неопределено
		Или Amounts.Vat <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьАтрибутWithoutVat736(Контент736)
	
	ТабличнаяЧасть = Контент736.InvoiceCorrectionTable;
	
	ЕстьУвеличение = Ложь;
	ЕстьУменьшение = Ложь;
	
	ВсегоУвелБезНДС = Истина;
	ВсегоУмБезНДС = Истина;
	
	Для Каждого Элемент Из ТабличнаяЧасть.Items Цикл
		
		СтавкаДоИзменения = Элемент.OriginalValues.TaxRate;
		ДоИзмененияБезНДС = ЭтоСтавкаБезНДС(СтавкаДоИзменения);
		Элемент.OriginalValues.WithoutVat = XMLСтрока(ДоИзмененияБезНДС);
		
		СтавкаПослеИзменения = Элемент.CorrectedValues.TaxRate;
		ПослеИзмененияБезНДС = ЭтоСтавкаБезНДС(СтавкаПослеИзменения);
		Элемент.CorrectedValues.WithoutVat = XMLСтрока(ПослеИзмененияБезНДС);
		
		Если ЕстьДельта(Элемент.AmountsInc) Тогда
			ЕстьУвеличение = Истина;
			ВсегоУвелБезНДС = ВсегоУвелБезНДС И ДоИзмененияБезНДС И ПослеИзмененияБезНДС;
		КонецЕсли;
		
		Если ЕстьДельта(Элемент.AmountsDec) Тогда
			ЕстьУменьшение = Истина;
			ВсегоУмБезНДС = ВсегоУмБезНДС И ДоИзмененияБезНДС И ПослеИзмененияБезНДС;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьУвеличение Тогда
		ТабличнаяЧасть.TotalsInc.WithoutVat = XMLСтрока(ВсегоУвелБезНДС);
	КонецЕсли;
	
	Если ЕстьУменьшение Тогда
		ТабличнаяЧасть.TotalsDec.WithoutVat = XMLСтрока(ВсегоУмБезНДС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьItemOriginalNumber736(Контент736)
	
	СтрокиТабличнойЧасти = Контент736.InvoiceCorrectionTable.Items;
	
	НомерПоПорядку = 0;
	
	Для Каждого Item Из СтрокиТабличнойЧасти Цикл
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
		ЭтоНоваяСтрока = ЭтоНоваяСтрокаКорректировки(Item);
		
		НомерСтрокиИсходногоСФ = НомерПоПорядку;
		
		Если ЭтоНоваяСтрока Тогда
			НомерСтрокиИсходногоСФ = Неопределено;
		ИначеЕсли ЗначениеЗаполнено(Item.OriginalNumber) Тогда 
			Продолжить;
		КонецЕсли;
		
		Item.OriginalNumber = НомерСтрокиИсходногоСФ;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьКонтент189ПоДаннымКонтент736(ПротоКонтентУКД)
	
	ПротоКонтентУКД.EventContent.TransferDocDetails = ПредставлениеTransferDocDetails(ПротоКонтентУКД.EventContent.TransferDocDetails736);
	
	Для Каждого CorrectionBase Из ПротоКонтентУКД.EventContent.CorrectionBases Цикл
			
		Если CorrectionBase.BaseDocumentName = ОснованиеПередачи_БезДокументаОснования() Тогда
			CorrectionBase.BaseDocumentName = ОснованиеПередачи_Отсутствует();
		КонецЕсли;
		
	КонецЦикла;
	
	СтавкаНДС_ИсчНалАг = МетодСервера(, "СтавкаНДС_ИсчНалАг");
	
	Для Каждого Item Из ПротоКонтентУКД.InvoiceCorrectionTable.Items Цикл
		
		Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			
			Если Item.CorrectedValues.TotalWithVatExcluded >= Item.OriginalValues.TotalWithVatExcluded Тогда // увеличение
				Item.AmountsInc.Vat		= 0;
				Item.AmountsInc.Total 	= 0;			
			Иначе // уменьшение
				Item.AmountsDec.Vat 	= 0;
				Item.AmountsDec.Total 	= 0;			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеTransferDocDetails(TransferDocDetails736)

	Результат = "";
	
	Для Каждого BaseDocument Из TransferDocDetails736 Цикл
		
		Результат = Результат 	+ ?(ПустаяСтрока(Результат), "", ", ")
								+ BaseDocument.BaseDocumentName + "№" + BaseDocument.BaseDocumentNumber 
								+ " от " + BaseDocument.BaseDocumentDate;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

// Формирует и заполняет структуру ProformaInvoiceContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентФормализованногоСчета(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = Новый_ProformaInvoiceSellerContent();
	
	Шапка = ДанныеШапки(СсылкаНаДокумент);
	ДатаНомер = Шапка.ДатаНомерДокумента;
	
	Результат.DocumentDate	 = ДатаНомер.ДатаДокумента;
	Результат.DocumentNumber = ДатаНомер.НомерДокумента;
	
	Результат.Currency	 = Шапка.ВалютаДокументаКод;
	Результат.CurrencyRate = Шапка.КурсДокумента;
	
	// Заполнение сведений о продавце и получателе платежа
	Продавец	 = Шапка.Организация;
	Получатель	 = Шапка.ОрганизацияПолучатель;
	Если Получатель = Продавец Тогда 
		Получатель = Неопределено;
	КонецЕсли;
	
	СчетПродавца	 = ?(ЗначениеЗаполнено(Получатель), Неопределено, Шапка.БанковскийСчетОрганизации);
	СчетПолучателя	 = Шапка.БанковскийСчетОрганизации;
	
	РеквизитыПродавца = РеквизитыЮрФизЛица(Продавец, ДатаНомер.ДатаДокумента, СчетПродавца);
	ЗаполнитьИнформациюОбОрганизации(Результат.Seller, РеквизитыПродавца);
	
	Если ЗначениеЗаполнено(Получатель) Тогда 
		РеквизитыПолучателя = РеквизитыЮрФизЛица(Получатель, ДатаНомер.ДатаДокумента, СчетПолучателя);
		ЗаполнитьИнформациюОбОрганизации(Результат.Recipient, РеквизитыПолучателя);
	Иначе 
		Результат.Recipient = Неопределено;
	КонецЕсли;
	
	// Заполнение сведений о покупателе и плательщике
	Покупатель = Шапка.Контрагент;
	Плательщик = Шапка.Плательщик;
	Если Плательщик = Покупатель Тогда 
		Плательщик = Неопределено;
	КонецЕсли;
	
	СчетПокупателя = ?(ЗначениеЗаполнено(Плательщик), Неопределено, Шапка.БанковскийСчетКонтрагента);
	СчетПлательщика = Шапка.БанковскийСчетКонтрагента;
	
	РеквизитыПокупателя = РеквизитыЮрФизЛица(Покупатель, ДатаНомер.ДатаДокумента, СчетПокупателя);
	ЗаполнитьИнформациюОбОрганизации(Результат.Buyer, РеквизитыПокупателя);
	
	Если ЗначениеЗаполнено(Плательщик) Тогда 
		РеквизитыПлательщика = РеквизитыЮрФизЛица(Плательщик, ДатаНомер.ДатаДокумента, СчетПлательщика);
		ЗаполнитьИнформациюОбОрганизации(Результат.Payer, РеквизитыПлательщика);
	Иначе 
		Результат.Payer = Неопределено;
	КонецЕсли;
	
	Договор = РеквизитыДоговора(Шапка);
	Если ЗначениеЗаполнено(Договор) Тогда 
		Результат.Contract.Name	 = Договор.Представление;
		Результат.Contract.Number	 = Договор.Номер;
		Результат.Contract.Date	 = Договор.Дата;
	Иначе 
		Результат.Contract = Неопределено;
	КонецЕсли;
	
	Результат.GovernmentContractInfo = Шапка.ИдентификаторГосКонтракта;
	Результат.PaymentPurpose = Шапка.НазначениеПлатежа;
	
	ГрафикПлатежей = ЭтапыГрафикаОплатПоДокументу(Шапка);
	Если ГрафикПлатежей.Количество() = 0 Тогда
		ДатаПлатежа = '00010101';
	ИначеЕсли ГрафикПлатежей.Количество() = 1 Тогда
		ДатаПлатежа = ГрафикПлатежей[0].ДатаПлатежа;
	Иначе
		ДатаПлатежа = ГрафикПлатежей[ГрафикПлатежей.Количество()-1].ДатаПлатежа;
	КонецЕсли;
	
	ИнфоПоля = Новый Структура;
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().ДополнительныеУсловия	, Шапка.ДополнительныеУсловия);
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().ДополнительнаяИнформация, Шапка.ДополнительнаяИнформация);
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().ИдентификаторПлатежа	, Шапка.ИдентификаторПлатежа);
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().СрокОплаты				, ДатаПлатежа);
	
	Для Каждого Поле Из ИнфоПоля Цикл 
		Если ЗначениеЗаполнено(Поле.Значение) Тогда 
			ДополнитьМассивKeyValue(Результат.StructedAdditionalInfos, Поле.Ключ, Поле.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеТЧ = ДанныеТабличныхЧастей(Шапка);
	ЗаполнитьТаблицуСчетаНаОплату(Результат.ProformaInvoiceTable, ДанныеТЧ);
	
	СведенияОбПодписанте = Результат.Signer;
	
	Если ЗначениеЗаполнено(РеквизитыПродавца.Свидетельство)
		И СведенияОбПодписанте.Свойство("SoleProprietorRegistrationCertificate") Тогда
		Результат.Signer.SoleProprietorRegistrationCertificate = РеквизитыПродавца.Свидетельство;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру Torg12SellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентНакладной172(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = Новый_Torg12SellerContent();
	
	МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЗаполнитьКонтентXmlTorg12"
				, Результат
				, СсылкаНаДокумент
				, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру AcceptanceCertificateSellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентАкта172(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = Новый_AcceptanceCertificateSellerContent();
	
	МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЗаполнитьКонтентXmlAcceptanceCertificate"
				, Результат
				, СсылкаНаДокумент
				, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру InvoiceContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = Новый_InvoiceContent();
	
	МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЗаполнитьКонтентInvoice"
				, Результат
				, СсылкаНаДокумент
				, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру InvoiceCorrectionContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентКорректировочногоСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = Новый_InvoiceCorrectionContent();
	
	МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЗаполнитьКонтентInvoiceCorrection"
				, Результат
				, СсылкаНаДокумент
				, ПараметрыФормирования);
	
	РассчитатьСуммыУвеличенияУменьшенияВКонтентеКСФ(Результат);
	
	Возврат Результат;
	
КонецФункции

// Определяет значение параметра ФункцияУПД, используемого в
// методах заполнения контента. Алгоритм следующий:
//  - Пробуем определить результат по имени типа электронного документа (typeNamedId);
//  - В случае неудачи берем значение функции из формата отправки;
//  - Если результат не определен, возвращаем функцию по умолчанию;
//
// Параметры:
//  ФорматОтправки - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента;
// 
// Возвращаемое значение:
//  Строка - возможные значения указаны в перечислении ФункцииЭлектронныхДокументов;
//
Функция ФункцияУниверсальногоДокумента(ФорматОтправки)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	ИмяТипа = ФорматОтправки.ИмяТипа;
	
	Если ИмяТипа = ТипыДокументов.Invoice
		Или ИмяТипа = ТипыДокументов.InvoiceRevision Тогда
		
		Результат = ФункцииЭД.СЧФ;
		
	ИначеЕсли ИмяТипа = ТипыДокументов.InvoiceCorrection
		Или ИмяТипа = ТипыДокументов.InvoiceCorrectionRevision Тогда
		
		Результат = ФункцииЭД.КСЧФ;
		
	ИначеЕсли ИмяТипа = ТипыДокументов.XmlTorg12
		Или ИмяТипа = ТипыДокументов.XmlAcceptanceCertificate Тогда
		
		Результат = ФункцииЭД.ДОП;
		
	Иначе
		
		Результат = ФорматОтправки.ФункцияДокумента;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ФункцииЭД.ПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, является ли строка корректировочного документа (ucd) новой.
//
// Параметры:
//  Item - СтрокаТаблицыЗначений - элемент коллекции UcdSellerContent.InvoiceCorrectionTable.Items.
// 
// Возвращаемое значение:
//  Булево - Истина, если это новая строка (её не было в исходном документе).
// 
Функция ЭтоНоваяСтрокаКорректировки(Item)
	
	ЗначенияДоИзменения = Item.OriginalValues;
	
	Результат = Истина;
	
	Если ЗначениеЗаполнено(ЗначенияДоИзменения.Quantity)
		Или ЗначениеЗаполнено(ЗначенияДоИзменения.TotalWithVatExcluded)
		Или ЗначениеЗаполнено(ЗначенияДоИзменения.Total)
		Или ЗначениеЗаполнено(ЗначенияДоИзменения.Vat) Тогда
		
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтавкиНДС

// Получает ссылку на прикладное значение ставки НДС по ее представлению.
//
// Параметры:
//  ПредставлениеСтавки - Строка, Число - представление ставки НДС;
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС - для подсистемы УТ редакции 11.4 и ниже;
//  СправочникСсылка.СтавкиНДС - для УТ редакции 11.5 и выше.
//
Функция ПрикладнаяСтавкаНДС(ПредставлениеСтавки) Экспорт
	
	Замены = Новый Соответствие;
	Замены.Вставить("ИсчНалАг", "НДС исчисляется налоговым агентом");
	
	ПредставлениеБЭД = Замены.Получить(ПредставлениеСтавки);
	Если Не ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		ПредставлениеБЭД = ПредставлениеСтавки;
	КонецЕсли;
	
	Если ИспользуетсяБЭД19() Тогда
		// Функция ФорматыЭДОПовтИсп.СтавкаНДСИзПредставления
		// БЭД 1.9.12.44 не поддерживает новые ставки
		// БЭД 1.9.14.22 поддерживает новые ставки
		Если ИспользуетсяБЭД191422ИВыше() Тогда
			МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ФорматыЭДОПовтИсп");
			Результат = МодульБЭД.СтавкаНДСИзПредставления(ПредставлениеБЭД);
		Иначе
			Результат = СтавкаНДСИзПредставленияЛок(ПредставлениеБЭД);
		КонецЕсли;
	Иначе
		МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиПовтИсп");
		Результат = МодульБЭД.СтавкаНДСИзПредставления(ПредставлениеБЭД);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция преобразует из представления ставки НДС в значение перечисления.
// взято из БЭД 1.9.14.22
// поддержка новых ставок
//
// Параметры:
//  ПредставлениеСтавкиНДС - Число, Строка - представление ставки НДС;
//
// Возвращаемое значение:
//   ПеречислениеСсылка, СправочникСсылка, Неопределено - значение ставки НДС прикладного решения.
//
Функция СтавкаНДСИзПредставленияЛок(ПредставлениеСтавкиНДС) Экспорт
	
	ЗначениеНДС = Неопределено;
	
	Если ТипЗнч(ПредставлениеСтавкиНДС) = Тип("Строка") Тогда
		СтрСтавкаНДС = СокрЛП(ПредставлениеСтавкиНДС);
	ИначеЕсли ТипЗнч(ПредставлениеСтавкиНДС) = Тип("Число") Тогда
		СтрСтавкаНДС = Строка(ПредставлениеСтавкиНДС);
	Иначе // неправильный тип
		СтрСтавкаНДС = Неопределено;
	КонецЕсли;
	
	Если СтрСтавкаНДС = Неопределено ИЛИ СтрНайти(НСтр("ru ='БЕЗ НДС'"), ВРег(СтрСтавкаНДС)) > 0 Тогда
		ЗначениеНДС = НСтр("ru ='без НДС'");
	Иначе
		СтрСтавкаНДС = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрСтавкаНДС, ",", "."), "\", "/"), " ", ""), "%", "");
		// # - разделитель представлений ставок.
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5#0.05#0.050", СтрСтавкаНДС) > 0 Тогда	
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7#0.07#0.070", СтрСтавкаНДС) > 0 Тогда	
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("9.09", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "9,09";	
		ИначеЕсли СтрНайти("16.67", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "16,67";
		ИначеЕсли СтрНайти("18.03", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18,03";
		ИначеЕсли СтрНайти("10#0.1#0.10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18#0.18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20#0.2#0.20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22#0.22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("5/105", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5/105";	
		ИначеЕсли СтрНайти("7/107", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7/107";	
		ИначеЕсли СтрНайти("10/110#0.0909#9.0909", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118#0.1525#15.2542", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120#0.1667#16.6667", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122#0.1803#18.0327", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавкиНДС;
		КонецЕсли;
	КонецЕсли;
	
	СтавкаНДС = СтавкаНДСИзСоответствияЛок(ЗначениеНДС);
	
	Возврат СтавкаНДС;
	
КонецФункции

Функция СтавкаНДСИзСоответствияЛок(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Если ИспользуетсяБЭД19() Тогда
		МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЭДО");
	Иначе
		МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиПовтИсп");
	КонецЕсли;
	
	Результат = МодульБЭД.СтавкаНДСИзСоответствия(ПредставлениеБЭД, ПрикладноеЗначение);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДС20()
	
	ПредставлениеСтавки = ПредставлениеСтавкиНДС20();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДС18()
	
	ПредставлениеСтавки = ПредставлениеСтавкиНДС18();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДС10()
	
	ПредставлениеСтавки = ПредставлениеСтавкиНДС10();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДС0()
	
	ПредставлениеСтавки = ПредставлениеСтавкиНДС0();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаБезНДС() Экспорт
	
	ПредставлениеСтавки = ПредставлениеСтавкиБезНДС();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДС20_120()
	
	ПредставлениеСтавки = ПредставлениеСтавкиНДС20_120();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДС18_118()
	
	ПредставлениеСтавки = ПредставлениеСтавкиНДС18_118();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДС10_110()
	
	ПредставлениеСтавки = ПредставлениеСтавкиНДС10_110();
	Результат = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиНДС20()
	Возврат "20";
КонецФункции

Функция ПредставлениеСтавкиНДС18()
	Возврат "18";
КонецФункции

Функция ПредставлениеСтавкиНДС10()
	Возврат "10";
КонецФункции

Функция ПредставлениеСтавкиНДС0()
	Возврат "0";
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	Возврат "без НДС";
КонецФункции

Функция ПредставлениеСтавкиНДС20_120()
	Возврат "20/120";
КонецФункции

Функция ПредставлениеСтавкиНДС18_118()
	Возврат "18/118";
КонецФункции

Функция ПредставлениеСтавкиНДС10_110()
	Возврат "10/110";
КонецФункции

Функция ПредставлениеПрикладнойСтавкиНДС(СтавкаНДС) Экспорт
	
	Если ТипЗнч(СтавкаНДС) = Тип("Строка") Тогда
		
		Результат = СтавкаНДС;
		
	ИначеЕсли Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		
		Результат = "##";
		
	Иначе
		
		Если ИспользуетсяБЭД19() Тогда
			МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЭДО");
		Иначе
			МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиПовтИсп");
		КонецЕсли;
		
		Результат = МодульБЭД.СтавкаНДСИзСоответствия(, СтавкаНДС);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СокрЛП(СтавкаНДС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РасчетноеПредставлениеСтавкиНДС(СуммаБезНалога, СуммаНалога)
	
	Если СуммаНалога = Неопределено Тогда // без НДС
		Возврат ПредставлениеСтавкиБезНДС();
	КонецЕсли;
	
	РасчетнаяСтавка = 0;
	Если ЗначениеЗаполнено(СуммаБезНалога) Тогда
		РасчетнаяСтавка = 100 * СуммаНалога / СуммаБезНалога;
	КонецЕсли;
	
	Если РасчетнаяСтавка < 5 Тогда
		Результат = "0";
	ИначеЕсли РасчетнаяСтавка < 14 Тогда
		Результат = "10";
	ИначеЕсли РасчетнаяСтавка < 19 Тогда
		Результат = "18";
	Иначе
		Результат = "20";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСтавкаБезНДС(Ставка) Экспорт
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(Ставка)
		Или Ставка = СтавкаБезНДС()
		Или НРег(Ставка) = НРег(ПредставлениеСтавкиБезНДС()) Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что указанное представление ставки НДС соответствует ставке "НДС исчисляется налоговым агентом".
//
// Параметры:
//  ПредставлениеСтавки - Строка - Представление ставки НДС.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоСтавкаНДСИНА(Знач ПредставлениеСтавки) Экспорт
	
	Результат = Ложь;
	
	ПредставлениеСтавки = ВРег(ПредставлениеСтавки);
	
	Если ПредставлениеСтавки = ВРег("ИсчНалАг") 
		Или ПредставлениеСтавки = ВРег("НДС исчисляется налоговым агентом") Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение ставки НДС по умолчанию.
//
// Параметры:
//  Период - Дата - дата на которую необходимо получить ставку НДС по умолчанию,
//               если дата пустая, то будет получена ставка НДС на текущую дату
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС - значение ставки НДС.
//
Функция ОбщаяСтавкаНДС(Период = Неопределено) Экспорт
	
	ДатаПолучения = ?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса());
	
	Если ДатаПолучения < ДатаПримененияНДС20() Тогда
		Результат = СтавкаНДС18();
	Иначе
		Результат = СтавкаНДС20();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение расчетной ставки НДС по умолчанию.
//
// Параметры:
//  Период - Дата - дата на которую необходимо получить ставку НДС по умолчанию,
//               если дата пустая, то будет получена ставка НДС на текущую дату
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС - значение ставки НДС.
//
Функция ОбщаяРасчетнаяСтавкаНДС(Период = Неопределено) Экспорт
	
	ДатаПолучения = ?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса());
	
	Если ДатаПолучения >= ДатаПримененияНДС20() Тогда
		Результат = СтавкаНДС20_120();
	Иначе
		Результат = СтавкаНДС18_118();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаПримененияНДС20()
	Возврат '20190101';
КонецФункции

#КонецОбласти

// Получает основные сведения о признаках и свойствах, характеризующих объект информационной базы.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на потенциальный источник сведений для формирования электронного документа;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * Ссылка - ЛюбаяСсылка - ссылка на исходный документ
//    * Проведен - Булево - Истина, если объект является документом и проведен
//    * ПометкаУдаления - Булево - Истина, если объект помечен на удаление
//    * Дата - Дата - Системная дата документа
//    * Номер - Строка - Системный номер объекта
//    * ЭтоИсравление - Булево - Истина, если это исправительный документ
//    * ЭтоКорректировка - Булево - Истина, если это корректировочный документ
//    * ВидДокумента - Строка - вид документа с точки зрения ЭДО (см. ВидыЭлектронныхДокументов)
//
Функция ОписаниеПрикладногоДокумента(СсылкаНаОбъект) Экспорт
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Ссылка");
	ТребуемыеРеквизиты.Вставить("Проведен");
	ТребуемыеРеквизиты.Вставить("ПометкаУдаления");
	ТребуемыеРеквизиты.Вставить("Дата");
	ТребуемыеРеквизиты.Вставить("Номер");
	ТребуемыеРеквизиты.Вставить("ЭтоКорректировка", "ЛОЖЬ");
	ТребуемыеРеквизиты.Вставить("ЭтоИсправление", "ЛОЖЬ");
	
	ЭтоДокумент = Метаданные.Документы.Содержит(СсылкаНаОбъект.Метаданные());
	Если Не ЭтоДокумент Тогда
		ТребуемыеРеквизиты.Проведен = "ЛОЖЬ";
	КонецЕсли;
	
	ПриПолученииОписанияПрикладногоДокумента(ТребуемыеРеквизиты, СсылкаНаОбъект);
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, ТребуемыеРеквизиты);
	
	РеквизитыТипаБулево = Новый Массив;
	РеквизитыТипаБулево.Добавить("Проведен");
	РеквизитыТипаБулево.Добавить("ПометкаУдаления");
	РеквизитыТипаБулево.Добавить("ЭтоКорректировка");
	РеквизитыТипаБулево.Добавить("ЭтоИсправление");
	
	Для Каждого ИмяРеквизита Из РеквизитыТипаБулево Цикл
		
		Если Результат[ИмяРеквизита] = Неопределено Тогда
			Результат[ИмяРеквизита] = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ВидДокумента = ВидДокументаИнформационнойБазы(СсылкаНаОбъект, Результат.ЭтоКорректировка);
	
	Результат.Вставить("ВидДокумента", ВидДокумента);
	
	Возврат Результат;
	
КонецФункции

// Возвращает сведения о дате и номере документа, необходимые для формирования электронных документов и печатных форм.
//
// Параметры:
//  ОписаниеДокумента - Структура - параметры объекта ИБ (см. ОписаниеПрикладногоДокумента)
//  ЦифровойИндексОП - Строка, Число - цифровой индекс обособленного подразделения
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//    * НомерДокумента - Строка - представление номера документа;
//    * ДатаДокумента - Дата - дата документа;
//    * НомерИсправления - Строка - (необязательный) номер исправления документа;
//    * ДатаИсправления - Дата - (необязательный) дата исправления документа;
//    * НомерИсходногоДокумента - Строка - (необязательный) представление номера корректируемого документа;
//    * ДатаИсходногоДокумента - Дата - (необязательный) дата корректируемого документа;
//    * УчитыватьИсправлениеИсходногоДокумента - Булево - Истина, если требуется учитывать дату и номер исправления корректируемого документа;
//    * НомерИсправленияИсходногоДокумента - Строка - (необязательный) номер исправления корректируемого документа;
//    * ДатаИсправленияИсходногоДокумента - Дата - (необязательный) дата исправления корректируемого документа;
//
Функция ДатаНомерДокумента(ОписаниеДокумента, ЦифровойИндексОП) Экспорт
	
	СсылкаНаОбъект 		= ОписаниеДокумента.Ссылка;
	ЭтоКорректировка 	= ОписаниеДокумента.ЭтоКорректировка;
	
	Результат = Новый Структура;
	Результат.Вставить("НомерДокумента");
	Результат.Вставить("ДатаДокумента");
	Результат.Вставить("НомерИсправления");
	Результат.Вставить("ДатаИсправления");
	
	ИмяПроцедурыЗаполнения = "ЗаполнитьСведенияОДатеИНомереДокумента";
	
	Если ЭтоКорректировка Тогда
		
		Результат.Вставить("ДатаНомерДокументовОснований", Новый Массив);
		
		//Результат.Вставить("НомерИсходногоДокумента");
		//Результат.Вставить("ДатаИсходногоДокумента");
		//Результат.Вставить("НомерИсправленияИсходногоДокумента");
		//Результат.Вставить("ДатаИсправленияИсходногоДокумента");
		//Результат.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
		
		ИмяПроцедурыЗаполнения = "ЗаполнитьСведенияОДатеИНомереКорректировочногоДокумента";
		
	КонецЕсли;
	
	МетодСервера(ИмяМодуляИнтеграции(), ИмяПроцедурыЗаполнения
		, Результат
		, ОписаниеДокумента
		, ЦифровойИндексОП);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ДатаНомерДокументаОснования() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НомерДокумента");
	Результат.Вставить("ДатаДокумента");
	Результат.Вставить("НомерИсправления");
	Результат.Вставить("ДатаИсправления");
	
	Результат.Вставить("НомерИсходногоДокумента");
	Результат.Вставить("ДатаИсходногоДокумента");
	Результат.Вставить("НомерИсправленияИсходногоДокумента");
	Результат.Вставить("ДатаИсправленияИсходногоДокумента");
	Результат.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Дополняет номер документа и номер исходного документа (для корректировки) цифровым индексом обособленного подразделения
//
// Параметры:
//  ДатаНомер		 - Структура - см. метод ДатаНомерДокумента()
//  ЦифровойИндексОП - Число	 - цифровой индекс обособленного подразделения (может быть пустым)
//
Процедура ДополнитьНомерЦифровымИндексомОП(ДатаНомер, ЦифровойИндексОП) Экспорт
	
	Если Не ЗначениеЗаполнено(ЦифровойИндексОП) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонНомера = "%1/%2";
		
	ДатаНомер.НомерДокумента = СтрШаблон(ШаблонНомера, ДатаНомер.НомерДокумента, ЦифровойИндексОП);
	
	ДанныеОснований = СвойствоСтруктуры(ДатаНомер, "ДатаНомерДокументовОснований", Новый Массив);
	Для каждого НомераОснования Из ДанныеОснований Цикл
		Если ЗначениеЗаполнено(НомераОснования.НомерИсходногоДокумента) Тогда
			НомераОснования.НомерИсходногоДокумента = СтрШаблон(ШаблонНомера, НомераОснования.НомерИсходногоДокумента, ЦифровойИндексОП);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИмяМодуляИнтеграции()
	
	Результат = "Модуль_Интеграция" + ПараметрыКлиентСервер.МаркерКонфигурации;
	Возврат Результат;
	
КонецФункции

// Проверяет, что в интеграционном модуле используется "старый" алгоритм 
// получения данных табличной части.
// 
// Возвращаемое значение:
//  Булево - Истина, если для получения данных табличной части используется устаревший метод "ПолучитьДанныеТЧ".
//
Функция ИспользуетсяМетодПолучитьДанныеТЧ()
	
	Результат = Истина;
	
	ИдентификаторКонфигурации = ВРег(ПараметрыКлиентСервер.МаркерКонфигурации);
	
	Если ИдентификаторКонфигурации = "УНФ16" Тогда 
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает данные товарной части документа по "старому" алгоритму
// и преобразует их в соответствии с контрактом функции ДанныеТабличныхЧастей.
//
// Параметры:
//  Шапка - Структура - см. функцию ДанныеШапки()
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ДанныеТабличныхЧастей()
//
Функция ПолучитьДанныеТЧ(Шапка)
	
	ПромежуточныйРезультат = МетодСервера(ИмяМодуляИнтеграции(), "ПолучитьДанныеТЧ", Шапка.ОписаниеДокумента.Ссылка);
	
	ОписаниеСтрокиТЧ = НоваяСтрокаТоварнойЧасти();
	Результат = Новый ТаблицаЗначений;
	
	Для Каждого Элемент Из ОписаниеСтрокиТЧ Цикл 
		Результат.Колонки.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Счетчик = 0;
	
	Для Каждого СтрокаИсточник Из ПромежуточныйРезультат Цикл 
		
		Счетчик = Счетчик + 1;
		
		СтрокаПриемник = Результат.Добавить();
		СтрокаПриемник.НомерСтроки = Счетчик;
		СтрокаПриемник.ИмяТабличнойЧасти = "Неопределено";
		
		СтрокаПриемник.Номенклатура = СтрокаИсточник.Номенклатура;
		СтрокаПриемник.Характеристика = СтрокаИсточник.Характеристика;
		СтрокаПриемник.Серия = СтрокаИсточник.Серия;
		СтрокаПриемник.ЕдиницаИзмерения = СтрокаИсточник.ЕдиницаИзмерения;
		
		СтрокаПриемник.НоменклатураКод = СтрокаИсточник.КодНоменклатуры;
		СтрокаПриемник.НоменклатураПредставление = СтрокаИсточник.НоменклатураПредставление;
		
		СтрокаПриемник.ВидУпаковки = СтрокаИсточник.ВидУпаковки;
		СтрокаПриемник.ЕдиницаИзмеренияКод = СтрокаИсточник.КодЕдиницыИзмерения;
		
		СтрокаПриемник.ПризнакТоварРаботаУслуга = СтрокаИсточник.ПризнакТоварРаботаУслуга;
		СтрокаПриемник.ЭтоУслуга = СтрокаИсточник.ЭтоУслуга;
		
		СтрокаПриемник.СтавкаНДС = СтрокаИсточник.СтавкаНДС;
		СтрокаПриемник.СтавкаНДСПредставление = ПредставлениеПрикладнойСтавкиНДС(СтрокаПриемник.СтавкаНДС);
		
		СтрокаПриемник.НомерГТД = СтрокаИсточник.НомерГТД;
		СтрокаПриемник.СтранаПроисхождения = СтрокаИсточник.СтранаПроисхождения;
		Если ЗначениеЗаполнено(СтрокаПриемник.СтранаПроисхождения) Тогда 
			СтрокаПриемник.СтранаПроисхожденияКод = СтрокаПриемник.СтранаПроисхождения.Код;
		КонецЕсли;
		
		СтрокаПриемник.Количество = СтрокаИсточник.Количество;
		СтрокаПриемник.КоличествоВОдномМесте = СтрокаИсточник.КоличествоВОдномМесте;
		СтрокаПриемник.КоличествоМест = СтрокаИсточник.КоличествоМест;
		СтрокаПриемник.Масса = СтрокаИсточник.Масса;
		
		СтрокаПриемник.СуммаНДС = СтрокаИсточник.СуммаНДС;
		Если Шапка.ЦенаВключаетНДС Тогда 
			СтрокаПриемник.СуммаСНДС = СтрокаИсточник.Сумма;
			СтрокаПриемник.Цена		 = СтрокаПриемник.СуммаСНДС / ?(ЗначениеЗаполнено(СтрокаПриемник.Количество), СтрокаПриемник.Количество, 1);
		Иначе
			СтрокаПриемник.СуммаСНДС = СтрокаИсточник.Сумма + СтрокаИсточник.СуммаНДС;
			СтрокаПриемник.Цена		 = СтрокаИсточник.Цена;
		КонецЕсли;
		СтрокаПриемник.Сумма = СтрокаПриемник.СуммаСНДС - СтрокаПриемник.СуммаНДС;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив имен табличных частей документа, содержащих его товарную часть.
//
// Параметры:
//  Шапка - Структура - см. функцию ДанныеШапки
// 
// Возвращаемое значение:
//  Массив - содержит имена табличных частей с товарами, услугами, работами.
//
Функция ИменаТабличныхЧастейДокумента(Шапка)
	
	Результат			 = Новый Массив;
	СтандартнаяОбработка = Истина;
	
	СсылкаНаОбъект = Шапка.ОписаниеДокумента.Ссылка;
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	
	ПриПолученииИменТабличныхЧастей(МетаданныеОбъекта, Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		ПолноеИмяДокумента = МетаданныеОбъекта.ПолноеИмя();
		
		ПроверяемыеИменаТЧ = Новый Массив;
		ПроверяемыеИменаТЧ.Добавить("Товары");
		ПроверяемыеИменаТЧ.Добавить("Услуги");
		ПроверяемыеИменаТЧ.Добавить("РаботыИУслуги");
		
		Для Каждого ИмяТЧ Из ПроверяемыеИменаТЧ Цикл 
			
			Если СуществуетОбъектМетаданных(ПолноеИмяДокумента + ".ТабличнаяЧасть." + ИмяТЧ) Тогда
				Результат.Добавить(ИмяТЧ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет существование объекта метаданных по его полному имени.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - полное имя объекта метаданных.
// 
// Возвращаемое значение:
//  Булево - Истина, если объект с заданным именем существует.
//
// Пример:
//   ЕстьКорректировкиРТУ	 = СуществуетОбъектМетаданных("Документ.КорректировкаРеализации");
//   ЕстьГрузооотправитель	 = СуществуетОбъектМетаданных("Документ.РеализацияТоваровУслуг.Реквизит.Грузоотправитель");
//   ЕстьРеквизитКодТНВЭД	 = СуществуетОбъектМетаданных("Документ.РасходнаяНакладная.ТабличнаяЧасть.Запасы.Реквизит.КодТНВЭД");
//
Функция СуществуетОбъектМетаданных(ПолноеИмяОбъекта)
	
	Возврат МетодСервера(, "СуществуетОбъектМетаданных", ПолноеИмяОбъекта);
	
КонецФункции

// Универсальный метод для получения данных табличной части документа.
//
// Параметры:
//  Шапка				 - Структура - см. функцию ДанныеШапки
//  ИмяТабличнойЧасти	 - Строка	 - имя табличной части.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит данные табличной части документа.
//
Функция ТабличнаяЧастьДокумента(Шапка, ИмяТабличнойЧасти)
	
	Реквизиты = НоваяСтрокаТоварнойЧасти();
	Реквизиты.ИмяТабличнойЧасти = СтрШаблон("""%1""", ИмяТабличнойЧасти);
	
	Реквизиты.НоменклатураПредставление = "Содержание";
	Реквизиты.ЭтоУслуга = "ЛОЖЬ";
	Реквизиты.ПризнакТоварРаботаУслуга = """Property""";
	
	ИмяКолонкиКодНоменклатуры = ИмяКолонкиКодТовара();
	Если ЗначениеЗаполнено(ИмяКолонкиКодНоменклатуры) Тогда 
		Реквизиты.НоменклатураКод = "Номенклатура." + ИмяКолонкиКодНоменклатуры;
	Иначе 
		Реквизиты.НоменклатураКод = """""";
	КонецЕсли;
	
	СсылкаНаОбъект = Шапка.ОписаниеДокумента.Ссылка;
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	МетаданныеТЧ = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	
	ПараметрыЗапроса = Новый Структура;
	ПриПодготовкеЗапросаПоТоварнойЧастиДокумента(Шапка, ИмяТабличнойЧасти, Реквизиты, ПараметрыЗапроса);
	
	ЗаполнитьВыраженияПолейЗапроса(Реквизиты, МетаданныеТЧ);
	
	ТабличнаяЧасть = ЗначенияРеквизитовТабличнойЧасти(СсылкаНаОбъект, ИмяТабличнойЧасти, Реквизиты, ПараметрыЗапроса);
	
	Возврат ТабличнаяЧасть;
	
КонецФункции

// Возвращает параметры учета номенклатуры в текущей информационной базе.
// 
// Возвращаемое значение:
//  ФикисированнаяСтруктура - содержит ключи:
//    * ИспользоватьХарактеристики - Булево - Истина, если используются характеристики номенклатуры
//    * ИспользоватьУпаковки - Булево - Истина, если используются упаковки номенклатуры
//    * ИспользоватьСерии - Булево - Истина, если используются серии номенклатуры
//
Функция ПараметрыУчетаНоменклатуры()
	
	СтандартнаяОбработка = Истина;
	
	ПараметрыНоменклатуры = Новый Структура;
	ПараметрыНоменклатуры.Вставить("ИспользоватьХарактеристики", Ложь);
	ПараметрыНоменклатуры.Вставить("ИспользоватьСерии", Ложь);
	
	ПриЗаполненииПараметровУчетаНоменклатуры(ПараметрыНоменклатуры, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		Если Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") <> Неопределено Тогда
			ПараметрыНоменклатуры.ИспользоватьХарактеристики = Истина;
		КонецЕсли;
		
		Если Метаданные.Справочники.Найти("СерииНоменклатуры") <> Неопределено Тогда
			ПараметрыНоменклатуры.ИспользоватьСерии = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(ПараметрыНоменклатуры);
	
	Возврат Результат;
	
КонецФункции

// TODO: Заполнить описание
// 
// Возвращаемое значение:
//  Структура - ключи структуры соответствуют именам колонок таблицы значений с данными ТЧ.
//
Функция НоваяСтрокаТоварнойЧасти()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяТабличнойЧасти");
	Результат.Вставить("НомерСтроки");
	Результат.Вставить("ИдентификаторСтроки");
	
	Результат.Вставить("НоменклатураПредставление");
	
	Результат.Вставить("Номенклатура");
	Результат.Вставить("НоменклатураКод");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Серия");
	
	Результат.Вставить("Упаковка");
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("ЕдиницаИзмеренияКод");
	Результат.Вставить("ВидУпаковки");
	
	Результат.Вставить("ЭтоУслуга");
	Результат.Вставить("ПризнакТоварРаботаУслуга");
	
	Результат.Вставить("СтранаПроисхождения");
	Результат.Вставить("СтранаПроисхожденияКод");
	
	Результат.Вставить("НомерГТД");
	Результат.Вставить("КодТНВЭД");
	
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("СтавкаНДСПредставление");
	
	Результат.Вставить("Количество");
	Результат.Вставить("КоличествоВОдномМесте");
	Результат.Вставить("КоличествоМест");
	Результат.Вставить("Цена");
	Результат.Вставить("Сумма");
	Результат.Вставить("СуммаНДС");
	Результат.Вставить("СуммаСНДС");
	Результат.Вставить("Масса");
	Результат.Вставить("МассаНетто");
	
	Результат.Вставить("СтранаПроисхожденияДоИзменения");
	Результат.Вставить("СтранаПроисхожденияДоИзмененияКод");
	
	Результат.Вставить("УпаковкаДоИзменения");
	Результат.Вставить("ЕдиницаИзмеренияДоИзменения");
	Результат.Вставить("ЕдиницаИзмеренияДоИзмененияКод");
	
	Результат.Вставить("НомерГТДДоИзменения");
	Результат.Вставить("КодТНВЭДДоИзменения");
	Результат.Вставить("СтавкаНДСДоИзменения");
	Результат.Вставить("СтавкаНДСДоИзмененияПредставление");
	
	Результат.Вставить("КоличествоДоИзменения");
	Результат.Вставить("ЦенаДоИзменения");
	Результат.Вставить("СуммаДоИзменения");
	Результат.Вставить("СуммаНДСДоИзменения");
	Результат.Вставить("СуммаСНДСДоИзменения");
	
	Результат.Вставить("СуммаАкциза");
	Результат.Вставить("СуммаАкцизаДоИзменения");
	
	Результат.Вставить("НомерГТДПредставление");
	
	Результат.Вставить("ДокументОтгрузки");
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданный параметр может использоваться в качестве ключа структуры:
// ключ может быть только строковым и должен удовлетворять требованиям, 
// предъявляемым к именованию переменных встроенного языка.
//
// Параметры:
//  ПроверяемоеЗначение - Произвольный - Произвольное значение.
// 
// Возвращаемое значение:
//  Булево - Истина, если проверяемое значение может использоваться в качестве ключа структуры.
//
Функция СтрокаСоответствуетТребованиямККлючуСтруктуры(ПроверяемоеЗначение)
	
	Результат = Ложь;
	
	Если Ложь
		Или ПроверяемоеЗначение = "НЕОПРЕДЕЛЕНО"
		Или ПроверяемоеЗначение = "ИСТИНА"
		Или ПроверяемоеЗначение = "ЛОЖЬ" Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипЗнч(ПроверяемоеЗначение) = Тип("Строка") И ПроверяемоеЗначение = СокрЛП(ПроверяемоеЗначение) Тогда
		
		Попытка
			НоваяСтруктура = Новый Структура(ПроверяемоеЗначение);
			Результат = (НоваяСтруктура.Количество() = 1);
		Исключение КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет существование реквизитов, значения которых нужно получить.
// Если требуемый реквизит отсутствует, то выражение для получения его значения
// заменяется на "НЕОПРЕДЕЛЕНО".
// Выражения для получения значений и представлений реквизитов ссылочных типов
// автоматически заменяются на "<ИмяРеквизита>" и "ПРЕДСТАВЛЕНИЕ(<ИмяРеквизита>)".
//
// Параметры:
//  Реквизиты			 - Структура - в качестве ключа передается псевдоним поля для возвращаемой структуры с результатом, 
//                                     а в качестве значения (опционально) фактическое имя поля в таблице или произвольное выражение.
//                                     Если ключ задан, а значение не определено, то имя поля берется из ключа.
//  МетаданныеИсточника	 - ОбъектМетаданных - Метаданные документа или его табличной части.
//
Процедура ЗаполнитьВыраженияПолейЗапроса(Реквизиты, МетаданныеИсточника)
	
	Для Каждого ОписаниеРеквизита Из Реквизиты Цикл 
		
		Псевдоним = ОписаниеРеквизита.Ключ;
		Выражение = ОписаниеРеквизита.Значение;
		
		Если Не ЗначениеЗаполнено(Выражение) Тогда 
			Выражение = Псевдоним;
		КонецЕсли;
		
		Если Не СтрокаСоответствуетТребованиямККлючуСтруктуры(Выражение) Тогда 
			// Значит, это не имя реквизита, а сложное выражение или поле, получаемое через точку.
			// Такие выражения обрабатывать не будем, а в случае ошибки выполнение запроса выпадет в исключение.
			Продолжить;
		КонецЕсли;
		
		// Будем искать реквизит, для которого строится выражение поля запроса.
		// Если такой реквизит не найдется, запишем в выражение поля запроса "НЕОПРЕДЕЛЕНО".
		РеквизитНайден = Ложь;
		
		Если ЕстьРеквизитМетаданных(МетаданныеИсточника, Выражение, Истина)
			Или ВРег(Выражение) = "ССЫЛКА" Тогда
			
			РеквизитНайден = Истина;
			Реквизиты.Вставить(Псевдоним, Выражение);
			
		Иначе // Проверим, можно ли получить требуемое поле через точку от реквизита.
			
			// Будем проверять только наиболее часто встречающиеся разыменования
			ВозможныеПоляРеквизита = Новый Массив;
			ВозможныеПоляРеквизита.Добавить("Код");
			ВозможныеПоляРеквизита.Добавить("Наименование");
			
			Для Каждого ПолеЧерезТочку Из ВозможныеПоляРеквизита Цикл 
				
				Если Не СтрокаЗаканчиваетсяНа(Выражение, ПолеЧерезТочку) Тогда 
					Продолжить;
				КонецЕсли;
				
				ИмяРеквизита = ОбрезатьСтрокуСправа(Выражение, СтрДлина(ПолеЧерезТочку));
				
				Если ЕстьРеквизитМетаданных(МетаданныеИсточника, ИмяРеквизита) Тогда
					
					РеквизитНайден = Истина;
					Выражение = "ЕСТЬNULL(%1.%2, НЕОПРЕДЕЛЕНО)";
					Выражение = СтрЗаменить(Выражение, "%1", ИмяРеквизита);
					Выражение = СтрЗаменить(Выражение, "%2", ПолеЧерезТочку);
					
					Реквизиты.Вставить(Псевдоним, Выражение);
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не РеквизитНайден Тогда 
			Реквизиты.Вставить(Псевдоним, "НЕОПРЕДЕЛЕНО");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в структуру шапки документа сведения о юридических и физических лицах.
//
// Параметры:
//  ДанныеШапки - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуРеквизитамиЮрФизЛиц(ДанныеШапки)
	
	ЮрФизЛицаДокумента = Новый Структура; // ключ - имя реквизита со ссылкой на юр. или физ. лицо, значение - ссылка на банковский счет юр. или физ. лица
	ЮрФизЛицаДокумента.Вставить("Организация"		, "БанковскийСчетОрганизации");
	ЮрФизЛицаДокумента.Вставить("Контрагент"		, "БанковскийСчетКонтрагента");
	ЮрФизЛицаДокумента.Вставить("Грузоотправитель"	, "БанковскийСчетГрузоотправителя");
	ЮрФизЛицаДокумента.Вставить("Грузополучатель"	, "БанковскийСчетГрузополучателя");
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	ДатаДокумента = ДатаНомер.ДатаДокумента;
	
	Для Каждого Элемент Из ЮрФизЛицаДокумента Цикл 
		
		ИмяРеквизита_ЮрФизЛицо		 = Элемент.Ключ;
		ИмяРеквизита_БанковскийСчет	 = Элемент.Значение;
		
		ЮрФизЛицо		 = Неопределено;
		БанковскийСчет	 = Неопределено;
		
		ДанныеШапки.Свойство(ИмяРеквизита_ЮрФизЛицо		, ЮрФизЛицо);
		ДанныеШапки.Свойство(ИмяРеквизита_БанковскийСчет, БанковскийСчет);
		
		Реквизиты = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчет);
		ДанныеШапки.Вставить(ИмяРеквизита_ЮрФизЛицо + "Реквизиты", Реквизиты);
		
	КонецЦикла;
	
КонецПроцедуры

Функция РасчетноеПредставлениеНомера(Знач НомерОбъекта)
	
	СтандартнаяОбработка = Истина;
	ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		МодульПрефиксацияОбъектов = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
		НомерОбъекта = МодульПрефиксацияОбъектов.НомерНаПечать(НомерОбъекта);
		
	КонецЕсли;
	
	Возврат НомерОбъекта;
	
КонецФункции

// Проверяет, заполнены ли в структуре шапки документа поля "КонтрагентИНН" и "КонтрагентКПП".
// Если же значения этих полей не были получены из самого документа, то подставляются ИНН и КПП,
// указанные в карточке контрагента.
//
// Параметры:
//  ДанныеШапки - Структура - см. функцию ДанныеШапки.
//
Процедура ПроверитьЗаполнитьИННКППКонтрагента(ДанныеШапки)
	
	Если Не ЗначениеЗаполнено(ДанныеШапки.КонтрагентИНН) И ЗначениеЗаполнено(ДанныеШапки.КонтрагентРеквизиты.ИНН) Тогда 
		ДанныеШапки.КонтрагентИНН = ДанныеШапки.КонтрагентРеквизиты.ИНН;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеШапки.КонтрагентКПП) И ЗначениеЗаполнено(ДанныеШапки.КонтрагентРеквизиты.КПП) Тогда 
		ДанныеШапки.КонтрагентКПП = ДанныеШапки.КонтрагентРеквизиты.КПП;
	КонецЕсли;
	
КонецПроцедуры

// Конструктор коллекции, содержащей общепринятые реквизиты компании (юридического лица или индивидуального предпринимателя).
// 
// Возвращаемое значение:
// Структура - см. содержимое функции
//
Функция НовыйРеквизитыЮрФизЛица()
	
	Реквизиты = Новый Структура();
	Реквизиты.Вставить("ЮридическоеФизическоеЛицо"); // ЮридическоеЛицо или ФизическоеЛицо
	// Наименования
	Реквизиты.Вставить("Представление",                      "");
	Реквизиты.Вставить("ПолноеНаименование",                 "");
	Реквизиты.Вставить("СокращенноеНаименование",            "");
	Реквизиты.Вставить("НаименованиеДляПечатныхФорм",        "");
	Реквизиты.Вставить("ФамилияИнициалыФизлица",             ""); // Фамилия И.О.
	Реквизиты.Вставить("ФИОФизлица",                         ""); // Фамилия Имя Отчество
	// Адреса и контактная информация
	Реквизиты.Вставить("ЮридическийАдрес",                   "");
	Реквизиты.Вставить("ЗначенияПолейЮридическийАдрес",      ""); // структурированное строковое представление адреса (XML или в формате "9 запятых")
	Реквизиты.Вставить("ЗначениеJSONЮридическийАдрес",       ""); // структурированное строковое представление адреса JSON
	Реквизиты.Вставить("ФактическийАдрес",                   ""); 
	Реквизиты.Вставить("ЗначенияПолейФактическийАдрес",      ""); // структурированное строковое представление адреса (XML или в формате "9 запятых")
	Реквизиты.Вставить("ЗначениеJSONФактическийАдрес",       ""); // структурированное строковое представление адреса JSON
	Реквизиты.Вставить("ПочтовыйАдрес",                      ""); 
	Реквизиты.Вставить("ЗначенияПолейПочтовыйАдрес",         ""); // структурированное строковое представление адреса (XML или в формате "9 запятых")
	Реквизиты.Вставить("ЗначениеJSONПочтовыйАдрес",          ""); // структурированное строковое представление адреса JSON
	Реквизиты.Вставить("Телефоны",                           ""); 
	Реквизиты.Вставить("ЗначениеJSONТелефоны",               ""); // структурированное строковое представление телефона JSON
	Реквизиты.Вставить("ЗначенияПолейТелефоны",              ""); 
	Реквизиты.Вставить("Факс",                               ""); 
	Реквизиты.Вставить("Email",                              "");
	// Регистрационные данные
	Реквизиты.Вставить("ОГРН",                               ""); // Здесь же ОГРНИП для ИП, рег. номер для иностранных контрагентов
	Реквизиты.Вставить("ДатаРегистрации",                    "");
	Реквизиты.Вставить("КодПоОКПО",                          "");
	Реквизиты.Вставить("ИНН",                                "");
	Реквизиты.Вставить("КПП",                                ""); // Только для ЮЛ
	Реквизиты.Вставить("СвидетельствоСерияНомер",            "");           // Только для ИП
	Реквизиты.Вставить("СвидетельствоДатаВыдачи",            '0001-01-01'); // Только для ИП
	Реквизиты.Вставить("Свидетельство",                      ""); // Свидетельство строкой, только для ИП
	Реквизиты.Вставить("ДокументУдостоверяющийЛичность",     ""); // Только для физлица
	Реквизиты.Вставить("ИндивидуальныйПредприниматель",      Неопределено); // Только для организаций-ИП: ссылка на физ. лицо
	Реквизиты.Вставить("СтранаРегистрации",                  Неопределено);
	Реквизиты.Вставить("НалоговыйНомерВСтранеРегистрации",   "");
	// Банковские реквизиты
	Реквизиты.Вставить("НомерСчета",                         "");
	Реквизиты.Вставить("ТекстКорреспондента",                "");
	Реквизиты.Вставить("БИК",                                "");
	Реквизиты.Вставить("Банк",                               "");
	Реквизиты.Вставить("АдресБанка",                         "");
	Реквизиты.Вставить("КоррСчет",                           "");
	// Должностные лица юридического лица
	Реквизиты.Вставить("РуководительФИО"                   , "");
	Реквизиты.Вставить("ДолжностьРуководителяПредставление", "");
	
	Реквизиты.Вставить("ТипЮрФизЛица"					   , ""); // ЮридическоеЛицо, ФизическоеЛицо, ИностраннаяКомпания
	
	Возврат Реквизиты;
	
КонецФункции

// Описывает значения псевдоперечисления ТипыНалогообложенияНДС.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ТипыНалогообложенияНДС()
	
	ЗначенияПеречисления = Новый Структура;
	ЗначенияПеречисления.Вставить("ПродажаОблагаетсяНДС"	, "Продажа облагается НДС");		 // Есть строки с суммой НДС, отличной от нуля.
	ЗначенияПеречисления.Вставить("ПродажаНеОблагаетсяНДС"	, "Продажа не облагается НДС");		 // Все строки по ставке "Без НДС"
	ЗначенияПеречисления.Вставить("ПродажаНаЭкспорт"		, "Продажа на экспорт (ставка 0%)"); // Все строки по ставке "0%"
	ЗначенияПеречисления.Вставить("ОблагаетсяНДСУПокупателя", "Облагается НДС у покупателя");	 // Все строки по ставке "НДС исчисляется налоговым агентом"
	
	Результат = Новый ФиксированнаяСтруктура(ЗначенияПеречисления);
	
	Возврат Результат;
	
КонецФункции

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКИ()
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес", "ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	Результат.Вставить("Факс", "Факс");
	
	Возврат Результат;
	
КонецФункции

// Создает структуру параметров для заполнения служебной информации о документе,
// которая будет передана в протоструктуру контента документа.
// 
// Возвращаемое значение:
//  Структура.
//
Функция НоваяСлужебнаяИнформацияШапки()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	
	Возврат Результат;
	
КонецФункции

// Создает структуру параметров для заполнения служебной информации о строке документа,
// которая будет передана в протоструктуру контента документа.
// 
// Возвращаемое значение:
//  Структура.
//
Функция НоваяСлужебнаяИнформацияСтроки()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Характеристика");
	Результат.Вставить("СтранаПроисхождения");
	Результат.Вставить("Серия");
	
	// Упаковки (единицы) номенклатуры
	Результат.Вставить("Упаковка");
	Результат.Вставить("УпаковкаДоИзменения");
	
	// Единицы по классификатору
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("ЕдиницаИзмеренияДоИзменения");
	
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("СтавкаНДСДоИзменения");
	Результат.Вставить("ПрослеживаемыйТовар"	, Ложь);
	Результат.Вставить("ДанныеПрослеживаемости"	, Новый Массив);
	Результат.Вставить("ДокументОтгрузки");
	
	Возврат Результат;
	
КонецФункции

Функция СсылочноеЗначениеСвойстваИсточникаДанных(ИсточникДанных, КаноничноеИмяСвойства)
	
	Результат = Неопределено;
	
	ПроверяемыеСвойства = Новый Массив;
	ПроверяемыеСвойства.Добавить(КаноничноеИмяСвойства);
	ПроверяемыеСвойства.Добавить(КаноничноеИмяСвойства + "Ссылка");
	
	Для Каждого ИмяСвойства Из ПроверяемыеСвойства Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникДанных, ИмяСвойства)
		И ОбщегоНазначения.ЗначениеСсылочногоТипа(ИсточникДанных[ИмяСвойства]) Тогда 
			
			Результат = ИсточникДанных[ИмяСвойства];
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Инициализует новую таблицу видов документов, 
// которые можно отправлять и принимать по ЭДО.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - имеет колонки:
//     * ОбъектМетаданных	 - ОбъектМетаданных	 - метаданные объекта учета;
//     * ВидЭД				 - Строка			 - вид электронного документа (см. ВидыЭлектронныхДокументов);
//     * Ограничения		 - Неопределено		 - // TODO: Дописать позже. Пока видится, что это будет структура отборов;
//
Функция НоваяТаблицаВидовДокументовДляОбмена()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидЭД");
	Результат.Колонки.Добавить("ОбъектМетаданных");
	Результат.Колонки.Добавить("Ограничения");
	Результат.Колонки.Добавить("ПравилоКонвертацииСвойств");
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектМетаданныхСоответствуетВидуЭД(ОписаниеОбъектаМетаданных, ВидЭД, ВидыДокументов)
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектМетаданных", ОбъектМетаданных);
	Отбор.Вставить("ВидЭД", ВидЭД);
	
	НайденныеСтроки = ВидыДокументов.НайтиСтроки(Отбор);
	
	Результат = НайденныеСтроки.Количество() > 0;
	
	Возврат Результат;
	
КонецФункции

Функция ВсеВидыДокументовДляОбмена()
	
	Результат = НоваяТаблицаВидовДокументовДляОбмена();
	
	ВходящиеДокументы	 = ВидыВходящихДокументов();
	ИсходящиеДокументы	 = ВидыИсходящихДокументов();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВходящиеДокументы	, Результат);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсходящиеДокументы, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ВыборкаОбъектовПоПараметрамПоиска(ОписаниеОбъектаМетаданных, ПоляПоиска, ИгнорироватьПустыеЗначения = Истина)
	
	Результат = Новый Массив;
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	&ПолноеИмяТаблицы КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ПометкаУдаления";
	
	ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&ПолноеИмяТаблицы", ОбъектМетаданных.ПолноеИмя());
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПоляПоиска Цикл 
		
		КлючПоиска	 = Элемент.Ключ;
		Значение	 = Элемент.Значение;
		ИмяРеквизита = КлючПоиска;
		
		// Нормализуем значение
		Если ТипЗнч(Значение) = Тип("Строка") Тогда 
			Значение = СокрЛП(Значение);
		ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда 
			Значение = НачалоДня(Значение);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Значение) И ИгнорироватьПустыеЗначения Тогда 
			Продолжить;
		КонецЕсли;
		
		ВыражениеСправа = ПодставитьПараметрыВСтроку("&%1", ИмяРеквизита);
		
		Если ЭтоСтроковыйРеквизитНеограниченнойДлины(ОбъектМетаданных, ИмяРеквизита) Тогда 
			
			ВыражениеСлева = ПодставитьПараметрыВСтроку("ВЫРАЗИТЬ(Таблица.%1 КАК СТРОКА(%2))"
								, ИмяРеквизита
								, Формат(СтрДлина(Значение), "ЧГ=0"));
			
		ИначеЕсли ЭтоРеквизитТипаДатаВремя(ОбъектМетаданных, ИмяРеквизита) Тогда
			
			ВыражениеСлева = ПодставитьПараметрыВСтроку("НАЧАЛОПЕРИОДА(Таблица.%1, ДЕНЬ)", ИмяРеквизита);
			
		Иначе 
			
			ВыражениеСлева = ПодставитьПараметрыВСтроку("Таблица.%1", ИмяРеквизита);
			
		КонецЕсли;
		
		ТекстЗапроса = ПодставитьПараметрыВСтроку("%1 И %2 = %3", ТекстЗапроса, ВыражениеСлева, ВыражениеСправа);
		
		Запрос.УстановитьПараметр(ИмяРеквизита, Значение);
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактура(СсылкаНаОбъект)
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ВидыСФ = Новый Массив;
	ВидыСФ.Добавить(ВидыЭД.СчетФактура);
	ВидыСФ.Добавить(ВидыЭД.КорректировочныйСчетФактура);
	
	МетаданныеСчетовФактур = МетаданныеПоВидуЭД(ВидыСФ, Истина, Истина);
	
	Результат = МетаданныеСчетовФактур.Найти(МетаданныеОбъекта) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных)
	
	ОбъектМетаданных = Неопределено;
	
	ТипОписанияОбъектаМетаданных = ТипЗнч(ОписаниеОбъектаМетаданных);
	
	Если ТипОписанияОбъектаМетаданных = Тип("Тип") Тогда 
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ОписаниеОбъектаМетаданных);
	ИначеЕсли ТипОписанияОбъектаМетаданных = Тип("Строка") Тогда 
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ОписаниеОбъектаМетаданных);
	ИначеЕсли ТипОписанияОбъектаМетаданных = Тип("ОбъектМетаданных") Тогда 
		ОбъектМетаданных = ОписаниеОбъектаМетаданных;
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда 
		
		ОписаниеОш = ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка при выполнении функции Модуль_ИнтеграцииУниверсальный.ОбъектМетаданныхПоОписанию().
                                     |
                                     |Объект метаданных не найден:
                                     |ОписаниеОбъектаМетаданных = ""%1"" (тип ""%2"")'")
								, ОписаниеОбъектаМетаданных
								, Строка(ТипОписанияОбъектаМетаданных));
		
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
	Возврат ОбъектМетаданных;
	
КонецФункции

// Создает объект ОписаниеТипов на основании описания объекта метаданных.
//
// Параметры:
//  ОписаниеОбъектаМетаданных - ОбъектМетаданных, Тип, Строка - см. функцию ОбъектМетаданныхПоОписанию;
// 
// Возвращаемое значение:
//  ОписаниеТипов.
//
Функция ОписаниеТиповПоОбъектуМетаданных(ОписаниеОбъектаМетаданных)
	
	Если ОписаниеОбъектаМетаданных = Неопределено Тогда 
		Возврат ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	КонецЕсли;
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	МенеджерОбъекта	 = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
	ПустаяСсылка	 = МенеджерОбъекта.ПустаяСсылка();
	
	МассивТипов	 = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(ПустаяСсылка));
	
	Результат = Новый ОписаниеТипов(МассивТипов);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что в описание типов реквизита входит тип Строка с неограниченной длиной.
//
// Параметры:
//  ОписаниеОбъектаМетаданных - ОбъектМетаданных, Тип, Строка - см. функцию ОбъектМетаданныхПоОписанию;
//  ИмяРеквизита - Строка - имя проверяемого реквизита;
// 
// Возвращаемое значение:
//  Булево - Истина, если в описание типов реквизита входит тип Строка с неограниченной длиной.
//
Функция ЭтоСтроковыйРеквизитНеограниченнойДлины(ОписаниеОбъектаМетаданных, ИмяРеквизита)
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	Реквизит = ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита);
	
	Результат = Ложь;
	
	Если Реквизит <> Неопределено
		И Реквизит.Тип.СодержитТип(Тип("Строка"))
		И (Реквизит.Тип.КвалификаторыСтроки.Длина = 0) Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что в описание типов реквизита входит тип Дата, включающий дату и время.
//
// Параметры:
//  ОписаниеОбъектаМетаданных - ОбъектМетаданных, Тип, Строка - см. функцию ОбъектМетаданныхПоОписанию;
//  ИмяРеквизита - Строка - имя проверяемого реквизита;
// 
// Возвращаемое значение:
//  Булево - Истина, если в описание типов реквизита входит тип Дата, включающий дату и время.
//
Функция ЭтоРеквизитТипаДатаВремя(ОписаниеОбъектаМетаданных, ИмяРеквизита)
	
	ОбъектМетаданных = ОбъектМетаданныхПоОписанию(ОписаниеОбъектаМетаданных);
	Реквизит = ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита);
	
	Если Реквизит = Неопределено
		И ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, Истина) Тогда 
		Реквизит = ОбъектМетаданных.СтандартныеРеквизиты[ИмяРеквизита];
	КонецЕсли;
	
	Результат = Ложь;
	
	Если Реквизит <> Неопределено
		И Реквизит.Тип.СодержитТип(Тип("Дата"))
		И (Реквизит.Тип.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя) Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что у всех элементов коллекции заполнены значения.
//
// Параметры:
//  Коллекция - Струтура, ФиксированнаяСтруктура, 
//				Соответствие, ФиксированноеСоответствие, 
//				Массив, ФиксированныйМассив,
//				СписокЗначений - проверяемая коллекция;
// 
// Возвращаемое значение:
//  Булево - Истина, если отсутствуют незаполненные значения
//
Функция ВсеПоляКоллекцииЗаполнены(Коллекция)
	
	Если Не ЗначениеЗаполнено(Коллекция) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ТипКоллекции = ТипЗнч(Коллекция);
	ПроверятьЭлемент = (ТипКоллекции = Тип("Массив") Или ТипКоллекции = Тип("ФиксированныйМассив"));
	
	Результат = Истина;
	
	Для Каждого Элемент Из Коллекция Цикл 
		
		ПроверяемоеЗначение = ?(ПроверятьЭлемент, Элемент, Элемент.Значение);
		
		Если Не ЗначениеЗаполнено(ПроверяемоеЗначение) Тогда 
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает массив и копирует в него значения элементов коллекции.
//
// Параметры:
//  Коллекция - Структура, Соответствие, СписокЗначений - коллекция элементов КлючИЗначение.
// 
// Возвращаемое значение:
//  Массив.
//
Функция ЗначенияКоллекцииВМассив(Коллекция)
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Коллекция Цикл
		Результат.Добавить(Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьФункцияСчетаФактуры(Знач ФункцияЭД)
	
	Результат = Ложь;
	
	ФункцияЭД = ВРег(ФункцияЭД);
	
	ПодстрокиПоиска = Новый Массив;
	ПодстрокиПоиска.Добавить("Invoice");
	ПодстрокиПоиска.Добавить("СЧФ");
	ПодстрокиПоиска.Добавить("КСЧФ");
	
	Для Каждого Подстрока Из ПодстрокиПоиска Цикл 
		
		Если Найти(ФункцияЭД, ВРег(Подстрока)) > 0 Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьФункцияПервичногоДокумента(Знач ФункцияЭД)
	
	Результат = Ложь;
	
	ФункцияЭД = ВРег(ФункцияЭД);
	
	ПодстрокиПоиска = Новый Массив;
	ПодстрокиПоиска.Добавить("Basic");
	ПодстрокиПоиска.Добавить("ДОП");
	ПодстрокиПоиска.Добавить("ДИС");
	ПодстрокиПоиска.Добавить("СВРК");
	ПодстрокиПоиска.Добавить("СВЗК");
	ПодстрокиПоиска.Добавить("СВИСЗК");
	ПодстрокиПоиска.Добавить("СВИСРК");
	
	Для Каждого Подстрока Из ПодстрокиПоиска Цикл 
		
		Если Найти(ФункцияЭД, ВРег(Подстрока)) > 0 Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭлектронныйУПД(ТипДокумента)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	Результат = Ложь;
	
	Если ТипДокумента = ТипыДокументов.UniversalTransferDocument
		Или ТипДокумента = ТипыДокументов.UniversalTransferDocumentRevision Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭлектронныйУКД(ТипДокумента)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	Результат = Ложь;
	
	Если ТипДокумента = ТипыДокументов.UniversalCorrectionDocument
		Или ТипДокумента = ТипыДокументов.UniversalCorrectionDocumentRevision Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭлектронныйСчетФактура(ТипДокумента)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	Результат = Ложь;
	
	Если ТипДокумента = ТипыДокументов.Invoice
		Или ТипДокумента = ТипыДокументов.InvoiceRevision Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭлектронныйКорректировочныйСчетФактура(ТипДокумента)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	Результат = Ложь;
	
	Если ТипДокумента = ТипыДокументов.InvoiceCorrection
		Или ТипДокумента = ТипыДокументов.InvoiceCorrectionRevision Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКорректировочныйДокумент(ТипДокумента)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ТипыКорректировочныхДокументов = Новый Массив;
	ТипыКорректировочныхДокументов.Добавить(ТипыДокументов.UniversalCorrectionDocument);
	ТипыКорректировочныхДокументов.Добавить(ТипыДокументов.UniversalCorrectionDocumentRevision);
	ТипыКорректировочныхДокументов.Добавить(ТипыДокументов.InvoiceCorrection);
	ТипыКорректировочныхДокументов.Добавить(ТипыДокументов.InvoiceCorrectionRevision);
	
	Результат = (ТипыКорректировочныхДокументов.Найти(ТипДокумента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправительныйДокумент(ТипДокумента)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ТипыИсправительныхДокументов = Новый Массив;
	ТипыИсправительныхДокументов.Добавить(ТипыДокументов.UniversalTransferDocumentRevision);
	ТипыИсправительныхДокументов.Добавить(ТипыДокументов.UniversalCorrectionDocumentRevision);
	ТипыИсправительныхДокументов.Добавить(ТипыДокументов.InvoiceRevision);
	ТипыИсправительныхДокументов.Добавить(ТипыДокументов.InvoiceCorrectionRevision);
	
	Результат = (ТипыИсправительныхДокументов.Найти(ТипДокумента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПервичныйДокумент(ТипДокумента)

	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ТипыПервичныхДокументов = Новый Массив;
	ТипыПервичныхДокументов.Добавить(ТипыДокументов.UniversalTransferDocument);
	
	Результат = (ТипыПервичныхДокументов.Найти(ТипДокумента) <> Неопределено);
	
	Возврат Результат;

КонецФункции

Функция ЭтоДокументОРасхождениях(ТипДокумента)

	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ТипыДокументовОРасхождениях = Новый Массив;
	ТипыДокументовОРасхождениях.Добавить(ТипыДокументов.Torg2);
	
	Результат = (ТипыДокументовОРасхождениях.Найти(ТипДокумента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоАктСверки(ТипДокумента)

	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ТипыДокументовОРасхождениях = Новый Массив;
	ТипыДокументовОРасхождениях.Добавить(ТипыДокументов.reconciliationact);
	
	Результат = (ТипыДокументовОРасхождениях.Найти(ТипДокумента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоТипДокументаСчетНаОплату(ТипДокумента)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ТипыДокументаСчетНаОплату = Новый Массив;
	ТипыДокументаСчетНаОплату.Добавить(ТипыДокументов.XmlInvoiceOffer);
	ТипыДокументаСчетНаОплату.Добавить(ТипыДокументов.XmlProformaInvoice);
	ТипыДокументаСчетНаОплату.Добавить(ТипыДокументов.ProformaInvoice);
	
	Результат = (ТипыДокументаСчетНаОплату.Найти(ТипДокумента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьТипДокумента(ТипДокумента)

	Если ЭтоПервичныйДокумент(ТипДокумента) Тогда
		Результат = ТипДокумента_Первичный();
	ИначеЕсли ЭтоКорректировочныйДокумент(ТипДокумента) Тогда
		Результат = ТипДокумента_Корректировочный();
	ИначеЕсли ЭтоДокументОРасхождениях(ТипДокумента) Тогда
		Результат = ТипДокумента_ДокументОРасхождениях();
	ИначеЕсли ЭтоАктСверки(ТипДокумента) Тогда
		Результат = ТипДокумента_АктСверки();
	ИначеЕсли ЭтоТипДокументаСчетНаОплату(ТипДокумента) Тогда
		Результат = ТипДокумента_СчетНаОплату();
	Иначе
		Результат = ТипДокумента_НеизвестныйТип();
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ТипДокумента_Первичный()

	Возврат "Первичный";

КонецФункции

Функция ТипДокумента_Корректировочный()

	Возврат "Корректировочный";

КонецФункции

Функция ТипДокумента_ДокументОРасхождениях()

	Возврат "ДокументОРасхождениях";

КонецФункции

Функция ТипДокумента_АктСверки()

	Возврат "АктСверки";

КонецФункции

Функция ТипДокумента_СчетНаОплату()
	
	Возврат "СчетНаОплату";
	
КонецФункции

Функция ТипДокумента_НеизвестныйТип()

	Возврат "НеизвестныйТип";

КонецФункции

// Проверяет, что указанный ИНН принадлежит физическому лицу.
//
// Параметры:
//  ИНН - Строка - проверяемый ИНН;
// 
// Возвращаемое значение:
//  Булево - Истина, если ИНН состоит из 12 значащих символов.
//
Функция ЭтоИННФизическогоЛица(Знач ИНН)
	
	Результат = Ложь;
	
	ИНН = СокрЛП(ИНН);
	Если Лев(ИНН, 2) = "00" Тогда 
		ИНН = Сред(ИНН, 3);
	КонецЕсли;
	
	Если СтрДлина(ИНН) = 12 Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает коллекцию имен инфополей, которые зарезервированы
// под хранение и передачу служебной информации.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. тело функции.
//
Функция ЗарезервированныеИменаИнфоПолей()
	
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныеУсловия"		, "ДопУсловия");
	Результат.Вставить("ДополнительнаяИнформация"	, "ДопИнформация");
	Результат.Вставить("СрокОплаты"					, "СрокОплаты");
	Результат.Вставить("ИдентификаторПлатежа"		, "УИП");
	Результат.Вставить("ИдентификаторНоменклатуры"	, "ИдентификаторНоменклатуры");
	Результат.Вставить("ВидСчетаФактуры"			, "ВидСчетаФактуры");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Определяет значения программного перечисления ВидыЭлектронныхСчетовФактур.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. тело функции.
//
Функция ВидыЭлектронныхСчетовФактур()
	
	Результат = Новый Структура;
	Результат.Вставить("Реализация", "Реализация");
	Результат.Вставить("Авансовый", "Авансовый");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возвращает код основного языка конфигурации, например "ru".
//
// Возвращаемое значение:
//  Строка - код языка.
//
Функция КодОсновногоЯзыка()
	
	Результат = "ru";
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассиве(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Результат = Значение;
	Иначе
		Результат = Новый Массив;
		Результат.Добавить(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСписокЗначений(Приемник, Источник)
	
	Если Не ЗначениеЗаполнено(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементИсточника Из Источник Цикл
		Приемник.Добавить(ЭлементИсточника.Значение, ЭлементИсточника.Представление);
	КонецЦикла;
	
КонецПроцедуры

#Область ЗагрузкаДанных

// Возвращает описание способа отражения электронного документа в учете:
// как создать и заполнить новый объект информационной базы или
// сопоставить с существующим объектом.
//
// Параметры:
//  ИдентификаторПравила - Строка - Идентификатор правила обработки электронных документов. Варианты использования:
//                                  1. Имя метаданных документа:
//                                     правило обработки формируется автоматически по имени и представлению метаданного
//                                  2. Произвольная строка:
//                                     правило обработки требуется описать в событии ПриПолученииПравилаОбработкиЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Структура - содержит поля;
//   * Идентификатор - Строка - Идентификатор правила (способа) обработки;
//   * Представление - Строка - Представление правила для пользовательского интерфейса;
//   * ОбъектМетаданных - Строка - Полное имя объекта метаданных;
//   * ДополнительныеПараметры - Структура, Неопределено - Дополнительные параметры для передачи в обработку заполнения документа;
//
Функция ПравилоОбработкиЭлектронныхДокументов(ИдентификаторПравила)
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", ИдентификаторПравила);
	Результат.Вставить("Представление");
	Результат.Вставить("ОбъектМетаданных");
	Результат.Вставить("ДополнительныеПараметры");
	
	СтандартнаяОбработка = Истина;
	
	ПриПолученииПравилаОбработкиЭлектронногоДокумента(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		ОбъектМетаданных = Метаданные.Документы.Найти(ИдентификаторПравила);
		
		Если ОбъектМетаданных = Неопределено Тогда
			
			ПолноеИмяОбъектаМетаданных = "Документ." + ИдентификаторПравила;
			ШаблонОшибки = НСтр("ru = 'Не найден объект метаданных (%1)'");
			Ошибка = СтрШаблон(ШаблонОшибки, ПолноеИмяОбъектаМетаданных);
			ВызватьИсключение Ошибка;
			
		КонецЕсли;
		
		ПредставлениеОперации = ОбъектМетаданных.ПредставлениеОбъекта;
		Если Не ЗначениеЗаполнено(ПредставлениеОперации) Тогда
			ПредставлениеОперации = ОбъектМетаданных.Представление();
		КонецЕсли;
		
		Результат.Идентификатор		 = ИдентификаторПравила;
		Результат.Представление		 = ПредставлениеОперации;
		Результат.ОбъектМетаданных	 = ОбъектМетаданных.ПолноеИмя();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает правила обработки входящих электронных документов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//    * ВидДокумента - Строка - вид электронного документа (см. ВидыЭлектронныхДокументов);
//    * ЭтоИсправление - Булево - Истина, если правило действует для исправлений;
//    * ИдентификаторПравила - Строка - идентификатор правила обработки (см. ПравилоОбработкиЭлектронныхДокументов)
//
Функция ПравилаОбработкиВходящихДокументов()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидДокумента");
	Результат.Колонки.Добавить("ЭтоИсправление");
	Результат.Колонки.Добавить("ИдентификаторПравила");
	
	ЗаполнитьПравилаОбработкиВходящихДокументов(Результат);
	
	Возврат Результат;
	
КонецФункции

// Для указанного формата электронного документа формирует
// список соответствующих ему видов первичных документов.
//
// Параметры:
//  ФорматЭД - Структура - описание формата (см. НовоеОписаниеФорматаЭлектронногоДокумента).
// 
// Возвращаемое значение:
//  Строка - вид электронного документа (см. ВидыЭлектронныхДокументов);
//  Массив - если формат можно преобразовать в несколько видов документов (см. ВидыЭлектронныхДокументов);
//  Неопределено - если формат не предполагает создание первичного документа.
//
Функция ВидПервичногоДокумента(ФорматЭД)
	
	ВидыДокументов = ВидыЭлектронныхДокументов();
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	ВерсияФормата = ФорматЭД.ВерсияФормата;
	
	ЭтоУПД = ЭтоЭлектронныйУПД(ТипДокумента);
	ЭтоУКД = ЭтоЭлектронныйУКД(ТипДокумента);
	
	ЕстьФункцияПД = ЕстьФункцияПервичногоДокумента(ФункцияДокумента);
	
	Если ТипДокумента = ТипыДокументов.XmlTorg12 Тогда
		
		Результат = ВидыДокументов.ТоварнаяНакладная;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.XmlAcceptanceCertificate Тогда
		
		Результат = ВидыДокументов.АктОбОказанииУслуг;
		
	ИначеЕсли ЭтоУПД И ЕстьФункцияПД Тогда
		
		Результат = Новый Массив;
		Результат.Добавить(ВидыДокументов.ТоварнаяНакладная);
		Результат.Добавить(ВидыДокументов.АктОбОказанииУслуг);
		
	ИначеЕсли ЭтоУКД И ЕстьФункцияПД Тогда
		
		Результат = ВидыДокументов.СоглашениеОбИзмененииСтоимости;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.Torg2 Тогда
		
		Результат = ВидыДокументов.ДокументОРасхождениях;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.reconciliationact
		И НРег(ВерсияФормата) = "reconciliationact405_05_01_01" Тогда
		
		Результат = ВидыДокументов.АктСверки;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.XmlInvoiceOffer
		Или ТипДокумента = ТипыДокументов.XmlProformaInvoice Тогда
		
		Результат = ВидыДокументов.СчетНаОплату;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Для указанного формата электронного документа получает соответствующий
// ему вид счета-фактуры.
//
// Параметры:
//  ФорматЭД - Структура - описание формата (см. НовоеОписаниеФорматаЭлектронногоДокумента).
// 
// Возвращаемое значение:
//  Строка - вид счета-фактуры (см. ВидыЭлектронныхДокументов);
//  Неопределено - если формат не предполагает создание счета-фактуры.
//
Функция ВидСчетаФактуры(ФорматЭД)
	
	ВидыДокументов = ВидыЭлектронныхДокументов();
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	
	ЭтоУПД	 = ЭтоЭлектронныйУПД(ТипДокумента);
	ЭтоУКД	 = ЭтоЭлектронныйУКД(ТипДокумента);
	ЭтоСФ	 = ЭтоЭлектронныйСчетФактура(ТипДокумента);
	ЭтоКСФ	 = ЭтоЭлектронныйКорректировочныйСчетФактура(ТипДокумента);
	
	ЕстьФункцияСФ = ЕстьФункцияСчетаФактуры(ФункцияДокумента);
	
	Если ЭтоУПД И ЕстьФункцияСФ
		Или ЭтоСФ Тогда
		
		Результат = ВидыДокументов.СчетФактура;
		
	ИначеЕсли ЭтоУКД И ЕстьФункцияСФ
		Или ЭтоКСФ Тогда
		
		Результат = ВидыДокументов.КорректировочныйСчетФактура;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет таблицу правил обработки электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - правила обработки документов (см. ПравилаОбработкиВходящихДокументов);
//
// Пример:
//	Если ПолучитьФункциональнуюОпцию("ВедетсяПроизводственнаяДеятельность") Тогда
//		
//		ДобавитьПравилоОбработкиДокументов(ПравилоОбработки
//			, "ПоступлениеВПереработку" // Описание правила задается в процедуре ПриПолученииПравилаОбработкиЭлектронногоДокумента
//			, "ТоварнаяНакладная" 		// Используется для накладных
//			, Ложь); 					// Для исправлений не используется, только для первичных документов
//		
//	КонецЕсли;
//
Процедура ЗаполнитьПравилаОбработкиВходящихДокументов(ПравилаОбработки)
	
	МетодСервера(ИмяМодуляИнтеграции()
		, "ЗаполнитьПравилаОбработкиВходящихДокументов"
		, ПравилаОбработки);
	
КонецПроцедуры

// Обработчик получения правила отражения электронного документа в учетной системе.
//
// Параметры:
//  ПравилоОбработки	 - Структура - описание правила обработки электронного документа (см. ПравилоОбработкиЭлектронныхДокументов);
//  СтандартнаяОбработка - Булево - Истина, если специальная обработка не требуется,
//                                  а идентификатор совпадает с именем метаданных документа;
//
// Пример:
//
//	Если ПравилоОбработки.Идентификатор = "ПоступлениеВПереработку" Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		ДополнительныеПараметры = Новый Структура;
//		ДополнительныеПараметры.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
//		
//		ПравилоОбработки.Представление = "Поступление материалов в переработку";
//		ПравилоОбработки.ОбъектМетаданных = Метаданные.Документы.ПоступлениеТоваровУслуг.ПолноеИмя();
//		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
//		
//	КонецЕсли;
//
Процедура ПриПолученииПравилаОбработкиЭлектронногоДокумента(ПравилоОбработки, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции()
		, "ПриПолученииПравилаОбработкиЭлектронногоДокумента"
		, ПравилоОбработки
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Формирует из структуры с данными электронного документа новую структуру,
// в свойствах которой вместо вложенных структур находятся значения для
// заполнения документа информационной базы.
//
// Параметры:
//  ДанныеЭД - Структура - содержит данные электронного документа;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ЗначенияЗаполненияДокументаИБ(ДанныеЭД)
	
	Шапка = ДанныеЭД.Шапка;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация", СвойствоСтруктуры(Шапка, "Покупатель.Ссылка"));
	Результат.Вставить("Контрагент"	, СвойствоСтруктуры(Шапка, "Продавец.Ссылка"));
	Результат.Вставить("Валюта"		, СвойствоСтруктуры(Шапка, "Валюта.Ссылка"));
	Результат.Вставить("ДатаВходящегоДокумента"	, Шапка.Дата);
	Результат.Вставить("НомерВходящегоДокумента", Шапка.Номер);
	
	Результат.Вставить("Грузоотправитель"	, СвойствоСтруктуры(Шапка, "Грузоотправитель.Ссылка"));
	Результат.Вставить("Грузополучатель"	, СвойствоСтруктуры(Шапка, "Грузополучатель.Ссылка"));
	Результат.Вставить("НомерИсправления"	, Шапка.НомерИсправления);
	Результат.Вставить("ДатаИсправления"	, Шапка.ДатаИсправления);
	
	Возврат Результат;
	
КонецФункции

// Формирует массив с метаданными документов, которые можно создавать по входящему ЭД.
//
// Параметры:
//  ВидЭД - Строка - см. функцию ВидыЭлектронныхДокументов;
// 
// Возвращаемое значение:
//  Массив - содержит метаданные прикладных документов.
//
Функция МетаданныеПоВидуЭД(ВидЭД, ВключаяВходящие = Истина, ВключаяИсходящие = Ложь)
	
	Если ТипЗнч(ВидЭД) = Тип("Массив") Тогда 
		КоллекцияВидовЭД = ВидЭД;
	Иначе 
		КоллекцияВидовЭД = Новый Массив;
		КоллекцияВидовЭД.Добавить(ВидЭД);
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Получим таблицу видов документов для обмена
	Если ВключаяВходящие И ВключаяИсходящие Тогда 
		ТаблицаВидов = ВсеВидыДокументовДляОбмена();
	ИначеЕсли ВключаяВходящие Тогда 
		ТаблицаВидов = ВидыВходящихДокументов();
	ИначеЕсли ВключаяИсходящие Тогда 
		ТаблицаВидов = ВидыИсходящихДокументов();
	Иначе 
		ТаблицаВидов = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаВидов) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	КэшМетаданных = Новый Соответствие;
	
	Для Каждого Стр Из ТаблицаВидов Цикл 
		
		Если КоллекцияВидовЭД.Найти(Стр.ВидЭД) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КэшМетаданных[Стр.ОбъектМетаданных] = Неопределено Тогда 
			КэшМетаданных.Вставить(Стр.ОбъектМетаданных, Истина);
			Результат.Добавить(Стр.ОбъектМетаданных);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на документ учета, подходящую по значениям реквизитов электронного документа:
// Организация, Контрагент, Дата и Номер.
//
// Параметры:
//  ВидЭД - Строка - см. функцию ВидыЭлектронныхДокументов;
//  ПараметрыПоиска - Структура - содержит значения реквизитов для поиска (ключи структуры совпадают с ключами структуры НовоеПравилоКонвертацииСвойствЭД);
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, Неопределено - ссылка на найденный документ или Неопределено, если документ не найден.
//
Функция ДокументУчетаПоРеквизитамВходящегоЭД(ВидЭД, ПараметрыПоиска)
	
	Результат = Неопределено;
	
	ПравилаЗагрузки = ПравилаОбработкиВидаДокументов(ВидЭД);
	
	Для Каждого ЭлементСписка Из ПравилаЗагрузки Цикл 
		
		Правило = ЭлементСписка.Значение;
		
		ОбъектМетаданных = Правило.ОбъектМетаданных;
		СоответствиеРеквизитов = СоответствиеРеквизитовПолямВходящегоДокумента(ОбъектМетаданных);
		
		ЗначенияРеквизитов = Новый Структура;
		
		Для Каждого Элемент Из СоответствиеРеквизитов Цикл 
			
			ИмяРеквизитаЭД = Элемент.Ключ;
			ИмяРеквизитаИБ = Элемент.Значение;
			
			Если ПараметрыПоиска.Свойство(ИмяРеквизитаЭД) Тогда
				ЗначениеРеквизита = ПараметрыПоиска[ИмяРеквизитаЭД];
				ЗначенияРеквизитов.Вставить(ИмяРеквизитаИБ, ЗначениеРеквизита);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(ЗначенияРеквизитов) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденноеЗначение = СсылкаОбъектаПоПолямПоиска(ЗначенияРеквизитов, ОбъектМетаданных, Истина);
		
		Если ЗначениеЗаполнено(НайденноеЗначение) Тогда 
			Результат = НайденноеЗначение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Контструктор структуры параметров регистрации счетов-фактур на основании документов закупки или возврата товаров от клиента.
// 
// Возвращаемое значение:
// 	Структура - Структура параметров с ключами
// 	     * Ссылка - ДокументСсылка - Ссылка на документ закупки.
// 	     * Организация - СправочникСсылка.Организации - Организация, в которой отражается закупка или возврат товаров.
// 	     * Контрагент - СправочникСсылка.Контрагенты,
// 	                    СправочникСсылка.Организации - Контрагент или организация поставщик.
// 	                                                   Покупатель товаров при возврате.
// 	     * НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - Налогообложение НДС документа закупки или возврата.
//
Функция ПараметрыРегистрацииСчетаФактуры()
	
	ПараметрыРегистрации = Новый Структура();
	ПараметрыРегистрации.Вставить("Ссылка");
	ПараметрыРегистрации.Вставить("Организация");
	ПараметрыРегистрации.Вставить("Контрагент");
	ПараметрыРегистрации.Вставить("НалогообложениеНДС");
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

// Инициализирует параметры регистрации счета-фактуры по документу-основанию.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - документ, на основании которого необходимо получить параметры;
// 
// Возвращаемое значение:
//  Структура - см. ПараметрыРегистрацииСчетаФактуры().
//
Функция ПараметрыРегистрацииСчетаФактурыПоОснованию(ДокументОснование)
	
	ПараметрыРегистрации = ПараметрыРегистрацииСчетаФактуры();
	СтандартнаяОбработка = Истина;
	
	ПриПодготовкеПараметровРегистрацииСчетаФактуры(ПараметрыРегистрации, ДокументОснование, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Ссылка, Организация, Контрагент");
		ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, РеквизитыОснования);
		
	КонецЕсли;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

// Определяет партнера, соответствующего выбранному контрагенту.
//
// Параметры:
//  Контрагент - СправочникСсылка - элемент справочника "Контрагенты";
//               Структура - ключевые свойства контрагента (см. функцию НовыйКлючевыеСвойстваЮрФизЛицо);
// 
// Возвращаемое значение:
//  СправочникСсылка - ссылка на партнера;
//  Неопределено - если не удалось определить партнера;
//
Функция ПартнерПоКонтрагенту(Контрагент, Кэш = Неопределено)
	
	Результат = Неопределено;
	
	Если Кэш <> Неопределено Тогда
		
		Результат = Кэш[Контрагент];
		
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Контрагент) = Тип("Структура") Тогда 
		КонтрагентСсылка = СвойствоСтруктуры(Контрагент, "Ссылка");
	Иначе 
		КонтрагентСсылка = Контрагент;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонтрагентСсылка) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	МетаданныеКонтрагентов = КонтрагентСсылка.Метаданные();
	
	Если ЕстьРеквизитМетаданных(МетаданныеКонтрагентов, "Партнер") Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер");
	Иначе
		Результат = КонтрагентСсылка;
	КонецЕсли;
	
	Если Кэш <> Неопределено Тогда
		Кэш.Вставить(Контрагент, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на элемент справочника-владельца номенклатуры поставщиков.
//
// Параметры:
//  ДанныеЭД - Структура - см. функцию НовыйДанныеЭлектронногоДокумента;
// 
// Возвращаемое значение:
//  СправочникСсылка - ссылка на поставщика номенклатуры (контрагента или партнера).
//
Функция ВладелецНоменклатураПоставщиков(ДанныеЭД)
	
	Результат	 = Неопределено;
	ИмяСвойства	 = ИмяРеквизитаВладельцаНоменклатуры();
	
	Если Не ЗначениеЗаполнено(ИмяСвойства) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Результат = СвойствоСтруктуры(ДанныеЭД, ИмяСвойства);
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя свойства структуры ДанныеЭД, содержащее ссылку
// на владельца номенклатуры (контрагента или партнера).
// 
// Возвращаемое значение:
//  Строка - имя свойства структуры.
//
Функция ИмяРеквизитаВладельцаНоменклатуры()
	
	Результат = Неопределено;
	
	ИмяСправочника = ИмяСправочникаВладельцаНоменклатуры();
	
	Если ВРег(ИмяСправочника) = ВРег("Партнеры") Тогда 
		Результат = "Партнер.Ссылка";
	Иначе 
		Результат = "Продавец.Ссылка";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя справочника-владельца номенклатуры поставщиков.
// 
// Возвращаемое значение:
//  Строка - имя прикладного справочника.
//
Функция ИмяСправочникаВладельцаНоменклатуры()
	
	Результат = Неопределено;
	
	СтандартнаяОбработка = Истина;
	
	ПриОпределенииИмениСправочникаВладельцаНоменклатуры(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		Результат = "Контрагенты";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает метаданные прикладного справочника по имени справочника в терминах сервиса.
//
// Параметры:
//  ИмяСправочника - строка - название справочника в терминах сервиса.
//
// Возвращаемое значение:
//  ОбъектМетаданных - метаданные прикладного справочника.
//
Функция МетаданныеПрикладногоСправочника(ИмяСправочника)
	
	СоответствиеСправочников = Новый Соответствие;
	
	СтандартнаяОбработка = Истина;
	ПриПолученииСоответствияСправочников(СоответствиеСправочников, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		СоответствиеСправочников.Вставить("Валюты"			, Метаданные.Справочники.Валюты);
		СоответствиеСправочников.Вставить("СтраныМира"		, Метаданные.Справочники.СтраныМира);
		СоответствиеСправочников.Вставить("Организации"				, Метаданные.Справочники.Организации);
		СоответствиеСправочников.Вставить("Контрагенты"				, Метаданные.Справочники.Контрагенты);
		СоответствиеСправочников.Вставить("Партнеры"				, Неопределено);
		
	КонецЕсли;
	
	ИмяПрикладногоСправочника = СоответствиеСправочников.Получить(ИмяСправочника);
	
	Возврат ИмяПрикладногоСправочника;
	
КонецФункции

// Возвращает ссылку на организацию или контрагента по идентификатору организации в сервисе Диадок.
//
// Параметры:
//  Идентификатор	 - Строка - идентификатор организации в сервисе Диадок (boxId);
//  ОбъектМетаданных - ОбъектМетаданных - метаданные справочника, в котором осуществляется поиск;
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, Неопределено - ссылка на найденный элемент.
//
Функция СсылкаПоИдентификаторуОрганизации(Идентификатор, ОбъектМетаданных)
	
	Результат = Неопределено;
	
	Если ОбъектМетаданных = МетаданныеПрикладногоСправочника("Организации") Тогда 
		
		Результат = МетодСервера(, "BoxID_2_Организация", Идентификатор);
		
	ИначеЕсли ОбъектМетаданных = МетаданныеПрикладногоСправочника("Контрагенты") Тогда 
		
		Результат = МетодСервера(, "CounteragentBoxID_2_Контрагент", Идентификатор);
		
	Иначе 
		
		ТекстОшибки = НСтр("ru = 'Поиск ссылки с идентификатором ""%1"" не выполнен по причине:
                           |Для объектов ""%2"" поиск по идентификатору организации не определен!'");
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(ТекстОшибки, Идентификатор, ОбъектМетаданных.ПолноеИмя());
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ЗаполнениеСтруктурыЭлектронногоДокументаПоКонтенту

// Инициализиирует новую структуру с содержимым электронного документа.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * ЭлектронныйДокумент - Структура - описание документа (см. НовыйЭлектронныйДокумент);
//    * Шапка - Структура - содержит поля шапки документа;
//    * ТоварнаяЧасть - Массив - содержит коллекцию строк товарной части документа;
//    * Итоги - Структура - содержит поля итогов по товарной части;
//
Функция НовыйДанныеЭлектронногоДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("ЭлектронныйДокумент");
	Результат.Вставить("Шапка");
	Результат.Вставить("ТоварнаяЧасть");
	Результат.Вставить("Итоги");
	Результат.Вставить("ЭтоАванс", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует новую структуру с содержимым шапки электронного документа.
//
// Возвращаемое значение:
//  Структура
//
Функция НовыйШапкаЭлектронногоДокумента()

	Результат = Новый Структура;
	
	Результат.Вставить("Покупатель");
	Результат.Вставить("Продавец");
	Результат.Вставить("Партнер");
	Результат.Вставить("Грузоотправитель");
	Результат.Вставить("Грузополучатель");
	Результат.Вставить("Валюта");
	Результат.Вставить("Курс");
	Результат.Вставить("Кратность");
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	Результат.Вставить("НомерИсправления");
	Результат.Вставить("ДатаИсправления");
	Результат.Вставить("Основание");
	Результат.Вставить("ДопИнфо", Новый Массив);
	
	Возврат Результат;

КонецФункции

// Инициализирует новую структуру с содержимым шапки электронного документа 405@.
//
// Возвращаемое значение:
//  Структура
//
Функция НовыйШапкаЭлектронногоДокумента405()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отправитель");
	Результат.Вставить("Получатель");
	Результат.Вставить("Партнер");
	Результат.Вставить("Валюта");
	Результат.Вставить("Курс");
	Результат.Вставить("Кратность");
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	Результат.Вставить("ДатаНачала");
	Результат.Вставить("ДатаОкончания");
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет шапку с данными электронного документа.
//
// Параметры:
//  Контент - Структура - Протоструктура с содержимым документа;
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ШапкаЭлектронногоДокумента(Контент)
	
	Результат = НовыйШапкаЭлектронногоДокумента();
	
	ЗаполнитьШапкуПоДаннымЭлектронногоДокумента(Результат, Контент);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет шапку с данными электронного документа в формате @423.
//
// Параметры:
//  Контент - Структура - Протоструктура с содержимым документа;
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ШапкаЭлектронногоДокумента423(Контент)
	
	Результат = НовыйШапкаЭлектронногоДокумента();
	
	ЗаполнитьШапкуПоДаннымЭлектронногоДокумента423(Результат, Контент);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет шапку с данными электронного документа в формате @405.
//
// Параметры:
//  Контент - Структура - Протоструктура с содержимым документа;
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ШапкаАктаСверки405(Контент)
	
	Результат = НовыйШапкаЭлектронногоДокумента405();
	
	ЗаполнитьШапкуПоДаннымЭлектронногоДокумента405(Результат, Контент);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет шапку с данными электронного документа.
//
// Параметры:
//  Контент - Структура - Протоструктура с содержимым документа;
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ШапкаСчетаНаОплату(Контент)
	
	Результат = НовыйШапкаЭлектронногоДокумента();
	
	ЗаполнитьШапкуПоДаннымЭлектронногоДокумента29(Результат, Контент);
	
	Если ЗначениеЗаполнено(Контент.ProformaInvoiceAdditionalInfo.StartShipmentDate) Тогда
		Результат.Вставить("ДатаНачТов", Контент.ProformaInvoiceAdditionalInfo.StartShipmentDate);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контент.ProformaInvoiceAdditionalInfo.ShipmentTerms) Тогда
		Результат.Вставить("УсловияОказанияПоставки", Контент.ProformaInvoiceAdditionalInfo.ShipmentTerms);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контент.Buyer.Address.AddressText.AddressText) Тогда
		Результат.Покупатель.Вставить("АдрТекст", Контент.Buyer.Address.AddressText.AddressText);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контент.ProformaInvoiceAdditionalInfo.PaymentPurpose) Тогда
		Результат.Вставить("НазначениеПлатежа", Контент.ProformaInvoiceAdditionalInfo.PaymentPurpose);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контент.ProformaInvoiceAdditionalInfo.DateRestriction) Тогда
		Результат.Вставить("ЖелательнаяДатаПлатежа", Контент.ProformaInvoiceAdditionalInfo.DateRestriction);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контент.CurrencyRate) Тогда
		Результат.Вставить("КурсВалюты", Контент.CurrencyRate);
	КонецЕсли;
	
	Если Контент.ProformaInvoiceAdditionalInfo.Свойство("UniquePaymentInfo") Тогда
		Результат.Вставить("ИдентификаторПлатежа", Контент.ProformaInvoiceAdditionalInfo.UniquePaymentInfo);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет описание шапки электронного документа по контенту документа 29@.
//
// Параметры:
//  Шапка	 - Структура - см. ШапкаЭлектронногоДокумента;
//  Контент	 - Структура - Протоструктура с содержимым документа;
//
Процедура ЗаполнитьШапкуПоДаннымЭлектронногоДокумента29(Шапка, Контент)
	
	Шапка.Продавец			= КлючевыеСвойстваПродавцов29(Контент);
	Шапка.Покупатель		= КлючевыеСвойстваПокупателей29(Контент);
	Шапка.Партнер			= НовыйКлючевыеСвойстваПартнер();
	Шапка.Грузоотправитель	= КлючевыеСвойстваГрузоотправителей(Контент);
	Шапка.Грузополучатель	= КлючевыеСвойстваГрузополучателей(Контент);
	
	Получатель = КлючевыеСвойстваПолучателей29(Контент);
	Шапка.Вставить("Получатель", Получатель);
	
	Если СвойствоСтруктуры(Контент, "Currency") = Неопределено Тогда
		Валюта = НовыйКлючевыеСвойстваВалюта();
	Иначе
		Валюта = КлючевыеСвойстваВалюта(Контент.Currency);
	КонецЕсли;
	
	CurrencyRate = СвойствоСтруктуры(Контент, "CurrencyRate");
	Если ЗначениеЗаполнено(CurrencyRate) Тогда
		КурсВалюты = ПривестиКЧислу(CurrencyRate);
	Иначе
		КурсВалюты = 1;
	КонецЕсли;
	
	Шапка.Валюта			= Валюта;
	Шапка.Курс				= КурсВалюты;
	Шапка.Кратность			= 1;
	
	Если Контент.Свойство("DocumentDate") Тогда
		ДатаДокумента = Контент.DocumentDate;
	Иначе
		ДатаДокумента = Контент.Date;
	КонецЕсли;
	
	Шапка.Дата				= ДатаДокумента;
	
	Если Контент.Свойство("DocumentNumber") Тогда
		НомерДокумента = Контент.DocumentNumber;
	Иначе
		НомерДокумента = Контент.Number;
	КонецЕсли;
	
	Шапка.Номер				= НомерДокумента;
	
КонецПроцедуры

// Заполняет описание шапки электронного документа по контенту.
//
// Параметры:
//  Шапка	 - Структура - см. ШапкаЭлектронногоДокумента;
//  Контент	 - Структура - Протоструктура с содержимым документа;
//
Процедура ЗаполнитьШапкуПоДаннымЭлектронногоДокумента(Шапка, Контент)
	
	Шапка.Продавец			= КлючевыеСвойстваПродавцов(Контент);
	Шапка.Покупатель		= КлючевыеСвойстваПокупателей(Контент);
	Шапка.Партнер			= НовыйКлючевыеСвойстваПартнер();
	Шапка.Грузоотправитель	= КлючевыеСвойстваГрузоотправителей(Контент);
	Шапка.Грузополучатель	= КлючевыеСвойстваГрузополучателей(Контент);
	
	Если СвойствоСтруктуры(Контент, "Currency") = Неопределено Тогда
		Валюта = НовыйКлючевыеСвойстваВалюта();
	Иначе
		Валюта = КлючевыеСвойстваВалюта(Контент.Currency);
	КонецЕсли;
	
	CurrencyRate = СвойствоСтруктуры(Контент, "CurrencyRate");
	Если ЗначениеЗаполнено(CurrencyRate) Тогда
		КурсВалюты = ПривестиКЧислу(CurrencyRate);
	Иначе
		КурсВалюты = 1;
	КонецЕсли;
	
	Шапка.Валюта			= Валюта;
	Шапка.Курс				= КурсВалюты;
	Шапка.Кратность			= 1;
	
	Если Контент.Свойство("DocumentDate") Тогда
		ДатаДокумента = Контент.DocumentDate;
	Иначе
		ДатаДокумента = Контент.Date;
	КонецЕсли;
	
	Шапка.Дата				= ДатаДокумента;
	
	Если Контент.Свойство("DocumentNumber") Тогда
		НомерДокумента = Контент.DocumentNumber;
	Иначе
		НомерДокумента = Контент.Number;
	КонецЕсли;
	
	Шапка.Номер				= НомерДокумента;
	
	Шапка.НомерИсправления	= СвойствоСтруктуры(Контент, "RevisionNumber");
	Шапка.ДатаИсправления	= СвойствоСтруктуры(Контент, "RevisionDate");
	
	// Информационные поля шапки
	Если Контент.Свойство("AdditionalInfoId") Тогда
		ПрочитатьСвойства_ИнформационныеПоля(Шапка.ДопИнфо, Контент.AdditionalInfoId);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет описание шапки электронного документа в формате @423 по контенту.
//
// Параметры:
//  Шапка	 - Структура - см. ШапкаЭлектронногоДокумента;
//  Контент	 - Структура - Протоструктура с содержимым документа;
//
Процедура ЗаполнитьШапкуПоДаннымЭлектронногоДокумента423(Шапка, Контент)
	
	Шапка.Продавец			= КлючевыеСвойстваПокупателей423(Контент);
	Шапка.Покупатель		= КлючевыеСвойстваПродавцов423(Контент);
	Шапка.Партнер			= НовыйКлючевыеСвойстваПартнер();
	Шапка.Грузоотправитель	= КлючевыеСвойстваГрузоотправителей423(Контент);
	Шапка.Грузополучатель	= КлючевыеСвойстваГрузополучателей423(Контент);
	
	Если Контент.Свойство("DocumentDate") Тогда
		ДатаДокумента = Контент.DocumentDate;
	Иначе
		ДатаДокумента = Контент.Date;
	КонецЕсли;
	
	Шапка.Валюта	= НовыйКлючевыеСвойстваВалюта();	
	Шапка.Дата		= Контент.DocumentDate;
	Шапка.Номер		= Контент.DocumentNumber;
	
КонецПроцедуры

// Заполняет описание шапки электронного документа в формате @405 по контенту.
//
// Параметры:
//  Шапка - Структура - см. ШапкаЭлектронногоДокумента;
//  Контент - Структура - Протоструктура с содержимым документа;
//
Процедура ЗаполнитьШапкуПоДаннымЭлектронногоДокумента405(Шапка, Контент)
	
	Шапка.Отправитель = КлючевыеСвойстваОтправителя405(Контент);
	Шапка.Получатель = КлючевыеСвойстваПолучателя405(Контент);
	Шапка.Партнер = НовыйКлючевыеСвойстваПартнер();
	Шапка.Валюта = КлючевыеСвойстваВалюта(Контент.ReconciliationAct.AdditionalInfoReconciliationAct.Currency);
	Шапка.Дата = Контент.DateCreateFile;
	Шапка.Номер = Контент.ActNumber;
	Шапка.ДатаНачала = Контент.ReconcilationDateFrom;
	Шапка.ДатаОкончания = Контент.ReconcilationDateTo;
	
КонецПроцедуры

Процедура ЗаполнитьОрганизациюКонтрагентаИнформационнойБазы(Шапка, ЭлектронныйДокумент)
	
	ОрганизацияИБ = ЭлектронныйДокумент.ОрганизацияСервиса.Ссылка;
	
	Если ЗначениеЗаполнено(ОрганизацияИБ)
		И ТипЗнч(Шапка.Покупатель) = Тип("Структура") // Документ содержит сведения об одном покупателе
		И Не ЗначениеЗаполнено(Шапка.Покупатель.Ссылка) Тогда
		Шапка.Покупатель.Ссылка = ОрганизацияИБ;
	КонецЕсли;
	
	КонтрагентИБ = ЭлектронныйДокумент.КонтрагентСервиса.Ссылка;
	
	Если ЗначениеЗаполнено(КонтрагентИБ)
		И ТипЗнч(Шапка.Продавец) = Тип("Структура") // Документ содержит сведения об одном продавце
		И Не ЗначениеЗаполнено(Шапка.Продавец.Ссылка) Тогда
		Шапка.Продавец.Ссылка = КонтрагентИБ;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОрганизациюКонтрагентаИнформационнойБазы405(Шапка, ЭлектронныйДокумент)
	
	ОрганизацияИБ = ЭлектронныйДокумент.ОрганизацияСервиса.Ссылка;
	
	Если ЗначениеЗаполнено(ОрганизацияИБ)
		И ТипЗнч(Шапка.Получатель) = Тип("Структура") // Документ содержит сведения об одном получателе
		И Не ЗначениеЗаполнено(Шапка.Получатель.Ссылка) Тогда
		Шапка.Получатель.Ссылка = ОрганизацияИБ;
	КонецЕсли;
	
	КонтрагентИБ = ЭлектронныйДокумент.КонтрагентСервиса.Ссылка;
	
	Если ЗначениеЗаполнено(КонтрагентИБ)
		И ТипЗнч(Шапка.Отправитель) = Тип("Структура") // Документ содержит сведения об одном отправителе
		И Не ЗначениеЗаполнено(Шапка.Отправитель.Ссылка) Тогда
		Шапка.Отправитель.Ссылка = КонтрагентИБ;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКлючевыеСвойстваКорректируемогоДокумента(Шапка, Контент)
	
	Если Контент.Invoices.Количество() > 1 Тогда 
		ТекстОшибки = НСтр("ru = 'Создание корректировки по нескольким документам-основаниям не поддерживается.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	КорректируемыйДокумент = Контент.Invoices[0];
	Шапка.Вставить("КорректируемыйДокумент", КлючевыеСвойстваДокументОснованиеУКД(КорректируемыйДокумент));
	
КонецПроцедуры

Процедура ЗаполнитьКлючевыеСвойстваДокумента423(Шапка, Контент)

	ОснованиеАктаОРасхождениях = СвойствоСтруктуры(Контент, "CircumstancesAcceptanceInfo.CargoInspectionInformation.AccompanyingDocumentInfo");
	Шапка.Основание = КлючевыеСвойстваДокументОснованиеДокументаОРасхождениях(ОснованиеАктаОРасхождениях);

КонецПроцедуры

// Формирует описание товарной части электронного документа.
//
// Параметры:
//  Контент - Структура - Протоструктура с содержимым документа;
//  ЭтоКорректировка - Булево - Истина, если это контент корректировочного документа;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ДанныеТоварнойЧастиЭлектронногоДокумента(Контент, ЭтоКорректировка)
	
	ТоварнаяЧасть 	= Новый Массив;
	Итоги 			= Новый Структура;
	
	Если ЭтоКорректировка Тогда 
		
		Таблица = Контент.InvoiceCorrectionTable;
		
		СтрокиКонтента = Таблица.Items;
		ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоКорректировочногоДокумента(ТоварнаяЧасть, СтрокиКонтента);
		
		// Итоги (уменьшение)
		СуммаСНДСУменьшение		 = СвойствоСтруктуры(Таблица, "TotalsDec.Total");
		СуммаБезНДСУменьшение	 = СвойствоСтруктуры(Таблица, "TotalsDec.TotalWithVatExcluded");
		СуммаНДСУменьшение		 = СвойствоСтруктуры(Таблица, "TotalsDec.Vat");
		
		Итоги.Вставить("СуммаСНДСУменьшение"	, ПривестиКЧислу(СуммаСНДСУменьшение));
		Итоги.Вставить("СуммаБезНДСУменьшение"	, ПривестиКЧислу(СуммаБезНДСУменьшение));
		Итоги.Вставить("СуммаНДСУменьшение"		, ПривестиКЧислу(СуммаНДСУменьшение));
		
		// Итоги (увеличение)
		СуммаСНДСУвеличение		 = СвойствоСтруктуры(Таблица, "TotalsInc.Total");
		СуммаБезНДСУвеличение	 = СвойствоСтруктуры(Таблица, "TotalsInc.TotalWithVatExcluded");
		СуммаНДСУвеличение		 = СвойствоСтруктуры(Таблица, "TotalsInc.Vat");
		
		Итоги.Вставить("СуммаСНДСУвеличение"	, ПривестиКЧислу(СуммаСНДСУвеличение));
		Итоги.Вставить("СуммаБезНДСУвеличение"	, ПривестиКЧислу(СуммаБезНДСУвеличение));
		Итоги.Вставить("СуммаНДСУвеличение"		, ПривестиКЧислу(СуммаНДСУвеличение));
		
	Иначе 
		
		Если Контент.Свойство("Items") Тогда
			// это старый формат
			СтрокиКонтента = Контент.Items;
		ИначеЕсли Контент.Свойство("Table") Тогда
			Таблица = Контент.Table;
			СтрокиКонтента = Таблица.Items;
		ИначеЕсли Контент.Свойство("Works") Тогда
			// это акт 552 формата
			ТаблицыРабот = Контент.Works;
			СтрокиКонтента = Новый Массив;
			Для Каждого Таблица Из ТаблицыРабот Цикл
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиКонтента, Таблица.Items);
			КонецЦикла;
		Иначе
			Таблица = Контент.InvoiceTable;
			СтрокиКонтента = Таблица.Items;
		КонецЕсли;
		
		ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоДокумента(ТоварнаяЧасть, СтрокиКонтента);
		
		// Итоги
		СуммаСНДС	 = СвойствоСтруктуры(Таблица, "Total");
		СуммаБезНДС	 = СвойствоСтруктуры(Таблица, "TotalWithVatExcluded");
		СуммаНДС	 = СвойствоСтруктуры(Таблица, "Vat");
		
		Итоги.Вставить("СуммаСНДС"	, ПривестиКЧислу(СуммаСНДС));
		Итоги.Вставить("СуммаБезНДС", ПривестиКЧислу(СуммаБезНДС));
		Итоги.Вставить("СуммаНДС"	, ПривестиКЧислу(СуммаНДС));
		
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТоварнаяЧасть", ТоварнаяЧасть);
	Результат.Вставить("ИтоговыеСуммы", Итоги);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеТоварнойЧастиЭлектронногоДокумента29(Контент, ЭтоКорректировка)
	
	ТоварнаяЧасть = Новый Массив;
	Итоги = Новый Структура;
	
	Таблица = Контент.Table;
	СтрокиКонтента = Таблица.Items;
	
	ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоДокумента29(ТоварнаяЧасть, СтрокиКонтента);
	
	// Итоги
	СуммаСНДС	 = СвойствоСтруктуры(Таблица, "Total");
	СуммаБезНДС	 = СвойствоСтруктуры(Таблица, "TotalWithVatExcluded");
	СуммаНДС	 = СвойствоСтруктуры(Таблица, "Vat");
	
	Итоги.Вставить("СуммаСНДС"	, ПривестиКЧислу(СуммаСНДС));
	Итоги.Вставить("СуммаБезНДС", ПривестиКЧислу(СуммаБезНДС));
	Итоги.Вставить("СуммаНДС"	, ПривестиКЧислу(СуммаНДС));
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТоварнаяЧасть", ТоварнаяЧасть);
	Результат.Вставить("ИтоговыеСуммы", Итоги);
	
	Возврат Результат;
	
КонецФункции

// Формирует описание товарной части электронного документа в формате @423.
//
// Параметры:
//  Контент - Структура - Протоструктура с содержимым документа;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ДанныеТоварнойЧастиЭлектронногоДокумента423(Контент)
	
	ТоварнаяЧасть = Новый Массив;
	
	СтрокиКонтента = СвойствоСтруктуры(Контент, "EvidenceAcceptanceInfo.AcceptanceResults.AcceptanceResult", Неопределено);
	
	ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоДокументаОРасхождениях(ТоварнаяЧасть, СтрокиКонтента);
	
	Возврат ТоварнаяЧасть;
	
КонецФункции

// Формирует описание товарной части электронного документа в формате @423.
//
// Параметры:
//  Контент - Структура - Протоструктура с содержимым документа;
// 
// Возвращаемое значение:
//  Структура.
//
Функция ДанныеТабличнойЧастиЭлектронногоДокумента405(Контент)
	
	Результат = Новый Структура;
	ТаблицаАктаСверки = Неопределено;
	Итоги = Новый Структура;
	
	СтрокиКонтента = СвойствоСтруктуры(Контент, "ReconciliationAct.ReconciliationActTable", Неопределено);
	
	ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоАктаСверки(ТаблицаАктаСверки, СтрокиКонтента);
	
	ЗаполнитьИтогиПоДаннымЭлектронногоАктаСверки(Итоги, СтрокиКонтента);
	
	Результат.Вставить("СверкаПоДаннымКонтрагента", ТаблицаАктаСверки);
	Результат.Вставить("ИтоговыеСуммы", Итоги);
	
	Возврат Результат;
	
КонецФункции

// Преобразует протоструктуры со сведениями об участниках ЭДО
// в структуры с ключевыми свойствами организаций.
//
// Параметры:
//  КоллекцияУчастниковЭДО - Массив - содержит структуры, соответствующие объекту ExtendedOrganizationInfo.
// 
// Возвращаемое значение:
//  Структура - если в коллекции один элемент (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если в коллекции несколько элементов.
//  Неопределено - если коллекция пустая
//
Функция КлючевыеСвойстваУчастниковЭДО(КоллекцияУчастниковЭДО)
	
	Если Не ЗначениеЗаполнено(КоллекцияУчастниковЭДО) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КоллекцияЮрФизЛиц = Новый Массив;
	
	Для Каждого ДанныеУчастника Из КоллекцияУчастниковЭДО Цикл
		
		ЮрФизЛицо = КлючевыеСвойстваЮрФизЛицо(ДанныеУчастника);
		КоллекцияЮрФизЛиц.Добавить(ЮрФизЛицо);
		
	КонецЦикла;
	
	Если КоллекцияЮрФизЛиц.Количество() = 1 Тогда
		Результат = КоллекцияЮрФизЛиц[0];
	Иначе
		Результат = КоллекцияЮрФизЛиц;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа сведения о продавцах.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если продавец один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если продавцов несколько.
//
Функция КлючевыеСвойстваПродавцов(Контент)
	
	Если Контент.Свойство("Sellers") Тогда
		КоллекцияУчастниковЭДО = Контент.Sellers;
	Иначе
		КоллекцияУчастниковЭДО = Новый Массив;
		КоллекцияУчастниковЭДО.Добавить(Контент.Seller);
	КонецЕсли;
	
	Результат = КлючевыеСвойстваУчастниковЭДО(КоллекцияУчастниковЭДО);
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа сведения о покупателях.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если покупатель один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если покупателей несколько.
//
Функция КлючевыеСвойстваПокупателей(Контент)
	
	Если Контент.Свойство("Buyers") Тогда
		КоллекцияУчастниковЭДО = Контент.Buyers;
	ИначеЕсли Контент.Свойство("Buyer") Тогда 
		КоллекцияУчастниковЭДО = Новый Массив;
		КоллекцияУчастниковЭДО.Добавить(Контент.Buyer);
	КонецЕсли;
	
	Результат = КлючевыеСвойстваУчастниковЭДО(КоллекцияУчастниковЭДО);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа сведения о грузоотправителях.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если грузоотправитель один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если грузоотправителей несколько.
//
Функция КлючевыеСвойстваГрузоотправителей(Контент)
	
	КоллекцияУчастниковЭДО = Новый Массив;
	
	Если Контент.Свойство("Shippers") Тогда
		
		Для Каждого Shipper Из Контент.Shippers Цикл
			
			ЭлементКоллекции = Shipper.OrganizationInfo;
			КоллекцияУчастниковЭДО.Добавить(ЭлементКоллекции);
			
		КонецЦикла;
		
	ИначеЕсли Контент.Свойство("Shipper") Тогда
		
		Если Контент.Shipper.Свойство("OrganizationInfo") Тогда
			ЭлементКоллекции = Контент.Shipper.OrganizationInfo; // для 155@
		Иначе
			ЭлементКоллекции = Контент.Shipper; // для 172@
		КонецЕсли;
		
		КоллекцияУчастниковЭДО.Добавить(ЭлементКоллекции);
		
	КонецЕсли;
	
	Результат = КлючевыеСвойстваУчастниковЭДО(КоллекцияУчастниковЭДО);
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа сведения о грузополучателях.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если грузополучатель один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если грузополучателей несколько.
//
Функция КлючевыеСвойстваГрузополучателей(Контент)
	
	Если Контент.Свойство("Consignees") Тогда
		
		КоллекцияУчастниковЭДО = Контент.Consignees;
		
	ИначеЕсли Контент.Свойство("Consignee") Тогда
		
		КоллекцияУчастниковЭДО = Новый Массив;
		КоллекцияУчастниковЭДО.Добавить(Контент.Consignee);
		
	КонецЕсли;
	
	Результат = КлючевыеСвойстваУчастниковЭДО(КоллекцияУчастниковЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваУчастниковЭДО29(КоллекцияУчастниковЭДО)
	
	Если Не ЗначениеЗаполнено(КоллекцияУчастниковЭДО) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КоллекцияЮрФизЛиц = Новый Массив;
	
	Для Каждого ДанныеУчастника Из КоллекцияУчастниковЭДО Цикл
		
		ЮрФизЛицо = КлючевыеСвойстваЮрФизЛицо(ДанныеУчастника);
		КоллекцияЮрФизЛиц.Добавить(ЮрФизЛицо);
		
	КонецЦикла;
	
	Если КоллекцияЮрФизЛиц.Количество() = 1 Тогда
		Результат = КоллекцияЮрФизЛиц[0];
	Иначе
		Результат = КоллекцияЮрФизЛиц;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваПолучателей29(Контент)
	
	КоллекцияУчастниковЭДО = Новый Массив;
	КоллекцияУчастниковЭДО.Добавить(Контент.MoneyRecipient);
	
	Результат = КлючевыеСвойстваУчастниковЭДО29(КоллекцияУчастниковЭДО);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваПродавцов29(Контент)
	
	Если Контент.Свойство("Sellers") Тогда
		КоллекцияУчастниковЭДО = Контент.Sellers;
	Иначе
		КоллекцияУчастниковЭДО = Новый Массив;
		КоллекцияУчастниковЭДО.Добавить(Контент.Seller);
	КонецЕсли;
	
	Результат = КлючевыеСвойстваУчастниковЭДО29(КоллекцияУчастниковЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваПокупателей29(Контент)
	
	КоллекцияУчастниковЭДО = Новый Массив;
	КоллекцияУчастниковЭДО.Добавить(Контент.Buyer);
	
	Результат = КлючевыеСвойстваУчастниковЭДО29(КоллекцияУчастниковЭДО);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа в формате @423 сведения о продавцах.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если продавец один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если продавцов несколько.
//
Функция КлючевыеСвойстваПродавцов423(Контент)
	
	ДанныеУчастника = СвойствоСтруктуры(Контент, "CircumstancesAcceptanceInfo.Seller.OrganizationDetails", Неопределено);
	
	Результат = КлючевыеСвойстваЮрФизЛицо423(ДанныеУчастника);
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа в формате @423 сведения о покупателях.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если покупатель один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если покупателей несколько.
//
Функция КлючевыеСвойстваПокупателей423(Контент)
	
	ДанныеУчастника = СвойствоСтруктуры(Контент, "CircumstancesAcceptanceInfo.Buyer.OrganizationDetails", Неопределено);
	
	Результат = КлючевыеСвойстваЮрФизЛицо423(ДанныеУчастника);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа в формате @423 сведения о грузоотправителях.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если грузоотправитель один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если грузоотправителей несколько.
//
Функция КлючевыеСвойстваГрузоотправителей423(Контент)
	
	ДанныеУчастника = СвойствоСтруктуры(Контент, "CircumstancesAcceptanceInfo.Shipper.OrganizationDetails", Неопределено);
	
	Результат = КлючевыеСвойстваЮрФизЛицо423(ДанныеУчастника);
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа в формате @423 сведения о грузополучателях.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если грузополучатель один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если грузополучателей несколько.
//
Функция КлючевыеСвойстваГрузополучателей423(Контент)
	
	ДанныеУчастника = СвойствоСтруктуры(Контент, "CircumstancesAcceptanceInfo.Consignee.OrganizationDetails", Неопределено);
	
	Результат = КлючевыеСвойстваЮрФизЛицо423(ДанныеУчастника);
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа в формате @405 сведения о продавцах.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если продавец один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если продавцов несколько.
//
Функция КлючевыеСвойстваОтправителя405(Контент)
	
	ДанныеУчастника = СвойствоСтруктуры(Контент, "ReconciliationAct.AdditionalInfoReconciliationAct.Sender", Неопределено);
	
	Результат = КлючевыеСвойстваЮрФизЛицо405(ДанныеУчастника);
	
	Возврат Результат;
	
КонецФункции

// Получает из электронного документа в формате @405 сведения о покупателях.
//
// Параметры:
//  Контент - Структура - протоконтент.
// 
// Возвращаемое значение:
//  Структура - если покупатель один (см. КлючевыеСвойстваЮрФизЛицо);
//  Массив - если покупателей несколько.
//
Функция КлючевыеСвойстваПолучателя405(Контент)
	
	ДанныеУчастника = СвойствоСтруктуры(Контент, "ReconciliationAct.AdditionalInfoReconciliationAct.Recipient", Неопределено);
	
	Результат = КлючевыеСвойстваЮрФизЛицо405(ДанныеУчастника);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоДокумента(ТоварнаяЧасть, ИсточникДанных)
	
	Для Каждого СтрокаКонтента Из ИсточникДанных Цикл 
		
		Стр = НоваяСтрокаТоварнойЧастиДокумента();
		
		НоменклатураКонтрагента = НоменклатураКонтрагентаПоСтрокеКонтента(СтрокаКонтента);
		Стр.НоменклатураКонтрагента = НоменклатураКонтрагента;
		
		ПрочитатьСвойства_КоличественноСуммовыеПоказатели(Стр, СтрокаКонтента);
		ПрочитатьСвойства_КорСчета(Стр, СтрокаКонтента);
		ПрочитатьСвойства_ИнформационныеПоля(Стр.ДопИнфо, СтрокаКонтента);
		ПрочитатьСвойства_ДанныеГТД(Стр.ДанныеГТД, СтрокаКонтента);
		ПрочитатьСвойства_СведенияОМаркировке(Стр.СведенияОМаркировке, СтрокаКонтента);
		ПрочитатьСвойства_СведенияОПрослеживаемости(Стр.СведенияОПрослеживаемости, СтрокаКонтента);
		
		Стр.КлючСтроки = Стр.НоменклатураКонтрагента.Идентификатор;
		
		ТоварнаяЧасть.Добавить(Стр);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоДокумента29(ТоварнаяЧасть, ИсточникДанных)
	
	Для Каждого СтрокаКонтента Из ИсточникДанных Цикл 
		
		Стр = НоваяСтрокаТоварнойЧастиДокумента29();
		
		НоменклатураКонтрагента = НоменклатураКонтрагентаПоСтрокеКонтента(СтрокаКонтента);
		Стр.НоменклатураКонтрагента = НоменклатураКонтрагента;
		
		ПрочитатьСвойства_КоличественноСуммовыеПоказатели(Стр, СтрокаКонтента);
		ПрочитатьСвойства_КорСчета(Стр, СтрокаКонтента);
		ПрочитатьСвойства_ИнформационныеПоля(Стр.ДопИнфо, СтрокаКонтента);
		ПрочитатьСвойства_ДанныеГТД(Стр.ДанныеГТД, СтрокаКонтента);
		ПрочитатьСвойства_СведенияОМаркировке(Стр.СведенияОМаркировке, СтрокаКонтента);
		ПрочитатьСвойства_СведенияОПрослеживаемости(Стр.СведенияОПрослеживаемости, СтрокаКонтента);
		
		Стр.СуммаСкидки = СвойствоСтруктуры(СтрокаКонтента, "DiscountSum");
		Стр.ПроцентСкидки = СвойствоСтруктуры(СтрокаКонтента, "DiscountPercent");
		Стр.ЦенаБезСкидки = СвойствоСтруктуры(СтрокаКонтента, "PriceWithoutDiscount");
		Стр.СуммаСНДСБезСкидки = СвойствоСтруктуры(СтрокаКонтента, "SubtotalWithoutDiscount");
		Стр.СуммаБезНДСБезСкидки = СвойствоСтруктуры(СтрокаКонтента, "SubtotalWithoutVatAndDiscount");
		Стр.СуммаНДСБезСкидки = СвойствоСтруктуры(СтрокаКонтента, "VatWithoutDiscount");
		
		Стр.КлючСтроки = Стр.НоменклатураКонтрагента.Идентификатор;
		
		ТоварнаяЧасть.Добавить(Стр);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоДокументаОРасхождениях(ТоварнаяЧасть, ИсточникДанных)

	Если НЕ ЗначениеЗаполнено(ИсточникДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКонтента Из ИсточникДанных Цикл 
		
		ДанныеНоменклатуры			= СвойствоСтруктуры(СтрокаКонтента, "Assets",						Неопределено);
		ДанныеПоДокументуПродавца	= СвойствоСтруктуры(СтрокаКонтента, "AccordingToSellerDocument",	Неопределено);
		ДанныеПоФакту				= СвойствоСтруктуры(СтрокаКонтента, "ActuallyAccepted",				Неопределено);
		ДанныеРезультатовПриемки	= СвойствоСтруктуры(СтрокаКонтента, "AdditionalInfos",				Неопределено);
		
		ДанныеОМаркировкеПоДокументуПродавца	= СвойствоСтруктуры(СтрокаКонтента, "AccordingToSellerDocument.ItemIdentificationNumbers",	Неопределено);
		ДанныеОМаркировкеПоФакту				= СвойствоСтруктуры(СтрокаКонтента, "ActuallyAccepted.ItemIdentificationNumbers",			Неопределено);
		
		НоменклатураЭД	= КлючевыеСвойстваНоменклатурыПоставщика(ДанныеНоменклатуры);
		ЕдиницаЭД		= КлючевыеСвойстваЕдиницыИзмерения(СтрокаКонтента);
		СтавкаЭД		= КлючевыеСвойстваСтавкиНДС(ДанныеПоДокументуПродавца);
		
		Стр = НоваяСтрокаТоварнойЧастиДокументаОРасхождениях();
		
		Стр.НоменклатураКонтрагента = НоменклатураКонтрагентаПоСтрокеДокумента(НоменклатураЭД, ЕдиницаЭД, СтавкаЭД);
		
		ПрочитатьСвойства_КоличественноСуммовыеПоказатели(Стр, ДанныеПоДокументуПродавца,	Истина);
		ПрочитатьСвойства_КоличественноСуммовыеПоказатели(Стр, ДанныеПоФакту,				Ложь);
		
		ПрочитатьСвойства_ИнформационныеПоля(Стр.ДопИнфо, ДанныеРезультатовПриемки);
		
		ПрочитатьСвойства_СведенияОМаркировке423(Стр.СведенияОМаркировке, ДанныеОМаркировкеПоДокументуПродавца);
		ПрочитатьСвойства_СведенияОМаркировке423(Стр.СведенияОМаркировке, ДанныеОМаркировкеПоФакту);
		
		Стр.КлючСтроки = Стр.НоменклатураКонтрагента.Идентификатор;
		
		ТоварнаяЧасть.Добавить(Стр);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоАктаСверки(ТабличнаяЧасть, ИсточникДанных)
	
	Если НЕ ЗначениеЗаполнено(ИсточникДанных) Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = НовыйТабличнаяЧастьАктаСверки405();
	
	ТабличнаяЧасть.СальдоНачДебет = СвойствоСтруктуры(ИсточникДанных, "BalanceDebitFrom", Неопределено);
	ТабличнаяЧасть.СальдоНачКредит = СвойствоСтруктуры(ИсточникДанных, "BalanceAmountFrom", Неопределено);
	ТабличнаяЧасть.ОборотДебет = СвойствоСтруктуры(ИсточникДанных, "TurnoverDebit", Неопределено);
	ТабличнаяЧасть.ОборотКредит = СвойствоСтруктуры(ИсточникДанных, "TurnoverAmount", Неопределено);
	ТабличнаяЧасть.СальдоКонДебет = СвойствоСтруктуры(ИсточникДанных, "BalanceDebitEnd", Неопределено);
	ТабличнаяЧасть.СальдоКонКредит = СвойствоСтруктуры(ИсточникДанных, "BalanceAmountEnd", Неопределено);
	
	ПрочитатьСвойства_СведенияОДоговорах405(ТабличнаяЧасть, ИсточникДанных);
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОДоговорах405(СтрокиТабличнойЧасти, ИсточникДанных)
	
	КоллекцияДоговоров = СвойствоСтруктуры(ИсточникДанных, "ContractInfo", Новый Массив);
	
	Для Каждого ЭлементДоговор Из КоллекцияДоговоров Цикл
		
		СтрокаДоговор = НовыйСведенияОДоговоре405();
		
		СтрокаДоговор.ИдДоговора = СвойствоСтруктуры(ЭлементДоговор, "ContractId", Неопределено);
		СтрокаДоговор.Описание = СвойствоСтруктуры(ЭлементДоговор, "ContractAdditionalInfo", Неопределено);
		СтрокаДоговор.Номер = СвойствоСтруктуры(ЭлементДоговор, "ContractNumber", Неопределено);
		СтрокаДоговор.Дата = СвойствоСтруктуры(ЭлементДоговор, "ContractDate", Неопределено);
		СтрокаДоговор.СальдоНачДебет = СвойствоСтруктуры(ЭлементДоговор, "BalanceDebitFrom", Неопределено);
		СтрокаДоговор.СальдоНачКредит = СвойствоСтруктуры(ЭлементДоговор, "BalanceAmountFrom", Неопределено);
		СтрокаДоговор.ОборотДебет = СвойствоСтруктуры(ЭлементДоговор, "TurnoverDebit", Неопределено);
		СтрокаДоговор.ОборотКредит = СвойствоСтруктуры(ЭлементДоговор, "TurnoverAmount", Неопределено);
		СтрокаДоговор.СальдоКонДебет = СвойствоСтруктуры(ЭлементДоговор, "BalanceDebitEnd", Неопределено);
		СтрокаДоговор.СальдоКонКредит = СвойствоСтруктуры(ЭлементДоговор, "BalanceAmountEnd", Неопределено);
		
		DocumentInfo = СвойствоСтруктуры(ЭлементДоговор, "DocumentInfo", Новый Массив);
		
		ПрочитатьСвойства_СведенияОДокументах405(СтрокаДоговор, DocumentInfo);
		
		СтрокиТабличнойЧасти.Договор.Добавить(СтрокаДоговор);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОДокументах405(СтрокаДоговор, DocumentInfo)
	
	Для Каждого ЭлементДокумент Из DocumentInfo Цикл
		
		СтрокаДокумент = НовыйСведенияОДокументе405();
		
		СтрокаДокумент.Наименование = СвойствоСтруктуры(ЭлементДокумент, "DocumentName", Неопределено);
		СтрокаДокумент.Номер = СвойствоСтруктуры(ЭлементДокумент, "DocumentNumber", Неопределено);
		СтрокаДокумент.Дата = СвойствоСтруктуры(ЭлементДокумент, "DocumentDate", Неопределено);
		СтрокаДокумент.ИдДокумента = СвойствоСтруктуры(ЭлементДокумент, "DocumentId", Неопределено);
		СтрокаДокумент.ДопИнфо = СвойствоСтруктуры(ЭлементДокумент, "AdditionalInfo", Неопределено);
		
		OperationInfo = СвойствоСтруктуры(ЭлементДокумент, "OperationInfo", Новый Массив);
		
		ПрочитатьСвойства_СведенияОбОперациях405(СтрокаДокумент, OperationInfo);
		
		СтрокаДоговор.Документ.Добавить(СтрокаДокумент);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОбОперациях405(СтрокаДокумент, OperationInfo)
	
	Для Каждого ЭлементОперация Из OperationInfo Цикл
		
		СтрокаОперация = НовыйСведенияОбОперации405();
		
		СтрокаОперация.Дата = СвойствоСтруктуры(ЭлементОперация, "OperationDate", Неопределено);
		СтрокаОперация.Наименование = СвойствоСтруктуры(ЭлементОперация, "OperationName", Неопределено);
		СтрокаОперация.СуммаДебет = СвойствоСтруктуры(ЭлементОперация, "SumDebit", Неопределено);
		СтрокаОперация.СуммаКредит = СвойствоСтруктуры(ЭлементОперация, "SumAmount", Неопределено);
		
		СтрокаДокумент.Операция.Добавить(СтрокаОперация);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИтогиПоДаннымЭлектронногоАктаСверки(Итоги, ИсточникДанных)
	
	СальдоНачДеб = СвойствоСтруктуры(ИсточникДанных, "BalanceDebitFrom", Неопределено);
	СальдоНачКр = СвойствоСтруктуры(ИсточникДанных, "BalanceAmountFrom", Неопределено);
	ОборотДеб = СвойствоСтруктуры(ИсточникДанных, "TurnoverDebit", Неопределено);
	ОборотКр = СвойствоСтруктуры(ИсточникДанных, "TurnoverAmount", Неопределено);
	СальдоКонДеб = СвойствоСтруктуры(ИсточникДанных, "BalanceDebitEnd", Неопределено);
	СальдоКонКр = СвойствоСтруктуры(ИсточникДанных, "BalanceAmountEnd", Неопределено);
	
	Итоги.Вставить("СальдоНачДеб", СальдоНачДеб);
	Итоги.Вставить("СальдоНачКр", СальдоНачКр);
	Итоги.Вставить("ОборотДеб", ОборотДеб);
	Итоги.Вставить("ОборотКр", ОборотКр);
	Итоги.Вставить("СальдоКонДеб", СальдоКонДеб);
	Итоги.Вставить("СальдоКонКр", СальдоКонКр);
	
КонецПроцедуры

Процедура ЗаполнитьТоварнуюЧастьПоДаннымЭлектронногоКорректировочногоДокумента(ТоварнаяЧасть, ИсточникДанных)
	
	Для Каждого СтрокаКонтента Из ИсточникДанных Цикл 
		
		НоменклатураЭД = КлючевыеСвойстваНоменклатурыПоставщика(СтрокаКонтента);
		
		ЕдиницаЭД = КлючевыеСвойстваЕдиницыИзмерения(СтрокаКонтента.CorrectedValues);
		ЕдиницаЭД_До = КлючевыеСвойстваЕдиницыИзмерения(СтрокаКонтента.OriginalValues);
		
		СтавкаЭД = КлючевыеСвойстваСтавкиНДС(СтрокаКонтента.CorrectedValues);
		СтавкаЭД_До = КлючевыеСвойстваСтавкиНДС(СтрокаКонтента.OriginalValues);
		
		Стр = НоваяСтрокаТоварнойЧастиКорректировочногоДокумента();
		
		Стр.НоменклатураКонтрагента = НоменклатураКонтрагентаПоСтрокеДокумента(НоменклатураЭД, ЕдиницаЭД, СтавкаЭД);
		Стр.НоменклатураКонтрагента_До = НоменклатураКонтрагентаПоСтрокеДокумента(НоменклатураЭД, ЕдиницаЭД_До, СтавкаЭД_До);
		
		ПрочитатьСвойства_КоличественноСуммовыеПоказатели(Стр, СтрокаКонтента.OriginalValues, Истина);
		ПрочитатьСвойства_КоличественноСуммовыеПоказатели(Стр, СтрокаКонтента.CorrectedValues);
		
		ПрочитатьСвойства_КорСчета(Стр, СтрокаКонтента);		
		ПрочитатьСвойства_ИнформационныеПоля(Стр.ДопИнфо, СтрокаКонтента);		
		ПрочитатьСвойства_ДанныеГТД_Корректировка(Стр.ДанныеГТД, СтрокаКонтента);
		ПрочитатьСвойства_СведенияОПрослеживаемостиКорректировочногоДокумента(Стр.СведенияОПрослеживаемости, СтрокаКонтента);
		ПрочитатьСвойства_СведенияОМаркировке736(Стр.СведенияОМаркировке, СтрокаКонтента);
		
		Стр.КлючСтроки = Стр.НоменклатураКонтрагента.Идентификатор;
		
		ТоварнаяЧасть.Добавить(Стр);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеПервогоНайденногоСвойстваСтруктуры(ИсточникДанных, ИскомыеСвойства)
	
	Результат = Неопределено;
	
	Для Каждого ИмяСвойства Из ИскомыеСвойства Цикл
		
		Если ИсточникДанных.Свойство(ИмяСвойства) Тогда
			Результат = ИсточникДанных[ИмяСвойства];
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеНоменклатурыИзСтрокиЭД(ИсточникДанных)
	
	ВозможныеИменаПолей = Новый Массив;
	ВозможныеИменаПолей.Добавить("Name"); // 820@, 552@
	ВозможныеИменаПолей.Добавить("Product");
	
	Результат = ЗначениеПервогоНайденногоСвойстваСтруктуры(ИсточникДанных, ВозможныеИменаПолей);
	
	Возврат Результат;
	
КонецФункции

Функция АртикулНоменклатурыИзСтрокиЭД(ИсточникДанных)
	
	ВозможныеИменаПолей = Новый Массив;
	ВозможныеИменаПолей.Добавить("ItemArticle"); // 820@
	ВозможныеИменаПолей.Добавить("VendorCode");
	ВозможныеИменаПолей.Добавить("Article"); // 172@
	
	Результат = ЗначениеПервогоНайденногоСвойстваСтруктуры(ИсточникДанных, ВозможныеИменаПолей);
	
	Возврат Результат;
	
КонецФункции

Функция КодНоменклатурыИзСтрокиЭД(ИсточникДанных)
	
	ВозможныеИменаПолей = Новый Массив;
	ВозможныеИменаПолей.Добавить("ItemVendorCode"); // 820@
	ВозможныеИменаПолей.Добавить("ProductCode");
	
	Результат = ЗначениеПервогоНайденногоСвойстваСтруктуры(ИсточникДанных, ВозможныеИменаПолей);
	
	Возврат Результат;
	
КонецФункции

Функция ХарактеристикаНоменклатурыИзСтрокиЭД(ИсточникДанных)
	
	ВозможныеИменаПолей = Новый Массив;
	ВозможныеИменаПолей.Добавить("ItemCharact"); // 820@
	ВозможныеИменаПолей.Добавить("Feature");
	ВозможныеИменаПолей.Добавить("Description"); // 552@
	
	Результат = ЗначениеПервогоНайденногоСвойстваСтруктуры(ИсточникДанных, ВозможныеИменаПолей);
	
	Возврат Результат;
	
КонецФункции

Функция СортНоменклатурыИзСтрокиЭД(ИсточникДанных)
	
	ВозможныеИменаПолей = Новый Массив;
	ВозможныеИменаПолей.Добавить("ItemKind"); // 820@
	ВозможныеИменаПолей.Добавить("Sort");
	
	Результат = ЗначениеПервогоНайденногоСвойстваСтруктуры(ИсточникДанных, ВозможныеИменаПолей);
	
	Возврат Результат;
	
КонецФункции

Функция НоменклатураКонтрагентаПоСтрокеДокумента(НоменклатураЭД, ЕдиницаЭД, СтавкаЭД)
	
	Результат = НоваяНоменклатураКонтрагента();
	
	ЗаполнитьЗначенияСвойств(Результат, НоменклатураЭД);
	
	Результат.ЕдиницаИзмерения = ЕдиницаЭД.Наименование;
	Результат.ЕдиницаИзмеренияКод = ЕдиницаЭД.Код;
	
	Результат.СтавкаНДС = СтавкаЭД.Представление;
	
	Возврат Результат;
	
КонецФункции

Функция НоменклатураКонтрагентаПоСтрокеКонтента(СтрокаКонтента)

	Результат = НоваяНоменклатураКонтрагента();

	НоменклатураЭД = КлючевыеСвойстваНоменклатурыПоставщика(СтрокаКонтента);
	
	ЕдиницаЭД = КлючевыеСвойстваЕдиницыИзмерения(СтрокаКонтента);
	
	ПредставлениеСтавкиИноеЗначение = СвойствоСтруктуры(СтрокаКонтента, "OtherTaxRate"); // 29@
	Если ПредставлениеСтавкиИноеЗначение = Неопределено Тогда
		СтавкаЭД = КлючевыеСвойстваСтавкиНДС(СтрокаКонтента);
	Иначе
		СтавкаЭД = КлючевыеСвойстваСтавкиНДСИноеЗначение(СтрокаКонтента);
	КонецЕсли;
	
	GTIN = СвойствоСтруктуры(СтрокаКонтента, "GTIN", "");
	Тип = СвойствоСтруктуры(СтрокаКонтента, "ItemMark", "");
	
	ЗаполнитьЗначенияСвойств(Результат, НоменклатураЭД);
	
	Результат.Тип = Тип;
	Результат.ЕдиницаИзмеренияКод = ЕдиницаЭД.Код;
	Результат.ЕдиницаИзмерения = ЕдиницаЭД.Наименование;
	Результат.СтавкаНДС = СтавкаЭД.Представление;
		
	Результат.GTIN = GTIN;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьСвойства_КоличественноСуммовыеПоказатели(Стр, ИсточникДанных, ЗначенияДоИзменения = Ложь)
	
	Если ИсточникДанных.Свойство("Net") Тогда // НеттоПередано в 551@
		Количество = ИсточникДанных.Net;
	Иначе
		Количество = ИсточникДанных.Quantity;
	КонецЕсли;
	
	Цена		 = СвойствоСтруктуры(ИсточникДанных, "Price");
	СуммаАкциза	 = СвойствоСтруктуры(ИсточникДанных, "Excise");
	СуммаБезНДС	 = СвойствоСтруктуры(ИсточникДанных, "TotalWithVatExcluded");
	СуммаНДС	 = СвойствоСтруктуры(ИсточникДанных, "Vat");
	СуммаСНДС	 = СвойствоСтруктуры(ИсточникДанных, "Total");
	
	Если СуммаБезНДС = Неопределено Тогда 
		СуммаБезНДС = СвойствоСтруктуры(ИсточникДанных, "SubtotalWithVatExcluded");
	КонецЕсли;
	
	Если СуммаСНДС = Неопределено Тогда 
		СуммаСНДС = СвойствоСтруктуры(ИсточникДанных, "Subtotal");
	КонецЕсли;
	
	Количество	 = ПривестиКЧислу(Количество);
	Цена		 = ПривестиКЧислу(Цена);
	СуммаАкциза	 = ПривестиКЧислу(СуммаАкциза);
	СуммаБезНДС	 = ПривестиКЧислу(СуммаБезНДС);
	СуммаНДС	 = ПривестиКЧислу(СуммаНДС);
	СуммаСНДС	 = ПривестиКЧислу(СуммаСНДС);
	
	Постфикс = ?(ЗначенияДоИзменения, "_До", "");
	
	УстановитьСвойствоСтруктуры(Стр, "Количество" + Постфикс	, Количество);
	УстановитьСвойствоСтруктуры(Стр, "Цена" + Постфикс		, Цена);
	УстановитьСвойствоСтруктуры(Стр, "СуммаАкциза" + Постфикс	, СуммаАкциза);
	УстановитьСвойствоСтруктуры(Стр, "СуммаБезНДС" + Постфикс	, СуммаБезНДС);
	УстановитьСвойствоСтруктуры(Стр, "СуммаНДС" + Постфикс	, СуммаНДС);
	УстановитьСвойствоСтруктуры(Стр, "СуммаСНДС" + Постфикс	, СуммаСНДС);
	
КонецПроцедуры

Процедура ПрочитатьСвойства_КорСчета(Стр, ИсточникДанных)
	
	КорСчетДт = СвойствоСтруктуры(ИсточникДанных, "AccountDebit");
	Если КорСчетДт = Неопределено Тогда 
		КорСчетДт = СвойствоСтруктуры(ИсточникДанных, "ItemAccountDebit");
	КонецЕсли;
	
	КорСчетКт = СвойствоСтруктуры(ИсточникДанных, "AccountCredit");
	Если КорСчетКт = Неопределено Тогда 
		КорСчетКт = СвойствоСтруктуры(ИсточникДанных, "ItemAccountCredit");
	КонецЕсли;
	
	УстановитьСвойствоСтруктуры(Стр, "КорСчетДт", КорСчетДт);
	УстановитьСвойствоСтруктуры(Стр, "КорСчетКт", КорСчетКт);
	
КонецПроцедуры

Процедура ПрочитатьСвойства_ИнформационныеПоля(Приемник, ИсточникДанных)
	
	ДополнительныеПоля = СвойствоСтруктуры(ИсточникДанных, "StructedAdditionalInfos");
	
	Если Не ЗначениеЗаполнено(ДополнительныеПоля) Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ДополнительныеПоля Цикл 
		
		ДопИнфо = Новый Структура;
		ДопИнфо.Вставить("Ключ", Элемент.Key);
		ДопИнфо.Вставить("Значение", Элемент.Value);
		
		Приемник.Добавить(ДопИнфо);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает ключи сведений о таможенной декларации и стране происхождения.
//
// Возвращаемое значение:
//   Структура - Ключи сведений о ТД
//
Функция Перечисление_ИдентификаторыСведенийОСтранеПроисхождения()

	СведенияТД = Новый Структура;
	СведенияТД.Вставить("КодСтраны"				, "цифровой код страны происхождения");
	СведенияТД.Вставить("НаименованиеСтраны"	, "краткое наименование страны происхождения");
	СведенияТД.Вставить("НомерТД"				, "регистрационный номер декларации на товары");
	
	Возврат СведенияТД;

КонецФункции

// Заполняет сведения о грузовой таможенной декларации и стран епроисхождения товара.
// 
// Параметры:
//  Приемник - Массив - Массив структур, сведения о ГТД и стране происхождения товара из StructedAdditionalInfos.
//  ИсточникДанных - Массив - Массив структур, дополнительные сведения поля StructedAdditionalInfos.
// 
Процедура ПрочитатьСвойства_ДанныеГТД_Корректировка(Приемник, ИсточникДанных)
	
	ДополнительныеПоля = СвойствоСтруктуры(ИсточникДанных, "StructedAdditionalInfos");
	
	Если Не ЗначениеЗаполнено(ДополнительныеПоля) Тогда 
		Возврат;
	КонецЕсли;
	
	КлючИнфПолФХЖ2 = Перечисление_ИдентификаторыСведенийОСтранеПроисхождения();
	
	КодыСтран			= Новый Массив;
	НомераДекаларций	= Новый Массив;
		
	Для Каждого Элемент Из ДополнительныеПоля Цикл 
		
		Если НРег(Элемент.Key) = НРег(КлючИнфПолФХЖ2.КодСтраны) Тогда
			КодыСтран.Добавить(Элемент.Value);
		ИначеЕсли НРег(Элемент.Key) = НРег(КлючИнфПолФХЖ2.НомерТД) Тогда
			НомераДекаларций.Добавить(Элемент.Value);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КодыСтран)
		И ЗначениеЗаполнено(НомераДекаларций) Тогда
		
		ДополнитьДанныеГТД(Приемник, КодыСтран[0], НомераДекаларций[0]);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_ДанныеГТД(Приемник, ИсточникДанных)
	
	СведенияТД = СвойствоСтруктуры(ИсточникДанных, "CustomDeclarations");
	
	Если ЗначениеЗаполнено(СведенияТД) Тогда 
		
		Для Каждого Элемент Из СведенияТД Цикл 
			
			КодСтраны	 = СвойствоСтруктуры(Элемент, "CountryCode");
			НомерГТД	 = СвойствоСтруктуры(Элемент, "DeclarationNumber");
			
			ДополнитьДанныеГТД(Приемник, КодСтраны, НомерГТД);
			
		КонецЦикла;
		
	Иначе 
		
		КодСтраны	 = СвойствоСтруктуры(ИсточникДанных, "CountriesOfOrigin");
		НомерГТД	 = СвойствоСтруктуры(ИсточникДанных, "CustomsDeclarationNumbers");
		
		ДополнитьДанныеГТД(Приемник, КодСтраны, НомерГТД);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОМаркировке(Приемник, ИсточникДанных)
	
	НомСредИдентТов = СвойствоСтруктуры(ИсточникДанных, "ItemIdentificationNumbers");
	
	Если Не ЗначениеЗаполнено(НомСредИдентТов) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из НомСредИдентТов Цикл
		
		Если ЗначениеЗаполнено(Элемент.TransPackageId) Тогда
			Приемник.ТранспортныеУпаковки.Добавить(Элемент.TransPackageId);
		КонецЕсли;
		
		Для Каждого ВложенныйЭлемент Из Элемент.PackageIds Цикл
			Приемник.ИндивидуальныеУпаковки.Добавить(ВложенныйЭлемент);
		КонецЦикла;
		
		Для Каждого ВложенныйЭлемент Из Элемент.Units Цикл
			Приемник.КонтрольныеИдентификационныеЗнаки.Добавить(ВложенныйЭлемент);
		КонецЦикла;
		
		КолВедМарк = СвойствоСтруктуры(Элемент, "MarkedItemsQuantity", 0);
		
		Если ЗначениеЗаполнено(КолВедМарк) Тогда
			Приемник.КоличествоТовараВУпаковке = Приемник.КоличествоТовараВУпаковке + КолВедМарк;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОМаркировке423(Приемник, ИсточникДанных)
	
	НомСредИдентТов = СвойствоСтруктуры(ИсточникДанных, "ItemIdentificationNumber");
	
	Если Не ЗначениеЗаполнено(НомСредИдентТов) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из НомСредИдентТов Цикл
		
		Если Элемент.Свойство("TransPackageId") Тогда
			Если ЗначениеЗаполнено(Элемент.TransPackageId) Тогда
				Приемник.ТранспортныеУпаковки.Добавить(Элемент.TransPackageId);
			КонецЕсли;
		КонецЕсли;
		
		Если Элемент.Свойство("PackageIds") Тогда
			Для Каждого ВложенныйЭлемент Из Элемент.PackageIds Цикл
				Приемник.ИндивидуальныеУпаковки.Добавить(ВложенныйЭлемент);
			КонецЦикла;
		КонецЕсли;
		
		Если Элемент.Свойство("Units") Тогда
			Для Каждого ВложенныйЭлемент Из Элемент.Units Цикл
				Приемник.КонтрольныеИдентификационныеЗнаки.Добавить(ВложенныйЭлемент);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОМаркировке736(Приемник, ИсточникДанных)
	
	НомСредИдентТовПосле = СвойствоСтруктуры(ИсточникДанных, "CorrectedItemIdentificationNumbers", Новый Массив);
	
	Если Не ЗначениеЗаполнено(НомСредИдентТовПосле) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из НомСредИдентТовПосле Цикл
		
		Если Элемент.Свойство("TransPackageId") Тогда
			Если ЗначениеЗаполнено(Элемент.TransPackageId) Тогда
				Приемник.ТранспортныеУпаковки.Добавить(Элемент.TransPackageId);
			КонецЕсли;
		КонецЕсли;
		
		Если Элемент.Свойство("PackageIds") Тогда
			Для Каждого ВложенныйЭлемент Из Элемент.PackageIds Цикл
				Приемник.ИндивидуальныеУпаковки.Добавить(ВложенныйЭлемент);
			КонецЦикла;
		КонецЕсли;
		
		Если Элемент.Свойство("Units") Тогда
			Для Каждого ВложенныйЭлемент Из Элемент.Units Цикл
				Приемник.КонтрольныеИдентификационныеЗнаки.Добавить(ВложенныйЭлемент);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОПрослеживаемости(Приемник, ИсточникДанных)
	
	СведПрослеж = СвойствоСтруктуры(ИсточникДанных, "ItemTracingInfos");
	
	Если Не ЗначениеЗаполнено(СведПрослеж) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из СведПрослеж Цикл
		
		ДанныеПрослеживаемости = НовыеСвойстваЭлементаПрослеживаемости(); 
		
		ДанныеПрослеживаемости.НомерГТДРегистрационныйНомер 		= Элемент.RegNumberUnit;
		ДанныеПрослеживаемости.КоличествоПоРНПТ 					= Элемент.Quantity;
		ДанныеПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости 	= Элемент.Unit;
		ДанныеПрослеживаемости.ЕдиницаИзмеренияПрослеживаемости 	= Элемент.UnitName;
		
		СтоимостьБезНДСПрослеживаемости	= СвойствоСтруктуры(Элемент, "SumWithoutVat", 0);
		ДанныеПрослеживаемости.СтоимостьБезНДСПрослеживаемости = СтоимостьБезНДСПрослеживаемости; 

		Приемник.Добавить(ДанныеПрослеживаемости);
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет СведенияОПрослеживаемости по данным ItemTracingInfos строки контента
//
// Параметры
//  Приемник 		- Массив 		- см. НоваяСтрокаТоварнойЧастиКорректировочногоДокумента().СведенияОПрослеживаемости
//  ИсточникДанных 	- Структура		- СтрокаКонтента в которой есть ItemTracingInfos.
//
Процедура ПрочитатьСвойства_СведенияОПрослеживаемостиКорректировочногоДокумента(Приемник, ИсточникДанных)
	
	СведПрослеж = СвойствоСтруктуры(ИсточникДанных, "ItemTracingInfos");
	
	Если Не ЗначениеЗаполнено(СведПрослеж) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из СведПрослеж Цикл
		
		ДанныеПрослеживаемости = НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке(); 
		
		ДанныеПрослеживаемости.НомерГТДРегистрационныйНомер 		= Элемент.RegNumberUnit;
		ДанныеПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости 	= Элемент.Unit;
		
		QuantityDiff												= Элемент.QuantityDiff;
		ДанныеПрослеживаемости.КоличествоУменьшение 				= QuantityDiff.QuantityDec;
		ДанныеПрослеживаемости.КоличествоУвеличение 				= QuantityDiff.QuantityInc;
		ДанныеПрослеживаемости.КоличествоПослеИзменения 			= QuantityDiff.CorrectedQuantity;
		ДанныеПрослеживаемости.КоличествоДоИзменения 				= QuantityDiff.OriginalQuantity;
		
		Приемник.Добавить(ДанныеПрослеживаемости);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует структуру свойств контрагента или организации
// по данным объекта ExtendedOrganizationInfo.
//
// Параметры:
//  ИнформацияОбОрганизации - Структура - соответствует объекту ExtendedOrganizationInfo;
// 
// Возвращаемое значение:
//  Структура - см. функцию НовыйКлючевыеСвойстваЮрФизЛицо
//
Функция КлючевыеСвойстваЮрФизЛицо(ИнформацияОбОрганизации)
	
	// Результат метода используется для подготовки данных шапки УПД СЧФ ДОП и Счета ФНС 29@.
	// Реализовано для поддержки плагина распознавания неформализованных документов (Plaugin_OCR).
	// При получении документа с типом nonformalized пользователь выбирает вид документа для создания
	// из перечня первичных документов и счета на оплату (поддержаны в плагине).
	// В этом случае нужно создать первичный документ и счет от поставщика из контента УПД.
	
	Если Не ЗначениеЗаполнено(ИнформацияОбОрганизации) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	
	Результат.ИдентификаторУчастникаЭДО	 = СвойствоСтруктуры(ИнформацияОбОрганизации, "FnsParticipantId");
	Результат.ИдентификаторОрганизации	 = СвойствоСтруктуры(ИнформацияОбОрганизации, "BoxId");
	Результат.НаименованиеПолное = ИнформацияОбОрганизации.Name;
	Результат.Наименование		 = ИнформацияОбОрганизации.Name;
	Результат.ИНН = СвойствоСтруктуры(ИнформацияОбОрганизации, "Inn");
	Результат.КПП = СвойствоСтруктуры(ИнформацияОбОрганизации, "Kpp");
	Результат.НомерСчета = СвойствоСтруктуры(ИнформацияОбОрганизации, "BankAccountNumber");
	
	Возврат Результат;
	
КонецФункции

// Формирует структуру свойств контрагента или организации
// по данным объекта ExtendedOrganizationInfo_Torg2.
//
// Параметры:
//  ИнформацияОбОрганизации - Структура - соответствует объекту ExtendedOrganizationInfo_Torg2;
// 
// Возвращаемое значение:
//  Структура - см. функцию НовыйКлючевыеСвойстваЮрФизЛицо
//
Функция КлючевыеСвойстваЮрФизЛицо423(ИнформацияОбОрганизации)
	
	Если Не ЗначениеЗаполнено(ИнформацияОбОрганизации) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	
	Результат.ИдентификаторУчастникаЭДО	 = ИнформацияОбОрганизации.FnsParticipantId;
	Результат.НаименованиеПолное = ИнформацияОбОрганизации.OrgName;
	Результат.Наименование		 = ИнформацияОбОрганизации.ShortOrgName;
	Результат.ИНН = ИнформацияОбОрганизации.Inn;
	Результат.КПП = ИнформацияОбОрганизации.Kpp;
	
	Возврат Результат;
	
КонецФункции

// Формирует структуру свойств контрагента или организации
// по данным объекта ExtendedOrganizationInfo_ReconciliationAct.
//
// Параметры:
//  ИнформацияОбОрганизации - Структура - соответствует объекту ExtendedOrganizationInfo_ReconciliationAct;
// 
// Возвращаемое значение:
//  Структура - см. функцию НовыйКлючевыеСвойстваЮрФизЛицо
//
Функция КлючевыеСвойстваЮрФизЛицо405(ИнформацияОбОрганизации)
	
	Если Не ЗначениеЗаполнено(ИнформацияОбОрганизации) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = НовыйКлючевыеСвойстваЮрФизЛицо();
	
	Результат.НаименованиеПолное = ИнформацияОбОрганизации.Name;
	Результат.Наименование = ИнформацияОбОрганизации.Name;
	Результат.ИНН = ИнформацияОбОрганизации.Inn;
	Результат.КПП = ИнформацияОбОрганизации.Kpp;
	
	Возврат Результат;
	
КонецФункции

// Формирует структру свойств валюты
//
// Параметры:
//  ДанныеВалюты - Строка, Число - код валюты по ОКВ;
// 
// Возвращаемое значение:
//  Структура - см. функцию НовыйКлючевыеСвойстваВалюта.
//
Функция КлючевыеСвойстваВалюта(ДанныеВалюты)
	
	Результат = НовыйКлючевыеСвойстваВалюта();
	Результат.Код = Формат(ДанныеВалюты, "ЧГ=0"); // на случай, если из компоненты прилетит число
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваНоменклатурыПоставщика(ИсточникДанных)
	
	Результат = НовыйКлючевыеСвойстваНоменклатураПоставщика();
	
	Результат.Код = КодНоменклатурыИзСтрокиЭД(ИсточникДанных);
	Результат.Сорт = СортНоменклатурыИзСтрокиЭД(ИсточникДанных);
	Результат.Артикул = АртикулНоменклатурыИзСтрокиЭД(ИсточникДанных);
	Результат.Описание = СвойствоСтруктуры(ИсточникДанных, "Description");
	Результат.Наименование = НаименованиеНоменклатурыИзСтрокиЭД(ИсточникДанных);
	Результат.Идентификатор = ИдентификаторНоменклатурыИзСтрокиЭД(ИсточникДанных);
	Результат.Характеристика = ХарактеристикаНоменклатурыИзСтрокиЭД(ИсточникДанных);
	// + шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15 
	// т1к О.Н.Кошелев, 2023-11-30{Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb 
	Результат.ЕдиницаИзмерения = КлючевыеСвойстваЕдиницыИзмерения(ИсточникДанных).Наименование; 
	// }т1к О.Н.Кошелев, 2023-11-30
	// - шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15 
	
	Если Не ЗначениеЗаполнено(Результат.Наименование)
		И ЗначениеЗаполнено(Результат.Описание) Тогда
		
		Результат.Наименование = Результат.Описание;
		Результат.Описание = "";
		
	КонецЕсли;
	
	ЗаполнитьИдентификаторНоменклатурыКонтрагента(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваЕдиницыИзмерения(ИсточникДанных)
	
	Результат = НовыйКлючевыеСвойстваЕдиницаИзмерения();
	
	Результат.Наименование = СвойствоСтруктуры(ИсточникДанных, "UnitName");
	
	Результат.Код = СвойствоСтруктуры(ИсточникДанных, "UnitCode");
	Если Не ЗначениеЗаполнено(Результат.Код) Тогда 
		Результат.Код = СвойствоСтруктуры(ИсточникДанных, "Unit"); // 551@, 820@
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваСтавкиНДС(ИсточникДанных)
	
	ПредставлениеСтавки = СвойствоСтруктуры(ИсточникДанных, "TaxRate");
	
	Если Не ЗначениеЗаполнено(ПредставлениеСтавки) Тогда // для 172@
		
		СуммаНалога = СвойствоСтруктуры(ИсточникДанных, "Vat", 0);
		СуммаБезНалога = СвойствоСтруктуры(ИсточникДанных, "TotalWithVatExcluded", 0);
		ПредставлениеСтавки = РасчетноеПредставлениеСтавкиНДС(СуммаБезНалога, СуммаНалога);
		
	КонецЕсли;
	
	Результат = НовыйКлючевыеСвойстваСтавкаНДС();
	Результат.Представление = ПредставлениеСтавки;
	Результат.Ссылка = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	
	Возврат Результат;
	
КонецФункции

Функция КлючевыеСвойстваСтавкиНДСИноеЗначение(ИсточникДанных)
	
	ПредставлениеСтавки = СвойствоСтруктуры(ИсточникДанных, "OtherTaxRate");
	
	Результат = НовыйКлючевыеСвойстваСтавкаНДС();
	Результат.Представление = ПредставлениеСтавки;
	Результат.Ссылка = ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	
	Возврат Результат;
	
КонецФункции

// Формирует структру свойств документа-основания УКД.
//
// Параметры:
//  СведенияОКорректируемомДокументе - Структура - соответствует объекту InvoiceForCorrectionInfo;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КлючевыеСвойстваДокументОснованиеУКД(СведенияОКорректируемомДокументе)
	
	Результат = Новый Структура;
	Результат.Вставить("ПервичныйДокумент");
	Результат.Вставить("СчетФактура");
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Дата", СведенияОКорректируемомДокументе.InvoiceDate);
	Результат.Вставить("Номер", СведенияОКорректируемомДокументе.InvoiceNumber);
	
	Возврат Результат;
	
КонецФункции

// Формирует структру свойств документа-основания акта о расхождениях.
//
// Параметры:
//  СведенияОбОсновании - Структура - Сведения о номере и дате сопроводительного документа для акта о расхождениях;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КлючевыеСвойстваДокументОснованиеДокументаОРасхождениях(СведенияОбОсновании)
	
	Результат = НовыйКлючевыеСвойстваДокументОснованиеДокументаОРасхождениях();
	
	Если ЗначениеЗаполнено(СведенияОбОсновании.Date) Тогда
		Результат.Дата = СведенияОбОсновании.Date;
		Результат.Номер = СведенияОбОсновании.Number;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет в коллекцию данных грузовой таможенной декларации новый элемент.
//
// Параметры:
//  ДанныеГТД - Массив - содержит структуры с ключами:
//    * СтранаПроисхождения - Структура - см. НовыйКлючевыеСвойстваСтранаМира;
//    * НомерГТД - Структура - см. НовыйКлючевыеСвойстваНомерГТД;
//  КодСтраны - Строка - код страны мира по общероссийскому классификатору;
//  НомерГТД  - Строка - регистрационный номер таможенной декларации;
//
Процедура ДополнитьДанныеГТД(ДанныеГТД, КодСтраны, НомерГТД)
	
	Если Не ЗначениеЗаполнено(КодСтраны) И Не ЗначениеЗаполнено(НомерГТД) Тогда 
		Возврат;
	КонецЕсли;
	
	Элемент = Новый Структура;
	Элемент.Вставить("СтранаПроисхождения", НовыйКлючевыеСвойстваСтранаМира());
	Элемент.Вставить("НомерГТД"			, НовыйКлючевыеСвойстваГТД());
	
	Элемент.СтранаПроисхождения.Код = КодСтраны;
	Элемент.НомерГТД.РегистрационныйНомер = НомерГТД;
	
	ДанныеГТД.Добавить(Элемент);
	
КонецПроцедуры

// Считывает идентификатор номенклатуры контрагента из инфополей
// строки электронного документа.
//
// Параметры:
//  СтрокаЭД - Структура - протоструктура строки ЭД (см. Новый_ExtendedInvoiceItem, Новый_TovTorgItem и т.д.).
// 
// Возвращаемое значение:
//  Строка - идентификатор номенклатуры поставщика.
//
Функция ИдентификаторНоменклатурыИзСтрокиЭД(СтрокаЭД)
	
	Результат = "";
	
	ИнфоПоля = СвойствоСтруктуры(СтрокаЭД, "StructedAdditionalInfos");
	
	Если Не ЗначениеЗаполнено(ИнфоПоля) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Имена дополнительных полей, которые могут содержать идентификатор номенклатуры для сопоставления.
	// Порядок определяет приоритет выбора поля!
	ВозможныеИмена = Новый Массив;
	ВозможныеИмена.Добавить(ЗарезервированныеИменаИнфоПолей().ИдентификаторНоменклатуры);
	ВозможныеИмена.Добавить("Для1С_Идентификатор"); // Используется в 1С-ЭДО
	
	// Найдем все возможные идентификаторы.
	НайденныеЗначения = Новый Соответствие;
	
	Для Каждого ДополнительноеПоле Из ИнфоПоля Цикл
		
		ИмяПоля	 = ДополнительноеПоле.Key;
		Значение = ДополнительноеПоле.Value;
		
		Если ВозможныеИмена.Найти(ИмяПоля) <> Неопределено Тогда
			НайденныеЗначения.Вставить(ИмяПоля, Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(НайденныеЗначения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Выберем из найденных значений то, чье имя имеет наболее высокий приоритет.
	Для Каждого ИмяПоля Из ВозможныеИмена Цикл
		
		Если ЗначениеЗаполнено(НайденныеЗначения[ИмяПоля]) Тогда
			Результат = НайденныеЗначения[ИмяПоля];
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, является ли электронный документ счетом-фактурой на аванс.
// Счет-фактура авансовый, если это явно указано в предопределенном инфополе
// или если ни в одной строке не заполнено поле СуммаБезНДС (атрибут СтТовБезНДС)
//
// Параметры:
//  ДанныеЭД - Структура - см. функцию НовыйДанныеЭлектронногоДокумента;
// 
// Возвращаемое значение:
//  Булево - Истина, если это счет-фактура (УПД СЧФ или СФ) на аванс.
//
Функция ЭтоЭлектронныйСчетФактураНаАванс(Контент, ДанныеЭД)
	
	Результат = Истина;
	
	ИмяПоляВидСФ	 = ЗарезервированныеИменаИнфоПолей().ВидСчетаФактуры;
	ВидСчетаФактуры	 = ЗначениеИнформационногоПоля(ДанныеЭД.Шапка, ИмяПоляВидСФ);
	
	ФункцияДокумента = СвойствоСтруктуры(Контент, "Function");
	ОбстФормСЧФ = СвойствоСтруктуры(Контент, "CircumFormatInvoice");
	
	Если ФункцияДокумента = ФункцииЭлектронныхДокументов().СЧФ
		И ОбстФормСЧФ = "2" Тогда
		
		Результат = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(ВидСчетаФактуры)
		И ВидСчетаФактуры <> ВидыЭлектронныхСчетовФактур().Авансовый Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ВидСчетаФактуры = Неопределено Тогда
		
		Для Каждого СтрокаТЧ Из ДанныеЭД.ТоварнаяЧасть Цикл
			
			НДСИНА = ЭтоСтавкаНДСИНА(СтрокаТЧ.НоменклатураКонтрагента.СтавкаНДС);
			
			Если Не НДСИНА И ЗначениеЗаполнено(СтрокаТЧ.СуммаБезНДС)
				Или НДСИНА И ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает значение информационного поля по его имени.
//
// Параметры:
//  Владелец - Структура - электронный документ или строка электронного документа;
//  ИмяИнформационногоПоля - Строка - имя информационного поля;
//  ЗначениеПоУмолчанию - Произвольный - Необязательный. Возвращается когда нет инфополя с указанным именем;
// 
// Возвращаемое значение:
//  Произвольный - Значение информационного поля. ЗначениеПоУмолчанию если нет указанного поля.
//
Функция ЗначениеИнформационногоПоля(Владелец, ИмяИнформационногоПоля, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = ЗначениеПоУмолчанию;
	
	ИмяПоляВРЕГ = ВРег(ИмяИнформационногоПоля);
	
	КоллекцияИнфоПолей = Владелец.ДопИнфо;
	
	Для Каждого Элемент Из КоллекцияИнфоПолей Цикл
		
		Если ВРег(Элемент.Ключ) = ИмяПоляВРЕГ Тогда
			Результат = Элемент.Значение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает страну по данным информационного поля "цифровой код страны происхождения" из ДопИнфо. 
//
// Параметры:
//  ДопИнфо - Массив;
// 
// Возвращаемое значение:
//  СправочникСсылка.СтраныМира, Неопределено
//
Функция НайтиСтрануПроисхожденияПоДаннымДопИнфо(ДопИнфо) Экспорт
	
	Результат = Неопределено;
	
	КлючКодСтраны = Перечисление_ИдентификаторыСведенийОСтранеПроисхождения().КодСтраны;

	КодСтраны = "";
	
	Для каждого Элемент Из ДопИнфо Цикл
	
		Если ВРег(Элемент.Ключ) = ВРег(КлючКодСтраны) Тогда
			
			Если ЗначениеЗаполнено(КодСтраны) Тогда
				КодСтраны = Неопределено;
				Прервать;
			КонецЕсли;
			
			КодСтраны = Элемент.Значение; 
			
		КонецЕсли;
	
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(КодСтраны) Тогда
		
		СвойстваОбъекта		 = НовыйКлючевыеСвойстваСтранаМира(); 
		СвойстваОбъекта.Код	 = КодСтраны;
		НайтиСтрану(СвойстваОбъекта);
		
		Результат = СвойстваОбъекта.Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Генерирует уникальный строковый идентификатор с ограниченной длиной.
// Входная строка приводится к верхнему регистру, из нее удаляются все пробелы.
// Если длина нормализованной строки превышает заданное ограничение,
// её "хвост" заменяется на хеш-строку, вычисленную по алгоритму MD5.
//
// Параметры:
//  ВходнаяСтрока		 - Строка	 - произвольная строка;
//  МаксимальнаяДлина	 - Число	 - максимальная длина формируемого идентификатора;
// 
// Возвращаемое значение:
//  Строка - идентификатор входной строки.
//
Функция ИдентификаторПоСтроке(Знач ВходнаяСтрока, Знач МаксимальнаяДлина = Неопределено)
	
	Если Не ЗначениеЗаполнено(МаксимальнаяДлина) Тогда 
		МаксимальнаяДлина = 110;
	КонецЕсли;
	
	Идентификатор = СокрЛП(ВходнаяСтрока);
	Идентификатор = ВРег(Идентификатор);
	Идентификатор = СтрЗаменить(Идентификатор, " ", "");
	
	Длина = СтрДлина(Идентификатор);
	
	Если Длина > МаксимальнаяДлина Тогда
		
		Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
		Хеширование.Добавить(Идентификатор);
		
		ХешСтрока = Строка(Хеширование.ХешСумма);
		ХешСтрока = СтрЗаменить(ХешСтрока, " ", "");
		
		ДлинаХешСтроки = СтрДлина(ХешСтрока);
		
		Идентификатор = Лев(Идентификатор, МаксимальнаяДлина - ДлинаХешСтроки) + ХешСтрока;
		
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

// Заполняет идентификатор номенклатуры контрагента, который будет использован
// для сопоставления с номенклатурой информационной базы.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - см. функцию НовыйКлючевыеСвойстваНоменклатураПоставщика.
//
Процедура ЗаполнитьИдентификаторНоменклатурыКонтрагента(НоменклатураКонтрагента)
	
	Если ЗначениеЗаполнено(НоменклатураКонтрагента.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ФрагментыПредставления = Новый Массив;
	ФрагментыПредставления.Добавить(НоменклатураКонтрагента.Наименование);
	ФрагментыПредставления.Добавить(НоменклатураКонтрагента.Характеристика);
	ФрагментыПредставления.Добавить(НоменклатураКонтрагента.Код);
	ФрагментыПредставления.Добавить(НоменклатураКонтрагента.Артикул);

	// + шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15 
	// т1к О.Н.Кошелев, 2023-11-30{ Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb
	ФрагментыПредставления.Добавить(НоменклатураКонтрагента.ЕдиницаИзмерения);
	// }т1к О.Н.Кошелев, 2023-11-30
	// - шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15 

	Представление = СтрСоединить(ФрагментыПредставления, "#");
	
	Если Представление = "###" Тогда // ни одно поле не заполнено
		Представление = "";
	КонецЕсли;
	
	НоменклатураКонтрагента.Идентификатор = ИдентификаторПоСтроке(Представление);
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияВспомогательныхСтруктур

// Инициализирует пустую структуру свойств 
// юридического или физического лица.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваЮрФизЛицо()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("ИдентификаторУчастникаЭДО"); // fnsParticipantId
	Результат.Вставить("ИдентификаторОрганизации"); // boxId
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("Наименование");
	Результат.Вставить("НаименованиеПолное");
	Результат.Вставить("НомерСчета");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств валюты.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваВалюта()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Код");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств ставки НДС.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваСтавкаНДС()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Представление");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств единицы измерения.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваЕдиницаИзмерения()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Код"); // Код по ОКЕИ (UnitCode)
	Результат.Вставить("Наименование"); // UnitName
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств партнера.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваПартнер()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Контрагент");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств номенклатуры поставщика.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваНоменклатураПоставщика()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Идентификатор"); // Читается из доп. полей, если не заполнен - генерируется автоматически (см. ИдентификаторПоСтроке())
	Результат.Вставить("Код"); // Код товара (ProductCode / КодТов)
	Результат.Вставить("Артикул"); // Артикул товара (VendorCode / АртикулТов)
	Результат.Вставить("Сорт"); // Сорт товара (Sort / СортТов)
	Результат.Вставить("Наименование");
	Результат.Вставить("Характеристика"); // Характеристика товара (Feature / ХарактерТов)
	Результат.Вставить("Описание"); // Описание работы (Description / Описание)
	
	// + шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15 
	// т1к О.Н.Кошелев, 2023-11-30{Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb 
	Результат.Вставить("ЕдиницаИзмерения");
	// }т1к О.Н.Кошелев, 2023-11-30
	// - шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15 
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств номера ГТД.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваГТД()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("РегистрационныйНомер");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств страны мира.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваСтранаМира()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Код");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру свойств основания докумнента о расхождениях.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйКлючевыеСвойстваДокументОснованиеДокументаОРасхождениях()
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", "");
	Результат.Вставить("Дата", Дата(1, 1, 1));
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру строки товарной части электронного документа.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НоваяСтрокаТоварнойЧастиДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", НоваяНоменклатураИнформационнойБазы());
	Результат.Вставить("НоменклатураКонтрагента");
	Результат.Вставить("Количество", 0);
	Результат.Вставить("МассаБрутто", 0);
	Результат.Вставить("МассаНетто", 0);
	Результат.Вставить("Цена", 0);
	Результат.Вставить("СуммаАкциза", 0);
	Результат.Вставить("СуммаБезНДС", 0);
	Результат.Вставить("СуммаНДС", 0);
	Результат.Вставить("СуммаСНДС", 0);
	Результат.Вставить("КорСчетДт", Неопределено);
	Результат.Вставить("КорСчетКт", Неопределено);
	Результат.Вставить("ДопИнфо", Новый Массив);
	Результат.Вставить("ДанныеГТД", Новый Массив);
	Результат.Вставить("СведенияОМаркировке"		, НовыйСведенияОМаркировке());
	Результат.Вставить("СведенияОПрослеживаемости"	, Новый Массив);
	Результат.Вставить("КлючСтроки", ""); // Служебное поле для записи идентификатора номенклатуры поставщика
	
	Возврат Результат;
	
КонецФункции

Функция НоваяСтрокаТоварнойЧастиДокумента29()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", НоваяНоменклатураИнформационнойБазы());
	Результат.Вставить("НоменклатураКонтрагента");
	Результат.Вставить("Количество", 0);
	Результат.Вставить("МассаБрутто", 0);
	Результат.Вставить("МассаНетто", 0);
	Результат.Вставить("Цена", 0);
	Результат.Вставить("СуммаАкциза", 0);
	Результат.Вставить("СуммаБезНДС", 0);
	Результат.Вставить("СуммаНДС", 0);
	Результат.Вставить("СуммаСНДС", 0);
	Результат.Вставить("КорСчетДт", Неопределено);
	Результат.Вставить("КорСчетКт", Неопределено);
	Результат.Вставить("ДопИнфо", Новый Массив);
	Результат.Вставить("ДанныеГТД", Новый Массив);
	Результат.Вставить("СведенияОМаркировке"		, НовыйСведенияОМаркировке());
	Результат.Вставить("СведенияОПрослеживаемости"	, Новый Массив);
	Результат.Вставить("КлючСтроки", "");
	Результат.Вставить("СуммаСкидки", 0);
	Результат.Вставить("ПроцентСкидки", 0);
	Результат.Вставить("ЦенаБезСкидки", 0);
	Результат.Вставить("СуммаБезНДСБезСкидки", 0);
	Результат.Вставить("СуммаНДСБезСкидки", 0);
	Результат.Вставить("СуммаСНДСБезСкидки", 0);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру строки товарной части электронного корректировочного документа.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НоваяСтрокаТоварнойЧастиКорректировочногоДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", НоваяНоменклатураИнформационнойБазы());
	Результат.Вставить("Номенклатура_До", НоваяНоменклатураИнформационнойБазы());
	Результат.Вставить("НоменклатураКонтрагента");
	Результат.Вставить("НоменклатураКонтрагента_До");
	Результат.Вставить("Количество", 0);
	Результат.Вставить("Количество_До", 0);
	Результат.Вставить("Цена", 0);
	Результат.Вставить("Цена_До", 0);
	Результат.Вставить("СуммаАкциза", 0);
	Результат.Вставить("СуммаАкциза_До", 0);
	Результат.Вставить("СуммаБезНДС", 0);
	Результат.Вставить("СуммаБезНДС_До", 0);
	Результат.Вставить("СуммаНДС", 0);
	Результат.Вставить("СуммаНДС_До", 0);
	Результат.Вставить("СуммаСНДС", 0);
	Результат.Вставить("СуммаСНДС_До", 0);
	Результат.Вставить("КорСчетДт", Неопределено);
	Результат.Вставить("КорСчетКт", Неопределено);
	Результат.Вставить("ДопИнфо", Новый Массив);
	Результат.Вставить("ДанныеГТД", Новый Массив);
	Результат.Вставить("СведенияОМаркировке", НовыйСведенияОМаркировке());
	Результат.Вставить("СведенияОПрослеживаемости"	, Новый Массив);
	Результат.Вставить("КлючСтроки", ""); // Служебное поле для записи идентификатора номенклатуры поставщика
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру строки товарной части электронного акта о расхождениях.
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НоваяСтрокаТоварнойЧастиДокументаОРасхождениях()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", НоваяНоменклатураИнформационнойБазы());
	Результат.Вставить("НоменклатураКонтрагента");
	Результат.Вставить("Количество_До", 0);
	Результат.Вставить("Количество", 0);
	Результат.Вставить("Акциз_До", 0);
	Результат.Вставить("Акциз", 0);
	Результат.Вставить("Цена_До", 0);
	Результат.Вставить("Цена", 0);
	Результат.Вставить("СуммаСНДС_До", 0);
	Результат.Вставить("СуммаСНДС", 0);
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("СуммаНДС_До", 0);
	Результат.Вставить("СуммаНДС", 0);
	Результат.Вставить("ЕстьВДокументеРеализации", Ложь);
	Результат.Вставить("СуммаБезНДС_До", 0);
	Результат.Вставить("СуммаБезНДС", 0);
	
	Результат.Вставить("ДопИнфо", Новый Массив);
	Результат.Вставить("ДанныеГТД", Новый Массив);
	Результат.Вставить("СведенияОМаркировке"		, НовыйСведенияОМаркировке());
	Результат.Вставить("СведенияОПрослеживаемости"	, Новый Массив);
	Результат.Вставить("КлючСтроки", "");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует пустую структуру строки табличной части электроного акта сверки
// 
// Возвращаемое значение:
//  Структура - см. текст функции.
//
Функция НовыйТабличнаяЧастьАктаСверки405()
	
	Результат = Новый Структура;
	Результат.Вставить("Договор", Новый Массив);
	Результат.Вставить("СальдоНачДебет", 0);
	Результат.Вставить("СальдоНачКредит", 0);
	Результат.Вставить("ОборотДебет", 0);
	Результат.Вставить("ОборотКредит", 0);
	Результат.Вставить("СальдоКонДебет", 0);
	Результат.Вставить("СальдоКонКредит", 0);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСведенияОДоговоре405()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдДоговора", "");
	Результат.Вставить("Документ", Новый Массив);
	Результат.Вставить("Описание", "");
	Результат.Вставить("Номер", "");
	Результат.Вставить("Дата", "");
	Результат.Вставить("СальдоНачДебет", 0);
	Результат.Вставить("СальдоНачКредит", 0);
	Результат.Вставить("ОборотДебет", 0);
	Результат.Вставить("ОборотКредит", 0);
	Результат.Вставить("СальдоКонДебет", 0);
	Результат.Вставить("СальдоКонКредит", 0);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСведенияОДокументе405()
	
	Результат = Новый Структура;
	Результат.Вставить("Операция", Новый Массив);
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Номер", "");
	Результат.Вставить("Дата", "");
	Результат.Вставить("ИдДокумента", "");
	Результат.Вставить("ДопИнфо", "");
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСведенияОбОперации405()
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("СуммаДебет", 0);
	Результат.Вставить("СуммаКредит", 0);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПравилаПоискаДанныхИнформационнойБазы

// Создает новую структуру и копирует в нее указанные поля исходной структуры.
//
// Параметры:
//  ИсходнаяСтруктура	 - Структура - исходная структура;
//  КопируемыеПоля		 - Строка - имена копируемый полей исходной структуры;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КопияСтруктуры(ИсходнаяСтруктура, КопируемыеПоля)
	
	Результат = Новый Структура(КопируемыеПоля);
	ЗаполнитьЗначенияСвойств(Результат, ИсходнаяСтруктура);
	
	Возврат Результат;
	
КонецФункции

// Заполняет свойство "Ссылка" структуры "ЮрФизЛицо".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. НовыйКлючевыеСвойстваЮрФизЛицо();
//
Процедура НайтиКонтрагента(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	КоллекцияУчастниковЭДО = ЗначениеВМассиве(СвойстваОбъекта);
	
	ОписаниеОбъектаМетаданных = МетаданныеПрикладногоСправочника("Контрагенты");
	
	Если ОписаниеОбъектаМетаданных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент из КоллекцияУчастниковЭДО Цикл
		
		Если ЗначениеЗаполнено(Элемент.Ссылка) Тогда 
			Возврат;
		КонецЕсли;
		
		ПоляПоиска = Новый Массив;
		ПоляПоиска.Добавить(КопияСтруктуры(Элемент, "ИдентификаторОрганизации"));
		
		Элемент.Ссылка = СсылкаОбъектаПоНаборуПолейПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных);
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет свойство "Ссылка" структуры "ЮрФизЛицо".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. НовыйКлючевыеСвойстваЮрФизЛицо();
//
Процедура НайтиОрганизацию(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	КоллекцияУчастниковЭДО = ЗначениеВМассиве(СвойстваОбъекта);
	
	ОписаниеОбъектаМетаданных = МетаданныеПрикладногоСправочника("Организации");
	
	Если ОписаниеОбъектаМетаданных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент из КоллекцияУчастниковЭДО Цикл
		
		Если ЗначениеЗаполнено(Элемент.Ссылка) Тогда 
			Возврат;
		КонецЕсли;
		
		ПоляПоиска = Новый Массив;
		ПоляПоиска.Добавить(КопияСтруктуры(Элемент, "ИдентификаторОрганизации"));
		ПоляПоиска.Добавить(КопияСтруктуры(Элемент, "ИдентификаторУчастникаЭДО"));
		ПоляПоиска.Добавить(КопияСтруктуры(Элемент, "ИНН, КПП"));
		ПоляПоиска.Добавить(КопияСтруктуры(Элемент, "НаименованиеПолное, ИНН"));
		ПоляПоиска.Добавить(КопияСтруктуры(Элемент, "Наименование, ИНН"));
		
		Элемент.Ссылка = СсылкаОбъектаПоНаборуПолейПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных);
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет свойство "Ссылка" структуры "ЮрФизЛицо".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. НовыйКлючевыеСвойстваПартнер();
//
Процедура НайтиПартнера(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОбъекта.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОбъектаМетаданных = МетаданныеПрикладногоСправочника("Партнеры");
	
	Если ОписаниеОбъектаМетаданных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Контрагент = СвойствоСтруктуры(СвойстваОбъекта, "Контрагент");
	
	СвойстваОбъекта.Ссылка = ПартнерПоКонтрагенту(Контрагент);
	
КонецПроцедуры

// Заполняет свойство "Ссылка" структуры "Валюта".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. НовыйКлючевыеСвойстваВалюта();
//
Процедура НайтиВалюту(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОбъекта.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОбъектаМетаданных = МетаданныеПрикладногоСправочника("Валюты");
	
	Если ОписаниеОбъектаМетаданных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПоляПоиска = КопияСтруктуры(СвойстваОбъекта, "Код");
	СвойстваОбъекта.Ссылка = СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных);
	
КонецПроцедуры

// Заполняет свойство "Ссылка" структуры "НомерГТД".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. НовыйКлючевыеСвойстваНомерГТД();
//
Процедура НайтиНомерГТД(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОбъекта.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОбъектаМетаданных = МетаданныеПрикладногоСправочника("НомераГТД");
	
	Если ОписаниеОбъектаМетаданных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПоляПоиска = Новый Массив;
	ПоляПоиска.Добавить(КопияСтруктуры(СвойстваОбъекта, "РегистрационныйНомер"));
	ПоляПоиска.Добавить(КопияСтруктуры(СвойстваОбъекта, "Код"));
	
	СвойстваОбъекта.Ссылка = СсылкаОбъектаПоНаборуПолейПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных);
	
КонецПроцедуры

// Заполняет свойство "Ссылка" структуры "СтранаМира".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. НовыйКлючевыеСвойстваСтранаМира();
//
Процедура НайтиСтрану(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОбъекта.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОбъектаМетаданных = МетаданныеПрикладногоСправочника("СтраныМира");
	
	Если ОписаниеОбъектаМетаданных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПоляПоиска = КопияСтруктуры(СвойстваОбъекта, "Код");
	СвойстваОбъекта.Ссылка = СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных);
	
КонецПроцедуры

// Заполняет свойство "СчетФактура" структуры "КорректируемыйДокумент".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. КлючевыеСвойстваДокументОснованиеУКД();
//
Процедура НайтиКорректируемыйСчетФактуру(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОбъекта.СчетФактура) Тогда 
		Возврат;
	КонецЕсли;
	
	СвойстваОбъекта.СчетФактура = ДокументУчетаПоРеквизитамВходящегоЭД(ВидыЭлектронныхДокументов().СчетФактура, СвойстваОбъекта);
	
КонецПроцедуры

// Заполняет свойство "ПервичныйДокумент" структуры "КорректируемыйДокумент".
//
// Параметры:
//  СвойстваОбъекта - Структура - см. КлючевыеСвойстваДокументОснованиеУКД();
//
Процедура НайтиКорректируемуюНакладную(СвойстваОбъекта)
	
	Если Не ЗначениеЗаполнено(СвойстваОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОбъекта.ПервичныйДокумент) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СвойстваОбъекта.СчетФактура) = Тип("Массив") И СвойстваОбъекта.СчетФактура.Количество() > 0 Тогда 
		СчетФактура = СвойстваОбъекта.СчетФактура[0];
	Иначе 
		СчетФактура = СвойстваОбъекта.СчетФактура;
	КонецЕсли;
	
	НайденныеДокументы = ДокументыОснованияСчетаФактуры(СчетФактура);
	
	Если Не ЗначениеЗаполнено(НайденныеДокументы) Тогда 
		
		НайденныеДокументы = ДокументУчетаПоРеквизитамВходящегоЭД(ВидыЭлектронныхДокументов().АктОбОказанииУслуг, СвойстваОбъекта);
		Если Не ЗначениеЗаполнено(НайденныеДокументы) Тогда 
			НайденныеДокументы = ДокументУчетаПоРеквизитамВходящегоЭД(ВидыЭлектронныхДокументов().ТоварнаяНакладная, СвойстваОбъекта);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НайденныеДокументы) Тогда
		Результат = Неопределено;
	ИначеЕсли ТипЗнч(НайденныеДокументы) = Тип("Массив") 
		И НайденныеДокументы.Количество() = 1 Тогда 
		Результат = НайденныеДокументы[0];
	Иначе 
		Результат = НайденныеДокументы;
	КонецЕсли;
	
	СвойстваОбъекта.ПервичныйДокумент = Результат;
	
КонецПроцедуры

// Получает ссылку на объект информационной базы, связанный с участником сделки
//
// Параметры:
//  СвойстваИлиМассив - Структура, Массив из Структура - см. КлючевыеСвойстваЮрФизЛицо.
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, Неопределено.
//
Функция СсылкаНаУчастникаЭДО(СвойстваИлиМассив) Экспорт
	
	КоллекцияУчастниковЭДО = ЗначениеВМассиве(СвойстваИлиМассив);
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(КоллекцияУчастниковЭДО) Тогда
		ПервыйЭлемент = КоллекцияУчастниковЭДО[0];
		Результат = СвойствоСтруктуры(ПервыйЭлемент, "Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СопоставлениеНоменклатуры

Процедура ПрочитатьСоответствиеНоменклатурыБЭД(СоответствиеНоменклатуры, ВладелецНоменклатуры, ИдентификаторыНоменклатуры)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СопоставленнаяНоменклатура.Идентификатор КАК Идентификатор,
	|	СопоставленнаяНоменклатура.Номенклатура КАК Номенклатура,
	|	СопоставленнаяНоменклатура.Характеристика КАК Характеристика,
	|	СопоставленнаяНоменклатура.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентовБЭД КАК СопоставленнаяНоменклатура
	|ГДЕ
	|	СопоставленнаяНоменклатура.Владелец = &Владелец
	|	И СопоставленнаяНоменклатура.Идентификатор В(&ИдентификаторыНоменклатуры)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("ИдентификаторыНоменклатуры", ИдентификаторыНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоменклатураИБ = НоваяНоменклатураИнформационнойБазы();
		ЗаполнитьЗначенияСвойств(НоменклатураИБ, Выборка);
		СоответствиеНоменклатуры.Вставить(Выборка.Идентификатор, НоменклатураИБ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСоответствиеНоменклатурыПереопределяемый(СоответствиеНоменклатуры, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриЧтенииСоответствияНоменклатуры"
		, СоответствиеНоменклатуры
		, ВладелецНоменклатуры
		, ИдентификаторыНоменклатуры
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Создает или обновляет запись в регистре сведений НоменклатураКонтрагентовБЭД.
//
// Параметры:
//  НоменклатураИБ					 - Структура - см. функцию НоваяНоменклатураИнформационнойБазы;
//  ВладелецНоменклатуры			 - СправочникСсылка	 - владелец номенклатуры (контрагент/партнер);
//  РеквизитыНоменклатурыКонтрагента - Структура - см. функцию НовыйКлючевыеСвойстваНоменклатураПоставщика;
//
Процедура ЗаписатьСоответствиеНоменклатурыБЭД(НоменклатураКонтрагента, НоменклатураИБ)
	
	Набор = РегистрыСведений.НоменклатураКонтрагентовБЭД.СоздатьНаборЗаписей();
	Набор.Отбор.Владелец.Установить(НоменклатураКонтрагента.Владелец);
	Набор.Отбор.Идентификатор.Установить(НоменклатураКонтрагента.Идентификатор);
	
	Запись = Набор.Добавить();
	
	ЗаполнитьЗначенияСвойств(Запись, НоменклатураКонтрагента);
	ЗаполнитьЗначенияСвойств(Запись, НоменклатураИБ);
	
	Набор.Записать();
	
КонецПроцедуры

Процедура ЗаписатьСоответствиеНоменклатурыПереопределяемый(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриЗаписиСоответствияНоменклатуры"
		, НоменклатураКонтрагента
		, НоменклатураИБ
		, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ЗаполнитьМетаданныеСопоставленияНоменклатурыКонфигурация(МетаданныеСопоставления, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриЗаполненииМетаданныхСопоставленияНоменклатуры"
		, МетаданныеСопоставления
		, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ЗаполнитьМетаданныеСопоставленияНоменклатурыБЭД(МетаданныеСопоставления)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.СопоставлениеНоменклатурыКонтрагентов") Тогда
		МодульСопоставленияНоменклатуры = ОбщегоНазначения.ОбщийМодуль("СопоставлениеНоменклатурыКонтрагентовСлужебный");
	Иначе
		МодульСопоставленияНоменклатуры = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиСлужебный");
	КонецЕсли;
	
	МетаданныеСопоставленияБЭД = МодульСопоставленияНоменклатуры.МетаданныеСопоставленияНоменклатуры();
	
	ЗаполнитьЗначенияСвойств(МетаданныеСопоставления, МетаданныеСопоставленияБЭД);
	
	МетаданныеСопоставления.ВладелецНоменклатурыТип = Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип;
	МетаданныеСопоставления.НоменклатураТип = Новый_ТипНоменклатурыБЭДДляСопоставления(Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип);
	МетаданныеСопоставления.ХарактеристикаТип = Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатурыБЭД.Тип;
	МетаданныеСопоставления.УпаковкаТип = Метаданные.ОпределяемыеТипы.УпаковкаНоменклатурыБЭД.Тип;
	
КонецПроцедуры

Функция Новый_ТипНоменклатурыБЭДДляСопоставления(ОписаниеТипаНоменклатураБЭД)
	
	Результат = ОписаниеТипаНоменклатураБЭД;
	
	ИмяОбъектаМетаданных = "Справочник.Номенклатура";
	Если Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданных) <> Неопределено Тогда
		
		ИмяТипа			 = "СправочникСсылка.Номенклатура";
		ТипНоменклатура	 = Тип(ИмяТипа);
		
		Если ОписаниеТипаНоменклатураБЭД.СодержитТип(ТипНоменклатура) Тогда
			Результат = Новый ОписаниеТипов(ИмяТипа);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВыгрузкаДанных

// Конструктор структуры дополнительных параметров процедуры ЗаполнитьИнформациюОбОрганизации()
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//     * ВидАдреса - Перечисление_ВидыКИ - вид адреса для заполнения свойства Address.
//
Функция ПараметрыЗаполненияИнформацииОбОрганизации()
	
	Результат = Новый Структура;
	Результат.Вставить("ВидАдреса", Перечисление_ВидыКИ().ЮридическийАдрес);
	
	Возврат Результат;
	
КонецФункции

// Заполняет сведения об участнике сделки.
//
// Параметры:
//  СведенияОбОрганизации	 - Структура - см. функцию Новый_ExtendedOrganizationInfo()
//  РеквизитыОрганизации	 - Структура - см. функцию РеквизитыЮрФизЛица()
//  ДополнительныеПараметры	 - Структура - (Необязательный) см. функцию ПараметрыЗаполненияИнформацииОбОрганизации()
//
Процедура ЗаполнитьИнформациюОбОрганизации(СведенияОбОрганизации, РеквизитыОрганизации, ДополнительныеПараметры = Неопределено)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияИнформацииОбОрганизации();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	#Область ОбщиеСвойства
	
	СведенияОбОрганизации.Name	 = РеквизитыОрганизации.НаименованиеДляПечатныхФорм;
	СведенияОбОрганизации.Inn	 = РеквизитыОрганизации.ИНН;
	СведенияОбОрганизации.Kpp	 = РеквизитыОрганизации.КПП;
	СведенияОбОрганизации.Okpo	 = РеквизитыОрганизации.КодПоОкпо;
	СведенияОбОрганизации.Phone	 = РеквизитыОрганизации.Телефоны;
	
	СведенияОбОрганизации.BankAccountNumber		 = РеквизитыОрганизации.НомерСчета;
	СведенияОбОрганизации.BankId				 = РеквизитыОрганизации.БИК;
	СведенияОбОрганизации.BankName				 = ?(ЗначениеЗаполнено(РеквизитыОрганизации.Банк), СокрЛП(РеквизитыОрганизации.Банк), Неопределено); // Банк может быть ссылкой
	
	// Адрес
	ЗначенияПолейАдреса = РеквизитыОрганизации["ЗначенияПолей" + ПараметрыЗаполнения.ВидАдреса];
	Если ЗначениеЗаполнено(ЗначенияПолейАдреса) Тогда 
		СтруктураАдреса = СведенияОбАдресе(ЗначенияПолейАдреса);
		Заполнить_AddressInfo(СведенияОбОрганизации.Address, СтруктураАдреса);
	КонецЕсли;
	
	#КонецОбласти
	
	ОрганизацияИП = СтрДлина(РеквизитыОрганизации.ИНН) = 12;
	ТипОрганизации = ?(ОрганизацияИП, "IndividualEntity", "LegalEntity");
	
	#Область Свойства_ExtendedOrganizationInfo
	Если СведенияОбОрганизации.Свойство("CorrespondentAccount") Тогда 
		СведенияОбОрганизации.CorrespondentAccount = РеквизитыОрганизации.КоррСчет;
	КонецЕсли;
	
	Если СведенияОбОрганизации.Свойство("Email") Тогда
		СведенияОбОрганизации.Email = РеквизитыОрганизации.Email;
	КонецЕсли;
	
	Если СведенияОбОрганизации.Свойство("Type") Тогда 
		СведенияОбОрганизации.Type = ТипОрганизации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОрганизации.Свидетельство)
		И СведенияОбОрганизации.Свойство("IndividualEntityRegistrationCertificate") Тогда
		СведенияОбОрганизации.IndividualEntityRegistrationCertificate = РеквизитыОрганизации.Свидетельство;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Свойства_OrganizationInfo
	Если СведенияОбОрганизации.Свойство("IsSoleProprietor") Тогда 
		СведенияОбОрганизации.IsSoleProprietor = (ТипОрганизации = "IndividualEntity");
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

// Заполняет сведения таблицы счета на оплату.
//
// Параметры:
//  ТаблицаЭД	 - Структура		 - см. функцию Новый_ProformaInvoiceTable()
//  ДанныеТЧ	 - ТаблицаЗначений	 - см. функцию ДанныеТабличныхЧастей()
//
Процедура ЗаполнитьТаблицуСчетаНаОплату(ТаблицаЭД, ДанныеТЧ)
	
	// Итоги
	ТаблицаЭД.TotalWithVatExcluded	 = ДанныеТЧ.Итог("Сумма");
	ТаблицаЭД.TotalVat				 = ДанныеТЧ.Итог("СуммаНДС");
	ТаблицаЭД.Total					 = ДанныеТЧ.Итог("СуммаСНДС");
	ТаблицаЭД.GrandTotal			 = ТаблицаЭД.Total;
	
	// Строки таблицы
	Для Каждого СтрокаТЧ Из ДанныеТЧ Цикл 
		
		СтрокаЭД = Новый_ProformaInvoiceItem();
		
		СтрокаЭД.Product	 = СтрокаТЧ.НоменклатураПредставление;
		СтрокаЭД.Unit		 = СтрокаТЧ.ЕдиницаИзмеренияКод;
		СтрокаЭД.UnitName	 = Строка(СтрокаТЧ.ЕдиницаИзмерения);
		СтрокаЭД.Quantity	 = СтрокаТЧ.Количество;
		СтрокаЭД.Price		 = СтрокаТЧ.Цена;
		СтрокаЭД.TaxRate	 = СтрокаТЧ.СтавкаНДСПредставление;
		СтрокаЭД.Excise		 = Неопределено;
		СтрокаЭД.Vat		 = СтрокаТЧ.СуммаНДС;
		СтрокаЭД.Subtotal	 = СтрокаТЧ.СуммаСНДС;
		СтрокаЭД.SubtotalWithVatExcluded = СтрокаТЧ.Сумма;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(СтрокаЭД, СтрокаТЧ);
		
		//СтрокаЭД.AdditionalInfo.Добавить();
		
		ТаблицаЭД.Items.Добавить(СтрокаЭД);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет структурированное инфополе в контент исходящего документа
//
// Параметры
//  Массив - Массив - Коллекция инфополей шапки или табличной части документа
//  Key - Строка - Ключ добавляемого свойства
//  Value - Строка - Значение добавляемого свойства
//
Процедура ДополнитьМассивKeyValue(Массив, Key, Value)
	
	НовыйЭлемент = Новый Структура;
	
	НовыйЭлемент.Вставить("Key", Key);
	НовыйЭлемент.Вставить("Value", Value);
	
	Массив.Добавить(НовыйЭлемент);
	
КонецПроцедуры

// Возвращает структурированную информацию о договоре, соглашении или
// ином основании отгрузки/перехода прав собственности.
//
// Параметры:
//  Шапка - Структура - реквизиты шапки документа (см. ДанныеШапки)
// 
// Возвращаемое значение:
//  Неопределено - если не удалось получить реквизиты основания передачи.
//  Структура - содержит поля:
//     * Представление - Строка - представление основания (договора, соглашения);
//     * Номер - Строка - (необязательный) номер основания;
//     * Дата - Дата - (необязательный) дата основания;
//
Функция РеквизитыДоговора(Шапка)
	
	Результат = Новый Структура;
	Результат.Вставить("Представление");
	Результат.Вставить("Номер");
	Результат.Вставить("Дата");
	
	СтандартнаяОбработка = Истина;
	ПриПолученииРеквизитовДоговора(Результат, Шапка, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		// TODO: добавить в контракт шапки свойство "Договор" и получать реквизиты из него
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Представление) Тогда 
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Событие возникает при получении реквизитов договора, соглашения
// или иного основания передачи/перехода прав собственности.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииРеквизитовДоговора"
		, Реквизиты
		, Шапка
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Возвращает график оплаты счета на оплату.
//
// Параметры:
//  Шапка - Структура - реквизиты шапки документа (см. ДанныеШапки)
// 
// Возвращаемое значение:
//  ТаблицаЗначений - график платежей, содержит колонки:
//     * НомерСтроки	 - Число	 - номер строки графика;
//     * ДатаПлатежа	 - Дата		 - дата платежа;
//     * ПроцентПлатежа	 - Число	 - процент платежа;
//     * СуммаПлатежа	 - Число	 - сумма платежа;
//     * ЭтоЗалогЗаТару	 - Булево	 - Истина, если это оплата залога за тару;
//
Функция ЭтапыГрафикаОплатПоДокументу(Шапка)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НомерСтроки");
	Результат.Колонки.Добавить("ДатаПлатежа");
	Результат.Колонки.Добавить("ПроцентПлатежа");
	Результат.Колонки.Добавить("СуммаПлатежа");
	Результат.Колонки.Добавить("ЭтоЗалогЗаТару");
	
	СтандартнаяОбработка = Истина;
	ПриПолученииЭтаповГрафикаОплат(Результат, Шапка, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		ДатаПлатежа = Шапка.СрокОплаты;
		
		Если ЗначениеЗаполнено(ДатаПлатежа) Тогда 
			Этап = Результат.Добавить();
			Этап.НомерСтроки	 = 1;
			Этап.ДатаПлатежа	 = ДатаПлатежа;
			Этап.ПроцентПлатежа	 = 100;
			Этап.СуммаПлатежа	 = Шапка.СуммаДокумента;
			Этап.ЭтоЗалогЗаТару	 = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Событие возникает при получении таблицы этапов оплаты по документу.
//
Процедура ПриПолученииЭтаповГрафикаОплат(ЭтапыОплаты, Шапка, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ПриПолученииЭтаповГрафикаОплат"
		, ЭтапыОплаты
		, Шапка
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Заполняет поля AmountsInc, AmountsDec, TotalsInc, TotalsDec в контенте КСФ
//
Процедура РассчитатьСуммыУвеличенияУменьшенияВКонтентеКСФ(Content)
	
	Content.TotalsDec.Total = 0;
	Content.TotalsDec.TotalWithVatExcluded = 0;
	Content.TotalsDec.Vat = 0;
	
	Content.TotalsInc.Total= 0;
	Content.TotalsInc.TotalWithVatExcluded= 0;
	Content.TotalsInc.Vat= 0;
	
	Для каждого Item из Content.items Цикл 
						
		Если Item.OriginalValues.TotalWithVatExcluded < Item.CorrectedValues.TotalWithVatExcluded Тогда 
			Item.AmountsInc.TotalWithVatExcluded= 	Item.CorrectedValues.TotalWithVatExcluded - Item.OriginalValues.TotalWithVatExcluded;
			Item.AmountsDec.TotalWithVatExcluded= 	0;
		Иначе 
			Item.AmountsInc.TotalWithVatExcluded= 	0; 
			Item.AmountsDec.TotalWithVatExcluded= 	- Item.CorrectedValues.TotalWithVatExcluded + Item.OriginalValues.TotalWithVatExcluded;
		КонецЕсли;
		
		Если Item.OriginalValues.Vat < Item.CorrectedValues.Vat Тогда 
			Item.AmountsInc.Vat= Item.CorrectedValues.Vat - Item.OriginalValues.Vat;
			Item.AmountsDec.Vat= 0; 
		Иначе 
			Item.AmountsInc.Vat= 0 ;
			Item.AmountsDec.Vat= - Item.CorrectedValues.Vat + Item.OriginalValues.Vat;
		КонецЕсли;
		
		Если Item.OriginalValues.Total < Item.CorrectedValues.Total Тогда 
			Item.AmountsInc.Total= Item.CorrectedValues.Total - Item.OriginalValues.Total;
			Item.AmountsDec.Total= 0;
		Иначе 
			Item.AmountsInc.Total= 0;
			Item.AmountsDec.Total= - Item.CorrectedValues.Total + Item.OriginalValues.Total;
		КонецЕсли;
		
		Content.TotalsDec.TotalWithVatExcluded= Content.TotalsDec.TotalWithVatExcluded 	+ Item.AmountsDec.TotalWithVatExcluded; 
		Content.TotalsDec.Vat= 					Content.TotalsDec.Vat					+ Item.AmountsDec.Vat; 
		Content.TotalsDec.Total= 				Content.TotalsDec.Total 				+ Item.AmountsDec.Total; 
		
		Content.TotalsInc.TotalWithVatExcluded= Content.TotalsInc.TotalWithVatExcluded 	+ Item.AmountsInc.TotalWithVatExcluded; 
		Content.TotalsInc.Vat= 					Content.TotalsInc.Vat					+ Item.AmountsInc.Vat; 
		Content.TotalsInc.Total= 				Content.TotalsInc.Total 				+ Item.AmountsInc.Total; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКонтактнойИнформацией

Функция ВидыКонтактнойИнформацииКонтрагентов()
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес");
	Результат.Вставить("Факс");
	
	СтандартнаяОбработка = Истина;
	//ПриПолученииВидовКонтактнойИнформации(Результат, "Контрагенты", СтандартнаяОбработка); // TODO: Прокинуть событие во все интеграционники
	
	Если СтандартнаяОбработка Тогда 
		
		Результат.ЮридическийАдрес	 = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		Результат.ФактическийАдрес	 = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		Результат.ПочтовыйАдрес		 = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
		Результат.Факс				 = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидыКонтактнойИнформацииОрганизаций()
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес");
	Результат.Вставить("Факс");
	
	СтандартнаяОбработка = Истина;
	//ПриПолученииВидовКонтактнойИнформации(Результат, "Организации", СтандартнаяОбработка); // TODO: Прокинуть событие во все интеграционники
	
	Если СтандартнаяОбработка Тогда 
		
		Результат.ЮридическийАдрес	 = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
		Результат.ФактическийАдрес	 = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
		Результат.ПочтовыйАдрес		 = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
		Результат.Факс				 = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу, содержащую контактную информацию объекта.
//
// Параметры:
//  СсылкаИлиОбъект - ЛюбаяСсылка, Объект - Ссылка или объект-владелец контактной информации (организация,
//                                          контрагент, партнер и т.д.).
//  ВидКИ           - СправочникСсылка.ВидыКонтактнойИнформации - Необязательный, отбор по виду контактной информации.
//  Дата            - Дата - необязательный, дата с которой действует запись контактной информации,
//                           используется при хранении истории изменения контактной информации.
//                           Если владелец хранит историю изменений, то при несоответствии параметра
//                           дате будет вызвано исключение.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с контактной информацией объекта, содержащая колонки:
//    * Объект			 - Ссылка - Владелец контактной информации;
//    * Вид				 - СправочникСсылка.ВидыКонтактнойИнформации   - Вид контактной информации;
//    * Тип				 - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации;
//    * ЗначенияПолей	 - Строка - XML, соответствующий XDTO пакетам КонтактнаяИнформация или Адрес;
//    * Значение		 - Строка - (необязательный) контактная информация во внутреннем формате JSON (только для БСП 3.0 и выше).
//    * Представление	 - Строка - Представление контактной информации.
//    * Дата			 - Дата   - (необязательный) Дата с которой действует запись контактной информации (для БСП 2.4 и выше).
//
Функция КонтактнаяИнформацияОбъекта(ЮрФизЛицо, ВидКИ = Неопределено, Знач Дата = Неопределено)
	
	ИнформацияОКонфигурации = МетодСервера(, "СведенияОКонфигурации");
	
	ВерсияБСП = ИнформацияОКонфигурации.ВерсииБиблиотек.СтандартныеПодсистемы;
	
	Если МетодСервера(, "СравнитьВерсии", ВерсияБСП, "2.4") >= 0 Тогда
		Результат = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицо, ВидКИ, Дата, Ложь);
	Иначе 
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЮрФизЛицо);
		Результат	 = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивСсылок, , ВидКИ, Дата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Исправление ошибки БСП 00-00174180:
// Значения полей адреса в формате JSON содержат неверный код страны или код страны вообще не указан.
// Такое поведение зафиксировано на ERP 2.4.6.85 и БП 3.0.65.72 (версии БСП 3.0.1.252 и 3.0.1.268 соответственно).
//
// Параметры:
//  СтруктураАдреса - Структура - см. функцию СведенияОбАдресе;
//
Процедура ПроверитьИсправитьКодСтраныВСведенияхОбАдресе(СтруктураАдреса)
	
	Если ЗначениеЗаполнено(СтруктураАдреса.КодСтраны) Тогда
		Возврат;
	КонецЕсли;
	
	// Находим страну по ее наименованию
	ДанныеСтраны = УправлениеКонтактнойИнформацией.ДанныеКлассификатораСтранМираПоНаименованию(СтруктураАдреса.Страна);
	
	// Исправляем код страны
	Если ЗначениеЗаполнено(ДанныеСтраны) Тогда 
		СтруктураАдреса.КодСтраны = ДанныеСтраны.Код;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, является ли адрес российским.
// Проверка производится по коду страны.
//
// Параметры:
//  СтруктураАдреса - Структура - см. функцию СведенияОбАдресе или урезанный вариант (КодСтраны и Представление);
// 
// Возвращаемое значение:
//  Булево - Истина, если указан код России по ОКСМ (643).
//
Функция ЭтоРоссийскийАдрес(СтруктураАдреса)
	
	Результат = (СтруктураАдреса.КодСтраны = "643");
	
	Возврат Результат;
	
КонецФункции

// Проверяет адрес на соответствие формату КЛАДР. Если в сведении об адресе
// заполнены специфичные для ФИАС поля, то он не поместится в формат КЛАДР.
//
// Параметры:
//  СтруктураАдреса - Структура - см. функцию СведенияОбАдресе.
//
// Возвращаемое значение - Булево - Истина, если адрес соответствует формату КЛАДР.
//
Функция АдресСоответствуетФорматуКЛАДР(СтруктураАдреса)
	
	Соответствует = Ложь;
	
	Если ЗначениеЗаполнено(СвойствоСтруктуры(СтруктураАдреса, "КодРегиона"))
		И Не ЕстьПоляНеПоКЛАДР(СтруктураАдреса)
		И ЗданиеСоответствуетКЛАДР(СтруктураАдреса)
		И КорпусСоответствуетКЛАДР(СтруктураАдреса)
		И ПомещениеСоответствуетКЛАДР(СтруктураАдреса) Тогда
		
		Соответствует = Истина;
		
	КонецЕсли;
	
	Возврат Соответствует;
	
КонецФункции

Функция ЭтоМуниципальныйАдрес(СтруктураАдреса)
	
	ТипАдреса = СвойствоСтруктуры(СтруктураАдреса, "ТипАдреса");
	
	Результат = ТипАдреса = МуниципальныйАдрес();
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что в структуре адреса присутствуют поля, которых нет в формате КЛАДР.
//
// Параметры:
//  СтруктураАдреса - Структура - см. функцию СведенияОбАдресе;
// 
// Возвращаемое значение:
//  Булево - Истина, если есть хотя бы одно заполненное поле, не соответстующее формату КЛАДР.
//
Функция ЕстьПоляНеПоКЛАДР(СтруктураАдреса)
	
	Результат = Ложь;
	
	ПоляНеПоКЛАДР = Новый Массив;
	ПоляНеПоКЛАДР.Добавить("Округ");
	ПоляНеПоКЛАДР.Добавить("МуниципальныйРайон");
	ПоляНеПоКЛАДР.Добавить("Поселение");
	ПоляНеПоКЛАДР.Добавить("ВнутригородскойРайон");
	ПоляНеПоКЛАДР.Добавить("Территория");
	ПоляНеПоКЛАДР.Добавить("ДополнительнаяТерритория");
	ПоляНеПоКЛАДР.Добавить("ЭлементДополнительнойТерритории");
	
	Для Каждого ИмяПоля Из ПоляНеПоКЛАДР Цикл 
		
		ЗначениеПоля = СвойствоСтруктуры(СтруктураАдреса, ИмяПоля);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗданиеСоответствуетКЛАДР(СтруктураАдреса)
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(СтруктураАдреса.Здание.ТипЗдания)
		Или ВРег(СтруктураАдреса.Здание.ТипЗдания) = ВРег("Дом") Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КорпусСоответствуетКЛАДР(СтруктураАдреса)
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(СтруктураАдреса.Корпуса)
		Или СтруктураАдреса.Корпуса.Количество() = 1 //Тогда 
		И ВРег(СтруктураАдреса.Корпуса[0].ТипКорпуса) = ВРег("Корпус") Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПомещениеСоответствуетКЛАДР(СтруктураАдреса)
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(СтруктураАдреса.Помещения)
		Или СтруктураАдреса.Помещения.Количество() = 1 //Тогда 
		И ВРег(СтруктураАдреса.Помещения[0].ТипПомещения) = ВРег("Квартира") Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СкопироватьЗначенияJSONВЗначенияПолей(РеквизитыЮрФизЛица)
	
	СоответствиеПолей = Новый Структура;
	СоответствиеПолей.Вставить("ЗначениеJSONЮридическийАдрес"	, "ЗначенияПолейЮридическийАдрес");
	СоответствиеПолей.Вставить("ЗначениеJSONФактическийАдрес"	, "ЗначенияПолейФактическийАдрес");
	СоответствиеПолей.Вставить("ЗначениеJSONПочтовыйАдрес"		, "ЗначенияПолейПочтовыйАдрес");
	СоответствиеПолей.Вставить("ЗначениеJSONТелефоны"			, "ЗначенияПолейТелефоны");
	
	Для каждого Элемент Из СоответствиеПолей Цикл
		
		ПолеИсточник = Элемент.Ключ;
		ПолеПриемник = Элемент.Значение;
		
		НовоеЗначение = РеквизитыЮрФизЛица[ПолеИсточник];
		
		Если ЗначениеЗаполнено(НовоеЗначение) Тогда
			РеквизитыЮрФизЛица[ПолеПриемник] = НовоеЗначение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет в коллекции реквизитов компании свойства, содержащие
// значения полей юридического и фактического адресов.
//
// Параметры:
//  РеквизитыЮрФизЛица	 - Структура - см. функцию РеквизитыЮрФизЛица()
//  ЮрФизЛицо			 - СправочникСсылка - компания, для которой нужно заполнить адресную информацию
//  Период				 - Дата - дата, на которую нужно получить значения периодических реквизитов
//
Процедура ДополнитьРеквизитыЮрФизЛицаАдреснойИнформацией(РеквизитыЮрФизЛица, ЮрФизЛицо, Период = Неопределено)
	
	ПроверяемыеВидыКИ = Новый Массив;
	ПроверяемыеВидыКИ.Добавить(Перечисление_ВидыКИ().ЮридическийАдрес);
	ПроверяемыеВидыКИ.Добавить(Перечисление_ВидыКИ().ФактическийАдрес);
	
	Для Каждого ВидКИСтрокой Из ПроверяемыеВидыКИ Цикл 
		
		ИмяСвойства = "ЗначенияПолей" + ВидКИСтрокой;
		Если ЗначениеЗаполнено(РеквизитыЮрФизЛица[ИмяСвойства]) Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭтоЮрАдрес = (ВидКИСтрокой = Перечисление_ВидыКИ().ЮридическийАдрес);
		
		ВидКИ = МетодСервера(ИмяМодуляИнтеграции(), "ПолучитьВидКИ", ЮрФизЛицо, ЭтоЮрАдрес);
		
		Адрес = АдресЮрФизЛица(ЮрФизЛицо, ВидКИ, Период);
		
		РеквизитыЮрФизЛица[ИмяСвойства] = Адрес.ЗначенияПолей;
		РеквизитыЮрФизЛица[ВидКИСтрокой] = Адрес.Представление;
		
	КонецЦикла;
	
КонецПроцедуры

#Область СведенияОбАдресе_ЗначенияСвойстваТипАдреса

Функция АдминистративноТерриториальныйАдрес()
	Возврат "Административно-территориальный"; 
КонецФункции

Функция МуниципальныйАдрес()
	Возврат "Муниципальный";
КонецФункции

Функция ИностранныйАдрес()
	Возврат "Иностранный";
КонецФункции

#КонецОбласти

Функция ПолеАдресаССокращением(Поле, ПолеСокращение)
	
	Результат = СокрЛП(ПодставитьПараметрыВСтроку("%1 %2", Поле, ПолеСокращение));
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеАдреса(СтруктураАдреса)
	
	Если ЭтоМуниципальныйАдрес(СтруктураАдреса) Тогда
		Результат = СвойствоСтруктуры(СтруктураАдреса, "МуниципальноеПредставление");
	Иначе
		Результат = СвойствоСтруктуры(СтруктураАдреса, "Представление");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СохраненноеПредставлениеАдресаСовпадаетСРассчитанным(СтруктураАдреса)
	
	РассчитанноеПредставление	 = ВРег(ПредставлениеАдреса(СтруктураАдреса));
	СохраненноеПредставление	 = ВРег(СтруктураАдреса.СохраненноеПредставление);
	Страна = ВРег(СтруктураАдреса.Страна);
	
	Результат = Ложь;
	
	Если РассчитанноеПредставление = СохраненноеПредставление
		Или РассчитанноеПредставление = Страна + ", " + СохраненноеПредставление Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтроковыеФункции_СлужебныеМетоды

// Выполняет преобразование цифры в римскую нотацию. 
//
// Параметры
//	Цифра - Число - цифра от 0 до 9.
//  РимскаяЕдиница, РимскаяПятерка, РимскаяДесятка - Строка - символы, соответствующие римским цифрам.
//
// Возвращаемое значение
//	Строка - цифра в римской нотации.
//
// Пример: 
//	ПреобразоватьЦифруВРимскуюНотацию(7,"I","V","X") = "VII".
//
Функция ПреобразоватьЦифруВРимскуюНотацию(Цифра, РимскаяЕдиница, РимскаяПятерка, РимскаяДесятка)
	
	РимскаяЦифра = "";
	Если Цифра = 1 Тогда
		РимскаяЦифра = РимскаяЕдиница
	ИначеЕсли Цифра = 2 Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 3 Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 4 Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяПятерка;
	ИначеЕсли Цифра = 5 Тогда
		РимскаяЦифра = РимскаяПятерка;
	ИначеЕсли Цифра = 6 Тогда
		РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница;
	ИначеЕсли Цифра = 7 Тогда
		РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 8 Тогда
		РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница + РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 9 Тогда
		РимскаяЦифра = РимскаяЕдиница + РимскаяДесятка;
	КонецЕсли;
	Возврат РимскаяЦифра;
	
КонецФункции

// Вставляет параметры в строку, учитывая, что в параметрах могут использоваться подстановочные слова %1, %2 и т.д.
//
Функция ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = Найти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = "";
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр =  Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр =  Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр =  Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр =  Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр =  Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр =  Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр =  Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр =  Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр =  Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = "" Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = Найти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции

Функция СоответствиеКириллицыИЛатиницы()
	// транслитерация, используемая в загранпаспортах 1997-2010 гг.
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("а", "a");
	Соответствие.Вставить("б", "b");
	Соответствие.Вставить("в", "v");
	Соответствие.Вставить("г", "g");
	Соответствие.Вставить("д", "d");
	Соответствие.Вставить("е", "e");
	Соответствие.Вставить("ё", "e");
	Соответствие.Вставить("ж", "zh");
	Соответствие.Вставить("з", "z");
	Соответствие.Вставить("и", "i");
	Соответствие.Вставить("й", "y");
	Соответствие.Вставить("к", "k");
	Соответствие.Вставить("л", "l");
	Соответствие.Вставить("м", "m");
	Соответствие.Вставить("н", "n");
	Соответствие.Вставить("о", "o");
	Соответствие.Вставить("п", "p");
	Соответствие.Вставить("р", "r");
	Соответствие.Вставить("с", "s");
	Соответствие.Вставить("т", "t");
	Соответствие.Вставить("у", "u");
	Соответствие.Вставить("ф", "f");
	Соответствие.Вставить("х", "kh");
	Соответствие.Вставить("ц", "ts");
	Соответствие.Вставить("ч", "ch");
	Соответствие.Вставить("ш", "sh");
	Соответствие.Вставить("щ", "shch");
	Соответствие.Вставить("ъ", """");
	Соответствие.Вставить("ы", "y");
	Соответствие.Вставить("ь", ""); // пропускается
	Соответствие.Вставить("э", "e");
	Соответствие.Вставить("ю", "yu");
	Соответствие.Вставить("я", "ya");
	
	Возврат Соответствие;
КонецФункции

#КонецОбласти

Функция НовоеПрограммноеПеречисление(ЗначенияПеречисления)
	
	Результат = Новый Структура;
	
	Для Каждого Значение Из ЗначенияПеречисления Цикл
		Результат.Вставить(Значение, Значение);
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Имя события для записи в журнал регистрации.
//
Функция СобытиеЖурналаРегистрации()
	
	Результат = НСтр("ru = 'Диадок'; en = 'Diadoc'", КодОсновногоЯзыка());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрограммныеПеречисления

// Описывает возможные значения базовых версий форматов контента.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция БазовыеФорматы()
	
	Результат = МетодСервера(, "БазовыеФорматы");
	
	Возврат Результат;
	
КонецФункции

// Описывает возможные значения типов протоконтента.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ТипыКонтента()
	
	Результат = МетодСервера(, "ТипыКонтента");
	
	Возврат Результат;
	
КонецФункции

// Идентификаторы типов документов в терминах Diadoc Web API 
// см. http://api-docs.diadoc.ru/ru/latest/proto/FullVersion.html (TypeNamedId).
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ИдентификаторыТиповДокументов()
	
	ВозможныеЗначения = Новый Массив;
	ВозможныеЗначения.Добавить("UniversalTransferDocument");
	ВозможныеЗначения.Добавить("UniversalTransferDocumentRevision");
	ВозможныеЗначения.Добавить("UniversalCorrectionDocument");
	ВозможныеЗначения.Добавить("UniversalCorrectionDocumentRevision");
	ВозможныеЗначения.Добавить("XmlTorg12");
	ВозможныеЗначения.Добавить("Torg12");
	ВозможныеЗначения.Добавить("XmlAcceptanceCertificate");
	ВозможныеЗначения.Добавить("AcceptanceCertificate");
	ВозможныеЗначения.Добавить("Invoice");
	ВозможныеЗначения.Добавить("InvoiceRevision");
	ВозможныеЗначения.Добавить("InvoiceCorrection");
	ВозможныеЗначения.Добавить("InvoiceCorrectionRevision");
	ВозможныеЗначения.Добавить("ProformaInvoice");
	ВозможныеЗначения.Добавить("ReconciliationAct");
	ВозможныеЗначения.Добавить("Nonformalized");
	ВозможныеЗначения.Добавить("TrustConnectionRequest");
	ВозможныеЗначения.Добавить("PriceList");
	ВозможныеЗначения.Добавить("PriceListAgreement");
	ВозможныеЗначения.Добавить("CertificateRegistry");
	ВозможныеЗначения.Добавить("Contract");
	ВозможныеЗначения.Добавить("Torg13");
	ВозможныеЗначения.Добавить("ServiceDetails");
	ВозможныеЗначения.Добавить("SupplementaryAgreement");
	ВозможныеЗначения.Добавить("StorageInventoryAcceptanceCertificate");
	ВозможныеЗначения.Добавить("ReturnInventoryAcceptanceCertificate");
	ВозможныеЗначения.Добавить("PowerOfAttorney");
	ВозможныеЗначения.Добавить("Torg2");
	ВозможныеЗначения.Добавить("Letter");
	ВозможныеЗначения.Добавить("XmlInvoiceOffer");
	ВозможныеЗначения.Добавить("XmlProformaInvoice");
	
	Возврат НовоеПрограммноеПеречисление(ВозможныеЗначения);
	
КонецФункции

// Идентификаторы функций документов в терминах Web API Diadoc.
// см. http://api-docs.diadoc.ru/ru/latest/proto/FullVersion.html (Function).
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ФункцииЭлектронныхДокументов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПоУмолчанию", "default");
	Результат.Вставить("СЧФДОП"		, "СЧФДОП");
	Результат.Вставить("СЧФ"		, "СЧФ");
	Результат.Вставить("ДОП"		, "ДОП");
	Результат.Вставить("КСЧФДИС"	, "КСЧФДИС");
	Результат.Вставить("КСЧФ"		, "КСЧФ");
	Результат.Вставить("ДИС"		, "ДИС");
	Результат.Вставить("БезДопИнфо"	, "NoAdditionalInfo");
	Результат.Вставить("СДопИнфо"	, "WithAdditionalInfo");
	Результат.Вставить("СвРК"		, "СвРК");
	Результат.Вставить("СвЗК"		, "СвЗК");
	Результат.Вставить("СвИСРК"		, "СвИСРК");
	Результат.Вставить("СвИСЗК"		, "СвИСЗК");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Идентификаторы версий документов в терминах Web API Diadoc.
// см. http://api-docs.diadoc.ru/ru/latest/proto/FullVersion.html (Version).
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ВерсииФорматовЭлектронныхДокументов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД155"	, "utd_05_01_05");
	Результат.Вставить("УПД820"	, "utd820_05_01_02_hyphen");
	Результат.Вставить("УКД189"	, "ucd_05_01_03");
	Результат.Вставить("УКД736"	, "ucd736_05_01_01");
	Результат.Вставить("Торг172", "torg12_05_01_02");
	Результат.Вставить("Акт172"	, "act_05_01_02");
	Результат.Вставить("СФ93"	, "invoice_05_02_02");
	Результат.Вставить("КСФ93"	, "invoicecor_05_02_02");
	Результат.Вставить("Торг423", "torg2_05_01_01");
	Результат.Вставить("Файл"	, "v1");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возможные значения настройки ДиадокФормироватьУПД, которая
// определяет список отправляемых типов документов и их версии.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция КлючиНастроекОтправки()
	
	ВозможныеЗначения = Новый Массив;
	
	// УПД820 СЧФДОП, УКД736 КСЧФДИС
	ВозможныеЗначения.Добавить("СЧФДОП_820_736");
	
	// УПД820 СЧФ+ДОП, УКД736 КСЧФ+ДИС
	ВозможныеЗначения.Добавить("СЧФ_ДОП_820_736");
	
	// СФ820, Торг820/Акт820, КСФ736
	ВозможныеЗначения.Добавить("СФТОРГ12АКТ_820_736");
	
	// УПД820 СЧФДОП, УКД189 КСЧФДИС
	ВозможныеЗначения.Добавить("СЧФДОП_820");
	
	// УПД820 СЧФ+ДОП, УКД189 КСЧФ+ДИС
	ВозможныеЗначения.Добавить("СЧФ_ДОП_820");
	
	// СФ820, Торг820/Акт820, КСФ189
	ВозможныеЗначения.Добавить("СФТОРГ12АКТ_820");
	
	// УПД155 СЧФДОП, УКД189 КСЧФДИС
	ВозможныеЗначения.Добавить("СЧФДОП");
	
	// УПД155 СЧФ+ДОП, УКД189 КСЧФ+ДИС
	ВозможныеЗначения.Добавить("СЧФ_ДОП");
	
	// СФ155, Торг155/Акт155, КСФ189
	ВозможныеЗначения.Добавить("СФТОРГ12АКТ");
	
	// УПД155 СЧФ, Торг172/Акт172, УКД189
	ВозможныеЗначения.Добавить("СЧФ");
	
	// СФ93, УПД155 ДОП, КСФ93
	ВозможныеЗначения.Добавить("ДОП");
	
	// СФ155, Торг172/Акт172, КСФ189
	ВозможныеЗначения.Добавить("СФ");
	
	// СФ93, Торг155/Акт155, КСФ93
	ВозможныеЗначения.Добавить("ТОРГ12АКТ");
	
	// СФ93, Торг172/Акт172, КСФ93
	ВозможныеЗначения.Добавить("НЕТ");
	
	Возврат НовоеПрограммноеПеречисление(ВозможныеЗначения);
	
КонецФункции

// Возможные значения настройки ДиадокФормироватьСчетНаОсновании.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ВидыОснованийСчета()
	
	Результат = Новый Структура;
	Результат.Вставить("Счет", 0);
	Результат.Вставить("Заказ", 4);
	Результат.Вставить("ДокументПродажи", 1);
	Результат.Вставить("НеФормировать", 2);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возможные значения следующих настроек параметров отправки:
//  * ДиадокИдентификаторСвойстваПечатнаяФормаДляТоваров
//  * ДиадокИдентификаторСвойстваПечатнаяФормаДляУслуг
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура.
//
Функция ВидыПечатныхФорм()
	
	Результат = Новый Структура;
	Результат.Вставить("Торг12", "Торг-12");
	Результат.Вставить("Акт", "Акт");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возможные значения свойства CurrentStatus структуры Counteragent
// см. https://api-docs.diadoc.ru/ru/latest/proto/Counteragent.html
//
Функция СтатусыПартнерскихОтношений()
	
	ВозможныеЗначения = Новый Массив;
	ВозможныеЗначения.Добавить("UnknownCounteragentStatus");
	ВозможныеЗначения.Добавить("IsMyCounteragent");
	ВозможныеЗначения.Добавить("InvitesMe");
	ВозможныеЗначения.Добавить("IsInvitedByMe");
	ВозможныеЗначения.Добавить("RejectsMe");
	ВозможныеЗначения.Добавить("IsRejectedByMe");
	ВозможныеЗначения.Добавить("NotInCounteragentList");
	
	Возврат НовоеПрограммноеПеречисление(ВозможныеЗначения);
	
КонецФункции

Функция ФункцияПрото_InvoiceAndBasic()
	Возврат "InvoiceAndBasic";
КонецФункции

Функция ФункцияПрото_Invoice()
	Возврат "Invoice";
КонецФункции

Функция ФункцияПрото_Basic()
	Возврат "Basic";
КонецФункции

#КонецОбласти 

#Область РаботаСФорматамиОтправки

// Инициализирует структуру, описывающую формат электронного документа.
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//  * ИмяТипа			 - Строка - Именованный идентификатор типа документа;
//  * ФункцияДокумента	 - Строка - Функция документа;
//  * ВерсияФормата		 - Строка - Версия формата;
//  * Представление		 - Строка - Представление формата;
//  * БазовыйФормат		 - Строка - Идентификатор базового формата (см. БазовыеФорматы);
//  * ПриказОбУтверждении - ФиксированнаяСтруктура - приказ об утверждении формата (см. НовыйПриказОбУтвержденииФормата)
//  * ТипКонтента		 - Строка - (Для совместимости) Тип протоконтента (см. ТипыКонтента);
//  * DocumentType		 - Строка - (Для совместимости) Тип документа в терминах компоненты;
//  * ЭтоИсправление	 - Булево - Истина, если это исправительный документ;
//  * ЭтоКорректировка	 - Булево - Истина, если это корректировочный документ;
//  * ЕстьФункцияПД		 - Булево - Истина, если формат включает функцию первичного документа;
//  * ЕстьФункцияСФ		 - Булево - Истина, если формат включает функцию счета-фактуры;
//  * ВидПервичногоДокумента - см. функцию ВидПервичногоДокумента;
//  * ВидСчетаФактуры		 - см. функцию ВидСчетаФактуры;
//  * ТипДокумента		 - Строка - Идентификатор вида электонного документа.
//
Функция НовоеОписаниеФорматаЭлектронногоДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяТипа");
	Результат.Вставить("ВерсияФормата");
	Результат.Вставить("ФункцияДокумента");
	Результат.Вставить("Представление");
	Результат.Вставить("БазовыйФормат");
	Результат.Вставить("ПриказОбУтверждении");
	Результат.Вставить("ЭтоИсправление", Ложь);
	Результат.Вставить("ЭтоКорректировка", Ложь);
	Результат.Вставить("ВидПервичногоДокумента");
	Результат.Вставить("ВидСчетаФактуры");
	Результат.Вставить("ЕстьФункцияПД", Ложь);
	Результат.Вставить("ЕстьФункцияСФ", Ложь);
	Результат.Вставить("ТипКонтента"); // Для совместимости
	Результат.Вставить("DocumentType"); // Для совместимости
	Результат.Вставить("ТипДокумента");
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданная структура содержит полное описание формата электронных документов.
//
// Параметры:
//  ФорматЭД - Структура - описание формата.
// 
// Возвращаемое значение:
//  Булево - Истина, если параметр содержит полное описание формата.
//
Функция ЭтоПолноеОписаниеФорматаЭД(ФорматЭД)
	
	Результат = Истина;
	
	ШаблонФормата = НовоеОписаниеФорматаЭлектронногоДокумента();
	
	Для Каждого Элемент Из ШаблонФормата Цикл
		
		Если Не ФорматЭД.Свойство(Элемент.Ключ) Тогда
			Результат = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает полное описание формата электронного документа по структуре, содержащей
// имя типа, функцию документа и версию формата вложения.
//
// Параметры:
//  ФорматЭД - Структура - содержит ключи:
//   * ИмяТипа - Строка - идентификатор типа документа (TypeNamedId)
//   * ФункцияДокумента - Строка - идентификатор функции документа (Function)
//   * ВерсияФормата - Строка - идентификатор версии вложения (Version).
// 
// Возвращаемое значение:
//  Структура - полное описание формата (см. ОписаниеФорматаЭлектронногоДокумента)
//
Функция ПолноеОписаниеФорматаЭлектронногоДокумента(ФорматЭД) Экспорт
	
	ЭтоПолноеОписаниеФормата = ЭтоПолноеОписаниеФорматаЭД(ФорматЭД);
	
	Если ЭтоПолноеОписаниеФормата Тогда
		Результат = ФорматЭД;
	Иначе
		Результат = ОписаниеФорматаЭлектронногоДокумента(ФорматЭД.ИмяТипа
			, ФорматЭД.ФункцияДокумента
			, ФорматЭД.ВерсияФормата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует описание формата электронного документа.
//
// Параметры:
//  ИмяТипа			 - Строка - typeNameId (см. ИдентификаторыТиповДокументов())
//  ФункцияДокумента - Строка - Function (см. ФункцииЭлектронныхДокументов())
//  ВерсияФормата	 - Строка - Version (см. значения перечисления ВерсииФорматовЭлектронныхДокументов())
// 
// Возвращаемое значение:
//  Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
Функция ОписаниеФорматаЭлектронногоДокумента(ИмяТипа, ФункцияДокумента, ВерсияФормата) Экспорт
	
	БазовыйФормат	 = БазовыйФорматВерсииКонтента(ВерсияФормата);
	ТипКонтента		 = ТипКонтентаПоБазовомуФормату(БазовыйФормат);
	ТипДокументаCOM	 = ТипДокументаКомпоненты(ИмяТипа);
	Представление	 = ПредставлениеФорматаЭД(ИмяТипа, ФункцияДокумента);
	ПриказОбУтверждении = ПриказОбУтвержденииФормата(БазовыйФормат);
	
	Результат = НовоеОписаниеФорматаЭлектронногоДокумента();
	Результат.ИмяТипа			 = ИмяТипа;
	Результат.ВерсияФормата		 = ВерсияФормата;
	Результат.ФункцияДокумента	 = ФункцияДокумента;
	
	// Расчетные параметры
	Результат.Представление	 = Представление;
	Результат.БазовыйФормат	 = БазовыйФормат;
	Результат.ТипКонтента	 = ТипКонтента;
	Результат.DocumentType	 = ТипДокументаCOM;
	Результат.ЭтоКорректировка	 = ЭтоКорректировочныйДокумент(ИмяТипа);
	Результат.ЭтоИсправление	 = ЭтоИсправительныйДокумент(ИмяТипа);
	Результат.ТипДокумента	= ОпределитьТипДокумента(ИмяТипа);
	
	Результат.ПриказОбУтверждении = ПриказОбУтверждении;
	
	Результат.ВидПервичногоДокумента = ВидПервичногоДокумента(Результат);
	Результат.ВидСчетаФактуры		 = ВидСчетаФактуры(Результат);
	Результат.ЕстьФункцияПД	 = ЗначениеЗаполнено(Результат.ВидПервичногоДокумента);
	Результат.ЕстьФункцияСФ	 = ЗначениеЗаполнено(Результат.ВидСчетаФактуры);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Формирует представление для формата электронных документов
// для отображения в пользовательском интерфейсе
//
// Параметры:
//  ИмяТипа			 - Строка - см. ИдентификаторыТиповДокументов;
//  ФункцияДокумента - Строка - см. ФункцииЭлектронныхДокументов;
// 
// Возвращаемое значение:
//  Строка - представление формата ЭД.
//
Функция ПредставлениеФорматаЭД(ИмяТипа, ФункцияДокумента)
	
	ПредставлениеТипа	 = ПредставлениеТипаЭлектронногоДокумента(ИмяТипа);
	ПредставлениеФункции = ПредставлениеФункцииЭлектронногоДокумента(ФункцияДокумента);
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(ПредставлениеТипа);
	
	Если ЗначениеЗаполнено(ПредставлениеФункции) Тогда
		Подстроки.Добавить(ПредставлениеФункции);
	КонецЕсли;
	
	Результат = СтрСоединить(Подстроки, " ");
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление типа электронного документа для отображения
// в пользовательском интерфейсе.
//
// Параметры:
//  ИмяТипа - Строка - см. ИдентификаторыТиповДокументов;
// 
// Возвращаемое значение:
//  Строка.
//
Функция ПредставлениеТипаЭлектронногоДокумента(ИмяТипа)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ПредставленияТипов = Новый Соответствие;
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalTransferDocument
		, НСтр("ru = 'УПД'; en = 'UTD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalTransferDocumentRevision
		, НСтр("ru = 'Исправление УПД'; en = 'Revision of UTD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalCorrectionDocument
		, НСтр("ru = 'УКД'; en = 'UAD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalCorrectionDocumentRevision
		, НСтр("ru = 'Исправление УКД'; en = 'Revision of UAD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.XmlTorg12
		, НСтр("ru = 'Торг-12'; en='TORG-12'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Torg12
		, НСтр("ru = 'Торг-12'; en='TORG-12'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.XmlAcceptanceCertificate
		, НСтр("ru = 'Акт'; en='Act'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.AcceptanceCertificate
		, НСтр("ru = 'Акт'; en='Act'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Invoice
		, НСтр("ru = 'Счет-фактура'; en='Tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.InvoiceRevision
		, НСтр("ru = 'Исправление СФ'; en='Revision of tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.InvoiceCorrection
		, НСтр("ru = 'Корректировочный СФ'; en = 'Corrective tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.InvoiceCorrectionRevision
		, НСтр("ru = 'Исправление КСФ'; en = 'Revision of corrective tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ProformaInvoice
		, НСтр("ru = 'Счет на оплату'; en='Proforma invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ReconciliationAct
		, НСтр("ru = 'Акт сверки'; en='Reconciliation act'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.TrustConnectionRequest
		, НСтр("ru = 'Приглашение к ЭДО'; en='Trust connection request'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.PriceList
		, НСтр("ru = 'Прайс-лист'; en='Price list'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.PriceListAgreement
		, НСтр("ru = 'Протокол согласования цены'; en='Price approval protocol'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.CertificateRegistry
		, НСтр("ru = 'Реестр сертификатов'; en='Certificate registry'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Contract
		, НСтр("ru = 'Договор'; en='Contract'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Nonformalized
		, НСтр("ru = 'Неформализованный'; en='Nonformalized document'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Torg13
		, НСтр("ru = 'ТОРГ-13'; en='TORG-13'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ServiceDetails
		, НСтр("ru = 'Детализация'; en='Service details'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.SupplementaryAgreement
		, НСтр("ru = 'Доп. соглашение к договору'; en='Supplementary agreement'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.StorageInventoryAcceptanceCertificate
		, НСтр("ru = 'Акт МХ-1'; en='Act MH-1'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ReturnInventoryAcceptanceCertificate
		, НСтр("ru = 'Акт МХ-3'; en='Act MH-3'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.PowerOfAttorney
		, НСтр("ru = 'Доверенность'; en='Letter of authority'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Torg2
		, НСтр("ru = 'Акт Торг-2'; en='Act Torg-2'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Letter
		, НСтр("ru = 'Письмо'; en='Letter'"));
	
	Результат = ПредставленияТипов[ИмяТипа];
	Если Результат = Неопределено Тогда
		Результат = ИмяТипа;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление функции электронного документа для отображения
// в пользовательском интерфейсе.
//
// Параметры:
//  ФункцияДокумента - Строка - см. ФункцииЭлектронныхДокументов;
// 
// Возвращаемое значение:
//  Строка.
//
Функция ПредставлениеФункцииЭлектронногоДокумента(ФункцияДокумента)
	
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	
	ПредставленияФункций = Новый Соответствие;
	
	ПредставленияФункций.Вставить(ФункцииДокументов.ПоУмолчанию
		, "");
	
	ПредставленияФункций.Вставить(ФункцииДокументов.СЧФДОП
		, НСтр("ru = 'Счф Доп'; en='Invoice and basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.СЧФ
		, НСтр("ru = 'Счф'; en='Invoice'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.ДОП
		, НСтр("ru = 'Доп'; en='Basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.КСЧФДИС
		, НСтр("ru = 'Ксчф Дис'; en='Invoice and basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.КСЧФ
		, НСтр("ru = 'Ксчф'; en='Invoice'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.ДИС
		, НСтр("ru = 'Дис'; en='Basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.БезДопИнфо
		, "");
	
	ПредставленияФункций.Вставить(ФункцииДокументов.СДопИнфо
		, "");
	
	Результат = ПредставленияФункций[ФункцияДокумента];
	Если Результат = Неопределено Тогда
		Результат = ФункцияДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет базовую версию формата контента.
//
// Параметры:
//  ВерсияФормата - Строка - версия вложения в терминах Web API Diadoc
//                           наример, utd820_05_01_01, tovtorg_05_01_04 и т.д.
// 
// Возвращаемое значение:
//  Строка - см. БазовыеФорматы()
//
Функция БазовыйФорматВерсииКонтента(ВерсияФормата)
	
	БазовыеФорматы = БазовыеФорматы();
	
	Если НРег(Лев(ВерсияФормата, 7)) = "utd820_" Тогда
		
		Результат = БазовыеФорматы.utd820;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 7)) = "utd970_" Тогда
		
		Результат = БазовыеФорматы.utd970;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 4)) = "utd_" Тогда
		
		Результат = БазовыеФорматы.utd;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 7)) = "ucd736_" Тогда
		
		Результат = БазовыеФорматы.ucd736;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 4)) = "ucd_" Тогда
		
		Результат = БазовыеФорматы.ucd;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 8)) = "tovtorg_" Тогда
		
		Результат = БазовыеФорматы.tovtorg;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 6)) = "rezru_" Тогда
		
		Результат = БазовыеФорматы.rezru;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 8)) = "invoice_" Тогда
		
		Результат = БазовыеФорматы.invoice;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 11)) = "invoicecor_" Тогда
		
		Результат = БазовыеФорматы.invoicecor;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 7)) = "torg12_" Тогда
		
		Результат = БазовыеФорматы.torg12;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 4)) = "act_" Тогда
		
		Результат = БазовыеФорматы.act;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 16)) = "proformainvoice_" Тогда
		
		Результат = БазовыеФорматы.proformainvoice;
		
	ИначеЕсли НРег(ВерсияФормата) = "v1" Тогда
		
		Результат = БазовыеФорматы.v1;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 6)) = "torg2_" Тогда
		
		Результат = БазовыеФорматы.torg2;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 21)) = "reconciliationact405_" Тогда
		
		Результат = БазовыеФорматы.reconciliationact;
		
	Иначе
		
		Результат = БазовыеФорматы.unknown; // Все остальное будем считать неформализованными
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет тип протоконтента по идентификатору базовой версии формата.
//
// Параметры:
//  ВерсияФормата - Строка - см. функцию БазовыеФорматы;
// 
// Возвращаемое значение:
//  Строка - см. ТипыКонтента()
//
Функция ТипКонтентаПоБазовомуФормату(БазовыйФормат)
	
	БазовыеФорматы	 = БазовыеФорматы();
	ТипыКонтента	 = ТипыКонтента();
	
	ТипыКонтентаБазовыхФорматов = Новый Соответствие;
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.utd970			, ТипыКонтента.Utd970SellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.utd820			, ТипыКонтента.Utd820SellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.utd				, ТипыКонтента.UtdSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.ucd736			, ТипыКонтента.UcdSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.ucd				, ТипыКонтента.UcdSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.tovtorg			, ТипыКонтента.TovTorgSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.torg12			, ТипыКонтента.Torg12SellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.rezru			, ТипыКонтента.Act552SellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.act				, ТипыКонтента.AcceptanceCertificateSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.invoice			, ТипыКонтента.InvoiceContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.invoicecor		, ТипыКонтента.InvoiceCorrectionContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.proformainvoice	, ТипыКонтента.ProformaInvoiceContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.v1				, ТипыКонтента.NonformalizedContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.unknown			, ТипыКонтента.NonformalizedContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.torg2			, ТипыКонтента.Torg2SenderTitle);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.reconciliationact, ТипыКонтента.ReconciliationActSenderTitle);
	
	Результат = ТипыКонтентаБазовыхФорматов[БазовыйФормат];
	
	Возврат Результат;
	
КонецФункции

// Определяет имя типа документа в терминах компоненты AddinDiadocAPI (DocumentType),
// который соответствует указанному типу документа (typeNamedId).
//
// Параметры:
//  ИмяТипа - Строка - см. ИдентификаторыТиповДокументов;
// 
// Возвращаемое значение:
//  Строка.
//
Функция ТипДокументаКомпоненты(ИмяТипа)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	Результат = ИмяТипа;
	
	Если ИмяТипа = ТипыДокументов.ProformaInvoice Тогда
		Результат = "NonformalizedProforma";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриказОбУтвержденииФормата(БазовыйФормат)
	
	ВсеПриказы = ПриказыОбУтвержденииФорматовЭлектронныхДокументов();
	
	Результат = ВсеПриказы.Получить(БазовыйФормат);
	Если Результат = Неопределено Тогда
		Результат = ПриказНеНайден();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриказыОбУтвержденииФорматовЭлектронныхДокументов()
	
	ВсеФорматы = БазовыеФорматы();
	
	Результат = Новый Соответствие;
	Результат.Вставить(ВсеФорматы.utd970	, Приказ970());
	Результат.Вставить(ВсеФорматы.utd820	, Приказ820());
	Результат.Вставить(ВсеФорматы.ucd		, Приказ189());
	Результат.Вставить(ВсеФорматы.ucd736	, Приказ736());
	Результат.Вставить(ВсеФорматы.tovtorg	, Приказ551());
	Результат.Вставить(ВсеФорматы.rezru		, Приказ552());
	Результат.Вставить(ВсеФорматы.utd		, Приказ155());
	Результат.Вставить(ВсеФорматы.torg12	, Приказ172());
	Результат.Вставить(ВсеФорматы.act		, Приказ172());
	Результат.Вставить(ВсеФорматы.invoice	, Приказ93());
	Результат.Вставить(ВсеФорматы.invoicecor, Приказ93());
	Результат.Вставить(ВсеФорматы.torg2		, Приказ423());
	Результат.Вставить(ВсеФорматы.reconciliationact, Приказ405());
	
	Возврат Результат;
	
КонецФункции

Функция НовыйПриказОбУтвержденииФормата()
	
	Результат = Новый Структура;
	Результат.Вставить("Представление");
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	Результат.Вставить("ДатаНачалаДействия", '1980.01.01');
	Результат.Вставить("ДатаОкончанияДействия", '3999.12.31');
	Результат.Вставить("СсылкаНаПриказ");
	
	Возврат Результат;
	
КонецФункции

Функция Приказ970()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2023.12.19';
	Результат.Номер = "ЕД-7-26/970@";
	Результат.ДатаНачалаДействия = '2025.04.01';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=464695";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ820()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2018.12.19';
	Результат.Номер = "ММВ-7-15/820@";
	Результат.ДатаНачалаДействия = '2019.02.02';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=328588";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ155()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2016.03.24';
	Результат.Номер = "ММВ-7-15/155@";
	Результат.ДатаНачалаДействия = '2016.05.07';
	Результат.ДатаОкончанияДействия = КонецДня('2019.12.31');
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=339569";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ189()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2016.04.13';
	Результат.Номер = "ММВ-7-15/189@";
	Результат.ДатаНачалаДействия = '2016.05.31';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=339567";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ736()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2020.10.12';
	Результат.Номер = "ЕД-7-26/736@";
	Результат.ДатаНачалаДействия = '2020.11.27';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=375857";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ423()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2019.08.27';
	Результат.Номер = "ММВ-7-15/423@";
	Результат.ДатаНачалаДействия = '2019.11.24';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=348230";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ551()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2015.11.30';
	Результат.Номер = "ММВ-7-10/551@";
	Результат.ДатаНачалаДействия = '2016.01.09';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=339634";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ552()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2015.11.30';
	Результат.Номер = "ММВ-7-10/552@";
	Результат.ДатаНачалаДействия = '2016.01.10';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=339635";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ172()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2012.03.21';
	Результат.Номер = "ММВ-7-6/172@";
	Результат.ДатаНачалаДействия = '2012.03.21';
	//Результат.ДатаОкончанияДействия = КонецДня('2017.06.30');
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=261859";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ93()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2015.03.04';
	Результат.Номер = "ММВ-7-6/93@";
	Результат.ДатаНачалаДействия = '2015.04.14';
	Результат.ДатаОкончанияДействия = КонецДня('2017.06.30');
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=334617";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция Приказ405()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Дата = '2022.05.13';
	Результат.Номер = "ЕД-7-26/405@";
	Результат.ДатаНачалаДействия = '2022.07.21';
	Результат.СсылкаНаПриказ = "https://normativ.kontur.ru/document?moduleId=1&documentId=425482";
	Результат.Представление = СтрШаблон("Приказ ФНС России от %1 N %2"
		, Формат(Результат.Дата, "ДФ=dd.MM.yyyy")
		, Результат.Номер);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция ПриказНеНайден()
	
	Результат = НовыйПриказОбУтвержденииФормата();
	Результат.Представление = "<Отсутствует>";
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

#Область ПравилаОтправки

// Находит правило отправки документа по его виду, функции и флагу исправления.
//
//
// Параметры:
//  КлючНастройкиОтправки	 - Строка - см. КлючиНастроекОтправки;
//  ВидДокумента			 - Строка - см. ИдентификаторыТиповДокументов;
//  ФункцияДокумента		 - Строка - см. ФункцииЭлектронныхДокументов;
//  ЭтоИсправление			 - Булево - Истина, если нужно отправить исправленную версию документа
//  КэшПравил				 - Соответствие, Неопределено - содержит ключи настроек отправки и соответствующие им правила отправки;
// 
// Возвращаемое значение:
//  Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента;
//
Функция ФорматОтправкиДокумента(КлючНастройкиОтправки, ВидДокумента, ФункцияДокумента, ЭтоИсправление, КэшПравил = Неопределено)
	
	Результат = Неопределено;
	
	Если КэшПравил = Неопределено Тогда
		КэшПравил = Новый Соответствие;
	КонецЕсли;
	
	ПравилаОтправки = КэшПравил[КлючНастройкиОтправки];
	Если Не ЗначениеЗаполнено(ПравилаОтправки) Тогда
		ПравилаОтправки = ПравилаОтправкиДокументов(КлючНастройкиОтправки);
		КэшПравил.Вставить(КлючНастройкиОтправки, ПравилаОтправки);
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидЭД"				, ВидДокумента);
	ПараметрыДокумента.Вставить("ФункцияДокумента"	, ФункцияДокумента);
	ПараметрыДокумента.Вставить("ЭтоИсправление"	, ЭтоИсправление);
	
	НайденныеПравила = ПравилаОтправки.НайтиСтроки(ПараметрыДокумента);
	
	Если ЗначениеЗаполнено(НайденныеПравила) Тогда
		Результат = НайденныеПравила[0].ФорматОтправки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Для указанного ключа настроек формирует таблиц правил, по которым
// определяется формат отправки документа. Чтобы корректно определить
// формат отправки документа, нужно знать, что это за документ (его вид),
// его функцию, а также понимать, является ли этот документ исправлением.
//
// Параметры:
//  КлючНастройкиФорматаОтправки - Строка - см. КлючиНастроекОтправки;
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//    * ВидЭД			 - Строка - см. ВидыЭлектронныхДокументов;
//    * ФункцияДокумента - Строка - см. ФункцииЭлектронныхДокументов;
//    * ЭтоИсправление	 - Булево - Истина, если исправленная версия документа;
//    * ФорматОтправки	 - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента;
//
Функция ПравилаОтправкиДокументов(КлючНастройкиФорматаОтправки)
	
	КлючиНастроек = КлючиНастроекОтправки();
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидЭД");
	Результат.Колонки.Добавить("ФункцияДокумента");
	Результат.Колонки.Добавить("ЭтоИсправление");
	Результат.Колонки.Добавить("ФорматОтправки");
	
	ДобавитьОбщиеПравилаОтправки(Результат);
	
	Если 	КлючНастройкиФорматаОтправки = КлючиНастроек.СЧФДОП_820_736
		Или КлючНастройкиФорматаОтправки = КлючиНастроек.СЧФ_ДОП_820_736 Тогда 
		
		ДобавитьПравилаОтправкиУПДСЧФДОП820(Результат);
		ДобавитьПравилаОтправкиУПДСЧФ820(Результат);
		ДобавитьПравилаОтправкиУПДДОП820(Результат);
		ДобавитьПравилаОтправкиУКДКСЧФДИС736(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.СЧФДОП_820
		Или КлючНастройкиФорматаОтправки = КлючиНастроек.СЧФ_ДОП_820 Тогда
		
		ДобавитьПравилаОтправкиУПДСЧФДОП820(Результат);
		ДобавитьПравилаОтправкиУПДСЧФ820(Результат);
		ДобавитьПравилаОтправкиУПДДОП820(Результат);
		ДобавитьПравилаОтправкиУКДКСЧФДИС189(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.СЧФДОП
		Или КлючНастройкиФорматаОтправки = КлючиНастроек.СЧФ_ДОП Тогда
		
		ДобавитьПравилаОтправкиУПДСЧФДОП155(Результат);
		ДобавитьПравилаОтправкиУПДСЧФ155(Результат);
		ДобавитьПравилаОтправкиУПДДОП155(Результат);
		ДобавитьПравилаОтправкиУКДКСЧФДИС189(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.СФТОРГ12АКТ_820_736 Тогда
		
		ДобавитьПравилаОтправкиСФ820(Результат);
		ДобавитьПравилаОтправкиКСФ736(Результат);
		ДобавитьПравилаОтправкиНакладныхАктов820(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.СФТОРГ12АКТ_820 Тогда
		
		ДобавитьПравилаОтправкиСФ820(Результат);
		ДобавитьПравилаОтправкиКСФ189(Результат);
		ДобавитьПравилаОтправкиНакладныхАктов820(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.СФТОРГ12АКТ Тогда
		
		ДобавитьПравилаОтправкиСФ155(Результат);
		ДобавитьПравилаОтправкиКСФ189(Результат);
		ДобавитьПравилаОтправкиНакладныхАктов155(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.СЧФ Тогда
		
		ДобавитьПравилаОтправкиУПДСЧФ155(Результат);
		ДобавитьПравилаОтправкиУКДКСЧФДИС189(Результат);
		ДобавитьПравилаОтправкиНакладныхАктов172(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.ДОП Тогда
		
		ДобавитьПравилаОтправкиСФ93(Результат);
		ДобавитьПравилаОтправкиКСФ93(Результат);
		ДобавитьПравилаОтправкиУКДКСЧФДИС189(Результат);
		ДобавитьПравилаОтправкиУПДДОП155(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.СФ Тогда
		
		ДобавитьПравилаОтправкиСФ155(Результат);
		ДобавитьПравилаОтправкиКСФ189(Результат);
		ДобавитьПравилаОтправкиНакладныхАктов172(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.ТОРГ12АКТ Тогда
		
		ДобавитьПравилаОтправкиСФ93(Результат);
		ДобавитьПравилаОтправкиКСФ93(Результат);
		ДобавитьПравилаОтправкиНакладныхАктов155(Результат);
		
	ИначеЕсли КлючНастройкиФорматаОтправки = КлючиНастроек.НЕТ Тогда
		
		ДобавитьПравилаОтправкиСФ93(Результат);
		ДобавитьПравилаОтправкиКСФ93(Результат);
		ДобавитьПравилаОтправкиНакладныхАктов172(Результат);
		
	Иначе
		
		Ошибка = СтрШаблон("Неизвестный ключ настройки отправки (%1)", КлючНастройкиФорматаОтправки);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет новую строку в таблицу правил определения формата отправки.
//
// Параметры:
//  Правила			 - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//  ВидЭД			 - Строка - см. ВидыЭлектронныхДокументов;
//  ФункцияДокумента - Строка - см. ФункцииЭлектронныхДокументов;
//  ЭтоИсправление	 - Булево - Истина, если исправленная версия документа;
//  ФорматОтправки	 - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента;
//
Процедура ДобавитьПравилоОтправки(Правила, ВидЭД, ФункцияДокумента, ФорматОтправки, ЭтоИсправление = Ложь)
	
	НовоеПравило = Правила.Добавить();
	НовоеПравило.ВидЭД = ВидЭД;
	НовоеПравило.ФункцияДокумента = ФункцияДокумента;
	НовоеПравило.ФорматОтправки = ФорматОтправки;
	НовоеПравило.ЭтоИсправление = ЭтоИсправление;
	
КонецПроцедуры

// Добавляет правила отправки, общие для всех настроек отправки.
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьОбщиеПравилаОтправки(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	// Счета на оплату
	ФорматОтправки = ФорматОтправкиСчетНаОплату();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетНаОплату
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправки
			, Исправление);
		
	КонецЦикла;
	
	// Акты сверок
	ДобавитьПравилоОтправки(Правила
		, ВидыЭД.АктСверки
		, ФункцииЭД.ПоУмолчанию
		, ФорматОтправкиАктСверки());
	
	// Прочие неформализованные
	ДобавитьПравилоОтправки(Правила
		, ВидыЭД.Произвольный
		, ФункцииЭД.ПоУмолчанию
		, ФорматОтправкиПроизвольный());
	
КонецПроцедуры

// Добавляет правила для отправки полного УПД в формате приказа 820@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУПДСЧФДОП820(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УПД СЧФДОП
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетФактура
			, ФункцииЭД.СЧФДОП
			, ФорматОтправкиУПДСЧФДОП820(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки УПД СЧФ в формате приказа 820@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУПДСЧФ820(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УПД СЧФ
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетФактура
			, ФункцииЭД.СЧФ
			, ФорматОтправкиУПДСЧФ820(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки УПД ДОП в формате приказа 820@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУПДДОП820(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УПД ДОП
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.ТоварнаяНакладная
			, ФункцииЭД.ДОП
			, ФорматОтправкиУПДДОП820(Исправление)
			, Исправление);
		
		// УПД ДОП
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.АктОбОказанииУслуг
			, ФункцииЭД.ДОП
			, ФорматОтправкиУПДДОП820(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки полного УПД в формате приказа 155@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУПДСЧФДОП155(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УПД СЧФДОП
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетФактура
			, ФункцииЭД.СЧФДОП
			, ФорматОтправкиУПДСЧФДОП155(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки УПД СЧФ в формате приказа 155@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУПДСЧФ155(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УПД СЧФ
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетФактура
			, ФункцииЭД.СЧФ
			, ФорматОтправкиУПДСЧФ155(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки УПД ДОП в формате приказа 155@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУПДДОП155(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УПД ДОП
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.ТоварнаяНакладная
			, ФункцииЭД.ДОП
			, ФорматОтправкиУПДДОП155(Исправление)
			, Исправление);
		
		// УПД ДОП
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.АктОбОказанииУслуг
			, ФункцииЭД.ДОП
			, ФорматОтправкиУПДДОП155(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки УКД в формате приказа 189@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУКДКСЧФДИС189(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УКД КСЧФДИС
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.КорректировочныйСчетФактура
			, ФункцииЭД.КСЧФДИС
			, ФорматОтправкиУКДКСЧФДИС189(Исправление)
			, Исправление);
		
		// УКД КСЧФ
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.КорректировочныйСчетФактура
			, ФункцииЭД.КСЧФ
			, ФорматОтправкиУКДКСЧФ189(Исправление)
			, Исправление);
		
		// УКД ДИС
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СоглашениеОбИзмененииСтоимости
			, ФункцииЭД.ДИС
			, ФорматОтправкиУКДДИС189(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки УКД в формате приказа 736@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиУКДКСЧФДИС736(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// УКД КСЧФДИС
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.КорректировочныйСчетФактура
			, ФункцииЭД.КСЧФДИС
			, ФорматОтправкиУКДКСЧФДИС736(Исправление)
			, Исправление);
		
		// УКД КСЧФ
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.КорректировочныйСчетФактура
			, ФункцииЭД.КСЧФ
			, ФорматОтправкиУКДКСЧФ736(Исправление)
			, Исправление);
		
		// УКД ДИС
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СоглашениеОбИзмененииСтоимости
			, ФункцииЭД.ДИС
			, ФорматОтправкиУКДДИС736(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки счетов-фактур в формате приказа 820@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиСФ820(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Счет-фактура
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетФактура
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиСчетФактура820(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки счетов-фактур в формате приказа 155@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиСФ155(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Счет-фактура
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетФактура
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиСчетФактура155(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки счетов-фактур в формате приказа 93@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиСФ93(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Счет-фактура
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.СчетФактура
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиСчетФактура93(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки корректировочных счетов-фактур в формате приказа 736@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиКСФ736(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Корректировочный счет-фактура
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.КорректировочныйСчетФактура
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиКорректировочныйСчетФактура736(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки корректировочных счетов-фактур в формате приказа 189@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиКСФ189(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Корректировочный счет-фактура
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.КорректировочныйСчетФактура
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиКорректировочныйСчетФактура189(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки корректировочных счетов-фактур в формате приказа 93@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиКСФ93(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Корректировочный счет-фактура
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.КорректировочныйСчетФактура
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиКорректировочныйСчетФактура93(Исправление)
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки товарных накладных и актов в формате приказа 820@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиНакладныхАктов820(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Товарная накладная
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.ТоварнаяНакладная
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиНакладная820()
			, Исправление);
		
		// Акт об оказании услуг
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.АктОбОказанииУслуг
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиАкт820()
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки товарных накладных и актов в формате приказа 155@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиНакладныхАктов155(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Товарная накладная
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.ТоварнаяНакладная
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиНакладная155()
			, Исправление);
		
		// Акт об оказании услуг
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.АктОбОказанииУслуг
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиАкт155()
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет правила для отправки товарных накладных и актов в формате приказа 172@
//
// Параметры:
//  Правила - ТаблицаЗначений - см. ПравилаОтправкиДокументов;
//
Процедура ДобавитьПравилаОтправкиНакладныхАктов172(Правила)
	
	ВидыЭД	  = ВидыЭлектронныхДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	Для Индекс = 0 По 1 Цикл
		
		Исправление = (Индекс = 1);
		
		// Товарная накладная
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.ТоварнаяНакладная
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиНакладная172()
			, Исправление);
		
		// Акт об оказании услуг
		ДобавитьПравилоОтправки(Правила
			, ВидыЭД.АктОбОказанииУслуг
			, ФункцииЭД.ПоУмолчанию
			, ФорматОтправкиАкт172()
			, Исправление);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныФорматовОтправки

#Область УПД

// УПД СЧФДОП 820@
//
Функция ФорматОтправкиУПДСЧФДОП820(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalTransferDocument;
	ФункцияДокумента = ФункцииДокументов.СЧФДОП;
	ВерсияФормата	 = ВерсииФорматов.УПД820;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalTransferDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УПД СЧФ 820@
//
Функция ФорматОтправкиУПДСЧФ820(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalTransferDocument;
	ФункцияДокумента = ФункцииДокументов.СЧФ;
	ВерсияФормата	 = ВерсииФорматов.УПД820;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalTransferDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УПД ДОП 820@
//
Функция ФорматОтправкиУПДДОП820(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalTransferDocument;
	ФункцияДокумента = ФункцииДокументов.ДОП;
	ВерсияФормата	 = ВерсииФорматов.УПД820;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalTransferDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УПД СЧФДОП 155@
//
Функция ФорматОтправкиУПДСЧФДОП155(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalTransferDocument;
	ФункцияДокумента = ФункцииДокументов.СЧФДОП;
	ВерсияФормата	 = ВерсииФорматов.УПД155;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalTransferDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УПД СЧФ 155@
//
Функция ФорматОтправкиУПДСЧФ155(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalTransferDocument;
	ФункцияДокумента = ФункцииДокументов.СЧФ;
	ВерсияФормата	 = ВерсииФорматов.УПД155;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalTransferDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УПД ДОП 155@
//
Функция ФорматОтправкиУПДДОП155(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalTransferDocument;
	ФункцияДокумента = ФункцииДокументов.ДОП;
	ВерсияФормата	 = ВерсииФорматов.УПД155;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalTransferDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

#КонецОбласти

#Область УКД

// УКД КСЧФДИС 736@
//
Функция ФорматОтправкиУКДКСЧФДИС736(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalCorrectionDocument;
	ФункцияДокумента = ФункцииДокументов.КСЧФДИС;
	ВерсияФормата	 = ВерсииФорматов.УКД736;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalCorrectionDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УКД КСЧФ 736@
//
Функция ФорматОтправкиУКДКСЧФ736(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalCorrectionDocument;
	ФункцияДокумента = ФункцииДокументов.КСЧФ;
	ВерсияФормата	 = ВерсииФорматов.УКД736;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalCorrectionDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УКД ДИС 736@
//
Функция ФорматОтправкиУКДДИС736(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalCorrectionDocument;
	ФункцияДокумента = ФункцииДокументов.ДИС;
	ВерсияФормата	 = ВерсииФорматов.УКД736;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalCorrectionDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УКД КСЧФДИС 189@
//
Функция ФорматОтправкиУКДКСЧФДИС189(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalCorrectionDocument;
	ФункцияДокумента = ФункцииДокументов.КСЧФДИС;
	ВерсияФормата	 = ВерсииФорматов.УКД189;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalCorrectionDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УКД КСЧФ 189@
//
Функция ФорматОтправкиУКДКСЧФ189(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalCorrectionDocument;
	ФункцияДокумента = ФункцииДокументов.КСЧФ;
	ВерсияФормата	 = ВерсииФорматов.УКД189;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalCorrectionDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// УКД ДИС 189@
//
Функция ФорматОтправкиУКДДИС189(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.UniversalCorrectionDocument;
	ФункцияДокумента = ФункцииДокументов.ДИС;
	ВерсияФормата	 = ВерсииФорматов.УКД189;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.UniversalCorrectionDocumentRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

#КонецОбласти

#Область СчетФактура

// Счет-фактура 820@
//
Функция ФорматОтправкиСчетФактура820(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.Invoice;
	ФункцияДокумента = ФункцииДокументов.ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматов.УПД820;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.InvoiceRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Счет-фактура 155@
//
Функция ФорматОтправкиСчетФактура155(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.Invoice;
	ФункцияДокумента = ФункцииДокументов.ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматов.УПД155;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.InvoiceRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Счет-фактура 93@
//
Функция ФорматОтправкиСчетФактура93(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.Invoice;
	ФункцияДокумента = ФункцииДокументов.ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматов.СФ93;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.InvoiceRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

#КонецОбласти

#Область КорректировочныйСчетФактура

// Корректировочный счет-фактура 736@
//
Функция ФорматОтправкиКорректировочныйСчетФактура736(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.InvoiceCorrection;
	ФункцияДокумента = ФункцииДокументов.ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматов.УКД736;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.InvoiceCorrectionRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Корректировочный счет-фактура 189@
//
Функция ФорматОтправкиКорректировочныйСчетФактура189(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.InvoiceCorrection;
	ФункцияДокумента = ФункцииДокументов.ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматов.УКД189;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.InvoiceCorrectionRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Корректировочный счет-фактура 93@
//
Функция ФорматОтправкиКорректировочныйСчетФактура93(Исправление = Ложь)
	
	ТипыДокументов	  = ИдентификаторыТиповДокументов();
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	ВерсииФорматов	  = ВерсииФорматовЭлектронныхДокументов();
	
	ТипДокумента	 = ТипыДокументов.InvoiceCorrection;
	ФункцияДокумента = ФункцииДокументов.ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматов.КСФ93;
	
	Если Исправление Тогда
		ТипДокумента = ТипыДокументов.InvoiceCorrectionRevision;
	КонецЕсли;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

#КонецОбласти

#Область ТоварнаяНакладная

// Товарная накладная 820@
//
Функция ФорматОтправкиНакладная820()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().XmlTorg12;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().УПД820;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Товарная накладная 155@
//
Функция ФорматОтправкиНакладная155()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().XmlTorg12;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().УПД155;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Товарная накладная 172@
//
Функция ФорматОтправкиНакладная172()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().XmlTorg12;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().Торг172;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

#КонецОбласти

#Область АктОбОказанииУслуг

// Акт 820@
//
Функция ФорматОтправкиАкт820()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().XmlAcceptanceCertificate;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().УПД820;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Акт 155@
//
Функция ФорматОтправкиАкт155()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().XmlAcceptanceCertificate;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().УПД155;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Акт 172@
//
Функция ФорматОтправкиАкт172()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().XmlAcceptanceCertificate;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().Акт172;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

#КонецОбласти

#Область Неформализованные

// Произвольный файл
//
Функция ФорматОтправкиПроизвольный()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().Nonformalized;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().Файл;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Счет на оплату (неформализованный)
//
Функция ФорматОтправкиСчетНаОплату()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().ProformaInvoice;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().Файл;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

// Акт сверки (неформализованный)
//
Функция ФорматОтправкиАктСверки()
	
	ТипДокумента	 = ИдентификаторыТиповДокументов().ReconciliationAct;
	ФункцияДокумента = ФункцииЭлектронныхДокументов().ПоУмолчанию;
	ВерсияФормата	 = ВерсииФорматовЭлектронныхДокументов().Файл;
	
	ФорматОтправки = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента
		, ФункцияДокумента
		, ВерсияФормата);
	
	Возврат ФорматОтправки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ПодготовкаСпискаИсходящихДокументов

// Возвращает список параметров запроса для построения списка исходящих документов.
//
// Параметры:
//  ДатаНачала		 - Дата - нижняя граница выборки документов;
//  ДатаОкончания	 - Дата - верхняя граница выборки документов;
// 
// Возвращаемое значение:
//  Структура - см. тело метода.
//
Функция ПараметрыЗапросаСпискаИсходящих(ДатаНачала, ДатаОкончания)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДатаНачала"		, ДатаНачала);
	Результат.Вставить("ДатаОкончания"	, КонецДня(ДатаОкончания));
	Результат.Вставить("СвойствоДокументаИдентификатор"			, СвойствоДокументаИдентификатор());
	Результат.Вставить("СвойствоДокументаИдентификаторСчета"	, СвойствоДокументаИдентификаторСчета());
	Результат.Вставить("СвойствоДокументаСтатусОтправляемыхВПФ"	, СвойствоДокументаСтатусОтправляемыхВПФ());
	
	КлючиНастроек = КлючиНастроекОтправки();
	Для Каждого Элемент Из КлючиНастроек Цикл
		Результат.Вставить("КлючНастройки_" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	Для Каждого Элемент Из ФункцииЭД Цикл
		Результат.Вставить("ФункцияЭД_" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	Для Каждого Элемент Из ВидыЭД Цикл
		Результат.Вставить("ВидыЭД_" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	ВидыОснованийСчета = ВидыОснованийСчета();
	Для Каждого Элемент Из ВидыОснованийСчета Цикл
		Результат.Вставить("ОснованиеСчета_" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	ВидыПФ = ВидыПечатныхФорм();
	Для Каждого Элемент Из ВидыПФ Цикл
		Результат.Вставить("ВидыПФ_" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет параметры запроса по переданной структуре.
//
// Параметры:
//  Запрос			 - Запрос - Запрос, параметры которого нужно установить;
//  ПараметрыЗапроса - Структура - содержит имена и значения устанавливаемых параметров;
//
Процедура УстановитьПараметрыЗапроса(Запрос, ПараметрыЗапроса)
	
	Для Каждого Элемент Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Формирует временную таблицу НастройкиОрганизаций, которая содержит колонки:
//  * Организация - СправочникСсылка.Организации;
//  * КлючНастройкиОтправки - Строка - см. КлючиНастроекОтправки;
//  * ОснованиеФормированияСчета - Строка - см. ВидыОснованийСчета;
//  * ОтправлятьНепроведенные - Булево - Истина, если нужно отправлять непроведенные документы;
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц, содержит таблицу ТаблицаОтношений (см. ПодготовитьТаблицуПартнерскихОтношений);
//
Процедура ПодготовитьНастройкиОрганизаций(МенеджерВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Параметры.Вставить("НастройкаОтправкиПоУмолчанию", КлючНастройкиОтправкиПоУмолчанию());
	Запрос.Параметры.Вставить("ВидОснованияСчетаПоУмолчанию", ВидОснованияСчетаПоУмолчанию());
	Запрос.Параметры.Вставить("ПечатнаяФормаДляТоваровПоУмолчанию", ПечатнаяФормаДляТоваровПоУмолчанию());
	Запрос.Параметры.Вставить("ПечатнаяФормаДляУслугПоУмолчанию", ПечатнаяФормаДляУслугПоУмолчанию());
	
	Запрос.Параметры.Вставить("СвойствоОрганизацииФормироватьУПД"
		, СвойствоОрганизацииФормироватьУПД());
	
	Запрос.Параметры.Вставить("СвойствоОрганизацииОтправлятьНепроведенные"
		, СвойствоОрганизацииОтправлятьНепроведенные());
	
	Запрос.Параметры.Вставить("СвойствоОрганизацииОснованиеДляФормированияСчета"
		, СвойствоОрганизацииФормироватьСчетНаОсновании());
	
	Запрос.Параметры.Вставить("СвойствоОрганизацииПечатнаяФормаДляТоваров"
		, СвойствоОрганизацииПечатнаяФормаДляТоваров());
	
	Запрос.Параметры.Вставить("СвойствоОрганизацииПечатнаяФормаДляУслуг"
		, СвойствоОрганизацииПечатнаяФормаДляУслуг());
	
	ВидыОснованийСчета = ВидыОснованийСчета();
	Запрос.УстановитьПараметр("ДопустимыеВидыОснованийСчета", ЗначенияКоллекцииВМассив(ВидыОснованийСчета));
	
	КлючиНастроекОтправки = КлючиНастроекОтправки();
	Запрос.УстановитьПараметр("ДопустимыеНастройкиОтправки", ЗначенияКоллекцииВМассив(КлючиНастроекОтправки));
	
	ВидыПечатныхФорм = ВидыПечатныхФорм();
	Запрос.УстановитьПараметр("ДопустимыеВидыПечатныхФорм", ЗначенияКоллекцииВМассив(ВидыПечатныхФорм));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Таблица.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ЗначенияСвойстваНастройкаФорматовОтправки.Значение В (&ДопустимыеНастройкиОтправки)
	|			ТОГДА ЗначенияСвойстваНастройкаФорматовОтправки.Значение
	|		ИНАЧЕ &НастройкаОтправкиПоУмолчанию
	|	КОНЕЦ КАК КлючНастройкиОтправки,
	|	ВЫБОР
	|		КОГДА ЗначенияСвойстваНастройкаОснованияДляФормированияСчета.Значение В (&ДопустимыеВидыОснованийСчета)
	|			ТОГДА ЗначенияСвойстваНастройкаОснованияДляФормированияСчета.Значение
	|		ИНАЧЕ &ВидОснованияСчетаПоУмолчанию
	|	КОНЕЦ КАК ОснованиеФормированияСчета,
	|	ВЫБОР
	|		КОГДА ЗначенияСвойстваПечатнаяФормаДляТоваров.Значение В (&ДопустимыеВидыПечатныхФорм)
	|			ТОГДА ЗначенияСвойстваПечатнаяФормаДляТоваров.Значение
	|		ИНАЧЕ &ПечатнаяФормаДляТоваровПоУмолчанию
	|	КОНЕЦ КАК ПечатнаяФормаДляТоваров,
	|	ВЫБОР
	|		КОГДА ЗначенияСвойстваПечатнаяФормаДляУслуг.Значение В (&ДопустимыеВидыПечатныхФорм)
	|			ТОГДА ЗначенияСвойстваПечатнаяФормаДляУслуг.Значение
	|		ИНАЧЕ &ПечатнаяФормаДляУслугПоУмолчанию
	|	КОНЕЦ КАК ПечатнаяФормаДляУслуг,
	|	ЕСТЬNULL(ЗначенияСвойстваОтправлятьНепроведенные.Значение, ЛОЖЬ) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ НастройкиОрганизаций
	|ИЗ
	|	ТаблицаОтношений КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойстваНастройкаФорматовОтправки
	|		ПО Таблица.Организация = ЗначенияСвойстваНастройкаФорматовОтправки.Объект
	|			И (ЗначенияСвойстваНастройкаФорматовОтправки.Свойство = &СвойствоОрганизацииФормироватьУПД)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойстваОтправлятьНепроведенные
	|		ПО Таблица.Организация = ЗначенияСвойстваОтправлятьНепроведенные.Объект
	|			И (ЗначенияСвойстваОтправлятьНепроведенные.Свойство = &СвойствоОрганизацииОтправлятьНепроведенные)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойстваНастройкаОснованияДляФормированияСчета
	|		ПО Таблица.Организация = ЗначенияСвойстваНастройкаОснованияДляФормированияСчета.Объект
	|			И (ЗначенияСвойстваНастройкаОснованияДляФормированияСчета.Свойство = &СвойствоОрганизацииОснованиеДляФормированияСчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойстваПечатнаяФормаДляТоваров
	|		ПО Таблица.Организация = ЗначенияСвойстваПечатнаяФормаДляТоваров.Объект
	|			И (ЗначенияСвойстваПечатнаяФормаДляТоваров.Свойство = &СвойствоОрганизацииПечатнаяФормаДляТоваров)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойстваПечатнаяФормаДляУслуг
	|		ПО Таблица.Организация = ЗначенияСвойстваПечатнаяФормаДляУслуг.Объект
	|			И (ЗначенияСвойстваПечатнаяФормаДляУслуг.Свойство = &СвойствоОрганизацииПечатнаяФормаДляУслуг)";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Уничтожает временную таблицу НастройкиОрганизаций.
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц;
//
Процедура УничтожитьНастройкиОрганизаций(МенеджерВТ)
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ НастройкиОрганизаций");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу НастройкиКонтрагентов, которая содержит колонки:
//  * Контрагент - СправочникСсылка.Контрагенты;
//  * КлючНастройкиОтправки - Строка - см. КлючиНастроекОтправки;
//                          - Null	 - если для контрагента используется настройка по умолчанию;
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц, содержит таблицу ТаблицаОтношений (см. ПодготовитьТаблицуПартнерскихОтношений);
//
Процедура ПодготовитьНастройкиКонтрагентов(МенеджерВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ПустыеЗначенияНастроек = ПустыеЗначенияРеквизита("РегистрСведений.ДополнительныеСведения.Ресурс.Значение");
	
	Запрос.Параметры.Вставить("ПустыеЗначенияНастроек", ПустыеЗначенияНастроек);
	Запрос.Параметры.Вставить("СвойствоКонтрагентаФормироватьУПД"
		, СвойствоКонтрагентаФормироватьУПД());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Таблица.Контрагент КАК Контрагент,
	|	ЗначенияСвойстваНастройкаФорматовОтправки.Значение КАК КлючНастройкиОтправки
	|ПОМЕСТИТЬ НастройкиКонтрагентов
	|ИЗ
	|	ТаблицаОтношений КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойстваНастройкаФорматовОтправки
	|		ПО Таблица.Контрагент = ЗначенияСвойстваНастройкаФорматовОтправки.Объект
	|			И (ЗначенияСвойстваНастройкаФорматовОтправки.Свойство = &СвойствоКонтрагентаФормироватьУПД)
	|			И (НЕ ЗначенияСвойстваНастройкаФорматовОтправки.Значение В (&ПустыеЗначенияНастроек))";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Уничтожает временную таблицу НастройкиКонтрагентов.
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц;
//
Процедура УничтожитьНастройкиКонтрагентов(МенеджерВТ)
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ НастройкиКонтрагентов");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу ТаблицаОтношений, которая содержит колонки:
//  * Контрагент - СправочникСсылка.Контрагенты;
//  * Организация - СправочникСсылка.Организации;
//  * ЭтоТестовыйКонтрагент - Булево - Истина, если это тестовый контрагент;
//  * ЭтоТестоваяОрганизация - Булево - Истина, если это тестовая организация;
//  * Статус - Строка - статус партнерских отношений (см. СтатусыПартнерскихОтношений);
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц;
//  СведенияОбОтношениях - Массив - содержит структуры с описаниями партнерских отношений;
//  Организация - ЛюбаяСсылка - значение отбора по организации
//  Контрагент - ЛюбаяСсылка - значение отбора по контрагенту
//
Процедура ПодготовитьТаблицуПартнерскихОтношений(МенеджерВТ, СведенияОбОтношениях, Организация = Неопределено, Контрагент = Неопределено)
	
	ТипВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ТаблицаОтношений = Новый ТаблицаЗначений;
	ТаблицаОтношений.Колонки.Добавить("Контрагент", ТипВсеСсылки);
	ТаблицаОтношений.Колонки.Добавить("Организация", ТипВсеСсылки);
	ТаблицаОтношений.Колонки.Добавить("ЭтоТестовыйКонтрагент", ТипБулево);
	ТаблицаОтношений.Колонки.Добавить("ЭтоТестоваяОрганизация", ТипБулево);
	ТаблицаОтношений.Колонки.Добавить("Статус", ТипСтрока);
	
	Для Каждого Элемент Из СведенияОбОтношениях Цикл
		
		НоваяСтрока = ТаблицаОтношений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
	КонецЦикла;
	
	УсловиеПоОрганизации = "ИСТИНА";
	Если ЗначениеЗаполнено(Организация) Тогда
		УсловиеПоОрганизации = "Т.Организация В (&Организация)";
	КонецЕсли;
	
	УсловиеПоКонтрагенту = "ИСТИНА";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		УсловиеПоКонтрагенту = "Т.Контрагент В (&Контрагент)";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ТаблицаОтношений
	|ИЗ
	|	&ТаблицаОтношений КАК Т
	|ГДЕ
	|	&ОтборПоОрганизации
	|	И &ОтборПоКонтрагенту";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоОрганизации", УсловиеПоОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоКонтрагенту", УсловиеПоКонтрагенту);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТаблицаОтношений", ТаблицаОтношений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Уничтожает временную таблицу НастройкиОрганизаций.
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц;
//
Процедура УничтожитьТаблицуПартнерскихОтношений(МенеджерВТ)
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ТаблицаОтношений");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу НастройкиЭДО.
// Менеджер временных таблиц должен содержать следующие ВТ:
//  * НастройкиОрганизаций - см. ПодготовитьНастройкиОрганизаций;
//  * НастройкиКонтрагентов - см. ПодготовитьНастройкиКонтрагентов;
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц;
//
Процедура ПодготовитьНастройкиЭДО(МенеджерВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	КлючиНастроек = КлючиНастроекОтправки();
	Для Каждого Элемент Из КлючиНастроек Цикл
		Запрос.Параметры.Вставить("КлючНастройки_" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОтношений.Организация КАК Организация,
	|	ТаблицаОтношений.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаОтношений.ЭтоТестоваяОрганизация
	|				ИЛИ ТаблицаОтношений.ЭтоТестовыйКонтрагент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТестоваяНастройка,
	|	НастройкиОрганизаций.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиОрганизаций.ПечатнаяФормаДляТоваров КАК ПечатнаяФормаДляТоваров,
	|	НастройкиОрганизаций.ПечатнаяФормаДляУслуг КАК ПечатнаяФормаДляУслуг,
	|	НастройкиОрганизаций.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные,
	|	ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки) КАК КлючНастройкиОтправки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки) = &КлючНастройки_СЧФДОП_820_736
	|			ИЛИ ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки) = &КлючНастройки_СЧФДОП_820 
	|			ТОГДА &КлючНастройки_СЧФДОП
	|		КОГДА ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки) = &КлючНастройки_СЧФ_ДОП_820_736
	|			ИЛИ ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки) = &КлючНастройки_СЧФ_ДОП_820
	|			ТОГДА &КлючНастройки_СЧФ_ДОП
	|		КОГДА ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки) = &КлючНастройки_СФТОРГ12АКТ_820_736
	|			ИЛИ ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки) = &КлючНастройки_СФТОРГ12АКТ_820
	|			ТОГДА &КлючНастройки_СФТОРГ12АКТ
	|		ИНАЧЕ ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиОтправки, НастройкиОрганизаций.КлючНастройкиОтправки)
	|	КОНЕЦ КАК ФормироватьУПД
	|ПОМЕСТИТЬ НастройкиЭДО
	|ИЗ
	|	ТаблицаОтношений КАК ТаблицаОтношений
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиОрганизаций КАК НастройкиОрганизаций
	|		ПО ТаблицаОтношений.Организация = НастройкиОрганизаций.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтрагентов КАК НастройкиКонтрагентов
	|		ПО ТаблицаОтношений.Контрагент = НастройкиКонтрагентов.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьГрузополучателя(Документ) Экспорт
	
	Если (Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
		ИЛИ (Метаданные.Документы.Найти("НакладнаяНаРеализациюТорг12") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12")) Тогда
		
		Если Документ.Метаданные().Реквизиты.Найти("Грузополучатель") <> Неопределено Тогда
			Грузополучатель = Документ.Грузополучатель;
		Иначе
			Грузополучатель = Документ.Контрагент;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ПредставлениеОтчетаКомиссионера = "ОтчетКомиссионераОПродажах";
		Если Метаданные.Документы.Найти(ПредставлениеОтчетаКомиссионера) = Неопределено Тогда
			ПредставлениеОтчетаКомиссионера = "ОтчетКомиссионера";
		КонецЕсли;
		
		Если (Документ.Метаданные().ТабличныеЧасти.Найти("ДокументыОснования") <> Неопределено 
			И Документ.ДокументыОснования.Количество() > 0
			И (ТипЗнч(Документ.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			ИЛИ ТипЗнч(Документ.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка." + ПредставлениеОтчетаКомиссионера))) Тогда
			
			Если Документ.ДокументыОснования[0].ДокументОснование.Метаданные().Реквизиты.Найти("Грузополучатель") <> Неопределено Тогда
				Грузополучатель = Документ.ДокументыОснования[0].ДокументОснование.Грузополучатель;
			Иначе
				Грузополучатель = Документ.ДокументыОснования[0].ДокументОснование.Контрагент;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный")) И 
		Метаданные.Документы.Найти("НакладнаяНаРеализациюТорг12") <> Неопределено И (ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12")) Тогда
		
		Если Документ.ДокументОснование.Метаданные().Реквизиты.Найти("Грузополучатель") <> Неопределено Тогда
			Грузополучатель = Документ.ДокументОснование.Грузополучатель;
		Иначе
			Грузополучатель = Документ.ДокументОснование.Контрагент;
		КонецЕсли;
		
	Иначе 
		
		Грузополучатель = Неопределено;
		
	КонецЕсли;	
	
	Возврат Грузополучатель;
	
КонецФункции

Функция ПолучитьПодразделениеПолучателя(Документ, Контрагент) Экспорт
	
	СтруктураДанных=	Новый Структура("ToDepartmentID, НаименованиеПодразделения");
	
	НаименованиеРеквизитаДоговор=	?(ПараметрыКлиентСервер.МаркерКонфигурации = "БГУ20" Или ПараметрыКлиентСервер.МаркерКонфигурации = "УТ11", "Договор", "ДоговорКонтрагента");
	Если НЕ Документ.Метаданные().Реквизиты.Найти(НаименованиеРеквизитаДоговор) = Неопределено Тогда
		
		МаршрутПоДоговору=	МетодСервера(,"ПолучитьМаршрутизациюПоДоговору", Документ[НаименованиеРеквизитаДоговор]);
		Если ЗначениеЗаполнено(МаршрутПоДоговору.ToDepartmentID) Тогда
			
			СтруктураДанных.Вставить("ToDepartmentID", 				МаршрутПоДоговору.ToDepartmentID);
			СтруктураДанных.Вставить("НаименованиеПодразделения", 	МаршрутПоДоговору.НаименованиеПодразделения);
			
			Возврат СтруктураДанных;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыКлиентСервер.МаркерКонфигурации = "УНФ16" Тогда
		Грузополучатель= МетодСервера("Модуль_ИнтеграцияУНФ16", "ПолучитьГрузополучателя", Документ);
	Иначе
		Грузополучатель= ПолучитьГрузополучателя(Документ);
	КонецЕсли;
	
	ТекущийКонтрагент=	Контрагент;
	Если (ЗначениеЗаполнено(Грузополучатель)) И (ТекущийКонтрагент.ИНН = Грузополучатель.ИНН) Тогда
		
		МаршрутПоГрузополучателю=	МетодСервера(,"ПолучитьМаршрутизациюПоКонтрагенту", Грузополучатель);
		Если ЗначениеЗаполнено(МаршрутПоГрузополучателю.ToDepartmentID) Тогда
			
			СтруктураДанных.Вставить("ToDepartmentID", 				МаршрутПоГрузополучателю.ToDepartmentID);
			СтруктураДанных.Вставить("НаименованиеПодразделения", 	МаршрутПоГрузополучателю.НаименованиеПодразделения);
			
			Возврат СтруктураДанных;
			
		КонецЕсли;
		
	КонецЕсли;
	
	МаршрутПоКонтрагенту=	МетодСервера(,"ПолучитьМаршрутизациюПоКонтрагенту", ТекущийКонтрагент);
	СтруктураДанных.Вставить("ToDepartmentID", 				МаршрутПоКонтрагенту.ToDepartmentID);
	СтруктураДанных.Вставить("НаименованиеПодразделения", 	МаршрутПоКонтрагенту.НаименованиеПодразделения);
	
	Возврат СтруктураДанных;
	
КонецФункции

// Возвращает строку представления суммы документа или её корректировки
//
// Параметры:
//  СуммаДокумента  - Число - сумма документа
//  СуммаУвеличение - Число - сумма корректировки в большую сторону
//  СуммаУменьшение - Число - сумма корректировки в меньшую сторону
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеСуммы(Знач СуммаДокумента
	, Знач СуммаУвеличение = Неопределено
	, Знач СуммаУменьшение = Неопределено)
	
	ФорматнаяСтрока = "ЧДЦ=2; ЧРГ=' '"; // Явно указанный разделитель групп отключает неразрывный пробел
	
	СуммаДокумента = Формат(СуммаДокумента, ФорматнаяСтрока);
	СуммаУвеличение = Формат(СуммаУвеличение, ФорматнаяСтрока);
	СуммаУменьшение = Формат(СуммаУменьшение, ФорматнаяСтрока);
	
	Если ЗначениеЗаполнено(СуммаУвеличение) И ЗначениеЗаполнено(СуммаУменьшение) Тогда
		
		Результат = "+" + СуммаУвеличение + " -" + СуммаУменьшение;
		
	ИначеЕсли ЗначениеЗаполнено(СуммаУвеличение) Тогда
		
		Результат = "+" + СуммаУвеличение;
		
	ИначеЕсли ЗначениеЗаполнено(СуммаУменьшение) Тогда
		
		Результат = "-" + СуммаУменьшение;
		
	Иначе
		
		Результат = СуммаДокумента;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТаблицыДляВыгрузкиВДиадок(ДатаНачала, ДатаОкончания
			, ТипыДокументов
			, Организации
			, Контрагенты
			, СведенияОПартнерскихОтношениях
			, ДопПараметрыЗапросаРасширение = Неопределено
			, ВызовИзРасширения = Ложь
			, НеИспользуется_ПользовательАвторизованПоСертификату = Ложь) Экспорт
	
	Если ВызовИзРасширения Тогда
		
		// Дополним параметры, которые нужны функции СформироватьТЗВыгрузкиВДиадок_ПакетныйРежим, но не переданы сюда на входе 
		// Предполагаем, что ПараметрыРасширения - Структура, где Значения являются ссылками на документы или Неопределено
		
		Для Каждого КлючИЗначение Из ДопПараметрыЗапросаРасширение Цикл
			
			Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				
				ДатаНачала		= НачалоДня(КлючИЗначение.Значение.Дата);
				ДатаОкончания	= КонецДня(КлючИЗначение.Значение.Дата);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТипыДокументов = "";
		
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	ПодготовитьТаблицуПартнерскихОтношений(МенеджерВТ, СведенияОПартнерскихОтношениях, Организации, Контрагенты);
	
	// Настройки ЭДО
	ПодготовитьНастройкиОрганизаций(МенеджерВТ);
	ПодготовитьНастройкиКонтрагентов(МенеджерВТ);
	ПодготовитьНастройкиЭДО(МенеджерВТ);
	
	// Уничтожить ненужные таблицы
	УничтожитьНастройкиОрганизаций(МенеджерВТ);
	УничтожитьНастройкиКонтрагентов(МенеджерВТ);
	УничтожитьТаблицуПартнерскихОтношений(МенеджерВТ);
	
	ПараметрыЗапросаСписка = ПараметрыЗапросаСпискаИсходящих(ДатаНачала, ДатаОкончания);
	
	СтруктТаблицыДляВыгрузки = СформироватьТаблицыДляВыгрузкиВДиадок_ПакетныйРежим(МенеджерВТ
		, ПараметрыЗапросаСписка
		, ТипыДокументов);
	
	ТЗ = СтруктТаблицыДляВыгрузки.ТаблицаВыгрузки;
	
	Если ВызовИзРасширения Тогда
		
		// Теперь надо отфильтровать ТЗ по документам, переданным в ДопПараметрыЗапросаРасширение.
		// Получаем избыточность в запросах внутри СформироватьТЗВыгрузкиВДиадок_ПакетныйРежим,
		//   но выигрываем в поддержке данного кода.
		// В будущем можно оптимизировать, передавая ссылки на конкретные документы в явном виде в конечные запросы.
		
		НайденныеСтроки = Новый Массив;
		Для Каждого КлючИЗначение Из ДопПараметрыЗапросаРасширение Цикл
			
			Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				
				СтрокиТаблицыВыгрузки = ТЗ.НайтиСтроки(Новый Структура("Документ", КлючИЗначение.Значение));
				Для Каждого СтрокаТаблицыВыгрузки Из СтрокиТаблицыВыгрузки Цикл
					НайденныеСтроки.Добавить(СтрокаТаблицыВыгрузки);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктТаблицыДляВыгрузки.ТаблицаВыгрузки = ТЗ.Скопировать(НайденныеСтроки);
		
	КонецЕсли;
	
	ПараметрыСобытияПМ = Новый Структура;
	ПараметрыСобытияПМ.Вставить("МассивОрганизаций"	, Организации);
	ПараметрыСобытияПМ.Вставить("МассивКонтрагентов", Контрагенты);
	ПараметрыСобытияПМ.Вставить("ДатаНачала"		, ДатаНачала);
	ПараметрыСобытияПМ.Вставить("ДатаОкончания"		, ДатаОкончания);
	ПараметрыСобытияПМ.Вставить("ТипыДокументов"	, ТипыДокументов);
	ПараметрыСобытияПМ.Вставить("ТаблицаДокументов"	, СтруктТаблицыДляВыгрузки.ТаблицаВыгрузки);
	ПараметрыСобытияПМ.Вставить("ТаблицаСвязей"		, СтруктТаблицыДляВыгрузки.ТаблицаСвязей);
	
	МетодСервера(, "ОбработкаСобытияПодключаемогоМодуля", "ПослеПолученияТаблицыДокументовДляОтправки", ПараметрыСобытияПМ);
	
	Возврат СтруктТаблицыДляВыгрузки;
	
КонецФункции

Процедура ДобавитьСтрокуТаблицыИсходящихДокументов(ИсходящиеДокументы, Выборка, КэшПравил)
	
	Попытка
		
		ФорматЭД = ФорматОтправкиДокумента(Выборка.КлючНастройкиОтправки
			, Выборка.ВидЭД
			, Выборка.ФункцияУПД
			, Выборка.ЭтоИсправление
			, КэшПравил);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		
		СсылкаНаОбъект = Выборка.Документ;
		ШаблонКомментария = "Не удалось определить формат отправки по причине: %1";
		КомментарийЖР = СтрШаблон(ШаблонКомментария, ПодробноеПредставлениеОшибки(Ошибка));
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации()
			, УровеньЖурналаРегистрации.Ошибка
			, СсылкаНаОбъект.Метаданные()
			, СсылкаНаОбъект
			, КомментарийЖР);
		
		ШаблонСообщения = "Не удалось определить формат отправки документа %1
		|Подробности в журнале регистрации.";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(ШаблонСообщения, Строка(СсылкаНаОбъект));
		Сообщение.Сообщить(); 
		
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ФорматЭД) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ИсходящиеДокументы.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	
	ЗаполнитьПредставлениеСуммыВСтрокеСпискаДокументовНаОтправку(СтрокаТаблицы);
	
	СтрокаТаблицы.ФорматОтправки = ФорматЭД;
	СтрокаТаблицы.DocumentType = ФорматЭД.DocumentType;
	СтрокаТаблицы.ТипДокумента = ФорматЭД.Представление;
	
	Если ТекущаяДатаСеанса() > ФорматЭД.ПриказОбУтверждении.ДатаОкончанияДействия Тогда
		СтрокаТаблицы.УстаревшийФормат = Истина;
	КонецЕсли;
	
	СтрокаТаблицы.CounteragentID = МетодСервера(, "Контрагент_2_CounteragentBoxID", СтрокаТаблицы.Контрагент);
	Если СтрокаТаблицы.ЭтоТестовыйДок Тогда
		СтрокаТаблицы.ТипДокумента  = СтрокаТаблицы.ТипДокумента + " (тестовый)";
	КонецЕсли;
	
	СтрокаТаблицы.ДокВыгружен = ЗначениеЗаполнено(СтрокаТаблицы.ID);
	
	ДанныеДляМаршрутизации = ПолучитьПодразделениеПолучателя(СтрокаТаблицы.Документ, СтрокаТаблицы.Контрагент);
	СтрокаТаблицы.НаименованиеПодразделения	 = ДанныеДляМаршрутизации.НаименованиеПодразделения;
	СтрокаТаблицы.ToDepartmentID			 = ДанныеДляМаршрутизации.ToDepartmentID;
	
	СтрокаТаблицы.ВидДокумента = СтрокаТаблицы.Документ.Метаданные().Представление();
	
	ШаблонКлючей = МетодСервера(, "ПолучитьШаблонКлючейДопСведений", СтрокаТаблицы.CounteragentID, СтрокаТаблицы.DocumentType); 
	Если ЗначениеЗаполнено(ШаблонКлючей) = Истина Тогда
		СтрокаТаблицы.ДопПоле = ПолучитьСтрокуКлючЗначение(СтрокаТаблицы.Организация, СтрокаТаблицы.DocumentType, ШаблонКлючей);
	КонецЕсли;
	СтрокаТаблицы.ТребуетсяКлючЗначение = Истина;
	
	СтрокаТаблицы.ПропускатьПриВыгрузке = Ложь;
	СтрокаТаблицы.СвязующийИдентификаторСтроки = Новый УникальныйИдентификатор;
	
	Если СтрокаТаблицы.Проведен Тогда
		СтрокаТаблицы.СостояниеДокумента = 2;
	Иначе
		СтрокаТаблицы.СостояниеДокумента = 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеСуммыВСтрокеСпискаДокументовНаОтправку(СтрокаСписка)
	
	СуммаДокумента = СтрокаСписка.СуммаДокументаЗначение;
	СуммаНДСДокумента = СтрокаСписка.СуммаНДСЗначение;
	
	СуммаУвеличение = 0;
	СуммаУменьшение = 0;
	СуммаНДСУвеличение = 0;
	СуммаНДСУменьшение = 0;
	
	Если СтрокаСписка.Тип = "СчетФактураВыданный" Тогда
		
		ПараметрыСФ = МетодСервера(ИмяМодуляИнтеграции(), "ПараметрыСчетаФактуры", СтрокаСписка.Документ);
		
		Если ПараметрыСФ <> Неопределено Тогда
			
			СуммаДокумента = ПараметрыСФ.СуммаДокумента;
			СуммаУвеличение = ПараметрыСФ.СуммаУвеличение;
			СуммаУменьшение = ПараметрыСФ.СуммаУменьшение;
			
			СуммаНДСДокумента = ПараметрыСФ.СуммаНДСДокумента;
			СуммаНДСУвеличение = ПараметрыСФ.СуммаНДСУвеличение;
			СуммаНДСУменьшение = ПараметрыСФ.СуммаНДСУменьшение;
			
		КонецЕсли;
		
	ИначеЕсли СтрокаСписка.Тип = "СчетНаОплату" Тогда
		
		ПараметрыСчета = МетодСервера(ИмяМодуляИнтеграции(), "ПараметрыСчетаНаОплату", СтрокаСписка.Документ);
		
		Если ПараметрыСчета <> Неопределено Тогда
			
			СуммаДокумента = ПараметрыСчета.СуммаДокумента;
			СуммаНДСДокумента = ПараметрыСчета.СуммаНДСДокумента;
			
		КонецЕсли;
		
	Иначе
		
		СуммаДокумента = СтрокаСписка.СуммаДокументаЗначение;
		СуммаНДСДокумента = СтрокаСписка.СуммаНДСЗначение;
		
	КонецЕсли;
	
	СтрокаСписка.СуммаДокумента = ПредставлениеСуммы(СуммаДокумента, СуммаУвеличение, СуммаУменьшение);
	СтрокаСписка.СуммаНДС = ПредставлениеСуммы(СуммаНДСДокумента, СуммаНДСУвеличение, СуммаНДСУменьшение);
	
КонецПроцедуры

Функция СформироватьТаблицыДляВыгрузкиВДиадок_ПакетныйРежим(МенеджерВТ, ПараметрыЗапроса, ТипыДокументов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	УстановитьПараметрыЗапроса(Запрос, ПараметрыЗапроса);
	
	МассивВременныхТаблиц = МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции
		, "ПодготовитьВТДляСпискаОтправкиДокументов"
		, ТипыДокументов
		, Запрос);
	
	Запрос.Текст = ТаблицаВыгрузки_ПодготовитьИтоговыйТекстЗапроса(МассивВременныхТаблиц);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос.Текст = ТаблицаСвязей_ПодготовитьТекстЗапроса(МассивВременныхТаблиц);
	ТаблицаСвязей = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	Запрос = Неопределено;
	
	ИсходящиеДокументы = ВернутьЗаготовкуРезультирующейТаблицы(РезультатЗапроса);
	
	Выборка = РезультатЗапроса.Выбрать();
	РезультатЗапроса = Неопределено;
	
	КэшПравил = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		ДобавитьСтрокуТаблицыИсходящихДокументов(ИсходящиеДокументы
			, Выборка
			, КэшПравил);
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаВыгрузки", ИсходящиеДокументы);
	Результат.Вставить("ТаблицаСвязей"	, ТаблицаСвязей);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаВыгрузки_ПодготовитьИтоговыйТекстЗапроса(МассивВременныхТаблиц)
	
	ТекстЗапроса=	"";
	Разделитель=	"";
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	Т.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА Т.ВидЭД = &ВидыЭД_ТоварнаяНакладная И НастройкиОбмена.ПечатнаяФормаДляТоваров = &ВидыПФ_Акт
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		КОГДА Т.ВидЭД = &ВидыЭД_АктОбОказанииУслуг И НастройкиОбмена.ПечатнаяФормаДляУслуг = &ВидыПФ_Торг12
	|			ТОГДА &ВидыЭД_ТоварнаяНакладная
	|		ИНАЧЕ Т.ВидЭД
	|	КОНЕЦ КАК ВидЭД,
	|	Т.ЭтоИсправление КАК ЭтоИсправление,
	|	Т.ЭтоКорректировка КАК ЭтоКорректировка,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	Т.Валюта КАК Валюта,
	|	Т.ID_ КАК ID,
	|	Т.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	Т.Проведен КАК Проведен,
	|	Т.Дата КАК Дата,
	|	Т.Номер КАК Номер,
	|	Т.СуммаНДСТовары КАК СуммаНДСТовары,
	|	Т.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	Т.СуммаНДСТовары + Т.СуммаНДСУслуги КАК СуммаНДСЗначение,
	|	Т.Тип КАК Тип,
	|	Т.ФункцияУПД КАК ФункцияУПД,
	|	НастройкиОбмена.ЭтоТестоваяНастройка КАК ЭтоТестовыйДок,
	|	НастройкиОбмена.КлючНастройкиОтправки КАК КлючНастройкиОтправки
	|ИЗ
	|	&ИмяВременнойТаблицы КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиОбмена
	|		ПО Т.Организация = НастройкиОбмена.Организация
	|			И Т.Контрагент = НастройкиОбмена.Контрагент";
	
	Для Каждого ИмяВременнойТаблицы Из МассивВременныхТаблиц Цикл
		
		Если Лев(ИмяВременнойТаблицы, 6) = "Связь_" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + Разделитель
		+ СтрЗаменить(ШаблонТекстаЗапроса, "&ИмяВременнойТаблицы", ИмяВременнойТаблицы);
		
		Разделитель = РазделительОбъединенияЗапросов();
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиЭДО";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТаблицаСвязей_ПодготовитьТекстЗапроса(МассивВременныхТаблиц)
	
	ТекстЗапроса	= "";
	Разделитель		= "";
	ТекстПоместить	= "ПОМЕСТИТЬ ВТ_Объединение";
	
	Для Каждого ИмяВременнойТаблицы Из МассивВременныхТаблиц Цикл
		
		Если НЕ Лев(ИмяВременнойТаблицы, 6) = "Связь_" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + Разделитель + 
		"ВЫБРАТЬ
		|	Документ,
		|	ДокументСвязь
		|"+ТекстПоместить+"
		|ИЗ
		|	" + ИмяВременнойТаблицы + " КАК Т";
		
		Разделитель		= РазделительОбъединенияЗапросов();
		ТекстПоместить	= "";
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Документ КАК Документ,
		|	ВТ1.Документ КАК ДокументСвязь
		|ИЗ
		|	ВТ_Объединение КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Объединение КАК ВТ1
		|		ПО ВТ.Документ = ВТ1.ДокументСвязь
		|
		|	ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ.Документ,
		|	ВТ1.Документ
		|ИЗ
		|	ВТ_Объединение КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Объединение КАК ВТ1
		|		ПО ВТ.ДокументСвязь = ВТ1.ДокументСвязь
		|			И ВТ.Документ <> ВТ1.Документ
		|			И ВТ.ДокументСвязь <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Объединение";
		
	Иначе
		
		ТекстЗапроса = 		
		"ВЫБРАТЬ
		| NULL КАК Документ,
		| NULL КАК ДокументСвязь
		|ГДЕ
		| ЛОЖЬ";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьЗаготовкуРезультирующейТаблицы(РезультатЗапроса)
	
	ПолученнаяТаблицаДанных= Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ПолученнаяТаблицаДанных.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	ПолученнаяТаблицаДанных.Колонки.Добавить("СуммаДокумента",				Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("СуммаНДС",					Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.колонки.добавить("ТипДокумента", 				Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("CounteragentID", 				Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ВидДокумента", 				Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ДопПоле",						Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ТребуетсяКлючЗначение",		Новый ОписаниеТипов("Булево"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("DocumentType", 				Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("НаименованиеПодразделения", 	Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ToDepartmentID", 				Новый ОписаниеТипов("Строка"));
	
	ПолученнаяТаблицаДанных.Колонки.Добавить("ДокВыгружен", 				Новый ОписаниеТипов("Булево"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ПропускатьПриВыгрузке",		Новый ОписаниеТипов("Булево"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ВнешняяПечатнаяФорма");
	
	ПолученнаяТаблицаДанных.Колонки.Добавить("ЭтоПакет", 					Новый ОписаниеТипов("Булево"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ВременныйИдентификаторПакета");
	ПолученнаяТаблицаДанных.Колонки.Добавить("ПозицияСортировки",			Новый ОписаниеТипов("Число"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("ИндексИконкиПакета",			Новый ОписаниеТипов("Число"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("СвязующийИдентификаторСтроки");
	ПолученнаяТаблицаДанных.Колонки.Добавить("ОшибкаОтправки", 				Новый ОписаниеТипов("Строка"));
	ПолученнаяТаблицаДанных.Колонки.Добавить("СостояниеДокумента", 			Новый ОписаниеТипов("Число"));
	
	ПолученнаяТаблицаДанных.Колонки.Добавить("ФорматОтправки");
	ПолученнаяТаблицаДанных.Колонки.Добавить("УстаревшийФормат", Новый ОписаниеТипов("Булево"));
	
	Возврат ПолученнаяТаблицаДанных; 
	
КонецФункции

Функция ВыгрузитьКолонкуМассиваСтруктур(МассивСтруктур, ИмяКолонки, ТолькоРазличные = Истина)
	
	Результат = Новый Массив;
	
	Для Каждого Стр Из МассивСтруктур Цикл
		
		Значение = Неопределено;
		Если Не Стр.Свойство(ИмяКолонки, Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ТолькоРазличные
			Или Результат.Найти(Значение) = Неопределено Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоДокументаИдентификатор()
	
	ИдентификаторСвойства = "ИдентификаторДокументаВДиадок";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоДокументаИдентификаторСчета()
	
	ИдентификаторСвойства = "ИдентификаторДокументаВДиадокСчет";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоДокументаСтатусОтправляемыхВПФ()
	
	ИдентификаторСвойства = "СтатусОтправляемыхВПФ_Диадок";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоКонтрагентаФормироватьУПД()
	
	ИдентификаторСвойства = "ДиадокФормироватьУПДКонтрагент";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоОрганизацииФормироватьУПД()
	
	ИдентификаторСвойства = "ДиадокФормироватьУПД";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоОрганизацииОтправлятьНепроведенные()
	
	ИдентификаторСвойства = "ДиадокОтправкаНепроведенных";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоОрганизацииФормироватьСчетНаОсновании()
	
	ИдентификаторСвойства = "ДиадокФормироватьСчетНаОсновании";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоОрганизацииПечатнаяФормаДляТоваров()
	
	ИдентификаторСвойства = "ДиадокИдентификаторСвойстваПечатнаяФормаДляТоваров";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция СвойствоОрганизацииПечатнаяФормаДляУслуг()
	
	ИдентификаторСвойства = "ДиадокИдентификаторСвойстваПечатнаяФормаДляУслуг";
	Результат = МетодСервера(, "НайтиСвойство", ИдентификаторСвойства);
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФормаДляТоваровПоУмолчанию()
	
	Результат = ВидыПечатныхФорм().Торг12;
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФормаДляУслугПоУмолчанию()
	
	Результат = ВидыПечатныхФорм().Акт;
	Возврат Результат;
	
КонецФункции

Функция КлючНастройкиОтправкиПоУмолчанию()
	
	Результат = КлючиНастроекОтправки().СЧФДОП_820;
	Возврат Результат;
	
КонецФункции

Функция ВидОснованияСчетаПоУмолчанию()
	
	Результат = ВидыОснованийСчета().Счет;
	Возврат Результат;
	
КонецФункции

Функция СтатусДействующихПартнерскихОтношений()
	
	Результат = СтатусыПартнерскихОтношений().IsMyCounteragent;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Автотесты

#Область ТаблицаДокументовНаОтправку

// Возвращает таблицу исходящих документов.
// Для построения таблицы формируется тестовая таблица НастройкиЭДО,
// в которую входят все организации и контрагенты информационной базы.
//
// Параметры:
//  НачалоПериода			 - Дата - нижняя граница выборки документов;
//  КонецПериода			 - Дата - верхняя граница выборки документов;
//  КлючНастройкиОтправки	 - Строка - см. КлючиНастроекОтправки;
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица, которая используется для отображения в форме ФормаВыгрузка.
//
Функция Тест_ТаблицаИсходящихДокументов(НачалоПериода, КонецПериода, КлючНастройкиОтправки) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	// Сформировать ВТ НастройкиОрганизаций с заданным ключом настройки отправки
	Тест_ПодготовитьНастройкиОрганизаций(МенеджерВТ, КлючНастройкиОтправки);
	
	// Сформировать ВТ НастройкиКонтрагентов
	Тест_ПодготовитьНастройкиКонтрагентов(МенеджерВТ);
	
	// Сформировать ВТ ТаблицаОтношений
	Тест_ПодготовитьТаблицуПартнерскихОтношений(МенеджерВТ);
	
	// Сформировать ВТ НастройкиЭДО
	ПодготовитьНастройкиЭДО(МенеджерВТ);
	
	// Уничтожить ненужные таблицы
	УничтожитьНастройкиОрганизаций(МенеджерВТ);
	УничтожитьНастройкиКонтрагентов(МенеджерВТ);
	УничтожитьТаблицуПартнерскихОтношений(МенеджерВТ);
	
	КлючНастройкиОтбораПоТипам = "";
	
	ПараметрыЗапросаСписка = ПараметрыЗапросаСпискаИсходящих(НачалоПериода, КонецПериода);
	
	ДанныеДляВыгрузки = СформироватьТаблицыДляВыгрузкиВДиадок_ПакетныйРежим(МенеджерВТ
							, ПараметрыЗапросаСписка
							, КлючНастройкиОтбораПоТипам);
	
	Результат = ДанныеДляВыгрузки.ТаблицаВыгрузки;
	
	Возврат Результат;
	
КонецФункции

// Формирует временную таблицу НастройкиОрганизаций для автотестов.
// Описание таблицы см. в процедуре ПодготовитьНастройкиОрганизаций.
//
// Параметры:
//  МенеджерВТ				 - МенеджерВременныхТаблиц	 - менеджер временных таблиц;
//  КлючНастройкиОтправки	 - Строка - см. КлючиНастроекОтправки;
//
Процедура Тест_ПодготовитьНастройкиОрганизаций(МенеджерВТ, КлючНастройкиОтправки)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.Ссылка КАК Организация,
	|	&КлючНастройкиОтправки КАК КлючНастройкиОтправки,
	|	&ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	&ПечатнаяФормаДляТоваров КАК ПечатнаяФормаДляТоваров,
	|	&ПечатнаяФормаДляУслуг КАК ПечатнаяФормаДляУслуг,
	|	&ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ НастройкиОрганизаций
	|ИЗ
	|	Справочник.Организации КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Параметры.Вставить("КлючНастройкиОтправки"		, КлючНастройкиОтправки);
	Запрос.Параметры.Вставить("ОснованиеФормированияСчета"	, ВидОснованияСчетаПоУмолчанию());
	Запрос.Параметры.Вставить("ПечатнаяФормаДляТоваров"		, ПечатнаяФормаДляТоваровПоУмолчанию());
	Запрос.Параметры.Вставить("ПечатнаяФормаДляУслуг"		, ПечатнаяФормаДляУслугПоУмолчанию());
	Запрос.Параметры.Вставить("ОтправлятьНепроведенные"		, Ложь);
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу НастройкиКонтрагентов для автотестов.
// Описание таблицы см. в процедуре ПодготовитьНастройкиКонтрагентов.
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц;
//
Процедура Тест_ПодготовитьНастройкиКонтрагентов(МенеджерВТ)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.Ссылка КАК Контрагент,
	|	NULL КАК КлючНастройкиОтправки
	|ПОМЕСТИТЬ НастройкиКонтрагентов
	|ИЗ
	|	Справочник.Контрагенты КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ПометкаУдаления
	|	И &УсловиеЭтоГруппа";
	
	УсловиеЭтоГруппа = "ИСТИНА";
	Если Метаданные.Справочники.Контрагенты.Иерархический Тогда
		УсловиеЭтоГруппа = "НЕ Таблица.ЭтоГруппа";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеЭтоГруппа", УсловиеЭтоГруппа);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу ТаблицаОтношений для автотестов.
// Описание таблицы см. в процедуре ПодготовитьТаблицуПартнерскихОтношений.
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - менеджер временных таблиц;
// 
Процедура Тест_ПодготовитьТаблицуПартнерскихОтношений(МенеджерВТ)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВсеОрганизации.Организация КАК Организация,
	|	ВсеКонтрагенты.Контрагент КАК Контрагент,
	|	ИСТИНА КАК ЭтоТестоваяОрганизация,
	|	ИСТИНА КАК ЭтоТестовыйКонтрагент,
	|	&СтатусОтношений КАК Статус
	|ПОМЕСТИТЬ ТаблицаОтношений
	|ИЗ
	|	НастройкиОрганизаций КАК ВсеОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиКонтрагентов КАК ВсеКонтрагенты
	|		ПО (ИСТИНА)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СтатусОтношений", СтатусДействующихПартнерскихОтношений());
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументов

// Формирует полный список правил обработки электронных документов
// для заданного формата.
//
// Параметры:
//  ФорматЭД - Структура - формат электронных документов (FullVersion)
// 
// Возвращаемое значение:
//  СписокЗначений - правила обработки документов.
//
Функция Тест_ПравилаОбработкиДокументов(ФорматЭД) Экспорт
	
	ОписаниеФормата = ПолноеОписаниеФорматаЭлектронногоДокумента(ФорматЭД);
	
	ПравилаОбработкиПД = ПравилаОбработкиПервичныхДокументов(ОписаниеФормата);
	ПравилаОбработкиСФ = ПравилаОбработкиСчетовФактур(ОписаниеФормата);
	
	Результат = Новый СписокЗначений;
	
	ДополнитьСписокЗначений(Результат, ПравилаОбработкиПД);
	ДополнитьСписокЗначений(Результат, ПравилаОбработкиСФ);
	
	Результат.СортироватьПоПредставлению();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Маркировка

// Заполняет в табличной части протоконтента сведения о маркировке полученными из ПМ
//
// Параметры:
//  Контент - Структура - Протоконтент в формате приказа 820@.
//  СсылкаНаДокумент - ЛюбаяСсылка - Ссылка основание электронного документа.
//
Процедура ЗаполнитьСведенияОМаркировке820_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект)
	
	СтандартнаяОбработка = Истина;
	РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
	
	ЗаполнитьРазвернутуюТаблицуКодов(РазвернутаяТаблицаУпаковок, СсылкаНаОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка = Ложь Тогда
		
		ЗаполнитьСведенияОМаркировкеВКонтенте820(Контент, РазвернутаяТаблицаУпаковок);
		
		Если ЗначениеЗаполнено(РазвернутаяТаблицаУпаковок) Тогда
			ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировке736_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект, ИсходныйДокумент)
	
	СтандартнаяОбработка = Истина;
	РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
	РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок();
	
	ЗаполнитьРазвернутуюТаблицуКодов(РазвернутаяТаблицаУпаковок, СсылкаНаОбъект, СтандартнаяОбработка);
	
	Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда 
		ЗаполнитьРазвернутуюТаблицуКодов(РазвернутаяТаблицаУпаковокДоИзменения, ИсходныйДокумент, СтандартнаяОбработка);
	КонецЕсли;
	
	Если СтандартнаяОбработка = Ложь Тогда
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736(Контент, СсылкаНаОбъект, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения);
		
		Если ЗначениеЗаполнено(РазвернутаяТаблицаУпаковок) Тогда
			ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте820(Контент, РазвернутаяТаблицаУпаковок)
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		ТребуемоеКоличество = СтрокаТЧ.Quantity;
		
		Если Не ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			Продолжить;
		КонецЕсли;
		
		// Инициализировать промежуточную структуру с коллекциями кодов маркировки
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		// Найти подходящие кодами маркировки
		ПодобратьКодыМаркировки(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
		
		// Перенести найденные коды маркировки в строку протоконтента
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.ItemIdentificationNumbers, КодыМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736(Контент, СсылкаНаОбъект, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения)
	
	ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
	ЭтоУКД_НаОснованииВозвратаОтКлиента = СредиВладельцевКодовМаркировкиТолькоВозвратыОтКлиента(ДокументыПередачи);
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
						
		//OriginalValues
		ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity;
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки(КодыМаркировки
				, РазвернутаяТаблицаУпаковокДоИзменения
				, СтрокаТЧ.СлужебнаяИнформация
				, ТребуемоеКоличество
			);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
		ЭтоПолныйВозвратТовара = ЭтоПолныйВозвратТовара(СтрокаТЧ);
		
		//CorrectedValues
		Если ЭтоУКД_НаОснованииВозвратаОтКлиента Тогда
			
			Если ЭтоПолныйВозвратТовара Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьКодыМаркировкиДляВозвратаОтКлиента(
				СтрокаТЧ, 
				РазвернутаяТаблицаУпаковок,
				РазвернутаяТаблицаУпаковокДоИзменения
			);
			
		Иначе
			
			ТребуемоеКоличество = СтрокаТЧ.CorrectedValues.Quantity;
			ТребуемоеКоличество = ?(ТребуемоеКоличество = Неопределено, 0, ТребуемоеКоличество);
			
			Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
				// Инициализировать промежуточную структуру с коллекциями кодов маркировки
				КодыМаркировки = НовыйСведенияОМаркировке();
				
				// Найти подходящие кодами маркировки
				ПодобратьКодыМаркировки(КодыМаркировки
					, РазвернутаяТаблицаУпаковок
					, СтрокаТЧ.СлужебнаяИнформация
					, ТребуемоеКоличество
				);
				
				// Перенести найденные коды маркировки в строку протоконтента
				ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет таблицу кодов штатными средствами конфигурации (с помощью интеграционного модуля).
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. НоваяРазвернутаяТаблицаУпаковок).
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода.
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка)
	
	МетодСервера(ИмяМодуляИнтеграции(), "ЗаполнитьРазвернутуюТаблицуКодов", Результат, СсылкаНаОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

// Инициализирует структуру с коллекциями кодов маркировки.
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * ТранспортныеУпаковки - Массив - Идентификаторы транспортных упаковок (TransPackageId, ИдентТрансУпак)
//   * ИндивидуальныеУпаковки - Массив - Идентификаторы потребительских упаковок (PackageIds, НомУпак)
//   * КонтрольныеИдентификационныеЗнаки - Массив - Контрольные идентификационные знаки (Units, КИЗ)
//
Функция НовыйСведенияОМаркировке()
	
	Результат = Новый Структура;
	Результат.Вставить("КонтрольныеИдентификационныеЗнаки", Новый Массив);
	Результат.Вставить("ИндивидуальныеУпаковки", Новый Массив);
	Результат.Вставить("ТранспортныеУпаковки", Новый Массив);
	Результат.Вставить("КоличествоТовараВУпаковке", 0);
	Результат.Вставить("НомерПартии", "");
	
	Возврат Результат;
	
КонецФункции

// Подбирает требуемое количество кодов маркировки, удовлетворяющих параметрам номенклатуры.
// В исходной таблице кодов строки с подобранными кодами отмечаются как обработанные.
//
// Параметры:
//  КодыМаркировки		 - Структура - результат подбора (см. НовыйСведенияОМаркировке)
//  ТаблицаКодов		 - ТаблицаЗначений - таблица штрихкодов упаковок (см. РазвернутаяТаблицаУпаковок)
//  СлужебнаяИнформация	 - Структура - содержит параметры номенклатуры (см. НоваяСлужебнаяИнформацияСтроки)
//  ТребуемоеКоличество	 - Число - Количество кодов, которые нужно подобрать
//
Процедура ПодобратьКодыМаркировки(КодыМаркировки
	, РазвернутаяТаблицаУпаковок
	, СлужебнаяИнформация
	, Знач ТребуемоеКоличество
	, ПодобратьКодДляПолногоВозрата = Ложь)
	
	Для Каждого СтрокаУпаковки Из РазвернутаяТаблицаУпаковок Цикл
		
		МожноПодобратьКодПоУпаковке = МожноПодобратьКодМаркировкиПоУпаковке(СтрокаУпаковки, ТребуемоеКоличество, ПодобратьКодДляПолногоВозрата);
		
		Если НЕ МожноПодобратьКодПоУпаковке Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.Номенклатура <> СлужебнаяИнформация.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьХарактеристики
			И СтрокаУпаковки.Характеристика <> СлужебнаяИнформация.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьСерии
			И ЗначениеЗаполнено(СлужебнаяИнформация.Серия)
			И СтрокаУпаковки.Серия <> СлужебнаяИнформация.Серия Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШК = СтрокаУпаковки.ЗначениеШтрихкода; 
		
		Если ЗначениеЗаполнено(ЗначениеШК) Тогда
			
			ВидУпаковки = СтрокаУпаковки.ВидУпаковки;
			
			Если ВидУпаковки = УпаковкаЛогистическая() Тогда
				КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаГрупповая()
				ИЛИ ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			Иначе
				КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
			КонецЕсли;
			
			ТребуемоеКоличество = ТребуемоеКоличество - 1;
			
		КонецЕсли;
		
		СтрокаУпаковки.Обработан = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Функция МожноПодобратьКодМаркировкиПоУпаковке(СтрокаУпаковки, ТребуемоеКоличество, ПодобратьКодДляПолногоВозрата)
	
	Результат = Истина;
	
	Если СтрокаУпаковки.Обработан Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ПодобратьКодДляПолногоВозрата 
		И ТребуемоеКоличество = 0 Тогда
		
		ЭтоОСУ = СтрокаУпаковки.ВидУпаковки = УпаковкаОбъемноСортовойУчет();
		
		Если НЕ ЭтоОСУ Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТребуемоеКоличество <= 0 Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьКодОСУИзGTIN(КоличествоТовара, СтрокаУпаковки)
	
	Если СтрокаУпаковки.КоличествоВПотребительскойУпаковке = 0 Тогда
		КоличествоПоТегу37 = 0;
	Иначе
		КоличествоПоТегу37 = Окр(КоличествоТовара / СтрокаУпаковки.КоличествоВПотребительскойУпаковке);
	КонецЕсли;
	
	Результат = НовыйКодОСУ(СтрокаУпаковки.ЗначениеШтрихкода, КоличествоПоТегу37);
	
	Возврат Результат;
	
КонецФункции

// Переносит коды маркировки в коллекцию ItemIdentificationNumbers.
//
// Параметры:
//  ItemIdentificationNumbers - Массив - содержит структуры, соответствующие объекту ItemIdentificationNumber (см. Новый_ItemIdentificationNumber)
//  КодыМаркировки - Структура - содержит коллекции кодов маркировки (см. НовыйСведенияОМаркировке)
//
Процедура ЗаполнитьКодыМаркировкиВСтрокеКонтента(ItemIdentificationNumbers, КодыМаркировки)
	
	Для Каждого Элемент Из КодыМаркировки.ТранспортныеУпаковки Цикл
		
		ИдентификационныйНомер = Новый_ItemIdentificationNumber();
		ИдентификационныйНомер.TransPackageId = Элемент;
		ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КодыМаркировки.ИндивидуальныеУпаковки) Тогда
		
		ИдентификационныйНомер = Новый_ItemIdentificationNumber();
		
		Для Каждого Элемент Из КодыМаркировки.ИндивидуальныеУпаковки Цикл
			ИдентификационныйНомер.PackageIds.Добавить(Элемент);
		КонецЦикла;
		
		ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодыМаркировки.КонтрольныеИдентификационныеЗнаки) Тогда
		
		ИдентификационныйНомер = Новый_ItemIdentificationNumber();
		
		Для Каждого Элемент Из КодыМаркировки.КонтрольныеИдентификационныеЗнаки Цикл
			ИдентификационныйНомер.Units.Добавить(Элемент);
		КонецЦикла;
		
		ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЕсли;
	
КонецПроцедуры

// Конструктор таблицы кодов маркировки, развернутой по номенклатуре.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок с товарными данными:
//   * Ссылка             - Произвольный - объект-владелец штрихкода - исходная колонка
//   * Номенклатура       - ОпределяемыйТип.Номенклатура - содержимое
//   * Характеристика     - ОпределяемыйТип.ХарактеристикаНоменклатуры - содержимое
//   * Серия              - ОпределяемыйТип.СерияНоменклатуры - содержимое
//   * ЗначениеШтрихкода  - Строка - текстовое представление исходного штрихкода для передачи в ЭДО
//   * ВидУпаковки        - Строка - вид упаковки номенклатуры для кодировки значения штрихкода. Допустимые значения:
//                                   УпаковкаПотребительская(), УпаковкаЛогистическая(), УпаковкаГрупповая(), Неопределено.
//   * Обработан          - Булево - признак сопоставления строки товарной части документа
//
//
Функция НоваяРазвернутаяТаблицаУпаковок()
	
	ТипСтрока200 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200));
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Серия");
	Результат.Колонки.Добавить("ЗначениеШтрихкода", ТипСтрока200);
	Результат.Колонки.Добавить("ВидУпаковки", ТипСтрока200);
	Результат.Колонки.Добавить("Обработан", ТипБулево);
	Результат.Колонки.Добавить("ИспользоватьХарактеристики", ТипБулево);
	Результат.Колонки.Добавить("ИспользоватьСерии", ТипБулево);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользоватьИнтеграционныйМодульДляЗаполненияСведенийОМаркировке()
	
	ИнтеграционныеМодули = Новый Массив;
	ИнтеграционныеМодули.Добавить("Модуль_ИнтеграцияАльфаАвто6");
	
	Результат = ИнтеграционныеМодули.Найти(ИмяМодуляИнтеграции()) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция УпаковкаГрупповая()
	Возврат "Групповая";
КонецФункции

Функция УпаковкаЛогистическая()
	Возврат "Логистическая";
КонецФункции

Функция УпаковкаПотребительская()
	Возврат "Потребительская";
КонецФункции

Функция УпаковкаОбъемноСортовойУчет()
	Возврат "ОбъемноСортовойУчет";
КонецФункции

Функция ВладельцыКодовМаркировки(СсылкаНаОбъект)
	
	Если ЭтоСчетФактура(СсылкаНаОбъект) Тогда
		Результат = ДокументыОснованияСчетаФактуры(СсылкаНаОбъект);
	Иначе
		Результат = Новый Массив;
		Результат.Добавить(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область БиблиотекаИнтеграцииИСМП

// Заполняет в табличной части протоконтента сведения о маркировке с помощью библиотеки интеграции с ИС МП
//
// Параметры:
//  Контент - Структура - Протоконтент в формате приказа 820@.
//  СсылкаНаДокумент - ЛюбаяСсылка - Ссылка основание электронного документа.
//
Процедура ЗаполнитьСведенияОМаркировке820_ИСМП(Контент, СсылкаНаОбъект)
	
	Если НЕ ЕстьИнтеграцияИСМП() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
	ТаблицаУпаковок = ТаблицаУпаковокИСМП(ДокументыПередачи);
	
	Если Не ЗначениеЗаполнено(ТаблицаУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяИнтеграцияИСМП10127() Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_ИСМП10127();
		ТаблицаТоваров = ТаблицаТоваровИСМП820(Контент.Table.Items);
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИКодыОСУИСМП(ТаблицаУпаковок, ТаблицаТоваров, ДокументыПередачи);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		ЗаполнитьСведенияОМаркировкеВКонтенте820_ИСМП10127(Контент, РазвернутаяТаблицаУпаковок);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИСМП(ТаблицаУпаковок);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		ЗаполнитьСведенияОМаркировкеВКонтенте820(Контент, РазвернутаяТаблицаУпаковок);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РазвернутаяТаблицаУпаковок) Тогда
		ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировке736_ИСМП(Контент, СсылкаНаОбъект, ИсходныйДокумент)
	
	Если НЕ ЕстьИнтеграцияИСМП() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
	ТаблицаУпаковок = ТаблицаУпаковокИСМП(ДокументыПередачи);
	
	Если ИспользуетсяИнтеграцияИСМП10127() Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_ИСМП10127();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок_ИСМП10127();
		ТаблицаТоваров = ТаблицаТоваровИСМП736(Контент.InvoiceCorrectionTable.Items, Ложь);
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИКодыОСУИСМП(ТаблицаУпаковок, ТаблицаТоваров, ДокументыПередачи);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
			
			ИсходныеДокументыПередачи = ВладельцыКодовМаркировки(ИсходныйДокумент);
			ТаблицаУпаковокДоИзменения = ТаблицаУпаковокИСМП(ИсходныеДокументыПередачи);
			ИсходныйДокументПередачи = ?(ИсходныеДокументыПередачи.Количество(), ИсходныеДокументыПередачи[0], Неопределено);
			ТаблицаТоваровДоИзменения = ТаблицаТоваровИСМП736(
				Контент.InvoiceCorrectionTable.Items,
				Истина,
				ИсходныйДокументПередачи
			);
			ДанныеШтрихкодовУпаковокДоИзменения = ЧастичноеСодержимоеИКодыОСУИСМП(
				ТаблицаУпаковокДоИзменения,
				ТаблицаТоваровДоИзменения,
				ИсходныеДокументыПередачи
			);
			
			ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковокДоИзменения, ДанныеШтрихкодовУпаковокДоИзменения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736_ИСМП10127(
			Контент,
			ДокументыПередачи,
			РазвернутаяТаблицаУпаковок,
			РазвернутаяТаблицаУпаковокДоИзменения
		);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок();
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИСМП(ТаблицаУпаковок);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
			
			ИсходныеДокументыПередачи = ВладельцыКодовМаркировки(ИсходныйДокумент);
			ТаблицаУпаковокДоИзменения = ТаблицаУпаковокИСМП(ИсходныеДокументыПередачи);
			ДанныеШтрихкодовУпаковокДоИзменения = ЧастичноеСодержимоеИСМП(ТаблицаУпаковокДоИзменения);
			
			ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковокДоИзменения, ДанныеШтрихкодовУпаковокДоИзменения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736(Контент, СсылкаНаОбъект, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШтрихкодовУпаковок) Тогда
		ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаТоваровИСМП820(СтрокиКонтента)
	
	Результат = НоваяТаблицаТоваровИСМП(СтрокиКонтента);
	
	Для Каждого СтрокаКонтента Из СтрокиКонтента Цикл
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокаКонтента.СлужебнаяИнформация;
		
		СтрокаТаблицыТоваров = Результат.Добавить();
		СтрокаТаблицыТоваров.Номенклатура = СлужебнаяИнформацияСтрокиКонтента.Номенклатура;
		СтрокаТаблицыТоваров.Характеристика = СлужебнаяИнформацияСтрокиКонтента.Характеристика;
		СтрокаТаблицыТоваров.Ссылка = СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки;
		СтрокаТаблицыТоваров.Количество = СтрокаКонтента.Quantity;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаТоваровИСМП736(СтрокиКонтента, ИспользоватьКоличествоДоИзменения, ДокументОтгрузкиДоИзменения = Неопределено)
	
	Результат = НоваяТаблицаТоваровИСМП(СтрокиКонтента, ДокументОтгрузкиДоИзменения);
	
	Для Каждого СтрокаКонтента Из СтрокиКонтента Цикл
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокаКонтента.СлужебнаяИнформация;
		
		СтрокаТаблицыТоваров = Результат.Добавить();
		СтрокаТаблицыТоваров.Номенклатура = СлужебнаяИнформацияСтрокиКонтента.Номенклатура;
		СтрокаТаблицыТоваров.Характеристика = СлужебнаяИнформацияСтрокиКонтента.Характеристика;
		
		Если ЗначениеЗаполнено(ДокументОтгрузкиДоИзменения) Тогда
			СтрокаТаблицыТоваров.Ссылка = ДокументОтгрузкиДоИзменения;
		Иначе
			СтрокаТаблицыТоваров.Ссылка = СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки;
		КонецЕсли;
		
		Если ИспользоватьКоличествоДоИзменения Тогда
			СтрокаТаблицыТоваров.Количество = СтрокаКонтента["OriginalValues"].Quantity;
		Иначе
			СтрокаТаблицыТоваров.Количество = СтрокаКонтента["CorrectedValues"].Quantity;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаТоваровИСМП(СтрокиКонтента, ДокументОтгрузкиДоИзменения = Неопределено)
	
	ОписаниеТипаНоменклатура = Новый ОписаниеТипов(Справочники.ТипВсеСсылки());
	ОписаниеТипаХарактеристика = Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип;
	ОписаниеТипаСсылка = Новый ОписаниеТипов(Документы.ТипВсеСсылки());
	
	Если СтрокиКонтента.Количество() Тогда
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокиКонтента[0].СлужебнаяИнформация;
		
		Если ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.Номенклатура) Тогда
			ОписаниеТипаНоменклатура = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.Номенклатура);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.Характеристика) Тогда
			ОписаниеТипаХарактеристика = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.Характеристика);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОтгрузкиДоИзменения) Тогда
			ОписаниеТипаСсылка = ОписаниеТиповЗначения(ДокументОтгрузкиДоИзменения);
		ИначеЕсли ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки) Тогда
			ОписаниеТипаСсылка = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура", ОписаниеТипаНоменклатура);
	Результат.Колонки.Добавить("Характеристика", ОписаниеТипаХарактеристика);
	Результат.Колонки.Добавить("Ссылка", ОписаниеТипаСсылка);
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Возврат Результат;
	
КонецФункции

// Проверяет, встроена ли в конфигурацию библиотека интеграции с ИС МП.
// 
// Возвращаемое значение:
//  Булево - Истина, если подсистема есть.
//
Функция ЕстьИнтеграцияИСМП()
	
	Результат = Ложь;
	
	ОписанияПодсистем = ОписанияПодсистемКонфигурации();
	Если ОписанияПодсистем.Получить("БиблиотекаИнтеграцииИСМП") <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, поддерживает-ли встроенная версия библиотеки интеграции с ИС МП распределение одного кода ОСУ по нескольким строкам
// 
// Возвращаемое значение:
//  Булево - Истина, если библиотека поддерживает функционал.
//
Функция ИспользуетсяИнтеграцияИСМП10127()
	
	Результат = Ложь;
	
	ОписанияПодсистем = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемыБиблиотекиИнтеграцииИСМП = ОписанияПодсистем.Получить("БиблиотекаИнтеграцииИСМП");
	
	Если СравнитьВерсии(ОписаниеПодсистемыБиблиотекиИнтеграцииИСМП.Версия, "10.1.27") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяРасширеннаяВерсияГосИС()
	
	Результат = Ложь;
	
	Подсистема = "ГосИС.БазоваяФункциональность.Расширенная";
	
	Результат = ОбщегоНазначения.ПодсистемаСуществует(Подсистема);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, есть ли у объекта метаданных табличная часть с штрихкодами упаковок товаров.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - проверяемый объект метаданных.
// 
// Возвращаемое значение:
//  Булево - Истина, если у объекта есть табличная часть "ШтрихкодыУпаковок".
//
Функция ЕстьШтрихкодыУпаковокИСМП(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") <> Неопределено);
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу упаковок, сформированную по данным библиотеки интеграции с ИС МП.
//
// Параметры:
//  СсылкаИлиМассив - ЛюбаяСсылка, Массив - ссылки на документы, по которым необходимо получить таблицу упаковок
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок:
//   * Ссылка   - Произвольный - объект-владелец штрихкода
//   * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров
//
Функция ТаблицаУпаковокИСМП(СсылкаИлиМассив)
	
	КоллекцияСсылок = ЗначениеВМассиве(СсылкаИлиМассив);
	
	ВладельцыШтрихкодов = Новый Массив;
	
	ТипыСсылок = Новый Соответствие;
	
	ТекстыЗапросов = Новый Массив;
	
	Для Каждого СсылкаНаОбъект Из КоллекцияСсылок Цикл
		
		Тип = ТипЗнч(СсылкаНаОбъект);
		
		Если ТипыСсылок[Тип] = Неопределено Тогда
			
			МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
			ЕстьШК = ЕстьШтрихкодыУпаковокИСМП(МетаданныеОбъекта);
			
			ТипыСсылок.Вставить(Тип, ЕстьШК);
			
			Если ЕстьШК Тогда
				ТекстЗапросаШК = ТекстЗапросаТаблицыУпаковокИСМП(МетаданныеОбъекта.ПолноеИмя());
				ТекстыЗапросов.Добавить(ТекстЗапросаШК);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипыСсылок[Тип] Тогда
			ВладельцыШтрихкодов.Добавить(СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ТекстыЗапросов) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, РазделительОбъединенияЗапросов());
		Запрос.УстановитьПараметр("ВладельцыШтрихкодов", ВладельцыШтрихкодов);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		КоллекцияТипов = Новый Массив;
		
		Для Каждого Элемент Из ТипыСсылок Цикл
			КоллекцияТипов.Добавить(Элемент.Ключ);
		КонецЦикла;
		
		Результат = Новый ТаблицаЗначений;
		Результат.Колонки.Добавить(
			"Ссылка",
			Новый ОписаниеТипов(КоллекцияТипов)
		);
		Результат.Колонки.Добавить(
			"Штрихкод",
			Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров")
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТаблицыУпаковокИСМП(ПолноеИмяОбъекта)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.ШтрихкодУпаковки КАК Штрихкод
	|ИЗ
	|	&ТЧШтрихкоды КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В (&ВладельцыШтрихкодов)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТЧШтрихкоды", ПолноеИмяОбъекта + ".ШтрихкодыУпаковок");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Разворачивает таблицу транспортных и индивидуальных штрихкодов до номенклатуры, характеристики, серии
//   для дальнейшего сопоставления информации об упаковках с товарной частью.
//   Для транспортных упаковок номенклатура (характеристика, серия)- это номенклатура (характеристика, серия)
//   первого вложенного (на любом уровне) индивидуального штрихкода.
// 
// Параметры:
// 	ТаблицаУпаковок - ТаблицаЗначений - исходная таблица упаковок:
// 	 * Ссылка   - Произвольный - объект-владелец штрихкода
// 	 * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров
// Возвращаемое значение - ТаблицаЗначений - таблица упаковок с товарными данными:
// 	 * Ссылка             - Произвольный - объект-владелец штрихкода - исходная колонка
// 	 * Штрихкод           - СправочникСсылка.ШтрихкодыУпаковокТоваров - ссылка на индивидуальный штрихкод содержимого
// 	 * Номенклатура       - ОпределяемыйТип.Номенклатура - содержимое
// 	 * Характеристика     - ОпределяемыйТип.ХарактеристикаНоменклатуры - содержимое
// 	 * Серия              - ОпределяемыйТип.СерияНоменклатуры - содержимое
// 	 * ЗначениеШтрихкода  - Строка - текстовое представление исходного штрихкода для передачи в ЭДО
// 	 * Обработан          - Булево - признак сопоставления строки товарной части документа
//
Функция ЧастичноеСодержимоеИСМП(ТаблицаУпаковок)
	
	МодульЭлектронноеВзаимодействиеИСМП = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеВзаимодействиеИСМП");
	Результат = МодульЭлектронноеВзаимодействиеИСМП.ЧастичноеСодержимое(ТаблицаУпаковок);
	
	Возврат Результат;
	
КонецФункции

// Разворачивает таблицу транспортных и индивидуальных штрихкодов до номенклатуры, характеристики, серии
//   для дальнейшего сопоставления информации об упаковках с товарной частью.
// Добавляет в таблицу коды ОСУ для строк, по которым коды маркировки не указывались. Считаем что таблица товаров
//   уже соответствует таблице штрихкодов упаковок (с учетом невнесенных ОСУ).
//
// Параметры:
// 	ТаблицаУпаковок - ТаблицаЗначений - исходная таблица упаковок:
// 	 * Ссылка   - Произвольный - объект-владелец штрихкода
// 	 * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкод
//  ТаблицаТоваров	 - ТаблицаЗначений - исходная таблица товаров: 
// 	 * Ссылка         - Произвольный - объект-владелец штрихкода
// 	 * Номенклатура   - ОпределяемыйТип.Номенклатура - номенклатура
// 	 * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика
// 	 * Количество     - Число - количество
//  ПараметрыСканирования - См. ШтрихкодированиеИС.ПараметрыСканирования
// Возвращаемое значение:
//  ТаблицаЗначений - См. ЧастичноеСодержимое
//
Функция ЧастичноеСодержимоеИКодыОСУИСМП(ТаблицаУпаковок, ТаблицаТоваров, ДокументыОснования)
	
	Если ДокументыОснования.Количество() Тогда
		ДокументОснование = ДокументыОснования[0];
	ИначеЕсли ТаблицаТоваров.Количество() Тогда
		ДокументОснование = ТаблицаТоваров[0].Ссылка;
	КонецЕсли;
	
	Если ИспользуетсяРасширеннаяВерсияГосИС() Тогда
		МодульШтрихкодированиеИС = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеОбщегоНазначенияИС");
	Иначе
		МодульШтрихкодированиеИС = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеИС");
	КонецЕсли;
	
	ПараметрыСканирования = МодульШтрихкодированиеИС.ПараметрыСканирования(ДокументОснование);
	МодульЭлектронноеВзаимодействиеИСМП = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеВзаимодействиеИСМП");
	
	Результат = МодульЭлектронноеВзаимодействиеИСМП.ЧастичноеСодержимоеИКодыОСУ(ТаблицаУпаковок
				,ТаблицаТоваров
				,ПараметрыСканирования);
	
	Возврат Результат;
	
КонецФункции

Функция НоваяРазвернутаяТаблицаУпаковок_ИСМП10127()
	
	Результат = НоваяРазвернутаяТаблицаУпаковок();
	
	Результат.Колонки.Добавить("КоличествоВПотребительскойУпаковке", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ШтрихКод");
	
	Возврат Результат;
	
КонецФункции

// Заполняет таблицу кодов средствами типовой библиотеки интеграции с ИС МП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(Результат, ДанныеШтрихкодовУпаковок)
	
	ЕстьВидУпаковки = (ДанныеШтрихкодовУпаковок.Колонки.Найти("ВидУпаковки") <> Неопределено);
	ИсключаемыеСвойства = "";
	
	Если ЕстьВидУпаковки Тогда 
		ИсключаемыеСвойства = "ВидУпаковки";
	КонецЕсли;
	
	ПараметрыНоменклатуры = ПараметрыУчетаНоменклатуры();
	ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокИСМП();
	
	Для Каждого УпаковкаИСМП Из ДанныеШтрихкодовУпаковок Цикл
		
		ВидУпаковкиИСМП = Неопределено;
		Если ЕстьВидУпаковки Тогда
			ВидУпаковкиИСМП = УпаковкаИСМП.ВидУпаковки;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, УпаковкаИСМП, , ИсключаемыеСвойства);
		НоваяСтрока.ВидУпаковки = ВидУпаковкиПоДаннымИСМП(ВидУпаковкиИСМП, ПравилаКонвертацииУпаковок);
		НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатуры.ИспользоватьХарактеристики;
		НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатуры.ИспользоватьСерии;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте820_ИСМП10127(Контент, РазвернутаяТаблицаУпаковок)
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		ТребуемоеКоличество = СтрокаТЧ.Quantity;
		
		Если Не ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			Продолжить;
		КонецЕсли;
		
		// Инициализировать промежуточную структуру с коллекциями кодов маркировки
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		// Найти подходящие кодами маркировки
		ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
		
		// Перенести найденные коды маркировки в строку протоконтента
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.ItemIdentificationNumbers, КодыМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковок, СлужебнаяИнформация, ТребуемоеКоличество)
	
	Для Каждого СтрокаУпаковки Из РазвернутаяТаблицаУпаковок Цикл
		
		Если СтрокаУпаковки.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.Номенклатура <> СлужебнаяИнформация.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьХарактеристики
			И СтрокаУпаковки.Характеристика <> СлужебнаяИнформация.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		
		ВидУпаковки = СтрокаУпаковки.ВидУпаковки;
		
		Если (ВидУпаковки <> УпаковкаОбъемноСортовойУчет() ИЛИ ЗначениеЗаполнено(СтрокаУпаковки.Штрихкод))
			И СтрокаУпаковки.ИспользоватьСерии
			И ЗначениеЗаполнено(СлужебнаяИнформация.Серия)
			И СтрокаУпаковки.Серия <> СлужебнаяИнформация.Серия Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШК = СтрокаУпаковки.ЗначениеШтрихкода;
		
		Если ЗначениеЗаполнено(ЗначениеШК) Тогда
			
			Если ВидУпаковки = УпаковкаЛогистическая() Тогда
				КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаГрупповая() Тогда
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
				
				Если ЗначениеЗаполнено(СтрокаУпаковки.Штрихкод) Тогда
					КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				Иначе
					Если ТребуемоеКоличество > 0 Тогда
						ЗначениеШК = СформироватьКодОСУИзGTIN(ТребуемоеКоличество, СтрокаУпаковки);
						КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
					КонецЕсли;
					
					Прервать;
				КонецЕсли;
				
			Иначе
				КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаУпаковки.Обработан = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736_ИСМП10127(
	Контент,
	ДокументыПередачи,
	РазвернутаяТаблицаУпаковок,
	РазвернутаяТаблицаУпаковокДоИзменения
	)
	
	ЭтоУКД_НаОснованииВозвратаОтКлиента = СредиВладельцевКодовМаркировкиТолькоВозвратыОтКлиента(ДокументыПередачи);
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
						
		//OriginalValues
		ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity;
		ТребуемоеКоличество = ?(ТребуемоеКоличество = Неопределено, 0, ТребуемоеКоличество);
		
		// Инициализировать промежуточную структуру с коллекциями кодов маркировки
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		// Найти подходящие кодами маркировки
		ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки
			, РазвернутаяТаблицаУпаковокДоИзменения
			, СтрокаТЧ.СлужебнаяИнформация
			, ТребуемоеКоличество
		);
		
		// Перенести найденные коды маркировки в строку протоконтента
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировки);
		
		ЭтоПолныйВозвратТовара = ЭтоПолныйВозвратТовара(СтрокаТЧ);
		Если ЭтоПолныйВозвратТовара Тогда
			Продолжить;
		КонецЕсли;
			
		//CorrectedValues
		Если ЭтоУКД_НаОснованииВозвратаОтКлиента Тогда
			
			ЗаполнитьКодыМаркировкиДляВозвратаОтКлиента_ИСМП10127(
				СтрокаТЧ, 
				РазвернутаяТаблицаУпаковок,
				РазвернутаяТаблицаУпаковокДоИзменения
			);
			
		Иначе
			
			ТребуемоеКоличество = СтрокаТЧ.CorrectedValues.Quantity;
			ТребуемоеКоличество = ?(ТребуемоеКоличество = Неопределено, 0, ТребуемоеКоличество);
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки
				, РазвернутаяТаблицаУпаковок
				, СтрокаТЧ.СлужебнаяИнформация
				, ТребуемоеКоличество
			);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует правила преобразования видов упаковок подсистемы ИСМП во внутреннее представление,
// которое используется для заполнения развернутой таблицы упаковок.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки в формате ИСМП.
//   * Значение - Строка - Внутреннее представление вида упаковки.
//
Функция ПравилаКонвертацииУпаковокИСМП()
	
	Результат = Новый Соответствие;

	МетаданныеВидыУпаковокИС = Метаданные.Перечисления.Найти("ВидыУпаковокИС");
	Если МетаданныеВидыУпаковокИС <> Неопределено Тогда
		
		ВидыУпаковокИСМП = Перечисления.ВидыУпаковокИС;
		
		Результат.Вставить(ВидыУпаковокИСМП.Групповая, УпаковкаГрупповая());
		Результат.Вставить(ВидыУпаковокИСМП.Логистическая, УпаковкаЛогистическая());
		Результат.Вставить(ВидыУпаковокИСМП.Потребительская, УпаковкаПотребительская()); 
		
		ЕстьОбъемноСортовойУчет = МетаданныеВидыУпаковокИС.ЗначенияПеречисления.Найти("ОбъемноСортовойУчет") <> Неопределено;
		Если ЕстьОбъемноСортовойУчет Тогда
			Результат.Вставить(ВидыУпаковокИСМП.ОбъемноСортовойУчет, УпаковкаОбъемноСортовойУчет());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает вид упаковки подсистемы ИСМП во внутренее представление.
//
// Параметры:
//  ВидУпаковкиИСМП - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки в формате ИСМП.
//  ПравилаКонвертацииУпаковок - Соответствие - (Необязательный) правила преобразования (см. ПравилаКонвертацииУпаковокИСМП)
// 
// Возвращаемое значение:
//  Строка - Возможные значения описаны функциями УпаковкаПотребительская(), УпаковкаЛогистическая() и УпаковкаГрупповая()
//
Функция ВидУпаковкиПоДаннымИСМП(ВидУпаковкиИСМП, ПравилаКонвертацииУпаковок = Неопределено)
	
	Если ПравилаКонвертацииУпаковок = Неопределено Тогда
		ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокИСМП();
	КонецЕсли;
	
	ЗначениеПоУмолчанию = УпаковкаПотребительская();
	
	Результат = ПравилаКонвертацииУпаковок.Получить(ВидУпаковкиИСМП);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область КонтурМаркировка

// Заполняет в табличной части протоконтента сведения о маркировке с помощью подсистемы "Контур.Маркировка"
//
// Параметры:
//  Контент - Структура - Протоконтент в формате приказа 820@.
//  СсылкаНаДокумент - ЛюбаяСсылка - Ссылка основание электронного документа.
//
Процедура ЗаполнитьСведенияОМаркировке820_КонтурМаркировка(Контент, СсылкаНаОбъект)
	
	ПроверитьПодсистемуКонтурМаркировка();
	
	Если ИспользуетсяКонтурМаркировка33() Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33();
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтента(РазвернутаяТаблицаУпаковок, Контент);
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		ЗаполнитьСведенияОМаркировкеВКонтенте820_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок);
		
		Если ЕстьМаркируемаяПродукция_КонтурМаркировка33(РазвернутаяТаблицаУпаковок) Тогда
			ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
		КонецЕсли;
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(РазвернутаяТаблицаУпаковок, ДокументыПередачи, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		ЗаполнитьСведенияОМаркировкеВКонтенте820(Контент, РазвернутаяТаблицаУпаковок);
		
		Если ЗначениеЗаполнено(РазвернутаяТаблицаУпаковок) Тогда
			ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировке736_КонтурМаркировка(Контент, СсылкаНаОбъект, ИсходныйДокумент)
	
	ПроверитьПодсистемуКонтурМаркировка();
	
	// Получим товарные документы отгрузки до корректировки, если таких документов больше 1,
	// то не будем использовать новый метод маркировки, так как не сможем корректно получить коды по нескольким документам
	Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
		ИсходныеДокументыПередачи = ВладельцыКодовМаркировки(ИсходныйДокумент);
	Иначе
		ИсходныеДокументыПередачи = Новый Массив;
	КонецЕсли;
	
	ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
	
	НесколькоДокументовПередачи = 2;
	
	Если ИспользуетсяКонтурМаркировка310()
		И ИсходныеДокументыПередачи.Количество() < НесколькоДокументовПередачи Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33();
		ОшибкиЗаполнения = Новый Массив;
		
		ЭтоУКДНаОснованииВозвратаОтКлиента = СредиВладельцевКодовМаркировкиТолькоВозвратыОтКлиента(ДокументыПередачи);
		
		ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтентаУКД736(
			РазвернутаяТаблицаУпаковок,
			Контент,
			Неопределено,
			ЭтоУКДНаОснованииВозвратаОтКлиента
		);
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		Если ИсходныеДокументыПередачи.Количество() > 0 Тогда
			
			ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтентаУКД736(
				РазвернутаяТаблицаУпаковокДоИзменения,
				Контент,
				ИсходныеДокументыПередачи[0],
				Ложь
			);
			ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковокДоИзменения, ОшибкиЗаполнения);
			ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка33(
			Контент,
			РазвернутаяТаблицаУпаковок,
			РазвернутаяТаблицаУпаковокДоИзменения,
			ЭтоУКДНаОснованииВозвратаОтКлиента
		);
		
		Если ЕстьМаркируемаяПродукция_КонтурМаркировка33(РазвернутаяТаблицаУпаковок) Тогда
			ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
		КонецЕсли;
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок();
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(РазвернутаяТаблицаУпаковок, ДокументыПередачи, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		Если ИсходныеДокументыПередачи.Количество() > 0 Тогда
			
			ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(
				РазвернутаяТаблицаУпаковокДоИзменения,
				ИсходныеДокументыПередачи,
				ОшибкиЗаполнения
			);
			ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка(
			Контент,
			ДокументыПередачи,
			РазвернутаяТаблицаУпаковок,
			РазвернутаяТаблицаУпаковокДоИзменения
		);
		
		Если ЗначениеЗаполнено(РазвернутаяТаблицаУпаковок) Тогда
			ЗаполнитьВыбытиеИзОборотаМаркируемойПродукции(Контент, СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка(
	Контент,
	ДокументыПередачи,
	РазвернутаяТаблицаУпаковок,
	РазвернутаяТаблицаУпаковокДоИзменения
	)
	
	ЭтоУКД_НаОснованииВозвратаОтКлиента = СредиВладельцевКодовМаркировкиТолькоВозвратыОтКлиента(ДокументыПередачи);
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
						
		//OriginalValues
		ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity;
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки(КодыМаркировки
				, РазвернутаяТаблицаУпаковокДоИзменения
				, СтрокаТЧ.СлужебнаяИнформация
				, ТребуемоеКоличество
			);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
		ЭтоПолныйВозвратТовара = ЭтоПолныйВозвратТовара(СтрокаТЧ);
		
		//CorrectedValues
		Если ЭтоУКД_НаОснованииВозвратаОтКлиента Тогда
			
			Если ЭтоПолныйВозвратТовара Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьКодыМаркировкиДляВозвратаОтКлиента(
				СтрокаТЧ, 
				РазвернутаяТаблицаУпаковок, 
				РазвернутаяТаблицаУпаковокДоИзменения
			);
			
		Иначе
			
			ТребуемоеКоличество = СтрокаТЧ.CorrectedValues.Quantity;
			ТребуемоеКоличество = ?(ТребуемоеКоличество = Неопределено, 0, ТребуемоеКоличество);
			
			Если ЗначениеЗаполнено(ТребуемоеКоличество) ИЛИ ЭтоПолныйВозвратТовара Тогда
			
				// Инициализировать промежуточную структуру с коллекциями кодов маркировки
				КодыМаркировки = НовыйСведенияОМаркировке();
				
				// Найти подходящие кодами маркировки
				ПодобратьКодыМаркировки(КодыМаркировки
					, РазвернутаяТаблицаУпаковок
					, СтрокаТЧ.СлужебнаяИнформация
					, ТребуемоеКоличество
					, ЭтоПолныйВозвратТовара
				);
				
				// Перенести найденные коды маркировки в строку протоконтента
				ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка33(
		Контент,
		РазвернутаяТаблицаУпаковок,
		РазвернутаяТаблицаУпаковокДоИзменения,
		ЭтоУКДНаОснованииВозвратаОтКлиента
	)
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		СтрокаТаблицыУпаковок = РазвернутаяТаблицаУпаковок.Найти(НомерСтроки, "ИндексСтроки");
		
		Если СтрокаТаблицыУпаковок <> Неопределено Тогда
			СведенияОМаркировке = СтрокаТаблицыУпаковок.СведенияОМаркировке;
		Иначе
			СведенияОМаркировке = Неопределено;
		КонецЕсли;
		
		СтрокаТаблицыУпаковокДоИзменения = РазвернутаяТаблицаУпаковокДоИзменения.Найти(НомерСтроки, "ИндексСтроки");
		
		Если СтрокаТаблицыУпаковокДоИзменения <> Неопределено Тогда
			СведенияОМаркировкеДоИзменения = СтрокаТаблицыУпаковокДоИзменения.СведенияОМаркировке;
		Иначе
			СведенияОМаркировкеДоИзменения = Неопределено;
		КонецЕсли;
		
		Если ЭтоУКДНаОснованииВозвратаОтКлиента Тогда
			СведенияОМаркировкеПослеИзменения = СведенияОМаркировкеПередаваемыеПослеВозврата(
				СведенияОМаркировке,
				СведенияОМаркировкеДоИзменения
			);
		Иначе
			СведенияОМаркировкеПослеИзменения = СведенияОМаркировке;
		КонецЕсли;
		
		КодыМаркировки = КодыМаркировкиДляКонтентаПоДаннымКонтурМаркировки33(СведенияОМаркировкеПослеИзменения);
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
		
		Если ЗначениеЗаполнено(КодыМаркировки.НомерПартии) Тогда
			ДополнитьМассивKeyValue(СтрокаТЧ.StructedAdditionalInfos, "ПрПартМаркПосле", КодыМаркировки.НомерПартии);
		КонецЕсли;
		
		КодыМаркировкиДоИзменения = КодыМаркировкиДляКонтентаПоДаннымКонтурМаркировки33(СведенияОМаркировкеДоИзменения);
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировкиДоИзменения);
		
		Если ЗначениеЗаполнено(КодыМаркировкиДоИзменения.НомерПартии) Тогда
			ДополнитьМассивKeyValue(СтрокаТЧ.StructedAdditionalInfos, "ПрПартМаркДо", КодыМаркировкиДоИзменения.НомерПартии);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, что подсистема Контур.Маркировка подключена.
// 
// Возвращаемое значение:
//  Булево - Истина, если подсистема подключена.
//
Функция ЕстьИнтеграцияКонтурМаркировка()
	
	Результат = Метаданные.Подсистемы.Найти("КонтурМаркировка") <> Неопределено
		И Метаданные.ОбщиеМодули.Найти("ВзаимодействиеКонтурМаркировка") <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что подсистема "Контур.Маркировка" установлена.
// Если подсистема не установлена, записывает ошибку в журнал
// и генерирует исключение.
//
Процедура ПроверитьПодсистемуКонтурМаркировка()
	
	Если ЕстьИнтеграцияКонтурМаркировка() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "Подсистема ""Контур.Маркировка"" не подключена!";
	
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации()
		, УровеньЖурналаРегистрации.Ошибка
		,
		,
		, ТекстОшибки);
	
	ВызватьИсключение ТекстОшибки;
	
КонецПроцедуры

Функция ИспользуетсяКонтурМаркировка33()
	
	Результат = Истина;
	НеобходимаяВерсияМодуляМаркировки = "3.3.0";
	
	Попытка
		ВерсияМодуляМаркировки = Вычислить("ВзаимодействиеКонтурМаркировка.ВерсияМодуля()");
	Исключение
		ВерсияМодуляМаркировки = "0.0.0";
	КонецПопытки;
	
	Результат = СравнитьВерсии(ВерсияМодуляМаркировки, НеобходимаяВерсияМодуляМаркировки) >= 0;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяКонтурМаркировка310()
	
	// В версии 3.10 в маркировке исправлена ошибка деления на 0 при полном возврате кодов ОСУ
	
	Результат = Истина;
	НеобходимаяВерсияМодуляМаркировки = "3.10.0";
	
	Попытка
		ВерсияМодуляМаркировки = Вычислить("ВзаимодействиеКонтурМаркировка.ВерсияМодуля()");
	Исключение
		ВерсияМодуляМаркировки = "0.0.0";
	КонецПопытки;
	
	Результат = СравнитьВерсии(ВерсияМодуляМаркировки, НеобходимаяВерсияМодуляМаркировки) >= 0;
	
	Возврат Результат;
	
КонецФункции

// Получает таблицу упаковок, развернутую по номенклатуре, из подсистемы Контур.Маркировка.
// Аналог функции ЧастичноеСодержимоеИСМП.
//
// Параметры:
//  ДокументыПередачи - Массив - коллекция объектов-владельцев кодов.
//  ОшибкиЗаполнения - Массив - (Необязательный) Коллекция ошибок получения кодов (возвращаемый параметр).
// 
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция РазвернутаяТаблицаУпаковокКонтурМаркировка(ДокументыПередачи, ОшибкиЗаполнения)
	
	МодульВзаимодействиеКонтурМаркировка = ОбщегоНазначения.ОбщийМодуль("ВзаимодействиеКонтурМаркировка");
	
	Результат = МодульВзаимодействиеКонтурМаркировка.РазвернутаяТаблицаУпаковок(ДокументыПередачи, ОшибкиЗаполнения);
	
	Возврат Результат;
	
КонецФункции

// Заполняет таблицу кодов по данным подсистемы Контур.Маркировка
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. НоваяРазвернутаяТаблицаУпаковок)
//  ДокументыПередачи - Массив - коллекция объектов-владельцев штрихкодов
//  ОшибкиЗаполнения - Массив - (Необязательный) Коллекция ошибок получения кодов (возвращаемый параметр).
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(Результат, ДокументыПередачи, ОшибкиЗаполнения)
	
	ДанныеШтрихкодовУпаковок = РазвернутаяТаблицаУпаковокКонтурМаркировка(ДокументыПередачи, ОшибкиЗаполнения);
	
	Если Не ЗначениеЗаполнено(ДанныеШтрихкодовУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиШтрихкодов = ДанныеШтрихкодовУпаковок.Колонки;
	ЕстьПараметрыНоменклатуры = (КолонкиШтрихкодов.Найти("ИспользоватьХарактеристики") <> Неопределено);
	ПараметрыНоменклатурыПоУмолчанию = ПараметрыУчетаНоменклатуры();
	ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокКонтурМаркировка();
	
	Для Каждого УпаковкаКМ Из ДанныеШтрихкодовУпаковок Цикл
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, УпаковкаКМ);
		
		НоваяСтрока.ВидУпаковки = ВидУпаковкиПоДаннымКонтурМаркировка(УпаковкаКМ.ВидУпаковки, ПравилаКонвертацииУпаковок);
		
		Если Не ЕстьПараметрыНоменклатуры Тогда
			НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатурыПоУмолчанию.ИспользоватьХарактеристики;
			НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатурыПоУмолчанию.ИспользоватьСерии;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33()
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипЧисло5 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 0));
	ТипЧисло15_3 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 3));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИндексСтроки", ТипЧисло5);
	Результат.Колонки.Добавить("Количество", ТипЧисло15_3);
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Серия");
	Результат.Колонки.Добавить("Упаковка");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("ПервичныйДокумент");
	Результат.Колонки.Добавить("СведенияОМаркировке");
	Результат.Колонки.Добавить("КодТоварнойГруппы", ТипЧисло);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтента(РазвернутаяТаблицаУпаковок, Контент)
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		СлужебнаяИнформацияСтрокиТЧ = СтрокаТЧ.СлужебнаяИнформация;
		
		СтрокаТаблицыУпаковок = РазвернутаяТаблицаУпаковок.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыУпаковок, СлужебнаяИнформацияСтрокиТЧ);
		
		СтрокаТаблицыУпаковок.ИндексСтроки = НомерСтроки;
		СтрокаТаблицыУпаковок.Количество = СтрокаТЧ.Quantity;
		СтрокаТаблицыУпаковок.ПервичныйДокумент = СлужебнаяИнформацияСтрокиТЧ.ДокументОтгрузки;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтентаУКД736(
	РазвернутаяТаблицаУпаковок,
	Контент,
	ИсходныйДокумент,
	ЭтоУКДНаОснованииВозвратаОтКлиента)
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СлужебнаяИнформацияСтрокиТЧ = СтрокаТЧ.СлужебнаяИнформация;
		
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
			КоличествоПоСтроке = ПривестиКЧислу(СтрокаТЧ["OriginalValues"].Quantity);
			ПервичныйДокумент = ИсходныйДокумент;
		ИначеЕсли ЭтоУКДНаОснованииВозвратаОтКлиента Тогда
			КоличествоПоСтроке = ПривестиКЧислу(СтрокаТЧ["OriginalValues"].Quantity)
				- ПривестиКЧислу(СтрокаТЧ["CorrectedValues"].Quantity);
			ПервичныйДокумент = СлужебнаяИнформацияСтрокиТЧ.ДокументОтгрузки;
		Иначе
			КоличествоПоСтроке = ПривестиКЧислу(СтрокаТЧ["CorrectedValues"].Quantity);
			ПервичныйДокумент = СлужебнаяИнформацияСтрокиТЧ.ДокументОтгрузки;
		КонецЕсли;
		
		Если КоличествоПоСтроке = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыУпаковок = РазвернутаяТаблицаУпаковок.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыУпаковок, СлужебнаяИнформацияСтрокиТЧ);
		
		СтрокаТаблицыУпаковок.ИндексСтроки = НомерСтроки;
		СтрокаТаблицыУпаковок.Количество = КоличествоПоСтроке;
		СтрокаТаблицыУпаковок.ПервичныйДокумент = ПервичныйДокумент;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения)
	
	МодульВзаимодействиеКонтурМаркировка = ОбщегоНазначения.ОбщийМодуль("ВзаимодействиеКонтурМаркировка");
	
	МодульВзаимодействиеКонтурМаркировка.ЗаполнитьСведенияОМаркировке(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте820_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок)
	
	ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
	УпаковкаГрупповая = ВидыУпаковокКМ.Групповая;
	УпаковкаЛогистическая = ВидыУпаковокКМ.Логистическая;
	УпаковкаОбъемноСортовойУчет = ВидыУпаковокКМ.ОбъемноСортовойУчет;
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		СтрокаТаблицы = РазвернутаяТаблицаУпаковок.Найти(НомерСтроки, "ИндексСтроки");
		СведенияОМаркировке = СтрокаТаблицы.СведенияОМаркировке; // ЗначениеШтрихкода - Строка, ВидУпаковки - Перечисления.КонтурМаркировка_ВидыУпаковок, GTIN - Строка, Количество - Число
		
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		Для Каждого СведенияОКоде Из СведенияОМаркировке Цикл
			
			ВидУпаковки = СведенияОКоде.ВидУпаковки;
			ЗначениеШК = СведенияОКоде.ЗначениеШтрихкода;
			
			Если ВидУпаковки = УпаковкаЛогистическая Тогда
				
				КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
				
			ИначеЕсли ВидУпаковки = УпаковкаГрупповая Тогда
				
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				
			ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет Тогда
				
				ЗначениеШК = СформироватьКодОСУ_КонтурМаркировка33(СведенияОКоде);
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				
			Иначе
				КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.ItemIdentificationNumbers, КодыМаркировки);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СведенияОМаркировкеПередаваемыеПослеВозврата(СведенияОМаркировке, СведенияОМаркировкеДоИзменения)
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(СведенияОМаркировкеДоИзменения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат СведенияОМаркировкеДоИзменения;
	КонецЕсли;
	
	// Коды ОСУ не совпадают из-за количества в самом коде ОСУ
	// так же СведенияОМаркировке содержит только одну строку
	СтрокаМаркировки = СведенияОМаркировке[0];
	
	ЭтоКодОСУ = СтрокаМаркировки.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.ОбъемноСортовойУчет;
	
	Если ЭтоКодОСУ Тогда
		
		СтрокаМаркировкиДоИзменения = СведенияОМаркировкеДоИзменения[0];
		
		СтрокаМаркировки.Количество = СтрокаМаркировкиДоИзменения.Количество - СтрокаМаркировки.Количество;
		
		Результат = СведенияОМаркировке;
		
	Иначе
		
		ВозвращенныеКоды = Новый СписокЗначений;
		ВозвращенныеКоды.ЗагрузитьЗначения(СведенияОМаркировке.ВыгрузитьКолонку("ЗначениеШтрихкода"));
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(СведенияОМаркировкеДоИзменения);
		
		НовыйОтбор = ПостроительЗапроса.Отбор.Добавить("ЗначениеШтрихкода");
		НовыйОтбор.Использование = Истина;
		НовыйОтбор.ВидСравнения = ВидСравнения.НеВСписке;
		НовыйОтбор.Значение = ВозвращенныеКоды;
		
		Результат = ПостроительЗапроса.Результат.Выгрузить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыМаркировкиДляКонтентаПоДаннымКонтурМаркировки33(СведенияОМаркировке)
	
	Результат = НовыйСведенияОМаркировке();
	
	Если НЕ ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
	УпаковкаГрупповая = ВидыУпаковокКМ.Групповая;
	УпаковкаЛогистическая = ВидыУпаковокКМ.Логистическая;
	УпаковкаОбъемноСортовойУчет = ВидыУпаковокКМ.ОбъемноСортовойУчет;
	
	ЕстьИнформацияПоПартиям = Неопределено;
	
	Для Каждого СведенияОКоде Из СведенияОМаркировке Цикл
		
		ВидУпаковки = СведенияОКоде.ВидУпаковки;
		ЗначениеШК = СведенияОКоде.ЗначениеШтрихкода;
		
		Если ВидУпаковки = УпаковкаЛогистическая Тогда
			
			Результат.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			
		ИначеЕсли ВидУпаковки = УпаковкаГрупповая Тогда
			
			Результат.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			
		ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет Тогда
			
			ЗначениеШК = СформироватьКодОСУ_КонтурМаркировка33(СведенияОКоде);
			Результат.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			
			Если ЕстьИнформацияПоПартиям = Неопределено Тогда
				ЕстьИнформацияПоПартиям = НЕ СведенияОМаркировке.Колонки.Найти("НомерПартии") = Неопределено;
			КонецЕсли;
			
			Если ЕстьИнформацияПоПартиям Тогда
				Результат.НомерПартии = СведенияОКоде.НомерПартии;
			КонецЕсли;
			
		Иначе
			Результат.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьКодОСУ_КонтурМаркировка33(СведенияОКоде)
	
	Результат = СтрШаблон("%1%2%3%4",
		"02",
		СведенияОКоде.GTIN,
		"37",
		Формат(СведенияОКоде.Количество, "ЧДЦ=0; ЧН=0; ЧГ=;"));
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьМаркируемаяПродукция_КонтурМаркировка33(РазвернутаяТаблицаУпаковок)
	
	Результат = Ложь;
	
	ТипТаблицаЗначений = Тип("ТаблицаЗначений");
	
	Для Каждого СтрокаТаблицыУпаковок Из РазвернутаяТаблицаУпаковок Цикл
		
		СведенияОМаркировке = СтрокаТаблицыУпаковок.СведенияОМаркировке;
		
		Если ТипЗнч(СведенияОМаркировке) = ТипТаблицаЗначений
			И СведенияОМаркировке.Количество() > 0 Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, КоллекцияОшибок)
	
	Если Не ЗначениеЗаполнено(КоллекцияОшибок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Ошибка Из КоллекцияОшибок Цикл
		
		ТекстОшибки = "<Контур.Маркировка> " + Ошибка.ТекстОшибки;
		СсылкаНаОбъект = Ошибка.ДокументМаркировки;
		
		МетодСервера(, "ДобавитьОшибкуВалидации"
			, Контент.ОшибкиВДанных
			, ТекстОшибки
			, СсылкаНаОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует правила преобразования видов упаковок подсистемы КонтурМаркировка во внутреннее представление,
// которое используется для заполнения развернутой таблицы упаковок.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки в формате КонтурМаркировка.
//   * Значение - Строка - Внутреннее представление вида упаковки.
//
Функция ПравилаКонвертацииУпаковокКонтурМаркировка()
	
	Результат = Новый Соответствие;

	МетаданныеВидыУпаковокКонтурМаркировка = Метаданные.Перечисления.Найти("КонтурМаркировка_ВидыУпаковок");
	Если МетаданныеВидыУпаковокКонтурМаркировка <> Неопределено Тогда
		
		ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
		
		Результат.Вставить(ВидыУпаковокКМ.Групповая, УпаковкаГрупповая());
		Результат.Вставить(ВидыУпаковокКМ.Логистическая, УпаковкаЛогистическая());
		Результат.Вставить(ВидыУпаковокКМ.Потребительская, УпаковкаПотребительская()); 
		
		ЕстьОбъемноСортовойУчет = МетаданныеВидыУпаковокКонтурМаркировка.ЗначенияПеречисления.Найти("ОбъемноСортовойУчет") <> Неопределено;
		Если ЕстьОбъемноСортовойУчет Тогда
			Результат.Вставить(ВидыУпаковокКМ.ОбъемноСортовойУчет, УпаковкаОбъемноСортовойУчет());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает вид упаковки подсистемы КонтурМаркировка во внутренее представление.
//
// Параметры:
//  ВидУпаковкиКМ - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки в формате КМ.
//  ПравилаКонвертацииУпаковок - Соответствие - (Необязательный) правила преобразования (см. ПравилаКонвертацииУпаковокКонтурМаркировка)
// 
// Возвращаемое значение:
//  Строка - Возможные значения описаны функциями УпаковкаПотребительская(), УпаковкаЛогистическая() и УпаковкаГрупповая()
//
Функция ВидУпаковкиПоДаннымКонтурМаркировка(ВидУпаковкиКМ, ПравилаКонвертацииУпаковок = Неопределено)
	
	Если ПравилаКонвертацииУпаковок = Неопределено Тогда
		ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокКонтурМаркировка();
	КонецЕсли;
	
	ЗначениеПоУмолчанию = УпаковкаПотребительская();
	
	Результат = ПравилаКонвертацииУпаковок.Получить(ВидУпаковкиКМ);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
//{ СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

	Функция ПолучитьОписаниеТиповСтрокой(ЗначениеЭл)
		
		СтрЗаменТипов = Новый Структура("Справочник,Документ,Перечисление", "СправочникСсылка", "ДокументСсылка", "ПеречислениеСсылка");
		
		ТипКолонки = ТипЗнч(ЗначениеЭл);
		МассивТ= Новый массив;
		
		МД = метаданные.найтипотипу(типзнч(ЗначениеЭл));
		Если МД = Неопределено Тогда
			ПолноеИмяТипа = Строка(ТипЗнч(ЗначениеЭл));
		Иначе
			ПолноеИмяТипа = МД.ПолноеИмя();
			
			Для Каждого стрхх из СтрЗаменТипов Цикл
				Если Найти(ПолноеИмяТипа, стрхх.Ключ) <> 0 Тогда
					ПолноеИмяТипа = СтрЗаменить(ПолноеИмяТипа, стрхх.Ключ, стрхх.Значение);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПолноеИмяТипа = "Не определено" Тогда
			ПолноеИмяТипа = "Строка"; //проверить - заглушка пока!!!
		КонецЕсли;
		
		Возврат ПолноеИмяТипа;
		
	КонецФункции	
	
	Функция ЭтоКСФ(СсылкаНаОбъект) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЭтоКСФ", СсылкаНаОбъект);
		
	КонецФункции
	
	Функция ЭтоНакладная(СсылкаНаОбъект) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЭтоНакладная", СсылкаНаОбъект);
		
	КонецФункции	
	
	Функция ЭтоСчетНаОплату(СсылкаНаОбъект) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЭтоСчетНаОплату", СсылкаНаОбъект);
		
	КонецФункции
	
	Функция ЭтоЗаказПокупателя(СсылкаНаОбъект) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЭтоЗаказПокупателя", СсылкаНаОбъект);
		
	КонецФункции
	
	Функция ЭтоКорректировкаРеализации(СсылкаНаОбъект) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ЭтоКорректировкаРеализации", СсылкаНаОбъект);
		
	КонецФункции
	
	Функция НайтиСтрануПоКодуВКлассификаторе(КодСтраны) Экспорт
		
		ТаблицаОКСМ= МетодСервера("Модуль_ИнтеграцияУниверсальный", "ВернутьТаблицуОКСМ");
		
		СтрокаКлассификатора= ТаблицаОКСМ.Найти(КодСтраны, "Код");
		Если СтрокаКлассификатора = Неопределено Тогда
			Возврат "";
		Иначе
			Возврат СтрокаКлассификатора.Наименование; 
		КонецЕсли;
		
	КонецФункции
	
	Функция ВернутьТаблицуОКСМ() Экспорт
		
		Макет= Справочники.СтраныМира.ПолучитьМакет("Классификатор");
	
		Чтение= Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
	
		Возврат СериализаторXDTO.ПрочитатьXML(Чтение);
		
	КонецФункции
	
	Функция НайтиСтрануПоКоду(КодСтраны) Экспорт
		
		Возврат Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
		
	КонецФункции
	
	Функция ВернутьСсылкуНаГТД(НомерГТД, СтранаПроисхождения) Экспорт
		
		ЭлементСсылкаНомерГТД= Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
		
		Если ЗначениеЗаполнено(ЭлементСсылкаНомерГТД) = Ложь Тогда
			НовыйЭлемент= Справочники.НомераГТД.СоздатьЭлемент();
			
			НовыйЭлемент.Код= НомерГТД;
			Если ПараметрыКлиентСервер.МаркерКонфигурации = "УТ11" Тогда
				НовыйЭлемент.СтранаПроисхождения= СтранаПроисхождения;
			КонецЕсли;
			НовыйЭлемент.Записать();
			
			ЭлементСсылкаНомерГТД= НовыйЭлемент.Ссылка; 
		КонецЕсли;
		
		Возврат ЭлементСсылкаНомерГТД;
		
	КонецФункции
	
	Функция ПустыеЗначенияРеквизита(ИмяРеквизита) Экспорт
		
		Результат = Новый Массив;
		
		МетаданныеРеквизита = Метаданные.НайтиПоПолномуИмени(ИмяРеквизита);
		
		МассивТипов = МетаданныеРеквизита.Тип.Типы();
		
		Для каждого Тип Из МассивТипов Цикл
			ПустоеЗначение = ПустоеЗначениеТипа(Тип);
			Результат.Добавить(ПустоеЗначение);
		КонецЦикла;
		
		Если Результат.Количество() > 1 Тогда
			Результат.Добавить(Неопределено);
		КонецЕсли;
		
		Результат = Новый ФиксированныйМассив(Результат);
		
		Возврат Результат;
		
	КонецФункции
	
	// Предназначена для получения пустого значения заданного типа:
	//	примитивного, или ссылочного. Используется
	//
	// Параметры:
	//	ЗаданныйТип - Тип, Строка - Тип пустого значения или строка с его идентификатором.
	//
	Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт
		
		Если ЗаданныйТип = Тип("Число") Тогда
			
			Результат = 0;
			
		ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
			
			Результат = "";
			
		ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
			
			Результат = '00010101';
			
		ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
			
			Результат = Ложь;
			
		Иначе
			
			Результат = Новый (ЗаданныйТип);
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции
	
	Функция ИмяФайлаПечатнойФормы(ИмяДокумента, НомерДокумента, ДатаДокумента) Экспорт 
		
		НормализованныйНомер = ЗаменитьНедопустимыеСимволы(НомерДокумента);
		
		Возврат ИмяДокумента + " №" + НормализованныйНомер + " от " + Формат(ДатаДокумента, "ДЛФ=Д") + ".pdf"; 
					
	КонецФункции
	
	Функция ЗаменитьНедопустимыеСимволы(НомерДокумента) Экспорт 
		
		Результат = НомерДокумента;
		
		НедопустимыеЗнаки = "\/:*?""<>|";
		
		Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
			
			ТекСимвол = Лев(НедопустимыеЗнаки, 1);
			Если Найти(Результат, ТекСимвол) <> 0 Тогда
				Результат = СтрЗаменить(Результат, ТекСимвол, "_");
			КонецЕсли;
			НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
			
		КонецЦикла;
		
		Возврат Результат;
		
	КонецФункции
	
	Функция МаркерКонфигурацииОпределен()
		
		Результат = ЗначениеЗаполнено(ПараметрыКлиентСервер.МаркерКонфигурации);
		
		Возврат Результат;
		
	КонецФункции
	
	Функция СредиВладельцевКодовМаркировкиТолькоВозвратыОтКлиента(КоллекцияВладельцев)
		
		Результат = Истина;
		
		Для Каждого ЭлементКоллекции Из КоллекцияВладельцев Цикл
			
			ЭтоВозвратТовараОтКлиента = МетодСервера(ИмяМодуляИнтеграции(), "ЭтоВозвратТоваровОтКлиента", ЭлементКоллекции);
			
			Если НЕ ЭтоВозвратТовараОтКлиента Тогда
				
				Результат = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
						
		Возврат Результат;
		
	КонецФункции

//} СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ ПОЛУЧЕНИЕ ДАННЫХ

	Функция ПолучитьТипЦенПоДоговору(ДоговорКонтрагента) Экспорт
		
		Если ПараметрыКлиентСервер.МаркерКонфигурации = "БП30" Тогда
			Если ЗначениеЗаполнено(ДоговорКонтрагента) = Истина Тогда
				ТипЦен= ДоговорКонтрагента.ТипЦен;
			Иначе
				ТипЦен= Неопределено;
			КонецЕсли;
		Иначе
			ТипЦен= Неопределено;
		КонецЕсли;
		
		Возврат ТипЦен;
		
	КонецФункции
	
	Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ДокументСсылка) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию", ДокументСсылка);	
		
	КонецФункции
	
	Функция ПолучитьДокОснованиеКорректировкиРеализации(ДокументСсылка) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ПолучитьДокОснованиеКорректировкиРеализации", ДокументСсылка);
		
	КонецФункции
	
	Функция ПолучитьЗаказПокупателяНаОснованииРТУ(ДокументСсылка) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ПолучитьЗаказПокупателяНаОснованииРТУ", ДокументСсылка); 
		
	КонецФункции
	
	Функция ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(СчетФактура) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному", СчетФактура);
		
	КонецФункции
	
	Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СчетСсылка) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ПолучитьМассивСсылокРТУПоСчетуНаОплату", СчетСсылка);
		
	КонецФункции
	
	Функция ПолучитьСФОснованиеПоИСФ_КСФ(ДокументСсылка) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ПолучитьСФОснованиеПоИСФ_КСФ", ДокументСсылка);  	
		
	КонецФункции
	
	Функция ПолучитьСчетНаОплатуНаОснованииРТУ(ДокументСсылка) Экспорт
		
		Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "ПолучитьСчетНаОплатуНаОснованииРТУ", ДокументСсылка); 
		
	КонецФункции
	
	Функция ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(Организация) Экспорт
		
		Результат = "";
		
		Если ЗначениеЗаполнено(Организация.СвидетельствоСерияНомер) И ЗначениеЗаполнено(Организация.СвидетельствоДатавыдачи) Тогда 
			Результат = Организация.СвидетельствоСерияНомер + " от " + Формат(Организация.СвидетельствоДатавыдачи, "ДФ=dd.MM.yyyy");
		Иначе
			Если МетодСервера(, "ЕстьМетаданныеКонфигурации_ДД", "Справочники.Организации.Реквизиты.ДатаРегистрации") Тогда
				Если ЗначениеЗаполнено(Организация.ДатаРегистрации) Тогда
					Результат = "Лист записи ЕГРИП от " + Формат(Организация.ДатаРегистрации, "ДФ=dd.MM.yyyy");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции

	Функция ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект) Экспорт
		
		Результат= Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст = МетодСервера(
			ПараметрыКлиентСервер.ИмяФормыИнтеграции,
			"ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного"
		);
		
		Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
		
		РезультатЗапроса = Запрос.Выполнить();
		Запрос = Неопределено;
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			РезультатЗапроса = Неопределено;
			
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
					Результат.Добавить(Выборка.ДокументОснование);
				КонецЕсли; 
			КонецЦикла;
			
		КонецЕсли; 
		
		Возврат Результат;
	
	КонецФункции
	
//} ПОЛУЧЕНИЕ ДАННЫХ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ РАБОТА С КОНТЕНТОМ

	////////////////////////////////////////////////////////////////////////////////
	//{ ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
		// Возвращает структуру, в которой Ключ - наименование параметра типового метода печати, 
		// а Значение - значение параметра типового метода печати
		//
		// Возвращаемое значение:
		//   Структура
		//
		Функция НовыйПараметрыТиповогоМетодаПечати()
			
			Результат = Новый Структура("МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода");
			
			Результат.МассивОбъектов 		= Новый Массив;
			Результат.ПараметрыПечати 		= Новый Структура;
			Результат.КоллекцияПечатныхФорм	= НовыйКоллекцияПечатныхФормДляПечатиДокумента();
			Результат.ОбъектыПечати			= Новый СписокЗначений;
			Результат.ПараметрыВывода		= Новый Структура;
						
			Возврат Результат;			
			
		КонецФункции //НовыйПараметрыТиповогоМетодаПечати()
		
		// Метод является констркутором служебной коллекции "КоллекцияПечатныхФорм"
		// 
		// Возвращаемое значение:
		//   - ТаблицаЗначений
		//
		Функция НовыйКоллекцияПечатныхФормДляПечатиДокумента()
			
			КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
			
			КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
			КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
			КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
			КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
			КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
			КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
			КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
			КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
			
			Возврат КоллекцияПечатныхФорм;
			
		КонецФункции // НовыйКоллекцияПечатныхФормДляПечатиДокумента()


		// Определяет содержимое результата визуализации счета на оплату для всех интеграционных модулей
		// 
		// Возвращаемое значение:
		//   Структура 
		//
		Функция НовыйРезультатВизуализацииСчетаНаОплату() Экспорт
			
			Результат = Новый Структура();
			
			Результат.Вставить("Таблица");
			Результат.Вставить("СписокОшибок");
			Результат.Вставить("ИмяФайла");
			Результат.Вставить("Дата");
			Результат.Вставить("Номер");
			Результат.Вставить("Сумма");
			Результат.Вставить("СуммаНДС");
			Результат.Вставить("ДокументБезНДС");
			
			Возврат Результат;
			
		КонецФункции //НовыйРезультатВизуализацииСчетаНаОплату()
		
		// Определяет содержимое результата визуализации сверки взаиморасчетов для всех интеграционных модулей
		// 
		// Возвращаемое значение:
		//   Структура 
		//
		Функция НовыйРезультатВизуализацииАктаСверки() Экспорт
			
			Возврат Новый Структура("Таблица, СписокОшибок, ИмяФайла, Дата, Номер, Сумма, СуммаНДС");
								
		КонецФункции //НовыйРезультатВизуализацииАктаСверки()
	
		// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату
		//	Параметры:
		//  	ДокССылка	- ДокументСсылка	- Ссылка на документ, по которому формируется печатная форма
		// 
		//	Возвращаемое значение:
		//   	Структура
		//
		Функция РезультатВизуализацииСчетаНаОплату(ДокССылка, ПараметрыОтправкиНаСогласование =  Неопределено, ФИОПодписанта = "") Экспорт
			
			ИДСвойства = МетодСервера(, "ИдентификаторСвойстваСтандартнаяФормаСчетаНаОплату");
			СтандартнаяФормаСчетаНаОплату = МетодСервера(, "ПолучитьЗначениеСвойства", ДокСсылка.Организация, ИДСвойства);
	
			Если СтандартнаяФормаСчетаНаОплату = Истина
				И ЭтоСчетНаОплату(ДокССылка) Тогда
				
				Результат = РезультатВизуализацииСчетаНаОплатуСредствамиКонфигурации(ДокСсылка);
			Иначе 
				
				Результат = МетодСервера(ИмяМодуляИнтеграции(), "РезультатВизуализацииСчетаНаОплатуСредствамиДиадок", ДокССылка, ПараметрыОтправкиНаСогласование, ФИОПодписанта);
			КонецЕсли;
			
			Если ТипЗнч(Результат.Таблица) = Тип("ТабличныйДокумент") Тогда
				Результат.Таблица.Автомасштаб = Истина;
			КонецЕсли;
			
			Возврат Результат;
			
		КонецФункции //РезультатВизуализацииСчетаНаОплату()
		
		// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату. 
		// Табличный документ формируется типовым механизмом конфигурации.
		//
		// Параметры:
		//  СчетНаОплату - ДокументСсылка	- документ, на основании которого формируем печатную форму 
		// 
		// Возвращаемое значение:
		//   Структура
		//
		Функция РезультатВизуализацииСчетаНаОплатуСредствамиКонфигурации(СчетНаОплату) Экспорт 
			
			Перем МенеджерПечати;
			
			ПараметрыМетодаПечати = НовыйПараметрыТиповогоМетодаПечати();
			ПараметрыМетодаПечати.МассивОбъектов.Добавить(СчетНаОплату);
			
			ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати);
			
			Если МенеджерПечати = Неопределено Тогда
				ВызватьИсключение "Не удалось определить менеджер печати для сформирования печатной формы счета на оплату по документу " + СчетНаОплату;
			КонецЕсли;
			
			МенеджерПечати.Печать(	ПараметрыМетодаПечати.МассивОбъектов, 
									ПараметрыМетодаПечати.ПараметрыПечати, 
									ПараметрыМетодаПечати.КоллекцияПечатныхФорм, 
									ПараметрыМетодаПечати.ОбъектыПечати, 
									ПараметрыМетодаПечати.ПараметрыВывода	);
			
			Для Каждого Стр Из ПараметрыМетодаПечати.КоллекцияПечатныхФорм Цикл
				Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
					ТабличныйДокумент = Стр.ТабличныйДокумент;
				КонецЕсли;
			КонецЦикла;
			
			Если ТабличныйДокумент = Неопределено Тогда
				ВызватьИсключение "Не удалось сформировать печатную форму счета на оплату по документу " + СчетНаОплату;
			КонецЕсли;
			
			УстановитьПоляТабличногоДокумента(ТабличныйДокумент);
			
			ОписаниеДокумента = ОписаниеПрикладногоДокумента(СчетНаОплату);
			ИндексОП = "";
			
			ДатаНомер = ДатаНомерДокумента(ОписаниеДокумента, ИндексОП);
			
			Результат = НовыйРезультатВизуализацииСчетаНаОплату();
			
			Результат.Таблица 		= ТабличныйДокумент;
			Результат.СписокОшибок 	= ""; 
			Результат.ИмяФайла 		= ИмяФайлаПечатнойФормы("Счет", ДатаНомер.НомерДокумента, ДатаНомер.ДатаДокумента);
			Результат.Дата 			= ДатаНомер.ДатаДокумента;
			Результат.Номер 		= ДатаНомер.НомерДокумента;
			
			ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Результат);
			
			Возврат Результат;
			
		КонецФункции //РезультатВизуализацииСчетаНаОплатуСредствамиКонфигурации()
		
		// Дозаполняет мету неформализованного счета на оплату по данным интеграционного модуля
		//
		// Параметры:
		//  СчетНаОплату - ДокументСсылка	- документ, на основании которого формируем печатную форму 
		//  Мета		 - Структура		- см. метод "НовыйРезультатВизуализацииСчетаНаОплату"
		//
		Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета)
			
			МетодСервера(ИмяМодуляИнтеграции(), "ПриЗаполненииМетыНеформализованногоСчетаНаОплату", СчетНаОплату, Мета);
			
		КонецПроцедуры //ПриЗаполненииМетыНеформализованногоСчетаНаОплату()
		
		// Определяет менеждер печати и значения параметров метода печати, характерные для конкретной конфигурации 1С
		//
		// Параметры:
		//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
		//  ПараметрыМетодаПечати	 - Структура 		- См. метод "НовыйПараметрыТиповогоМетодаПечати"
		//
		Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати)
			
			МетодСервера(ИмяМодуляИнтеграции(), "ПередФормированиемПечатнойФормыСчетаНаОплату", МенеджерПечати, ПараметрыМетодаПечати);
			
		КонецПроцедуры
		
				// Формирует структуру с данными, которые необходимы для визуализации ПФ сверки взаиморасчетов, используя типовые механизмы конфигурации 1С.
		//	Параметры:
		//  	ДокументСверкиСсылка	- ДокументСсылка	- Ссылка на документ, по которому формируется печатная форма
		//
		//	Возвращаемое значение:
		//   	Структура
		//
		Функция РезультатВизуализацииАктаСверки(ДокументСверкиСсылка, ПараметрыОтправкиНаСогласование = Неопределено, ФИОПодписанта = "") Экспорт

			Перем МенеджерПечати;

			ПараметрыМетодаПечати = НовыйПараметрыТиповогоМетодаПечати();
			ПараметрыМетодаПечати.МассивОбъектов.Добавить(ДокументСверкиСсылка);

			ПередФормированиемПечатнойФормыСверкиВзаиморасчетов(МенеджерПечати, ПараметрыМетодаПечати);

			Если МенеджерПечати = Неопределено Тогда
				ВызватьИсключение "Не удалось определить менеджер печати для формирования печатной формы сверки взаиморасчетов по документу " + ДокументСверкиСсылка;
			КонецЕсли;

			МенеджерПечати.Печать(
				ПараметрыМетодаПечати.МассивОбъектов,
				ПараметрыМетодаПечати.ПараметрыПечати,
				ПараметрыМетодаПечати.КоллекцияПечатныхФорм,
				ПараметрыМетодаПечати.ОбъектыПечати,
				ПараметрыМетодаПечати.ПараметрыВывода);

			Для Каждого ЭлементТЗ Из ПараметрыМетодаПечати.КоллекцияПечатныхФорм Цикл
				Если ТипЗнч(ЭлементТЗ.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
					ТабличныйДокумент = ЭлементТЗ.ТабличныйДокумент;
				КонецЕсли;
			КонецЦикла;

			Если ТабличныйДокумент = Неопределено Тогда
				ВызватьИсключение "Не удалось сформировать печатную форму сверки взаиморасчетов по документу " + ДокументСверкиСсылка;
			КонецЕсли;

			УстановитьПоляТабличногоДокумента(ТабличныйДокумент);

			Результат = НовыйРезультатВизуализацииАктаСверки();

			Результат.Вставить("Таблица", ТабличныйДокумент);
			Результат.Вставить("СписокОшибок", "");
			Результат.Вставить("ИмяФайла", ИмяФайлаПечатнойФормы("Акт сверки", ДокументСверкиСсылка.Номер, ДокументСверкиСсылка.Дата));
			Результат.Вставить("Дата", ДокументСверкиСсылка.Дата);
			Результат.Вставить("Номер", ДокументСверкиСсылка.Номер);
			Результат.Вставить("Сумма", "");
			Результат.Вставить("СуммаНДС", "");

			УбратьПодписьИПечать(Результат.Таблица);

			Возврат Результат;

		КонецФункции // РезультатВизуализацииАктаСверки()
		
		Процедура УбратьПодписьИПечать(ТабличныйДокумент)
	
			Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
				Если Рисунок.ТипРисунка = ТипРисункаТабличногоДокумента.Картинка
					И Найти(Рисунок.Имя, "_Документ_") > 0 Тогда
					Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				КонецЕсли;
			КонецЦикла;
	
		КонецПроцедуры

		
		Процедура УстановитьПоляТабличногоДокумента(ТабДокумент)
			
			Если ТипЗнч(ТабДокумент) <> Тип("ТабличныйДокумент") Тогда
				Возврат;
			КонецЕсли;
			
			ТабДокумент.ПолеСверху = 5;
			ТабДокумент.ПолеСлева = 5;
			ТабДокумент.ПолеСнизу = 5;
			ТабДокумент.ПолеСправа = 5;
			
			ТабДокумент.АвтоМасштаб = Истина;
			
		КонецПроцедуры
		
		// Определяет менеждер печати и значения параметров метода печати, характерные для конкретной конфигурации 1С
		//
		// Параметры:
		//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
		//  ПараметрыМетодаПечати	 - Структура 		- См. метод "НовыйПараметрыТиповогоМетодаПечати"
		//
		Процедура ПередФормированиемПечатнойФормыСверкиВзаиморасчетов(МенеджерПечати, ПараметрыМетодаПечати)
			
			МетодСервера(ИмяМодуляИнтеграции(), "ПередФормированиемПечатнойФормыСверкиВзаиморасчетов", МенеджерПечати, ПараметрыМетодаПечати);
			
		КонецПроцедуры //ПередФормированиемПечатнойФормыСверкиВзаиморасчетов()


		Функция СформироватьМетуВнешнейПечатнойФормы(DocumentType, ДокументСсылка) Экспорт
			
			Результат = Неопределено;
			
			Если DocumentType = "XmlAcceptanceCertificate" Тогда
				
				Результат = СформироватьМетуАктаВыполненныхРабот(ДокументСсылка);
				
			ИначеЕсли DocumentType = "ProformaInvoice" Тогда
				
				Результат = СформироватьМетуСчетаНаОплату(ДокументСсылка);
				
			ИначеЕсли DocumentType = "ReconciliationAct" Тогда
				
				Результат = СформироватьМетуАктаСверки(ДокументСсылка);
				
			КонецЕсли;
			
			Возврат Результат;
			
		КонецФункции
		
		Функция СформироватьМетуСчетаНаОплату(ДокументСсылка) Экспорт
			
			Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "СформироватьМетуСчетаНаОплату", ДокументСсылка);
			
		КонецФункции
		
		Функция СформироватьМетуАктаСверки(ДокументСсылка) Экспорт
			
			Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "СформироватьМетуАктаСверки", ДокументСсылка);
			
		КонецФункции
		
		Функция СформироватьМетуАктаВыполненныхРабот(ДокументСсылка) Экспорт
			
			Возврат МетодСервера(ПараметрыКлиентСервер.ИмяФормыИнтеграции, "СформироватьМетуАктаВыполненныхРабот", ДокументСсылка);
			
		КонецФункции
		
		// Возвращает шаблон текста для объединения запросов.
		//
		// Параметры:
		//  ТолькоНовые - Булево - Истина, если из результата присоединяемого запроса нужно получить
		//                         только те строки, которых еще нет в общем результате.
		// 
		// Возвращаемое значение:
		//   Строка
		//
		Функция РазделительОбъединенияЗапросов(ТолькоНовые = Ложь)
			
			Если ТолькоНовые Тогда
				
				Результат = "
				|
				|ОБЪЕДИНИТЬ
				|
				|";
				
			Иначе
				
				Результат = "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|";
				
			КонецЕсли;
			
			Возврат Результат;
			
		КонецФункции
		
	//} ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	////////////////////////////////////////////////////////////////////////////////
	
	////////////////////////////////////////////////////////////////////////////////
	//{ Get content

		////////////////////////////////////////////////////////////////////////////////
		//{ ИНИЦАЛИЗАЦИЯ content
		
		// описанные функции вызываются на сервере из интеграционных модулей,
		// должны совпадать с описанием функций инициализации контентов на клиенте (форма "Модуль_Клиент")

		//{ документ

			//&НаКлиенте
			Функция Новый_Torg12SellerContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Torg12SellerContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				
				Результат.Вставить("SupplyDate");
				
				Результат.Вставить("WaybillDate");
				Результат.Вставить("WaybillNumber");
				
				Результат.Вставить("OperationCode");
				
				Результат.Вставить("GroundName");
				Результат.Вставить("GroundDate");
				Результат.Вставить("GroundNumber");
				
				Результат.Вставить("AttachmentSheetsQuantity");
				
				Результат.Вставить("ShipperDepartment");
				Результат.Вставить("ShipperOkdp");
				
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("Seller", Новый_OrganizationInfo());
				Результат.Вставить("Buyer" , Новый_OrganizationInfo());
				
				Результат.Вставить("Shipper"  , Новый_OrganizationInfo());
				Результат.Вставить("Consignee", Новый_OrganizationInfo());
				
				Результат.Вставить("Totals" , Новый_Torg12Totals());
				Результат.Вставить("Commons", Новый_Torg12Commons());
				
				Результат.Вставить("SupplyAllowedBy"  , Новый_Official());
				Результат.Вставить("ChiefAccountant"  , Новый_Official());
				Результат.Вставить("SupplyPerformedBy", Новый_Official());
				
				Результат.Вставить("Signer", Новый_Signer());
				
				Результат.Вставить("Items", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции	

			//&НаКлиенте
			Функция Новый_Torg12BuyerContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Torg12BuyerContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("ShipmentReceiptDate");
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("Receiver", Новый_Official());
				Результат.Вставить("Accepter", Новый_Official());
				Результат.Вставить("Attorney", Новый_Attorney());
				
				Результат.Вставить("Signer", Новый_Signer());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_AcceptanceCertificateSellerContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/AcceptanceCertificateSellerContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				
				Результат.Вставить("Title");
				Результат.Вставить("SignatureDate");
				
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("Seller", Новый_OrganizationInfo());
				
				Результат.Вставить("Official", Новый_Official());
				Результат.Вставить("Attorney", Новый_Attorney());
				
				Результат.Вставить("Signer", Новый_Signer());
				
				Результат.Вставить("Items", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции	

			//&НаКлиенте
			Функция Новый_AcceptanceCertificateBuyerContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/AcceptanceCertificateBuyerContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("SignatureDate");
				Результат.Вставить("Complaints");
				
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("Official", Новый_Official());
				Результат.Вставить("Attorney", Новый_Attorney());
				
				Результат.Вставить("Signer", Новый_Signer());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceContent() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				
				Результат.Вставить("InvoiceRevisionDate");
				Результат.Вставить("InvoiceRevisionNumber");
				
				Результат.Вставить("Currency");
				
				Результат.Вставить("Seller", Новый_OrganizationInfo());
				Результат.Вставить("Buyer" , Новый_OrganizationInfo());
				
				Результат.Вставить("Shipper"  , Новый_ShipperOrConsigneeInfo());
				Результат.Вставить("Consignee", Новый_ShipperOrConsigneeInfo());
				
				Результат.Вставить("Signer", Новый_Signer());
				
				Результат.Вставить("Totals", Новый_InvoiceTotals());
				
				Результат.Вставить("Items", Новый Массив);
				Результат.Вставить("PaymentDocuments", Новый Массив);
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Результат.Вставить("ВалютаСсылка");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceCorrectionContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceCorrectionContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("InvoiceCorrectionDate");
				Результат.Вставить("InvoiceCorrectionNumber");
				
				Результат.Вставить("InvoiceCorrectionRevisionDate");
				Результат.Вставить("InvoiceCorrectionRevisionNumber");
				
				Результат.Вставить("Currency");
				
				Результат.Вставить("Seller", Новый_OrganizationInfo());
				Результат.Вставить("Buyer" , Новый_OrganizationInfo());
				
				Результат.Вставить("TotalsInc", Новый_InvoiceTotals());
				Результат.Вставить("TotalsDec", Новый_InvoiceTotals());
				
				Результат.Вставить("Signer", Новый_Signer());
				
				Результат.Вставить("Items", Новый Массив);
				Результат.Вставить("OriginalInvoices", Новый Массив);
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Результат.Вставить("ВалютаСсылка");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_UtdSellerContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/UtdSellerContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				Результат.Вставить("Function");
				
				Результат.Вставить("RevisionDate");
				Результат.Вставить("RevisionNumber");
				
				Результат.Вставить("Name");
				Результат.Вставить("Creator");
				Результат.Вставить("CreatorBase");
				
				Результат.Вставить("Currency");
				Результат.Вставить("CurrencyRate");
				
				Результат.Вставить("GovernmentContractInfo");
				
				Результат.Вставить("Seller", Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Buyer" , Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("Shipper"  , Новый_Shipper());
				Результат.Вставить("Consignee", Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("InvoiceTable", Новый_InvoiceTable());
				Результат.Вставить("TransferInfo", Новый_TransferInfo());
				
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Результат.Вставить("Signers", Новый Массив);
				Результат.Вставить("PaymentDocuments", Новый Массив);
				
				Результат.Вставить("СчетФактураСсылка");
				Результат.Вставить("ВалютаСсылка");
				Результат.Вставить("ОшибкиВДанных", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции	

			//&НаКлиенте
			Функция Новый_UtdBuyerContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/UtdBuyerContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("AcceptanceDate");
				
				Результат.Вставить("Creator");
				Результат.Вставить("CreatorBase");
				
				Результат.Вставить("OperationCode");
				Результат.Вставить("OperationContent");
				
				Результат.Вставить("Employee"	, Новый_Employee());
				Результат.Вставить("OtherIssuer", Новый_OtherIssuer());
				
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Результат.Вставить("Signers", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Utd820SellerContent() //Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				Результат.Вставить("Function");
				
				Результат.Вставить("RevisionDate");
				Результат.Вставить("RevisionNumber");
				
				Результат.Вставить("DocumentName");
				Результат.Вставить("DocumentCreator");
				Результат.Вставить("DocumentCreatorBase");
				
				Результат.Вставить("Currency");
				Результат.Вставить("CurrencyRate");
				
				Результат.Вставить("GovernmentContractInfo");
				Результат.Вставить("CircumFormatInvoice");
				Результат.Вставить("ApprovedStructureAdditionalInfoFields");
				
				Результат.Вставить("HyphenRevisionDate");
				Результат.Вставить("HyphenRevisionNumber");
				
				Результат.Вставить("Sellers", Новый Массив); // Новый_ExtendedOrganizationInfo820()
				Результат.Вставить("Buyers"	, Новый Массив); // Новый_ExtendedOrganizationInfo820()
				
				Результат.Вставить("Shippers"	, Новый Массив); // Новый_Shipper820()
				Результат.Вставить("Consignees"	, Новый Массив); // Новый_ExtendedOrganizationInfo820()
				
				Результат.Вставить("FactorInfo", Новый_ExtendedOrganizationInfo820());
				
				Результат.Вставить("Table", Новый_Utd820Table());
				Результат.Вставить("TransferInfo", Новый_TransferInfo820());
				
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Результат.Вставить("Signers", Новый Массив);
				Результат.Вставить("PaymentDocuments", Новый Массив);
				
				Результат.Вставить("MainAssignMonetaryClaim"	, Новый_TransferBase820());
				Результат.Вставить("SellerInfoCircumPublicProc"	, Новый_SellerInfoCircumPublicProc());
				Результат.Вставить("DocumentShipments"			, Новый Массив); // Новый_DocumentShipment()
				
				Результат.Вставить("ОшибкиВДанных", Новый Массив);
				Результат.Вставить(ИмяСвойстваСлужебнаяИнформация(), НоваяСлужебнаяИнформацияШапки());
				
				Возврат Результат;
				
			КонецФункции	

			//&НаКлиенте
			Функция Новый_UcdSellerContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/UcdSellerContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				Результат.Вставить("Function");
				Результат.Вставить("FormatVersion");
				
				Результат.Вставить("RevisionDate");
				Результат.Вставить("RevisionNumber");
				
				Результат.Вставить("Name");
				Результат.Вставить("Creator");
				Результат.Вставить("CreatorBase");
				
				Результат.Вставить("Currency");
				Результат.Вставить("CurrencyRate");
				Результат.Вставить("CurrencyName");
				
				Результат.Вставить("GovernmentContractInfo");
				
				Результат.Вставить("Seller", Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Buyer" , Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("InvoiceCorrectionTable", Новый_InvoiceCorrectionTable());
				Результат.Вставить("EventContent", Новый_EventContent());
				
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Результат.Вставить("Invoices", Новый Массив);
				Результат.Вставить("Signers" , Новый Массив);
				
				Результат.Вставить("СчетФактураСсылка");
				Результат.Вставить("ВалютаСсылка");
				Результат.Вставить("ОшибкиВДанных", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_UcdBuyerContent() Экспорт 
				
				Возврат Новый_UtdBuyerContent();
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_TovTorgSellerContent() Экспорт 
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentName");
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("RevisionDate");
				Результат.Вставить("RevisionNumber");
				
				Результат.Вставить("Currency");
				Результат.Вставить("CurrencyRate");
				
				Результат.Вставить("DocumentCreator");
				Результат.Вставить("DocumentCreatorBase");
				
				Результат.Вставить("OperationType");
				
				Результат.Вставить("GovernmentContractInfo");
				
				Результат.Вставить("Table", Новый_TovTorgTable());
				
				Результат.Вставить("Seller", Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Buyer" , Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("Shipper"  , Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Carrier"  , Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Consignee", Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("TransferInfo"	 , Новый_TovTorgTransferInfo());
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Результат.Вставить("Signers", Новый Массив);
				Результат.Вставить("Grounds", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_TovTorgBuyerContent() Экспорт 
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentCreator");
				Результат.Вставить("DocumentCreatorBase");
				
				Результат.Вставить("OperationCode");
				Результат.Вставить("OperationContent");
				
				Результат.Вставить("AcceptanceDate");
				
				Результат.Вставить("Employee"	, Новый_Employee());
				Результат.Вставить("OtherIssuer", Новый_OtherIssuer());
				
				Результат.Вставить("AdditionalInfo", Новый_AdditionalInfoId());
				
				Результат.Вставить("Signers", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_Act552SellerContent() Экспорт 
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentName");
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("RevisionDate");
				Результат.Вставить("RevisionNumber");
				
				Результат.Вставить("Currency");
				Результат.Вставить("CurrencyRate");
				
				Результат.Вставить("DocumentCreator");
				Результат.Вставить("DocumentCreatorBase");
				
				Результат.Вставить("OperationType");
				Результат.Вставить("OperationTitle");
				
				Результат.Вставить("GovernmentContractInfo");
				
				Результат.Вставить("Seller", Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Buyer" , Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("TransferInfo"  , Новый_Act552TransferInfo());
				Результат.Вставить("AdditionalInfo", Новый_AdditionalInfoId());
				
				Результат.Вставить("Works"	, Новый Массив);
				Результат.Вставить("Signers", Новый Массив);
				Результат.Вставить("Grounds", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_Act552BuyerContent() Экспорт 
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentCreator");
				Результат.Вставить("DocumentCreatorBase");
				
				Результат.Вставить("OperationType");
				Результат.Вставить("OperationContent");
				
				Результат.Вставить("AcceptanceDate");
				
				Результат.Вставить("CreatedThingInfo");
				Результат.Вставить("CreatedThingAcceptDate");
				
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Результат.Вставить("Signers", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			
			// Инициализирует структуру ProformaInvoiceSellerContent.
			// 
			// Возвращаемое значение:
			//  Структура - содержит поля:
			//     * DocumentDate - Дата - Дата составления счета на оплату;
			//     * DocumentNumber - Строка - Номер счета на оплату;
			//     * Seller - Структура - Сведения о продавце, БанкРекв обязательны для СвПрод (см. Новый_ExtendedOrganizationInfo());
			//     * Buyer - Структура - Сведения о покупателе (см. Новый_ExtendedOrganizationInfo());
			//     * Recipient - Структура - (Необязательный) Сведения о получателе платежа (см. Новый_ExtendedOrganizationInfo());
			//     * Payer - Структура - (Необязательный) Сведения о плательщике (см. Новый_ExtendedOrganizationInfo());
			//     * Contract - Структура - (Необязательный) Договор (см. Новый_ContractInfo());
			//     * Currency - Строка - (Необязательный) Код валюты по Общероссийскому классификатору валют;
			//     * CurrencyRate - Число - (Необязательный) Курс валюты;
			//     * GovernmentContractInfo - Строка - (Необязательный) Идентификатор государственного контракта;
			//     * PaymentPurpose - Строка - (Необязательный) Назначение платежа;
			//     * Signer - Структура - Сведения о лице, подписывающем файл счета на оплату в электронной форме (см. Новый_Signer());
			//     * ProformaInvoiceTable - Структура - Сведения об отгруженных товарах (о выполненных работах, оказанных услугах), переданных имущественных правах (см. Новый_ProformaInvoiceTable());
			//     * PersonalAccountInfo - Массив - Сведения по изменению лицевого счета;
			//     * AdditionalInfo - Массив - Дополнительные сведения к документу, содержит структуры StructedAdditionalInfo (см. Новый_StructedAdditionalInfo());
			//
			//&НаКлиенте
			Функция Новый_ProformaInvoiceSellerContent() Экспорт 
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("Seller"	, Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Buyer"	, Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("Recipient"	, Новый_ExtendedOrganizationInfo());
				Результат.Вставить("Payer"		, Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("Contract", Новый_ContractInfo());
				
				Результат.Вставить("Currency");
				Результат.Вставить("CurrencyRate");
				
				Результат.Вставить("GovernmentContractInfo");
				Результат.Вставить("PaymentPurpose");
				
				Результат.Вставить("Signer", Новый_Signer());
				
				Результат.Вставить("ProformaInvoiceTable", Новый_ProformaInvoiceTable());
				
				Результат.Вставить("PersonalAccountInfo", Новый Массив);
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_ProformaInvoiceBuyerContent() Экспорт 
				
				Результат = Новый Структура;
				
				Возврат Результат;
				
			КонецФункции
			
		//} документ

		//{ шапка
			
			//&НаКлиенте
			Функция Новый_OrganizationInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/OrganizationInfo.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Inn");
				Результат.Вставить("Kpp");
				Результат.Вставить("IsSoleProprietor");
				
				Результат.Вставить("FnsParticipantId");
				
				Результат.Вставить("Okopf");
				Результат.Вставить("Okpo");
				
				Результат.Вставить("Phone");
				Результат.Вставить("Fax");
				
				Результат.Вставить("BankAccountNumber");
				Результат.Вставить("BankName");
				Результат.Вставить("BankId");
				
				Результат.Вставить("Address", Новый_AddressInfo());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_ExtendedOrganizationInfo() Экспорт 
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/ExtendedOrganizationInfo.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Type");
				Результат.Вставить("Inn");
				Результат.Вставить("Kpp");
				
				Результат.Вставить("Okopf");
				Результат.Вставить("Okpo");
				Результат.Вставить("Okdp");
				
				Результат.Вставить("FnsParticipantId");
				Результат.Вставить("BoxId");
				
				Результат.Вставить("IndividualEntityRegistrationCertificate");
				Результат.Вставить("OrganizationOrPersonInfo");
				Результат.Вставить("LegalEntityId");
				
				Результат.Вставить("Phone");
				Результат.Вставить("Email");
				
				Результат.Вставить("BankAccountNumber");
				Результат.Вставить("CorrespondentAccount");
				Результат.Вставить("BankName");
				Результат.Вставить("BankId");
				
				Результат.Вставить("Department");
				
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("Address", Новый_AddressInfo());
				
				Результат.Вставить("Ссылка");
				
				Возврат Результат;
				
			КонецФункции
			
			Функция Новый_ExtendedOrganizationInfo820() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Type");
				Результат.Вставить("Inn");
				Результат.Вставить("Kpp");
				
				Результат.Вставить("HyphenInn");
				
				Результат.Вставить("Okopf");
				Результат.Вставить("Okpo");
				Результат.Вставить("Okdp");
				
				Результат.Вставить("FnsParticipantId");
				Результат.Вставить("BoxId");
				
				Результат.Вставить("IndividualEntityRegistrationCertificate");
				Результат.Вставить("OrganizationOrPersonInfo");
				Результат.Вставить("LegalEntityId");
				
				Результат.Вставить("Phone");
				Результат.Вставить("Email");
				
				Результат.Вставить("BankAccountNumber");
				Результат.Вставить("CorrespondentAccount");
				Результат.Вставить("BankName");
				Результат.Вставить("BankId");
				
				Результат.Вставить("Department");
				
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("Address", Новый_AddressInfo());
				
				Результат.Вставить("Ссылка");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_Shipper() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Shipper.html
				
				Результат = Новый Структура;
				Результат.Вставить("SameAsSeller");
				Результат.Вставить("OrganizationInfo", Новый_ExtendedOrganizationInfo());
				
				Возврат Результат;
				
			КонецФункции
			
			Функция Новый_Shipper820() Экспорт
				
				Результат = Новый Структура;
				Результат.Вставить("SameAsSeller");
				Результат.Вставить("OrganizationInfo", Новый_ExtendedOrganizationInfo820());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_ShipperOrConsigneeInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/ShipperOrConsigneeInfo.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("IsSoleProprietor");
				Результат.Вставить("SameAsSellerOrBuyer");
				
				Результат.Вставить("Address", Новый_AddressInfo());
				
				Результат.Вставить("Ссылка");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_AddressInfo() Экспорт 
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/AddressInfo.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("IsForeign");
				
				Результат.Вставить("ZipCode");
				Результат.Вставить("RegionCode");
				
				Результат.Вставить("Territory");
				Результат.Вставить("City");
				Результат.Вставить("Locality");
				Результат.Вставить("Street");
				Результат.Вставить("Building");
				Результат.Вставить("Block");
				Результат.Вставить("Apartment");
				Результат.Вставить("CountryCode");
				
				Результат.Вставить("AddressText");
				Результат.Вставить("AddressCode");
				
				Возврат Результат;
				
			КонецФункции	

			//&НаКлиенте
			Функция Новый_AdditionalInfoId() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/AdditionalInfoId.html
				
				Результат = Новый Структура;
				Результат.Вставить("InfoFileId");
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_StructedAdditionalInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/StructedAdditionalInfo.html
				
				Результат = Новый Структура;
				Результат.Вставить("Key");
				Результат.Вставить("Value");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceForCorrectionInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceForCorrectionInfo.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("InvoiceDate");
				Результат.Вставить("InvoiceNumber");
				
				Результат.Вставить("InvoiceRevisions", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceRevisionInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceRevisionInfo.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("RevisionDate");
				Результат.Вставить("RevisionNumber");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_OriginalInvoice() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/OriginalInvoice.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				
				Результат.Вставить("InvoiceRevisionDate");
				Результат.Вставить("InvoiceRevisionNumber");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_PaymentDocument() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/PaymentDocument.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_PaymentDocumentInfo() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				Результат.Вставить("Total");
				
				Возврат Результат;
				
			КонецФункции
			
			// Инициализирует структуру Contract объекта ProformaInvoiceSellerContent.
			//
			// Возвращаемое значение:
			//  Структура - содержит ключи:
			//     * Name	 - Строка	 - Наименование договора;
			//     * Number	 - Строка	 - (Необязательный) Номер договора;
			//     * Date	 - Дата		 - (Необязательный) Дата договора;
			//
			//&НаКлиенте
			Функция Новый_ContractInfo()
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Number");
				Результат.Вставить("Date");
				
				Возврат Результат;
				
			КонецФункции
			
		//} шапка

		//{ ТЧ
			
			//&НаКлиенте
			Функция Новый_Torg12Item() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Torg12Item.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				Результат.Вставить("Feature");
				Результат.Вставить("Sort");
				Результат.Вставить("Article");
				Результат.Вставить("ProductCode");
				Результат.Вставить("ExternalCode");
				
				Результат.Вставить("UnitCode");
				Результат.Вставить("UnitName");
				
				Результат.Вставить("ParcelsQuantity");
				Результат.Вставить("ParcelType");
				Результат.Вставить("ParcelCapacity");
				
				Результат.Вставить("GrossQuantity");
				Результат.Вставить("Quantity");
				
				Результат.Вставить("Price");
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("СсылкаНаЕИ");
				
				Возврат Результат; 
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_AcceptanceCertificateItem() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/AcceptanceCertificateItem.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Description");
				
				Результат.Вставить("UnitCode");
				Результат.Вставить("UnitName");
				
				Результат.Вставить("Quantity");
				
				Результат.Вставить("Price");
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				
				Результат.Вставить("AdditionalInfo");
				
				Результат.Вставить("СсылкаНаЕИ");
				
				Возврат Результат; 
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceItem() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceItem.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				Результат.Вставить("UnitCode");
				Результат.Вставить("Quantity");
				
				Результат.Вставить("Price");
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				Результат.Вставить("Excise");
				
				Результат.Вставить("CountriesOfOrigin");
				Результат.Вставить("CustomsDeclarationNumbers");
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Результат.Вставить("ЕдиницаИзмеренияСсылка");
				Результат.Вставить("СтранаПроисхожденияСсылка");
				Результат.Вставить("СсылкаНаЕИ");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceCorrectionItem() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceCorrectionItem.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				
				Результат.Вставить("OriginalValues" , Новый_InvoiceItemFields());
				Результат.Вставить("CorrectedValues", Новый_InvoiceItemFields());
				
				Результат.Вставить("AmountsInc", Новый_AmountsDiff());
				Результат.Вставить("AmountsDec", Новый_AmountsDiff());
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceTable() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceTable.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Items", Новый Массив);
				
				Результат.Вставить("TotalNet");
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Utd820Item() //Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				Результат.Вставить("ItemVendorCode");
				Результат.Вставить("ItemCharact");
				Результат.Вставить("ItemArticle");
				Результат.Вставить("ItemKind");
				Результат.Вставить("CatalogCode");
				Результат.Вставить("ItemTypeCode");
				
				Результат.Вставить("ItemMark");
				Результат.Вставить("AdditionalProperty");
				
				Результат.Вставить("Unit");
				Результат.Вставить("UnitName");
				
				Результат.Вставить("ItemToRelease");
				Результат.Вставить("Quantity");
				
				Результат.Вставить("Price");
				Результат.Вставить("SubtotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Vat");
				Результат.Вставить("WithoutVat");
				Результат.Вставить("Subtotal");
				Результат.Вставить("Excise");
				
				Результат.Вставить("HyphenUnit");
				Результат.Вставить("HyphenVat");
				Результат.Вставить("HyphenSubtotal");
				
				Результат.Вставить("CustomDeclarations"		, Новый Массив); // Новый_CustomDeclaration820()
				Результат.Вставить("StructedAdditionalInfos", Новый Массив); // Новый_StructedAdditionalInfo()
				
				Результат.Вставить("ItemTracingInfos"			, Новый Массив); // Новый_ItemTracingInfo()
				Результат.Вставить("ItemIdentificationNumbers"	, Новый Массив); // Новый_ItemIdentificationNumber()
				
				Результат.Вставить(ИмяСвойстваСлужебнаяИнформация(), НоваяСлужебнаяИнформацияСтроки());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Utd820Table() //Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Items", Новый Массив); // Новый_Utd820Item()
				
				Результат.Вставить("TotalNet");
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				Результат.Вставить("WithoutVat");
				
				Результат.Вставить("HyphenVat");
				Результат.Вставить("HyphenTotal");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_ExtendedInvoiceItem() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/ExtendedInvoiceItem.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				Результат.Вставить("VendorCode");
				
				Результат.Вставить("ItemMark");
				Результат.Вставить("AdditionalProperty");
				
				Результат.Вставить("UnitCode");
				Результат.Вставить("UnitName");
				
				Результат.Вставить("ToRelease");
				Результат.Вставить("Quantity");
				
				Результат.Вставить("Price");
				Результат.Вставить("SubtotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Vat");
				Результат.Вставить("Subtotal");
				Результат.Вставить("Excise");
				
				Результат.Вставить("AccountDebit");
				Результат.Вставить("AccountCredit");
				
				Результат.Вставить("CustomDeclarations"		, Новый Массив);
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Результат.Вставить("ЕдиницаИзмеренияСсылка");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceCorrectionTable() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceCorrectionTable.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Items", Новый Массив);
				
				Результат.Вставить("TotalsInc", Новый_InvoiceTotals());
				Результат.Вставить("TotalsDec", Новый_InvoiceTotals());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_ExtendedInvoiceCorrectionItem() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				
				Результат.Вставить("ItemAccountDebit");
				Результат.Вставить("ItemAccountCredit");
				
				Результат.Вставить("OriginalValues" , Новый_InvoiceItemFields());
				Результат.Вставить("CorrectedValues", Новый_InvoiceItemFields());
				
				Результат.Вставить("AmountsInc", Новый_AmountsDiff());
				Результат.Вставить("AmountsDec", Новый_AmountsDiff());
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				// дополяется полями для 736@
				Результат.Вставить("OriginalNumber");
				Результат.Вставить("ItemTracingInfos", Новый Массив); // Новый_ItemTracingInfo736() 
				Результат.Вставить("OriginalItemIdentificationNumbers", Новый Массив); 	// Новый_ItemIdentificationNumber()
				Результат.Вставить("CorrectedItemIdentificationNumbers", Новый Массив); // Новый_ItemIdentificationNumber()
				Результат.Вставить("ItemCharact");
				Результат.Вставить("ItemKind");
				Результат.Вставить("ItemArticle");
				Результат.Вставить("ItemVendorCode");
				Результат.Вставить("ItemTypeCode");
				Результат.Вставить("OriginalUnitName");
				Результат.Вставить("CorrectedUnitName");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_TovTorgTable() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Items", Новый Массив);
				
				Результат.Вставить("TotalQuantity");
				Результат.Вставить("TotalGross");
				Результат.Вставить("TotalNet");
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("TotalVat");
				Результат.Вставить("Total");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_TovTorgItem() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				Результат.Вставить("Feature");
				Результат.Вставить("Sort");
				Результат.Вставить("VendorCode");
				Результат.Вставить("ProductCode");
				
				Результат.Вставить("UnitName");
				Результат.Вставить("Unit");
				
				Результат.Вставить("PackageType");
				Результат.Вставить("QuantityInPack");
				
				Результат.Вставить("ItemToRelease");
				Результат.Вставить("Quantity");
				Результат.Вставить("Gross");
				Результат.Вставить("Net");
				
				Результат.Вставить("Price");
				Результат.Вставить("SubtotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Vat");
				Результат.Вставить("Subtotal");
				
				Результат.Вставить("ItemAccountDebit");
				Результат.Вставить("ItemAccountCredit");
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Результат.Вставить("СсылкаНаЕИ");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_Act552WorkDescription() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Items", Новый Массив);
				
				Результат.Вставить("StartingDate");
				Результат.Вставить("CompletionDate");
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("TotalVat");
				Результат.Вставить("Total");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_Act552WorkItem() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Description");
				
				Результат.Вставить("UnitCode");
				Результат.Вставить("UnitName");
				
				Результат.Вставить("Quantity");
				
				Результат.Вставить("Price");
				Результат.Вставить("SubtotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Vat");
				Результат.Вставить("Subtotal");
				
				Результат.Вставить("ItemAccountDebit");
				Результат.Вставить("ItemAccountCredit");
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Результат.Вставить("СсылкаНаЕИ");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_CustomDeclaration() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/CustomDeclaration.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("CountryCode");
				Результат.Вставить("HyphenCountry", Ложь);
				Результат.Вставить("DeclarationNumber");
				
				Результат.Вставить("СтранаПроисхожденияСсылка");
				
				Возврат Результат;
				
			КонецФункции
			
			Функция Новый_CustomDeclaration820() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("CountryCode");
				Результат.Вставить("DeclarationNumber");
				Результат.Вставить("HyphenCountry");
				
				Результат.Вставить("СтранаПроисхожденияСсылка");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_InvoiceItemFields() Экспорт 
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/InvoiceItemFields.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("UnitCode");
				Результат.Вставить("UnitName");
				Результат.Вставить("Quantity");
				
				Результат.Вставить("Price");
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				Результат.Вставить("Excise");
				Результат.Вставить("WithoutVat");
				
				Результат.Вставить("ЕдиницаИзмеренияСсылка");
				
				Возврат Результат;
				
			КонецФункции	
			
			// Инициализирует строку табличной части объекта ProformaInvoiceSellerContent.
			//
			// Возвращаемое значение:
			//  Структура содержит ключи:
			//     * Product - Строка - Наименование товара (описание выполненных работ, оказанных услуг), имущественных прав;
			//     * Unit - Строка - Код единицы измерения по Общероссийскому классификатору единиц измерения или «0000» (при отсутствии необходимой единицы измерения в ОКЕИ). 
			//                       В случае указания значения 0000 наименование единицы измерения определяется пользователем;
			//     * UnitName - Строка - (Необязательный) Наименование единицы измерения;
			//     * Quantity - Число - (Необязательный) Количество (объем);
			//     * Price - Число - (Необязательный) Цена (тариф) за единицу измерения;
			//     * SubtotalWithVatExcluded - Число - (Необязательный) Стоимость товаров (работ, услуг), имущественных прав без налога - всего;
			//     * TaxRate - Строка - Налоговая ставка;
			//     * Excise - Строка - (Необязательный) Сумма акциза;
			//     * Vat - Число - (Необязательный) Сумма налога, предъявляемая покупателю;
			//     * Subtotal - Число - Стоимость товаров (работ, услуг), имущественных прав с налогом - всего;
			//     * AdditionalInfo - Массив - Дополнительные сведения к строке документа, содержит структуры StructedAdditionalInfo (см. Новый_StructedAdditionalInfo());
			//
			//&НаКлиенте
			Функция Новый_ProformaInvoiceItem()
				
				Результат = Новый Структура;
				
				Результат.Вставить("Product");
				Результат.Вставить("Unit");
				Результат.Вставить("UnitName");
				Результат.Вставить("Quantity");
				Результат.Вставить("Price");
				Результат.Вставить("SubtotalWithVatExcluded");
				Результат.Вставить("TaxRate");
				Результат.Вставить("Excise");
				Результат.Вставить("Vat");
				Результат.Вставить("Subtotal");
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			// Инициализирует табличную часть объекта ProformaInvoiceSellerContent.
			//
			// Возвращаемое значение:
			//  Структура содержит ключи:
			//     * Items - Массив - содержит структуры ProformaInvoiceItem (см. Новый_ProformaInvoiceItem)
			//     * TotalWithVatExcluded - Число - Всего к оплате без налога
			//     * TotalVat - Число - Сумма налога (всего), предъявляемая покупателю
			//     * Total - Число - Всего к оплате с учетом налога
			//     * GrandTotal - Число - (Необязательный) Итого к оплате, с учетом дополнительных начислений, перерасчетов и оплат
			//
			//&НаКлиенте
			Функция Новый_ProformaInvoiceTable()
				
				Результат = Новый Структура;
				
				Результат.Вставить("Items", Новый Массив);
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("TotalVat");
				Результат.Вставить("Total");
				Результат.Вставить("GrandTotal");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_ItemTracingInfo736()
				
				Результат = Новый Структура;
				
				Результат.Вставить("QuantityDiff");
				Результат.Вставить("RegNumberUnit");
				Результат.Вставить("Unit");
				Результат.Вставить("ItemAddInfo");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_QuantityDiff()
				
				Результат = Новый Структура;
				
				Результат.Вставить("QuantityInc");
				Результат.Вставить("QuantityDec");
				Результат.Вставить("OriginalQuantity");
				Результат.Вставить("CorrectedQuantity");
				
				Возврат Результат;
				
			КонецФункции
			
		//} ТЧ

		//{ подвал

			//&НаКлиенте
			Функция Новый_TransferInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/TransferInfo.html
				
			 	Результат = Новый Структура;
				
				Результат.Вставить("OperationInfo");
				Результат.Вставить("OperationType");
				
				Результат.Вставить("TransferTextInfo");
				Результат.Вставить("TransferDate");
				
				Результат.Вставить("CreatedThingInfo");
				Результат.Вставить("CreatedThingTransferDate");
				
				Результат.Вставить("Waybills"	  , Новый Массив);
				Результат.Вставить("TransferBases", Новый Массив);
				
				Результат.Вставить("Carrier", Новый_ExtendedOrganizationInfo());
				
				Результат.Вставить("Employee"	, Новый_Employee());
				Результат.Вставить("OtherIssuer", Новый_OtherIssuer());
				
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Возврат Результат;
				
			КонецФункции

			Функция Новый_TransferInfo820()
				
				Результат = Новый Структура;
				
				Результат.Вставить("OperationInfo");
				Результат.Вставить("OperationType");
				
				Результат.Вставить("TransferTextInfo");
				Результат.Вставить("TransferDate");
				
				Результат.Вставить("TransferStartDate");
				Результат.Вставить("TransferEndDate");
				
				Результат.Вставить("CreatedThingInfo");
				Результат.Вставить("CreatedThingTransferDate");
				
				Результат.Вставить("Waybills"		, Новый Массив); // Новый_Waybill()
				Результат.Вставить("TransferBases"	, Новый Массив); // Новый_TransferBase820()
				
				Результат.Вставить("Carrier", Новый_ExtendedOrganizationInfo820());
				
				Результат.Вставить("Employee"	, Новый_Employee());
				Результат.Вставить("OtherIssuer", Новый_OtherIssuer());
				
				Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_TovTorgTransferInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/TovTorgTransferInfo.html
				
			 	Результат = Новый Структура;
				
				Результат.Вставить("OperationInfo");
				Результат.Вставить("TransferDate");
				Результат.Вставить("Attachment");
				
				Результат.Вставить("Employee"	, Новый_Employee());
				Результат.Вставить("OtherIssuer", Новый_OtherIssuer());
				
				Результат.Вставить("Waybills", Новый Массив);
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_Act552TransferInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Act552TransferInfo.html
				
			 	Результат = Новый Структура;
				
				Результат.Вставить("OperationInfo");
				Результат.Вставить("TransferDate");
				
				Результат.Вставить("CreatedThingInfo");
				Результат.Вставить("CreatedThingTransferDate");
				
				Результат.Вставить("StructedAdditionalInfos", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_TransferBase() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/TransferBase.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentName");
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("DocumentInfo");
				
				Возврат Результат; 
				
			КонецФункции
			
			Функция Новый_TransferBase820() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentName");
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("DocumentInfo");
				Результат.Вставить("BaseDocumentId");
				
				Возврат Результат;
				
			КонецФункции
			
			Функция Новый_SellerInfoCircumPublicProc()
				
				Результат = Новый Структура;
				
				Результат.Вставить("DateStateContract");
				Результат.Вставить("NumberStateContract");
				Результат.Вставить("PersonalAccountSeller");
				Результат.Вставить("SellerBudjetClassCode");
				Результат.Вставить("SellerTargetCode");
				Результат.Вставить("SellerTreasuryCode");
				Результат.Вставить("SellerTreasuryName");
				
				Возврат Результат;
				
			КонецФункции
			
			Функция Новый_ItemTracingInfo() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("RegNumberUnit");
				Результат.Вставить("Unit");
				Результат.Вставить("UnitName");
				Результат.Вставить("Quantity");
				Результат.Вставить("ItemAddInfo");
				
				Возврат Результат;
				
			КонецФункции
			
			Функция Новый_ItemIdentificationNumber() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("TransPackageId");
				Результат.Вставить("Units"		, Новый Массив);
				Результат.Вставить("PackageIds"	, Новый Массив);
				
				Возврат Результат;
				
			КонецФункции
			
			Функция Новый_DocumentShipment()
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Number");
				Результат.Вставить("Date");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_Waybill() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Waybill.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Возврат Результат; 
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_EventContent() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/EventContent.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("OperationContent");
				Результат.Вставить("NotificationDate");
				Результат.Вставить("TransferDocDetails");
				Результат.Вставить("TransferDocDetails736", Новый Массив);
				Результат.Вставить("CostChangeInfo");
				
				Результат.Вставить("CorrectionBases", Новый Массив);
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_CorrectionBase() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/CorrectionBase.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("BaseDocumentName");
				Результат.Вставить("BaseDocumentNumber");
				Результат.Вставить("BaseDocumentDate");
				
				Результат.Вставить("AdditionalInfo");
				
				Возврат Результат;
				
			КонецФункции
			
			Функция ОснованиеПередачи_Отсутствует()
				
				Результат = "Отсутствует";
				
				Возврат Результат;
				
			КонецФункции
			
			Функция ОснованиеПередачи_БезДокументаОснования() Экспорт
				
				Результат = "Без документа-основания";
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_BaseDocumentName() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("BaseDocumentDate");
				Результат.Вставить("BaseDocumentNumber");
				Результат.Вставить("BaseDocumentName");
				Результат.Вставить("AdditionalInfo");
				Результат.Вставить("BaseIdFile");
				
				Возврат Результат;
				
			КонецФункции
			
			//&НаКлиенте
			Функция Новый_GroundInfo() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/GroundInfo.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Name");
				Результат.Вставить("Number");
				Результат.Вставить("Date");
				Результат.Вставить("Info");
				
				Возврат Результат;
				
			КонецФункции
			
		//} подвал

		//{ ответственные, подписи

			//&НаКлиенте
			Функция Новый_Signer() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Signer.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Surname");
				Результат.Вставить("FirstName");
				Результат.Вставить("Patronymic");
				
				Результат.Вставить("JobTitle");
				
				Результат.Вставить("Inn");
				
				Результат.Вставить("IsSoleProprietor", Ложь);
				Результат.Вставить("SoleProprietorRegistrationCertificate");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_ExtendedSigner() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/ExtendedSigner.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("BoxId");
				Результат.Вставить("CertificateThumbprint");
				
				Результат.Вставить("SignerDetails", Новый_ExtendedSignerDetails());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_ExtendedSignerDetails() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/ExtendedSignerDetails.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Status");
				Результат.Вставить("SignerType");
				Результат.Вставить("SignerInfo");
				
				Результат.Вставить("Surname");
				Результат.Вставить("FirstName");
				Результат.Вставить("Patronymic");
				
				Результат.Вставить("JobTitle");
				
				Результат.Вставить("Inn");
				Результат.Вставить("OrganizationName");
				Результат.Вставить("RegistrationCertificate");
				
				Результат.Вставить("Powers");
				Результат.Вставить("PowersBase");
				Результат.Вставить("OrganizationPowersBase");
				
				Возврат Результат; 
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Signature() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Signature.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("SignDate");
				Результат.Вставить("SignatureAuthenticityDate");
				
				Результат.Вставить("Certificate", Новый_PersonalCertificate());
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_PersonalCertificate() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/PersonalCertificate.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Thumbprint");
				
				Результат.Вставить("BeginDate");
				Результат.Вставить("EndDate");
				
				Результат.Вставить("Name");
				Результат.Вставить("IssuerName");
				Результат.Вставить("OrganizationName");
				
				Результат.Вставить("Inn");
				Результат.Вставить("Kpp");
				
				Результат.Вставить("JobTitle");
				
				Результат.Вставить("IsQualifiedElectronicSignature");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_ExtendedSignerDetailsToPost() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/ExtendedSignerDetailsToPost.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Status");
				Результат.Вставить("SignerType");
				Результат.Вставить("SignerInfo");
				
				Результат.Вставить("JobTitle");
				
				Результат.Вставить("Powers");
				Результат.Вставить("PowersBase");
				Результат.Вставить("OrganizationPowersBase");
				
				Результат.Вставить("RegistrationCertificate");
				
				Возврат Результат; 
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Official() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Official.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Surname");
				Результат.Вставить("FirstName");
				Результат.Вставить("Patronymic");
				
				Результат.Вставить("JobTitle");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Employee() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Employee.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Surname");
				Результат.Вставить("FirstName");
				Результат.Вставить("Patronymic");
				
				Результат.Вставить("EmployeePosition");
				Результат.Вставить("EmployeeBase");
				Результат.Вставить("EmployeeInfo");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_OtherIssuer() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/OtherIssuer.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Surname");
				Результат.Вставить("FirstName");
				Результат.Вставить("Patronymic");
				
				Результат.Вставить("EmployeePosition");
				Результат.Вставить("EmployeeBase");
				Результат.Вставить("EmployeeInfo");
				
				Результат.Вставить("OrganizationName");
				Результат.Вставить("OrganizationBase");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Attorney() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Attorney.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("Date");
				Результат.Вставить("Number");
				
				Результат.Вставить("IssuerOrganizationName");
				Результат.Вставить("IssuerAdditionalInfo");
				
				Результат.Вставить("RecipientAdditionalInfo");
				
				Результат.Вставить("Issuer"	  , Новый_Official());
				Результат.Вставить("Recipient", Новый_Official());
				
				Возврат Результат;
				
			КонецФункции

		//} ответственные, подписи

		//{ итоги

			//&НаКлиенте
			Функция Новый_Torg12Commons() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Torg12Commons.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("TotalParcelsQuantity");
				Результат.Вставить("TotalGrossQuantity");
				Результат.Вставить("TotalQuantity");
				
				Результат.Вставить("TotalParcelsQuantityInWords");
				Результат.Вставить("TotalGrossQuantityInWords");
				Результат.Вставить("TotalQuantityInWords");
				
				Результат.Вставить("TotalSum");
				Результат.Вставить("TotalSumInWords");
				
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Torg12Totals() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Torg12Totals.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("ParcelsQuantity");
				Результат.Вставить("GrossQuantity");
				Результат.Вставить("Quantity");
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_InvoiceTotals() Экспорт
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/Totals-InvoiceTotals.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				Результат.Вставить("WithoutVat");
				
				Возврат Результат;
											
			КонецФункции

			//&НаКлиенте
			Функция Новый_AmountsDiff() Экспорт 
				
				// http://diadocsdk-1c.readthedocs.io/ru/latest/AmountsDiff.html
				
				Результат = Новый Структура;
				
				Результат.Вставить("TotalWithVatExcluded");
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				Результат.Вставить("Excise");
				
				Возврат Результат;
				
			КонецФункции	

		//} итоги

		//{ НЕФОРМАЛИЗОВАННЫЕ

			//&НаКлиенте
			Функция Новый_NonformalizedDocumentToSend() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("Comment");
				
				Результат.Вставить("NeedRecipientSignature", Ложь);
				
				Возврат Результат;
			
			КонецФункции

			//&НаКлиенте
			Функция Новый_ServiceDetails() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("Comment");
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_NonformalizedProforma() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				
				Результат.Вставить("Grounds");
				Результат.Вставить("Comment");
				
				Результат.Вставить("БезНДС", Ложь);
			
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_PriceList() Экспорт
				
				Возврат Новый Структура;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_AcceptanceCertificate() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("Vat");
				Результат.Вставить("Total");
				
				Результат.Вставить("Grounds");
				Результат.Вставить("Comment");
				
				Результат.Вставить("БезНДС", Ложь);
				Результат.Вставить("NeedRecipientSignature", Истина);
				
				Возврат Результат;
				
			КонецФункции

			//&НаКлиенте
			Функция Новый_Contract() Экспорт
				
				Результат = Новый Структура;
				
				Результат.Вставить("DocumentDate");
				Результат.Вставить("DocumentNumber");
				
				Результат.Вставить("ContractType");
				Результат.Вставить("ContractPrice");
				Результат.Вставить("Comment");
				
				Результат.Вставить("ЦенаНеУказана", Ложь);
				
				Возврат Результат;
				
			КонецФункции

		//} НЕФОРМАЛИЗОВАННЫЕ

	//} Get content
	////////////////////////////////////////////////////////////////////////////////
	
//} РАБОТА С КОНТЕНТОМ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ ДОП НАСТРОЙКИ

	Функция ПолучитьСтрокуКлючЗначение(Организация, DocumentType, ШаблонКлючей) Экспорт
		
		ДопСведения = "";
		
		ТаблицаКлючейЗначений =	ХранилищеОбщихНастроек.Загрузить(МетодСервера(,"ПолучитьСловарь").НаименованиеСистемы, "ТаблицаОбязательныхЗначенийКлючей");
		Если ТаблицаКлючейЗначений <> Неопределено Тогда
			ОтборСтрок = Новый Структура("Организация, DocumentType", Организация, DocumentType);
			НайденныеСтроки = ТаблицаКлючейЗначений.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ДопСведения = НайденныеСтроки[0].СтрокаКлючЗначение;
			Иначе
				ДопСведения = ШаблонКлючей;
			КонецЕсли;
		Иначе
			ДопСведения = ШаблонКлючей;
		КонецЕсли;
		
		Возврат ДопСведения;
		
	КонецФункции

//} ДОП НАСТРОЙКИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ УСТАРЕЛИ

	// Устарела в версии 5.32.01. Следует использовать метод "РезультатВизуализацииСчетаНаОплату()"
	//
	Функция СформироватьПечатнуюФормуСчетаНаОплату(ДокССылка, ПараметрыОтправкиНаСогласование =  Неопределено, ФИОПодписанта = "") Экспорт
		
		Возврат РезультатВизуализацииСчетаНаОплату(ДокССылка, ПараметрыОтправкиНаСогласование, ФИОПодписанта);
		
	КонецФункции

	// Устарела  в версии 5.32.01. Следует использовать метод "РезультатВизуализацииАктаСверки()"
	//
	Функция СформироватьПечатнуюФормуАктаСверки(ДокССылка, ПараметрыОтправкиНаСогласование =  Неопределено, ФИОПодписанта = "") Экспорт
		
		Возврат РезультатВизуализацииАктаСверки(ДокССылка, ПараметрыОтправкиНаСогласование, ФИОПодписанта);
		
	КонецФункции

//} УСТАРЕЛИ
////////////////////////////////////////////////////////////////////////////////
