////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем СписокОрганизаций;
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	ИнициализироватьФорму(Параметры);
	
	ЗаполнитьСписокВыбораОрганизацийНаФорме(СписокОрганизаций);
	
	НастроитьЭлементыФормы();
	
	ОбновитьСписокДоверенностей();
	
КонецПроцедуры

// BSLLS:MissingParameterDescription-off

// Служебный метод для передачи параметров формы.
//
&НаСервере
Процедура ИнициализироватьФорму(ПараметрыФормы) Экспорт
	
	Если НЕ Модуль_ЯдроНаСервере().ЭтоАдресЯщика(ПараметрыФормы.ИдентификаторЯщика) Тогда
		// BSLLS:UnusedLocalVariable-off
		ИдентификаторЯщика = Модуль_ЯдроНаСервере().ИдентификаторВАдресЯщика(ПараметрыФормы.ИдентификаторЯщика);
		// BSLLS:UnusedLocalVariable-on
	Иначе
		// BSLLS:UnusedLocalVariable-off
		ИдентификаторЯщика = ПараметрыФормы.ИдентификаторЯщика;
		// BSLLS:UnusedLocalVariable-on
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:MissingParameterDescription-on

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().НастройкиДоверенности;
	НазваниеФормыДляМетрики = Метрика_НазваниеФормы();
	ПредставлениеМетрики = Метрика_НазваниеФормы();
	
	Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		Истина,
		Ядро.Метрика_НазваниеДействий().ОткрытиеФормы,
		ПредставлениеМетрики
	);
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Кол-во доверенностей", СписокДоверенностей.Количество());
	TraceId = Ядро.TraceId();
	
	Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		Ядро.Метрика_НазваниеДействий().ОткрытиеФормы,
		,
		ДопПеременные,
		,
		TraceId
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().НастройкиДоверенности;
	НазваниеФормыДляМетрики = Метрика_НазваниеФормы();
	ПредставлениеМетрики = Метрика_НазваниеФормы();
	
	Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		Ложь,
		Ядро.Метрика_НазваниеДействий().НажатиеКнопки,
		ПредставлениеМетрики,
		TraceId
	);
	Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		Ядро.Метрика_НазваниеДействий().ОткрытиеФормы,
		,
		,
		,
		TraceId
	);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЕРВИСНЫЕ МЕТОДЫ

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Платформа = Модуль_Платформа();
	Результат = Платформа.Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

// Возвращает форму для вызова сервера без контекста вызывающей формы
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ОбновитьДанные;
	
	Метрика_НажатиеКнопки(ДействиеМетрики, Неопределено);
	
	ОбновитьСписокДоверенностей();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпуститьНовую(Команда)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ВыпуститьНовую;
	
	Метрика_НажатиеКнопки(ДействиеМетрики, Неопределено);
	
	Ссылка = СсылкаНаСтраницуВыпускаНовойМЧД();
	ЗапуститьПриложение(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВВебВерсииДиадока(Команда)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ЗагрузитьВДиадоке;
	
	Метрика_НажатиеКнопки(ДействиеМетрики, Неопределено);
	
	Ссылка = СсылкаНаСтраницуЗагрузкиМЧД();
	ЗапуститьПриложение(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоверенность(Команда)
	
	Метрика_ДобавитьДоверенностьНажатие();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторЯщика", ИдентификаторЯщика);
	
	Модуль_Платформа = Модуль_Платформа();
	
	ОписаниеОповещения = Модуль_Платформа.НовыйОписаниеОповещения("ДобавитьДоверенностьЗавершение", ЭтаФорма);
	
	Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
		"МЧД_ФормаДобавленияУправляемая",
		ЭтаФорма,
		ПараметрыФормы,
		ОписаниеОповещения
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоверенностьЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьСписокДоверенностей();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИдентификаторЯщикаПриИзменении(Элемент)
	
	ОбновитьСписокДоверенностей();
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Кол-во доверенностей", СписокДоверенностей.Количество());
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ИзменитьОтбор;
	
	Метрика_НажатиеКнопки(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоверенностейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = СписокДоверенностей.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле = Элементы.СписокДоверенностейПоУмолчанию Тогда
		ОбработкаВыбораДоверенностиПоУмолчанию(ТекущиеДанные, СтандартнаяОбработка);
	ИначеЕсли Поле = Элементы.СписокДоверенностейПолномочияИРеквизиты Тогда
		ОбработкаОткрытияДетальнойИнформацииПоДоверенности(ТекущиеДанные, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаГиперссылкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ГиперссылкаКакДобавитьДоверенностьНажатие(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаКакДобавитьДоверенностьНажатие(Элемент)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ОткрытьИнструкцию;
	
	Метрика_НажатиеКнопки(ДействиеМетрики, Неопределено);
	
	Ссылка = СсылкаНаСтраницуИнструкцииПоДобавлениюМЧД();
	ЗапуститьПриложение(Ссылка);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСписокВыбораОрганизацийНаФорме(СписокОрганизаций)
	
	Ядро = Модуль_ЯдроНаСервере();
	
	СписокДляОтбора = Элементы.ИдентификаторЯщика.СписокВыбора;
	
	СписокДляОтбораОрганизации = Ядро.Организации_СписокОрганизацийДляВыбора(Ложь);
	
	Для Каждого ТекОрганизация Из СписокДляОтбораОрганизации Цикл
		
		НовыйЭлемент = СписокДляОтбора.Добавить();
		НовыйЭлемент.Значение = ТекОрганизация.Значение;
		НовыйЭлемент.Представление = ТекОрганизация.Представление;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЯщика)
		И ЗначениеЗаполнено(СписокДляОтбора) Тогда
		
		ПервыйЭлемент = СписокДляОтбора[0];
		ИдентификаторЯщика = ПервыйЭлемент.Значение;
		
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ОбновитьСписокДоверенностей()
	
	СписокДоверенностей.Очистить();
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Доверенности = Ядро.МЧД_СписокДоверенностей(ИдентификаторЯщика);
	
	// BSLLS:UnusedLocalVariable-off
	КонтрактыМЧД = Новый ФиксированноеСоответствие(Доверенности);
	// BSLLS:UnusedLocalVariable-on
	
	ЗаполнитьСписокДоверенностей();
	
	Если СписокДоверенностей.Количество() Тогда
		ПоказатьСтраницуСпискаДоверенностей()
	Иначе
		ПоказатьСтраницуИнформацииОбОтсутствииДоверенностей()
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтраницуСпискаДоверенностей()
	
	ГруппаДоверенности = Элементы.ГруппаДоверенности;
	ГруппаДоверенности.ТекущаяСтраница = ГруппаДоверенности.ПодчиненныеЭлементы.ГруппаСписок;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтраницуИнформацииОбОтсутствииДоверенностей()
	
	ГруппаДоверенности = Элементы.ГруппаДоверенности;
	ГруппаДоверенности.ТекущаяСтраница = ГруппаДоверенности.ПодчиненныеЭлементы.ГруппаИнформация;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоверенностей()
	
	СписокДоверенностей.Очистить();
	
	Для Каждого ЭлементСпискаМЧД Из КонтрактыМЧД Цикл
		
		КонтрактМЧД = ЭлементСпискаМЧД.Значение;
		
		НоваяСтрока = СписокДоверенностей.Добавить();
		НоваяСтрока.Идентификатор = КонтрактМЧД.Идентификатор;
		НоваяСтрока.ПоУмолчанию = КонтрактМЧД.ПоУмолчанию;
		НоваяСтрока.СрокДействия = КонтрактМЧД.СрокДействия;
		// BSLLS:MagicNumber-off
		ОсталосьДоОкончанияСрокаДействияДней = (КонтрактМЧД.СрокДействия - ТекущаяДатаСеанса()) / (24 * 60 * 60);
		
		Если ОсталосьДоОкончанияСрокаДействияДней <= 30 Тогда
			НоваяСтрока.ИстекаетСрок = Истина;
		КонецЕсли;
		// BSLLS:MagicNumber-on
		
		НоваяСтрока.ПредставлениеПредставителяИДоверителя = ПредставлениеПредставителяИДоверителя(КонтрактМЧД);
		
		НоваяСтрока.ПолномочияИРеквизиты = АдресВХранилищеКартинкиИнформацияПоДоверенности;
		Если НоваяСтрока.ПоУмолчанию Тогда
			НоваяСтрока.КартинкаДоверенностьПоУмолчанию = АдресВХранилищеКартинкиОсновнаяДоверенность;
		КонецЕсли;
		
		СтрктураОшибок = КонтрактМЧД.СтатусПроверки.СтруктураОшибок;
		
		Если СтрктураОшибок.ИдентификаторСтатуса = "HasWarnings"
			ИЛИ СтрктураОшибок.ИдентификаторСтатуса = "IsNotValid" Тогда

			НоваяСтрока.ЕстьПроблемыСМЧД = "Есть проблемы с МЧД";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеПредставителяИДоверителя(КонтрактМЧД)
	
	Результат = "";
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ШаблонДоверитель = НСтр("ru='%1, %2'");
	
	Представитель = КонтрактМЧД.Представитель.Наименование;
	
	Доверитель = Ядро.Общее_ПодставитьПараметрыВСтроку(
		ШаблонДоверитель,
		КонтрактМЧД.Доверитель.Наименование,
		КонтрактМЧД.Доверитель.ИНН
	);
	
	ШаблонРезультат = НСтр("ru='%1%2%3'");
	
	Результат = Ядро.Общее_ПодставитьПараметрыВСтроку(
		ШаблонРезультат,
		Представитель,
		Символы.ПС,
		Доверитель
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.ГруппаДобавитьДоверенность.Видимость = Ложь;
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	КоллекцияКартинок = Модуль_Ядро.БиблиотекаКартинок();
	
	КартинкаИнформацииПоМЧД = КоллекцияКартинок.КартинкаДанныеСертификата;
	АдресВХранилищеКартинкиИнформацияПоДоверенности = ПоместитьВоВременноеХранилище(КартинкаИнформацииПоМЧД, УникальныйИдентификатор);
	
	КартинкаМЧДпоУмолчанию = КоллекцияКартинок.КартинкаПодразделениеПоУмолчанию;
    АдресВХранилищеКартинкиОсновнаяДоверенность = ПоместитьВоВременноеХранилище(КартинкаМЧДпоУмолчанию, УникальныйИдентификатор);
	
	КартинкаПоиск = КоллекцияКартинок.КартинкаПоиск64;
	АдресВХранилищеКартинкиПоиск = ПоместитьВоВременноеХранилище(КартинкаПоиск, УникальныйИдентификатор);
	
	КартинкаИнструкция = КоллекцияКартинок.КартинкаИнструкцияСиняяКруглая;
	АдресВХранилищеКартинкиИнструкция = ПоместитьВоВременноеХранилище(КартинкаИнструкция, УникальныйИдентификатор);
	
	УстановитьНастройкиЭлементовФормыДляПлатформыВыше8_3_7();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиЭлементовФормыДляПлатформыВыше8_3_7()

	СвойстваЭлементаФормы = Новый Структура;
	
	СвойстваЭлементаФормы.Вставить("ГоризонтальноеПоложениеПодчиненных"	, ГоризонтальноеПоложениеЭлемента.Центр);
	СвойстваЭлементаФормы.Вставить("ВертикальноеПоложениеВГруппе"		, ВертикальноеПоложениеЭлемента.Центр);
	
	СвойстваЭлементаФормы.Вставить("АвтоМаксимальнаяШирина", Ложь);
	СвойстваЭлементаФормы.Вставить("АвтоМаксимальнаяВысота", Ложь);

	ЗаполнитьЗначенияСвойств(Элементы.ГруппаТекстаНетДоверенности, СвойстваЭлементаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// BSLLS:DuplicateStringLiteral-off
	// BSLLS:StyleElementConstructors-off
	// BSLLS:MagicNumber-off
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДоверенностей.ИстекаетСрок");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(246, 156, 0));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДоверенностейСрокДействия");
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДоверенностей.ПоУмолчанию");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(85, 85, 85));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДоверенностейПоУмолчанию");
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДоверенностей.ЕстьПроблемыСМЧД");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 102, 0));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДоверенностейЕстьПроблемыСМЧД");
	
	// BSLLS:MagicNumber-on
	// BSLLS:StyleElementConstructors-on
	// BSLLS:DuplicateStringLiteral-on
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДоверенностиПоУмолчанию(ВыбраннаяСтрока, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Метрика_НазваниеДействий = Ядро.Метрика_НазваниеДействий();
	
	НазваниеФормыДляМетрики = Метрика_НазваниеФормы();
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().НастройкиДоверенности;
	ДействиеМетрики = Метрика_НазваниеДействий.НазначитьПоУмолчанию;
	ЛейблМетрики = Метрика_НазваниеДействий.НажатиеКнопки;
	ПредставлениеМетрики = Метрика_НазваниеФормы();
	
	Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		ЛейблМетрики,
		ПредставлениеМетрики,
		TraceId
	);
	
	Если УстановитьВыбраннойМЧДПризнакПоУмолчаниюНаСервере(ВыбраннаяСтрока.Идентификатор) Тогда
		
		СброситьУДоверенностейПризнакПоУмолчанию();
		
		ВыбраннаяСтрока.ПоУмолчанию = Истина;
		ВыбраннаяСтрока.КартинкаДоверенностьПоУмолчанию = АдресВХранилищеКартинкиОсновнаяДоверенность;
		
		КонтрактМЧД = КонтрактыМЧД.Получить(ВыбраннаяСтрока.Идентификатор);
		КонтрактМЧД.ПоУмолчанию = Истина;
		
		Метрика_ДобавитьСтатистику_ДляОрганизации(
			ИдентификаторЯщика,
			КатегорияМетрики,
			ДействиеМетрики,
			ЛейблМетрики,
			,
			,
			TraceId
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьУДоверенностейПризнакПоУмолчанию()

	Отбор = Новый Структура;
	Отбор.Вставить("ПоУмолчанию", Истина);

	СтрокиСпискаДоверенностей = СписокДоверенностей.НайтиСтроки(Отбор);
	Если СтрокиСпискаДоверенностей.Количество() Тогда
		
		СтрокаСпискаДоверенностей = СтрокиСпискаДоверенностей[0];
		
		СтрокаСпискаДоверенностей.ПоУмолчанию 						= Ложь;
		СтрокаСпискаДоверенностей.КартинкаДоверенностьПоУмолчанию 	= "";
		
		КонтрактМЧД = КонтрактыМЧД.Получить(СтрокаСпискаДоверенностей.Идентификатор);
		КонтрактМЧД.ПоУмолчанию = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьВыбраннойМЧДПризнакПоУмолчаниюНаСервере(ИдентификаторМЧД)
	
	Ядро = Модуль_ЯдроНаСервере();
	
	КонтрактМЧД = КонтрактыМЧД.Получить(ИдентификаторМЧД);
	
	Результат = Ядро.МЧД_УстановитьЗначениеПризнакаПоУмолчанию(ИдентификаторЯщика, КонтрактМЧД);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОткрытияДетальнойИнформацииПоДоверенности(ВыбраннаяСтрока, СтандартнаяОбработка)

	КонтрактМЧД = КонтрактыМЧД[ВыбраннаяСтрока.Идентификатор];
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.МЧД_ПоказатьСведенияОДоверенности(КонтрактМЧД, ЭтаФорма);
	
	Метрика_ПоказатьСведенияОДоверенности(ВыбраннаяСтрока.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Функция СсылкаНаСтраницуЗагрузкиМЧД()
	Возврат "https://diadoc.kontur.ru/BoxId/Preferences";
КонецФункции

&НаКлиенте
Функция СсылкаНаСтраницуВыпускаНовойМЧД()
	Возврат "https://diadoc.kontur.ru";
КонецФункции

&НаКлиенте
Функция СсылкаНаСтраницуИнструкцииПоДобавлениюМЧД()
	Возврат "https://support.kontur.ru/pages/viewpage.action?pageId=83865732";
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеФормы()
	
	Возврат "Форма доверенности";
	
КонецФункции

&НаКлиенте
Процедура Метрика_НажатиеКнопки(ДействиеМетрики, ДопПеременные)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().НастройкиДоверенности;
	НазваниеФормыДляМетрики = Метрика_НазваниеФормы();
	ПредставлениеМетрики = Метрика_НазваниеФормы();
	ЛейблМетрики = Ядро.Метрика_НазваниеДействий().НажатиеКнопки;
	
	Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		ЛейблМетрики,
		ПредставлениеМетрики,
		TraceId
	);
	Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		ЛейблМетрики,
		,
		,
		TraceId
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьДоверенностьНажатие()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Метрика_НазваниеДействий = Ядро.Метрика_НазваниеДействий();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().ДобавлениеМЧД;
	ДействиеМетрики = Метрика_НазваниеДействий.ДобавитьМЧД;
	НазваниеФормы = Метрика_НазваниеФормы();
	ПредставлениеМетрики = Метрика_НазваниеФормы();
	ЛейблМетрики = Метрика_НазваниеДействий.НажатиеКнопки;
	
	Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		КатегорияМетрики,
		ДействиеМетрики,
		ЛейблМетрики,
		ПредставлениеМетрики,
		TraceId
	);
	Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		,
		,
		ПредставлениеМетрики,
		TraceId
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПоказатьСведенияОДоверенности(ИдентификаторМЧД)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().НастройкиДоверенности;
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ПосмотретьДоверенность;
	НазваниеФормы = Метрика_НазваниеФормы();
	ПредставлениеМетрики = Метрика_НазваниеФормы();
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Рег.номер МЧД", ИдентификаторМЧД);
	
	Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		КатегорияМетрики,
		ДействиеМетрики,
		,
		ПредставлениеМетрики,
		TraceId
	);
	Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		,
		ДопПеременные,
		ПредставлениеМетрики,
		TraceId
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_НажатиеКнопки(
	НазваниеФормы,
	НазваниеКатегории,
	НазваниеКнопки,
	НазваниеМетки = "",
	ПредставлениеМетрики = "",
	TraceId = "")
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		НазваниеКатегории,
		НазваниеКнопки,
		НазваниеМетки,
		ПредставлениеМетрики,
		TraceId
	);
	
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-off

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ДляОрганизации(
	ИдентификаторЯщика,
	КатегорияМетрики,
	ДействиеМетрики,
	НазваниеМетки = Неопределено,
	ДопПеременные = Неопределено,
	ПредставлениеМетрики = "",
	TraceId = "")
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		НазваниеМетки,
		ДопПеременные,
		ПредставлениеМетрики,
		TraceId
	);
	
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-on

