// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_ТиповойМодуль;
Перем НеИспользуется_РежимУправляемыхФорм;

Перем Ядро;
Перем ОсновнойМодуль;
Перем ГенерацияXML;
Перем ПечатныеФормы;
Перем РаботаСМаркировкой;
Перем ЭтоРедакция6_1;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормы = Модуль_ПечатныеФормы;
	РаботаСМаркировкой = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормы = Неопределено;
	РаботаСМаркировкой = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html
    
	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		Возврат ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);
		
		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
		
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "УстановитьУсловноеОформление" Тогда
		
		Возврат УстановитьУсловноеОформление(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd970");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd970",	Неопределено,	"ID_СчетФактура");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd970",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd970",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd970",	"ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd970",	"СЧФДОП",		"ID_УПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"СЧФ",			"ID_УПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"ДОП",			"ID_УПД_ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)", 		"ProformaInvoice", 						"");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");

	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	
	Результат = "";
	НужнаВТДокументыБезНДС = Ложь;
	Запросы = Новый Массив;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ДобавитьЗапросПоВидуПакетуПакета(Запросы, ОписаниеВидаПакета);
		
		Если ЭтоВидПакетаБезСчетаФактуры(ОписаниеВидаПакета.ID) Тогда
			
			НужнаВТДокументыБезНДС = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрОбъединениеЗапросов = ТекстЗапроса_ОбъединитьВсе();
	
	Результат = СтрСоединить(Запросы, СтрОбъединениеЗапросов);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;
	
	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		Если МожноСформироватьПередаточныйДокумент(Документ1С.ДокументОснование) Тогда
			
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(
				Пакет,
				Документ1С.ДокументОснование,
				"ID_УПД_ДОП");
			
		КонецЕсли;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С.ДокументОснование);
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_ДИС");	
		
	// Исправления первичных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С.ДокументОснование, "ID_ИУПД_ДОП");
		
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Корректировочные документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_КСЧФ");
				
		Если ТипЗнч(Документ1С.ДокументОснование) <> Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С.ДокументОснование, "ID_УКД_ДИС");
		КонецЕсли;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_КСФ");
		
	// Исправления корректировочных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД_КСЧФ");
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С.ДокументОснование, "ID_ИУКД_ДИС");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИКСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИКСФ");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
	// Исправления СФ на аванс
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Прочие документы
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");		
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СчетФормализованный" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФормализованный");
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html

	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый		 = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры		 = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника			 = Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый)
		Или ОсновнойМодуль.ТипСоответствуетКонтентуУКД(ВидДокументаРазвернутый) Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД"	, УказыватьОтсутствиеОснованияУПД);
		ДополнительныеПараметры.Вставить("ПараметрыСогласования"			, Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"					, ДанныеСотрудника); // Графа 10 (РабОргПрод)
		ДополнительныеПараметры.Вставить("ФИОПодписанта"					, " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД"						, ФункцияУПД);
		ДополнительныеПараметры.Вставить("FormatVersion"					, FormatVersion);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_СчетФормализованный" Тогда
		
		ДополнительныеПараметры = Неопределено;
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" ИЛИ ID = "ID_Счет" Тогда
		
		ДополнительныеПараметры = Новый Структура("ПараметрыСогласования, ФИОПодписанта", Неопределено, " ");
		
		Если ID = "ID_АктСверки" Тогда
			ИмяПечатнойФормы = "АктСверки";
		Иначе 
			ИмяПечатнойФормы = "СчетНаОплату";
			ДополнительныеПараметры.Вставить("СредствамиКонфигурации", Истина);
		КонецЕсли;
		
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ИмяПечатнойФормы, ДополнительныеПараметры);
		
		НомерДокумента = ПредставлениеНомера(Документ1С.Номер);
		
		Результат.Метаданные.DocumentDate	= Документ1С.Дата;
		Результат.Метаданные.DocumentNumber	= СокрЛП(НомерДокумента);
		Результат.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
		
		Если TypeNamedId = "ProformaInvoice" Тогда
			Результат.Метаданные.TotalSum = ДанныеПечатнойФормы.Сумма;
			Результат.Метаданные.TotalVat = ДанныеПечатнойФормы.СуммаНДС;
		КонецЕсли;
		
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
				
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
			
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры)
	
	ЗаполнитьРеквизитыДокумента(Параметры);
	
	Документ				= Параметры.Документ;
	РеквизитыДокумента		= Документ.Реквизиты;
	ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
	ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
	
	ДанныеПечатнойФормы = СформироватьВнешнююПечатнуюФорму(Документ.ДокументУчета, ВнешняяПечатнаяФорма, ИдентификаторКоманды);
	
	Документ.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	Документ.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
	Документ.Метаданные.DocumentDate	= РеквизитыДокумента.Дата;
	Документ.Метаданные.DocumentNumber	= РеквизитыДокумента.Номер;
	
	Если Документ.Метаданные.Свойство("TotalSum") Тогда
		Документ.Метаданные.TotalSum = РеквизитыДокумента.Сумма;
	КонецЕсли;
	
	Если Документ.Метаданные.Свойство("TotalVat") Тогда
		Документ.Метаданные.TotalVat = РеквизитыДокумента.СуммаНДС;
	КонецЕсли;
	
	ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
	ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
	ХранилищеКонтента.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	СлужебнаяИнформация = Документ.СлужебнаяИнформация;
	СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
	
	УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html

	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета = Параметры.Документ.ДокументУчета;
	Реквизиты = Параметры.Документ.Реквизиты;
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЕстьСуммаДокумента = Общее_ЕстьОбщийРеквизит(ДокументУчета.Метаданные(), "СуммаДокумента");
	
	Если ЕстьСуммаДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаДокумента";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОсновнойМодуль.Общее_ЗначенияРеквизитовОбъекта(ДокументУчета, ИменаРеквизитов);
	
	Реквизиты.Номер = СокрЛП(ЗначенияРеквизитов.Номер);
	Реквизиты.Дата = ЗначенияРеквизитов.Дата;
	
	Если ЕстьСуммаДокумента Тогда
		Реквизиты.Сумма = ЗначенияРеквизитов.СуммаДокумента;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////

// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html
	
	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента = Документ.Тип;
	ФункцияДокумента = Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента",	Документ.Реквизиты.Номер);
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваров");
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеАвтомобилей");
		КонецЕсли;
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "КорректировкаПоступления");
		
	ИначеЕсли ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетНаОплату(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетОтПоставщика");
		
	ИначеЕсли ЭтоФормализованныйАктСверки405(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		НачалоПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.BeginDate);
		ОкончаниеПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.EndDate);
		
		Результат = НайтиАктыСверкиВзаиморасчетов(
			Организация,
			Контрагент,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктСверки405(ТипЭД)
	
	Результат = НРег(ТипЭД.ТипДокумента) = НРег("ReconciliationAct")
				И НРег(ТипЭД.ТипКонтента) = НРег("reconciliationact405");
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументАктСверки.Ссылка
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ДокументАктСверки
	|ГДЕ
	|	НЕ ДокументАктСверки.ПометкаУдаления
	|	И ДокументАктСверки.Организация = &Организация
	|	И ДокументАктСверки.Контрагент = &Контрагент
	|	И ДокументАктСверки.ДатаНачала = &ДатаНачала
	|	И ДокументАктСверки.ДатаОкончания = &ДатаОкончания";
	
	Возврат Результат;
	
КонецФункции

Функция НайтиАктыСверкиВзаиморасчетов(Организация, Контрагент, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериодаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	Ошибки = Новый Массив;
	
	Документ = Параметры.Документ;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	
	ПроверитьЗаполнитьИдентификаторОперации(Параметры, Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Документ.Тип.ФункцияДокумента) Тогда
		Результат.ОписаниеОшибки = "Не задана операция для создания учетного документа!";
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторОперации = Параметры.ИдентификаторОперации;
	
	РезультатПроверки = ПроверкаДокументаОснования(Документ, ИдентификаторОперации);
	
	Если ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки) Тогда
		
		Результат.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	Параметры.ДополнительныеПараметры.Вставить("ДокументОснование", РезультатПроверки.ОсновнойОбъект);
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Если НовыйОбъект <> Неопределено Тогда
		
		НовыйОбъект.ОбменДанными.Загрузка = Истина;
		
	КонецЕсли;
	
	Если ИспользоватьДатуЭД
		И НЕ ЭтоФормализованныйАктСверки405(Документ.Тип) Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаНоменклатурыДляСопоставления = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	////https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html

	//Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	//
	//ДокументДД	= Параметры.ДокументДД;
	//ПакетДД		= Параметры.ПакетДД;
	//
	//Ошибки		= Новый Массив;
	//Документ1С	= Неопределено;
	//
	//СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	//
	//ТипДокумента 	= НРег(СтруктураДанных.ТипДокумента);
	//ТипКонтента 	= НРег(СтруктураДанных.ТипКонтента);
	//ФункцияДокумента= НРег(СтруктураДанных.ФункцияДокумента);	
	//
	//Контрагент	= СтруктураДанных.Контрагент;
	//Организация	= СтруктураДанных.Организация;
	//	
	//Если Не ЗначениеЗаполнено(Контрагент) Тогда			
	//	Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
	//	Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	//КонецЕсли;	
	//
	//// Выполним сопоставление документа
	//МассивДокументов1С = ОсновнойМодуль.НайтиСопоставлениеДокумента(Параметры.Документ);
	//
	//Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
	//	Документ1С = МассивДокументов1С[0];
	//КонецЕсли;
	//
	//// НАКЛАДНЫЕ
	//Если ТипДокумента = "xmltorg12" 
	//	ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда		
	//	
	//	Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
	//		Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
	//	Иначе			
	//		ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
	//	КонецЕсли;		
	//	
	//// СЧЕТА-ФАКТУРЫ
	//ИначеЕсли ТипДокумента = "invoice" 
	//	ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда		
	//					
	//	Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
	//		Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
	//	КонецЕсли;
	//	
	//	ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820");
	//	
	//	Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
	//		Ошибки.Добавить("Счет-фактура в старом формате.");
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Результат.Вставить("ДокументДляСопоставления", Документ1С);
	//Результат.Вставить("Ошибки", Ошибки);	
	//
	//Если Ошибки.Количество() > 0 Тогда
	//	Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	//КонецЕсли;
	//
	//Возврат Результат;
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	////https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html

	//Пакет			= Параметры.Пакет;	
	//ДокументыПакета	= Параметры.ДокументыПакета;
	//
	//ДокументыПакета.Колонки.Добавить("ДанныеДокумента");
	//
	//СуммаНакладной 					= Неопределено;
	//СуммаСчетаФактуры 				= Неопределено;
	//ЕстьНесопоставленныеДокументы 	= Ложь;	
	//ЕстьКритичнаяОшибкаПакета 		= Ложь;
	//
	//Ошибки = Новый Массив;
	//
	//// 1. Анализ всех документов пакета
	//
	//Для Каждого ТекДокумент Из ДокументыПакета Цикл
	//	
	//	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ТекДокумент.Ссылка, Пакет);
	//	ТекДокумент.ДанныеДокумента = ДанныеДокумента;
	//	
	//	ДокументДД 		= ТекДокумент.Ссылка;		
	//	ТипДокумента 	= НРег(ДанныеДокумента.ТипДокумента);
	//	ФункцияДокумента= НРег(ДанныеДокумента.ФункцияДокумента);	
	//	
	//	//ошибки, выявленные при выполнении события ПровестиАнализДокумента, распространяем на весь пакет
	//	Если ЗначениеЗаполнено(ДанныеДокумента.ТекстОшибки) Тогда
	//		Ошибки.Добавить(ДанныеДокумента.ТекстОшибки);
	//	КонецЕсли;
	//	
	//	Если ТипДокумента = "xmltorg12" 
	//		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
	//	    СуммаНакладной = ДанныеДокумента.СуммаДокумента;
	//	КонецЕсли;
	//	
	//	Если ТипДокумента = "invoice"
	//		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
	//		СуммаСчетаФактуры = ДанныеДокумента.СуммаДокумента;
	//	КонецЕсли;
	//					
	//	Если (ТипДокумента = "xmltorg12" ИЛИ ТипДокумента = "invoice" ИЛИ ТипДокумента = "universaltransferdocument")
	//		И НЕ ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
	//		ЕстьНесопоставленныеДокументы = Истина;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//
	//// 2. Интерпретация ошибок
	//
	//Если СуммаНакладной = Неопределено Тогда
	//	Ошибки.Добавить("Нет накладной.");
	//КонецЕсли;
	//
	//Если СуммаСчетаФактуры = Неопределено Тогда
	//	Ошибки.Добавить("Нет счета-фактуры.");
	//КонецЕсли;
	//
	//Если СуммаНакладной <> Неопределено И СуммаСчетаФактуры <> Неопределено И СуммаНакладной <> СуммаСчетаФактуры Тогда
	//	Ошибки.Добавить("Не совпадают суммы счета-фактуры и первичного документа.");
	//	//ЕстьКритичнаяОшибкаПакета = Истина; //иногда в СФ могут не включать позиции без НДС, Тогда несовпадение сумм приемлемо
	//КонецЕсли;
	//	
	//ТекстВсехОшибокПакета = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
	//
	//ЕстьКритичнаяОшибкаПакета = (ЕстьКритичнаяОшибкаПакета 
	//							ИЛИ Найти(ТекстВсехОшибокПакета, "ДУБЛИКАТ") <> 0
	//							ИЛИ Найти(ТекстВсехОшибокПакета, "Счет-фактура в старом формате") <> 0);
	//
	////ОшибокНет = (СокрЛП(ТекстВсехОшибокПакета) = ""); //самый жесткий вариант выполнения анализа пакета
	//ОшибокНет = НЕ ЕстьКритичнаяОшибкаПакета;           //менее жесткий вариант выполнения анализа пакета
	//
	//
	//// 3. Формирование контента ответа всех документов пакета
	//
	//Для Каждого ТекДокумент Из ДокументыПакета Цикл
	//	
	//	ДанныеДокумента = ТекДокумент.ДанныеДокумента;
	//	
	//	ДокументДД	= ТекДокумент.Ссылка;		
	//	Документ1С	= ДанныеДокумента.ДокументВ1С;
	//	ТекстОшибки	= ДанныеДокумента.ТекстОшибки;
	//	
	//	НеИзменятьДействиеВДД = ЗначениеЗаполнено(ДанныеДокумента.ТребуемоеДействиеВДД)
	//							И ДанныеДокумента.ТребуемоеДействиеВДД <> "Подписать";
	//	
	//	Если НеИзменятьДействиеВДД ИЛИ Не ЗначениеЗаполнено(Документ1С) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//					
	//	РезультатАнализа = ОсновнойМодуль.ЭДО_НовыйРезультатАнализаВходящегоДокумента();
	//	
	//	РезультатАнализа.Ошибки = ТекстОшибки; // сохраняем ошибки, относящиеся только к текущему документу
	//	//РезультатАнализа.Ошибки = ТекстВсехОшибокПакета; // сохраняем ошибки всего пакета для каждого документа из пакета
	//	
	//	СписокДействийТекДокумента = ОсновнойМодуль.ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументДД, ОшибокНет);		
	//	РезультатАнализа.ДействиеВДД = ?(СписокДействийТекДокумента.Количество()=0, "", СписокДействийТекДокумента[0].Значение);
	//			
	//	Если ЗначениеЗаполнено(РезультатАнализа.ДействиеВДД) Тогда						
	//		РезультатАнализа.Вставить("КонтентОтвета", ПолучитьКонтентОтвета(ДокументДД, Документ1С, РезультатАнализа.ДействиеВДД, ТекстВсехОшибокПакета));			
	//	КонецЕсли;
	//	
	//	РезультатАнализа.Вставить("ДокументДляСопоставления", Документ1С);
	//	ОсновнойМодуль.СохранитьРезультатАнализа(ДокументДД, РезультатАнализа);
	//	
	//КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html

	//ДокументДД 	= Параметры.ДокументДД;
	//ПакетДД 	= Параметры.ПакетДД;
	//
	//ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	//
	//Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
	//	ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
	//	ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
	//	ВызватьИсключение ТекстИсключения;
	//КонецЕсли;
	//
	//Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
	//	
	//	Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
	//	Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	
	//	ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
	//	
	//КонецЕсли;		
	
	Возврат Неопределено;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
		
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваров"		, Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеАвтомобилей"	, Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратОтПокупателя"		, Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваров"		, Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеДопРасходов"	, Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионера"		, Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Справочник.ХозОперации.СчетФактураПолученный"));
			ОтборСФ.Вставить("ХозОперация", ЗначенияОтбора); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		//Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
		//	
		//	ОтборКоррСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
		//	
		//	ЗначенияОтбора = Новый Массив;
		//	ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Справочник.ХозОперации.СчетФактураПолученныйКорректировка"));
		//	ОтборКоррСФ.Вставить("ХозОперация", ЗначенияОтбора);
		//	
		//	ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
		//	
		//КонецЕсли;
		
		//Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
		//	ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления", Отбор);
		//КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетОтПоставщика", Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			Элемент
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции


///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html

	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваров) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваров
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваров).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваров).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваров.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваров.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Проведен = ИСТИНА
	|	И РеализацияТоваров.Организация = &Организация
	|	И РеализацияТоваров.Дата >= &ДатаНачала
	|	И РеализацияТоваров.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваров.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваров.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваров.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Проведен = ИСТИНА
	|	И ПоступлениеТоваров.Организация = &Организация
	|	И ПоступлениеТоваров.Дата >= &ДатаНачала
	|	И ПоступлениеТоваров.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваров.Контрагент
	|	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияАвтомобилей.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияАвтомобилей.Ссылка)
	|ИЗ
	|	Документ.РеализацияАвтомобилей КАК РеализацияАвтомобилей
	|ГДЕ
	|	РеализацияАвтомобилей.Проведен = ИСТИНА
	|	И РеализацияАвтомобилей.Организация = &Организация
	|	И РеализацияАвтомобилей.Дата >= &ДатаНачала
	|	И РеализацияАвтомобилей.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияАвтомобилей.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеАвтомобилей.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеАвтомобилей.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей КАК ПоступлениеАвтомобилей
	|ГДЕ
	|	ПоступлениеАвтомобилей.Проведен = ИСТИНА
	|	И ПоступлениеАвтомобилей.Организация = &Организация
	|	И ПоступлениеАвтомобилей.Дата >= &ДатаНачала
	|	И ПоступлениеАвтомобилей.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеАвтомобилей.Контрагент
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратОтПокупателя.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВозвратОтПокупателя.Ссылка)
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|ГДЕ
	|	ВозвратОтПокупателя.Проведен = ИСТИНА
	|	И ВозвратОтПокупателя.Организация = &Организация
	|	И ВозвратОтПокупателя.Дата >= &ДатаНачала
	|	И ВозвратОтПокупателя.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателя.Контрагент
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратПоставщику.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВозвратПоставщику.Ссылка)
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
	|ГДЕ
	|	ВозвратПоставщику.Проведен = ИСТИНА
	|	И ВозвратПоставщику.Организация = &Организация
	|	И ВозвратПоставщику.Дата >= &ДатаНачала
	|	И ВозвратПоставщику.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратПоставщику.Контрагент
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КорректировкаПоступления.Ссылка)
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.Проведен = ИСТИНА
	|	И КорректировкаПоступления.Организация = &Организация
	|	И КорректировкаПоступления.Дата >= &ДатаНачала
	|	И КорректировкаПоступления.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступления.Контрагент
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КорректировкаРеализации.Ссылка)
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Проведен = ИСТИНА
	|	И КорректировкаРеализации.Организация = &Организация
	|	И КорректировкаРеализации.Дата >= &ДатаНачала
	|	И КорректировкаРеализации.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализации.Контрагент
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияАвтомобилей.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КорректировкаПоступленияАвтомобилей.Ссылка)
	|ИЗ
	|	Документ.КорректировкаПоступленияАвтомобилей КАК КорректировкаПоступленияАвтомобилей
	|ГДЕ
	|	КорректировкаПоступленияАвтомобилей.Проведен = ИСТИНА
	|	И КорректировкаПоступленияАвтомобилей.Организация = &Организация
	|	И КорректировкаПоступленияАвтомобилей.Дата >= &ДатаНачала
	|	И КорректировкаПоступленияАвтомобилей.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияАвтомобилей.Контрагент
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииАвтомобилей.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КорректировкаРеализацииАвтомобилей.Ссылка)
	|ИЗ
	|	Документ.КорректировкаРеализацииАвтомобилей КАК КорректировкаРеализацииАвтомобилей
	|ГДЕ
	|	КорректировкаРеализацииАвтомобилей.Проведен = ИСТИНА
	|	И КорректировкаРеализацииАвтомобилей.Организация = &Организация
	|	И КорректировкаРеализацииАвтомобилей.Дата >= &ДатаНачала
	|	И КорректировкаРеализацииАвтомобилей.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииАвтомобилей.Контрагент
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьУсловноеОформление(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Ustanovit%27_Uslovnoye_Oformleniye.html
	
	Форма = Параметры.Форма;
	
	//входящие документ на подпись
	//ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Направление");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение 	= "Входящее";
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Статус");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Содержит;
	//ОтборЭлемента.ПравоеЗначение 	= "Требуется подпись";
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	Возврат Истина;

КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
	КатегорииПакетов = КатегорииПакетов();
	
	ОсновнойПакет			= КатегорииПакетов.ОсновнойПакет;
	КорректировочныйПакет	= КатегорииПакетов.КорректировочныйПакет;
	СчетФактураНаАванс		= КатегорииПакетов.СчетФактураНаАванс;
	СчетНаОплату			= КатегорииПакетов.СчетНаОплату;
	АктCверки				= КатегорииПакетов.АктCверки;
	БезКатегории			= КатегорииПакетов.БезКатегории;
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД",								"ID_УПД, ID_УПД_ДОП",								ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ОсновнойПакет",		"СФ + ТОРГ12/Акт",					"ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура",	ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_раздельно",		"УПД СЧФ + УПД ДОП",				"ID_УПД_СЧФ, ID_УПД_ДОП",							ОсновнойПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД",								"ID_УКД",											КорректировочныйПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_раздельно",		"УКД КСЧФ + УКД ДИС",				"ID_УКД_КСЧФ, ID_УКД_ДИС",							КорректировочныйПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ",								"ID_КСФ",											КорректировочныйПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СФ_НаАванс",			"СФ (на аванс)",					"ID_СчетФактура",									СчетФактураНаАванс);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_НаАванс",			"УПД СЧФ (на аванс)",				"ID_УПД_СЧФ",										СчетФактураНаАванс);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)",			"ID_Счет",											СчетНаОплату);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки",						"ID_АктСверки",										АктCверки);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)",				"ID_ИУПД",											БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_раздельно",		"УПД СЧФ + УПД ДОП (исправление)",	"ID_ИУПД_СЧФ, ID_ИУПД_ДОП",							БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)",					"ID_ИСФ",											БезКатегории);
	
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)",				"ID_ИУКД",										БезКатегории);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ + УКД ДИС (исправление)",	"ID_ИУКД_КСЧФ, ID_ИУКД_ДИС",						БезКатегории);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)",				"ID_ИКСФ",										БезКатегории);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_НаАванс",			"УПД (исправление на аванс)",		"ID_ИУПД_СЧФ",										БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ_НаАванс",			"СФ (исправление на аванс)",		"ID_ИСФ",											БезКатегории);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12_Акт_БезНДС",	"ТОРГ12/Акт (без СФ)",				"ID_АктФормализованный, ID_ТОРГ12",					БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_БезНДС",			"УПД ДОП (без СФ)",					"ID_УПД_ДОП",										БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_БезНДС",			"УПД ДОП (исправление без СФ)",		"ID_ИУПД_ДОП",										БезКатегории);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_БезНДС",			"УКД ДИС (без СФ)",					"ID_УКД_ДИС",										БезКатегории);
	
	ЗаполнитьНаименованияКатегорийПакетов(ТЗ);
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	МетаданныеДокумента1С = Документ1С.Метаданные();
	
	ЕстьРеквизитПодразделение	= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "ПодразделениеКомпании");
	ЕстьРеквизитОрганизация		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "Организация");
	ЕстьРеквизитКонтрагент		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "Контрагент");
	
	ИменаРеквизитов = Новый Массив;
		
	Если ЕстьРеквизитПодразделение Тогда
		ИменаРеквизитов.Добавить("ПодразделениеКомпании");
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
		
	Разделитель 		= ",";
	ТребуемыеРеквизиты 	= Ядро.СоединитьСтроку(ИменаРеквизитов, Разделитель);
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		Реквизиты = Ядро.Общее_ЗначенияРеквизитовОбъекта(Документ1С, ТребуемыеРеквизиты);
	КонецЕсли;
	
	// В коллекции ПоляОтправителя и ПоляПолучателя индекс элементов соответствует приоритету этих элементов.
	// Чем меньше индекс, тем выше приоритет.
	
	Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(Реквизиты.ПодразделениеКомпании) Тогда
		ПоляОтправителя.Добавить(Реквизиты.ПодразделениеКомпании);
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Организация);
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ПоляПолучателя.Добавить(Реквизиты.Контрагент);
	КонецЕсли;
			
КонецПроцедуры

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	СсылкаНаОбъект = ПараметрыМетодаПечати.МассивОбъектов[0];
	
	ИмяМакета = "ПФ_MXL_СчетНаОплату";
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили") Тогда
		ИмяМакета = "СчетНаОплатуЗаАвтомобили";
	КонецЕсли;
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект);
	
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= ИмяМакета;
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт
	
	ПараметрыСчета = МетаСчетаНаОплату(СчетНаОплату);
	
	Мета.Сумма = ПараметрыСчета.СуммаСНалогом;
	Мета.СуммаНДС = ПараметрыСчета.СуммаНалога;
	
КонецПроцедуры

Функция МетаСчетаНаОплату(СсылкаНаОбъект)
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаСНалогом", 0);
	Результат.Вставить("СуммаНалога", 0);
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТЧ.СуммаВсего КАК СуммаСНалогом,
		|	ТЧ.СуммаНДС КАК СуммаНалога
		|ПОМЕСТИТЬ ПоказателиСчетаНаОплату
		|ИЗ
		|	Документ.СчетНаОплату.Товары КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧ.СуммаВсего,
		|	ТЧ.СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплату.Автоработы КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧ.СуммаВсего,
		|	ТЧ.СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплатуЗаАвтомобили.Автомобили КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧ.СуммаВсего,
		|	ТЧ.СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплатуЗаАвтомобили.Товары КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ.СуммаСНалогом) КАК СуммаСНалогом,
		|	СУММА(ВТ.СуммаНалога) КАК СуммаНалога
		|ИЗ
		|	ПоказателиСчетаНаОплату КАК ВТ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Результат = ПредставлениеНомера(Документ.Номер);
	
	Возврат Результат;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
	
	СписокОснований.Добавить("СчетНаОплату", "Счет на оплату");
	
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетНаОплату"))
	 		ИЛИ (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили"));
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	СоответствияРеквизитов.Номер = "ВхДокНомер";
	СоответствияРеквизитов.дата = "ВхДокДата";
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  КоллекцияДокументов - Массив - коллекция документов учета
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеЭлемента)
		ИЛИ Общее_ЕстьОбщийРеквизит(МетаданныеЭлемента, "Организация") Тогда
		Реквизиты.Добавить("Организация");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеЭлемента)
		ИЛИ Общее_ЕстьОбщийРеквизит(МетаданныеЭлемента, "Контрагент") Тогда
		Реквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	ИменаРеквизитов = СтрСоединить(Реквизиты, ",");
	
	Результат = Общее_ЗначенияРеквизитовОбъектов(КоллекцияДокументов, ИменаРеквизитов);
	
	Возврат Результат;
	
КонецФункции

// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С.
// Для получения подчиненных документов используется критерии отбора СвязанныеДокументы.
//
// Параметры:
//  ДокументУчета	 - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(Документ) Экспорт
	
	Результат = Новый Массив;
		
	СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, Документ);
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДокументОснование");
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если ЭтоЗаказНаряд(ДокументОснование)
			Или ЭтоРеализацияТоваров(ДокументОснование) 
			Или ЭтоРеализацияАвтомобилей(ДокументОснование) Тогда
			
			Результат.Добавить(ДокументОснование);
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, ДокументОснование);			
		
		ИначеЕсли ЭтоЗаказПокупателя(ДокументОснование)
			Или ЭтоЗаказНаАвтомобиль(ДокументОснование) Тогда
			
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, ДокументОснование);
			
		КонецЕсли;
		
	КонецЕсли;

	Результат.Добавить(Документ);	
	
	Возврат Результат;	
	
КонецФункции

Процедура СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, Документ)
	
	СвязанныеДокументы = СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ);
	
	Для Каждого СсылкаНаОбъект Из СвязанныеДокументы Цикл

		Если КоллекцияПриемник.Найти(СсылкаНаОбъект) = Неопределено Тогда
			КоллекцияПриемник.Добавить(СсылкаНаОбъект); 
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, СсылкаНаОбъект)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  Документ - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ)
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодчиненныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.ПодчиненныеДокументы(&Ссылка) КАК ПодчиненныеДокументы";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;	
	
КонецФункции

Функция ЭтоЗаказНаряд(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаряд"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияТоваров(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваров"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияАвтомобилей(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияАвтомобилей"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗаказПокупателя(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗаказНаАвтомобиль(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаАвтомобиль"));
	Возврат Результат;
	
КонецФункции

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка - счет-фактура, основание которой нужно найти;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "ДокументОснование");
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И Результат.Найти(ДокументОснование) = Неопределено Тогда
		Результат.Добавить(ДокументОснование);
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
		
	Если НЕ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КоллекцияОснований = ДокументыОснованияСчетаФактуры(ДокументУчета);
	
КонецПроцедуры

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  СправочникСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = ПредставлениеСтавкиБезНДС();
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("5/105", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5/105";
		ИначеЕсли СтрНайти("7/107", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7/107";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - СправочникСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = "";
		
	ИначеЕсли ЭтоСтавкаНДСИсчисляетсяНалоговымАгентом(ЗначениеСтавки) Тогда
		
		Результат = СтавкаНДСИсчисляетсяНалоговымАгентом();
		
	Иначе
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "##";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредставлениеСтавкиБезНДС(), Справочники.СтавкиНДС.БезНДС);
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентом(), СтавкаНДСИсчисляетсяНалоговымАгентомПредставление());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиНДС.Наименование КАК Наименование,
	|	СтавкиНДС.Ставка КАК Ставка,
	|	СтавкиНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	НЕ СтавкиНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СтрЗаменить(Строка(Выборка.Наименование), "%", ""), Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ

//*****************************************************************************
//{ СБОР КОНТЕНТА УПД970

//{ УПД970. Программный интерфейс

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка		 - ДокументСсылка - ссылка на учетный документ 1С,
//										по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры	 - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаПродавца(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры) Экспорт
	
	Перем Результат;
	
	Если ЭтоСчетФактураВыданный(ДокСсылка) Тогда
		
		Если ЭтоСчетФактураНаАванс(ДокСсылка) Тогда
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданныйНаАванс(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
		Иначе
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданный(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
		КонецЕсли;
			
	ИначеЕсли УПД970_ЭтоПоддерживаемыйТипПервичногоДокумента(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоПервичномуДокументуОбщее(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ДокСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//} УПД970. Программный интерфейс

//{ УПД970. Заполнение протоструктуры по документам

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданный(
	СчетФактура,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокумента(СчетФактура);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	СведенияОДокументахОплаты = ДанныеПоДокументу.СведенияОДокументахОплаты;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;

	Если ДанныеШапки.Исправление Тогда
		УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки);
	Иначе
		УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
	КонецЕсли;
		
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		СведенияОДокументахОплаты);
	
	ОснованиеПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(
		Контент,
		ДанныеШапки);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент, ОснованиеПередачиТоваров, ДополнительныеПараметры);
	УПД970_ЗаполнитьДатуОтгрузки(Контент, ДанныеШапки);

	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	ПересчитыватьНормыВремени = ТребуетсяПересчетНормыВремени(ДанныеШапки.ДокументОснование);
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры,
		ПересчитыватьНормыВремени);
		
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДанныеШапки.ДокументОснование, ФункцияДокумента);

	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Если ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка Тогда
		УПД970_ЗаполнитьСведенияОМаркировкеЧерезСервисКонтурМаркировки(Контент, СчетФактура);
	КонецЕсли;
	
	УПД970_ЗаполнитьПризнакВыбытияИзОборотаМаркируемойПродукции(
		Контент,
		СчетФактура);
	
		Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданныйНаАванс(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		ДанныеПоДокументу.СведенияОДокументахОплаты);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры);
		
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	Контент.Shippers.Очистить();
	Контент.Consignees.Очистить();

	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоПервичномуДокументуОбщее(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокумента(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	ДокументыПередачиТоваров = Новый Массив;
	ДокументыПередачиТоваров.Добавить(ДокСсылка);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(
		Контент,
		ДанныеШапки);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент,
		ОснованияПередачиТоваров,
		ДополнительныеПараметры);
		
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры);
		
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);

	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокСсылка, ФункцияДокумента);
	УПД970_ЗаполнитьДатуОтгрузки(Контент, ДанныеШапки);

	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Если ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка Тогда
		УПД970_ЗаполнитьСведенияОМаркировкеЧерезСервисКонтурМаркировки(Контент, ДокСсылка);
	КонецЕсли;
	
	УПД970_ЗаполнитьПризнакВыбытияИзОборотаМаркируемойПродукции(
		Контент,
		ДокСсылка);
		
	Возврат Контент;
	
КонецФункции

//{ УПД970. Заполнение протоструктуры по документам. Общее

Процедура УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки)
	
	НомерДокумента = УПД970_ПредставлениеНомераДокумента(ДанныеШапки.Номер);
	
	ДобавитьИндексОП = (ЗначениеЗаполнено(ДанныеШапки.ПодразделениеОрганизации)
		И ЭтоРедакция6_1()
		И ЭтоСчетФактураВыданный(ДанныеШапки.Ссылка));
	
	ЧастиНомераДокумента = Новый Массив;
	ЧастиНомераДокумента.Добавить(НомерДокумента);
	
	Если ДобавитьИндексОП Тогда
		
		ИндексПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеШапки.ПодразделениеОрганизации,
			"ЦифровойИндексОбособленногоПодразделения");
			
		Если ЗначениеЗаполнено(ИндексПодразделения) Тогда
			ЧастиНомераДокумента.Добавить(Формат(ИндексПодразделения, "ЧГ=0"));
		КонецЕсли;
			
	КонецЕсли;
	
	Контент.DocumentNumber = СтрСоединить(ЧастиНомераДокумента, "/");
	Контент.DocumentDate = ДанныеШапки.Дата;

КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки)

	Контент.RevisionNumber = ДанныеШапки.НомерИсправления;
	Контент.RevisionDate = ДанныеШапки.Дата;
	
	Контент.DocumentNumber = УПД970_НомерИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки);
	Контент.DocumentDate = УПД970_ДатаИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки);

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, СведенияОДокументахОплаты)
	
	Для Каждого СтрокаТаблицы Из СведенияОДокументахОплаты Цикл
		
		PaymentDocument = Контракт_PaymentDocumentInfo();
		
		PaymentDocument.Number = СтрокаТаблицы.НомерДокумента;
		PaymentDocument.Date = СтрокаТаблицы.ДатаДокумента;
		
		Контент.PaymentDocuments.Добавить(PaymentDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
	Контент,
	РеквизитыОснования,
	ДополнительныеПараметры)
	
	Перем УказыватьОтсутствиеОснованияУПД;
	
	TransferInfo = Контракт_TransferInfo970();
	Контент.TransferInfo = TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	ДополнительныеПараметры.Свойство("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
	
	РеквизитыЗаполнены = УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования);
		
	Если Не РеквизитыЗаполнены
		И УказыватьОтсутствиеОснованияУПД = Истина Тогда
		
		TransferInfo.TransferBases.Очистить();
		
	Иначе
		
		TransferBase = УПД970_НовыйTransferBase(РеквизитыОснования);
		TransferInfo.TransferBases.Добавить(TransferBase);
		
	КонецЕсли;
	
	Если TransferInfo.TransferBases.Количество() = 0 Тогда
		TransferInfo.WithoutTransferBase = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ИсходныйДокумент, ФункцияДокумента)
	
	ДокументОтгрузки = УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент);
	
	СтрокиТаблицы = Контент.Table.Items;
	
	НаименованиеДокумента = УПД970_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		РеквизитыДокументаОтгрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДокументОтгрузки,
			"Дата, Номер");
			
		НомерДокумента = УПД970_ПредставлениеНомераДокумента(РеквизитыДокументаОтгрузки.Номер);
		ДатаДокумента = РеквизитыДокументаОтгрузки.Дата;
		
		DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
		Контент.DocumentShipments.Добавить(DocumentShipment);
			
	Иначе
		
		НомерДокумента = Контент.DocumentNumber;
		ДатаДокумента = Контент.DocumentDate;
		
		DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
		Контент.DocumentShipments.Добавить(DocumentShipment);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента)
	
	Если ФункцияДокумента <> ФункцияДокументаУПД_СЧФ()
		И Контент.DocumentShipments.Количество() > 0 Тогда
		Контент.DocumentName = Контент.DocumentShipments[0].Name;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуОтгрузки(Контент, ДанныеШапки)
	
	Если Контент.Function <> ФункцияДокументаУПД_СЧФ() Тогда
		
		ДатаОтгрузки = ДанныеШапки.ДатаОтгрузки;
		Если Не ЗначениеЗаполнено(ДатаОтгрузки) Тогда
			ДатаОтгрузки = ДанныеШапки.Дата;
		КонецЕсли;

		Контент.TransferInfo.TransferDate = ДатаОтгрузки;

	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки)
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	
	Контент.Currency = Валюта.Код;

КонецПроцедуры

Процедура УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент)
	
	Контент.DocumentCreator = "";
	Контент.DocumentCreatorBase = "";
	
	Если Контент.Sellers.Количество() > 0 Тогда
		
		ПродавецИнфо = Контент.Sellers[0];
		Контент.DocumentCreator = ПредставлениеЮрФизЛица(ПродавецИнфо.Name, ПродавецИнфо.Inn, ПродавецИнфо.Kpp);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки)
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОбУчастникахЭДО.Организация);
	Seller.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОбУчастникахЭДО.Контрагент);
	Buyer.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Контрагент.Ссылка;
	
	ВДокументеЕстьТовары = УПД970_ВДокументеЕстьТовары(Контент.Table.Items);

	Грузоотправитель = СведенияОбУчастникахЭДО.Грузоотправитель;
	Если Грузоотправитель <> Неопределено
		И ВДокументеЕстьТовары Тогда
		
		Shipper = Контракт_Shipper970();
		Shipper.SameAsSeller = Ложь;
		
		Контент.Shippers.Добавить(Shipper);
		
		Если Грузоотправитель.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка
			И Контент.Function <> ФункцияДокументаУПД_ДОП() Тогда
			
			Shipper.SameAsSeller = Истина;
			
		Иначе
			
			ShipperInfo = Контракт_ExtendedOrganizationInfo970();
			Shipper.OrganizationInfo = ShipperInfo;
			
			УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, Грузоотправитель);
			
			ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СведенияОбУчастникахЭДО.Грузополучатель <> Неопределено
		И ВДокументеЕстьТовары Тогда
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		Контент.Consignees.Добавить(Consignee);

		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, СведенияОбУчастникахЭДО.Грузополучатель);
		
		Consignee.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Грузополучатель.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьExtendedOrganizationInfo(Content, ДанныеУчастникаЭДО)
	
	Content.Type = УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО);
	
	Content.Name = ДанныеУчастникаЭДО.Наименование;
	
	Content.Inn = ДанныеУчастникаЭДО.ИНН;
	Content.Kpp = ДанныеУчастникаЭДО.КПП;
	Content.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	Content.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
	
	Content.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРНИП;
	Content.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаОГРНИП;
	
	Content.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	
	Content.Country = ДанныеУчастникаЭДО.СтранаНаименование;
	Content.CountryCode = ДанныеУчастникаЭДО.СтранаКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		Content.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.ЭлектроннаяПочта) Тогда
		Content.Email.Добавить(ДанныеУчастникаЭДО.ЭлектроннаяПочта);
	КонецЕсли;
	
	Content.BankName = ДанныеУчастникаЭДО.НаименованиеБанка;
	Content.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	Content.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	Content.BankId = ДанныеУчастникаЭДО.БИК;
	
	УПД970_ЗаполнитьAddressInfo(Content, ДанныеУчастникаЭДО.Адрес);
	
	Content.СлужебнаяИнформация.Ссылка = ДанныеУчастникаЭДО.Ссылка;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьAddressInfo(OrganizationInfo, СведенияОбАдресе)
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат;
	КонецЕсли;
	
	AddressInfo = Контракт_AddressInfo970();
	OrganizationInfo.Address = AddressInfo;
	
	ВидыАдресов = ГенерацияXML.Перечисление_ВидыАдресов();
	
	ЭтоАдресВФорматеГАР = УПД970_ЭтоАдресВФорматеАдрГАР(СведенияОбАдресе);
	ЭтоАдресВФорматеРФ = УПД970_ЭтоАдресВФорматеАдрРФ(СведенияОбАдресе);
	
	Если ЭтоАдресВФорматеГАР Тогда
		
		AddressSAR = УПД970_НовыйAddressSAR(СведенияОбАдресе);
		
		AddressInfo.AddressSAR = AddressSAR;
		AddressInfo.Type = ВидыАдресов.АдресГАР;
		
	ИначеЕсли ЭтоАдресВФорматеРФ Тогда
		
		AddressRF = УПД970_НовыйAddressRF(СведенияОбАдресе);
		
		AddressInfo.AddressRF = AddressRF;
		AddressInfo.Type = ВидыАдресов.АдресРФ;
		
	Иначе
		
		AddressText = УПД970_НовыйAddressText(СведенияОбАдресе);
		
		AddressInfo.AddressText = AddressText;
		AddressInfo.Type = ВидыАдресов.АдресСтрокой;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Поселение) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.Поселение;
		AddressSAR.SettlementCode = СведенияОбАдресе.КодПоселения;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.ВнутригородскойРайон) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.ВнутригородскойРайон;
		AddressSAR.SettlementCode = "4";
		
	Иначе
		
		AddressSAR.Settlement = "";
		AddressSAR.SettlementCode = "";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОНаселенномПункте(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.НаселенныйПункт) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.НаселенныйПункт;
		AddressSAR.LocalityType = СведенияОбАдресе.НаселенныйПунктТипКраткий;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.Город) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.Город;
		AddressSAR.LocalityType = СведенияОбАдресе.ГородТипКраткий;
		
	Иначе
		
		AddressSAR.Locality = "";
		AddressSAR.LocalityType = "";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТерритории(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Территория) Тогда
		AddressSAR.PlanningElement = СведенияОбАдресе.Территория;
		AddressSAR.PlanningElementType = СведенияОбАдресе.ТерриторияТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОУлице(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Улица) Тогда
		AddressSAR.StreetElement = СведенияОбАдресе.Улица;
		AddressSAR.StreetElementType = СведенияОбАдресе.УлицаТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОЗданиях(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание.Номер)
		И ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания) Тогда
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = СведенияОбАдресе.Здание.Номер;
		AddressObject.Type = СведенияОбАдресе.Здание.ТипЗдания;
		
	КонецЕсли;

	Для Каждого Корпус Из СведенияОбАдресе.Корпуса Цикл
		
		Если Не ЗначениеЗаполнено(Корпус.Номер)
			И Не ЗначениеЗаполнено(Корпус.ТипКорпуса) Тогда
			Продолжить;
		КонецЕсли;
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = Корпус.Номер;
		AddressObject.Type = Корпус.ТипКорпуса;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииЗдания(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыПомещений = УПД970_ТипыПомещений();
	
	Для Каждого ТипПомещения Из ТипыПомещений Цикл
		
		ПомещениеЗдания = Ядро.МассивСтруктур_Найти(Помещения, ТипПомещения, "ТипПомещения");
		Если ПомещениеЗдания <> Неопределено Тогда
			
			AddressSAR.House = ПомещениеЗдания.Номер;
			AddressSAR.HouseType = ПомещениеЗдания.ТипПомещения;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииКвартиры(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыАпартаментов = УПД970_ТипыАпартаментов();
	
	Для Каждого ТипАппартаментов Из ТипыАпартаментов Цикл
		
		ПомещениеКвартиры = Ядро.МассивСтруктур_Найти(Помещения, ТипАппартаментов, "ТипПомещения");
		Если ПомещениеКвартиры <> Неопределено Тогда
			
			AddressSAR.Apartment = ПомещениеКвартиры.Номер;
			AddressSAR.ApartmentType = ПомещениеКвартиры.ТипПомещения;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(Контент, ДанныеПоДокументу, ДополнительныеПараметры, ПересчитыватьНормыВремени = Ложь)
	
	Перем КодыМаркировки;
	
	ТабличныеДанные = ДанныеПоДокументу.ТабличныеДанные;
	
	Если ДанныеПоДокументу.Свойство("КодыМаркировки")
		И ЗначениеЗаполнено(ДанныеПоДокументу.КодыМаркировки) Тогда
		
		КодыМаркировки = ДанныеПоДокументу.КодыМаркировки.Скопировать();
		КодыМаркировки.Колонки.Добавить("Обработан", Новый ОписаниеТипов("Булево"));
		
	КонецЕсли;
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	
	ВсеСтрокиБезНДС = Истина;
	
	Если Контент.Table = Неопределено Тогда
		Table = Контракт_InvoiceTable970();
		Контент.Table = Table;
	Иначе
		Table = Контент.Table;
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы);
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			Количество = Окр(СтрокаТаблицы.Количество, ТочностьКоличества);
			Если ПересчитыватьНормыВремени
				И ТипЗнч(СтрокаТаблицы.Номенклатура) <> Тип("СправочникСсылка.Номенклатура")
				И ЕстьРеквизит(СтрокаТаблицы, "Коэффициент") Тогда
				Количество = Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Коэффициент, ТочностьКоличества);
			КонецЕсли;
			
			Item.Quantity = Количество;
			
		КонецЕсли;
		
		ПредставлениеСтавки = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		
		Item.TaxRate = ПредставлениеСтавки;
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		
		Item.Price = 0;
		Если Количество <> 0 Тогда
			Item.Price = Окр(СтрокаТаблицы.СуммаБезНДС / Количество, ТочностьЦены);
		КонецЕсли;
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		
		УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(
			Item,
			СтрокаТаблицы,
			КодыМаркировки,
			ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка);
			
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		УПД970_РассчитатьИтогиПоТаблице(Table, Item);

	КонецЦикла;
	
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(Контент, ТабличныеДанные, ДополнительныеПараметры)
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;

	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
			
		Item = Контракт_Item970();
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПолноеНаименование) Тогда
			НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураПолноеНаименование;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураНаименование) Тогда
			НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураНаименование;
		Иначе
			НаименованиеНоменклатуры = "Предварительная оплата";
		КонецЕсли;
		
		Item.Product = НаименованиеНоменклатуры;
		Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
		
		ПредставлениеСтавки = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		Item.TaxRate = ПредставлениеСтавки;
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияСтроки();
		Item.СлужебнаяИнформация.Номенклатура = СтрокаТаблицы.Номенклатура;
		Item.СлужебнаяИнформация.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.Vat = ТабличныеДанные.Итог("СуммаНДС");
	Table.Total = ТабличныеДанные.Итог("СуммаВсего");
	
КонецПроцедуры

Процедура УПД970_РассчитатьИтогиПоТаблице(Table, Item)

	Если Table.TotalNet = Неопределено Тогда
		Table.TotalNet = 0;
	КонецЕсли;
	
	Если Table.TotalWithVatExcluded = Неопределено Тогда
		Table.TotalWithVatExcluded = 0;
	КонецЕсли;
	
	Если Table.Vat = Неопределено Тогда
		Table.Vat = 0;
	КонецЕсли;
	
	Если Table.Total = Неопределено Тогда
		Table.Total = 0;
	КонецЕсли;
	
	Если Item.Quantity <> Неопределено Тогда
		Table.TotalNet = Table.TotalNet + Item.Quantity;
	КонецЕсли;
	
	Table.Vat = Table.Vat + Item.Vat;
	Table.TotalWithVatExcluded = Table.TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
	Table.Total = Table.Total + Item.Subtotal;

КонецПроцедуры

Процедура УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы)
	
	Item.Product = УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы);
	Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
	
	РежимВыводаКода = УправлениеПечатьюПлатформа.ПолучитьПараметрыРежимаВыводаКодаВДокументах().Имя;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Артикул)
		И (РежимВыводаКода = "Артикул" Или РежимВыводаКода = "АртикулИПроизводитель") Тогда
		Item.ItemVendorCode = СокрЛП(СтрокаТаблицы.Артикул);
	Иначе
		Item.ItemVendorCode = СокрЛП(СтрокаТаблицы.КодНоменклатуры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
		
		КодЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод);
		ИмяЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
		
		Item.Unit = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕИ);
		Item.UnitName = ИмяЕИ;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(
	Item,
	СтрокаТаблицы,
	КодыМаркировки,
	ИспользуетсяСервисКонтурМаркировки)
	
	УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаТаблицы);
	
	Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
		УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СтрокаТаблицы);
	КонецЕсли;
	
	Если Не ИспользуетсяСервисКонтурМаркировки Тогда
		УПД970_ЗаполнитьКодыМаркировкиВСтрокеКонтента(Item, КодыМаркировки, СтрокаТаблицы);
	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ЗаполнитьКодыМаркировкиВСтрокеКонтента(Item, КодыМаркировки, СтрокаТаблицы)
	
	Если Не ЗначениеЗаполнено(КодыМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", СтрокаТаблицы.Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаТаблицы.ХарактеристикаНоменклатуры);
	Отбор.Вставить("Обработан", Ложь);
	
	КодыМаркировкиПоТовару = КодыМаркировки.НайтиСтроки(Отбор);
	
	ИдентификационныйНомер = Контракт_ItemIdentificationNumber970();

	Для Каждого ДанныеМаркировки Из КодыМаркировкиПоТовару Цикл
		
		КодМаркировки = УПД970_КодМаркировкиБезСкобок(ДанныеМаркировки.КодМаркировки);
		ИдентификационныйНомер.Units.Добавить(КодМаркировки);
		
		ДанныеМаркировки.Обработан = Истина;
		
	КонецЦикла;
	
	Если ИдентификационныйНомер.Units.Количество() > 0 Тогда
		Item.ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаТаблицы)
	
	СтранаПроисхожденияРоссия = (СтрокаТаблицы.СтранаПроисхожденияКод = ОсновнаяСтрана().Код);
	
	ЕстьСведенияГТД = (ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД)
		Или ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхожденияКод));
		
	Если СтранаПроисхожденияРоссия
		Или Не ЕстьСведенияГТД Тогда
		Возврат;
	КонецЕсли;
	
	СтранаПроисхожденияЧленЕАЭС = СтранаЧленЕАЭС(СтрокаТаблицы.СтранаПроисхожденияКод);
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД) И СтранаПроисхожденияЧленЕАЭС Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
		НомерГТД = УПД970_РегистрационныйНомерПрослеживаемогоТовара();
	Иначе
		НомерГТД = СокрЛП(СтрокаТаблицы.НомерГТД);
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = СтрокаТаблицы.СтранаПроисхожденияКод;
	CustomDeclaration.DeclarationNumber = НомерГТД;
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СтрокаТаблицы)
	
	ItemTracingInfo = Контракт_ItemTracingInfo970();
	
	ItemTracingInfo.RegNumberUnit = СокрЛП(СтрокаТаблицы.НомерГТД);
	ItemTracingInfo.Quantity = Item.Quantity;
	ItemTracingInfo.SumWithoutVat = Окр(Item.SubtotalWithVatExcluded, 0);
	ItemTracingInfo.Unit = Item.Unit;
	ItemTracingInfo.UnitName = Item.UnitName;
	
	Item.ItemTracingInfos.Добавить(ItemTracingInfo);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры)
	
	Перем ДанныеСотрудника;
	
	ДополнительныеПараметры.Свойство("ДанныеСотрудника", ДанныеСотрудника);
		
	ЕстьТовары = УПД970_ВДокументеЕстьТовары(Контент.Table.Items);
	
	НеобходимоЗаполнитьСведения = (ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность)
		И Контент.Function <> ФункцияДокументаУПД_СЧФ()
		И ЕстьТовары);
	
	Если НеобходимоЗаполнитьСведения Тогда
		
		Employee = Контракт_Employee970();
		
		Employee.Surname = ДанныеСотрудника.Фамилия;
		Employee.FirstName = ДанныеСотрудника.Имя;
		Employee.Patronymic = ДанныеСотрудника.Отчество;
		Employee.EmployeePosition = ДанныеСотрудника.Должность;
		
		Контент.TransferInfo.Employee = Employee;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент)
	
	ЕстьПрослеживаемыеТовары = Ложь;
	
	Для Каждого Item Из Контент.Table.Items Цикл
		Если Item.ItemTracingInfos.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТовары = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПризнакиТоваров = ГенерацияXML.Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваровУПД970(ЕстьПрослеживаемыеТовары);
	
	ГенерацияXML.Заполнить_ПризнакиПрослеживаемыхИМаркируемыхТоваровДокументаУПД970(Контент, ПризнакиТоваров);

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОМаркировкеЧерезСервисКонтурМаркировки(Контент, СсылкаНаОбъект)
	
	Попытка
		
		РаботаСМаркировкой.ЗаполнитьСведенияОМаркировке970(Контент);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ПодробнаяОшибка = Ядро.Общее_ПодставитьПараметрыВСтроку(
			"Не удалось заполнить сведения о маркировке по причине:
			|%1",
			ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
			"Диадок.РаботаСМаркировкой",
			УровеньЖурналаРегистрации.Ошибка,
			СсылкаНаОбъект.Метаданные(),
			СсылкаНаОбъект,
			ПодробнаяОшибка);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО)
	
	ВидыЮрФизЛиц = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	ЭтоФизЛицо = ДанныеУчастникаЭДО.ЭтоФизЛицо;
	ЭтоЮрЛицо = ДанныеУчастникаЭДО.ЭтоЮрЛицо;
	ЭтоРезидент = НЕ ДанныеУчастникаЭДО.Нерезидент;
	
	Если Не ЭтоЮрЛицо И Не ЭтоФизЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИндивидуальныйПредприниматель;
		
	ИначеЕсли ЭтоЮрЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ЮридическоеЛицо;
		
	ИначеЕсли ЭтоФизЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ФизическоеЛицо;
		
	ИначеЕсли Не ЭтоЮрЛицо И Не ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностранныйГражданин;
		
	ИначеЕсли ЭтоЮрЛицо И Не ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностраннаяОрганизация;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Не удалось определить тип участника ЭДО.
				|Заполните корректные реквизиты участников ЭДО в базе 1С 
				|(организация, грузоотправитель, контрагент, грузополучатель)'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЭтоАдресВФорматеАдрГАР(СведенияОбАдресе)
	
	Результат = Ложь;
	
	Если СведенияОбАдресе.ТипАдреса <> МуниципальныйАдрес()
		Или НЕ ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторАдресногоОбъекта) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ТипыПомещений = УПД970_ТипыПомещений();
	ТипыАпартаментов = УПД970_ТипыАпартаментов();
	
	Помещения = Новый Массив;
	Апартаменты = Новый Массив;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		Если ТипыПомещений.Найти(Элемент.ТипПомещения) <> Неопределено Тогда
			Помещения.Добавить(Элемент);
		КонецЕсли;
		
		Если ТипыАпартаментов.Найти(Элемент.ТипПомещения) <> Неопределено Тогда
			Апартаменты.Добавить(Элемент);
		КонецЕсли;
		
		Если Помещения.Количество() > 1
			ИЛИ Апартаменты.Количество() > 1 Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Помещения.Количество() <= 1
		И Апартаменты.Количество() <= 1 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЭтоАдресВФорматеАдрРФ(СведенияОбАдресе)
	
	МаксимальноеКоличествоКорпусовИПомещений = 1;
	
	Результат = (СведенияОбАдресе.ТипАдреса = АдминистративноТерриториальныйАдрес()
		И ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона)
		И СведенияОбАдресе.Корпуса.Количество() <= МаксимальноеКоличествоКорпусовИПомещений
		И СведенияОбАдресе.Помещения.Количество() <= МаксимальноеКоличествоКорпусовИПомещений
		И ТипКорпусаСоответствуетКлассификатору(СведенияОбАдресе.Корпуса)
		И ТипПомещенияСоответствуетКлассификатору(СведенияОбАдресе.Помещения));
	
	Возврат Результат;
	
КонецФункции

Функция ТипКорпусаАдрРФ()
	
	Возврат "Корпус";
	
КонецФункции

Функция ТипПомещенияАдрРФ()
	
	Возврат "Квартира";
	
КонецФункции

Функция ТипКорпусаСоответствуетКлассификатору(Корпуса)

	Результат = Истина;
	
	Если ЗначениеЗаполнено(Корпуса)
		И ВРЕГ(Корпуса[0].ТипКорпуса) <> ВРЕГ(ТипКорпусаАдрРФ()) Тогда
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипПомещенияСоответствуетКлассификатору(Помещения)

	Результат = Истина;
	
	Если ЗначениеЗаполнено(Помещения)
		И ВРЕГ(Помещения[0].ТипПомещения) <> ВРЕГ(ТипПомещенияАдрРФ()) Тогда
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйAddressSAR(СведенияОбАдресе)
	
	Результат = Контракт_AddressSARInfo();
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома) Тогда
		Результат.ID = СведенияОбАдресе.ИдентификаторДома;
	Иначе
		Результат.ID = СведенияОбАдресе.ИдентификаторАдресногоОбъекта;
	КонецЕсли;
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = УПД970_ПредставлениеРегиона(СведенияОбАдресе);
	
	Результат.MunicipalDistrict = СведенияОбАдресе.МуниципальныйРайон;
	Результат.MunicipalDistrictCode = СведенияОбАдресе.КодМуниципальногоРайона;
	
	УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОНаселенномПункте(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОТерритории(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОУлице(Результат, СведенияОбАдресе);
	
	Результат.LandPlot = СведенияОбАдресе.НомерЗемельногоУчастка;
	
	УПД970_ЗаполнитьСведенияОЗданиях(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииЗдания(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииКвартиры(Результат, СведенияОбАдресе);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйAddressRF(СведенияОбАдресе)
	
	Результат = Контракт_AddressRFInfo();
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = СведенияОбАдресе.Регион;
	Результат.Territory = СведенияОбАдресе.Район;
	
	Результат.City = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Город,
		СведенияОбАдресе.ГородСокращение);
	
	Результат.Locality = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.НаселенныйПункт,
		СведенияОбАдресе.НаселенныйПунктСокращение);
		
	Результат.Street = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Улица,
		СведенияОбАдресе.УлицаСокращение);
	
	ИмяПоляНомер = "Номер";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание) Тогда 
		СведенияОбАдресе.Здание.Свойство(ИмяПоляНомер, Результат.Building);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса) Тогда 
		СведенияОбАдресе.Корпуса[0].Свойство(ИмяПоляНомер, Результат.Block);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда 
		СведенияОбАдресе.Помещения[0].Свойство(ИмяПоляНомер, Результат.Apartment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйAddressText(СведенияОбАдресе)
	
	Результат = Контракт_AddressTextInfo();
	
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	Если СведенияОбАдресе.ТипАдреса = МуниципальныйАдрес()
		И ЗначениеЗаполнено(СведенияОбАдресе.МуниципальноеПредставление) Тогда
		
		ПредставлениеАдреса = СведенияОбАдресе.МуниципальноеПредставление;
		
	КонецЕсли;
	
	Результат.AddressText = ПредставлениеАдреса;
	Результат.CountryCode = СведенияОбАдресе.КодСтраны;
	Результат.Country = СведенияОбАдресе.Страна;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипыАпартаментов()
	
	Результат = Новый Массив;
	Результат.Добавить("Комната");
	Результат.Добавить("Бокс");
	Результат.Добавить("А/Я");
	Результат.Добавить("В/Ч");
	Результат.Добавить("П/О");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипыПомещений()
	
	Результат = Новый Массив;
	Результат.Добавить("Офис");
	Результат.Добавить("Квартира");
	Результат.Добавить("Помещение");
	Результат.Добавить("Этаж");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеРегиона(СведенияОбАдресе)
	
	КодыРегионов = ГенерацияXML_КодыРегионов();
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		Результат = КодыРегионов.Получить(XMLЗначение(Тип("Число"), СведенияОбАдресе.КодРегиона));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		ЧастиРегиона = Новый Массив;
		ЧастиРегиона.Добавить(СокрЛП(СведенияОбАдресе.Регион));
		ЧастиРегиона.Добавить(НРег(СведенияОбАдресе.РегионТипКраткий));
		
		Результат = СтрСоединить(ЧастиРегиона, " ");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НомерИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки)
	
	Если ЗначениеЗаполнено(ДанныеШапки.НомерИсходногоДокумента) Тогда
		НомерДокумента = ДанныеШапки.НомерИсходногоДокумента;
	Иначе
		НомерДокумента = ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Результат = УПД970_ПредставлениеНомераДокумента(НомерДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДатаИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки)
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДатаИсходногоДокумента) Тогда
		Результат = ДанныеШапки.ДатаИсходногоДокумента;
	Иначе
		Результат = ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйTransferBase(РеквизитыОснования)
	
	Результат = Контракт_TransferBases970();
	
	Результат.Name = РеквизитыОснования.Наименование;
	Результат.Number = РеквизитыОснования.Номер;
	Результат.Date = РеквизитыОснования.Дата;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	Результат.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	Результат.Номенклатура = СтрокаТаблицы.Номенклатура;
	Результат.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
	Результат.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
	Результат.НомерГТД = СтрокаТаблицы.НомерГТД;
	Результат.ПрослеживаемыйТовар = СтрокаТаблицы.ПрослеживаемыйТовар;
	Результат.Характеристика = СтрокаТаблицы.ХарактеристикаНоменклатуры;

	Результат.ДокументОтгрузки = СтрокаТаблицы.ДокументОтгрузки;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыВТерминахПрото(ТипНоменклатуры)
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Если ТипНоменклатуры = УПД970_ТипНоменклатурыУслуга() Тогда
		Результат = ТипыНоменклатуры.Услуга;
	ИначеЕсли ТипНоменклатуры = УПД970_ТипНоменклатурыРабота() Тогда
		Результат = ТипыНоменклатуры.Работа;
	Иначе
		Результат = ТипыНоменклатуры.Имущество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы)
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Содержание) Тогда
		НаименованиеНоменклатуры = СтрокаТаблицы.Содержание;
	ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПолноеНаименование) Тогда
		НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураПолноеНаименование;
	Иначе
		НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураНаименование;
	КонецЕсли;
	
	ХарактеристикаНоменклатуры = "";
	Если ЗначениеЗаполнено(СтрокаТаблицы.ХарактеристикаНоменклатуры) Тогда
		ХарактеристикаНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СтрокаТаблицы.ХарактеристикаНоменклатуры,
			"Наименование");
	КонецЕсли;
	
	ПредставлениеДопСведенийОНоменклатуре = "";
	Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда
		ПредставлениеДопСведенийОНоменклатуре = СтрШаблон(" (%1)", ХарактеристикаНоменклатуры);
	КонецЕсли;
	
	Результат = НаименованиеНоменклатуры + ПредставлениеДопСведенийОНоменклатуре;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РегистрационныйНомерПрослеживаемогоТовара()
	Возврат "Прослеж";
КонецФункции

Функция УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента)
	
	Результат = Контракт_DocumentShipments970();
	
	Результат.Name = НаименованиеДокумента;
	Результат.Number = НомерДокумента;
	Результат.Date = ДатаДокумента;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФДОП() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	Иначе
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьТовары(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеНомераДокумента(НомерДокумента)
	
	УдалятьПрефиксы = НЕ Константы.ПолныйНомерДокументаВПечатныхФормах.Получить();
	
	УдалитьПрефиксИнформационнойБазы = УдалятьПрефиксы;
	УдалитьПользовательскийПрефикс = УдалятьПрефиксы;
	УдалитьНулиВНомере = УдалятьПрефиксы;
	
	Результат = ПредставлениеНомера(
			НомерДокумента,
			УдалитьПрефиксИнформационнойБазы,
			УдалитьПользовательскийПрефикс,
			УдалитьНулиВНомере);
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Заполнение протоструктуры по документам. Общее

//} УПД970. Заполнение протоструктуры по документам

//{ УПД970. Исходные данные по документам

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(ДокСсылка)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданный();
	ТекстЗапросаДанныхОДокументахОплаты = УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхОДокументахОплаты);
	
	РезультатыЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	Результат = УПД970_Контракт_ДанныеСчетФактураВыданный();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	УПД970_ДополнитьДанныеШапкиЗначениямиДополнительныхСвойств(ДанныеШапки);

	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	
	СведенияОДокументахОплаты = РезультатыЗапроса[2].Выгрузить();
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.ЭтоСчетФактураНаАванс = Ложь;
	
	УПД970_ДополнитьДанныеСчетФактурыСведениямиОКодахМаркировки(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданныйНаАванс());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный());
	
	ТекстЗапроса = Ядро.СоединитьСтроку(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	УПД970_ЗаменитьИменаПараметровВТекстеЗапросаНаВыражения(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = УПД970_Контракт_ДанныеСчетФактураВыданный();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	СведенияОДокументахОплаты = РезультатыЗапроса[2].Выгрузить();
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.ЭтоСчетФактураНаАванс = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаРеализацияТоваров(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияТоваров());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияТоваров());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаКодовМаркировкиТоваровДокументаРеализацияТоварах());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = РезультатЗапроса[2];
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализации());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаКодовМаркировкиТоваровДокументаКорректировкаРеализации());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = РезультатЗапроса[2];
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаРеализацияАвтомобилей(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияАвтомобилей());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияАвтомобилей());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаКорректировкаРеализацииАвтомобилей(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализацииАвтомобилей());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализацииАвтомобилей());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомитенту(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитенту());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитенту());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомитентуЗаАвтомобили(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитентуЗаАвтомобили());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитентуЗаАвтомобили());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомиссионера(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионера());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионера());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомиссионераЗаАвтомобили(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионераЗаАвтомобили());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионераЗаАвтомобили());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаВозвратПоставщику(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратПоставщику());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратПоставщику());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаКодовМаркировкиТоваровДокументаВозвратПоставщику());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = РезультатЗапроса[2];
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаВозвратПоставщикуАвтомобилей(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратПоставщикуАвтомобилей());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратПоставщикуАвтомобилей());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаЗаказНаряд(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаЗаказНаряд());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаЗаказНаряд());
	
	РезультатЗапроса = УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, ДокСсылка);
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	КодыМаркировки = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		КодыМаркировки);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокумента(ДокументСсылка)
	
	Перем Результат;
	
	Если ЭтоСчетФактураВыданный(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(ДокументСсылка);
		
	ИначеЕсли ЭтоРеализацияТоваров(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаРеализацияТоваров(ДокументСсылка);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокументСсылка);
		
	ИначеЕсли ЭтоРеализацияАвтомобилей(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаРеализацияАвтомобилей(ДокументСсылка);
		
	ИначеЕсли ЭтоИсправлениеРеализацииАвтомобилей(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаКорректировкаРеализацииАвтомобилей(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомитенту(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомитентуЗаАвтомобили") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомитентуЗаАвтомобили(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомиссионера(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомиссионераЗаАвтомобили") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомиссионераЗаАвтомобили(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаВозвратПоставщику(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратПоставщикуАвтомобилей") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаВозвратПоставщикуАвтомобилей(ДокументСсылка);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаЗаказНаряд(ДокументСсылка);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ДокументСсылка));
		
		ВызватьИсключение ТекстОшибки;
	
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыеДанныеПервичногоДокумента(
	РезультатЗапросаПоШапке,
	РезультатЗапросаПоТаблицам,
	РезультатЗапросаПоПрослеживаемости)
	
	Результат = УПД970_Контракт_ДанныеПервичногоДокумента();
	
	ТабДанныеШапки = РезультатЗапросаПоШапке.Выгрузить();
	Если ТабДанныеШапки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	УПД970_ДополнитьДанныеШапкиЗначениямиДополнительныхСвойств(ДанныеШапки);
	
	ТабличныеДанные = РезультатЗапросаПоТаблицам.Выгрузить();
	
	Если РезультатЗапросаПоПрослеживаемости = Неопределено Тогда
		КодыМаркировки = Неопределено;
	Иначе
		КодыМаркировки = РезультатЗапросаПоПрослеживаемости.Выгрузить();
	КонецЕсли;
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);

	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.КодыМаркировки = КодыМаркировки;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_РезультатыЗапросовДанныхПервичногоДокумента()

	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("КодыМаркировки");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВыполнитьЗапросПоДокументу(ТекстыЗапросов, Документ)

	РазделительЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, РазделительЗапросов);
	
	УПД970_ЗаменитьИменаПараметровВТекстеЗапросаНаВыражения(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", УПД970_ТипНоменклатурыТовар());
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", УПД970_ТипНоменклатурыУслуга());
	Запрос.УстановитьПараметр("ТипНоменклатурыРабота", УПД970_ТипНоменклатурыРабота());
	
	Запрос.УстановитьПараметр("КраткоеНаименованиеЕдиницыИзмеренияЧас", УПД970_КраткоеНаименованиеЕдиницыИзмеренияЧас());
	Запрос.УстановитьПараметр("КодЕдиницыИзмеренияЧас", УПД970_КодЕдиницыИзмеренияЧас());
	
	Запрос.УстановитьПараметр("НаименованиеЕдИзмШтука", "шт");
	Запрос.УстановитьПараметр("КодЕдИзмШтука", "796");
	Запрос.УстановитьПараметр("ЕдИзмШтука", Справочники.КлассификаторЕдиницИзмерения.шт);

	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьДанныеСчетФактурыСведениямиОКодахМаркировки(ДанныеДокумента)
	
	ДокументОснование = ДанныеДокумента.ДанныеШапки.ДокументОснование;
	
	МетаданныеДокумента = ДокументОснование.Метаданные();
	ЕстьТабличнаяЧастьКодыМаркировки = (МетаданныеДокумента.ТабличныеЧасти.Найти("КодыМаркировки") <> Неопределено);
	
	Если ЕстьТабличнаяЧастьКодыМаркировки Тогда
		
		ТекстЗапроса = УПД970_ТекстЗапросаКодовМаркировкиОбщее(МетаданныеДокумента.Имя);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		КодыМаркировки = Запрос.Выполнить().Выгрузить();
		
		ДанныеДокумента.КодыМаркировки = КодыМаркировки;

	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ДополнитьДанныеШапкиЗначениямиДополнительныхСвойств(ДанныеШапки)
	
	ЭтоСчетФактура = ЭтоСчетФактураВыданный(ДанныеШапки.Ссылка);
	
	Если ЭтоСчетФактура Тогда
		ДокументОтгрузки = ДанныеШапки.ДокументОснование;
	Иначе
		ДокументОтгрузки = ДанныеШапки.Ссылка;
	КонецЕсли;
	
	ДатаОтгрузки = УПД970_ДатаОтгрузкиИзДополнительныхСвойствДокумента(ДокументОтгрузки);
	ДанныеШапки.Вставить("ДатаОтгрузки", ДатаОтгрузки);

	Если Не ЭтоРедакция6_1() Тогда
		
		ЗначенияСвойств = УПД970_ГрузоотправительИГрузополучательИзДополнительныхСвойствДокумента(ДанныеШапки.Ссылка);
		
		ДанныеШапки.Грузоотправитель = ЗначениеСвойстваЛок("Грузоотправитель", ЗначенияСвойств);
		
		Если Не ЭтоСчетФактура Тогда
			ДанныеШапки.Грузополучатель = ЗначениеСвойстваЛок("Грузополучатель", ЗначенияСвойств);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//{ УПД970. Исходные данные по документам. Тексты запросов

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	ДанныеШапки.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	1 КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ДанныеШапки.ДокументОснование КАК ДокументОснование,
	|	ДанныеШапки.Исправление КАК Исправление,
	|	ДанныеШапки.НомерИсправления КАК НомерИсправления,
	|	ДанныеШапки.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	ДанныеШапки.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданный()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.ДокументОснование КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА &ТипНоменклатурыУслуга
	|		ИНАЧЕ &ТипНоменклатурыТовар
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	&СодержаниеВыражение КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	СпрНоменклатура.Код Как КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ТабТовары.ГТД.Наименование КАК НомерГТД,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Коэффициент КАК Коэффициент,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабТовары.Номенклатура ССЫЛКА Справочник.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	&СодержаниеВыражение КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	НЕОПРЕДЕЛЕНО КАК Артикул,
	|	СпрАвтомобили.Код КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	КлассификаторЕдиницИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ТабТовары.ГТД.Наименование КАК НомерГТД,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Коэффициент КАК Коэффициент,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрАвтомобили.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабТовары.Номенклатура = СпрАвтомобили.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабТовары.Номенклатура ССЫЛКА Справочник.Автомобили
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыУслуга КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	&СодержаниеВыражение КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтоработы.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтоработы.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтоработы.Артикул КАК Артикул,
	|	СпрАвтоработы.Код КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ТабТовары.Ссылка.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах, """") КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТабТовары.Ссылка.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТабТовары.Ссылка.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах.Код, """") КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеСтраны,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Коэффициент КАК Коэффициент,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК СпрАвтоработы
	|		ПО ТабТовары.Номенклатура = СпрАвтоработы.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабТовары.Номенклатура ССЫЛКА Справочник.Автоработы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.СчетФактураВыданный.ТабличныеЧасти.Товары;
	ЕстьСодержание = (МетаданныеТЧ.Реквизиты.Найти("Содержание") <> Неопределено); // 6.1.8 и выше
	
	ВыражениеСодержание = "НЕОПРЕДЕЛЕНО";
	Если ЕстьСодержание Тогда
		ВыражениеСодержание = "ВЫРАЗИТЬ(ТабТовары.Содержание КАК СТРОКА(1000))";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&СодержаниеВыражение", ВыражениеСодержание);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный()
	
	Результат = 
	"ВЫБРАТЬ 
	|	ПлатежноРасчетныеДокументы.Дата КАК ДатаДокумента,
	|	ПлатежноРасчетныеДокументы.Номер КАК НомерДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК ПлатежноРасчетныеДокументы
	|ГДЕ
	|	ПлатежноРасчетныеДокументы.Ссылка = &Ссылка
	|	И ПлатежноРасчетныеДокументы.Дата <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ПлатежноРасчетныеДокументы.Номер <> """"";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК КодВидаОперации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	
	|	ЕСТЬNULL(Выписка.БанковскийСчет, Организации.ОсновнойБанковскийСчет) КАК БанковскийСчетОрганизации,
	
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов

	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеШапки.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК Выписка
	|		ПО ДанныеШапки.ДокументОснование = Выписка.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданныйНаАванс()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Прочее"" КАК ТипНоменклатуры,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	&СодержаниеВыражение КАК Содержание,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Код КАК КодНоменклатуры
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.СчетФактураВыданный.ТабличныеЧасти.Товары;
	ЕстьСодержание = (МетаданныеТЧ.Реквизиты.Найти("Содержание") <> Неопределено); // 6.1.8 и выше
	
	ВыражениеСодержание = "НЕОПРЕДЕЛЕНО";
	Если ЕстьСодержание Тогда
		ВыражениеСодержание = "ВЫРАЗИТЬ(ТабТовары.Содержание КАК СТРОКА(1000))";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&СодержаниеВыражение", ВыражениеСодержание);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияТоваров()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.РеализацияТоваров КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияТоваров()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА &ТипНоменклатурыУслуга
	|		ИНАЧЕ &ТипНоменклатурыТовар
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ТабТовары.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	&СодержаниеВыражение КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	СпрНоменклатура.Код Как КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ТабТовары.ГТД.Наименование КАК НомерГТД,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.РеализацияТоваров.ТабличныеЧасти.Товары;
	ЕстьСодержание = (МетаданныеТЧ.Реквизиты.Найти("Содержание") <> Неопределено); // 6.1.8 и выше
	
	ВыражениеСодержание = "НЕОПРЕДЕЛЕНО";
	Если ЕстьСодержание Тогда
		ВыражениеСодержание = "ВЫРАЗИТЬ(ТабТовары.Содержание КАК СТРОКА(1000))";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&СодержаниеВыражение", ВыражениеСодержание);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиТоваровДокументаРеализацияТоварах()
	
	ИмяДокумента = "РеализацияТоваров";
	Результат = УПД970_ТекстЗапросаКодовМаркировкиОбщее(ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализации()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА &ТипНоменклатурыУслуга
	|		ИНАЧЕ &ТипНоменклатурыТовар
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ТабТовары.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	&СодержаниеВыражение КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ТабТовары.ГТД.Наименование КАК НомерГТД,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабРаботы.Ссылка КАК ДокументОтгрузки,
	|	ТабРаботы.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыРабота КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабРаботы.Авторабота КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтоработы.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтоработы.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтоработы.Артикул КАК Артикул,
	|	СпрАвтоработы.Код КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК ЕдиницаИзмерения,
	|	&КраткоеНаименованиеЕдиницыИзмеренияЧас КАК ЕдиницаИзмеренияНаименование,
	|	&КодЕдиницыИзмеренияЧас КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеСтраны,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхожденияКод,
	|	ТабРаботы.Количество КАК Количество,
	|	ТабРаботы.Цена КАК Цена,
	|	ТабРаботы.СтавкаНДС КАК СтавкаНДС,
	|	ТабРаботы.СуммаНДС КАК СуммаНДС,
	|	ТабРаботы.СуммаВсего - ТабРаботы.СуммаНДС КАК СуммаБезНДС,
	|	ТабРаботы.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализации.Автоработы КАК ТабРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК СпрАвтоработы
	|		ПО ТабРаботы.Авторабота = СпрАвтоработы.Ссылка
	|ГДЕ
	|	ТабРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.КорректировкаРеализации.ТабличныеЧасти.Товары;
	ЕстьСодержание = (МетаданныеТЧ.Реквизиты.Найти("Содержание") <> Неопределено); // 6.1.8 и выше
	
	ВыражениеСодержание = "НЕОПРЕДЕЛЕНО";
	Если ЕстьСодержание Тогда
		ВыражениеСодержание = "ВЫРАЗИТЬ(ТабТовары.Содержание КАК СТРОКА(1000))";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&СодержаниеВыражение", ВыражениеСодержание);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиТоваровДокументаКорректировкаРеализации()
	
	ИмяДокумента = "КорректировкаРеализации";
	Результат = УПД970_ТекстЗапросаКодовМаркировкиОбщее(ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.РеализацияАвтомобилей КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабТовары.Автомобиль КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	НЕОПРЕДЕЛЕНО Как Артикул,
	|	СпрАвтомобили.Код КАК КодНоменклатуры,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	&ЕдИзмШтука КАК ЕдиницаИзмерения,
	|	&НаименованиеЕдИзмШтука КАК ЕдиницаИзмеренияНаименование,
	|	&КодЕдИзмШтука КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Наименование, НЕОПРЕДЕЛЕНО) КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрАвтомобили.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабТовары.Автомобиль = СпрАвтомобили.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализацииАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.КорректировкаРеализацииАвтомобилей КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализацииАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабТовары.Автомобиль КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтомобили.Код КАК КодНоменклатуры,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	&ЕдИзмШтука КАК ЕдиницаИзмерения,
	|	&НаименованиеЕдИзмШтука КАК ЕдиницаИзмеренияНаименование,
	|	&КодЕдИзмШтука КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Наименование, НЕОПРЕДЕЛЕНО) КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрАвтомобили.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабТовары.Автомобиль = СпрАвтомобили.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитенту()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитенту()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыУслуга КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	&ЕдИзмШтука КАК ЕдиницаИзмерения,
	|	&НаименованиеЕдИзмШтука КАК ЕдиницаИзмеренияНаименование,
	|	&КодЕдИзмШтука КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеСтраны,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхожденияКод,
	|	1 КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.ДокументОснование = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитентуЗаАвтомобили()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомитентуЗаАвтомобили КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитентуЗаАвтомобили()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыУслуга КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	&ЕдИзмШтука КАК ЕдиницаИзмерения,
	|	&НаименованиеЕдИзмШтука КАК ЕдиницаИзмеренияНаименование,
	|	&КодЕдИзмШтука КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеСтраны,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхожденияКод,
	|	1 КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.ДокументОснование = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионера()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионера()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ТабТовары.ГТД.Наименование КАК НомерГТД,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ОтчетКомиссионера.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионераЗаАвтомобили()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомиссионераЗаАвтомобили КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионераЗаАвтомобили()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабАвтомобили.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабАвтомобили.Автомобиль КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтомобили.Код КАК КодНоменклатуры,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	&ЕдИзмШтука КАК ЕдиницаИзмерения,
	|	&НаименованиеЕдИзмШтука КАК ЕдиницаИзмеренияНаименование,
	|	&КодЕдИзмШтука КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Наименование, НЕОПРЕДЕЛЕНО) КАК НомерГТД,
	|	1 КАК Количество,
	|	ТабАвтомобили.Цена КАК Цена,
	|	ТабАвтомобили.СтавкаНДС КАК СтавкаНДС,
	|	ТабАвтомобили.СуммаНДС КАК СуммаНДС,
	|	ТабАвтомобили.СуммаВсего - ТабАвтомобили.СуммаНДС КАК СуммаБезНДС,
	|	ТабАвтомобили.СуммаВсего КАК СуммаВсего,
	|	СпрАвтомобили.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ОтчетКомиссионераЗаАвтомобили.Автомобили КАК ТабАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабАвтомобили.Автомобиль = СпрАвтомобили.Ссылка
	|ГДЕ
	|	ТабАвтомобили.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратПоставщику()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратПоставщику()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	ТабТовары.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ТабТовары.ГТД.Наименование КАК НомерГТД,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(ТабТовары.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ВозвратПоставщику.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиТоваровДокументаВозвратПоставщику()
	
	ИмяДокумента = "ВозвратПоставщику";
	Результат = УПД970_ТекстЗапросаКодовМаркировкиОбщее(ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратПоставщикуАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ВозвратПоставщикуАвтомобилей КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратПоставщикуАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабАвтомобили.Ссылка КАК ДокументОтгрузки,
	|	ТабАвтомобили.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабАвтомобили.Автомобиль КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтомобили.Код КАК КодНоменклатуры,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	&ЕдИзмШтука КАК ЕдиницаИзмерения,
	|	&НаименованиеЕдИзмШтука КАК ЕдиницаИзмеренияНаименование,
	|	&КодЕдИзмШтука КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СпрАвтомобили.ГТД.Наименование, НЕОПРЕДЕЛЕНО) КАК НомерГТД,
	|	ТабАвтомобили.Количество КАК Количество,
	|	ТабАвтомобили.Цена КАК Цена,
	|	ТабАвтомобили.СтавкаНДС КАК СтавкаНДС,
	|	ТабАвтомобили.СуммаНДС КАК СуммаНДС,
	|	ТабАвтомобили.СуммаВсего - ТабАвтомобили.СуммаНДС КАК СуммаБезНДС,
	|	ТабАвтомобили.СуммаВсего КАК СуммаВсего,
	|	СпрАвтомобили.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ВозвратПоставщикуАвтомобилей.Автомобили КАК ТабАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабАвтомобили.Автомобиль = СпрАвтомобили.Ссылка
	|ГДЕ
	|	ТабАвтомобили.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаЗаказНаряд()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.ПодразделениеКомпании КАК ПодразделениеОрганизации,
	|	&ГрузоотправительВыражение КАК Грузоотправитель,
	|	&ГрузополучательВыражение КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВалютыВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеШапки.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДоговорыКонтрагентов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ЗаказНаряд КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаЗаказНаряд()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК ДокументОтгрузки,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА &ТипНоменклатурыУслуга
	|		ИНАЧЕ &ТипНоменклатурыТовар
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СпрНоменклатура.ГТД.Наименование, НЕОПРЕДЕЛЕНО) КАК НомерГТД,
	|	ЕСТЬNULL(СпрНоменклатура.ГТД.Страна, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СпрНоменклатура.ГТД.Страна.НаименованиеПолное, НЕОПРЕДЕЛЕНО) КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(СпрНоменклатура.ГТД.Страна.Код, НЕОПРЕДЕЛЕНО) КАК СтранаПроисхожденияКод,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ЗаказНаряд.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабРаботы.Ссылка КАК ДокументОтгрузки,
	|	ТабРаботы.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыРабота КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Содержание,
	|	ТабРаботы.Авторабота КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтоработы.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтоработы.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтоработы.Артикул КАК Артикул,
	|	СпрАвтоработы.Код Как КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ТабРаботы.Ссылка.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах, ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТабРаботы.Ссылка.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах.Наименование, &КраткоеНаименованиеЕдиницыИзмеренияЧас) КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТабРаботы.Ссылка.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах.Код, &КодЕдиницыИзмеренияЧас) КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеСтраны,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхожденияКод,
	|	ТабРаботы.Количество КАК Количество,
	|	ТабРаботы.Цена КАК Цена,
	|	ТабРаботы.СтавкаНДС КАК СтавкаНДС,
	|	ТабРаботы.СуммаНДС КАК СуммаНДС,
	|	ТабРаботы.СуммаВсего - ТабРаботы.СуммаНДС КАК СуммаБезНДС,
	|	ТабРаботы.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ЗаказНаряд.Автоработы КАК ТабРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК СпрАвтоработы
	|		ПО ТабРаботы.Авторабота = СпрАвтоработы.Ссылка
	|ГДЕ
	|	ТабРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиОбщее(ИмяДокумента)

	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабКодыМаркировки.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ТабКодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.%1.КодыМаркировки КАК ТабКодыМаркировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.%1.Товары КАК ТабТовары
	|		ПО ТабКодыМаркировки.Ссылка = ТабТовары.Ссылка
	|			И ТабКодыМаркировки.ИдентификаторТовара = ТабТовары.ИдентификаторТовара
	|ГДЕ
	|	ТабКодыМаркировки.Ссылка = &Ссылка";
	
	Результат = СтрШаблон(ШаблонТекстаЗапроса, ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаменитьИменаПараметровВТекстеЗапросаНаВыражения(ТекстЗапроса)

	Если ЭтоРедакция6_1() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГрузоотправительВыражение", "ДанныеШапки.Грузоотправитель");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГрузополучательВыражение", "ДанныеШапки.Грузополучатель");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГрузоотправительВыражение", "НЕОПРЕДЕЛЕНО");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГрузополучательВыражение", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
КонецПроцедуры

//} УПД970. Исходные данные по документам. Тексты запросов

//} УПД970. Исходные данные по документам

//{ УПД970. Служебные процедуры и функции

Функция УПД970_ВТабличныхДанныхДокументаТолькоУслуги(ТабличныеДанные)
	
	ОтборСтрок = Новый Структура("ТипНоменклатуры", УПД970_ТипНоменклатурыТовар());
	СтрокиСТоварами = ТабличныеДанные.НайтиСтроки(ОтборСтрок);
	
	Результат = (СтрокиСТоварами.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияДокумента(ДанныеДокумента, ФункцияДокумента)
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		Результат = УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеДокумента);
	Иначе
		Результат = УПД970_ОбстоятельстваФормированияУПД(ДанныеДокумента);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияУПД(ДанныеДокумента)
	
	Результат = Неопределено;
	
	Если ДанныеДокумента.ЭтоДоговорСКомиссионером Тогда
		Результат = "00005";
	КонецЕсли;
	
	Если ДанныеДокумента.ЭтоДоговорСКомитентом Тогда
		Результат = "00007";
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу)
	
	Перем Результат;
	
	ЭтоКомиссионнаяТорговля = (ДанныеПоДокументу.ЭтоДоговорСКомитентом Или ДанныеПоДокументу.ЭтоДоговорСКомиссионером);
	
	Если ДанныеПоДокументу.ЭтоСчетФактураНаАванс Тогда
		Результат = "2";
	ИначеЕсли ЭтоКомиссионнаяТорговля Тогда
		Результат = "1";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(
		Контент,
		ДанныеШапки)
	
	Результат = УПД970_НовыеРеквизитыОснованияОтгрузки(
		"Договор",
		ДанныеШапки.ДоговорНомер,
		ДанныеШапки.ДоговорДата);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования)
	
	ОбязательныеРеквизитыЗаполнены = (РеквизитыОснования <> Неопределено
		И ЗначениеЗаполнено(РеквизитыОснования.Наименование)
		И ЗначениеЗаполнено(РеквизитыОснования.Номер)
		И ЗначениеЗаполнено(РеквизитыОснования.Дата));
	
	Возврат ОбязательныеРеквизитыЗаполнены;
	
КонецФункции

Функция УПД970_НовыеРеквизитыОснованияОтгрузки(Наименование = "", Номер = "", Дата = '00010101')

	Результат = Новый Структура;
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("Дата", Дата);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыТовар()
	Возврат "Товар";
КонецФункции

Функция УПД970_ТипНоменклатурыУслуга()
	Возврат "Услуга";
КонецФункции

Функция УПД970_ТипНоменклатурыРабота()
	Возврат "Работа";
КонецФункции

Функция УПД970_КраткоеНаименованиеЕдиницыИзмеренияЧас()
	Возврат "ч";
КонецФункции

Функция УПД970_КодЕдиницыИзмеренияЧас()
	Возврат "356";
КонецФункции

Функция УПД970_Контракт_ДанныеПервичногоДокумента()

	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("КодыМаркировки");
	
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");

	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеСчетФактураВыданный()

	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("КодыМаркировки");
	Результат.Вставить("СведенияОДокументахОплаты");
	
	Результат.Вставить("ЭтоСчетФактураНаАванс");
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбУчастникахЭДО(ДанныеШапки)
	
	Если ЭтоОбособленноеПодразделениеОрганизации(ДанныеШапки.ПодразделениеОрганизации) Тогда
		ОбособленноеПодразделение = ДанныеШапки.ПодразделениеОрганизации;
	ИначеЕсли ЭтоОбособленноеПодразделениеОрганизации(ДанныеШапки.Грузоотправитель) Тогда
		ОбособленноеПодразделение = ДанныеШапки.Грузоотправитель;
	Иначе
		ОбособленноеПодразделение = Неопределено;
	КонецЕсли;
	
	СведенияОбОбособленномПодразделении = Неопределено;
	Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
		
		СведенияОбОбособленномПодразделении = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ОбособленноеПодразделение,
			ДанныеШапки.Дата);
	
	КонецЕсли;
	
	// Продавец
	СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		ДанныеШапки.Организация,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетОрганизации);
	
	Если СведенияОбОбособленномПодразделении <> Неопределено Тогда
		СведенияОбОрганизации.КПП = СведенияОбОбособленномПодразделении.КПП;
	КонецЕсли;
	
	Если ЭтоОбособленноеПодразделениеОрганизацииНаОтдельномБалансе(ОбособленноеПодразделение) Тогда
		СведенияОбОрганизации.НаименованиеБанка = СведенияОбОбособленномПодразделении.НаименованиеБанка;
		СведенияОбОрганизации.БИК = СведенияОбОбособленномПодразделении.БИК;
		СведенияОбОрганизации.КоррСчет = СведенияОбОбособленномПодразделении.КоррСчет;
		СведенияОбОрганизации.НомерСчета = СведенияОбОбособленномПодразделении.НомерСчета;
	КонецЕсли;
	
	// Покупатель
	ЭтоОбособленноеПодразделениеКонтрагента = ЭтоОбособленноеПодразделениеКонтрагента(ДанныеШапки.Контрагент);
	Если ЭтоОбособленноеПодразделениеКонтрагента Тогда
		
		СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
			ДанныеШапки.ГоловнойКонтрагент,
			ДанныеШапки.Дата);
			
		СведенияОКонтрагенте.КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Контрагент, "КПП");
		
	Иначе
		
		СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
			ДанныеШапки.Контрагент,
			ДанныеШапки.Дата);
			
	КонецЕсли;
	
	// Грузоотправитель
	Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузоотправитель,
			ДанныеШапки.Дата);
			
	ИначеЕсли СведенияОбОбособленномПодразделении <> Неопределено Тогда
		
		СведенияОГрузоотправителе = СведенияОбОбособленномПодразделении;
		
	Иначе
		
		СведенияОГрузоотправителе = Ядро.КопияКоллекцииЗначений(СведенияОбОрганизации);
		
		СведенияОГрузоотправителе.Адрес = УПД970_СведенияОФактическомАдресе(
			СведенияОбОрганизации.Ссылка,
			ДанныеШапки.Дата);
		
	КонецЕсли;
	
	// Грузополучатель
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		
		СведенияОГрузополучателе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузополучатель,
			ДанныеШапки.Дата);
			
	ИначеЕсли ЭтоОбособленноеПодразделениеКонтрагента Тогда
		
		СведенияОГрузополучателе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Контрагент,
			ДанныеШапки.Дата);
			
		СведенияОГрузополучателе.ИНН = СведенияОКонтрагенте.ИНН;
		
	Иначе
		
		СведенияОГрузополучателе = Ядро.КопияКоллекцииЗначений(СведенияОКонтрагенте);
		
		СведенияОГрузополучателе.Адрес = УПД970_СведенияОФактическомАдресе(
			СведенияОКонтрагенте.Ссылка,
			ДанныеШапки.Дата);
		
	КонецЕсли;
	
	Результат = УПД970_Контракт_УчастникиЭДО();
	Результат.Организация = СведенияОбОрганизации;
	Результат.Контрагент = СведенияОКонтрагенте;
	Результат.Грузоотправитель = СведенияОГрузоотправителе;
	Результат.Грузополучатель = СведенияОГрузополучателе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсЮрАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсФактАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)

	СведенияОЮрФизЛице = СведенияОЮрФизЛице(Ссылка, ДатаСведений);
		
	НаименованиеУчастникаЭДО = УПД970_НаименованиеУчастникаЭДО(СведенияОЮрФизЛице);
	ЭтоИП = (СведенияОЮрФизЛице.ЮрФизЛицо = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель);
	ЭтоФизЛицо = (СведенияОЮрФизЛице.ЮрФизЛицо = Перечисления.ФормыСобственности.ЧастноеЛицо);

	Результат = УПД970_Контракт_ДанныеУчастникаЭДО();

	Результат.Ссылка = Ссылка;
	Результат.Наименование = НаименованиеУчастникаЭДО;
	Результат.ИНН = СведенияОЮрФизЛице.ИНН;
	Результат.КПП = СведенияОЮрФизЛице.КПП;
	Результат.КодПоОКПО = СведенияОЮрФизЛице.КодПоОКПО;
	
	Результат.ЭтоЮрЛицо = (Не ЭтоИП И Не ЭтоФизЛицо);
	Результат.ЭтоФизЛицо = ЭтоФизЛицо;
	Результат.Нерезидент = СведенияОЮрФизЛице.Нерезидент;
	
	Если СведенияОЮрФизЛице.Нерезидент Тогда
		Результат.НалоговыйНомерВСтранеРегистрации = СведенияОЮрФизЛице.НалоговыйНомерВСтранеРегистрации;
	КонецЕсли;
	
	Если ЭтоИП Тогда
		Результат.ОГРНИП = СведенияОЮрФизЛице.ОГРН;
		СведенияОЮрФизЛице.Свойство("ДатаРегистрации", Результат.ДатаОГРНИП);
	КонецЕсли;
	
	Если СведенияОЮрФизЛице.Свойство("СтранаРегистрации") Тогда
		Результат.СтранаКод = СведенияОЮрФизЛице.СтранаРегистрации.Код;
		Результат.СтранаНаименование = СведенияОЮрФизЛице.СтранаРегистрации.Наименование;
	КонецЕсли;
	
	Результат.Телефоны = СведенияОЮрФизЛице.Телефоны;
	Результат.ЭлектроннаяПочта = СведенияОЮрФизЛице.ЭлектроннаяПочта;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		СведенияОБанковскомСчете = СведенияОБанковскомСчете(БанковскийСчет);
	Иначе
		СведенияОБанковскомСчете = СведенияОЮрФизЛице;
	КонецЕсли;
	
	Результат.НаименованиеБанка = СведенияОБанковскомСчете.Банк;
	Результат.НомерСчета = СведенияОБанковскомСчете.НомерСчета;
	Результат.КоррСчет = СведенияОБанковскомСчете.КоррСчет;
	Результат.БИК = СведенияОБанковскомСчете.БИК;
		
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыПодразделенияОрганизации(Подразделение)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("НаименованиеПолное", "НаименованиеПолное");
	Реквизиты.Вставить("КПП", "КПП");
	Реквизиты.Вставить("Ссылка", "Ссылка");
	
	Если ЭтоРедакция6_1() Тогда
		Реквизиты.Вставить("ОбособленноеПодразделение", "ОбособленноеПодразделение");
	Иначе
		Реквизиты.Вставить("ОбособленноеПодразделение", "Ложь");
	КонецЕсли;
		
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, Реквизиты);
	
	Если Не ЭтоРедакция6_1() Тогда
		Результат.ОбособленноеПодразделение = ЗначениеЗаполнено(Реквизиты.КПП);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НаименованиеУчастникаЭДО(СведенияОЮрФизЛице)

	Результат = СведенияОЮрФизЛице.ПолноеНаименование;
	
	Если СведенияОЮрФизЛице.ЮрФизЛицо = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель Тогда
		
		ФИОУчастникаЭДО = Новый Массив;
		ФИОУчастникаЭДО.Добавить(СведенияОЮрФизЛице.Фамилия);
		ФИОУчастникаЭДО.Добавить(СведенияОЮрФизЛице.Имя);
		ФИОУчастникаЭДО.Добавить(СведенияОЮрФизЛице.Отчество);
		
		РазделительФИО = " ";
		Результат = СтрСоединить(ФИОУчастникаЭДО, РазделительФИО);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений)
	
	Перем Результат;
	
	ВидАдреса = ВидКонтактнойИнформацииЮридическийАдрес(Ссылка);
	Если ВидАдреса = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбъектыКИ = Новый Массив;
	ОбъектыКИ.Добавить(Ссылка);
	
	ТипАдреса = Неопределено;
	
	СведенияОбАдресах = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ОбъектыКИ,
		ТипАдреса,
		ВидАдреса,
		ДатаСведений);
		
	Результат = УПД970_СтруктураАдресаОбъекта(СведенияОбАдресах);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений)
	
	Перем Результат;
	
	ВидАдреса = ВидКонтактнойИнформацииФактическийАдрес(Ссылка);
	Если ВидАдреса = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбъектыКИ = Новый Массив;
	ОбъектыКИ.Добавить(Ссылка);
	
	ТипАдреса = Неопределено;
	
	СведенияОбАдресах = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ОбъектыКИ,
		ТипАдреса,
		ВидАдреса,
		ДатаСведений);
		
	Результат = УПД970_СтруктураАдресаОбъекта(СведенияОбАдресах);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СтруктураАдресаОбъекта(СведенияОбАдресах)
	
	Перем Результат;
	
	Если ЗначениеЗаполнено(СведенияОбАдресах) Тогда
		
		СведенияОбАдресе = СведенияОбАдресах[0];
		
		ДопПараметры = УПД970_ДополнительныеПараметрыДляПолученияАдреса();
		
		Если ЭтоРедакция6_1() Тогда
			СтрокаАдреса = СведенияОбАдресе.Значение;
		Иначе
			СтрокаАдреса = СведенияОбАдресе.ЗначенияПолей;
		КонецЕсли;
		
		Результат = СведенияОбАдресе_(СтрокаАдреса, ДопПараметры);
		
		Если Не ЭтоРедакция6_1() Тогда
			
			ЭтоАдресВСвободнойФорме = ЭтоАдресВСвободнойФорме(Результат, СведенияОбАдресе.Представление);
			
			Если ЭтоАдресВСвободнойФорме Тогда
				
				ТипАдреса = "";
				Представление = СведенияОбАдресе.Представление;
				
			Иначе
				
				ТипАдреса = АдминистративноТерриториальныйАдрес();
				Представление = СведенияОбАдресе.Представление;
				
			КонецЕсли;
			
			Результат.Вставить("ТипАдреса", ТипАдреса);
			Результат.Вставить("Представление", Представление);
			
		Иначе
			
			Если Результат.ТипАдреса = "ВСвободнойФорме" Тогда
				Результат.Вставить("Представление", СведенияОбАдресе.Представление);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДополнительныеПараметрыДляПолученияАдреса()

	Результат = Новый Структура;
	Результат.Вставить("НаименованиеВключаетСокращение", Ложь);
	Результат.Вставить("ПолноеНаименованиеСокращений", Ложь);
	
	Если ЭтоРедакция6_1() Тогда
		Результат.Вставить("КодыАдреса", Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЭтоРоссийскийАдрес(СтруктураАдреса)

	Результат = (СтруктураАдреса.КодСтраны = ОсновнаяСтрана().Код);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент)
	
	ТипДокумента = ТипЗнч(ИсходныйДокумент);
	
	ЭтоИсправительныйДокумент = (ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации")
		Или ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей"));
	
	Если ЭтоИсправительныйДокумент Тогда
		
		ДокументРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокумент, "ДокументОснование");
		Результат = УПД970_ИсправляемыйДокументОтгрузки(ДокументРеализации);
		
	Иначе
		
		Результат = ИсходныйДокумент;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция УПД970_Контракт_УчастникиЭДО()

	Результат = Новый Структура;
	
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Грузоотправитель");
	Результат.Вставить("Грузополучатель");

	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеУчастникаЭДО()

	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("Наименование");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("ЭтоЮрЛицо");
	Результат.Вставить("ЭтоФизЛицо");
	Результат.Вставить("КодПоОКПО");
	Результат.Вставить("ОГРНИП");
	Результат.Вставить("ДатаОГРНИП");
	Результат.Вставить("Телефоны");
	Результат.Вставить("ЭлектроннаяПочта");
	Результат.Вставить("СтранаНаименование");
	Результат.Вставить("СтранаКод");
	Результат.Вставить("Нерезидент");
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации");
	Результат.Вставить("Свидетельство");
	Результат.Вставить("НаименованиеБанка");
	Результат.Вставить("НомерСчета");
	Результат.Вставить("КоррСчет");
	Результат.Вставить("БИК");
	Результат.Вставить("Адрес");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЭтоПоддерживаемыйТипПервичногоДокумента(ДокументСсылка)
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.РеализацияАвтомобилей"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуЗаАвтомобили"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераЗаАвтомобили"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ВозвратПоставщику"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ВозвратПоставщикуАвтомобилей"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗаказНаряд"));
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Результат = (ТипыДокументов.Найти(ТипДокумента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КодМаркировкиБезСкобок(Штрихкод)
	
	Если Не СтрНачинаетсяС(Штрихкод, "(") Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Результат = СтрЗаменить(Штрихкод, "(01)", "01");
	Результат = СтрЗаменить(Результат, "(21)", "21");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ГрузоотправительИГрузополучательИзДополнительныхСвойствДокумента(Документ)

	Грузоотправитель = ПредопределенноеЗначение(
		"ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузоотправитель");
	
	Грузополучатель = ПредопределенноеЗначение(
		"ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузополучатель");
	
	ДопРеквизитыИСвойства = Новый Массив;
	ДопРеквизитыИСвойства.Добавить(Грузоотправитель);
	ДопРеквизитыИСвойства.Добавить(Грузополучатель);
	
	Результат = ЗначенияСвойствЛок(Документ, ДопРеквизитыИСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДатаОтгрузкиИзДополнительныхСвойствДокумента(Документ)
	
	ДопРеквизитыИСвойства = Новый Массив;
	ДопРеквизитыИСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаОтгрузки);
	
	ЗначенияСвойств = ЗначенияСвойствЛок(Документ, ДопРеквизитыИСвойства);
	
	Результат = ЗначениеСвойстваЛок("ДатаОтгрузки", ЗначенияСвойств);
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяПересчетНормыВремени(ДокументОснованиеПересчета)
	
	Результат = Ложь;
	
	Если НЕ ЕстьПересчетНормыВремени() Тогда
		Результат = (ТипЗнч(ДокументОснованиеПересчета) = Тип("ДокументСсылка.ЗаказНаряд"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьПересчетНормыВремени()
	
	// С версии 6.1.16 пересчет норм времени авторабот в Заказ-наряде
	// при заполнении товарной части СФ выполняется в запросе (при заполнении СФ на основании),
	// если установлено значение "По норме времени" в строке ТЧ.
	// В более старых версиях пересчет выполняется на лету при формировании типовой ПФ УПД
	
	ВерсияАА = ВерсияПодсистемыАА();
	Результат = (Ядро.СравнитьВерсии(ВерсияАА, "6.1.16") >= 0);
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Служебные процедуры и функции

//{ УПД970. Контракты протоструктуры

Функция Контракт_ПротоструктураУПД970()
	
	ИмяТипа = "Utd970SellerContent";
	
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформация();
	Результат.AdditionalInfoId = Контракт_AdditionalInfoId();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформация()
	
	ИмяТипа = "СлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.ContentsDocumentProductsType = Контракт_ContentsDocumentProductsType();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ContentsDocumentProductsType()
	
	ИмяТипа = "ContentsDocumentProductsType";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ExtendedOrganizationInfo970()

	ИмяТипа = "ExtendedOrganizationInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияОрганизации();
	
	Возврат Результат;

КонецФункции

Функция Контракт_Shipper970()

	ИмяТипа = "Shipper970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_СлужебнаяИнформацияОрганизации()
	
	ИмяТипа = "OrganizationСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressInfo970()

	ИмяТипа = "AddressInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressRFInfo()

	ИмяТипа = "AddressRFInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressSARInfo()

	ИмяТипа = "AddressSARInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressTextInfo()

	ИмяТипа = "AddressTextInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressObjectNumberInfo()

	ИмяТипа = "AddressObjectNumberInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentShipments970()

	ИмяТипа = "DocumentShipment970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferInfo970()

	ИмяТипа = "TransferInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferBases970()

	ИмяТипа = "TransferBase970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_Employee970()
	
	ИмяТипа = "Employee970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_InvoiceTable970()
	
	ИмяТипа = "InvoiceTable970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemTracingInfo970()
	
	ИмяТипа = "ItemTracingInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_CustomDeclarations()

	ИмяТипа = "CustomDeclaration";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияСтроки()
	
	ИмяТипа = "ItemСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Item970()
	
	ИмяТипа = "Item970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_PaymentDocumentInfo()

	ИмяТипа = "PaymentDocumentInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_ItemIdentificationNumber970()
	
	ИмяТипа = "ItemIdentificationNumber970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AdditionalInfoId()
	
	ИмяТипа = "AdditionalInfoId";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

//} УПД970. Контракты протоструктуры

//} СБОР КОНТЕНТА УПД970

//*****************************************************************************
//{ СБОР КОНТЕНТА ФНС29

Функция СчетФНС29(СсылкаНаОбъект) Экспорт
	Ошибка = "ИнтеграцияААА6: формирование электронных счетов в формате ФНС 29@ не реализовано";
	ВызватьИсключение Ошибка;
КонецФункции

//} СБОР КОНТЕНТА ФНС29
//*****************************************************************************

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция СведенияОбАдресе_(Адрес, ДополнительныеПараметры = Неопределено)

	ВерсияБСП = ВерсияБиблиотекиСтандартныхПодсистем();
	
	Если Ядро.СравнитьВерсии(ВерсияБСП, "2.4") >= 0 Тогда
		ИмяОбщегоМодуля = "РаботаСАдресами";
	Иначе
		ИмяОбщегоМодуля = "УправлениеКонтактнойИнформацией";
	КонецЕсли;
	
	ОбщийМодульРаботыСАдресами = ОбщегоНазначения.ОбщийМодуль(ИмяОбщегоМодуля);
	Результат = ОбщийМодульРаботыСАдресами.СведенияОбАдресе(Адрес, ДополнительныеПараметры);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьКППНаДату_(СсылкаНаОбъект, ДатаСведений)

	Если ЭтоРедакция6_1() Тогда
		МенеджерРеквизитовИстории = ОбщегоНазначения.ОбщийМодуль("РеквизитыСИсторией");
	Иначе
		МенеджерРеквизитовИстории = ОбщегоНазначения;
	КонецЕсли;
	
	Результат = МенеджерРеквизитовИстории.ПолучитьКППНаДату(СсылкаНаОбъект, ДатаСведений);
	
	Возврат Результат;

КонецФункции

Функция СведенияОЮрФизЛице(Ссылка, ДатаСведений)
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		Результат = Справочники.Организации.ДанныеЮрФизЛицаДляЭДО(Ссылка);
		ДополнитьСведенияОЮрФизЛицеДаннымиОрганизации(Результат, Ссылка);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		
		Результат = Справочники.ПодразделенияКомпании.ДанныеЮрФизЛицаДляЭДО(Ссылка);
		ДополнитьСведенияОЮрФизЛицеДаннымиПодразделения(Результат, Ссылка);

	Иначе
		
		Результат = Справочники.Контрагенты.ДанныеЮрФизЛицаДляЭДО(Ссылка);
		ДополнитьСведенияОЮрФизЛицеДаннымиКонтрагента(Результат, Ссылка);
		
	КонецЕсли;
	
	Результат.КПП = ПолучитьКППНаДату_(Ссылка, ДатаСведений);
	
	ДополнитьСведенияОЮрФизЛицеТелефономИEmail(Результат, Ссылка, ДатаСведений);
	
	ОсновнойБанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ОсновнойБанковскийСчет");
	Если ЗначениеЗаполнено(ОсновнойБанковскийСчет) Тогда
		
		РеквизитыСчета = СведенияОБанковскомСчете(ОсновнойБанковскийСчет);
		
		Результат.Банк = РеквизитыСчета.Банк;
		Результат.БИК = РеквизитыСчета.БИК;
		Результат.КоррСчет = РеквизитыСчета.КоррСчет;
		Результат.НомерСчета = РеквизитыСчета.НомерСчета;
		
	Иначе
		
		Результат.Банк = Неопределено;
		Результат.БИК = Неопределено;
		Результат.КоррСчет = Неопределено;
		Результат.НомерСчета = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияОБанковскомСчете(БанковскийСчет)
	
	РеквизитыСчета = Новый Структура;
	РеквизитыСчета.Вставить("НомерСчета", "НомерСчета");
	РеквизитыСчета.Вставить("Банк", "ЕСТЬNULL(Банк.Наименование, НЕОПРЕДЕЛЕНО)");
	РеквизитыСчета.Вставить("БИК", "ЕСТЬNULL(Банк.Код, НЕОПРЕДЕЛЕНО)");
	РеквизитыСчета.Вставить("КоррСчет", "ЕСТЬNULL(Банк.КоррСчет, НЕОПРЕДЕЛЕНО)");
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БанковскийСчет, РеквизитыСчета);

	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеКонтрагента(Ссылка)

	ФормаСобственности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ФормаСобственности");
	Результат = (ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеОрганизации(Ссылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании")
		И ЗначениеЗаполнено(Ссылка) Тогда
		
		Если ЭтоРедакция6_1() Тогда
			Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ОбособленноеПодразделение");
		Иначе
			КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КПП");
			Результат = ЗначениеЗаполнено(КПП);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеОрганизацииНаОтдельномБалансе(Ссылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании")
		И ЗначениеЗаполнено(Ссылка) Тогда
		
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Балансовое");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоАдресВСвободнойФорме(СведенияОбАдресе, СохраненноеПредставление)
	
	Результат = (Не УПД970_ЭтоРоссийскийАдрес(СведенияОбАдресе)
		Или Не ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона)
		Или Не РасчетноеПредставлениеАдресаСовпадаетССохраненным(СведенияОбАдресе, СохраненноеПредставление));
		
	Возврат Результат;
	
КонецФункции

Функция ВидКонтактнойИнформацииЮридическийАдрес(ВладелецКИ)
	
	ТипВладельца = ТипЗнч(ВладелецКИ);
	
	Если ТипВладельца = Тип("СправочникСсылка.Организации") Тогда
		Результат = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		Результат = Справочники.ВидыКонтактнойИнформации.ЮрАдресПодразделенияКомпании;
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Контрагенты") Тогда
		Результат = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ВидКонтактнойИнформацииФактическийАдрес(ВладелецКИ)
	
	ТипВладельца = ТипЗнч(ВладелецКИ);
	
	Если ТипВладельца = Тип("СправочникСсылка.Организации") Тогда
		Результат = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		Результат = Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании;
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Контрагенты") Тогда
		Результат = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция РасчетноеПредставлениеАдресаСовпадаетССохраненным(СтруктураАдреса, Знач СохраненноеПредставление)
	
	РасчетноеПредставление = "";
		
	МодульУправлениеКИКлиентСервер = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиентСервер");
	МодульУправлениеКИКлиентСервер.СформироватьПредставлениеАдреса(СтруктураАдреса, РасчетноеПредставление);
	
	Если СтруктураАдреса.Свойство("Страна")
		И ЗначениеЗаполнено(СтруктураАдреса.Страна) Тогда
		
		СохраненноеПредставление = СтруктураАдреса.Страна + ", " + СохраненноеПредставление;
		
	КонецЕсли;

	Результат = (ВРег(РасчетноеПредставление) = ВРег(СохраненноеПредставление));
	
	Возврат Результат;

КонецФункции

Функция ИспользуетсяБЭД19()
	
	Результат = Ложь;
	
	ВерсияБЭД = ВерсияБиблиотекиЭлектронныхДокументов();
	
	Если Ядро.СравнитьВерсии(ВерсияБЭД, "1.9") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияБиблиотекиЭлектронныхДокументов()
	
	Результат = ОбновлениеИнформационнойБазыБЭД.ВерсияБиблиотеки();
	Возврат Результат;
	
КонецФункции

Функция ВерсияБиблиотекиСтандартныхПодсистем()
	
	Результат = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	Возврат Результат;
	
КонецФункции

Функция ВерсияПодсистемыАА()
	
	Результат = "0.0.0.0";
	
	ВозможныеИменаПодсистем = Новый Массив;
	ВозможныеИменаПодсистем.Добавить("Автосалон6");
	ВозможныеИменаПодсистем.Добавить("Автосалон6Базовая");
	
	Для Каждого ИмяПодсистемы Из ВозможныеИменаПодсистем Цикл
		
		ПодсистемаАА = ОбновлениеИнформационнойБазы.ВерсияИБ(ИмяПодсистемы);
		Если ПодсистемаАА <> "0.0.0.0" Тогда
			Результат = ПодсистемаАА;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоРедакция6_1()
	
	Если ЭтоРедакция6_1 = Неопределено Тогда
		ВерсияАА = ВерсияПодсистемыАА();
		ЭтоРедакция6_1 = (Ядро.СравнитьВерсии(ВерсияАА, "6.1") >= 0);
	КонецЕсли;

	Результат = ЭтоРедакция6_1;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции       

Функция ФункцияДокумента_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции     

Функция ТекстЗапроса_ВыбытиеМаркируемойПродукцииДляСобственныхНуждПоСчетФактуре()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА СчетаФактуры.ДокументОснование ССЫЛКА Документ.РеализацияТоваров
	|			ТОГДА ВЫРАЗИТЬ(СчетаФактуры.ДокументОснование КАК Документ.РеализацияТоваров).ПричинаВыводаИзОборота
	|		КОГДА СчетаФактуры.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(СчетаФактуры.ДокументОснование КАК Документ.КорректировкаРеализации).ПричинаВыводаИзОборота
	|		КОГДА СчетаФактуры.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	|			ТОГДА ВЫРАЗИТЬ(СчетаФактуры.ДокументОснование КАК Документ.ЗаказНаряд).ПричинаВыводаИзОборота
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПричинаВыводаИзОборота
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ВариантВыбытияМаркируемойПродукции(ДокументСсылка)
	
	Результат = "";
	
	ВариантыВыбытия = Новый Соответствие;
	ВариантыВыбытия.Вставить(Перечисления.ПричиныВыбытияМаркируемойПродукции.ПустаяСсылка(),						"");
	ВариантыВыбытия.Вставить(Перечисления.ПричиныВыбытияМаркируемойПродукции.ИспользованиеДляСобственныхНужд,		"1");
	ВариантыВыбытия.Вставить(Перечисления.ПричиныВыбытияМаркируемойПродукции.БезвозмезднаяПередача,					"2");
	ВариантыВыбытия.Вставить(Перечисления.ПричиныВыбытияМаркируемойПродукции.ПриобретениеВРамкахГосКонтракта,		"3");
	ВариантыВыбытия.Вставить(Перечисления.ПричиныВыбытияМаркируемойПродукции.ИспользованиеДляПроизводственныхЦелей,	"4");
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса_ВыбытиеМаркируемойПродукцииДляСобственныхНуждПоСчетФактуре();
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Причина = Выборка.ПричинаВыводаИзОборота;
			Результат = ВариантыВыбытия.Получить(Причина);
		КонецЕсли;
	
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваров")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ЗаказНаряд")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
	
		Причина = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ПричинаВыводаИзОборота");
		Результат = ВариантыВыбытия.Получить(Причина);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокументСсылка) Тогда
		
		Причина = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка.ДокументОснование, "ПричинаВыводаИзОборота");
		Результат = ВариантыВыбытия.Получить(Причина);
		
	Иначе
		
			Результат = "";
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьПризнакВыбытияИзОборотаМаркируемойПродукции(Контент, ДокСсылка)
	
	ВариантВыбытияМаркируемойПродукции = ВариантВыбытияМаркируемойПродукции(ДокСсылка);
	
	ЕстьКодыМаркировки = УПД970_ВКонтентеЕстьКодыМаркировки(Контент.Table.Items);
	
	Если ЕстьКодыМаркировки
		И Контент.Function <> ФункцияДокумента_СЧФ()
		И ВариантВыбытияМаркируемойПродукции <> "" Тогда
		
		Если Контент.AdditionalInfoId = Неопределено Тогда
			Контент.AdditionalInfoId = Контракт_AdditionalInfoId();
		КонецЕсли;
	
		ПризнакВыбытия = Новый Структура;
		ПризнакВыбытия.Вставить("Key", "СвВыбытияМАРК");
		ПризнакВыбытия.Вставить("Value", Число(ВариантВыбытияМаркируемойПродукции));
	
		Контент.AdditionalInfoId.StructedAdditionalInfos.Добавить(ПризнакВыбытия);
	
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ВКонтентеЕстьКодыМаркировки(Items)
	
	Результат = Ложь;
	
	Для Каждого Item Из Items Цикл
		Если Item.ItemIdentificationNumbers.Количество() > 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОсновнаяСтрана()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "РОССИЯ");
	Результат.Вставить("Код", "643");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаБезСчетаФактуры(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ТОРГ12_Акт_БезНДС");
	ВидыПакетов.Добавить("ID_УПД_БезНДС");
	ВидыПакетов.Добавить("ID_ИУПД_БезНДС");
	ВидыПакетов.Добавить("ID_УКД_БезНДС");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправительныйВидПакета(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ИУПД");
	ВидыПакетов.Добавить("ID_ИУПД_раздельно");
	ВидыПакетов.Добавить("ID_ИСФ");
	ВидыПакетов.Добавить("ID_ИУКД");
	ВидыПакетов.Добавить("ID_ИУКД_раздельно");
	ВидыПакетов.Добавить("ID_ИКСФ");
	ВидыПакетов.Добавить("ID_ИУПД_НаАванс");
	ВидыПакетов.Добавить("ID_ИСФ_НаАванс");
	ВидыПакетов.Добавить("ID_ИУПД_БезНДС");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяНоменклатураКонтрагентовБЭД()
	
	Результат = Истина;
	
	Если Метаданные.РегистрыСведений.Найти("НоменклатураКонтрагентовБЭД") = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	Если ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		
		МетаданныеНоменклатурыКонтрагентов = Метаданные.РегистрыСведений.НоменклатураКонтрагентовБЭД;
		
		ВладелецТип = Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип;
		
		НоменклатураТип = Новый_ТипНоменклатурыБЭДДляСопоставления(Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип);
		
		НаименованиеТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Артикул.Тип;
		КодТип = АртикулТип; // поля "Код" в регистре нет
		
		ХарактеристикаТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Характеристика.Тип;
		УпаковкаТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Упаковка.Тип; 
		ЕстьХарактеристики = Истина;
		ЕстьУпаковки = Истина;
		
	Иначе
		
		МетаданныеНоменклатурыПоставщиков = Метаданные.Справочники.НоменклатураПоставщиков;
		
		ВладелецТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Владелец.Тип;
		
		НоменклатураТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Номенклатура.Тип;
		
		НаименованиеТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Артикул.Тип;
		КодТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Идентификатор.Тип;
		
		ХарактеристикаТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.ХарактеристикаНоменклатуры.Тип;
		УпаковкаТип = Неопределено;
		ЕстьХарактеристики = Истина;
		ЕстьУпаковки = Ложь;
		
	КонецЕсли;
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	
	Если ЕстьХарактеристики Тогда
		Результат.Колонки.Добавить("Характеристика", ХарактеристикаТип);
	КонецЕсли;
	
	Если ЕстьУпаковки Тогда
		Результат.Колонки.Добавить("Упаковка", УпаковкаТип);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция Общее_ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов)
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если ТипЗнч(МассивСсылок) = Тип("Массив") ИЛИ ТипЗнч(МассивСсылок) = Тип("ФиксированныйМассив") Тогда
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		Если НЕ Метаданные.ОбщиеМодули.Найти("ОбщегоНазначенияКлиентСервер") = Неопределено Тогда
			СтрокаСообщения = "Неверный тип параметра ""МассивСсылок""";
			Выполнить("ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения)");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция Общее_СтрокаВДату(Значение)
	
	Результат = СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ЕстьОбщийРеквизит(Объект, ИмяРеквизита)
	
	Если Объект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьРеквизит = Ложь;
	
	КоллекцияРеквизитов = Метаданные.ОбщиеРеквизиты;
	
	Для Каждого ОбщийРеквизит Из КоллекцияРеквизитов Цикл
		
		Если ВРег(ОбщийРеквизит.Имя) = ВРег(ИмяРеквизита) Тогда
			
			ИспользованиеОбщегоРеквизита = ОбщийРеквизит.Состав.Найти(Объект);
			
			Если ИспользованиеОбщегоРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
				ЕстьРеквизит = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьРеквизит;
	
КонецФункции

Функция Новый_ТипНоменклатурыБЭДДляСопоставления(ОписаниеТипаНоменклатураБЭД)
	
	Результат = ОписаниеТипаНоменклатураБЭД;
	
	ИмяОбъектаМетаданных = "Справочник.Номенклатура";
	Если Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданных) <> Неопределено Тогда
		
		ИмяТипа			 = "СправочникСсылка.Номенклатура";
		ТипНоменклатура	 = Тип(ИмяТипа);
		
		Если ОписаниеТипаНоменклатураБЭД.СодержитТип(ТипНоменклатура) Тогда
			Результат = Новый ОписаниеТипов(ИмяТипа);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, НоменклатураКонтрагента)
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент				= Контрагент;
	НоваяСтрока.Наименование			= НоменклатураКонтрагента.Наименование;
	НоваяСтрока.Код						= НоменклатураКонтрагента.Код;
	НоваяСтрока.Артикул					= НоменклатураКонтрагента.Артикул;
	НоваяСтрока.НоменклатураКонтрагента = НоменклатураКонтрагента;
	
КонецПроцедуры

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеТоваров" Тогда				
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	НЕ ПоступлениеТоваров.ПометкаУдаления
		|	И ПоступлениеТоваров.Организация = &Организация
		|	И ПоступлениеТоваров.Контрагент = &Контрагент
		|	И ПоступлениеТоваров.ВхДокДата = &ДатаДокумента
		|	И ПоступлениеТоваров.ВхДокНомер = &НомерДокумента";

	ИначеЕсли ВидДокумента1С = "ПоступлениеАвтомобилей" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеАвтомобилей.Ссылка
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей КАК ПоступлениеАвтомобилей
		|ГДЕ
		|	НЕ ПоступлениеАвтомобилей.ПометкаУдаления
		|	И ПоступлениеАвтомобилей.Организация = &Организация
		|	И ПоступлениеАвтомобилей.Контрагент = &Контрагент
		|	И ПоступлениеАвтомобилей.ВхДокДата = &ДатаДокумента
		|	И ПоступлениеАвтомобилей.ВхДокНомер = &НомерДокумента";	
		
	ИначеЕсли ВидДокумента1С = "ПоступлениеДопРасходов" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеДопРасходов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	НЕ ПоступлениеДопРасходов.ПометкаУдаления
		|	И ПоступлениеДопРасходов.Организация = &Организация
		|	И ПоступлениеДопРасходов.Контрагент = &Контрагент
		|	И ПоступлениеДопРасходов.ВхДокДата = &ДатаДокумента
		|	И ПоступлениеДопРасходов.ВхДокНомер = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "КорректировкаПоступления" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаПоступления.Ссылка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|ГДЕ
		|	НЕ КорректировкаПоступления.ПометкаУдаления
		|	И КорректировкаПоступления.Организация = &Организация
		|	И КорректировкаПоступления.Контрагент = &Контрагент
		|	И КорректировкаПоступления.ВхДокДата = &ДатаДокумента
		|	И КорректировкаПоступления.ВхДокНомер = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ВхДокДата = &ДатаДокумента
		|	И СчетФактураПолученный.ВхДокНомер = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетОтПоставщика" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетОтПоставщика.Ссылка
		|ИЗ
		|	Документ.СчетОтПоставщика КАК СчетОтПоставщика
		|ГДЕ
		|	НЕ СчетОтПоставщика.ПометкаУдаления
		|	И СчетОтПоставщика.Организация = &Организация
		|	И СчетОтПоставщика.Контрагент = &Контрагент
		|	И СчетОтПоставщика.ВхДокДата = &ДатаДокумента
		|	И СчетОтПоставщика.ВхДокНомер = &НомерДокумента";		
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	ТипДокумента = ТипЭД.ТипДокумента;
	
	Если 	ТипДокумента = "UniversalTransferDocumentRevision" 
		Или ТипДокумента = "UniversalCorrectionDocument" 
		Или ТипДокумента = "UniversalCorrectionDocumentRevision"
		Или ТипДокумента = "InvoiceCorrectionRevision" 
		Или ТипДокумента = "InvoiceRevision" Тогда 

		Результат = Неопределено;
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = "ПоступлениеТоваров";
		
	//ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипЭД)
	//	Или ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(ТипЭД) Тогда
	//	
	//	Результат = "КорректировкаПоступления";
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипЭД) Тогда
		
		Результат = "СчетФактураПолученный";
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭД = ПараметрыСобытия.Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
	Если Не ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		
		Если Не ТипЭД.Формализованный Тогда
			Ошибки.Добавить("Документ неформализованный.");
		КонецЕсли;
		
		Ошибки.Добавить("Для этого формата или типа документа нельзя создать документ.");
		Ошибки.Добавить("Сопоставьте документ вручную из карточки документа.");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаДокументаОснования(Документ, ВыбранныйВид)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Если ВыбранныйВид = "КорректировкаПоступления" Тогда
		
		ФункцияДокумента = Документ.Тип.ФункцияДокумента;
		
		НомерДатаДокумента = НомерДатаДокументаОснованияКорректировкиИзКонтентаXML(Документ, Результат.ОписаниеОшибки);
		
		Если НомерДатаДокумента <> Неопределено Тогда
			
			НомерОснования = НомерДатаДокумента.Номер;
			ДатаОснования  = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаДокумента.Дата);

			ДокументОснование = Неопределено;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
			ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
			ПараметрыОтбора.Вставить("ДатаДокумента",	ДатаОснования);
			ПараметрыОтбора.Вставить("НомерДокумента",	НомерОснования);
			
			Если ФункцияДокумента = "InvoiceAndBasic" Тогда
				
				ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
				
				Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
					ДокументОснование = ДокументыОснования1С[0].ДокументОснование;
				КонецЕсли;
				
			ИначеЕсли ФункцияДокумента = "Basic" Тогда
				
				ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваров");
				
				Если ДокументыОснования1С = Неопределено Тогда
					ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
				КонецЕсли;
				
				Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
					ДокументОснование = ДокументыОснования1С[0];
				КонецЕсли;
				
				Если ДокументыОснования1С = Неопределено Тогда
					ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеАвтомобилей");
				КонецЕсли;
				
				Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
					ДокументОснование = ДокументыОснования1С[0];
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДокументОснование = Неопределено Тогда
				
				СоздаватьСчетаФактуры = ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СоздаватьСчетаФактуры;
								
				Результат.ОписаниеОшибки = "Для корректировки не найден документ-основание №" + НомерОснования + " от " + Формат(ДатаОснования, "ДФ=dd.MM.yyyy");
												
				Если СоздаватьСчетаФактуры = Истина Тогда
					Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ". Создайте счет-фактуру для документа-основания и повторите создание документа";
				Иначе
					Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ". Сопоставьте документ вручную из карточки документа.";
				КонецЕсли;
				
			ИначеЕсли НЕ ДокументОснование.Проведен Тогда
				ШаблонОшибки = НСтр("ru='Документ %1 не проведен. Ввод на основании непроведенного документа запрещен'");
				Результат.ОписаниеОшибки = СтрШаблон(ШаблонОшибки, ДокументОснование);
			Иначе
				Результат.ОсновнойОбъект = ДокументОснование;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомерДатаДокументаОснованияКорректировкиИзКонтентаXML(Документ, ТекстОшибки = "")
	
	Перем СведенияОДокументе;
	
	Результат = Новый Структура("Номер, Дата");
	
	ТипДокумента = Документ.Тип.ТипДокумента;
	ТипКонтента = Документ.Тип.ТипКонтента;
	Контент = Документ.Документооборот.ХранилищеКонтента;
	ДвоичныеДанные = Контент.Данные;
	КонтентДокументаXML = ОсновнойМодуль.XML_В_XDTO(ДвоичныеДанные);
	
	Если ТипДокумента = "UniversalCorrectionDocument" Тогда
		СведенияОДокументе = КонтентДокументаXML.Документ.СвКСчФ.СчФ;
	ИначеЕсли ТипДокумента = "UniversalTransferDocumentRevision" Тогда
		СведенияОДокументе = КонтентДокументаXML.Документ.СвСчФакт;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
		
	Если СведенияОДокументе <> Неопределено Тогда
		
		Если ТипЗнч(СведенияОДокументе) = Тип("СписокXDTO") Тогда
			
			Результат = Неопределено;
			ТекстОшибки = "Создание корректировки по нескольким документам-оснований недоступно. Вы можете вручную создать документ в 1С и сопоставить его с текущим документом";
			
		ИначеЕсли ТипКонтента = ТипКонтентаUtd970() Тогда
			
			Результат.Номер = СведенияОДокументе.НомерДок;
			Результат.Дата = СведенияОДокументе.ДатаДок;
			
		Иначе
			
			Результат.Номер = СведенияОДокументе.НомерСчФ;
			Результат.Дата = СведенияОДокументе.ДатаСчФ;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных)
	
	МетаданныеОснованийСФ = Метаданные.Документы.СчетФактураПолученный.ВводитсяНаОсновании;
	Результат = МетаданныеОснованийСФ.Содержит(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	Результат = Ложь;
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Если ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных) Тогда
		
		Результат = (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.СчетФактураПолученный"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		ИЛИ НЕ ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(Документ.Тип) Тогда
		
		ЭлектронныйСФ = ЭлектронныйКорректировочныйСчетФактураПакета(Документ);
		
	Иначе
		
		ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйСФ)
		ИЛИ ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ДокументОбъект.Проведен = Истина; //чтобы работала ОбработкаЗаполнения
	ДокументОбъект.Записать();
	
	ОснованиеСФ = ДокументОбъект.Ссылка;
	
	ДатаДокумента = ТекущаяДатаСеанса();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	ДокументСФ.Заполнить(ОснованиеСФ);
	ДокументСФ.ВхДокДата = ЭлектронныйСФ.Реквизиты.Дата;
	ДокументСФ.ВхДокНомер = ЭлектронныйСФ.Реквизиты.Номер;
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.ДополнительныеСвойства.Вставить("Загрузка", Истина);
	Если НЕ ЗначениеЗаполнено(ДокументСФ.Номер) Тогда
		ДокументСФ.УстановитьНовыйНомер();
	КонецЕсли;
	ДокументСФ.Записать();
	
	ДокументОбъект.Проведен = Ложь;
	ДокументОбъект.Записать();
	
	Если НЕ ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлектронныйКорректировочныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(ДокументУчета.ДокументОснование, ДобавляемыйКомментарий);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция РезультатФункцииОшибка(ОшибкаИлиМассив)
	
	Если ТипЗнч(ОшибкаИлиМассив) = Тип("Массив") Тогда
		КоллекцияОшибок = ОшибкаИлиМассив;
	Иначе
		КоллекцияОшибок = Новый Массив;
		КоллекцияОшибок.Добавить(ОшибкаИлиМассив);
	КонецЕсли;
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(КоллекцияОшибок);
	
	Возврат Результат;
	
КонецФункции

Функция ЗапрещеноЧтениеТаблицыДанныхДокумента(ОбъектМетаданных)
	
	Результат = НЕ ПравоДоступа("Чтение", ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Процедура АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм)
	
	НовыйЭлементТаблицы = КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета = "ПФ_MXL_АктСверки";
	НовыйЭлементТаблицы.ИмяВРЕГ = ВРег(НовыйЭлементТаблицы.ИмяМакета);
	НовыйЭлементТаблицы.Экземпляров = 1;

КонецПроцедуры

// Метод является констркутором служебной коллекции "КоллекцияПечатныхФорм"
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция НовыйКоллекцияПечатныхФормДляПечатиДокумента()
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции

Функция АктыСверок_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	Если ТипОбъекта <> Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда
		
		Ошибка = СтрШаблон(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ДокументПечати = Новый Массив;
	ДокументПечати.Добавить(СсылкаНаОбъект);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	КоллекцияПечатныхФорм = НовыйКоллекцияПечатныхФормДляПечатиДокумента();
	
	АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм);
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Новый Структура;
	
	МенеджерПечати = Документы.АктСверкиВзаиморасчетов;
	МенеджерПечати.Печать(
		ДокументПечати,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода
	);
	
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			
			ТабличныйДокумент = Стр.ТабличныйДокумент;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

Функция МуниципальныйАдрес()
	
	ОбщийМодульИмя = "РаботаСАдресамиКлиентСервер";
	
	ОбщийМодульРаботаСАдресами = ОбщегоНазначения.ОбщийМодуль(ОбщийМодульИмя);
	Результат = ОбщийМодульРаботаСАдресами.МуниципальныйАдрес();
	
	Возврат Результат;
	
КонецФункции

Функция АдминистративноТерриториальныйАдрес()
	
	ОбщийМодульИмя = "РаботаСАдресамиКлиентСервер";
	
	ОбщийМодульРаботаСАдресами = ОбщегоНазначения.ОбщийМодуль(ОбщийМодульИмя);
	Результат = ОбщийМодульРаботаСАдресами.АдминистративноТерриториальныйАдрес();
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСведенияОЮрФизЛицеТелефономИEmail(СведенияОЮрФизЛице, Ссылка, ДатаСведений)

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		ВидКонтактнойИнформацииТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
		ВидКонтактнойИнформацииEmail = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		
		ВидКонтактнойИнформацииТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонПодразделенияКомпании;
		ВидКонтактнойИнформацииEmail = Справочники.ВидыКонтактнойИнформации.EmailПодразделенияКомпании;
		
	Иначе
		
		ВидКонтактнойИнформацииТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		ВидКонтактнойИнформацииEmail = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		
	КонецЕсли;
	
	Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Ссылка,
		ВидКонтактнойИнформацииТелефон,
		ДатаСведений);
		
	ЭлектроннаяПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Ссылка,
		ВидКонтактнойИнформацииEmail,
		ДатаСведений);
		
	СведенияОЮрФизЛице.Вставить("Телефоны", Телефон);
	СведенияОЮрФизЛице.Вставить("ЭлектроннаяПочта", ЭлектроннаяПочта);

КонецПроцедуры

Процедура ДополнитьСведенияОЮрФизЛицеДаннымиПодразделения(СведенияОЮрФизЛице, Ссылка)

	ОГРН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Организация.ОГРН");
		
	СведенияОЮрФизЛице.Вставить("ОГРН", ОГРН);
	СведенияОЮрФизЛице.Вставить("СтранаРегистрации", Справочники.СтраныМира.Россия);
	СведенияОЮрФизЛице.Вставить("Нерезидент", Ложь);

КонецПроцедуры

Процедура ДополнитьСведенияОЮрФизЛицеДаннымиОрганизации(СведенияОЮрФизЛице, Ссылка)
	
	ВыбираемыеРеквизиты = Новый Структура;
	ВыбираемыеРеквизиты.Вставить("ДатаРегистрации");

	Если Не ЭтоРедакция6_1() Тогда
		ВыбираемыеРеквизиты.Вставить("ОГРН");
	КонецЕсли;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ВыбираемыеРеквизиты);
		
	СведенияОЮрФизЛице.Вставить("ДатаРегистрации", РеквизитыОрганизации.ДатаРегистрации);
	
	Если Не ЭтоРедакция6_1() Тогда
		СведенияОЮрФизЛице.Вставить("ОГРН", РеквизитыОрганизации.ОГРН);
		СведенияОЮрФизЛице.Вставить("СтранаРегистрации", Справочники.СтраныМира.Россия);
	КонецЕсли;
	
	СведенияОЮрФизЛице.Вставить("Нерезидент", Ложь);
	
КонецПроцедуры

Процедура ДополнитьСведенияОЮрФизЛицеДаннымиКонтрагента(СведенияОЮрФизЛице, Ссылка)
	
	ОписаниеРеквизитов = Новый Структура;
	ОписаниеРеквизитов.Вставить("СтранаРегистрации", "СтранаРегистрации");
	ОписаниеРеквизитов.Вставить("Иностранный", "Иностранный");
	ОписаниеРеквизитов.Вставить("НалоговыйНомер", "НалоговыйНомер");
	ОписаниеРеквизитов.Вставить("ИНН", "ГоловнойКонтрагент.ИНН");
	
	РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ОписаниеРеквизитов);
		
	Нерезидент = (РеквизитыКонтрагента.Иностранный
		И РеквизитыКонтрагента.СтранаРегистрации <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
		
	СведенияОЮрФизЛице.Вставить("Нерезидент", Нерезидент);

	Если Не ЭтоРедакция6_1() Тогда
		
		СведенияОЮрФизЛице.Вставить("СтранаРегистрации", РеквизитыКонтрагента.СтранаРегистрации);
		СведенияОЮрФизЛице.Вставить("НалоговыйНомерВСтранеРегистрации", РеквизитыКонтрагента.НалоговыйНомер);
		СведенияОЮрФизЛице.Вставить("ОГРН", "");
		
	КонецЕсли;
	
	ОбособленноеПодразделение = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ОбособленноеПодразделение");
	Если СведенияОЮрФизЛице.ЮрФизЛицо = ОбособленноеПодразделение Тогда
		СведенияОЮрФизЛице.ИНН = РеквизитыКонтрагента.ИНН;
	КонецЕсли;

КонецПроцедуры

// Заполняет мету электронных актов и накладных
//
// Параметры:
//  Мета - Структура - модель меты передаточного документа
//  УчетныйДокумент - ЛюбаяСсылка - основание электронного акта или накладной
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартный обработчик заполнения меты
//
Процедура ПередаточныеДокументы_ЗаполнитьМету(Мета, УчетныйДокумент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Истина;
	
КонецПроцедуры

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	ДокументыКонфигурации = Метаданные.Документы;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомиссионера);
	Результат.Добавить(ДокументыКонфигурации.РеализацияАвтомобилей);
	Результат.Добавить(ДокументыКонфигурации.КорректировкаРеализации);
	Результат.Добавить(ДокументыКонфигурации.ЗаказНаряд);
	Результат.Добавить(ДокументыКонфигурации.РеализацияТоваров);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомиссионераЗаАвтомобили);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомитенту);
	Результат.Добавить(ДокументыКонфигурации.КорректировкаРеализацииАвтомобилей);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомитентуЗаАвтомобили);
	Результат.Добавить(ДокументыКонфигурации.СчетНаОплату);
	Результат.Добавить(ДокументыКонфигурации.СчетНаОплатуЗаАвтомобили);
	Результат.Добавить(ДокументыКонфигурации.СчетФактураВыданный);
	
	Возврат Результат;
	
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//{ Взаимодействие с библиотекой ГенерацияXML

Функция ФункцияДокументаУПД_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции

Функция ФункцияДокументаУПД_ДОП()
	Возврат ГенерацияXML_ФункцииУПД().ДОП;
КонецФункции

Функция ФункцияДокументаУПД_СЧФДОП()
	Возврат ГенерацияXML_ФункцииУПД().СЧФДОП;
КонецФункции

Функция ГенерацияXML_ФункцииУПД()
	Результат = ГенерацияXML.Перечисление_ФункцииУПД();
	Возврат Результат;	
КонецФункции

Функция ГенерацияXML_Перечисление_ВидыЮрФизЛиц()
	
	Результат = ГенерацияXML.Перечисление_ВидыЮрФизЛиц();
	Возврат Результат;
	
КонецФункции

Функция ГенерацияXML_КодыРегионов()
	
	Результат = ГенерацияXML.КодыРегионов();
	Возврат Результат;
	
КонецФункции

Функция Новый_ЭлементПрото(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы);
	
	Возврат Результат;
	
КонецФункции

//} Взаимодействие с библиотекой ГенерацияXML

Функция МожноСформироватьПередаточныйДокумент(Документ1С)
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.Выписка"));
	
	Результат = (ИсключаемыеТипы.Найти(ТипДокумента) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом()
	
	Возврат "ИсчНалАг";
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентомПредставление()
	
	Возврат "НДС исчисляется налоговым агентом";
	
КонецФункции

Функция ЭтоСтавкаНДСИсчисляетсяНалоговымАгентом(НалоговаяСтавка) 
	
	ПредставлениеСтавки = СтавкаНДСИзСоответствия(, НалоговаяСтавка);
	
	Возврат ПредставлениеСтавки = "НДС исчисляется налоговым агентом";
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	Возврат "без НДС";
КонецФункции

Функция ПредставлениеЮрФизЛица(Наименование, ИНН, КПП)
	
	Если ЗначениеЗаполнено(КПП) Тогда
		Результат = СтрШаблон("%1, ИНН/КПП %2/%3", Наименование, ИНН, КПП);
	Иначе
		Результат = СтрШаблон("%1, ИНН %2", Наименование, ИНН);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность = "")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция КатегорииПакетов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"ОсновнойПакет");
	Результат.Вставить("КорректировочныйПакет", "КорректировочныйПакет");
	Результат.Вставить("СчетФактураНаАванс", 	"СчетФактураНаАванс");
	Результат.Вставить("СчетНаОплату", 			"СчетНаОплату");
	Результат.Вставить("АктCверки", 			"АктCверки");
	Результат.Вставить("БезКатегории",			"БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКатегории()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"Первичные документы");
	Результат.Вставить("КорректировочныйПакет", "Корректировочные документы");
	Результат.Вставить("СчетФактураНаАванс", 	"Счет-фактура на аванс");
	Результат.Вставить("СчетНаОплату", 			"Счет на оплату");
	Результат.Вставить("АктCверки", 			"Акт сверки");
	Результат.Вставить("БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНаименованияКатегорийПакетов(ТЗ)
	
	НаименованиеКатегории = НаименованиеКатегории();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.КатегорияПакета) Тогда
			СтрокаТЗ.НаименованиеКатегории = НаименованиеКатегории[СтрокаТЗ.КатегорияПакета];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;

	ТолькоУслуги = ДокументРеализацииСодержитТолькоУслуги(Документ1С);
	ВидДокумента = "ID_ТОРГ12";
	
	Если ТолькоУслуги Тогда
		ВидДокумента = "ID_АктФормализованный";
	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, ВидДокумента);
	
КонецПроцедуры 

Функция ДокументРеализацииСодержитТолькоУслуги(Документ1С)
	
	Результат = Истина;
	
	ЕстьТЧТовары		= Документ1С.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено;
	ЭтоОтчетКомитенту	= ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомитенту");
	ЭтоЗаказНаряд		= ТипЗнч(Документ1С) = Тип("ДокументСсылка.ЗаказНаряд");
	
	ЭтоРеализацияАктивов		= ТипЗнч(Документ1С) = Тип("ДокументСсылка.РеализацияАктивов");
	ЭтоРеализацияАвтомобилей	= ТипЗнч(Документ1С) = Тип("ДокументСсылка.РеализацияАвтомобилей");
	ОтчетКомиссионераЗаАвтомобили = ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомиссионераЗаАвтомобили");
	
	Если ЭтоЗаказНаряд Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги) КАК ЕстьУслуги,
		|	МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары) КАК ЕстьТовары
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА ТЧ.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК ЕстьУслуги,
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА НЕ ТЧ.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК ЕстьТовары
		|	ИЗ
		|		Документ.ЗаказНаряд.Товары КАК ТЧ
		|	ГДЕ
		|		ТЧ.Ссылка = &СсылкаНаОбъект
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА ЗаказНарядМатериалы.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА НЕ ЗаказНарядМатериалы.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|	ИЗ
		|		Документ.ЗаказНаряд.Материалы КАК ЗаказНарядМатериалы
		|	ГДЕ
		|		ЗаказНарядМатериалы.Ссылка = &СсылкаНаОбъект
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МАКСИМУМ(ИСТИНА),
		|		МАКСИМУМ(ЛОЖЬ)
		|	ИЗ
		|		Документ.ЗаказНаряд.Автоработы КАК ЗаказНарядАвтоработы
		|	ГДЕ
		|		ЗаказНарядАвтоработы.Ссылка = &СсылкаНаОбъект
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МАКСИМУМ(ИСТИНА),
		|		МАКСИМУМ(ЛОЖЬ)
		|	ИЗ
		|		Документ.ЗаказНаряд.ВспомогательныеАвтоработы КАК ЗаказНарядВспомогательныеАвтоработы
		|	ГДЕ
		|		ЗаказНарядВспомогательныеАвтоработы.Ссылка = &СсылкаНаОбъект) КАК ВложенныйЗапрос";
	
		Запрос.УстановитьПараметр("СсылкаНаОбъект", Документ1С);
		Запрос.УстановитьПараметр("ТипыНоменклатурыУслуги", ТипыНоменклатурыУслуги());
	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.ЕстьУслуги И Не Выборка.ЕстьТовары;
		КонецЕсли;
		
	ИначеЕсли ЭтоРеализацияАктивов Тогда 
		
		Результат = Ложь;
		
	ИначеЕсли ЭтоРеализацияАвтомобилей Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ОтчетКомиссионераЗаАвтомобили Тогда 
		
		Результат = Ложь;
		
	ИначеЕсли ЕстьТЧТовары И Не ЭтоОтчетКомитенту Тогда
	
		ШаблонЗапроса =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТЧ.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьУслуги,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ ТЧ.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьТовары
		|ИЗ
		|	&ПолноеИмяТаблицы КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &СсылкаНаОбъект";
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СсылкаНаОбъект", Документ1С);
		Запрос.УстановитьПараметр("ТипыНоменклатурыУслуги", ТипыНоменклатурыУслуги());
	
		ПолноеИмяТаблицы = СтрШаблон("%1.%2"
			, Документ1С.Метаданные().ПолноеИмя()
			, "Товары");
		
		Запрос.Текст = СтрЗаменить(ШаблонЗапроса
			, "&ПолноеИмяТаблицы"
			, ПолноеИмяТаблицы);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.ЕстьУслуги И Не Выборка.ЕстьТовары;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипыНоменклатурыУслуги()
	
	Результат = Новый Массив;
	Результат.Добавить(Справочники.ТипыНоменклатуры.Услуга);
	Результат.Добавить(Справочники.ТипыНоменклатуры.Авторабота);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Функция ЭтоВидПакетаОсновной(ВидПакетаID)
	
	ВидыПакетов = Новый Массив;
	ВидыПакетов.Добавить("ID_ОсновнойПакет");
	ВидыПакетов.Добавить("ID_УПД");
	ВидыПакетов.Добавить("ID_УПД_раздельно");
	ВидыПакетов.Добавить("ID_ИУПД");
	ВидыПакетов.Добавить("ID_ИУПД_раздельно");
	ВидыПакетов.Добавить("ID_ИСФ");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаКорректировочный(ВидПакетаID)
	
	ВидыПакетов = Новый Массив;
	ВидыПакетов.Добавить("ID_УКД");
	ВидыПакетов.Добавить("ID_УКД_раздельно");
	ВидыПакетов.Добавить("ID_КСФ");
	ВидыПакетов.Добавить("ID_ИУКД");
	ВидыПакетов.Добавить("ID_ИУКД_раздельно");
	ВидыПакетов.Добавить("ID_ИКСФ");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаСчетФактураНаАванс(ВидПакетаID)
	
	ВидыПакетов = Новый Массив;
	ВидыПакетов.Добавить("ID_СФ_НаАванс");
	ВидыПакетов.Добавить("ID_УПД_НаАванс");
	ВидыПакетов.Добавить("ID_ИУПД_НаАванс");
	ВидыПакетов.Добавить("ID_ИСФ_НаАванс");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаСчетНаОплату(ВидПакетаID)
	
	ВидыПакетов = Новый Массив;
	ВидыПакетов.Добавить("ID_Счет");
	ВидыПакетов.Добавить("ID_СчетФормализованный");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаАктСверки(ВидПакетаID)
	
	ВидыПакетов = Новый Массив;
	ВидыПакетов.Добавить("ID_АктСверки");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапроса_СчетаФактуры_НаРеализацию(Запросы, ОписаниеВидаПакета, ЭтоИсправление)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", ЭтоИсправление);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаФактуры_Корректировочный(Запросы, ОписаниеВидаПакета, ЭтоИсправление)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса =  ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", ЭтоИсправление);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаФактуры_НаАванс(Запросы, ОписаниеВидаПакета, ЭтоИсправление)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", ЭтоИсправление);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_ПервичныеДокументыБезНДС(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетНаОплату(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетНаОплату) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетНаОплатуЗаАвтомобили(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетНаОплатуЗаАвтомобили) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетНаОплатуЗаАвтомобили(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_АктыСверок(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.АктСверкиВзаиморасчетов) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьЗапросПоВидуПакетуПакета(Запросы, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	ЭтоИсправление = ЭтоИсправительныйВидПакета(ВидПакетаID);
	
	Если ЭтоВидПакетаОсновной(ВидПакетаID) Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_НаРеализацию(
			Запросы, 
			ОписаниеВидаПакета, 
			ЭтоИсправление
		);
		
	ИначеЕсли ЭтоВидПакетаКорректировочный(ВидПакетаID) Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_Корректировочный(
			Запросы, 
			ОписаниеВидаПакета, 
			ЭтоИсправление
		);
		
	ИначеЕсли ЭтоВидПакетаСчетФактураНаАванс(ВидПакетаID) Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_НаАванс(
			Запросы, 
			ОписаниеВидаПакета, 
			ЭтоИсправление
		); 
		
	ИначеЕсли ЭтоВидПакетаБезСчетаФактуры(ВидПакетаID) Тогда
		
		ДобавитьТекстЗапроса_ПервичныеДокументыБезНДС(Запросы, ОписаниеВидаПакета);
		
	ИначеЕсли	ЭтоВидПакетаСчетНаОплату(ВидПакетаID) Тогда
		
		ДобавитьТекстЗапроса_СчетНаОплату(Запросы, ОписаниеВидаПакета);
		
		ДобавитьТекстЗапроса_СчетНаОплатуЗаАвтомобили(Запросы, ОписаниеВидаПакета);
		
	ИначеЕсли	ЭтоВидПакетаАктСверки(ВидПакетаID) Тогда
		
		ДобавитьТекстЗапроса_АктыСверок(Запросы, ОписаниеВидаПакета);
		
	КонецЕсли;
	
КонецПроцедуры


Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК Документ,
		|	СчетФактура.Номер КАК НомерДокумента,
		|	СчетФактура.Дата КАК ДатаДокумента,
		|	СчетФактура.Контрагент КАК Контрагент,
		|	СчетФактура.Организация КАК Организация,
		|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И СчетФактура.Проведен
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетФактура.Исправление
		|	И НЕ СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)
		|	И &УсловиеНаДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Номер,
		|	СчетФактура.Дата,
		|	СчетФактура.Контрагент,
		|	СчетФактура.Организация,
		|	СчетФактура.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И НЕ СчетФактура.ПометкаУдаления
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетФактура.Исправление
		|	И НЕ СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)
		|	И &УсловиеНаДокументОснование
		|";
	
	УсловиеНаДокументОснование = "	И Не ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.Выписка)
		|	И Не ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ЧекНаОплату)";
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
				"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Исправление", "СчетФактура.Исправление");
		Результат = СтрЗаменить(Результат,
				"НЕ СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)",
				"СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)");
		УсловиеНаДокументОснование = "";
		
	КонецЕсли;
	
	Если ВидСчетаФактуры = "Корректировочный" Тогда
		
		Результат = СтрЗаменить(Результат,
				"НЕ СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)",
				"СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)");
		УсловиеНаДокументОснование = "";
		
	ИначеЕсли ВидСчетаФактуры = "НаАванс" Тогда
		
		Результат = СтрЗаменить(Результат, "И НЕ СчетФактура.Исправление", "");
		Результат = СтрЗаменить(Результат, "И НЕ СчетФактура.ЕстьКорректировка", "");
		
		УсловиеНаДокументОснование = " И  (ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ЧекНаОплату)
			|  ИЛИ ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.Выписка))";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "И &УсловиеНаДокументОснование", УсловиеНаДокументОснование);
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "НаРеализацию", ВидСчетаФактуры);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ВТ_ДокументыБезНДС.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";
	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(Результат,
				"И (ВТ_ДокументыБезНДС.ЭтоИсправление)",
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоИсправление)");
	КонецЕсли;
	
	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		Результат = СтрЗаменить(Результат,
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)",
				"И (ВТ_ДокументыБезНДС.ЭтоКорректировка)");
	КонецЕсли;
	
	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат,
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
		|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
		|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
		|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
		|	СчетНаОплатуПокупателю.Организация КАК Организация,
		|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетНаОплатуЗаАвтомобили(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетНаОплатуЗаАвтомобили.Ссылка КАК Документ,
		|	СчетНаОплатуЗаАвтомобили.Номер КАК НомерДокумента,
		|	СчетНаОплатуЗаАвтомобили.Дата КАК ДатаДокумента,
		|	СчетНаОплатуЗаАвтомобили.Контрагент КАК Контрагент,
		|	СчетНаОплатуЗаАвтомобили.Организация КАК Организация,
		|	СчетНаОплатуЗаАвтомобили.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетНаОплатуЗаАвтомобили КАК СчетНаОплатуЗаАвтомобили
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетНаОплатуЗаАвтомобили.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетНаОплатуЗаАвтомобили.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетНаОплатуЗаАвтомобили.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И СчетНаОплатуЗаАвтомобили.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетНаОплатуЗаАвтомобили.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
		|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
		|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
		|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
		|	АктСверкиВзаиморасчетов.Организация КАК Организация,
		|	0 КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	КатегорииПакетов = КатегорииПакетов();
	ОсновнойПакет = КатегорииПакетов.ОсновнойПакет;
	
	ПодстрокаПоиска = "&УсловиеСвязиПоКатегорииПакета";
	
	Если ЗначениеЗаполнено(КатегорияПакета) Тогда
		ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """"
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета ЕСТЬ NULL";
	Иначе
		ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID
			+ " ИЛИ ОтправленныеДокументы.ВидПакета ЕСТЬ NULL";
	КонецЕсли;
	
	Если КатегорияПакета = КатегорииПакетов.СчетНаОплату Тогда
		
		ПодстрокаЗамены = ПодстрокаЗамены
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета = """ + ОсновнойПакет + """";
		
		ИспользоватьСХ2 = НЕ ОсновнойМодуль.ИспользоватьПодсистемуДиадока();
		ОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
		
		Если ИспользоватьСХ2 И ОснованияПоУмолчанию Тогда
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Результат = Ядро.СписокНаОтправку_ТекстЗапроса_ВременныеТаблицы();
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВТДокументыБезНДС()
	
	Результат = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.ЭтоИсправление,
	|	ВТ_ПодходящиеДокументы.ЭтоКорректировка,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL"; 
	
	Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);	
	
	Возврат Результат;
			
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	
	ТекстОтбораДокументов = " И ТабличнаяЧасть.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах)
							| И ТабличнаяЧасть.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон)
							| И ТабличнаяЧасть.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах)
							| И ТабличнаяЧасть.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейКорректировкаПоСогласованиюСторон)";
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваров", "Товары", ТекстОтбораДокументов);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ВозвратПоставщику", "Товары", ТекстОтбораДокументов);
	
	УсловиеКорректировки = " И ТабличнаяЧасть.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах)";
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", УсловиеКорректировки, "Истина");
	
	УсловиеКорректировки = " И ТабличнаяЧасть.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон)";
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", УсловиеКорректировки, , "Истина");
	
	УсловиеКорректировки = " И ТабличнаяЧасть.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах)";
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализацииАвтомобилей", "Автомобили", УсловиеКорректировки, "Истина");
	
	УсловиеКорректировки = " И ТабличнаяЧасть.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейКорректировкаПоСогласованиюСторон)";
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализацииАвтомобилей", "Автомобили", УсловиеКорректировки, , "Истина");
	
	ТекстОтбораДокументов = " И ТабличнаяЧасть.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)";
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ЗаказНаряд", "Товары", ТекстОтбораДокументов);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ЗаказНаряд", "Автоработы", ТекстОтбораДокументов);
	
	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь", Корректировка = "Ложь")
	
	ТЧ	= "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;

	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК ЭтоИсправление,
	|	&Корректировка КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	Результат = СтрЗаменить(Результат, "&Корректировка", Корректировка);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
			
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоДаннымТЧПоУсловию(Запросы, ВидДокумента, ТабличнаяЧасть, Условие)
	
	ТЧ = "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;
	
	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.Ссылка КАК Документ,
		|	0 КАК ВсегоПозиций,
		|	0 КАК ПозицийБезНДС,
		|	Ложь КАК Исправление
		|ИЗ
		|	&Таблица КАК ТабличнаяЧасть
		|ГДЕ
		|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
		|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
	
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
	
КонецПроцедуры

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	ИначеЕсли TypeNamedId = "InvoiceCorrection" ИЛИ TypeNamedId = "InvoiceCorrectionRevision" Тогда
		Результат = "КСЧФ";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ, ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы = Неопределено, ДопПараметры = Неопределено)
			
	РезультатПечати 	= Неопределено;	
	ПараметрыВывода 	= Неопределено;	
	ОбъектыНазначения 	= Новый Массив;
	ПараметрыИсточника 	= Новый Структура("ИдентификаторКоманды, ОбъектыНазначения", ИдентификаторКомандыПечатнойФормы, ОбъектыНазначения);
	ОбъектыПечати 		= Новый СписокЗначений;
	
	ОбъектыНазначения.Добавить(Документ);
	
	МодульДополнительныеОтчетыИОбработки = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
	МодульДополнительныеОтчетыИОбработки.ПечатьПоВнешнемуИсточнику(ВнешняяПечатнаяФорма, ПараметрыИсточника, РезультатПечати, ОбъектыПечати, ПараметрыВывода);
		
	Если ТипЗнч(РезультатПечати) <> Тип("ТаблицаЗначений") ИЛИ РезультатПечати.Количество() <> 1 Тогда
		ВызватьИсключение "Не удалось сформировать печатную форму """ + ВнешняяПечатнаяФорма + """ для документа " + Документ;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ИмяФайла = РезультатПечати[0].СинонимМакета + " № " + Документ.Номер + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
	
	ИмяФайла = ЗаменитьНедопустимыеСимволы(ИмяФайла);
	
	РезультатПечати[0].ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);		
			
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(НомерДокумента)
		
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(НомерДокумента, ТекСимвол) <> 0 Тогда
			НомерДокумента = СтрЗаменить(НомерДокумента, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат НомерДокумента;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

// Возвращает номер документа
//
// Параметры:
//  НомерДокумента - Строка - Номер документа учета информационной базы
//  УдалитьПрефиксИнформационнойБазы - Булево - признак удаления префикса информационной базы
//  УдалитьПользовательскийПрефикс - Булево - признак удаления пользовательского префикса
//  УдалитьНулиВНомере - Булево - признак удаления лидирующих нулей
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПредставлениеНомера(Знач НомерДокумента,
	УдалитьПрефиксИнформационнойБазы = Истина,
	УдалитьПользовательскийПрефикс = Истина,
	УдалитьНулиВНомере = Истина)
	
	Если ЭтоРедакция6_1() Тогда
		
		МенеджерПрефиксации = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектов");
		
	Иначе
		
		МенеджерПрефиксации = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовПлатформа");
		
	КонецЕсли;
	
	Результат = МенеджерПрефиксации.ПолучитьНомерНаПечать(
			НомерДокумента,
			УдалитьПрефиксИнформационнойБазы,
			УдалитьПользовательскийПрефикс,
			УдалитьНулиВНомере);
	
	Возврат Результат;
	
КонецФункции

Функция Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию()
	
	Результат = Ядро.Настройки_ОснованияВидовДокументов_ИспользуютсяНастройкиПоУмолчанию();
	
	Возврат Результат;
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

Функция ЭтоСчетФактураВыданный(ДокументСсылка)

	Результат = (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураНаАванс(ДокументСсылка)

	Результат = Ложь;
	
	Если ЭтоСчетФактураВыданный(ДокументСсылка) Тогда
		
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ДокументОснование");
		ТипДокументаОснование = ТипЗнч(ДокументОснование);
		
		Результат = (ТипДокументаОснование = Тип("ДокументСсылка.Выписка")
					Или ТипДокументаОснование = Тип("ДокументСсылка.ЧекНаОплату"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправлениеРеализации(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
		Результат = (ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправлениеРеализацииАвтомобилей(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		
		ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
		Результат = (ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияАгентскихУслуг(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
		Результат = (ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)

	ЭлементыАдресногоОбъекта = Новый Массив;
	ЭлементыАдресногоОбъекта.Добавить(Элемент1);
	ЭлементыАдресногоОбъекта.Добавить(Элемент2);
	
	Результат = СокрЛП(СтрСоединить(ЭлементыАдресногоОбъекта, " "));
	
	Возврат Результат;
	
КонецФункции

Функция СтранаЧленЕАЭС(Знач КодСтраны) Экспорт
	
	КодСтраны = СокрЛП(КодСтраны);
	
	КодыСтранТС = Новый Массив;
	КодыСтранТС.Добавить("643"); // Россия
	КодыСтранТС.Добавить("051"); // Армения
	КодыСтранТС.Добавить("112"); // Беларусь
	КодыСтранТС.Добавить("398"); // Казахстан
	КодыСтранТС.Добавить("417"); // Киргизия
	КодыСтранТС.Добавить("981"); // ЕАЭС
	
	Возврат КодыСтранТС.Найти(КодСтраны) <> Неопределено;
	
КонецФункции

Функция ЗначенияСвойствЛок(ВладелецСвойств, Свойства)
	
	ПолучатьДопРеквизиты = Истина;
	ПолучатьДопСведения = Истина;
	
	ИнтерфейсАА6 = ОбщийМодульПоИмениЛок("УправлениеСвойствами");
	Результат = ИнтерфейсАА6.ПолучитьЗначенияСвойств(
		ВладелецСвойств,
		ПолучатьДопРеквизиты,
		ПолучатьДопСведения,
		Свойства
	);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеСвойстваЛок(Знач Свойство, Знач ЗначенияСвойств)
	
	ИнтерфейсАА6 = ОбщийМодульПоИмениЛок("УправлениеСвойствамиПлатформа");
	Результат = ИнтерфейсАА6.ПолучитьЗначениеСвойства(Свойство, ЗначенияСвойств);
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблон("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ


НеИспользуется_РежимУправляемыхФорм = Истина; // Определяет версию типового модуля: ОФ / УФ
