
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаименованиеДокумента = Параметры.Наименование;
	Номер = Параметры.Номер;
	Дата = Параметры.Дата;
	ДопСведения = Параметры.ДопСведения;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)

	РезультатПроверки = ПроверитьЗаполнениеПолейФормы(); 
	Если РезультатПроверки Тогда
		
		СведенияОДокументе = Новый Структура;
		СведенияОДокументе.Вставить("Наименование", НаименованиеДокумента);
		СведенияОДокументе.Вставить("Номер", Номер);
		СведенияОДокументе.Вставить("Дата", Дата);
		СведенияОДокументе.Вставить("ДопСведения", ДопСведения);
		
		Закрыть(Новый ФиксированнаяСтруктура(СведенияОДокументе));
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеПолейФормы()
	
	Результат = Истина;
	
	ЕстьЗаполненныеПоля = ЕстьЗаполненныеПоля();
	
	Если ЕстьЗаполненныеПоля Тогда
		
		Если Не (ЗначениеЗаполнено(НаименованиеДокумента)
			И ЗначениеЗаполнено(Номер)
			И ЗначениеЗаполнено(Дата)) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заполните Наименование, Номер и Дата - или очистите все поля, если не требуется заполнение";
			Сообщение.Сообщить();
				
			Результат = Ложь;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьЗаполненныеПоля()

	КонтрольнаяСтрока = СокрЛП(НаименованиеДокумента + Номер + Формат(Дата, "ДП=' '") + ДопСведения);
	Результат = ЗначениеЗаполнено(КонтрольнаяСтрока);
	
	Возврат Результат;
	
КонецФункции
