#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список поддерживаемых модулем команд
//
// Возвращаемое значение:
//  Структура - поддерживаемые команды, ключ - идентификатор команды, значение - структура см. ОписаниеКомандыМодуля()
//
Функция ОсновныеКомандыМодуля() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Отправить", ОписаниеКомандыОтправить());
	Результат.Вставить("Открыть", ОписаниеКомандыОткрыть());
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание дополнительной команды модуля
//
// Возвращаемое значение:
//  Структура - см. ОписаниеКомандыМодуля()
//
Функция ДополнительнаяКомандаМодуля() Экспорт
	
	Результат = ОписаниеКомандыМодуля();
	Результат.Заголовок = "Диадок";
	Результат.НомерКоманды = 1;
	
	Возврат Результат;
	
КонецФункции

// Определяет ссылку на документ 1С по переданной форме документа
//
// Параметры:
//  ФормаДокумента - ФормаКлиентскогоПриложения - форма документа, из которой надо получить ссылку на документ
//
// Возвращаемое значение:
//  ДокументСсылка - ссылка на документ
//
Функция ДокументУчетаИзФормыДокумента(ФормаДокумента) Экспорт
	
	Результат = ФормаДокумента.Объект.Ссылка;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеКомандыОтправить()
	
	Результат = ОписаниеКомандыМодуля();
	Результат.Заголовок = "Отправить ЭД";
	Результат.НомерКоманды = 1;
	Результат.Имя = ИмяКоманды(Результат.НомерКоманды);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеКомандыОткрыть()
	
	Результат = ОписаниеКомандыМодуля();
	Результат.Заголовок = "Открыть ЭД";
	Результат.НомерКоманды = 2;
	Результат.Имя = ИмяКоманды(Результат.НомерКоманды);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеКомандыМодуля()
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", "");
	Результат.Вставить("НомерКоманды", 0);
	Результат.Вставить("Имя", "");
	
	Возврат Результат;
	
КонецФункции

Функция ИмяКоманды(ПорядковыйНомерКоманды)
	
	Результат = "КонтурИнтеграцияОсновнаяКомандаДиадок" + ПорядковыйНомерКоманды;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти