
//{ Сервисные методы
	
&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьФорму(ПараметрыФормы) 
	
	ДанныеДоверенности = ПараметрыФормы.ДанныеДоверенности;
	
	Если ДанныеДоверенности <> Неопределено Тогда
		
		Дата 		= ДанныеДоверенности.Дата;
		Номер		= ДанныеДоверенности.Номер;
		Организация	= ДанныеДоверенности.Организация;
		Должность	= ДанныеДоверенности.Должность;
		Фамилия		= ДанныеДоверенности.Фамилия;
		Имя			= ДанныеДоверенности.Имя;
		Отчество	= ДанныеДоверенности.Отчество;
		ДопСведения	= ДанныеДоверенности.ДопСведения;
		
	КонецЕсли;
	
КонецПроцедуры

//} Сервисные методы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОчиститьНажатие(Элемент)
		
	Дата 		= '00010101';
	Номер		= "";
	Организация	= "";
	Должность	= "";
	Фамилия		= "";
	Имя			= "";
	Отчество	= "";
	ДопСведения	= "";
		
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Отказ = Ложь;
	
	ПроверкаЗаполненияДанных(Отказ);
	
	Если Не Отказ Тогда
	
		ДанныеДоверенности = Новый Структура();
		
		ДанныеДоверенности.Вставить("Дата", 		Дата);
		ДанныеДоверенности.Вставить("Номер", 		СокрЛП(Номер));
		ДанныеДоверенности.Вставить("Организация", 	СокрЛП(Организация));
		ДанныеДоверенности.Вставить("Должность", 	СокрЛП(Должность));
		ДанныеДоверенности.Вставить("Фамилия", 		СокрЛП(Фамилия));
		ДанныеДоверенности.Вставить("Имя", 			СокрЛП(Имя));
		ДанныеДоверенности.Вставить("Отчество", 	СокрЛП(Отчество));
		ДанныеДоверенности.Вставить("ДопСведения", 	СокрЛП(ДопСведения));
		
		Закрыть(ДанныеДоверенности);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияДанных(Отказ)
	
	ОсновнаяФорма().ПроверитьЗаполнениеПоляФормы(Отказ, ЭтаФорма, "Номер");
	ОсновнаяФорма().ПроверитьЗаполнениеПоляФормы(Отказ, ЭтаФорма, "Дата");
	ОсновнаяФорма().ПроверитьЗаполнениеПоляФормы(Отказ, ЭтаФорма, "Фамилия");
	ОсновнаяФорма().ПроверитьЗаполнениеПоляФормы(Отказ, ЭтаФорма, "Имя");
	
КонецПроцедуры
