////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс форм-модулей
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Описание переменных

// Служебные свойства
&НаКлиенте
Перем МодулиЛок;

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТипМетаданных = "ВнешняяОбработка";
	Если Лев(ЭтаФорма.ИмяФормы, СтрДлина(ЭтаФорма.ТипМетаданных)) <> ЭтаФорма.ТипМетаданных Тогда
		ЭтаФорма.ТипМетаданных = "Обработка";
	КонецЕсли;
	
	ЭтаФорма.ПространствоИмен = СтрЗаменить(
			СтрЗаменить(ЭтаФорма.ИмяФормы, ЭтаФорма.ТипМетаданных + ".", ""), "Стд.Форма.Клиент", "");
	
КонецПроцедуры // ПриСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс

&НаКлиенте
Функция JSON() Экспорт
	
	Возврат ВызовМодуля("СтдJSON");
	
КонецФункции // JSON

&НаКлиенте
Функция Диалоги() Экспорт
	
	Возврат ВызовМодуля("СтдДиалоги");
	
КонецФункции // Диалоги

&НаКлиенте
Функция Коллекции() Экспорт
	
	Возврат ВызовМодуля("СтдКоллекции");
	
КонецФункции // Коллекции

&НаКлиенте
Функция ОбщегоНазначения() Экспорт
	
	Возврат ВызовМодуля("СтдОбщегоНазначения");
	
КонецФункции // ОбщегоНазначения

&НаКлиенте
Функция ОС() Экспорт
	
	Возврат ВызовМодуля("СтдОС");
	
КонецФункции // ОС

&НаКлиенте
Функция Стр() Экспорт
	
	Возврат ВызовМодуля("СтдСтр");
	
КонецФункции // Стр

&НаКлиенте
Функция ФС() Экспорт
	
	Возврат ВызовМодуля("СтдФС");
	
КонецФункции // ФС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ВызовМодуля(ИмяМодуля)
	
	Если МодулиЛок = Неопределено Тогда
		МодулиЛок = Новый Структура;
		МодулиЛок.Вставить("СтдСтр");
		МодулиЛок.Вставить("СтдОС");
		МодулиЛок.Вставить("СтдФС");
		МодулиЛок.Вставить("СтдJSON");
		МодулиЛок.Вставить("СтдОбщегоНазначения");
		МодулиЛок.Вставить("СтдДиалоги");
		МодулиЛок.Вставить("СтдКоллекции");
	КонецЕсли;
	
	Если НЕ МодулиЛок.Свойство(ИмяМодуля) Тогда
		ВызватьИсключение "Ошибка значения: " + ИмяМодуля;
	КонецЕсли;
	
	Если МодулиЛок[ИмяМодуля] = Неопределено Тогда
		МодулиЛок[ИмяМодуля] = ПолучитьФорму(ТипМетаданных + "." + ПространствоИмен + ИмяМодуля + ".Форма.Клиент");
		Попытка
			МодулиЛок[ИмяМодуля].Инит(ЭтаФорма);
		Исключение
			Возврат МодулиЛок[ИмяМодуля];
		КонецПопытки;
	КонецЕсли;
	
	Возврат МодулиЛок[ИмяМодуля];
	
КонецФункции // ВызовМодуля