////////////////////////////////////////////////////////////////////////////////
// Служебные методы для работы с файловой системой на клиенте
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// КОНСТРУКТОРЫ

Функция ПараметрыДиалогаПомещенияФайлов(Заголовок = Неопределено,
		МножественныйВыбор = Ложь,
		Фильтр = Неопределено,
		ИндексФильтра = 0) Экспорт
	
	Попытка
		ПараметрыДиалога = Новый(Тип("ПараметрыДиалогаПомещенияФайлов"));
		ПараметрыДиалога.Заголовок = Заголовок;
		ПараметрыДиалога.МножественныйВыбор = МножественныйВыбор;
		ПараметрыДиалога.Фильтр = Фильтр;
		ПараметрыДиалога.ИндексФильтра = ИндексФильтра;
	Исключение
		ПараметрыДиалога = Новый Структура;
		ПараметрыДиалога.Вставить("Заголовок", Заголовок);
		ПараметрыДиалога.Вставить("МножественныйВыбор", МножественныйВыбор);
		ПараметрыДиалога.Вставить("Фильтр", Фильтр);
		ПараметрыДиалога.Вставить("ИндексФильтра", ИндексФильтра);
		ПараметрыДиалога = Новый ФиксированнаяСтруктура(ПараметрыДиалога);
	КонецПопытки;
	
	Возврат ПараметрыДиалога;
	
КонецФункции // ПараметрыДиалогаПомещенияФайлов

Функция ПараметрыДиалогаПолученияФайлов(Заголовок = Неопределено,
		ВыборКаталога = Неопределено,
		Каталог = Неопределено) Экспорт
	
	Попытка
		ПараметрыДиалога = Новый(Тип("ПараметрыДиалогаПолученияФайлов"));
		ПараметрыДиалога.Заголовок = Заголовок;
		ПараметрыДиалога.ВыборКаталога = ВыборКаталога;
		ПараметрыДиалога.Каталог = Каталог;
	Исключение
		ПараметрыДиалога = Новый Структура(
				"Заголовок, ВыборКаталога, Каталог",
				Заголовок, ВыборКаталога, Каталог);
		ПараметрыДиалога = Новый ФиксированнаяСтруктура(ПараметрыДиалога);
	КонецПопытки;
	
	Возврат ПараметрыДиалога;
	
КонецФункции // ПараметрыДиалогаПолученияФайлов

Функция ОписаниеПомещенногоФайла(Адрес, ПомещениеФайлаОтменено, СсылкаНаФайл) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Адрес", Адрес);
	Результат.Вставить("ПомещениеФайлаОтменено", ПомещениеФайлаОтменено);
	Результат.Вставить("СсылкаНаФайл", СсылкаНаФайл);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // ОписаниеПомещенногоФайла

Функция ОписаниеПереданногоФайла(ПутьКФайлу, Адрес) Экспорт
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторФайла", Новый УникальныйИдентификатор);
	Результат.Вставить("Имя", Файл.Имя);
	Результат.Вставить("ПолноеИмя", Файл.ПолноеИмя);
	Результат.Вставить("Хранение", Адрес);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // ОписаниеПереданногоФайла

Функция СсылкаНаФайл(Файл) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторФайла", Новый УникальныйИдентификатор());
	Результат.Вставить("Имя", Файл.Имя);
	Результат.Вставить("Расширение", Файл.Расширение);
	Результат.Вставить("Файл", Файл);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // СсылкаНаФайл

// НачатьПолучениеКаталогаВременныхФайлов

Процедура НачатьПолучениеКаталогаВременныхФайловЛок(ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов(); // BSLLS:TempFilesDir-off
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяКаталогаВременныхФайлов);
	Иначе
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПолучениеКаталогаВременныхФайловПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, ИсходноеОповещение);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеКаталогаВременныхФайловЛок

Процедура НачатьПолучениеКаталогаВременныхФайловПослеПроверкиРасширения(РасширениеПодключено,
		ИсходноеОповещение) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный83Клиент.НачатьПолучениеКаталогаВременныхФайловЛок(ИсходноеОповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеКаталогаВременныхФайловПослеПроверкиРасширения

// НачатьПолучениеИмениВременногоФайла

Процедура НачатьПолучениеИмениВременногоФайлаЛок(ИсходноеОповещение, Расширение = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("Оповещение", ИсходноеОповещение);
	Контекст.Вставить("Расширение", Расширение);
	
	#Если ВебКлиент Тогда
	Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
			"НачатьПолучениеИмениВременногоФайлаПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
	ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	#Иначе
	ИмяВремФайла = ПолучитьИмяВременногоФайла(Расширение); // BSLLS:MissingTemporaryFileDeletion-off Файл не создается
	КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяВремФайла);
	#КонецЕсли
	
КонецПроцедуры // НачатьПолучениеИмениВременногоФайлаЛок

Процедура НачатьПолучениеИмениВременногоФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПолучениеИмениВременногоФайлаПослеПолученияВременногоКаталога", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		НачатьПолучениеКаталогаВременныхФайловЛок(Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеИмениВременногоФайлаПослеПроверкиРасширения

Процедура НачатьПолучениеИмениВременногоФайлаПослеПолученияВременногоКаталога(
		ИмяКаталогаВременныхФайлов, Контекст) Экспорт
	
	Оповещение = Контекст.Оповещение;
	Расширение = Контекст.Расширение;
	
	Если НЕ Прав(ИмяКаталогаВременныхФайлов, 1) = "\" Тогда
		ИмяКаталогаВременныхФайлов = ИмяКаталогаВременныхФайлов + "\";
	КонецЕсли;
	
	ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + Строка(Новый УникальныйИдентификатор);
	
	Если НЕ ПустаяСтрока(Расширение) Тогда
		Если НЕ Лев(Расширение, 1) = "." Тогда
			ИмяВременногоФайла = ИмяВременногоФайла + ".";
		КонецЕсли;
		ИмяВременногоФайла = ИмяВременногоФайла + Расширение;
	КонецЕсли;
	
	КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(Оповещение, ИмяВременногоФайла);
	
КонецПроцедуры // НачатьПолучениеИмениВременногоФайлаПослеПолученияВременногоКаталога

// НачатьЗаписьДвоичныхДанных

Процедура НачатьЗаписьДвоичныхДанныхЛок(ДвоичныеДанные, ИсходноеОповещение, ИмяФайла) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ДвоичныеДанные.Записать(ИмяФайла);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ДвоичныеДанные", ДвоичныеДанные);
		Контекст.Вставить("ИмяФайла", ИмяФайла);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьЗаписьДвоичныхДанныхПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьЗаписьДвоичныхДанныхЛок

Процедура НачатьЗаписьДвоичныхДанныхПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.ДвоичныеДанные.НачатьЗапись(Контекст.Оповещение, Контекст.ИмяФайла);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьЗаписьДвоичныхДанныхПослеПроверкиРасширения

// НачатьСозданиеДвоичныхДанныхИзФайла

Процедура НачатьСозданиеДвоичныхДанныхИзФайлаЛок(ИсходноеОповещение, ИмяФайла) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ДвоичныеДанные);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяФайла", ИмяФайла);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьСозданиеДвоичныхДанныхИзФайлаПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеДвоичныхДанныхИзФайлаЛок

Процедура НачатьСозданиеДвоичныхДанныхИзФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный83Клиент.НачатьСозданиеДвоичныхДанныхИзФайлаЛок(Контекст.Оповещение, Контекст.ИмяФайла);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеДвоичныхДанныхИзФайлаПослеПроверкиРасширения

// НачатьКопированиеФайла

Процедура НачатьКопированиеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяФайлаПриемника);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяФайлаИсточника", ИмяФайлаИсточника);
		Контекст.Вставить("ИмяФайлаПриемника", ИмяФайлаПриемника);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьКопированиеФайлаПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьКопированиеФайлаЛок

Процедура НачатьКопированиеФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный83Клиент.НачатьКопированиеФайлаЛок(
			Контекст.Оповещение, Контекст.ИмяФайлаИсточника, Контекст.ИмяФайлаПриемника);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьКопированиеФайлаПослеПроверкиРасширения

// НачатьПеремещениеФайла

Процедура НачатьПеремещениеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ПереместитьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяФайлаПриемника);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяФайлаИсточника", ИмяФайлаИсточника);
		Контекст.Вставить("ИмяФайлаПриемника", ИмяФайлаПриемника);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПеремещениеФайлаПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПеремещениеФайлаЛок

Процедура НачатьПеремещениеФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный83Клиент.НачатьПеремещениеФайлаЛок(
			Контекст.Оповещение, Контекст.ИмяФайлаИсточника, Контекст.ИмяФайлаПриемника);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПеремещениеФайлаПослеПроверкиРасширения

// НачатьПоискФайлов

Процедура НачатьПоискФайловЛок(ИсходноеОповещение, Путь, Маска = Неопределено, ИскатьВПодкаталогах = Ложь) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		НайденныеФайлы = НайтиФайлы(Путь, Маска, ИскатьВПодкаталогах);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, НайденныеФайлы);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Путь", Путь);
		Контекст.Вставить("Маска", Маска);
		Контекст.Вставить("ИскатьВПодкаталогах", ИскатьВПодкаталогах);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПоискФайловПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПоискФайловЛок

Процедура НачатьПоискФайловПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный83Клиент.НачатьПоискФайловЛок(
			Контекст.Оповещение, Контекст.Путь, Контекст.Маска, Контекст.ИскатьВПодкаталогах);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПоискФайловПослеПроверкиРасширения

// НачатьСозданиеКаталога

Процедура НачатьСозданиеКаталогаЛок(ИсходноеОповещение, ИмяКаталога) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		СоздатьКаталог(ИмяКаталога);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяКаталога", ИмяКаталога);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьСозданиеКаталогаПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеКаталогаЛок

Процедура НачатьСозданиеКаталогаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный83Клиент.НачатьСозданиеКаталогаЛок(Контекст.Оповещение, Контекст.ИмяКаталога);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеКаталогаПослеПроверкиРасширения

// НачатьУдалениеФайлов

Процедура НачатьУдалениеФайловЛок(ИсходноеОповещение, Путь, Маска = Неопределено) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		УдалитьФайлы(Путь, Маска);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Путь", Путь);
		Контекст.Вставить("Маска", Маска);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьУдалениеФайловПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьУдалениеФайловЛок

Процедура НачатьУдалениеФайловПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный83Клиент.НачатьУдалениеФайловЛок(Контекст.Оповещение, Контекст.Путь, Контекст.Маска);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУдалениеФайловПослеПроверкиРасширения

// НачатьПомещениеФайлаНаСервер

Процедура НачатьПомещениеФайлаНаСерверЛок(ОписаниеОповещенияОЗавершении = Неопределено, // BSLLS:OrderOfParams-off
		ОписаниеОповещенияОХодеВыполнения = Неопределено, // Сигнатура соответствует оригиналу
		ОписаниеОповещенияПередНачалом = Неопределено,
		Адрес = Неопределено,
		Знач ПутьКФайлуПараметрыДиалога,
		УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	// 8.2
	Если ТипЗнч(ОписаниеОповещенияОЗавершении) = Тип("ФиксированнаяСтруктура") Тогда
		
		ВыбранноеИмяФайла = Неопределено;
		
		НачатьПомещениеФайлаНаСерверОбработкаИсточникаФайла(ВыбранноеИмяФайла, ПутьКФайлуПараметрыДиалога);
		
		Если ВыбранноеИмяФайла = Неопределено Тогда
			ОтказОтПомещенияФайла = Истина;
		Иначе
			
			СсылкаНаФайл = СсылкаНаФайл(Новый Файл(ВыбранноеИмяФайла));
			
			ОтказОтПомещенияФайла = Ложь;
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(СсылкаНаФайл);
			МассивПараметров.Добавить(ОтказОтПомещенияФайла);
			
			КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияПередНачалом, МассивПараметров);
			
			ОтказОтПомещенияФайла = МассивПараметров[1];
			
		КонецЕсли;
		
		Если НЕ ОтказОтПомещенияФайла = Истина Тогда
			
			Адрес = Неопределено;
			ПоместитьФайл(Адрес, ВыбранноеИмяФайла, , Ложь, УникальныйИдентификаторФормы);
			ПомещаемыйФайл = ОписаниеПомещенногоФайла(Адрес, ОтказОтПомещенияФайла, СсылкаНаФайл);
			
		Иначе
			ПомещаемыйФайл = Неопределено;
		КонецЕсли;
		
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияОЗавершении, ПомещаемыйФайл);
		
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
		Контекст.Вставить("ОписаниеОповещенияОХодеВыполнения", ОписаниеОповещенияОХодеВыполнения);
		Контекст.Вставить("ОписаниеОповещенияПередНачалом", ОписаниеОповещенияПередНачалом);
		Контекст.Вставить("Адрес", Адрес);
		Контекст.Вставить("ПутьКФайлуПараметрыДиалога", ПутьКФайлуПараметрыДиалога);
		Контекст.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПомещениеФайлаНаСерверПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверЛок

Процедура НачатьПомещениеФайлаНаСерверПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	ПутьКФайлуПараметрыДиалога = Контекст.ПутьКФайлуПараметрыДиалога;
	
	Если КонтурДиадокСтдСтрКлиентСервер.ВерсияПлатформыБольшеИлиРавна("8.3.15") Тогда
		
		КонтурДиадокСтдФССлужебный8315Клиент.НачатьПомещениеФайлаНаСерверЛок(Контекст.ОписаниеОповещенияОЗавершении,
			Контекст.ОписаниеОповещенияОХодеВыполнения,
			Контекст.ОписаниеОповещенияПередНачалом,
			Контекст.Адрес,
			ПутьКФайлуПараметрыДиалога,
			Контекст.УникальныйИдентификаторФормы);
		
	Иначе
		
		КонтекстЗавершения = Новый Структура;
		КонтекстЗавершения.Вставить("ОписаниеОповещенияОЗавершении", Контекст.ОписаниеОповещенияОЗавершении);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПомещениеФайлаНаСерверПослеПомещенияФайлаДо8_3_15", КонтурДиадокСтдФССлужебныйКлиент, КонтекстЗавершения);
		
		Если КонтурДиадокСтдСтрКлиентСервер.ВерсияПлатформыБольшеИлиРавна("8.3.13") Тогда
			
			Если ТипЗнч(ПутьКФайлуПараметрыДиалога) = Тип("ФиксированнаяСтруктура") Тогда
				
				ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
				ДиалогОткрытияФайла.Заголовок = ПутьКФайлуПараметрыДиалога.Заголовок;
				ДиалогОткрытияФайла.МножественныйВыбор = ПутьКФайлуПараметрыДиалога.МножественныйВыбор;
				ДиалогОткрытияФайла.Фильтр = ПутьКФайлуПараметрыДиалога.Фильтр;
				
				ПутьКФайлуПараметрыДиалога = ДиалогОткрытияФайла;
				
				Интерактивно = Истина;
				
			Иначе
				Интерактивно = Ложь;
			КонецЕсли;
			
			КонтурДиадокСтдФССлужебный83Клиент.НачатьПомещениеФайлаЛок(Оповещение,
				Контекст.Адрес,
				ПутьКФайлуПараметрыДиалога,
				Интерактивно,
				Контекст.УникальныйИдентификаторФормы,
				Контекст.ОписаниеОповещенияПередНачалом);
			
			// от 8.3.6
		Иначе
			
			Интерактивно = Ложь;
			
			Если ТипЗнч(ПутьКФайлуПараметрыДиалога) = Тип("ФиксированнаяСтруктура") Тогда
				Интерактивно = Истина;
			КонецЕсли;
			
			КонтурДиадокСтдФССлужебный83Клиент.НачатьПомещениеФайлаЛок(Оповещение,
				Контекст.Адрес,
				ПутьКФайлуПараметрыДиалога,
				Интерактивно,
				Контекст.УникальныйИдентификаторФормы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверПослеПроверкиРасширения

Процедура НачатьПомещениеФайлаНаСерверПослеПомещенияФайлаДо8_3_15(Результат, Адрес, ПомещаемыйФайл, Контекст) Экспорт
	
	Если Результат = Истина Тогда
		
		СсылкаНаФайл = СсылкаНаФайл(Новый Файл(ПомещаемыйФайл));
		ОтказОтПомещенияФайла = Ложь;
		
		ПомещаемыйФайл = ОписаниеПомещенногоФайла(Адрес, ОтказОтПомещенияФайла, СсылкаНаФайл);
		
	Иначе
		
		ПомещаемыйФайл = Неопределено;
		
	КонецЕсли;
	
	КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(Контекст.ОписаниеОповещенияОЗавершении, ПомещаемыйФайл);
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверПослеПомещенияФайлаДо8_3_15

// НачатьПолучениеФайлаССервераСДиалогом

Процедура НачатьПолучениеФайлаССервераСДиалогомЛок(Адрес,
		ИмяФайла = Неопределено, ПараметрыДиалога = Неопределено) Экспорт
	
	Если НЕ КонтурДиадокСтдСтрКлиентСервер.ВерсияПлатформыБольшеИлиРавна("8.3.15") Тогда
		
		ПолучитьФайл(Адрес, ИмяФайла, Истина);
		
	Иначе
		
		КонтурДиадокСтдФССлужебный8315Клиент.НачатьПолучениеФайлаССервераСДиалогом(Адрес, ИмяФайла, ПараметрыДиалога);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеФайлаССервераСДиалогомЛок

// НачатьПолучениеФайлаССервераБезДиалога

Процедура НачатьПолучениеФайлаССервераБезДиалогаЛок(// Сигнатура соответствует оригиналу
		ОписаниеОповещенияОЗавершении = Неопределено, Адрес, ПутьКФайлу) Экспорт // BSLLS:OrderOfParams-off
	
	Если НЕ КонтурДиадокСтдСтрКлиентСервер.ВерсияПлатформыБольшеИлиРавна("8.3.15") Тогда
		
		#Если ВебКлиент Тогда
		ПолучитьФайл(Адрес, ПутьКФайлу, Истина); // В веб клиенте всегда Интерактивно = Истина
		
		#Иначе
		ПолучитьФайл(Адрес, ПутьКФайлу, Ложь);
		#КонецЕсли
		
		Если НЕ ОписаниеОповещенияОЗавершении = Неопределено Тогда
			ОписаниеФайла = ОписаниеПереданногоФайла(ПутьКФайлу, Адрес);
			КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияОЗавершении, ОписаниеФайла);
		КонецЕсли;
		
	Иначе
		
		#Если ВебКлиент Тогда
		Контекст = Новый Структура;
		Контекст.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
		Контекст.Вставить("Адрес", Адрес);
		Контекст.Вставить("ПутьКФайлу", ПутьКФайлу);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПолучениеФайлаССервераБезДиалогаПослеПроверкиРасширения", КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		#Иначе
		КонтурДиадокСтдФССлужебный8315Клиент.НачатьПолучениеФайлаССервераБезДиалога(ОписаниеОповещенияОЗавершении, Адрес, ПутьКФайлу);
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеФайлаССервераБезДиалогаЛок

Процедура НачатьПолучениеФайлаССервераБезДиалогаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		КонтурДиадокСтдФССлужебный8315Клиент.НачатьПолучениеФайлаССервераБезДиалога(Контекст.ОписаниеОповещенияОЗавершении,
			Контекст.Адрес,
			Контекст.ПутьКФайлу);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеФайлаССервераБезДиалогаПослеПроверкиРасширения

// НачатьЗапросРазрешенияПользователя

Процедура НачатьЗапросРазрешенияПользователяЛок(ИсходноеОповещение, Вызовы) Экспорт
	
	Возврат;
	
КонецПроцедуры // НачатьЗапросРазрешенияПользователяЛок

// НачатьПолучениеВремениИзмененияФайла

Процедура НачатьПолучениеВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьВремяИзменения();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПолучениеВремениИзмененияФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеВремениИзмененияФайлаЛок

Процедура НачатьПолучениеВремениИзмененияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеВремениИзменения(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеВремениИзмененияФайлаПослеПроверкиРасширения

// НачатьПолучениеНевидимостиФайла

Процедура НачатьПолучениеНевидимостиФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьНевидимость();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьПолучениеНевидимостиФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеНевидимостиФайлаЛок

Процедура НачатьПолучениеНевидимостиФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеНевидимости(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеНевидимостиФайлаПослеПроверкиРасширения

// НачатьПолучениеРазмераФайла

Процедура НачатьПолучениеРазмераФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.Размер();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьПолучениеРазмераФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеРазмераФайлаЛок

Процедура НачатьПолучениеРазмераФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеРазмера(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеРазмераФайлаПослеПроверкиРасширения

// НачатьПолучениеТолькоЧтенияФайла

Процедура НачатьПолучениеТолькоЧтенияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьТолькоЧтение();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьПолучениеТолькоЧтенияФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеТолькоЧтенияФайлаЛок

Процедура НачатьПолучениеТолькоЧтенияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеТолькоЧтения(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеТолькоЧтенияФайлаПослеПроверкиРасширения

// НачатьПолучениеУниверсальногоВремениИзмененияФайла

Процедура НачатьПолучениеУниверсальногоВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьУниверсальноеВремяИзменения();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьПолучениеУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеУниверсальногоВремениИзмененияФайлаЛок

Процедура НачатьПолучениеУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения(
		РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеУниверсальногоВремениИзменения(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения

// НачатьПроверкуСуществованияФайла

Процедура НачатьПроверкуСуществованияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.Существует();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьПроверкуСуществованияФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуСуществованияФайлаЛок

Процедура НачатьПроверкуСуществованияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПроверкуСуществования(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуСуществованияФайлаПослеПроверкиРасширения

// НачатьПроверкуЭтоКаталогФайл

Процедура НачатьПроверкуЭтоКаталогФайлЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ЭтоКаталог();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьПроверкуЭтоКаталогФайлПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоКаталогФайлЛок

Процедура НачатьПроверкуЭтоКаталогФайлПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПроверкуЭтоКаталог(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоКаталогФайлПослеПроверкиРасширения

// НачатьПроверкуЭтоФайлФайл

Процедура НачатьПроверкуЭтоФайлФайлЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ЭтоФайл();
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьПроверкуЭтоФайлФайлПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоФайлФайлЛок

Процедура НачатьПроверкуЭтоФайлФайлПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПроверкуЭтоФайл(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоФайлФайлПослеПроверкиРасширения

// НачатьУстановкуВремениИзмененияФайла

Процедура НачатьУстановкуВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение, ВремяИзменения) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьВремяИзменения(ВремяИзменения);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("ВремяИзменения", ВремяИзменения);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьУстановкуВремениИзмененияФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуВремениИзмененияФайлаЛок

Процедура НачатьУстановкуВремениИзмененияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуВремениИзменения(Контекст.Оповещение, Контекст.ВремяИзменения);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуВремениИзмененияФайлаПослеПроверкиРасширения

// НачатьУстановкуНевидимостиФайла

Процедура НачатьУстановкуНевидимостиФайлаЛок(Файл, ИсходноеОповещение, Невидимость) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьНевидимость(Невидимость);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("Невидимость", Невидимость);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьУстановкуНевидимостиФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуНевидимостиФайлаЛок

Процедура НачатьУстановкуНевидимостиФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуНевидимости(Контекст.Оповещение, Контекст.Невидимость);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуНевидимостиФайлаПослеПроверкиРасширения

// НачатьУстановкуТолькоЧтенияФайла

Процедура НачатьУстановкуТолькоЧтенияФайлаЛок(Файл, ИсходноеОповещение, ТолькоЧтение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьТолькоЧтение(ТолькоЧтение);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("ТолькоЧтение", ТолькоЧтение);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения("НачатьУстановкуТолькоЧтенияФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуТолькоЧтенияФайлаЛок

Процедура НачатьУстановкуТолькоЧтенияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуТолькоЧтения(Контекст.Оповещение, Контекст.ТолькоЧтение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуТолькоЧтенияФайлаПослеПроверкиРасширения

// НачатьУстановкуУниверсальногоВремениИзмененияФайла

Процедура НачатьУстановкуУниверсальногоВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение, ВремяИзменения) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьУниверсальноеВремяИзменения(ВремяИзменения);
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("ВремяИзменения", ВремяИзменения);
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"НачатьУстановкуУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения",
				КонтурДиадокСтдФССлужебныйКлиент, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуУниверсальногоВремениИзмененияФайлаЛок

Процедура НачатьУстановкуУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения(
		РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуУниверсальногоВремениИзменения(Контекст.Оповещение, Контекст.ВремяИзменения);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения

// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПослеПодключенияРасширенияРаботыСФайлами(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда
		РасширениеПодключено = Истина;
		КонтурДиадокСтдОбщегоНазначенияКлиент.ВыполнитьОбработкуОповещенияЛок(ДопПараметры.ИсходноеОповещение, РасширениеПодключено);
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		
		Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
				"ПослеУстановкиРасширенияРаботыСФайлами",
				КонтурДиадокСтдФССлужебныйКлиент,
				ДопПараметры.ИсходноеОповещение);
		
		КонтурДиадокСтдФССлужебный83Клиент.НачатьУстановкуРасширенияРаботыСФайламиЛок(Оповещение);
		
	Иначе
		// не удалось подключить или установить расширение
		ВызватьИсключение("Не удалось подключить или установить расширение");
	КонецЕсли;
	
КонецПроцедуры // ПослеПодключенияРасширенияРаботыСФайлами

Процедура ПослеУстановкиРасширенияРаботыСФайлами(ИсходноеОповещение) Экспорт
	
	ПодключитьУстановитьРасширениеРаботыСФайлами(ИсходноеОповещение, Ложь);
	
КонецПроцедуры // ПослеУстановкиРасширенияРаботыСФайлами

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура НачатьПомещениеФайлаНаСерверОбработкаИсточникаФайла(ВыбранноеИмяФайла, ПутьКФайлуПараметрыДиалога)
	
	ТипЗнчИсточника = ТипЗнч(ПутьКФайлуПараметрыДиалога);
	
	Если ТипЗнчИсточника = Тип("ФиксированнаяСтруктура")
		И ПутьКФайлуПараметрыДиалога.Свойство("Заголовок") Тогда
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Заголовок = ПутьКФайлуПараметрыДиалога.Заголовок;
		ДиалогОткрытияФайла.МножественныйВыбор = ПутьКФайлуПараметрыДиалога.МножественныйВыбор;
		ДиалогОткрытияФайла.Фильтр = ПутьКФайлуПараметрыДиалога.Фильтр;
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ВыбранноеИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнчИсточника = Тип("Строка") Тогда
		ВыбранноеИмяФайла = ПутьКФайлуПараметрыДиалога;
	Иначе
		ВызватьИсключение "Ошибка типа: " + ТипЗнчИсточника;
	КонецЕсли;
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверОбработкаИсточникаФайла

Процедура ПодключитьУстановитьРасширениеРаботыСФайлами(ИсходноеОповещение, УстановитьЕслиНеПодключено = Истина)
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("УстановитьЕслиНеПодключено", УстановитьЕслиНеПодключено);
	ДопПараметры.Вставить("ИсходноеОповещение", ИсходноеОповещение);
	
	Оповещение = КонтурДиадокСтдОбщегоНазначенияКлиент.ОписаниеОповещения(
			"ПослеПодключенияРасширенияРаботыСФайлами",
			КонтурДиадокСтдФССлужебныйКлиент,
			ДопПараметры);
	
	КонтурДиадокСтдФССлужебный83Клиент.НачатьПодключениеРасширенияРаботыСФайламиЛок(Оповещение);
	
КонецПроцедуры // ПодключитьУстановитьРасширениеРаботыСФайлами

Процедура ОбработатьОтсутствиеРасширенияРаботыСФайлами()
	
	ВызватьИсключение "Не подключено расширение работы с файлами";
	
КонецПроцедуры // ОбработатьОтсутствиеРасширенияРаботыСФайлами