// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем ОсновнойМодуль Экспорт;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//{ СлужебныйПрограммныйИнтерфейс

// Заполняет коллекцию DocumentShipments переданного контента документа 
// данными документов об отгрузке счет-фактуры.
//
//Параметры:
// Контент820 - Структура - см. ОсновнойМодуль.Новый_Utd820SellerContent()
//
Процедура ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку(Контент820, СсылкаНаОбъект) Экспорт
	
	ИнтеграционныйМодуль = ОсновнойМодуль.Модуль_Интеграция;
	
	Если ИнтеграционныйМодуль.ЭтоСчетФактураНаАванс(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДокПодтвОтгр = Контент820.DocumentShipments;
	ФункцияДокумента = Контент820.Function;
	СтрокиТаблицы = Контент820.Table.Items;
	
	Если ФункцияДокумента = ФункцияПрото_Invoice() Тогда
		
		ДокументыОснования = ДокументыОснованияСчетаФактуры(СсылкаНаОбъект);
		
		НаименованиеДокумента = НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОснования, ФункцияДокумента);
		
		Для Каждого ОснованиеСФ Из ДокументыОснования Цикл
			
			Если ИнтеграционныйМодуль.ЭтоКорректировкаРеализации(ОснованиеСФ) Тогда
				ДокументОтгрузки = ИнтеграционныйМодуль.ПолучитьДокОснованиеКорректировкиРеализациии(ОснованиеСФ);
			Иначе
				ДокументОтгрузки = ОснованиеСФ;
			КонецЕсли;
			
			РеквизитыДокументаОтгрузки = ЗначенияРеквизитовОбъектаЛокальная(ДокументОтгрузки, "Дата");
			
			ДатаДокумента = РеквизитыДокументаОтгрузки.Дата;
			НомерДокумента = ИнтеграционныйМодуль.ПолучитьНомерНаПечатьДиадок(ДокументОтгрузки);
			
			РеквизитыДокумента = ДокПодтвОтгр.Добавить();
			РеквизитыДокумента.Name = НаименованиеДокумента;
			РеквизитыДокумента.Number = НомерДокумента;
			РеквизитыДокумента.Date = ДатаДокумента;
			
		КонецЦикла;
		
	Иначе
		
		ДокументыОснования = Новый Массив;
		
		НаименованиеДокумента = НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОснования, ФункцияДокумента);
		
		РеквизитыДокумента = ДокПодтвОтгр.Добавить();
		РеквизитыДокумента.Name = НаименованиеДокумента;
		РеквизитыДокумента.Number = Контент820.DocumentNumber;
		РеквизитыДокумента.Date = Контент820.DocumentDate;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияПрото_InvoiceAndBasic() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

Функция ВДокументеЕстьТовары(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВДокументеЕстьУслуги(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ItemMarks()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Имущество", "Property");
	Результат.Вставить("Работа", "Job");
	Результат.Вставить("Услуга", "Service");
	Результат.Вставить("ИмущественныеПрава", "PropertyRights");
	Результат.Вставить("Иное", "Other");
	
	Возврат Результат;
	
КонецФункции

Функция ФункцияПрото_InvoiceAndBasic()
	
	Возврат "InvoiceAndBasic";
	
КонецФункции

Функция ФункцияПрото_Invoice()
	
	Возврат "Invoice";
	
КонецФункции

// Заполняет список правил создания учетных документов, которые
// могут быть применены к указанному формату электронных документов.
//
// Параметры:
//  ПравилаСоздания - СписокЗначений - Список с идентификаторами правил создания дкоументов учета.
//  ФорматЭД - Структура - описание формата электронных документов (см. НовоеОписаниеФорматаЭлектронногоДокумента).
//
Процедура ЗаполнитьПравилаСозданияДокументовУчета(ПравилаСоздания, ФорматЭД) Экспорт
	
	СтандартнаяОбработка = Истина;
	ИнтеграционныйМодуль = МодульИнтеграции();
	
	ИнтеграционныйМодуль.ПриЗаполненииПравилСозданияДокументовУчета(
		ПравилаСоздания,
		ФорматЭД,
		СтандартнаяОбработка
	);
	
	Если СтандартнаяОбработка Тогда
		
		ЗаполнитьПравилаСозданияДокументовУчетаПоУмолчанию(ПравилаСоздания, ФорматЭД);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйДокументИнформационнойБазы(ИдентификаторОперации, ПараметрыСоздания, ДанныеЭД) Экспорт
	
	СтандартнаяОбработка = Истина;
	ИнтеграционныйМодуль = МодульИнтеграции();
	
	НовыйОбъект = Неопределено;
	
	ИнтеграционныйМодуль.ПриСозданииДокументаУчета(
		НовыйОбъект,
		ИдентификаторОперации,
		ПараметрыСоздания,
		ДанныеЭД,
		СтандартнаяОбработка
	);
	
	Если НовыйОбъект = Неопределено Тогда
		
		МенеджерОбъекта = Документы[ИдентификаторОперации];
		НовыйОбъект = МенеджерОбъекта.СоздатьДокумент();
		
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		
		НовыйОбъект.Заполнить(ПараметрыСоздания);
		
		ОбъектМетаданных = НовыйОбъект.Метаданные();
		
		Если ЕстьРеквизитМетаданных(ОбъектМетаданных, "Комментарий")
			И Не ЗначениеЗаполнено(НовыйОбъект.Комментарий) Тогда
			НовыйОбъект.Комментарий = "Загружен из системы Диадок";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НовыйОбъект.Дата) Тогда
			НовыйОбъект.Дата = ТекущаяДата();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НовыйОбъект.Номер) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не НовыйОбъект = Неопределено Тогда
		ТабличнаяЧастьЭД = ДанныеЭД.ТабличнаяЧасть;
		ИспользоватьКонтурМаркировку = ПараметрыСоздания.ИспользоватьКонтурМаркировку; // TODO: Получать из параметров
		ЗагрузитьКодыМаркировки(НовыйОбъект, ТабличнаяЧастьЭД, ИспользоватьКонтурМаркировку);
	КонецЕсли;
	
	Возврат НовыйОбъект;
	
КонецФункции

// Получает номенклатуру информационной базы, соответствующую идентификаторам номенклатуры контрагента.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип.ВладелецНоменклатурыБЭД - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Строка, Массив из Строка - идентификаторы номенклатуры контрагента.
// 
// Возвращаемое значение:
//  Соответствие - содержит:
//    * Ключ - Строка - идентификатор номенклатуры контрагента.
//    * Значение - Структура - номенклатура информационной базы (см. МенеджерИнтеграции.НоваяНоменклатураИнформационнойБазы)
//
Функция ПрочитатьСопоставлениеНоменклатуры(ВладелецНоменклатуры, ИдентификаторыНоменклатуры) Экспорт
	
	Результат = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(ИдентификаторыНоменклатуры) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ИдентификаторыНоменклатуры) = Тип("Массив") Тогда
		КоллекцияИдентификаторов = ИдентификаторыНоменклатуры;
	Иначе
		КоллекцияИдентификаторов = Новый Массив;
		КоллекцияИдентификаторов.Добавить(ИдентификаторыНоменклатуры);
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	ПрочитатьСоответствиеНоменклатурыПереопределяемый(
		Результат,
		ВладелецНоменклатуры,
		КоллекцияИдентификаторов,
		СтандартнаяОбработка
	);
	
	Если СтандартнаяОбработка Тогда
		
		ПрочитатьСоответствиеНоменклатурыПоУмолчанию(
			Результат,
			ВладелецНоменклатуры,
			КоллекцияИдентификаторов
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Записывает соответствие номенклатуры информационной базы с номенклатурой поставщика.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - сведения о номенклатуре контрагента (см. МенеджерИнтеграции.НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - сведения о номенклатуре информационной базы (см. МенеджерИнтеграции.НоваяНоменклатураИнформационнойБазы)
//
Процедура ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	СтандартнаяОбработка = Истина;
	ЗаписатьСоответствиеНоменклатурыПереопределяемый(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ЗаписатьСоответствиеНоменклатурыПоУмолчанию(НоменклатураКонтрагента, НоменклатураИБ);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает описание и взаимосвязь объектов, составляющих номенклатуру информационной базы.
// Результат базируется на определяемых типах и переопределяемых методах.
//
// Возвращаемое значение:
//  Структура - данные о структуре номенклатуры информационной базы:
//   * ВладелецНоменклатурыПредставлениеОбъекта - Строка - представление единичного объекта владельца номенклатуры.
//   * НоменклатураПредставлениеОбъекта - Строка - представление единичного объекта номенклатуры.
//   * ХарактеристикаПредставлениеОбъекта - Строка - представление единичного объекта характеристики.
//   * УпаковкаПредставлениеОбъекта - Строка - представление единичного объекта упаковки.
//   * ИмяПараметраСвязиХарактеристики - Строка - имя параметра связи характеристики от номенклатуры.
//   * ИмяПараметраСвязиУпаковки - Строка - имя параметра связи упаковки от номенклатуры.
//
Функция МетаданныеСопоставленияНоменклатуры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВладелецНоменклатурыПредставлениеОбъекта");
	Результат.Вставить("НоменклатураПредставлениеОбъекта");
	Результат.Вставить("ХарактеристикаПредставлениеОбъекта");
	Результат.Вставить("УпаковкаПредставлениеОбъекта");
	
	Результат.Вставить("ИмяПараметраСвязиХарактеристики", "Отбор.Владелец");
	Результат.Вставить("ИмяПараметраСвязиУпаковки", "Отбор.Владелец");
	
	СтандартнаяОбработка = Истина;
	
	ИнтеграционныйМодуль = МодульИнтеграции();
	ИнтеграционныйМодуль.ПриЗаполненииМетаданныхСопоставленияНоменклатуры(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ЗаполнитьМетаданныеСопоставленияНоменклатурыПоУмолчанию(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает свойства набора номенклатур информационной базы.
// Определяет обязательность использования характеристики и упаковки.
//
// Параметры:
//  СсылкаИлиМассив - Массив из ОпределяемыйТип.НоменклатураБЭД, ОпределяемыйТип.НоменклатураБЭД
//    - ссылки на номенклатуру ИБ, для которой требуется определить свойства. Если передается ссылка, преобразуется в массив.
//
// Возвращаемое значение:
// Соответствие, Неопределено - в случае незаполненного набора номенклатуры возвращается Неопределено. Соответствие содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//
Функция СвойстваНоменклатурыИнформационнойБазы(Знач СсылкаИлиМассив) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаИлиМассив) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваНоменклатурИБ = Новый Соответствие;
	
	Если ТипЗнч(СсылкаИлиМассив) = Тип("Массив") Тогда
		НаборНоменклатуры = СсылкаИлиМассив;
	Иначе
		НаборНоменклатуры = Новый Массив;
		НаборНоменклатуры.Добавить(СсылкаИлиМассив);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаборНоменклатуры) Тогда
		Возврат СвойстваНоменклатурИБ;
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	
	ИнтеграционныйМодуль = МодульИнтеграции();
	ИнтеграционныйМодуль.ПриОпределенииСвойствНоменклатурыИнформационнойБазы(СвойстваНоменклатурИБ, НаборНоменклатуры, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ОпределитьСвойстваНоменклатурыИнформационнойБазыПоУмолчанию(СвойстваНоменклатурИБ, НаборНоменклатуры);
	КонецЕсли;
	
	Возврат СвойстваНоменклатурИБ;
	
КонецФункции

// Возвращает структуру свойств номенклатуры ИБ.
//
// Возвращаемое значение:
//  Структура - свойства номенклатуры информационной базы:
//   * ИспользоватьХарактеристики           - Булево - признак использования характеристик. По умолчанию Ложь.
//   * ИспользоватьУпаковки                 - Булево - признак использования упаковок. По умолчанию Ложь.
//   * ОбязательноеЗаполнениеХарактеристики - Булево - признак обязательного заполнения характеристик при их использовании. По умолчанию Истина.
//
Функция НовыеСвойстваНоменклатурыИБ() Экспорт
	
	СвойствоНоменклатуры = Новый Структура;
	СвойствоНоменклатуры.Вставить("ИспользоватьХарактеристики"          , Ложь);
	СвойствоНоменклатуры.Вставить("ИспользоватьУпаковки"                , Ложь);
	СвойствоНоменклатуры.Вставить("ОбязательноеЗаполнениеХарактеристики", Ложь);
	
	Возврат СвойствоНоменклатуры;
	
КонецФункции

// Заполняет коллекцию значений полей маршрутизации по данным документа 1С
//
// Параметры:
//	ЗначениеПолей	- Массив			- коллекция со значением полей маршрутизации
//	ИменаПолей		- Массив			- коллекция с именами полей маршрутизации
//	Документ1С		- ДокументСсылка	- документ, по которому определяются значения полей маршрутизации
Процедура ПолучитьЗначениеПолейМаршрутизацииПоДокументу1С(ЗначениеПолей, ИменаПолей, Документ1С) Экспорт
	
	Если Не ЗначениеЗаполнено(ИменаПолей) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛокальная(Документ1С, ИменаПолей);
	
	Для Каждого КлючЗначение Из ЗначенияРеквизитов Цикл
		Если ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
			ЗначениеПолей.Добавить(КлючЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//} СлужебныйПрограммныйИнтерфейс

Функция МодульФорматыЭлектронныхДокументов()
	
	ИмяМодуля = "ФорматыЭД";
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция МодульИнтеграции()
	
	ИмяМодуля = "Модуль_Интеграция";
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМодульПрог(ИмяМодуля)
	
	Возврат ОсновнойМодуль.ПолучитьМодульПрог(ИмяМодуля);
	
КонецФункции 

Процедура ЗаполнитьПравилаСозданияДокументовУчетаПоУмолчанию(ПравилаСоздания, ФорматЭД)
	
	ФорматыЭД = МодульФорматыЭлектронныхДокументов();
	
	Если ФорматыЭД.ЭтоУниверсальныйПередаточныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоПередаточныйДокумент(ФорматЭД) Тогда
		
		Операция = ОперацияПоступлениеТоваровУслуг();
		Представление = "Поступление товаров и услуг";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияПоступлениеДопРасходов();
		Представление = "Поступление доп. расходов";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоУниверсальныйКорректировочныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоСоглашениеОбИзмененииСтоимости(ФорматЭД) Тогда
		
		Операция = ОперацияКорректировкаПоступления();
		Представление = "Корректировка поступления";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоСчетФактура(ФорматЭД) Тогда
		
		Операция = ОперацияСчетФактураПолученный();
		Представление = "Счет-фактура полученный";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоКорректировочныйСчетФактура(ФорматЭД) Тогда
		
		Операция = ОперацияКорректировочныйСчетФактураПолученный();
		Представление = "Счет-фактура полученный (корректировочный)";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоАктСверкиВзаиморасчетов(ФорматЭД) Тогда
		
		Операция = ОперацияАктСверкиВзаиморасчетов();
		Представление = "Акт сверки взаиморасчетов";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОперацияПоступлениеТоваровУслуг()
	Возврат "ПоступлениеТоваровУслуг";
КонецФункции

Функция ОперацияПоступлениеДопРасходов()
	Возврат "ПоступлениеДопРасходов";
КонецФункции

Функция ОперацияКорректировкаПоступления()
	Возврат "КорректировкаПоступления";
КонецФункции

Функция ОперацияСчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

Функция ОперацияКорректировочныйСчетФактураПолученный()
	Возврат "КорректировочныйСчетФактураПолученный";
КонецФункции

Функция ОперацияАктСверкиВзаиморасчетов()
	Возврат "АктСверкиВзаиморасчетов";
КонецФункции

// Ищет варианты сопоставления номенклатуры по номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - см. Контракт_НоменклатураКонтрагента
// 
// Возвращаемое значение:
//  Массив из Контракт_НоменклатураКонтрагента
//
Функция ВариантыСопоставленияНоменклатуры(НоменклатураКонтрагента) Экспорт
	
	Результат = Новый Массив;
	
	СтандартнаяОбработка = Истина;
	
	ИнтеграционныйМодуль = МодульИнтеграции();
	
	Если ИнтеграционныйМодуль <> Неопределено Тогда
		
		ИнтеграционныйМодуль.ПриЗаполненииВариантовСопоставленияНоменклатуры(
			Результат, 
			НоменклатураКонтрагента,
			СтандартнаяОбработка
		);
		
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		
		ЗаполнитьВариантыСопоставленияНоменклатурыПоУмолчанию(
			Результат,
			НоменклатураКонтрагента
		);
		
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента 
//
Процедура ЗаполнитьВариантыСопоставленияНоменклатурыПоУмолчанию(Результат, НоменклатураКонтрагента) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ИменаВТ = Новый Массив;
	
	ДобавитьЗапросПоАртикулу(МенеджерВТ, ИменаВТ, НоменклатураКонтрагента.Артикул);
	ДобавитьЗапросПоАртикулу(МенеджерВТ, ИменаВТ, НоменклатураКонтрагента.Код);
	ДобавитьЗапросПоНаименованию(МенеджерВТ, ИменаВТ, НоменклатураКонтрагента.Наименование);
	
	Если Не ЗначениеЗаполнено(ИменаВТ) Тогда
		Возврат;
	КонецЕсли;
	
	ИтоговыйТекст = "";
	Разделитель = "";
	Для Каждого ИмяВТ Из ИменаВТ Цикл
		ТекстЗапроса = "ВЫБРАТЬ * ИЗ " + ИмяВТ; 
		ИтоговыйТекст = ИтоговыйТекст + Разделитель + ТекстЗапроса;
		Разделитель = " ОБЪЕДИНИТЬ ";
	КонецЦикла;
	
	Запрос = Новый Запрос(ИтоговыйТекст);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоменклатураИБ = НоваяНоменклатураИнформационнойБазы(ВыборкаДетальныеЗаписи.НоменклатураСсылка);
		
		Результат.Добавить(НоменклатураИБ);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавить запрос по артикулу
//
// Параметры:
//  МенеджерВТ	 - МенеджерВременныхТаблиц - менеджер временных таблиц запроса на варианты сопоставления номенклатуры 
//  ИменаВТ		 - Массив - Массив имен временных таблиц
//  Артикул		 - Строка - Искомый артикул
//
Процедура ДобавитьЗапросПоАртикулу(МенеджерВТ, ИменаВТ, Артикул)
	
	Если Не ЗначениеЗаполнено(Артикул) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВТ = "ВТ_ПоАртикулу" + XMLСтрока(ИменаВТ.Количество());
	
	Текст = 
	"ВЫБРАТЬ
	|  Т.Ссылка КАК НоменклатураСсылка
	|ПОМЕСТИТЬ ИмяВТ
	|ИЗ
	|  Справочник.Номенклатура КАК Т
	|ГДЕ
	|  Т.Артикул = &Артикул
	|  И НЕ Т.ЭтоГруппа
	|  И НЕ Т.ПометкаУдаления";
	
	Запрос = Новый Запрос(Текст);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяВТ", ИмяВТ);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Параметры.Вставить("Артикул", Артикул); 
	
	Запрос.Выполнить();
	
	ИменаВТ.Добавить(ИмяВТ);
	
КонецПроцедуры

// Добавить запрос по наименованию
//
// Параметры:
//  МенеджерВТ	 - МенеджерВременныхТаблиц - менеджер временных таблиц запроса на варианты сопоставления номенклатуры 
//  ИменаВТ		 - Массив - Массив имен временных таблиц
//  Наименование - Строка - Искомое наименование
//
Процедура ДобавитьЗапросПоНаименованию(МенеджерВТ, ИменаВТ, Наименование)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВТ = "ВТ_ПоНаименованию" + XMLСтрока(ИменаВТ.Количество());
	
	Текст =
		"ВЫБРАТЬ
		|  Т.Ссылка КАК НоменклатураСсылка
		|ПОМЕСТИТЬ ИмяВТ
		|ИЗ
		|  Справочник.Номенклатура КАК Т
		|ГДЕ
		|  Т.Наименование = ВЫРАЗИТЬ(&Наименование КАК Строка(1024))
		|  И НЕ Т.ЭтоГруппа
		|  И НЕ Т.ПометкаУдаления";
	
	Запрос = Новый Запрос(Текст);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяВТ", ИмяВТ);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Параметры.Вставить("Наименование", Наименование);
	
	Запрос.Выполнить();
	
	ИменаВТ.Добавить(ИмяВТ);
	
КонецПроцедуры

// Контракт новой номенклатуры Информационной базы
//
// Параметры:
//  Номенклатура	 - СправочникСсылка - Ссылка на номенклатуру
//  Характеристика	 - СправочникСсылка - Ссылка на характеристику
//  Упаковка		 - СправочникСсылка - Ссылка на упаковку или единицу измерения
// 
// Возвращаемое значение:
//  Структура - структура с полями 
//			  - Номенклатура - Ссылка или неопределено
//			  - Характеристика - Ссылка или неопределено
//			  - Упаковка - Ссылка или неопределено
//
Функция НоваяНоменклатураИнформационнойБазы(Номенклатура, Характеристика = Неопределено, Упаковка = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Номенклатура);
	Результат.Вставить("Характеристика");
	Результат.Вставить("Упаковка");
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Результат.Характеристика = Характеристика;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Результат.Упаковка = Упаковка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьСоответствиеНоменклатурыПоУмолчанию(СоответствиеНоменклатуры, ВладелецНоменклатуры, ИдентификаторыНоменклатуры)
	
	ВызватьИсключение "Отсутствует обработка события (ПриЧтенииСоответствияНоменклатуры)";
	
КонецПроцедуры

Процедура ПрочитатьСоответствиеНоменклатурыПереопределяемый(СоответствиеНоменклатуры, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка)
	
	ИнтеграционныйМодуль = МодульИнтеграции();
	
	ИнтеграционныйМодуль.ПриЧтенииСоответствияНоменклатуры(
		СоответствиеНоменклатуры,
		ВладелецНоменклатуры,
		ИдентификаторыНоменклатуры,
		СтандартнаяОбработка
	);
	
КонецПроцедуры

Процедура ЗаписатьСоответствиеНоменклатурыПереопределяемый(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка)
	
	ИнтеграционныйМодуль = МодульИнтеграции();
	
	ИнтеграционныйМодуль.ПриЗаписиСоответствияНоменклатуры(
		НоменклатураКонтрагента,
		НоменклатураИБ,
		СтандартнаяОбработка
	);
	
КонецПроцедуры

Процедура ЗаписатьСоответствиеНоменклатурыПоУмолчанию(НоменклатураКонтрагента, НоменклатураИБ)
	
	ВызватьИсключение "Отсутствует обработка события (ПриЗаписиСоответствияНоменклатуры)";
	
КонецПроцедуры

Процедура ЗаполнитьМетаданныеСопоставленияНоменклатурыПоУмолчанию(МетаданныеСопоставления)
	
	МетаданныеСопоставления.ВладелецНоменклатурыПредставлениеОбъекта = "Владелец";
	МетаданныеСопоставления.НоменклатураПредставлениеОбъекта = "Номенклатура";
	МетаданныеСопоставления.ХарактеристикаПредставлениеОбъекта = "Характеристика";
	МетаданныеСопоставления.УпаковкаПредставлениеОбъекта = "Ед. изм.";
	
КонецПроцедуры

Процедура ОпределитьСвойстваНоменклатурыИнформационнойБазыПоУмолчанию(СвойстваНоменклатурыИБ, НаборНоменклатуры)
	
	Для Каждого Ссылка Из НаборНоменклатуры Цикл
		
		Свойства = НовыеСвойстваНоменклатурыИБ();
		СвойстваНоменклатурыИБ.Вставить(Ссылка, Свойства);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType) Экспорт
	
	Если DocumentType = "NonformalizedProforma" Тогда
		Возврат "ИдентификаторДокументаВДиадокСч";
	ИначеЕсли DocumentType = "Invoice" И ОсновнойМодуль.ФормироватьСфНаОснованииРТУ() Тогда
		Возврат "ИдентификаторДокументаВДиадокСФ";
	Иначе
		Возврат "ИдентификаторДокументаВДиадок";
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType) Экспорт
	
	Если DocumentType = "NonformalizedProforma" Тогда
		Возврат "ИдентификаторЯщикДокументаВДиадокСч"
	ИначеЕсли DocumentType = "Invoice" И ОсновнойМодуль.ФормироватьСфНаОснованииРТУ() Тогда
		Возврат "ИдентификаторЯщикДокументаВДиадокСФ"
	Иначе	
		Возврат "ИдентификаторЯщикДокументаВДиадок"
	КонецЕсли;	
	
КонецФункции 

Функция ПолучитьНомерНаПечатьДиадок(ДокументСсылка) Экспорт
	
	Результат = Неопределено;
	
	Если Метаданные.ОбщиеМодули.ОбщегоНазначения.Глобальный Тогда
		// Поддержка БП 1.5 для 8.1
		Результат = Вычислить("ПолучитьНомерНаПечать(ДокументСсылка)");
	Иначе
		Результат = Вычислить("ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСсылка)");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает XML представление ставки НДС для записи в контент электронных документов.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - ставка НДС, представление которой нужно получить;
//  ИспользоватьРасчетныеСтавки     - Булево - Ложь, если наименование расчетных ставок,
//                                             таких как "20/120", использовать запрещено (необязательный);
// 
// Возвращаемое значение:
//   - Строка - Наименование ставки НДС или "##", если наименование определить не удалось.
//
Функция ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, ИспользоватьРасчетныеСтавки = Истина) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		
		НаименованияСтавок = Новый Соответствие;
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС0		, "0");
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС10	, "10");
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС18	, "18");
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС20	, "20");
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.БезНДС	, "без НДС");
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС5") Тогда
			НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС7") Тогда
			НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС22") Тогда
			НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
		КонецЕсли;
		
		Если ИспользоватьРасчетныеСтавки Тогда
			
			НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
			НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
			
			Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС20_120") Тогда
				НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
			КонецЕсли;
			
			Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС5_105") Тогда
				НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
			КонецЕсли;
			
			Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС7_107") Тогда
				НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
			КонецЕсли;
			
			Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС22_122") Тогда
				НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = НаименованияСтавок.Получить(СтавкаНДС);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			
			// Представление ставки НДС получить не удалось,
			// поэтому возвращаем признак ошибки через зарезервированную строку "##".
			// Такую строку умеет обрабатывать валидация контента.
			Результат = "##";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактуранаАванс(СчетФактура) Экспорт
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураВыданный")
		И СуществуетОбъектМетаданных("Перечисление.ВидСчетаФактурыВыставленного")
		И СуществуетОбъектМетаданных("Документ.СчетФактураВыданный.Реквизит.ВидСчетаФактуры") Тогда
		
		ВидСчетаФактуры = СчетФактура.ВидСчетаФактуры;
		
		Возврат
		
		ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ (СуществуетОбъектМетаданных("Перечисление.ВидСчетаФактурыВыставленного.ЗначениеПеречисления.НаАвансКомитента")
			  И ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
		
			 
	КонецЕсли;
				
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьНаименованиеКолонкиКодаТовара() Экспорт
	
	КолонкаКодаТовара = "Код";
	
	Попытка
		Если Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить() = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			КолонкаКодаТовара = "Артикул";
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат КолонкаКодаТовара;
	
КонецФункции

Функция ДиадокПолучитьПараметрыУчетнойПолитики(ДокСсылка) 
	
	Результат = Неопределено;
	
	Дата		 = ДокСсылка.Дата;
	Организация	 = ДокСсылка.Организация;
	
	Если Метаданные.ОбщиеМодули.ОбщегоНазначения.Глобальный Тогда
		// Поддержка БП 1.5 для 8.1
		Результат = Вычислить("ПолучитьПараметрыУчетнойПолитики(Дата, Неопределено, Организация)");
	Иначе
		Результат = Вычислить("ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Неопределено, Организация)");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуНомерДокументовОплаты(СчетФактура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ДатаНомерДокументовОплаты КАК СчетФактураВыданныйДатаНомерДокументовОплаты
	|ГДЕ
	|	СчетФактураВыданныйДатаНомерДокументовОплаты.Ссылка = &Ссылка
	|	И СчетФактураВыданныйДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента <> """"
	|	И СчетФактураВыданныйДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("Ссылка", СчетФактура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьНомераДляСФ(СсылкаНаОбъект) Экспорт 
	
	ДанныеДляПечати = Новый Структура;
	
	Если СсылкаНаОбъект.Метаданные().Реквизиты.Найти("Исправление") <> Неопределено И СсылкаНаОбъект.Исправление Тогда
		
		ДанныеДляПечати.Вставить("НомерДокумента"	, ?(ЗначениеЗаполнено(СсылкаНаОбъект.НомерИсходногоДокумента), СсылкаНаОбъект.НомерИсходногоДокумента, СсылкаНаОбъект.НомерИсправляемогоКорректировочногоДокумента));
		ДанныеДляПечати.Вставить("ДатаДокумента"	, ?(ЗначениеЗаполнено(СсылкаНаОбъект.ДатаИсходногоДокумента), СсылкаНаОбъект.ДатаИсходногоДокумента, СсылкаНаОбъект.ДатаИсправляемогоКорректировочногоДокумента));
		ДанныеДляПечати.Вставить("ЭтоИСФ"			, Истина);
		ДанныеДляПечати.Вставить("НомерИсправления"	, Строка(СсылкаНаОбъект.НомерИсправления));
		ДанныеДляПечати.Вставить("ДатаИсправления"	, СсылкаНаОбъект.Дата);
		
	Иначе 
		
		ДанныеДляПечати.Вставить("НомерДокумента"	, ПолучитьНомерНаПечатьДиадок(СсылкаНаОбъект));
		ДанныеДляПечати.Вставить("ДатаДокумента" 	, СсылкаНаОбъект.Дата);
		ДанныеДляПечати.Вставить("ЭтоИСФ"			, Ложь);
		
	КонецЕсли;	
	
	Возврат ДанныеДляПечати;
	
КонецФункции	

Функция ПолучитьНомераДляКСФ(ДокСсылка) Экспорт 
	
	ДанныеДляПечати = Новый Структура;
	Если (ДокСсылка.Метаданные().Реквизиты.Найти("Исправление")<>Неопределено) И (ДокСсылка.Исправление) Тогда 
		//это ксф с исправлением
		ДанныеДляПечати.вставить("НомерКСФ", ДокСсылка.НомерИсправляемогоКорректировочногоДокумента);
		ДанныеДляПечати.вставить("ДатаКСФ",  ДокСсылка.ДатаИсправляемогоКорректировочногоДокумента);
		ДанныеДляПечати.вставить("ЭтоИКСФ", Истина);
		
		ДанныеДляПечати.вставить("НомерИКСФ", формат(ДокСсылка.НомерИсправления, "ЧДЦ=0; ЧГ=0"));
		ДанныеДляПечати.вставить("ДатаИКСФ",  ДокСсылка.Дата);
	Иначе 
		//это ксф без исправлений
		ДанныеДляПечати.вставить("НомерКСФ", ОсновнойМодуль.Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ДокСсылка));
		ДанныеДляПечати.вставить("ДатаКСФ",  ДокСсылка.Дата);
		ДанныеДляПечати.вставить("ЭтоИКСФ", Ложь);
	КонецЕсли;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ИсправляемыйДокументРеализации = ОсновнойМодуль.Модуль_Интеграция.ПолучитьИсправляемыйДокументРеализации(ДокСсылка);
		ДатаИсходногоДокумента 	= ИсправляемыйДокументРеализации.Дата;
		НомерИсходногоДокумента = ОсновнойМодуль.Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ИсправляемыйДокументРеализации);
		УчитыватьИсправлениеИсходногоДокумента 	= Ложь;
		НомерИсправленияИсходногоДокумента 		=  "";
		ДатаИсправленияИсходногоДокумента 		= Дата(1, 1, 1);
	Иначе
		ПерваяСтрокаТЧ = ДокСсылка.ДокументыОснования[0];
		ДатаИсходногоДокумента = ПерваяСтрокаТЧ.ДатаИсходногоДокумента;
		НомерИсходногоДокумента = ПерваяСтрокаТЧ.НомерИсходногоДокумента;
		ДатаИсправленияИсходногоДокумента = ПерваяСтрокаТЧ.ДатаИсправленияИсходногоДокумента;
		НомерИсправленияИсходногоДокумента = ПерваяСтрокаТЧ.НомерИсправленияИсходногоДокумента;
		УчитыватьИсправлениеИсходногоДокумента = ПерваяСтрокаТЧ.УчитыватьИсправлениеИсходногоДокумента;
	КонецЕсли;
	
	ДанныеДляПечати.вставить("ДатаИсходногоДокумента",				  	ДатаИсходногоДокумента);
	ДанныеДляПечати.вставить("НомерИсходногоДокумента", 				НомерИсходногоДокумента);
	ДанныеДляПечати.вставить("УчитыватьИсправлениеИсходногоДокумента",  УчитыватьИсправлениеИсходногоДокумента);
	ДанныеДляПечати.вставить("НомерИсправленияИсходногоДокумента",  	НомерИсправленияИсходногоДокумента);
	ДанныеДляПечати.вставить("ДатаИсправленияИсходногоДокумента",  		ДатаИсправленияИсходногоДокумента);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ПолучитьКПППокупателя(СсылкаНаОбъект) Экспорт 
	
	Если НЕ СсылкаНаОбъект.Метаданные().Реквизиты.Найти("КППКонтрагента") = Неопределено Тогда
		Если ЗначениеЗаполнено(СсылкаНаОбъект.КППКонтрагента) Тогда
			Возврат СсылкаНаОбъект.КППКонтрагента
		КонецЕсли
	КонецЕсли;	
	
	Возврат ""
КонецФункции	

Функция ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокументРеализации, СчетФактура = Неопределено, ЭтоСФ = Ложь, ЭтоАкт = Ложь) Экспорт 
	
	Результат = Ложь;
	
	Если НЕ ЭтоСчетФактуранаАванс(СчетФактура)                                               // Счета-фактуры на аванс заполняются в рублях, их пересчитывать не надо.
		И ДокументРеализации.ВалютаДокумента <> ПолучитьВалютуРегламентированногоУчета()     // Документ в иностранной валюте.
		И ДиадокПолучитьПараметрыУчетнойПолитики(ДокументРеализации) <> Неопределено Тогда   // Есть учетная политика на дату документа.
		
		Если ДокументРеализации.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах Тогда

			
			Результат = Истина; // Документ в у.е. всегда пересчитываем в рубли.
			
		Иначе
			
			Результат = НЕ ЭтоСФ И НЕ ЭтоАкт; // Валютный Счет-фактуру и валютный Акт в рубли пересчитывать не нужно.
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

Функция ПолучитьВалютуРегламентированногоУчета() Экспорт
	
	Результат = ОсновнойМодуль.ЭДО_Кэш_Прочитать("ВалютаРегламентированногоУчета");
	
	Если Результат = Неопределено Тогда
		
		Попытка
			Результат = Вычислить("глЗначениеПеременной(""ВалютаРегламентированногоУчета"")");
		Исключение
			Результат = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецПопытки;
		
		ОсновнойМодуль.ЭДО_Кэш_Поместить("ВалютаРегламентированногоУчета", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВалютуДокумента(ВалютаДокумента, СчетФактура) Экспорт 
	
	Валюта = ВалютаДокумента; 
	РасчетыВУЕ = Ложь;
	ВалютаРегламентированногоУчета=	Константы.ВалютаРегламентированногоУчета.Получить();
	УчетнаяПолитика=				ДиадокПолучитьПараметрыУчетнойПолитики(СчетФактура);
	Если НЕ УчетнаяПолитика = Неопределено 
		И СчетФактура.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = Истина И
		ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
		РасчетыВУЕ = Истина;
	КонецЕсли;
	
	Если РасчетыВУЕ = Истина ИЛИ ЭтоСчетФактуранаАванс(СчетФактура) Тогда
		Валюта = ВалютаРегламентированногоУчета;
	КонецЕсли;		
	
	Возврат Валюта; 
	
КонецФункции 

Функция ПолучитьСтруктуруОснования(ДокСсылка, ЭтоАкт = Ложь, ЭтоУПД = Ложь)  Экспорт 
	
	Перем Сделка;
	
	ДоговорКонтрагента = ДокСсылка.ДоговорКонтрагента;
	
	Если ЭтоАкт = Ложь
		И ЗначениеЗаполнено(ДоговорКонтрагента)
		И ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
		И ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(ДокСсылка, "Сделка", Сделка)
		И ЗначениеЗаполнено(Сделка)
		И ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Результат = ПолучитьСтруктуруОснованияПоЗаказу(Сделка);
		
	Иначе
		
		Результат = ПолучитьСтруктуруОснованияПоДоговору(ДоговорКонтрагента, ЭтоУПД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьСтруктуруОснованияПоДоговору(Договор, ЭтоУПД)  Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("GroundName");
	Результат.Вставить("GroundNumber");
	Результат.Вставить("GroundDate");
	Результат.Вставить("Основание");
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		Результат.GroundName   = ?(ЭтоУПД, "Договор", Договор.Наименование);
		Результат.GroundNumber = Договор.Номер;
		Результат.GroundDate   = Договор.Дата;
		Результат.Основание	   = Договор;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьСтруктуруОснованияПоЗаказу(Заказ)  Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("GroundName");
	Результат.Вставить("GroundNumber");
	Результат.Вставить("GroundDate");
	Результат.Вставить("Основание");
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		
		Результат.GroundName   = Заказ.Метаданные().Представление();
		Результат.GroundNumber = ПолучитьМодульПрог("Модуль_Интеграция").ПолучитьНомерНаПечатьДиадок(Заказ);
		Результат.GroundDate   = Заказ.Дата;
		Результат.Основание	   = Заказ;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	



Функция ПолучитьПредставлениеХарактеристикиИСерии(Выборка) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
		Результат = "(" + стрЗаменить(выборка.Характеристика, "<>", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Серия) Тогда
		Результат = ?(стрДлина(результат) = 0, " (", Результат+"; ") + стрЗаменить(выборка.серия, "<>", "");
	КонецЕсли;
	
	Возврат ?(Результат = "", "", Результат + ")");
	
КонецФункции

Функция ПолучитьНомерГТД(НомерГТД) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(НомерГТД) Тогда
		
		Если ТипЗнч(НомерГТД) = Тип("Строка") Тогда
			
			Результат = НомерГТД;
			
		ИначеЕсли НЕ ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(НомерГТД, "РегистрационныйНомер", Результат) Тогда
			
			Результат = НомерГТД.Код;
			
		КонецЕсли; 
		
		Результат = СокрЛП(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуНомерГТД(НомерГТД, СоздатьНовый = Ложь) Экспорт
	
	Результат = Неопределено;
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка КАК Ссылка ИЗ Справочник.НомераГТД ГДЕ Код = &НомерГТД";
	
	Если СуществуетОбъектМетаданных("Справочник.НомераГТД.Реквизит.РегистрационныйНомер") Тогда
		ТекстЗапроса = ТекстЗапроса + РазделительОбъединенияЗапросов() + "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.НомераГТД ГДЕ РегистрационныйНомер = &НомерГТД";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НомерГТД", НомерГТД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		НовыйЭлемент = Справочники.НомераГТД.СоздатьЭлемент();
		
		НовыйЭлемент.Код = НомерГТД;
		
		Если СуществуетОбъектМетаданных("Справочник.НомераГТД.Реквизит.РегистрационныйНомер") Тогда
			
			РеквизитыДляЗаполнения = Новый Структура;
			РеквизитыДляЗаполнения.Вставить("РегистрационныйНомер", НомерГТД);
			
			Попытка
				ЗначенияРеквизитов = Справочники.НомераГТД.РегистрационныйНомерИСтранаВвоза(НомерГТД);
			Исключение 
				ЗначенияРеквизитов = РеквизитыДляЗаполнения;
			КонецПопытки;    
			
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЗначенияРеквизитов);
			
		КонецЕсли;
		
		НовыйЭлемент.Записать();
		
		Результат = НовыйЭлемент.Ссылка;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуСерииНоменклатуры(Номенклатура, НомерГТД, СтранаПроисхождения = "", СоздатьНовый = Ложь) Экспорт
	
	Результат = Неопределено;
	
	ВестиУчетПоСериям = Ложь;
	
	Если	НЕ ЗначениеЗаполнено(Номенклатура)
		ИЛИ НЕ ЗначениеЗаполнено(НомерГТД)
		ИЛИ НЕ ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(Номенклатура, "ВестиУчетПоСериям", ВестиУчетПоСериям)
		ИЛИ НЕ ВестиУчетПоСериям Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	СсылкаНомерГТД = ОсновнойМодуль.Модуль_Интеграция.ПолучитьСсылкуНомерГТД(НомерГТД);
		
	// Ищем существующий элемент в справочнике серий.
	Если ЗначениеЗаполнено(СсылкаНомерГТД) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			| 	СерииНоменклатуры.Ссылка
			| ИЗ
			| 	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			| ГДЕ
			| 	СерииНоменклатуры.Владелец = &Владелец
			| 	И СерииНоменклатуры.НомерГТД = &НомерГТД
			| 	И &ТекстОтбораПоСтранеПроисхождения
			| 	И НЕ СерииНоменклатуры.ПометкаУдаления";
		
		Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
			ПодстрокаЗамены = "СерииНоменклатуры.СтранаПроисхождения = &СтранаПроисхождения";
			СсылкаСтранаПроисхождения = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СтранаПроисхождения);
			Если Не ЗначениеЗаполнено(СсылкаСтранаПроисхождения) Тогда
				СсылкаСтранаПроисхождения = Справочники.КлассификаторСтранМира.ПустаяСсылка();
			КонецЕсли;
		Иначе
			// для совместимости с необязательностью параметра "СтранаПроисхождения"
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоСтранеПроисхождения", ПодстрокаЗамены);
		
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Запрос.УстановитьПараметр("НомерГТД", СсылкаНомерГТД);
		Запрос.УстановитьПараметр("СтранаПроисхождения", СсылкаСтранаПроисхождения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Результат = Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Создаем новый элемент в справочнике серий.
	Если НЕ ЗначениеЗаполнено(Результат) И СоздатьНовый = Истина Тогда
		
		СсылкаСтранаПроисхождения = НайтиСоздатьСтрануПроисхождения(СтранаПроисхождения);
		
		Если ЗначениеЗаполнено(СсылкаСтранаПроисхождения) Тогда
			
			// Создаем новый элемент в справочнике НомераГТД
			Если НЕ ЗначениеЗаполнено(СсылкаНомерГТД) Тогда
				СсылкаНомерГТД = ОсновнойМодуль.Модуль_Интеграция.ПолучитьСсылкуНомерГТД(НомерГТД, Истина);
			КонецЕсли;
			
			НовыйЭлемент = Справочники.СерииНоменклатуры.СоздатьЭлемент();
			
			НовыйЭлемент.Владелец 	  = Номенклатура;
			НовыйЭлемент.НомерГТД	  = СсылкаНомерГТД;
			НовыйЭлемент.Наименование = Строка(СсылкаНомерГТД) + ", " + Строка(СсылкаСтранаПроисхождения); 
			НовыйЭлемент.СтранаПроисхождения = СсылкаСтранаПроисхождения;
			
			НовыйЭлемент.Записать();
			
			Результат = НовыйЭлемент.Ссылка;
			
		Иначе
			
			Сообщить("Не удалось создать серию """ + НомерГТД + """ для номенклатуры """ + Номенклатура + """
			|По причине: В классификаторе стран мира не найдена страна с наименованием """ + СтранаПроисхождения + ""); 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция НайтиСоздатьСтрануПроисхождения(СтранаПроисхождения)
	
	СсылкаСтранаПроисхождения = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СтранаПроисхождения);
	
	Если НЕ ЗначениеЗаполнено(СсылкаСтранаПроисхождения) Тогда
		
		ПодходящиеСтраны = ПолучитьМодульПрог("ГенерацияXML").ПодходящиеСтраны(СтранаПроисхождения);
		
		Если ЗначениеЗаполнено(ПодходящиеСтраны) Тогда
			ПодходящаяСтрана = ДанныезаполненияСтраны(ПодходящиеСтраны[0]);
			
			СсылкаСтранаПроисхождения = Справочники.КлассификаторСтранМира.НайтиПокоду(ПодходящаяСтрана.Код);
			
			Если НЕ ЗначениеЗаполнено(СсылкаСтранаПроисхождения) Тогда
				НовыйЭлемент = Справочники.КлассификаторСтранМира.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, ПодходящаяСтрана);
				НовыйЭлемент.Записать();
				СсылкаСтранаПроисхождения = НовыйЭлемент.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	Возврат СсылкаСтранаПроисхождения;
КонецФункции

Функция ДанныеЗаполненияСтраны(ОписаниеСтраны)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Наименование"		, "");
	СтруктураВозврата.Вставить("НаименованиеКраткое", "");
	СтруктураВозврата.Вставить("НаименованиеПолное"	, "");
	СтруктураВозврата.Вставить("КодАльфа2"			, "");
	СтруктураВозврата.Вставить("КодАльфа3"			, "");  
	СтруктураВозврата.Вставить("Код"				, "");
	СтруктураВозврата.Вставить("Неактуальный"		, "");
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ОписаниеСтраны);
	
	Если НЕ ЗначениеЗаполнено(СтруктураВозврата.Наименование) Тогда
		СтруктураВозврата.Наименование = СтруктураВозврата.НаименованиеКраткое;
	КонецЕсли;         
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, СписокВидовДоговоров) Экспорт
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.ОсновнойДоговорКонтрагента КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Контрагенты.ОсновнойДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|			И (ДоговорыКонтрагентов.Организация = &Организация)
	|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|			И (ДоговорыКонтрагентов.ВидДоговора В (&СписокДоговоров))
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокВидовДоговоров);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка
	КонецЕсли;
		
КонецФункции

Функция Документ_Организация(Документ) Экспорт

	Возврат Документ.Организация;

КонецФункции

Функция Организация_КПП(Организация) Экспорт
	
	Возврат Организация.КПП;
	
КонецФункции

Функция ПолучитьДатуНомерВходящейНакладной(ДокСсылка) Экспорт 
	
	Результат= Новый Структура("ДатаВходящегоДокумента, НомерВходящегоДокумента");
	
	МетаданныеДокумента= ДокСсылка.Метаданные();
	
	Если  МетаданныеДокумента.Реквизиты.Найти("ДатаВходящегоДокумента")  <> Неопределено 
		И МетаданныеДокумента.Реквизиты.Найти("НомерВходящегоДокумента") <> Неопределено Тогда 
		
		Результат.ДатаВходящегоДокумента=  ДокСсылка.ДатаВходящегоДокумента;
		Результат.НомерВходящегоДокумента= ДокСсылка.НомерВходящегоДокумента;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуНомерВходящегоСчетаФактуры(ДокСсылка) Экспорт 
	
	Возврат ПолучитьДатуНомерВходящейНакладной(ДокСсылка);
	
КонецФункции

Процедура УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
		
	МетаданныеДокумента = ДокСсылка.Метаданные();
					
	Если  ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеДокумента, "ДатаВходящегоДокумента")
		И ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеДокумента, "НомерВходящегоДокумента")		
		И (ДокСсылка.ДатаВходящегоДокумента <> ДатаВходящегоДокумента
			ИЛИ ДокСсылка.НомерВходящегоДокумента <> НомерВходящегоДокумента) Тогда
		
		Объект = ДокСсылка.ПолучитьОбъект();
		Объект.ДатаВходящегоДокумента	= ДатаВходящегоДокумента;
		Объект.НомерВходящегоДокумента	= НомерВходящегоДокумента;
		
		Попытка
			Объект.Записать();
			Сообщить("Изменены следующие реквизиты: "+ СписокОтличающихсяРеквизитов + " 
			|у документа: " + ДокСсылка);
		Исключение
			Сообщить("Не удалось изменить следующие реквизиты: " + СписокОтличающихсяРеквизитов + "
			|у документа: " + ДокСсылка);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатуНомерВходящегоСчетаФактуры(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры

Функция ИменаРеквизитов_КодСпособаПолучения(ДокСсылка) Экспорт
	
	Результат = "";
	
	МетаданныеДокумента = ДокСсылка.Метаданные();
	
	Если ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеДокумента, "КодСпособаПолучения") Тогда
		
		Результат = "КодСпособаПолучения";
		
	КонецЕсли;
			
	//Переопределяем имена реквизитов непосредственно в интеграционном модуле
	ОсновнойМодуль.Модуль_Интеграция.ПереопределитьИменаРеквизитов_КодСпособаПолучения(Результат, ДокСсылка);	
	
	Возврат Результат;
	
КонецФункции

//Возвращает имена реквизитов "НомерВходящегоДокумента" и "ДатаВходящегоДокумента"
//так как они заданны в текущей конфигурации
//
//Параметры:
// ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
//
//Возвращаемое значение:
//	Структура	- с ключами "НомерВходящегоДокумента" и "ДатаВходящегоДокумента". Значением ключей
//				  является имена реквизитов в конфигурации
Функция ИменаРеквизитов_НомерИДатаВходящегоДокумента(ДокСсылка) Экспорт
	
	Результат = Новый Структура("НомерВходящегоДокумента, ДатаВходящегоДокумента");
	
	МетаданныеДокумента = ДокСсылка.Метаданные();
	
	Если ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеДокумента, "НомерВходящегоДокумента") Тогда
		
		Результат.Вставить("НомерВходящегоДокумента", "НомерВходящегоДокумента"); 
		
	КонецЕсли;
	
	Если ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеДокумента, "ДатаВходящегоДокумента") Тогда
		
		Результат.Вставить("ДатаВходящегоДокумента", "ДатаВходящегоДокумента"); 
		
	КонецЕсли;
	
	//Переопределяем имена реквизитов непосредственно в интеграционном модуле
	ОсновнойМодуль.Модуль_Интеграция.ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента(Результат, ДокСсылка);	
							
	Возврат Результат;
	
КонецФункции //ИменаРеквизитов_НомерИДатаВходящегоДокумента()

//Возвращает именя реквизита "Склад" у документа поступления
//так как оно заданно в текущей конфигурации
//
//Возвращаемое значение:
//	Строка
Функция ИменаРеквизитов_Склад() Экспорт
	
	Результат = "СкладОрдер";
	
	Возврат Результат;
	
КонецФункции //ИменаРеквизитов_Склад()

Функция ДокументБезНДС(СсылкаНаОбъект) Экспорт
	
	МетаданныеДокумента= СсылкаНаОбъект.Метаданные();
	
	Возврат
	
		( МетаданныеДокумента.ТабличныеЧасти.Найти("Товары") 					   <> Неопределено
		 И МетаданныеДокумента.ТабличныеЧасти.Товары.Реквизиты.Найти("СтавкаНДС")  <> Неопределено
		 И СсылкаНаОбъект.Товары.Найти(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС") <> Неопределено)
	ИЛИ 
		(  МетаданныеДокумента.ТабличныеЧасти.Найти("Услуги") 					   <> Неопределено
		 И МетаданныеДокумента.ТабличныеЧасти.Услуги.Реквизиты.Найти("СтавкаНДС")  <> Неопределено
		 И СсылкаНаОбъект.Услуги.Найти(Перечисления.СтавкиНДС.БезНДС, "СтавкаНДС") <> Неопределено)
	
КонецФункции

Функция ПустаяСсылкаНаНомерГТД() Экспорт
	
	Возврат Справочники.НомераГТД.ПустаяСсылка();
	
КонецФункции

Функция СократитьПредставлениеТелефона(телефонСтрока) Экспорт 
	
	Если (СтрДлина(телефонСтрока) <= 20) Или (Найти(ТелефонСтрока, ";") = 0) Тогда
		//резать нечего
		Возврат ТелефонСтрока
	КонецЕсли;
	
	НовыйТелефон = "";
	СтарыйТелефон = ТелефонСтрока;
	Пока Найти(СтарыйТелефон, ";") > 0 Цикл
		Если (НовыйТелефон = "") Или (СтрДлина(НовыйТелефон) + Найти(СтарыйТелефон, ";") <= 20) Тогда
			//добавим кусок
			НовыйТелефон = ?(НовыйТелефон = "", "",  НовыйТелефон + ";") + Лев(СтарыйТелефон, Найти(СтарыйТелефон, ";") - 1);
			СтарыйТелефон = Прав(СтарыйТелефон, СтрДлина(СтарыйТелефон) - Найти(СтарыйТелефон, ";"));
		Иначе 
			СтарыйТелефон = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйТелефон;
	
КонецФункции

Функция ПредставлениеТелефона(Знач Телефоны, ТипТелефона, Знач МаксимальнаяДлинаСтроки, Разделитель= ";") Экспорт
	
	ПозицияНачалаФакса= Найти(Телефоны, "факс:");
	
	Если ПозицияНачалаФакса > 0 Тогда
		
		Если ТипТелефона= "Телефон" Тогда
			Телефоны= Лев(Телефоны, ПозицияНачалаФакса - 1);
		ИначеЕсли ТипТелефона= "Факс" Тогда
			Телефоны= Сред(Телефоны, ПозицияНачалаФакса + 5);
		КонецЕсли;
		
	КонецЕсли;
	
	МассивПодстрок= ПреобразоватьСтрокуВМассивПодстрок(Телефоны, Разделитель, Истина, Истина);
	
	Результат=	  "";
	Разделитель1= "";
	
	Для Каждого Подстрока Из МассивПодстрок Цикл
		
		МаксимальнаяДлинаСтроки= МаксимальнаяДлинаСтроки - СтрДлина(Подстрока);
		
		Если МаксимальнаяДлинаСтроки < 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат= Результат + Разделитель1 + Подстрока;
		
		Разделитель1= Разделитель;
		
		Если МаксимальнаяДлинаСтроки = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьСтрокуВМассивПодстрок(Знач Строка, Разделитель= ",", ПропускатьПустыеСтроки= Ложь, ПрименятьСокрЛП= Ложь)Экспорт
	
	МассивПодстрок= Новый Массив;
	
	ДлинаРазделителя= СтрДлина(Разделитель);
	
	ПозицияРазделителя= Найти(Строка, Разделитель);
	
	Пока ПозицияРазделителя > 0 Цикл
		
		Подстрока= Лев(Строка, ПозицияРазделителя - 1);
		
		Если НЕ ПропускатьПустыеСтроки ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			МассивПодстрок.Добавить(?(ПрименятьСокрЛП, СокрЛП(Подстрока), Подстрока));
		КонецЕсли;
		
		Строка= Сред(Строка, ПозицияРазделителя + ДлинаРазделителя);
		
		ПозицияРазделителя= Найти(Строка, Разделитель);
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Строка) Тогда
		МассивПодстрок.Добавить(?(ПрименятьСокрЛП, СокрЛП(Строка), Строка));
	КонецЕсли;
	
	Возврат МассивПодстрок;
	
КонецФункции 

Функция Значение1C_В_СтрокаCOM(Значение1С, ФорматнаяСтрока= "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение1С) Тогда
		Возврат "";
	ИначеЕсли НЕ ПустаяСтрока(ФорматнаяСтрока) Тогда
		Возврат Формат(Значение1С, ФорматнаяСтрока);
	Иначе
		Возврат СокрЛП(Значение1С);
	КонецЕсли;
	
КонецФункции

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита, ЗначениеРеквизита = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Попытка
		Объект_ЗначениеРеквизита = Объект[ИмяРеквизита];
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	Если НЕ Отказ Тогда
		ЗначениеРеквизита = Объект_ЗначениеРеквизита;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

Функция СуществуетОбъектМетаданных(ПолноеИмяОбъекта) Экспорт
	
	КэшСуществуетОбъектМетаданных = ОсновнойМодуль.ЭДО_Кэш_Прочитать("КэшСуществуетОбъектМетаданных");
	
	Если КэшСуществуетОбъектМетаданных = Неопределено Тогда
		КэшСуществуетОбъектМетаданных = Новый Соответствие;
		ОсновнойМодуль.ЭДО_Кэш_Поместить("КэшСуществуетОбъектМетаданных", КэшСуществуетОбъектМетаданных);
	КонецЕсли;
	
	Результат = КэшСуществуетОбъектМетаданных[ПолноеИмяОбъекта];
	
	Если Результат = Неопределено Тогда
		Результат = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта) <> Неопределено;
		КэшСуществуетОбъектМетаданных.Вставить(ПолноеИмяОбъекта, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет существование реквизита метаданных.
//
// Параметры:
//  ОбъектМетаданных				 - ОбъектМетаданных	 - метаданные произвольного объекта.
//  ИмяРеквизита					 - Строка			 - имя проверяемого реквизита.
//  ПроверятьСтандартныеРеквизиты	 - Булево			 - Истина, если при проверке следует учитывать стандартные реквизиты (Код, Наименование и т.д.)
// 
// Возвращаемое значение:
//  Булево - Истина, если реквизит с заданным именем существует.
//
Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь) Экспорт
	
	Если ОбъектМетаданных = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьРеквизит = ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
	
	Если Не ЕстьРеквизит И ПроверятьСтандартныеРеквизиты Тогда 
		
		КоллекцияРеквизитов = ОбъектМетаданных.СтандартныеРеквизиты;
		
		Для Каждого СтандартныйРеквизит Из КоллекцияРеквизитов Цикл 
			
			Если ВРег(СтандартныйРеквизит.Имя) = ВРег(ИмяРеквизита) Тогда 
				ЕстьРеквизит = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЕстьРеквизит;
	
КонецФункции

Функция ПредопределенныйЭлемент(Менеджер, ИмяПредопределенногоЭлемента) Экспорт
	
	Попытка 
		Возврат Менеджер[ИмяПредопределенногоЭлемента];
	Исключение КонецПопытки;
	
КонецФункции

Функция РазделительОбъединенияЗапросов(БезДубликатов= Ложь) Экспорт
	
	Возврат "		
	|
	|ОБЪЕДИНИТЬ " + ?(БезДубликатов, "", "ВСЕ") + "
	|
	|"
	
КонецФункции

//фукнция для получения результата запроса из одной записи и одного поля
Функция ПолучитьРезультатЗапроса(Запрос, ИмяПоля = "Ссылка", ПустоеЗначение = Неопределено) Экспорт 
	
	Результат = ПустоеЗначение;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка[ИмяПоля];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон содержащий маркеры подстановки вида: "%1..%N"
//                        . Нумерация маркеров начинается с 1.
//                          N не может быть более 5.
//  Параметр<n>  - Строка - подставляемые параметры.
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
Функция ПодставитьПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено) Экспорт
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтавкуНДСДиадок(Знач TaxRate) Экспорт
	
	КэшСтавкиНДС = ОсновнойМодуль.ЭДО_Кэш_Прочитать("КэшСтавкиНДС");
	
	Если КэшСтавкиНДС = Неопределено Тогда
		
		КэшСтавкиНДС = Новый Соответствие;
		
		ОсновнойМодуль.ЭДО_Кэш_Поместить("СтавкаНДСДиадок", КэшСтавкиНДС);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(TaxRate) Тогда
		TaxRate = "нет значения";
	КонецЕсли;
	
	TaxRate = НРег(СтрЗаменить(СтрЗаменить(TaxRate, " ", ""), "%", ""));
	
	Результат = КэшСтавкиНДС[TaxRate];
	
	Если Результат = Неопределено Тогда
		
		СтавкиНДСДиадок = Новый Соответствие;
		СтавкиНДСДиадок.Вставить("0", Перечисления.СтавкиНДС.НДС0);
		СтавкиНДСДиадок.Вставить("10", Перечисления.СтавкиНДС.НДС10);
		СтавкиНДСДиадок.Вставить("18", Перечисления.СтавкиНДС.НДС18);
		СтавкиНДСДиадок.Вставить("20", Перечисления.СтавкиНДС.НДС20);
		СтавкиНДСДиадок.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
		СтавкиНДСДиадок.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
		СтавкиНДСДиадок.Вставить("безндс", Перечисления.СтавкиНДС.БезНДС);
		СтавкиНДСДиадок.Вставить("исчналаг", "НДС исчисляется налоговым агентом");
		СтавкиНДСДиадок.Вставить("нетзначения", Перечисления.СтавкиНДС.БезНДС);
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС5") Тогда
			СтавкиНДСДиадок.Вставить("5", Перечисления.СтавкиНДС.НДС5);
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС7") Тогда
			СтавкиНДСДиадок.Вставить("7", Перечисления.СтавкиНДС.НДС7);
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС22") Тогда
			СтавкиНДСДиадок.Вставить("22", Перечисления.СтавкиНДС.НДС22);
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС20_120") Тогда
			СтавкиНДСДиадок.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС5_105") Тогда
			СтавкиНДСДиадок.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС7_107") Тогда
			СтавкиНДСДиадок.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных("Перечисление.СтавкиНДС.ЗначениеПеречисления.НДС22_122") Тогда
			СтавкиНДСДиадок.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
		КонецЕсли;
		
		Результат = СтавкиНДСДиадок.Получить(TaxRate);
		
		КэшСтавкиНДС.Вставить(TaxRate, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение - Строка - проверяемая строка.
//
// Возвращаемое значение:
//  Булево - Истина, если строка содержит только цифры или пустая.
//
Функция ТолькоЦифрыВСтроке(Значение) Экспорт
	
	Результат	 = Истина;
	ДлинаСтроки	 = СтрДлина(Значение);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Значение, НомерСимвола);
		
		Если КодСимвола < 48 Или КодСимвола > 57 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//  ОбщийМодуль - общий модуль.
Функция ОбщийМодульПоИмени(ИмяМодуля)
	
	Результат = Неопределено;
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено Тогда
		Результат = Вычислить(ИмяМодуля);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает код основного языка конфигурации, например "ru".
//
// Возвращаемое значение:
//  Строка - код языка.
//
Функция КодОсновногоЯзыка()
	
	Результат = "ru";
	Возврат Результат;
	
КонецФункции

// Имя события для записи в журнал регистрации.
//
Функция СобытиеЖурналаРегистрации()
	
	Результат = НСтр("ru = 'Диадок'; en = 'Diadoc'", КодОсновногоЯзыка());
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСсылкуНаОбъектПоРеквизиту(ОбъектМетаданных, ИмяРеквизита, ЗначРеквизита) Экспорт
	
	Результат = ОсновнойМодуль.НайтиСсылкуНаОбъектПоРеквизиту(ОбъектМетаданных, ИмяРеквизита, ЗначРеквизита);
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает произвольное значение в число.
//
// Параметры:
//  Значение - Произвольный - произвольное значение.
// 
// Возвращаемое значение:
//  Число - результат преобразования.
//
// Пример:
//   Цена = ПривестиКЧислу("1 000,50"); // результат 1000.5
//
Функция ПривестиКЧислу(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда // нечего преобразовывать
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда // удалим пробелы
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

//{ Маркировка

// Инициализирует структуру с коллекциями кодов маркировки.
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * ТранспортныеУпаковки - Массив - Идентификаторы транспортных упаковок (TransPackageId, ИдентТрансУпак)
//   * ИндивидуальныеУпаковки - Массив - Идентификаторы потребительских упаковок (PackageIds, НомУпак)
//   * КонтрольныеИдентификационныеЗнаки - Массив - Контрольные идентификационные знаки (Units, КИЗ)
//
Функция НовыйСведенияОМаркировке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КонтрольныеИдентификационныеЗнаки", Новый Массив);
	Результат.Вставить("ИндивидуальныеУпаковки", Новый Массив);
	Результат.Вставить("ТранспортныеУпаковки", Новый Массив);
	Результат.Вставить("КоличествоТовараВУпаковке", 0);
	Результат.Вставить("НомерПартии", "");
	
	Возврат Результат;
	
КонецФункции

// Получает коды маркировки из документа и обогащает ими контент.
//
// Параметры:
//  Контент 						- Структура 	- протоконтент электронного документа.
//  СсылкаНаОбъект 					- ЛюбаяСсылка 	- источник данных для получения контента.
//	ИспользоватьКонтурМаркировку	- Булево 		- Истина, если получать сведения о маркировке
//                                          		нужно с помощью подсистемы "Контур.Маркировка"
//
Процедура ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаОбъект, ИспользоватьКонтурМаркировку = Ложь) Экспорт
	
	Если ИспользоватьКонтурМаркировку Тогда
		
		ЗаполнитьСведенияОМаркировке_КонтурМаркировка(Контент, СсылкаНаОбъект);
		
	ИначеЕсли ИспользоватьИнтеграционныйМодульДляЗаполненияСведенийОМаркировке() Тогда
		
		ЗаполнитьСведенияОМаркировке_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект);
		
	Иначе
		
		ЗаполнитьСведенияОМаркировке_ИСМП(Контент, СсылкаНаОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

// Получает коды маркировки из документа и обогащает ими контент.
//
// Параметры:
//  Контент 						- Структура 	- протоконтент электронного документа.
//  СсылкаНаОбъект 					- ЛюбаяСсылка 	- источник данных для получения контента.
//	ИспользоватьКонтурМаркировку	- Булево 		- Истина, если получать сведения о маркировке
//                                          		нужно с помощью подсистемы "Контур.Маркировка"
//
Процедура ЗаполнитьСведенияОМаркировке736(Контент, СсылкаНаОбъект, ИспользоватьКонтурМаркировку = Ложь) Экспорт
	
	ИнтеграционныйМодуль = МодульИнтеграции();
	ИсходныйДокумент = ИнтеграционныйМодуль.КорректируемыйДокумент(СсылкаНаОбъект);
	
	Если ИспользоватьКонтурМаркировку Тогда
		
		ЗаполнитьСведенияОМаркировке736_КонтурМаркировка(Контент, СсылкаНаОбъект, ИсходныйДокумент);
		
	ИначеЕсли ИспользоватьИнтеграционныйМодульДляЗаполненияСведенийОМаркировке() Тогда
		
		ЗаполнитьСведенияОМаркировке736_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект, ИсходныйДокумент);
		
	Иначе
		
		ЗаполнитьСведенияОМаркировке736_ИСМП(Контент, СсылкаНаОбъект, ИсходныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте(Контент, РазвернутаяТаблицаУпаковок)
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		ТребуемоеКоличество = СтрокаТЧ.Quantity;
		
		// Инициализировать промежуточную структуру с коллекциями кодов маркировки
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		// Найти подходящие кодами маркировки
		ПодобратьКодыМаркировки(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
		
		// Перенести найденные коды маркировки в строку протоконтента
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.ItemIdentificationNumbers, КодыМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка(Контент, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения)
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		//CorrectedValues
		ТребуемоеКоличество = СтрокаТЧ.CorrectedValues.Quantity;
		ТребуемоеКоличество = ?(ТребуемоеКоличество = Неопределено, 0, ТребуемоеКоличество);
		ЭтоПолныйВозвратТовара	 = ЭтоПолныйВозвратТовара(СтрокаТЧ);
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) ИЛИ ЭтоПолныйВозвратТовара Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество, ЭтоПолныйВозвратТовара);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
		//OriginalValues
		ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity;
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки(КодыМаркировки, РазвернутаяТаблицаУпаковокДоИзменения, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736(Контент, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения)
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		//CorrectedValues
		ТребуемоеКоличество = СтрокаТЧ.CorrectedValues.Quantity;
		ТребуемоеКоличество = ?(ТребуемоеКоличество = Неопределено, 0, ТребуемоеКоличество);
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
		//OriginalValues
		ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity;
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки(КодыМаркировки, РазвернутаяТаблицаУпаковокДоИзменения, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Подбирает требуемое количество кодов маркировки, удовлетворяющих параметрам номенклатуры.
// В исходной таблице кодов строки с подобранными кодами отмечаются как обработанные.
//
// Параметры:
//  КодыМаркировки		 - Структура - результат подбора (см. НовыйСведенияОМаркировке)
//  ТаблицаКодов		 - ТаблицаЗначений - таблица штрихкодов упаковок (см. РазвернутаяТаблицаУпаковок)
//  СлужебнаяИнформация	 - Структура - содержит параметры номенклатуры (см. НоваяСлужебнаяИнформацияСтроки)
//  ТребуемоеКоличество	 - Число - Количество кодов, которые нужно подобрать
//
Процедура ПодобратьКодыМаркировки(КодыМаркировки
	, РазвернутаяТаблицаУпаковок
	, СлужебнаяИнформация
	, Знач ТребуемоеКоличество
	, ПодобратьКодДляПолногоВозрата = Ложь)
	
	Для Каждого СтрокаУпаковки Из РазвернутаяТаблицаУпаковок Цикл
		
		МожноПодобратьКодПоУпаковке = МожноПодобратьКодМаркировкиПоУпаковке(СтрокаУпаковки, ТребуемоеКоличество, ПодобратьКодДляПолногоВозрата);
		
		Если НЕ МожноПодобратьКодПоУпаковке Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.Номенклатура <> СлужебнаяИнформация.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьХарактеристики
			И СтрокаУпаковки.Характеристика <> СлужебнаяИнформация.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьСерии
			И СтрокаУпаковки.Серия <> СлужебнаяИнформация.Серия Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШК = СтрокаУпаковки.ЗначениеШтрихкода;
		
		ВидУпаковки = СтрокаУпаковки.ВидУпаковки;
		
		Если ВидУпаковки = УпаковкаЛогистическая() Тогда
			КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
		ИначеЕсли ВидУпаковки = УпаковкаГрупповая()
			ИЛИ ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
			КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
		Иначе
			КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
		КонецЕсли;
		
		СтрокаУпаковки.Обработан = Истина;
		ТребуемоеКоличество = ТребуемоеКоличество - 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция МожноПодобратьКодМаркировкиПоУпаковке(СтрокаУпаковки, ТребуемоеКоличество, ПодобратьКодДляПолногоВозрата)
	
	Результат = Истина;
	
	Если СтрокаУпаковки.Обработан Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ПодобратьКодДляПолногоВозрата 
		И ТребуемоеКоличество = 0 Тогда
		
		ЭтоОСУ = СтрокаУпаковки.ВидУпаковки = УпаковкаОбъемноСортовойУчет();
		
		Если НЕ ЭтоОСУ Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТребуемоеКоличество <= 0 Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользоватьИнтеграционныйМодульДляЗаполненияСведенийОМаркировке()
	
	ИнтеграционныеМодули = Новый Массив;
	ИнтеграционныеМодули.Добавить("Модуль_ИнтеграцияАльфаАвто41");
	
	Результат = ИнтеграционныеМодули.Найти(ОсновнойМодуль.ИмяМодуляИнтеграции) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеТиповЗначения(Значение)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(Значение));
	
	Результат = Новый ОписаниеТипов(МассивТипов);
	
	Возврат Результат;
	
КонецФункции

// Загружает в учетный документ сведения о маркировке из товарной части ЭД.
//
// Параметры:
//  ДокументОбъект 					- ЛюбойОбъект 		- документ-владелец штрихкодов
//  ТоварнаяЧасть 					- ТаблицаЗначений 	- данные товарной части электронного документа.
//                  										См. Форма_Диадок_ЭД.Новый_ТабличнаяЧастьСтруктурыДокумента
//	ИспользоватьКонтурМаркировку	- Булево 			- истина, если получать сведения о маркировке
//                                          				нужно с помощью подсистемы "Контур.Маркировка"
//
Процедура ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, ИспользоватьКонтурМаркировку = Ложь) Экспорт
	
	Если ИспользоватьКонтурМаркировку Тогда
		ЗагрузитьКодыМаркировкиКонтурМаркировка(ДокументОбъект, ТоварнаяЧасть);
	Иначе
		ЗагрузитьКодыМаркировкиВнутренний(ДокументОбъект, ТоварнаяЧасть);
	КонецЕсли;
	
КонецПроцедуры

// Загружает сведения о маркировке из товарной части ЭД штатными средствами модуля.
// Сначала загрузка выполняется с помощью интеграционного модуля. Если в интеграционном
// модуле не будет отключена стандартная обработка, то коды маркировки будут загружены
// средствами типовой библиотеки интеграции с ИС МП.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//
Процедура ЗагрузитьКодыМаркировкиВнутренний(ДокументОбъект, ТоварнаяЧасть)
	
	СтандартнаяОбработка = Истина;
	
	ЗагрузитьКодыМаркировкиКонфигурация(ДокументОбъект, ТоварнаяЧасть, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ЗагрузитьКодыМаркировкиИСМП(ДокументОбъект, ТоварнаяЧасть);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьКодОСУИзGTIN(КоличествоТовара, СтрокаУпаковки)
	
	Если СтрокаУпаковки.КоличествоВПотребительскойУпаковке = 0 Тогда
		КоличествоПоТегу37 = 0;
	Иначе
		КоличествоПоТегу37 = Окр(КоличествоТовара / СтрокаУпаковки.КоличествоВПотребительскойУпаковке);
	КонецЕсли;
	
	Результат = ПодставитьПараметрыВСтроку("%1%2%3%4"
		,"02"
		,СтрокаУпаковки.ЗначениеШтрихкода
		,"37"
		,Формат(КоличествоПоТегу37,"ЧДЦ=0; ЧН=0; ЧГ=;"));
	
	Возврат Результат;
	
КонецФункции

// Переносит коды маркировки в коллекцию ItemIdentificationNumbers.
//
// Параметры:
//  НомСредИдентТов	 - Массив - содержит структуры, соответствующие объекту ItemIdentificationNumber (см. Новый_ItemIdentificationNumber)
//  КодыМаркировки	 - Структура - содержит коллекции кодов маркировки (см. НовыйСведенияОМаркировке)
//
Процедура ЗаполнитьКодыМаркировкиВСтрокеКонтента(ItemIdentificationNumbers, КодыМаркировки)
	
	Для Каждого Элемент Из КодыМаркировки.ТранспортныеУпаковки Цикл
		
		ИдентификационныйНомер = ОсновнойМодуль.Новый_ItemIdentificationNumber();
		ИдентификационныйНомер.TransPackageId = Элемент;
		ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КодыМаркировки.ИндивидуальныеУпаковки) Тогда
		
		ИдентификационныйНомер = ОсновнойМодуль.Новый_ItemIdentificationNumber();
		
		Для Каждого Элемент Из КодыМаркировки.ИндивидуальныеУпаковки Цикл
			ИдентификационныйНомер.PackageIds.Добавить(Элемент);
		КонецЦикла;
		
		ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодыМаркировки.КонтрольныеИдентификационныеЗнаки) Тогда
		
		ИдентификационныйНомер = ОсновнойМодуль.Новый_ItemIdentificationNumber();
		
		Для Каждого Элемент Из КодыМаркировки.КонтрольныеИдентификационныеЗнаки Цикл
			ИдентификационныйНомер.Units.Добавить(Элемент);
		КонецЦикла;
		
		ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает параметры учета номенклатуры в текущей информационной базе.
// 
// Возвращаемое значение:
//  ФикисированнаяСтруктура - содержит ключи:
//    * ИспользоватьХарактеристики - Булево - Истина, если используются характеристики номенклатуры
//    * ИспользоватьСерии - Булево - Истина, если используются серии номенклатуры
//
Функция ПараметрыУчетаНоменклатуры()
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьХарактеристики", Ложь);
	Результат.Вставить("ИспользоватьСерии", Ложь);
	
	Если Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьХарактеристики = Истина;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("СерииНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьСерии = Истина;
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Конструктор таблицы кодов маркировки, развернутой по номенклатуре.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок с товарными данными:
//   * Ссылка             - Произвольный - объект-владелец штрихкода - исходная колонка
//   * Номенклатура       - ОпределяемыйТип.Номенклатура - содержимое
//   * Характеристика     - ОпределяемыйТип.ХарактеристикаНоменклатуры - содержимое
//   * Серия              - ОпределяемыйТип.СерияНоменклатуры - содержимое
//   * ЗначениеШтрихкода  - Строка - текстовое представление исходного штрихкода для передачи в ЭДО
//   * ВидУпаковки        - Строка - вид упаковки номенклатуры для кодировки значения штрихкода. Допустимые значения:
//                                   УпаковкаПотребительская(), УпаковкаЛогистическая(), УпаковкаГрупповая(), Неопределено.
//   * Обработан          - Булево - признак сопоставления строки товарной части документа
//
//
Функция НоваяРазвернутаяТаблицаУпаковок()
	
	ТипСтрока200 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200));
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Серия");
	Результат.Колонки.Добавить("ЗначениеШтрихкода", ТипСтрока200);
	Результат.Колонки.Добавить("ВидУпаковки", ТипСтрока200);
	Результат.Колонки.Добавить("Обработан", ТипБулево);
	Результат.Колонки.Добавить("ИспользоватьХарактеристики", ТипБулево);
	Результат.Колонки.Добавить("ИспользоватьСерии", ТипБулево);
	
	Возврат Результат;
	
КонецФункции

Функция УпаковкаГрупповая()
	Возврат "Групповая";
КонецФункции

Функция УпаковкаЛогистическая()
	Возврат "Логистическая";
КонецФункции

Функция УпаковкаПотребительская()
	Возврат "Потребительская";
КонецФункции

Функция УпаковкаОбъемноСортовойУчет()
	Возврат "ОбъемноСортовойУчет";
КонецФункции

//{ Маркировка.ИнтеграционныйМодульКонфигурации

// Получает коды маркировки из документа с помощью ИМ и обогащает ими контент.
//
// Параметры:
//  Контент - Структура - протоконтент электронного документа.
//  СсылкаНаОбъект - ЛюбаяСсылка - источник данных для получения контента.
//
Процедура ЗаполнитьСведенияОМаркировке_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект)
	
	СтандартнаяОбработка = Истина;
	РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
	
	ЗаполнитьРазвернутуюТаблицуКодов(РазвернутаяТаблицаУпаковок, СсылкаНаОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка = Ложь Тогда
		ЗаполнитьСведенияОМаркировкеВКонтенте(Контент, РазвернутаяТаблицаУпаковок);
	КонецЕсли;
	
КонецПроцедуры

// Получает коды маркировки из документа с помощью подсистемы ИМ и обогащает ими контент.
//
// Параметры:
//  Контент - Структура - протоконтент электронного документа.
//  СсылкаНаОбъект - ЛюбаяСсылка - источник данных для получения контента.
//  ИсходныйДокумент - ЛюбаяСсылка - источник данных для получения контена до изменения.
//
Процедура ЗаполнитьСведенияОМаркировке736_ИнтеграционныйМодуль(Контент, СсылкаНаОбъект, ИсходныйДокумент)
	
	СтандартнаяОбработка = Истина;
	РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
	РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок();
	
	ЗаполнитьРазвернутуюТаблицуКодов(РазвернутаяТаблицаУпаковок, СсылкаНаОбъект, СтандартнаяОбработка);
	
	Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда 
		ЗаполнитьРазвернутуюТаблицуКодов(РазвернутаяТаблицаУпаковокДоИзменения, ИсходныйДокумент, СтандартнаяОбработка);
	КонецЕсли;
	
	Если СтандартнаяОбработка = Ложь Тогда
		ЗаполнитьСведенияОМаркировкеВКонтенте736(Контент, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет таблицу кодов штатными средствами конфигурации (с помощью интеграционного модуля).
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. НоваяРазвернутаяТаблицаУпаковок).
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода.
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка)
	
	ИнтеграционныйМодуль = ОсновнойМодуль.Модуль_Интеграция;
	ИнтеграционныйМодуль.ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

// Загружает сведения о маркировке из товарной части ЭД штатными средствами конфигурации.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов.
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить загрузку средствами библиотеки интеграции ИС МП.
//
Процедура ЗагрузитьКодыМаркировкиКонфигурация(ДокументОбъект, ТоварнаяЧасть, СтандартнаяОбработка = Истина)
	
	ИнтеграционныйМодуль = ОсновнойМодуль.Модуль_Интеграция;
	ИнтеграционныйМодуль.ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, СтандартнаяОбработка);
	
КонецПроцедуры

//} Маркировка.ИнтеграционныйМодульКонфигурации


//{ Маркировка.БиблиотекаИнтеграцииИСМП

// Получает коды маркировки из документа с помощью подсистемы ИСМП и обогащает ими контент.
//
// Параметры:
//  Контент - Структура - протоконтент электронного документа.
//  СсылкаНаОбъект - ЛюбаяСсылка - источник данных для получения контента.
//
Процедура ЗаполнитьСведенияОМаркировке_ИСМП(Контент, СсылкаНаОбъект)
	
	Если НЕ ЕстьИнтеграцияИСМП() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
	ТаблицаУпаковок = ТаблицаУпаковокИСМП(ДокументыПередачи);
	
	Если Не ЗначениеЗаполнено(ТаблицаУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяИнтеграцияИСМП10127() Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_ИСМП10127();
		ТаблицаТоваров = ТаблицаТоваровИСМП(Контент.Table.Items);
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИКодыОСУИСМП(ТаблицаУпаковок, ТаблицаТоваров, ДокументыПередачи);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		ЗаполнитьСведенияОМаркировкеВКонтенте_ИСМП10127(Контент, РазвернутаяТаблицаУпаковок);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИСМП(ТаблицаУпаковок);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		ЗаполнитьСведенияОМаркировкеВКонтенте(Контент, РазвернутаяТаблицаУпаковок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировке736_ИСМП(Контент, СсылкаНаОбъект, ИсходныйДокумент)
	
	Если НЕ ЕстьИнтеграцияИСМП() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
	ТаблицаУпаковок = ТаблицаУпаковокИСМП(ДокументыПередачи);
	
	Если Не ЗначениеЗаполнено(ТаблицаУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяИнтеграцияИСМП10127() Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_ИСМП10127();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок_ИСМП10127();
		ТаблицаТоваров = ТаблицаТоваровИСМП736(Контент.InvoiceCorrectionTable.Items, Ложь);
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИКодыОСУИСМП(ТаблицаУпаковок, ТаблицаТоваров, ДокументыПередачи);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда 
			
			ИсходныеДокументыПередачи = ВладельцыКодовМаркировки(ИсходныйДокумент);
			ТаблицаУпаковокДоИзменения = ТаблицаУпаковокИСМП(ИсходныеДокументыПередачи);
			ИсходныйДокументПередачи = ?(ИсходныеДокументыПередачи.Количество(), ИсходныеДокументыПередачи[0], Неопределено);
			ТаблицаТоваровДоИзменения = ТаблицаТоваровИСМП736(
				Контент.InvoiceCorrectionTable.Items,
				Истина,
				ИсходныйДокументПередачи
			);
			ДанныеШтрихкодовУпаковокДоИзменения = ЧастичноеСодержимоеИКодыОСУИСМП(
				ТаблицаУпаковокДоИзменения,
				ТаблицаТоваровДоИзменения,
				ИсходныеДокументыПередачи
			);
			
			ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковокДоИзменения, ДанныеШтрихкодовУпаковокДоИзменения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736_ИСМП10127(
			Контент,
			РазвернутаяТаблицаУпаковок,
			РазвернутаяТаблицаУпаковокДоИзменения
		);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок();
		ДанныеШтрихкодовУпаковок = ЧастичноеСодержимоеИСМП(ТаблицаУпаковок);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда 
			
			ИсходныеДокументыПередачи = ВладельцыКодовМаркировки(ИсходныйДокумент);
			ТаблицаУпаковокДоИзменения = ТаблицаУпаковокИСМП(ИсходныеДокументыПередачи);
			ДанныеШтрихкодовУпаковокДоИзменения = ЧастичноеСодержимоеИСМП(ТаблицаУпаковокДоИзменения);
			
			ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковокДоИзменения, ДанныеШтрихкодовУпаковокДоИзменения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736(Контент, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения);
		
	КонецЕсли;
	
КонецПроцедуры

// Загружает сведения о маркировке из товарной части ЭД средствами типовой библиотеки интеграции с ИС МП.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//
Процедура ЗагрузитьКодыМаркировкиИСМП(ДокументОбъект, ТоварнаяЧасть)
	
	Если Не ЕстьИнтеграцияИСМП()
		Или Не ЕстьШтрихкодыУпаковокИСМП(ДокументОбъект.Метаданные())
		Или Не ЗначениеЗаполнено(ТоварнаяЧасть) Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихкодыУпаковок = НоваяТаблицаШтрихкодыУпаковок();
	
	Для Каждого СтрокаТЧ Из ТоварнаяЧасть Цикл
		ДополнитьТаблицуШтрихкодов(
		    ШтрихкодыУпаковок,
			СтрокаТЧ.СведенияОМаркировке,
			СтрокаТЧ.НоменклатураДокумента.GTIN);
	КонецЦикла;
	
	ШтрихкодыУпаковок.Свернуть("ШтрихкодУпаковки, ЗначениеШтрихкода");
	
	ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ШтрихкодыУпаковок);
	
КонецПроцедуры

Функция ТаблицаТоваровИСМП(СтрокиКонтента)
	
	Результат = НоваяТаблицаТоваровИСМП(СтрокиКонтента);
	
	Для Каждого СтрокаКонтента Из СтрокиКонтента Цикл
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокаКонтента.СлужебнаяИнформация;
		
		СтрокаТаблицыТоваров = Результат.Добавить();
		СтрокаТаблицыТоваров.Номенклатура = СлужебнаяИнформацияСтрокиКонтента.Номенклатура;
		СтрокаТаблицыТоваров.Характеристика = СлужебнаяИнформацияСтрокиКонтента.Характеристика;
		СтрокаТаблицыТоваров.Ссылка = СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки;
		СтрокаТаблицыТоваров.Количество = СтрокаКонтента.Quantity;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаТоваровИСМП736(СтрокиКонтента, ИспользоватьКоличествоДоИзменения,
		ДокументОтгрузкиДоИзменения = Неопределено)
	
	Результат = НоваяТаблицаТоваровИСМП(СтрокиКонтента, ДокументОтгрузкиДоИзменения);
	
	Для Каждого СтрокаКонтента Из СтрокиКонтента Цикл
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокаКонтента.СлужебнаяИнформация;
		
		СтрокаТаблицыТоваров = Результат.Добавить();
		СтрокаТаблицыТоваров.Номенклатура = СлужебнаяИнформацияСтрокиКонтента.Номенклатура;
		СтрокаТаблицыТоваров.Характеристика = СлужебнаяИнформацияСтрокиКонтента.Характеристика;
		
		Если ЗначениеЗаполнено(ДокументОтгрузкиДоИзменения) Тогда
			СтрокаТаблицыТоваров.Ссылка = ДокументОтгрузкиДоИзменения;
		Иначе
			СтрокаТаблицыТоваров.Ссылка = СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки;
		КонецЕсли;
		
		Если ИспользоватьКоличествоДоИзменения Тогда
			СтрокаТаблицыТоваров.Количество = СтрокаКонтента["OriginalValues"].Quantity;
		Иначе
			СтрокаТаблицыТоваров.Количество = СтрокаКонтента["CorrectedValues"].Quantity;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаТоваровИСМП(СтрокиКонтента, ДокументОтгрузкиДоИзменения = Неопределено)
	
	ОписаниеТипаНоменклатура = Новый ОписаниеТипов(Справочники.ТипВсеСсылки());
	ОписаниеТипаХарактеристика = Новый ОписаниеТипов(Справочники.ТипВсеСсылки());
	ОписаниеТипаСсылка = Новый ОписаниеТипов(Документы.ТипВсеСсылки());
	
	Если СтрокиКонтента.Количество() Тогда
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокиКонтента[0].СлужебнаяИнформация;
		
		Если ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.Номенклатура) Тогда
			ОписаниеТипаНоменклатура = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.Номенклатура);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.Характеристика) Тогда
			ОписаниеТипаХарактеристика = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.Характеристика);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОтгрузкиДоИзменения) Тогда
			ОписаниеТипаСсылка = ОписаниеТиповЗначения(ДокументОтгрузкиДоИзменения);
		ИначеЕсли ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки) Тогда
			ОписаниеТипаСсылка = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура", ОписаниеТипаНоменклатура);
	Результат.Колонки.Добавить("Характеристика", ОписаниеТипаХарактеристика);
	Результат.Колонки.Добавить("Ссылка", ОписаниеТипаСсылка);
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Возврат Результат;
	
КонецФункции

// Проверяет, возможна ли интеграция с ИС МП.
// 
// Возвращаемое значение:
//  Булево - Истина, если подсистема есть.
//
Функция ЕстьИнтеграцияИСМП()
	
	Результат = Ложь;
	
	Если Метаданные.ОбщиеМодули.Найти("ОбновлениеИнформационнойБазыИСМП") <> Неопределено Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияБиблиотекиИнтеграцииИСМП()
	
	ОписаниеПодсистемы = Новый Структура;
	ОписаниеПодсистемы.Вставить("Имя", "");
	ОписаниеПодсистемы.Вставить("Версия", "");
	ОписаниеПодсистемы.Вставить("ТребуемыеПодсистемы", Новый Массив);
	
	МодульОбновлениеИнформационнойБазыИСМП = Вычислить("ОбновлениеИнформационнойБазыИСМП");
	МодульОбновлениеИнформационнойБазыИСМП.ПриДобавленииПодсистемы(ОписаниеПодсистемы);
	
	Результат = ОписаниеПодсистемы.Версия;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, поддерживает-ли встроенная версия библиотеки интеграции с ИС МП распределение одного кода ОСУ по нескольким строкам
// 
// Возвращаемое значение:
//  Булево - Истина, если библиотека поддерживает функционал.
//
Функция ИспользуетсяИнтеграцияИСМП10127()
	
	ВерсияИСМП = ВерсияБиблиотекиИнтеграцииИСМП();
	
	Результат = (ОсновнойМодуль.СравнитьВерсии(ВерсияИСМП, "10.1.27") = "ПерваяБольше");
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяРасширеннаяВерсияГосИС()
	
	ВерсияИСМП = ВерсияБиблиотекиИнтеграцииИСМП();
	
	Результат = (ОсновнойМодуль.СравнитьВерсии(ВерсияИСМП, "10.1.33") = "ПерваяБольше");
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу упаковок
//
// Параметры:
//  СсылкаИлиМассив - ЛюбаяСсылка, Массив - ссылки на документы, по которым необходимо получить таблицу упаковок
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок:
//   * Ссылка   - Произвольный - объект-владелец штрихкода
//   * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров
//
Функция ТаблицаУпаковокИСМП(СсылкаИлиМассив)
	
	КоллекцияСсылок = ОсновнойМодуль.ЗначениеВМассив(СсылкаИлиМассив);
	
	ТипыСсылок 			= Новый Соответствие;
	ТекстыЗапросов 		= Новый Массив;
	ВладельцыШтрихкодов = Новый Массив;
	
	Для Каждого СсылкаНаОбъект Из КоллекцияСсылок Цикл
		
		Тип = ТипЗнч(СсылкаНаОбъект);
		
		Если ТипыСсылок[Тип] = Неопределено Тогда
			
			МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
			ЕстьШК = ЕстьШтрихкодыУпаковокИСМП(МетаданныеОбъекта);
			
			ТипыСсылок.Вставить(Тип, ЕстьШК);
			
			Если ЕстьШК Тогда
				ТекстЗапросаШК = ТекстЗапросаТаблицыУпаковокИСМП(МетаданныеОбъекта.ПолноеИмя());
				ТекстыЗапросов.Добавить(ТекстЗапросаШК);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипыСсылок[Тип] Тогда
			ВладельцыШтрихкодов.Добавить(СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ТекстыЗапросов) Тогда
		
		Запрос = Новый Запрос;
		
		Разделитель = РазделительОбъединенияЗапросов();
						
		Запрос.Текст = ОсновнойМодуль.Преобразование_МассивВСтроку(ТекстыЗапросов, Разделитель, Истина);
		
		Запрос.УстановитьПараметр("ВладельцыШтрихкодов", ВладельцыШтрихкодов);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, есть ли у объекта метаданных табличная часть с штрихкодами упаковок товаров.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - проверяемый объект метаданных.
// 
// Возвращаемое значение:
//  Булево - Истина, если у объекта есть табличная часть "ШтрихкодыУпаковок".
//
Функция ЕстьШтрихкодыУпаковокИСМП(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТаблицыУпаковокИСМП(ПолноеИмяОбъекта)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.ШтрихкодУпаковки КАК Штрихкод
	|ИЗ
	|	&ТЧШтрихкоды КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В (&ВладельцыШтрихкодов)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТЧШтрихкоды", ПолноеИмяОбъекта + ".ШтрихкодыУпаковок");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Разворачивает таблицу транспортных и индивидуальных штрихкодов до номенклатуры, характеристики, серии
//   для дальнейшего сопоставления информации об упаковках с товарной частью.
//   Для транспортных упаковок номенклатура (характеристика, серия)- это номенклатура (характеристика, серия)
//   первого вложенного (на любом уровне) индивидуального штрихкода.
// 
// Параметры:
// 	ТаблицаУпаковок - ТаблицаЗначений - исходная таблица упаковок:
// 	 * Ссылка   - Произвольный - объект-владелец штрихкода
// 	 * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров
// Возвращаемое значение - ТаблицаЗначений - таблица упаковок с товарными данными:
// 	 * Ссылка             - Произвольный - объект-владелец штрихкода - исходная колонка
// 	 * Штрихкод           - СправочникСсылка.ШтрихкодыУпаковокТоваров - ссылка на индивидуальный штрихкод содержимого
// 	 * Номенклатура       - ОпределяемыйТип.Номенклатура - содержимое
// 	 * Характеристика     - ОпределяемыйТип.ХарактеристикаНоменклатуры - содержимое
// 	 * Серия              - ОпределяемыйТип.СерияНоменклатуры - содержимое
// 	 * ЗначениеШтрихкода  - Строка - текстовое представление исходного штрихкода для передачи в ЭДО
// 	 * Обработан          - Булево - признак сопоставления строки товарной части документа
//
Функция ЧастичноеСодержимоеИСМП(ТаблицаУпаковок)
	
	МодульЭлектронноеВзаимодействиеИСМП = ОбщийМодульПоИмени("ЭлектронноеВзаимодействиеИСМП");
	Результат = МодульЭлектронноеВзаимодействиеИСМП.ЧастичноеСодержимое(ТаблицаУпаковок);
	
	Возврат Результат;
	
КонецФункции

// Разворачивает таблицу транспортных и индивидуальных штрихкодов до номенклатуры, характеристики, серии
//   для дальнейшего сопоставления информации об упаковках с товарной частью.
// Добавляет в таблицу коды ОСУ для строк, по которым коды маркировки не указывались. Считаем что таблица товаров
//   уже соответствует таблице штрихкодов упаковок (с учетом невнесенных ОСУ).
//
// Параметры:
// 	ТаблицаУпаковок - ТаблицаЗначений - исходная таблица упаковок:
// 	 * Ссылка   - Произвольный - объект-владелец штрихкода
// 	 * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкод
//  ТаблицаТоваров	 - ТаблицаЗначений - исходная таблица товаров: 
// 	 * Ссылка         - Произвольный - объект-владелец штрихкода
// 	 * Номенклатура   - ОпределяемыйТип.Номенклатура - номенклатура
// 	 * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика
// 	 * Количество     - Число - количество
//  ПараметрыСканирования - См. ШтрихкодированиеИС.ПараметрыСканирования
// Возвращаемое значение:
//  ТаблицаЗначений - См. ЧастичноеСодержимое
//
Функция ЧастичноеСодержимоеИКодыОСУИСМП(ТаблицаУпаковок, ТаблицаТоваров, ДокументыОснования)
	
	Если ДокументыОснования.Количество() Тогда
		ДокументОснование = ДокументыОснования[0];
	ИначеЕсли ТаблицаТоваров.Количество() Тогда
		ДокументОснование = ТаблицаТоваров[0].Ссылка;
	КонецЕсли;
	
	Если ИспользуетсяРасширеннаяВерсияГосИС() Тогда
		МодульШтрихкодированиеИС = Вычислить("ШтрихкодированиеОбщегоНазначенияИС");
	Иначе
		МодульШтрихкодированиеИС = Вычислить("ШтрихкодированиеИС");
	КонецЕсли;
	
	ПараметрыСканирования = МодульШтрихкодированиеИС.ПараметрыСканирования(ДокументОснование);
	МодульЭлектронноеВзаимодействиеИСМП = ОбщийМодульПоИмени("ЭлектронноеВзаимодействиеИСМП");
	
	Результат = МодульЭлектронноеВзаимодействиеИСМП.ЧастичноеСодержимоеИКодыОСУ(ТаблицаУпаковок
				,ТаблицаТоваров
				,ПараметрыСканирования);
	
	Возврат Результат;
	
КонецФункции

Функция НоваяРазвернутаяТаблицаУпаковок_ИСМП10127()
	
	Результат = НоваяРазвернутаяТаблицаУпаковок();
	
	Результат.Колонки.Добавить("КоличествоВПотребительскойУпаковке", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ШтрихКод");
	
	Возврат Результат;
	
КонецФункции

// Заполняет таблицу кодов средствами типовой библиотеки интеграции с ИС МП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(Результат, ДанныеШтрихкодовУпаковок)
	
	ЕстьВидУпаковки = (ДанныеШтрихкодовУпаковок.Колонки.Найти("ВидУпаковки") <> Неопределено);
	ИсключаемыеСвойства = "";
	
	Если ЕстьВидУпаковки Тогда 
		ИсключаемыеСвойства = "ВидУпаковки";
	КонецЕсли;
	
	ПараметрыНоменклатуры = ПараметрыУчетаНоменклатуры();
	ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокИСМП();
	
	Для Каждого УпаковкаИСМП Из ДанныеШтрихкодовУпаковок Цикл
		
		ВидУпаковкиИСМП = Неопределено;
		Если ЕстьВидУпаковки Тогда
			ВидУпаковкиИСМП = УпаковкаИСМП.ВидУпаковки;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, УпаковкаИСМП, , ИсключаемыеСвойства);
		НоваяСтрока.ВидУпаковки = ВидУпаковкиПоДаннымИСМП(ВидУпаковкиИСМП, ПравилаКонвертацииУпаковок);
		НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатуры.ИспользоватьХарактеристики;
		НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатуры.ИспользоватьСерии;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте_ИСМП10127(Контент, РазвернутаяТаблицаУпаковок)
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		ТребуемоеКоличество = СтрокаТЧ.Quantity;
		
		Если Не ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			Продолжить;
		КонецЕсли;
		
		// Инициализировать промежуточную структуру с коллекциями кодов маркировки
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		// Найти подходящие кодами маркировки
		ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
		
		// Перенести найденные коды маркировки в строку протоконтента
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.ItemIdentificationNumbers, КодыМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковок, СлужебнаяИнформация, ТребуемоеКоличество)
	
	Для Каждого СтрокаУпаковки Из РазвернутаяТаблицаУпаковок Цикл
		
		Если СтрокаУпаковки.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.Номенклатура <> СлужебнаяИнформация.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьХарактеристики
			И СтрокаУпаковки.Характеристика <> СлужебнаяИнформация.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		
		ВидУпаковки = СтрокаУпаковки.ВидУпаковки;
		
		Если ВидУпаковки <> УпаковкаОбъемноСортовойУчет()
			И СтрокаУпаковки.ИспользоватьСерии
			И ЗначениеЗаполнено(СлужебнаяИнформация.Серия)
			И СтрокаУпаковки.Серия <> СлужебнаяИнформация.Серия Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШК = СтрокаУпаковки.ЗначениеШтрихкода;
		
		Если ЗначениеЗаполнено(ЗначениеШК) Тогда
			
			Если ВидУпаковки = УпаковкаЛогистическая() Тогда
				КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаГрупповая() Тогда
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
				
				Если ЗначениеЗаполнено(СтрокаУпаковки.Штрихкод) Тогда
					КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				Иначе
					ЗначениеШК = СформироватьКодОСУИзGTIN(ТребуемоеКоличество, СтрокаУпаковки);
					КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
					
					Прервать;
				КонецЕсли;
				
			Иначе
				КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаУпаковки.Обработан = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736_ИСМП10127(Контент, РазвернутаяТаблицаУпаковок, РазвернутаяТаблицаУпаковокДоИзменения)
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		//CorrectedValues
		ТребуемоеКоличество = СтрокаТЧ.CorrectedValues.Quantity;
		ТребуемоеКоличество = ?(ТребуемоеКоличество = Неопределено, 0, ТребуемоеКоличество);
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
		//OriginalValues
		ТребуемоеКоличество = СтрокаТЧ.OriginalValues.Quantity;
		
		Если ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			
			// Инициализировать промежуточную структуру с коллекциями кодов маркировки
			КодыМаркировки = НовыйСведенияОМаркировке();
			
			// Найти подходящие кодами маркировки
			ПодобратьКодыМаркировки_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковокДоИзменения, СтрокаТЧ.СлужебнаяИнформация, ТребуемоеКоличество);
			
			// Перенести найденные коды маркировки в строку протоконтента
			ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует правила преобразования видов упаковок подсистемы ИСМП во внутреннее представление,
// которое используется для заполнения развернутой таблицы упаковок.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки в формате ИСМП.
//   * Значение - Строка - Внутреннее представление вида упаковки.
//
Функция ПравилаКонвертацииУпаковокИСМП()
	
	Результат = Новый Соответствие;

	МетаданныеВидыУпаковокИС = Метаданные.Перечисления.Найти("ВидыУпаковокИС");
	Если МетаданныеВидыУпаковокИС <> Неопределено Тогда
		
		ВидыУпаковокИСМП = Перечисления.ВидыУпаковокИС;
		
		Результат.Вставить(ВидыУпаковокИСМП.Групповая, УпаковкаГрупповая());
		Результат.Вставить(ВидыУпаковокИСМП.Логистическая, УпаковкаЛогистическая());
		Результат.Вставить(ВидыУпаковокИСМП.Потребительская, УпаковкаПотребительская()); 
		
		ЕстьОбъемноСортовойУчет = МетаданныеВидыУпаковокИС.ЗначенияПеречисления.Найти("ОбъемноСортовойУчет") <> Неопределено;
		Если ЕстьОбъемноСортовойУчет Тогда
			Результат.Вставить(ВидыУпаковокИСМП.ОбъемноСортовойУчет, УпаковкаОбъемноСортовойУчет());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает вид упаковки подсистемы ИСМП во внутренее представление.
//
// Параметры:
//  ВидУпаковкиИСМП - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки в формате ИСМП.
//  ПравилаКонвертацииУпаковок - Соответствие - (Необязательный) правила преобразования (см. ПравилаКонвертацииУпаковокИСМП)
// 
// Возвращаемое значение:
//  Строка - Возможные значения описаны функциями УпаковкаПотребительская(), УпаковкаЛогистическая() и УпаковкаГрупповая()
//
Функция ВидУпаковкиПоДаннымИСМП(ВидУпаковкиИСМП, ПравилаКонвертацииУпаковок = Неопределено)
	
	Если ПравилаКонвертацииУпаковок = Неопределено Тогда
		ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокИСМП();
	КонецЕсли;
	
	ЗначениеПоУмолчанию = УпаковкаПотребительская();
	
	Результат = ПравилаКонвертацииУпаковок.Получить(ВидУпаковкиИСМП);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} Маркировка.БиблиотекаИнтеграцииИСМП


//{ Маркировка.КонтурМаркировка

// Получает коды маркировки из документа с помощью подсистемы "Контур.Маркировка" и обогащает ими контент.
//
// Параметры:
//  Контент - Структура - протоконтент электронного документа.
//  СсылкаНаОбъект - ЛюбаяСсылка - источник данных для получения контента.
//
Процедура ЗаполнитьСведенияОМаркировке_КонтурМаркировка(Контент, СсылкаНаОбъект)
	
	ПроверитьПодсистемуКонтурМаркировка();
	
	Если ИспользуетсяКонтурМаркировка33() Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33();
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтента(РазвернутаяТаблицаУпаковок, Контент);
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		ЗаполнитьСведенияОМаркировкеВКонтенте_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(РазвернутаяТаблицаУпаковок, СсылкаНаОбъект, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		ЗаполнитьСведенияОМаркировкеВКонтенте(Контент, РазвернутаяТаблицаУпаковок);
		
	КонецЕсли;
	
КонецПроцедуры

// Получает коды маркировки из документа с помощью подсистемы "Контур.Маркировка" и обогащает ими контент.
//
// Параметры:
//  Контент - Структура - протоконтент электронного документа.
//  СсылкаНаОбъект - ЛюбаяСсылка - источник данных для получения контента.
//  ИсходныйДокумент - ЛюбаяСсылка - источник данных для получения контена до изменения.
//
Процедура ЗаполнитьСведенияОМаркировке736_КонтурМаркировка(Контент, СсылкаНаОбъект, ИсходныйДокумент)
	
	ПроверитьПодсистемуКонтурМаркировка();
	
	// Получим товарные документы отгрузки до корректировки, если таких документов больше 1,
	// то не будем использовать новый метод маркировки, так как не сможем корректно получить коды по нескольким документам
	Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
		ИсходныеДокументыПередачи = ВладельцыКодовМаркировки(ИсходныйДокумент);
	Иначе
		ИсходныеДокументыПередачи = Новый Массив;
	КонецЕсли;
	
	ДокументыПередачи = ВладельцыКодовМаркировки(СсылкаНаОбъект);
	
	НесколькоДокументовПередачи = 2;
	
	Если ИспользуетсяКонтурМаркировка310()
		И ИсходныеДокументыПередачи.Количество() < НесколькоДокументовПередачи Тогда
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33();
		ОшибкиЗаполнения = Новый Массив;
		
		ЭтоУКДНаОснованииВозвратаОтКлиента = СредиВладельцевКодовМаркировкиТолькоВозвратыОтКлиента(ДокументыПередачи);
		
		ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтентаУКД736(
			РазвернутаяТаблицаУпаковок,
			Контент,
			Неопределено,
			ЭтоУКДНаОснованииВозвратаОтКлиента
		);
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		Если ИсходныеДокументыПередачи.Количество() > 0 Тогда
			
			ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтентаУКД736(
				РазвернутаяТаблицаУпаковокДоИзменения,
				Контент,
				ИсходныеДокументыПередачи[0],
				Ложь
			);
			ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковокДоИзменения, ОшибкиЗаполнения);
			ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка33(
			Контент,
			РазвернутаяТаблицаУпаковок,
			РазвернутаяТаблицаУпаковокДоИзменения,
			ЭтоУКДНаОснованииВозвратаОтКлиента
		);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = НоваяРазвернутаяТаблицаУпаковок();
		РазвернутаяТаблицаУпаковокДоИзменения = НоваяРазвернутаяТаблицаУпаковок();
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(РазвернутаяТаблицаУпаковок, ДокументыПередачи, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
		
		Если ИсходныеДокументыПередачи.Количество() > 0 Тогда
			
			ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(
				РазвернутаяТаблицаУпаковокДоИзменения,
				ИсходныеДокументыПередачи,
				ОшибкиЗаполнения
			);
			ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, ОшибкиЗаполнения);
			
		КонецЕсли;
		
		ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка(
			Контент,
			РазвернутаяТаблицаУпаковок,
			РазвернутаяТаблицаУпаковокДоИзменения
		);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, что подсистема Контур.Маркировка подключена.
// 
// Возвращаемое значение:
//  Булево - Истина, если подсистема подключена.
//
Функция ЕстьИнтеграцияКонтурМаркировка()
	
	Результат = Метаданные.Подсистемы.Найти("КонтурМаркировка") <> Неопределено
		И Метаданные.ОбщиеМодули.Найти("ВзаимодействиеКонтурМаркировка") <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что подсистема "Контур.Маркировка" установлена.
// Если подсистема не установлена, записывает ошибку в журнал
// и генерирует исключение.
//
Процедура ПроверитьПодсистемуКонтурМаркировка()
	
	Если ЕстьИнтеграцияКонтурМаркировка() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "Подсистема ""Контур.Маркировка"" не подключена!";
	
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации()
		, УровеньЖурналаРегистрации.Ошибка
		,
		,
		, ТекстОшибки);
	
	ВызватьИсключение ТекстОшибки;
	
КонецПроцедуры

Функция ИспользуетсяКонтурМаркировка33()
	
	Результат = Истина;
	НеобходимаяВерсияМодуляМаркировки = "3.3.0";
	
	Попытка
		ВерсияМодуляМаркировки = Вычислить("ВзаимодействиеКонтурМаркировка.ВерсияМодуля()");
	Исключение
		ВерсияМодуляМаркировки = "0.0.0";
	КонецПопытки;
	
	Результат = ОсновнойМодуль.СравнитьВерсии(ВерсияМодуляМаркировки, НеобходимаяВерсияМодуляМаркировки) = "ПерваяБольше";
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяКонтурМаркировка310()
	
	// В версии 3.10 в маркировке исправлена ошибка деления на 0 при полном возврате кодов ОСУ
	
	Результат = Истина;
	НеобходимаяВерсияМодуляМаркировки = "3.10.0";
	
	Попытка
		ВерсияМодуляМаркировки = Вычислить("ВзаимодействиеКонтурМаркировка.ВерсияМодуля()");
	Исключение
		ВерсияМодуляМаркировки = "0.0.0";
	КонецПопытки;
	
	Результат = ОсновнойМодуль.СравнитьВерсии(ВерсияМодуляМаркировки, НеобходимаяВерсияМодуляМаркировки) = "ПерваяБольше";
	
	Возврат Результат;
	
КонецФункции

// Получает таблицу упаковок, развернутую по номенклатуре, из подсистемы Контур.Маркировка.
// Аналог функции ЧастичноеСодержимоеИСМП.
//
// Параметры:
//  ДокументыПередачи - Массив - коллекция объектов-владельцев кодов.
//  ОшибкиЗаполнения - Массив - (Необязательный) Коллекция ошибок получения кодов (возвращаемый параметр).
// 
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция РазвернутаяТаблицаУпаковокКонтурМаркировка(ДокументыПередачи, ОшибкиЗаполнения = Неопределено)
	
	МодульВзаимодействиеКонтурМаркировка = ОбщийМодульПоИмени("ВзаимодействиеКонтурМаркировка");
	
	Результат = МодульВзаимодействиеКонтурМаркировка.РазвернутаяТаблицаУпаковок(ДокументыПередачи, ОшибкиЗаполнения);
	
	Возврат Результат;
	
КонецФункции

// Заполняет таблицу кодов по данным подсистемы Контур.Маркировка
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. НоваяРазвернутаяТаблицаУпаковок)
//  ДокументыПередачи - Массив - коллекция объектов-владельцев штрихкодов
//  ОшибкиЗаполнения - Массив - (Необязательный) Коллекция ошибок получения кодов (возвращаемый параметр).
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(
	Результат,
	ДокументыПередачи,
	ОшибкиЗаполнения = Неопределено
	)
	
	ДанныеШтрихкодовУпаковок = РазвернутаяТаблицаУпаковокКонтурМаркировка(ДокументыПередачи, ОшибкиЗаполнения);
	
	Если Не ЗначениеЗаполнено(ДанныеШтрихкодовУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиШтрихкодов = ДанныеШтрихкодовУпаковок.Колонки;
	ЕстьПараметрыНоменклатуры = (КолонкиШтрихкодов.Найти("ИспользоватьХарактеристики") <> Неопределено);
	ПараметрыНоменклатурыПоУмолчанию = ПараметрыУчетаНоменклатуры();
	ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокКонтурМаркировка();
	
	Для Каждого УпаковкаКМ Из ДанныеШтрихкодовУпаковок Цикл
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, УпаковкаКМ);
		
		НоваяСтрока.ВидУпаковки = ВидУпаковкиПоДаннымКонтурМаркировка(
			УпаковкаКМ.ВидУпаковки,
			ПравилаКонвертацииУпаковок
		);
		
		Если Не ЕстьПараметрыНоменклатуры Тогда
			НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатурыПоУмолчанию.ИспользоватьХарактеристики;
			НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатурыПоУмолчанию.ИспользоватьСерии;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка33(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения)
	
	МодульВзаимодействиеКонтурМаркировка = Вычислить("ВзаимодействиеКонтурМаркировка");
	
	МодульВзаимодействиеКонтурМаркировка.ЗаполнитьСведенияОМаркировке(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
	
КонецПроцедуры

Функция НоваяРазвернутаяТаблицаУпаковок_КонтурМаркировка33()
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипЧисло5 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 0));
	ТипЧисло15_3 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 3));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИндексСтроки", ТипЧисло5);
	Результат.Колонки.Добавить("Количество", ТипЧисло15_3);
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Серия");
	Результат.Колонки.Добавить("Упаковка");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("ПервичныйДокумент");
	Результат.Колонки.Добавить("СведенияОМаркировке");
	Результат.Колонки.Добавить("КодТоварнойГруппы", ТипЧисло);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтента(РазвернутаяТаблицаУпаковок, Контент)
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		СлужебнаяИнформацияСтрокиТЧ = СтрокаТЧ.СлужебнаяИнформация;
		
		СтрокаТаблицыУпаковок = РазвернутаяТаблицаУпаковок.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыУпаковок, СлужебнаяИнформацияСтрокиТЧ);
		
		СтрокаТаблицыУпаковок.ИндексСтроки = НомерСтроки;
		СтрокаТаблицыУпаковок.Количество = СтрокаТЧ.Quantity;
		СтрокаТаблицыУпаковок.ПервичныйДокумент = СлужебнаяИнформацияСтрокиТЧ.ДокументОтгрузки;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтентаУКД736(
	РазвернутаяТаблицаУпаковок,
	Контент,
	ИсходныйДокумент,
	ЭтоУКДНаОснованииВозвратаОтКлиента)
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СлужебнаяИнформацияСтрокиТЧ = СтрокаТЧ.СлужебнаяИнформация;
		
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
			КоличествоПоСтроке = ПривестиКЧислу(СтрокаТЧ["OriginalValues"].Quantity);
			ПервичныйДокумент = ИсходныйДокумент;
		ИначеЕсли ЭтоУКДНаОснованииВозвратаОтКлиента Тогда
			КоличествоПоСтроке = ПривестиКЧислу(СтрокаТЧ["OriginalValues"].Quantity)
				- ПривестиКЧислу(СтрокаТЧ["CorrectedValues"].Quantity);
			ПервичныйДокумент = СлужебнаяИнформацияСтрокиТЧ.ДокументОтгрузки;
		Иначе
			КоличествоПоСтроке = ПривестиКЧислу(СтрокаТЧ["CorrectedValues"].Quantity);
			ПервичныйДокумент = СлужебнаяИнформацияСтрокиТЧ.ДокументОтгрузки;
		КонецЕсли;
		
		Если КоличествоПоСтроке = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыУпаковок = РазвернутаяТаблицаУпаковок.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыУпаковок, СлужебнаяИнформацияСтрокиТЧ);
		
		СтрокаТаблицыУпаковок.ИндексСтроки = НомерСтроки;
		СтрокаТаблицыУпаковок.Количество = КоличествоПоСтроке;
		СтрокаТаблицыУпаковок.ПервичныйДокумент = ПервичныйДокумент;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок)
	
	ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
	УпаковкаГрупповая = ВидыУпаковокКМ.Групповая;
	УпаковкаЛогистическая = ВидыУпаковокКМ.Логистическая;
	УпаковкаОбъемноСортовойУчет = ВидыУпаковокКМ.ОбъемноСортовойУчет;
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		СтрокаТаблицы = РазвернутаяТаблицаУпаковок.Найти(НомерСтроки, "ИндексСтроки");
		СведенияОМаркировке = СтрокаТаблицы.СведенияОМаркировке; // ЗначениеШтрихкода - Строка, ВидУпаковки - Перечисления.КонтурМаркировка_ВидыУпаковок, GTIN - Строка, Количество - Число
		
		КодыМаркировки = НовыйСведенияОМаркировке();
		
		Для Каждого СведенияОКоде Из СведенияОМаркировке Цикл
			
			ВидУпаковки = СведенияОКоде.ВидУпаковки;
			ЗначениеШК = СведенияОКоде.ЗначениеШтрихкода;
			
			Если ВидУпаковки = УпаковкаЛогистическая Тогда
				
				КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
				
			ИначеЕсли ВидУпаковки = УпаковкаГрупповая Тогда
				
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				
			ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет Тогда
				
				ЗначениеШК = СформироватьКодОСУ_КонтурМаркировка33(СведенияОКоде);
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				
			Иначе
				КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.ItemIdentificationNumbers, КодыМаркировки);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте736_КонтурМаркировка33(
		Контент,
		РазвернутаяТаблицаУпаковок,
		РазвернутаяТаблицаУпаковокДоИзменения,
		ЭтоУКДНаОснованииВозвратаОтКлиента
	)
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		СтрокаТаблицыУпаковок = РазвернутаяТаблицаУпаковок.Найти(НомерСтроки, "ИндексСтроки");
		
		Если СтрокаТаблицыУпаковок <> Неопределено Тогда
			СведенияОМаркировке = СтрокаТаблицыУпаковок.СведенияОМаркировке;
		Иначе
			СведенияОМаркировке = Неопределено;
		КонецЕсли;
		
		СтрокаТаблицыУпаковокДоИзменения = РазвернутаяТаблицаУпаковокДоИзменения.Найти(НомерСтроки, "ИндексСтроки");
		
		Если СтрокаТаблицыУпаковокДоИзменения <> Неопределено Тогда
			СведенияОМаркировкеДоИзменения = СтрокаТаблицыУпаковокДоИзменения.СведенияОМаркировке;
		Иначе
			СведенияОМаркировкеДоИзменения = Неопределено;
		КонецЕсли;
		
		Если ЭтоУКДНаОснованииВозвратаОтКлиента Тогда
			СведенияОМаркировкеПослеИзменения = СведенияОМаркировкеПередаваемыеПослеВозврата(
				СведенияОМаркировке,
				СведенияОМаркировкеДоИзменения
			);
		Иначе
			СведенияОМаркировкеПослеИзменения = СведенияОМаркировке;
		КонецЕсли;
		
		КодыМаркировки = КодыМаркировкиДляКонтентаПоДаннымКонтурМаркировки33(СведенияОМаркировкеПослеИзменения);
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.CorrectedItemIdentificationNumbers, КодыМаркировки);
		
		Если ЗначениеЗаполнено(КодыМаркировки.НомерПартии) Тогда
			ДополнитьМассивKeyValue(СтрокаТЧ.StructedAdditionalInfos, "ПрПартМаркПосле", КодыМаркировки.НомерПартии);
		КонецЕсли;
		
		КодыМаркировкиДоИзменения = КодыМаркировкиДляКонтентаПоДаннымКонтурМаркировки33(СведенияОМаркировкеДоИзменения);
		ЗаполнитьКодыМаркировкиВСтрокеКонтента(СтрокаТЧ.OriginalItemIdentificationNumbers, КодыМаркировкиДоИзменения);
		
		Если ЗначениеЗаполнено(КодыМаркировкиДоИзменения.НомерПартии) Тогда
			ДополнитьМассивKeyValue(СтрокаТЧ.StructedAdditionalInfos, "ПрПартМаркДо", КодыМаркировкиДоИзменения.НомерПартии);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СведенияОМаркировкеПередаваемыеПослеВозврата(СведенияОМаркировке, СведенияОМаркировкеДоИзменения)
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(СведенияОМаркировкеДоИзменения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат СведенияОМаркировкеДоИзменения;
	КонецЕсли;
	
	// Коды ОСУ не совпадают из-за количества в самом коде ОСУ
	// так же СведенияОМаркировке содержит только одну строку
	СтрокаМаркировки = СведенияОМаркировке[0];
	
	ЭтоКодОСУ = СтрокаМаркировки.ВидУпаковки = Перечисления.КонтурМаркировка_ВидыУпаковок.ОбъемноСортовойУчет;
	
	Если ЭтоКодОСУ Тогда
		
		СтрокаМаркировкиДоИзменения = СведенияОМаркировкеДоИзменения[0];
		
		СтрокаМаркировки.Количество = СтрокаМаркировкиДоИзменения.Количество - СтрокаМаркировки.Количество;
		
		Результат = СведенияОМаркировке;
		
	Иначе
		
		ВозвращенныеКоды = Новый СписокЗначений;
		ВозвращенныеКоды.ЗагрузитьЗначения(СведенияОМаркировке.ВыгрузитьКолонку("ЗначениеШтрихкода"));
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(СведенияОМаркировкеДоИзменения);
		
		НовыйОтбор = ПостроительЗапроса.Отбор.Добавить("ЗначениеШтрихкода");
		НовыйОтбор.Использование = Истина;
		НовыйОтбор.ВидСравнения = ВидСравнения.НеВСписке;
		НовыйОтбор.Значение = ВозвращенныеКоды;
		
		Результат = ПостроительЗапроса.Результат.Выгрузить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыМаркировкиДляКонтентаПоДаннымКонтурМаркировки33(СведенияОМаркировке)
	
	Результат = НовыйСведенияОМаркировке();
	
	Если НЕ ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
	УпаковкаГрупповая = ВидыУпаковокКМ.Групповая;
	УпаковкаЛогистическая = ВидыУпаковокКМ.Логистическая;
	УпаковкаОбъемноСортовойУчет = ВидыУпаковокКМ.ОбъемноСортовойУчет;
	
	ЕстьИнформацияПоПартиям = Неопределено;
	
	Для Каждого СведенияОКоде Из СведенияОМаркировке Цикл
		
		ВидУпаковки = СведенияОКоде.ВидУпаковки;
		ЗначениеШК = СведенияОКоде.ЗначениеШтрихкода;
		
		Если ВидУпаковки = УпаковкаЛогистическая Тогда
			
			Результат.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			
		ИначеЕсли ВидУпаковки = УпаковкаГрупповая Тогда
			
			Результат.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			
		ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет Тогда
			
			ЗначениеШК = СформироватьКодОСУ_КонтурМаркировка33(СведенияОКоде);
			Результат.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			
			Если ЕстьИнформацияПоПартиям = Неопределено Тогда
				ЕстьИнформацияПоПартиям = НЕ СведенияОМаркировке.Колонки.Найти("НомерПартии") = Неопределено;
			КонецЕсли;
			
			Если ЕстьИнформацияПоПартиям Тогда
				Результат.НомерПартии = СведенияОКоде.НомерПартии;
			КонецЕсли;
			
		Иначе
			Результат.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьКодОСУ_КонтурМаркировка33(СведенияОКоде)
	
	Результат = ПодставитьПараметрыВСтроку("%1%2%3%4"
		,"02"
		,СведенияОКоде.GTIN
		,"37"
		,XMLСтрока(Цел(СведенияОКоде.Количество))
	);
	
	Возврат Результат;
	
КонецФункции

// Загружает сведения о маркировке из товарной части ЭД в подсистему Контур.Маркировка.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//
Процедура ЗагрузитьКодыМаркировкиКонтурМаркировка(ДокументОбъект, ТоварнаяЧасть)
	
	// Загрузка из электронного документа не требуется, коды будут получены напрямую из сервиса.
	
КонецПроцедуры

Процедура ОбработатьОшибкиПолученияКодовКонтурМаркировка(Контент, КоллекцияОшибок)
	
	Если Не ЗначениеЗаполнено(КоллекцияОшибок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Ошибка Из КоллекцияОшибок Цикл
		
		ТекстОшибки = "<Контур.Маркировка> " + Ошибка.ТекстОшибки;
		СсылкаНаОбъект = Ошибка.ДокументМаркировки;
		ОсновнойМодуль.ДобавитьОшибкуВалидации(Контент.ОшибкиВДанных, ТекстОшибки, СсылкаНаОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует правила преобразования видов упаковок подсистемы КонтурМаркировка во внутреннее представление,
// которое используется для заполнения развернутой таблицы упаковок.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки в формате КонтурМаркировка.
//   * Значение - Строка - Внутреннее представление вида упаковки.
//
Функция ПравилаКонвертацииУпаковокКонтурМаркировка()
	
	Результат = Новый Соответствие;

	МетаданныеВидыУпаковокКонтурМаркировка = Метаданные.Перечисления.Найти("КонтурМаркировка_ВидыУпаковок");
	Если МетаданныеВидыУпаковокКонтурМаркировка <> Неопределено Тогда
		
		ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
		
		Результат.Вставить(ВидыУпаковокКМ.Групповая, УпаковкаГрупповая());
		Результат.Вставить(ВидыУпаковокКМ.Логистическая, УпаковкаЛогистическая());
		Результат.Вставить(ВидыУпаковокКМ.Потребительская, УпаковкаПотребительская()); 
		
		ЕстьОбъемноСортовойУчет = МетаданныеВидыУпаковокКонтурМаркировка.ЗначенияПеречисления.Найти("ОбъемноСортовойУчет") <> Неопределено;
		Если ЕстьОбъемноСортовойУчет Тогда
			Результат.Вставить(ВидыУпаковокКМ.ОбъемноСортовойУчет, УпаковкаОбъемноСортовойУчет());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает вид упаковки подсистемы КонтурМаркировка во внутренее представление.
//
// Параметры:
//  ВидУпаковкиКМ - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки в формате КМ.
//  ПравилаКонвертацииУпаковок - Соответствие - (Необязательный) правила преобразования (см. ПравилаКонвертацииУпаковокКонтурМаркировка)
// 
// Возвращаемое значение:
//  Строка - Возможные значения описаны функциями УпаковкаПотребительская(), УпаковкаЛогистическая() и УпаковкаГрупповая()
//
Функция ВидУпаковкиПоДаннымКонтурМаркировка(ВидУпаковкиКМ, ПравилаКонвертацииУпаковок = Неопределено)
	
	Если ПравилаКонвертацииУпаковок = Неопределено Тогда
		ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокКонтурМаркировка();
	КонецЕсли;
	
	ЗначениеПоУмолчанию = УпаковкаПотребительская();
	
	Результат = ПравилаКонвертацииУпаковок.Получить(ВидУпаковкиКМ);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет структурированное инфополе в контент исходящего документа
//
// Параметры
//  Массив - Массив - Коллекция инфополей шапки или табличной части документа
//  Key - Строка - Ключ добавляемого свойства
//  Value - Строка - Значение добавляемого свойства
//
Процедура ДополнитьМассивKeyValue(Массив, Key, Value)
	
	НовыйЭлемент = Новый Структура;
	
	НовыйЭлемент.Вставить("Key", Key);
	НовыйЭлемент.Вставить("Value", Value);
	
	Массив.Добавить(НовыйЭлемент);
	
КонецПроцедуры

//} Маркировка.КонтурМаркировка


Функция ВладельцыКодовМаркировки(СсылкаНаОбъект)
	
	Если ЭтоДокументСФ(СсылкаНаОбъект) Тогда
		Результат = ДокументыОснованияСчетаФактуры(СсылкаНаОбъект);
	Иначе
		Результат = Новый Массив;
		Результат.Добавить(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоДокументСФ(СсылкаНаДокумент)
			
	Результат = 	ЭтоСФВыданный(СсылкаНаДокумент)
				ИЛИ ЭтоКСФ(СсылкаНаДокумент);
	
	Возврат Результат;
	
КонецФункции

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка - счет-фактура, основание которой нужно найти;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура) Экспорт
	
	Результат = Новый Массив;
	
	Если Не ЭтоДокументСФ(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ОбъектМетаданных = СчетФактура.Метаданные();
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Если СуществуетОбъектМетаданных(ПолноеИмяОбъекта + ".ТабличнаяЧасть.ДокументыОснования") Тогда 
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	&ПолноеИмяТаблицы КАК Т
		|ГДЕ
		|	Т.Ссылка = &СчетФактура";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяОбъекта + ".ДокументыОснования");
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			Результат.Добавить(Выборка.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ЕстьРеквизитМетаданных(ОбъектМетаданных, "ДокументОснование") Тогда 
		
		ДокументОснование = ОсновнойМодуль.ЗначениеРеквизитаОбъекта(СчетФактура, "ДокументОснование");
		Результат.Добавить(ДокументОснование);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает новую таблицу значений для штрихкодов упаковок.
// В прикладных документах должна существовать табличная часть с аналогичным набором колонок.
// См. ЭлектронноеВзаимодействиеИСМП.НоваяТаблицаШтрихкодыУпаковок()
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений штрихкодов упаковок:
//    * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкод упаковки
//    * ЗначениеШтрихкода - Строка - Значение штрихкода
//
Функция НоваяТаблицаШтрихкодыУпаковок()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ШтрихкодУпаковки");
	Результат.Колонки.Добавить("ЗначениеШтрихкода");
	
	Возврат Результат;
	
КонецФункции

// Считывает коды маркировки из строки электронного документа и
// добавляет их в общую таблицу штрихкодов.
//
// Параметры:
//  ШтрихкодыУпаковок	 - ТаблицаЗначений - таблица с кодами маркировки (см НоваяТаблицаШтрихкодыУпаковок)
//  СведенияОМаркировке	 - Структура - сведения о маркировке (см. НовыйСведенияОМаркировке)
//  GTIN				 - Строка - Глобальный идентификационный номер товарной продукции
//
Процедура ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, СведенияОМаркировке, GTIN = "")
	
	Если Не ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(GTIN)
		И ЗначениеЗаполнено(СведенияОМаркировке.КоличествоТовараВУпаковке) Тогда
		
		КоличествоТовараВУпаковке = СведенияОМаркировке.КоличествоТовараВУпаковке;

		ЗначениеШтрихкода = НовыйКодОСУ(GTIN, КоличествоТовараВУпаковке);
		
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;

	КонецЕсли;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ЗначениеШтрихкода = ЗначениеШтрихкода;
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйКодОСУ(GTIN, Количество)
	
	КоличествоСтрокой = XMLСтрока(Цел(Количество));
	
	Результат = "02" + GTIN + "37" + КоличествоСтрокой;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПолныйВозвратТовара(СтрокаТЧ)

	Результат = ЗначениеЗаполнено(СтрокаТЧ.OriginalValues.Quantity)
		И Не ЗначениеЗаполнено(СтрокаТЧ.CorrectedValues.Quantity); 
		
	Возврат Результат;

КонецФункции // ()

Функция СредиВладельцевКодовМаркировкиТолькоВозвратыОтКлиента(КоллекцияВладельцев)
	
	Результат = Истина;
	
	Для Каждого ЭлементКоллекции Из КоллекцияВладельцев Цикл
		
		ЭтоВозвратТовараОтКлиента = ЭтоВозвратТоваровОтКлиента(ЭлементКоллекции);
		
		Если НЕ ЭтоВозвратТовараОтКлиента Тогда
			
			Результат = Ложь;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВозвратТоваровОтКлиента(СсылкаНаОбъект)
	
	Возврат (НЕ Метаданные.Документы.Найти("ВозвратТоваровОтКлиента") = Неопределено
	И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента"));
	
КонецФункции

//} Маркировка

//{ Прослеживаемость

// Возвращает признак применения Федерального Закона 
// который вводит понятие прослеживаемости для определенных групп товаров
// Параметры:
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ применяется
//           Ложь   - ФЗ не применяется
Функция ИспользуетсяУчетПрослеживаемыхТоваров(Дата) Экспорт
	
	ИнтеграционныйМодуль	 = ОсновнойМодуль.Модуль_Интеграция;
	Результат				 = ИнтеграционныйМодуль.ИспользуетсяУчетПрослеживаемыхТоваров(Дата);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСведенияПрослеживаемости(Контент) Экспорт
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		Если ОсновнойМодуль.СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ПрослеживаемыйТовар", Ложь) = Истина Тогда
			
			ДанныеПрослеживаемости = ОсновнойМодуль.СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ДанныеПрослеживаемости", Новый Массив);
			
			Если ДанныеПрослеживаемости <> Неопределено Тогда
				
				Для каждого СтрокаДанныхПрослеживаемости Из ДанныеПрослеживаемости Цикл
					
					ItemTracingInfo					 = ОсновнойМодуль.Новый_ItemTracingInfo();
					
					ItemTracingInfo.Unit			 = СтрокаДанныхПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости;
					ItemTracingInfo.UnitName		 = СокрЛП(СтрокаДанныхПрослеживаемости.ЕдиницаИзмеренияПрослеживаемости);
					ItemTracingInfo.Quantity		 = СтрокаДанныхПрослеживаемости.КоличествоПоРНПТ;
					ItemTracingInfo.RegNumberUnit	 = СокрЛП(СтрокаДанныхПрослеживаемости.НомерГТДРегистрационныйНомер);
					
					Если ЗначениеЗаполнено(ItemTracingInfo.RegNumberUnit) Тогда
						СтрокаТЧ.ItemTracingInfos.Добавить(ItemTracingInfo);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(СтрокаТЧ.CustomDeclarations) Тогда
					
					Для каждого CustomDeclaration Из СтрокаТЧ.CustomDeclarations Цикл
						CustomDeclaration.DeclarationNumber = "Прослеж";
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает структуру свойств строки прослеживаемости
//
// Возвращаемое значение:
//  Структура
//
Функция НовыеСвойстваЭлементаПрослеживаемости() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодЕдиницыИзмеренияПрослеживаемости");
	Результат.Вставить("ЕдиницаИзмеренияПрослеживаемости");
	Результат.Вставить("КоличествоПоРНПТ");
	Результат.Вставить("НомерГТДРегистрационныйНомер");
	
	Возврат Результат;
	
КонецФункции

//} Прослеживаемость

Процедура ЗаполнитьОбстФормСЧФ820(Контент, СчетФактура, ФункцияУПД) Экспорт
	
	ФункцияДОП		 = ФункцияУПД = "ДОП";
	ФункцияСЧФДОП	 = ФункцияУПД = "СЧФДОП";
	
	Если (ФункцияДОП ИЛИ ФункцияСЧФДОП) Тогда 
		
		ИнтеграционныйМодуль	 = ОсновнойМодуль.Модуль_Интеграция;
		Результат				 = ИнтеграционныйМодуль.ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура);
		
		Контент.CircumFormatInvoice = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
//
// Параметры:
//	Ссылка	- ДокументСсылка, СправочникСсылка	- ссылка на объект конфигурации
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура
// 
Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты) Экспорт
	
	Результат = ОсновнойМодуль.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

//////////////////////////////////////////////////////
//функции генерации структуры для ФУФ счета-фактуры
///////////////////////////////////////////////////////

Функция СчетФактураПолученныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК Т
	|		ПО ТЧ.Ссылка = Т.Ссылка
	|			И (НЕ Т.ПометкаУдаления)
	|ГДЕ
	|	ТЧ.ДокументОснование = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции

Функция СчетФактураВыданныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Док.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК Док
		|ГДЕ
		|	Док.ДокументОснование = &ДокументОснование";
		
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
		
КонецФункции


Функция СФПоМассивуДокументовОснованийИдентичны(МассивДокументыОснования) Экспорт
	
	Запрос = Новый Запрос;
	
	Если СуществуетОбъектМетаданных("Документ.СчетФактураПолученный.ТабличнаяЧасть.ДокументыОснования") Тогда

	    Запрос.Текст =
		    "ВЫБРАТЬ Т.ДокументОснование ПОМЕСТИТЬ ВТ Из &ТаблицаДокументов КАК Т;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		    |   ИСТИНА
		    |ИЗ
		    |   ВТ КАК ВТ
		    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК ТЧ
		    |           ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК Т
		    |           ПО ТЧ.Ссылка = Т.Ссылка
		    |               И (НЕ Т.ПометкаУдаления)
		    |       ПО ВТ.ДокументОснование = ТЧ.ДокументОснование
		    |
		    |ИМЕЮЩИЕ
		    |   КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(Т.Ссылка, НЕОПРЕДЕЛЕНО)) = 1";

	Иначе

	    Запрос.Текст = 
			"ВЫБРАТЬ Т.ДокументОснование ПОМЕСТИТЬ ВТ ИЗ &ТаблицаДокументов КАК Т;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		    |   ИСТИНА
		    |ИЗ
		    |   ВТ КАК ВТ
		    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК Т
		    |       ПО ВТ.ДокументОснование = Т.ДокументОснование
		    |           И (НЕ Т.ПометкаУдаления)
		    |
		    |ИМЕЮЩИЕ
		    |   КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(Т.Ссылка, НЕОПРЕДЕЛЕНО)) = 1";

	КонецЕсли;

	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("ДокументОснование", Документы.ТипВсеСсылки());
	
	Для Каждого ДокументОснование Из МассивДокументыОснования Цикл
		НоваяСтрока = ТаблицаДокументов.Добавить(); 
		НоваяСтрока.ДокументОснование = ДокументОснование;
	КонецЦикла;
		
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);

	// Запрос возвращает Истину, если счета-фактуры или их остутствие идентичны у всех документов оснований.
	Возврат НЕ Запрос.Выполнить().Пустой();
		
КонецФункции

//{ Общие запросы типовых КФ Семейства УТ

Функция ВыражениеПустаяУпаковка()
	Возврат "ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
КонецФункции

Процедура ЗаполнитьВыражениеПустаяУпаковка(ТекстЗапроса)
	
	ПодстрокаПоиска = "&ПустаяУпаковка";
	ПодстрокаЗамены = ВыражениеПустаяУпаковка();
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		ПодстрокаПоиска,
		ПодстрокаЗамены
	);
	
КонецПроцедуры

Функция ТекстЗапросаТара() Экспорт

Результат =
"ВЫБРАТЬ
|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
|	ВЫБОР
|		КОГДА ПОДСТРОКА(РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
|			Тогда РеализацияТоваровУслугТовары.Номенклатура.Наименование
|		ИНАЧЕ РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное
|	КОНЕЦ КАК Номенклатура,
|	РеализацияТоваровУслугТовары.Номенклатура.Ссылка КАК НоменклатураСсыла,
|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК КодНоменклатуры,
|	"""" КАК Характеристика,
|	"""" КАК серия,
|	РеализацияТоваровУслугТовары.Количество КАК Количество,
|	РеализацияТоваровУслугТовары.Цена КАК Цена,
|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
|	0 КАК СуммаНДС,
|	"""" КАК НомерГТД,
|	"""" КАК СтранаПроисхождения,
|	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
|	РеализацияТоваровУслугТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
|	&ПустаяУпаковка КАК Упаковка,
|	РеализацияТоваровУслугТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	РеализацияТоваровУслугТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
|	"""" КАК ВидУпаковки,
|	"""" КАК КоличествоВОдномМесте,
|	"""" КАК КоличествоМест,
|	0 КАК Масса,
|	Ложь КАК ЭтоУслуга,
|	""Property"" как ПризнакТРУ,
|	2 КАК порядок,
|	РеализацияТоваровУслугТовары.Ссылка
|ИЗ
|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК РеализацияТоваровУслугТовары
|ГДЕ
|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";

ЗаполнитьВыражениеПустаяУпаковка(Результат);

Возврат Результат;

КонецФункции

//{ ПОЛУЧЕНИЕ ДАННЫХ

//{ ТЧПолучитьТекстЗапроса...

Функция ТЧПолучитьТекстЗапросаРеализацияТоваровУслуг(ФормированиеСФ) Экспорт
	
	Результат = "ВЫБРАТЬ
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	подзапрос.Номенклатура,
	|	подзапрос.НоменклатураСсылка,
	|	подзапрос.КодНоменклатуры,
	|	подзапрос.Характеристика,
	|	подзапрос.Серия,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.Сумма,
	|	подзапрос.СтавкаНДС,
	|	подзапрос.СуммаНДС,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.УчитыватьНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения,
	|	подзапрос.ВидУпаковки,
	|	подзапрос.КоличествоВОдномМесте,
	|	подзапрос.КоличествоМест,
	|	подзапрос.Масса,
	|	подзапрос.ЭтоУслуга,
	|	подзапрос.ПризнакТРУ,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|		&ИдентификаторСтрокиТовары КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				Тогда РеализацияТоваровУслугТовары.Номенклатура.Наименование
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		РеализацияТоваровУслугТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		РеализацияТоваровУслугТовары.Номенклатура.Код  КАК КодНоменклатуры,
	|		РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры  КАК Характеристика,
	|		РеализацияТоваровУслугТовары.СерияНоменклатуры КАК серия,
	|		РеализацияТоваровУслугТовары.Количество КАК Количество,
	|		РеализацияТоваровУслугТовары.Цена КАК Цена,
	|		РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|		РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|		РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|		РеализацияТоваровУслугТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|		%ТекстЗапросаСтранаПроисхождения% КАК СтранаПроисхождения,
	|		РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		РеализацияТоваровУслугТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК Упаковка,
	|		РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|		РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|		РеализацияТоваровУслугТовары.ЕдиницаИзмеренияМест КАК ВидУпаковки,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Коэффициент = 0
	|				Тогда 0
	|			ИНАЧЕ РеализацияТоваровУслугТовары.ЕдиницаИзмеренияМест.Коэффициент / РеализацияТоваровУслугТовары.Коэффициент
	|		КОНЕЦ КАК КоличествоВОдномМесте,
	|		РеализацияТоваровУслугТовары.КоличествоМест КАК КоличествоМест,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.КоличествоМест > 0
	|				Тогда РеализацияТоваровУслугТовары.КоличествоМест * РеализацияТоваровУслугТовары.ЕдиницаИзмеренияМест.Вес
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Количество * РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Вес
	|		КОНЕЦ КАК Масса,
	|		Ложь КАК ЭтоУслуга,
	|		""Property"" КАК ПризнакТРУ,
	|		1 КАК порядок,
	|		РеализацияТоваровУслугТовары.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|		  "+?(ФормированиеСФ, "", " ОБЪЕДИНИТЬ ВСЕ
	|  " + ТекстЗапросаТара()) + "
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугУслуги.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(РеализацияТоваровУслугУслуги.Содержание, 1, 10) = """"
	|				Тогда РеализацияТоваровУслугУслуги.Номенклатура.Наименование
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.Содержание
	|		КОНЕЦ,
	|		РеализацияТоваровУслугУслуги.Номенклатура.Ссылка,
	|		РеализацияТоваровУслугУслуги.Номенклатура.Код ,
	|		""""  КАК Характеристика,
	|		"""" КАК серия,
	|		РеализацияТоваровУслугУслуги.Количество,
	|		РеализацияТоваровУслугУслуги.Цена,
	|		РеализацияТоваровУслугУслуги.Сумма,
	|		РеализацияТоваровУслугУслуги.СтавкаНДС,
	|		РеализацияТоваровУслугУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС,
	|		РеализацияТоваровУслугУслуги.Ссылка.УчитыватьНДС,
	|		&ПустаяУпаковка КАК Упаковка,
	|		РеализацияТоваровУслугУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		РеализацияТоваровУслугУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		"""",
	|		"""",
	|		"""",
	|		0,
	|		Истина,
	|		""Service"",
	|		3,
	|		РеализацияТоваровУслугУслуги.Ссылка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|	ГДЕ
	|		РеализацияТоваровУслугУслуги.Ссылка = &Ссылка) КАК подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Если ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.РеализацияТоваровУслуг.ТабличнаяЧасть.Товары.Реквизит.ИдентификаторСтроки") Тогда
		КолонкаИдентификаторСтрокиТовары = "РеализацияТоваровУслугТовары.ИдентификаторСтроки";
	Иначе
		КолонкаИдентификаторСтрокиТовары = "НЕОПРЕДЕЛЕНО";
	КонецЕсли; 
	Результат = СтрЗаменить(Результат, "&ИдентификаторСтрокиТовары", КолонкаИдентификаторСтрокиТовары);
	
	ЕстьРеквизитТЧ_СтранаПроисхождения = ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.РеализацияТоваровУслуг.ТабличнаяЧасть.Товары.Реквизит.СтранаПроисхождения");
	Если ЕстьРеквизитТЧ_СтранаПроисхождения Тогда
		ТекстЗапросаСтранаПроисхождения = 
		"			ВЫБОР
			|			КОГДА РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения ЕСТЬ NULL
			|				Тогда РеализацияТоваровУслугТовары.СтранаПроисхождения
			|			ИНАЧЕ РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения
			|		КОНЕЦ	";
	Иначе
		ТекстЗапросаСтранаПроисхождения = "РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения";
	КонецЕсли;
	Результат = СтрЗаменить(Результат, "%ТекстЗапросаСтранаПроисхождения%", ТекстЗапросаСтранаПроисхождения);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаСчетФактураВыданный() Экспорт
	
	Результат =
	"ВЫБРАТЬ
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(СчетФактураВыданныйАвансы.Содержание, 1, 10) <> """" Тогда СчетФактураВыданныйАвансы.Содержание
	|		КОГДА СчетФактураВыданныйАвансы.Номенклатура <> Значение(Справочник.Номенклатура.ПустаяСсылка) и 
	|           ПОДСТРОКА(СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное, 1, 10) <> """"
	|			Тогда СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное
	|		КОГДА СчетФактураВыданныйАвансы.Номенклатура <> Значение(Справочник.Номенклатура.ПустаяСсылка)  
	|			Тогда СчетФактураВыданныйАвансы.Номенклатура.Наименование
	|  Иначе ""Предварительная оплата""
	|	КОНЕЦ КАК Номенклатура,
	|  СчетФактураВыданныйАвансы.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|  СчетФактураВыданныйАвансы.Номенклатура.Код КАК КодНоменклатуры,
	|	0 как Количество,
	|	0 как Цена,
	|	СчетФактураВыданныйАвансы.Сумма,
	|	СчетФактураВыданныйАвансы.СтавкаНДС,
	|	СчетФактураВыданныйАвансы.СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК Характеристика,
	|	"""" КАК Серия,
	|	0 КАК Масса,
	|	Истина КАК СуммаВключаетНДС,
	|	Истина КАК УчитыватьНДС,
	|	&ПустаяУпаковка КАК Упаковка,
	|	"""" КАК ЕдиницаИзмерения,
	|	"""" КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0  как КоличествоМест,
	|	Истина КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТРУ
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Возврат Результат;
	
КонецФункции 

Функция ТЧПолучитьТекстЗапросаСчетНаоплатуПокупателю() Экспорт 
	
	Результат =
	"ВЫБРАТЬ
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.Номенклатура,
	|	подзапрос.НоменклатураСсылка,
	|	подзапрос.КодНоменклатуры,
	|	подзапрос.Характеристика,
	|	подзапрос.серия,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.Сумма,
	|	подзапрос.СтавкаНДС,
	|	подзапрос.СуммаНДС,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.УчитыватьНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения,
	|	подзапрос.ВидУпаковки,
	|	подзапрос.КоличествоВОдномМесте,
	|	подзапрос.КоличествоМест,
	|	подзапрос.Масса,
	|	подзапрос.ЭтоУслуга,
	|	подзапрос.ПризнакТРУ,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		СчетНаоплатуТовары.НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(СчетНаоплатуТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА СчетНаоплатуТовары.Номенклатура.Наименование
	|			ИНАЧЕ СчетНаоплатуТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		СчетНаоплатуТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		СчетНаоплатуТовары.Номенклатура.Код КАК КодНоменклатуры,
	|		СчетНаоплатуТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|		"""" КАК серия,
	|		СчетНаоплатуТовары.Количество КАК Количество,
	|		СчетНаоплатуТовары.Цена КАК Цена,
	|		СчетНаоплатуТовары.Сумма КАК Сумма,
	|		СчетНаоплатуТовары.СтавкаНДС КАК СтавкаНДС,
	|		СчетНаоплатуТовары.СуммаНДС КАК СуммаНДС,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		СчетНаоплатуТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		СчетНаоплатуТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		СчетНаоплатуТовары.ЕдиницаИзмерения КАК Упаковка,
	|		СчетНаоплатуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|		СчетНаоплатуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|		СчетНаоплатуТовары.ЕдиницаИзмеренияМест КАК ВидУпаковки,
	|		ВЫБОР
	|			КОГДА СчетНаоплатуТовары.Коэффициент = 0
	|				ТОГДА 0
	|			ИНАЧЕ СчетНаоплатуТовары.ЕдиницаИзмеренияМест.Коэффициент / СчетНаоплатуТовары.Коэффициент
	|		КОНЕЦ КАК КоличествоВОдномМесте,
	|		СчетНаоплатуТовары.КоличествоМест КАК КоличествоМест,
	|		ВЫБОР
	|			КОГДА СчетНаоплатуТовары.КоличествоМест > 0
	|				ТОГДА СчетНаоплатуТовары.КоличествоМест * СчетНаоплатуТовары.ЕдиницаИзмеренияМест.Вес
	|			ИНАЧЕ СчетНаоплатуТовары.Количество * СчетНаоплатуТовары.ЕдиницаИзмерения.Вес
	|		КОНЕЦ КАК Масса,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		""Property"" КАК ПризнакТРУ,
	|		1 КАК порядок,
	|		НЕОПРЕДЕЛЕНО КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаоплатуТовары
	|	ГДЕ
	|		СчетНаоплатуТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СчетНаОплатуУслуги.НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(СчетНаОплатуУслуги.Содержание, 1, 10) = """"
	|				ТОГДА СчетНаОплатуУслуги.Номенклатура.Наименование
	|			ИНАЧЕ СчетНаОплатуУслуги.Содержание
	|		КОНЕЦ,
	|		СчетНаОплатуУслуги.Номенклатура.Ссылка,
	|		СчетНаОплатуУслуги.Номенклатура.Код,
	|		"""",
	|		"""",
	|		СчетНаОплатуУслуги.Количество,
	|		СчетНаОплатуУслуги.Цена,
	|		СчетНаОплатуУслуги.Сумма,
	|		СчетНаОплатуУслуги.СтавкаНДС,
	|		СчетНаОплатуУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		СчетНаОплатуУслуги.Ссылка.СуммаВключаетНДС,
	|		СчетНаОплатуУслуги.Ссылка.УчитыватьНДС,
	|		&ПустаяУпаковка КАК Упаковка,
	|		СчетНаОплатуУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		СчетНаОплатуУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		"""",
	|		"""",
	|		"""",
	|		"""",
	|		ИСТИНА,
	|		""Service"",
	|		2,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуУслуги
	|	ГДЕ
	|		СчетНаОплатуУслуги.Ссылка = &Ссылка) КАК подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаКорректировкаРеализации() Экспорт
	
	Результат = "ВЫБРАТЬ
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	подзапрос.Номенклатура,
	|	подзапрос.НоменклатураСсылка КАК НоменклатураСсылка,
	|	подзапрос.КодНоменклатуры КАК КодНоменклатуры,
	|	подзапрос.Характеристика КАК Характеристика,
	|	подзапрос.серия КАК серия,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.Сумма,
	|	подзапрос.СтавкаНДС,
	|	подзапрос.СуммаНДС,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.УчитыватьНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения КАК КодЕдиницыИзмерения,
	|	подзапрос.ВидУпаковки КАК ВидУпаковки,
	|	подзапрос.КоличествоВОдномМесте КАК КоличествоВОдномМесте,
	|	подзапрос.КоличествоМест КАК КоличествоМест,
	|	подзапрос.Масса КАК Масса,
	|	подзапрос.ЭтоУслуга,
	|	подзапрос.ПризнакТРУ,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|		&ИдентификаторСтрокиТовары КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		КорректировкаРеализацииТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		КорректировкаРеализацииТовары.Номенклатура.Код КАК КодНоменклатуры,
	|		КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|		КорректировкаРеализацииТовары.СерияНоменклатуры КАК серия,
	|		КорректировкаРеализацииТовары.Количество КАК Количество,
	|		КорректировкаРеализацииТовары.Цена КАК Цена,
	|		КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|		КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|		КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|		КорректировкаРеализацииТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|		%ТекстЗапросаСтранаПроисхождения% КАК СтранаПроисхождения,
	|		КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		КорректировкаРеализацииТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК Упаковка,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмеренияМест КАК ВидУпаковки,
	|		ВЫБОР
	|			КОГДА КорректировкаРеализацииТовары.Коэффициент = 0
	|				ТОГДА 0
	|			ИНАЧЕ КорректировкаРеализацииТовары.ЕдиницаИзмеренияМест.Коэффициент / КорректировкаРеализацииТовары.Коэффициент
	|		КОНЕЦ КАК КоличествоВОдномМесте,
	|		КорректировкаРеализацииТовары.КоличествоМест КАК КоличествоМест,
	|		ВЫБОР
	|			КОГДА КорректировкаРеализацииТовары.КоличествоМест > 0
	|				ТОГДА КорректировкаРеализацииТовары.КоличествоМест * КорректировкаРеализацииТовары.ЕдиницаИзмеренияМест.Вес
	|			ИНАЧЕ КорректировкаРеализацииТовары.Количество * КорректировкаРеализацииТовары.ЕдиницаИзмерения.Вес
	|		КОНЕЦ КАК Масса,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		""Property"" КАК ПризнакТРУ,
	|		1 КАК порядок,
	|		КорректировкаРеализацииТовары.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|	ГДЕ
	|		КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииУслуги.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииУслуги.Номенклатура.Код,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Количество,
	|		КорректировкаРеализацииУслуги.Цена,
	|		КорректировкаРеализацииУслуги.Сумма,
	|		КорректировкаРеализацииУслуги.СтавкаНДС,
	|		КорректировкаРеализацииУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииУслуги.Ссылка.УчитыватьНДС,
	|		&ПустаяУпаковка КАК Упаковка,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		"""",
	|		"""",
	|		"""",
	|		0,
	|		ИСТИНА,
	|		""Service"",
	|		2,
	|		КорректировкаРеализацииУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	ГДЕ
	|		КорректировкаРеализацииУслуги.Ссылка = &Ссылка) КАК подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Если ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.КорректировкаРеализации.ТабличнаяЧасть.Товары.Реквизит.ИдентификаторСтроки") Тогда
		КолонкаИдентификаторСтрокиТовары = "КорректировкаРеализацииТовары.ИдентификаторСтроки";
	Иначе
		КолонкаИдентификаторСтрокиТовары = "НЕОПРЕДЕЛЕНО";
	КонецЕсли; 
	Результат = СтрЗаменить(Результат, "&ИдентификаторСтрокиТовары", КолонкаИдентификаторСтрокиТовары);
	
	ЕстьРеквизитТЧ_СтранаПроисхождения = ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.КорректировкаРеализации.ТабличнаяЧасть.Товары.Реквизит.СтранаПроисхождения");
	Если ЕстьРеквизитТЧ_СтранаПроисхождения Тогда
		ТекстЗапросаСтранаПроисхождения = 
		"			ВЫБОР
			|			КОГДА КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения ЕСТЬ NULL
			|				Тогда КорректировкаРеализацииТовары.СтранаПроисхождения
			|			ИНАЧЕ КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения
			|		КОНЕЦ	";
	Иначе
		ТекстЗапросаСтранаПроисхождения = "КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения";
	КонецЕсли;
	Результат = СтрЗаменить(Результат, "%ТекстЗапросаСтранаПроисхождения%", ТекстЗапросаСтранаПроисхождения);
	
	Возврат Результат;
	
КонецФункции 

Функция ТЧПолучитьТекстЗапросаИКСФ() Экспорт
	
	Результат = "ВЫБРАТЬ
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	подзапрос.Номенклатура,
	|	подзапрос.НоменклатураСсылка,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.Сумма,
	|	подзапрос.СтавкаНДС,
	|	подзапрос.СуммаНДС,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.УчитыватьНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения,
	|	подзапрос.ЭтоУслуга,
	|	подзапрос.ПризнакТРУ,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.КоличествоДоИзменения,
	|	подзапрос.ЦенаДоИзменения,
	|	подзапрос.СуммаДоИзменения,
	|	подзапрос.СтавкаНДСДоИзменения,
	|	подзапрос.СуммаНДСДоИзменения,
	|	подзапрос.НомерГТДДоИзменения,
	|	подзапрос.СтранаПроисхожденияДоИзменения,
	|	подзапрос.УпаковкаДоИзменения,
	|	подзапрос.ЕдиницаИзмеренияДоИзменения,
	|	подзапрос.КодЕдиницыИзмеренияДоИзменения,
	|	подзапрос.Характеристика,
	|	подзапрос.Серия,
	|	подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|		&ИдентификаторСтрокиТовары КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		КорректировкаРеализацииТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		КорректировкаРеализацииТовары.Количество КАК Количество,
	|		КорректировкаРеализацииТовары.Цена КАК Цена,
	|		КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|		КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|		КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|		КорректировкаРеализацииТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|		КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|		КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		КорректировкаРеализацииТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК Упаковка,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК УпаковкаДоИзменения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияДоИзменения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмеренияДоИзменения,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		""Property"" КАК ПризнакТРУ,
	|		1 КАК порядок,
	|		КорректировкаРеализацииТовары.КоличествоДоКорректировки КАК КоличествоДоИзменения,
	|		КорректировкаРеализацииТовары.ЦенаДоКорректировки КАК ЦенаДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаДоКорректировки КАК СуммаДоИзменения,
	|		КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаНДСДоКорректировки КАК СуммаНДСДоИзменения,
	|		NULL КАК СтранаПроисхожденияДоИзменения,
	|		NULL КАК НомерГТДДоИзменения,
	|		КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|		КорректировкаРеализацииТовары.СерияНоменклатуры КАК Серия,
	|		КорректировкаРеализацииТовары.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|	ГДЕ
	|		КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииУслуги.НомерСтроки,
	|		Неопределено КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииУслуги.Количество,
	|		КорректировкаРеализацииУслуги.Цена,
	|		КорректировкаРеализацииУслуги.Сумма,
	|		КорректировкаРеализацииУслуги.СтавкаНДС,
	|		КорректировкаРеализацииУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииУслуги.Ссылка.УчитыватьНДС,
	|		&ПустаяУпаковка КАК Упаковка,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		&ПустаяУпаковка КАК УпаковкаДоИзменения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		""Service"",
	|		2,
	|		КорректировкаРеализацииУслуги.КоличествоДоКорректировки,
	|		КорректировкаРеализацииУслуги.ЦенаДоКорректировки,
	|		КорректировкаРеализацииУслуги.СуммаДоКорректировки,
	|		КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииУслуги.СуммаНДСДоКорректировки,
	|		NULL,
	|		NULL,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	ГДЕ
	|		КорректировкаРеализацииУслуги.Ссылка = &Ссылка) КАК подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Если ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.КорректировкаРеализации.ТабличнаяЧасть.Товары.Реквизит.ИдентификаторСтроки") Тогда
		КолонкаИдентификаторСтрокиТовары = "КорректировкаРеализацииТовары.ИдентификаторСтроки";
	Иначе
		КолонкаИдентификаторСтрокиТовары = "НЕОПРЕДЕЛЕНО";
	КонецЕсли; 
	Результат = СтрЗаменить(Результат, "&ИдентификаторСтрокиТовары", КолонкаИдентификаторСтрокиТовары);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаКСФ() Экспорт
	
	Результат = "ВЫБРАТЬ
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	подзапрос.Номенклатура,
	|	подзапрос.НоменклатураСсылка,
	|	подзапрос.КодНоменклатуры,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.Сумма,
	|	подзапрос.СтавкаНДС,
	|	подзапрос.СуммаНДС,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.УчитыватьНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения,
	|	подзапрос.ЭтоУслуга,
	|	подзапрос.ПризнакТРУ,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.КоличествоДоИзменения,
	|	подзапрос.ЦенаДоИзменения,
	|	подзапрос.СуммаДоИзменения,
	|	подзапрос.СтавкаНДСДоИзменения,
	|	подзапрос.СуммаНДСДоИзменения,
	|	подзапрос.НомерГТДДоИзменения,
	|	подзапрос.СтранаПроисхожденияДоИзменения,
	|	подзапрос.УпаковкаДоИзменения,
	|	подзапрос.ЕдиницаИзмеренияДоИзменения,
	|	подзапрос.КодЕдиницыИзмеренияДоИзменения,
	|	подзапрос.Характеристика,
	|	подзапрос.Серия,
	|	подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|		&ИдентификаторСтрокиТовары КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		КорректировкаРеализацииТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		КорректировкаРеализацииТовары.Номенклатура.Код КАК КодНоменклатуры,
	|		КорректировкаРеализацииТовары.Количество КАК Количество,
	|		КорректировкаРеализацииТовары.Цена КАК Цена,
	|		КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|		КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|		КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|		КорректировкаРеализацииТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|		%ТекстЗапросаСтранаПроисхождения% КАК СтранаПроисхождения,
	|		КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		КорректировкаРеализацииТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК Упаковка,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК УпаковкаДоИзменения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияДоИзменения,
	|		КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмеренияДоИзменения,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		""Property"" КАК ПризнакТРУ,
	|		1 КАК порядок,
	|		КорректировкаРеализацииТовары.КоличествоДоИзменения КАК КоличествоДоИзменения,
	|		КорректировкаРеализацииТовары.ЦенаДоИзменения КАК ЦенаДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаДоИзменения КАК СуммаДоИзменения,
	|		КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
	|		NULL КАК СтранаПроисхожденияДоИзменения,
	|		NULL КАК НомерГТДДоИзменения,
	|		КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|		КорректировкаРеализацииТовары.СерияНоменклатуры КАК Серия,
	|		КорректировкаРеализацииТовары.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|	ГДЕ
	|		КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииУслуги.НомерСтроки,
	|		Неопределено КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииУслуги.Номенклатура.Код,
	|		КорректировкаРеализацииУслуги.Количество,
	|		КорректировкаРеализацииУслуги.Цена,
	|		КорректировкаРеализацииУслуги.Сумма,
	|		КорректировкаРеализацииУслуги.СтавкаНДС,
	|		КорректировкаРеализацииУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииУслуги.Ссылка.УчитыватьНДС,
	|		&ПустаяУпаковка КАК Упаковка,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		&ПустаяУпаковка КАК УпаковкаДоИзменения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		""Service"",
	|		2,
	|		КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|		КорректировкаРеализацииУслуги.ЦенаДоИзменения,
	|		КорректировкаРеализацииУслуги.СуммаДоИзменения,
	|		КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	|		NULL,
	|		NULL,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	ГДЕ
	|		КорректировкаРеализацииУслуги.Ссылка = &Ссылка) КАК подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Если ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.КорректировкаРеализации.ТабличнаяЧасть.Товары.Реквизит.ИдентификаторСтроки") Тогда
		КолонкаИдентификаторСтрокиТовары = "КорректировкаРеализацииТовары.ИдентификаторСтроки";
	Иначе
		КолонкаИдентификаторСтрокиТовары = "НЕОПРЕДЕЛЕНО";
	КонецЕсли; 
	Результат = СтрЗаменить(Результат, "&ИдентификаторСтрокиТовары", КолонкаИдентификаторСтрокиТовары);
	
	ЕстьРеквизитТЧ_СтранаПроисхождения = ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.КорректировкаРеализации.ТабличнаяЧасть.Товары.Реквизит.СтранаПроисхождения");
	Если ЕстьРеквизитТЧ_СтранаПроисхождения Тогда
		ТекстЗапросаСтранаПроисхождения = 
		"			ВЫБОР
			|			КОГДА КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения ЕСТЬ NULL
			|				Тогда КорректировкаРеализацииТовары.СтранаПроисхождения
			|			ИНАЧЕ КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения
			|		КОНЕЦ	";
	Иначе
		ТекстЗапросаСтранаПроисхождения = "КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения";
	КонецЕсли;
	Результат = СтрЗаменить(Результат, "%ТекстЗапросаСтранаПроисхождения%", ТекстЗапросаСтранаПроисхождения);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаАктОбОказанииПроизводственныхУслуг() Экспорт
	
	Результат = "ВЫБРАТЬ
	               |	АктОбОказанииПроизводственныхУслугУслуги.НомерСтроки КАК НомерСтроки,
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(АктОбОказанииПроизводственныхУслугУслуги.Содержание, 1, 10) = """"
	               |			ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.Наименование
	               |		ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Содержание
	               |	КОНЕЦ КАК Номенклатура,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.Ссылка КАК НоменклатураСсылка,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.Код КАК КодНоменклатуры,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Количество,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Цена,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Сумма,
	               |	АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	               |	АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Ссылка.УчитыватьНДС,
	               |	"""" КАК НомерГТД,
	               |	"""" КАК СтранаПроисхождения,
				   |	&Упаковка КАК Упаковка,
	               |	&ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	&ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	               |	"""" КАК ВидУпаковки,
	               |	"""" КАК КоличествоВОдномМесте,
	               |	"""" КАК КоличествоМест,
	               |	0 КАК Масса,
	               |	"""" КАК Характеристика,
	               |	"""" КАК Серия,
	               |	ИСТИНА КАК ЭтоУслуга,
	               |	""Service"" КАК ПризнакТРУ,
	               |	АктОбОказанииПроизводственныхУслугУслуги.Ссылка КАК ДокументОтгрузки
	               |ИЗ
	               |	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	               |ГДЕ
	               |	АктОбОказанииПроизводственныхУслугУслуги.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Если ОсновнойМодуль.СуществуетОбъектМетаданных("Документ.АктОбОказанииПроизводственныхУслуг.ТабличнаяЧасть.Услуги.Реквизит.ЕдиницаИзмерения") Тогда 
		ВыражениеЕдиницаИзмерения = "АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения.ЕдиницаПоКлассификатору";
		ВыражениеУпаковка = "АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения";
	Иначе
		ВыражениеЕдиницаИзмерения = "АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.БазоваяЕдиницаИзмерения";
		ВыражениеУпаковка = ВыражениеПустаяУпаковка();
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмерения", ВыражениеЕдиницаИзмерения);
	Результат = СтрЗаменить(Результат, "&Упаковка", ВыражениеУпаковка);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтчетКомиссионераОПродажах() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	ВложенныйЗапрос.НомерСтроки,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НоменклатураСсылка,
	|	ВложенныйЗапрос.КодНоменклатуры,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.НомерГТД,
	|	ВложенныйЗапрос.СтранаПроисхождения,
	|	ВложенныйЗапрос.СуммаВключаетНДС,
	|	ВложенныйЗапрос.УчитыватьНДС,
	|	ВложенныйЗапрос.Упаковка,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.КодЕдиницыИзмерения,
	|	ВложенныйЗапрос.ВидУпаковки,
	|	ВложенныйЗапрос.КоличествоВОдномМесте,
	|	ВложенныйЗапрос.КоличествоМест,
	|	ВложенныйЗапрос.Масса,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия,
	|	ВложенныйЗапрос.ЭтоУслуга,
	|	""Property"" КАК ПризнакТРУ,
	|	ВложенныйЗапрос.Порядок,
	|	ВложенныйЗапрос.СуммаНДС,
	|	ВложенныйЗапрос.ДокументОтгрузки
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтчетКомиссионераОПродажахТовары.НомерСтроки КАК НомерСтроки,
	|			ВЫБОР
	|				КОГДА ПОДСТРОКА(ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|					ТОГДА ОтчетКомиссионераОПродажахТовары.Номенклатура.Наименование
	|				ИНАЧЕ ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное
	|			КОНЕЦ КАК Номенклатура,
	|			ОтчетКомиссионераОПродажахТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|			ОтчетКомиссионераОПродажахТовары.Номенклатура.Код КАК КодНоменклатуры,
	|			ОтчетКомиссионераОПродажахТовары.Количество КАК Количество,
	|			ОтчетКомиссионераОПродажахТовары.Цена КАК Цена,
	|			ОтчетКомиссионераОПродажахТовары.Сумма КАК Сумма,
	|			ОтчетКомиссионераОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|			ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|			ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|			ОтчетКомиссионераОПродажахТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|			ОтчетКомиссионераОПродажахТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|			ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения КАК Упаковка,
	|			ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|			ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|			"""" КАК ВидУпаковки,
	|			"""" КАК КоличествоВОдномМесте,
	|			"""" КАК КоличествоМест,
	|			0 КАК Масса,
	|			"""" КАК Характеристика,
	|			"""" КАК Серия,
	|			ЛОЖЬ КАК ЭтоУслуга,
	|			1 КАК Порядок,
	|			ОтчетКомиссионераОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|			ОтчетКомиссионераОПродажахТовары.КлючСтроки КАК КлючСтроки,
	|			ОтчетКомиссионераОПродажахТовары.Ссылка КАК ДокументОтгрузки
	|		ИЗ
	|			Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|		ГДЕ
	|			ОтчетКомиссионераОПродажахТовары.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|		ПО ОтчетКомиссионераОПродажахПокупатели.КлючСтроки = ВложенныйЗапрос.КлючСтроки
	|ГДЕ
	|	ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура";
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтчетКомитентуОПродажах() Экспорт
	
	Результат =
	"ВЫБРАТЬ
	|	подзапрос.Сумма,
	|	подзапрос.СуммаНДС,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	"""" КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	0 КАК Масса,
	|	"""" КАК Характеристика,
	|	"""" КАК Серия,
	|	подзапрос.ЭтоУслуга,
	|	""Service"" КАК ПризнакТРУ,
	|	ВЫБОР
	|		КОГДА подзапрос.Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА ""Комиссионное вознаграждение""
	|		КОГДА ПОДСТРОКА(подзапрос.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА подзапрос.Номенклатура.Наименование
	|		ИНАЧЕ подзапрос.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	подзапрос.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	подзапрос.Номенклатура.Код КАК КодНоменклатуры,
	|	подзапрос.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	подзапрос.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК Сумма,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению КАК Номенклатура,
	|		ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|		0 КАК Количество,
	|		0 КАК Цена,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		ИСТИНА КАК СуммаВключаетНДС,
	|		&ПустаяУпаковка КАК Упаковка,
	|		"""" КАК ЕдиницаИзмерения,
	|		ИСТИНА КАК ЭтоУслуга
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомитентуОПродажахТовары.Ссылка,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению) КАК подзапрос";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаВозвратТоваровПоставщику() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.Наименование
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	ВозвратТоваровПоставщикуТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры КАК Серия,
	|	ВозвратТоваровПоставщикуТовары.Количество,
	|	ВозвратТоваровПоставщикуТовары.Цена,
	|	ВозвратТоваровПоставщикуТовары.Сумма,
	|	ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуТовары.СуммаНДС КАК суммаНДС,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения КАК Упаковка,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмеренияМест КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Коэффициент = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.ЕдиницаИзмеренияМест.Коэффициент / ВозвратТоваровПоставщикуТовары.Коэффициент
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|	ВозвратТоваровПоставщикуТовары.КоличествоМест КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.КоличествоМест > 0
	|			ТОГДА ВозвратТоваровПоставщикуТовары.КоличествоМест * ВозвратТоваровПоставщикуТовары.ЕдиницаИзмеренияМест.Вес
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Количество * ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.Вес
	|	КОНЕЦ КАК Масса,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	""Property"" КАК ПризнакТРУ,
	|	ВозвратТоваровПоставщикуТовары.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтражениеРеализацииТоваровИУслугНДС() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	ОтражениеРеализацииТоваровИУслугНДС.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ОтражениеРеализацииТоваровИУслугНДС.Номенклатура ССЫЛКА Справочник.ОбъектыСтроительства
	|			ТОГДА ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.Наименование
	|		КОГДА ПОДСТРОКА(ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.Наименование
	|		ИНАЧЕ ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.Код КАК КодНоменклатуры,
	|	ОтражениеРеализацииТоваровИУслугНДС.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ОтражениеРеализацииТоваровИУслугНДС.СерияНоменклатуры КАК Серия,
	|	ОтражениеРеализацииТоваровИУслугНДС.Количество,
	|	ОтражениеРеализацииТоваровИУслугНДС.Цена,
	|	ОтражениеРеализацииТоваровИУслугНДС.Сумма,
	|	ОтражениеРеализацииТоваровИУслугНДС.СтавкаНДС,
	|	ОтражениеРеализацииТоваровИУслугНДС.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	ОтражениеРеализацииТоваровИУслугНДС.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ОтражениеРеализацииТоваровИУслугНДС.СуммаНДС КАК суммаНДС,
	|	ОтражениеРеализацииТоваровИУслугНДС.ЕдиницаИзмерения КАК Упаковка,
	|	ОтражениеРеализацииТоваровИУслугНДС.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|	ОтражениеРеализацииТоваровИУслугНДС.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	0 КАК Масса,
	|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ИСТИНА КАК УчитыватьНДС,
	|	ВЫБОР
	|		КОГДА ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	ВЫБОР
	|		КОГДА ОтражениеРеализацииТоваровИУслугНДС.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ""Service""
	|		ИНАЧЕ ""Property""
	|	КОНЕЦ КАК ПризнакТРУ,
	|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ОтражениеРеализацииТоваровИУслугНДС.ТоварыИУслуги КАК ОтражениеРеализацииТоваровИУслугНДС
	|ГДЕ
	|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаРеализацияУслугПопереработке() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.Номенклатура,
	|	подзапрос.КодНоменклатуры,
	|	подзапрос.НоменклатураСсылка,
	|	подзапрос.Характеристика,
	|	подзапрос.Серия,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.Сумма,
	|	подзапрос.СтавкаНДС,
	|	подзапрос.СуммаНДС,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.УчитыватьНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения,
	|	подзапрос.ВидУпаковки,
	|	подзапрос.КоличествоВОдномМесте,
	|	подзапрос.КоличествоМест,
	|	подзапрос.Масса,
	|	подзапрос.ЭтоУслуга,
	|	подзапрос.ПризнакТРУ,
	|	подзапрос.Порядок КАК Порядок,
	|	подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияУслугПоПереработкеУслуги.НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(РеализацияУслугПоПереработкеУслуги.Содержание, 1, 10) = """"
	|				ТОГДА РеализацияУслугПоПереработкеУслуги.Номенклатура.Наименование
	|			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Содержание
	|		КОНЕЦ КАК Номенклатура,
	|		РеализацияУслугПоПереработкеУслуги.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		РеализацияУслугПоПереработкеУслуги.Номенклатура.Код КАК КодНоменклатуры,
	|		"""" КАК Характеристика,
	|		"""" КАК Серия,
	|		РеализацияУслугПоПереработкеУслуги.Количество КАК Количество,
	|		РеализацияУслугПоПереработкеУслуги.Цена КАК Цена,
	|		РеализацияУслугПоПереработкеУслуги.Сумма КАК Сумма,
	|		РеализацияУслугПоПереработкеУслуги.СтавкаНДС КАК СтавкаНДС,
	|		РеализацияУслугПоПереработкеУслуги.СуммаНДС КАК СуммаНДС,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		РеализацияУслугПоПереработкеУслуги.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		РеализацияУслугПоПереработкеУслуги.Номенклатура КАК Упаковка,
	|		РеализацияУслугПоПереработкеУслуги.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		РеализацияУслугПоПереработкеУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|		"""" КАК ВидУпаковки,
	|		"""" КАК КоличествоВОдномМесте,
	|		"""" КАК КоличествоМест,
	|		0 КАК Масса,
	|		ИСТИНА КАК ЭтоУслуга,
	|		""Job"" КАК ПризнакТРУ,
	|		2 КАК Порядок,
	|		РеализацияУслугПоПереработкеУслуги.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	|	ГДЕ
	|		РеализацияУслугПоПереработкеУслуги.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияУслугПоПереработкеПродукция.НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(РеализацияУслугПоПереработкеПродукция.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА РеализацияУслугПоПереработкеПродукция.Номенклатура.Наименование
	|			ИНАЧЕ РеализацияУслугПоПереработкеПродукция.Номенклатура.НаименованиеПолное
	|		КОНЕЦ,
	|		РеализацияУслугПоПереработкеПродукция.Номенклатура.Ссылка,
	|		РеализацияУслугПоПереработкеПродукция.Номенклатура.Код,
	|		РеализацияУслугПоПереработкеПродукция.ХарактеристикаНоменклатуры,
	|		РеализацияУслугПоПереработкеПродукция.СерияНоменклатуры,
	|		РеализацияУслугПоПереработкеПродукция.Количество,
	|		РеализацияУслугПоПереработкеПродукция.Цена,
	|		РеализацияУслугПоПереработкеПродукция.Сумма,
	|		РеализацияУслугПоПереработкеПродукция.СтавкаНДС,
	|		РеализацияУслугПоПереработкеПродукция.СуммаНДС,
	|		РеализацияУслугПоПереработкеПродукция.СерияНоменклатуры.НомерГТД,
	|		РеализацияУслугПоПереработкеПродукция.СерияНоменклатуры.СтранаПроисхождения,
	|		РеализацияУслугПоПереработкеПродукция.Ссылка.СуммаВключаетНДС,
	|		РеализацияУслугПоПереработкеПродукция.Ссылка.УчитыватьНДС,
	|		РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмерения,
	|		РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	|		РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код,
	|		РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмеренияМест,
	|		ВЫБОР
	|			КОГДА РеализацияУслугПоПереработкеПродукция.Коэффициент = 0
	|				ТОГДА 0
	|			ИНАЧЕ РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмеренияМест.Коэффициент / РеализацияУслугПоПереработкеПродукция.Коэффициент
	|		КОНЕЦ,
	|		РеализацияУслугПоПереработкеПродукция.КоличествоМест,
	|		ВЫБОР
	|			КОГДА РеализацияУслугПоПереработкеПродукция.КоличествоМест > 0
	|				ТОГДА РеализацияУслугПоПереработкеПродукция.КоличествоМест * РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмеренияМест.Вес
	|			ИНАЧЕ РеализацияУслугПоПереработкеПродукция.Количество * РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмерения.Вес
	|		КОНЕЦ,
	|		ИСТИНА,
	|		""Property"",
	|		1,
	|		РеализацияУслугПоПереработкеПродукция.Ссылка
	|	ИЗ
	|		Документ.РеализацияУслугПоПереработке.Продукция КАК РеализацияУслугПоПереработкеПродукция
	|	ГДЕ
	|		РеализацияУслугПоПереработкеПродукция.Ссылка = &Ссылка) КАК подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаПередачаОС() Экспорт
	
	Результат =
	"ВЫБРАТЬ
	|	ПередачаОС.НомерСтроки КАК НомерСтроки,
	|	ПередачаОС.ОсновноеСредство.Наименование КАК Номенклатура,
	|	ПередачаОС.ОсновноеСредство.Код КАК КодНоменклатуры,
	|	"""" КАК Характеристика,
	|	"""" КАК Серия,
	|	1 КАК Количество,
	|	0 КАК цена,
	|	ПередачаОС.Сумма,
	|	ПередачаОС.СтавкаНДС,
	|	ПередачаОС.СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	ПередачаОС.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПередачаОС.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	&ПустаяУпаковка КАК Упаковка,
	|	"""" КАК ЕдиницаИзмерения,
	|	"""" КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК Масса,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	""Property"" КАК ПризнакТРУ,
	|	ПередачаОС.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ПередачаОС
	|ГДЕ
	|	ПередачаОС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаЗаказПокупателя() Экспорт
	
	Результат =
	"ВЫБРАТЬ
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.Номенклатура,
	|	подзапрос.НоменклатураСсылка,
	|	подзапрос.КодНоменклатуры,
	|	подзапрос.Характеристика,
	|	подзапрос.серия,
	|	подзапрос.Количество,
	|	подзапрос.Цена,
	|	подзапрос.Сумма,
	|	подзапрос.СтавкаНДС,
	|	подзапрос.СуммаНДС,
	|	подзапрос.НомерГТД,
	|	подзапрос.СтранаПроисхождения,
	|	подзапрос.СуммаВключаетНДС,
	|	подзапрос.УчитыватьНДС,
	|	подзапрос.Упаковка,
	|	подзапрос.ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения,
	|	подзапрос.ВидУпаковки,
	|	подзапрос.КоличествоВОдномМесте,
	|	подзапрос.КоличествоМест,
	|	подзапрос.Масса,
	|	подзапрос.ЭтоУслуга,
	|	подзапрос.ПризнакТРУ,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(ЗаказПокупателяТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА ЗаказПокупателяТовары.Номенклатура.Наименование
	|			ИНАЧЕ ЗаказПокупателяТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		ЗаказПокупателяТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		ЗаказПокупателяТовары.Номенклатура.Код КАК КодНоменклатуры,
	|		ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|		"""" КАК серия,
	|		ЗаказПокупателяТовары.Количество КАК Количество,
	|		ЗаказПокупателяТовары.Цена КАК Цена,
	|		ЗаказПокупателяТовары.Сумма КАК Сумма,
	|		ЗаказПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	|		ЗаказПокупателяТовары.СуммаНДС КАК СуммаНДС,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		ЗаказПокупателяТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		ЗаказПокупателяТовары.ЕдиницаИзмерения КАК Упаковка,
	|		ЗаказПокупателяТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	|		ЗаказПокупателяТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|		ЗаказПокупателяТовары.ЕдиницаИзмеренияМест КАК ВидУпаковки,
	|		ВЫБОР
	|			КОГДА ЗаказПокупателяТовары.Коэффициент = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Коэффициент / ЗаказПокупателяТовары.Коэффициент
	|		КОНЕЦ КАК КоличествоВОдномМесте,
	|		ЗаказПокупателяТовары.КоличествоМест КАК КоличествоМест,
	|		ВЫБОР
	|			КОГДА ЗаказПокупателяТовары.КоличествоМест > 0
	|				ТОГДА ЗаказПокупателяТовары.КоличествоМест * ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Вес
	|			ИНАЧЕ ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.ЕдиницаИзмерения.Вес
	|		КОНЕЦ КАК Масса,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		""Property"" КАК ПризнакТРУ,
	|		1 КАК порядок,
	|		НЕОПРЕДЕЛЕНО КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|	ГДЕ
	|		ЗаказПокупателяТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказПокупателяУслуги.НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(ЗаказПокупателяУслуги.Содержание, 1, 10) = """"
	|				ТОГДА ЗаказПокупателяУслуги.Номенклатура.Наименование
	|			ИНАЧЕ ЗаказПокупателяУслуги.Содержание
	|		КОНЕЦ,
	|		ЗаказПокупателяУслуги.Номенклатура.Ссылка,
	|		ЗаказПокупателяУслуги.Номенклатура.Код,
	|		"""",
	|		"""",
	|		ЗаказПокупателяУслуги.Количество,
	|		ЗаказПокупателяУслуги.Цена,
	|		ЗаказПокупателяУслуги.Сумма,
	|		ЗаказПокупателяУслуги.СтавкаНДС,
	|		ЗаказПокупателяУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		ЗаказПокупателяУслуги.Ссылка.СуммаВключаетНДС,
	|		ЗаказПокупателяУслуги.Ссылка.УчитыватьНДС,
	|		&ПустаяУпаковка КАК Упаковка,
	|		ЗаказПокупателяУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		ЗаказПокупателяУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		"""",
	|		"""",
	|		"""",
	|		0,
	|		ИСТИНА,
	|		""Service"",
	|		2,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.ЗаказПокупателя.Услуги КАК ЗаказПокупателяУслуги
	|	ГДЕ
	|		ЗаказПокупателяУслуги.Ссылка = &Ссылка) КАК подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	ЗаполнитьВыражениеПустаяУпаковка(Результат);
	
	Возврат Результат;
	
КонецФункции

//} ТЧПолучитьТекстЗапроса...

//{ ПолучитьДанныеШапки...

Функция ШапкаПолучитьТекстЗапросаСФ()  Экспорт 
	Возврат 			"ВЫБРАТЬ
	|	СчетФактураВыданный.Организация,
	|	"""" как Грузоотправитель,
	|	СчетФактураВыданный.Контрагент,
	|	"""" КАК Грузополучатель,
	|	"""" как АдресДоставки,
	|	СчетФактураВыданный.ВалютаДокумента,
	|	Истина как СуммаВключаетНДС,
	|	Истина КАК УчитыватьНДС,
	|	СчетФактураВыданный.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &СчетФактура"; 
КонецФункции	

Функция ШапкаПолучитьТекстЗапросаОсновной() Экспорт 
	ТекстЗапроса = 			"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
	|			Тогда ""он же""
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
	|			Тогда РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтражениеРеализацииТоваровИУслугНДС.Организация,
	|	ВЫБОР
	|		КОГДА ОтражениеРеализацииТоваровИУслугНДС.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
	|			Тогда ""он же""
	|		ИНАЧЕ ОтражениеРеализацииТоваровИУслугНДС.Грузоотправитель
	|	КОНЕЦ,
	|	ОтражениеРеализацииТоваровИУслугНДС.Контрагент,
	|	ВЫБОР
	|		КОГДА ОтражениеРеализацииТоваровИУслугНДС.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
	|			Тогда ОтражениеРеализацииТоваровИУслугНДС.Контрагент
	|		ИНАЧЕ ОтражениеРеализацииТоваровИУслугНДС.Грузополучатель
	|	КОНЕЦ,
	|	NULL,
	|	ОтражениеРеализацииТоваровИУслугНДС.ВалютаДокумента,
	|	ОтражениеРеализацииТоваровИУслугНДС.СуммаВключаетНДС,
	|	ИСТИНА,
	|	ОтражениеРеализацииТоваровИУслугНДС.ДоговорКонтрагента
	|ИЗ
	|	Документ.ОтражениеРеализацииТоваровИУслугНДС КАК ОтражениеРеализацииТоваровИУслугНДС
	|ГДЕ
	|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщику.Организация,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
	|			Тогда ""он же""
	|		ИНАЧЕ ВозвратТоваровПоставщику.Грузоотправитель
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщику.Контрагент,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
	|			Тогда ВозвратТоваровПоставщику.Контрагент
	|		ИНАЧЕ ВозвратТоваровПоставщику.Грузополучатель
	|	КОНЕЦ,
	|	NULL,
	|	ВозвратТоваровПоставщику.ВалютаДокумента,
	|	ВозвратТоваровПоставщику.СуммаВключаетНДС,
	|	ВозвратТоваровПоставщику.УчитыватьНДС,
	|	ВозвратТоваровПоставщику.ДоговорКонтрагента
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслуг.Организация,
	|	"""",
	|	АктОбОказанииПроизводственныхУслуг.Контрагент,
	|	"""",
	|	"""",
	|	АктОбОказанииПроизводственныхУслуг.ВалютаДокумента,
	|	АктОбОказанииПроизводственныхУслуг.СуммаВключаетНДС,
	|	АктОбОказанииПроизводственныхУслуг.УчитыватьНДС,
	|	АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслуг.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Организация,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОПродажах.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
	|			Тогда ""он же""
	|		ИНАЧЕ ОтчетКомиссионераОПродажах.Грузоотправитель
	|	КОНЕЦ,
	|	ВложенныйЗапрос.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОПродажах.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
	|			Тогда ВЫБОР
	|					КОГДА ВложенныйЗапрос.Ссылка.Контрагент = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
	|						Тогда ОтчетКомиссионераОПродажах.Контрагент
	|					ИНАЧЕ ВложенныйЗапрос.Ссылка.Контрагент
	|				КОНЕЦ
	|		ИНАЧЕ ОтчетКомиссионераОПродажах.Грузополучатель
	|	КОНЕЦ,
	|	"""",
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС,
	|	ОтчетКомиссионераОПродажах.УчитыватьНДС,
	|	ВложенныйЗапрос.Ссылка.ДоговорКонтрагента
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах,
	|	(ВЫБРАТЬ
	|		СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
	|		СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
	|	ИЗ
	|		Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|	ГДЕ
	|		СчетФактураВыданныйДокументыОснования.Ссылка = &СчетФактура) КАК ВложенныйЗапрос
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Организация,
	|	"""",
	|	ОтчетКомитентуОПродажах.Контрагент,
	|	"""",
	|	"""",
	|	ОтчетКомитентуОПродажах.ВалютаДокумента,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслугПоПереработке.Организация,
	|	"""",
	|	РеализацияУслугПоПереработке.Контрагент,
	|	"""",
	|	"""",
	|	РеализацияУслугПоПереработке.ВалютаДокумента,
	|	РеализацияУслугПоПереработке.СуммаВключаетНДС,
	|	РеализацияУслугПоПереработке.УчитыватьНДС,
	|	РеализацияУслугПоПереработке.ДоговорКонтрагента
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаОС.Организация,
	|	ВЫБОР
	|		КОГДА ПередачаОС.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
	|			Тогда ""он же""
	|		ИНАЧЕ ПередачаОС.Грузоотправитель
	|	КОНЕЦ,
	|	ПередачаОС.Контрагент,
	|	ВЫБОР
	|		КОГДА ПередачаОС.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
	|			Тогда ПередачаОС.Контрагент
	|		ИНАЧЕ ПередачаОС.Грузополучатель
	|	КОНЕЦ,
	|	"""",
	|	ПередачаОС.ВалютаДокумента,
	|	ПередачаОС.СуммаВключаетНДС,
	|	ПередачаОС.УчитыватьНДС,
	|	ПередачаОС.ДоговорКонтрагента
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|ГДЕ
	|	ПередачаОС.Ссылка = &ДокументСсылка";
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено Тогда 
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ  
		|" + "ВЫБРАТЬ
		|	КорректировкаРеализации.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА КорректировкаРеализации.Грузоотправитель = ЗНАЧЕНИЕ(справочник.контрагенты.ПустаяСсылка)
		|			Тогда ""он же""
		|		ИНАЧЕ КорректировкаРеализации.Грузоотправитель
		|	КОНЕЦ КАК Грузоотправитель,
		|	КорректировкаРеализации.Контрагент,
		|	ВЫБОР
		|		КОГДА КорректировкаРеализации.Грузополучатель = ЗНАЧЕНИЕ(справочник.контрагенты.пустаяСсылка)
		|			Тогда КорректировкаРеализации.Контрагент
		|		ИНАЧЕ КорректировкаРеализации.Грузополучатель
		|	КОНЕЦ КАК Грузополучатель,
		|	КорректировкаРеализации.АдресДоставки КАК АдресДоставки,
		|	КорректировкаРеализации.ВалютаДокумента КАК ВалютаДокумента,
		|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	КорректировкаРеализации.УчитыватьНДС КАК УчитыватьНДС,
		|	КорректировкаРеализации.ДоговорКонтрагента
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|ГДЕ
		|	КорректировкаРеализации.Ссылка = &ДокументСсылка";
		
	КонецЕсли;		
	
	Если Метаданные.Документы.Найти("СчетНаОплатуПокупателю") <> Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетНаОплату.Организация,
		|	"""",
		|	СчетНаОплату.Контрагент,
		|	"""",
		|	"""",
		|	СчетНаОплату.ВалютаДокумента,
		|	СчетНаОплату.СуммаВключаетНДС,
		|	СчетНаОплату.УчитыватьНДС,
		|	СчетНаОплату.ДоговорКонтрагента
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.Ссылка = &ДокументСсылка";
		
	КонецЕсли;
	
	Если Метаданные.Документы.Найти("ЗаказПокупателя") <> Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Организация,
		|	"""",
		|	ЗаказПокупателя.Контрагент,
		|	"""",
		|	"""",
		|	ЗаказПокупателя.ВалютаДокумента,
		|	ЗаказПокупателя.СуммаВключаетНДС,
		|	ЗаказПокупателя.УчитыватьНДС,
		|	ЗаказПокупателя.ДоговорКонтрагента
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &ДокументСсылка";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

//} ПолучитьДанныеШапки...

Функция НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка) Экспорт

	Если НЕ ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(ДокументСсылка, "ДоговорКонтрагента") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ОсновнойМодуль.ЕстьРеквизитИлиСвойствоОбъектаЛок(ДокументСсылка.ДоговорКонтрагента,
		"РеализацияТоваровОблагаемыхНДСУПокупателя") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ДокументСсылка.ДоговорКонтрагента.РеализацияТоваровОблагаемыхНДСУПокупателя;

КонецФункции // НДСПоДокументуИсчисляетсяНалоговымАгентом()

Функция АдресЭлектроннойПочты(Объект, ВидАдреса) Экспорт
	
	Перем Результат;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Представление ИЗ РегистрСведений.КонтактнаяИнформация ГДЕ Объект = &Объект И Вид = &ВидАдреса И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) ");
	
	Запрос.УстановитьПараметр("Объект"	 , Объект);
	Запрос.УстановитьПараметр("ВидАдреса", ВидАдреса);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Представление;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСтруктуруАдреса(AddressInfo, ЮрФизЛицо, ИспользоватьЮрАдрес = Ложь, АдресСтрокой = "") Экспорт
	
	СведенияОбАдресе = СведенияОбАдресе(ЮрФизЛицо, ИспользоватьЮрАдрес, АдресСтрокой);
	
	Заполнить_AddressInfo(AddressInfo, СведенияОбАдресе);
				
КонецПроцедуры

Функция СтрокаИностранногоАдресаБезСтраны(СтрокаАдреса, НаименованиеСтраны)
	// Вырезает страну из начала строки с адресом
	// Если название страны входит, например, в улицу, то из улицы вырезаться не должно
	
	Результат = "";
	МассивТокенов = ПреобразоватьСтрокуВМассивПодстрок(СтрокаАдреса, ",");
	
	// Удалим первое вхождение страны
	Для Сч = 0 По МассивТокенов.ВГраница() Цикл
		
		Токен = МассивТокенов[Сч];
		
		Если ВРЕГ(СокрЛП(Токен)) = ВРЕГ(СокрЛП(НаименованиеСтраны)) Тогда
			МассивТокенов.Удалить(Сч);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// И соберем строку обратно
	Для Каждого Токен Из МассивТокенов Цикл
		Результат = Результат + Токен + ",";
	КонецЦикла;
	
	// Удалим последнюю запятую
	Результат = Лев(Результат, СтрДлина(Результат) - 1);
	
	Возврат СокрЛП(Результат);

КонецФункции

//} ПОЛУЧЕНИЕ ДАННЫХ

//{ АДРЕСА

//{ Конструкторы

//Заготовка сведений об адресе в виде отдельных частей адреса и различных кодов (код региона, ОКТМО и др.).
// Возвращаемое значение:
//	Структура
Функция НовыйСведенияОбАдресе()
	
	Результат = Новый Структура;
	
	Результат.Вставить("СохраненноеПредставление"				, "");	// - представление адреса, отображаемое в формах:
	Результат.Вставить("Представление"							, "");	// - текстовое представление адреса по административно-территориальному делению.
																		//Это представление формируется динамически по значениям адресообразующих полей.
	Результат.Вставить("МуниципальноеПредставление"				, "");	// - текстовое представление адреса по муниципальному делению.
	Результат.Вставить("ТипАдреса"								, "");	// - основной тип адреса (только для адресов РФ).
																		//Варианты: "Муниципальный", "Административно-территориальный".
	Результат.Вставить("Страна"									, "");	// - текстовое представление страны.
	Результат.Вставить("КодСтраны"								, "");	// - код страны по ОКСМ.
	Результат.Вставить("Индекс"									, "");	// - почтовый индекс.
	Результат.Вставить("КодРегиона"								, "");	// - код региона РФ.
	Результат.Вставить("Регион"									, "");	// - текстовое представление региона РФ;
	Результат.Вставить("РегионСокращение"						, "");	// - сокращение региона.
	Результат.Вставить("Округ"									, "");	// - (устарело) текстовое представление округа;
	Результат.Вставить("ОкругСокращение"						, "");	// - (устарело) сокращение округа;
	Результат.Вставить("Район"									, "");	// - текстовое представление района у адресов по административно-территориальному делению;
	Результат.Вставить("РайонСокращение"						, "");	// - сокращение района у адресов по административно-территориальному делению;
	Результат.Вставить("МуниципальныйРайон"						, "");	// - текстовое представление муниципального района у адресов по муниципальному делению;
	Результат.Вставить("МуниципальныйРайонСокращение"			, "");	// - сокращение муниципального района у адресов по муниципальному делению;
	Результат.Вставить("Город"									, "");	// - текстовое представление города у адресов по административно-территориальному делению;
	Результат.Вставить("ГородСокращение"						, "");	// - сокращение города у адресов по административно-территориальному делению;
	Результат.Вставить("Поселение"								, "");	// - текстовое представление поселения у адресов по муниципальному делению;
	Результат.Вставить("ПоселениеСокращение"					, "");	// - сокращение поселения у адресов по муниципальному делению;
	Результат.Вставить("ВнутригородскойРайон"					, "");	// - текстовое представление внутригородского района;
	Результат.Вставить("ВнутригородскойРайонСокращение"			, "");	// - сокращение внутригородского района;
	Результат.Вставить("НаселенныйПункт"						, "");	// - текстовое представление населенного пункта;
	Результат.Вставить("НаселенныйПунктСокращение"				, "");	// - сокращение населенного пункта;
	Результат.Вставить("Территория"								, "");	// - текстовое представление территории;
	Результат.Вставить("ТерриторияСокращение"					, "");	// - сокращение территории;
	Результат.Вставить("Улица"									, "");	// - текстовое представление улицы;
	Результат.Вставить("УлицаСокращение"						, "");	// - сокращение улицы;
	Результат.Вставить("ДополнительнаяТерритория"				, "");	// - (устарело) текстовое представление дополнительной территории;
	Результат.Вставить("ДополнительнаяТерриторияСокращение"		, "");	// - (устарело)сокращение дополнительной территории;
	Результат.Вставить("ЭлементДополнительнойТерритории"			, "");	// - (устарело) текстовое представление элемента дополнительной территории;
	Результат.Вставить("ЭлементДополнительнойТерриторииСокращение"	, "");	// - (устарело)сокращение элемента дополнительной территории;
	
	Здание = Новый Структура;
	Здание.Вставить("ТипЗдания"	, "");	// - тип объекта адресации адреса РФ согласно приказу Минфина России от 5.11.2015 г. N 171н;
	Здание.Вставить("Номер"		, "");	// - текстовое представление номера дома (только для адресов РФ);
	
	Результат.Вставить("Здание"									, Здание);	// - (устарело)сокращение элемента дополнительной территории;
	Результат.Вставить("Корпуса"								, Новый Массив);	// - содержит структуры(поля структуры: ТипКорпуса, Номер) с перечнем корпусов адреса;
	Результат.Вставить("Помещения"								, Новый Массив);	// - содержит структуры(поля структуры: ТипПомещения, Номер) с перечнем помещений адреса;
	
	Результат.Вставить("Комментарий"							, "");	// - комментарий об адресе;
	
	Возврат Результат;
	
КонецФункции //НовыйСведенияОбАдресе()

//} Конструкторы

Функция ПолеАдресаССокращением(Поле, ПолеСокращение)
	
	Результат = СокрЛП(Поле + ?(ЗначениеЗаполнено(ПолеСокращение), " " + ПолеСокращение, ""));
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру полей записи регистра КонтактнаяИнформация.
// 
// Возвращаемое значение:
//  Структура - свойства структуры соответствуют полям типового регистра КонтактнаяИнформация.
//
Функция НоваяЗаписьКонтактнойИнформации()
	
	Результат = Новый Структура;
	Результат.Вставить("Представление");
	Результат.Вставить("Значение");
	Результат.Вставить("Поле1");
	Результат.Вставить("Поле2");
	Результат.Вставить("Поле3");
	Результат.Вставить("Поле4");
	Результат.Вставить("Поле5");
	Результат.Вставить("Поле6");
	Результат.Вставить("Поле7");
	Результат.Вставить("Поле8");
	Результат.Вставить("Поле9");
	Результат.Вставить("Поле10");
	Результат.Вставить("ТипДома", "дом");
	Результат.Вставить("ТипКорпуса", "корпус");
	Результат.Вставить("ТипКвартиры", "кв.");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТипЗданияКорпусаПомещения(ЗначенияПолей)
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипДома) Тогда 
		ЗначенияПолей.ТипДома = "дом";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКорпуса) Тогда 
		ЗначенияПолей.ТипКорпуса = "корпус";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКвартиры) Тогда 
		ЗначенияПолей.ТипКвартиры = "кв.";
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает представление адреса собранного из полей значений Поле1 - Поле10.
//
// Параметры
//  ЗначенияПолей - Структура - значения полей регистра контактной информации (см. НоваяЗаписьКонтактнойИнформации).
//
// Возвращаемое значение:
//   Строка - представление адреса.
//
Функция ПредставлениеАдресаПоЗначениямПолейКИ(ЗначенияПолей)
	
	СтруктураЗаписи = НоваяЗаписьКонтактнойИнформации();
	ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ЗначенияПолей);
	ЗаполнитьТипЗданияКорпусаПомещения(СтруктураЗаписи);
	
	Результат = "";
	
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле1), ", ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле2), ", ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле3), ", ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле4), ", ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле5), ", ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле6), ", ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле7), ", " + СтруктураЗаписи.ТипДома + " № ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле8), ", " + СтруктураЗаписи.ТипКорпуса + " ");
	ДополнитьПредставлениеАдреса(Результат, СокрЛП(СтруктураЗаписи.Поле9), ", " + СтруктураЗаписи.ТипКвартиры + " ");
	
	Если СтрДлина(Результат) > 2 Тогда
		Результат = Сред(Результат, 3);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Процедура дополняет представление адреса строкой.
//
Процедура ДополнитьПредставлениеАдреса(ТекущееПредставление, Дополнение, СтрокаКонкатенации)
	
	Если Дополнение <> "" Тогда
		ТекущееПредставление = ТекущееПредставление + СтрокаКонкатенации + Дополнение;
	КонецЕсли;
  	
КонецПроцедуры

// Возвращает данные регистра КонтактнаяИнформация по виду адреса.
//
// Параметры:
//  ЮрФизЛицо - ЛюбаяСсылка	 - владелец контактной информации;
//  ВидАдреса - Строка		 - вида адреса (см. функцию Перечисление_ВидыКИ);
// 
// Возвращаемое значение:
//  Структура - см. НоваяЗаписьКонтактнойИнформации().
//
Функция ЗначенияПолейКонтактнойИнформацииПоВидуАдреса(ЮрФизЛицо, ВидАдреса)
	
	Результат = Неопределено;
	
	ВладелецКИ = ХранилищеКонтактнойИнформацииОбъекта(ЮрФизЛицо);
	ВидКИ = ВидАдресаЮрФизЛица(ЮрФизЛицо, ВидАдреса);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ВладелецКИ);
	Запрос.УстановитьПараметр("Вид", ВидКИ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И Т.Вид = &Вид";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Результат = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗаполнитьТипЗданияКорпусаПомещения(Результат); 
		
		Если ЗначениеЗаполнено(Результат.Значение) Тогда
			ДополнитьКонтактнуюИнформациюДаннымиJson(Результат, Выборка.Значение, Выборка.Тип);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьКонтактнуюИнформациюДаннымиJson(КонтактнаяИнформация, ЗначениеJson, Тип)
	
	МодульУправлениеКонтактнойИнформациейСлужебный = ОбщийМодульПоИмени("УправлениеКонтактнойИнформациейСлужебный");
	
	Если МодульУправлениеКонтактнойИнформациейСлужебный <> Неопределено Тогда
		
		ДанныеАдреса = Неопределено;
		
		Попытка
			ДанныеАдреса = МодульУправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ЗначениеJson, Тип);
		Исключение
		КонецПопытки;
		
		Если ДанныеАдреса <> Неопределено Тогда
		
			Если  ДанныеАдреса.Свойство("addressType") И ДанныеАдреса.addressType = "ВСвободнойФорме" 
				И ДанныеАдреса.Свойство("Country") Тогда
				
				КонтактнаяИнформация.Поле1 = ДанныеАдреса.Country;	// Страна
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает данные регистра КонтактнаяИнформация по представлению КИ.
//
// Параметры:
//  ЮрФизЛицо - ЛюбаяСсылка	 - владелец контактной информации;
//  ВидАдреса - Строка		 - вида адреса (см. функцию Перечисление_ВидыКИ);
// 
// Возвращаемое значение:
//  Структура - см. НоваяЗаписьКонтактнойИнформации().
//
Функция ЗначенияПолейКонтактнойИнформацииПоПредставлению(ЮрФизЛицо, ПредставлениеКИ)
	
	Результат = Неопределено;
	
	ВладелецКИ = ХранилищеКонтактнойИнформацииОбъекта(ЮрФизЛицо);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ВладелецКИ);
	Запрос.УстановитьПараметр("Представление", ПредставлениеКИ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И ВЫРАЗИТЬ(Т.Представление КАК СТРОКА(&ДлинаСтроки)) = &Представление";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДлинаСтроки", Формат(СтрДлина(ПредставлениеКИ), "ЧГ=0"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Результат = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗаполнитьТипЗданияКорпусаПомещения(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структурированную информацию об адресе юридического или физического лица.
//
// Параметры:
//  ЮрФизЛицо - ЛюбаяСсылка - владелец контактной информации
//  ИспользоватьЮрАдрес - Булево - (Необязательный) Истина, если требуется получить юридический адрес.
//                                 Ложь, если требуется фактический адрес.
//  АдресСтрокой - Строка - (Необязательный) строковое представление адреса. Если указано, сначала
//                          будет выполнен поиск сведений об адресе по переданному представлению.
//
// Возвращаемое значение:
//  Структура - см. функцию НовыйСведенияОбАдресе()
//  Нопределено, если нет сведений о требуемом адресе.
//
Функция СведенияОбАдресе(ЮрФизЛицо, ИспользоватьЮрАдрес = Истина, АдресСтрокой = Неопределено) Экспорт
	
	Результат = Неопределено;
	ЗаписьКИ = Неопределено;
	
	ПредставлениеАдреса = СокрЛП(АдресСтрокой);
	
	Если ЗначениеЗаполнено(ПредставлениеАдреса) Тогда 
		
		ЗаписьКИ = ЗначенияПолейКонтактнойИнформацииПоПредставлению(ЮрФизЛицо, ПредставлениеАдреса);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаписьКИ) Тогда 
		
		ВидыКИ = Перечисление_ВидыКИ();
		
		ВидАдреса = ?(ИспользоватьЮрАдрес, ВидыКИ.ЮридическийАдрес, ВидыКИ.ФактическийАдрес);
		ЗаписьКИ = ЗначенияПолейКонтактнойИнформацииПоВидуАдреса(ЮрФизЛицо, ВидАдреса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаписьКИ)
		Или ЗначениеЗаполнено(ПредставлениеАдреса) Тогда 
		
		Результат = НовыйСведенияОбАдресе();
		
		Если ЗначениеЗаполнено(ЗаписьКИ) Тогда 
			ЗаполнитьСведенияОбАдресеПоДаннымРегистра(Результат, ЗаписьКИ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПредставлениеАдреса) Тогда 
			Результат.СохраненноеПредставление = ПредставлениеАдреса;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат.КодСтраны) Тогда 
			Результат.КодСтраны = ОсновнаяСтрана().Код;
		КонецЕсли;
		
		УдалитьСтрануИзПредставленияАдреса(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьСтрануИзПредставленияАдреса(СведенияОбАдресе)
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе.Страна) Тогда 
		Возврат;
	КонецЕсли;
	
	Подстроки = ОсновнойМодуль.Преобразование_СтрокуВМассивПодстрок(СведенияОбАдресе.СохраненноеПредставление
					, ","
					, Истина
					, Истина);
	
	Если ЗначениеЗаполнено(Подстроки) 
		И ВРег(Подстроки[0]) = ВРег(СведенияОбАдресе.Страна) Тогда 
		
		Подстроки.Удалить(0);
		СведенияОбАдресе.СохраненноеПредставление = ОсновнойМодуль.Преобразование_МассивВСтроку(Подстроки, ", ", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОсновнаяСтрана()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "РОССИЯ");
	Результат.Вставить("Код", "643");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСведенияОбАдресеПоДаннымРегистра(СведенияОбАдресе, ЗаписьКИ)
	
	СведенияОбАдресе.СохраненноеПредставление = ЗаписьКИ.Представление;
	СведенияОбАдресе.Представление = ПредставлениеАдресаПоЗначениямПолейКИ(ЗаписьКИ);
	
	Индекс = Неопределено;
	КодСтраны = Неопределено;
	НаименованиеСтраны = Неопределено;
	
	Если Не ТолькоЦифрыВСтроке(ЗаписьКИ.Поле1) Тогда 
		НаименованиеСтраны = СокрП(ЗаписьКИ.Поле1);
		КодСтраны = ОсновнойМодуль.КодСтраны(НаименованиеСтраны);
	Иначе 
		Индекс = СокрП(ЗаписьКИ.Поле1);
	КонецЕсли;
	
	НаименованиеРегиона = СокрЛП(ЗаписьКИ.Поле2);
	КодРегиона = ОсновнойМодуль.КодРегиона(НаименованиеРегиона);
	
	Если ЗначениеЗаполнено(КодРегиона) Тогда // Это структурированный адрес РФ
		
		СведенияОбАдресе.Страна				 = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.Индекс				 = Индекс;
		СведенияОбАдресе.КодСтраны			 = ОсновнаяСтрана().Код;
		СведенияОбАдресе.КодРегиона			 = КодРегиона;
		СведенияОбАдресе.Район				 = ЗаписьКИ.Поле3;
		СведенияОбАдресе.Город				 = ЗаписьКИ.Поле4;
		СведенияОбАдресе.НаселенныйПункт	 = ЗаписьКИ.Поле5;
		СведенияОбАдресе.Улица				 = ЗаписьКИ.Поле6;
		
		СведенияОбАдресе.Здание.ТипЗдания	 = ЗаписьКИ.ТипДома;
		СведенияОбАдресе.Здание.Номер		 = ЗаписьКИ.Поле7;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле8) Тогда
			
			Корпус = Новый Структура;
			Корпус.Вставить("ТипКорпуса", ЗаписьКИ.ТипКорпуса);
			Корпус.Вставить("Номер", ЗаписьКИ.Поле8);
			
			СведенияОбАдресе.Корпуса.Добавить(Корпус);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле9) Тогда
			
			Помещение = Новый Структура;
			Помещение.Вставить("ТипПомещения", ЗаписьКИ.ТипКвартиры);
			Помещение.Вставить("Номер", ЗаписьКИ.Поле9); 
			СведенияОбАдресе.Помещения.Добавить(Помещение);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(КодСтраны) Тогда // Это иностранный или российский адрес в свободной форме
		
		СведенияОбАдресе.КодСтраны	 = КодСтраны;
		СведенияОбАдресе.Страна		 = НаименованиеСтраны;
		
	ИначеЕсли ЗначениеЗаполнено(Индекс) Тогда // Это российский адрес, который не удалось разложить в структуру
		
		СведенияОбАдресе.Страна		 = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.КодСтраны	 = ОсновнаяСтрана().Код;
		
	КонецЕсли;
	
КонецПроцедуры

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКИ() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес", "ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	Результат.Вставить("Телефон", "Телефон");
	Результат.Вставить("Факс", "Факс");
	
	Возврат Результат;
	
КонецФункции

//{ Структура адреса по объекту

// Возвращает ссылку на фактического владельца контактной информации объекта.
// Например, контактная информация контрагента - физ.лица хранится в карточке
// связанного с контрагентом физического лица, а не в карточке самого контрагента.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект (контрагента/организацию/подразделение);
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на объект, который является фактическим владельцем контактной информации.
//
Функция ХранилищеКонтактнойИнформацииОбъекта(СсылкаНаОбъект)
	
	ХранилищеКИ = Неопределено;
	
	СтандартнаяОбработка = Истина;
	ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		//Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации")
		//	И СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		//	ХранилищеКИ = СсылкаНаОбъект.ИндивидуальныйПредприниматель;
		//Иначе 
			ХранилищеКИ = СсылкаНаОбъект;
		//КонецЕсли;
		
	КонецЕсли;
	
	Возврат ХранилищеКИ;
	
КонецФункции

// Получает ссылку на вид контактной информации объекта.
//
// Параметры:
//  ЮрФизЛицо - ЛюбаяСсылка	 - ссылка на объект (контрагента/организацию/подразделение);
//  ТипАдреса - Строка		 - вид адреса (см. функцию Перечисление_ВидыКИ);
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации объекта.
//
Функция ВидАдресаЮрФизЛица(ЮрФизЛицо, ТипАдреса)
	
	Результат = Неопределено;
	
	СтандартнаяОбработка = Истина;
	ПриПолученииВидаКонтактнойИнформации(Результат, ЮрФизЛицо, ТипАдреса, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			
			Если ЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				ПринадлежностьАдреса = "Организации";
			Иначе
				ПринадлежностьАдреса = "ФизЛица";
			КонецЕсли;
			
		Иначе
			ПринадлежностьАдреса = "Контрагента";
		КонецЕсли;
		
		ИмяВидаКИ = ?(ТипАдреса = Перечисление_ВидыКИ().ЮридическийАдрес, "ЮрАдрес", "ФактАдрес") + ПринадлежностьАдреса;
		Результат = Справочники.ВидыКонтактнойИнформации[ИмяВидаКИ];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Событие возникает при определении фактического места хранения контактной информации объекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации")
//			И СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
//			
//			СтандартнаяОбработка = Ложь;
//			ХранилищеКИ = СсылкаНаОбъект.ИндивидуальныйПредприниматель;
//			
//		КонецЕсли;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка)
	
	ОсновнойМодуль.Модуль_Интеграция.ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ
		, СсылкаНаОбъект
		, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие позволяет переопределить алгоритм вычисления вида контактной информации,
// соответствующего юр./физ. лицу и указанному типу контактной информации.
//
// Параметры:
//  ВидКИ - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации;
//  ЮрФизЛицо - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  ТипКИ - Строка - тип контактной информации (см. Перечисление_ВидыКИ);
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		
//		Если ТипКИ = Перечисление_ВидыКИ().ЮридическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
//		ИначеЕсли ТипКИ = Перечисление_ВидыКИ().ФактическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресФактический;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ВидКИ) Тогда
//			СтандартнаяОбработка = Ложь;
//		КонецЕсли;
//
Процедура ПриПолученииВидаКонтактнойИнформации(ВидКИ, ЮрФизЛицо, ТипКИ, СтандартнаяОбработка)
	
	ОсновнойМодуль.Модуль_Интеграция.ПриПолученииВидаКонтактнойИнформации(ВидКИ
		, ЮрФизЛицо
		, ТипКИ
		, СтандартнаяОбработка);
	
КонецПроцедуры

//По структуре с адресом возвращает его представление, используя типовой механизм конфигурации
// Параметры:
//	СтруктураАдреса	- Структура	-	структура с данными, задействованными в формировании представления адреса
//									в одноименном методе общего модуля "УправлениеКонтактнойИнформацией". 
//									Формирование параметра происходит в методе "ПредставлениеАдресаПоПолученнымДанным"
//									интеграционного модуля.
// Возвращаемое значение:
//	Строка
Функция ПредставлениеАдресаПоСтруктуре(СтруктураАдреса) Экспорт
	
	Возврат Вычислить("УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтруктуре(СтруктураАдреса)");
	
КонецФункции

// Заполняет объект AddressInfo по структуре сведений об адресе.
//
// Параметры:
//  AddressInfo		 - Структура - соответствует объекту https://diadocsdk-1c.readthedocs.io/ru/latest/AddressInfo.html;
//  СтруктураАдреса	 - Структура - см. функцию СведенияОбАдресе или урезанный вариант (КодСтраны и Представление);
//
Процедура Заполнить_AddressInfo(AddressInfo, СтруктураАдреса) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктураАдреса) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнятьАдрРФ = Ложь;
	Если СохраненноеПредставлениеАдресаСовпадаетСРассчитанным(СтруктураАдреса) // проверка на консистентность адреса
		И ЭтоРоссийскийАдрес(СтруктураАдреса)
		И АдресСоответствуетФорматуКЛАДР(СтруктураАдреса) Тогда
		
		ЗаполнятьАдрРФ = Истина;
	КонецЕсли;
	
	Если ЗаполнятьАдрРФ Тогда 
		
		AddressInfo.IsForeign	 = Ложь;
		AddressInfo.ZipCode		 = СтруктураАдреса.Индекс;
		AddressInfo.RegionCode	 = СтруктураАдреса.КодРегиона;
		AddressInfo.Territory	 = ПолеАдресаССокращением(СтруктураАдреса.Район, СтруктураАдреса.РайонСокращение);
		AddressInfo.City		 = ПолеАдресаССокращением(СтруктураАдреса.Город, СтруктураАдреса.ГородСокращение);
		AddressInfo.Locality	 = ПолеАдресаССокращением(СтруктураАдреса.НаселенныйПункт, СтруктураАдреса.НаселенныйПунктСокращение);
		AddressInfo.Street		 = ПолеАдресаССокращением(СтруктураАдреса.Улица, СтруктураАдреса.УлицаСокращение);
		
		Если ЗначениеЗаполнено(СтруктураАдреса.Здание) Тогда 
			СтруктураАдреса.Здание.Свойство("Номер", AddressInfo.Building);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураАдреса.Корпуса) Тогда 
			СтруктураАдреса.Корпуса[0].Свойство("Номер", AddressInfo.Block);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураАдреса.Помещения) Тогда 
			СтруктураАдреса.Помещения[0].Свойство("Номер", AddressInfo.Apartment);
		КонецЕсли;
		
	Иначе 
		
		// Для российских адресов не по КЛАДР тоже установим флаг в значение Истина,
		// чтобы обойти некорректную проверку адреса в компоненте
		AddressInfo.IsForeign	 = Истина;
		AddressInfo.CountryCode	 = СтруктураАдреса.КодСтраны;
		AddressInfo.AddressText	 = СтруктураАдреса.СохраненноеПредставление;
		
	КонецЕсли;
	
КонецПроцедуры //Заполнить_AddressInfo()

//{ Валидация адреса

// Проверяет адрес на соответствие формату КЛАДР. Если в сведении об адресе
// заполнены специфичные для ФИАС поля, то он не поместится в формат КЛАДР.
//
// Параметры:
//  СтруктураАдреса - Структура - см. функцию СведенияОбАдресе.
//
// Возвращаемое значение - Булево - Истина, если адрес соответствует формату КЛАДР.
//
Функция АдресСоответствуетФорматуКЛАДР(СтруктураАдреса)
	
	Соответствует = Ложь;
	
	Если ЗначениеЗаполнено(ОсновнойМодуль.СвойствоСтруктуры(СтруктураАдреса, "КодРегиона"))
		И НЕ ЕстьПоляНеПоКЛАДР(СтруктураАдреса)
		И ЗданиеСоответствуетКЛАДР(СтруктураАдреса)
		И КорпусСоответствуетКЛАДР(СтруктураАдреса)
		И ПомещениеСоответствуетКЛАДР(СтруктураАдреса) Тогда
		
		Соответствует = Истина;
		
	КонецЕсли;
	
	Возврат Соответствует;
	
КонецФункции //АдресСоответствуетФорматуКЛАДР()

// Проверяет, что в структуре адреса присутствуют поля, которых нет в формате КЛАДР.
//
// Параметры:
//  СтруктураАдреса - Структура - см. функцию СведенияОбАдресе;
// 
// Возвращаемое значение:
//  Булево - Истина, если есть хотя бы одно заполненное поле, не соответстующее формату КЛАДР.
//
Функция ЕстьПоляНеПоКЛАДР(СтруктураАдреса)
	
	Результат = Ложь;
	
	ПоляНеПоКЛАДР = Новый Массив;
	ПоляНеПоКЛАДР.Добавить("Округ");
	ПоляНеПоКЛАДР.Добавить("МуниципальныйРайон");
	ПоляНеПоКЛАДР.Добавить("Поселение");
	ПоляНеПоКЛАДР.Добавить("ВнутригородскойРайон");
	ПоляНеПоКЛАДР.Добавить("Территория");
	ПоляНеПоКЛАДР.Добавить("ДополнительнаяТерритория");
	ПоляНеПоКЛАДР.Добавить("ЭлементДополнительнойТерритории");
	
	Для Каждого ИмяПоля Из ПоляНеПоКЛАДР Цикл 
		
		ЗначениеПоля = ОсновнойМодуль.СвойствоСтруктуры(СтруктураАдреса, ИмяПоля);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //ЕстьПоляНеПоКЛАДР()

Функция ЗданиеСоответствуетКЛАДР(СтруктураАдреса)

	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(СтруктураАдреса.Здание.ТипЗдания)
		Или ВРег(СтруктураАдреса.Здание.ТипЗдания) = ВРег("Дом") Тогда 
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ЗданиеСоответствуетКЛАДР()

Функция КорпусСоответствуетКЛАДР(СтруктураАдреса)

	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(СтруктураАдреса.Корпуса)
		Или СтруктураАдреса.Корпуса.Количество() = 1 //Тогда 
		И ВРег(СтруктураАдреса.Корпуса[0].ТипКорпуса) = ВРег("Корпус") Тогда 
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //КорпусСоответствуетКЛАДР()

Функция ПомещениеСоответствуетКЛАДР(СтруктураАдреса)

	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(СтруктураАдреса.Помещения)
		Или СтруктураАдреса.Помещения.Количество() = 1 //Тогда 
		И ВРег(СтруктураАдреса.Помещения[0].ТипПомещения) = ВРег("Кв.") Тогда 
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПомещениеСоответствуетКЛАДР()

// Проверяет, является ли адрес российским.
// Проверка производится по коду страны.
//
// Параметры:
//  СтруктураАдреса - Структура - см. функцию СведенияОбАдресе или урезанный вариант (КодСтраны и Представление);
// 
// Возвращаемое значение:
//  Булево - Истина, если указан код России по ОКСМ (643).
//
Функция ЭтоРоссийскийАдрес(СтруктураАдреса)
	
	Результат = (СтруктураАдреса.КодСтраны = ОсновнаяСтрана().Код);
	
	Возврат Результат;
	
КонецФункции //ЭтоРоссийскийАдрес()

Функция СохраненноеПредставлениеАдресаСовпадаетСРассчитанным(СтруктураАдреса)

	РассчитанноеПредставление = ВРег(СтруктураАдреса.Представление);
	РассчитанноеПредставление = СтрЗаменить(РассчитанноеПредставление, " ", "");
	
	СохраненноеПредставление = ВРег(СтруктураАдреса.СохраненноеПредставление);
	СохраненноеПредставление = СтрЗаменить(СохраненноеПредставление, " ", "");
	
	Страна = ВРег(СтруктураАдреса.Страна);
	
	Результат = Ложь;
	
	Если РассчитанноеПредставление = СохраненноеПредставление
		Или РассчитанноеПредставление = Страна + ", " + СохраненноеПредставление Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //СохраненноеПредставлениеАдресаСовпадаетСРассчитанным()

//} Валидация адреса

//} АДРЕСА

//{ ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

//{ Подготовка временных таблиц для списка отправки документов...

Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.СуммаНДС КАК СуммаНДСЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Т.ВидСчетаФактуры,
	|	ОтборОрганизации.ФормироватьУПД КАК ОрганизацияФормироватьУПД,
	|	Т.Исправление,
	|	ЕСТЬNULL(ТЧ_ДокументыОснования.ДокументОснование, НЕОПРЕДЕЛЕНО) КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ТЧ_ДокументыОснования
	|		ПО (Т.Ссылка = ТЧ_ДокументыОснования.Ссылка)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.СуммаНДС,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	Т.ВидСчетаФактуры,
	|	ОтборОрганизации.ФормироватьУПД,
	|	Т.Исправление,
	|	ЕСТЬNULL(ТЧ_ДокументыОснования.ДокументОснование, НЕОПРЕДЕЛЕНО)
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ТЧ_ДокументыОснования
	|		ПО (Т.Ссылка = ТЧ_ДокументыОснования.Ссылка)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТИПЗНАЧЕНИЯ(ВТ_Основная.ДокументОснование) КАК ДокументОснованиеТип
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ДокументОснование ЕСТЬ НЕ NULL 
	|	И НЕ ВТ_Основная.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах";
	
	ТекстЗапросаГрузополучатели= "";
	РезультатЗапроса= Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка= РезультатЗапроса.Выбрать();
		РезультатЗапроса= Неопределено;
		
		Пока Выборка.Следующий() Цикл
			
			МетаданныеДокумента= Метаданные.НайтиПоТипу(Выборка.ДокументОснованиеТип);
			
			Если МетаданныеДокумента <> Неопределено И МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") <> Неопределено Тогда
				
				ТекстЗапросаГрузополучатели= ТекстЗапросаГрузополучатели + "
				|	
				|	ОБЪЕДИНИТЬ
				|	
				|ВЫБРАТЬ
				|	ВТ_Основная.Документ,
				|	ДанныеДокументаОснования.Грузополучатель
				|ИЗ
				|	ВТ_Основная КАК ВТ_Основная
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + МетаданныеДокумента.ПолноеИмя() + " КАК ДанныеДокументаОснования
				|		ПО ВТ_Основная.ДокументОснование = ДанныеДокументаОснования.Ссылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
				|		ПО (ВТ_Основная.Покупатель = ОтборГрузополучатели.Контрагент)
				|			И ДанныеДокументаОснования.Грузополучатель = ОтборГрузополучатели.Грузополучатель";
				
			КонецЕсли;
			
			МетаданныеДокумента = Неопределено;
			
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.Грузополучатель) КАК Грузополучатель
	|ПОМЕСТИТЬ ВТ_Грузополучатели
	|ИЗ
	|	(ВЫБРАТЬ
	|		NULL КАК Документ,
	|		NULL КАК Грузополучатель
	|	ГДЕ
	|		ЛОЖЬ " + ТекстЗапросаГрузополучатели + ") КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено Тогда
		
		Запрос.Текст= Запрос.Текст +
		"ВЫБРАТЬ
		|	NULL КАК Документ,
		|	NULL КАК Контрагент
		|ПОМЕСТИТЬ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	Иначе
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ВТ_Основная.Документ,
		|	ОтчетКомиссионераОПродажах.Контрагент
		|ПОМЕСТИТЬ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
		|ИЗ
		|	ВТ_Основная КАК ВТ_Основная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|		ПО ВТ_Основная.ДокументОснование = КорректировкаРеализации.Ссылка
		|			И (КорректировкаРеализации.ДокументРеализации ССЫЛКА Документ.СчетФактураВыданный)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО (КорректировкаРеализации.ДокументРеализации = СчетФактураВыданный.Ссылка)
		|			И (СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|		ПО (СчетФактураВыданный.ДокументОснование = ОтчетКомиссионераОПродажах.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	
	Запрос.Текст= Запрос.Текст +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	ВТ_Основная.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ДокументОснованиеID,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД) КАК ФормироватьУПД
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО ВТ_Основная.Покупатель = ОтборКонтрагенты.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Грузополучатели КАК ВТ_Грузополучатели
	|		ПО ВТ_Основная.Документ = ВТ_Грузополучатели.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров КАК ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
	|		ПО ВТ_Основная.Документ = ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО ВТ_Основная.ДокументОснование = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|ГДЕ
	|	НЕ ВТ_Основная.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|	И ВТ_Грузополучатели.Документ ЕСТЬ NULL 
	|	И ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Документ ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ОтчетКомиссионераОПродажах.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД)
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ПО ВТ_Основная.ДокументОснование = ОтчетКомиссионераОПродажах.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (ОтчетКомиссионераОПродажах.Контрагент = ОтборКонтрагенты.Контрагент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД)
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров КАК ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
	|		ПО ВТ_Основная.Документ = ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Контрагент = ОтборКонтрагенты.Контрагент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Грузополучатели.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	ВТ_Основная.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД)
	|ИЗ
	|	ВТ_Грузополучатели КАК ВТ_Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Основная КАК ВТ_Основная
	|		ПО ВТ_Грузополучатели.Документ = ВТ_Основная.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (ВТ_Основная.Покупатель = ОтборГрузополучатели.Контрагент)
	|			И ВТ_Грузополучатели.Грузополучатель = ОтборГрузополучатели.Грузополучатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (ВТ_Основная.ДокументОснование = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Грузополучатели";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &СЧФДОП
	|	И НЕ СЧФ_Основная.Исправление
	|	И СЧФ_Основная.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И СЧФ_Основная.ДокументОснование <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID = СЧФ_Основная.ДокументОснованиеID
	|					ИЛИ СЧФ_Основная.ID ПОДОБНО ""усл:%""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.Продавец,
	|	СЧФ_Основная.Покупатель,
	|	СЧФ_Основная.Грузополучатель,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСЗначение,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID,
	|	СЧФ_Основная.CounteragentID,
	|	&СЧФДОП КАК ФункцияУПД,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УПД_СЧФДОП
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование
	|ПОМЕСТИТЬ УПД_СЧФДОП_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Выполнить();
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 5 Тогда
		МассивВременныхТаблиц.Добавить("УПД_СЧФДОП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &СЧФДОП
	|	И НЕ СЧФ_Основная.Исправление
	|	И СЧФ_Основная.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|	И СЧФ_Основная.ДокументОснование <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.Продавец,
	|	СЧФ_Основная.Покупатель,
	|	СЧФ_Основная.Грузополучатель,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСЗначение,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID,
	|	СЧФ_Основная.CounteragentID,
	|	&КСЧФДИС КАК ФункцияУПД,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет				
	|ПОМЕСТИТЬ УКД_КСЧФДИС
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование
	|ПОМЕСТИТЬ УКД_КСЧФДИС_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Выполнить();
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 6 Тогда
		МассивВременныхТаблиц.Добавить("УКД_КСЧФДИС");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.Продавец,
	|	СЧФ_Основная.Покупатель,
	|	СЧФ_Основная.Грузополучатель,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСЗначение,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID,
	|	СЧФ_Основная.CounteragentID,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СЧФ_Основная.ФормироватьУПД В (&СФ, &СФТОРГ12АКТ)
	|						ТОГДА &КСФ
	|					КОГДА НЕ СЧФ_Основная.Исправление И СЧФ_Основная.ФормироватьУПД В (&СЧФДОП, &СЧФ, &СЧФ_ДОП)
	|						ТОГДА &КСЧФ
	|					ИНАЧЕ """"
	|				КОНЕЦ 
	|		КОГДА СЧФ_Основная.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента))
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА СЧФ_Основная.ФормироватьУПД В (&СФ, &СФТОРГ12АКТ)
	|						ТОГДА &СФ
	|					КОГДА НЕ СЧФ_Основная.Исправление И СЧФ_Основная.ФормироватьУПД В (&СЧФДОП, &СЧФ, &СЧФ_ДОП)
	|						ТОГДА &СЧФ
	|					ИНАЧЕ """"
	|				КОНЕЦ 
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ СчетаФактуры_СчетФактураВыданный
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО СЧФ_Основная.Документ = УПД_СЧФДОП.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС КАК УКД_КСЧФДИС
	|		ПО СЧФ_Основная.Документ = УКД_КСЧФДИС.Документ
	|ГДЕ
	|	УПД_СЧФДОП.Документ ЕСТЬ NULL
	|	И УКД_КСЧФДИС.Документ ЕСТЬ NULL
	|	И ВЫБОР
	|		КОГДА СЧФ_Основная.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|			И НЕ СЧФ_Основная.Исправление И СЧФ_Основная.ФормироватьУПД = &ДОП
	|				ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СЧФ_Основная";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетаФактуры_СчетФактураВыданный");
	
КонецПроцедуры

Процедура ПодготовитьВТ_АктыСверки(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.ВалютаДокумента КАК Валюта,
	|	ИСТИНА КАК Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID,
	|	0 КАК СуммаДокументаЗначение,
	|	0 КАК СуммаНДСЗначение,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	"""" КАК ФункцияУПД,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ АктыСверки_АктСверкиВзаиморасчетов
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктСверкиВзаиморасчетов КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСверки = ""АктСверкиВзаиморасчетов""
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("АктыСверки_АктСверкиВзаиморасчетов");
	
КонецПроцедуры


Процедура ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_РеализацияТоваровУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &СЧФДОП
	|				И ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияТоваровУслуг");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			И Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА &ДИС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|			И (НЕ Т.ДокументРеализации ССЫЛКА Документ.СчетФактураВыданный)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС_ДокументыОснования КАК УКД_КСЧФДИС_ДокументыОснования
	|		ПО (Т.Ссылка = УКД_КСЧФДИС_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УКД_КСЧФДИС_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			И Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА &ДИС
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|			И (НЕ Т.ДокументРеализации ССЫЛКА Документ.СчетФактураВыданный)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС_ДокументыОснования КАК УКД_КСЧФДИС_ДокументыОснования
	|		ПО (Т.Ссылка = УКД_КСЧФДИС_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УКД_КСЧФДИС_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			И Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА &ДИС
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|			И (НЕ Т.ДокументРеализации ССЫЛКА Документ.СчетФактураВыданный)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС_ДокументыОснования КАК УКД_КСЧФДИС_ДокументыОснования
	|		ПО (Т.Ссылка = УКД_КСЧФДИС_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УКД_КСЧФДИС_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			И Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА &ДИС
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|			И (НЕ Т.ДокументРеализации ССЫЛКА Документ.СчетФактураВыданный)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС_ДокументыОснования КАК УКД_КСЧФДИС_ДокументыОснования
	|		ПО (Т.Ссылка = УКД_КСЧФДИС_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УКД_КСЧФДИС_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Т.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК Т
	|			ПО ВТ_Основная.Документ = Т.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Т.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Услуги КАК Т
	|			ПО ВТ_Основная.Документ = Т.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.CounteragentID,
	|	ВТ_Основная.ФункцияУПД,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &СЧФДОП
	|				И ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_КорректировкаРеализации");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ВозвратТоваровПоставщику(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборКонтрагенты.CounteragentID,
	|	ОтборОрганизации.ОтпрНеПроведенные КАК ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная_Шаг1
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО Т.Контрагент = ОтборКонтрагенты.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборКонтрагенты.CounteragentID,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО Т.Контрагент = ОтборКонтрагенты.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная_Шаг1.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная_Шаг1 КАК ВТ_Основная_Шаг1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная_Шаг1.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная_Шаг1.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная_Шаг1.Документ
	|ИЗ
	|	ВТ_Основная_Шаг1 КАК ВТ_Основная_Шаг1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная_Шаг1.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная_Шаг1.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная_Шаг1.Документ,
	|	ВТ_Основная_Шаг1.Продавец,
	|	ВТ_Основная_Шаг1.Покупатель,
	|	ВТ_Основная_Шаг1.СуммаДокументаЗначение,
	|	ВТ_Основная_Шаг1.Валюта,
	|	ВТ_Основная_Шаг1.Проведен,
	|	ВТ_Основная_Шаг1.Дата,
	|	ВТ_Основная_Шаг1.Номер,
	|	ВТ_Основная_Шаг1.ID,
	|	ВТ_Основная_Шаг1.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная_Шаг1.ФункцияУПД,
	|	ВТ_Основная_Шаг1.CounteragentID
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ВТ_Основная_Шаг1 КАК ВТ_Основная_Шаг1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная_Шаг1.Документ = ВТ_ЕстьСЧФ.Документ
	|ГДЕ
	|	ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная_Шаг1.ФормироватьУПД <> &СЧФДОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная_Шаг1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК Товары
	|		ПО ВТ_Основная.Документ = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_ВозвратТоваровПоставщику
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ВозвратТоваровПоставщику");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияОтгруженныхТоваров(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	ДанныеДокументаОтгрузки.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	ДанныеДокументаОтгрузки.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ПО ВТ_Основная.ДокументОтгрузки = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|			ПО ВТ_Основная.ДокументОтгрузки = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.CounteragentID,
	|	ВТ_Основная.ФункцияУПД КАК ФункцияУПД,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_РеализацияОтгруженныхТоваров
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияОтгруженныхТоваров");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_АктОбОказанииПроизводственныхУслуг(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ,
	|	СУММА(Услуги.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК Услуги
	|		ПО ВТ_Основная.Документ = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_АктОбОказанииПроизводственныхУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_АктОбОказанииПроизводственныхУслуг");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияУслугПоПереработке(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПоПереработке КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПоПереработке КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ,
	|	СУММА(Услуги.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПоПереработке.Услуги КАК Услуги
	|		ПО ВТ_Основная.Документ = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_РеализацияУслугПоПереработке
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияУслугПоПереработке");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ОтчетКомитентуОПродажах(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаВознаграждения КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|			И (Т.СуммаВознаграждения <> 0 ИЛИ Т.УдержатьКомиссионноеВознаграждение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаВознаграждения,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|			И (Т.СуммаВознаграждения <> 0 ИЛИ Т.УдержатьКомиссионноеВознаграждение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	СУММА(Товары.СуммаНДСВознаграждения) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК Товары
	|		ПО ВТ_Основная.Документ = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_ОтчетКомитентуОПродажах
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ОтчетКомитентуОПродажах");
	
КонецПроцедуры


Процедура ПодготовитьВТ_СчетаНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	ИСТИНА КАК Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборКонтрагенты.Контрагент ЕСТЬ НЕ NULL
	|	И ОтборОрганизации.СпособОтправкиСчета = ""СчетНаОплату""
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	ИСТИНА КАК Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборГрузополучатели.Контрагент ЕСТЬ НЕ NULL
	|	И ОтборОрганизации.СпособОтправкиСчета = ""СчетНаОплату""
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ИСТИНА КАК ЭтоСчет,
	|	ВТ_Основная.CounteragentID,
	|	ВТ_Основная.Грузополучатель,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	"""" КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетаНаОплату_СчетНаОплатуПокупателю
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетаНаОплату_СчетНаОплатуПокупателю");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.CounteragentID,
	|	ИСТИНА КАК ЭтоСчет,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	"""" КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетаНаОплату_РеализацияТоваровУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетаНаОплату_РеализацияТоваровУслуг");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""РеализацияТоваров""
	|	И ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.CounteragentID,
	|	ИСТИНА КАК ЭтоСчет,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	"""" КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетаНаОплату_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетаНаОплату_КорректировкаРеализации");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_ЗаказПокупателя(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ОтборКонтрагенты.CounteragentID
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""Заказ""
	|	И НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""Заказ""
	|	И ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""Заказ""
	|	И НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.Грузополучатель,
	|	Т.СуммаДокумента,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (Т.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
	|ГДЕ
	|	ОтборОрганизации.СпособОтправкиСчета = ""Заказ""
	|	И ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.CounteragentID,
	|	ИСТИНА КАК ЭтоСчет,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	"""" КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетаНаОплату_ЗаказПокупателя
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетаНаОплату_ЗаказПокупателя");
	
КонецПроцедуры

//} Подготовка временных таблиц для списка отправки документов...

//} ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

//{ Управление ГТД

Функция ЕстьВозможностьЗаполненияГТД(Видоперации, ЭДОбъект) Экспорт
	Возврат Ложь;	
КонецФункции

Функция ЕстьВозможностьЗаполненияСерий(Видоперации, ЭДОбъект) Экспорт
	
	Результат = Ложь;
	
	Если 	Видоперации = "ПокупкаКомиссия"
		ИЛИ Видоперации = "ПоступлениеОборудования"
		ИЛИ Видоперации = "ВозвратОтПокупателя"
		ИЛИ Видоперации = "ПоступлениеАвтомобилей" Тогда
		
		Результат = ОсновнойМодуль.Форма_Диадок_ЭД().ДляDocumentЕстьГТД(ЭДОбъект);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} Управление ГТД

//} Общие запросы типовых КФ Семейства УТ

//{ СозданиеДокументов1С

Процедура ЗаполнитьОснованием_СчетФактура(ДокументОбъект, ДокументОснование) Экспорт
	
	Если ТипЗнч(ДокументОснование) = Тип("Массив") Тогда
		ДокументыОснования = ДокументОснование;
	Иначе
		
		ДокументыОснования = Новый Массив;
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ДокументыОснования.Добавить(ДокументОснование);
		КонецЕсли;
	
	КонецЕсли;
	
	ДокументыОснованияВГраница= ДокументыОснования.ВГраница();
	
	Если ДокументыОснованияВГраница = -1 Тогда // Документов основания нет
		Возврат;
	КонецЕсли;
	
	ЕстьТабЧастьДокументыОснования= ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("ДокументыОснования") <> Неопределено;
	
	Если ЕстьТабЧастьДокументыОснования Тогда
		
		// Заполняем табличную часть ДокументыОснования без последнего документа,
		// для того чтобы вызвать этим документом стандартную обработку заполнения шапки
		Для ИндексЦикла = 0 По ДокументыОснованияВГраница - 1 Цикл
			ДокументОбъект.ДокументыОснования.Добавить().ДокументОснование= ДокументыОснования[ИндексЦикла];
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		// Заполняем шапку документа с помощью последнего документа основания
		ДокументОбъект.Заполнить(ДокументыОснования[ДокументыОснованияВГраница]);
	Исключение
		Если ЕстьТабЧастьДокументыОснования Тогда
			ДокументОбъект.ДокументыОснования.Добавить().ДокументОснование = ДокументыОснования[ДокументыОснованияВГраница];
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения) Экспорт
	
	Реквизиты= Новый Структура;
	
	Если Document.Type = "InvoiceRevision" Тогда
		
		Реквизиты.Вставить("НомерВходящегоДокумента", Document.OriginalDocumentNumber);
		Реквизиты.Вставить("ДатаВходящегоДокумента"	, Document.OriginalDocumentDate);
		
		Реквизиты.Вставить("Исправление", Истина);
		
		Реквизиты.Вставить("НомерИсправления", Document.DocumentNumber);
		Реквизиты.Вставить("ДатаИсправления" , Document.DocumentDate);
	
	ИначеЕсли Document.Type = "InvoiceCorrection" Тогда
		
		Реквизиты.Вставить("НомерВходящегоДокумента", Document.DocumentNumber);
		Реквизиты.Вставить("ДатаВходящегоДокумента"	, Document.DocumentDate);
		
		Реквизиты.Вставить("НомерИсходногоДокумента", Document.OriginalDocumentNumber);
		Реквизиты.Вставить("ДатаИсходногоДокумента"	, Document.OriginalDocumentDate);
		
		Попытка
			Реквизиты.Вставить("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыПолученного.Корректировочный);
		Исключение КонецПопытки;
		
	ИначеЕсли Document.Type = "InvoiceCorrectionRevision" Тогда
		
		Реквизиты.Вставить("НомерВходящегоДокумента", Document.OriginalInvoiceCorrectionNumber);
		Реквизиты.Вставить("ДатаВходящегоДокумента"	, Document.OriginalInvoiceCorrectionDate);
		
		Реквизиты.Вставить("НомерИсходногоДокумента", Document.OriginalDocumentNumber);
		Реквизиты.Вставить("ДатаИсходногоДокумента"	, Document.OriginalDocumentDate);
		
		Попытка
			Реквизиты.Вставить("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыПолученного.Корректировочный);
		Исключение КонецПопытки;
		
		Реквизиты.Вставить("Исправление", Истина);
		
		Реквизиты.Вставить("НомерИсправления", Document.DocumentNumber);
		Реквизиты.Вставить("ДатаИсправления" , Document.DocumentDate);
		
	Иначе
		
		Реквизиты.Вставить("НомерВходящегоДокумента", Document.DocumentNumber);
		Реквизиты.Вставить("ДатаВходящегоДокумента"	, Document.DocumentDate);
		
		Попытка
			Реквизиты.Вставить("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыПолученного.НаПоступление);
		Исключение КонецПопытки;
		
	КонецЕсли;
	
	Реквизиты.Вставить("ВхДокНомер", Реквизиты.НомерВходящегоДокумента);
	Реквизиты.Вставить("ВхДокДата" , Реквизиты.ДатаВходящегоДокумента);
	
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.СчетФактураПолученный")
		И ДокументОбъект.Ссылка = Документы.СчетФактураПолученный.ПустаяСсылка() Тогда
		
		//идет запонение созданного документа
		Реквизиты.Вставить("Дата", ТекущаяДата());
	КонецЕсли;
	
	Реквизиты.Вставить("КодВидаОперации", "01");
	Реквизиты.Вставить("КодСпособаПолучения", 2);
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Реквизиты);
	
	Реквизиты= Неопределено;
	
	Если ПараметрыЗаполнения <> Неопределено И ПараметрыЗаполнения.Свойство("Реквизиты") Тогда
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыЗаполнения.Реквизиты);
	КонецЕсли;
	
	ОсновнойМодуль.УстановитьДоговорВСчетеФактуреДляДиадок(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизиты_СчетФактураВыданный(ДокументОбъект, Document, ПараметрыЗаполнения= Неопределено) Экспорт
	
	Реквизиты= Новый Структура;
	
	Реквизиты.Вставить("КодВидаОперации", "01");
	Реквизиты.Вставить("КодСпособаВыставления", 2);
	
	Реквизиты.Вставить("Дата", ТекущаяДата());
	
	Реквизиты.Вставить("Выставлен", Истина);
	Реквизиты.Вставить("ДатаВыставления", Document.ConfirmationDate);
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Реквизиты);
	
	Реквизиты= Неопределено;
	
	Если ПараметрыЗаполнения <> Неопределено И ПараметрыЗаполнения.Свойство("Реквизиты") Тогда
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыЗаполнения.Реквизиты);
	КонецЕсли;
	
	ОсновнойМодуль.УстановитьДоговорВСчетеФактуреДляДиадок(ДокументОбъект);
	
КонецПроцедуры

Функция СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	НовыйДокумент= Документы.СчетФактураПолученный.СоздатьДокумент();
	
	ЗаполнитьОснованием_СчетФактура(НовыйДокумент, ДокументОснование);
	ЗаполнитьРеквизиты_СчетФактураПолученный(НовыйДокумент, Document, ПараметрыЗаполнения);
	
	ОсновнойМодуль.ОбработкаСобытияПодключаемогоМодуля("ПослеСозданияСчетФактуры", Новый Структура("СчетФактураОбъект, РеализацииСсылка, Document", НовыйДокумент, ДокументОснование, Document));
	
	Возврат НовыйДокумент;
	
КонецФункции

Функция СоздатьДокумент_СчетФактураВыданный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт  
	
	НовыйДокумент= Документы.СчетФактураВыданный.СоздатьДокумент();
	
	ЗаполнитьОснованием_СчетФактура(НовыйДокумент, ДокументОснование);
	ЗаполнитьРеквизиты_СчетФактураВыданный(НовыйДокумент, Document, ПараметрыЗаполнения);
	
	ОсновнойМодуль.ОбработкаСобытияПодключаемогоМодуля("ПослеСозданияСчетФактуры", Новый Структура("СчетФактураОбъект, РеализацииСсылка, Document", НовыйДокумент, ДокументОснование, Document));
	
	Возврат НовыйДокумент;
	
КонецФункции

//} СозданиеДокументов1С

//{ СвязиМеждуДокументами

//Производит поиск приходных накладных, которые являются основанием для заданной СФ
//
//Параметры:
// СФПолученныйСсылка	- ДокументСсылка	- ссылка на входящий счет-фактуру
//
//Возвращаемое значение:
// Массив
Функция ДокументыОснованияПолученногоСчетаФактуры(СФПолученныйСсылка) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Запрос_ДокументыОснованияПолученногоСчетаФактуры(СФПолученныйСсылка);
					
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
						
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				Результат.Добавить(Выборка.Ссылка);
			КонецЕсли; 
		КонецЦикла;
	
	КонецЕсли; 
						
	Возврат Результат;
	
КонецФункции //ДокументыОснованияПолученногоСчетаФактуры()

Функция Запрос_ДокументыОснованияПолученногоСчетаФактуры(СФПолученныйСсылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументОснование КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования
	|ГДЕ
	|	Ссылка = &СсылкаНаОбъект");
	
	Если Метаданные.Документы.СчетФактураПолученный.ТабличныеЧасти.Найти("ДокументыОснования") = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетФактураПолученный.ДокументыОснования", "Документ.СчетФактураПолученный");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СФПолученныйСсылка);
	
	Возврат Запрос; 
	
КонецФункции //Запрос_ДокументыОснованияПолученногоСчетаФактуры()

Функция НайтиПодходящийСчетФактуруИзРНК(МассивСсылокРНК) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка 
	|ИЗ
	|	Документ.СчетФактураПолученный
	|ГДЕ
	|	ДокументОснование В (&МассивСсылокРНК)");
	
	Если Метаданные.Документы.СчетФактураПолученный.ТабличныеЧасти.Найти("ДокументыОснования") = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.СчетФактураПолученный.ДокументыОснования", "Документ.СчетФактураПолученный");
	КонецЕсли;
	
	МассивСодержитРТУ= Ложь;
	Для Каждого СсылкаРНК Из МассивСсылокРНК Цикл
		Если ТипЗнч(СсылкаРНК) = ОсновнойМодуль.ОдинСАдаптер_Документы_ПолучитьТипДокументаРеализацияТоваровУслуг() Тогда
			МассивСодержитРТУ= Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСодержитРТУ Тогда
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "СчетФактураПолученный", "СчетФактураВыданный");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивСсылокРНК", МассивСсылокРНК);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка; 
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументОснование КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования
	|ГДЕ
	|	Ссылка = &СсылкаНаОбъект");
	
	Если Метаданные.Документы.СчетФактураВыданный.ТабличныеЧасти.Найти("ДокументыОснования") = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетФактураВыданный.ДокументыОснования", "Документ.СчетФактураВыданный");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				Результат.Добавить(Выборка.Ссылка);
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования
	|ГДЕ
	|	ДокументОснование = &СсылкаНаОбъект");
	
	Если Метаданные.Документы.СчетФактураВыданный.ТабличныеЧасти.Найти("ДокументыОснования") = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетФактураВыданный.ДокументыОснования", "Документ.СчетФактураВыданный");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СсылкаНаОбъект) Экспорт
	
	Результат= Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ ПометкаУдаления И Сделка = &СсылкаНаОбъект");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект) Экспорт 
	
	Возврат СсылкаНаОбъект.Сделка;
	
КонецФункции

Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации) Экспорт
	
	Если ЗначениеЗаполнено(ДокРеализации) 
		И ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Возврат ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументРеализации);
	Иначе
		Возврат ДокРеализации;
	КонецЕсли;	
	
КонецФункции

//} СвязиМеждуДокументами

//{ Приглашение Контрагентов

Функция ЕстьНовыеКонтрагентыДляПриглашения(МассивОрганизаций1С, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусКонтрагентаНеПодходит
	|ГДЕ
	|	СтатусКонтрагентаНеПодходит.Объект В(&МассивОрганизаций1С)
	|	И СтатусКонтрагентаНеПодходит.Свойство = &ПриглашенияДатаСтатусНеПодходит
	|	И ТИПЗНАЧЕНИЯ(СтатусКонтрагентаНеПодходит.Значение) = ТИП(ДАТА)
	|	И СтатусКонтрагентаНеПодходит.Значение > &ПериодАнализаДокументов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И Т.ОтражатьВБухгалтерскомУчете
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И Т.ОтражатьВБухгалтерскомУчете
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И Т.ОтражатьВБухгалтерскомУчете
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL ");
	
	Запрос.УстановитьПараметр("МассивОрганизаций1С"			   , МассивОрганизаций1С);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"		   , ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"  					   , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ПриглашенияДатаСтатусНеПодходит", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДиадокПриглашенияДатаСтатусНеПодходит"));

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ТаблицаКонтрагентовДляПриглашения(BoxID, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	ЯщикиОрганизаций.Значение КАК BoxID
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиОрганизаций
	|		ПО Организации.Ссылка = ЯщикиОрганизаций.Объект
	|			И (ЯщикиОрганизаций.Свойство = &ЯщикДиадокДляОрганизации)
	|			И (ЯщикиОрганизаций.Значение В (&BoxID))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.BoxID,
	|	ВложенныйЗапрос.Контрагент,
	|	СУММА(ВложенныйЗапрос.КоличествоДокументов) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ_СтатистикаДокументов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Организации.BoxID КАК BoxID,
	|		Т.Контрагент КАК Контрагент,
	|		1 КАК КоличествоДокументов
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Организации.BoxID,
	|		Т.Контрагент,
	|		1
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Организации.BoxID,
	|		Т.Контрагент,
	|		1
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.BoxID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Организации.BoxID,
	|	ВТ_Организации.ИНН
	|ПОМЕСТИТЬ ВТ_BoxID
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент1С,
	|	Контрагенты.Код КАК Контрагент1С_Код,
	|	Контрагенты.ИНН КАК Контрагент1С_ИНН,
	|	Контрагенты.КПП КАК Контрагент1С_КПП,
	|	ЕСТЬNULL(ЯщикиКонтрагентов.Значение, """") КАК КонтрагентЭДО_ID,
	|	ЕСТЬNULL(ВТ_СтатистикаДокументов.КоличествоДокументов, 0) КАК КоличествоДокументов,
	|	ВТ_BoxID.BoxID КАК ОрганизацияЭДО_ID,
	|	ВЫБОР
	|		КОГДА ЯщикиКонтрагентов.Значение ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Сопоставлен
	|ИЗ
	|	ВТ_BoxID КАК ВТ_BoxID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_BoxID.ИНН <> Контрагенты.ИНН
	|			И (НЕ Контрагенты.ЭтоГруппа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатистикаДокументов КАК ВТ_СтатистикаДокументов
	|		ПО ВТ_BoxID.BoxID = ВТ_СтатистикаДокументов.BoxID
	|			И (Контрагенты.Ссылка = ВТ_СтатистикаДокументов.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО (Контрагенты.Ссылка = ЯщикиКонтрагентов.Объект)
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)");
	
	Запрос.УстановитьПараметр("BoxID"					, BoxID);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"	, ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"				, ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ЯщикДиадокДляОрганизации", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ЯщикДиадокДляОрганизации"));
															   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//} Приглашение Контрагентов

//{ Внешние обработки

Функция ВнешняяОбработкаПоGUID(GUID) Экспорт
	
	Возврат ОсновнойМодуль.СсылкаПоGUID(Справочники.ВнешниеОбработки, GUID);
	
КонецФункции

//} Внешние обработки

//{ ИдентификацияДокументов

Функция ЭтоЗаказПокупателя(ДокументСсылка) Экспорт 
	Возврат
	(Метаданные.Документы.Найти("СчетНаОплатуПокупателю") <> Неопределено
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"))
	Или (Метаданные.Документы.Найти("СчетНаОплату") <> Неопределено
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетНаОплату"))
	Или (Метаданные.Документы.Найти("ЗаказПокупателя") <> Неопределено
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя"));
	
КонецФункции

Функция ЭтоКорректировкаРеализации(ДокументСсылка) Экспорт
	
	Возврат (Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено)
		И (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации"));
	
КонецФункции

Функция ЭтоКСФ(СсылкаНаДокумент) Экспорт 
	
	МетаданныеДокумента = СсылкаНаДокумент.Метаданные();
	
	Возврат 
	
	(МетаданныеДокумента.Реквизиты.Найти("ВидСчетаФактуры") <> Неопределено
		И Строка(СсылкаНаДокумент.ВидСчетаФактуры) = "Корректировочный")
	ИЛИ (МетаданныеДокумента.Реквизиты.Найти("ХозОперация") <> Неопределено
		 И МетаданныеДокумента.Реквизиты.Найти("Исправление") <> Неопределено
		 И СсылкаНаДокумент.ХозОперация = Справочники.ХозОперации.СчетФактураВыданныйКорректировка
		 И НЕ СсылкаНаДокумент.Исправление)
	ИЛИ (МетаданныеДокумента.Реквизиты.Найти("НомерИсправляемогоКорректировочногоДокумента") <> Неопределено
		 И ЗначениеЗаполнено(СсылкаНаДокумент.НомерИсправляемогоКорректировочногоДокумента)
		 И СокрЛП(СсылкаНаДокумент.НомерИсправляемогоКорректировочногоДокумента) <> "0")
		 
КонецФункции

Функция ЭтоРТУ_ДД(СсылкаНаОбъект) Экспорт
	Возврат 
	( (Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено) И (ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг")))
	ИЛИ
	( (Метаданные.Документы.Найти("РеализацияТоваров") <> Неопределено)       И (ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияТоваров")))
КонецФункции 

Функция ЭтоСФ(Документ) Экспорт
	
	Результат = ТипЗнч(Документ) = ОсновнойМодуль.ОдинСАдаптер_Документы_ПолучитьТипДокументаСчетФактураВыданный(); 
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСФВыданный(Документ)
	
	Результат = Ложь;
	
	ТипСФВыданный = Новый Соответствие;
	
	Если Метаданные.Документы.Найти("СчетФактураВыданный") <> Неопределено Тогда
		ТипСФВыданный.Вставить(Тип("ДокументСсылка.СчетФактураВыданный"), Истина);
	ИначеЕсли Метаданные.Документы.Найти("РегистрацияСчетаФактуры") <> Неопределено Тогда
		ТипСФВыданный.Вставить(Тип("ДокументСсылка.РегистрацияСчетаФактуры"), Истина);
	ИначеЕсли Метаданные.Документы.Найти("СчетФактура") <> Неопределено Тогда
		ТипСФВыданный.Вставить(Тип("ДокументСсылка.СчетФактура"), Истина);
	Иначе		
		ТипСФВыданный.Вставить(Тип("ДокументСсылка.СчетФактураВыданный"), Истина);
	КонецЕсли;
	
	Если ТипСФВыданный.Получить(ТипЗнч(Документ)) = Истина Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСФПолученный(Документ) Экспорт
	
	Если ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияДалионУМ" Тогда
		Возврат Ложь
	Иначе
		Возврат (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураПолученный"));
	КонецЕсли;
	
КонецФункции	

Функция ЭтоСчетНаОплату(ДокументСсылка) Экспорт
	Возврат
	(Метаданные.Документы.Найти("СчетНаОплатуПокупателю") <> Неопределено
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"))
	Или (Метаданные.Документы.Найти("СчетНаОплату") <> Неопределено
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетНаОплату"));
КонецФункции	

//} ИдентификацияДокументов

//{ ФормированиеТЗВыгрузкиВДиадок

Функция ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент) Экспорт 
	
	ТаблицаДокументов= ТаблицаВыгрузкиВДиадок(ДатаНачала,  ДатаОкончания, ТипыДокументов, Организация, Контрагент);
	
	ТаблицаДокументов.Колонки.Добавить("ЭтоТестовыйДокумент", Новый ОписаниеТипов("Булево"));
	ТаблицаДокументов.Колонки.Добавить("ВПодразделение"		, Новый ОписаниеТипов("Строка"));
	ТаблицаДокументов.Колонки.Добавить("ToDepartmentID"		, Новый ОписаниеТипов("Строка"));
	
	КэшМаршрутизация= Новый Соответствие;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		
		СтрокаТаблицы.ЭтоТестовыйДокумент= СтрокаТаблицы.IsTest ИЛИ ПолучитьМодульПрог("Модуль_РаботаССерверомДиадок").ПолучитьЯщикДиадокДляОрганизации(СтрокаТаблицы.Продавец).IsTest;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Грузополучатель) Тогда
			СтрокаТаблицы.ВПодразделение = Строка(СтрокаТаблицы.Грузополучатель);
		КонецЕсли;
		
		Маршрутизация= Маршрутизация(ПолучитьДоговорПоДокументу(СтрокаТаблицы.Документ), СтрокаТаблицы.Грузополучатель, СтрокаТаблицы.Покупатель, КэшМаршрутизация);
		Если Маршрутизация <> Неопределено Тогда
			СтрокаТаблицы.ВПодразделение= Маршрутизация.ВПодразделение;
			СтрокаТаблицы.ToDepartmentID= Маршрутизация.ToDepartmentID;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Организация"		 , Организация);
	ПараметрыСобытия.Вставить("Контрагент"		 , Контрагент);
	ПараметрыСобытия.Вставить("ДатаНачала"		 , ДатаНачала);
	ПараметрыСобытия.Вставить("ДатаОкончания"	 , ДатаОкончания);
	ПараметрыСобытия.Вставить("ТипыДокументов"	 , ТипыДокументов);
	ПараметрыСобытия.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	
	ОсновнойМодуль.ОбработкаСобытияПодключаемогоМодуля("ПослеПолученияТаблицыДокументовДляОтправки", ПараметрыСобытия);
		
	Возврат ТаблицаДокументов;
	
КонецФункции	

Функция Маршрутизация(ДоговорКонтрагента, Грузополучатель, Контрагент, КэшМаршрутизация)
	
	Маршрутизация= МаршрутизацияПоДоговору(ДоговорКонтрагента, КэшМаршрутизация);
	
	Если Маршрутизация = Неопределено Тогда 
		Маршрутизация= МаршрутизацияПоКонтрагенту(Грузополучатель, КэшМаршрутизация);
	КонецЕсли;	
	
	Если Маршрутизация = Неопределено Тогда 
		Маршрутизация= МаршрутизацияПоКонтрагенту(Контрагент, КэшМаршрутизация);
	КонецЕсли;	
	
	Возврат Маршрутизация;
	
КонецФункции

Функция МаршрутизацияПоДоговору(ДоговорКонтрагента, КэшМаршрутизация)
	
	ПодразделениеПолучателя= КэшМаршрутизация[ДоговорКонтрагента];
	
	Если ПодразделениеПолучателя = Неопределено Тогда 
		
		ПодразделениеПолучателя= ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьПараметрыМаршрутизацииПоДоговору(ДоговорКонтрагента);
		
		КэшМаршрутизация.Вставить(ДоговорКонтрагента, ?(ПодразделениеПолучателя= Неопределено, Ложь, ПодразделениеПолучателя));
		
	КонецЕсли;
	
	Возврат ?(ПодразделениеПолучателя= Ложь, Неопределено, ПодразделениеПолучателя);
	
КонецФункции

Функция МаршрутизацияПоКонтрагенту(Контрагент, КэшМаршрутизация)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		ПодразделениеПолучателя= КэшМаршрутизация[Контрагент];
		
		Если ПодразделениеПолучателя = Неопределено Тогда 
			
			ПодразделениеПолучателя= ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ПолучитьПараметрыМаршрутизацииПоКонтрагенту(Контрагент);
			
			КэшМаршрутизация.Вставить(Контрагент, ?(ПодразделениеПолучателя= Неопределено, Ложь, ПодразделениеПолучателя));
			
		ИначеЕсли ПодразделениеПолучателя = Ложь Тогда
			
			ПодразделениеПолучателя= Неопределено;
			
		КонецЕсли;
		
		Возврат ПодразделениеПолучателя;
		
	КонецЕсли;
	
КонецФункции

// Описывает возможные значения типов протоконтента.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ТипыКонтента()
	
	Результат = ОсновнойМодуль.ТипыКонтента();
	
	Возврат Результат;
	
КонецФункции

Функция ТипДокументаУПД(ФункцияДокумента)
	
	Результат = ОсновнойМодуль.ТипДокументаУПД(ФункцияДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция ТипДокументаУКД(ФункцияДокумента)
	
	Результат = ОсновнойМодуль.ТипДокументаУКД(ФункцияДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеФорматаЭлектронногоДокумента(ИмяТипа, ФункцияДокумента, ВерсияФормата)
	
	Результат = ОсновнойМодуль.ОписаниеФорматаЭлектронногоДокумента(ИмяТипа, ФункцияДокумента, ВерсияФормата);
	
	Возврат Результат;
	
КонецФункции

// Алгоритм определения формата, в который нужно выгрузить документ информационной базы.
//
// Параметры:
//  КлючНастройкиФорматовВыгрузки - Строка - значение настройки "ДиадокФормироватьУПД" организации/контрагента;
//  ТипДокумента - Строка - значение колонки DocumentType таблицы выгружаемых документов (возможно уточнено функцией ОпределитьТипСчетФактуры);
//  ФункцияУПД - Строка - значение колонки ФункцияУПД таблицы выгружаемых документов;
// 
// Возвращаемое значение:
//  Структура - см. функцию ОписаниеФорматаЭлектронногоДокумента
//
Функция ОпределитьФорматОтправки(КлючНастройкиФорматовВыгрузки, ТипДокумента, ФункцияУПД) Экспорт 
	
	ТипыКонтента = ТипыКонтента();
	
	ВерсияУПД820 = Найти(КлючНастройкиФорматовВыгрузки, "_820") > 0;
	ВерсияУКД736 = Найти(КлючНастройкиФорматовВыгрузки, "_736") > 0;
	
	ВерсияФорматаУПД155	= "utd_05_01_05";
	ВерсияФорматаУПД820	= "utd820_05_01_02_hyphen";
	ВерсияФорматаУКД189	= "ucd_05_01_03";
	ВерсияФорматаУКД736	= "ucd736_05_01_01";
	ВерсияФорматаТорг12	= "torg12_05_01_02";
	ВерсияФорматаАкт	= "act_05_01_02";
	ВерсияФорматаСФ		= "invoice_05_02_02";
	ВерсияФорматаКСФ	= "invoicecor_05_02_02";
	ВерсияФорматаФайл	= "v1";
	
	ФункцияПоУмолчанию = "default";
	
	ТипКонтентаУПД820 = ТипыКонтента.Utd820SellerContent;
	ТипКонтентаУПД155 = ТипыКонтента.UtdSellerContent;
	ТипКонтентаУКД189 = ТипыКонтента.UcdSellerContent;
	ТипКонтентаУКД736 = ТипыКонтента.UcdSellerContent;
	ТипКонтентаТОРГ12 = ТипыКонтента.Torg12SellerContent;
	ТипКонтентаАкт172 = ТипыКонтента.AcceptanceCertificateSellerContent;
	ТипКонтентаСФ	  = ТипыКонтента.InvoiceContent;
	ТипКонтентаКСФ	  = ТипыКонтента.InvoiceCorrectionContent;
	ТипКонтентаНеформализованный = ТипыКонтента.NonformalizedContent;
	
	Если ТипДокумента = "UniversalTransferDocument" Тогда
		
		ИмяТипа = ТипДокумента;
		ФункцияДокумента = ФункцияУПД;
		
		Если ВерсияУПД820 Тогда
			
			ТипКонтента = ТипКонтентаУПД820;
			ВерсияФормата = ВерсияФорматаУПД820;
			
		Иначе 
			
			ТипКонтента = ТипКонтентаУПД155;
			ВерсияФормата = ВерсияФорматаУПД155;
			
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = "UniversalCorrectionDocument" Тогда
		
		ИмяТипа 			= ТипДокумента;
		ФункцияДокумента 	= ФункцияУПД;
		
		Если ВерсияУКД736 Тогда
			ТипКонтента 	= ТипКонтентаУКД736;
			ВерсияФормата 	= ВерсияФорматаУКД736;
		Иначе
			ТипКонтента 	= ТипКонтентаУКД189;
			ВерсияФормата 	= ВерсияФорматаУКД189;	
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = "XmlTorg12" Тогда
		
		ИмяТипа = ТипДокумента;
		ФункцияДокумента = ФункцияПоУмолчанию;
		
		Если Не ЗначениеЗаполнено(ФункцияУПД) Тогда
			
			ТипКонтента = ТипКонтентаТОРГ12;
			ВерсияФормата = ВерсияФорматаТорг12;
			
		ИначеЕсли ВерсияУПД820 Тогда
			
			ТипКонтента = ТипКонтентаУПД820;
			ВерсияФормата = ВерсияФорматаУПД820;
			
		Иначе 
			
			ТипКонтента = ТипКонтентаУПД155;
			ВерсияФормата = ВерсияФорматаУПД155;
			
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = "XmlAcceptanceCertificate" Тогда
		
		ИмяТипа = ТипДокумента;
		ФункцияДокумента = ФункцияПоУмолчанию;
		
		Если Не ЗначениеЗаполнено(ФункцияУПД) Тогда
			
			ТипКонтента = ТипКонтентаАкт172;
			ВерсияФормата = ВерсияФорматаАкт;
			
		ИначеЕсли ВерсияУПД820 Тогда
			
			ТипКонтента = ТипКонтентаУПД820;
			ВерсияФормата = ВерсияФорматаУПД820;
			
		Иначе 
			
			ТипКонтента = ТипКонтентаУПД155;
			ВерсияФормата = ВерсияФорматаУПД155;
			
		КонецЕсли;
		
	ИначеЕсли (ТипДокумента = "Invoice" Или ТипДокумента = "InvoiceRevision") Тогда
		
		ИмяТипа = ТипДокумента;
		ФункцияДокумента = ФункцияПоУмолчанию;
		
		Если Не ЗначениеЗаполнено(ФункцияУПД) Тогда
			
			ТипКонтента = ТипКонтентаСФ;
			ВерсияФормата = ВерсияФорматаСФ;
			
		ИначеЕсли ВерсияУПД820 Тогда
			
			ТипКонтента = ТипКонтентаУПД820;
			ВерсияФормата = ВерсияФорматаУПД820;
			
		Иначе
			
			ТипКонтента = ТипКонтентаУПД155;
			ВерсияФормата = ВерсияФорматаУПД155;
			
		КонецЕсли;
		
	ИначеЕсли (ТипДокумента = "InvoiceCorrection" Или ТипДокумента = "InvoiceCorrectionRevision") Тогда
		
		ИмяТипа = ТипДокумента;
		ФункцияДокумента = ФункцияПоУмолчанию;
		
		Если Не ЗначениеЗаполнено(ФункцияУПД) Тогда
			
			ТипКонтента = ТипКонтентаКСФ;
			ВерсияФормата = ВерсияФорматаКСФ;
			
		ИначеЕсли ВерсияУКД736 Тогда
			
			ТипКонтента = ТипКонтентаУКД736;
			ВерсияФормата = ВерсияФорматаУКД736;
			
		Иначе
			
			ТипКонтента = ТипКонтентаУКД189;
			ВерсияФормата = ВерсияФорматаУКД189;
			
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = "NonformalizedProforma" Тогда
		
		ИмяТипа = "ProformaInvoice";
		ФункцияДокумента = ФункцияПоУмолчанию;
		ВерсияФормата = ВерсияФорматаФайл;
		ТипКонтента = ТипКонтентаНеформализованный;
		
	ИначеЕсли ТипДокумента = "ReconciliationAct" Тогда
		
		ИмяТипа = ТипДокумента;
		ФункцияДокумента = ФункцияПоУмолчанию;
		ВерсияФормата = ВерсияФорматаФайл;
		ТипКонтента = ТипКонтентаНеформализованный;
		
	ИначеЕсли ТипДокумента = "Nonformalized" Тогда
		
		ИмяТипа			 = ТипДокумента;
		ФункцияДокумента = ФункцияПоУмолчанию;
		ВерсияФормата	 = "v1";
		ТипКонтента		 = ТипКонтентаНеформализованный;
		
	КонецЕсли;
	
	Результат = ОписаниеФорматаЭлектронногоДокумента(ИмяТипа, ФункцияДокумента, ВерсияФормата);
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеТиповДокументов()
	
	СоответствиеТиповДокументов = Новый Соответствие;
	
	СоответствиеТиповДокументов.Вставить("Счет-фактура"			, "Invoice");
	СоответствиеТиповДокументов.Вставить("Исправление СФ"		, "InvoiceRevision");
	СоответствиеТиповДокументов.Вставить("Корректировочный СФ"	, "InvoiceCorrection");
	СоответствиеТиповДокументов.Вставить("Исправление КСФ"		, "InvoiceCorrectionRevision");
	
	СоответствиеТиповДокументов.Вставить("Акт"					, "XmlAcceptanceCertificate");
	СоответствиеТиповДокументов.Вставить("Торг-12"				, "XmlTorg12");
	СоответствиеТиповДокументов.Вставить("Счет на оплату"		, "NonformalizedProforma");
	СоответствиеТиповДокументов.Вставить("Акт сверки"			, "ReconciliationAct");
	
	СоответствиеТиповДокументов.Вставить(ТипДокументаУПД("СЧФДОП"), "UniversalTransferDocument");
	СоответствиеТиповДокументов.Вставить(ТипДокументаУПД("ДОП")	  , "UniversalTransferDocument");
	СоответствиеТиповДокументов.Вставить(ТипДокументаУПД("СЧФ")	  , "UniversalTransferDocument");
	
	СоответствиеТиповДокументов.Вставить(ТипДокументаУКД("КСЧФДИС")	, "UniversalCorrectionDocument");
	СоответствиеТиповДокументов.Вставить(ТипДокументаУКД("ДИС")	  	, "UniversalCorrectionDocument");
	СоответствиеТиповДокументов.Вставить(ТипДокументаУКД("КСЧФ")	, "UniversalCorrectionDocument");
	
	Возврат СоответствиеТиповДокументов;
	
КонецФункции

Функция ОпределитьDocumentType(Документ, ТипДокумента)
	
	Возврат СоответствиеТиповДокументов()[ТипДокумента];
	
КонецФункции

Функция ТаблицаВыгрузкиВДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент)
	
	Запрос= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц= Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаНачала"	 , ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, ТекущаяДата())));
	
	Запрос.УстановитьПараметр("ИдентификаторЯщикаКонтрагента"  , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваЯщикКонтрагентаПрефикс()));
	Запрос.УстановитьПараметр("ИдентификаторДокументаВДиадок"  , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваИдентификаторДокументаВДиадок()));
	Запрос.УстановитьПараметр("ИдентификаторДокументаВДиадокСч", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваИдентификаторДокументаВДиадокСчет()));
	Запрос.УстановитьПараметр("ИдентификаторДокументаВДиадокСФ", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваИдентификаторДокументаВДиадок("Invoice")));
	
	Запрос.УстановитьПараметр("СвойствоДиадокСтатусОтправляемыхВПФ", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваСтатусОтправляемыхВПФ()));
	
	Запрос.УстановитьПараметр("СЧФДОП_820_736"		, "СЧФДОП_820_736");
	Запрос.УстановитьПараметр("СЧФ_ДОП_820_736"		, "СЧФ_ДОП_820_736");
	Запрос.УстановитьПараметр("СФТОРГ12АКТ_820_736"	, "СФТОРГ12АКТ_820_736");
	
	Запрос.УстановитьПараметр("СЧФДОП_820"		, "СЧФДОП_820");
	Запрос.УстановитьПараметр("СЧФ_ДОП_820"		, "СЧФ_ДОП_820");
	Запрос.УстановитьПараметр("СФТОРГ12АКТ_820"	, "СФТОРГ12АКТ_820");
	Запрос.УстановитьПараметр("ТОРГ12АКТ_820"	, "ТОРГ12АКТ_820");
	
	Запрос.УстановитьПараметр("СЧФДОП" , "СЧФДОП");
	Запрос.УстановитьПараметр("ДОП"	   , "ДОП");
	Запрос.УстановитьПараметр("СЧФ"	   , "СЧФ");
	Запрос.УстановитьПараметр("СЧФ_ДОП", "СЧФ_ДОП");
	
	Запрос.УстановитьПараметр("КСЧФДИС", "КСЧФДИС");
	Запрос.УстановитьПараметр("ДИС"	   , "ДИС");
	Запрос.УстановитьПараметр("КСЧФ"   , "КСЧФ");
	
	Запрос.УстановитьПараметр("СФ"	   	   , "СФ");
	Запрос.УстановитьПараметр("ТОРГ12АКТ"  , "ТОРГ12АКТ");
	Запрос.УстановитьПараметр("СФТОРГ12АКТ", "СФТОРГ12АКТ");
	Запрос.УстановитьПараметр("КСФ"	   	   , "КСФ");
	
	ТаблицаВыгрузкиВДиадок_ПодготовитьВременныеТаблицы_Отборы(Запрос, Организация, Контрагент);
	
	МассивВременныхТаблиц= Модуль_Интеграция().ПодготовитьВТ_СпискаОтправкиДокументов(ТипыДокументов, Запрос);
	
	ТаблицаВыгрузкиВДиадок_ПодготовитьВременнуюТаблицу_ОтборIsMyCounteragent_Записать_ПриглашенияДатаСтатусНеПодходит(Запрос, МассивВременныхТаблиц);
	
	Запрос.Текст= ТаблицаВыгрузкиВДиадок_ТекстЗапроса_РезультатыЗапросов(МассивВременныхТаблиц);
	МассивВременныхТаблиц= Неопределено;
	
	ТаблицаНастроекПечати= ТаблицаВыгрузкиВДиадок_ТаблицаНастроекПечати(Организация);
	
	ТаблицаВыгрузки= ТаблицаВыгрузкиВДиадок_НоваяТаблицаВыгрузки();
	
	Выборка= Запрос.Выполнить().Выбрать();
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	Запрос= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		ДокументТип = ТипЗнч(Выборка.Документ);
		
		НоваяСтрока = ТаблицаВыгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ТипДокумента = Модуль_Интеграция().ПолучитьТипДокумента(НоваяСтрока.Документ, ТаблицаНастроекПечати, НоваяСтрока.ЭтоСчет, НоваяСтрока.ФункцияУПД);
		
		Если НоваяСтрока.ФункцияУПД = "СФ" Тогда
			НоваяСтрока.ФункцияУПД = "СЧФ";
		ИначеЕсли НоваяСтрока.ФункцияУПД = "КСФ" Тогда
			НоваяСтрока.ФункцияУПД = "КСЧФ";
		ИначеЕсли НоваяСтрока.ФункцияУПД = "ТОРГ12АКТ" Тогда
			НоваяСтрока.ФункцияУПД = "ДОП";
		КонецЕсли;
		
		Если ДокументТип = ОсновнойМодуль.ОдинСАдаптер_Документы_ПолучитьТипДокументаСчетФактураВыданный() Тогда
			
			ПараметрыСФ = Модуль_Интеграция().ПолучитьПараметрыСФ(НоваяСтрока.Документ);
			НоваяСтрока.СуммаДокумента = ПредставлениеСуммы(ПараметрыСФ);
			НоваяСтрока.СуммаНДС	   = ПредставлениеСуммыНДС(ПараметрыСФ);
			
		Иначе
			
			НоваяСтрока.СуммаДокумента = Формат(НоваяСтрока.СуммаДокументаЗначение, "ЧДЦ=2");
			НоваяСтрока.СуммаНДС	   = Формат(НоваяСтрока.СуммаНДСЗначение	  , "ЧДЦ=2");
			
		КонецЕсли;
		
		Если ОсновнойМодуль.ФормироватьСфНаОснованииРТУ() = Истина И НоваяСтрока.ТипДокумента = "Счет-фактура" Тогда
			НоваяСтрока.ВидДокумента = "Счет-фактура выданный";
			НоваяСтрока.DocumentType = "Invoice";
		Иначе
			НоваяСтрока.ВидДокумента = НоваяСтрока.Документ.Метаданные().Представление();
			НоваяСтрока.DocumentType = ОпределитьDocumentType(НоваяСтрока.Документ, НоваяСтрока.ТипДокумента);
		КонецЕсли;
		
		НоваяСтрока.ФорматОтправки = ОпределитьФорматОтправки(Выборка.КлючНастройкиФорматовВыгрузки
		, НоваяСтрока.DocumentType, НоваяСтрока.ФункцияУПД);
		
	КонецЦикла;
	
	Возврат ТаблицаВыгрузки;
	
КонецФункции

Процедура ТаблицаВыгрузкиВДиадок_ПодготовитьВременныеТаблицы_Отборы(Запрос, Организация, Контрагент)
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЯщикиКонтрагентов.Значение КАК CounteragentID,
	|	ФормироватьУПД.Значение КАК КлючНастройкиФорматовВыгрузки,
	|	ВЫБОР
	|		КОГДА ФормироватьУПД.Значение = &СФТОРГ12АКТ_820_736
	|			ИЛИ ФормироватьУПД.Значение = &СФТОРГ12АКТ_820
	|			ТОГДА &СФТОРГ12АКТ
	|		КОГДА ФормироватьУПД.Значение = &ТОРГ12АКТ_820
	|			ТОГДА &ТОРГ12АКТ
	|		КОГДА ФормироватьУПД.Значение = &СЧФДОП_820_736
	|			ИЛИ ФормироватьУПД.Значение = &СЧФДОП_820
	|			ТОГДА &СЧФДОП
	|		КОГДА ФормироватьУПД.Значение = &СЧФ_ДОП_820_736
	|			ИЛИ ФормироватьУПД.Значение = &СЧФ_ДОП_820
	|			ТОГДА &СЧФ_ДОП
	|		ИНАЧЕ ФормироватьУПД.Значение
	|	КОНЕЦ КАК ФормироватьУПД,
	|	Контрагенты.ИНН КАК ИНН
	|ПОМЕСТИТЬ ОтборКонтрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Контрагенты.Ссылка = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ИдентификаторЯщикаКонтрагента)
	|			И (НЕ ЯщикиКонтрагентов.Значение В (&МассивПустыхЗначений))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ФормироватьУПД
	|		ПО Контрагенты.Ссылка = ФормироватьУПД.Объект
	|			И (ФормироватьУПД.Свойство = &СвойствоДиадокФормироватьУПДКонтрагент)
	|			И (НЕ ФормироватьУПД.Значение В (&МассивПустыхЗначений))
	|ГДЕ
	|	(&Контрагент = НЕОПРЕДЕЛЕНО
	|			ИЛИ Контрагенты.Ссылка = &Контрагент)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ОтборКонтрагенты.Контрагент КАК Грузополучатель,
	|	ОтборКонтрагенты.CounteragentID,
	|	ОтборКонтрагенты.КлючНастройкиФорматовВыгрузки,
	|	ОтборКонтрагенты.ФормироватьУПД
	|ПОМЕСТИТЬ ОтборГрузополучатели
	|ИЗ
	|	ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ОтборКонтрагенты.ИНН = Контрагенты.ИНН
	|ГДЕ
	|	ОтборКонтрагенты.Контрагент <> Контрагенты.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОтборКонтрагенты.Контрагент,
	|	Контрагенты.Ссылка,
	|	ЯщикиКонтрагентов.Значение,
	|	ФормироватьУПДКонтрагент.Значение,
	|	ВЫБОР
	|		КОГДА ФормироватьУПДКонтрагент.Значение = &СФТОРГ12АКТ_820_736
	|			ИЛИ ФормироватьУПДКонтрагент.Значение = &СФТОРГ12АКТ_820
	|			ТОГДА &СФТОРГ12АКТ
	|		КОГДА ФормироватьУПДКонтрагент.Значение = &ТОРГ12АКТ_820
	|			ТОГДА &ТОРГ12АКТ
	|		КОГДА ФормироватьУПДКонтрагент.Значение = &СЧФДОП_820_736
	|			ИЛИ ФормироватьУПДКонтрагент.Значение = &СЧФДОП_820
	|			ТОГДА &СЧФДОП
	|		КОГДА ФормироватьУПДКонтрагент.Значение = &СЧФ_ДОП_820_736
	|			ИЛИ ФормироватьУПДКонтрагент.Значение = &СЧФ_ДОП_820
	|			ТОГДА &СЧФ_ДОП
	|		ИНАЧЕ ФормироватьУПДКонтрагент.Значение
	|	КОНЕЦ
	|ИЗ
	|	ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ОтборКонтрагенты.ИНН = Контрагенты.ИНН
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО (НЕ ЯщикиКонтрагентов.Значение В (&МассивПустыхЗначений))
	|			И (ЯщикиКонтрагентов.Свойство = &ИдентификаторЯщикаКонтрагента)
	|			И (Контрагенты.Ссылка = ЯщикиКонтрагентов.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ФормироватьУПДКонтрагент
	|		ПО (ФормироватьУПДКонтрагент.Свойство = &СвойствоДиадокФормироватьУПДКонтрагент)
	|			И (НЕ ФормироватьУПДКонтрагент.Значение В (&МассивПустыхЗначений))
	|			И (Контрагенты.Ссылка = ФормироватьУПДКонтрагент.Объект)
	|ГДЕ
	|	ЯщикиКонтрагентов.Значение ЕСТЬ НЕ NULL 
	|	И ОтборКонтрагенты.Контрагент <> Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтправкаНепроведенных.Значение, """") = ""Да""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтпрНеПроведенные,
	|	ЕСТЬNULL(СпособОтправкиСчета.Значение, ""СчетНаОплату"") КАК СпособОтправкиСчета,
	|	ЕСТЬNULL(СпособОтправкиСверки.Значение, ""АктСверкиВзаиморасчетов"") КАК СпособОтправкиСверки,
	|	ЕСТЬNULL(ФормироватьУПД.Значение, ""НЕТ"") КАК КлючНастройкиФорматовВыгрузки,
	|	ВЫБОР
	|		КОГДА ФормироватьУПД.Значение = &СФТОРГ12АКТ_820_736
	|			ИЛИ ФормироватьУПД.Значение = &СФТОРГ12АКТ_820
	|			ТОГДА &СФТОРГ12АКТ
	|		КОГДА ФормироватьУПД.Значение = &ТОРГ12АКТ_820
	|			ТОГДА &ТОРГ12АКТ
	|		КОГДА ФормироватьУПД.Значение = &СЧФДОП_820_736
	|			ИЛИ ФормироватьУПД.Значение = &СЧФДОП_820
	|			ТОГДА &СЧФДОП
	|		КОГДА ФормироватьУПД.Значение = &СЧФ_ДОП_820_736
	|			ИЛИ ФормироватьУПД.Значение = &СЧФ_ДОП_820
	|			ТОГДА &СЧФ_ДОП
	|		ИНАЧЕ ЕСТЬNULL(ФормироватьУПД.Значение, ""НЕТ"")
	|	КОНЕЦ КАК ФормироватьУПД
	|ПОМЕСТИТЬ ОтборОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикДиадокДляОрганизации
	|		ПО Организации.Ссылка = ЯщикДиадокДляОрганизации.Объект
	|			И (ЯщикДиадокДляОрганизации.Свойство = &СвойствоЯщикДиадокДляОрганизации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ОтправкаНепроведенных
	|		ПО Организации.Ссылка = ОтправкаНепроведенных.Объект
	|			И (ОтправкаНепроведенных.Свойство = &СвойствоДиадокОтправкаНепроведенных)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СпособОтправкиСчета
	|		ПО Организации.Ссылка = СпособОтправкиСчета.Объект
	|			И (СпособОтправкиСчета.Свойство = &СвойствоДиадокСпособОтправкиСчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СпособОтправкиСверки
	|		ПО Организации.Ссылка = СпособОтправкиСверки.Объект
	|			И (СпособОтправкиСверки.Свойство = &СвойствоДиадокСпособОтправкиСверки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ФормироватьУПД
	|		ПО Организации.Ссылка = ФормироватьУПД.Объект
	|			И (ФормироватьУПД.Свойство = &СвойствоДиадокФормироватьУПД)
	|ГДЕ
	|	Организации.Ссылка В(&Организация)";
	
	МассивПустыхЗначений = Новый Массив;
	МассивПустыхЗначений.Добавить("");
	МассивПустыхЗначений.Добавить(Неопределено);
	
	Запрос.УстановитьПараметр("МассивПустыхЗначений", МассивПустыхЗначений);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент" , Контрагент);
		
	Запрос.УстановитьПараметр("СвойствоЯщикДиадокДляОрганизации"	  , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваЯщикОрганизации()));
	Запрос.УстановитьПараметр("СвойствоДиадокОтправкаНепроведенных"	  , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваОтправлятьНеПроведенные()));
	Запрос.УстановитьПараметр("СвойствоДиадокСпособОтправкиСчета"	  , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификатрСвойстваСпособОтправкиСчета()));
	Запрос.УстановитьПараметр("СвойствоДиадокСпособОтправкиСверки"	  , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификатрСвойстваСпособОтправкиСверки()));
	Запрос.УстановитьПараметр("СвойствоДиадокФормироватьУПД"		  , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваФормироватьУПД()));
	Запрос.УстановитьПараметр("СвойствоДиадокФормироватьУПДКонтрагент", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваФормироватьУПДКонтрагент()));
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("Организация");
	Запрос.Параметры.Удалить("Контрагент");
	
	Запрос.Параметры.Удалить("СвойствоЯщикДиадокДляОрганизации"	  	 );
	Запрос.Параметры.Удалить("СвойствоДиадокОтправкаНепроведенных"	 );
	Запрос.Параметры.Удалить("СвойствоДиадокСпособОтправкиСчета"  	 );
	Запрос.Параметры.Удалить("СвойствоДиадокСпособОтправкиСверки" 	 );
	Запрос.Параметры.Удалить("СвойствоДиадокФормироватьУПД"		  	 );
	Запрос.Параметры.Удалить("СвойствоДиадокФормироватьУПДКонтрагент");
	
КонецПроцедуры

Процедура ТаблицаВыгрузкиВДиадок_ПодготовитьВременнуюТаблицу_ОтборIsMyCounteragent_Записать_ПриглашенияДатаСтатусНеПодходит(Запрос, МассивВременныхТаблиц)
	
	ОтборIsMyCounteragent= Новый ТаблицаЗначений;
	ОтборIsMyCounteragent.Колонки.Добавить("Продавец"	   , Справочники.ТипВсеСсылки());
	ОтборIsMyCounteragent.Колонки.Добавить("CounteragentID", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200)));
	ОтборIsMyCounteragent.Колонки.Добавить("IsTest"		   , Новый ОписаниеТипов("Булево"));
	
	Запрос.Текст= ТаблицаВыгрузкиВДиадок_ТекстЗапроса_ПродавецCounteragentID(МассивВременныхТаблиц);
	
	ВыборкаПродавец= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПродавец.Следующий() Цикл
		
		ЕстьКонтрагентыСтатусНеПодходит= Ложь;
		СоответствиеCounteragentID= Новый Соответствие;
		
		Выборка= ВыборкаПродавец.Выбрать();
		Пока Выборка.Следующий() Цикл
			СоответствиеCounteragentID.Вставить(Выборка.CounteragentID, NULL);
		КонецЦикла;
		
		ПолучитьМодульПрог("Модуль_РаботаССерверомДиадок").Заполнить_СоответствиеCounteragentID_Значением_IsTest_Только_IsMyCounteragent(ВыборкаПродавец.Продавец, СоответствиеCounteragentID);
		
		Для Каждого КлючИЗначение Из СоответствиеCounteragentID Цикл
			
			Если КлючИЗначение.Значение = NULL Тогда
				ЕстьКонтрагентыСтатусНеПодходит= Истина;
			Иначе
				НоваяСтрока= ОтборIsMyCounteragent.Добавить();
				НоваяСтрока.Продавец= 		ВыборкаПродавец.Продавец;
				НоваяСтрока.CounteragentID= КлючИЗначение.Ключ;
				НоваяСтрока.IsTest= 		КлючИЗначение.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьКонтрагентыСтатусНеПодходит И ВыборкаПродавец.Дата > ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеСвойства(ВыборкаПродавец.Продавец, "ДиадокПриглашенияДатаСтатусНеПодходит", '00010101') Тогда
			ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(ВыборкаПродавец.Продавец, "ДиадокПриглашенияДатаСтатусНеПодходит", ВыборкаПродавец.Дата);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ОтборIsMyCounteragent", ОтборIsMyCounteragent);
	
	Запрос.Текст= "ВЫБРАТЬ Продавец, CounteragentID, IsTest ПОМЕСТИТЬ ОтборIsMyCounteragent ИЗ &ОтборIsMyCounteragent КАК Т";
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ОтборIsMyCounteragent");
	
КонецПроцедуры

Функция ТаблицаВыгрузкиВДиадок_ТекстЗапроса_ПродавецCounteragentID(МассивВременныхТаблиц)
	
	ТекстЗапроса= "";
	Разделитель= "";
	
	Для Каждого ИмяВременнойТаблицы Из МассивВременныхТаблиц Цикл
		
		ТекстЗапроса= ТекстЗапроса + Разделитель + 
		
		"ВЫБРАТЬ
		|	Продавец,
		|	CounteragentID,
		|	МАКСИМУМ(Дата) КАК Дата
		|ИЗ
		|	" + ИмяВременнойТаблицы + "
		|
		|СГРУППИРОВАТЬ ПО
		|	CounteragentID,
		|	Продавец";
		
		Разделитель= РазделительОбъединенияЗапросов(Истина);
		
	КонецЦикла;
	
	ТекстЗапроса= ТекстЗапроса + "
	|ИТОГИ
	|	МАКСИМУМ(Дата)
	|ПО
	|	Продавец";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТаблицаВыгрузкиВДиадок_ТекстЗапроса_РезультатыЗапросов(МассивВременныхТаблиц)
	
	ТекстЗапроса = "";
	Разделитель = "";
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	Т.Документ,
	|	Т.Продавец,
	|	Т.Покупатель,
	|	Т.СуммаДокументаЗначение,
	|	Т.СуммаНДСЗначение,
	|	Т.Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	Т.ID,
	|	Т.CounteragentID,
	|	Т.Грузополучатель,
	|	Т.СостояниеОтправкиДополнительныхВПФ,
	|	Т.ФункцияУПД,
	|	Т.ЭтоСчет,
	|	ЕСТЬNULL(НастройкиКонтрагентов.КлючНастройкиФорматовВыгрузки, НастройкиОрганизаций.КлючНастройкиФорматовВыгрузки) КАК КлючНастройкиФорматовВыгрузки
	|ИЗ
	|	&ИмяВременнойТаблицы КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборIsMyCounteragent КАК ОтборIsMyCounteragent
	|		ПО Т.Продавец = ОтборIsMyCounteragent.Продавец
	|			И Т.CounteragentID = ОтборIsMyCounteragent.CounteragentID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборОрганизации КАК НастройкиОрганизаций
	|		ПО Т.Продавец = НастройкиОрганизаций.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК НастройкиКонтрагентов
	|		ПО Т.Покупатель = НастройкиКонтрагентов.Контрагент";
	
	Для Каждого ИмяВременнойТаблицы Из МассивВременныхТаблиц Цикл
		
		ТекстЗапроса = ТекстЗапроса
		+ Разделитель + СтрЗаменить(ШаблонТекстаЗапроса, "&ИмяВременнойТаблицы", ИмяВременнойТаблицы);
		
		Разделитель= РазделительОбъединенияЗапросов();
		
	КонецЦикла;
	
	ТекстЗапроса= ТекстЗапроса + "
	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТаблицаВыгрузкиВДиадок_НоваяТаблицаВыгрузки()
	
	СправочникиТипВсеСсылки= 	 Справочники.ТипВсеСсылки();
	ДокументыТипВсеСсылки= 	 	 Документы.ТипВсеСсылки();
	ОписаниеТиповМоментВремени=	 Новый ОписаниеТипов("МоментВремени");
	ОписаниеТиповСтрока=	 	 Новый ОписаниеТипов("Строка");
	ОписаниеТиповБулево=	 	 Новый ОписаниеТипов("Булево");
	ОписаниеТиповЧисло= 	 	 Новый ОписаниеТипов("Число");
	ОписаниеТиповДата=	 	 	 Новый ОписаниеТипов("Дата");
	
	НоваяТаблицаВыгрузки= Новый ТаблицаЗначений;
	
	НоваяТаблицаВыгрузки.Колонки.Добавить("Документ"				, ДокументыТипВсеСсылки);
	НоваяТаблицаВыгрузки.Колонки.Добавить("Продавец"				, СправочникиТипВсеСсылки);
	НоваяТаблицаВыгрузки.Колонки.Добавить("Покупатель"				, СправочникиТипВсеСсылки);
	НоваяТаблицаВыгрузки.Колонки.Добавить("Грузополучатель"			, СправочникиТипВсеСсылки);
	НоваяТаблицаВыгрузки.Колонки.Добавить("СуммаДокументаЗначение"	, ОписаниеТиповЧисло);
	НоваяТаблицаВыгрузки.Колонки.Добавить("СуммаНДСЗначение"		, ОписаниеТиповЧисло);
	НоваяТаблицаВыгрузки.Колонки.Добавить("Валюта"					, СправочникиТипВсеСсылки);
	НоваяТаблицаВыгрузки.Колонки.Добавить("Проведен"				, ОписаниеТиповБулево);
	НоваяТаблицаВыгрузки.Колонки.Добавить("Дата"					, ОписаниеТиповДата);
	НоваяТаблицаВыгрузки.Колонки.Добавить("Номер"					, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("ID"						, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("ФункцияУПД"				, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("МоментВремени"			, ОписаниеТиповМоментВремени);
	НоваяТаблицаВыгрузки.Колонки.Добавить("CounteragentID"			, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("СуммаДокумента"			, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("СуммаНДС"				, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("ТипДокумента"			, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("ЭтоСчет"					, ОписаниеТиповБулево);
	НоваяТаблицаВыгрузки.Колонки.Добавить("IsTest"					, ОписаниеТиповБулево);
	НоваяТаблицаВыгрузки.Колонки.Добавить("СостояниеОтправкиДополнительныхВПФ", ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("DocumentType"			, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("ВидДокумента"			, ОписаниеТиповСтрока);
	НоваяТаблицаВыгрузки.Колонки.Добавить("ФорматОтправки");
	
	Возврат НоваяТаблицаВыгрузки;
	
КонецФункции

Функция ТаблицаВыгрузкиВДиадок_ТаблицаНастроекПечати(Организация)
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(ПечатныеФормыДляТоваров.Значение, ""Торг-12"") КАК ПечатнаяФормаДляТоваров,
	|	ЕСТЬNULL(ПечатныеФормыДляУслуг.Значение, ""Акт"") КАК ПечатнаяФормаДляУслуг
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиДиадок
	|		ПО Организации.Ссылка = ЯщикиДиадок.Объект
	|			И (ЯщикиДиадок.Свойство = &СвойствоЯщикДиадокДляОрганизации)
	|			И (ЯщикиДиадок.Значение <> """")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ПечатныеФормыДляТоваров
	|		ПО Организации.Ссылка = ПечатныеФормыДляТоваров.Объект
	|			И (ПечатныеФормыДляТоваров.Объект ССЫЛКА Справочник.Организации)
	|			И (ПечатныеФормыДляТоваров.Свойство = &СвойствоПечатнаяФормаДляТоваров)
	|			И (ПечатныеФормыДляТоваров.Значение <> """")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ПечатныеФормыДляУслуг
	|		ПО Организации.Ссылка = ПечатныеФормыДляУслуг.Объект
	|			И (ПечатныеФормыДляУслуг.Объект ССЫЛКА Справочник.Организации)
	|			И (ПечатныеФормыДляУслуг.Свойство = &СвойствоПечатнаяФормаДляУслуг)
	|			И (ПечатныеФормыДляУслуг.Значение <> """")
	|ГДЕ
	|	Организации.Ссылка В (&Организация)");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.УстановитьПараметр("СвойствоЯщикДиадокДляОрганизации", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваЯщикОрганизации()));
	Запрос.УстановитьПараметр("СвойствоПечатнаяФормаДляТоваров"	,ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваПечатнаяФормаДляТоваров()));
	Запрос.УстановитьПараметр("СвойствоПечатнаяФормаДляУслуг"	,ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").ИдентификаторСвойстваПечатнаяФормаДляУслуг()));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает строку представления суммы счета-фактуры
// Для корректировочных счетов-фактур отображает суммы увеличения и уменьшения
//
// Параметры:
//  ПараметрыСФ - Структура - см. функцию модуля интеграции ПолучитьПараметрыСФ()
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеСуммы(ПараметрыСФ)
	
	СуммаДокумента = Формат(ПараметрыСФ.СуммаДокумента, "ЧДЦ=2");
	СуммаУвеличение = Формат(ПараметрыСФ.СуммаУвеличение, "ЧДЦ=2");
	СуммаУменьшение = Формат(ПараметрыСФ.СуммаУменьшение, "ЧДЦ=2");
	
	Если ЗначениеЗаполнено(СуммаУвеличение) И ЗначениеЗаполнено(СуммаУменьшение) Тогда
		
		Результат = "+" + СуммаУвеличение + " -" + СуммаУменьшение;
		
	ИначеЕсли ЗначениеЗаполнено(СуммаУвеличение) Тогда
		
		Результат = "+" + СуммаУвеличение;
		
	ИначеЕсли ЗначениеЗаполнено(СуммаУменьшение) Тогда
		
		Результат = "-" + СуммаУменьшение;
		
	Иначе
		
		Результат = СуммаДокумента;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строку представления суммы НДС счета-фактуры
// Для корректировочных счетов-фактур отображает суммы увеличения НДС и уменьшения НДС
//
// Параметры:
//  ПараметрыСФ - Структура - см. функцию модуля интеграции ПолучитьПараметрыСФ()
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеСуммыНДС(ПараметрыСФ)
	
	СуммаНДСДокумента = Формат(ПараметрыСФ.СуммаНДСДокумента, "ЧДЦ=2");
	СуммаНДСУвеличение = Формат(ПараметрыСФ.СуммаНДСУвеличение, "ЧДЦ=2");
	СуммаНДСУменьшение = Формат(ПараметрыСФ.СуммаНДСУменьшение, "ЧДЦ=2");
	
	Если ЗначениеЗаполнено(СуммаНДСУвеличение) И ЗначениеЗаполнено(СуммаНДСУменьшение) Тогда
		
		Результат = "+" + СуммаНДСУвеличение + " -" + СуммаНДСУменьшение;
		
	ИначеЕсли ЗначениеЗаполнено(СуммаНДСУвеличение) Тогда
		
		Результат = "+" + СуммаНДСУвеличение;
		
	ИначеЕсли ЗначениеЗаполнено(СуммаНДСУменьшение) Тогда
		
		Результат = "-" + СуммаНДСУменьшение;
		
	Иначе
		
		Результат = СуммаНДСДокумента;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} ФормированиеТЗВыгрузкиВДиадок

//{ ОтправкаДокументов

Процедура УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок) Экспорт  
	
	ДокументОбъект	= ДокументСсылка.ПолучитьОбъект();
	Записать		= Ложь;
	Реквизиты		= ДокументОбъект.Метаданные().Реквизиты;
	
	Если Реквизиты.Найти("Выставлен") <> Неопределено Тогда 
		ДокументОбъект.Выставлен = Истина;
		Записать = Истина;
	КонецЕсли;
	Если Реквизиты.Найти("КодСпособаВыставления") <> Неопределено Тогда 
		ДокументОбъект.КодСпособаВыставления = 2;
		Записать = Истина;
	КонецЕсли;
	Если Реквизиты.Найти("ДатаВыставления") <> Неопределено Тогда 
		ДокументОбъект.ДатаВыставления = ТекущаяДата();
		Записать = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстКомментарияДиадок) Тогда 
		ДокументОбъект.Комментарий = ?(ЗначениеЗаполнено(ДокументОбъект.Комментарий), ДокументОбъект.Комментарий + " ", "") + ТекстКомментарияДиадок;
		Записать = Истина;
	КонецЕсли;	 
	
	Если Записать Тогда 
		Попытка
			ДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			ДокументОбъект.Записать();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

//} ОтправкаДокументов

//{ ПолучениеДанныхДляФУФ

Функция ГрузополучательПоДокументу(ДокументСсылка) Экспорт
	
	Результат = Неопределено;
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Если ПолучитьМодульПрог("Модуль_Интеграция").ЭтоРТУ_ДД(ДокументСсылка) Тогда 
		
		Если МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") <> Неопределено Тогда
			Результат = ДокументСсылка.Грузополучатель;
		Иначе
			Результат = ДокументСсылка.Контрагент;
		КонецЕсли;
		
	ИначеЕсли ПолучитьМодульПрог("Модуль_Интеграция").ЭтоСФ(ДокументСсылка) Тогда
		
		Если МетаданныеДокумента.ТабличныеЧасти.Найти("ДокументыОснования") <> Неопределено 
			И ДокументСсылка.ДокументыОснования.Количество()>0 
			И (		ТипЗнч(ДокументСсылка.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				ИЛИ ТипЗнч(ДокументСсылка.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации")
				ИЛИ ТипЗнч(ДокументСсылка.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")	) Тогда
				
			Результат = ДокументСсылка.ДокументыОснования[0].ДокументОснование.Грузополучатель;
			
		ИначеЕсли НЕ МетаданныеДокумента.Реквизиты.Найти("ДокументОснование") = Неопределено
					И (		Метаданные.Документы.Найти("РеализацияТоваров") <> Неопределено И ТипЗнч(ДокументСсылка.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров")
						ИЛИ Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено И ТипЗнч(ДокументСсылка.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")	) Тогда 
			
			Результат = ДокументСсылка.ДокументОснование.Контрагент;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтрагентПоДокументу(ДокументСсылка) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ДокументСсылка.Метаданные().Реквизиты.Найти("Контрагент") = Неопределено Тогда
		
		Результат = ДокументСсылка.Контрагент;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоговорПоДокументу(ДокументСсыдка) Экспорт 
	Возврат ?(ДокументСсыдка.метаданные().реквизиты.найти("ДоговорКонтрагента")<>Неопределено, ДокументСсыдка.ДоговорКонтрагента, ДокументСсыдка.ДоговорВзаиморасчетов);
КонецФункции	

Функция ПолучитьСуммуДокумента(ДокументСсылка) Экспорт 
	Если ДокументСсылка.метаданные().реквизиты.найти("СуммаДокумента")<>Неопределено  Тогда
		Возврат ДокументСсылка.СуммаДокумента
	Иначе 
		Возврат 0;
	КонецЕсли;
КонецФункции	

Функция ПолучитьСуммуНДС(ДокументСсылка) Экспорт 
	
	результат = 0;
	
	Если ДокументСсылка.метаданные().ТабличныеЧасти.Найти("Товары")<>Неопределено Тогда 
		Если ДокументСсылка.метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("СуммаНДС") <> Неопределено Тогда
			результат = результат + ДокументСсылка.Товары.Итог("СуммаНДС");
		ИначеЕсли ДокументСсылка.метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("СтавкаНДСВознаграждения") <> Неопределено Тогда
			результат = результат + ДокументСсылка.Товары.Итог("СтавкаНДСВознаграждения");
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументСсылка.метаданные().ТабличныеЧасти.Найти("Услуги")<>Неопределено Тогда 
		результат = результат+  ДокументСсылка.Услуги.Итог("СуммаНДС")
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции	

Функция ПолучитьФИОРуководителяДляСчета(ДанныеШапки, ПараметрыОтправкиНаСогласование) Экспорт
	
	Если ПараметрыОтправкиНаСогласование <> Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОРуководителя = ?(ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта), ПараметрыОтправкиНаСогласование.ФИОПодписанта, "_");
		Иначе
			ФИОРуководителя = ?(ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПолучателя), ПараметрыОтправкиНаСогласование.ФИОПолучателя, "_");
		КонецЕсли;
	Иначе 	
		ФИОРуководителя = ПолучитьМодульПрог("Модуль_РаботаССерверомДиадок").ДанныеКонтекстаДиадок(ДанныеШапки.Организация, "ДанныеСотрудника").ФИО;
	КонецЕсли;
	
	Возврат ФИОРуководителя; 
	
КонецФункции

//} ПолучениеДанныхДляФУФ

//{ СвязиМеждуДокументами

Функция ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент ) Экспорт
	
	Если первыйДокумент = ВторойДокумент Тогда
		Возврат Истина
	ИначеЕсли (ПервыйДокумент.Метаданные().реквизиты.найти("ДокументОснование")<>Неопределено)
		И (ПервыйДокумент.ДокументОснование = ВторойДокумент) Тогда
		Возврат Истина
	ИначеЕсли (первыйДокумент.метаданные().ТабличныеЧасти.найти("ДокументыОснования")<>Неопределено) И
		(ПервыйДокумент.метаданные().ТабличныеЧасти.ДокументыОснования.Реквизиты.Найти("ДокументОснование") <> Неопределено) Тогда
		Для каждого стр Из ПервыйДокумент.ДокументыОснования Цикл 
			Если стр.ДокументОснование = ВторойДокумент Тогда
				Возврат Истина
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка) Экспорт 
	Если НЕ ДокументСсылка.Метаданные().Реквизиты.Найти("ДокументРеализации") = Неопределено Тогда
		Возврат ДокументСсылка.ДокументРеализации
	Иначе
		Возврат ДокументСсылка.ДокументОснование
	КонецЕсли;
КонецФункции

Функция ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента) Экспорт
	
	Если ТипНовогоДокумента = "InvoiceRevision" ИЛИ ТипНовогоДокумента = "InvoiceCorrectionRevision" Тогда
		Корр = ПолучитьМодульПрог("Модуль_Интеграция").ПолучитьПоследнееИсправление(КорректировкаРеализацииОснование, Истина);
		КорректировкаРеализацииСсылка = ПолучитьМодульПрог("Модуль_Интеграция").ПолучитьДочернееИсправление(Корр);
	Иначе
		Корр = ПолучитьМодульПрог("Модуль_Интеграция").ПолучитьПоследнееИсправление(КорректировкаРеализацииОснование, Ложь);
		КорректировкаРеализацииСсылка = ПолучитьМодульПрог("Модуль_Интеграция").ПолучитьНеотправленнуюКорректировку(Корр);
	КонецЕсли;
	
	ИсправленныйСчетФактураСсылка = ПолучитьМодульПрог("Модуль_Интеграция").СчетФактураВыданныйПоДокументуОснование(КорректировкаРеализацииСсылка);
	
	Результат = Новый Структура("КорректировкаРеализацииОснование, КорректировкаРеализацииСсылка, ИсправленныйСчетФактураСсылка");
	
	Результат.КорректировкаРеализацииОснование	= Корр;
	Результат.КорректировкаРеализацииСсылка 	= КорректировкаРеализацииСсылка;
	Результат.ИсправленныйСчетФактураСсылка 	= ИсправленныйСчетФактураСсылка;
	
	Возврат Результат;
	
КонецФункции

//} СвязиМеждуДокументами

//{ СозданиеДокументов1С

Функция ТекстЗапросаПодборНакладных(Direction) Экспорт
	
	Если Метаданные.Документы.Найти("СчетФактураПолученный") <> Неопределено Тогда
		
		Если Метаданные.Документы.СчетФактураПолученный.ТабличныеЧасти.Найти("ДокументыОснования") = Неопределено Тогда
			
			ЗапросДокументыОснования = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Т.Ссылка,
			|	Т.ДокументОснование
			|ПОМЕСТИТЬ ДокОснование
			|ИЗ
			|	Документ.СчетФактураПолученный КАК Т
			|ГДЕ
			|	Т.Организация = &Организация
			|;";
			
		Иначе
			
			ЗапросДокументыОснования = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
			|	Т.Ссылка,
			|	Т.ДокументОснование
			|ПОМЕСТИТЬ ДокОснование
			|ИЗ
			|	Документ.СчетФактураПолученный.ДокументыОснования КАК Т
			|ГДЕ
			|	Т.Ссылка.Организация = &Организация
			|;";
			
		КонецЕсли;
		
	ИначеЕсли Метаданные.Документы.Найти("РегистрацияСчетаФактуры") <> Неопределено Тогда
		
		ЗапросДокументыОснования = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Т.Ссылка,
		|	Т.Основание КАК ДокументОснование
		|ПОМЕСТИТЬ ДокОснование
		|ИЗ
		|	Документ.РегистрацияСчетаФактуры.СоставНДС КАК Т
		|ГДЕ
		|	Т.Ссылка.Фирма = &Организация
		|;";
		
	Иначе
		
		ЗапросДокументыОснования= 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Ссылка,
		|	Т.Ссылка КАК ДокументОснование
		|ПОМЕСТИТЬ ДокОснование
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК Т
		|ГДЕ
		|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Т.Фирма = &Организация
		|	И Т.НомерСчетаФактуры <> """"
		|	И НЕ Т.ПометкаУдаления
		|	И Т.Контрагент В (&СписокКонтрагентов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.Ссылка,
		|	Т.Ссылка
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК Т
		|ГДЕ
		|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Т.Фирма = &Организация
		|	И Т.НомерСчетаФактуры <> """"
		|	И НЕ Т.ПометкаУдаления
		|	И Т.Контрагент В (&СписокКонтрагентов)
		|;";
		
	КонецЕсли;
	
	ТекстЗапроса = ЗапросДокументыОснования + "
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ДокументСсылка,
	|	ВложенныйЗапрос.Комментарий,
	|	ВложенныйЗапрос.Проведен,
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.Номер,
	|	ВложенныйЗапрос.Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДокОснование.ДокументОснование, 0) = 0
	|			Тогда Ложь		
	|		ИНАЧЕ Истина
	|	КОНЕЦ КАК ЕстьОснование,
	|    Ложь как ВКЛ,
	|	ВложенныйЗапрос.ДатаВходящегоДокумента,
	|	ВложенныйЗапрос.НомерВходящегоДокумента
	|ИЗ
	|(" + ТекстЗапросаОснованийСчетовФактур(Direction) + ") КАК ВложенныйЗапрос
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДокОснование КАК ДокОснование
	|	ПО ВложенныйЗапрос.ДокументСсылка = ДокОснование.ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.МоментВремени УБЫВ";
	
	
	Если Direction = "Outbound" Тогда 
		
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ПоступлениеТоваровУслуг", "Документ.РеализацияТоваровУслуг");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ВозвратТоваровОтПокупателя", "Документ.ВозвратТоваровПоставщику");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.СчетФактураПолученный", "Документ.СчетФактураВыданный");
		
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.ДатаВходящегоДокумента", "Т.Дата");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.НомерВходящегоДокумента", "Т.Номер");
		
	КонецЕсли;	
	
	Если ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияАльфаАвто41" Тогда
		
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ПоступлениеТоваровУслуг", "Документ.ПоступлениеТоваров");	
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ВозвратТоваровОтПокупателя", "Документ.ВозвратОтПокупателя");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", "Документ.РеализацияТоваров");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ВозвратТоваровПоставщику", "Документ.ВозвратПоставщику");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.СчетФактураПолученный.ДокументыОснования", "Документ.СчетФактураПолученный");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.СчетФактураВыданный.ДокументыОснования", "Документ.СчетФактураВыданный");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Т.ДатаВходящегоДокумента", "Т.ВхДокДата");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Т.НомерВходящегоДокумента", "Т.ВхДокНомер");
		
	КонецЕсли;
	
	Если ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияДалионУМ" Тогда
		
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ПоступлениеТоваровУслуг", "Документ.ПриходнаяНакладная");
		
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.Организация", "Т.Фирма");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.ДатаВходящегоДокумента", "Т.ДатаСчетаФактуры");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.НомерВходящегоДокумента", "Т.ВходящийНомер");
		
	КонецЕсли;
	
	Если ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияАсторТД" Тогда
		
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ПоступлениеТоваровУслуг", "Документ.ПриходнаяНакладная");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Документ.ВозвратТоваровОтПокупателя", "Документ.ВозвратнаяНакладная");
		
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.Организация" 			, "Т.Фирма");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.ДатаВходящегоДокумента" 	, "Т.ДатаДокумента");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.НомерВходящегоДокумента" , "Т.НомерДокумента");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Т.СуммаДокумента" 			, "Т.ИтогоВсего");
		
	КонецЕсли;
	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПодборСчетовФактур(Direction) Экспорт
	
	Если ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияУТ102" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Док.ДокументОснование.Контрагент КАК Контрагент,
		|	Док.Организация КАК Организация,
		|	Док.Ссылка КАК ДокументСсылка,
		|	Док.Проведен КАК Проведен,			
		|	Док.Дата КАК Дата,
		|	Док.Номер КАК Номер,
		|	Док.ДокументОснование.СуммаДокумента КАК Сумма,
		|	Док.Комментарий КАК Комментарий,
		|	Док.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	Док.НомерВходящегоДокумента КАК НомерВходящегоДокумента
		|ИЗ
		|	Документ.СчетФактураПолученный КАК Док
		|ГДЕ
		|	Док.Организация = &Организация
		|	И Док.ДокументОснование.Контрагент В(&СписокКонтрагентов)
		|	И Док.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания"	
		
	ИначеЕсли ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияДалионУМ" ИЛИ ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияАсторТД" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Док.Контрагент КАК Контрагент,
		|	Док.Фирма КАК Организация,
		|	Док.Ссылка КАК ДокументСсылка,
		|	Док.Проведен КАК Проведен,
		|	Док.Дата КАК Дата,
		|	Док.Номер КАК Номер,
		|	Док.СуммаДокумента КАК Сумма,
		|	Док.Комментарий КАК Комментарий,
		|	Док.ДатаСчетаФактуры КАК ДатаВходящегоДокумента,
		|	Док.НомерСчетаФактуры КАК НомерВходящегоДокумента
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК Док
		|ГДЕ
		|	Док.Фирма = &Организация
		|	И Док.Контрагент В(&СписокКонтрагентов)
		|	И Док.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания"	
		
	Иначе
		ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	Док.Контрагент КАК Контрагент,
		|	Док.Организация КАК Организация,
		|	Док.Ссылка КАК ДокументСсылка,
		|	Док.Проведен КАК Проведен,
		|	Док.Дата КАК Дата,
		|	Док.Номер КАК Номер,
		|	Док.СуммаДокумента КАК Сумма,
		|	Док.Комментарий КАК Комментарий,
		|	Док.ДатаВходящегоДокумента как ДатаВходящегоДокумента,
		|	Док.НомерВходящегоДокумента  как  НомерВходящегоДокумента
		|ИЗ
		|	Документ.СчетФактураПолученный КАК Док
		|ГДЕ
		|	Док.Организация = &Организация
		|	И Док.Контрагент В(&СписокКонтрагентов)
		|	И Док.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	КонецЕсли;
	
	Если Direction = "Outbound" Тогда 
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "СчетФактураПолученный", "СчетФактураВыданный");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Док.ДатаВходящегоДокумента", "Док.Дата");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Док.НомерВходящегоДокумента", "Док.Номер");
	ИначеЕсли 	ОсновнойМодуль.ПолучитьПрофильКонфигурации().ХранениеНастроекПользователей.Вариант = "Рарус" Тогда
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Док.ДатаВходящегоДокумента", "Док.ВхДокДата");
		ТекстЗапроса = стрЗаменить(ТекстЗапроса, "Док.НомерВходящегоДокумента", "Док.ВхДокНомер");
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	Если ОсновнойМодуль.ПолучитьПрофильКонфигурации().ХранениеНастроекПользователей.Вариант = "Рарус" Тогда
		Если (ТипЗнч(докСсылка) = Тип("ДокументСсылка.ПоступлениеТоваров"))
			И (докСсылка.ВхДокДата <> ДатаВходящегоДокумента ИЛИ докСсылка.ВхДокНомер <> НомерВходящегоДокумента) Тогда
			Попытка
				Объект = докСсылка.ПолучитьОбъект();
				Объект.ВхДокДата = ДатаВходящегоДокумента;
				Объект.ВхДокНомер = НомерВходящегоДокумента;
				Объект.Записать();
				
				Сообщить("Изменены следующие реквизиты: " + СписокОтличающихсяРеквизитов + " 
				|у документа: " + докСсылка);
			Исключение
				Сообщить("Не удалось изменить следующие реквизиты: " + СписокОтличающихсяРеквизитов + "
				|у документа: " + докСсылка);
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		
		Если ((докСсылка.Метаданные().Реквизиты.Найти("ДатаВходящегоДокумента") <> Неопределено) И (докСсылка.Метаданные().Реквизиты.Найти("НомерВходящегоДокумента") <> Неопределено))
			И (докСсылка.ДатаВходящегоДокумента <> ДатаВходящегоДокумента ИЛИ докСсылка.НомерВходящегоДокумента <> НомерВходящегоДокумента) Тогда
			Попытка
				Объект = докСсылка.ПолучитьОбъект();
				Объект.ДатаВходящегоДокумента = ДатаВходящегоДокумента;
				Объект.НомерВходящегоДокумента = НомерВходящегоДокумента;
				Объект.Записать();
				
				Сообщить("Изменены следующие реквизиты: " + СписокОтличающихсяРеквизитов + "
				|у документа: " + докСсылка);
			Исключение
				Сообщить("Не удалось изменить следующие реквизиты: " + СписокОтличающихсяРеквизитов + "
				|у документа: " + докСсылка);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Функция ТекстЗапросаОснованийСчетовФактур(Direction)
	
	ЗапросыОбъединения = Новый Массив;
	ЗапросыОбъединения.Добавить(ТекстЗапросаОснованийСФ_ПоступлениеТоваровУслуг());
	ЗапросыОбъединения.Добавить(ТекстЗапросаОснованийСФ_ВозвратТоваровОтПокупателя());
	
	ДляВходящихДокументов = (Direction = "Inbound");
	
	Если ДляВходящихДокументов И ИспользуетсяПоступлениеДопРасходов() Тогда
		ЗапросыОбъединения.Добавить(ТекстЗапросаОснованийСФ_ПоступлениеДопРасходов());
	КонецЕсли;
	
	Если ДляВходящихДокументов И ИспользуетсяПоступлениеНМА() Тогда
		ЗапросыОбъединения.Добавить(ТекстЗапросаОснованийСФ_ПоступлениеНМА());
	КонецЕсли;
	
	Если ДляВходящихДокументов И ИспользуетсяПоступлениеАвтомобилей() Тогда
		ЗапросыОбъединения.Добавить(ТекстЗапросаОснованийСФ_ПоступлениеАвтомобилей());
	КонецЕсли;
	
	Если ДляВходящихДокументов И ИспользуетсяСписаниеСРасчетногоСчета() Тогда
		ЗапросыОбъединения.Добавить(ТекстЗапросаОснованийСФ_СписаниеСРасчетногоСчета());
	КонецЕсли;
	
	Результат = "";
	
	Для Каждого ТекстЗапроса Из ЗапросыОбъединения Цикл
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Результат = Результат + РазделительОбъединенияЗапросов();
		КонецЕсли;
		
		Результат = Результат + ТекстЗапроса;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаОснованийСФ_ПоступлениеТоваровУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.Ссылка КАК ДокументСсылка,
	|	Т.Проведен КАК Проведен,
	|	Т.Дата КАК Дата,
	|	Т.Номер КАК Номер,
	|	Т.СуммаДокумента КАК Сумма,
	|	Т.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	Т.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	Т.МоментВремени КАК МоментВремени,
	|	Т.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Т.Организация = &Организация
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Контрагент В(&СписокКонтрагентов)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаОснованийСФ_ВозвратТоваровОтПокупателя()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.Ссылка КАК ДокументСсылка,
	|	Т.Проведен КАК Проведен,
	|	Т.Дата КАК Дата,
	|	Т.Номер КАК Номер,
	|	Т.СуммаДокумента КАК Сумма,
	|	Т.Дата КАК ДатаВходящегоДокумента,
	|	Т.Номер КАК НомерВходящегоДокумента,
	|	Т.МоментВремени КАК МоментВремени,
	|	Т.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Т.Организация = &Организация
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Контрагент В(&СписокКонтрагентов)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаОснованийСФ_ПоступлениеДопРасходов()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.Ссылка КАК ДокументСсылка,
	|	Т.Проведен КАК Проведен,
	|	Т.Дата КАК Дата,
	|	Т.Номер КАК Номер,
	|	Т.СуммаДокумента КАК Сумма,
	|	Т.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	Т.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	Т.МоментВремени КАК МоментВремени,
	|	Т.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ПоступлениеДопРасходов КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Т.Организация = &Организация
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Контрагент В(&СписокКонтрагентов)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаОснованийСФ_ПоступлениеНМА()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.Ссылка КАК ДокументСсылка,
	|	Т.Проведен КАК Проведен,
	|	Т.Дата КАК Дата,
	|	Т.Номер КАК Номер,
	|	Т.СуммаДокумента КАК Сумма,
	|	Т.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	Т.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	Т.МоментВремени КАК МоментВремени,
	|	Т.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ПоступлениеНМА КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Т.Организация = &Организация
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Контрагент В(&СписокКонтрагентов)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаОснованийСФ_ПоступлениеАвтомобилей()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.Ссылка КАК ДокументСсылка,
	|	Т.Проведен КАК Проведен,
	|	Т.Дата КАК Дата,
	|	Т.Номер КАК Номер,
	|	Т.СуммаДокумента КАК Сумма,
	|	Т.Дата КАК ДатаВходящегоДокумента,
	|	Т.Номер КАК НомерВходящегоДокумента,
	|	Т.МоментВремени КАК МоментВремени,
	|	Т.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Т.Организация = &Организация
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Контрагент В(&СписокКонтрагентов)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаОснованийСФ_СписаниеСРасчетногоСчета()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.Ссылка КАК ДокументСсылка,
	|	Т.Проведен КАК Проведен,
	|	Т.Дата КАК Дата,
	|	Т.Номер КАК Номер,
	|	Т.СуммаДокумента КАК Сумма,
	|	Т.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	Т.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	Т.МоментВремени КАК МоментВремени,
	|	Т.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Т.Организация = &Организация
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Контрагент В(&СписокКонтрагентов)";
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяПоступлениеДопРасходов()
	
	Результат = Метаданные.Документы.Найти("ПоступлениеДопРасходов") <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяПоступлениеНМА()
	
	Результат = ОсновнойМодуль.ПолучитьПрофильКонфигурации().НастройкиПоступления.ПоступлениеНМА;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяСписаниеСРасчетногоСчета()
	
	Результат = ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияБух";
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяПоступлениеАвтомобилей()
	
	Результат = Ложь;
	
	Если ОсновнойМодуль.ИмяМодуляИнтеграции = "Модуль_ИнтеграцияАльфаАвто41" 
		И Метаданные.Документы.Найти("ПоступлениеАвтомобилей") <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} СозданиеДокументов1С

//{Внешние печатные формы

Функция ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ) Экспорт
	
	ВнешняяОбработка = ВПФ_ВнешняяОбработка(ИдентификаторВПФ);
	
	ДополнительныеПараметры = ВПФ_ДополнительныеПараметры(ИдентификаторВПФ);
	
	Если ТипЗнч(ВнешняяОбработка) = Тип("Строка") Тогда
		ВызватьИсключение "Не удалось создать внешнюю обработку: " + ВнешняяОбработка;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ВнешняяОбработка, Новый Структура("СсылкаНаОбъект, ДополнительныеПараметры", СсылкаНаОбъект, ДополнительныеПараметры));
	
	ВПФ = ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ).Ссылка;
	
	Попытка
		ТабДокумент = ВнешняяОбработка.Печать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ВызватьИсключение("Не удалось сформировать внешнюю печатную форму " + ВПФ + " для документа " + СсылкаНаОбъект + " по причине: " + Символы.ПС + ОписаниеОшибки);
	КонецПопытки;
	
	Если НЕ ТипЗнч(ТабДокумент) = Тип("ТабличныйДокумент") Тогда
		ВызватьИсключение
		"
		|Документ: " + СсылкаНаОбъект + "
		|Внешняя печатная форма: " + ВПФ + "
		|Вместо табличного документа получено значение: " + ТипЗнч(ТабДокумент);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции) Экспорт
	
	ВнешняяОбработка = ВПФ_ВнешняяОбработка(ИдентификаторВПФ);
	
	Если ТипЗнч(ВнешняяОбработка) = Тип("Строка") Тогда
		ВызватьИсключение "Не удалось создать внешнюю обработку: " + ВнешняяОбработка;
	КонецЕсли;
	
	Попытка
		Результат = Вычислить("ВнешняяОбработка." + ИмяФункции + "(ПараметрыФункции)");
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат
	
КонецФункции

Функция ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ) Экспорт
	
	ПолноеИмяВПФ = ВПФ.Метаданные().ПолноеИмя();
	
	НомерСтроки = 0;
	
	Если СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".ТабличнаяЧасть.Принадлежность") Тогда
		
		ПолноеИмяОбъекта = СсылкаНаОбъект.Метаданные().ПолноеИмя();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВПФ", ВПФ);
		
		Если СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".ТабличнаяЧасть.Принадлежность.Реквизит.МетаданныеОбъекта") Тогда
			
			УсловиеПоДокументу = " И МетаданныеОбъекта = &МетаданныеОбъекта";
			Запрос.УстановитьПараметр("МетаданныеОбъекта", ПолноеИмяОбъекта);
			
		ИначеЕсли СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".ТабличнаяЧасть.Принадлежность.Реквизит.СсылкаОбъекта") Тогда
			
			УсловиеПоДокументу = " И СсылкаОбъекта = &СсылкаОбъекта";
			Запрос.УстановитьПараметр("СсылкаОбъекта", ПредопределенноеЗначение(ПолноеИмяОбъекта + ".ПустаяСсылка"));
			
		Иначе
			УсловиеПоДокументу = "";
		КонецЕсли;
		
		Если СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".ТабличнаяЧасть.Принадлежность.Реквизит.НастройкиПостроителяДляОтбора") Тогда
			
			НастройкиПостроителяДляОтбора = "НастройкиПостроителяДляОтбора";
			
			ПостроительОтчета = Новый ПостроительОтчета;
			ПостроительОтчета.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 ИСТИНА ИЗ " + ПолноеИмяОбъекта + " ГДЕ Ссылка = &СсылкаНаОбъект {ГДЕ Ссылка.*}";
			ПостроительОтчета.Параметры.Вставить("СсылкаНаОбъект", СсылкаНаОбъект);
			
		Иначе
			НастройкиПостроителяДляОтбора = "НЕОПРЕДЕЛЕНО КАК НастройкиПостроителяДляОтбора";
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ НомерСтроки, " + НастройкиПостроителяДляОтбора + " ИЗ " + ПолноеИмяВПФ + ".Принадлежность ГДЕ Ссылка = &ВПФ" + УсловиеПоДокументу + " УПОРЯДОЧИТЬ ПО НомерСтроки";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.НастройкиПостроителяДляОтбора <> Неопределено Тогда
					
					НастройкиПостроителя = Выборка.НастройкиПостроителяДляОтбора.Получить();
					
					Если ТипЗнч(НастройкиПостроителя) = Тип("НастройкиПостроителяОтчета") Тогда
						
						ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя, Истина, Ложь, Ложь, Ложь, Ложь);
						ПостроительОтчета.Выполнить();
						Если ПостроительОтчета.Результат.Пустой() Тогда
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				НомерСтроки = Выборка.НомерСтроки;
				
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Строка(ВПФ.УникальныйИдентификатор()) + "_" + Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	
КонецФункции

Функция ВПФ_ДополнительныеПараметры(ИдентификаторВПФ) Экспорт
	
	ДополнительныеПараметры = ОсновнойМодуль.ПараметрыВПФ(ИдентификаторВПФ).ДополнительныеПараметры;
	
	//Если измененных параметров нет, то пробуем прочитать параметры из базы.
	Если ДополнительныеПараметры = Неопределено Тогда
		
		СсылкаНомерСтроки = ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ);
		
		// Вычитываем параметры из базы, если в базе есть соответствующая строка.
		Если СсылкаНомерСтроки.НомерСтроки > 0 Тогда
			ДополнительныеПараметры = СсылкаНомерСтроки.Ссылка.Принадлежность[СсылкаНомерСтроки.НомерСтроки - 1].ДополнительныеПараметрыОбработки.Получить();
		КонецЕсли;
		
		ОсновнойМодуль.ПараметрыВПФ(ИдентификаторВПФ).ДополнительныеПараметры = ДополнительныеПараметры;
		
	КонецЕсли;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ) Экспорт
	
	ПозицияРазделителя = Найти(ИдентификаторВПФ, "_");
	
	Если ПозицияРазделителя > 0 Тогда
		НомерСтроки = Число(Сред(ИдентификаторВПФ, ПозицияРазделителя + 1));
		GUID = Лев(ИдентификаторВПФ, ПозицияРазделителя - 1);
	Иначе
		НомерСтроки = 0;
		GUID = ИдентификаторВПФ;
	КонецЕсли;
	
	СсылкаНомерСтроки = Новый Структура;
	СсылкаНомерСтроки.Вставить("Ссылка"		, ПолучитьМодульПрог("Модуль_Интеграция").ВнешняяОбработкаПоGUID(GUID));
	СсылкаНомерСтроки.Вставить("НомерСтроки", НомерСтроки);
	
	Возврат СсылкаНомерСтроки;
	
КонецФункции

Функция ВПФ_ВнешняяОбработка(ИдентификаторВПФ)
	
	ВнешняяОбработка = ОсновнойМодуль.ПараметрыВПФ(ИдентификаторВПФ).ВнешняяОбработка;
	Если ВнешняяОбработка <> Неопределено Тогда
		Возврат ВнешняяОбработка;
	КонецЕсли;
	
	СсылкаНомерСтроки = ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ);
	ПолноеИмяВПФ = СсылкаНомерСтроки.Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНомерСтроки.Ссылка);
	
	Разделитель  = "";
	
	Если СсылкаНомерСтроки.НомерСтроки > 0
		И СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".ТабличнаяЧасть.Принадлежность.Реквизит.ХранилищеВнешнейОбработки") Тогда
		
		Запрос.Текст = Запрос.Текст + Разделитель + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 ХранилищеВнешнейОбработки ИЗ " + ПолноеИмяВПФ + ".Принадлежность ГДЕ Ссылка = &Ссылка И НомерСтроки = &НомерСтроки";
		Разделитель = ОсновнойМодуль.РазделительПакетаЗапросов();
		
		Запрос.УстановитьПараметр("НомерСтроки", СсылкаНомерСтроки.НомерСтроки);
		
	КонецЕсли;
	
	Если СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".Реквизит.ХранилищеВнешнейОбработки") Тогда
		
		Запрос.Текст = Запрос.Текст + Разделитель + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 ХранилищеВнешнейОбработки ИЗ " + ПолноеИмяВПФ + " ГДЕ Ссылка = &Ссылка";
		Разделитель = ОсновнойМодуль.РазделительПакетаЗапросов();
		
	КонецЕсли;
	
	Если СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".Реквизит.Хранилище") Тогда
		
		Запрос.Текст = Запрос.Текст + Разделитель + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Хранилище КАК ХранилищеВнешнейОбработки ИЗ " + ПолноеИмяВПФ + " ГДЕ Ссылка = &Ссылка";
		Разделитель = ОсновнойМодуль.РазделительПакетаЗапросов();
		
	КонецЕсли;
	
	// вариант на крайний случай, читаем первую строку табличной части.
	Если СуществуетОбъектМетаданных(ПолноеИмяВПФ + ".ТабличнаяЧасть.Принадлежность.Реквизит.ХранилищеВнешнейОбработки") Тогда
		
		Запрос.Текст = Запрос.Текст + Разделитель + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 ХранилищеВнешнейОбработки ИЗ " + ПолноеИмяВПФ + ".Принадлежность ГДЕ Ссылка = &Ссылка И НомерСтроки = 1";
		Разделитель = ОсновнойМодуль.РазделительПакетаЗапросов();
		
	КонецЕсли;
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	ВГраница = РезультатыЗапросов.ВГраница();
	Для Сч = 0 По ВГраница Цикл
		
		Если НЕ РезультатыЗапросов[Сч].Пустой() Тогда
			
			Выборка = РезультатыЗапросов[Сч].Выбрать();
			Выборка.Следующий();
			
			ДвоичныеДанные = Выборка.ХранилищеВнешнейОбработки.Получить();
			
			Выборка = Неопределено;
			
			Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыЗапросов = Неопределено;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат "Отсутствуют двоичные данные обработки";
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	
	Попытка
		
		ДвоичныеДанные.Записать(ИмяФайла);
		ДвоичныеДанные = Неопределено;
		
		// BSLLS:UsingExternalCodeTools-off
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);
		// BSLLS:UsingExternalCodeTools-on
		
		УдалитьФайлы(ИмяФайла);
		
		ОсновнойМодуль.ПараметрыВПФ(ИдентификаторВПФ).ВнешняяОбработка = ВнешняяОбработка;
		
	Исключение
		ВнешняяОбработка = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ВнешняяОбработка;
	
КонецФункции

//}Внешние печатные формы

// {Обертки

Функция Модуль_Интеграция()
	
	Результат = ПолучитьМодульПрог("Модуль_Интеграция");
	
	Возврат Результат;
	
КонецФункции

// }Обертки

// Устаревшие

//Устарел в релизе 5.30.01. Необходимо использовать метод "ГрузополучательПоДокументу"
Функция ПолучитьГрузополучателяПоДокументу(ДокументСсылка) Экспорт 
	
	Результат = ГрузополучательПоДокументу(ДокументСсылка);
					
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСведенияПрослеживаемости736(Контент) Экспорт
	
	Для Каждого СтрокаТЧ Из Контент.InvoiceCorrectionTable.Items Цикл
		
		Если ОсновнойМодуль.СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ПрослеживаемыйТовар", Ложь) = Истина Тогда
			
			ДанныеПрослеживаемости = ОсновнойМодуль.СвойствоСтруктуры(СтрокаТЧ.СлужебнаяИнформация, "ДанныеПрослеживаемости", Новый Массив);
			
			Если ДанныеПрослеживаемости <> Неопределено Тогда
				
				ЕстьУвеличение = ОсновнойМодуль.ЕстьДельта(СтрокаТЧ.AmountsInc);
				ЕстьУменьшение = ОсновнойМодуль.ЕстьДельта(СтрокаТЧ.AmountsDec);
				
				Для каждого СтрокаДанныхПрослеживаемости Из ДанныеПрослеживаемости Цикл
					
					QuantityDiff = ОсновнойМодуль.Новый_QuantityDiff();
					QuantityDiff.QuantityDec		 = СтрокаДанныхПрослеживаемости.КоличествоУменьшение;
					QuantityDiff.QuantityInc		 = СтрокаДанныхПрослеживаемости.КоличествоУвеличение;
					QuantityDiff.CorrectedQuantity	 = СтрокаДанныхПрослеживаемости.КоличествоПослеИзменения;
					QuantityDiff.OriginalQuantity	 = СтрокаДанныхПрослеживаемости.КоличествоДоИзменения;
					
					Если НЕ ЗначениеЗаполнено(QuantityDiff.QuantityDec) 
						И НЕ ЗначениеЗаполнено(QuantityDiff.QuantityInc) Тогда
						
						Если ЕстьУвеличение Тогда
							QuantityDiff.QuantityInc = 0;
							QuantityDiff.QuantityDec = Неопределено;
						ИначеЕсли ЕстьУменьшение Тогда
							QuantityDiff.QuantityInc = Неопределено;
							QuantityDiff.QuantityDec = 0;
						КонецЕсли;
						
					КонецЕсли;
					
					ItemTracingInfo					 = ОсновнойМодуль.Новый_ItemTracingInfo736();
					ItemTracingInfo.Unit			 = СтрокаДанныхПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости;
					ItemTracingInfo.QuantityDiff	 = QuantityDiff;
					ItemTracingInfo.RegNumberUnit	 = СокрЛП(СтрокаДанныхПрослеживаемости.НомерГТДРегистрационныйНомер);
					
					СтрокаТЧ.ItemTracingInfos.Добавить(ItemTracingInfo);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает структуру свойств строки прослеживаемости для корректировки
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * НомерТовара
//   * ЕдиницаИзмеренияКод
//   * ЕдиницаИзмеренияНаименование
//   * КоличествоТовараДоИзменения
//   * КоличествоТовараПослеИзменения
//   * КоличествоТовараУвеличение
//   * КоличествоТовараУменьшение
//   * КоличествоУчетноеДоИзменения
//   * КоличествоУчетноеПослеИзменения
//
Функция НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НомерГТДРегистрационныйНомер");
	Результат.Вставить("КодЕдиницыИзмеренияПрослеживаемости");
	Результат.Вставить("КоличествоДоИзменения");
	Результат.Вставить("КоличествоПослеИзменения");
	Результат.Вставить("КоличествоУвеличение");
	Результат.Вставить("КоличествоУменьшение");
	
	Возврат Результат;
	
КонецФункции
