#Область ПрограммныйИнтерфейс

// Инициализирует контекст сеанса и запускает модуль Контур.Диадок
//
// Параметры:
//  ДокументУчета - ДокументСсылка, Неопределено - ссылка на документ 1С
//
Процедура Открыть(ДокументУчета = Неопределено) Экспорт
	
	ТекущийКонтекст = КонтурДиадокВызовСервера.КонтекстСеанса();
	
	Если ЗначениеЗаполнено(ТекущийКонтекст) Тогда
		ОткрытьГлавнуюФорму(ТекущийКонтекст, ДокументУчета);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументУчета", ДокументУчета);
	
	ПриНачалеСеанса = Новый ОписаниеОповещения(
		"СлужебныйОбработчик_ПриНачалеСеанса",
		ЭтотОбъект,
		ДополнительныеПараметры
	);
	
	НачатьАвторизацию(ПриНачалеСеанса);
	
КонецПроцедуры

Процедура ОткрытьДокументУчета(ДокументУчета, ОповещениеПослеЗавершения) Экспорт
	
	ИнтерфейсУМ = МодульДиадок();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументУчета", ДокументУчета);
	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", ОповещениеПослеЗавершения);
	ДополнительныеПараметры.Вставить("ИнтерфейсУМ", ИнтерфейсУМ);
	ДополнительныеПараметры.Вставить("КонтекстВосстановлен", Истина);
	ДополнительныеПараметры.Вставить("СопоставлениеВыполнено", Ложь);
	
	ПередЗавершениемРаботыМодуля = Новый ОписаниеОповещения(
		"СлужебныйОбработчик_ПередЗавершениемРаботыМодуля",
		ЭтотОбъект,
		ДополнительныеПараметры
	);
	ДополнительныеПараметры.Вставить("ОповещениеПослеОткрытия", ПередЗавершениемРаботыМодуля);
	
	НачатьОткрытиеДокументаУчета(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОтправитьДокументУчета(ДокументУчета, ОповещениеПослеЗавершения) Экспорт
	
	ИнтерфейсУМ = МодульДиадок();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументУчета", ДокументУчета);
	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", ОповещениеПослеЗавершения);
	ДополнительныеПараметры.Вставить("ИнтерфейсУМ", ИнтерфейсУМ);
	
	ПередЗавершениемРаботыМодуля = Новый ОписаниеОповещения(
		"СлужебныйОбработчик_ПередЗавершениемРаботыМодуля",
		ЭтотОбъект,
		ДополнительныеПараметры
	);
	ДополнительныеПараметры.Вставить("ОповещениеПослеОткрытия", ПередЗавершениемРаботыМодуля);
	
	ПослеПроверкиДокументаУчета = Новый ОписаниеОповещения(
		"СлужебныйОбработчик_ПослеПроверкиДокументаУчета",
		ЭтотОбъект,
		ДополнительныеПараметры
	);
	ДополнительныеПараметры.Вставить("ОповещениеПослеПроверки", ПослеПроверкиДокументаУчета);
	
	НачатьПроверкуДокументаУчета(ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Открывает основную форму модуля с параметрами.
//
// Параметры:
//  КонтекстСеанса - ФиксированноеСоответствие - см. КонтурДиадокСервер.КонтекстСеанса()
//  ДокументУчета - ДокументСсылка, Неопределено - ссылка на документ 1С
//
Процедура ОткрытьГлавнуюФорму(КонтекстСеанса, ДокументУчета)
	
	Уникальность = "diadoc_um/main";
	
	ПриЗакрытииГлавнойФормы = Новый ОписаниеОповещения(
		"СлужебныйОбработчик_ПриЗакрытииГлавнойФормы",
		ЭтотОбъект
	);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтекстСеанса", КонтекстСеанса);
	ПараметрыФормы.Вставить("ИсточникОткрытия", ДокументУчета);
	
	ОткрытьФорму(
		"Обработка.КонтурЭДО.Форма.ФормаУправляемая",
		ПараметрыФормы,
		Неопределено,
		Уникальность,
		Неопределено,
		Неопределено,
		ПриЗакрытииГлавнойФормы
	);
	
КонецПроцедуры

// Начинает инициализацию контекста сеанса
//
// Параметры:
//  ПриНачалеСеанса - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана после
//                                          завершения авторизации со следующими параметрами:
//      # КонтекстСеанса - ФиксированноеСоответствие - см. КонтурДиадокСервер.КонтекстСеанса()
//      # ДополнительныеПараметры - Произвольный - значение, которое было указано при создании описания оповещения
//
Процедура НачатьАвторизацию(ПриНачалеСеанса)
	
	ИнтерфейсУМ = МодульДиадок();
	ИнтерфейсУМ.Сеанс_Начать(ПриНачалеСеанса);
	
КонецПроцедуры

Процедура НачатьАвторизациюДоступногоКонтекста(ПриНачалеСеанса, КонтекстВосстановлен, ИнтерфейсУМ)
	
	Если КонтекстВосстановлен Тогда
		ИнтерфейсУМ.Сеанс_РедактироватьКонтекст(ПриНачалеСеанса);
	Иначе
		ИнтерфейсУМ.Сеанс_Начать(ПриНачалеСеанса);
	КонецЕсли;
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ПриНачалеСеанса(КонтекстСеанса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если КонтекстСеанса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументУчета = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ДополнительныеПараметры.Свойство("ДокументУчета", ДокументУчета);
	КонецЕсли;
	
	КонтурДиадокВызовСервера.КонтекстСеансаУстановить(КонтекстСеанса);
	ОткрытьГлавнуюФорму(КонтекстСеанса, ДокументУчета);
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ПриЗакрытииГлавнойФормы(КонтекстСеанса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если КонтекстСеанса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурДиадокВызовСервера.КонтекстСеансаУстановить(КонтекстСеанса);
	
КонецПроцедуры

Функция ОрганизацияДокументаДоступнаВКонтекстеСеанса(ДокументУчета, ИнтерфейсУМ, ТекущийКонтекст)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ТекущийКонтекст) Тогда
		
		ИдентификаторыОрганизации = ИнтерфейсУМ.ИдентификаторыОрганизацииДокумента(ДокументУчета);
		
		Результат = (ТекущийКонтекст.Получить(ИдентификаторыОрганизации.АдресЯщика) <> Неопределено);
		
		Если НЕ Результат Тогда
			Результат = (ТекущийКонтекст.Получить(ИдентификаторыОрганизации.BoxId) <> Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НачатьПроверкуДокументаУчета(ПараметрыПроверки)
	
	ТекущийКонтекст = КонтурДиадокВызовСервера.КонтекстСеанса();
	
	КонтекстВосстановлен = ЗначениеЗаполнено(ТекущийКонтекст);
	
	Если КонтекстВосстановлен Тогда
		
		ВыполнитьПроверкуДокументаУчета(ТекущийКонтекст, ПараметрыПроверки);
		
	Иначе
		
		ПриНачалеСеанса = Новый ОписаниеОповещения(
			"СлужебныйОбработчик_ВыполнитьПроверкуДокументаУчета",
			ЭтотОбъект,
			ПараметрыПроверки
		);
		
		НачатьАвторизациюДоступногоКонтекста(ПриНачалеСеанса, КонтекстВосстановлен, ПараметрыПроверки.ИнтерфейсУМ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПроверкуДокументаУчета(КонтекстСеанса, ДополнительныеПараметры)
	
	ДокументУчета = ДополнительныеПараметры.ДокументУчета;
	ОповещениеПослеЗавершения = ДополнительныеПараметры.ОповещениеПослеПроверки;
	ИнтерфейсУМ = ДополнительныеПараметры.ИнтерфейсУМ;
	
	ИнтерфейсУМ.КонтекстСеанса_УстановитьКонтекст(КонтекстСеанса);
	ИнтерфейсУМ.СформироватьМетрикуДействияОтправкиИзДокумента1С(ДокументУчета);
	ИнтерфейсУМ.ПроверитьДокументУчета(ДокументУчета, ОповещениеПослеЗавершения);
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ВыполнитьПроверкуДокументаУчета(КонтекстСеанса, ДополнительныеПараметры) Экспорт
	
	КонтекстВосстановлен = ЗначениеЗаполнено(КонтекстСеанса);
	
	Если КонтекстВосстановлен Тогда
		
		КонтурДиадокВызовСервера.КонтекстСеансаУстановить(КонтекстСеанса);
		ВыполнитьПроверкуДокументаУчета(КонтекстСеанса, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОткрытиеДокументаУчета(ПараметрыОткрытия)
	
	ТекущийКонтекст = КонтурДиадокВызовСервера.КонтекстСеанса();
	
	КонтекстДоступен = ОрганизацияДокументаДоступнаВКонтекстеСеанса(
		ПараметрыОткрытия.ДокументУчета,
		ПараметрыОткрытия.ИнтерфейсУМ,
		ТекущийКонтекст
	);
	
	Если КонтекстДоступен Тогда
		
		ВыполнитьОткрытиеДокументаУчета(ТекущийКонтекст, ПараметрыОткрытия);
		
	Иначе
		
		КонтекстВосстановлен = ЗначениеЗаполнено(ТекущийКонтекст);
		ПараметрыОткрытия.КонтекстВосстановлен = КонтекстВосстановлен;
		
		ПриНачалеСеанса = Новый ОписаниеОповещения(
			"СлужебныйОбработчик_ВыполнитьОткрытиеДокументаУчета",
			ЭтотОбъект,
			ПараметрыОткрытия
		);
		
		НачатьАвторизациюДоступногоКонтекста(ПриНачалеСеанса, КонтекстВосстановлен, ПараметрыОткрытия.ИнтерфейсУМ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОткрытиеДокументаУчета(КонтекстСеанса, ДополнительныеПараметры)
	
	ДокументУчета = ДополнительныеПараметры.ДокументУчета;
	ОповещениеПослеЗавершения = ДополнительныеПараметры.ОповещениеПослеОткрытия;
	ИнтерфейсУМ = ДополнительныеПараметры.ИнтерфейсУМ;
	
	Попытка
		
		ИнтерфейсУМ.КонтекстСеанса_УстановитьКонтекст(КонтекстСеанса);
		ИнтерфейсУМ.ПроверитьНаличиеТиповДокументовAPI();
		ИнтерфейсУМ.ОткрытьДокументУчета(ДокументУчета, ОповещениеПослеЗавершения);
		
	Исключение
		
		ИмяСобытия = "Диадок. Ошибка команды документа учета";
		
		ИнформацияОбОшибкеЛок = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибкеЛок);
		
		КонтурДиадокВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ИмяСобытия, ПодробноеПредставлениеОшибки);
		
		КраткаяИнформацияОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибкеЛок);
		
		КонтурДиадокСтдДиалогиКлиент.ПоказатьПредупреждениеЛок(, КраткаяИнформацияОбОшибке);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ВыполнитьОткрытиеДокументаУчета(КонтекстСеанса, ДополнительныеПараметры) Экспорт
	
	ИнтерфейсУМ = ДополнительныеПараметры.ИнтерфейсУМ;
	ДокументУчета = ДополнительныеПараметры.ДокументУчета;
	
	Если ДополнительныеПараметры.Свойство("КонтекстСеанса") Тогда
		КонтекстСеанса = ДополнительныеПараметры.КонтекстСеанса;
	КонецЕсли;
	
	КонтекстДоступен = ОрганизацияДокументаДоступнаВКонтекстеСеанса(ДокументУчета, ИнтерфейсУМ, КонтекстСеанса);
	
	Если КонтекстДоступен Тогда
		
		КонтурДиадокВызовСервера.КонтекстСеансаУстановить(КонтекстСеанса);
		ВыполнитьОткрытиеДокументаУчета(КонтекстСеанса, ДополнительныеПараметры);
		
	Иначе
		
		ПриНачалеСеанса = Новый ОписаниеОповещения(
			"СлужебныйОбработчик_ВыполнитьОткрытиеДокументаУчета",
			ЭтотОбъект,
			ДополнительныеПараметры
		);
		
		Если ДополнительныеПараметры.КонтекстВосстановлен Тогда
			
			Если ДополнительныеПараметры.СопоставлениеВыполнено Тогда
				Возврат;
			КонецЕсли;
			
			ДополнительныеПараметры.Вставить("КонтекстСеанса", КонтекстСеанса);
			ДополнительныеПараметры.СопоставлениеВыполнено = Истина;
			
			ИнтерфейсУМ.ЗапуститьНастройкуОрганизации(ПриНачалеСеанса);
			
		Иначе
			
			ДополнительныеПараметры.КонтекстВосстановлен = Истина;
			
			НачатьАвторизациюДоступногоКонтекста(ПриНачалеСеанса, Истина, ИнтерфейсУМ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ПослеПроверкиДокументаУчета(ПроверкаПройдена, ДополнительныеПараметры) Экспорт
	
	Если ПроверкаПройдена <> Истина Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеОткрытия);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("КонтекстВосстановлен", Истина);
	ДополнительныеПараметры.Вставить("СопоставлениеВыполнено", Ложь);
	
	НачатьОткрытиеДокументаУчета(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ПередЗавершениемРаботыМодуля(РезультатДействия, ДополнительныеПараметры) Экспорт
	
	ИнтерфейсУМ = ДополнительныеПараметры.ИнтерфейсУМ;
	ИнтерфейсУМ.ПриЗавершенииРаботыМодуляОткрытогоИзРасширения();
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения);
	
КонецПроцедуры

// Инициализирует клиентский программный интерфейс модуля
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения.
//
Функция МодульДиадок()
	
	Конфиг = КонфигурационныйФайл();
	
	ПараметрыМодуля = Новый Структура;
	Если Конфиг <> Неопределено Тогда
		ПараметрыМодуля.Вставить("КонфигурационныйФайл", Конфиг);
	КонецЕсли;
	
	Платформа = ПолучитьФорму("Обработка.КонтурЭДО.Форма.Модуль_ПлатформаУправляемая", ПараметрыМодуля);
	
	Возврат Платформа;
	
КонецФункции

// Возвращает конфигурационный файл модуля Диадока, путь
// к которому указан в параметрах запуска приложения
// 
// Возвращаемое значение:
//  ДвоичныеДанные - если файл по указанному пути существует
//  Неопределено - если путь не указан или файл не существует
//
Функция КонфигурационныйФайл()
	
	Результат = Неопределено;
	
	Параметры = КонтурДиадокСтдСтрКлиентСервер.РазобратьСтрокуПараметров(ПараметрЗапуска);
	Путь = Параметры.Получить("diadoc-config");
	
	Если ЗначениеЗаполнено(Путь) Тогда
		
		Файл = Новый Файл(Путь);
		Если Файл.Существует() Тогда
			Результат = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
