// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_ТиповойМодуль;
Перем НеИспользуется_РежимУправляемыхФорм;

Перем Ядро;
Перем ОсновнойМодуль;
Перем ГенерацияXML;
Перем ПечатныеФормы;
Перем РаботаСМаркировкойЛок;

// Структура - содержит поля:
//   * Идентификатор - Строка - идентификатор категории пакета
//   * Представление - Строка - пользовательское представление категории пакета
Перем _ТекущаяКатегорияПакетов;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира

Перем _СоответствиеСтавокНДС; // Кэш соответствия ставок НДС
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормы = Модуль_ПечатныеФормы;
	РаботаСМаркировкойЛок = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормы = Неопределено;
	РаботаСМаркировкойЛок = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ


//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html

	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		Возврат ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);

		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
	
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПриОткрытииФормы" Тогда
		
		Возврат ПриОткрытииФормы(Параметры);

	ИначеЕсли ИмяСобытия = "ПриПолученииДанныхТабличнойЧасти" Тогда
		
		Возврат ПриПолученииДанныхТабличнойЧасти(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd970");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd970",	Неопределено,	"ID_СчетФактура");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd970",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd970",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd970",	"ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd970",	"СЧФДОП",		"ID_УПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"СЧФ",			"ID_УПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"ДОП",			"ID_УПД_ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",						"Счет (неформализованный)", 		"ProformaInvoice", 					"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",		"Счет (Диадок)", 					"ProformaInvoice", 					"xmlproformainvoice");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ВНУТР", "УПД (перемещение)", "UniversalTransferDocumentInternal", "utd970", "ДОП");
	
	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	
	НужнаВТДокументыБезНДС = Ложь;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ВидПакетаID		= ОписаниеВидаПакета.ID;
		КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
		
		Если 		ВидПакетаID = "ID_ОсновнойПакет" 
				ИЛИ ВидПакетаID = "ID_УПД"
				ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Ложь);
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета);
			
		ИначеЕсли 	ВидПакетаID = "ID_УКД" 
				ИЛИ ВидПакетаID = "ID_УКД_раздельно"
				ИЛИ ВидПакетаID = "ID_КСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Ложь);
			
		ИначеЕсли	ВидПакетаID = "ID_УПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Ложь);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД" 
				ИЛИ ВидПакетаID = "ID_ИУПД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУКД" 
				ИЛИ ВидПакетаID = "ID_ИУКД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИКСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_ИСФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" 
				ИЛИ ВидПакетаID = "ID_УПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_ИУПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_УКД_БезНДС" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
			
			НужнаВТДокументыБезНДС = Истина;
			
		ИначеЕсли	ВидПакетаID = "ID_Счет" 
				ИЛИ ВидПакетаID = "ID_СчетФормализованный" Тогда
				
			ИспользуютсяТолькоОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
			
			Если ИспользуютсяТолькоОснованияПоУмолчанию Тогда
		
				Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
				
			Иначе
				
				ТипОснования_СчетНаОплату		= ТипОснованияСчетаНаОплату_СчетНаОплату();
				ТипОснования_ЗаказПокупателя	= ТипОснованияСчетаНаОплату_ЗаказПокупателя();
				ТипОснования_ДокументПродажи	= ТипОснованияСчетаНаОплату_ДокументПродажи();
				
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "СчетНаОплатуПокупателю", ТипОснования_СчетНаОплату);
				
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ЗаказПокупателя", ТипОснования_ЗаказПокупателя);
				
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "КорректировкаРеализации", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "РеализацияТоваровУслуг", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ОтчетКомитентуОПродажах", ТипОснования_ДокументПродажи);
				
				
			КонецЕсли;
			
		ИначеЕсли	ВидПакетаID = "ID_АктСверки" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса_ВременныеТаблицы);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;
	
	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_ДОП");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_ДИС");

	// Исправления первичных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_УПД_ДОП");
		КонецЦикла;	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Корректировочные документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_КСЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_УКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_КСФ");
		
	// Исправления корректировочных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД_КСЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_ИУКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИКСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИКСФ");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
	// Исправления СФ на аванс
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
		
	// Прочие документы
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");		
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СчетФормализованный" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФормализованный");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_ВНУТР" Тогда
		
		Пакет.Направление = "Внутреннее";
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ВНУТР");
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html
	
	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника = Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С = Результат.Документ1С;
	ДокументыОснования = Результат.ДокументыОснования;
	ВидДокументаНаименование = ВидДокументаРазвернутый.Наименование;
	
	ID = ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO = ВидДокументаРазвернутый.ТипКонтента;
	TypeNamedId = ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion = ВидДокументаРазвернутый.FormatVersion;
	FunctionName = ВидДокументаРазвернутый.FunctionName;
	
	Если ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый)
		Или ОсновнойМодуль.ТипСоответствуетКонтентуУКД(ВидДокументаРазвернутый) Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
		ДополнительныеПараметры.Вставить("ПараметрыСогласования", Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника", ДанныеСотрудника); // Графа 10 (РабОргПрод)
		ДополнительныеПараметры.Вставить("ФИОПодписанта", " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД", ФункцияУПД);
		ДополнительныеПараметры.Вставить("FormatVersion", FormatVersion);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_СчетФормализованный" Тогда
		
		ДополнительныеПараметры = Неопределено;
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" ИЛИ ID = "ID_Счет" Тогда
		
		Если ID = "ID_АктСверки" Тогда
			ИмяПечатнойФормы = "АктСверки";
		Иначе
			ИмяПечатнойФормы = "СчетНаОплату";
		КонецЕсли;
		
		ДополнительныеПараметры = Неопределено;
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ИмяПечатнойФормы, ДополнительныеПараметры);
		
		Результат.Метаданные.DocumentNumber = ДанныеПечатнойФормы.Номер;
		Результат.Метаданные.DocumentDate = ДанныеПечатнойФормы.Дата;
		Результат.Метаданные.FileName = ДанныеПечатнойФормы.ИмяФайла;
		
		Если TypeNamedId = "ProformaInvoice" Тогда
			Результат.Метаданные.TotalSum = ДанныеПечатнойФормы.Сумма;
			Результат.Метаданные.TotalVat = ДанныеПечатнойФормы.СуммаНДС;
			Результат.Метаданные.CurrencyCode = ДанныеПечатнойФормы.КодВалюты;
		КонецЕсли;
		
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		// BSLLS:UsingSynchronousCalls-off
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		// BSLLS:UsingSynchronousCalls-on
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры)
	
	ЗаполнитьРеквизитыДокумента(Параметры);
	
	Документ				= Параметры.Документ;
	РеквизитыДокумента		= Документ.Реквизиты;
	ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
	ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
	
	ДанныеПечатнойФормы = СформироватьВнешнююПечатнуюФорму(Документ.ДокументУчета, ВнешняяПечатнаяФорма, ИдентификаторКоманды);
	
	Документ.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	Документ.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
	Документ.Метаданные.DocumentDate	= РеквизитыДокумента.Дата;
	Документ.Метаданные.DocumentNumber	= РеквизитыДокумента.Номер;
	
	Если Документ.Метаданные.Свойство("TotalSum") Тогда
		Документ.Метаданные.TotalSum = РеквизитыДокумента.Сумма;
	КонецЕсли;
	
	Если Документ.Метаданные.Свойство("TotalVat") Тогда
		Документ.Метаданные.TotalVat = РеквизитыДокумента.СуммаНДС;
	КонецЕсли;
	
	ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
	ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
	ХранилищеКонтента.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	СлужебнаяИнформация = Документ.СлужебнаяИнформация;
	СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
	
	// BSLLS:UsingSynchronousCalls-off
	УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
	// BSLLS:UsingSynchronousCalls-on
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html

	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЕстьСуммаДокумента = ДокументУчета.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено;
	
	Если ЕстьСуммаДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаДокумента";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОсновнойМодуль.Общее_ЗначенияРеквизитовОбъекта(ДокументУчета, ИменаРеквизитов);
	
	Реквизиты.Номер	= СокрЛП(ЗначенияРеквизитов.Номер);
	Реквизиты.Дата = ЗначенияРеквизитов.Дата;
	
	Если ЕстьСуммаДокумента Тогда
		Реквизиты.Сумма	= ЗначенияРеквизитов.СуммаДокумента;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html
	
	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента = Документ.Тип;
	ФункцияДокумента = Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента",	Документ.Реквизиты.Номер);
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "КорректировкаПоступления");
		
	ИначеЕсли ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетНаОплату(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетНаОплатуПоставщика");
		
	ИначеЕсли ЭтоФормализованныйАктСверки405(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		НачалоПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.BeginDate);
		ОкончаниеПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.EndDate);
		
		Результат = НайтиАктыСверкиВзаиморасчетов(
			Организация,
			Контрагент,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктСверки405(ТипЭД)
	
	Результат = НРег(ТипЭД.ТипДокумента) = НРег("ReconciliationAct")
				И НРег(ТипЭД.ТипКонтента) = НРег("reconciliationact405");
	
	Возврат Результат;
	
КонецФункции

Функция НайтиАктыСверкиВзаиморасчетов(Организация, Контрагент, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериодаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументАктСверки.Ссылка
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ДокументАктСверки
	|ГДЕ
	|	НЕ ДокументАктСверки.ПометкаУдаления
	|	И ДокументАктСверки.Организация = &Организация
	|	И ДокументАктСверки.Контрагент = &Контрагент
	|	И ДокументАктСверки.ДатаНачала = &ДатаНачала
	|	И ДокументАктСверки.ДатаОкончания = &ДатаОкончания";
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	Ошибки = Новый Массив;
	
	Документ = Параметры.Документ;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	ОтключитьПроверкуСопоставленияНоменклатуры = Параметры.ОтключитьПроверкуСопоставленияНоменклатуры;
	
	ПроверитьФункциюДокумента(Параметры, Ошибки);
	ПроверитьЗаполнитьИдентификаторОперации(Параметры, Ошибки);
	ПроверитьЗаполнитьДокументОснование(Параметры, Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Ошибки = ЗначениеВМассив(Результат.ОписаниеОшибки);
	
	ПроверитьЗаполнениеДокумента(НовыйОбъект, Ошибки, ОтключитьПроверкуСопоставленияНоменклатуры);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ИспользоватьДатуЭД
		И НЕ ЭтоФормализованныйАктСверки405(Документ.Тип) Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаНоменклатурыДляСопоставления = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html

	Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	
	ДокументДД	= Параметры.ДокументДД;
	ПакетДД		= Параметры.ПакетДД;
	
	Ошибки		= Новый Массив;
	Документ1С	= Неопределено;
	
	СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	
	ТипДокумента 	= НРег(СтруктураДанных.ТипДокумента);
	ТипКонтента 	= НРег(СтруктураДанных.ТипКонтента);
	ФункцияДокумента = НРег(СтруктураДанных.ФункцияДокумента);
	
	Контрагент	= СтруктураДанных.Контрагент;
	Организация	= СтруктураДанных.Организация;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда			
		Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
		Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	КонецЕсли;
	
	// Выполним сопоставление документа
	МассивДокументов1С = ОсновнойМодуль.НайтиСопоставлениеДокумента(Параметры.Документ);
	
	Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
		Документ1С = МассивДокументов1С[0];
	КонецЕсли;
	
    // НАКЛАДНЫЕ
	Если ТипДокумента = "xmltorg12" 
		ИЛИ (ТипДокумента = "universaltransferdocument"
		И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
		Иначе			
			ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
		КонецЕсли;		
		
	// СЧЕТА-ФАКТУРЫ
	ИначеЕсли ТипДокумента = "invoice" 
		ИЛИ (ТипДокумента = "universaltransferdocument"
			И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
		КонецЕсли;
		
		ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820" ИЛИ ТипКонтента = ТипКонтентаUtd970());
		
		Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
			Ошибки.Добавить("Счет-фактура в старом формате.");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("ДокументДляСопоставления", Документ1С);
	Результат.Вставить("Ошибки", Ошибки);	
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html

	Пакет			= Параметры.Пакет;	
	ДокументыПакета	= Параметры.ДокументыПакета;
	
	ДокументыПакета.Колонки.Добавить("ДанныеДокумента");
	
	СуммаНакладной 					= Неопределено;
	СуммаСчетаФактуры 				= Неопределено;
	ЕстьНесопоставленныеДокументы 	= Ложь;	
	ЕстьКритичнаяОшибкаПакета 		= Ложь;
	
	Ошибки = Новый Массив;
	
	// 1. Анализ всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ТекДокумент.Ссылка, Пакет);
		ТекДокумент.ДанныеДокумента = ДанныеДокумента;
		
		ДокументДД 		= ТекДокумент.Ссылка;		
		ТипДокумента 	= НРег(ДанныеДокумента.ТипДокумента);
		ФункцияДокумента = НРег(ДанныеДокумента.ФункцияДокумента);
		
		//ошибки, выявленные при выполнении события ПровестиАнализДокумента, распространяем на весь пакет
		Если ЗначениеЗаполнено(ДанныеДокумента.ТекстОшибки) Тогда
			Ошибки.Добавить(ДанныеДокумента.ТекстОшибки);
		КонецЕсли;
		
		Если ТипДокумента = "xmltorg12" 
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
		    СуммаНакладной = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если ТипДокумента = "invoice"
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
			СуммаСчетаФактуры = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
						
		Если (ТипДокумента = "xmltorg12" ИЛИ ТипДокумента = "invoice" ИЛИ ТипДокумента = "universaltransferdocument")
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
			ЕстьНесопоставленныеДокументы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// 2. Интерпретация ошибок
	
	Если СуммаНакладной = Неопределено Тогда
		Ошибки.Добавить("Нет накладной.");
	КонецЕсли;
	
	Если СуммаСчетаФактуры = Неопределено Тогда
		Ошибки.Добавить("Нет счета-фактуры.");
	КонецЕсли;
	
	Если СуммаНакладной <> Неопределено И СуммаСчетаФактуры <> Неопределено И СуммаНакладной <> СуммаСчетаФактуры Тогда
		Ошибки.Добавить("Не совпадают суммы счета-фактуры и первичного документа.");
		//ЕстьКритичнаяОшибкаПакета = Истина; //иногда в СФ могут не включать позиции без НДС, Тогда несовпадение сумм приемлемо
	КонецЕсли;
		
	ТекстВсехОшибокПакета = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
	
	ЕстьКритичнаяОшибкаПакета = (ЕстьКритичнаяОшибкаПакета 
								ИЛИ Найти(ТекстВсехОшибокПакета, "ДУБЛИКАТ") <> 0
								ИЛИ Найти(ТекстВсехОшибокПакета, "Счет-фактура в старом формате") <> 0);
	
	//ОшибокНет = (СокрЛП(ТекстВсехОшибокПакета) = ""); //самый жесткий вариант выполнения анализа пакета
	ОшибокНет = НЕ ЕстьКритичнаяОшибкаПакета;           //менее жесткий вариант выполнения анализа пакета
	
	
	// 3. Формирование контента ответа всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ТекДокумент.ДанныеДокумента;
		
		ДокументДД	= ТекДокумент.Ссылка;		
		Документ1С	= ДанныеДокумента.ДокументВ1С;
		ТекстОшибки	= ДанныеДокумента.ТекстОшибки;
		
		НеИзменятьДействиеВДД = ЗначениеЗаполнено(ДанныеДокумента.ТребуемоеДействиеВДД)
								И ДанныеДокумента.ТребуемоеДействиеВДД <> "Подписать";
		
		Если НеИзменятьДействиеВДД ИЛИ Не ЗначениеЗаполнено(Документ1С) Тогда
			Продолжить;
		КонецЕсли;
						
		РезультатАнализа = ОсновнойМодуль.ЭДО_НовыйРезультатАнализаВходящегоДокумента();
		
		РезультатАнализа.Ошибки = ТекстОшибки; // сохраняем ошибки, относящиеся только к текущему документу
		//РезультатАнализа.Ошибки = ТекстВсехОшибокПакета; // сохраняем ошибки всего пакета для каждого документа из пакета
		
		СписокДействийТекДокумента = ОсновнойМодуль.ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументДД, ОшибокНет);		
		РезультатАнализа.ДействиеВДД = ?(СписокДействийТекДокумента.Количество() = 0, "", СписокДействийТекДокумента[0].Значение);
				
		Если ЗначениеЗаполнено(РезультатАнализа.ДействиеВДД) Тогда						
			РезультатАнализа.Вставить("КонтентОтвета", ПолучитьКонтентОтвета(ДокументДД, Документ1С, РезультатАнализа.ДействиеВДД, ТекстВсехОшибокПакета));			
		КонецЕсли;
		
		РезультатАнализа.Вставить("ДокументДляСопоставления", Документ1С);
		ОсновнойМодуль.СохранитьРезультатАнализа(ДокументДД, РезультатАнализа);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html

	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
		ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
		ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
	
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
	
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратТоваровОтПокупателя",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт ИЛИ ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ", Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеДопРасходов",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионераОПродажах",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаПоступление"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс"));
			
			ОтборСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный"));
			
			ОтборКоррСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетНаОплатуПоставщика", Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		НоменклатураКод = Элемент.Код;
		НоменклатураАртикул = Элемент.Артикул;
		НоменклатураНаименование = Элемент.Наименование;
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			НоменклатураНаименование,
			НоменклатураКод,
			НоменклатураАртикул
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции



///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html

	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И РеализацияТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслуг.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНачала
	|	И ПоступлениеТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПриОткрытииФормы(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pri_Otkrytii_Formy.html
	
	Форма		= Параметры.Форма;
	ИмяФормы	= Параметры.ИмяФормы;
	
	// Пример для снятия флажков у всех видов пакетов на отправку
	
	//Если ИмяФормы = "ОсновнаяФорма" Тогда
	//
	//	ДеревоФильтров = Форма.ДеревоФильтров;
	//	
	//	СтрокаОтправкаПакетов = ДеревоФильтров.Строки.Найти("ОтправкаПакетов");
	//	
	//	Если СтрокаОтправкаПакетов <> Неопределено Тогда
	//		
	//		Для Каждого СтрокаВидыПакетов Из СтрокаОтправкаПакетов.Строки Цикл
	//			СтрокаВидыПакетов.Пометка = Ложь;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриПолученииДанныхТабличнойЧасти(Параметры) Экспорт 
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pri_Poluchenii_Dannykh_Tablichnoy_Chasti.html
	
	Форма			 = Параметры.Форма;
	ИмяФормы		 = Параметры.ИмяФормы;
	Элемент			 = Параметры.Элемент;
	ОформленияСтрок	 = Параметры.ОформленияСтрок;
	
	//Для Каждого Эл Из Параметры.ОформленияСтрок Цикл
	//	
	//	Если Эл.ДанныеСтроки.НомерСтроки % 2 = 0 Тогда
	//		Эл.Ячейки.Документ.ЦветФона	= WebЦвета.Аквамарин;
	//		Эл.ЦветФона					= WebЦвета.Древесный;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_Основная(), "Первичные документы");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД"			, "УПД"					, "ID_УПД, ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ОсновнойПакет"	, "СФ + ТОРГ12/Акт"		, "ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_раздельно"	, "УПД СЧФ + УПД ДОП"	, "ID_УПД_СЧФ, ID_УПД_ДОП");
	
	Пакеты_НачатьКатегорию("КорректировочныйПакет", "Корректировочные документы");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД"			, "УКД"					, "ID_УКД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД_раздельно"	, "УКД КСЧФ + УКД ДИС"	, "ID_УКД_КСЧФ, ID_УКД_ДИС");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_КСФ"			, "КСФ"					, "ID_КСФ");
	
	Пакеты_НачатьКатегорию("СчетФактураНаАванс", "Счет-фактура на аванс");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_СФ_НаАванс"	, "СФ (на аванс)"		, "ID_СчетФактура");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_НаАванс"	, "УПД СЧФ (на аванс)"	, "ID_УПД_СЧФ");
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_СчетаНаОплату(), "Счет на оплату");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_Счет"					, "Счет (неформализованный)", "ID_Счет");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_СчетФормализованный"	, "Счет (Диадок)"			, "ID_СчетФормализованный");
	
	Пакеты_НачатьКатегорию("АктCверки", "Акт сверки");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_АктСверки", "Акт сверки", "ID_АктСверки");
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_БезКатегории(), "");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД"			, "УПД (исправление)"				, "ID_ИУПД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_раздельно", "УПД СЧФ + УПД ДОП (исправление)"	, "ID_ИУПД_СЧФ, ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИСФ"			, "СФ (исправление)"				, "ID_ИСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУКД"			, "УКД (исправление)"				, "ID_ИУКД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУКД_раздельно", "УКД КСЧФ + УКД ДИС (исправление)", "ID_ИУКД_КСЧФ, ID_ИУКД_ДИС");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИКСФ"			, "КСФ (исправление)"				, "ID_ИКСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_НаАванс"	, "УПД (исправление на аванс)"	, "ID_ИУПД_СЧФ");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИСФ_НаАванс"	, "СФ (исправление на аванс)"	, "ID_ИСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ТОРГ12_Акт_БезНДС"	, "ТОРГ12/Акт (без СФ)"			, "ID_АктФормализованный, ID_ТОРГ12");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_БезНДС"		, "УПД ДОП (без СФ)"			, "ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_БезНДС"		, "УПД ДОП (исправление без СФ)", "ID_ИУПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД_БезНДС"		, "УКД ДИС (без СФ)"			, "ID_УКД_ДИС");
	
	Пакеты_НачатьКатегорию("ВнутренниеПеремещения", "Внутренние перемещения");
	Пакет = Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_ВНУТР", "УПД (перемещение)", "ID_УПД_ВНУТР");
	Пакет.ВнутреннийДО = Истина;
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Если ВидПакетаID <> "ID_УПД_ВНУТР" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ПеремещениеТоваров) Тогда
		ИмяВТ = ДобавитьТаблицу_ПеремещениеТоваров(Запрос);
		Результат.Добавить(ИмяВТ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	ТипСсылки = ТипЗнч(Документ1С);
	
	ЭтоСчетФактураВыданный = (ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Если ЭтоСчетФактураВыданный Тогда
		
		ОснованияСФ = ДокументыОснованияСчетаФактуры(Документ1С);
		
		Если ОснованияСФ.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ИсточникДанных = ОснованияСФ[0];
		
	Иначе
		ИсточникДанных = Документ1С;
	КонецЕсли;
	
	МетаданныеИсточникаДанных = ИсточникДанных.Метаданные();
	
	ЕстьРеквизитПодразделение = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Подразделение");
	ЕстьРеквизитОрганизация = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Организация");
	ЕстьРеквизитКонтрагент = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Контрагент");
	ЕстьРеквизитСкладОтправитель = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "СкладОтправитель");
	ЕстьРеквизитСкладПолучатель = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "СкладПолучатель");
	
	ИменаРеквизитов = Новый Массив;
	
	Если ЕстьРеквизитСкладОтправитель Тогда
		ИменаРеквизитов.Добавить("СкладОтправитель");
	КонецЕсли;
	
	Если ЕстьРеквизитСкладПолучатель Тогда
		ИменаРеквизитов.Добавить("СкладПолучатель");
	КонецЕсли;
	
	Если ЕстьРеквизитПодразделение Тогда
		ИменаРеквизитов.Добавить("Подразделение");
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
	
	Разделитель = ",";
	ТребуемыеРеквизиты = Ядро.СоединитьСтроку(ИменаРеквизитов, Разделитель);
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		Реквизиты = Ядро.Общее_ЗначенияРеквизитовОбъекта(ИсточникДанных, ТребуемыеРеквизиты);
	КонецЕсли;
	
	// В коллекции ПоляОтправителя и ПоляПолучателя индекс элементов соответствует приоритету этих элементов.
	// Чем меньше индекс, тем выше приоритет.
	
	Если ЕстьРеквизитСкладОтправитель И ЗначениеЗаполнено(Реквизиты.СкладОтправитель) Тогда
		ПоляОтправителя.Добавить(Реквизиты.СкладОтправитель);
	КонецЕсли;
	
	Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(Реквизиты.Подразделение) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Подразделение);
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Организация);
	КонецЕсли;
	
	Если ЕстьРеквизитСкладПолучатель И ЗначениеЗаполнено(Реквизиты.СкладПолучатель) Тогда
		ПоляПолучателя.Добавить(Реквизиты.СкладПолучатель);
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ПоляПолучателя.Добавить(Реквизиты.Контрагент);
	КонецЕсли;
	
КонецПроцедуры

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка - счет-фактура, основание которой нужно найти;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Ядро.Общее_ВыборкаДанныхОбъекта(СчетФактура, "ДокументыОснования", "ДокументОснование");
			
	Пока Выборка.Следующий() Цикл 
		
		ДокументОснование = Выборка.ДокументОснование;
		
		Если Результат.Найти(ДокументОснование) = Неопределено Тогда
			Результат.Добавить(ДокументОснование);
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат Результат;
	
КонецФункции

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
			
КонецПроцедуры

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Результат = ПредставлениеНомера(Документ);
	
	Возврат Результат;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
	
	СписокОснований.Добавить("СчетНаОплату", "Счет на оплату");
	СписокОснований.Добавить("ЗаказПокупателя", "Заказ покупателя");
	СписокОснований.Добавить("ДокументПродажи", "Документ продажи");
	
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  КоллекцияДокументов - Массив - коллекция документов учета
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если НЕ МетаданныеЭлемента.Реквизиты.Найти("Организация") = Неопределено Тогда
		Реквизиты.Добавить("Организация");	
	КонецЕсли;
	
	Если НЕ МетаданныеЭлемента.Реквизиты.Найти("Контрагент") = Неопределено Тогда
		Реквизиты.Добавить("Контрагент");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	ИменаРеквизитов = СоединитьСтроку(Реквизиты, ","); 
	
	Результат = Общее_ЗначенияРеквизитовОбъектов(КоллекцияДокументов, ИменаРеквизитов);
	
	Возврат Результат;
	
КонецФункции

// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ЕстьТиповаяПечатнаяФорма = Ложь;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С.
// Для получения подчиненных документов используется критерии отбора СвязанныеДокументы.
//
// Параметры:
//  ДокументУчета	 - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(Документ) Экспорт
	
	Результат = Новый Массив;
		
	СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, Документ);
	
	Если ЭтоСчетНаОплату(Документ) Тогда
		
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ЗаказПокупателя");
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Результат.Добавить(ДокументОснование);
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат.Найти(Документ) = Неопределено Тогда
		
		Результат.Добавить(Документ);
		
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции	

// Находит связи с учетным документом, на основании которого формируется электронный счет на оплату.
// Если в аргументе передается счет на оплату, то в результат функции добавляются связи
// второго порядка. Например, документ реализации - это связь первого порядка.
// А счет-фактура на реализацию - это связь второго порядка.
//
// Параметры:
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - учетный документ (счет, заказ, документ продажи),
//                               на основании которого формируется электронный счет на оплату.
// 
// Возвращаемое значение:
//  Массив из ЛюбаяСсылка.
//
Функция СчетаНаОплату_СвязанныеДокументы(ОснованиеЭлектронногоСчета) Экспорт
	
	Если ЭтоСчетНаОплату(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоСчетуНаОплату(ОснованиеЭлектронногоСчета);
		Результат.Добавить(ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоЗаказПокупателя(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоЗаказуПокупателя(ОснованиеЭлектронногоСчета);
		Результат.Добавить(ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоДокументПродажи(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоДокументуПродажи(ОснованиеЭлектронногоСчета);
		Результат.Добавить(ОснованиеЭлектронногоСчета);
		
	Иначе
		
		Результат = Новый Массив;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоСчетуНаОплату(СчетНаОплату)
		
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетНаОплату, "ЗаказПокупателя");
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Результат = СчетаНаОплату_СвязиПоЗаказуПокупателя(ДокументОснование);
		Результат.Добавить(ДокументОснование);
		
	Иначе
		
		Результат = СчетаНаОплату_СвязиПоСчетуНаОплатуБезОснования(СчетНаОплату);
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоСчетуНаОплатуБезОснования(СчетНаОплату)
	
	Результат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка
	|ПОМЕСТИТЬ ВТ_СвязанныеПервичныеДокументы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	НЕ ЗаказПокупателя.ПометкаУдаления
	|	И ЗаказПокупателя.ДокументОснование = &СчетПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ВТ_СвязанныеВторичныеДокументы
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_СвязанныеПервичныеДокументы.Ссылка = РеализацияТоваровУслуг.Сделка
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_СвязанныеПервичныеДокументы.Ссылка = РеализацияТоваровУслугТовары.ЗаказПокупателя
	|ГДЕ
	|	НЕ РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугВозвратнаяТара.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК РеализацияТоваровУслугВозвратнаяТара
	|		ПО ВТ_СвязанныеПервичныеДокументы.Ссылка = РеализацияТоваровУслугВозвратнаяТара.ЗаказПокупателя
	|ГДЕ
	|	НЕ РеализацияТоваровУслугВозвратнаяТара.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ПО ВТ_СвязанныеПервичныеДокументы.Ссылка = РеализацияТоваровУслугУслуги.ЗаказПокупателя
	|ГДЕ
	|	НЕ РеализацияТоваровУслугУслуги.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Сделка = &СчетПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_СвязанныеВторичныеДокументы КАК ВТ_СвязанныеВторичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_СвязанныеВторичныеДокументы.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	ВТ_СвязанныеВторичныеДокументы КАК ВТ_СвязанныеВторичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ВТ_СвязанныеВторичныеДокументы.Ссылка = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданный.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязанныеВторичныеДокументы.Ссылка
	|ИЗ
	|	ВТ_СвязанныеВторичныеДокументы КАК ВТ_СвязанныеВторичныеДокументы
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязанныеПервичныеДокументы.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетПокупателя", СчетНаОплату);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоЗаказуПокупателя(ЗаказПокупателя)
	
	Результат = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РТУТовары.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_СвязанныеПервичныеДокументы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РТУТовары
	|ГДЕ
	|	РТУТовары.ЗаказПокупателя = &ЗаказПокупателя
	|	И НЕ РТУТовары.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РТУВозвратнаяТара.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК РТУВозвратнаяТара
	|ГДЕ
	|	РТУВозвратнаяТара.ЗаказПокупателя = &ЗаказПокупателя
	|	И НЕ РТУВозвратнаяТара.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РТУУслуги.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РТУУслуги
	|ГДЕ
	|	РТУУслуги.ЗаказПокупателя = &ЗаказПокупателя
	|	И НЕ РТУУслуги.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РТУ.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РТУ
	|ГДЕ
	|	РТУ.Сделка = &ЗаказПокупателя
	|	И НЕ РТУ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Документ
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязанныеПервичныеДокументы.Документ
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоДокументуПродажи(ДокументПродажи)
	
	Результат = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Документ
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументПродажи
	|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Процедура СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, Документ)
	
	СвязанныеДокументы = СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ);
	
	Для Каждого СсылкаНаОбъект Из СвязанныеДокументы Цикл
		Если КоллекцияПриемник.Найти(СсылкаНаОбъект) = Неопределено Тогда
			КоллекцияПриемник.Добавить(СсылкаНаОбъект); 
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, СсылкаНаОбъект)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  Документ - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ)
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;	
	
КонецФункции

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
	
	Если НЕ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КоллекцияОснований = ДокументыОснованияСчетаФактуры(ДокументУчета);
	
КонецПроцедуры

Функция ЭтоСчетНаОплату(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗаказПокупателя(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоДокументПродажи(Документ)
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	
	Результат = МассивТипов.Найти(ТипЗнч(Документ)) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что документ является корректировочным документом.
// Корректировочный документ - это КРТУ с видом "Корректировка по согласованию сторон"
// или исправительный КРТУ на основании корректировочного документа.
//
// Параметры:
//  КРТУ - ДокументСсылка.КорректировкаРеализации - ссылка на проверяемый документ
// 
// Возвращаемое значение:
//  Булево - Истина, если это КРТУ на корректировку или исправление корректировки.
//
Функция ЭтоКорректировкаРеализации(КРТУ)
	
	Результат = Ложь;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Т.ВидОперации = &ВидОперацииКорректировка
	|				ИЛИ Т.ИсправляемыйДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", КРТУ);
	Запрос.УстановитьПараметр("ВидОперацииКорректировка", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЭтоКорректировка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет модель данных электронного счета на оплату.
//
// Параметры:
//	Шапка - Контракт шапки неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - Контракт табличной части неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату() 
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанные(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета) Экспорт
	
	Если ЭтоСчетНаОплату(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ШапкаСчетНаОплатуПокупателю(МодельШапка, ОснованиеЭлектронногоСчета);
		СчетаНаОплату_ТабличнаяЧастьСчетНаОплатуПокупателю(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоЗаказПокупателя(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ШапкаЗаказПокупателя(МодельШапка, ОснованиеЭлектронногоСчета);
		СчетаНаОплату_ТабличнаяЧастьЗаказПокупателя(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоДокументПродажи(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ШапкаДокументПродажи(МодельШапка, ОснованиеЭлектронногоСчета);
		СчетаНаОплату_ТабличнаяЧастьДокументПродажи(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа: %1'");
		
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ШапкаСчетНаОплатуПокупателю(МодельШапка, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокументаСчетНаОплатуПокупателю();
	
	ДанныеШапки = Запрос.Выполнить().Выбрать();
	ДанныеШапки.Следующий();
	
	СчетаНаОплату_ЗаполнитьШапкуЭлектронногоСчетаПоУмолчанию(МодельШапка, ДанныеШапки);
	
КонецПроцедуры

Процедура СчетаНаОплату_ТабличнаяЧастьСчетНаОплатуПокупателю(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеТабличнойЧастиСчетНаОплатуПокупателю();
	
	ДанныеТабличнойЧасти = Запрос.Выполнить().Выбрать();
		
	СчетаНаОплату_ЗаполнитьТабличнуюЧастьЭлектронногоСчетаПоУмолчанию(МодельТабличнаяЧасть, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ШапкаЗаказПокупателя(МодельШапка, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокументаЗаказПокупателя();
	
	ДанныеШапки = Запрос.Выполнить().Выбрать();
	ДанныеШапки.Следующий();
	
	СчетаНаОплату_ЗаполнитьШапкуЭлектронногоСчетаПоУмолчанию(МодельШапка, ДанныеШапки);
	
КонецПроцедуры

Процедура СчетаНаОплату_ТабличнаяЧастьЗаказПокупателя(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеТабличнойЧастиЗаказПокупателя();
	
	ДанныеТабличнойЧасти = Запрос.Выполнить().Выбрать();
	
	СчетаНаОплату_ЗаполнитьТабличнуюЧастьЭлектронногоСчетаПоУмолчанию(МодельТабличнаяЧасть, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ШапкаДокументПродажи(МодельШапка, ОснованиеЭлектронногоСчета)
	
	Если ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СчетаНаОплату_ШапкаРеализацияТоваровУслуг(МодельШапка, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		СчетаНаОплату_ШапкаКорректировкаРеализации(МодельШапка, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		СчетаНаОплату_ШапкаОтчетКомитентуОПродажах(МодельШапка, ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа продажи: %1'");
		
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ТабличнаяЧастьДокументПродажи(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Если ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СчетаНаОплату_ТабличнаяЧастьРеализацияТоваровУслуг(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		СчетаНаОплату_ТабличнаяЧастьКорректировкаРеализации(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		СчетаНаОплату_ТабличнаяЧастьОтчетКомитентуОПродажах(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа продажи: %1'");
		
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;

КонецПроцедуры

Процедура СчетаНаОплату_ШапкаРеализацияТоваровУслуг(МодельШапка, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокументаРеализацияТоваровУслуг();
	
	ДанныеШапки = Запрос.Выполнить().Выбрать();
	ДанныеШапки.Следующий();
	
	СчетаНаОплату_ЗаполнитьШапкуЭлектронногоСчетаПоУмолчанию(МодельШапка, ДанныеШапки);
	
КонецПроцедуры

Процедура СчетаНаОплату_ТабличнаяЧастьРеализацияТоваровУслуг(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеТабличнойЧастиРеализацияТоваровУслуг();
	
	ДанныеТабличнойЧасти = Запрос.Выполнить().Выбрать();
	
	СчетаНаОплату_ЗаполнитьТабличнуюЧастьЭлектронногоСчетаПоУмолчанию(МодельТабличнаяЧасть, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ШапкаКорректировкаРеализации(МодельШапка, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокументаКорректировкаРеализации();
	
	ДанныеШапки = Запрос.Выполнить().Выбрать();
	ДанныеШапки.Следующий();
	
	СчетаНаОплату_ЗаполнитьШапкуЭлектронногоСчетаПоУмолчанию(МодельШапка, ДанныеШапки);
	
КонецПроцедуры

Процедура СчетаНаОплату_ТабличнаяЧастьКорректировкаРеализации(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	ИнтерфейсКонфигурации = ОбщийМодульПоИмениЛок("УниверсальныеМеханизмы");
	ИнтерфейсКонфигурации.ОпределитьКурсыДокументаДляПечати(ОснованиеЭлектронногоСчета, Запрос);
	Запрос.Текст = ТекстЗапроса_ДанныеТабличнойЧастиКорректировкаРеализации();
	
	ДанныеТабличнойЧасти = Запрос.Выполнить().Выбрать();
	
	СчетаНаОплату_ЗаполнитьТабличнуюЧастьЭлектронногоСчетаПоУмолчанию(МодельТабличнаяЧасть, ДанныеТабличнойЧасти);

КонецПроцедуры

Процедура СчетаНаОплату_ШапкаОтчетКомитентуОПродажах(МодельШапка, ОснованиеЭлектронногоСчет)
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчет);
	Запрос.Текст = ТекстЗапроса_ДанныеДокументаОтчетКомитентуОПродажах();
	
	ДанныеШапки = Запрос.Выполнить().Выбрать();
	ДанныеШапки.Следующий();
	
	НомерДокумента = ПредставлениеНомера(ДанныеШапки);
	ДатаДокумента = ДанныеШапки.Дата;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.ЦенаВключаетНДС = Истина;
	МодельШапка.ОблагаетсяНДСУПокупателя = Ложь;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = КодВалюты(ДанныеШапки.Валюта);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчет = БанковскийСчет;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ТабличнаяЧастьОтчетКомитентуОПродажах(МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеТабличнойЧастиОтчетКомитентуОПродажах();
	
	ДанныеТабличнойЧасти = Запрос.Выполнить().Выбрать();
	ДанныеТабличнойЧасти.Следующий();
	
	НоваяСтрока = МодельТабличнаяЧасть.Добавить();
	
	НоваяСтрока.НоменклатураПредставление = НСтр("ru='Комиссионное вознаграждение'");
	НоваяСтрока.Сумма = ДанныеТабличнойЧасти.Сумма;
	НоваяСтрока.СуммаНДС = ДанныеТабличнойЧасти.СуммаНДС;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьШапкуЭлектронногоСчетаПоУмолчанию(Модель, ДанныеШапки)
	
	НомерДокумента = ПредставлениеНомера(ДанныеШапки);
	ДатаДокумента = ДанныеШапки.Дата;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	Модель.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Модель.Продавец = ДанныеШапки.Организация;
	Модель.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Модель.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Модель.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Модель.ПродавецКПП = СведенияОбОрганизации.КПП;
	Модель.Покупатель = ДанныеШапки.Контрагент;
	Модель.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Модель.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	Модель.Номер = НомерДокумента;
	Модель.Дата = ДатаДокумента;
	Модель.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Модель.ОблагаетсяНДСУПокупателя = Ложь;
	Модель.Валюта = ДанныеШапки.Валюта;
	Модель.ВалютаКод = КодВалюты(ДанныеШапки.Валюта);
	Модель.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если НЕ ЗначениеЗаполнено(БанковскийСчет)
		ИЛИ ТипЗнч(БанковскийСчет) <> Тип("СправочникСсылка.БанковскиеСчета") Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		Модель.ПродавецБанк = РеквизитыСчета.Банк;
		Модель.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Модель.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Модель.ПродавецБанковскийСчет = БанковскийСчет;
		Модель.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Модель.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьТабличнуюЧастьЭлектронногоСчетаПоУмолчанию(Модель, ДанныеТабличнойЧасти)
	
	МодульЦенообразование = ОбщийМодульПоИмениЛок("Ценообразование");
	
	Пока ДанныеТабличнойЧасти.Следующий() Цикл
		
		НоваяСтрока = Модель.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеТабличнойЧасти);
		
		НоваяСтрока.СуммаСкидки = МодульЦенообразование.ПолучитьСуммуСкидки(ДанныеТабличнойЧасти.Сумма, ДанныеТабличнойЧасти.Скидка);
		
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			ДанныеТабличнойЧасти.НаименованиеПолное,
			ДанныеТабличнойЧасти.Характеристика,
			ДанныеТабличнойЧасти.Содержание
		);
		
		НоваяСтрока.НоменклатураАртикул = АртикулНоменклатуры(ДанныеТабличнойЧасти.Номенклатура);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СчетаНаОплату_ПредставлениеЮрФизЛица(РеквизитыЮрФизЛица)
	
	Результат = РеквизитыЮрФизЛица.ПолноеНаименование;
	
	Если РеквизитыЮрФизЛица.Свойство("Представление") Тогда
		Результат = РеквизитыЮрФизЛица.Представление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(Реквизиты)
	
	ШаблонПредставления = "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны";
	Результат = ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ДанныеЮрФизЛица(Участник, ДатаСведений)
	
	Модель = Новый Структура;
	Модель.Вставить("ПолноеНаименование", "");
	Модель.Вставить("СокращенноеНаименование", "");
	Модель.Вставить("ИНН", "");
	Модель.Вставить("КПП", "");
	Модель.Вставить("Телефоны", "");
	Модель.Вставить("ЮридическийАдрес", "");
	
	МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	
	Данные = МодульУправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Участник, ДатаСведений);
	
	Модель.ПолноеНаименование = Данные.ПолноеНаименование;
	Модель.ИНН = Данные.ИНН;
	Модель.КПП = Данные.КПП;
	Модель.Телефоны = Данные.Телефоны;
	Модель.ЮридическийАдрес = Данные.ЮридическийАдрес;
	
	Если Данные.Свойство("НаименованиеСокращенное") Тогда
		Модель.СокращенноеНаименование = Данные.НаименованиеСокращенное;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Модель.СокращенноеНаименование) Тогда
		Модель.СокращенноеНаименование = Данные.Представление;
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента)
	
	Результат = СтрШаблонЛок(
		"Счет на оплату № %1 от %2",
		НомерДокумента,
		Формат(ДатаДокумента, "ДФ=dd.MM.yyyy")
	);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления = "")
	
	Перем Префикс, СтрокаДополнения;
	
	СоответствиеПараметров = Новый Структура;
	СоответствиеПараметров.Вставить("ПолноеНаименование", " ");
	СоответствиеПараметров.Вставить("НаименованиеСокращенное", " ");
	СоответствиеПараметров.Вставить("Представление", " ");
	СоответствиеПараметров.Вставить("ИНН", " ИНН ");
	СоответствиеПараметров.Вставить("КПП", " КПП ");
	СоответствиеПараметров.Вставить("Свидетельство", " ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи", " от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес", " ");
	СоответствиеПараметров.Вставить("ФактическийАдрес", " ");
	СоответствиеПараметров.Вставить("Телефоны", " тел.: ");
	СоответствиеПараметров.Вставить("Факс", " факс: ");
	СоответствиеПараметров.Вставить("НомерСчета", " р/с ");
	СоответствиеПараметров.Вставить("Банк", " в банке ");
	СоответствиеПараметров.Вставить("БИК", " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет", " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО", " Код по ОКПО ");
	
	Если ПустаяСтрока(ШаблонПредставления) Тогда
		
		Если НЕ Реквизиты.Свойство("Представление")
			ИЛИ НЕ ЗначениеЗаполнено(Реквизиты.Представление) Тогда
			
			ШаблонПредставления = "ПолноеНаименование," + ШаблонПредставления;
			
		Иначе
			
			ШаблонПредставления = "Представление," + ШаблонПредставления;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПропускатьПустыеСтроки = Истина;
	Разделитель = ",";
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("СтроковыеФункцииКлиентСервер");
	СписокПараметров = ИнтерфейсБСП.РазложитьСтрокуВМассивПодстрок(
		ШаблонПредставления,
		Разделитель,
		ПропускатьПустыеСтроки
	);
	
	Результат = Новый Массив;
	
	Для Каждого ИмяПараметра Из СписокПараметров Цикл
		
		Если Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения) Тогда
			
			Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения);
			Если ПустаяСтрока(СтрокаДополнения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СоответствиеПараметров.Свойство(ИмяПараметра, Префикс) Тогда
				Результат.Добавить(Префикс + СтрокаДополнения);
			Иначе
				Результат.Добавить(СтрокаДополнения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаРезультата = СоединитьСтроку(Результат, ",");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "  ", " ");
	
	Возврат СокрЛП(СтрокаРезультата);
	
КонецФункции

Функция КодВалюты(ВалютаСсылка)
	
	ЗначениеРеквизита = ЗначенияРеквизитовОбъектаЛок(
		ВалютаСсылка,
		"Код"
	);
	
	Результат = ЗначениеРеквизита.Код;
	
	Если Результат = Неопределено Тогда
		Результат = "643";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатурыЛок(Номенклатура, Характеристика, Содержание)
	
	НоменклатураНаименование = СокрЛП(Номенклатура);
	ХарактеристикаНаименование = СокрЛП(Характеристика);
	Упаковка = Неопределено;
	Серия = Неопределено;
	
	МодульНоменклатураКлиентСервер = ОбщийМодульПоИмениЛок("НоменклатураКлиентСервер");
	
	ДополнительныеПараметры = МодульНоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
	ДополнительныеПараметры.Содержание = Содержание;
	
	Результат = МодульНоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
		НоменклатураНаименование,
		ХарактеристикаНаименование,
		Упаковка,
		Серия,
		ДополнительныеПараметры
	);
	
	Возврат Результат;
	
КонецФункции

Функция АртикулНоменклатуры(Номенклатура)
	
	ДополнительнаяКолонкаНоменклатуры = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	Если ДополнительнаяКолонкаНоменклатуры = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		
		Результат = Номенклатура.Артикул;
		
	ИначеЕсли ДополнительнаяКолонкаНоменклатуры = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		
		Результат = Номенклатура.Код;
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыБанковскогоСчета(БанковскийСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.Банк.Наименование КАК БанкНаименование,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура АктыСверок_ЗаполнитьДанные(Модель, СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	Если ТипОбъекта <> Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда
		
		Ошибка = СтрШаблонЛок(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ДатаНачала КАК НачалоПериода,
	|	ДанныеДокумента.ДатаОкончания КАК КонецПериода,
	|	ДанныеДокумента.ДоговорКонтрагента КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ДоговорКонтрагента) КАК ДоговорПредставление,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.ВалютаДокумента.Наименование КАК ВалютаПредставление,
	|	ДанныеДокумента.ОстатокНаНачало КАК ОстатокНаНачало,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.Наименование КАК ОрганизацияНаименование,
	|	ДанныеДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ДанныеДокумента.ПредставительОрганизации КАК ПредставительОрганизации,
	|	ЕСТЬNULL(ДанныеДокумента.ПредставительОрганизации.Наименование, """") КАК ПредставительОрганизацииФИО,
	|	ДанныеДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ЕСТЬNULL(ДанныеДокумента.ПредставительКонтрагента.Наименование, """") КАК ПредставительКонтрагентаФИО,
	|	ЕСТЬNULL(ДанныеДокумента.ПредставительКонтрагента.Должность, """") КАК ПредставительКонтрагентаДолжность,
	|	ДанныеДокумента.СверкаСогласована КАК СверкаСогласована
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОрганизации.НомерСтроки КАК НомерСтроки,
	|	ДанныеОрганизации.ДоговорКонтрагента КАК Аналитика,
	|	ДанныеОрганизации.Представление КАК ДокументПредставление,
	|	ДанныеОрганизации.Дата КАК Дата,
	|	ДанныеОрганизации.Дебет КАК Дебет,
	|	ДанныеОрганизации.Кредит КАК Кредит,
	|	ИСТИНА КАК ЭтоДанныеОрганизации
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ДанныеОрганизации
	|ГДЕ
	|	ДанныеОрганизации.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеКонтрагента.НомерСтроки,
	|	ДанныеКонтрагента.ДоговорКонтрагента,
	|	ДанныеКонтрагента.Представление,
	|	ДанныеКонтрагента.Дата,
	|	ДанныеКонтрагента.Дебет,
	|	ДанныеКонтрагента.Кредит,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ДанныеКонтрагента
	|ГДЕ
	|	ДанныеКонтрагента.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоДанныеОрганизации,
	|	НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДатаСверки", СсылкаНаОбъект.Дата);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		
		Модель.Шапка.Дата = ВыборкаШапка.Дата;
		Модель.Шапка.НачалоПериода = ВыборкаШапка.НачалоПериода;
		Модель.Шапка.КонецПериода = ВыборкаШапка.КонецПериода;
		Модель.Шапка.ГруппироватьПоАналитике = Ложь;
		Модель.Шапка.СверкаСогласована = ВыборкаШапка.СверкаСогласована;
		
		Модель.Шапка.СверкаПоДоговору = ЗначениеЗаполнено(ВыборкаШапка.Договор);
		Модель.Шапка.ДоговорПредставление = СокрЛП(ВыборкаШапка.ДоговорПредставление);
		
		Модель.Шапка.ВалютаКод = СокрЛП(ВыборкаШапка.ВалютаКод);
		Модель.Шапка.ВалютаПредставление = СокрЛП(ВыборкаШапка.ВалютаПредставление);
		Модель.Шапка.ОстатокНаНачало = ВыборкаШапка.ОстатокНаНачало;
		
		Модель.Шапка.ОрганизацияПредставление = СокрЛП(ВыборкаШапка.ОрганизацияНаименованиеПолное);
		Если ПустаяСтрока(ВыборкаШапка.ОрганизацияНаименованиеПолное) Тогда
			Модель.Шапка.ОрганизацияПредставление = СокрЛП(ВыборкаШапка.ОрганизацияНаименование);
		КонецЕсли;
		
		Модель.Шапка.ПредставительОрганизацииФИО = СокрЛП(ВыборкаШапка.ПредставительОрганизацииФИО);
		Модель.Шапка.ПредставительОрганизацииДолжность = ДолжностьОтветственногоЛицаОрганизации(
			ВыборкаШапка.ПредставительОрганизации,
			ВыборкаШапка.Организация,
			ВыборкаШапка.Дата
		);
		
		Модель.Шапка.КонтрагентПредставление = СокрЛП(ВыборкаШапка.КонтрагентНаименованиеПолное);
		Если ПустаяСтрока(ВыборкаШапка.КонтрагентНаименованиеПолное) Тогда
			Модель.Шапка.КонтрагентПредставление = СокрЛП(ВыборкаШапка.КонтрагентНаименование);
		КонецЕсли;
		
		Модель.Шапка.ПредставительКонтрагентаФИО = СокрЛП(ВыборкаШапка.ПредставительКонтрагентаФИО);
		Модель.Шапка.ПредставительКонтрагентаДолжность = СокрЛП(ВыборкаШапка.ПредставительКонтрагентаДолжность);
		
	КонецЕсли;
	
	ВыборкаТЧ = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Если ВыборкаТЧ.ЭтоДанныеОрганизации Тогда
			Запись = Модель.ДанныеОрганизации.Добавить();
		Иначе
			Запись = Модель.ДанныеКонтрагента.Добавить();
		КонецЕсли;
		
		Запись.Аналитика = ВыборкаТЧ.Аналитика;
		Запись.ДокументПредставление = СокрЛП(ВыборкаТЧ.ДокументПредставление);
		Запись.Дата = ВыборкаТЧ.Дата;
		Запись.Дебет = ВыборкаТЧ.Дебет;
		Запись.Кредит = ВыборкаТЧ.Кредит;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДолжностьОтветственногоЛицаОрганизации(ФизическоеЛицо, Организация, НаДату = '00010101')
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОтветственныеЛица.Период КАК Период,
	|	ОтветственныеЛица.Должность КАК Должность,
	|	ПРЕДСТАВЛЕНИЕ(ОтветственныеЛица.Должность) КАК ДолжностьПредставление
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
	|			&Дата,
	|			СтруктурнаяЕдиница = &Организация
	|				И ФизическоеЛицо = &ФизическоеЛицо) КАК ОтветственныеЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", НаДату);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = "";
	Если Выборка.Следующий() Тогда
		Результат = СокрЛП(Выборка.ДолжностьПредставление);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  ПеречислениеСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	СтавкиНДСДиадок = Новый Соответствие;
	СтавкиНДСДиадок.Вставить("0", Перечисления.СтавкиНДС.НДС0);
	СтавкиНДСДиадок.Вставить("10", Перечисления.СтавкиНДС.НДС10);
	СтавкиНДСДиадок.Вставить("18", Перечисления.СтавкиНДС.НДС18);
	СтавкиНДСДиадок.Вставить("20", Перечисления.СтавкиНДС.НДС20);
	СтавкиНДСДиадок.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
	СтавкиНДСДиадок.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
	СтавкиНДСДиадок.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
	СтавкиНДСДиадок.Вставить(ПредставлениеСтавкиБезНДС(), Перечисления.СтавкиНДС.БезНДС);
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		СтавкиНДСДиадок.Вставить("5", Перечисления.СтавкиНДС.НДС5);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		СтавкиНДСДиадок.Вставить("7", Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		СтавкиНДСДиадок.Вставить("22", Перечисления.СтавкиНДС.НДС22);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		СтавкиНДСДиадок.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		СтавкиНДСДиадок.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		СтавкиНДСДиадок.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
	КонецЕсли;
	
	Результат = СтавкиНДСДиадок.Получить(ПредставлениеСтавки);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - ПеречислениеСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Если НЕ ЗначениеЗаполнено(_СоответствиеСтавокНДС) Тогда
			_СоответствиеСтавокНДС = _ПеречислениеСтавокНДС();
		КонецЕсли;
		
		Результат = _СоответствиеСтавокНДС.Получить(ЗначениеСтавки);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = "##";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция _ПеречислениеСтавокНДС()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Перечисления.СтавкиНДС.НДС0, "0");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10, "10");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18, "18");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20, "20");
	Результат.Вставить(Перечисления.СтавкиНДС.БезНДС, "без НДС");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетЗначениеПеречисленияСтавкиНДС(ИмяЗначенияСтавкаНДС)
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	Результат = (ЗначенияПеречисления.Найти(ИмяЗначенияСтавкаНДС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	ДокументыКонфигурации = Метаданные.Документы;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументыКонфигурации.КорректировкаРеализации);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомитентуОПродажах);
	Результат.Добавить(ДокументыКонфигурации.ВозвратТоваровПоставщику);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомиссионераОПродажах);
	Результат.Добавить(ДокументыКонфигурации.РеализацияТоваровУслуг);
	Результат.Добавить(ДокументыКонфигурации.СчетФактураВыданный);
	Результат.Добавить(ДокументыКонфигурации.СчетНаОплатуПокупателю);
	Результат.Добавить(ДокументыКонфигурации.АктСверкиВзаиморасчетов);

	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ

//*****************************************************************************
//{ СБОР КОНТЕНТА УПД970

//{ УПД970. Программный интерфейс

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка		 - ДокументСсылка - ссылка на учетный документ 1С,
//										по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры	 - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаПродавца(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры) Экспорт
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Если ЭтоСчетФактураНаАванс(ДокСсылка) Тогда
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданныйНаАванс(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
		Иначе
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданный(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуРеализацияТоваровУслуг(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализации(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомитентуОПродажах(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуВозвратТоваровПоставщику(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуВозвратТоваровПоставщикуИзНТТ(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаНаПеремещениеТоваров(
			ДокСсылка,
			ДополнительныеПараметры);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ДокСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//} УПД970. Программный интерфейс

//{ УПД970. Заполнение протоструктуры по документам

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданный(
	СчетФактура,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(СчетФактура);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	ДокументыОснования = ДанныеПоДокументу.ДокументыОснования;
	СведенияОДокументахОплаты = ДанныеПоДокументу.СведенияОДокументахОплаты;
	
	ДокументОснование = ДокументыОснования[0];
	
	ДанныеПоДокументуОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(
		ДокументОснование,
		СчетФактура);
	
	ДанныеШапкиОснования = ДанныеПоДокументуОснования.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;

	Если ДанныеШапки.Исправление Тогда
		УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки);
	Иначе
		УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
	КонецЕсли;
		
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		СведенияОДокументахОплаты);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыОснования);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент, ОснованияПередачиТоваров, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапкиОснования);
	
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапкиОснования);
	Если ЗначениеЗаполнено(ДанныеШапки.КППКонтрагента) Тогда
		Контент.Buyers[0].Kpp = ДанныеШапки.КППКонтрагента;
	КонецЕсли;
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);

	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументуОснования,
		ДополнительныеПараметры);
		
	Для Индекс = 1 По ДокументыОснования.ВГраница() Цикл
		
		ДокументОснование = ДокументыОснования[Индекс];
		
		ДанныеПоДокументуОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(
			ДокументОснование,
			СчетФактура);
	
		УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
			Контент,
			ДанныеПоДокументуОснования,
			ДополнительныеПараметры);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОснования, ФункцияДокумента);

	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, СчетФактура);

	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданныйНаАванс(
		ДокСсылка,
		ФункцияДокумента,
		ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		ДанныеПоДокументу.СведенияОДокументахОплаты);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
		
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуРеализацияТоваровУслуг(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаРеализацияТоваровУслуг(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);

	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	ДокументыПередачиТоваров = Новый Массив;
	ДокументыПередачиТоваров.Добавить(ДокСсылка);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыПередачиТоваров);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент,
		ОснованияПередачиТоваров,
		ДополнительныеПараметры);
		
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры);
		
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализации(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);

	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	ДокументыПередачиТоваров = Новый Массив;
	ДокументыПередачиТоваров.Добавить(ДокСсылка);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыПередачиТоваров);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент,
		ОснованияПередачиТоваров,
		ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры);
		
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомитентуОПродажах(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаОтчетКомитентуОПродажах(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);

	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	ДокументыПередачиТоваров = Новый Массив;
	ДокументыПередачиТоваров.Добавить(ДокСсылка);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыПередачиТоваров);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент,
		ОснованияПередачиТоваров,
		ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры);
		
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуВозвратТоваровПоставщику(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаВозвратТоваровПоставщику(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);

	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	ДокументыПередачиТоваров = Новый Массив;
	ДокументыПередачиТоваров.Добавить(ДокСсылка);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыПередачиТоваров);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент,
		ОснованияПередачиТоваров,
		ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры);
		
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуВозвратТоваровПоставщикуИзНТТ(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаВозвратТоваровПоставщикуИзНТТ(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент = Контракт_ПротоструктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);

	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки);
	
	ДокументыПередачиТоваров = Новый Массив;
	ДокументыПередачиТоваров.Добавить(ДокСсылка);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыПередачиТоваров);
		
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(Контент,
		ОснованияПередачиТоваров,
		ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры);
		
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаНаПеремещениеТоваров(СсылкаНаОбъект, ДополнительныеПараметры)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Организация.НаименованиеПолное КАК ОрганизацияПредставление,
	|	Шапка.Организация.ИНН КАК ОрганизацияИНН,
	|	Шапка.Организация.КПП КАК ОрганизацияКПП,
	|	Шапка.СкладОтправитель КАК СкладОтправитель,
	|	Шапка.СкладОтправитель.Наименование КАК СкладОтправительПредставление,
	|	Шапка.СкладПолучатель КАК СкладПолучатель,
	|	Шапка.СкладПолучатель.Наименование КАК СкладПолучательПредставление,
	|	Шапка.Подразделение КАК Подразделение,
	|	Шапка.Подразделение.Наименование КАК ПодразделениеПредставление
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Номенклатура.Код КАК НоменклатураКод,
	|	ТЧ.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ТЧ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	&СтавкаБезНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД, &ПустойНомерГТД) КАК НомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД.Код, """") КАК ПолныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД.РегистрационныйНомер, """") КАК РегистрационныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения, &ПустаяСтранаПроисхождения) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.Наименование, """") КАК СтранаПроисхожденияНаименование,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТЧ.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ЕСТЬNULL(ТЧ.ХарактеристикаНоменклатуры.Наименование, """") КАК ХарактеристикаПредставление,
	|	ТЧ.СерияНоменклатуры КАК Серия,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.Наименование, """") КАК СерияПредставление,
	|	ТЧ.ЕдиницаИзмерения КАК Упаковка,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору, &ПустаяЕдиница) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена * ТЧ.Количество КАК Сумма,
	|	1 КАК Порядок
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Ссылка,
	|	ТЧ.НомерСтроки,
	|	ТЧ.Номенклатура,
	|	ТЧ.Номенклатура.Код,
	|	ТЧ.Номенклатура.Артикул,
	|	ТЧ.Номенклатура.НаименованиеПолное,
	|	&СтавкаБезНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения, &ПустаяЕдиница),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код, """"""""),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование, """"""""),
	|	0,
	|	ТЧ.Количество,
	|	0,
	|	2
	|ИЗ
	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Ссылка,
	|	НомерСтроки";
	
	СтранаПроисхожденияУчастникЕАЭС = "ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ)";
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда // 10.3.69 и ниже
		СтранаПроисхожденияУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтранаПроисхожденияУчастникЕАЭС", СтранаПроисхожденияУчастникЕАЭС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПустаяЕдиница", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойНомерГТД", Справочники.НомераГТД.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСтранаПроисхождения", Справочники.КлассификаторСтранМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтавкаБезНДС", Перечисления.СтавкиНДС.БезНДС);
	
	Данные = Запрос.ВыполнитьПакет();
	
	Шапка = Данные[0].Выбрать();
	Шапка.Следующий();
	
	Валюта = ВалютаРегламентированногоУчета();
	ФункцияДокумента = ФункцияДокументаУПД_ДОП();
	ДокументыОтгрузки = ЗначениеВМассив(СсылкаНаОбъект);
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Контент = Контракт_ПротоструктураУПД970();
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = "00051";
	Контент.DocumentNumber = ПредставлениеНомера(СсылкаНаОбъект);
	Контент.DocumentDate = Шапка.Дата;
	Контент.DocumentName = НаименованияДокументов.УПД;
	Контент.Currency = Валюта.Код;
	
	DocumentShipment = УПД970_НовыйDocumentShipments970(
		Контент.DocumentName,
		Контент.DocumentNumber,
		Контент.DocumentDate
	);
	
	Контент.DocumentShipments.Добавить(DocumentShipment);
	
	ПродавецИнфо = УПД970_ДанныеУчастникаЭДО(Шапка.Организация, Шапка.Дата);
	Seller = Контракт_ExtendedOrganizationInfo970();
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, ПродавецИнфо);
	Контент.Sellers.Добавить(Seller);
	
	ПокупательИнфо = ОбщегоНазначения.СкопироватьРекурсивно(ПродавецИнфо);
	Buyer = Контракт_ExtendedOrganizationInfo970();
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, ПокупательИнфо);
	Контент.Buyers.Добавить(Buyer);
	
	ГрузоотправительИнфо = ОбщегоНазначения.СкопироватьРекурсивно(ПродавецИнфо);
	ГрузоотправительИнфо.Адрес = УПД970_АдресСклада(Шапка.СкладОтправитель);
	Shipper = Контракт_Shipper970();
	Shipper.SameAsSeller = Ложь;
	Shipper.OrganizationInfo = Контракт_ExtendedOrganizationInfo970();
	УПД970_ЗаполнитьExtendedOrganizationInfo(Shipper.OrganizationInfo, ГрузоотправительИнфо);
	Shipper.OrganizationInfo.Department = Шапка.СкладОтправительПредставление;
	Контент.Shippers.Добавить(Shipper);
	
	ГрузополучательИнфо = ОбщегоНазначения.СкопироватьРекурсивно(ПродавецИнфо);
	ГрузополучательИнфо.Адрес = УПД970_АдресСклада(Шапка.СкладПолучатель);
	Consignee = Контракт_ExtendedOrganizationInfo970();
	УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, ГрузополучательИнфо);
	Consignee.Department = Шапка.СкладПолучательПредставление;
	Контент.Consignees.Добавить(Consignee);
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;
	РезультатТовары = Данные[1].Выгрузить();
	
	ТочностьКоличества = 3;
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	ВсеСтрокиБезНДС = Истина;
	
	Для Каждого ДанныеТЧ Из РезультатТовары Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = ПредставлениеНоменклатурыЛок(ДанныеТЧ.НоменклатураПредставление, ДанныеТЧ.ХарактеристикаПредставление, "");
		Item.ItemMark = ТипыНоменклатуры.Имущество;
		
		Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			Item.ItemVendorCode = ДанныеТЧ.НоменклатураАртикул;
		ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
			Item.ItemVendorCode = ДанныеТЧ.НоменклатураКод;
		Иначе
			Item.ItemVendorCode = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТЧ.ЕдиницаИзмеренияНаименование) Тогда
			Item.UnitName = СокрЛП(ДанныеТЧ.ЕдиницаИзмеренияНаименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТЧ.ЕдиницаИзмеренияКод) Тогда
			Item.Unit = СокрЛП(ДанныеТЧ.ЕдиницаИзмеренияКод);
		КонецЕсли;
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(ДанныеТЧ.Количество) Тогда
			Item.Quantity = Окр(ДанныеТЧ.Количество, ТочностьКоличества);
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиНДС(ДанныеТЧ.СтавкаНДС);
		Item.WithoutVat = XMLСтрока(ДанныеТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС);
		Если ДанныеТЧ.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, ДанныеТЧ);
		
		Item.Price = ДанныеТЧ.Цена;
		Item.Vat = 0;
		Item.Subtotal = ДанныеТЧ.Сумма;
		Item.SubtotalWithVatExcluded = Item.Subtotal - Item.Vat;
		
		СлужебнаяИнфо = Контракт_СлужебнаяИнформацияСтроки();
		СлужебнаяИнфо.ЕдиницаИзмерения = ДанныеТЧ.ЕдиницаИзмерения;
		СлужебнаяИнфо.Номенклатура = ДанныеТЧ.Номенклатура;
		СлужебнаяИнфо.СтранаПроисхождения = ДанныеТЧ.СтранаПроисхождения;
		СлужебнаяИнфо.СтавкаНДС = ДанныеТЧ.СтавкаНДС;
		СлужебнаяИнфо.НомерГТД = ДанныеТЧ.НомерГТД;
		СлужебнаяИнфо.ПрослеживаемыйТовар = Ложь;
		СлужебнаяИнфо.Серия = ДанныеТЧ.Серия;
		СлужебнаяИнфо.Характеристика = ДанныеТЧ.Характеристика;
		СлужебнаяИнфо.ДокументОтгрузки = СсылкаНаОбъект;
		
		Item.СлужебнаяИнформация = СлужебнаяИнфо;
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.TotalNet = РезультатТовары.Итог("Количество");
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	Table.Vat = 0;
	Table.Total = РезультатТовары.Итог("Сумма");
	Table.TotalWithVatExcluded = Table.Total - Table.Vat;
	
	TransferInfo = Контракт_TransferInfo970();
	TransferInfo.WithoutTransferBase = Истина;
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	Контент.TransferInfo = TransferInfo;
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьДатуОтгрузки(Контент);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаОбъект);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	Возврат Контент;
	
КонецФункции

//{ УПД970. Заполнение протоструктуры по документам. Общее

Процедура УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки)

	Контент.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Ссылка);
	Контент.DocumentDate = ДанныеШапки.Дата;

КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки)

	Контент.RevisionNumber = ДанныеШапки.НомерИсправления;
	Контент.RevisionDate = ДанныеШапки.Дата;
	
	Контент.DocumentNumber = УПД970_НомерИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки);
	Контент.DocumentDate = УПД970_ДатаИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки);

КонецПроцедуры

Процедура УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки)
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	
	Контент.Currency = Валюта.Код;

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, КоллекцияДокументов, ФункцияДокумента)
	
	ДокументыОтгрузки = УПД970_ДокументыОтгрузки(КоллекцияДокументов);
	
	СтрокиТаблицы = Контент.Table.Items;
	
	НаименованиеДокумента = УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		РеквизитыДокументовОтгрузки = Общее_ЗначенияРеквизитовОбъектов(ДокументыОтгрузки, "Дата");
		
		Для Каждого КлючЗначение Из РеквизитыДокументовОтгрузки Цикл
			
			ДокументОтгрузки = КлючЗначение.Ключ;
			РеквизитыДокумента = КлючЗначение.Значение;
			
			НомерДокумента = ПредставлениеНомера(ДокументОтгрузки);
			ДатаДокумента = РеквизитыДокумента.Дата;
			
			DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
			Контент.DocumentShipments.Добавить(DocumentShipment);
		
		КонецЦикла;
		
	Иначе
		
		НомерДокумента = Контент.DocumentNumber;
		ДатаДокумента = Контент.DocumentDate;
		
		DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
		Контент.DocumentShipments.Добавить(DocumentShipment);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, СведенияОДокументахОплаты)
	
	Для Каждого СтрокаТаблицы Из СведенияОДокументахОплаты Цикл
		
		PaymentDocument = Контракт_PaymentDocumentInfo();
		
		PaymentDocument.Number = СтрокаТаблицы.НомерДокумента;
		PaymentDocument.Date = СтрокаТаблицы.ДатаДокумента;
		
		Контент.PaymentDocuments.Добавить(PaymentDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
	Контент,
	ОснованияПередачиТоваров,
	ДополнительныеПараметры)
	
	Перем УказыватьОтсутствиеОснованияУПД;
	
	TransferInfo = Контракт_TransferInfo970();
	Контент.TransferInfo = TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	ДополнительныеПараметры.Свойство("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
	
	Для Каждого РеквизитыОснования Из ОснованияПередачиТоваров Цикл
		
		РеквизитыЗаполнены = УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования);
		
		Если Не РеквизитыЗаполнены
			И УказыватьОтсутствиеОснованияУПД = Истина Тогда
			
			TransferInfo.TransferBases.Очистить();
			Прервать;
			
		Иначе
			
			TransferBase = УПД970_НовыйTransferBase(РеквизитыОснования);
			TransferInfo.TransferBases.Добавить(TransferBase);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если TransferInfo.TransferBases.Количество() = 0 Тогда
		TransferInfo.WithoutTransferBase = Истина;
	КонецЕсли;

	УПД970_ЗаполнитьДатуОтгрузки(Контент);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуОтгрузки(Контент)

	Если Контент.Function <> ФункцияДокументаУПД_СЧФ() Тогда
		
		ДатаОтгрузки = Контент.DocumentDate;
		
		Для Каждого DocumentShipment Из Контент.DocumentShipments Цикл
			ДатаОтгрузки = DocumentShipment.Date;
			Прервать;
		КонецЦикла;
		
		Контент.TransferInfo.TransferDate = ДатаОтгрузки;
		
	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента)
	
	Если ФункцияДокумента <> ФункцияДокументаУПД_СЧФ()
		И Контент.DocumentShipments.Количество() > 0 Тогда
		Контент.DocumentName = Контент.DocumentShipments[0].Name;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеШапки)
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОбУчастникахЭДО.Организация);
	Seller.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОбУчастникахЭДО.Контрагент);
	Buyer.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Контрагент.Ссылка;
	
	Грузоотправитель = СведенияОбУчастникахЭДО.Грузоотправитель;
	Если Грузоотправитель <> Неопределено Тогда
		
		Shipper = Контракт_Shipper970();
		Shipper.SameAsSeller = Ложь;
		
		Контент.Shippers.Добавить(Shipper);
		
		Если Грузоотправитель.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка Тогда
			
			Shipper.SameAsSeller = Истина;
			
		Иначе
			
			ShipperInfo = Контракт_ExtendedOrganizationInfo970();
			Shipper.OrganizationInfo = ShipperInfo;
			
			УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, Грузоотправитель);
			
			ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СведенияОбУчастникахЭДО.Грузополучатель <> Неопределено Тогда
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		Контент.Consignees.Добавить(Consignee);

		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, СведенияОбУчастникахЭДО.Грузополучатель);
		
		Consignee.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Грузополучатель.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьExtendedOrganizationInfo(Content, ДанныеУчастникаЭДО)
	
	Content.Type = УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО);
	
	Content.Name = ДанныеУчастникаЭДО.Наименование;
	
	Content.Inn = ДанныеУчастникаЭДО.ИНН;
	Content.Kpp = ДанныеУчастникаЭДО.КПП;
	Content.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	Content.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
	
	Content.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРНИП;
	Content.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаОГРНИП;
	
	Content.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	
	Content.Country = ДанныеУчастникаЭДО.СтранаНаименование;
	Content.CountryCode = ДанныеУчастникаЭДО.СтранаКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		Content.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.ЭлектроннаяПочта) Тогда
		Content.Email.Добавить(ДанныеУчастникаЭДО.ЭлектроннаяПочта);
	КонецЕсли;
	
	Content.BankName = ДанныеУчастникаЭДО.НаименованиеБанка;
	Content.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	Content.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	Content.BankId = ДанныеУчастникаЭДО.БИК;
	
	УПД970_ЗаполнитьAddressInfo(Content, ДанныеУчастникаЭДО.Адрес);
	
	Content.СлужебнаяИнформация.Ссылка = ДанныеУчастникаЭДО.Ссылка;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьAddressInfo(OrganizationInfo, СведенияОбАдресе)
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат;
	КонецЕсли;
	
	AddressInfo = Контракт_AddressInfo970();
	OrganizationInfo.Address = AddressInfo;
	
	ВидыАдресов = ГенерацияXML.Перечисление_ВидыАдресов();
	
	ЭтоАдресВФорматеРФ = ЭтоАдресВФорматеАдрРФ(СведенияОбАдресе);
	
	Если ЭтоАдресВФорматеРФ Тогда
		
		AddressRF = УПД970_ЗаполненныйAddressRF(СведенияОбАдресе);
		
		AddressInfo.AddressRF = AddressRF;
		AddressInfo.Type = ВидыАдресов.АдресРФ;
		
	Иначе
		
		AddressText = УПД970_ЗаполненныйAddressText(СведенияОбАдресе);
		
		AddressInfo.AddressText = AddressText;
		AddressInfo.Type = ВидыАдресов.АдресСтрокой;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоАдресВФорматеАдрРФ(СведенияОбАдресе)
	
	Результат = Ложь;
	
	Если НЕ ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса)
		ИЛИ НЕ ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если СведенияОбАдресе.Корпуса.Количество() > 1
		ИЛИ СведенияОбАдресе.Помещения.Количество() > 1 Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса)
		И ВРЕГ(СведенияОбАдресе.Корпуса[0].ТипКорпуса) <> ВРЕГ(ТипКорпусаАдрРФ()) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения)
		И ВРЕГ(СведенияОбАдресе.Помещения[0].ТипПомещения) <> ВРЕГ(ТипПомещенияАдрРФ()) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ТипКорпусаАдрРФ()
	
	Возврат "Корпус";
	
КонецФункции

Функция ТипПомещенияАдрРФ()
	
	Возврат "Квартира";
	
КонецФункции

Процедура УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(Контент, ДанныеПоДокументу, ДополнительныеПараметры)
	
	Перем СведенияПрослеживаемости;
	
	ТабличныеДанные = ДанныеПоДокументу.ТабличныеДанные;
	ДанныеПоДокументу.Свойство("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	
	ВсеСтрокиБезНДС = Истина;
	
	Если Контент.Table = Неопределено Тогда
		Table = Контракт_InvoiceTable970();
		Контент.Table = Table;
	Иначе
		Table = Контент.Table;
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Если Контент.Function <> ФункцияДокументаУПД_ДОП()
			И СтрокаТаблицы.ТипНоменклатуры = УПД970_ТипНоменклатурыВозвратнаяТара() Тогда
			Продолжить;
		КонецЕсли;
			
		Item = Контракт_Item970();
		
		УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы);
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			Item.Quantity = Окр(СтрокаТаблицы.Количество, ТочностьКоличества);
		КонецЕсли;
		
		ПредставлениеСтавки = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
			
		Item.TaxRate = ПредставлениеСтавки;
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		
		Item.Price = УПД970_ЦенаБезНДС(СтрокаТаблицы, ТочностьЦены);
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		
		УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(
			Item,
			СтрокаТаблицы,
			СведенияПрослеживаемости);
			
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		УПД970_ПерерассчитатьИтоговыеЗначенияТаблицы(Table, Item);

	КонецЦикла;
	
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);	
	
КонецПроцедуры

Процедура УПД970_ПерерассчитатьИтоговыеЗначенияТаблицы(Table, Item)

	Если Table.TotalNet = Неопределено Тогда
		Table.TotalNet = 0;
	КонецЕсли;
	
	Если Table.TotalWithVatExcluded = Неопределено Тогда
		Table.TotalWithVatExcluded = 0;
	КонецЕсли;
	
	Если Table.Vat = Неопределено Тогда
		Table.Vat = 0;
	КонецЕсли;
	
	Если Table.Total = Неопределено Тогда
		Table.Total = 0;
	КонецЕсли;
	
	Если Item.Quantity <> Неопределено Тогда
		Table.TotalNet = Table.TotalNet + Item.Quantity;
	КонецЕсли;
	
	Table.Vat = Table.Vat + Item.Vat;
	Table.TotalWithVatExcluded = Table.TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
	Table.Total = Table.Total + Item.Subtotal;

КонецПроцедуры

Процедура УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы)
	
	Item.Product = УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы);
	Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
	
	Item.ItemVendorCode = СтрокаТаблицы.КодИлиАртикулНоменклатуры;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
		
		КодЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод);
		ИмяЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
		
		Item.Unit = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕИ);
		Item.UnitName = ИмяЕИ;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(Item, СтрокаТаблицы, СведенияПрослеживаемости)

	УПД970_ЗаполнитьСведенияОТаможеннойДекларации(
		Item,
		СтрокаТаблицы);
	
	Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
		
		УПД970_ЗаполнитьСведенияПрослеживаемости(
			Item,
			СведенияПрослеживаемости,
			СтрокаТаблицы.ИдентификаторСтроки);
		
	КонецЕсли;
	
	Если Item.ItemTracingInfos.Количество() > 0 Тогда
		УПД970_ЗаполнитьПризнакПрослеживаемогоТовараВСведенияхОТаможеннойДекларации(Item.CustomDeclarations);
	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(Контент, ТабличныеДанные, ДополнительныеПараметры)
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;

	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
			
		Item = Контракт_Item970();
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Содержание) Тогда
			НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураПолноеНаименование;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураНаименование) Тогда
			НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураНаименование;
		Иначе
			НаименованиеНоменклатуры = "Предварительная оплата";
		КонецЕсли;
		
		Item.Product = НаименованиеНоменклатуры;
		Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
		
		Item.ItemVendorCode = СтрокаТаблицы.КодИлиАртикулНоменклатуры;
		
		ПредставлениеСтавки = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		Item.TaxRate = ПредставлениеСтавки;
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияСтроки();
		Item.СлужебнаяИнформация.Номенклатура = СтрокаТаблицы.Номенклатура;
		Item.СлужебнаяИнформация.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.Vat = ТабличныеДанные.Итог("СуммаНДС");
	Table.Total = ТабличныеДанные.Итог("СуммаВсего");
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаТаблицы)
	
	ЭтоСтранаПроисхожденияРоссия = СтрокаТаблицы.СтранаПроисхожденияКод = ОсновнаяСтрана().Код;
	Если ЭтоСтранаПроисхожденияРоссия Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД)
		И (Не ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхожденияКод)
			Или СтрокаТаблицы.СтранаПроисхожденияУчастникЕАЭС) Тогда
		Возврат;
	КонецЕсли;
		
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = СтрокаТаблицы.СтранаПроисхожденияКод;
	CustomDeclaration.DeclarationNumber = СокрЛП(СтрокаТаблицы.НомерГТД);
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьПризнакПрослеживаемогоТовараВСведенияхОТаможеннойДекларации(CustomDeclarations)
	
	Для каждого CustomDeclaration Из CustomDeclarations Цикл
		CustomDeclaration.DeclarationNumber = УПД970_РегистрационныйНомерПрослеживаемогоТовара();
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СведенияПрослеживаемостиДокумента, ИдентификаторСтроки)
	
	Если СведенияПрослеживаемостиДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	СтрокиПрослеживаемости = СведенияПрослеживаемостиДокумента.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
		
		ItemTracingInfo = Контракт_ItemTracingInfo970();
		
		ItemTracingInfo.RegNumberUnit = СокрЛП(СтрокаПрослеживаемости.НомерРНПТ);
		ItemTracingInfo.Quantity = СтрокаПрослеживаемости.КоличествоПрослеживаемости;
		
		Если СтрокаПрослеживаемости.Сумма = Неопределено Тогда
			ItemTracingInfo.SumWithoutVat = Item.SubtotalWithVatExcluded;
		Иначе
			ItemTracingInfo.SumWithoutVat = СтрокаПрослеживаемости.Сумма;
		КонецЕсли;
		
		ItemTracingInfo.Unit = Item.Unit;
		ItemTracingInfo.UnitName = Item.UnitName;
		
		Item.ItemTracingInfos.Добавить(ItemTracingInfo);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент)
	
	Контент.DocumentCreator = "";
	Контент.DocumentCreatorBase = "";
	
	Если Контент.Sellers.Количество() > 0 Тогда
		
		ПродавецИнфо = Контент.Sellers[0];
		Контент.DocumentCreator = НаименованиеИННКПП(ПродавецИнфо.Name, ПродавецИнфо.Inn, ПродавецИнфо.Kpp);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры)
	
	Перем ДанныеСотрудника;
	
	ДополнительныеПараметры.Свойство("ДанныеСотрудника", ДанныеСотрудника);
		
	ЕстьТовары = УПД970_ВДокументеЕстьТовары(Контент.Table.Items);
	
	НеобходимоЗаполнитьСведения = (ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность)
		И Контент.Function <> ФункцияДокументаУПД_СЧФ()
		И ЕстьТовары);
	
	Если НеобходимоЗаполнитьСведения Тогда
		
		Employee = Контракт_Employee970();
		
		Employee.Surname = ДанныеСотрудника.Фамилия;
		Employee.FirstName = ДанныеСотрудника.Имя;
		Employee.Patronymic = ДанныеСотрудника.Отчество;
		Employee.EmployeePosition = ДанныеСотрудника.Должность;
		
		Контент.TransferInfo.Employee = Employee;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент)
	
	ЕстьПрослеживаемыеТовары = Ложь;
	
	Для Каждого Item Из Контент.Table.Items Цикл
		Если Item.ItemTracingInfos.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТовары = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПризнакиТоваров = ГенерацияXML.Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваровУПД970(ЕстьПрослеживаемыеТовары);
	
	ГенерацияXML.Заполнить_ПризнакиПрослеживаемыхИМаркируемыхТоваровДокументаУПД970(Контент, ПризнакиТоваров);

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаОбъект)
	
	Попытка
		
		РаботаСМаркировкойЛок.ЗаполнитьСведенияОМаркировке970(Контент);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ПодробнаяОшибка = Ядро.Общее_ПодставитьПараметрыВСтроку(
			"Не удалось заполнить сведения о маркировке по причине:
			|%1",
			ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
			"Диадок.РаботаСМаркировкой",
			УровеньЖурналаРегистрации.Ошибка,
			СсылкаНаОбъект.Метаданные(),
			СсылкаНаОбъект,
			ПодробнаяОшибка);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещении(AddressSAR, СведенияОбАдресе)

	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда
		
		Помещение = СведенияОбАдресе.Помещения[0];
		
		Если ЗначениеЗаполнено(Помещение.Номер) Тогда
			AddressSAR.Apartment = Помещение.Номер;
			AddressSAR.ApartmentType = Помещение.ТипПомещения;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОКорпусахСтроениях(AddressSAR, СведенияОбАдресе)

	Для Каждого Корпус Из СведенияОбАдресе.Корпуса Цикл
		
		Если ЗначениеЗаполнено(Корпус.Номер) Тогда
			
			AddressObject = Контракт_AddressObjectNumberInfo();
			AddressSAR.Buildings.Добавить(AddressObject);
			
			AddressObject.Number = Корпус.Номер;
			AddressObject.Type = Корпус.ТипКорпуса;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция УПД970_КодМуниципальногоРайона(ТипМуниципальногоРайона)
	
	Результат = "";
	
	Если ВРег(ТипМуниципальногоРайона) = ВРег("м.р-н") Тогда
		
		Результат = "1";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("г.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("ф.т.") Тогда
		
		Результат = "2";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер. г.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.г.") Тогда
		
		Результат = "3";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("мун. окр.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("м.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("мун.окр.") Тогда
		
		Результат = "4";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressRF(СведенияОбАдресе)
	
	Результат = Контракт_AddressRFInfo();
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = СведенияОбАдресе.Регион;
	Результат.Territory = СведенияОбАдресе.Район;
	
	Результат.City = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Город,
		СведенияОбАдресе.ГородСокращение);
	
	Результат.Locality = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.НаселенныйПункт,
		СведенияОбАдресе.НаселенныйПунктСокращение);
		
	Результат.Street = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Улица,
		СведенияОбАдресе.УлицаСокращение);
	
	ИмяПоляНомер = "Номер";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание) Тогда 
		СведенияОбАдресе.Здание.Свойство(ИмяПоляНомер, Результат.Building);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса) Тогда 
		СведенияОбАдресе.Корпуса[0].Свойство(ИмяПоляНомер, Результат.Block);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда 
		СведенияОбАдресе.Помещения[0].Свойство(ИмяПоляНомер, Результат.Apartment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressText(СведенияОбАдресе)
	
	Результат = Контракт_AddressTextInfo();
	
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса)
		И ЗначениеЗаполнено(СведенияОбАдресе.МуниципальноеПредставление) Тогда
		
		ПредставлениеАдреса = СведенияОбАдресе.МуниципальноеПредставление;
		
	КонецЕсли;
	
	Результат.AddressText = ПредставлениеАдреса;
	Результат.CountryCode = СведенияОбАдресе.КодСтраны;
	Результат.Country = СведенияОбАдресе.Страна;

	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеРегиона(СведенияОбАдресе)
	
	КодыРегионов = ГенерацияXML_КодыРегионов();
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		Результат = КодыРегионов.Получить(XMLЗначение(Тип("Число"), СведенияОбАдресе.КодРегиона));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		ЧастиРегиона = Новый Массив;
		ЧастиРегиона.Добавить(СокрЛП(СведенияОбАдресе.Регион));
		ЧастиРегиона.Добавить(НРег(СведенияОбАдресе.РегионТипПолный));
		
		Результат = СоединитьСтроку(ЧастиРегиона, " ");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО)
	
	ВидыЮрФизЛиц = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	ЭтоФизЛицо = НЕ ДанныеУчастникаЭДО.ЭтоЮрЛицо;
	ЭтоРезидент = НЕ ДанныеУчастникаЭДО.Нерезидент;
	
	Если ЭтоФизЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИндивидуальныйПредприниматель;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ЮридическоеЛицо;
		
	ИначеЕсли ЭтоФизЛицо И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностранныйГражданин;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо
		И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностраннаяОрганизация;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Не удалось определить тип участника ЭДО.
				|Заполните корректные реквизиты участников ЭДО в базе 1С 
				|(организация, грузоотправитель, контрагент, грузополучатель)'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента)
	
	Результат = Контракт_DocumentShipments970();
	
	Результат.Name = НаименованиеДокумента;
	Результат.Number = НомерДокумента;
	Результат.Date = ДатаДокумента;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйTransferBase(РеквизитыОснования)
	
	Результат = Контракт_TransferBases970();
	
	Результат.Name = РеквизитыОснования.Наименование;
	Результат.Number = РеквизитыОснования.Номер;
	Результат.Date = РеквизитыОснования.Дата;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыВТерминахПрото(ТипНоменклатуры)
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Если ТипНоменклатуры = УПД970_ТипНоменклатурыУслуга() Тогда
		Результат = ТипыНоменклатуры.Услуга;
	Иначе
		Результат = ТипыНоменклатуры.Имущество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РегистрационныйНомерПрослеживаемогоТовара()
	Возврат "Прослеж";
КонецФункции

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	Результат.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	Результат.Номенклатура = СтрокаТаблицы.Номенклатура;
	Результат.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
	Результат.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
	Результат.НомерГТД = СтрокаТаблицы.НомерГТД;
	Результат.ПрослеживаемыйТовар = СтрокаТаблицы.ПрослеживаемыйТовар;
	Результат.Серия = СтрокаТаблицы.СерияНоменклатуры;
	Результат.Характеристика = СтрокаТаблицы.ХарактеристикаНоменклатуры;
	Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка;
	Результат.ИдентификаторСтроки = СтрокаТаблицы.ИдентификаторСтроки;
	Результат.ПутьКИдентификаторуСтроки = СтрокаТаблицы.ИмяТабличнойЧасти;
	
	Возврат Результат;
	
КонецФункции

Функция УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФДОП() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьТовары(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЦенаБезНДС(СтрокаТаблицы, Разрядность)
	
	Перем Результат;
	
	ДопустимоеОтклонение = 0.03;
	
	Если СтрокаТаблицы.Количество = 0 Тогда
		
		Результат = 0;
		
	Иначе
		
		Результат = Окр(СтрокаТаблицы.СуммаБезНДС / СтрокаТаблицы.Количество, Разрядность);
		ОтклонениеВЦене = (Результат - СтрокаТаблицы.Цена) * СтрокаТаблицы.Количество;
		
		ОтклонениеВЦенеПоМодулю = Макс(ОтклонениеВЦене, -ОтклонениеВЦене);
		
		Если ОтклонениеВЦенеПоМодулю <= ДопустимоеОтклонение Тогда
			Результат = Окр(СтрокаТаблицы.Цена, Разрядность);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы)
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПолноеНаименование) Тогда
		НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураПолноеНаименование;
	Иначе
		НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураНаименование;
	КонецЕсли;
	
	ХарактеристикаНоменклатуры = "";
	Если ЗначениеЗаполнено(СтрокаТаблицы.ХарактеристикаНоменклатуры) Тогда
		ХарактеристикаНоменклатуры = ЗначениеРеквизитаОбъектаЛок(СтрокаТаблицы.ХарактеристикаНоменклатуры, "Наименование");
	КонецЕсли;
	
	СерияНоменклатуры = "";
	Если ЗначениеЗаполнено(СтрокаТаблицы.СерияНоменклатуры) Тогда
		СерияНоменклатуры = ЗначениеРеквизитаОбъектаЛок(СтрокаТаблицы.СерияНоменклатуры, "Наименование");
	КонецЕсли;
	
	ДопСведенияОНоменклатуре = Новый Массив;
	ДопСведенияОНоменклатуре.Добавить(СтрокаТаблицы.ХарактеристикаНоменклатуры);
	ДопСведенияОНоменклатуре.Добавить(СтрокаТаблицы.СерияНоменклатуры);
	
	РазделительСведений = "; ";
	ПредставлениеДопСведенийОНоменклатуре = СоединитьСтроку(ДопСведенияОНоменклатуре, РазделительСведений);
	
	Если ЗначениеЗаполнено(ПредставлениеДопСведенийОНоменклатуре) Тогда
		ПредставлениеДопСведенийОНоменклатуре = СтрШаблонЛок(" (%1)", ПредставлениеДопСведенийОНоменклатуре);
	КонецЕсли;
	
	Результат = НаименованиеНоменклатуры + ПредставлениеДопСведенийОНоменклатуре;
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Заполнение протоструктуры по документам. Общее

//} УПД970. Заполнение протоструктуры по документам

//{ УПД970. Исходные данные по документам

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(ДокСсылка)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный();
	ТекстЗапросаДанныхОДокументахОплаты = УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный();
	ТекстЗапросаДокументыОснования = УПД970_ТекстЗапросаДокументовОснованияСчетФактураВыданный();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхОДокументахОплаты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДокументыОснования);
	
	ТекстЗапроса = Ядро.СоединитьСтроку(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);

	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = УПД970_Контракт_ДанныеСчетФактураВыданный();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	СведенияОДокументахОплаты = РезультатыЗапроса[1].Выгрузить();
	ДокументыОснования = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку(0);
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ДокументыОснования = ДокументыОснования;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.ЭтоСчетФактураНаАванс = Ложь;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументСсылка, СчетФактура)

	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокументСсылка);

	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаРеализацияТоваровУслуг(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомитентуОПродажах(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаВозвратТоваровПоставщику(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаВозвратТоваровПоставщикуИзНТТ(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомиссионераОПродажах(ДокументСсылка, СчетФактура);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа-основания счета-фактура выданный: %1'");
		
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ДокументСсылка));
		
		ВызватьИсключение ТекстОшибки;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка)

	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданныйНаАванс());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданныйНаАванс());
	
	ТекстЗапроса = Ядро.СоединитьСтроку(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ДопКолонкаПечатныхФорм", УПД970_ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = УПД970_Контракт_ДанныеСчетФактураВыданный();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	СведенияОДокументахОплаты = РезультатыЗапроса[2].Выгрузить();
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.ЭтоСчетФактураНаАванс = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаРеализацияТоваровУслуг(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияТоваровУслуг());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияТоваровУслуг());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаРеализацияТоваровУслуг());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СоединитьСтроку(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", УПД970_ТипНоменклатурыТовар());
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", УПД970_ТипНоменклатурыУслуга());
	Запрос.УстановитьПараметр("ТипНоменклатурыВозвратнаяТара", УПД970_ТипНоменклатурыВозвратнаяТара());
	Запрос.УстановитьПараметр("ДопКолонкаПечатныхФорм", УПД970_ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	СведенияПрослеживаемости = РезультатЗапроса[2];
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомитентуОПродажах(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитентуОПродажах());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитентуОПродажах());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СоединитьСтроку(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", УПД970_ТипНоменклатурыУслуга());
	Запрос.УстановитьПараметр("ДопКолонкаПечатныхФорм", УПД970_ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[2];
	СведенияПрослеживаемости = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализации());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаКорректировкаРеализации());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СоединитьСтроку(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", УПД970_ТипНоменклатурыТовар());
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", УПД970_ТипНоменклатурыУслуга());
	Запрос.УстановитьПараметр("ДопКолонкаПечатныхФорм", УПД970_ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	СведенияПрослеживаемости = РезультатЗапроса[2];
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомиссионераОПродажах(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетаКомиссионераОПродажах());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионераОПродажах());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаОтчетаКомиссионераОПродажах());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СоединитьСтроку(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", УПД970_ТипНоменклатурыТовар());
	Запрос.УстановитьПараметр("ДопКолонкаПечатныхФорм", УПД970_ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	СведенияПрослеживаемости = РезультатЗапроса[3];
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаВозвратТоваровПоставщику(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратТоваровПоставщику());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратТоваровПоставщику());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаВозвратТоваровПоставщику());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СоединитьСтроку(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", УПД970_ТипНоменклатурыТовар());
	Запрос.УстановитьПараметр("ТипНоменклатурыВозвратнаяТара", УПД970_ТипНоменклатурыВозвратнаяТара());
	Запрос.УстановитьПараметр("ДопКолонкаПечатныхФорм", УПД970_ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	СведенияПрослеживаемости = РезультатЗапроса[2];
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаВозвратТоваровПоставщикуИзНТТ(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратТоваровПоставщикуИзНТТ());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратТоваровПоставщикуИзНТТ());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СоединитьСтроку(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", УПД970_ТипНоменклатурыТовар());
	Запрос.УстановитьПараметр("ТипНоменклатурыВозвратнаяТара", УПД970_ТипНоменклатурыВозвратнаяТара());
	Запрос.УстановитьПараметр("ДопКолонкаПечатныхФорм", УПД970_ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0];
	ТабличныеДанные = РезультатЗапроса[1];
	СведенияПрослеживаемости = Неопределено;
	
	Результат = УПД970_НовыеДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура);

	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыеДанныеПервичногоДокумента(
	РезультатЗапросаПоШапке,
	РезультатЗапросаПоТаблицам,
	РезультатЗапросаПоПрослеживаемости,
	СчетФактура)
	
	Результат = УПД970_Контракт_ДанныеПервичногоДокумента();
	
	ТабДанныеШапки = РезультатЗапросаПоШапке.Выгрузить();
	Если ТабДанныеШапки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	ТабличныеДанные = РезультатЗапросаПоТаблицам.Выгрузить();
	
	Если РезультатЗапросаПоПрослеживаемости = Неопределено Тогда
		СведенияПрослеживаемости = Неопределено;
	Иначе
		СведенияПрослеживаемости = РезультатЗапросаПоПрослеживаемости.Выгрузить();
	КонецЕсли;
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);

	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияПрослеживаемости = СведенияПрослеживаемости;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.СчетФактура = СчетФактура;
	
	Если УПД970_НеобходимоВыполнитьПересчетСуммВВалютеРегУчета(ДанныеШапки, СчетФактура) Тогда
		УПД970_ПерезаполнитьСуммыДокументаВВалютеРегУчета(ДанныеШапки, ТабличныеДанные);
		ДанныеШапки.ВалютаДокумента = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;
	
	Если УПД970_ВТабличныхДанныхДокументаТолькоУслуги(ТабличныеДанные) Тогда
		ДанныеШапки.Грузоотправитель = Неопределено;
		ДанныеШапки.Грузополучатель = Неопределено;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_РезультатыЗапросовДанныхПервичногоДокумента()

	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("СведенияПрослеживаемости");
	
	Возврат Результат;
	
КонецФункции

//{ УПД970. Исходные данные по документам. Тексты запросов

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Исправление КАК Исправление,
	|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданный.КППКонтрагента КАК КППКонтрагента,
	|	СчетФактураВыданный.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.КодВидаОперации КАК КодВидаОперации,
	|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный()
	
	Результат = 
	"ВЫБРАТЬ
	|	ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента КАК ДатаДокумента,
	|	ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента КАК НомерДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ДатаНомерДокументовОплаты КАК ДатаНомерДокументовОплаты
	|ГДЕ
	|	ДатаНомерДокументовОплаты.Ссылка = &Ссылка
	|	И ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента <> """"";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДокументовОснованияСчетФактураВыданный()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Основания.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК Основания
	|ГДЕ
	|	Основания.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.КодВидаОперации КАК КодВидаОперации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	
	|	ЕСТЬNULL(ПлатежноеПоручениеВходящее.СчетОрганизации, Организации.ОсновнойБанковскийСчет) КАК БанковскийСчетОрганизации,
	
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов

	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеШапки.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	|		ПО ДанныеШапки.ДокументОснование = ПлатежноеПоручениеВходящее.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданныйНаАванс()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Услуга"" КАК ТипНоменклатуры,
	|	ТабАвансы.Ссылка КАК Ссылка,
	|	ТабАвансы.НомерСтроки КАК НомерСтроки,
	|	""Авансы"" КАК ИмяТабличнойЧасти,
	|	ТабАвансы.Сумма КАК СуммаВсего,
	|	ТабАвансы.СуммаНДС КАК СуммаНДС,
	|	ТабАвансы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ТабАвансы.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	ТабАвансы.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК ТабАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабАвансы.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ТабАвансы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ВыражениеКодИлиАртикул =
	"ВЫБОР
	|		КОГДА &ДопКолонкаПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&КодИлиАртикулНоменклатуры", ВыражениеКодИлиАртикул);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданныйНаАванс()
	
	Результат = УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный();
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияТоваровУслуг()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.АдресДоставки КАК АдресДоставки,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДанныеШапки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,

	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияТоваровУслуг()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма - ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма + ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ТабТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ВозвратнаяТара.Ссылка КАК Ссылка,
	|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыВозвратнаяТара КАК ТипНоменклатуры,
	|	&ПустаяСтрока КАК ИдентификаторСтроки,
	|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
	|	ВозвратнаяТара.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	&ПустаяХарактеристика КАК ХарактеристикаНоменклатуры,
	|	&ПустаяСерия КАК СерияНоменклатуры,
	|	&ПустаяСтрана КАК СтранаПроисхождения,
	|	&ПустаяСтрока КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения  КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление  КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код  КАК ЕдиницаИзмеренияКод,
	|	&ПустаяСтрока КАК НомерГТД,
	|	ВозвратнаяТара.Количество КАК Количество,
	|	ВозвратнаяТара.Цена КАК Цена,
	|	&СтавкаБезНДС КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ВозвратнаяТара.Сумма КАК СуммаБезНДС,
	|	ВозвратнаяТара.Сумма КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК ВозвратнаяТара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ВозвратнаяТара.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3 КАК Порядок,
	|	ТабУслуги.Ссылка КАК Ссылка,
	|	ТабУслуги.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыУслуга КАК ТипНоменклатуры,
	|	&ПустаяСтрока КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	ТабУслуги.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТабУслуги.Содержание КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	&ПустаяХарактеристика КАК ХарактеристикаНоменклатуры,
	|	&ПустаяСерия КАК СерияНоменклатуры,
	|	&ПустаяСтрана КАК СтранаПроисхождения,
	|	&ПустаяСтрока КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	&ПустаяСтрокаКАК НомерГТД,
	|	ТабУслуги.Количество КАК Количество,
	|	ТабУслуги.Цена КАК Цена,
	|	ТабУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТабУслуги.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабУслуги.Сумма - ТабУслуги.СуммаНДС
	|		ИНАЧЕ ТабУслуги.Сумма
	|	КОНЕЦ  КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабУслуги.Сумма + ТабУслуги.СуммаНДС
	|		ИНАЧЕ ТабУслуги.Сумма
	|	КОНЕЦ  КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ТабУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабУслуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеШапки
	|		ПО ТабУслуги.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТабУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.Товары;
	
	ВыражениеТоварыИдентификаторСтроки = "ТабТовары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТЧ) Тогда
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "ТабТовары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТЧ) Тогда
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения, ТабТовары.СерияНоменклатуры.СтранаПроисхождения)";
	ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.Код, ТабТовары.СерияНоменклатуры.СтранаПроисхождения.Код)";
	ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.УчастникЕАЭС, ТабТовары.СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС)";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТЧ) Тогда // 10.3.69 и ниже
		ВыражениеСтранаСсылка = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))";
		ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения.Код, """")";
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеКодИлиАртикул =
	"ВЫБОР
	|		КОГДА &ДопКолонкаПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&КодИлиАртикулНоменклатуры", ВыражениеКодИлиАртикул);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&СтавкаБезНДС", "ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)");
	Замены.Добавить("&ПустаяХарактеристика", "ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСерия", "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрана", "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)");
	Замены.Добавить("&ПустойНомерГТД", "ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрока", """""");
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаРеализацияТоваровУслуг()
	
	ОбъектМетаданных = Метаданные.Документы.РеализацияТоваровУслуг;
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитентуОПродажах()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДанныеШапки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,

	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитентуОПродажах()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК СуммаВознаграждения,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения,
	|	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВремСуммыВознаграждения
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	1 КАК НомерСтроки,
	|	&ТипНоменклатурыУслуга КАК ТипНоменклатуры,
	|	"""" КАК ИдентификаторСтроки,
	|	"""" КАК ИмяТабличнойЧасти,
	|	&ПустаяНоменклатура КАК Номенклатура,
	|	""Комиссионное вознаграждение"" КАК НоменклатураПолноеНаименование,
	|	""Комиссионное вознаграждение"" КАК НоменклатураНаименование,
	|	&ПустаяСтрока КАК КодИлиАртикулНоменклатуры,
	|	&ПустаяХарактеристика КАК ХарактеристикаНоменклатуры,
	|	&ПустаяСерия КАК СерияНоменклатуры,
	|	&ПустаяСтрана КАК СтранаПроисхождения,
	|	&ПустаяСтрока КАК ПредставлениеСтраны,
	|	&ПустаяСтрока КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	&ПустаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	"""" КАК ЕдиницаИзмеренияНаименование,
	|	"""" КАК ЕдиницаИзмеренияКод,
	|	&ПустаяСтрока КАК НомерГТД,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	СуммыВознаграждения.СуммаНДСВознаграждения КАК СуммаНДС,
	|	СуммыВознаграждения.СуммаВознаграждения - СуммыВознаграждения.СуммаНДСВознаграждения КАК СуммаБезНДС,
	|	СуммыВознаграждения.СуммаВознаграждения КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСуммыВознаграждения КАК СуммыВознаграждения
	|		ПО ОтчетКомитентуОПродажах.Ссылка = СуммыВознаграждения.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ПустаяСтрока", """""");
	Замены.Добавить("&ПустаяНоменклатура", "ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)");
	Замены.Добавить("&ПустаяХарактеристика", "ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСерия", "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяЕдиницаИзмерения", "ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрана", "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)");
	Замены.Добавить("&ПустойНомерГТД", "ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)");
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаОтчетКомитентуОПродажах()
	
	ОбъектМетаданных = Метаданные.Документы.ОтчетКомиссионераОПродажах;
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.АдресДоставки КАК АдресДоставки,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДанныеШапки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,

	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализации()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма - ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма + ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ТабТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабТовары.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ТабУслуги.Ссылка КАК Ссылка,
	|	ТабУслуги.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыУслуга КАК ТипНоменклатуры,
	|	&ПустаяСтрока КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	ТабУслуги.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТабУслуги.Содержание КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	&ПустаяХарактеристика КАК ХарактеристикаНоменклатуры,
	|	&ПустаяСерия КАК СерияНоменклатуры,
	|	&ПустаяСтрана КАК СтранаПроисхождения,
	|	&ПустаяСтрока КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	&ПустаяСтрока КАК НомерГТД,
	|	ТабУслуги.Количество КАК Количество,
	|	ТабУслуги.Цена КАК Цена,
	|	ТабУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТабУслуги.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабУслуги.Сумма - ТабУслуги.СуммаНДС
	|		ИНАЧЕ ТабУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабУслуги.Сумма + ТабУслуги.СуммаНДС
	|		ИНАЧЕ ТабУслуги.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК ТабУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабУслуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ПО ТабУслуги.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТабУслуги.Ссылка = &Ссылка
	|	И ТабУслуги.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.КорректировкаРеализации.ТабличныеЧасти.Товары;
	
	ВыражениеТоварыИдентификаторСтроки = "ТабТовары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТЧ) Тогда
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "ТабТовары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТЧ) Тогда
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ТабТовары.СтранаПроисхождения";
	ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.Код, """")";
	ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ)";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТЧ) Тогда // 10.3.69 и ниже
		ВыражениеСтранаСсылка = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))";
		ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения.Код, """")";
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеКодИлиАртикул =
	"ВЫБОР
	|		КОГДА &ДопКолонкаПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&КодИлиАртикулНоменклатуры", ВыражениеКодИлиАртикул);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&СтавкаБезНДС", "ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)");
	Замены.Добавить("&ПустаяХарактеристика", "ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСерия", "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрана", "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)");
	Замены.Добавить("&ПустойНомерГТД", "ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрока", """""");
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаКорректировкаРеализации()
	
	ОбъектМетаданных = Метаданные.Документы.КорректировкаРеализации;
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетаКомиссионераОПродажах()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ТабПокупатели.Покупатель КАК Контрагент,
	|	ТабПокупатели.Покупатель.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТабПокупатели.Покупатель
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДанныеШапки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ТабПокупатели
	|		ПО ДанныеШапки.Ссылка = ТабПокупатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка
	|	И ТабПокупатели.СчетФактура = &СчетФактура";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионераОПродажах()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма - ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма + ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ТабТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ТабПокупатели
	|		ПО ТабТовары.Ссылка = ТабПокупатели.Ссылка
	|			И ТабТовары.КлючСтроки = ТабПокупатели.КлючСтроки
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабПокупатели.СчетФактура = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипНоменклатуры,
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.ОтчетКомиссионераОПродажах.ТабличныеЧасти.Товары;
	
	ВыражениеТоварыИдентификаторСтроки = "ТабТовары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТЧ) Тогда
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "ТабТовары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТЧ) Тогда
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ТабТовары.СтранаПроисхождения";
	ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.Код, """")";
	ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ)";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТЧ) Тогда // 10.3.69 и ниже
		ВыражениеСтранаСсылка = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))";
		ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения.Код, """")";
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеКодИлиАртикул =
	"ВЫБОР
	|		КОГДА &ДопКолонкаПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&КодИлиАртикулНоменклатуры", ВыражениеКодИлиАртикул);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаОтчетаКомиссионераОПродажах()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВремИдентификаторыСтрока
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК ТабТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК Покупатели
	|		ПО ТабТовары.Ссылка = Покупатели.Ссылка
	|			И ТабТовары.КлючСтроки = Покупатели.КлючСтроки
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И Покупатели.СчетФактура = &СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СведенияПрослеживаемости.Количество КАК Количество,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СведенияПрослеживаемости.Сумма КАК Сумма,
	|	НомераГТД.Код КАК НомерРНПТ,
	|	НомераГТД.РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремИдентификаторыСтрока КАК ВремИдентификаторыСтрока
	|		ПО СведенияПрослеживаемости.ИдентификаторСтроки = ВремИдентификаторыСтрока.ИдентификаторСтроки
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка";
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратТоваровПоставщику()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДанныеШапки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,

	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратТоваровПоставщику()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма - ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма + ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ТабТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ВозвратнаяТара.Ссылка КАК Ссылка,
	|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыВозвратнаяТара КАК ТипНоменклатуры,
	|	&ПустаяСтрока КАК ИдентификаторСтроки,
	|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
	|	ВозвратнаяТара.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	&ПустаяХарактеристика КАК ХарактеристикаНоменклатуры,
	|	&ПустаяСерия КАК СерияНоменклатуры,
	|	&ПустаяСтрана КАК СтранаПроисхождения,
	|	&ПустаяСтрока КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	&ПустаяСтрока КАК НомерГТД,
	|	ВозвратнаяТара.Количество КАК Количество,
	|	ВозвратнаяТара.Цена КАК Цена,
	|	&СтавкаБезНДС КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ВозвратнаяТара.Сумма КАК СуммаБезНДС,
	|	ВозвратнаяТара.Сумма КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.ВозвратнаяТара КАК ВозвратнаяТара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ВозвратнаяТара.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.ВозвратТоваровПоставщику.ТабличныеЧасти.Товары;
	
	ВыражениеТоварыИдентификаторСтроки = "ТабТовары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТЧ) Тогда
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "ТабТовары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТЧ) Тогда
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ТабТовары.СтранаПроисхождения";
	ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.Код, """")";
	ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ)";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТЧ) Тогда // 10.3.69 и ниже
		ВыражениеСтранаСсылка = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))";
		ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения.Код, """")";
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеКодИлиАртикул =
	"ВЫБОР
	|		КОГДА &ДопКолонкаПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&КодИлиАртикулНоменклатуры", ВыражениеКодИлиАртикул);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&СтавкаБезНДС", "ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)");
	Замены.Добавить("&ПустаяХарактеристика", "ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСерия", "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрана", "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)");
	Замены.Добавить("&ПустойНомерГТД", "ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрока", """""");
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаВозвратТоваровПоставщику()
	
	ОбъектМетаданных = Метаданные.Документы.ВозвратТоваровПоставщику;
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратТоваровПоставщикуИзНТТ()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ДанныеШапки.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДанныеШапки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДанныеШапки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,

	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратТоваровПоставщикуИзНТТ()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	&ТипНоменклатурыТовар КАК ТипНоменклатуры,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма - ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.УчитыватьНДС
	|				И НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабТовары.Сумма + ТабТовары.СуммаНДС
	|		ИНАЧЕ ТабТовары.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ТабТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщикуИзНТТ КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВозвратнаяТара.Ссылка,
	|	ВозвратнаяТара.НомерСтроки,
	|	&ТипНоменклатурыВозвратнаяТара,
	|	"""",
	|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
	|	ВозвратнаяТара.Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	&КодИлиАртикулНоменклатуры КАК КодИлиАртикулНоменклатуры,
	|	&ПустаяХарактеристика КАК ХарактеристикаНоменклатуры,
	|	&ПустаяСерия КАК СерияНоменклатуры,
	|	&ПустаяСтрана КАК СтранаПроисхождения,
	|	&ПустаяСтрока КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	&ПустаяСтрока КАК НомерГТД,
	|	ВозвратнаяТара.Количество КАК Количество,
	|	ВозвратнаяТара.Цена КАК Цена,
	|	&СтавкаБезНДС КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ВозвратнаяТара.Сумма КАК СуммаБезНДС,
	|	ВозвратнаяТара.Сумма КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ.ВозвратнаяТара КАК ВозвратнаяТара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ВозвратнаяТара.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	МетаданныеТЧ = Метаданные.Документы.ВозвратТоваровПоставщикуИзНТТ.ТабличныеЧасти.Товары;
	
	ВыражениеТоварыИдентификаторСтроки = "ТабТовары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТЧ) Тогда
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "ТабТовары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТЧ) Тогда
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ТабТовары.СтранаПроисхождения";
	ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.Код, """")";
	ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(ТабТовары.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ)";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТЧ) Тогда // 10.3.69 и ниже
		ВыражениеСтранаСсылка = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))";
		ВыражениеСтранаКод = "ЕСТЬNULL(ТабТовары.СерияНоменклатуры.СтранаПроисхождения.Код, """")";
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеКодИлиАртикул =
	"ВЫБОР
	|		КОГДА &ДопКолонкаПечатныхФорм = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&КодИлиАртикулНоменклатуры", ВыражениеКодИлиАртикул);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&СтавкаБезНДС", "ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)");
	Замены.Добавить("&ПустаяХарактеристика", "ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСерия", "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрана", "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)");
	Замены.Добавить("&ПустойНомерГТД", "ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)");
	Замены.Добавить("&ПустаяСтрока", """""");
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ОбъектМетаданных)
	
	Пустышка =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	&ПустойНомерГТД КАК РНПТ,
	|	0 КАК Количество,
	|	0 КАК КоличествоПрослеживаемости,
	|	"""""""" КАК ИдентификаторСтроки,
	|	0 КАК Сумма,
	|	"""""""" КАК НомерРНПТ,
	|	"""""""" КАК РегистрационныйНомер";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ПустойНомерГТД", "ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)");
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(Пустышка);
	
	МетаданныеТЧ = ОбъектМетаданных.ТабличныеЧасти.Найти("СведенияПрослеживаемости");
	
	Если МетаданныеТЧ <> Неопределено Тогда // 10.3.70 и выше
		
		ОсновнойЗапрос =
		"ВЫБРАТЬ
		|	ТаблицаПрослеживаемости.РНПТ КАК РНПТ,
		|	ТаблицаПрослеживаемости.Количество КАК Количество,
		|	ТаблицаПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	ТаблицаПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	&ВыражениеСумма КАК Сумма,
		|	НомераГТД.Код КАК НомерРНПТ,
		|	НомераГТД.РегистрационныйНомер КАК РегистрационныйНомер
		|ИЗ
		|	&ПолноеИмяТаблицы КАК ТаблицаПрослеживаемости
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
		|		ПО ТаблицаПрослеживаемости.РНПТ = НомераГТД.Ссылка
		|ГДЕ
		|	ТаблицаПрослеживаемости.Ссылка = &Ссылка";
		
		ВыражениеСумма = "ТаблицаПрослеживаемости.Сумма";
		Если Не ЕстьРеквизитОбъектаЛок("Сумма", МетаданныеТЧ) Тогда
			ВыражениеСумма = "0";
		КонецЕсли;
		
		Замены.Добавить("&ПолноеИмяТаблицы", ОбъектМетаданных.ПолноеИмя() + ".СведенияПрослеживаемости");
		Замены.Добавить("&ВыражениеСумма", ВыражениеСумма);
		
		ЧастиЗапроса.Добавить(ОсновнойЗапрос);
		
	КонецЕсли;
	
	Результат = СоединитьСтроку(ЧастиЗапроса, ТекстЗапроса_ОбъединитьВсе());
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Исходные данные по документам. Тексты запросов

//} УПД970. Исходные данные по документам

//{ УПД970. Служебные процедуры и функции

Функция УПД970_НомерИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки)
	
	Если ЗначениеЗаполнено(ДанныеШапки.НомерИсходногоДокумента) Тогда
		Результат = ДанныеШапки.НомерИсходногоДокумента;
	Иначе
		Результат = ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДатаИсходногоДокументаИсправительногоСчетФактураВыданный(ДанныеШапки)
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДатаИсходногоДокумента) Тогда
		Результат = ДанныеШапки.ДатаИсходногоДокумента;
	Иначе
		Результат = ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыВозвратнаяТара()
	Возврат "ВозвратнаяТара";
КонецФункции

Функция УПД970_ТипНоменклатурыТовар()
	Возврат "Товар";
КонецФункции

Функция УПД970_ТипНоменклатурыУслуга()
	Возврат "Услуга";
КонецФункции

Функция УПД970_ВТабличныхДанныхДокументаТолькоУслуги(ТабличныеДанные)
	
	ОтборСтрок = Новый Структура("ТипНоменклатуры", УПД970_ТипНоменклатурыУслуга());
	СтрокиСУслугами = ТабличныеДанные.НайтиСтроки(ОтборСтрок);
	
	Результат = (СтрокиСУслугами.Количество() = ТабличныеДанные.Количество());
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НеобходимоВыполнитьПересчетСуммВВалютеРегУчета(ДанныеШапки, СчетФактура)
	
	Перем Результат;
	
	ВалютаРеглУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Если ЭтоСчетФактураНаАванс(СчетФактура) Тогда
		
		Результат = Истина;
		
	ИначеЕсли ДанныеШапки.РасчетыВУсловныхЕдиницах
		И ДанныеШапки.ВалютаДокумента <> ВалютаРеглУчета Тогда
		
		Результат = УчетнаяПолитикаОрганизацииНастроена(ДанныеШапки.Организация, ДанныеШапки.Дата);
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ПерезаполнитьСуммыДокументаВВалютеРегУчета(ДанныеШапки, ТабличныеДанные)
	
	СуммаДокументаВВалютеРегУчета = УПД970_СуммаДокументаВВалютеРегУчетаСУчетомКурсовыхРазниц(
		ДанныеШапки,
		ТабличныеДанные);
	
	Коэффициент = ДанныеШапки.КурсВзаиморасчетов / ДанныеШапки.КратностьВзаиморасчетов;
	РазрядностьСуммы = 2;

	МассивРаспределения = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		СтрокаТаблицы.СуммаБезНДС = Окр(СтрокаТаблицы.СуммаБезНДС * Коэффициент, РазрядностьСуммы);
		СтрокаТаблицы.СуммаНДС = Окр(СтрокаТаблицы.СуммаНДС * Коэффициент, РазрядностьСуммы);
		
		СтрокаТаблицы.СуммаВсего = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.СуммаНДС;
		
		МассивРаспределения.Добавить(СтрокаТаблицы.СуммаВсего);
		
	КонецЦикла;
	
	МодульУчетНДС = ОбщийМодульПоИмениЛок("УчетНДС");
	
	МодульУчетНДС.РаспределитьСуммуПоСтолбцу(
		МассивРаспределения,
		СуммаДокументаВВалютеРегУчета,
		ТабличныеДанные,
		"СуммаВсего");
	
	РасчетСуммыНДСПоСтавке = МодульУчетНДС.РасчетНДСвРубляхПоСтавкеДокумента(ДанныеШапки.Дата);
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Если РасчетСуммыНДСПоСтавке Тогда
			
			СтавкаНДСЧислом = МодульУчетНДС.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
			
			СуммаНДС = Окр(СтрокаТаблицы.СуммаВсего * СтавкаНДСЧислом / (100 + СтавкаНДСЧислом), РазрядностьСуммы);
			
			СтрокаТаблицы.СуммаНДС = СуммаНДС;
			СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.СуммаВсего - СтрокаТаблицы.СуммаНДС;
			
		Иначе
			
			МассивРаспределения.Очистить();
			МассивРаспределения.Добавить(СтрокаТаблицы.СуммаБезНДС);
			МассивРаспределения.Добавить(СтрокаТаблицы.СуммаНДС);
			
			РезультатРаспределения = ОбщегоНазначения.РаспределитьПропорционально(
				СтрокаТаблицы.СуммаВсего,
				МассивРаспределения);
			
			Если РезультатРаспределения <> Неопределено Тогда
				СтрокаТаблицы.СуммаБезНДС = РезультатРаспределения[0];
				СтрокаТаблицы.СуммаНДС = РезультатРаспределения[1];
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТаблицы.СуммаВсего = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.СуммаНДС;
		
	КонецЦикла;

КонецПроцедуры

Функция УПД970_СуммаДокументаВВалютеРегУчетаСУчетомКурсовыхРазниц(ДанныеШапки, ТабличныеДанные)
	
	Результат = 0;
	
	Если Не УПД970_ЕстьТабличнаяЧастьДокументыРасчетовСКонтрагентом(ДанныеШапки.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяДокумента = ДанныеШапки.Ссылка.Метаданные().Имя;
	
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ДокументыРасчетов.СуммаВзаиморасчетов), 0) КАК СуммаВзаиморасчетов,
	|	ЕСТЬNULL(СУММА(ДокументыРасчетов.СуммаРегл), 0) КАК СуммаРегл
	|ИЗ
	|	Документ.%1.ДокументыРасчетовСКонтрагентом КАК ДокументыРасчетов
	|ГДЕ
	|	ДокументыРасчетов.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрШаблонЛок(ШаблонТекстаЗапроса, ИмяДокумента);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеШапки.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СуммаВзаиморасчетовДокумента = 0;
	СуммаРегл = 0;
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если Выборка.Следующий() Тогда
		СуммаВзаиморасчетовДокумента = Выборка.СуммаВзаиморасчетов;
		СуммаРегл  = Выборка.СуммаРегл;
	КонецЕсли;
	
	ВалютаРегУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	СуммаДокумента = УПД970_СуммаДокументаСНДСБезУчетаВозвратнойТары(ТабличныеДанные);
	
	Если ДанныеШапки.ВалютаДокумента = ВалютаРегУчета Тогда
		КурсДокумента = 1;
		КратностьДокумента = 1;
	Иначе
		КурсДокумента = ДанныеШапки.КурсВзаиморасчетов;
		КратностьДокумента = ДанныеШапки.КратностьВзаиморасчетов;
	КонецЕсли;
	
	ИнтерфейсКонфигурации = ОбщийМодульПоИмениЛок("МодульВалютногоУчета");
	СуммаВзаиморасчетовВУЕ = ИнтерфейсКонфигурации.ПересчитатьИзВалютыВВалюту(
		СуммаДокумента,
		ДанныеШапки.ВалютаДокумента,
		ДанныеШапки.ВалютаВзаиморасчетов,
		КурсДокумента,
		ДанныеШапки.КурсВзаиморасчетов,
		КратностьДокумента,
		ДанныеШапки.КратностьВзаиморасчетов);
	
	НеоплаченнаяСуммаВзаиморасчетов = СуммаВзаиморасчетовВУЕ - СуммаВзаиморасчетовДокумента;
	
	НеоплаченнаяСуммаРегл = ИнтерфейсКонфигурации.ПересчитатьИзВалютыВВалюту(
		НеоплаченнаяСуммаВзаиморасчетов,
		ДанныеШапки.ВалютаВзаиморасчетов,
		ВалютаРегУчета,
		ДанныеШапки.КурсВзаиморасчетов,
		1,
		ДанныеШапки.КратностьВзаиморасчетов,
		1);
	
	Результат = СуммаРегл + НеоплаченнаяСуммаРегл;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЕстьТабличнаяЧастьДокументыРасчетовСКонтрагентом(Документ)
	
	ТипДокумента = ТипЗнч(Документ);
	
	Результат = (ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
		Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
		
	Возврат Результат;
	
КонецФункции

Функция УПД970_СуммаДокументаСНДСБезУчетаВозвратнойТары(ТабличныеДанные)
	
	Результат = 0;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Если СтрокаТаблицы.ТипНоменклатуры <> УПД970_ТипНоменклатурыВозвратнаяТара() Тогда
			Результат = Результат + СтрокаТаблицы.СуммаВсего;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияДокумента(ДанныеДокумента, ФункцияДокумента)
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		Результат = УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеДокумента);
	Иначе
		Результат = УПД970_ОбстоятельстваФормированияУПД(ДанныеДокумента);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияУПД(ДанныеДокумента)
	
	Результат = Неопределено;
	
	Если ДанныеДокумента.ЭтоДоговорСКомиссионером Тогда
		Результат = "00005";
	КонецЕсли;
	
	Если ДанныеДокумента.ЭтоДоговорСКомитентом Тогда
		Результат = "00007";
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу)
	
	Перем Результат;
	
	ЭтоКомиссионнаяТорговля = (ДанныеПоДокументу.ЭтоДоговорСКомитентом Или ДанныеПоДокументу.ЭтоДоговорСКомиссионером);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;

	Если ДанныеШапки.КодВидаОперации = "01" И ЭтоКомиссионнаяТорговля Тогда
		Результат = "1";	
	ИначеЕсли ДанныеШапки.КодВидаОперации = "02" Тогда
		Результат = "2";
	ИначеЕсли ДанныеШапки.КодВидаОперации = "27" Тогда
		Результат = "3";
	ИначеЕсли ДанныеШапки.КодВидаОперации = "06" Тогда
		Результат = "4";
	ИначеЕсли ДанныеШапки.КодВидаОперации = "34"
		Или (ДанныеШапки.КодВидаОперации = "33" И ДанныеПоДокументу.ЭтоСчетФактураНаАванс) Тогда
		Результат = "5";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыОснования)
	
	Результат = Новый Массив;

	ОснованияОтгрузки = Новый Массив;
	Для Каждого СсылкаНаДокумент Из ДокументыОснования Цикл
		
		ОснованиеОтгрузки = УПД970_ОснованиеОтгрузкиТоваровПоДокументу(СсылкаНаДокумент);
		Если ЗначениеЗаполнено(ОснованиеОтгрузки)
			И ОснованияОтгрузки.Найти(ОснованиеОтгрузки) = Неопределено Тогда
			ОснованияОтгрузки.Добавить(ОснованиеОтгрузки);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ОснованиеОтгрузки Из ОснованияОтгрузки Цикл
		
		РеквизитыОснования = УПД970_РеквизитыОснованияОтгрузкиТоваров(ОснованиеОтгрузки);
		Результат.Добавить(РеквизитыОснования);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОснованиеОтгрузкиТоваровПоДокументу(ДокументСсылка)
	
	РеквизитыДокумента = ЗначенияРеквизитовОбъектаЛок(ДокументСсылка, "ДоговорКонтрагента, Сделка");
	
	Договор = РеквизитыДокумента.ДоговорКонтрагента;
	Сделка = РеквизитыДокумента.Сделка;
	
	Если ВедениеВзаиморасчетовПоЗаказам(Договор)
		И ЗначениеЗаполнено(Сделка)
		И ЭтоЗаказПокупателя(Сделка) Тогда
		
		Результат = Сделка;
		
	ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		
		Результат = Договор;
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияОтгрузкиТоваров(ОснованиеОтгрузки)
	
	Если ЗначениеЗаполнено(ОснованиеОтгрузки) Тогда
		
		Если ЭтоЗаказПокупателя(ОснованиеОтгрузки) Тогда
			Результат = УПД970_РеквизитыОснованияОтгрузкиТоваровПоЗаказу(ОснованиеОтгрузки);
		Иначе
			Результат = УПД970_РеквизитыОснованияОтгрузкиТоваровПоДоговору(ОснованиеОтгрузки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияОтгрузкиТоваровПоЗаказу(ДокументСсылка)
	
	ИмяДокумента = "Заказ покупателя";
	ДатаДокумента = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "Дата");
	НомерДокумента = ПредставлениеНомера(ДокументСсылка);
	
	Результат = УПД970_НовыеРеквизитыОснованияОтгрузки(
		ИмяДокумента,
		НомерДокумента,
		ДатаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияОтгрузкиТоваровПоДоговору(Договор)

	РеквизитыДоговора = ЗначенияРеквизитовОбъектаЛок(
		Договор,
		"Номер, Дата");
			
	Результат = УПД970_НовыеРеквизитыОснованияОтгрузки(
		"Договор",
		РеквизитыДоговора.Номер,
		РеквизитыДоговора.Дата);
		
	Возврат Результат;

КонецФункции

Функция УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования)
	
	ОбязательныеРеквизитыЗаполнены = (РеквизитыОснования <> Неопределено
		И ЗначениеЗаполнено(РеквизитыОснования.Наименование)
		И ЗначениеЗаполнено(РеквизитыОснования.Номер)
		И ЗначениеЗаполнено(РеквизитыОснования.Дата));
	
	Возврат ОбязательныеРеквизитыЗаполнены;
	
КонецФункции

Функция УПД970_НовыеРеквизитыОснованияОтгрузки(Наименование = "", Номер = "", Дата = '00010101')

	Результат = Новый Структура;
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("Дата", Дата);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбУчастникахЭДО(ДанныеШапки)
	
	// Продавец
	СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		ДанныеШапки.Организация,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетОрганизации);
	
	// Покупатель
	Если ДанныеШапки.ОбособленноеПодразделение Тогда
		
		СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
			ДанныеШапки.ГоловнойКонтрагент,
			ДанныеШапки.Дата);
			
		СведенияОКонтрагенте.КПП = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.Контрагент, "КПП");
		
	Иначе
		
		СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
			ДанныеШапки.Контрагент,
			ДанныеШапки.Дата);
			
	КонецЕсли;
	
	// Грузоотправитель
	Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузоотправитель,
			ДанныеШапки.Дата);
		
	КонецЕсли;
	
	// Грузополучатель
	СведенияОГрузополучателе = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		
		СведенияОГрузополучателе = УПД970_ДанныеГрузополучателя(
			ДанныеШапки.Грузополучатель,
			ДанныеШапки.Дата,
			ДанныеШапки.АдресДоставки);
		
	КонецЕсли;

	Результат = УПД970_Контракт_УчастникиЭДО();
	Результат.Организация = СведенияОбОрганизации;
	Результат.Контрагент = СведенияОКонтрагенте;
	Результат.Грузоотправитель = СведенияОГрузоотправителе;
	Результат.Грузополучатель = СведенияОГрузополучателе;

	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсЮрАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(Ссылка);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсФактАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_Контракт_ДанныеУчастникаЭДО();
	
	МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	
	СведенияОЮрФизЛице = МодульУправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Ссылка, ДатаСведений, , БанковскийСчет);
	
	Результат.Ссылка = Ссылка;
	
	Результат.Наименование = СведенияОЮрФизЛице.ПолноеНаименование;
	Результат.ИНН = СведенияОЮрФизЛице.ИНН;
	Результат.КПП = СведенияОЮрФизЛице.КПП;
	Результат.КодПоОКПО = СведенияОЮрФизЛице.КодПоОКПО;
	
	Если ЗначениеЗаполнено(СведенияОЮрФизЛице.Банк) Тогда
		Результат.НаименованиеБанка = СведенияОЮрФизЛице.Банк.Наименование;
	Иначе
		Результат.НаименованиеБанка = "";
	КонецЕсли;
	
	Результат.НомерСчета = СведенияОЮрФизЛице.НомерСчета;
	Результат.КоррСчет = СведенияОЮрФизЛице.КоррСчет;
	Результат.БИК = СведенияОЮрФизЛице.БИК;
	
	Результат.Телефоны = СведенияОЮрФизЛице.Телефоны;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиОрганизации(Результат, Ссылка);
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиКонтрагента(Результат, Ссылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиОрганизации(ДанныеУчастникаЭДО, Ссылка)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.Наименование КАК Наименование,
	|	Т.ЮрФизЛицо КАК ЮрФизЛицо,
	|	&СтранаРегистрацииСсылка КАК Страна,
	|	&СтранаРегистрацииКод КАК СтранаКод,
	|	&СтранаРегистрацииНаименование КАК СтранаНаименование,
	|	Т.ОГРН КАК ОГРН,
	|	Т.НаименованиеПолное КАК НаименованиеИнострОрганизации,
	|	&ИностраннаяОрганизация КАК ИностраннаяОрганизация,
	|	&КодВСтранеРегистрации КАК КодВСтранеРегистрации,
	|	Т.СвидетельствоСерияНомер КАК СвидетельствоСерияНомер,
	|	Т.СвидетельствоДатаВыдачи КАК СвидетельствоДатаВыдачи
	|ИЗ
	|	Справочник.Организации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	СтранаРегистрацииСсылка = "Т.СтранаРегистрации";
	СтранаРегистрацииКод = "ЕСТЬNULL(Т.СтранаРегистрации.Код, """")";
	СтранаРегистрацииНаименование = "ЕСТЬNULL(Т.СтранаРегистрации.Наименование, """")";
	ИностраннаяОрганизация = "Т.ИностраннаяОрганизация";
	КодВСтранеРегистрации = "Т.КодВСтранеРегистрации";
	НаименованиеИнострОрганизации = "Т.НаименованиеИнострОрганизации";
	
	ОбъектМД = Метаданные.Справочники.Организации;
	Если Не ЕстьРеквизитОбъектаЛок("СтранаРегистрации", ОбъектМД) Тогда
		СтранаРегистрацииСсылка = "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)";
		СтранаРегистрацииКод = """""";
		СтранаРегистрацииНаименование = """""";
		ИностраннаяОрганизация = "ЛОЖЬ";
		КодВСтранеРегистрации = """""";
		НаименованиеИнострОрганизации = """""";
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаРегистрацииСсылка", СтранаРегистрацииСсылка);
	Замены.Добавить("&СтранаРегистрацииКод", СтранаРегистрацииКод);
	Замены.Добавить("&СтранаРегистрацииНаименование", СтранаРегистрацииНаименование);
	Замены.Добавить("&ИностраннаяОрганизация", ИностраннаяОрганизация);
	Замены.Добавить("&КодВСтранеРегистрации", КодВСтранеРегистрации);
	Замены.Добавить("&НаименованиеИнострОрганизации", НаименованиеИнострОрганизации);
	
	Для Каждого Элемент Из Замены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	СведенияОбОрганизации = Запрос.Выполнить().Выбрать();
	Если Не СведенияОбОрганизации.Следующий() Тогда
		Ошибка = СтрШаблонЛок("Не удалось прочитать данные организации (Ссылка = %1)", Ссылка);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ЭтоИндивидуальныйПредприниматель = (СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо);
	ЭтоИностраннаяОрганизация = СведенияОбОрганизации.ИностраннаяОрганизация;
	
	ДанныеУчастникаЭДО.ЭтоЮрЛицо = (СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
	
	СтранаКод = СведенияОбОрганизации.СтранаКод;
	СтранаНаименование = СведенияОбОрганизации.СтранаНаименование;
	Если Не ЗначениеЗаполнено(СведенияОбОрганизации.Страна)
		И Не ЭтоИностраннаяОрганизация Тогда
		
		СтранаКод = ОсновнаяСтрана().Код;
		СтранаНаименование = ОсновнаяСтрана().Наименование;
		
	КонецЕсли;
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		ДанныеУчастникаЭДО.ОГРНИП = СведенияОбОрганизации.ОГРН;
	КонецЕсли;
	
	Если ЭтоИностраннаяОрганизация Тогда
		ДанныеУчастникаЭДО.Наименование = СведенияОбОрганизации.НаименованиеИнострОрганизации;
		ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации = СведенияОбОрганизации.КодВСтранеРегистрации;
	КонецЕсли;
	
	ДанныеУчастникаЭДО.СтранаКод = СтранаКод;
	ДанныеУчастникаЭДО.СтранаНаименование = СтранаНаименование;
	
	ДанныеУчастникаЭДО.Нерезидент = ЭтоИностраннаяОрганизация;
	
	Свидетельство = "";
	Если ЗначениеЗаполнено(СведенияОбОрганизации.СвидетельствоСерияНомер) Тогда
		Свидетельство = "свидетельство " + СведенияОбОрганизации.СвидетельствоСерияНомер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.СвидетельствоДатаВыдачи) Тогда
		Свидетельство = Свидетельство + " от " + Формат(СведенияОбОрганизации.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ДанныеУчастникаЭДО.Свидетельство = Свидетельство;
	
	ДанныеУчастникаЭДО.ЭлектроннаяПочта = УправлениеЭлектроннойПочтой.ОпределитьАдресПолучателя(Ссылка);
	
КонецПроцедуры

Процедура УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиКонтрагента(ДанныеУчастникаЭДО, Ссылка)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.Наименование КАК Наименование,
	|	Т.ЮрФизЛицо КАК ЮрФизЛицо,
	|	&СтранаРегистрацииСсылка КАК Страна,
	|	&СтранаРегистрацииКод КАК СтранаКод,
	|	&СтранаРегистрацииНаименование КАК СтранаНаименование,
	|	&ОГРН КАК ОГРН,
	|	Т.НеЯвляетсяРезидентом КАК ИностраннаяОрганизация,
	|	&РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	Справочник.Контрагенты КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	ОбъектМД = Метаданные.Справочники.Контрагенты;
	
	СтранаРегистрацииСсылка = "Т.СтранаРегистрации";
	СтранаРегистрацииКод = "ЕСТЬNULL(Т.СтранаРегистрации.Код, """")";
	СтранаРегистрацииНаименование = "ЕСТЬNULL(Т.СтранаРегистрации.Наименование, """")";
	РегистрационныйНомер = "Т.РегистрационныйНомер";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаРегистрации", ОбъектМД) Тогда
		СтранаРегистрацииСсылка = "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)";
		СтранаРегистрацииКод = """""";
		СтранаРегистрацииНаименование = """""";
		РегистрационныйНомер = """""";
	КонецЕсли;
	
	ОГРН = "Т.ОГРН";
	Если Не ЕстьРеквизитОбъектаЛок("ОГРН", ОбъектМД) Тогда
		ОГРН = """""";
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаРегистрацииСсылка", СтранаРегистрацииСсылка);
	Замены.Добавить("&СтранаРегистрацииКод", СтранаРегистрацииКод);
	Замены.Добавить("&СтранаРегистрацииНаименование", СтранаРегистрацииНаименование);
	Замены.Добавить("&РегистрационныйНомер", РегистрационныйНомер);
	Замены.Добавить("&ОГРН", ОГРН);
	
	Для Каждого Элемент Из Замены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	СведенияОКонтрагенте = Запрос.Выполнить().Выбрать();
	Если Не СведенияОКонтрагенте.Следующий() Тогда
		Ошибка = СтрШаблонЛок("Не удалось прочитать данные контрагенте (Ссылка = %1)", Ссылка);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ЭтоИндивидуальныйПредприниматель = (СведенияОКонтрагенте.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо);
	ЭтоИностраннаяОрганизация = СведенияОКонтрагенте.ИностраннаяОрганизация;
	
	СтранаКод = СведенияОКонтрагенте.СтранаКод;
	СтранаНаименование = СведенияОКонтрагенте.СтранаНаименование;
	Если Не ЗначениеЗаполнено(СведенияОКонтрагенте.Страна)
		И Не ЭтоИностраннаяОрганизация Тогда
		
		СтранаКод = ОсновнаяСтрана().Код;
		СтранаНаименование = ОсновнаяСтрана().Наименование;
		
	КонецЕсли;
	
	ДанныеУчастникаЭДО.ЭтоЮрЛицо = (СведенияОКонтрагенте.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
	
	Если ЭтоИностраннаяОрганизация Тогда
		ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации = СведенияОКонтрагенте.РегистрационныйНомер;
	КонецЕсли;
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		ДанныеУчастникаЭДО.ОГРНИП = СведенияОКонтрагенте.ОГРН;
	КонецЕсли;
	
	ДанныеУчастникаЭДО.СтранаКод = СведенияОКонтрагенте.СтранаКод;
	ДанныеУчастникаЭДО.СтранаНаименование = СведенияОКонтрагенте.СтранаНаименование;
	
	ДанныеУчастникаЭДО.Нерезидент = ЭтоИностраннаяОрганизация;
	
	ДанныеУчастникаЭДО.ЭлектроннаяПочта = УправлениеЭлектроннойПочтой.ОпределитьАдресПолучателя(Ссылка);
	
КонецПроцедуры

Функция УПД970_ДанныеГрузополучателя(Ссылка, ДатаСведений, Знач АдресДоставки)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений);
	
	АдресДоставки = СокрЛП(АдресДоставки);
	
	Если ЗначениеЗаполнено(АдресДоставки) Тогда
		СведенияОбАдресе = УПД970_СведенияОбАдресеДоставки(Ссылка, АдресДоставки);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка);
	КонецЕсли;
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбЮридическомАдресе(Ссылка)
	
	Перем Результат;
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	ЗаписьКИ = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ЮридическийАдрес);
	
	Если ЗаписьКИ <> Неопределено Тогда
		
		Результат = УПД970_СведенияОбАдресе(ЗаписьКИ);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОФактическомАдресе(Ссылка)
	
	Перем Результат;
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	ЗаписьКИ = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ФактическийАдрес);
	
	Если ЗаписьКИ <> Неопределено Тогда
		
		Результат = УПД970_СведенияОбАдресе(ЗаписьКИ);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеДоставки(Ссылка, АдресДоставки)
	
	Перем Результат;
	
	ПоляАдреса = УПД970_АдресИзПредставленияАдреса(Ссылка, АдресДоставки);
	
	Если ПоляАдреса <> Неопределено Тогда
		
		Результат = УПД970_НовыйСведенияОбАдресе();
		
		УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(Результат, ПоляАдреса);
		
		Результат.ТипАдреса = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресе(ЗаписьКИ)
	
	Результат = УПД970_НовыйСведенияОбАдресе();
	УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(Результат, ЗаписьКИ);
	
	УПД970_ДополнитьСведенияОбАдресеОсновнойСтраной(Результат);
	
	ЭтоАдминистративноТерриториальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressRF(Результат);
	
	ЭтоМуниципальныйАдрес = Ложь;
	Если Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		ЭтоМуниципальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressSAR(Результат);
	КонецЕсли;
	
	Если Не ЭтоМуниципальныйАдрес
		И Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		
		Результат.ТипАдреса = ТипАдресаВСвободнойФорме();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(СведенияОбАдресе, ЗаписьКИ)
	
	СведенияОбАдресе.Представление = ЗаписьКИ.Представление;
	
	Индекс = Неопределено;
	КодСтраны = Неопределено;
	НаименованиеСтраны = Неопределено;
	
	Если Не Общее_ВСтрокеТолькоЦифры(ЗаписьКИ.Поле1) Тогда 
		НаименованиеСтраны = СокрП(ЗаписьКИ.Поле1);
		КодСтраны = ГенерацияXML.КодСтраны(НаименованиеСтраны);
	Иначе
		Индекс = СокрП(ЗаписьКИ.Поле1);
	КонецЕсли;
	
	СведенияОбАдресе.Регион = СокрЛП(ЗаписьКИ.Поле2);
	КодРегиона = УПД970_КодРегиона(СведенияОбАдресе.Регион);
	
	Если ЗначениеЗаполнено(КодРегиона) Тогда // Это структурированный адрес РФ
		
		СведенияОбАдресе.ТипАдреса = АдминистративноТерриториальныйАдрес();
		
		СведенияОбАдресе.Страна = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.Индекс = Индекс;
		СведенияОбАдресе.КодСтраны = ОсновнаяСтрана().Код;
		СведенияОбАдресе.КодРегиона = КодРегиона;
		СведенияОбАдресе.Район = ЗаписьКИ.Поле3;
		СведенияОбАдресе.Город = ЗаписьКИ.Поле4;
		СведенияОбАдресе.НаселенныйПункт = ЗаписьКИ.Поле5;
		СведенияОбАдресе.Улица = ЗаписьКИ.Поле6;
		
		СведенияОбАдресе.Здание.ТипЗдания = ЗаписьКИ.ТипДома;
		СведенияОбАдресе.Здание.Номер = ЗаписьКИ.Поле7;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле8) Тогда
			
			Корпус = Новый Структура;
			Корпус.Вставить("ТипКорпуса", ЗаписьКИ.ТипКорпуса);
			Корпус.Вставить("Номер", ЗаписьКИ.Поле8);
			
			СведенияОбАдресе.Корпуса.Добавить(Корпус);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле9) Тогда
			
			Помещение = Новый Структура;
			Помещение.Вставить("ТипПомещения", ЗаписьКИ.ТипКвартиры);
			Помещение.Вставить("Номер", ЗаписьКИ.Поле9); 
			СведенияОбАдресе.Помещения.Добавить(Помещение);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(КодСтраны) Тогда // Это иностранный или российский адрес в свободной форме
		
		СведенияОбАдресе.КодСтраны = КодСтраны;
		СведенияОбАдресе.Страна = НаименованиеСтраны;
		
	Иначе // Это российский адрес, который не удалось разложить в структуру
		
		СведенияОбАдресе.Страна = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.КодСтраны = ОсновнаяСтрана().Код;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_АдресСоответствуетСтруктуреAddressSAR(СведенияОбАдресе)
	
	Результат = ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressRF(СведенияОбАдресе)
	
	Результат = ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСведенияОбАдресеОсновнойСтраной(Результат)
	
	Если НЕ ЗначениеЗаполнено(Результат.КодСтраны)
		И НЕ ЗначениеЗаполнено(Результат.Страна) Тогда
		
		Результат.КодСтраны = ОсновнаяСтрана().Код;
		Результат.Страна = ОсновнаяСтрана().Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_КодРегиона(Знач НаименованиеРегиона)
	
	Результат = ГенерацияXML.КодРегиона(НаименованиеРегиона);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйСведенияОбАдресе()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Представление", "");
	Результат.Вставить("ТипАдреса", "");
	Результат.Вставить("Страна", "");
	Результат.Вставить("КодСтраны", "");
	Результат.Вставить("Индекс", "");
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("Регион", "");
	Результат.Вставить("Район", "");
	Результат.Вставить("Город", "");
	Результат.Вставить("ГородСокращение", "");
	Результат.Вставить("НаселенныйПункт", "");
	Результат.Вставить("НаселенныйПунктСокращение", "");
	Результат.Вставить("Улица", "");
	Результат.Вставить("УлицаСокращение", "");
	
	Здание = Новый Структура;
	Здание.Вставить("ТипЗдания", "");
	Здание.Вставить("Номер", "");
	
	Результат.Вставить("Здание", Здание);
	Результат.Вставить("Корпуса", Новый Массив);
	Результат.Вставить("Помещения", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресИзПредставленияАдреса(Ссылка, ПредставлениеАдреса)
	
	Результат = Неопределено;
	
	РезультатЗапроса = УПД970_СведенияОбАдресеПоПредставлениюИзИБ(Ссылка, ПредставлениеАдреса);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		
		Результат = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		ЗаполнитьТипыАдресныхОбъектов(Результат);
		
		Если ЗначениеЗаполнено(Результат.Значение) Тогда
			ДополнитьКонтактнуюИнформациюДаннымиJson(Результат, Выборка.Значение, Выборка.Тип);
		КонецЕсли;
		
		УПД970_АдаптироватьПоляСтруктурыАдресов(Результат);
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		
		Результат = НоваяЗаписьКонтактнойИнформации();
		Результат.Представление = ПредставлениеАдреса;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеПоПредставлениюИзИБ(Ссылка, Знач ПредставлениеАдреса)
	
	Результат = Неопределено;
	
	МаксимальнаяДлинаСтроки = 1000;
	ПредставлениеАдреса = Сред(ПредставлениеАдреса, 1, МаксимальнаяДлинаСтроки);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("Представление", ПредставлениеАдреса);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И ВЫРАЗИТЬ(Т.Представление КАК СТРОКА(1000)) = &Представление";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидАдреса)
	
	Результат = Неопределено;
	
	РезультатЗапроса = УПД970_СведенияОбАдресеИзКонтактнойИнформацииОбъекта(Ссылка, ВидАдреса);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		
		Результат = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		ЗаполнитьТипыАдресныхОбъектов(Результат);
		
		Если ЗначениеЗаполнено(Результат.Значение) Тогда
			ДополнитьКонтактнуюИнформациюДаннымиJson(Результат, Выборка.Значение, Выборка.Тип);
		КонецЕсли;
		
		УПД970_АдаптироватьПоляСтруктурыАдресов(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеИзКонтактнойИнформацииОбъекта(Ссылка, ВидАдреса)
	
	ВидКИ = ВидАдресаЮрФизЛица(Ссылка, ВидАдреса);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("Вид", ВидКИ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И Т.Вид = &Вид";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

// Получает структурированное представление адреса склада (места осуществления деятельности).
// У складов нет предопределенного вида адреса, поэтому выбираются сведения о первой записи
// в регистре "Контактная информация" с типом "Адрес", где владелец - указанный склад.
//
// Параметры:
//  Склад - СправочникСсылка.Склады - МОД (место осуществления деятельности)
// 
// Возвращаемое значение:
//  Структура, Неопределено - см. УПД970_НовыйСведенияОбАдресе
//
Функция УПД970_АдресСклада(Склад)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Склад);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И Т.Тип = &Тип
	|	И НЕ Т.Вид.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПоляАдреса = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(ПоляАдреса, Выборка);
		
		ЗаполнитьТипыАдресныхОбъектов(ПоляАдреса);
		
		Если ЗначениеЗаполнено(ПоляАдреса.Значение) Тогда
			ДополнитьКонтактнуюИнформациюДаннымиJson(ПоляАдреса, Выборка.Значение, Выборка.Тип);
		КонецЕсли;
		
		УПД970_АдаптироватьПоляСтруктурыАдресов(ПоляАдреса);
		
		Результат = УПД970_НовыйСведенияОбАдресе();
		
		УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(Результат, ПоляАдреса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_АдаптироватьПоляСтруктурыАдресов(СведенияОбАдресе)
	
	ТипСтрока = Тип("Строка");
	
	Если ТипЗнч(СведенияОбАдресе.Страна) <> ТипСтрока Тогда
		СведенияОбАдресе.Страна = НРег(XMLСтрока(СведенияОбАдресе.Страна));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипДома) <> ТипСтрока Тогда
		СведенияОбАдресе.ТипДома = НРег(XMLСтрока(СведенияОбАдресе.ТипДома));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипКвартиры) <> ТипСтрока Тогда
		СведенияОбАдресе.ТипКвартиры = НРег(XMLСтрока(СведенияОбАдресе.ТипКвартиры));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипКорпуса) <> ТипСтрока Тогда
		СведенияОбАдресе.ТипКорпуса = НРег(XMLСтрока(СведенияОбАдресе.ТипКорпуса));
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_Контракт_УчастникиЭДО()

	Результат = Новый Структура;
	
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Грузоотправитель");
	Результат.Вставить("Грузополучатель");

	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеПервичногоДокумента()

	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("СведенияПрослеживаемости");
	
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");
	Результат.Вставить("СчетФактура");

	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеСчетФактураВыданный()

	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("ДокументыОснования");
	Результат.Вставить("СведенияОДокументахОплаты");
	
	Результат.Вставить("ЭтоСчетФактураНаАванс");
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеУчастникаЭДО()

	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("Наименование");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("ЭтоЮрЛицо");
	Результат.Вставить("КодПоОКПО");
	Результат.Вставить("ОГРНИП");
	Результат.Вставить("ДатаОГРНИП");
	Результат.Вставить("Телефоны");
	Результат.Вставить("ЭлектроннаяПочта");
	Результат.Вставить("СтранаНаименование");
	Результат.Вставить("СтранаКод");
	Результат.Вставить("Нерезидент");
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации");
	Результат.Вставить("Свидетельство");
	Результат.Вставить("НаименованиеБанка");
	Результат.Вставить("НомерСчета");
	Результат.Вставить("КоррСчет");
	Результат.Вставить("БИК");
	Результат.Вставить("Адрес");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДополнительнаяКолонкаПечатныхФормДокументов()
	
	Результат = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДокументыОтгрузки(ИсходныеДокументы)
	
	Результат = Новый Массив;
	
	Для Каждого ИсходныйДокумент Из ИсходныеДокументы Цикл
		
		ДокументОтгрузки = УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент);
		
		Результат.Добавить(ДокументОтгрузки);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент)
	
	Если ЗначениеЗаполнено(ИсходныйДокумент)
		И ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ДокументРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокумент, "ДокументРеализации");
		Результат = УПД970_ИсправляемыйДокументОтгрузки(ДокументРеализации);
		
	Иначе
		
		Результат = ИсходныйДокумент;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//} УПД970. Служебные процедуры и функции

//{ УПД970. Контракты протоструктуры

Функция Контракт_ПротоструктураУПД970()
	
	ИмяТипа = "Utd970SellerContent";
	
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформация();
	
	Результат.AdditionalInfoId = Контракт_AdditionalInfoId();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформация()
	
	ИмяТипа = "СлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Результат.ContentsDocumentProductsType = Контракт_ContentsDocumentProductsType();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ContentsDocumentProductsType()
	
	ИмяТипа = "ContentsDocumentProductsType";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ExtendedOrganizationInfo970()

	ИмяТипа = "ExtendedOrganizationInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияОрганизации();
	
	Возврат Результат;

КонецФункции

Функция Контракт_Shipper970()

	ИмяТипа = "Shipper970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_СлужебнаяИнформацияОрганизации()
	
	ИмяТипа = "OrganizationСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AdditionalInfoId()
	
	ИмяТипа = "AdditionalInfoId";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressInfo970()

	ИмяТипа = "AddressInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressRFInfo()

	ИмяТипа = "AddressRFInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressSARInfo()

	ИмяТипа = "AddressSARInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressTextInfo()

	ИмяТипа = "AddressTextInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressObjectNumberInfo()

	ИмяТипа = "AddressObjectNumberInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentShipments970()

	ИмяТипа = "DocumentShipment970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferInfo970()

	ИмяТипа = "TransferInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferBases970()

	ИмяТипа = "TransferBase970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_Employee970()
	
	ИмяТипа = "Employee970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_InvoiceTable970()
	
	ИмяТипа = "InvoiceTable970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemTracingInfo970()
	
	ИмяТипа = "ItemTracingInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_CustomDeclarations()

	ИмяТипа = "CustomDeclaration";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияСтроки()
	
	ИмяТипа = "ItemСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Item970()
	
	ИмяТипа = "Item970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_PaymentDocumentInfo()

	ИмяТипа = "PaymentDocumentInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

//} УПД970. Контракты протоструктуры

//} СБОР КОНТЕНТА УПД970

//*****************************************************************************
//{ СБОР КОНТЕНТА ФНС29

Функция СчетФНС29(СсылкаНаОбъект) Экспорт
	Ошибка = "ИнтеграцияУТ10: формирование электронных счетов в формате ФНС 29@ не реализовано";
	ВызватьИсключение Ошибка;
КонецФункции

//} СБОР КОНТЕНТА ФНС29
//*****************************************************************************

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// ВАЖНО: В результирующую строку добавляются только непустые значения!
// Платформенный метод СтрСоединить объединяет строки безусловно.
// Нужно это учитывать, если в качестве разделителя задана непустая строка.
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - коллекция объединяемых строк.
//  Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
// Пример:
//   
//   Строки = Новый Массив;
//   Строки.Добавить("Элемент0");
//   Строки.Добавить("");
//   Строки.Добавить("Элемент2");
//   
//   СоединитьСтроку(Строки, "#") = "Элемент0#Элемент2"
//   СтрСоединить(Строки, "#") = "Элемент0##Элемент2"
//   СоединитьСтроку(Строки, "") = СтрСоединить(Строки, "") = "Элемент0Элемент2"
//
Функция СоединитьСтроку(Строки, Разделитель = "") Экспорт
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов)
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если ТипЗнч(МассивСсылок) = Тип("Массив") ИЛИ ТипЗнч(МассивСсылок) = Тип("ФиксированныйМассив") Тогда
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		Если НЕ Метаданные.ОбщиеМодули.Найти("ОбщегоНазначения") = Неопределено Тогда
			СтрокаСообщения = "Неверный тип параметра ""МассивСсылок""";
			Выполнить("ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения)");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция РезультатФункцииОшибка(ОшибкаИлиМассив)
	
	Если ТипЗнч(ОшибкаИлиМассив) = Тип("Массив") Тогда
		КоллекцияОшибок = ОшибкаИлиМассив;
	Иначе
		КоллекцияОшибок = Новый Массив;
		КоллекцияОшибок.Добавить(ОшибкаИлиМассив);
	КонецЕсли;
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(КоллекцияОшибок);
	
	Возврат Результат;
	
КонецФункции

Функция РазрешеноЧтениеТаблицы(ОбъектМетаданных)
	
	Результат = ПравоДоступа("Чтение", ОбъектМетаданных);
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.НоменклатураКонтрагентов;
	
	// Ограничения типам реквизитов для текущей конфигурации
	ВладелецТип = МетаданныеРегистра.Измерения.Контрагент.Тип;
	
	НоменклатураТип = МетаданныеРегистра.Измерения.Номенклатура.Тип;
	ХарактеристикаТип = МетаданныеРегистра.Измерения.ХарактеристикаНоменклатуры.Тип;
	
	НаименованиеТип = МетаданныеРегистра.Ресурсы.НаименованиеНоменклатурыКонтрагента.Тип;
	КодТип = МетаданныеРегистра.Ресурсы.Идентификатор.Тип;
	АртикулТип = МетаданныеРегистра.Ресурсы.АртикулНоменклатурыКонтрагента.Тип;
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	Результат.Колонки.Добавить("Характеристика"         , ХарактеристикаТип);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, Наименование, Код = "", Артикул = "")
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент	 = Контрагент;
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Код			 = Код;
	НоваяСтрока.Артикул		 = Артикул;
	
КонецПроцедуры

Функция ПолучитьРеквизитыПодписантаПоОрганизации1С(Организация, Дата)
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Должность", "", "", "", "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК ФизЛицо,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность.Наименование КАК Должность,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо.Наименование
	|		ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК СокрФИО
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
	|			&Дата,
	|			СтруктурнаяЕдиница = &Организация
	|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.Руководитель)) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо ССЫЛКА Справочник.ФизическиеЛица) КАК ФИОФизЛицСрезПоследних
	|		ПО ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо");
	
	// немного универсальности
	Если Метаданные.Перечисления.Найти("ОтветственныеЛицаОрганизаций") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Перечисление.ОтветственныеЛицаОрганизации", "Перечисление.ОтветственныеЛицаОрганизаций");
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Найти("ФИОФизическихЛиц") <> Неопределено Тогда
		// для БП 3.0
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФИОФизЛиц",	"ФИОФизическихЛиц");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФизЛицо",		"ФизическоеЛицо");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.Фамилия 	= Выборка.Фамилия;
		Результат.Имя 		= Выборка.Имя;
		Результат.Отчество 	= Выборка.Отчество;
		Результат.Должность = Выборка.Должность;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОперацияПоступлениеТоваровУслуг()
	Возврат "ПоступлениеТоваровУслуг";
КонецФункции

Функция ОперацияКорректировкаПоступления()
	Возврат "КорректировкаПоступления";
КонецФункции

Функция ОперацияСчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = ОперацияПоступлениеТоваровУслуг();
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(ТипЭД) Тогда
		
		Результат = ОперацияКорректировкаПоступления();
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипЭД) Тогда
		
		Результат = ОперацияСчетФактураПолученный();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьДокументОснование(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование = Неопределено;
	Если ПараметрыСобытия.ДополнительныеПараметры.Свойство("ДокументОснование", ДокументОснование)
		И ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ИдентификаторОперации = ПараметрыСобытия.ИдентификаторОперации;
	
	Если ИдентификаторОперации = ОперацияКорректировкаПоступления() Тогда
		
		ДокументОснование = НайтиОснованиеДляСозданияКорректировкиПоступления(Документ, Ошибки);
		
	КонецЕсли;
	
	ПараметрыСобытия.ДополнительныеПараметры.Вставить("ДокументОснование", ДокументОснование);
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки)
		Или ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
	Если Не ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		
		Если Не Документ.Тип.Формализованный Тогда
			Ошибки.Добавить("Документ неформализованный.");
		КонецЕсли;
		
		Ошибки.Добавить("Для этого формата или типа документа нельзя создать документ.");
		Ошибки.Добавить("Сопоставьте документ вручную из карточки документа.");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьФункциюДокумента(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ТипЭД.ФункцияДокумента) Тогда
		ТекстОшибки = "Не задана операция для создания учетного документа!";
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	МетаданныеОснованийСФ = Новый Массив;
	МетаданныеОснованийСФ.Добавить(Метаданные.Документы.ПоступлениеТоваровУслуг);
	МетаданныеОснованийСФ.Добавить(Метаданные.Документы.ПоступлениеДопРасходов);
	МетаданныеОснованийСФ.Добавить(Метаданные.Документы.КорректировкаПоступления);
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Результат = (МетаданныеОснованийСФ.Найти(ОбъектМетаданных) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Ищем в пакете документ счета-фактуры: если есть, то сразу создаем его в 1С.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Основание для создания счета-фактуры полученного.
//  Документ - Структура - электронный документ (см. Контракт_Документ).
//  ИспользоватьДатуЭД - Булево - Истина, заполнять дату документа из документа ЭДО
//
Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		ИЛИ НЕ ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйСФ)
		ИЛИ ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	ДатаДокумента = ТекущаяДатаСеанса();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	ДокументСФ.Заполнить(ДокументОбъект.Ссылка);
	ДокументСФ.ДатаВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	ДокументСФ.НомерВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Номер;
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.КодСпособаПолучения = 2;
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.Записать();
	
	Если НЕ ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск счета-фактуры, полученного в одном пакете с указанным электронным документом.
//
// Параметры:
//  Документ - Структура - электронный документ (см. Контракт_Документ).
// 
// Возвращаемое значение:
//  Структура - электронный счет-фактура (см. Контракт_Документ).
//  Неопределено - если в пакете с указанным документом не найден счет-фактура.
//
Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента)
		Или ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) 
				Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Находит учетный документ, на основании которого нужно создать корректировку поступления.
//
// Параметры:
//  Документ - Структура - электронный УКД или КСФ (см. Контракт_Документ).
//  Ошибки - Массив из Строка- (возвращаемый параметр) Описания ошибок подбора документа-основания.
// 
// Возвращаемое значение:
//  ЛюабяСсылка - ссылка на документ-основание корректировки поступления.
//
Функция НайтиОснованиеДляСозданияКорректировкиПоступления(Документ, Ошибки)
	
	ДвоичныеДанные = Документ.Документооборот.ХранилищеКонтента.Данные;
	ДеревоКонтента = ОсновнойМодуль.XML_В_XDTO(ДвоичныеДанные);
	НомерДатаСФ = ДеревоКонтента.Документ.СвКСчФ.СчФ;
	
	ДокументОснование = Неопределено;
	
	Если ЭтоКорректировкаПоНесколькимОснованиям(НомерДатаСФ) Тогда
		
		Ошибки.Добавить("Создание корректировки по нескольким документам-оснований недоступно.");
		Ошибки.Добавить("Вы можете вручную создать документ в 1С и сопоставить его с текущим документом.");
		
	Иначе
		
		ДокументОснование = НайтиОснованиеКорректировки(Документ, НомерДатаСФ, Ошибки);
		ПроверитьОснованиеКорректировки(ДокументОснование, Ошибки);
		
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Функция ЭтоКорректировкаПоНесколькимОснованиям(НомерДатаСФ)
	
	Результат = (ТипЗнч(НомерДатаСФ) = Тип("СписокXDTO"));
	Возврат Результат;
	
КонецФункции

Функция НайтиОснованиеКорректировки(Документ, НомерДатаСФ, Ошибки)
	
	ДокументОснование = Неопределено;
	
	НомерОснования = НомерДатаСФ.НомерСчФ;
	ДатаОснования  = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаСФ.ДатаСчФ);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	ДатаОснования);
	ПараметрыОтбора.Вставить("НомерДокумента",	НомерОснования);
	
	Если Документ.Тип.ФункцияДокумента = "InvoiceAndBasic" Тогда
		
		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 
			И ДокументыОснования1С[0].ДокументыОснования.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0].ДокументыОснования[0].ДокументОснование;
		КонецЕсли;
		
	ИначеЕсли Документ.Тип.ФункцияДокумента = "Basic" Тогда

		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если ДокументыОснования1С = Неопределено Тогда
			ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ТекстОшибки = "Для корректировки не найден документ-основание №%НомерДокумента% от %ДатаДокумента%.";
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерДокумента%", НомерОснования);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаДокумента%", ДатаОснования);
		
		СоздаватьСчетаФактуры = ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СоздаватьСчетаФактуры;
		
		Если СоздаватьСчетаФактуры = Истина Тогда
			ТекстРешения = "Создайте счет-фактуру для документа-основания и повторите создание документа.";
		Иначе
			ТекстРешения = "Сопоставьте документ вручную из карточки документа.";
		КонецЕсли;
		
		Ошибки.Добавить(ТекстОшибки);
		Ошибки.Добавить(ТекстРешения);
		
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Процедура ПроверитьОснованиеКорректировки(ДокументОснование, Ошибки)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Договор", "ДоговорКонтрагента");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛок(ДокументОснование, ТребуемыеРеквизиты);
	
	ПредставлениеДокумента = Строка(ДокументОснование);
	
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитов.Договор) Тогда
		
		ТекстОшибки = "На основании документа %Документ% нельзя создать корректировку поступления, т.к. не указан договор.";
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ПредставлениеДокумента);
		
		Ошибки.Добавить(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеТоваровУслуг" Тогда				
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Организация = &Организация
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерДокумента";
	
	ИначеЕсли ВидДокумента1С = "ПоступлениеДопРасходов" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеДопРасходов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	НЕ ПоступлениеДопРасходов.ПометкаУдаления
		|	И ПоступлениеДопРасходов.Организация = &Организация
		|	И ПоступлениеДопРасходов.Контрагент = &Контрагент
		|	И ПоступлениеДопРасходов.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеДопРасходов.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "КорректировкаПоступления" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаПоступления.Ссылка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|ГДЕ
		|	НЕ КорректировкаПоступления.ПометкаУдаления
		|	И КорректировкаПоступления.Организация = &Организация
		|	И КорректировкаПоступления.Контрагент = &Контрагент
		|	И КорректировкаПоступления.ДатаВходящегоДокумента = &ДатаДокумента
		|	И КорректировкаПоступления.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетФактураПолученный.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетНаОплатуПоставщика" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплатуПоставщика.Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	НЕ СчетНаОплатуПоставщика.ПометкаУдаления
		|	И СчетНаОплатуПоставщика.Организация = &Организация
		|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент
		|	И СчетНаОплатуПоставщика.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетНаОплатуПоставщика.НомерВходящегоДокумента = &НомерДокумента";		
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		
		Для Каждого СтрокаОснование Из ДокументУчета.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(СтрокаОснование.ДокументОснование, ДобавляемыйКомментарий);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПроверитьЗаполнениеДокумента(ДокументОбъект, Ошибки, ОтключитьПроверкуСопоставленияНоменклатуры)
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокуДокументовОснованияСЧФ(ДокументОбъект);
	
	Если НЕ ОтключитьПроверкуСопоставленияНоменклатуры Тогда
		
		ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки)
	
	ПроверяемыеТаблицы = Новый Структура;
	ПроверяемыеТаблицы.Вставить("Товары", Неопределено);
	ПроверяемыеТаблицы.Вставить("Услуги", Неопределено);
	
	ЗаполнитьЗначенияСвойств(ПроверяемыеТаблицы, ДокументОбъект);
	
	Для Каждого ЭлементСтруктуры Из ПроверяемыеТаблицы Цикл
		
		ПроверяемаяТаблица = ЭлементСтруктуры.Значение;
		
		Если ПроверяемаяТаблица = Неопределено
			Или ЗначениеЗаполнено(Ошибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТовар Из ПроверяемаяТаблица Цикл
			
			Номенклатура = СтрокаТовар.Номенклатура;
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				
				ТекстОшибки = НСтр(
						"ru = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.';
						|en = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.'"
					);
				
				Ошибки.Добавить(ТекстОшибки);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуДокументовОснованияСЧФ(ДокументОбъект)
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СчетФактураПолученный")
		И Не ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) 
		И ДокументОбъект.ДокументыОснования.Количество() = 0 Тогда
		
		ДокументОбъект.ДокументыОснования.Добавить(); 
		
	КонецЕсли;
	
КонецПроцедуры

Функция Общее_СтрокаВДату(Значение)
	
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("СтроковыеФункцииКлиентСервер");
	Результат = ИнтерфейсБСП.СтрокаВДату(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция СтрШаблонЛок(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено
	, Параметр6 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	Результат = СтрЗаменить(Результат	, "%6", Параметр6);
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблонЛок("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

Функция ЕстьРеквизитОбъектаЛок(ИмяРеквизита, ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, Реквизиты)
	
	Результат = Ядро.Общее_ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеРеквизитаОбъектаЛок(СсылкаНаОбъект, Реквизиты)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СсылкаНаОбъект,
		Реквизиты
	);
	
	Возврат Результат;
	
КонецФункции

Функция ОсновнаяСтрана()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "РОССИЯ");
	Результат.Вставить("Код", "643");
	
	Возврат Результат;
	
КонецФункции

Функция ВидАдресаЮрФизЛица(Ссылка, ТипАдреса)
	
	Перем Результат, ИмяВладельца;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ИмяВладельца = "Организации";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяВладельца = "Контрагента";
	Иначе
		ИмяВладельца = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВладельца) Тогда
		
		ВидыКИЮридическийАдрес = Перечисление_ВидыКонтактнойИнформации().ЮридическийАдрес;
		
		Если ТипАдреса = ВидыКИЮридическийАдрес Тогда
			ИмяВида = "ЮрАдрес";
		Иначе
			ИмяВида = "ФактАдрес";
		КонецЕсли;
		
		ВидЭлементаКИ = ИмяВида + ИмяВладельца;
		
		Результат = Справочники.ВидыКонтактнойИнформации[ВидЭлементаКИ];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКонтактнойИнформации() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес", "ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	Результат.Вставить("Телефон", "Телефон");
	Результат.Вставить("Факс", "Факс");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру полей записи регистра КонтактнаяИнформация.
// 
// Возвращаемое значение:
//  Структура - свойства структуры соответствуют полям типового регистра КонтактнаяИнформация.
//
Функция НоваяЗаписьКонтактнойИнформации()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипАдреса");
	Результат.Вставить("Представление");
	Результат.Вставить("Значение");
	Результат.Вставить("КодСтраны");
	Результат.Вставить("Страна");
	Результат.Вставить("Поле1");
	Результат.Вставить("Поле2");
	Результат.Вставить("Поле3");
	Результат.Вставить("Поле4");
	Результат.Вставить("Поле5");
	Результат.Вставить("Поле6");
	Результат.Вставить("Поле7");
	Результат.Вставить("Поле8");
	Результат.Вставить("Поле9");
	Результат.Вставить("Поле10");
	Результат.Вставить("ТипДома", "дом");
	Результат.Вставить("ТипКорпуса", "корпус");
	Результат.Вставить("ТипКвартиры", "кв.");
	
	Возврат Результат;
	
КонецФункции

Функция ТипыАдресов_ВСвободнойФорме()
	Возврат "ВСвободнойФорме";
КонецФункции

Процедура ЗаполнитьТипыАдресныхОбъектов(ЗначенияПолей)
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипДома) Тогда 
		ЗначенияПолей.ТипДома = "дом";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКорпуса) Тогда 
		ЗначенияПолей.ТипКорпуса = "корпус";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКвартиры) Тогда 
		ЗначенияПолей.ТипКвартиры = "кв.";
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьКонтактнуюИнформациюДаннымиJson(КонтактнаяИнформация, ЗначениеJson, Тип)
	
	МодульУправленияКИСлужебный = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформациейСлужебный");
	ДанныеАдреса = МодульУправленияКИСлужебный.JSONВКонтактнуюИнформациюПоПолям(ЗначениеJson, Тип);
	
	Если ДанныеАдреса <> Неопределено Тогда
		
		Если ДанныеАдреса.Свойство("addressType")
			И ДанныеАдреса.Свойство("Country")
			И ДанныеАдреса.addressType = ТипыАдресов_ВСвободнойФорме() Тогда
			
			КонтактнаяИнформация.Поле1 = ДанныеАдреса.Country;	// Страна
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВедениеВзаиморасчетовПоЗаказам(Договор)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ВедениеВзаиморасчетов = ЗначениеРеквизитаОбъектаЛок(Договор, "ВедениеВзаиморасчетов");
		Результат = (ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УчетнаяПолитикаОрганизацииНастроена(Организация, ДатаСреза)
	
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ДатаСреза, Неопределено, Организация);
	
	Результат = (УчетнаяПолитика <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	Возврат "без НДС";
КонецФункции

Функция ЭтоИсправлениеРеализации(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВидОперации");
		Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипАдресаВСвободнойФорме()
	Возврат "ВСвободнойФорме";
КонецФункции

Функция ЭтоМуниципальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Муниципальный"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоАдминистративноТерриториальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Административно-территориальный"));
	Возврат Результат;
	
КонецФункции

Функция АдминистративноТерриториальныйАдрес()
	
	ОбщийМодульИмя = "РаботаСАдресамиКлиентСервер";
	
	Если НЕ Метаданные.ОбщиеМодули.Найти(ОбщийМодульИмя) = Неопределено Тогда
		ОбщийМодульРаботаСАдресами = ОбщийМодульПоИмениЛок(ОбщийМодульИмя);
		
		Результат = ОбщийМодульРаботаСАдресами.АдминистративноТерриториальныйАдрес();
	Иначе
		Результат = "Административно-территориальный";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//{ Взаимодействие с библиотекой ГенерацияXML

Функция ФункцияДокументаУПД_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции

Функция ФункцияДокументаУПД_ДОП()
	Возврат ГенерацияXML_ФункцииУПД().ДОП;
КонецФункции

Функция ФункцияДокументаУПД_СЧФДОП()
	Возврат ГенерацияXML_ФункцииУПД().СЧФДОП;
КонецФункции

Функция ГенерацияXML_ФункцииУПД()
	Результат = ГенерацияXML.Перечисление_ФункцииУПД();
	Возврат Результат;	
КонецФункции

Функция ГенерацияXML_Перечисление_ВидыЮрФизЛиц()
	
	Результат = ГенерацияXML.Перечисление_ВидыЮрФизЛиц();
	Возврат Результат;
	
КонецФункции

Функция ГенерацияXML_КодыРегионов()
	
	Результат = ГенерацияXML.КодыРегионов();
	Возврат Результат;
	
КонецФункции

Функция Новый_ЭлементПротоКонтента(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы);
	
	Возврат Результат;
	
КонецФункции

//} Взаимодействие с библиотекой ГенерацияXML

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность = "")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Процедура Пакеты_НачатьКатегорию(Знач Идентификатор, Знач Представление)
	
	_ТекущаяКатегорияПакетов = Новый Структура;
	_ТекущаяКатегорияПакетов.Вставить("Идентификатор", Идентификатор);
	_ТекущаяКатегорияПакетов.Вставить("Представление", Представление);
	
КонецПроцедуры

Функция Пакеты_ДобавитьВидПакета(ВидыПакетов, Знач Идентификатор, Знач Представление, Знач Состав)
	
	Если Не ЗначениеЗаполнено(_ТекущаяКатегорияПакетов) Тогда
		Пакеты_НачатьКатегорию(КатегорииПакетов_БезКатегории(), "");
	КонецЕсли;
	
	ОписаниеПакета = ВидыПакетов.Добавить();
	ОписаниеПакета.ID = Идентификатор;
	ОписаниеПакета.Наименование = Представление;
	ОписаниеПакета.СоставПакета = Состав;
	ОписаниеПакета.КатегорияПакета = _ТекущаяКатегорияПакетов.Идентификатор;
	ОписаниеПакета.НаименованиеКатегории = _ТекущаяКатегорияПакетов.Представление;
	
	Возврат ОписаниеПакета;
	
КонецФункции

Функция КатегорииПакетов_Основная()
	Возврат "ОсновнойПакет";
КонецФункции

Функция КатегорииПакетов_СчетаНаОплату()
	Возврат "СчетНаОплату";
КонецФункции

Функция КатегорииПакетов_БезКатегории()
	Возврат "БезКатегории";
КонецФункции

Функция МожноСформироватьПередаточныйДокумент(Документ1С)
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	Результат = (ИсключаемыеТипы.Найти(ТипДокумента) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьТовары = Документ1С.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено;
	
	Если ЕстьТовары Тогда
		
		ВыборкаТоваров = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "Товары", "Номенклатура");
		
		Если ВыборкаТоваров.Количество() = 0 Тогда
			ЕстьТовары = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоОтчетКомитенту = ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
	
	Если ЕстьТовары И Не ЭтоОтчетКомитенту Тогда		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ТОРГ12");
	Иначе
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктФормализованный");
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Результат)
		
	// Ищем ТОРГ-12 или УПД, относящийся к другому (не к текущему) пакету, и находящийся в статусе "Требуется подпись" или "Подписан".
	// Еще искомый документ должен быть уже проверен и признан "хорошим" (возможно, его еще не подписали, но уже проверили)
	// Если такой есть, то по текущему документу будем отказывать в подписи, т.к. это дубль
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить("XmlTorg12");
	ТипыДокументов.Добавить("UniversalTransferDocument");
	
	Статусы  = Новый Массив;
	Статусы.Добавить("Подписан");
	Статусы.Добавить("Требуется подпись");
	
	Если ОсновнойМодуль.ЭДО_Использовать1СЭДО() Тогда 
		//TODO добавить проверку дублей для 1С-ЭДО
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.АнализПроведен КАК АнализПроведен,
		|	Диадок_Документы.ТекстОшибки КАК ОшибкиПроверкиТекст
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка <> &ТекущийДокументДД
		|	И Диадок_Документы.LetterId <> &LetterId
		|	И Диадок_Документы.Документ = &Документ1С
		|	И (Диадок_Документы.Направление = ""Inbound"" или Диадок_Документы.Направление = ""Входящее"" )  //переходный период перед релизом 1.0.0
		|	И Диадок_Документы.ТипДокумента В(&ТипДокумента)
		|	И Диадок_Документы.АнализПроведен
		|	И Диадок_Документы.Статус В(&Статусы)
		|	И Выразить(Диадок_Документы.ТекстОшибки как строка(1)) = """"     //  ТекстОшибки сейчас неограниченная строка. Выразить работает в сторону уменьшения длины, но не увеличения
		//|	И Диадок_Документы.ДатаЗагрузки <= &ДатаЗагрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диадок_Документы.ДатаЗагрузки";
		
		Запрос.УстановитьПараметр("ТекущийДокументДД",	ДокументДД);
		Запрос.УстановитьПараметр("Документ1С",			Документ1С);
		Запрос.УстановитьПараметр("ТипДокумента",		ТипыДокументов);
		Запрос.УстановитьПараметр("Статусы",			Статусы);		
		Запрос.УстановитьПараметр("LetterId",			ДокументДД.LetterId);
		Запрос.УстановитьПараметр("ДатаЗагрузки",		ДокументДД.ДатаЗагрузки);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 И ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда
			Док = Выборка[0].Ссылка;
			Результат.Добавить("ДУБЛИКАТ: накладная уже была учтена в электронном виде (дата " + формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy")
			+ ", номер " + Док.НомерДокумента + ", загружен из Диадок " + Док.ДатаЗагрузки + ")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтентОтвета(ДокументДД, Документ1С, ДействиеВДД, ТекстВсехОшибок)
	
	Content = ОсновнойМодуль.ЭДО_ПолучитьПустойКонтентОтветаДляДокумента(ДокументДД, ДействиеВДД);

	ИмяТипаОбъектаXDTO = НРег(Content.Тип().Имя);
	
	Если ИмяТипаОбъектаXDTO = "torg12buyercontent" Тогда
		
		Content.ShipmentReceiptDate = Документ1С.Дата;
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Receiver, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, получившее груз
		ЗаполнитьПодпись(Content.Accepter, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, принявшее груз

	ИначеЕсли ИмяТипаОбъектаXDTO = "utdbuyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.Creator				= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.CreatorBase			= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd820buyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.DocumentCreator		= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.DocumentCreatorBase	= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";	
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd970buyercontent" Тогда
		
		Content.AcceptanceDate	 = Документ1С.Дата;
		Content.DocumentCreator	 = "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.OperationContent = "Товары и услуги получены, претензий нет";
		
		Content.ContentOperCode.TotalCode = "1";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта);
		
		Content.Employee.EmployeePosition = ДанныеПодписанта.Должность;
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "acceptancecertificatebuyercontent" Тогда
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Official, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, подписывающее со стороны заказчика
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "correctionrequestcontent"	// запрос на уточнение по СФ
		Или ИмяТипаОбъектаXDTO = "formalizedrejectioncontent"  // отказ по формализованному
		Или ИмяТипаОбъектаXDTO = "rejectioncontent" Тогда		// отказ по неформализованному
				
		Content.Comment = ТекстВсехОшибок;
		
	КонецЕсли;	
	
	Возврат Content;
	
КонецФункции

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК Документ,
		|	СчетФактура.Номер КАК НомерДокумента,
		|	СчетФактура.Дата КАК ДатаДокумента,
		|	СчетФактура.Контрагент КАК Контрагент,
		|	СчетФактура.Организация КАК Организация,
		|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И СчетФактура.Проведен
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И НЕ СчетФактура.Исправление
		|	И &ДополнительныеОтборы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Номер,
		|	СчетФактура.Дата,
		|	СчетФактура.Контрагент,
		|	СчетФактура.Организация,
		|	СчетФактура.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И НЕ СчетФактура.ПометкаУдаления
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И НЕ СчетФактура.Исправление
		|	И &ДополнительныеОтборы";
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
				"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Исправление", "СчетФактура.Исправление");
		
	КонецЕсли;
	
	ТекстЗапросаДополнительныеОтборы = ТекстЗапроса_ДополнительныеОтборыСчетаФактуры();
	
	Результат = СтрЗаменить(Результат, "&ДополнительныеОтборы", ТекстЗапросаДополнительныеОтборы);
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "НаРеализацию", ВидСчетаФактуры);
	
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДополнительныеОтборыСчетаФактуры()
	
	Результат = "НЕ СчетФактура.ДокументОснование Ссылка Документ.ОтчетКомиссионераОПродажах";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетФактурыПоОтчетуКомиссионера.Документ КАК Документ,
		|	СчетФактурыПоОтчетуКомиссионера.НомерДокумента КАК НомерДокумента,
		|	СчетФактурыПоОтчетуКомиссионера.ДатаДокумента КАК ДатаДокумента,
		|	СчетФактурыПоОтчетуКомиссионера.Контрагент КАК Контрагент,
		|	СчетФактурыПоОтчетуКомиссионера.Организация КАК Организация,
		|	0 КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	ВТ_СчетФактурыПоОтчетуКомиссионера КАК СчетФактурыПоОтчетуКомиссионера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактурыПоОтчетуКомиссионера.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактурыПоОтчетуКомиссионера.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактурыПоОтчетуКомиссионера.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СчетФактурыПоОтчетуКомиссионера.Проведен
		|		КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ВТ_ДокументыБезНДС.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";
	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(
				Результат,
				"И (ВТ_ДокументыБезНДС.ЭтоИсправление)",
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоИсправление)");
	КонецЕсли;
	
	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		Результат = СтрЗаменить(
				Результат,
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)",
				"И (ВТ_ДокументыБезНДС.ЭтоКорректировка)");
	КонецЕсли;
	
	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
	
	Результат = СтрЗаменить(
			Результат,
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
		|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
		|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
		|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
		|	СчетНаОплатуПокупателю.Организация КАК Организация,
		|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
		|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
		|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
		|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
		|	АктСверкиВзаиморасчетов.Организация КАК Организация,
		|	0 КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьТаблицу_ПеремещениеТоваров(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Организация КАК Организация,
	|	ВТ_Отправители.Подразделение1С КАК ПодразделениеОтправитель,
	|	ВТ_Получатели.Подразделение1С КАК ПодразделениеПолучатель,
	|	ТаблицаДокументов.Номер КАК НомерДокумента,
	|	ТаблицаДокументов.Дата КАК ДатаДокумента,
	|	0 КАК СуммаДокумента,
	|	ТаблицаДокументов.Ссылка КАК Документ
	|ПОМЕСТИТЬ Диадок_ПеремещениеТоваров
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиВнутреннегоДокументооборота КАК ВТ_Настройки
	|		ПО ТаблицаДокументов.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакета = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Отправители
	|		ПО ТаблицаДокументов.Организация = ВТ_Отправители.Организация1С
	|			И ТаблицаДокументов.СкладОтправитель = ВТ_Отправители.Подразделение1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Получатели
	|		ПО ТаблицаДокументов.Организация = ВТ_Получатели.Организация1С
	|			И ТаблицаДокументов.СкладПолучатель = ВТ_Получатели.Подразделение1С
	|ГДЕ
	|	ТаблицаДокументов.Проведен
	|	И ТаблицаДокументов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ВТ_Отправители.Подразделение1С ЕСТЬ NULL
	|	И НЕ ВТ_Получатели.Подразделение1С ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Возврат "Диадок_ПеремещениеТоваров";
	
КонецФункции

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	
	ОсновнойПакет = КатегорииПакетов_Основная();
	
	ПодстрокаПоиска = "&УсловиеСвязиПоКатегорииПакета";
	
	Если ЗначениеЗаполнено(КатегорияПакета) Тогда
		ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """"
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета ЕСТЬ NULL";
	Иначе
		ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID
			+ " ИЛИ ОтправленныеДокументы.ВидПакета ЕСТЬ NULL";
	КонецЕсли;
	
	Если КатегорияПакета = КатегорииПакетов_СчетаНаОплату() Тогда
		
		ПодстрокаЗамены = ПодстрокаЗамены
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета = """ + ОсновнойПакет + """";
		
		ИспользоватьСХ2 = НЕ ОсновнойМодуль.ИспользоватьПодсистемуДиадока();
		ОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
		
		Если ИспользоватьСХ2 И ОснованияПоУмолчанию Тогда
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Результат = Ядро.СписокНаОтправку_ТекстЗапроса_ВременныеТаблицы();
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса)
	
	ТекстЗапросаВременныхТаблиц = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактура.Ссылка КАК Документ,
		|	СчетФактура.Проведен КАК Проведен,
		|	СчетФактура.Номер КАК НомерДокумента,
		|	СчетФактура.Дата КАК ДатаДокумента,
		|	ОтчетКомиссионера.Контрагент КАК Контрагент,
		|	СчетФактура.Организация КАК Организация,
		|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
		|	СчетФактура.СводныйКомиссионный КАК Сводный
		|ПОМЕСТИТЬ ВТ_СчетФактурыПоОтчетуКомиссионера
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионера
		|		ПО СчетФактура.ДокументОснование = ОтчетКомиссионера.Ссылка
		|ГДЕ
		|	СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетФактура.СводныйКомиссионный
		|	И НЕ СчетФактура.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	
	Если Не ИспользуетсяСчетФактураКомиссионеру() Тогда
		
		ТекстЗапросаВременныхТаблиц = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	НЕОПРЕДЕЛЕНО КАК Документ,
		|	ИСТИНА КАК Проведен,
		|	НЕОПРЕДЕЛЕНО КАК НомерДокумента,
		|	НЕОПРЕДЕЛЕНО КАК ДатаДокумента,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	НЕОПРЕДЕЛЕНО КАК Организация,
		|	0 КАК СуммаДокумента,
		|	ЛОЖЬ КАК Сводный
		|ПОМЕСТИТЬ ВТ_СчетФактурыПоОтчетуКомиссионера";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапросаВременныхТаблиц;
	
КонецПроцедуры

Функция ТекстЗапроса_ВТДокументыБезНДС()
	
	Результат = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.ЭтоИсправление,
	|	ВТ_ПодходящиеДокументы.ЭтоКорректировка,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL"; 
	
	Возврат Результат;
			
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	 
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктОбОказанииПроизводственныхУслуг", "Услуги");
	
	ТекстОтбораДокументов = " И ТабличнаяЧасть.Ссылка.ДоговорКонтрагента.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)";
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Товары", ТекстОтбораДокументов);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Услуги");
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПоПереработке", "Продукция");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПоПереработке", "Услуги");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Услуги", ТекстОтбораДокументов, "Истина");

	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, , "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Услуги", ТекстОтбораДокументов, , "Истина"); 
	
	ДокументыБезСФ_ДобавитьТекстЗапросаПоДаннымРеализацииНаКомиссию(Запросы);
	ДокументыБезСФ_ДобавитьТекстЗапросаПоОтчетуКомитентуОПродажах(Запросы);
	ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратТоваровПоставщику(Запросы);

	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоОтчетуКомитентуОПродажах(Запросы)
	
	Результат =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА Док.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запросы.Добавить(Результат);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, ИмяТаблицыМетаданных, ЗначениеОснования)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумент.Ссылка 			КАК Документ,
	|	ТаблицаДокумент.Номер 			КАК НомерДокумента,
	|	ТаблицаДокумент.Дата 			КАК ДатаДокумента,
	|	ТаблицаДокумент.Контрагент 		КАК Контрагент,
	|	ТаблицаДокумент.Организация 	КАК Организация,
	|	ТаблицаДокумент.СуммаДокумента 	КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
	|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
	|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТаблицаДокумент.ПометкаУдаления";
	
	УчитыватьНастройкуОтправкиНепроведенных = (Метаданные.Документы[ИмяТаблицыМетаданных].Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить);
	
	Если УчитыватьНастройкуОтправкиНепроведенных Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|	И НЕ КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ТаблицаДокумент.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка,
		|	ТаблицаДокумент.Номер,
		|	ТаблицаДокумент.Дата,
		|	ТаблицаДокумент.Контрагент,
		|	ТаблицаДокумент.Организация,
		|	ТаблицаДокумент.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыМетаданных", "Документ." + ИмяТаблицыМетаданных);
	
	ВидДокументаID = ВидДокументаIDПоВидуПакетаID(ВидПакетаID);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДокументаID", """" + ВидДокументаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеНастройкиФормироватьНаОсновании", """" + ЗначениеОснования + """");
	
	ТекстЗапроса = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета);
	
	Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса;
	
КонецПроцедуры

Функция ВидДокументаIDПоВидуПакетаID(ВидПакетаID)
	
	Результат = "";
	
	Если 	ВидПакетаID = "ID_Счет"
		Или ВидПакетаID = "ID_СчетФормализованный" Тогда
		
		Результат = ВидПакетаID;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь", Корректировка = "Ложь")
	
	ТЧ	= "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;

	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК ЭтоИсправление,
	|	&Корректировка КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	Результат = СтрЗаменить(Результат, "&Корректировка", Корректировка);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
			
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоДаннымРеализацииНаКомиссию(Запросы)
		
	Результат =
		"ВЫБРАТЬ
		|	Ссылка КАК Документ,
		|	0 КАК ВсегоПозиций,
		|	0 КАК ПозицийБезНДС,
		|	Ложь КАК ЭтоИсправление,
		|	Ложь КАК ЭтоКорректировка
		|ИЗ
		|	 Документ.РеализацияТоваровУслуг
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|   И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)";
		
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
	
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратТоваровПоставщику(Запросы)
		
	Результат =
		"ВЫБРАТЬ
		|	Ссылка КАК Документ,
		|	0 КАК ВсегоПозиций,
		|	0 КАК ПозицийБезНДС,
		|	Ложь КАК ЭтоИсправление,
		|	Ложь КАК ЭтоКорректировка
		|ИЗ
		|	 Документ.ВозвратТоваровПоставщику
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
		
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
	
КонецПроцедуры

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	ИначеЕсли TypeNamedId = "InvoiceCorrection" ИЛИ TypeNamedId = "InvoiceCorrectionRevision" Тогда
		Результат = "КСЧФ";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ, ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы = Неопределено, ДопПараметры = Неопределено)
	
	Попытка
		
		ТабличныйДокумент = НапечататьВнешнююФормуЛок(Документ, ВнешняяПечатнаяФорма);
		
	Исключение
		
		ОшибкаИнфо = ИнформацияОбОшибке();
		// BSLLS:NestedFunctionInParameters-off
		КомментарийЖР = СтрШаблонЛок(
			"Не удалось сформировать внешнюю печатную форму (%1) по причине:
			|%2",
			ВнешняяПечатнаяФорма,
			ПодробноеПредставлениеОшибки(ОшибкаИнфо)
		);
		// BSLLS:NestedFunctionInParameters-on
		
		ЗаписьЖурналаРегистрации(
			"Диадок.ПодготовитьЭлектронныйДокумент",
			УровеньЖурналаРегистрации.Ошибка,
			Документ.Метаданные(),
			Документ,
			КомментарийЖР
		);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	// BSLLS:NestedFunctionInParameters-off
	ИмяФайла = СтрШаблонЛок(
		"%1 № 2 от 3.pdf",
		ВнешняяПечатнаяФорма.Наименование,
		Документ.Номер,
		Формат(Документ.Дата, "ДФ=dd.MM.yyyy")
	);
	// BSLLS:NestedFunctionInParameters-on
	
	ИмяФайла = ЗаменитьНедопустимыеСимволы(ИмяФайла);
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
	// BSLLS:MissingTemporaryFileDeletion-on
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

// Аналог функции УниверсальныеМеханизмы.НапечататьВнешнююФорму
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект, по которому нужно сформировать печатную форму
//  ВнешняяПФ - СправочникСсылка.ВнешниеОбработки - внешняя печатная форма
// 
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма
//
Функция НапечататьВнешнююФормуЛок(Ссылка, ВнешняяПФ)
	
	ИндексПринадлежности = 0;
	ДвоичныеДанные = ВнешняяПФ.Принадлежность[ИндексПринадлежности].ХранилищеВнешнейОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = ВнешняяПФ.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	ДополнительныеПараметры = ВнешняяПФ.Принадлежность[ИндексПринадлежности].ДополнительныеПараметрыОбработки.Получить();
	
	Если ДвоичныеДанные = Неопределено Тогда
		Ошибка = СтрШаблонЛок("Не удалось получить файл внешней печатной формы (%1)", ВнешняяПФ);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ТабДокумент = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	ДвоичныеДанные.Записать(ИмяФайла);
	// BSLLS:UsingExternalCodeTools-off
	Обработка = ВнешниеОбработки.Создать(ИмяФайла);
	// BSLLS:UsingExternalCodeTools-on
	Обработка.СсылкаНаОбъект = Ссылка;
	
	// Передать внешней обработке дополнительные параметры
	Если ДополнительныеПараметры <> Неопределено Тогда
		// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение
		Если НЕ Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
			Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент = Обработка.Печать();
	
	// BSLLS:UsingSynchronousCalls-off
	УдалитьФайлы(ИмяФайла);
	// BSLLS:UsingSynchronousCalls-on
	
	Если ТипЗнч(ТабДокумент) = Тип("ТабличныйДокумент") И (ПустаяСтрока(ТабДокумент.ИмяПараметровПечати)) Тогда
		Попытка
			
			ИдентификаторОбработки = Строка(ВнешняяПФ.УникальныйИдентификатор());
			ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + СтрЗаменить(ИдентификаторОбработки, "-", "_");
			ТабДокумент.ИмяПараметровПечати = ТабДокумент.ИмяПараметровПечати + "_" + Ссылка.Метаданные().Имя;
			
		Исключение
			
			ОшибкаИнфо = ИнформацияОбОшибке();
			// BSLLS:NestedFunctionInParameters-off
			КомментарийЖР = СтрШаблонЛок(
				"Не удалось установить имя параметров печати (%1) по причине:
				|%2",
				ВнешняяПФ,
				ПодробноеПредставлениеОшибки(ОшибкаИнфо)
			);
			// BSLLS:NestedFunctionInParameters-on
			
			// BSLLS:UsageWriteLogEvent-off
			ЗаписьЖурналаРегистрации(
				"Диадок.ПодготовитьЭлектронныйДокумент",
				УровеньЖурналаРегистрации.Предупреждение,
				Ссылка.Метаданные(),
				Ссылка,
				КомментарийЖР
			);
			// BSLLS:UsageWriteLogEvent-on
			
		КонецПопытки;
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(СтрокаОбработки)
	
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(СтрокаОбработки, ТекСимвол) <> 0 Тогда
			СтрокаОбработки = СтрЗаменить(СтрокаОбработки, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат СтрокаОбработки;
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Процедура ДобавитьЗначениеВСписок(Список, Значение, Представление)
	
	Если Список.НайтиПоЗначению(Значение) = Неопределено Тогда
		Список.Добавить(Значение, Представление);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - Докумена учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПредставлениеНомера(Документ)
	
	Результат = ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаРегламентированногоУчета()
	
	Результат = Константы.ВалютаРегламентированногоУчета.Получить();
	Возврат Результат;
	
КонецФункции

Функция НаименованиеИННКПП(Наименование, ИНН, КПП)
	
	Если ЗначениеЗаполнено(КПП) Тогда
		Результат = СтрШаблонЛок("%1, ИНН/КПП %2/%3", Наименование, ИНН, КПП);
	Иначе
		Результат = СтрШаблонЛок("%1, ИНН %2", Наименование, ИНН);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа СчетНаОплату
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_СчетНаОплату()
	
	Возврат "СчетНаОплату";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа ЗаказПокупателя
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ЗаказПокупателя()
	
	Возврат "ЗаказПокупателя";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документов продажи
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ДокументПродажи()
	
	Возврат "ДокументПродажи";
	
КонецФункции

Функция Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию()
	
	Результат = Ядро.Настройки_ОснованияВидовДокументов_ИспользуютсяНастройкиПоУмолчанию();
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что можно формировать электронные документы по счетам-фактурам,
// сформированных на основании отчетов комиссионеров. Функциональность доступна
// для конфигурации на базе типовой УТ версии не ниже 10.3.31
// 
// Возвращаемое значение:
//  Булево.
//
Функция ИспользуетсяСчетФактураКомиссионеру()
	
	РеквизитыСФ = Метаданные.Документы.СчетФактураВыданный.Реквизиты;
	Результат = (РеквизитыСФ.Найти("СводныйКомиссионный") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокументаСчетНаОплатуПокупателю()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	ВЫРАЗИТЬ(Т.СтруктурнаяЕдиница КАК Справочник.БанковскиеСчета) КАК БанковскийСчетОрганизации,
	|	Т.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК Т
	|ГДЕ
	|	Т.Ссылка = &ТекущийДокумент";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеТабличнойЧастиСчетНаОплатуПокупателю()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	NULL КАК Содержание,
	|	ТабличнаяЧасть.Номенклатура.Код КАК Код,
	|	ТабличнаяЧасть.Номенклатура.Артикул КАК Артикул,
	|	ТабличнаяЧасть.Количество,
	|	ТабличнаяЧасть.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ТабличнаяЧасть.ПроцентСкидкиНаценки 
	|	+ ТабличнаяЧасть.ПроцентАвтоматическихСкидок КАК Скидка,
	|	ТабличнаяЧасть.Цена КАК Цена,
	|	ТабличнаяЧасть.Сумма КАК Сумма,
	|	ТабличнаяЧасть.СуммаНДС КАК СуммаНДС,
	|	ТабличнаяЧасть.ХарактеристикаНоменклатуры КАК Характеристика,
	|	NULL КАК Серия,
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	0 КАК Метка
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Номенклатура,
	|	NULL КАК НаименованиеПолное,
	|	&ПолеСодержание КАК Содержание,
	|	ТабличнаяЧасть.Номенклатура.Код КАК Код,
	|	ТабличнаяЧасть.Номенклатура.Артикул КАК Артикул,
	|	ТабличнаяЧасть.Количество,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков,
	|	ТабличнаяЧасть.ПроцентСкидкиНаценки + ТабличнаяЧасть.ПроцентАвтоматическихСкидок,
	|	ТабличнаяЧасть.Цена,
	|	ТабличнаяЧасть.Сумма,
	|	ТабличнаяЧасть.СуммаНДС,
	|	NULL,
	|	NULL,
	|	ТабличнаяЧасть.НомерСтроки,
	|	1
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Услуги КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|УПОРЯДОЧИТЬ ПО
	|	Метка,
	|	НомерСтроки";
	
	ПолеНоменклатураНаименование = ВыражениеНоменклатураНаименование("ТабличнаяЧасть");
	ПолеСодержание = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("ТабличнаяЧасть");
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеНоменклатураНаименование",
		ПолеНоменклатураНаименование
	);
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеСодержание",
		ПолеСодержание
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокументаЗаказПокупателя()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	ВЫРАЗИТЬ(Т.СтруктурнаяЕдиница КАК Справочник.БанковскиеСчета) КАК БанковскийСчетОрганизации,
	|	Т.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Т
	|ГДЕ
	|	Т.Ссылка = &ТекущийДокумент";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеТабличнойЧастиЗаказПокупателя()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	NULL КАК Содержание,
	|	ВложенныйЗапрос.Номенклатура.Код КАК Код,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки
	|	+ ВложенныйЗапрос.ПроцентАвтоматическихСкидок КАК Скидка,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	NULL Как Серия,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	Метка
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		ТабличнаяЧасть.Номенклатура,
	|		ТабличнаяЧасть.ЕдиницаИзмерения,
	|		ТабличнаяЧасть.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ТабличнаяЧасть.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|		ТабличнаяЧасть.Цена КАК Цена,
	|		СУММА(ТабличнаяЧасть.Количество) КАК Количество,
	|		СУММА(ТабличнаяЧасть.Сумма ) КАК Сумма,
	|		СУММА(ТабличнаяЧасть.СуммаНДС ) КАК СуммаНДС,
	|		ТабличнаяЧасть.ХарактеристикаНоменклатуры КАК Характеристика,
	|		МИНИМУМ(ТабличнаяЧасть.НомерСтроки) КАК НомерСтроки,
	|		0 КАК Метка
	|	ИЗ
	|		Документ.ЗаказПокупателя.Товары КАК ТабличнаяЧасть
	|	ГДЕ
	|		ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|	СГРУППИРОВАТЬ ПО
	|		ТабличнаяЧасть.Номенклатура,
	|		ТабличнаяЧасть.ЕдиницаИзмерения,
	|		ТабличнаяЧасть.ПроцентСкидкиНаценки,
	|		ТабличнаяЧасть.ПроцентАвтоматическихСкидок,
	|		ТабличнаяЧасть.Цена,
	|		ТабличнаяЧасть.ХарактеристикаНоменклатуры
	|) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Номенклатура,
	|	NULL КАК НаименованиеПолное,
	|	&ПолеСодержание КАК Содержание,
	|	ТабличнаяЧасть.Номенклатура.Код КАК Код,
	|	ТабличнаяЧасть.Номенклатура.Артикул КАК Артикул,
	|	ТабличнаяЧасть.Количество КАК Количество,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	ТабличнаяЧасть.ПроцентСкидкиНаценки
	|	+ ТабличнаяЧасть.ПроцентАвтоматическихСкидок КАК Скидка,
	|	ТабличнаяЧасть.Цена КАК Цена,
	|	ТабличнаяЧасть.Сумма КАК Сумма,
	|	ТабличнаяЧасть.СуммаНДС КАК СуммаНДС,
	|	NULL КАК Характеристика,
	|	NULL КАК Серия,
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	1 КАК Метка
	|ИЗ
	|	Документ.ЗаказПокупателя.Услуги КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	&ПолеВозвратнаяТара,
	|	NULL КАК Содержание,
	|	ТабличнаяЧасть.Номенклатура.Код КАК Код,
	|	ТабличнаяЧасть.Номенклатура.Артикул КАК Артикул,
	|	ТабличнаяЧасть.Количество КАК Количество,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	NULL КАК Скидка,
	|	ТабличнаяЧасть.Цена КАК Цена,
	|	ТабличнаяЧасть.Сумма КАК Сумма,
	|	(0) КАК СуммаНДС,
	|	NULL КАК Характеристика,
	|	NULL КАК Серия,
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	3 КАК Метка
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|		СУММА(ТабличнаяЧасть.Количество) КАК Количество,
	|		ТабличнаяЧасть.Цена КАК Цена,
	|		СУММА(ТабличнаяЧасть.Сумма) КАК Сумма,
	|		МИНИМУМ(ТабличнаяЧасть.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		Документ.ЗаказПокупателя.ВозвратнаяТара КАК ТабличнаяЧасть
	|	ГДЕ
	|		ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|	СГРУППИРОВАТЬ ПО
	|		ТабличнаяЧасть.Номенклатура,
	|		ТабличнаяЧасть.Цена
	|) КАК ТабличнаяЧасть
	|УПОРЯДОЧИТЬ ПО Метка ВОЗР, НомерСтроки ВОЗР
	|";
	
	ПолеНоменклатураНаименование = ВыражениеНоменклатураНаименование("ВложенныйЗапрос");
	ПолеСодержание = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("ТабличнаяЧасть");
	ПолеВозвратнаяТара = ВыражениеНоменклатураНаименование("ТабличнаяЧасть");
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеНоменклатураНаименование",
		ПолеНоменклатураНаименование
	);
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеСодержание",
		ПолеСодержание
	);
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеВозвратнаяТара",
		ПолеВозвратнаяТара
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокументаРеализацияТоваровУслуг()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	Т.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|ГДЕ
	|	Т.Ссылка = &ТекущийДокумент";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеТабличнойЧастиРеализацияТоваровУслуг()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	NULL КАК Содержание,
	|	ВложенныйЗапрос.Номенклатура.Код КАК Код,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление КАК ВидУпаковки,
	|	ВложенныйЗапрос.КоэффициентМест / ВложенныйЗапрос.Коэффициент КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоМест > 0
	|			ТОГДА ВложенныйЗапрос.КоличествоМест * ВложенныйЗапрос.ЕдиницаИзмеренияМест.Вес
	|		ИНАЧЕ ВложенныйЗапрос.Количество * ВложенныйЗапрос.ЕдиницаИзмерения.Вес
	|	КОНЕЦ КАК МассаБрутто,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ПроцентСкидкиНаценки = 0
	|				И ВложенныйЗапрос.ПроцентАвтоматическихСкидок = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСкидкиПоСтроке,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоМест КАК КоличествоМест,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки + ВложенныйЗапрос.ПроцентАвтоматическихСкидок КАК Скидка,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.Метка КАК Метка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|		ТабличнаяЧасть.Коэффициент КАК Коэффициент,
	|		ТабличнаяЧасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест.Коэффициент КАК КоэффициентМест,
	|		ТабличнаяЧасть.ХарактеристикаНоменклатуры КАК Характеристика,
	|		ТабличнаяЧасть.СерияНоменклатуры КАК Серия,
	|		ТабличнаяЧасть.СтавкаНДС КАК СтавкаНДС,
	|		ТабличнаяЧасть.Цена КАК Цена,
	|		ТабличнаяЧасть.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ТабличнаяЧасть.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|		СУММА(ТабличнаяЧасть.Количество) КАК Количество,
	|		СУММА(ТабличнаяЧасть.КоличествоМест) КАК КоличествоМест,
	|		СУММА(ТабличнаяЧасть.Сумма) КАК Сумма,
	|		СУММА(ТабличнаяЧасть.СуммаНДС) КАК СуммаНДС,
	|		МИНИМУМ(ТабличнаяЧасть.НомерСтроки) КАК НомерСтроки,
	|		0 КАК Метка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ТабличнаяЧасть
	|	ГДЕ
	|		ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТабличнаяЧасть.Номенклатура,
	|		ТабличнаяЧасть.Коэффициент,
	|		ТабличнаяЧасть.ЕдиницаИзмерения,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест,
	|		ТабличнаяЧасть.ХарактеристикаНоменклатуры,
	|		ТабличнаяЧасть.СерияНоменклатуры,
	|		ТабличнаяЧасть.СтавкаНДС,
	|		ТабличнаяЧасть.Цена,
	|		ТабличнаяЧасть.ПроцентСкидкиНаценки,
	|		ТабличнаяЧасть.ПроцентАвтоматическихСкидок,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест.Коэффициент) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Номенклатура,
	|	NULL,
	|	&ПолеСодержание,
	|	ТабличнаяЧасть.Номенклатура.Код,
	|	ТабличнаяЧасть.Номенклатура.Артикул,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков.Представление,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	ТабличнаяЧасть.СтавкаНДС,
	|	ТабличнаяЧасть.Цена,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.ПроцентСкидкиНаценки = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ТабличнаяЧасть.Количество,
	|	NULL,
	|	ТабличнаяЧасть.ПроцентСкидкиНаценки + ТабличнаяЧасть.ПроцентАвтоматическихСкидок,
	|	ТабличнаяЧасть.Сумма,
	|	ТабличнаяЧасть.СуммаНДС,
	|	ТабличнаяЧасть.НомерСтроки,
	|	1
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Номенклатура,
	|	&ПолеВозвратнаяТара,
	|	NULL,
	|	ТабличнаяЧасть.Номенклатура.Код,
	|	ТабличнаяЧасть.Номенклатура.Артикул,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков.Представление,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков,
	|	NULL,
	|	NULL,
	|	ТабличнаяЧасть.Количество * ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков.Вес,
	|	NULL,
	|	NULL,
	|	""Без НДС"",
	|	ТабличнаяЧасть.Цена,
	|	ЛОЖЬ,
	|	ТабличнаяЧасть.Количество,
	|	NULL,
	|	0,
	|	ТабличнаяЧасть.Сумма,
	|	0,
	|	ТабличнаяЧасть.НомерСтроки,
	|	2
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|		ТабличнаяЧасть.Цена КАК Цена,
	|		СУММА(ТабличнаяЧасть.Количество) КАК Количество,
	|		СУММА(ТабличнаяЧасть.Сумма) КАК Сумма,
	|		МИНИМУМ(ТабличнаяЧасть.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК ТабличнаяЧасть
	|	ГДЕ
	|		ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТабличнаяЧасть.Номенклатура,
	|		ТабличнаяЧасть.Цена) КАК ТабличнаяЧасть
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метка,
	|	НомерСтроки";
	
	ПолеНоменклатураНаименование = ВыражениеНоменклатураНаименование("ВложенныйЗапрос");
	ПолеСодержание = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("ТабличнаяЧасть");
	ПолеВозвратнаяТара = ВыражениеНоменклатураНаименование("ТабличнаяЧасть");
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеНоменклатураНаименование",
		ПолеНоменклатураНаименование
	);
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеСодержание",
		ПолеСодержание
	);
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеВозвратнаяТара",
		ПолеВозвратнаяТара
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокументаОтчетКомитентуОПродажах()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номер,
	|	Т.Дата,
	|	Т.ДоговорКонтрагента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	Т.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ВЫБОР
	|		КОГДА Т.СтавкаНДСВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьНДС
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Т
	|ГДЕ
	|	Т.Ссылка = &ТекущийДокумент";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеТабличнойЧастиОтчетКомитентуОПродажах()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТабличнаяЧасть.СуммаВознаграждения) КАК Сумма,
	|	СУММА(ТабличнаяЧасть.СуммаНДСВознаграждения) КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &ТекущийДокумент";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокументаКорректировкаРеализации()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.ИсправляемыйДокументРеализации.Номер КАК НомерИсходногоДокумента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	Т.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Т
	|ГДЕ
	|	Т.Ссылка = &ТекущийДокумент";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеТабличнойЧастиКорректировкаРеализации()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	NULL КАК Содержание,
	|	ВложенныйЗапрос.Номенклатура.Код КАК Код,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление КАК ВидУпаковки,
	|	ВложенныйЗапрос.КоэффициентМест / ВложенныйЗапрос.Коэффициент КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоМест > 0
	|			ТОГДА ВложенныйЗапрос.КоличествоМест * ВложенныйЗапрос.ЕдиницаИзмеренияМест.Вес
	|		ИНАЧЕ ВложенныйЗапрос.Количество * ВложенныйЗапрос.ЕдиницаИзмерения.Вес
	|	КОНЕЦ КАК МассаБрутто,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ПроцентСкидкиНаценки = 0
	|				И ВложенныйЗапрос.ПроцентАвтоматическихСкидок = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСкидкиПоСтроке,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоМест КАК КоличествоМест,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки + ВложенныйЗапрос.ПроцентАвтоматическихСкидок КАК Скидка,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.Метка КАК Метка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|		ТабличнаяЧасть.Коэффициент КАК Коэффициент,
	|		ТабличнаяЧасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест.Коэффициент КАК КоэффициентМест,
	|		ТабличнаяЧасть.ХарактеристикаНоменклатуры КАК Характеристика,
	|		ТабличнаяЧасть.СерияНоменклатуры КАК Серия,
	|		ТабличнаяЧасть.СтавкаНДС КАК СтавкаНДС,
	|		ТабличнаяЧасть.Цена КАК Цена,
	|		ТабличнаяЧасть.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		ТабличнаяЧасть.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|		СУММА(ТабличнаяЧасть.Количество) КАК Количество,
	|		СУММА(ТабличнаяЧасть.КоличествоМест) КАК КоличествоМест,
	|		СУММА(ТабличнаяЧасть.Сумма) КАК Сумма,
	|		СУММА(ТабличнаяЧасть.СуммаНДС) КАК СуммаНДС,
	|		МИНИМУМ(ТабличнаяЧасть.НомерСтроки) КАК НомерСтроки,
	|		0 КАК Метка
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК ТабличнаяЧасть
	|	ГДЕ
	|		ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|		И ТабличнаяЧасть.Количество > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТабличнаяЧасть.Номенклатура,
	|		ТабличнаяЧасть.Коэффициент,
	|		ТабличнаяЧасть.ЕдиницаИзмерения,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест,
	|		ТабличнаяЧасть.ХарактеристикаНоменклатуры,
	|		ТабличнаяЧасть.СерияНоменклатуры,
	|		ТабличнаяЧасть.СтавкаНДС,
	|		ТабличнаяЧасть.Цена,
	|		ТабличнаяЧасть.ПроцентСкидкиНаценки,
	|		ТабличнаяЧасть.ПроцентАвтоматическихСкидок,
	|		ТабличнаяЧасть.ЕдиницаИзмеренияМест.Коэффициент) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Номенклатура,
	|	NULL,
	|	&ПолеСодержание,
	|	ТабличнаяЧасть.Номенклатура.Код,
	|	ТабличнаяЧасть.Номенклатура.Артикул,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков.Представление,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	|	ТабличнаяЧасть.Номенклатура.ЕдиницаХраненияОстатков,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	NULL,
	|	ТабличнаяЧасть.СтавкаНДС,
	|	ТабличнаяЧасть.Цена,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.ПроцентСкидкиНаценки = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ТабличнаяЧасть.Количество,
	|	NULL,
	|	ТабличнаяЧасть.ПроцентСкидкиНаценки + ТабличнаяЧасть.ПроцентАвтоматическихСкидок,
	|	ТабличнаяЧасть.Сумма,
	|	ТабличнаяЧасть.СуммаНДС,
	|	ТабличнаяЧасть.НомерСтроки,
	|	1
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &ТекущийДокумент
	|	И ТабличнаяЧасть.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метка,
	|	НомерСтроки";
	
	ПолеНоменклатураНаименование = ВыражениеНоменклатураНаименование("ВложенныйЗапрос");
	ПолеСодержание = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("ТабличнаяЧасть");
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеНоменклатураНаименование",
		ПолеНоменклатураНаименование
	);
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеСодержание",
		ПолеСодержание
	);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеНоменклатураНаименование(ИмяТаблицыВыбора)
	
	СтрокаИмениТаблицыВыборки = "";
	Если Не ПустаяСтрока(ИмяТаблицыВыбора) Тогда
		
		СтрокаИмениТаблицыВыборки = ИмяТаблицыВыбора + ".";
		
	КонецЕсли;
	
	Результат =
	"ВЫБОР
	|		КОГДА НЕ (" + СтрокаИмениТаблицыВыборки + "Номенклатура.НаименованиеПолное Подобно """") ТОГДА
	|			ВЫРАЗИТЬ(" + СтрокаИмениТаблицыВыборки + "Номенклатура.НаименованиеПолное КАК Строка (1000))
	|		ИНАЧЕ
	|			" + СтрокаИмениТаблицыВыборки + "Номенклатура.Наименование
	|	КОНЕЦ";
	
	Возврат Результат;
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

Функция ЭтоСчетФактураВыданный(ДокументСсылка)

	Результат = (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураНаАванс(ДокументСсылка)

	Результат = Ложь;
	
	Если ЭтоСчетФактураВыданный(ДокументСсылка) Тогда
		
		ВидСчетаФактуры = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "ВидСчетаФактуры");
		
		Результат = (ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
					Или ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОтчетКомитентуОПродажах(ДокументСсылка)

	Результат = (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)

	ЭлементыАдресногоОбъекта = Новый Массив;
	ЭлементыАдресногоОбъекта.Добавить(Элемент1);
	ЭлементыАдресногоОбъекта.Добавить(Элемент2);
	
	Результат = СокрЛП(СоединитьСтроку(ЭлементыАдресногоОбъекта, " "));
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)";
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

НеИспользуется_РежимУправляемыхФорм = Ложь; // Определяет версию типового модуля: ОФ / УФ

