////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
&НаСервере
Перем
МодульОбъектаКэш,
АдресКомпонентыКэш;

// Служебные свойства
&НаКлиенте
Перем
Генератор,
СтрокаQr,
ОповещениеЗавершенияГенерации;

// Стд
&НаКлиенте
Перем
КлиентСтдЛок;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоВнешняяОбработка = Объект_()._ЭтоВнешняяОбработка();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Асинхронно генерирует QR-код.
// 
// Возвращает двоичные данные изоброжения QR-кода
//
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения, ФиксированнаяСтруктура - Обработчик завершения получения сессии.
//                                            Результат: ДвоичныеДанные.
//
&НаКлиенте
Процедура НачатьСоздатьКод(Оповещение) Экспорт
	
	ОповещениеЗавершенияГенерации = Оповещение;
	_НачатьИнициализацииГенератораQr(Истина);
	
КонецПроцедуры

// Синхронно генерирует QR-код.
// 
// Возвращаемое значение: ДвоичныеДанные - изоброжения QR-кода
//
&НаКлиенте
Функция СоздатьКод() Экспорт
	
	Возврат Генератор().ПолучитьШтрихкод();
	
КонецФункции

// Устанавливает свойство формы для генерации QR-кода
//
// Параметры:
//  Значение - Произвольный - значение кодируемой строки.
//
&НаКлиенте
Процедура УстановитьЗначениеКода(Значение) Экспорт

	Если Не ЗначениеЗаполнено(Значение) Тогда
		ВызватьИсключение "Пустое значение QR-кода";
	КонецЕсли;
	
    СтрокаQr  = Значение;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция СтдЛок()
	
	Если КлиентСтдЛок = Неопределено Тогда	
		Если ЭтоВнешняяОбработка Тогда
			КлиентСтдЛок = ПолучитьФорму("ВнешняяОбработка.КонтурДиадокСтд.Форма.Клиент");
		Иначе
			КлиентСтдЛок = ПолучитьФорму("Обработка.КонтурДиадокСтд.Форма.Клиент");	
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлиентСтдЛок;                          
	
КонецФункции

&НаКлиенте
Функция Генератор()
	
	Если Генератор = Неопределено Тогда
		Если ПодключитьГенераторQr() Тогда
			Генератор = НовыйГенератор();
		КонецЕсли;
	КонецЕсли;
	
	Генератор.ЗначениеКода = СтрокаQr;
	
	Возврат Генератор;
	
КонецФункции

&НаКлиенте
Процедура _НачатьИнициализацииГенератораQr(Установить) Экспорт

	Адрес = АдресКомпоненты();
	Если Адрес = Неопределено Тогда
		ВызватьИсключение "Не найдена компонента для генерации QR-кода";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("_ПослеНачатьПодключениеВнешнейКомпоненты", ЭтотОбъект, Установить);
	Если ПодключитьВнешнююКомпоненту(Адрес, "BarcodeSymbolicName") Тогда
		СтдЛок().ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(Оповещение, Истина);
	Иначе	
		НачатьПодключениеВнешнейКомпоненты(Оповещение, Адрес, "BarcodeSymbolicName");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьГенераторQr()

	ПараметрыГенерации = ПараметрыГенерации();

	Генератор.Ширина = Окр(ПараметрыГенерации.Ширина);
	Генератор.Высота = Окр(ПараметрыГенерации.Высота);
	Генератор.ТипКода = ПараметрыГенерации.ТипКода;
	Генератор.ПрозрачныйФон = ПараметрыГенерации.ПрозрачныйФон;
	Генератор.ТипВходныхДанных = ПараметрыГенерации.ТипВходныхДанных;
	Генератор.GS1DatabarКоличествоСтрок = ПараметрыГенерации.GS1DatabarКоличествоСтрок;
	Генератор.УбратьЛишнийФон = ПараметрыГенерации.УбратьЛишнийФон;
	Генератор.ОтображатьТекст = ПараметрыГенерации.ОтображатьТекст;
    Генератор.УголПоворота = ПараметрыГенерации.УголПоворота;
	Генератор.УровеньКоррекцииQR = ПараметрыГенерации.УровеньКоррекцииQR;
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеНачатьПодключениеВнешнейКомпоненты(Подключено, УстановитьЕслиНеПодключено) Экспорт

	Если Подключено Тогда
		
		Генератор = НовыйГенератор();
		Генератор.ЗначениеКода = СтрокаQr;
		
		Результат = Генератор.ПолучитьШтрихкод();
		СтдЛок().ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ОповещениеЗавершенияГенерации, Результат);
		
	ИначеЕсли УстановитьЕслиНеПодключено Тогда
		
		Оповещение = Новый ОписаниеОповещения("_НачатьИнициализацииГенератораQr", ЭтотОбъект, Ложь);
		Адрес = АдресКомпоненты();
        НачатьУстановкуВнешнейКомпоненты(Оповещение, Адрес);
		
    Иначе
		
		ВызватьИсключение "Не удалось подключить или установить внешнюю компоненту для генерации QR-кода";

	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ПодключитьГенераторQr()

	Адрес = АдресКомпоненты();
	Если Адрес = Неопределено Тогда
		ВызватьИсключение "Не найдена компонента для генерации QR-кода";
	КонецЕсли;
	
	Если Не ПодключитьВнешнююКомпоненту(Адрес, "BarcodeSymbolicName") Тогда
		УстановитьВнешнююКомпоненту(Адрес);
		Если Не ПодключитьВнешнююКомпоненту(Адрес, "BarcodeSymbolicName") Тогда
			ВызватьИсключение "Не удалось подключить компоненту для генерации QR-кода";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НовыйГенератор()
	
	Генератор = Новый("AddIn.BarcodeSymbolicName.Barcode");
	ИнициализироватьГенераторQr();
	
	Возврат Генератор;
	
КонецФункции

&НаСервере
Функция АдресКомпоненты()
	
	Если АдресКомпонентыКэш <> Неопределено Тогда
		Возврат АдресКомпонентыКэш;
	КонецЕсли;
	
	Данные = Объект_()._ДанныеКомпонентыГенератораQr();
	
	Если Данные <> Неопределено Тогда
		АдресКомпонентыКэш = ПоместитьВоВременноеХранилище(Данные);
	КонецЕсли;
	
	Возврат АдресКомпонентыКэш;
	
КонецФункции

&НаСервере
Функция Объект_()
	
	Если МодульОбъектаКэш = Неопределено Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			МодульОбъектаКэш = ЭтотОбъект;
		#Иначе
			МодульОбъектаКэш = РеквизитФормыВЗначение("Объект");
		#КонецЕсли
	КонецЕсли;
	
	Возврат МодульОбъектаКэш;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыГенерации()
	
	Размер = 190;
	РазмерШрифта = 12;
	КоличествоСтрок = 2;
	ТипКода = 16;
	
	Результат = Новый Структура;
	Результат.Вставить("Ширина"            , Размер);
	Результат.Вставить("Высота"            , Размер);
	Результат.Вставить("ТипКода"           , ТипКода);
	Результат.Вставить("ОтображатьТекст"   , Истина);
	Результат.Вставить("РазмерШрифта"      , РазмерШрифта);
	Результат.Вставить("УголПоворота"      , 0);
	Результат.Вставить("Штрихкод"          , "");
	Результат.Вставить("ПрозрачныйФон"     , Истина);
	Результат.Вставить("УровеньКоррекцииQR", 1);
	Результат.Вставить("Масштабировать"           , Ложь);
	Результат.Вставить("СохранятьПропорции"       , Ложь);
	Результат.Вставить("ВертикальноеВыравнивание" , 1); 
	Результат.Вставить("GS1DatabarКоличествоСтрок", КоличествоСтрок);
	Результат.Вставить("ТипВходныхДанных", 0);
	Результат.Вставить("УбратьЛишнийФон" , Ложь); 
	Результат.Вставить("ЛоготипКартинка");
	Результат.Вставить("ЛоготипРазмерПроцентОтШК");       
	Результат.Вставить("НовыйВызовКомпоненты", Ложь);  
	
	Возврат Результат;
	
КонецФункции