
#Область ПЕРЕМЕННЫЕ_ПЛАТФОРМЫ
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Манифест 				Экспорт;
Перем ОбработкаОбъект 		Экспорт;
Перем ПараметрыКлиентСервер Экспорт;

Перем НомерИтерацииВызоваМодуля;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
#КонецОбласти

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ПЛАТФОРМЫ

Функция МетодСервера(ИмяМодуля = "", ИмяМетода, 
		Параметр0 = NULL, Параметр1 = NULL, Параметр2 = NULL, Параметр3 = NULL, Параметр4 = NULL, 
		Параметр5 = NULL, Параметр6 = NULL, Параметр7 = NULL, Параметр8 = NULL, Параметр9 = NULL)
	
	Возврат ОбработкаОбъект.МетодСервера(ИмяМодуля, ИмяМетода, 
	Параметр0, Параметр1, Параметр2, Параметр3, Параметр4, 
	Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля = 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ОбработкаОбъект.ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект			= Неопределено;
		ПараметрыКлиентСервер	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриглашениеОтладки() Экспорт
	
	//// Удалите комментарий напротив оператора "ВызватьИсключение", чтобы получить приглашение для начала отладки модуля.
	// ВызватьИсключение "Нажмите кнопку ""Подробно"", а затем ""Конфигуратор"", чтобы начать отладку модуля!"; 
	
КонецПроцедуры

#КонецОбласти

#Область МАНИФЕСТ

// Все функции и процедуры тела модуля должны быть экспортными и добавлены в соответствующую структуру!

Функция ФункцииМодуля() Экспорт
	
	Результат = Новый Структура;
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПодготовитьВТДляСпискаОтправкиДокументов");
	
	// Машиночитаемые доверенности
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ИмяСправочникаВИнформационнойБазе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ДанныеДоверенности");

	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьОбстоятельствоФормированияСчетФактуры");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВозвратТоваровОтКлиента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВыбытиеИзОборотаМаркируемойПродукции");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента
//
// Параметры:
//  ТребуемыеРеквизиты	 - Структура	 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - ссылка на объект, описание которого надо получить.
//
Процедура ПриПолученииОписанияПрикладногоДокумента(ТребуемыеРеквизиты, СсылкаНаОбъект) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидДокументаИнформационнойБазы
//
// Параметры:
//  ВидДокумента	 - Строка - (возвращаемый параметр) вид документа с точки зрения ЭДО (см. ВидыЭлектронныхДокументов);
//  СсылкаНаОбъект	 - ЛюбаяСсылка - объект информационной базы, вид которого необходимо определить;
//  ЭтоКорректировка - Булево - Истина, если объект отражает операцию корректировки;
//
Процедура ОпределитьВидДокумента(ВидДокумента, СсылкаНаОбъект, ЭтоКорректировка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 - Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  СсылкаНаОбъект	 - ЛюбаяСсылка - объект, для которого необходимо получить сведения о дате и номере;
//  ЭтоИсправление	 - Булево - Истина, если это исправительный документ;
//
Процедура ЗаполнитьСведенияОДатеИНомереДокумента(Результат, СсылкаНаОбъект, ЭтоИсправление) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку820
//
// Параметры:
//  ДокументыОбОтгрузке	- Массив - (возвращаемый параметр) Массив элементов "Новый_DocumentShipment";
//  СсылкаНаОбъект		- ДокументСсылка.СчетФактураВыданный - СФ для которой определяем реквизиты документов отгрузки.
//
Процедура ПриПолученииДанныхДокументовОбОтгрузке(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 - Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  СсылкаНаОбъект	 - ЛюбаяСсылка - объект, для которого необходимо получить сведения о дате и номере;
//  ЭтоИсправление	 - Булево - Истина, если это исправительный документ;
//
Процедура ЗаполнитьСведенияОДатеИНомереКорректировочногоДокумента(Результат, СсылкаНаОбъект, ЭтоИсправление) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//
// Параметры:
//  Реквизиты			 - Структура		 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  МетаданныеИсточника	 - ОбъектМетаданных	 - Метаданные документа-источника
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки
// после формирования структуры шапки документа.
//
// Параметры:
//  ЗначенияРеквизитов - Структура - Структура со значениями реквизита документа
//
Процедура ПослеПолученияДанныхШапкиДокумента(ДанныеШапки) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  МетаданныеОбъекта	 - ОбъектМетаданных - объект метаданных.
//  ТабличныеЧасти		 - Массив - массив, в который необходимо добавить имена табличных частей, из которых нужно получить данные.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииИменТабличныхЧастей(МетаданныеОбъекта, ТабличныеЧасти, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка				 - Структура - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//  ИмяТабличнойЧасти	 - Строка	 - имя табличной части объекта.
//  РеквизитыТЧ			 - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                     псевдоним поля, а в качестве значения (опционально) фактическое имя поля в таблице.
//                                     Если значение не определено, то имя поля берется из ключа.
//  ПараметрыЗапроса	 - Структура - дополнительные параметры, будут переданы в исполняемый запрос.
//
Процедура ПриПодготовкеЗапросаПоТоварнойЧастиДокумента(Шапка, ИмяТабличнойЧасти, РеквизитыТЧ, ПараметрыЗапроса) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка			 - Структура		 - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей.
//
Процедура ПослеПолученияТоварнойЧастиДокумента(Шапка, ТабличнаяЧасть) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РасчетноеПредставлениеНомера()
//
// Параметры:
//  НомерОбъекта		 - Строка - номер или код объекта, который преобразуется для вывода на печать.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	НомерОбъекта = ПредставлениеНомера(НомерОбъекта);
		
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяКолонкиКодТовара()
//
// Параметры:
//  ИмяКолонки			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов(ИмяКолонки, СтандартнаяОбработка = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ИмяКолонки = ИмяКолонкиКодТовара();
		
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВалютаРегламентированногоУчета()
//
Процедура ПриОпределенииВалютыРегламентированногоУчета(ВалютаРеглУчета, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыЮрФизЛица.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  ЮрФизЛицо			 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период				 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет		 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                         Если не передан, будут включены реквизиты основного банковского счета.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	

	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыДоговора.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  Шапка				 - Структура - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки).
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЭтапыГрафикаОплатПоДокументу.
//
// Параметры:
//  ЭтапыОплаты			 - ТаблицаЗначений	 - возвращаемые сведения;
//  Шапка				 - Структура		 - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки);
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииЭтаповГрафикаОплат(ЭтапыОплаты, Шапка, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПредставлениеНоменклатуры.
//
// Параметры:
//  Представление			 - Строка - параметр, в который возвращается полученное представление номенклатуры;
//  Номенклатура			 - Строка, СправочникСсылка.Номенклатура				 - ссылка на номенклатуру;
//  Характеристика			 - Строка, СправочникСсылка.ХарактеристикиНоменклатуры	 - характеристика номенклатуры;
//  ДополнительныеПараметры	 - Неопределено, Структура								 - см. функцию Модуль_ИнтеграцияУниверсальный.ДополнительныеПараметрыПредставленияНоменклатуры;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииПредставленияНоменклатуры(Представление, Номенклатура, Характеристика, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыУчетаНоменклатуры.
//
// Параметры:
//  ПараметрыНоменклатуры	 - Структура - Коллекция параметров учета номенклатуры в текущей ИБ;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииПараметровУчетаНоменклатуры(ПараметрыНоменклатуры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ХранилищеКонтактнойИнформацииОбъекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов;
//
Процедура ПриПолученииВидовИсходящихДокументов(ВидыДокументов) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов;
//
Процедура ПриПолученииВидовВходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, Неопределено);
			
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеТоваров
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПриПолученииВладельцаОбщихНастроекМодуля.
//
// Параметры:
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект, выступающий в качестве константы для хранения дополнительных свойств;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииВладельцаОбщихНастроекМодуля(СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаНаОбъект = ПредопределенноеЗначение("Справочник.ПрофилиГруппДоступа.Администратор");
	
КонецПроцедуры


#Область СопоставлениеНоменклатуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СвойстваНоменклатурыИнформационнойБазы.
// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  НаборНоменклатуры - Массив из ОпределяемыйТип.НоменклатураБЭД - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. Модуль_ИнтеграцияУниверсальный.НовыеСвойстваНоменклатурыИБ.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(Знач НаборНоменклатуры, СвойстваНоменклатурИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВидыНоменклатуры.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|	ЛОЖЬ КАК ИспользоватьУпаковки,
	|	ИСТИНА КАК ОбязательноеЗаполнениеХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка В(&НаборНоменклатуры)";
	
	Запрос.УстановитьПараметр("НаборНоменклатуры", НаборНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваНоменклатуры = НовыеСвойстваНоменклатурыИБ();
		ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, Выборка);
		
		СвойстваНоменклатурИБ.Вставить(Выборка.Номенклатура, СвойстваНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняется при подборе недостающих данных о номенклатуре информационной базы по уже имеющимся,
// а также номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//
Процедура ПриПодбореНоменклатурыИнформационнойБазы(Знач НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	//См. ОбменСКонтрагентамиПереопределяемый.ПриПодбореНоменклатурыИнформационнойБазы
	
	Если ЗначениеЗаполнено(НоменклатураИБ.Номенклатура) Тогда
		Если НЕ ЗначениеЗаполнено(НоменклатураИБ.Упаковка) Тогда
			ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураИБ.Номенклатура, "ЕдиницаИзмерения");
			Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
				НоменклатураИБ.Упаковка = ЕдиницаИзмерения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураИБ.Упаковка)  Тогда
		
		Если ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмеренияКод) Тогда
			НоменклатураИБ.Упаковка = ЭлектронноеВзаимодействиеРТ.НайтиСсылкуНаОбъектПоРеквизиту("БазовыеЕдиницыИзмерения", 
				"Код", НоменклатураКонтрагента.ЕдиницаИзмеренияКод);
		ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
			НоменклатураИБ.Упаковка = ЭлектронноеВзаимодействиеРТ.НайтиСсылкуНаОбъектПоРеквизиту("БазовыеЕдиницыИзмерения", 
				"Наименование", НоменклатураКонтрагента.ЕдиницаИзмерения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураИБ.Номенклатура)
		И Не ЗначениеЗаполнено(НоменклатураИБ.Характеристика)
		И ЗначениеЗаполнено(НоменклатураКонтрагента.Характеристика) Тогда
		
		ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураИБ.Номенклатура, 
			"ВидНоменклатуры");
		ВидНоменклатуры = ЗначенияРеквизитовНоменклатуры.ВидНоменклатуры;
		
		ЗначенияРеквизитовВидаНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидНоменклатуры, 
			"ИспользованиеХарактеристик");
		ИспользованиеХарактеристик = ЗначенияРеквизитовВидаНоменклатуры.ИспользованиеХарактеристик;
		
		Если ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры Тогда
			НоменклатураИБ.Характеристика = ЭлектронноеВзаимодействиеРТ.НайтиСсылкуНаОбъектПоРеквизиту("ХарактеристикиНоменклатуры", 
				"Наименование", НоменклатураКонтрагента.Характеристика, НоменклатураИБ.Номенклатура);
		ИначеЕсли ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ОбщиеДляВидаНоменклатуры Тогда
			НоменклатураИБ.Характеристика = ЭлектронноеВзаимодействиеРТ.НайтиСсылкуНаОбъектПоРеквизиту("ХарактеристикиНоменклатуры", 
				"Наименование", НоменклатураКонтрагента.Характеристика, ВидНоменклатуры);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ЗаполнитьСоответствиеПолейВходящегоДокумента(ОбъектМетаданных, ИменаПолей) Экспорт
	
	ВидДокумента = ОбъектМетаданных.Имя;
	
	Если ВРег(ВидДокумента) = ВРег("СчетФактураПолученный") Тогда
		
		ИменаПолей.Номер	= "Номер";
		ИменаПолей.Дата		= "ДатаСоставления";	
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет таблицу правил обработки входящих электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - правила обработки документов (см. ПравилаОбработкиВходящихДокументов);
//
// Пример:
//	Если ПолучитьФункциональнуюОпцию("ВедетсяПроизводственнаяДеятельность") Тогда
//		
//		ДобавитьПравилоОбработкиДокументов(ПравилоОбработки
//			, "ПоступлениеВПереработку" // Описание правила задается в процедуре ПриПолученииПравилаОбработкиЭлектронногоДокумента
//			, "ТоварнаяНакладная" 		// Используется для накладных
//			, Ложь); 					// Для исправлений не используется, только для первичных документов
//		
//	КонецЕсли;
//
Процедура ЗаполнитьПравилаОбработкиВходящихДокументов(ПравилаОбработки) Экспорт
	
	ЗаполнитьПравилаОбработкиАктов(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиНакладных(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки);
		
КонецПроцедуры

// Обработчик получения правила отражения электронного документа в учетной системе.
// Вызывается из Модуль_ИнтеграцияУниверсальный.ПравилоОбработкиЭлектронныхДокументов.
//
// Параметры:
//  ПравилоОбработки	 - Структура - описание способа обработки электронного документа (см. ПравилоОбработкиЭлектронныхДокументов);
//  СтандартнаяОбработка - Булево - Истина, если специальная обработка не требуется,
//                                  а идентификатор совпадает с именем метаданных документа;
//
// Пример:
//
//	Если ПравилоОбработки.Идентификатор = "ПоступлениеВПереработку" Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		ДополнительныеПараметры = Новый Структура;
//		ДополнительныеПараметры.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
//		
//		ПравилоОбработки.Представление = "Поступление материалов в переработку";
//		ПравилоОбработки.ОбъектМетаданных = Метаданные.Документы.ПоступлениеТоваровУслуг.ПолноеИмя();
//		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
//		
//	КонецЕсли;
//
Процедура ПриПолученииПравилаОбработкиЭлектронногоДокумента(ПравилоОбработки, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.НовыйДокументИнформационнойБазы.
//
// Параметры:
//  ДокументОбъект		 - ДокументОбъект	 - новый, еще не записанный, документ-объект;
//  ДанныеЭД			 - Структура		 - содержит данные электронного документа
//                                             (см. Модуль_ИнтеграцияУниверсальный.ДанныеЭлектронногоДокумента);
//  ПараметрыЗаполнения	 - Структура		 - содержит дополнительные параметры заполнения;
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриСозданииДокументаИнформационнойБазы(ДокументОбъект, ДанныеЭД, ПараметрыЗаполнения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если МетаданныеДокумента = Метаданные.Документы.ПоступлениеТоваров Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияТоваров(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеТоваров(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.СчетФактураПолученный Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияСчетаФактуры(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьСчетФактуруПолученный(ДокументОбъект, СтруктураЗаполнения);
		
	Иначе
		
		// Специальная обработка заполнения не реализована
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяСправочникаВладельцаНоменклатуры.
//
// Параметры:
//  ИмяСправочника		 - Строка - имя справочника, которому подчинен справочник "НоменклатураПоставщиков";
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииИмениСправочникаВладельцаНоменклатуры(ИмяСправочника, СтандартнаяОбработка) Экспорт
	
		
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.МетаданныеПрикладногоСправочника.
//
// Параметры:
//  СоответствиеСправочников - Соответствие - ключом является имя справочника в терминах сервиса, а значением - метаданные прикладного справочника;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСоответствияСправочников(СоответствиеСправочников, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СоответствиеСправочников.Вставить("Валюты"			, Неопределено);
	СоответствиеСправочников.Вставить("СтраныМира"		, Метаданные.Справочники.СтраныМира);
	
	СоответствиеСправочников.Вставить("Организации"				, Метаданные.Справочники.Организации);
	СоответствиеСправочников.Вставить("Контрагенты"				, Метаданные.Справочники.Контрагенты);
	СоответствиеСправочников.Вставить("Партнеры"				, Неопределено);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СсылкаОбъектаПоПолямПоиска.
//
// Параметры:
//  СсылкаНаОбъект		 - Произвольный - ссылка на искомый объект;
//  ПоляПоиска			 - Структура - содержит параметры поиска;
//  ОбъектМетаданных	 - ОбъектМетаданных - метаданные искомого объекта;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//
//  НаименованиеПолное = Неопределено;
//  Если ПоляПоиска.Свойство("НаименованиеПолное", НаименованиеПолное) 
//      И Не ЕстьРеквизитМетаданных(ОбъектМетаданных, "НаименованиеПолное") 
//      И ЕстьРеквизитМетаданных(ОбъектМетаданных, "ПолноеНаименование") Тогда
//          
//          ПоляПоиска.Удалить("НаименованиеПолное");
//          ПоляПоиска.Вставить("ПолноеНаименование", НаименованиеПолное);
//          
//  КонецЕсли;
//
Процедура ПриПолученииСсылкиПоПолямПоиска(СсылкаНаОбъект, ПоляПоиска, ОбъектМетаданных, СтандартнаяОбработка) Экспорт
			
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СчетаФактурыПоОснованию.
//
// Параметры:
//  НайденныеДокументы	 - Массив	 - Ссылки на найденные счета-фактуры;
//  ПараметрыРегистрации - Структура - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСчетовФактурПоОснованию(НайденныеДокументы, ПараметрыРегистрации, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ТаблицаСчетовФактур	 = Документы.СчетФактураПолученный.СчетаФактурыПоОснованию(ПараметрыРегистрации.Ссылка, , , Ложь);
	
	Если ЗначениеЗаполнено(ТаблицаСчетовФактур) Тогда 
		НайденныеДокументы = ТаблицаСчетовФактур.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
 
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактурыПоОснованию.
//
// Параметры:
//  ПараметрыРегистрации - Структура	 - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  ДокументОснование	 - ЛюбаяСсылка	 - документ, на основании которого необходимо получить параметры;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПодготовкеПараметровРегистрацииСчетаФактуры(ПараметрыРегистрации, ДокументОснование, СтандартнаяОбработка) Экспорт
		
	
КонецПроцедуры

#КонецОбласти

#Область СборПротоконтента

Процедура ЗаполнитьКонтентXmlUTD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
			
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlUCD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
		
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlTorg12(Content, Знач ДокСсылка, ПараметрыФормирования) Экспорт
			
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlAcceptanceCertificate(Content, ДокСсылка, ПараметрыФормирования) Экспорт
			
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoice(Content, ДокСсылка, ПараметрыФормирования) Экспорт
			
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoiceCorrection(Content, ДокСсылка, ПараметрыФормирования) Экспорт
			
КонецПроцедуры

#КонецОбласти

#Область МашиночитаемыеДоверенности
 
Функция МЧД_ИмяСправочникаВИнформационнойБазе(СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенности(Ссылка, СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтавкиНДС

Функция МенеджерИнтеграции_ПрикладнаяСтавкаНДС(ПредставлениеСтавки)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПрикладнаяСтавкаНДС", ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ОбщаяРасчетнаяСтавкаНДС(Дата = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОбщаяРасчетнаяСтавкаНДС", Дата);
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ЭтоСтавкаНДСИНА(Знач ПредставлениеСтавки)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЭтоСтавкаНДСИНА", ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСПоПредставлению(ПредставлениеСтавки, Дата = Неопределено)
	
	Если МенеджерИнтеграции_ЭтоСтавкаНДСИНА(ПредставлениеСтавки) Тогда
		Результат = МенеджерИнтеграции_ОбщаяРасчетнаяСтавкаНДС(Дата);
	Иначе 
		Результат = МенеджерИнтеграции_ПрикладнаяСтавкаНДС(ПредставлениеСтавки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПредставлениеНомера(НомерОбъекта)
	
	Результат = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерОбъекта, Истина, Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНомераОбъекта(СсылкаНаОбъект)
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	
	РеквизитыОбъекта = Новый Структура;
	РеквизитыОбъекта.Вставить("Номер");
	
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ПредставлениеНомера") Тогда
		РеквизитыОбъекта.Вставить("ПредставлениеНомера");
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыОбъекта);
	
	Если ЗначенияРеквизитов.Свойство("ПредставлениеНомера") Тогда
		Результат = ЗначенияРеквизитов.ПредставлениеНомера;
	Иначе
		НомерОбъекта = ЗначенияРеквизитов.Номер;
		Результат = ПредставлениеНомера(НомерОбъекта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает документ-основание счета-фактуры.
// Если оснований несколько, берется только первое.
//
// Параметры:
//  СчетФактура - ДокументСсылка.СчетФактураВыданный - Счет-фактура, основание которого требуется получить.
// 
// Возвращаемое значение:
//  ДокументСсылка - документ, на основании которого выписан счет-фактура.
//
Функция ДокументОснованиеСчетаФактуры(СчетФактура)
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ИмяДокумента = СчетФактура.Метаданные().ПолноеИмя();
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", ИмяДокумента + ".ТабличнаяЧасть.ДокументыОснования") Тогда 
	
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	&ПолноеИмяТаблицы КАК Т
		|ГДЕ
		|	Т.Ссылка = &СчетФактура";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ИмяДокумента + ".ДокументыОснования");
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Результат = Выборка.ДокументОснование;
		КонецЕсли;
		
	Иначе
		
		Результат = МетодСервера(, "ЗначениеРеквизитаОбъекта", СчетФактура, "ДокументОснование");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВозвратТоваровОтКлиента(СсылкаНаОбъект) Экспорт
		
	Возврат (НЕ Метаданные.Документы.Найти("ВозвратТоваровОтПокупателя") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
		
КонецФункции

Функция ЭтоВыбытиеИзОборотаМаркируемойПродукции(ДокументСсылка) Экспорт
		
	Возврат Неопределено;
		
КонецФункции

#Область ПараметрыИНастройкиИнформационнойБазы

Функция МенеджерИнтеграции_ОписанияПодсистемКонфигурации()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОписанияПодсистемКонфигурации");
	Возврат Результат;
	
КонецФункции

Функция ЕстьШтрихкодыУпаковок(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") <> Неопределено);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

// Список возможных идентификаторов правил обработки входящих документов.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ИдентификаторыПравилОбработкиДокументов()
	
	ЗначенияПеречисления = Новый Массив;
		
	ЗначенияПеречисления.Добавить("ПоступлениеТоваров");
	ЗначенияПеречисления.Добавить("СчетФактураПолученный");
	
	Результат = Новый Структура;
	
	Для Каждого Элемент Из ЗначенияПеречисления Цикл
		
		Результат.Вставить(Элемент, Элемент);
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Дополняет таблицу правил обработки актов об оказании услуг.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - правила обработки документов (см. ПравилаОбработкиВходящихДокументов);
//
Процедура ЗаполнитьПравилаОбработкиАктов(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	ДляПервичныхДокументов = Ложь;
	ВидДокумента = ВидыЭД.АктОбОказанииУслуг;
	
	// Товары, услуги, комиссия
	ДобавитьПравилоОбработкиДокументов(
		ПравилаОбработки,
		ИдентификаторыПравил.ПоступлениеТоваров,
		ВидДокумента,
		ДляПервичныхДокументов);
	
КонецПроцедуры

// Дополняет таблицу правил обработки товарных накладных.
//
Процедура ЗаполнитьПравилаОбработкиНакладных(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхДокументов = Ложь;
	ДляИсправительныхДокументов = Истина;
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	ВидДокумента = ВидыЭД.ТоварнаяНакладная;
	
	// Товары, услуги, комиссия
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеТоваров
		, ВидДокумента
		, ДляПервичныхДокументов);
			
КонецПроцедуры

// Дополняет таблицу правил обработки счетов-фактур и корректировочных счетов-фактур.
//
Процедура ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, ДляПервичныхИИсправительныхДокументов);
			
КонецПроцедуры

Функция ХозяйственнаяОперацияПоступленияТоваровПоУмолчанию()
	
	МетаданныеРеквизита = Метаданные.Документы.ПоступлениеТоваров.Реквизиты.ХозяйственнаяОперация;
	
	Результат = МетаданныеРеквизита.ЗначениеЗаполнения;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.ХозяйственныеОперации.ПоступлениеТоваров;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаполненияПоступленияТоваров()
	
	Магазин = ЗначениеНастроекПовтИсп.МагазинПоУмолчанию();
	Склад = ЗначениеНастроекПовтИсп.СкладПоступленияПоУмолчанию(Магазин, , , Пользователи.ТекущийПользователь());
	
	Результат = Новый Структура;
	Результат.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперацияПоступленияТоваровПоУмолчанию());
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("УчитыватьНДС", Истина);
	Результат.Вставить("Магазин", Магазин);
	Результат.Вставить("Склад", Склад);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияПоступленияТоваров(ДанныеЭД, ДополнительныеПараметры = Неопределено)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияПоступленияТоваров();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ИтогиТЧ = ДанныеЭД.Итоги;
	
	ДанныеДляЗаполнения = Новый Структура;
	
	Шапка = Новый Структура;
	
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	
	Шапка.Вставить("СуммаДокумента", ИтогиТЧ.СуммаСНДС);
	
	// Номера, даты
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	Шапка.Вставить("ХозяйственнаяОперация", ПараметрыЗаполнения.ХозяйственнаяОперация);
	Шапка.Вставить("ЦенаВключаетНДС", ПараметрыЗаполнения.ЦенаВключаетНДС);
	Шапка.Вставить("УчитыватьНДС", ПараметрыЗаполнения.УчитыватьНДС);
	Шапка.Вставить("Магазин", ПараметрыЗаполнения.Магазин);
	Шапка.Вставить("Склад", ПараметрыЗаполнения.Склад);
	
	ФорматЭлектронногоДокумента = ДанныеЭД.ЭлектронныйДокумент.Формат;
	
	// Табличная часть
	Товары = Документы.ПоступлениеТоваров.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	
	// Маркировка
	ШтрихкодыУпаковок = НоваяТаблицаШтрихкодыУпаковок();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл
		
		НоменклатураИБ = Стр.Номенклатура;
		
		НоваяСтрока = Товары.Добавить();
		
		НоваяСтрока.Номенклатура	 = НоменклатураИБ.Номенклатура;
		НоваяСтрока.Характеристика	 = НоменклатураИБ.Характеристика;
		НоваяСтрока.Упаковка		 = НоменклатураИБ.Упаковка;
		
		НоваяСтрока.НомерГТД = НомерГТДПоДаннымЭлектронногоДокумента(Стр.ДанныеГТД);
		
		ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = СтавкаНДСПоПредставлению(ПредставлениеСтавки, ШапкаЭД.Дата);
		
		НоваяСтрока.Количество	 = Стр.Количество;
		НоваяСтрока.СуммаНДС	 = Стр.СуммаНДС;
		
		Если НоваяСтрока.Количество = 0 Тогда
			НоваяСтрока.Количество = 1;
			Если НоваяСтрока.Цена = 0 Тогда
				НоваяСтрока.Цена = НоваяСтрока.Сумма;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыЗаполнения.ЦенаВключаетНДС Тогда
			НоваяСтрока.Сумма = Стр.СуммаСНДС;
			НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
		Иначе
			НоваяСтрока.Сумма = Стр.СуммаБезНДС;
			НоваяСтрока.Цена = Стр.Цена;
		КонецЕсли;
		
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		Если ЗначениеЗаполнено(НоваяСтрока.Упаковка) Тогда
			ТекКоэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Упаковка, "Коэффициент");
		Иначе
			ТекКоэффициент = 1;
		КонецЕсли;
		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * ТекКоэффициент;
		
		ДополнитьТаблицуШтрихкодов(
			ШтрихкодыУпаковок,
			Стр.СведенияОМаркировке,
			Стр.НоменклатураКонтрагента.GTIN);
		
	КонецЦикла;
		
	ДанныеДляЗаполнения.Вставить("Шапка"	, Шапка);
	ДанныеДляЗаполнения.Вставить("Товары"	, Товары);
	ДанныеДляЗаполнения.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

Процедура ЗаполнитьПоступлениеТоваров(ДокументОбъект, ДанныеДляЗагрузки)
	
	ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.УстановитьНовыйНомер();
	
	// вручную переопределим, если требуется
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ЗаполнитьБанковскиеСчета(ДокументОбъект);
			
	ДокументОбъект.Товары.Загрузить(ДанныеДляЗагрузки.Товары);
	
	Если ДанныеДляЗагрузки.Свойство("ШтрихкодыУпаковок")
		И ЕстьШтрихкодыУпаковок(ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДляЗагрузки.ШтрихкодыУпаковок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьБанковскиеСчета(ДокументОбъект)
	
	Организация = ДокументОбъект.Организация;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ДокументОбъект.БанковскийСчетОрганизации = 
			ЗначениеНастроекВызовСервера.БанковскийСчетОрганизацииПоУмолчанию(Организация, , ДокументОбъект.БанковскийСчетОрганизации);
	КонецЕсли;
	
	Контрагент = ДокументОбъект.Контрагент;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ДокументОбъект.БанковскийСчетКонтрагента = 
			ЗначениеНастроекВызовСервера.БанковскийСчетКонтрагентаПоУмолчанию(Контрагент, ДокументОбъект.БанковскийСчетКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыЗаполненияСчетаФактуры()
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументОснование", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияСчетаФактуры(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияСчетаФактуры();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ИтогиТЧ = ДанныеЭД.Итоги;
	
	// Основания счета-фактуры
	ДокументыОснования = ПараметрыЗаполнения.ДокументОснование;
	Если Не ЗначениеЗаполнено(ДокументыОснования) Тогда
		ИдентификаторЭД = ДанныеЭД.ЭлектронныйДокумент.Идентификатор;
		ДокументыОснования = СопоставленныеУчетныеДокументы(ИдентификаторЭД);
	КонецЕсли;
	
	Шапка = Новый Структура;
	
	// Даты, номера
	Шапка.Вставить("Номер", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаСоставления", ШапкаЭД.Дата);
	Шапка.Вставить("Дата", ТекущаяДатаСеанса());
			
	НомерИсправления = СвойствоСтруктуры(ШапкаЭД, "НомерИсправления");
	ДатаИсправления  = СвойствоСтруктуры(ШапкаЭД, "ДатаИсправления");
	
	Если ЗначениеЗаполнено(НомерИсправления) Тогда
		Шапка.Вставить("Исправление", Истина);
		Шапка.Вставить("НомерИсправления", НомерИсправления);
		Шапка.Вставить("ДатаИсправления",  ДатаИсправления);
	КонецЕсли;
	
	// Участники сделки
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
			
	Шапка.Вставить("ТипСчетаФактуры", Перечисления.ТипыПолученныхСчетовФактур.НаПоступление);
	Шапка.Вставить("КодВидаОперации", КодВидаОперацииСчетаФактурыПолученного(ДокументыОснования));
	
	Шапка.Вставить("ПолученВЭлектронномВиде", Истина);
	
	Если ЗначениеЗаполнено(ДанныеЭД.Шапка.Валюта.Код) Тогда
		СтрокаКлассификатора = ВалютаПоОбщероссийскомуКлассификатору(ДанныеЭД.Шапка.Валюта.Код);
		ВалютаСтрокой = СтрокаКлассификатора.CodeSymbol;
	Иначе
		ВалютаСтрокой = ВалютаСчетаФактурыПоУмолчанию();
	КонецЕсли;
		
	Шапка.Вставить("Валюта", ВалютаСтрокой);
					
	ДанныеОбъекта = Новый Структура;
	
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("ДокументыОснования", ДокументыОснования);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьСчетФактуруПолученный(ДокументОбъект, ДанныеДляЗагрузки)
	
	ДанныеШапки = ДанныеДляЗагрузки.Шапка;
	
	ДокументОбъект.Заполнить(ДанныеШапки);
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеШапки);
	
	Если ЗначениеЗаполнено(ДанныеДляЗагрузки.ДокументыОснования) Тогда
		
		ДокументОбъект.ДокументыОснования.Очистить();
		
		Для каждого ДокументОснование Из ДанныеДляЗагрузки.ДокументыОснования Цикл
			
			НоваяСтрокаТЧ = ДокументОбъект.ДокументыОснования.Добавить();
			НоваяСтрокаТЧ.ДокументОснование = ДокументОснование; 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнениеЗначенийРеквизитовШапки(ТекущийОбъект, ДанныеЗаполнения)
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ОбъектМетаданных = ТекущийОбъект.Метаданные();
	
	Для Каждого Строка Из ДанныеЗаполнения Цикл
		
		Если ЗначениеЗаполнено(Строка.Ключ) И ЕстьРеквизитМетаданных(ОбъектМетаданных, Строка.Ключ) Тогда
			Если ТекущийОбъект[Строка.Ключ] <> Строка.Значение Тогда
				ТекущийОбъект[Строка.Ключ] = Строка.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КодВидаОперацииСчетаФактурыПолученного(ДокументыОснования)
	
	Если Не ЗначениеЗаполнено(ДокументыОснования) Тогда
		Основание = Неопределено;
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("Массив") Тогда
		Основание = ДокументыОснования[0];
	Иначе
		Основание = ДокументыОснования;
	КонецЕсли;
	
	КодВидаОперации = "";
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		КодВидаОперации = "03";
	Иначе
		КодВидаОперации = "01";
	КонецЕсли;
	
	Возврат КодВидаОперации;
	
КонецФункции

// Номера ГТД

Функция НомерГТДПоДаннымЭлектронногоДокумента(ДанныеГТД)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеГТД) Тогда
		
		ПолучитьНомераГТД(ДанныеГТД);
		
		Результат = ДанныеГТД[0].НомерГТД.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает элементы справочника НомераГТД
//
// Параметры:
//  ДанныеГТД - Массив - содержит структуры с ключами:
//    * СтранаПроисхождения - Структура - см. НовыйКлючевыеСвойстваСтранаМира;
//       ** Ссылка - СправочникСсылка.СтраныМира
//       ** Код - Строка - код по ОКСМ
//    * НомерГТД - Структура - см. НовыйКлючевыеСвойстваГТД:
//       ** Ссылка - СправочникСсылка.НомераГТД
//       ** РегистрационныйНомер - Строка
//
Процедура ПолучитьНомераГТД(ДанныеГТД)
	
	Для Каждого Элемент Из ДанныеГТД Цикл 
		
		Если ЗначениеЗаполнено(Элемент.НомерГТД.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерТаможеннойДекларации	= Элемент.НомерГТД.РегистрационныйНомер;
		СтранаПроисхождения 		= Элемент.СтранаПроисхождения.Ссылка;
		
		Элемент.НомерГТД.Ссылка = НайтиСоздатьНомерГТД(НомерТаможеннойДекларации, СтранаПроисхождения);
		
	КонецЦикла;
	
КонецПроцедуры

// Получает ссылку на элемент справочника НомераГТД по номеру таможенной декларации.
// Если элемента с заданным номером ТД нет, создает новый.
//
// Параметры:
//  НомерТаможеннойДекларации - Строка - номер таможенной декларации;
//  СтранаПроисхождения - СправочникСсылка.СтраныМира - страна происхождения.
// 
// Возвращаемое значение:
//  СправочникСсылка.НомераГТД
//
Функция НайтиСоздатьНомерГТД(НомерТаможеннойДекларации, СтранаПроисхождения)
	
	Если Не ЗначениеЗаполнено(НомерТаможеннойДекларации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НомераГТД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НомераГТД КАК НомераГТД
	|ГДЕ
	|	НомераГТД.Код = &НомерТаможеннойДекларации
	|	И НомераГТД.СтранаПроисхождения = &СтранаПроисхождения
	|	И НЕ НомераГТД.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НомерТаможеннойДекларации"	, НомерТаможеннойДекларации);
	Запрос.УстановитьПараметр("СтранаПроисхождения"			, СтранаПроисхождения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Код");
		ЗначенияЗаполнения.Вставить("СтранаПроисхождения");
		ЗначенияЗаполнения.Вставить("РегистрационныйНомерДекларации");
		ЗначенияЗаполнения.Вставить("СтранаВвозаНеРФ");
		ЗначенияЗаполнения.Вставить("ПорядковыйНомерТовара");
		
		РеквизитыТД = Справочники.НомераГТД.РегистрационныйНомерИСтранаВвоза(НомерТаможеннойДекларации);
		
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, РеквизитыТД);
		ЗначенияЗаполнения.Код = НомерТаможеннойДекларации;
		ЗначенияЗаполнения.СтранаПроисхождения = СтранаПроисхождения;
		
		НомерГТД = Справочники.НомераГТД.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НомерГТД, ЗначенияЗаполнения);
		
		Попытка
			
			НомерГТД.Записать();
			Результат = НомерГТД.Ссылка;
			
		Исключение
			
			Ошибка = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаЗагрузка()
				, УровеньЖурналаРегистрации.Ошибка
				, НомерГТД.Метаданные()
				,
				, ПодробноеПредставлениеОшибки(Ошибка));
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита)
	
	Результат = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ИмяСобытияЖурналаЗагрузка()
	
	Результат = НСтр("ru = 'Диадок'; en = 'Diadoc'");
	Возврат Результат;
	
КонецФункции

Функция ВалютаПоОбщероссийскомуКлассификатору(ВалютаКод)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Code"		, "");
	Результат.Вставить("CodeSymbol"	, "");
	Результат.Вставить("Name"		, "");
	Результат.Вставить("Description", "");
	
	КлассификаторXML = ПолучитьОбщийМакет("ОбщероссийскийКлассификаторВалют").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	СтрокаТаблицыКлассификатора = КлассификаторТаблица.Найти(ВалютаКод, "Code");
	
	Если СтрокаТаблицыКлассификатора <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, СтрокаТаблицыКлассификатора);
	КонецЕсли;
	
	Возврат СтрокаТаблицыКлассификатора;
	
КонецФункции

Функция ВалютаСчетаФактурыПоУмолчанию()
	
	МетаданныеРеквизита = Метаданные.Документы.СчетФактураПолученный.Реквизиты.Валюта;
	
	Результат = МетаданныеРеквизита.ЗначениеЗаполнения;
			
	Возврат Результат;
	
КонецФункции

Функция СсылкаНаУчастникаСделки(СвойстваИлиМассив)
	
	Результат = МетодСервера(
		"Модуль_ИнтеграцияУниверсальный",
		"СсылкаНаУчастникаЭДО",
		СвойстваИлиМассив
	);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОберткиДляВызоваУниверсальныхМетодов

Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьРеквизитМетаданных", ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты);
	
КонецФункции

Функция ИмяКолонкиКодТовара()
	
	ЗначениеКонстанты = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	Если ЗначениеКонстанты = ПредопределенноеЗначение("Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул") Тогда
		Результат = "Артикул";
	Иначе
		Результат = "Код";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидыЭлектронныхДокументов()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ВидыЭлектронныхДокументов");
	
КонецФункции

Процедура ДобавитьВидДокументаДляОбмена(ВидыДокументов, ОбъектМетаданных, ВидЭД, Ограничения = Неопределено, ПравилоКонвертацииСвойств = Неопределено)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьВидДокументаДляОбмена"
				, ВидыДокументов
				, ОбъектМетаданных
				, ВидЭД
				, Ограничения
				, ПравилоКонвертацииСвойств);
	
КонецПроцедуры

Функция СвойствоСтруктуры(СложнаяСтруктура, ПолныйКлюч, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СвойствоСтруктуры"
					, СложнаяСтруктура
					, ПолныйКлюч
					, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция СопоставленныеУчетныеДокументы(ИдентификаторЭД)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СопоставленныеУчетныеДокументы", ИдентификаторЭД);
	
	Возврат Результат;
	
КонецФункции

// Добавляет новую запись в таблицу правил обработки электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - см. ПравилаОбработкиВходящихДокументов;
//  ИдентификаторПравила - Строка - идентификатор правила обработки документов;
//  ВидДокумента		 - Строка - вид документа, к которому относится правило (см. ВидыЭлектронныхДокументов);
//  ДляИсправлений		 - Булево, Неопределено - Ложь, если правило действует только для первичной версии документа;
//                                            Истина, если правило действует для только для исправленной версии документа;
//                                            Неопределено, если правило действует только для первичной и исправительной версий документа;
//
Процедура ДобавитьПравилоОбработкиДокументов(ПравилаОбработки, ИдентификаторПравила, ВидДокумента, ДляИсправлений)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьПравилоОбработкиДокументов"
		, ПравилаОбработки
		, ИдентификаторПравила
		, ВидДокумента
		, ДляИсправлений);
	
КонецПроцедуры

Функция НоваяТаблицаШтрихкодыУпаковок()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяТаблицаШтрихкодыУпаковок");
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, СведенияОМаркировке, GTIN = "")
	
	МетодСервера(
		"Модуль_ИнтеграцияУниверсальный",
		"ДополнитьТаблицуШтрихкодов",
		ШтрихкодыУпаковок,
		СведенияОМаркировке,
		GTIN);
	
КонецПроцедуры

Функция НовыеСвойстваНоменклатурыИБ() Экспорт
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваНоменклатурыИБ");
	
	Возврат Результат;
	
КонецФункции

Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Возврат МетодСервера(, "СравнитьВерсии", СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции

#КонецОбласти

#Область ПодготовкаСпискаИсходящихДокументов

Функция ПодготовитьВТДляСпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц = Новый Массив;
		
	Возврат МассивВременныхТаблиц;
	
КонецФункции

#КонецОбласти

Функция ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного() Экспорт
	
	Возврат "";
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура			 - ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат		 = Неопределено;
	
	Возврат Результат;
	
КонецФункции

