////////////////////////////////////////////////////////////////////////////////
// Методы для работы с Аутентификацией 
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Контекст текущего запроса авторизации
&НаКлиенте
Перем
КодУстройстваЛок,
ОписаниеОповещенияЗакрытияЛок;

// Служебные свойства
&НаКлиенте
Перем
КлиентСтдЛок, // Библиотека СтдСтр
ГенераторQrЛок; // Генератор для генерации qr

// Служебные
&НаСервере
Перем 
АутентификаторЛок;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект_ = Объект_();
	ЭтоВнешняяОбработка = Объект_._ЭтоВнешняяОбработка();
	КомпонентаГенерацииQrЕсть = Объект_._КомпонентаГенератораQrЕсть(); 
		
	КонфигурацияПровайдера = Объект_._КонфигурацияПровайдераПоУмолчанию();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьОпциональнойГиперссылки();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Асинхронно получает сессию из хранилища или обновляет её.
// 
// Возвращает:
//  - Валидную сессию из хранилища, если она актуальна.
//  - Обновлённую сессию, если токен обновления доступен и сессия устарела.
//  - Неопределено, если сессию не удалось получить или обновить.
//
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения, ФиксированнаяСтруктура - Обработчик завершения получения сессии.
//                                            Результат: ФиксированнаяСтруктура (см. Аутентификатор.МодельОтветТокен).
//
&НаКлиенте
Процедура НачатьПолучениеСессии(ОписаниеОповещения) Экспорт	
	
	Если Открыта() Тогда
		ВызватьИсключение "Ошибка: Форма должна быть закрыта";	
	КонецЕсли;
	
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОписаниеОповещенияЗакрытияЛок = ОписаниеОповещения;
		
	Сессия = Сессия();
	Если Сессия = Неопределено Тогда
		ПодключитьОбработчикОжидания("ПродолжитьПолучениеСессииАсинх", Таймаут01(), Истина);
		Открыть();
	Иначе
		СтдЛок().ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияЗакрытияЛок, Сессия);
	КонецЕсли;	
	
КонецПроцедуры

// Инициирует асинхронное обновление сессии с использованием токена обновления.
//
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения, ФиксированнаяСтруктура - Обработчик, вызываемый по завершении обновления 
//												сессии. Результат содержит обновлённые данные сессии.
//
&НаКлиенте
Процедура НачатьОбновлениеСессии(ОписаниеОповещения) Экспорт
	
	ОписаниеОповещенияЗакрытияЛок = ОписаниеОповещения;
	
	ПродолжитьОбновлениеСессии();
	
КонецПроцедуры

// Делает отзыв токена, сессия при этом остается живой.
//
&НаКлиенте
Процедура ЗавершитьСессию() Экспорт
	
	ЗавершитьСессиюНаСервере();
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанного объекта метаданных в качестве хранилища сессий.
//
// Параметры:
//  Значение - Строка - Имя объекта метаданных, используемого как хранилище сессий.
//                     Допустимые значения: "Обработка", "Справочник", "РегистрСведений", "ОбщийМодуль".
//
&НаКлиенте
Процедура УстановитьХранилищеСессий(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		ВызватьИсключение "Ошибка установки хранилища сессий: Неопределенный тип хранилища сессией";	
	КонецЕсли;
	
	ХранилищеСессий = Значение;	
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанной конфигурации приложения.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация приложения.
//                                     См. МодельКонфигурацияПриложения.
//
&НаКлиенте
Процедура УстановитьКонфигурациюПриложения(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации приложения: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	ПроверитьКонфигурациюПриложения(Значение);
	
	КонфигурацияПриложения = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанной конфигурации провайдера.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация провайдера.
//                                     См. МодельКонфигурацияПровайдера.
//
&НаКлиенте
Процедура УстановитьКонфигурациюПровайдера(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации провайдера: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	ПроверитьКонфигурациюПровайдера(Значение);
	
	КонфигурацияПровайдера = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования отбора сессий.
//
// Параметры:
//  Значение - Произвольный - Модель зависит от реализации хранилища.
//
&НаКлиенте
Процедура УстановитьОтборСессий(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		ВызватьИсключение "Пустое значение отбора сессией";	
	КонецЕсли;
	
	ОтборСессий = Значение;	
	
КонецПроцедуры

// Устанавливает свойство формы для генерации QR-кода средствами приложения
//
// Параметры:
//  Значение - Произвольный - клиентский генератор QR-кода приложения.
//
&НаКлиенте
Процедура УстановитьГенераторQr(Значение) Экспорт

	Если Значение = Неопределено Тогда
		ВызватьИсключение "Пустое значение генератора QR-кода";	
	КонецЕсли;
	
	ГенераторQrЛок = Значение;
	
КонецПроцедуры

// Возвращает контракт конфигурации приложения.
//
// Возвращаемое значение:
//  Структура - Описание конфигурации приложения.
//
&НаКлиенте
Функция МодельКонфигурацияПриложения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("Ключ");
	Результат.Вставить("Разрешения");
	Результат.Вставить("ПроверятьАктуальностьТокена", Ложь);
	Результат.Вставить("Опции", МодельОпции());
	
	Возврат Результат;
	
КонецФункции

// Возвращает контракт конфигурации провайдера.
//
// Возвращаемое значение:
//  Структура - Описание конфигурации провайдера.
//
&НаКлиенте
Функция МодельКонфигурацияПровайдера() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Хост");
	Результат.Вставить("Тип");
	
	Возврат Результат;
	
КонецФункции

// Собирает ключ объекта аутентификатора по конифгурации приложения и конфигурации провайдера.
//
// Возвращаемое значение:
//	Строка - ключ объекта аутентификатора.
//
&НаКлиенте
Функция СобратьКлючОбъекта() Экспорт
			
	Возврат СобратьКлючОбъектаНаСервере();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоСсылке(Команда)
	
	БуферОбмена = СтдЛок().Стр().СтрШаблонЛок("
		|<!DOCTYPE html>
		|<html>
		|	<body onload='copy()'>
		|		<input id='input' type='text'/>
		|		<script>
		|			function copy() {
		|				var text = '%1';
		|				var ua = navigator.userAgent;
		|				if (ua.search(/MSIE/) > 0 || ua.search(/Trident/) > 0) {
		|					window.clipboardData.setData('Text', text);
		|				} else {
		|					var copyText = document.getElementById('input');
		|					copyText.value = text;
		|					copyText.select();
		|					document.execCommand('copy');
		|				}
		|			}
		|		</script>
		|	</body>
		|</html>", 
		СсылкаАвторизации);    

	ПоказатьОповещениеПользователя("Ссылка готова",, "Ссылка для авторизации скопирована в буфер обмена");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоQRКоду(Команда)
	
	Элементы.ГруппаОсновная.Видимость = Ложь;
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаВходаПоQR.Видимость = Истина;
	
	СгенерироватьQrКод(СсылкаАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура НазадИзОжидания(Команда)
	
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НазадИзQR(Команда)
	
	Элементы.ГруппаВходаПоQR.Видимость = Ложь;
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НазадИзОтказа(Команда)
	
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВойтиЧерезБраузер(Команда)
			
	Сессия = Сессия();
	Если Сессия = Неопределено Тогда
		ПодключитьОбработчикОжидания("ПродолжитьПолучениеСессииАсинх", Таймаут01(), Истина);
		Элементы.ГруппаОсновная.Видимость = Ложь;
		Элементы.ГруппаОжидания.Видимость = Истина;
	Иначе
		СтдЛок().ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияЗакрытияЛок, Сессия);
	КонецЕсли;	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПродолжитьПолучениеСессииАсинх()
	
	ПродолжитьПолучениеСессии();
	ПроверитьТокенАсинх();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеСессии()

	КодУстройстваЛок = КодУстройства();
	СсылкаАвторизации = КодУстройстваЛок.СсылкаАвторизации;	
	
	Попытка
		ПерейтиПоНавигационнойСсылке(СсылкаАвторизации);
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;	
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСсылкаНаАвторизацию;
	ПодключитьОбработчикОжидания("ВыделитьТекстСсылки", Таймаут01(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьТекстСсылки()

	Элементы.СсылкаАвторизации.УстановитьГраницыВыделения(1, СтрДлина(СсылкаАвторизации) + 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТокенАсинх()
	
	Попытка
		Результат = ПроверитьТокенНаСервере(КодУстройстваЛок, ОтборСессий.КлючНастроек);
	Исключение
		Результат = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если ТипЗнч(Результат) = Тип("ФиксированнаяСтруктура") 
		И Результат.ТокенДоступа = Неопределено Тогда
		ПодключитьОбработчикОжидания("ПроверитьТокенАсинх", КодУстройстваЛок.Интервал, Истина);
	ИначеЕсли ТипЗнч(Результат) = Тип("ИнформацияОбОшибке") Тогда
		Если СтдЛок().Стр().СтрНайтиЛок(Результат.Описание, "access_denied") > 0 Тогда
			ПоказатьГруппуОтказ();
		Иначе
			ВызватьИсключение Результат.Описание;
		КонецЕсли;
	Иначе
		Оповещение = СтдЛок().ОбщегоНазначения().ОписаниеОповещения("НачатьПолучениеСессииЗавершение", ЭтотОбъект);
		СтдЛок().ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(Оповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСессииЗавершение(Результат, ДопПараметры) Экспорт
		
	КодУстройстваЛок = Неопределено;	
	
	СтдЛок().ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияЗакрытияЛок, Результат);
	
	Если Открыта() Тогда
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбновлениеСессии()
	
	Результат = ОбновитьСессиюНаСервере();

	СтдЛок().ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияЗакрытияЛок, Результат);
	
	Если Открыта() Тогда
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтдЛок()
	
	Если КлиентСтдЛок = Неопределено Тогда	
		Если ЭтоВнешняяОбработка Тогда
			КлиентСтдЛок = ПолучитьФорму("ВнешняяОбработка.КонтурДиадокСтд.Форма.Клиент");
		Иначе
			КлиентСтдЛок = ПолучитьФорму("Обработка.КонтурДиадокСтд.Форма.Клиент");	
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлиентСтдЛок;                          
	
КонецФункции

&НаКлиенте
Процедура ПроверитьКонфигурациюПриложения(Значение)
		
	Результат = ПроверитьКоллекцию(МодельКонфигурацияПриложения(), Значение);
	
	Если Результат.Количество() Тогда
		Ошибки = СтдЛок().Стр().СтрСоединитьЛок(Результат, ", ");
		Сообщение = СтдЛок().Стр().СтрШаблонЛок("При проверке конфигурации приложения обнаружены ошибки: %1", Ошибки);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонфигурациюПровайдера(Значение)
	
	Результат = ПроверитьКоллекцию(МодельКонфигурацияПровайдера(), Значение);
	
	Если Результат.Количество() Тогда
		Ошибки = СтдЛок().Стр().СтрСоединитьЛок(Результат, ", ");
		Сообщение = СтдЛок().Стр().СтрШаблонЛок("При проверке конфигурации провайдера обнаружены ошибки: %1", Ошибки);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКоллекцию(Модель, Коллекция)
	
	Ошибки = Новый Массив;
	Для Каждого Элемент Из Модель Цикл
		Если Элемент.Ключ = "Опции" Тогда
			Продолжить;
		КонецЕсли;
		Если Коллекция.Свойство(Элемент.Ключ) = Ложь Тогда
				Ошибки.Добавить(СтдЛок().Стр().СтрШаблонЛок("Не найден ключ: %1", Элемент.Ключ));
				Продолжить;
		КонецЕсли;                                        
		Если ЗначениеКоллекцииЗаполнено(Коллекция[Элемент.Ключ]) = Ложь Тогда
				Ошибки.Добавить(СтдЛок().Стр().СтрШаблонЛок("Пустое значение ключа: %1", Элемент.Ключ));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

&НаКлиенте
Функция ГенераторQrЛок(Ссылка)
	
	Если ГенераторQrЛок = Неопределено И КомпонентаГенерацииQrЕсть Тогда
		Если ЭтоВнешняяОбработка Тогда
			ГенераторQrЛок = ПолучитьФорму("ВнешняяОбработка.КонтурДиадокАутентификатор.Форма.ГенераторQr");
		Иначе
			ГенераторQrЛок = ПолучитьФорму("Обработка.КонтурДиадокАутентификатор.Форма.ГенераторQr");	
		КонецЕсли;	
	КонецЕсли;

	ГенераторQrЛок.УстановитьЗначениеКода(Ссылка);
	
	Возврат ГенераторQrЛок;
	
КонецФункции

&НаКлиенте
Процедура СгенерироватьQrКод(Ссылка)
	
	Попытка
		ГенераторQrЛок(Ссылка).НачатьСоздатьКод(_ОповещениеОЗавершенииГенерацииQrКода());
	Исключение
		УстановитьВидимостьПанелиВыбораДействий(Ложь);	
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Функция _ОповещениеОЗавершенииГенерацииQrКода() Экспорт
	
	Возврат СтдЛок().ОбщегоНазначения().ОписаниеОповещения("_ПослеГенерацииQrКода", ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура _ПослеГенерацииQrКода(ДвоичныеДанные, ДопПараметры) Экспорт
	
	Если ДвоичныеДанные = Неопределено Тогда
		УстановитьВидимостьПанелиВыбораДействий(Ложь);
	Иначе
		КартинкаQrКод = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		УстановитьВидимостьПанелиВыбораДействий(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГруппуОтказ()
	
	Элементы.ГруппаОтказ.Видимость = Истина;
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаВходаПоQR.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьТокенНаСервере(Знач ЗапросТокена, Знач КлючНастроек)

	Если ТекущаяУниверсальнаяДата() >= ЗапросТокена.УниверсальнаяДатаОкончания Тогда
		ВызватьИсключение "TimeoutError: вышло время ожидания подтверждения запроса";
	КонецЕсли;
	
	Сессия = Аутентификатор()._НоваяСессия(ЗапросТокена.Код);	
	Возврат Сессия;
	
КонецФункции

&НаСервере
Функция Сессия()
		
	Возврат Аутентификатор().ПолучитьСессию();
		
КонецФункции

&НаСервере
Процедура ЗавершитьСессиюНаСервере()

	Аутентификатор().ЗавершитьСессию();
	
КонецПроцедуры

&НаСервере
Функция КодУстройства()

	Возврат Аутентификатор()._НовыйКодУстройства();
	
КонецФункции

&НаСервере
Функция ОбновитьСессиюНаСервере()
	
	Сессия = Сессия();
	Возврат Аутентификатор().ОбновитьСессию(Сессия);
	
КонецФункции

&НаСервере
Функция Аутентификатор()
	
	Если АутентификаторЛок = Неопределено Тогда
		АутентификаторЛок = Объект_();
	КонецЕсли;
	
	АутентификаторЛок.УстановитьХранилищеСессий(ХранилищеСессий);
	АутентификаторЛок.УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
	АутентификаторЛок.УстановитьКонфигурациюПровайдера(КонфигурацияПровайдера);
	АутентификаторЛок.УстановитьОтборСессий(ОтборСессий);
	
	Возврат АутентификаторЛок;
	
КонецФункции

&НаСервере
Функция Объект_()
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ЭтотОбъект;
	#Иначе
		Возврат РеквизитФормыВЗначение("Объект");
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция СобратьКлючОбъектаНаСервере()

	Аутентификатор = Объект_();
	Аутентификатор.УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
	Аутентификатор.УстановитьКонфигурациюПровайдера(КонфигурацияПровайдера);
	
	Возврат Аутентификатор.СобратьКлючОбъекта();
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьПанелиВыбораДействий(Значение)

	Элементы.ГруппаПанельВыборДействия1.Видимость = Значение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеКоллекцииЗаполнено(Значение)
	
	ТипЗнч = ТипЗнч(Значение);
	
	Если ТипЗнч = Тип("Строка") Тогда
		Результат = Значение <> "";
	ИначеЕсли ТипЗнч = Тип("Массив") Тогда
		Результат = Значение.Количество() > 0;
	ИначеЕсли Значение = Неопределено Тогда
		Результат = Ложь;
	ИначеЕсли ТипЗнч = Тип("Булево") Или ТипЗнч = Тип("Число") Тогда
		Результат = Истина;
	Иначе
		ВызватьИсключение "Неопределенный ключ конфигурации";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Таймаут01()
	
	Возврат 0.1;
	
КонецФункции

// Возвращает контракт опций конифгурации приложения
//
// Возвращаемое значение:
//	- Структура:
// Ссылка - Строка - Наименование опциональной гиперссылки на основной форме. Необязательный
// ПредставлениеСсылки - Строка - Адрес перехода по опциональной ссылке на форме. Необязательный
//
&НаКлиентеНаСервереБезКонтекста
Функция МодельОпции()

	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("ПредставлениеСсылки");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОпциональнаяГиперссылкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке(КонфигурацияПриложения.Опции.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьОпциональнойГиперссылки()
	 
	ОпцияЕсть = КонфигурацияПриложения.Свойство("Опции")
		И КонфигурацияПриложения.Опции.Свойство("ПредставлениеСсылки")
		И КонфигурацияПриложения.Опции.Свойство("Ссылка")
		И ЗначениеЗаполнено(КонфигурацияПриложения.Опции.ПредставлениеСсылки)
		И ЗначениеЗаполнено(КонфигурацияПриложения.Опции.Ссылка);
		
	Элементы.ОпциональнаяГиперссылка.Видимость = ОпцияЕсть;
	Если ОпцияЕсть Тогда
		Элементы.ОпциональнаяГиперссылка.Заголовок = КонфигурацияПриложения.Опции.ПредставлениеСсылки;
	КонецЕсли;
	
КонецПроцедуры