// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

&НаКлиенте
Перем _МодульСтдСтрНаКлиенте;

&НаСервере
Перем _МодульСтдСтрНаСервере;

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа()
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

&НаКлиенте
Функция Модуль_СтдСтрНаКлиенте()
	
	Если _МодульСтдСтрНаКлиенте = Неопределено Тогда
		
		Если ЭтоВнешняяОбработка Тогда
			// BSLLS:GetFormMethod-off
			_МодульСтдНаКлиенте = ПолучитьФорму("ExternalDataProcessor.КонтурДиадокСтд.Форма.Клиент", , ЭтаФорма);
			_МодульСтдСтрНаКлиенте = ПолучитьФорму("ExternalDataProcessor.КонтурДиадокСтдСтр.Форма.Клиент", , ЭтаФорма);
			_МодульСтдСтрНаКлиенте.Инит(_МодульСтдНаКлиенте);
			// BSLLS:GetFormMethod-on
		Иначе
			_МодульСтдСтрНаКлиенте = Вычислить("КонтурДиадокСтдСтрКлиентСервер");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _МодульСтдСтрНаКлиенте;
	
КонецФункции

&НаСервере
Функция Модуль_СтдСтрНаСервере()
	
	Если _МодульСтдСтрНаСервере = Неопределено Тогда
		
		Если ЭтоВнешняяОбработка Тогда
			_МодульСтдСтрНаСервере = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтр");
		Иначе
			_МодульСтдСтрНаСервере = Вычислить("КонтурДиадокСтдСтрКлиентСервер");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _МодульСтдСтрНаСервере;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	Параметры.Свойство("ДокументЭДО", ДокументЭДО);
	
	Модуль = ОбработкаОбъект();
	
	ПроверяемыеСвойства = Новый Структура;
	ПроверяемыеСвойства.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПроверяемыеСвойства, Модуль);
	
	// BSLLS:UnusedLocalVariable-off
	ЭтоВнешняяОбработка = (ПроверяемыеСвойства.ИспользуемоеИмяФайла <> Неопределено);
	// BSLLS:UnusedLocalVariable-on
	
	ПроверитьПараметры();
	
	ЗаполнитьФорму();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПараметры()
	
	МодульСтдСтр = Модуль_СтдСтрНаСервере();
	
	Если ТипЗнч(ДокументЭДО) <> Тип("Структура") Тогда
		
		ШаблонОшибки = НСтр("ru='Неожиданный тип значения ДокументЭДО: %1'");
		ТекстОшибки = МодульСтдСтр.СтрШаблонЛок(
			ШаблонОшибки,
			ТипЗнч(ДокументЭДО)
		);
		
	ИначеЕсли НЕ ЭтоКонтрактДокументЭДО() Тогда
		
		ШаблонОшибки = НСтр("ru='Неожиданное значение ДокументЭДО: %1'");
		ТекстОшибки = МодульСтдСтр.СтрШаблонЛок(
			ШаблонОшибки,
			ТипЗнч(ДокументЭДО)
		);
		
	ИначеЕсли ДокументЭДО.Тип.ТипКонтента <> "utd970" Тогда
		
		ШаблонОшибки = НСтр("ru='Неожиданный тип контента: %1'");
		ТекстОшибки = МодульСтдСтр.СтрШаблонЛок(
			ШаблонОшибки,
			ДокументЭДО.Тип.ТипКонтента
		);
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ВызватьИсключение ТекстОшибки;
	
КонецПроцедуры

&НаСервере
Функция ЭтоКонтрактДокументЭДО()
	
	Результат = Истина;
	
	Ядро = Модуль_ЯдроНаСервере();
	Контракт_Документ = Ядро.Контракт_Документ();
	
	Для Каждого Элемент Из Контракт_Документ Цикл
		Если НЕ ДокументЭДО.Свойство(Элемент.Ключ) Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		Если ЗавершениеРаботы = Истина Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьВопросОСохраненииДанных();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	
	МодульСтдСтр = Модуль_СтдСтрНаСервере();
	
	AccompanyingDocuments = ДокументЭДО.СлужебнаяИнформация.Контент.AccompanyingDocuments;
	
	Для Каждого DocumentDetails970 Из AccompanyingDocuments Цикл
		
		Если DocumentDetails970.Name <> Конст_ИмяДокументаАСЧФ() Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = СведенияОбАвансах.Добавить();
		
		СтрокаТЧ.Date = DocumentDetails970.Date;
		СтрокаТЧ.Number = DocumentDetails970.Number;
		
		Если DocumentDetails970.Свойство("AdditionalInfo") Тогда
			
			AdditionalInfo = DocumentDetails970.AdditionalInfo;
			Попытка
				
				AdditionalInfo = СтрЗаменить(AdditionalInfo, "ИспАСЧФ № ", "");
				AdditionalInfo = СтрЗаменить(AdditionalInfo, " от ", ",");
				
				ВключатьПустые = Ложь;
				РеквизитыИсправления = МодульСтдСтр.СтрРазделитьЛок(AdditionalInfo, ",", ВключатьПустые);
				
				СтрокаТЧ.RevisionNumber = СокрЛП(РеквизитыИсправления[0]);
				СтрокаТЧ.RevisionDate = МодульСтдСтр.СтрокаВДатуЛок(СокрЛП(РеквизитыИсправления[1]));
				СтрокаТЧ.IsRevision = Истина;
				
			Исключение
				
				ШаблонСообщения = НСтр(
					"ru='Неожиданное значение DocumentDetails970.AdditionalInfo: %1
					|%2'"
				);
				
				ВидОперации = НСтр("ru='Диадок.Заполнение сведений об авансах'");
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				ТекстСообщения = МодульСтдСтр.СтрШаблонЛок(
					ШаблонСообщения,
					DocumentDetails970.AdditionalInfo,
					ТекстОшибки
				);
				
				Ядро = Модуль_ЯдроНаСервере();
				Ядро.Ошибка_Обработать(ВидОперации, ТекстСообщения);
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Конст_ИмяДокументаАСЧФ()
	Возврат "АСЧФ";
КонецФункции

&НаКлиенте
Процедура СведенияОбАвансахНомерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СведенияОбАвансах.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		МаксимальнаяДлинаЗначения = 255;
		ТекущиеДанные.Number = Лев(ТекущиеДанные.Number, МаксимальнаяДлинаЗначения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбАвансахRevisionDateПриИзменении(Элемент)
	
	УстановитьЗначениеЭтоИсправление();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбАвансахRevisionNumberПриИзменении(Элемент)
	
	УстановитьЗначениеЭтоИсправление();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеЭтоИсправление()
	
	ТекущиеДанные = Элементы.СведенияОбАвансах.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.IsRevision = (ЗначениеЗаполнено(ТекущиеДанные.RevisionDate)
			ИЛИ ЗначениеЗаполнено(ТекущиеДанные.RevisionNumber));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ОбработчикКомандыСохранить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОСохраненииДанных()
	
	Платформа = Модуль_Платформа();
	
	ТекстВопроса = "Данные были изменены. Сохранить изменения?";
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Платформа.НовыйОписаниеОповещения("ЗакрытиеФормыСведенийОбАвансахЗавершение", ЭтаФорма);
	
	Платформа.ПоказатьВопросЛок(Оповещение, ТекстВопроса, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыСведенийОбАвансахЗавершение(ОтветНаВопрос, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ОбработчикКомандыСохранить();
	Иначе
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКомандыСохранить()
	
	Отказ = Ложь;
	
	ПроверкаЗаполненияДанных(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	ЗаполнитьАвансИнфо970();
	
	Закрыть(ДокументЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансИнфо970()
	
	МодульСтдСтр = Модуль_СтдСтрНаКлиенте();
	
	AccompanyingDocuments = ДокументЭДО.СлужебнаяИнформация.Контент.AccompanyingDocuments;
	
	ОбратныйИндекс = AccompanyingDocuments.Количество() - 1;
	
	Пока ОбратныйИндекс >= 0 Цикл
		
		Элемент = AccompanyingDocuments[ОбратныйИндекс];
		Если Элемент.Name = Конст_ИмяДокументаАСЧФ() Тогда
			AccompanyingDocuments.Удалить(ОбратныйИндекс);
		КонецЕсли;
		
		ОбратныйИндекс = ОбратныйИндекс - 1;
		
	КонецЦикла;
	
	Для Каждого Элемент Из СведенияОбАвансах Цикл
		
		АвансИнфо = Новый Структура;
		АвансИнфо.Вставить("Name", Конст_ИмяДокументаАСЧФ());
		АвансИнфо.Вставить("Date", Элемент.Date);
		АвансИнфо.Вставить("Number", Элемент.Number);
		
		Если Элемент.IsRevision Тогда
			
			ШаблонСтроки = "ИспАСЧФ № %1 от %2";
			AdditionalInfo = МодульСтдСтр.СтрШаблонЛок(
				ШаблонСтроки,
				Формат(Элемент.RevisionNumber, "ЧГ=0"),
				Формат(Элемент.RevisionDate, "ДФ=dd.MM.yyyy")
			);
			
			АвансИнфо.Вставить("AdditionalInfo", AdditionalInfo);
			
		КонецЕсли;
		
		AccompanyingDocuments.Добавить(АвансИнфо);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияДанных(Отказ)
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из СведенияОбАвансах Цикл
		
		НетДатыНомераАванса = (НЕ ЗначениеЗаполнено(СтрокаТЧ.Date)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Number));
		
		НетДатыНомераИсправленияАванса = (СтрокаТЧ.IsRevision
			И (НЕ ЗначениеЗаполнено(СтрокаТЧ.RevisionDate)
				ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.RevisionNumber)));
		
		ДатаИсправленияМеньшеДатыАванса = (СтрокаТЧ.IsRevision
			И (СтрокаТЧ.RevisionDate < СтрокаТЧ.Date));
		
		Если НетДатыНомераАванса Тогда
			
			ШаблонСообщения = НСтр("ru = 'В строке %1 не заполнены поля в сведениях об авансах!'");
			Отказ = Истина;
			
		ИначеЕсли НетДатыНомераИсправленияАванса Тогда
			
			ШаблонСообщения = НСтр("ru = 'В строке %1 не заполнены поля в сведениях об исправлении авансов!'");
			Отказ = Истина;
			
		ИначеЕсли ДатаИсправленияМеньшеДатыАванса Тогда
			
			ШаблонСообщения = НСтр("ru = 'В строке %1 дата исправления меньше даты аванса!'");
			Отказ = Истина;
			
		Иначе
			
			НомерСтроки = НомерСтроки + 1;
			
			Продолжить;
			
		КонецЕсли;
		
		Если Отказ Тогда
			
			МодульСтдСтр = Модуль_СтдСтрНаКлиенте();
			
			ТекстСообщения = МодульСтдСтр.СтрШаблонЛок(
				ШаблонСообщения,
				НомерСтроки
			);
			
			Модуль_Платформа = Модуль_Платформа();
			Модуль_Платформа.ВывестиСообщениеПользователюЛок(ТекстСообщения, , ЭтаФорма);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
