// Открытие формы со списком онлайн счетов на оплату
//
// Параметры:
//  ФормаВладелец	 - Форма - Форма КлиентскиеВызовы Из Ядра
//
&НаКлиенте
Процедура ОткрытьФормуСчетовНаОплату(ФормаВладелец) Экспорт
	
	ФормаОбработки = ПолучитьФормуСчетовНаОплату(ФормаВладелец);
	
	ФормаОбработки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФормуСчетовНаОплату(ФормаВладелец) Экспорт
	
	ИмяОткрываемойФормы = "ФормаСчетовНаОплатуУправляемая";
	ТекущаяФорма = "КлиентскиеВызовы";
	ПолноеИмяОткрываемойФормы = СтрЗаменить(ЭтаФорма.ИмяФормы, ТекущаяФорма, ИмяОткрываемойФормы);	
	
	// BSLLS:GetFormMethod-off
	ФормаОбработки = ПолучитьФорму(ПолноеИмяОткрываемойФормы, , ФормаВладелец);
	// BSLLS:GetFormMethod-on
	
	Возврат ФормаОбработки;
	
КонецФункции
