////////////////////////////////////////////////////////////////////////////////
// Методы для работы с JSON
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
&НаКлиенте
Перем СтдКлиентЛок, ФункцииДоступныЛок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает преобразованные данные JSON
//
// Параметры:
//  Строка                       - Строка         - Строка, содержащая текст в формате JSON.
//  ПрочитатьВСоответствие       - Булево         - Если установлено Истина, чтение объекта JSON будет выполнено
//                                                  в Соответствие. Если установлено Ложь, объекты будут считываться
//                                                  в объект типа Структура.
//                                                  Примечание. При десериализации объектов JSON в структуру
//                                                  необходимо помнить о требованиях к ключам структуры.
//                                                  Если при десериализации объекта будет найдено имя свойства,
//                                                  недопустимое для ключа структуры, то будет вызвано исключение.
//                                                  Значение по умолчанию: Ложь.
//  ИменаСвойствСоЗначениямиДата - Массив, Строка - Массив, элементы которого содержат имена свойств JSON,
//                                                  для которых нужно вызывать восстановление даты из строки.
//  ОжидаемыйФорматДаты          - ФорматДатыJSON - Ожидаемый формат даты при десериализации объекта в формате JSON.
//  ИмяФункцииВосстановления     - Строка         - Данная функция вызывается при чтении каждого свойства и должна
//                                                  иметь следующие параметры:
//                                                  <Свойство> - значение типа Строка, указывается только
//                                                  при чтении объектов JSON,
//                                                  <Значение> - значение допустимого для сериализации типа,
//                                                  <ДополнительныеПараметры>.
//                                                  Возвращаемое значение - произвольного типа.
//                                                  Если данный параметр задан и не задан параметр
//                                                  <МодульФункцииВосстановления>, и наоборот, будет вызвано исключение
//                                                  Если функция не установлена, то при вызове метода ПрочитатьJSON
//                                                  параметр <ИменаСвойствСоЗначениямиДата> игнорируется.
//  МодульФункцииВосстановления  - Произвольный   - Указывает модуль, процедура которого будет
//                                                  использована для восстановления значения.
//  ДополнительныеПараметрыФункцииВосстановления  - Произвольный   - Дополнительные параметры, которые будут переданы
//                                                  в функцию восстановления значений.
//  ИменаСвойствДляОбработкиВосстановления - Массив - Массив имен свойств JSON, для которых будет вызвана
//                                                  функция восстановления. Параметр игнорируется, если не установлен
//                                                  параметр ИмяФункцииВосстановления.
// Возвращаемое значение:
//  Структура, Соответствие - преобразованные данные JSON в типы «1С:Предприятия».
//
&НаКлиенте
Функция ПрочитатьЗначение(Строка, ПрочитатьВСоответствие = Ложь, ИменаСвойствСоЗначениямиДата = Неопределено,
		ОжидаемыйФорматДаты = Неопределено, ИмяФункцииВосстановления = Неопределено,
		МодульФункцииВосстановления = Неопределено, ДополнительныеПараметрыФункцииВосстановления = Неопределено,
		ИменаСвойствДляОбработкиВосстановления = Неопределено) Экспорт
	
	Если ФункцииДоступны() Тогда
		Результат = ПлатформаПрочитатьJSON(
				Строка, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты, ИмяФункцииВосстановления,
				МодульФункцииВосстановления, ДополнительныеПараметрыФункцииВосстановления, ИменаСвойствДляОбработкиВосстановления);
	Иначе
		Результат = ПарсерПрочитатьJSON(
				Строка, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты, ИмяФункцииВосстановления,
				МодульФункцииВосстановления, ДополнительныеПараметрыФункцииВосстановления, ИменаСвойствДляОбработкиВосстановления);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПрочитатьЗначение

// Возвращает сериализованное значение в формат JSON
//
// Параметры:
//  Значение - Произвольный	 - Объект записи JSON. Меняет состояние потока записи.
//                             Представляет собой значение произвольного типа.
//
// Возвращаемое значение:
//  Строка - возвращает сериализованное <Значение> в формат JSON.
//
&НаКлиенте
Функция ЗаписатьЗначение(Значение) Экспорт
	
	Если ФункцииДоступны() Тогда
		Результат = ПлатформаЗаписатьJSON(Значение);
	Иначе
		Результат = ПарсерЗаписатьJSON(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗаписатьЗначение

// Возвращает преобразованную дату из строки прочитанной в JSON-формате
//
// Параметры:
//  Строка		 - Строка			 - Строка, которую требуется преобразовать в дату.
//  ФорматДаты	 - ФорматДатыJSON	 - Формат, в котором представлена дата в строке, подлежащей преобразованию.
//
// Возвращаемое значение:
//  Дата - преобразованная дата из строки.
//
&НаКлиенте
Функция ПрочитатьДатуJSONЛок(Строка, ФорматДаты = Неопределено) Экспорт
	
	Если ФункцииДоступны() Тогда
		Если ФорматДаты = Неопределено Тогда
			ФорматДаты = Вычислить("ФорматДатыJSON.ISO");
		КонецЕсли;
		Результат = Вычислить("ПрочитатьДатуJSON(Строка, ФорматДаты)");
	Иначе
		Результат = ПарсерПрочитатьДатуJSON(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПрочитатьДатуJSONЛок

// Возвращает преобразованную дату в строку для последующей записи в формат JSON.
// Формат записи даты ISO с локальной датой.
//
// Параметры:
//  Дата				 - Дата								 - Дата, которую надо преобразовать в формат JSON.
//  ФорматДаты			 - ФорматДатыJSON					 - Формат записываемой даты.
//  ВариантЗаписиДаты	 - ВариантЗаписиДатыJSON, Строка	 - Указывает используемый вариант записи даты JSON.
//
// Возвращаемое значение:
//  Строка - преобразованная дата в строку.
//
&НаКлиенте
Функция ЗаписатьДатуJSONЛок(Дата, ФорматДаты = Неопределено, ВариантЗаписиДаты = "ЛокальнаяДата") Экспорт
	
	Если ФункцииДоступны() Тогда
		Если ФорматДаты = Неопределено Тогда
			ФорматДаты = Вычислить("ФорматДатыJSON.ISO");
		КонецЕсли;
		Результат = Вычислить("ЗаписатьДатуJSON(Дата, ФорматДаты)");
	Иначе
		Результат = Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss; ДП=");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗаписатьДатуJSONЛок

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция Инит(СтдКлиент) Экспорт
	
	СтдКлиентЛок = СтдКлиент;
	
	Возврат ЭтаФорма;
	
КонецФункции // Инит

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПлатформаПрочитатьJSON(Строка, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты,
		ИмяФункцииВосстановления, МодульФункцииВосстановления,
		ДополнительныеПараметрыФункцииВосстановления, ИменаСвойствДляОбработкиВосстановления)
	
	Чтение = Новый("ЧтениеJSON");
	Чтение.УстановитьСтроку(Строка);
	
	Если НЕ ЗначениеЗаполнено(ОжидаемыйФорматДаты) Тогда
		ОжидаемыйФорматДаты = Вычислить("ФорматДатыJSON.ISO");
	КонецЕсли;
	
	ТекстВычисления = "ПрочитатьJSON(Чтение, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты,
		|ИмяФункцииВосстановления, МодульФункцииВосстановления, ДополнительныеПараметрыФункцииВосстановления,
		|ИменаСвойствДляОбработкиВосстановления)";
	
	Результат = Вычислить(ТекстВычисления);
	
	Возврат Результат;
	
КонецФункции // ПлатформаПрочитатьJSON

&НаКлиенте
Функция ПарсерПрочитатьJSON(Строка, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты,
		ИмяФункцииВосстановления, МодульФункцииВосстановления,
		ДополнительныеПараметрыФункцииВосстановления, ИменаСвойствДляОбработкиВосстановления)
	
	Если ТипЗнч(ИменаСвойствСоЗначениямиДата) = Тип("Строка") Тогда
		МассивИменаСвойствСоЗначениямиДата = СтдКлиентЛок.Стр().СтрРазделитьЛок(ИменаСвойствСоЗначениямиДата, ",", Ложь);
	Иначе
		МассивИменаСвойствСоЗначениямиДата = ИменаСвойствСоЗначениямиДата;
	КонецЕсли;
	
	ОписаниеФункцииВосстановлении = Новый Структура;
	ОписаниеФункцииВосстановлении.Вставить("ИмяФункцииВосстановления", ИмяФункцииВосстановления);
	ОписаниеФункцииВосстановлении.Вставить("МодульФункцииВосстановления", МодульФункцииВосстановления);
	ОписаниеФункцииВосстановлении.Вставить("ДополнительныеПараметрыФункцииВосстановления",
		ДополнительныеПараметрыФункцииВосстановления);
	ОписаниеФункцииВосстановлении.Вставить("ИменаСвойствДляОбработкиВосстановления",
		ИменаСвойствДляОбработкиВосстановления);
	
	ПараметрыЧтения = ПараметрыЧтенияJSON(Строка, ПрочитатьВСоответствие);
	Результат = ПрочитатьСтрокуJSON(ПараметрыЧтения, МассивИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении);
	
	Возврат Результат;
	
КонецФункции // ПарсерПрочитатьJSON

&НаКлиенте
Функция ПлатформаЗаписатьJSON(Значение)
	
	Запись = Новый("ЗаписьJSON");
	Запись.УстановитьСтроку();
	Выполнить("ЗаписатьJSON(Запись, Значение)");
	Результат = Запись.Закрыть();
	
	Возврат Результат;
	
КонецФункции // ПлатформаЗаписатьJSON

&НаКлиенте
Функция ПарсерЗаписатьJSON(Значение)
	
	Результат = ЗаписатьЗначениеВСтрокуJSON(Значение);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ЗаписатьОбъектВСтрокуJSON(Значение);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ЗаписатьМассивВСтрокуJSON(Значение);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ЭкранироватьСимволыJSON(Значение);
	Результат = ЗаменитьНедопустимыеСимволыJSON(Результат);
	Результат = СтрокаВКавычках(Результат);
	
	Возврат Результат;
	
КонецФункции // ПарсерЗаписатьJSON

&НаКлиенте
Функция ПарсерПрочитатьДатуJSON(Строка)
	
	Попытка
		ГодДлина = 4;
		Год = Лев(Строка, ГодДлина);
		МесяцНачало = 6;
		МесяцДлина = 2;
		Месяц = Сред(Строка, МесяцНачало, МесяцДлина);
		ДеньНачало = 9;
		ДеньДлина = 2;
		День = Сред(Строка, ДеньНачало, ДеньДлина);
		ЧасНачало = 12;
		ЧасДлина = 2;
		Час = Сред(Строка, ЧасНачало, ЧасДлина);
		МинутаНачало = 15;
		МинутаДлина = 2;
		Минута = Сред(Строка, МинутаНачало, МинутаДлина);
		СекундаНачало = 18;
		СекундаДлина = 2;
		Секунда = Сред(Строка, СекундаНачало, СекундаДлина);
		Возврат Дата(Год + Месяц + День + Час + Минута + Секунда);
	Исключение
		ВызватьИсключение "JSON: Некорректный формат даты: " + Строка;
	КонецПопытки;
	
КонецФункции // ПарсерПрочитатьДатуJSON

// ПАРСЕР 8.2 - ЧТЕНИЕ

// Формирует параметры для чтения json через парсер для 8.2
//
// Параметры:
//  Строка - Строка - строка json, которую надо прочитать;
//  ПрочитатьВСоответствие - Булево - Истина, если нужно прочитать объекты json в соответствие;
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Элемент - Строка - значение текущего элемента json;
//   * Позиция - Число - индекс текущего элемента в массиве;
//   * МассивЭлементов - Массив - массив элементов строки json;
//   * ВсегоЭлементов - Число - количество элементов в массиве;
//   * ПрочитатьВСоответствие - Булево - см. входящий параметр;
//
&НаКлиенте
Функция ПараметрыЧтенияJSON(Строка, ПрочитатьВСоответствие)
	
	СтрокаЭлементов = ЗаменитьЭкранированныеСимволыJSON(Строка);
	СтрокаЭлементов = РазбитьСтрокуПоСлужебнымСимволамJSON(СтрокаЭлементов);
	МассивЭлементов = РазделитьСтрокуJSON(СтрокаЭлементов);
	
	ВосстановитьТекстыJSON(МассивЭлементов);
	
	Результат = Новый Структура;
	Результат.Вставить("Элемент", "");
	Результат.Вставить("Позиция", -1);
	Результат.Вставить("МассивЭлементов", МассивЭлементов);
	Результат.Вставить("РазмерМассива", МассивЭлементов.ВГраница());
	Результат.Вставить("ПрочитатьВСоответствие", ПрочитатьВСоответствие);
	
	Возврат Результат;
	
КонецФункции // ПараметрыЧтенияJSON

&НаКлиенте
Функция ПрочитатьСтрокуJSON(ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении)
	
	Результат = "";
	НачалоОбъекта = "{";
	НачалоМассива = "[";
	
	Пока СледующийЭлементJSON(ПараметрыЧтения) Цикл
		
		Если ПустаяСтрока(ПараметрыЧтения.Элемент)
			ИЛИ ЭтоРазделительJSON(ПараметрыЧтения.Элемент) Тогда
			
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЧтения.Элемент = НачалоОбъекта Тогда
			Результат = ПрочитатьОбъектИзСтрокиJSON(
					ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении);
		ИначеЕсли ПараметрыЧтения.Элемент = НачалоМассива Тогда
			Результат = ПрочитатьМассивИзСтрокиJSON(
					ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении);
		Иначе
			Результат = ПрочитатьЗначениеИзСтрокиJSON(
					ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении);
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	ДекодироватьUnicodeСимволы(Результат);
	
	Возврат Результат;
	
КонецФункции // ПрочитатьСтрокуJSON

&НаКлиенте
Функция ПрочитатьОбъектИзСтрокиJSON(ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении)
	
	Если ПараметрыЧтения.ПрочитатьВСоответствие Тогда
		Результат = Новый Соответствие;
	Иначе
		Результат = Новый Структура;
	КонецЕсли;
	
	КонецОбъекта = "}";
	
	Пока СледующийЭлементJSON(ПараметрыЧтения) Цикл
		
		Если ПустаяСтрока(ПараметрыЧтения.Элемент)
			ИЛИ ЭтоРазделительJSON(ПараметрыЧтения.Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЧтения.Элемент = КонецОбъекта Тогда
			Прервать;
		КонецЕсли;
		
		Ключ = ПрочитатьЗначениеИзСтрокиJSON(ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении);
		Значение = ПрочитатьСтрокуJSON(ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении);
		
		// Преобразуем дату по имени свойства
		Если ИменаСвойствСоЗначениямиДата <> Неопределено И ИменаСвойствСоЗначениямиДата.Найти(Ключ) <> Неопределено Тогда
			Значение = ПарсерПрочитатьДатуJSON(Значение);
		КонецЕсли;
		
		// Преобразуем дату вызывая метод восстановления
		Если ОписаниеФункцииВосстановлении.ИмяФункцииВосстановления <> Неопределено
			И (ОписаниеФункцииВосстановлении.ИменаСвойствДляОбработкиВосстановления = Неопределено
				ИЛИ ОписаниеФункцииВосстановлении.ИменаСвойствДляОбработкиВосстановления.Найти(Ключ) <> Неопределено) Тогда
			
			Значение = ВызватьФункциюВосстановления(ОписаниеФункцииВосстановлении, Ключ, Значение);
			
		КонецЕсли;
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПрочитатьОбъектИзСтрокиJSON

&НаКлиенте
Функция ПрочитатьМассивИзСтрокиJSON(ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении)
	
	Результат = Новый Массив;
	КонецМассива = "]";
	
	Пока СледующийЭлементJSON(ПараметрыЧтения) Цикл
		
		Если ПустаяСтрока(ПараметрыЧтения.Элемент)
			ИЛИ ЭтоРазделительJSON(ПараметрыЧтения.Элемент) Тогда
			
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЧтения.Элемент = КонецМассива Тогда
			Прервать;
		Иначе
			ПараметрыЧтения.Позиция = ПараметрыЧтения.Позиция - 1;
			Значение = ПрочитатьСтрокуJSON(ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении);
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПрочитатьМассивИзСтрокиJSON

&НаКлиенте
Функция ПрочитатьЗначениеИзСтрокиJSON(ПараметрыЧтения, ИменаСвойствСоЗначениямиДата, ОписаниеФункцииВосстановлении)
	
	Элемент = СокрЛП(ПараметрыЧтения.Элемент);
	
	Кавычки = Кавычки();
	ЕстьКавычкиСлева = (Лев(Элемент, 1) = Кавычки);
	ЕстьКавычкиСправа = (Прав(Элемент, 1) = Кавычки) И СтрДлина(Элемент) > 1;
	ЭтоТекст = ЕстьКавычкиСлева И ЕстьКавычкиСправа;
	
	Если ЭтоТекст Тогда
		
		Результат = СокрЛП(СократитьКавычки(Элемент));
		Результат = ВосстановитьНедопустимыеСимволыJSON(Результат);
		Результат = ВосстановитьЭкранированныеСимволыJSON(Результат);
		
		ДекодироватьUnicodeСимволы(Результат);
		
		Возврат Результат;
		
	КонецЕсли;
	
	Апостроф = Апостроф();
	ЕстьАпострофСлева = (Лев(Элемент, 1) = Апостроф);
	ЕстьАпострофСправа = (Прав(Элемент, 1) = Апостроф) И СтрДлина(Элемент) > 1;
	ЭтоТекст = ЕстьАпострофСлева И ЕстьАпострофСправа;
	
	Если ЭтоТекст Тогда
		
		Результат = СокрЛП(СократитьАпострофы(Элемент));
		Результат = ВосстановитьНедопустимыеСимволыJSON(Результат);
		Результат = ВосстановитьЭкранированныеСимволыJSON(Результат);
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если Элемент = "null" Тогда
		
		Результат = Неопределено;
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		Результат = БулевоИзСтрокиJSON(Элемент);
	Исключение
		Попытка
			Экспонента = Найти(Элемент, "e");
			Если Экспонента = 0 Тогда
				ТипЧисло = Новый ОписаниеТипов("Число");
				Результат = ТипЧисло.ПривестиЗначение(Элемент);
			Иначе
				// BSLLS:TryNumber-off
				// Попытка-Исключение не относится к приведению к числу, а
				// является частью сериализатора, отделяя экспоненциальные
				// числа от обычных строк
				Мантисса = Число(Лев(Элемент, Экспонента - 1));
				Степень = Число(Прав(Элемент, СтрДлина(Элемент) - Экспонента));
				// BSLLS:TryNumber-on
				Основание = 10;
				Результат = Мантисса * Pow(Основание, Степень);
			КонецЕсли;
		Исключение
			Результат = ВосстановитьНедопустимыеСимволыJSON(Результат);
			Результат = ВосстановитьЭкранированныеСимволыJSON(Элемент);
		КонецПопытки;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ПрочитатьЗначениеИзСтрокиJSON

// ПАРСЕР 8.2 - ЗАПИСЬ

&НаКлиенте
Функция ЗаписатьОбъектВСтрокуJSON(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	ЭтоСтруктура = ТипЗначения = Тип("Структура") ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура");
	ЭтоСоответствие = ТипЗначения = Тип("Соответствие") ИЛИ ТипЗначения = Тип("ФиксированноеСоответствие");
	
	Если НЕ ЭтоСтруктура
		И НЕ ЭтоСоответствие Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = "{";
	Разделитель = "";
	Для Каждого Элемент Из Значение Цикл
		ВложенноеЗначение = ПарсерЗаписатьJSON(Элемент.Значение);
		Результат = Результат + Разделитель + СтрокаВКавычках(Элемент.Ключ) + ":" + ВложенноеЗначение;
		Разделитель = ",";
	КонецЦикла;
	Результат = Результат + "}";
	
	Возврат Результат;
	
КонецФункции // ЗаписатьОбъектВСтрокуJSON

&НаКлиенте
Функция ЗаписатьМассивВСтрокуJSON(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если НЕ (ТипЗначения = Тип("Массив")
			ИЛИ ТипЗначения = Тип("ФиксированныйМассив")) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = "[";
	Разделитель = "";
	Для Каждого Элемент Из Значение Цикл
		ВложенноеЗначение = ПарсерЗаписатьJSON(Элемент);
		Результат = Результат + Разделитель + ВложенноеЗначение;
		Разделитель = ",";
	КонецЦикла;
	Результат = Результат + "]";
	
	Возврат Результат;
	
КонецФункции // ЗаписатьМассивВСтрокуJSON

&НаКлиенте
Функция ЗаписатьЗначениеВСтрокуJSON(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Булево") Тогда
		
		Результат = БулевоXML(Значение);
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		Результат = ЧислоXML(Значение);
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Результат = СтрокаВКавычках(ЛокальнаяДатаXML(Значение));
		
	ИначеЕсли ТипЗначения = Тип("ДвоичныеДанные") Тогда
		
		Результат = СтрокаВКавычках(Base64ИзДвоичныхДанных(Значение));
		
	ИначеЕсли Значение = Неопределено Тогда
		
		Результат = "null";
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗаписатьЗначениеВСтрокуJSON

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ JSON

&НаКлиенте
Процедура ВосстановитьТекстыJSON(МассивЭлементов)
	
	ВосстановитьТекстыJSONВКавычках(МассивЭлементов);
	ВосстановитьТекстыJSONВАпострофах(МассивЭлементов);
	
КонецПроцедуры // ВосстановитьТекстыJSON

&НаКлиенте
Процедура ВосстановитьТекстыJSONВКавычках(МассивЭлементов)
	
	Кавычки = Кавычки();
	
	Для Сч = -МассивЭлементов.ВГраница() По 0 Цикл
		
		Индекс = -Сч;
		Элемент = СокрЛП(МассивЭлементов[Индекс]);
		
		ЕстьКавычкиСлева = (Лев(Элемент, 1) = Кавычки) И СтрДлина(Элемент) > 1;
		ЕстьКавычкиСправа = (Прав(Элемент, 1) = Кавычки);
		
		Если ЕстьКавычкиСлева И ЕстьКавычкиСправа Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЕстьКавычкиСлева И НЕ ЕстьКавычкиСправа Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЕстьКавычкиСлева И ЕстьКавычкиСправа Тогда
			ПредИндекс = Индекс - 1;
			МассивЭлементов[ПредИндекс] = МассивЭлементов[ПредИндекс] + МассивЭлементов[Индекс];
			МассивЭлементов.Удалить(Индекс);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВосстановитьТекстыJSONВКавычках

&НаКлиенте
Процедура ВосстановитьТекстыJSONВАпострофах(МассивЭлементов)
	
	Апостроф = Апостроф();
	
	Для Сч = -МассивЭлементов.ВГраница() По 0 Цикл
		
		Индекс = -Сч;
		Элемент = СокрЛП(МассивЭлементов[Индекс]);
		
		ЕстьАпострофСлева = (Лев(Элемент, 1) = Апостроф) И СтрДлина(Элемент) > 1;
		ЕстьАпострофСправа = (Прав(Элемент, 1) = Апостроф);
		
		Если ЕстьАпострофСлева И ЕстьАпострофСправа Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЕстьАпострофСлева И НЕ ЕстьАпострофСправа Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЕстьАпострофСлева И ЕстьАпострофСправа Тогда
			ПредИндекс = Индекс - 1;
			МассивЭлементов[ПредИндекс] = МассивЭлементов[ПредИндекс] + МассивЭлементов[Индекс];
			МассивЭлементов.Удалить(Индекс);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВосстановитьТекстыJSONВАпострофах

&НаКлиенте
Процедура ДекодироватьUnicodeСимволы(Результат)
	
	Позиция = Найти(Результат, "\u");
	Если Позиция = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Схема подстановок шестнадцатеричной системы.
	СхемаПодстановок = Новый Соответствие;
	ШестнадцатеричнаяСистема = "0123456789abcdef";
	ДесятичноеЧисло = 0;
	Для ВторойРазряд = 1 По 16 Цикл
		Для ПервыйРазряд = 1 По 16 Цикл
			ШестнадцатеричноеЧисло = Сред(ШестнадцатеричнаяСистема, ВторойРазряд, 1)
				+ Сред(ШестнадцатеричнаяСистема, ПервыйРазряд, 1);
			СхемаПодстановок.Вставить(ШестнадцатеричноеЧисло, ДесятичноеЧисло);
			ДесятичноеЧисло = ДесятичноеЧисло + 1;
		КонецЦикла;
	КонецЦикла;
	
	БуфферПозицийОбратныхСлешей = Новый Массив;
	Пока Позиция Цикл
		ДлинаСтаршийБайт = 2;
		ДлинаМладшийБайт = 4;
		СтаршийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + ДлинаСтаршийБайт, ДлинаСтаршийБайт))];
		МладшийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + ДлинаМладшийБайт, ДлинаСтаршийБайт))];
		Если (СтаршийБайт = Неопределено) ИЛИ (МладшийБайт = Неопределено) Тогда
			// Если не удалось найти, значит это не Unicode. Удалим символ, после декодировки вернем.
			БуфферПозицийОбратныхСлешей.Добавить(Позиция);
			Результат = Лев(Результат, Позиция - 1) + Прав(Результат, СтрДлина(Результат) - Позиция);
		Иначе
			Начало = 6;
			Длина = 256;
			Результат = СтрЗаменить(Результат, Сред(Результат, Позиция, Начало), Символ(Длина * СтаршийБайт + МладшийБайт));
		КонецЕсли;
		Позиция = Найти(Результат, "\u");
	КонецЦикла;
	
	// Вернем удаленные символы обратно
	ИндексПоследнего = БуфферПозицийОбратныхСлешей.ВГраница();
	Для Индекс = -ИндексПоследнего По 0 Цикл
		ИндексПозиции = -Индекс;
		Позиция = БуфферПозицийОбратныхСлешей[ИндексПозиции];
		Результат = Лев(Результат, Позиция - 1) + "\" + Прав(Результат, СтрДлина(Результат) - Позиция + 1);
	КонецЦикла;
	
КонецПроцедуры // ДекодироватьUnicodeСимволы

&НаКлиенте
Функция БулевоXML(Значение)
	
	Результат = Формат(Значение, "БЛ=false; БИ=true");
	
	Возврат Результат;
	
КонецФункции // БулевоXML

&НаКлиенте
Функция ЧислоXML(Значение)
	
	Результат = Формат(Значение, "ЧРД=.; ЧН=0; ЧГ=0");
	
	Возврат Результат;
	
КонецФункции // ЧислоXML

&НаКлиенте
Функция ЛокальнаяДатаXML(Значение)
	
	Результат = Формат(Значение, "ДФ=yyyy-MM-ddTHH:mm:ss");
	
	Возврат Результат;
	
КонецФункции // ЛокальнаяДатаXML

&НаКлиенте
Функция СледующийЭлементJSON(ПараметрыЧтения)
	
	// Увеличивает номер текущей позиции в параметрах чтения json
	// и записывает значение элемента расположенного в этой позиции в поле Элемент
	Если ПараметрыЧтения.Позиция < ПараметрыЧтения.РазмерМассива Тогда
		ПараметрыЧтения.Позиция = ПараметрыЧтения.Позиция + 1;
		ПараметрыЧтения.Элемент = ПараметрыЧтения.МассивЭлементов[ПараметрыЧтения.Позиция];
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СледующийЭлементJSON

&НаКлиенте
Функция РазделитьСтрокуJSON(Строка)
	
	ВключатьПустые = Истина;
	Разделитель = Символы.ПС;
	Результат = СтдКлиентЛок.Стр().СтрРазделитьЛок(Строка, Разделитель, ВключатьПустые);
	
	Возврат Результат;
	
КонецФункции // РазделитьСтрокуJSON

&НаКлиенте
Функция РазбитьСтрокуПоСлужебнымСимволамJSON(Знач Строка)
	
	СлужебныеСимволы = "{}[]:,";
	Для Сч = 1 По СтрДлина(СлужебныеСимволы) Цикл
		ТекСимвол = Сред(СлужебныеСимволы, Сч, 1);
		Строка = СтрЗаменить(Строка, ТекСимвол, Символы.ПС + ТекСимвол + Символы.ПС);
	КонецЦикла;
	
	Возврат Строка;
	
КонецФункции // РазбитьСтрокуПоСлужебнымСимволамJSON

&НаКлиенте
Функция ЭкранироватьСимволыJSON(Знач Строка)
	
	Строка = СтрЗаменить(Строка, "\", "\\");
	Строка = СтрЗаменить(Строка, """", "\""");
	
	Возврат Строка;
	
КонецФункции // ЭкранироватьСимволыJSON

&НаКлиенте
Функция ЗаменитьЭкранированныеСимволыJSON(Знач Строка)
	
	Строка = СтрЗаменить(Строка, "\\", "<&sl>");
	Строка = СтрЗаменить(Строка, "\""", "<&qt>");
	
	Возврат Строка;
	
КонецФункции // ЗаменитьЭкранированныеСимволыJSON

&НаКлиенте
Функция ВосстановитьЭкранированныеСимволыJSON(Знач Строка)
	
	Строка = СтрЗаменить(Строка, "\/", "/");
	Строка = СтрЗаменить(Строка, "<&sl>", "\");
	Строка = СтрЗаменить(Строка, "<&qt>", Кавычки());
	
	Возврат Строка;
	
КонецФункции // ВосстановитьЭкранированныеСимволыJSON

&НаКлиенте
Функция ЗаменитьНедопустимыеСимволыJSON(Знач Строка)
	
	Backspace = 8;
	РазделителяGS = 29;
	
	СимволBackspace = Символ(Backspace);
	СимволРазделителяGS = Символ(РазделителяGS);
	
	Строка = СтрЗаменить(Строка, Символы.ПФ, "\f");
	Строка = СтрЗаменить(Строка, Символы.ПС, "\n");
	Строка = СтрЗаменить(Строка, Символы.ВК, "\r");
	Строка = СтрЗаменить(Строка, Символы.Таб, "\t");
	Строка = СтрЗаменить(Строка, СимволBackspace, "\b");
	Строка = СтрЗаменить(Строка, СимволРазделителяGS, "\u001D");
	
	Возврат Строка;
	
КонецФункции // ЗаменитьНедопустимыеСимволыJSON

&НаКлиенте
Функция ВосстановитьНедопустимыеСимволыJSON(Знач Строка)
	
	Backspace = 8;
	РазделителяGS = 29;
	
	СимволBackspace = Символ(Backspace);
	СимволРазделителяGS = Символ(РазделителяGS);
	
	Строка = СтрЗаменить(Строка, "\f", Символы.ПФ);
	Строка = СтрЗаменить(Строка, "\n", Символы.ПС);
	Строка = СтрЗаменить(Строка, "\r", Символы.ВК);
	Строка = СтрЗаменить(Строка, "\t", Символы.Таб);
	Строка = СтрЗаменить(Строка, "\b", СимволBackspace);
	Строка = СтрЗаменить(Строка, "\u001d", СимволРазделителяGS);
	Строка = СтрЗаменить(Строка, "\u001D", СимволРазделителяGS);
	
	Возврат Строка;
	
КонецФункции // ВосстановитьНедопустимыеСимволыJSON

&НаКлиенте
Функция ЭтоРазделительJSON(Строка)
	
	Результат = Строка = "," ИЛИ Строка = ":";
	
	Возврат Результат;
	
КонецФункции // ЭтоРазделительJSON

&НаКлиенте
Функция БулевоИзСтрокиJSON(Строка)
	
	Если НРег(Строка) = "true" Тогда
		Результат = Истина;
	ИначеЕсли НРег(Строка) = "false" Тогда
		Результат = Ложь;
	Иначе
		ВызватьИсключение "Не удалось преобразовать json строку в булево: " + Строка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // БулевоИзСтрокиJSON

&НаКлиенте
Функция Кавычки()
	
	Кавычки = 34;
	Возврат Символ(Кавычки);
	
КонецФункции // Кавычки

&НаКлиенте
Функция Апостроф()
	
	Апостроф = 39;
	Возврат Символ(Апостроф);
	
КонецФункции // Апостроф

&НаКлиенте
Функция СтрокаВКавычках(Строка)
	
	Возврат Кавычки() + Строка + Кавычки();
	
КонецФункции // СтрокаВКавычках

&НаКлиенте
Функция СократитьКавычки(Строка)
	
	Возврат СтрЗаменить(Строка, """", "");
	
КонецФункции // СократитьКавычки

&НаКлиенте
Функция СократитьАпострофы(Строка)
	
	Длина = 2;
	Возврат Сред(Строка, Длина, СтрДлина(Строка) - Длина);
	
КонецФункции // СократитьАпострофы

&НаКлиенте
Функция Base64ИзДвоичныхДанных(ДвоичныеДанные)
	
	Результат = Base64Строка(ДвоичныеДанные);
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	
	Возврат Результат;
	
КонецФункции // Base64ИзДвоичныхДанных

&НаКлиенте
Функция ВызватьФункциюВосстановления(ОписаниеФункцииВосстановлении, Свойство, Значение)
	
	МодульФункцииВосстановления = ОписаниеФункцииВосстановлении.МодульФункцииВосстановления;
	ДополнительныеПараметры = ОписаниеФункцииВосстановлении.ДополнительныеПараметрыФункцииВосстановления;
	
	ТекстВычисления = "МодульФункцииВосстановления." + ОписаниеФункцииВосстановлении.ИмяФункцииВосстановления
		+ "(Свойство, Значение, ДополнительныеПараметры)";
	
	Значение = Вычислить(ТекстВычисления);
	
	Возврат Значение;
	
КонецФункции // ВызватьФункциюВосстановления

// ПРОЧЕЕ

&НаКлиенте
Функция ФункцииДоступны()
	
	Если ФункцииДоступныЛок = Неопределено Тогда
		ФункцииДоступныЛок = СтдКлиентЛок.Стр().ВерсияПлатформыБольшеИлиРавна("8.3.6");
	КонецЕсли;
	
	Возврат ФункцииДоступныЛок;
	
КонецФункции // ФункцииДоступны