
&НаКлиенте
Перем МодульТиповой;

&НаКлиенте
Перем ИмяФайлаМодуля;

&НаКлиенте
Перем РасположениеМодуля;

&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

&НаСервере
Функция Модуль_ЯдроНаСервере() Экспорт
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Результат = ОсновнаяФорма().Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

// Служебный метод для передачи параметров формы.
//
&НаСервере
Процедура ИнициализироватьФорму(ПараметрыФормы) Экспорт
	
	ОтборПоОрганизации = ПараметрыФормы.ОтборПоОрганизации;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	Элементы.СкопироватьТехИнформацию.ЦветФона = Новый Цвет(255, 225, 0);
	
	УстановитьЗаголовокФормы();
	
	ИнициализироватьФорму(Параметры);
	
	ЗаполнитьСпискиВыбораФормы();
	
	ЗаполнитьТехническуюИнформацию();
	
	УстановитьВидимостьКнопкиСкачатьПМ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КатегорияМетрики		 = Метрика_НазваниеКатегории().Техподдержка;
	НазваниеФормыДляМетрики	 = Метрика_НазваниеФормы();
	ПредставлениеМетрики	 = Метрика_НазваниеФормы(); 
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_ДействиеСФормой(НазваниеФормыДляМетрики,
		КатегорияМетрики, Истина, Метрика_НазваниеДействий().ОткрытиеФормы, ПредставлениеМетрики);
	
	TraceId = Модуль_ЯдроНаКлиенте().TraceId();
	Метрика_ДобавитьСтатистику_ДляОрганизации(ОтборПоОрганизации,
		КатегорияМетрики, Метрика_НазваниеДействий().ОткрытиеФормы, , , , TraceId);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	АвтоЗаголовок = Ложь;
	
	ЭтаФорма.Заголовок = "Техническая информация";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораФормы()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	СписокДляОтбора = Элементы.ОтборПоОрганизации.СписокВыбора;
	
	СписокДляОтбораОрганизации = Ядро.Организации_СписокОрганизацийДляВыбора(Истина);
	
	Для Каждого ТекОрганизация Из СписокДляОтбораОрганизации Цикл
		
		НовыйЭлемент = СписокДляОтбора.Добавить();
		НовыйЭлемент.Значение = ТекОрганизация.Значение;
		НовыйЭлемент.Представление = ТекОрганизация.Представление;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ОтборПоОрганизации)
		И ЗначениеЗаполнено(СписокДляОтбора) Тогда
		
		ПервыйЭлемент = СписокДляОтбора[0];
		ОтборПоОрганизации = ПервыйЭлемент.Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТехническуюИнформацию()
	
	BoxId = ОтборПоОрганизации;
	Ядро = Модуль_ЯдроНаСервере();
	ТехническиеДанные = Ядро.ТехническаяИнформацияV2(BoxId);
	
	// BSLLS:UnusedLocalVariable-off
	ТехническаяИнформация = Ядро.ТехническаяИнформацияКакТекст(ТехническиеДанные);
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиСкачатьПМ()
	
	ЕстьПМ = ТехническиеДанные.КонфигурацияМодуля.ПодключаемыйМодуль.Использовать;
	Элементы.СкачатьПМ.Видимость = ЕстьПМ;
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьПМ(Команда)
	
	Действие = "Скачать ПМ";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки("Форма технической информации", "Техподдержка", Действие);
	
	ОписаниеОповещения = ОсновнаяФорма().НовыйОписаниеОповещения("СкачатьПодключаемыйМодульЗавершение", ЭтаФорма);
	
	ДиалогСохранения 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохранения.Заголовок 			= "Укажите куда сохранить файл с подключаемым модулем";
	ДиалогСохранения.МножественныйВыбор = Ложь;
	ДиалогСохранения.Фильтр 			= "Внешняя обработка (*.epf)|*.epf";
	ДиалогСохранения.ПолноеИмяФайла 	= ДиалогСохранения.Каталог + "Подключаемый модуль.epf";
	
	ДиалогСохранения.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьПодключаемыйМодульЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	Файл = Новый Файл(ПолноеИмяФайла);
	
	ТекстПредупреждения = НСтр("ru = 'Подключаемый модуль сохранен'");
	
	ТехИнфоПМ = ТехническиеДанные.КонфигурацияМодуля.ПодключаемыйМодуль;
	
	Попытка
		
		ДвоичныеДанныеПМ = ДвоичныеДанныеПодключаемогоМодуля(ТехИнфоПМ);
		ДвоичныеДанныеПМ.Записать(ПолноеИмяФайла);
		
	Исключение
		
		ОшибкаИнфо = ИнформацияОбОшибке();
		ТекстПредупреждения =
		"Не удалось сохранить подключаемый модуль по причине:
		|" + КраткоеПредставлениеОшибки(ОшибкаИнфо);
		
	КонецПопытки;
	
	ОсновнаяФорма().ПоказатьПредупреждениеПереопределенная(, ТекстПредупреждения, , "Диадок");
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, "Техподдержка", "Скачать ПМ");
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеПодключаемогоМодуля(Знач ТехИнфоПМ)
	
	Ядро = Модуль_ЯдроНаСервере();
	Результат = Ядро.ФайлПодключаемогоМодуля(ТехИнфоПМ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СкопироватьТехИнформацию(Команда)
	
	Действие = "Скопировать тех. информацию";
	
	Переменные = Новый Структура;
	Переменные.Вставить("BoxId", BoxId);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки("Форма технической информации", "Техподдержка", Действие);
	
	Попытка
		
		Успех = ПоместитьТекстВБуферОбмена(ТехническаяИнформация);
		
		Если Успех Тогда
			ТекстПредупреждения = ТекстПредупрежденияОбУспешномКопированииТехническойИнформации();
		Иначе
			ТекстПредупреждения = ТекстПредупрежденияОбОшибкеКопированияТехническойИнформации();
		КонецЕсли;
		
		ОсновнаяФорма().ПоказатьПредупреждениеПереопределенная(, ТекстПредупреждения, , "Диадок");
		
		Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, "Техподдержка", "Скопировать тех. информацию");
		
	Исключение
		
		ВидОперации = "Копирование тех. информацию";
		ТекстСообщения = "Не удалось скопировать техническую информацию";
		ТекстОшибки = ТекстПредупрежденияОбОшибкеКопированияТехническойИнформации();
		
		Ядро.Ошибка_Обработать(ВидОперации, ТекстОшибки, , ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция ПоместитьТекстВБуферОбмена(Текст)
	
	htmlfile = Новый ComОбъект("htmlfile");
	Результат = htmlfile.ParentWIndow.ClipboardData.SetData("Text", Текст);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстПредупрежденияОбУспешномКопированииТехническойИнформации()
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(НСтр("ru = 'Техническая информация скопирована.'; en = 'Техническая информация скопирована.'"));
	Подстроки.Добавить(НСтр("ru = 'Вставьте ее в письмо или чат с помощью клавиш'; en = 'Вставьте ее в письмо или чат с помощью клавиш'"));
	Подстроки.Добавить(НСтр("ru = 'Ctrl + V для отправки в поддержку.'; en = 'Ctrl + V для отправки в поддержку.'"));
	
	Результат = Модуль_ЯдроНаСервере().СоединитьСтроку(Подстроки, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстПредупрежденияОбОшибкеКопированияТехническойИнформации()
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(НСтр("ru = 'Не удалось скопировать техническую информацию!'; en = 'Не удалось скопировать техническую информацию!'"));
	Подстроки.Добавить(НСтр("ru = 'Скопируйте информацию вручную:'; en = 'Скопируйте информацию вручную:'"));
	Подстроки.Добавить(НСтр("ru = '1. Щёлкните мышкой по окну с тех. информацией.'; en = '1. Щёлкните мышкой по окну с тех. информацией.'"));
	Подстроки.Добавить(НСтр("ru = '2. Нажмите Ctrl+A.'; en = '2. Нажмите Ctrl+A.'"));
	Подстроки.Добавить(НСтр("ru = '3. Нажмите Ctrl+C.'; en = '3. Нажмите Ctrl+C.'"));
	Подстроки.Добавить(НСтр("ru = '4. Отправьте информацию в поддержку.'; en = '4. Отправьте информацию в поддержку.'"));
	
	Результат = Модуль_ЯдроНаСервере().СоединитьСтроку(Подстроки, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	
	ЗаполнитьТехническуюИнформацию();
	
	ДействиеМетрики			 = Метрика_НазваниеДействий().ИзменитьОтбор;
	Метрика_НажатиеКнопки(ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеФормы()
	
	Возврат "Форма техподдержки";
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеКатегории()
	
	Результат = ОсновнаяФорма().Метрика_НазваниеКатегории();

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция Метрика_НазваниеДействий()
	
	Результат = ОсновнаяФорма().Метрика_НазваниеДействий();

	Возврат Результат;

КонецФункции

// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ДляОрганизации(ОтборПоОрганизации,
		КатегорияМетрики,
		ДействиеМетрики,
		НазваниеМетки = Неопределено,
		ДопПеременные = Неопределено,
		ПредставлениеМетрики = "",
		TraceId = "")
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(ОтборПоОрганизации,
		КатегорияМетрики, ДействиеМетрики, НазваниеМетки, ДопПеременные, ПредставлениеМетрики, TraceId);
	
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-on
// BSLLS:MissingParameterDescription-on

&НаКлиенте
Процедура Метрика_НажатиеКнопки(ДействиеМетрики)
	
	КатегорияМетрики		 = Метрика_НазваниеКатегории().Техподдержка;
	НазваниеФормыДляМетрики	 = Метрика_НазваниеФормы();
	ПредставлениеМетрики	 = Метрика_НазваниеФормы();
	ЛейблМетрики			 = Метрика_НазваниеДействий().НажатиеКнопки;
	
	Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормыДляМетрики,
		КатегорияМетрики, ДействиеМетрики, ЛейблМетрики, ПредставлениеМетрики, TraceId);
		
	Метрика_ДобавитьСтатистику_ДляОрганизации(ОтборПоОрганизации,
		КатегорияМетрики, ДействиеМетрики, , , , TraceId);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы,
		НазваниеКатегории, НазваниеКнопки, НазваниеМетки = "", ПредставлениеМетрики = "", TraceId = "")
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы,
		НазваниеКатегории, НазваниеКнопки, НазваниеМетки, ПредставлениеМетрики, TraceId);
	
КонецПроцедуры
