
&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;

////////////////////////////////////////////////////////////////////////////////
// СЕРВИСНЫЕ МЕТОДЫ

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

// Возвращает форму для вызова сервера без контекста вызывающей формы
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Платформа = Модуль_Платформа();
	Результат = Платформа.Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеПараметраРежимФормы = Неопределено;
	
	Параметры.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	Параметры.Свойство("ТекущийРежимФормы", ЗначениеПараметраРежимФормы);
	
	Если ЗначениеПараметраРежимФормы = РежимФормыВыборСертификата() Тогда
		ТекущийРежимФормы = РежимФормыВыборСертификата();
	ИначеЕсли Модуль_ЯдроНаСервере().КонтекстСеанса_ЕстьСтроки() Тогда
		ТекущийРежимФормы = РежимФормыВыборОрганизации();
	Иначе
		ТекущийРежимФормы = РежимФормыАвторизация();
	КонецЕсли;
	
	ИнициализироватьРежимыФормы(Параметры);
	ИнициализироватьАдресКартинкиТарифа();
	УстановитьУсловноеОформление();
	УстановитьНачальныеНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьАдресКартинкиТарифа()
	
	КартинкаТарифа =  КартинкаТарифСтартовый();
	
	АдресКартинкиТарифа = ПоместитьВоВременноеХранилище(КартинкаТарифа, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ЗначенияФункциональныхОпций()
	
	Модель = Новый Структура;
	Модель.Вставить("СпособВходаСертификат", Истина);
	Модель.Вставить("СпособВходаЛогин", Истина);
	Модель.Вставить("СпособВходаПорталБраузер", Истина);
	
	Ядро = Модуль_ЯдроНаСервере();
	ЗначенияОпций = Ядро.ОбщийКонтекст_Прочитать("ФункциональныеОпции");
	
	ТипБулево = Тип("Булево");
	
	Значение = ЗначенияОпций.Получить("Authorization.Tab.Certificate");
	Если ЗначениеЗаполнено(Значение) Тогда
		Модель.СпособВходаСертификат = XMLЗначение(ТипБулево, Значение);
	КонецЕсли;
	
	Значение = ЗначенияОпций.Получить("Authorization.Tab.Password");
	Если ЗначениеЗаполнено(Значение) Тогда
		Модель.СпособВходаЛогин = XMLЗначение(ТипБулево, Значение);
	КонецЕсли;
	
	Значение = ЗначенияОпций.Получить("Authorization.Tab.Portal");
	Если ЗначениеЗаполнено(Значение) Тогда
		Модель.СпособВходаПорталБраузер = XMLЗначение(ТипБулево, Значение);
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДоступныеСпособыВхода(ЗначенияФО)
	
	Результат = Новый СписокЗначений;
	
	Если ЗначенияФО.СпособВходаПорталБраузер Тогда
		Результат.Добавить(ТипАвторизацииПорталБраузер(), "Портал (через браузер)");
	КонецЕсли;
	
	Если ЗначенияФО.СпособВходаСертификат Тогда
		Результат.Добавить(ТипАвторизацииДиадокСертификат(), "По сертификату");
	КонецЕсли;
	
	Если ЗначенияФО.СпособВходаЛогин Тогда
		Результат.Добавить(ТипАвторизацииДиадокЛогин(), "По паролю");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КартинкаТарифСтартовый()
	
	МодульОбъекта = ОбработкаОбъект();
	ВсеКартинки = МодульОбъекта.БиблиотекаКартинок();
	
	Возврат ВсеКартинки.ТарифСтартовый;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТекущийРежимФормы = РежимФормыАвторизация()
		Или ТекущийРежимФормы = РежимФормыВыборОрганизации() Тогда
		ЗаполнитьТаблицуСертификатов();
	КонецЕсли;
	
	ПереключитьРежимФормыПриОткрытии();
	
	Если ТекущийРежимФормы = РежимФормыАвторизация()
		ИЛИ ТекущийРежимФормы = РежимФормыВыборОрганизации() Тогда
		
		НазваниеФормы	 = Метрика_НазваниеФормы();
		Категория		 = Метрика_ВозможныеКатегории().Авторизация;
		Действие		 = Метрика_ВозможныеДействия().ОткрытиеФормы;
		
		ДопПеременные = Новый Соответствие;
		ДопПеременные.Вставить("Количество сертификатов", ТаблицаСертификатов.Количество());
		Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы, ДопПеременные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежимФормыПриОткрытии()
	
	ПереключитьРежимФормы();
	
	//Если модулю не удается получить доступ к сертификатам, то форма автоматически открывается на закладке “По паролю”
	Если ТекущийРежимФормы = РежимФормыАвторизация()
		И НетДоступаКСертификатам() Тогда
		
		РежимАвторизации = ТипАвторизацииДиадокЛогин();
		ПереключитьРежимФормы();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Управление режимами формы

&НаСервере
Процедура ИнициализироватьРежимыФормы(ПараметрыФормы)
	
	Если ТекущийРежимФормы = РежимФормыАвторизация() 
		Или ТекущийРежимФормы = РежимФормыВыборОрганизации() Тогда
		
		ЗначенияФО = ЗначенияФункциональныхОпций();
		СпособыВхода = ДоступныеСпособыВхода(ЗначенияФО);
		Логин = НастройкиФормы_ПрочитатьЛогин();
		РежимАвторизации = НастройкиФормы_ПрочитатьСпособВхода(СпособыВхода);
		НастроитьКомандыПереключенияСпособаВхода(СпособыВхода);
		ЗаполнитьПараметрыКонтекстаСеанса();
		ЗаполнитьАктивныеСоединения();
		
	ИначеЕсли ТекущийРежимФормы = РежимФормыВыборСертификата() Тогда
		
		ПараметрыФормы.Свойство("Организация", Организация);
		ПараметрыФормы.Свойство("ОрганизацияBoxId", ОрганизацияBoxId);
		
		ОписанияСертификатов = Неопределено;
		Если ПараметрыФормы.Свойство("ОписанияСертификатов", ОписанияСертификатов)
			И ОписанияСертификатов <> Неопределено Тогда
			
			ТаблицаСертификатов.Очистить();
			Для Каждого ОписаниеСертификата Из ОписанияСертификатов Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаСертификатов.Добавить(), ОписаниеСертификата);
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Ошибка = "ValueError: ТекущийРежимФормы = [" + СокрЛП(ТекущийРежимФормы) + "]";
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыКонтекстаСеанса()
	
	Ядро = Модуль_ЯдроНаСервере();
	ТекущиеНастройки = Ядро.КонтекстСеанса_СохраненныеНастройки();
	
	Для Каждого Настройка Из ТекущиеНастройки Цикл
		Запись = НастройкиСеанса.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Настройка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАктивныеСоединения()
	
	Ядро = Модуль_ЯдроНаСервере();
	ТекущийКонтекст = Ядро.КонтекстСеанса_СтрокиКонтекста(Истина);
	
	Буфер = Новый Соответствие;
	
	Для Каждого Элемент Из ТекущийКонтекст Цикл
		
		Сессия = Элемент.Значение.Сессия;
		
		Если Буфер.Получить(Сессия.Ключ) = Неопределено Тогда
			Буфер.Вставить(Сессия.Ключ, Сессия);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущиеСоединения = Новый ФиксированноеСоответствие(Буфер);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РежимФормыАвторизация()
	Возврат "Авторизация";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимФормыВыборОрганизации()
	Возврат "ВыборОрганизаций";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимФормыВыборСертификата()
	Возврат "ВыборСертификата";
КонецФункции

// Видимость элементов и страниц формы в зависимости от ревизита ТекущийРежимФормы
//
&НаКлиенте
Процедура ПереключитьРежимФормы()
	
	Если ТекущийРежимФормы = РежимФормыАвторизация() Тогда
		
		НастроитьФормуРежимАвторизация();
		
	ИначеЕсли ТекущийРежимФормы = РежимФормыВыборОрганизации() Тогда
		
		ЗаполнитьДоступныеОрганизации();
		НастроитьФормуРежимВыборОрганизации();
		
	ИначеЕсли ТекущийРежимФормы = РежимФормыВыборСертификата() Тогда
		
		НастроитьФормуРежимВыборСертификата();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуРежимВыборОрганизации()
	
	ЭтаФорма.Заголовок = "Выбор организации для работы в модуле";
	
	УстановитьКнопкуПоУмолчанию(Элементы.ПриступитьКРаботе);
	
	Элементы.СтраницыДействия.ТекущаяСтраница = Элементы.СтраницаОрганизации;
	Если ЗначениеЗаполнено(ДоступныеОрганизации) Тогда
		Элементы.ГруппаОрганизации.ТекущаяСтраница = Элементы.СтраницаДоступныеОрганизации;
	Иначе
		Элементы.ГруппаОрганизации.ТекущаяСтраница = Элементы.СтраницаНетОрганизаций;
	КонецЕсли;
	
	НастроитьКолонкиСертификатаВТаблицеОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКолонкиСертификатаВТаблицеОрганизаций()
	
	ВидимостьКолонок = (ТаблицаСертификатов.Количество() > 0);
	
	Элементы.ГруппаДанныеСертификата.Видимость							 = ВидимостьКолонок;
	Элементы.ДоступныеОрганизацииКартинкаСертификат.Видимость			 = ВидимостьКолонок;
	Элементы.ДоступныеОрганизацииНаименованиеСертификата.Видимость		 = ВидимостьКолонок;
	Элементы.ДоступныеОрганизацииОписаниеСертификата.Видимость			 = ВидимостьКолонок;
	Элементы.ДоступныеОрганизацииКартинкаИзменитьСертификат.Видимость	 = ВидимостьКолонок;
	Элементы.ДоступныеОрганизацииРедактированиеСертификата.Видимость	 = ВидимостьКолонок;
	
	Если ВидимостьКолонок Тогда
		ЗначениеФиксации = ФиксацияВТаблице.Лево;
	Иначе
		ЗначениеФиксации = ФиксацияВТаблице.Нет;
	КонецЕсли; 
	
	Элементы.ГруппаДанныеОрганизации.ФиксацияВТаблице			 = ЗначениеФиксации;
	Элементы.ДоступныеОрганизацииНаименование.ФиксацияВТаблице	 = ЗначениеФиксации;
	Элементы.ДоступныеОрганизацииИНН_КПП.ФиксацияВТаблице		 = ЗначениеФиксации;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуРежимАвторизация()
	
	Если РежимАвторизации = ТипАвторизацииДиадокСертификат() Тогда
		
		Если ТаблицаСертификатов.Количество() = 0 Тогда
			Элементы.РежимыАвторизации.ТекущаяСтраница = Элементы.СтраницаВходПоСертификатуНедоступен;
		Иначе
			Элементы.РежимыАвторизации.ТекущаяСтраница = Элементы.СтраницаВходПоСертификату;
		КонецЕсли;
		
		Элементы.Декорация_НетСертификата.Видимость = Истина;
		Элементы.ЗавершитьСессию.Видимость = Ложь;
		
	ИначеЕсли РежимАвторизации = ТипАвторизацииДиадокЛогин() Тогда
		
		Элементы.РежимыАвторизации.ТекущаяСтраница = Элементы.СтраницаВходПоЛогину;
		Элементы.Декорация_НетСертификата.Видимость = Ложь;
		Элементы.ЗавершитьСессию.Видимость = Ложь;
		
	ИначеЕсли РежимАвторизации = ТипАвторизацииПорталБраузер() Тогда
		
		СессияАктивна = ЕстьАктивнаяПортальнаяСессия(ТекущиеСоединения);
		ТекстВходЧерезПортал = "Нажмите кнопку ""Авторизоваться"" для перехода на страницу портала в браузере.";
		Если СессияАктивна Тогда
			ТекстВходЧерезПортал = "Авторизация уже пройдена. Для смены пользователя завершите предыдущую сессию.";
		КонецЕсли;
		
		Элементы.РежимыАвторизации.ТекущаяСтраница = Элементы.СтраницаВходЧерезПортал;
		Элементы.Декорация_НетСертификата.Видимость = Ложь;
		Элементы.ЗавершитьСессию.Видимость = СессияАктивна;
		Элементы.НадписьВходЧерезПортал.Заголовок = ТекстВходЧерезПортал;
		
	Иначе
		ВызватьИсключение "ValueError: РежимАвторизации = [" + СокрЛП(РежимАвторизации) + "]";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "Авторизация";
	
	УстановитьКнопкуПоУмолчанию(Элементы.Авторизоваться);
	
	Элементы.Декорация_НетСертификата.Видимость = (РежимАвторизации = ТипАвторизацииДиадокСертификат());
	Элементы.СтраницыДействия.ТекущаяСтраница = Элементы.СтраницаАвторизация;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьАктивнаяПортальнаяСессия(Знач Сессии)
	
	Результат = Ложь;
	
	Для Каждого Элемент Из Сессии Цикл
		
		Если Элемент.Значение.ЭтоПортальнаяСессия Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастроитьФормуРежимВыборСертификата()
	
	ЭтаФорма.Заголовок = "Выбор сертификата";
	
	УстановитьКнопкуПоУмолчанию(Элементы.СохранитьВыборСертификата);

	Элементы.ПереключениеРежимаВхода.Видимость					 = Ложь;
	Элементы.ГруппаДействияСтраницаАвторизация.Видимость		 = Ложь;
	Элементы.ГруппаДействияСтраницаАвторизацияВыбор.Видимость	 = Истина;
	
	Элементы.ДекорацияВыборСертификата.Видимость	 = Истина;
	Элементы.ДекорацияВыборСертификата.Заголовок	 = "Выберите сертификат для авторизации " + Организация;
	
	Элементы.СтраницыДействия.ТекущаяСтраница = Элементы.СтраницаАвторизация;
	
	Элементы.ГруппаДанныеСертификата.Видимость = (РежимАвторизации = ТипАвторизацииДиадокСертификат());

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКнопкуПоУмолчанию(ЭлементКнопки)
	
	ШрифтКнопки = Новый Шрифт(ЭлементКнопки.Шрифт, , , Ложь);
	ЭлементКнопки.КнопкаПоУмолчанию	 = Истина;
	ЭлементКнопки.Шрифт				 = ШрифтКнопки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВариантИнтерфейсаКлиентскогоПриложения()
	
	ВариантыИнтерфейса	 = ВозможныеВариантыИнтерфейсаКлиентскогоПриложения();
	Результат			 = ВариантыИнтерфейса.Такси;
	Настройки			 = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	Если Настройки <> Неопределено Тогда
		
		Если Строка(Настройки.ВариантИнтерфейсаКлиентскогоПриложения) = ВариантыИнтерфейса.Версия8_2 Тогда
			Результат = ВариантыИнтерфейса.Версия8_2;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВозможныеВариантыИнтерфейсаКлиентскогоПриложения()

	Результат = Новый Структура;
	Результат.Вставить("Такси"		, "Такси");
	Результат.Вставить("Версия8_2"	, "Версия 8.2");
	
	Возврат Результат;
	
КонецФункции 
 

////////////////////////////////////////////////////////////////////////////////
// Настройки

&НаСервере
Процедура УстановитьНачальныеНастройкиФормы()
	
	ПодсказкаВводаЛогин = Новый Структура("ПодсказкаВвода", "Электронная почта");
	ЗаполнитьЗначенияСвойств(Элементы.Логин, ПодсказкаВводаЛогин);
	
	ПодсказкаВводаПароль = Новый Структура("ПодсказкаВвода", "Пароль");
	ЗаполнитьЗначенияСвойств(Элементы.Пароль, ПодсказкаВводаПароль);
	
	Если НЕ ОбработкаОбъект().ПриложениеСтаршеВерсии("8.3.7") Тогда
		Элементы.НетСертификатовПодробности.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;
	
	Если НЕ ОбработкаОбъект().ПриложениеСтаршеВерсии("8.3.3") Тогда
		
		ВариантыИнтерфейса			 = ВозможныеВариантыИнтерфейсаКлиентскогоПриложения();
		ТекущийВариантИнтерфейса	 = ВариантИнтерфейсаКлиентскогоПриложения();
		
		Если ТекущийВариантИнтерфейса = ВариантыИнтерфейса.Версия8_2 Тогда
			УстановитьЦветРамкиТаблицФормы();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение		 = Новый ПолеКомпоновкиДанных("ТаблицаСертификатов.ОшибкаАвторизации"); 
	ЭлементОтбора.ВидСравнения		 = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение	 = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(220, 20, 60));
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСертификатовВыбран");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСертификатовПредставление");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСертификатовНаименование");
	
	Если НЕ ОбработкаОбъект().ПриложениеСтаршеВерсии("8.3.3") Тогда
		Элементы.Декорация_ГоризонтальнаяЛиния.ЦветРамки = Новый Цвет(240, 240, 240);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветРамкиТаблицФормы()
	
	Цвет = Новый Цвет();
	Элементы.ТаблицаСертификатов.ЦветРамки	 = Цвет;
	Элементы.ДоступныеОрганизации.ЦветРамки	 = Цвет;
	
КонецПроцедуры

// Возвращает логин пользователя, сохраненный в настройках
//
// Возвращаемое значение:
//  Строка
//
&НаСервереБезКонтекста
Функция НастройкиФормы_ПрочитатьЛогин()
	
	Результат = "";
	
	Значение = ХранилищеНастроекДанныхФорм.Загрузить("Диадок", "Логин");
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Результат = СокрЛП(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НастройкиФормы_ПрочитатьСпособВхода(СпособыВхода)
	
	Результат = ХранилищеНастроекДанныхФорм.Загрузить("Диадок", "СпособВхода");
	Если СпособыВхода.НайтиПоЗначению(Результат) = Неопределено Тогда
		// Например, способ входа, использовавшийся ранее, отключили функциональными опциями
		Результат = СпособыВхода[0].Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура НастройкиФормы_Записать(Логин, СпособВхода)
	
	КлючОбъекта = "Диадок";
	ХранилищеНастроекДанныхФорм.Сохранить(КлючОбъекта, "Логин", Логин);
	ХранилищеНастроекДанныхФорм.Сохранить(КлючОбъекта, "СпособВхода", СпособВхода);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Авторизация

&НаСервере
Процедура НастроитьКомандыПереключенияСпособаВхода(СпособыВхода)
	
	ТекущиеКоманды = Элементы.ПереключениеРежимаВхода.СписокВыбора;
	ТекущиеКоманды.Очистить();
	
	Для Каждого Элемент Из СпособыВхода Цикл
		ТекущиеКоманды.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТипАвторизацииДиадокСертификат()
	Возврат "Сертификат";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипАвторизацииДиадокЛогин()
	Возврат "Логин";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипАвторизацииПорталБраузер()
	Возврат "Портал";
КонецФункции

&НаКлиенте
Процедура КомандаАвторизоваться(Команда)
	
	Метрика_НачатьПолучениеСессий(Команда);
	Авторизоваться();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьСессию(Команда)
	
	Метрика_ЗавершитьСессии(Команда);
	ЗавершитьСессию();
	ПереключитьРежимФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСессию()
	
	Платформа = Модуль_Платформа();
	
	Для Каждого Элемент Из ТекущиеСоединения Цикл
		
		Сессия = Элемент.Значение;
		
		Если Сессия.ЭтоПортальнаяСессия Тогда
			Платформа.Авторизация_СброситьПортальнуюСессию();
		КонецЕсли;
		
		Метрика_ЗакрытаСессия(Сессия);
		
	КонецЦикла;
	
	ЗакрытьАктивныеСоединения();
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться()
	
	ЗакрытьАктивныеСоединения();
	ДоступныеОрганизации.Очистить();
	
	ПараметрыПолученияСессии = Новый Структура;
	ПараметрыПолученияСессии.Вставить("РежимАвторизации", РежимАвторизации);
	
	Платформа = Модуль_Платформа();
	ПриПолученииСессии = Платформа.НовыйОписаниеОповещения(
		"Обработчик_ПриПолученииСессии",
		ЭтаФорма,
		ПараметрыПолученияСессии
	);
	
	Если РежимАвторизации = ТипАвторизацииДиадокСертификат() Тогда
		
		НачатьПолучениеСессийПоСертификатам(ПриПолученииСессии);
		
	ИначеЕсли РежимАвторизации = ТипАвторизацииДиадокЛогин() Тогда
		
		НачатьПолучениеСессииПоЛогину(ПриПолученииСессии);
		
	ИначеЕсли РежимАвторизации = ТипАвторизацииПорталБраузер() Тогда
		
		НачатьПолучениеСессииЧерезБраузер(ПриПолученииСессии);
		
	Иначе
		ВызватьИсключение "ValueError: РежимАвторизации = [" + СокрЛП(РежимАвторизации) + "]";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПриПолученииСессии(СессияИлиМассив, ПараметрыПолученияСессии) Экспорт
	
	Если Не ЗначениеЗаполнено(СессияИлиМассив) Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = ТипЗнч(СессияИлиМассив);
	Если ТипПараметра = Тип("Массив") Или ТипПараметра = Тип("ФиксированныйМассив") Тогда
		ПолученныеСессии = СессияИлиМассив;
	Иначе
		ПолученныеСессии = Новый Массив;
		ПолученныеСессии.Добавить(СессияИлиМассив);
	КонецЕсли;
	
	Буфер = Новый Соответствие;
	Для Каждого Сессия Из ПолученныеСессии Цикл
		Буфер.Вставить(Сессия.Ключ, Сессия);
		Метрика_ПолученаСессия(Сессия);
	КонецЦикла;
	
	ТекущиеСоединения = Новый ФиксированноеСоответствие(Буфер);
	
	ТекущийРежимФормы = РежимФормыВыборОрганизации();
	ПереключитьРежимФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСессииПоЛогину(ПриПолученииСессии)
	
	АвторизацияВозможна = Истина;
	
	Если НЕ ЗначениеЗаполнено(Логин) Тогда
		Метрика_ЗаписатьОшибку("Логин не заполнен", Метрика_ВозможныеКатегории().ПоЛогину, Метрика_ВозможныеДействия().Авторизоваться, "НеЗаполненоПоле");
		АвторизацияВозможна = Ложь;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Пароль) Тогда
		Метрика_ЗаписатьОшибку("Пароль не заполнен", Метрика_ВозможныеКатегории().ПоЛогину, Метрика_ВозможныеДействия().Авторизоваться, "НеЗаполненоПоле");
		АвторизацияВозможна = Ложь;
	КонецЕсли;
	
	Если Не АвторизацияВозможна Тогда
		
		мПоказатьПредупреждение(
			"Введите электронную почту и пароль
			|для авторизации"
		);
		
		Возврат;
		
	КонецЕсли;
	
	Отказ = Ложь;
	Платформа = Модуль_Платформа();
	
	Попытка
		
		Сессия = Платформа.Авторизация_СессияПоЛогину(Логин, Пароль);
		
	Исключение
		
		Отказ = Истина;
		ОшибкаИнфо = ИнформацияОбОшибке();
		
		ДопПеременные = Новый Соответствие;
		ДопПеременные.Вставить("ТипАвторизации", ТипАвторизацииДиадокЛогин());
		
		Если ЯвляетсяОшибкойКатегории(ОшибкаИнфо, ОшибкаНеверныйКлючАПИ()) Тогда
			
			ПоказатьОшибкуНевалидныйКлючАПИ();
			
			ДопПеременные.Вставить("ИдентификаторОшибки", "НекорректныйКлючАпи");
			ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
			
		ИначеЕсли ЯвляетсяОшибкойКатегории(ОшибкаИнфо, ОшибкаНеверныйЛогинПароль()) Тогда
			
			ТекстОшибки = НСтр("ru = 'Не удалось авторизоваться.
			|Проверьте электронную почту и пароль'");
			мПоказатьПредупреждение(ТекстОшибки);
			
			ДопПеременные.Вставить("ИдентификаторОшибки", "НеУдалосьАвторизоваться");
			ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
			
		Иначе
			
			ДопПеременные.Вставить("ИдентификаторОшибки", "НеизвестнаяОшибка");
			ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
			
			ВызватьИсключение;
			
		КонецЕсли;
		
	КонецПопытки;
	
	Если Не Отказ Тогда
		Платформа.ВыполнитьОбработкуОповещенияЛок(ПриПолученииСессии, Сессия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСессийПоСертификатам(ПриПолученииСессии)
	
	Для Каждого Запись Из ТаблицаСертификатов Цикл
		Запись.ОшибкаАвторизации = Ложь;
		Запись.Авторизован = Ложь;
	КонецЦикла;
	
	ВыбранныеСтроки = ТаблицаСертификатов.НайтиСтроки(Новый Структура("Выбран", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		
		ТекстОшибки = "Выберите сертификат для авторизации.";
		Категория = Метрика_ВозможныеКатегории().ПоСертификату;
		Действие = Метрика_ВозможныеДействия().Авторизоваться;
		Метрика_ЗаписатьОшибку(ТекстОшибки, Категория, Действие, "НеВыбранСертификат");
		мПоказатьПредупреждение(ТекстОшибки);
		
		Возврат;
		
	КонецЕсли;
	
	ЕстьУстаревшиеСертификаты = ПроверитьСертификатыНаУстаревшийГОСТ(ВыбранныеСтроки);
	
	Если ЕстьУстаревшиеСертификаты Тогда
		
		ТекстОшибки = 
		"Сертификаты устарели. Обновите их на
		|ГОСТ-2012 через сервисный центр.";
		Категория = Метрика_ВозможныеКатегории().ПоСертификату;
		Действие = Метрика_ВозможныеДействия().Авторизоваться;
		Метрика_ЗаписатьОшибку(ТекстОшибки, Категория, Действие, "УстаревшийГост");
		мПоказатьПредупреждение(ТекстОшибки);
		
		Возврат;
		
	КонецЕсли;
	
	Платформа = Модуль_Платформа();
	
	Отказ = Ложь;
	ПолученныеСессии = Новый Массив;
	
	Для Каждого Запись Из ВыбранныеСтроки Цикл
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		Отпечаток = Запись.ОтпечатокСертификата;
		
		Попытка
			
			Сессия = Платформа.Авторизация_СессияПоСертификату(Отпечаток);
			ПолученныеСессии.Добавить(Сессия);
			
		Исключение
			
			Отказ = Истина;
			ОшибкаИнфо = ИнформацияОбОшибке();
			
			ДопПеременные = Новый Соответствие;
			ДопПеременные.Вставить("ТипАвторизации", ТипАвторизацииДиадокСертификат());
			
			Если ЯвляетсяОшибкойКатегории(ОшибкаИнфо, ОшибкаНеверныйКлючАПИ()) Тогда
				
				ПоказатьОшибкуНевалидныйКлючАПИ();
				
				ДопПеременные.Вставить("ИдентификаторОшибки", "НекорректныйКлючАпи");
				ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
				
			ИначеЕсли ЯвляетсяОшибкойКатегории(ОшибкаИнфо, ОшибкаСертификатНеАвторизован()) Тогда
				
				ТекстОшибки = 
				"По сертификату нет доступа в Диадок:
				|- отпечаток %1
				|- выдан %2
				|
				|Попробуйте авторизоваться в веб-версии, следуя подсказкам сервиса.
				|Если авторизация в веб-версии не помогла, обратитесь в поддержку.";
				
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", Отпечаток);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%2", Запись.Наименование);
				
				мПоказатьПредупреждение(ТекстОшибки);
				
				ДопПеременные.Вставить("ИдентификаторОшибки", "НетДоступа");
				ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
				
			ИначеЕсли ЯвляетсяОшибкойКатегории(ОшибкаИнфо, ОшибкаКриптоПользовательНеВвелПинкод()) Тогда
				
				ТекстОшибки = 
				"Ошибка доступа к контейнеру сертификата:
				|- отпечаток %1
				|- выдан %2
				|
				|Необходимо ввести PIN-код.";
				
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", Отпечаток);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%2", Запись.Наименование);
				
				мПоказатьПредупреждение(ТекстОшибки);
				
				ДопПеременные.Вставить("ИдентификаторОшибки", "ПользовательОтказалсяОтВводаПинкода");
				ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
				
			Иначе
				
				ДопПеременные.Вставить("ИдентификаторОшибки", "НеизвестнаяОшибка");
				ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
				
				ВызватьИсключение;
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		Платформа.ВыполнитьОбработкуОповещенияЛок(ПриПолученииСессии, ПолученныеСессии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСессииЧерезБраузер(ПриПолученииСессии)
	
	Платформа = Модуль_Платформа();
	
	Попытка
		
		Платформа.Авторизация_НачатьПолучениеСессииЧерезБраузер(ПриПолученииСессии);
		
	Исключение
		
		ОшибкаИнфо = ИнформацияОбОшибке();
		
		ДопПеременные = Новый Соответствие;
		ДопПеременные.Вставить("ТипАвторизации", ТипАвторизацииПорталБраузер());
		
		Если ЯвляетсяОшибкойКатегории(ОшибкаИнфо, ОшибкаНеверныйКлючАПИ()) Тогда
			
			ПоказатьОшибкуНевалидныйКлючАПИ();
			
			ДопПеременные.Вставить("ИдентификаторОшибки", "НекорректныйКлючАпи");
			ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
			
		Иначе
			
			ДопПеременные.Вставить("ИдентификаторОшибки", "НеизвестнаяОшибка");
			ОбработатьОшибкуПолученияСессииВызовСервера(ОшибкаИнфо, ДопПеременные);
			
			ВызватьИсключение;
			
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОшибкуПолученияСессииВызовСервера(Знач ОшибкаИнфо, Знач ДопПеременные)
	
	КатегорияМетрики = "Авторизация";
	ДействиеМетрики = "ПолучитьСессию";
	
	Ядро = Модуль_ЯдроНаСервере();
	Ядро.Метрика_ДобавитьОшибку(КатегорияМетрики, ДействиеМетрики, ОшибкаИнфо, ДопПеременные);
	Ядро.Ошибка_Обработать("Авторизация", ОшибкаИнфо);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЯвляетсяОшибкойКатегории(Знач Ошибка, Знач Категория)
	
	Если Категория = ОшибкаСертификатНеАвторизован() Тогда
		Результат = ЭтоОшибкаСертификатНеАвторизован(Ошибка);
	ИначеЕсли Категория = ОшибкаНеверныйКлючАПИ() Тогда
		Результат = ЭтоОшибкаНеверныйКлючАПИ(Ошибка);
	ИначеЕсли Категория = ОшибкаНеверныйЛогинПароль() Тогда
		Результат = ЭтоОшибкаНеверныйЛогинПароль(Ошибка);
	ИначеЕсли Категория = ОшибкаКриптоПользовательНеВвелПинкод() Тогда
		Результат = ЭтоОшибкаКриптоПользовательНеВвелПинкод(Ошибка);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоОшибкаСертификатНеАвторизован(Знач Ошибка)
	
	Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
		ТекстОшибки = НРег(Ошибка);
	Иначе
		ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	КонецЕсли;
	
	// HTTP-ответ с ошибкой вида "401 Certificate with thumbprint <ОТПЕЧАТОК> is not authorized"
	Результат = (Найти(ТекстОшибки, "401") И Найти(ТекстОшибки, "certificate with thumbprint") И Найти(ТекстОшибки, "is not authorized"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоОшибкаНеверныйКлючАПИ(Знач Ошибка)
	
	Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
		ТекстОшибки = НРег(Ошибка);
	Иначе
		ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	КонецЕсли;
	
	Результат = (Найти(ТекстОшибки, "invalid api client id") > 0);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоОшибкаНеверныйЛогинПароль(Знач Ошибка)
	
	Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
		ТекстОшибки = НРег(Ошибка);
	Иначе
		ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	КонецЕсли;
	
	// HTTP-ответ с ошибкой вида "401 Wrong password provided for login <user@mail>"
	Результат = (Найти(ТекстОшибки, "401") И Найти(ТекстОшибки, "wrong password provided for login"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоОшибкаКриптоПользовательНеВвелПинкод(Знач Ошибка)
	
	Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
		ТекстОшибки = НРег(Ошибка);
	Иначе
		ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	КонецЕсли;
	
	// Источник ошибки - библиотека CRYPTOAPI
	// Десятичный код ошибки - 2148532334
	// Шестнадцатиричный код ошибки - 0x8010006E
	Результат = Найти(ТекстОшибки, НРег("CRYPTOAPI[0x8010006E]")) > 0;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаНеверныйКлючАПИ()
	Возврат "InvalidAPIKey";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаНеверныйЛогинПароль()
	Возврат "InvalidLoginOrPassword";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаСертификатНеАвторизован()
	Возврат "CertIsNotAuthorized";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаКриптоПользовательНеВвелПинкод()
	Возврат "CRYPTOAPI[0x8010006E]";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаНеизвестная()
	Возврат "НеизвестнаяОшибка";
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Соеднинения

&НаКлиенте
Процедура ПоказатьОшибкуНевалидныйКлючАПИ()
	
	Платформа = Модуль_Платформа();
	
	ДополнительныеПараметры = Новый Структура;
	
	ОповещениеОЗакрытииФормыОшибок = Платформа.НовыйОписаниеОповещения(
			"ОповещениеОЗакрытииФормыОшибкиКлючаАПИ",
			ЭтаФорма, 
			ДополнительныеПараметры);
	
	ТекстОшибки = НСтр(
		"ru = 'Версия модуля устарела. Требуется обновление.
		|Для продолжения работы скачайте и установите новую
		|версию по кнопке ниже.'"
	);
	
	КнопкаПоУмолчанию = КодВозвратаДиалога.ОК;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КнопкаПоУмолчанию, "Скачать обновление модуля");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Закрыть");
	
	мПоказатьВопрос(ТекстОшибки, СписокКнопок, , КнопкаПоУмолчанию, "", , ОповещениеОЗакрытииФормыОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗакрытииФормыОшибкиКлючаАПИ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Метрика_ПриНажатииКнопкиСкачатьНовуюВерсию();
	
	ГлавнаяФорма = ОсновнаяФорма();
	ГлавнаяФорма.ОткрытьФормуОбновления();
	
	Метрика_ЗаписатьСтатистикуСкачатьОбновлениеМодуля();
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПриНажатииКнопкиСкачатьНовуюВерсию()
	
	НазваниеФормы = "КлючАпиНеДействителен";
	Категория = Метрика_ВозможныеКатегории().НекорректныйКлючАпи;
	Действие = Метрика_ВозможныеДействия().СкачатьОбновлениеМодуля;
	Метка = "Нажатие кнопки";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, Категория, Действие, Метка);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ЗаписатьСтатистикуСкачатьОбновлениеМодуля()
	
	Категория = Метрика_ВозможныеКатегории().НекорректныйКлючАпи;
	Действие = Метрика_ВозможныеДействия().СкачатьОбновлениеМодуля;
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(Категория, Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьАктивныеСоединения()
	
	ТекущиеСоединения = Новый ФиксированноеСоответствие(Новый Соответствие);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Список организаций

// Заполняет таблицу доступных организаций с сервера ДД
//
&НаСервере
Процедура ЗаполнитьДоступныеОрганизации()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Для Каждого Элемент Из ТекущиеСоединения Цикл
		
		Сессия = Элемент.Значение;
		OrganizationList = Ядро.Организации_ДоступныеОрганизации(Сессия);
		ДополнитьСписокОрганизаций(OrganizationList, Сессия);
		
	КонецЦикла;
	
	ДоступныеОрганизации.Сортировать("Наименование");
	
	УстановитьСертификатыОрганизаций();
	
	УстановитьГалочкуВыбратьВсеПоСпискуОрганизаций();
	
	НастроитьОтображениеТарифа();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСертификатыОрганизаций()
	
	Если Не ЗначениеЗаполнено(ТаблицаСертификатов)
		Или РежимАвторизации = ТипАвторизацииДиадокЛогин() Тогда
		Возврат;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаСервере();
	Для Каждого Запись Из ДоступныеОрганизации Цикл
		
		ИдентификаторЯщика = Ядро.АдресЯщикаВИдентификатор(НРег(Запись.BoxId));
		
		СохраненныйОтпечаток = "";
		Для Каждого Элемент Из Запись.ДоступныеСессии Цикл
			
			Сессия = ТекущиеСоединения.Получить(Элемент.Значение);
			СохраненныйОтпечаток = ОтпечатокСертификатаИзНастроек(ИдентификаторЯщика, Сессия.Пользователь.Идентификатор);
			Если ЗначениеЗаполнено(СохраненныйОтпечаток) Тогда
				Запись.КлючСессии = Сессия.Ключ;
				Запись.ИдентификаторПользователя = Сессия.Пользователь.Идентификатор;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СохраненныйОтпечаток)
			И Запись.ДоступныеСертификаты.НайтиПоЗначению(СохраненныйОтпечаток) <> Неопределено Тогда
			Отпечаток = СохраненныйОтпечаток;
		ИначеЕсли Запись.ДоступныеСертификаты.Количество() = 1 Тогда
			Отпечаток = Запись.ДоступныеСертификаты[0].Значение;
		Иначе
			Отпечаток = "";
		КонецЕсли;
		
		НайденныеСертификаты = ТаблицаСертификатов.НайтиСтроки(Новый Структура("ОтпечатокСертификата", Отпечаток));
		СтрокаСертификат = Неопределено;
		Если НайденныеСертификаты.Количество() Тогда
			СтрокаСертификат = НайденныеСертификаты[0];
		КонецЕсли;
		
		ДанныеСертификата = ДанныеСертификатаДляСтрокиОрганизации(СтрокаСертификат, Запись.ДоступныеСертификаты.Количество());
		ЗаполнитьЗначенияСвойств(Запись, ДанныеСертификата);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОтпечатокСертификатаИзНастроек(Знач ИдентификаторЯщика, Знач ИдентификаторПользователя)
	
	Результат = "";
	
	Фильтр = Новый Структура;
	Фильтр.Вставить("ИдентификаторЯщика", ИдентификаторЯщика);
	Фильтр.Вставить("ИдентификаторПользователя", ИдентификаторПользователя);
	
	НайденныеНастройки = НастройкиСеанса.НайтиСтроки(Фильтр);
	Если НайденныеНастройки.Количество() > 0 Тогда
		Результат = НайденныеНастройки[0].ОтпечатокСертификата;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СертификатИспользовалсяРанее(Знач Отпечаток)
	
	Фильтр = Новый Структура;
	Фильтр.Вставить("ОтпечатокСертификата", Отпечаток);
	
	Результат = (НастройкиСеанса.НайтиСтроки(Фильтр).Количество() > 0);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЯщикИспользовалсяРанее(Знач ИдентификаторЯщика)
	
	Фильтр = Новый Структура;
	Фильтр.Вставить("ИдентификаторЯщика", ИдентификаторЯщика);
	
	Результат = (НастройкиСеанса.НайтиСтроки(Фильтр).Количество() > 0);
	
	Возврат Результат;
	
КонецФункции

// Дополняет таблицу организаций элементами из OrganizationList
//
// Параметры:
//  OrganizationList - Массив - см. Организации_ДоступныеОрганизации()
//  Сессия - ФиксированнаяСтруктура - см. Ядро.МодельСессияПользователя
//
&НаСервере
Процедура ДополнитьСписокОрганизаций(OrganizationList, Сессия)
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	Для Каждого Organization Из OrganizationList Цикл
		
		АдресЯщика = Organization.BoxId;
		ИдентификаторЯщика = Модуль_Ядро.АдресЯщикаВИдентификатор(НРег(АдресЯщика));
		
		СтрокаОрганизации = НайтиСтрокуВКоллекции(ДоступныеОрганизации, АдресЯщика, "BoxId");
		
		Если СтрокаОрганизации = Неопределено Тогда
			
			СтрокаОрганизации = ДоступныеОрганизации.Добавить();
			СтрокаОрганизации.КлючСессии = Сессия.Ключ;
			СтрокаОрганизации.ИдентификаторПользователя = Сессия.Пользователь.Идентификатор;
			СтрокаОрганизации.BoxId = АдресЯщика;
			СтрокаОрганизации.OrgID = Organization.OrgID;
			СтрокаОрганизации.Наименование = Organization.Наименование;
			СтрокаОрганизации.Инн = Organization.ИНН;
			СтрокаОрганизации.Кпп = Organization.КПП;
			СтрокаОрганизации.ИдентификаторУчастникаЭДО = Organization.FnsParticipantId;
			КоллекцияИНН_КПП = Модуль_Ядро.ПараметрыВМассив(СтрокаОрганизации.ИНН, СтрокаОрганизации.КПП);
			СтрокаОрганизации.ИНН_КПП = Модуль_Ядро.СоединитьСтроку(КоллекцияИНН_КПП, "-");
			СтрокаОрганизации.Использовать = ЯщикИспользовалсяРанее(ИдентификаторЯщика);
			
		КонецЕсли;
		
		СтрокаОрганизации.ДоступныеСессии.Добавить(Сессия.Ключ, ПредставлениеСессии(Сессия));
		
		Если Не ЗначениеЗаполнено(ТаблицаСертификатов)
			Или РежимАвторизации = ТипАвторизацииДиадокЛогин() Тогда
			Продолжить;
		КонецЕсли;
		
		МоиСертификаты = Модуль_Ядро.Пользователи_МоиСертификаты(АдресЯщика, Сессия);
		
		Если ЗначениеЗаполнено(МоиСертификаты) Тогда
			
			Для Каждого СертификатДД Из МоиСертификаты Цикл
				
				Фильтр = Новый Структура;
				Фильтр.Вставить("ОтпечатокСертификата", СертификатДД.Отпечаток);
				
				Если ТаблицаСертификатов.НайтиСтроки(Фильтр).Количество() > 0
					И СтрокаОрганизации.ДоступныеСертификаты.НайтиПоЗначению(СертификатДД.Отпечаток) = Неопределено Тогда
					СтрокаОрганизации.ДоступныеСертификаты.Добавить(СертификатДД.Отпечаток);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			// Сертификаты не привязаны к сотруднику или не удалось получить список сертификатов сотрудника
			Для Каждого Запись Из ТаблицаСертификатов Цикл
				Если СтрокаОрганизации.ДоступныеСертификаты.НайтиПоЗначению(Запись.ОтпечатокСертификата) = Неопределено Тогда
					СтрокаОрганизации.ДоступныеСертификаты.Добавить(Запись.ОтпечатокСертификата);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСессии(Сессия)
	
	Результат = "Ключ = %1 (%2)";
	Результат = СтрЗаменить(Результат, "%1", Сессия.Ключ);
	Результат = СтрЗаменить(Результат, "%2", Сессия.Пользователь.Представление);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьОтображениеТарифа()
	
	ВыводитьКолонкуТарифа = Ложь;
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	Для Каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл
		
		Сессия = ТекущиеСоединения.Получить(СтрокаОрганизации.КлючСессии);
		
		Если Не ЗначениеЗаполнено(Сессия) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоСтартовый = Модуль_Ядро.КонтурШлюзАвторизации_ЭтоСтартовыйТариф(СтрокаОрганизации.BoxId, Сессия);
		
		Если ЭтоСтартовый Тогда
			ВыводитьКолонкуТарифа = Истина;
			СтрокаОрганизации.Тариф = ИмяТарифаСтартовый();
			СтрокаОрганизации.КартинкаТарифа = АдресКартинкиТарифа;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ДоступныеОрганизацииКартинкаТарифа.Видимость = ВыводитьКолонкуТарифа;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяТарифаСтартовый()
	
	Возврат "Стартовый";
	
КонецФункции

// Описание сертификата в формате строки таблицы организаций
//
// Параметры:
//  СтрокаСертификата		 - Структура - см. функцию НоваяСтрокаСертификата()
//							 - ВыборкаДетальныеЗаписи - поля соответствуют функции НоваяСтрокаСертификата()
//							 - Неопределено 
//  КоличествоСертификатов	 - Число - Количество привязанных к организации сертификатов
// 
// Возвращаемое значение:
//  Структура - данные, представляющие номенклатуру ИБ:
//   * НаименованиеСертификата		 - Строка.
//   * ОтпечатокСертификата			 - Строка.
//   * ОписаниеСертификата			 - Строка	 - описание сертификата в формате: ИНН-КПП-Организация.
//   * ГОСТ							 - Строка	 - ГОСТ.
//   * РедактированиеСертификата	 - Строка	 - надпись в колонке редактирования сертификата.
//   * КартинкаИзменитьСертификат	 - Число	 - индекс картинки редактирования сертификата для таблицы формы.
//   * КартинкаСертификат			 - Число	 - индекс картинки наличия сертификата для таблицы формы.
//
&НаКлиентеНаСервереБезКонтекста
Функция ДанныеСертификатаДляСтрокиОрганизации(Знач СтрокаСертификата, Знач КоличествоСертификатов)
	
	Результат = Новый Структура;
	Результат.Вставить("НаименованиеСертификата"	, "");
	Результат.Вставить("ОтпечатокСертификата"		, "");
	Результат.Вставить("ОписаниеСертификата"		, "");
	Результат.Вставить("ГОСТ"						, "");
	Результат.Вставить("РедактированиеСертификата"	, "");
	Результат.Вставить("КартинкаИзменитьСертификат"	, 1);
	Результат.Вставить("КартинкаСертификат"			, 0);
		
	Если СтрокаСертификата = Неопределено Тогда
	
		СтрокаСертификата					 = НоваяСтрокаСертификата(); 
		Результат.РедактированиеСертификата	 = "Выбрать сертификат";
		
	Иначе
		
		Результат.КартинкаСертификат = 1;
		
		Если КоличествоСертификатов = 1 Тогда
			Результат.КартинкаИзменитьСертификат	 = 0;
		ИначеЕсли КоличествоСертификатов > 1 Тогда
			Результат.КартинкаИзменитьСертификат	 = 2;
			Результат.РедактированиеСертификата	 = "Изменить сертификат";
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.НаименованиеСертификата	 = СтрокаСертификата.Наименование;
	Результат.ОтпечатокСертификата		 = СтрокаСертификата.ОтпечатокСертификата;
	Результат.ОписаниеСертификата		 = СтрокаСертификата.Представление;
	Результат.ГОСТ						 = СтрокаСертификата.ГОСТ;
	
	Возврат Результат;
	
КонецФункции

// Описание строки сертификата при авторизации
// 
// Возвращаемое значение:
//  Структура
&НаКлиентеНаСервереБезКонтекста
Функция НоваяСтрокаСертификата()
	
	Результат = Новый Структура();
	Результат.Вставить("Наименование");
	Результат.Вставить("ОтпечатокСертификата");
	Результат.Вставить("Представление");
	Результат.Вставить("ГОСТ");
	Результат.Вставить("ИстекаетСрок");
	Результат.Вставить("Организация");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("Издатель");
	Результат.Вставить("ДатаВыдачи");
	Результат.Вставить("СрокДействия");
	Результат.Вставить("Выбран");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьГалочкуВыбратьВсеПоСпискуОрганизаций()

	Если ДоступныеОрганизации.Количество() > 0 Тогда
		НеВыбраннаяСтрока = НайтиСтрокуВКоллекции(ДоступныеОрганизации, Ложь, "Использовать");
		ВыбратьВсеОрганизации = НеВыбраннаяСтрока = Неопределено;
	КонецЕсли; 

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Список сертификатов

&НаКлиенте
Процедура ЗаполнитьТаблицуСертификатов()
	
	ТаблицаСертификатов.Очистить();
	
	СписокСертификатов = Новый Массив;
	
	Попытка
		
		Модуль_Ядро = Модуль_ЯдроНаКлиенте();
		
		СписокСертификатов = Модуль_Ядро.Сертификаты_СписокСертификатов();
		
	Исключение
		
		ТаблицаСертификатов.Очистить();
		
		Ошибка = ИнформацияОбОшибке();
		
		НетСертификатовПодробности = КраткоеПредставлениеОшибки(Ошибка);
		
		Категория	 = Метрика_ВозможныеКатегории().Авторизация;
		Действие	 = Метрика_ВозможныеДействия().ОткрытиеФормы;
		ТекстОшибки	 = ПодробноеПредставлениеОшибки(Ошибка);
		Метрика_ЗаписатьОшибку(ТекстОшибки, Категория, Действие, "НетДоступаКСертификатам");
		
	КонецПопытки;
	
	Для Каждого Сертификат Из СписокСертификатов Цикл
		
		Стр = ТаблицаСертификатов.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Сертификат);
		
		Если СтрДлина(Стр.ИНН) = 12 Тогда
			Стр.КПП = "";
		КонецЕсли; 
		
		ИНН_КПП = Модуль_Ядро.СоединитьСтроку(Модуль_Ядро.ПараметрыВМассив(Стр.ИНН, Стр.КПП), "-");
		Стр.Представление = Модуль_Ядро.СоединитьСтроку(Модуль_Ядро.ПараметрыВМассив(ИНН_КПП, Стр.Организация), " • ");
		Стр.ИстекаетСрок = 60*60*24*30 >= (Стр.СрокДействия - ТекущаяДата());
		
		Стр.Выбран = СертификатИспользовалсяРанее(Сертификат.ОтпечатокСертификата);
		
	КонецЦикла;
	
	ТаблицаСертификатов.Сортировать("Наименование, ДатаВыдачи убыв");
	
КонецПроцедуры

&НаКлиенте
Функция НетДоступаКСертификатам()
	
	Результат = Элементы.РежимыАвторизации.ТекущаяСтраница = Элементы.СтраницаВходПоСертификатуНедоступен;
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция ПроверитьСертификатыНаУстаревшийГОСТ(ВыбранныеСертификаты)

	Результат = Ложь;
	
	УстаревшиеСертификаты = СертификатыГОСТ2001(ВыбранныеСертификаты);
	
	Результат = УстаревшиеСертификаты.Количество() > 0;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СертификатыГОСТ2001(ВыбранныеСертификаты)
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаСертификата Из ВыбранныеСертификаты Цикл
		
		Если СтрокаСертификата.ГОСТ = "2001" Тогда
			
			НайденныйСертификат = Результат.Найти(СтрокаСертификата.Отпечаток);
			
			Если НайденныйСертификат = Неопределено Тогда
				
				Результат.Добавить(СтрокаСертификата.Отпечаток);
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРедактированияСоответствияСертификатов(СтрокаОрганизации)
	
	Если СтрокаОрганизации.ДоступныеСертификаты.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ВыборОрганизаций;
	Если ЗначениеЗаполнено(СтрокаОрганизации.ОтпечатокСертификата) Тогда
		Действие	 = Метрика_ВозможныеДействия().ИзменитьСертификат;
	Иначе
		Действие	 = Метрика_ВозможныеДействия().ВыбратьСертификат;
	КонецЕсли;
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы, , Организацияboxid);
	
	Если ТаблицаСертификатов.Количество() = 0 Тогда
		ЗаполнитьТаблицуСертификатов();
	КонецЕсли;
	
	ДоступныеСертификатыМассив = СтрокаОрганизации.ДоступныеСертификаты.ВыгрузитьЗначения();
	ОписанияСертификатов = Новый Массив;
	Для каждого СтрокаСертификата Из ТаблицаСертификатов Цикл
		
		Если ДоступныеСертификатыМассив.Найти(СтрокаСертификата.ОтпечатокСертификата) <> Неопределено Тогда
			
			ОписаниеСертификата = НоваяСтрокаСертификата();
			ЗаполнитьЗначенияСвойств(ОписаниеСертификата, СтрокаСертификата, , "Выбран");
			
			Если СтрокаОрганизации.ОтпечатокСертификата = ОписаниеСертификата.ОтпечатокСертификата Тогда
				ОписаниеСертификата.Выбран = Истина;
			КонецЕсли;
			
			ОписанияСертификатов.Добавить(ОписаниеСертификата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация"			, СтрокаОрганизации.Наименование);
	ПараметрыОткрытияФормы.Вставить("ОрганизацияBoxId"		, СтрокаОрганизации.boxid);
	ПараметрыОткрытияФормы.Вставить("ОписанияСертификатов"	, ОписанияСертификатов);
	ПараметрыОткрытияФормы.Вставить("ТекущийРежимФормы"		, РежимФормыВыборСертификата());
	
	Модуль_Платформа = Модуль_Платформа();
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("СтрокаОрганизации"		, СтрокаОрганизации);
	ОписаниеОповещения = Модуль_Платформа.НовыйОписаниеОповещения(
		"ФормаРедактированияСоответствияСертификатовПослеВыбора",
		ЭтаФорма,
		ПараметрыОповещения
	);
	
	Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
		"АвторизацияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Функция ИндексСрокиТаблицы(Таблица, Строка)
	
	Результат = Строка.ПолучитьИдентификатор();
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Приступить к работе

&НаКлиенте
Процедура КомандаПриступитьКРаботе(Команда)
	
	Метрика_ПриступитьКРаботе(Команда);
	ПриступитьКРаботе();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриступитьКРаботе()
	
	ОрганизацииДляВхода = ДоступныеОрганизации.НайтиСтроки(Новый Структура("Использовать", Истина));
	
	Если Не ЗначениеЗаполнено(ОрганизацииДляВхода) Тогда
		
		мПоказатьПредупреждение("Не выбрано ни одной организации для работы");
		Метрика_ПриступитьКРаботе_НеВыбранаОрганизация();
		Возврат;
		
	КонецЕсли;
	
	Если Не ОрганизацииИмеютОдинаковыйТариф(ОрганизацииДляВхода) Тогда
		
		ТекстОшибки = НСтр("ru='Вы попытались авторизоваться под организациями с разными
								|тарифными планами. Одновременное использование тарифов
								|""Стартовый"" и ""Универсальный"" невозможно.
								|Выберите организации, которые используют один тариф.'");
		
		мПоказатьПредупреждение(ТекстОшибки);
		Метрика_ПриступитьКРаботе_ВыбраныРазныеТарифы();
		Возврат;
		
	КонецЕсли;
	
	ЕстьЯщикиССертификатом = Ложь;
	Для Каждого Запись Из ОрганизацииДляВхода Цикл
		Если ЗначениеЗаполнено(Запись.ОтпечатокСертификата) Тогда
			ЕстьЯщикиССертификатом = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РежимАвторизации = ТипАвторизацииДиадокСертификат()
		Или ЕстьЯщикиССертификатом Тогда
		
		ЯщикиБезСертификата = Новый Массив;
		
		Для Каждого Запись Из ОрганизацииДляВхода Цикл
			
			Если ЗначениеЗаполнено(Запись.ОтпечатокСертификата) Тогда
				Продолжить;
			КонецЕсли;
			
			ЯщикиБезСертификата.Добавить(Запись.BoxId);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЯщикиБезСертификата) Тогда
			
			ТекстОшибки = "Выберите сертификат для каждой организации.";
			мПоказатьПредупреждение(ТекстОшибки);
			Метрика_ПриступитьКРаботе_НеУказанСертификат(ЯщикиБезСертификата);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Платформа = Модуль_Платформа();
	КлиентскиеСертификаты = ОписанияВыбранныхСертификатов();
	
	ЗаполненныйКонтекст = Новый Соответствие;
	
	Для Каждого Запись Из ОрганизацииДляВхода Цикл
		
		АдресЯщика = Запись.BoxId;
		Соединение = ТекущиеСоединения.Получить(Запись.КлючСессии);
		Сертификат = КлиентскиеСертификаты.Получить(Запись.ОтпечатокСертификата);
		СтрокаКонтекста = Платформа.Сеанс_НоваяСтрока(АдресЯщика, Соединение, Сертификат);
		
		ЗаполненныйКонтекст.Вставить(АдресЯщика, СтрокаКонтекста);
		
	КонецЦикла;
	
	НастройкиФормы_Записать(Логин, РежимАвторизации);
	
	Закрыть(ЗаполненныйКонтекст);
	
КонецПроцедуры

&НаКлиенте
Функция ОписанияВыбранныхСертификатов()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Результат = Новый Соответствие;
	
	ОрганизацииДляВхода = ДоступныеОрганизации.НайтиСтроки(Новый Структура("Использовать", Истина));
	
	Для Каждого Запись Из ОрганизацииДляВхода Цикл
		
		ОтпечатокСертификата = Запись.ОтпечатокСертификата;
		Если Не ЗначениеЗаполнено(ОтпечатокСертификата)
			Или Результат.Получить(ОтпечатокСертификата) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СертификатДанные = Ядро.Сертификаты_ДанныеСертификата(ОтпечатокСертификата);
		СертификатBase64 = Ядро.Сертификаты_СертификатВBase64(ОтпечатокСертификата);
		СертификатОписание = Ядро.Сертификаты_ОписаниеСертификата(СертификатДанные);
		СертификатОписание.Вставить("Base64", СертификатBase64);
		
		Результат.Вставить(ОтпечатокСертификата, СертификатОписание);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОрганизацииИмеютОдинаковыйТариф(ОрганизацииДляВхода)
	
	Тарифы = Новый Соответствие;
	
	Для Каждого Запись Из ОрганизацииДляВхода Цикл
		Тарифы.Вставить(Запись.Тариф, Истина);
	КонецЦикла;
	
	Результат = (Тарифы.Количество() <= 1);
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ДЕКОРАЦИИ ФОРМЫ

&НаКлиенте
Процедура НетСертификатовПоказатьПодробностиНажатие(Элемент)
	
	Метрика_НетСертификатовПоказатьПодробности(Элемент);
	
	Элементы.НетСертификатовПодробности.Видимость = НЕ Элементы.НетСертификатовПодробности.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация_ЗабылиПарольНажатие(Элемент)
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ПоЛогину;
	Действие		 = Метрика_ВозможныеДействия().ЗабылиПароль;
	ДопПеременные	 = Новый Соответствие;
	ДопПеременные.Вставить("Логин", Логин);
	
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы, ДопПеременные, , Истина);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	АдресаИнтернетРесурсов = Ядро.Перечисление_АдресаИнтернетРесурсов();
	
	ПерейтиПоНавигационнойСсылке(АдресаИнтернетРесурсов.СтраницаСменыПароля);
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация_НетСертификатаНажатие(Элемент)
	
	Метрика_НетСертификатаНажатие();
	
	ПоказатьФормуНетНужногоСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуНетНужногоСертификата()
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПропуститьВыборОрганизацииДляЧатаИEmail", Истина);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "НетНужногоСертификата");
	ПараметрыОткрытияФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы, ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦП_НетСертификатовСсылкаНажатие(Элемент)
	
	Метрика_НужнаПомощьНажатие(Элемент);
	
	Платформа = Модуль_Платформа();
	Платформа.ЦентрПоддержки_Открыть("", ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСДаннымиСертификата(ДанныеТекущейСтроки)
	
	ОписаниеСертификата = Модуль_ЯдроНаКлиенте().Сертификаты_Контракт_ОписаниеСертификата();
	ЗаполнитьЗначенияСвойств(ОписаниеСертификата, ДанныеТекущейСтроки);
	
	Платформа = Модуль_Платформа();
	Платформа.ПоказатьОписаниеСертификата(ОписаниеСертификата, ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФормаРедактированияСоответствияСертификатовПослеВыбора(ВыбранныйОтпечаток, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныйОтпечаток) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСертификата = НайтиСтрокуВКоллекции(ТаблицаСертификатов, ВыбранныйОтпечаток, "ОтпечатокСертификата");
	Если СтрокаСертификата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОрганизации = ДополнительныеПараметры.СтрокаОрганизации;
	
	ОписаниеСертификата = НоваяСтрокаСертификата();
	ЗаполнитьЗначенияСвойств(ОписаниеСертификата, СтрокаСертификата);
	
	ДанныеСертификата = ДанныеСертификатаДляСтрокиОрганизации(ОписаниеСертификата, СтрокаОрганизации.ДоступныеСертификаты.Количество());
	
	ЗаполнитьЗначенияСвойств(СтрокаОрганизации, ДанныеСертификата);
	
	Если РежимАвторизации = ТипАвторизацииДиадокСертификат() Тогда
		// Отпечаток сертификата определяет сессию
		НовыйКлючСессии = ВыбранныйОтпечаток;
		
		Сессия = ТекущиеСоединения.Получить(НовыйКлючСессии);
		Если Сессия <> Неопределено Тогда
			СтрокаОрганизации.КлючСессии = Сессия.Ключ;
			СтрокаОрганизации.ИдентификаторПользователя = Сессия.Пользователь.Идентификатор;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеРежимаВходаПриИзменении(Элемент)
	
	Метрика_ПереключениеРежимаВхода();
	ПереключитьРежимФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеОрганизацииВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоступныеОрганизации.ТекущиеДанные;
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ВыборОрганизаций;
	Действие		 = Метрика_ВозможныеДействия().Чекбокс;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("true/false"				, ТекущиеДанные.Использовать);
	
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы, ДопПеременные, ТекущиеДанные.boxid);
	
	НеВыбраннаяСтрока = НайтиСтрокуВКоллекции(ДоступныеОрганизации, Ложь, "Использовать");
	ВыбратьВсеОрганизации = НеВыбраннаяСтрока = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КАвторизации(Команда)
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ВыборОрганизаций;
	Действие		 = Метрика_ВозможныеДействия().КАвторизации;
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы);
	
	ТекущийРежимФормы = РежимФормыАвторизация();
	ПереключитьРежимФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаСертификатовКартинкаДанныеСертификата" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеТекущейСтроки = Элементы.ТаблицаСертификатов.ТекущиеДанные;
		
		НазваниеФормы	 = Метрика_НазваниеФормы();
		Действие		 = Метрика_ВозможныеДействия().ОткрытьСертификат;
		ДопПеременные	 = Новый Соответствие;
		ДопПеременные.Вставить("Отпечаток"		, ДанныеТекущейСтроки.ОтпечатокСертификата);
		ДопПеременные.Вставить("Срок действия"	, ДанныеТекущейСтроки.СрокДействия);
		
		Если ТекущийРежимФормы = РежимФормыВыборСертификата() Тогда
			
			Категория	 = Метрика_ВозможныеКатегории().ВыборСертификата;
			Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", "Выбор сертификата", ДопПеременные, Организацияboxid);
			
		Иначе
			
			Категория	 = Метрика_ВозможныеКатегории().ПоСертификату;
			Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы, ДопПеременные);
			
		КонецЕсли;
		
		ОткрытьФормуСДаннымиСертификата(ДанныеТекущейСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСертификатовВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	
	Если ТекущийРежимФормы = РежимФормыВыборСертификата() Тогда
		
		НазваниеФормы	 = Метрика_НазваниеФормы();
		Категория		 = Метрика_ВозможныеКатегории().ВыборСертификата;
		Действие		 = Метрика_ВозможныеДействия().Переключатель;
		Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", "Выбор сертификата", , Организацияboxid);

		ИндексТекущейСтроки = ИндексСрокиТаблицы(ТаблицаСертификатов, ТекущиеДанные);
		Для каждого СтрокаСертификата Из ТаблицаСертификатов Цикл
			
			ИндексСтроки = ИндексСрокиТаблицы(ТаблицаСертификатов, СтрокаСертификата);
			Если СтрокаСертификата.Выбран = Истина И ИндексСтроки <> ИндексТекущейСтроки Тогда
				
				СтрокаСертификата.Выбран = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		НазваниеФормы	 = Метрика_НазваниеФормы();
		Категория		 = Метрика_ВозможныеКатегории().ПоСертификату;
		Действие		 = Метрика_ВозможныеДействия().ЧекБокс;
		
		ДопПеременные = Новый Соответствие;
		ДопПеременные.Вставить("Отпечаток"	, ТекущиеДанные.ОтпечатокСертификата);
		ДопПеременные.Вставить("true/false"	, ТекущиеДанные.Выбран);
		Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы, ДопПеременные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыборСертификата(Команда)
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ВыборСертификата;
	Действие		 = Метрика_ВозможныеДействия().Сохранить;
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", "Выбор сертификата", , Организацияboxid);
	
	СтрокаСертификата = НайтиСтрокуВКоллекции(ТаблицаСертификатов, Истина, "Выбран");
	
	Если СтрокаСертификата <> Неопределено Тогда
		Попытка
			Закрыть(СтрокаСертификата.ОтпечатокСертификата);
		Исключение
			
			Категория	 = Метрика_ВозможныеКатегории().ПоСертификату;
			Действие	 = Метрика_ВозможныеДействия().Сохранить;
			ТекстОшибки	 = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Метрика_ЗаписатьОшибку(ТекстОшибки, Категория, Действие, "НеизвестнаяОшибка");
			
			Модуль_ЯдроНаКлиенте().Ошибка_Обработать("Выбор сертификата", ТекстОшибки);
			
		КонецПопытки;
	Иначе
		Категория	 = Метрика_ВозможныеКатегории().ПоСертификату;
		Действие	 = Метрика_ВозможныеДействия().Сохранить;
		ТекстОшибки	 = "Выберите сертификат для авторизации " + Организация;
		Метрика_ЗаписатьОшибку(ТекстОшибки, Категория, Действие, "НеВыбранСертификат");
		
		мПоказатьПредупреждение(ТекстОшибки);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборСертификата(Команда)
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ВыборСертификата;
	Действие		 = Метрика_ВозможныеДействия().Отменить;
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", "Выбор сертификата", , Организацияboxid);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДоступныеОрганизацииРедактированиеСертификата" Тогда
		ДанныеСтроки = Элементы.ДоступныеОрганизации.ТекущиеДанные;
		ОткрытьФормуРедактированияСоответствияСертификатов(ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеОрганизацииПриИзменении(Элемент)
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ВыборОрганизаций;
	Действие		 = Метрика_ВозможныеДействия().ВыбратьВсе;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("true/false"				, ВыбратьВсеОрганизации);
	ДопПеременные.Вставить("Количество строк в ТЧ"	, ДоступныеОрганизации.Количество());
	
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы, ДопПеременные);
	
	Для каждого СтрокаОрганизации Из ДоступныеОрганизации Цикл
		СтрокаОрганизации.Использовать = ВыбратьВсеОрганизации;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ПоЛогину;
	Действие		 = Метрика_ВозможныеДействия().ЭлектроннаяПочта;
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, Категория, Действие, "Нажать кнопку");
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	НазваниеФормы	 = Метрика_НазваниеФормы();
	Категория		 = Метрика_ВозможныеКатегории().ПоЛогину;
	Действие		 = Метрика_ВозможныеДействия().Пароль;
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, Категория, Действие, "Нажать кнопку");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиентеНаСервереБезКонтекста
Функция НайтиСтрокуВКоллекции(Коллекция, Значение, ИмяКолонки)
	
	Строки = Коллекция.НайтиСтроки(Новый Структура(ИмяКолонки, Значение));
	
	Если Строки.Количество() > 0 Тогда
		Результат = Строки[0];
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура мПоказатьПредупреждение(Текст, Таймаут = 0, Заголовок = Неопределено, Оповещение = Неопределено)
	
	Платформа = Модуль_Платформа();
	Платформа.ПоказатьПредупреждениеЛок(Оповещение, Текст, Таймаут, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура мПоказатьВопрос(ТекстВопроса,
			Кнопки,
			Таймаут = 0,
			КнопкаПоУмолчанию = Неопределено,
			Заголовок = Неопределено,
			КнопкаТаймаута = Неопределено,
			Оповещение = Неопределено)
	
	Платформа = Модуль_Платформа();
	Платформа.ПоказатьВопросЛок(
		Оповещение,
		ТекстВопроса,
		Кнопки,
		Таймаут,
		КнопкаПоУмолчанию,
		Заголовок,
		КнопкаТаймаута
	);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Метрики

&НаКлиенте
Процедура Метрика_НетСертификатаНажатие()
	
	НазваниеФормы = Метрика_НазваниеФормы();
	Категория = Метрика_ВозможныеКатегории().ПоСертификату;
	Действие = Метрика_ВозможныеДействия().НетНужногоСертификата;
	
	Метрика_ДобавитьСводноеСобытие(НазваниеФормы, Категория, Действие, "Нажать кнопку", НазваниеФормы);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_ВозможныеДействия()

	Результат = Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_ВозможныеКатегории()
	
	Результат = Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ДобавитьСводноеСобытие(ИмяФормы, КатегорияМетрики, ДействиеМетрики, Метка, Представление, ДопПеременные = Неопределено, boxid = "", ОтправитьСПустымBoxid = Ложь)
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(ИмяФормы, КатегорияМетрики, ДействиеМетрики, Метка, Представление);
	
	Если ЗначениеЗаполнено(boxid) ИЛИ ОтправитьСПустымBoxid Тогда
		Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(boxid, КатегорияМетрики, ДействиеМетрики, , ДопПеременные);
	Иначе
		Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(КатегорияМетрики, ДействиеМетрики, , ДопПеременные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ЗаписатьОшибку(ТекстОшибки, Категория, Действие, ИдентификаторОшибки)
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Идентификатор ошибки"	, ИдентификаторОшибки);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьОшибку_СУчетомЗаполненияКонтекста(Категория, Действие, ТекстОшибки, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеФормы()

	Результат = "Авторизация";
	
	Если ТекущийРежимФормы = РежимФормыВыборСертификата() Тогда
		
		Результат = "ВыборСертифаката";
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ПереключениеРежимаВхода()
	
	Переменные = Новый Соответствие;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = "ВыбратьСпособВхода";
	Метка = РежимАвторизации;
	
	Ядро.Метрика_ДобавитьПоведение(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_НачатьПолучениеСессий(Команда)
	
	Переменные = Новый Соответствие;
	
	Если РежимАвторизации = ТипАвторизацииДиадокСертификат() Тогда
		КоличествоСертификатов = ТаблицаСертификатов.НайтиСтроки(Новый Структура("Выбран", Истина)).Количество();
		Переменные.Вставить("КоличествоВыбранныхСертификатов", КоличествоСертификатов);
	КонецЕсли;
	
	Если РежимАвторизации = ТипАвторизацииДиадокЛогин() Тогда
		Переменные.Вставить("Логин", Логин);
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = Команда.Имя;
	Метка = РежимАвторизации;
	
	Ядро.Метрика_ДобавитьПоведение(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПолученаСессия(Сессия)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = "СоздатьСессию";
	Метка = Команды.Авторизоваться.Имя;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("СхемаАутентификации", Сессия.СхемаАутентификации);
	Переменные.Вставить("UserId", Сессия.Пользователь.Идентификатор);
	
	Ядро.Метрика_ДобавитьСтатистику(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ЗавершитьСессии(Команда)
	
	Переменные = Новый Соответствие;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = Команда.Имя;
	Метка = РежимАвторизации;
	
	Ядро.Метрика_ДобавитьПоведение(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ЗакрытаСессия(Сессия)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = "ЗавершитьСессию";
	Метка = Команды.ЗавершитьСессию.Имя;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("СхемаАутентификации", Сессия.СхемаАутентификации);
	Переменные.Вставить("UserId", Сессия.Пользователь.Идентификатор);
	
	Ядро.Метрика_ДобавитьСтатистику(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПриступитьКРаботе(Команда)
	
	Переменные = Новый Соответствие;
	
	ВыбранныеОрганизации = ДоступныеОрганизации.НайтиСтроки(Новый Структура("Использовать", Истина));
	
	УникальныеСессии = Новый Массив;
	УникальныеОтпечатки = Новый Массив;
	УникальныеПользователи = Новый Массив;
	
	Для Каждого Запись Из ВыбранныеОрганизации Цикл
		
		Сессия = ТекущиеСоединения.Получить(Запись.КлючСессии);
		
		Переменные.Вставить(Сессия.СхемаАутентификации, Истина);
		
		Если УникальныеСессии.Найти(Сессия.Ключ) = Неопределено Тогда
			УникальныеСессии.Добавить(Сессия.Ключ);
		КонецЕсли;
		
		Если УникальныеПользователи.Найти(Сессия.Пользователь.Идентификатор) = Неопределено Тогда
			УникальныеПользователи.Добавить(Сессия.Пользователь.Идентификатор);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.ОтпечатокСертификата)
			И УникальныеОтпечатки.Найти(Запись.ОтпечатокСертификата) = Неопределено Тогда
			УникальныеОтпечатки.Добавить(Запись.ОтпечатокСертификата);
		КонецЕсли;
		
	КонецЦикла;
	
	Переменные.Вставить("КоличествоЯщиков", ВыбранныеОрганизации.Количество());
	Переменные.Вставить("КоличествоСессий", УникальныеСессии.Количество());
	Переменные.Вставить("КоличествоСертификатов", УникальныеОтпечатки.Количество());
	Переменные.Вставить("КоличествоПользователей", УникальныеПользователи.Количество());
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = Команда.Имя;
	Метка = "";
	
	Ядро.Метрика_ДобавитьПоведение(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ПриступитьКРаботе_НеВыбранаОрганизация()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Категория = Ядро.Метрика_НазваниеКатегории().ВыборОрганизаций;
	Действие = Ядро.Метрика_НазваниеДействий().ПриступитьКРаботе;
	ТекстОшибки = "Не выбрано ни одной организации для работы";
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Идентификатор ошибки", "НеВыбранаОрганизация");
	
	Ядро.Метрика_ДобавитьОшибку_СУчетомЗаполненияКонтекста(Категория, Действие, ТекстОшибки, ДопПеременные);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ПриступитьКРаботе_ВыбраныРазныеТарифы()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Категория = Ядро.Метрика_НазваниеКатегории().ВыборОрганизаций;
	Действие = Ядро.Метрика_НазваниеДействий().ПриступитьКРаботе;
	ТекстОшибки = "Выбраны организации с разными тарифами";
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Идентификатор ошибки", "ВыбраныРазныеТарифы");
	
	Ядро.Метрика_ДобавитьОшибку_СУчетомЗаполненияКонтекста(Категория, Действие, ТекстОшибки, ДопПеременные);
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ПриступитьКРаботе_НеУказанСертификат(Знач СписокЯщиков)
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Категория = Ядро.Метрика_НазваниеКатегории().ВыборОрганизаций;
	Действие = Ядро.Метрика_НазваниеДействий().ПриступитьКРаботе;
	ТекстОшибки = "Выбраны организации с разными тарифами";
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Идентификатор ошибки", "НеВыбранСертификат");
	
	Для Каждого BoxId Из СписокЯщиков Цикл
		Ядро.Метрика_ДобавитьОшибку_ДляОрганизации(BoxId, Категория, Действие, ТекстОшибки, ДопПеременные);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_НужнаПомощьНажатие(Элемент)
	
	Переменные = Новый Соответствие;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = Ядро.Метрика_НазваниеДействий().ЗадатьВопросОнлайнКонсультанту;
	Метка = Элемент.Имя;
	
	Ядро.Метрика_ДобавитьПоведение(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_НетСертификатовПоказатьПодробности(Элемент)
	
	Переменные = Новый Соответствие;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = Ядро.Метрика_НазваниеКатегории().Авторизация;
	Действие = "ПоказатьПодробности";
	Метка = Элемент.Имя;
	
	Ядро.Метрика_ДобавитьПоведение(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦП_НетОрганизацийСсылкаНажатие(Элемент)
	
	Метрика_НужнаПомощьНажатие(Элемент);
	
	Платформа = Модуль_Платформа();
	Платформа.ЦентрПоддержки_Открыть("", ИмяФормы);
	
КонецПроцедуры

