// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//{		Сервисные методы

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Результат = Модуль_Платформа().Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

//}		Сервисные методы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПараметрыФормы();
	
	ЗаполнитьНастройкамиПоВидуДокумента();
	
	УстановитьВидимостьДоступностьЭлементов();
	
	Ядро = Модуль_ЯдроНаСервере();
	ИмяСправочникаОбработки = Ядро.Справочники_ДополнительнаяОбработка();
	
	// + ШХ
	// т1к Гирфанов Р.Э., 2023.07.18 Доработка по обработке Контур Диадок: e1cib/data/Справочник.Карточка?ref=861a005056b60a3c11ee20d6073ba6b3 {
	шх_ОбработатьФорму();
	// - ШХ
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкамиПоВидуДокумента()
	
	ЗаполнитьНастрокуФормироватьНаОсновании();
	
	ЗаполнитьНастройкиФорматов();
	
	ЗаполнитьНастройкиПечатныхФорм();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастрокуФормироватьНаОсновании()
			
	ДоступныеОснования	= Модуль_ЯдроНаСервере().МенеджерИнтеграции_СписокОснованийВидаЭлектронногоДокумента(НастройкаДокументаНаОтправку.ВидДокумента);
	СписокОснований		= Элементы.ФормироватьНаОсновании.СписокВыбора;
	
	Для Каждого ДоступноеОснование Из ДоступныеОснования Цикл
		СписокОснований.Добавить(ДоступноеОснование.Значение, ДоступноеОснование.Представление);
	КонецЦикла;
			
	ФормироватьНаОсновании = НастройкаДокументаНаОтправку.ФормироватьНаОсновании;
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиФорматов()
	
	ФорматыОтправкиДокументов		= Модуль_ЯдроНаСервере().Перечисление_ФорматыОтправкиДокументов();
	НаименованиеФорматовОтправки	= Модуль_ЯдроНаСервере().Перечисление_НаименованияФорматовОтправкиДокументов();
	
	Заголовок		= НастройкаДокументаНаОтправку.Наименование;
	ФорматыКонтента	= НастройкаДокументаНаОтправку.ФорматыКонтента;
	
	СписокФорматов = Элементы.ФорматОтправки.СписокВыбора;
	
	Если НастройкаДокументаНаОтправку.Формализованный Тогда
		
		ИспользуетсяФорматФНС = (ФорматыКонтента.НайтиПоЗначению(ФорматыОтправкиДокументов.pf_diadoc) = Неопределено);
		
		Если ИспользуетсяФорматФНС Тогда
			
			СписокФорматов.Добавить(ФорматыОтправкиДокументов.fns, НаименованиеФорматовОтправки.fns);
		
		    СписокВыбораФорматовКонтента = Элементы.ФорматКонтента.СписокВыбора;
		
			Для Каждого Элемент Из ФорматыКонтента Цикл
				
				ЭтоФорматКонтента = НЕ ФорматыОтправкиДокументов.Свойство(Элемент.Значение);
				
				Если ЭтоФорматКонтента Тогда
					СписокВыбораФорматовКонтента.Добавить(Элемент.Значение, Элемент.Представление);
				КонецЕсли;
				
			КонецЦикла;
			
			ВыбранФорматКонтента = НЕ ФорматыОтправкиДокументов.Свойство(НастройкаДокументаНаОтправку.ФорматКонтента);
			
			Если ВыбранФорматКонтента Тогда
				
				ВыбранныйФорматОтправки = ФорматыОтправкиДокументов.fns;
				ФорматКонтента = НастройкаДокументаНаОтправку.ФорматКонтента;
				
			Иначе
				
				ВыбранныйФорматОтправки = НастройкаДокументаНаОтправку.ФорматКонтента;
				
				Если СписокВыбораФорматовКонтента.Количество() > 0 Тогда
					ФорматКонтента = СписокВыбораФорматовКонтента[0].Значение;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			СписокФорматов.Добавить(ФорматыОтправкиДокументов.pf_diadoc, НаименованиеФорматовОтправки.pf_diadoc);
			ВыбранныйФорматОтправки = ФорматыОтправкиДокументов.pf_diadoc;
			
		КонецЕсли;
		
		Если ФорматыКонтента.НайтиПоЗначению(ФорматыОтправкиДокументов.epf) <> Неопределено Тогда
			СписокФорматов.Добавить(ФорматыОтправкиДокументов.epf, НаименованиеФорматовОтправки.epf);
		КонецЕсли;
		
	Иначе
		
		ЗаполнитьСписокФорматовДляНеформализованногоДокумента(СписокФорматов, ФорматыКонтента);
						
		ТекущийФорматЭтоФорматСТиповойПФ1С	= (НастройкаДокументаНаОтправку.ФорматКонтента = ФорматыОтправкиДокументов.pf_1c);
		ДоступнаНастройкаИспользоватьПФ1С	= Модуль_ЯдроНаСервере().НастройкиДокументов_ПоказатьНастройку_ТиповаяПФ1С(НастройкаДокументаНаОтправку.ВидДокумента, ФормироватьНаОсновании);
		
		ПринудительноСброситьНастройкуИспользоватьПФ1С = (ТекущийФорматЭтоФорматСТиповойПФ1С И Не ДоступнаНастройкаИспользоватьПФ1С);
		
		Если ПринудительноСброситьНастройкуИспользоватьПФ1С Тогда
			ВыбранныйФорматОтправки = ФорматыОтправкиДокументов.pf_diadoc;
		Иначе
			ВыбранныйФорматОтправки = НастройкаДокументаНаОтправку.ФорматКонтента;
		КонецЕсли;
				
	КонецЕсли;
	
	ФорматОтправки = ВыбранныйФорматОтправки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокФорматовДляНеформализованногоДокумента(СписокФорматов, ФорматыКонтента)
	
	СписокОснований = Модуль_ЯдроНаСервере().МенеджерИнтеграции_СписокОснованийВидаЭлектронногоДокумента(НастройкаДокументаНаОтправку.ВидДокумента);
	ФункциональностьРеализована = (СписокОснований.Количество() > 0);
			
	Если ФункциональностьРеализована Тогда
		ДоступнаТиповаяПФ1С	= Модуль_ЯдроНаСервере().НастройкиДокументов_ПоказатьНастройку_ТиповаяПФ1С(НастройкаДокументаНаОтправку.ВидДокумента, ФормироватьНаОсновании);
	Иначе
		ДоступнаТиповаяПФ1С	= Ложь;
	КонецЕсли;
		
	ФорматыОтправкиДокументов = Модуль_ЯдроНаСервере().Перечисление_ФорматыОтправкиДокументов();
						
	Для Каждого Элемент Из ФорматыКонтента Цикл
		
		ЭтоФорматСТиповойПФ1С = (Элемент.Значение = ФорматыОтправкиДокументов.pf_1c);
		
		Если ЭтоФорматСТиповойПФ1С Тогда
			ДобавитьФорматВСписок = ДоступнаТиповаяПФ1С;
		Иначе
			ДобавитьФорматВСписок = Истина;
		КонецЕсли;
						
		Если ДобавитьФорматВСписок Тогда
			СписокФорматов.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПечатныхФорм()
	
	НастройкиПечатныхФорм = НастройкаДокументаНаОтправку.НастройкиПечатныхФорм;
	
	Если ЗначениеЗаполнено(НастройкиПечатныхФорм.ОсновнаяПечатнаяФорма) Тогда
		ОсновнаяПечатнаяФорма = НастройкиПечатныхФорм.ОсновнаяПечатнаяФорма;
		Элементы.ДекорацияДобавитьФорму.Заголовок = ОсновнаяПечатнаяФорма;
	КонецЕсли;
	
	Для Каждого ПечатнаяФорма Из НастройкиПечатныхФорм.ДополнительныеПечатныеФормы Цикл
		СтрокаТЧ = ДополнительныеПечатныеФормы.Добавить();
		СтрокаТЧ.ПечатнаяФорма = ПечатнаяФорма;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЭтоНастройкиПечатныхФормСчетаНаОплату()

	Результат = Модуль_ЯдроНаСервере().ЭтоИдентификаторВидаСчет(НастройкаДокументаНаОтправку.ВидДокумента);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьПараметрыФормы()
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	Параметры.Свойство("ИмяСправочника",				ИмяСправочника);
	Параметры.Свойство("НастройкаДокументаНаОтправку",	НастройкаДокументаНаОтправку);
	
	ДанныеОрганизации 	= Параметры.ДанныеОрганизации;
	ДанныеКонтрагента 	= Параметры.ДанныеКонтрагента;
	ДобавлятьСчетВПакет = Параметры.ДобавлятьСчетВПакет;
	
	ID_Организации = ДанныеОрганизации.ID;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	УстановитьВидимостьДоступностьГруппы_ФормироватьНаОсновании();
	
	Элементы.ФорматКонтента.Видимость = (Элементы.ФорматКонтента.СписокВыбора.Количество() > 0);
	Элементы.ФорматКонтента.Доступность = ФорматОтправки = ФорматыОтправкиДокументов.fns;
	
	Элементы.ДекорацияДобавитьФорму.Видимость = ФорматОтправки = ФорматыОтправкиДокументов.epf;

	//TODO: #2486
	УстановитьВидимостьНастройки_ДобавлятьСчетВПакет(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьГруппы_ФормироватьНаОсновании()
	
	ФункциональностьРеализована = (Элементы.ФормироватьНаОсновании.СписокВыбора.Количество() > 0);
	
	Элементы.ГруппаФормироватьНаОсновании.Видимость = ФункциональностьРеализована;
	
	Если ФункциональностьРеализована Тогда
		
		ПлагинСчетВПакетУстановлен = Модуль_ЯдроНаСервере().КонтурПлагины_ПлагинСчетВПакетУстановлен();
						
		Элементы.ФормироватьНаОсновании.Доступность			= Не ПлагинСчетВПакетУстановлен;
		Элементы.ДекорацияИнформацияОПлагине.Видимость		= ПлагинСчетВПакетУстановлен;
		Элементы.ДекорацияОткрытьСписокПлагинов.Видимость	= ПлагинСчетВПакетУстановлен;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНастройки_ДобавлятьСчетВПакет()
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	ИспользуетсяФункциональность = Модуль_Ядро.СчетаНаОплату_ДоступнаОпцияДобавлятьСчетВПакет();
	
	Если ЭтоНастройкиПечатныхФормСчетаНаОплату() И ИспользуетсяФункциональность Тогда
		ПлагинСчетВПакетУстановлен = Модуль_Ядро.КонтурПлагины_ПлагинСчетВПакетУстановлен();
		Элементы.ДобавлятьСчетВПакет.Доступность = НЕ ПлагинСчетВПакетУстановлен;
	Иначе
		Элементы.ДобавлятьСчетВПакет.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	// ШХ // т1к Гирфанов Р.Э., 2023.07.18 Доработка по обработке Контур Диадок: e1cib/data/Справочник.Карточка?ref=861a005056b60a3c11ee20d6073ba6b3 {
	шх_ОбработатьФормуПередСохранением();
	
	Если ФорматОтправки = ФорматыОтправкиДокументов.epf
		И НЕ ЗначениеЗаполнено(ОсновнаяПечатнаяФорма) Тогда
		
		ТекстОшибки = "Для документа выбран формат отправки ""Своя форма"".
					|Подключите внешнюю печатную форму.";
		
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.ПоказатьПредупреждениеЛок(, ТекстОшибки, , "Не выбрана внешняя печатная форма");
		
		Возврат;
		
	КонецЕсли;
	
	НастройкаДокументаНаОтправку.ФормироватьНаОсновании = ФормироватьНаОсновании;
	
	Если ФорматОтправки = ФорматыОтправкиДокументов.fns Тогда
		НастройкаДокументаНаОтправку.ФорматКонтента = ФорматКонтента;
	Иначе
		НастройкаДокументаНаОтправку.ФорматКонтента = ФорматОтправки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновнаяПечатнаяФорма) Тогда
		НастройкаДокументаНаОтправку.НастройкиПечатныхФорм.ОсновнаяПечатнаяФорма = ОсновнаяПечатнаяФорма;
	КонецЕсли;
	
	НастройкаДокументаНаОтправку.НастройкиПечатныхФорм.ДополнительныеПечатныеФормы.Очистить();
	Для Каждого СтрокаТЧ Из ДополнительныеПечатныеФормы Цикл
		НастройкаДокументаНаОтправку.НастройкиПечатныхФорм.ДополнительныеПечатныеФормы.Добавить(СтрокаТЧ.ПечатнаяФорма);
	КонецЦикла;
	
	// + ШХ //{ Никоноров О.А. 29-08-2023 Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
	// Передаем информацию по отмеченным печатным формам для подписания контрагентом
	НастройкиПодписанияПФ = Новый СписокЗначений;
	Для Каждого СтрокаТЧ Из ДополнительныеПечатныеФормы Цикл
		НастройкиПодписанияПФ.Добавить(СтрокаТЧ.ПечатнаяФорма,, СтрокаТЧ.ЗП);
	КонецЦикла;
	НастройкаДокументаНаОтправку.НастройкиПечатныхФорм.Вставить("НастрокиПодписанияПФ", НастройкиПодписанияПФ);
	// - ШХ
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("НастройкаДокументов", НастройкаДокументаНаОтправку);
	ПараметрыЗакрытия.Вставить("ДобавлятьСчетВПакет", ДобавлятьСчетВПакет);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьСчетВПакетПриИзменении(Элемент)

	Метрика_ДобавитьПоведение_ДобавлятьСчетВПакет();
	Метрика_ДобавитьСтатистику_ДобавлятьСчетВПакет();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматОтправкиПриИзменении(Элемент)
	
	Метрика_ИзменениеФорматаОтправки(ФорматОтправки);

	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматКонтентаПриИзменении(Элемент)
	
	Метрика_ИзменениеФорматаОтправки(ФорматКонтента);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДобавитьФормуНажатие(Элемент)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Настройки;
	ДействиеМетрики		= "Добавить свою форму";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(Метрика_НазваниеФормы(), КатегорияМетрики, ДействиеМетрики);
	
	ДопПараметры =  Новый Структура;
	ДопПараметры.Вставить("ВыборОсновнойПечатнойФормы", Истина);
	
	НачатьВыборПечатнойФормы(ДопПараметры);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ID_ВидДокумента", НастройкаДокументаНаОтправку.ВидДокумента);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(ID_Организации, КатегорияМетрики, ДействиеМетрики, , Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительнуюПечатнуюФорму(Команда)

	Метрика_ДопПечатнаяФорма("Добавить");

	ДопПараметры =  Новый Структура;
	ДопПараметры.Вставить("ВыборОсновнойПечатнойФормы", Ложь);
	
	НачатьВыборПечатнойФормы(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДополнительнуюПечатнуюФорму(Команда)
	
	Метрика_ДопПечатнаяФорма("Изменить");
	
	ТекущиеДанные = Элементы.ДополнительныеПечатныеФормы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры =  Новый Структура;
	ДопПараметры.Вставить("ВыборОсновнойПечатнойФормы", Ложь);
	ДопПараметры.Вставить("РежимИзменения", Истина);
	ДопПараметры.Вставить("ТекущаяСтрока", Элементы.ДополнительныеПечатныеФормы.ТекущаяСтрока);
	
	НачатьВыборПечатнойФормы(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюПечатнуюФорму(Команда)
	
	Метрика_ДопПечатнаяФорма("Удалить");
	
	ТекущиеДанные = Элементы.ДополнительныеПечатныеФормы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ДополнительныеПечатныеФормы.НайтиПоИдентификатору(Элементы.ДополнительныеПечатныеФормы.ТекущаяСтрока);
	ДополнительныеПечатныеФормы.Удалить(ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура НачатьВыборПечатнойФормы(ДопПараметры)
	
	Если ИмяСправочникаОбработки <> "" Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		
		ОписаниеОповещения = Модуль_Платформа.НовыйОписаниеОповещения(
			"ОбработкаВыбораПечатнойФормы",
			ЭтаФорма,
			ДопПараметры
		);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
		
		РежимБлокирования = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		Модуль_Платформа.ОткрытьФормуЛок(
			ИмяСправочникаОбработки + ".ФормаВыбора",
			ПараметрыФормы,
			ЭтаФорма,
			Неопределено,
			Неопределено,
			Неопределено,
			ОписаниеОповещения,
			РежимБлокирования
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПечатнойФормы(ВыбранноеЗначение, ДопПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.ВыборОсновнойПечатнойФормы Тогда
		
		ОсновнаяПечатнаяФорма = ВыбранноеЗначение;
		Элементы.ДекорацияДобавитьФорму.Заголовок = ВыбранноеЗначение;
		
	Иначе
		
		Если ДопПараметры.Свойство("РежимИзменения") Тогда
			
			СтрокаТЧ = ДополнительныеПечатныеФормы.НайтиПоИдентификатору(ДопПараметры.ТекущаяСтрока);
			СтрокаТЧ.ПечатнаяФорма = ВыбранноеЗначение;
			
			// + ШХ
			// { т1к СоловьевИВ. 2023-09-05. ТП ЗНИ.Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f 
			СтрокаТЧ.Выбрать = Истина;
			// } т1к СоловьевИВ. 2023-09-05. ТП ЗНИ.Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f 
			// - ШХ
			
		Иначе
			
			СтрокаТЧ = ДополнительныеПечатныеФормы.Добавить();
			СтрокаТЧ.ПечатнаяФорма = ВыбранноеЗначение;
			
			// + ШХ
			// { т1к СоловьевИВ. 2023-09-05. ТП ЗНИ.Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f 
			СтрокаТЧ.Выбрать = Истина;
			// } т1к СоловьевИВ. 2023-09-05. ТП ЗНИ.Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f 
			// - ШХ
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьНаОснованииПриИзменении(Элемент)
	
	Метрика_ИзменитьОснование();
	
	ФормироватьНаОснованииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьНаОснованииПриИзмененииНаСервере()
	
	СписокФорматов = Элементы.ФорматОтправки.СписокВыбора;
	СписокФорматов.Очистить();
	
	СписокФорматовКонтента = Элементы.ФорматКонтента.СписокВыбора;
	СписокФорматовКонтента.Очистить();
	
	ЗаполнитьНастройкиФорматов();
		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОткрытьСписокПлагиновНажатие(Элемент)
	
	Метрика_ОткрытьСписокПлагинов();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.КонтурПлагины_ОткрытьФорму(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ИзменитьОснование()
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Настройки;
	ДействиеМетрики		= "Изменить основание";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(Метрика_НазваниеФормы(), КатегорияМетрики, ДействиеМетрики);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ОснованиеДляСчета", ФормироватьНаОсновании);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(ID_Организации, КатегорияМетрики, ДействиеМетрики, , Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ОткрытьСписокПлагинов()
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Настройки;
	ДействиеМетрики		= "Открыть список плагинов";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(Метрика_НазваниеФормы(), КатегорияМетрики, ДействиеМетрики);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(ID_Организации, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ИзменениеФорматаОтправки(ЗначениеФормата)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Настройки;
	ДействиеМетрики		= "Изменить формат отправки";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(Метрика_НазваниеФормы(), КатегорияМетрики, ДействиеМетрики);
	
	ЗначениеФорматаКонтента = Элементы.ФорматОтправки.СписокВыбора.НайтиПоЗначению(ЗначениеФормата);
	
	Если ЗначениеФорматаКонтента = Неопределено Тогда
		ЗначениеФорматаКонтента = Элементы.ФорматКонтента.СписокВыбора.НайтиПоЗначению(ЗначениеФормата);
	КонецЕсли;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ID_ВидДокумента",	НастройкаДокументаНаОтправку.ВидДокумента);
	Переменные.Вставить("Значение",			ЗначениеФорматаКонтента.Представление);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(ID_Организации, КатегорияМетрики, ДействиеМетрики, , Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДопПечатнаяФорма(Действие)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Настройки;
	ДействиеМетрики		= Действие + " дополнительную печатную форму";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(Метрика_НазваниеФормы(), КатегорияМетрики, ДействиеМетрики);
    
	Переменные = Новый Соответствие;
	Переменные.Вставить("ID_ВидДокумента", НастройкаДокументаНаОтправку.ВидДокумента);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(ID_Организации, КатегорияМетрики, ДействиеМетрики, , Переменные);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеФормы()
	
	Возврат "Настройка печатных форм и форматов";
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеКатегории()
	
	Результат = Новый Структура;
	
	Если ИмяСправочника = "Организации" Тогда
		Результат.Вставить("Настройки", "Настройки организации");
	ИначеЕсли ИмяСправочника = "Контрагенты" Тогда
		Результат.Вставить("Настройки", "Настройки контрагента");
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_ДобавлятьСчетВПакет()

	КатегорияМетрики	= Метрика_НазваниеКатегории().Настройки;
	ДействиеМетрики		= "ДобавлятьСчетВПакет";
	НаименованиеФормы	= Метрика_НазваниеФормы();
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(НаименованиеФормы, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ДобавлятьСчетВПакет()

	КатегорияМетрики	= Метрика_НазваниеКатегории().Настройки;
	ДействиеМетрики		= "ДобавлятьСчетВПакет";
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ДобавлятьСчетВПакет", ДобавлятьСчетВПакет);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ДляОрганизации(ID_Организации, КатегорияМетрики, ДействиеМетрики, , Переменные);

КонецПроцедуры


#Область т1кОбработатьФорму // + ШХ

&НаСервере
Процедура шх_ОбработатьФорму()
	
	// Список задач:
	// ТП ЗНИ.Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
	// Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
	
	#Область СозданиеРеквизитов
	
	ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
	
	НовыйРеквизит = Новый РеквизитФормы("т1кДанныеОрганизации", Новый ОписаниеТипов()); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("т1кДанныеКонтрагента", Новый ОписаниеТипов()); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("т1кОбработатьПередЗакрытием", Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	Путь = "ДополнительныеПечатныеФормы";
	НовыйРеквизит = Новый РеквизитФормы("Выбрать",Новый ОписаниеТипов("Булево"), Путь); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("ВстроеннаяПечатнаяФорма", Новый ОписаниеТипов("Булево"), Путь); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150), Путь); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(150), Путь); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

	НовыйРеквизит = Новый РеквизитФормы("ПредставлениеВидимости", ОбщегоНазначения.ОписаниеТипаСтрока(250), Путь); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	// Добавляем реквизит - Запрашивать подпись
	НовыйРеквизит = Новый РеквизитФормы("ЗП", Новый ОписаниеТипов("Булево"), Путь); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("т1кНастройкиПодписи", Новый ОписаниеТипов()); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

	ИзменитьРеквизиты(ДобавляемыеРеквизиты); // Применяем реквизиты 
	
	Параметры.Свойство("т1кДанныеОрганизации", ЭтотОбъект.т1кДанныеОрганизации);
	Параметры.Свойство("т1кДанныеКонтрагента", ЭтотОбъект.т1кДанныеКонтрагента);

	Параметры.Свойство("т1кНастройкиПодписи", ЭтотОбъект.т1кНастройкиПодписи);

	ЭтотОбъект.т1кОбработатьПередЗакрытием = НастройкаДокументаНаОтправку.ВидДокумента = "ID_СчетФактура"
	// Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
	// Добавляю УПД 1 и 2
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УПД_СЧФ"
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УПД_ДОП"
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УПД"
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УКД_КСЧФ"
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УКД_ДИС"
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УКД";
		
	#КонецОбласти
	
	Если НЕ ЭтотОбъект.т1кОбработатьПередЗакрытием = Истина Тогда
		Возврат;
	КонецЕсли;
	
	#Область СозданиеЭлементовФормы
	
	ГруппаЗакладки = СоздатьГруппуФормы(Элементы, "т1кГруппаЗакладки",, ВидГруппыФормы.Страницы,, Элементы.ГруппаДополнительнаяПечатнаяФорма);
	СтраницаДопПечФорм = СоздатьГруппуФормы(Элементы, "т1кСтраницаДопПечФорм", 
		НСтр("ru = 'Дополнительные печатные формы'"), ВидГруппыФормы.Страница, ГруппаЗакладки);
	Элементы.Переместить(Элементы.ГруппаДополнительнаяПечатнаяФорма, СтраницаДопПечФорм);
	Элементы.ГруппаДополнительнаяПечатнаяФорма.ОтображатьЗаголовок = Ложь;

	СтраницаВстроенныхПечФорм = СоздатьГруппуФормы(Элементы, "т1кСтраницаВстроенныхПечФорм", 
		НСтр("ru = 'Встроенные печатные формы'"), ВидГруппыФормы.Страница, ГруппаЗакладки);
		
	Табл = СоздатьТаблицуФормы(Элементы, "ВстроенныеПечатныеФормы",, "ДополнительныеПечатныеФормы", СтраницаВстроенныхПечФорм);
	
	Табл.АвтоВводНовойСтроки = Ложь;
	Табл.ИзменятьСоставСтрок = Ложь;
	Табл.ИзменятьПорядокСтрок = Ложь;
	
	ПолеФлажок = СоздатьПолеФормы(Элементы, "ДополнительныеПечатныеФормыВыбрать","Выбрать", "ДополнительныеПечатныеФормы.Выбрать", ВидПоляФормы.ПолеФлажка, Табл,,);
	ПолеФлажок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ПолеФлажок.УстановитьДействие("ПриИзменении", "шх_ДополнительныеПечатныеФормыВыбратьПриИзменении");
	
	ПолеНаименование = СоздатьПолеФормы(Элементы, "ДополнительныеПечатныеФормыНаименование",, "ДополнительныеПечатныеФормы.Наименование", ВидПоляФормы.ПолеВвода, Табл,,);
	ПолеНаименование.ТолькоПросмотр = Истина;
	
	ПолеПредставлениеВидимости = СоздатьПолеФормы(Элементы, "ДополнительныеПечатныеФормыПредставлениеВидимости",, "ДополнительныеПечатныеФормы.ПредставлениеВидимости", ВидПоляФормы.ПолеВвода, Табл,,);
	ПолеПредставлениеВидимости.ТолькоПросмотр = Истина;
	
	ПолеЗП = СоздатьПолеФормы(Элементы, "ДополнительныеПечатныеФормыЗП", "З.П.", "ДополнительныеПечатныеФормы.ЗП", ВидПоляФормы.ПолеФлажка, Табл,,);
	ПолеЗП.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ПолеЗП.Подсказка = "Запрашивать подпись контрагента";
	
	// Добавляем условное оформление
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Представление = "Запрет на редактирование З.П.";
	
	// Создаем условие отбора
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДополнительныеПечатныеФормы.Выбрать");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Создаем поля оформления
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Использование = Истина;
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДополнительныеПечатныеФормыЗП");
	
	СтруктураОтбораТЧ = Новый Структура;
	СтруктураОтбораТЧ.Вставить("ВстроеннаяПечатнаяФорма", Ложь);
	ФиксСтруктураОтбора = Новый ФиксированнаяСтруктура(СтруктураОтбораТЧ);
	
	Элементы.ДополнительныеПечатныеФормы.ОтборСтрок = ФиксСтруктураОтбора;
	
	СтруктураОтбораТЧ = Новый Структура;
	СтруктураОтбораТЧ.Вставить("ВстроеннаяПечатнаяФорма", Истина);
	ФиксСтруктураОтбора = Новый ФиксированнаяСтруктура(СтруктураОтбораТЧ);
	
	Табл.ОтборСтрок = ФиксСтруктураОтбора;
	
	Если Врег(ИмяСправочника) = "КОНТРАГЕНТЫ" Тогда
		
		ИмяКоманды = "шх_ЗаполнитьПоДаннымНастройкиКонтрагента";
		
		НоваяКоманда = СоздатьКоманду(
			ЭтотОбъект,
			ИмяКоманды,
			"Заполнить по данным настройки контрагента",
			ИмяКоманды
		);
		
		СоздатьКнопкуФормы(
			Элементы,
			ИмяКоманды,
			,
			ИмяКоманды,
			ВидКнопкиФормы.ОбычнаяКнопка,
			Табл.КоманднаяПанель);
		
	КонецЕсли;
	#КонецОбласти
	
	мСсылкиДляОбработки = Новый Массив;
	
	Если НастройкаДокументаНаОтправку.ВидДокумента = "ID_СчетФактура" Тогда
		
		мСсылкиДляОбработки.Добавить(Документы.СчетФактураВыданный.ПустаяСсылка());
		
	ИначеЕсли НастройкаДокументаНаОтправку.ВидДокумента = "ID_УПД"
	// Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
	// Добавляю УПД 1 и 2
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УПД_СЧФ"
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УПД_ДОП"
		Тогда
		
		мСсылкиДляОбработки.Добавить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
		мСсылкиДляОбработки.Добавить(Документы.ОтчетКомитенту.ПустаяСсылка());
		мСсылкиДляОбработки.Добавить(Документы.КорректировкаРеализации.ПустаяСсылка());
		
	ИначеЕсли НастройкаДокументаНаОтправку.ВидДокумента = "ID_УКД" 
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УКД_КСЧФ"
		ИЛИ НастройкаДокументаНаОтправку.ВидДокумента = "ID_УКД_ДИС"
		Тогда
		
		мСсылкиДляОбработки.Добавить(Документы.КорректировкаРеализации.ПустаяСсылка());
		
	КонецЕсли;
	
	#Область ОбщиеКомандыПечати
	
	ОбщиеКомандыПечати = Неопределено;
	Для каждого Документ1ССсылка Из мСсылкиДляОбработки Цикл
		МетаданныеДОК = Документ1ССсылка.Метаданные();
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(МетаданныеДОК, Ложь);
		
		Объекты = Новый СписокЗначений;
		Объекты.Добавить(Документ1ССсылка);
		
		КомандыПечати.Колонки.Добавить("Имя");
		КомандыПечати.ЗагрузитьКолонку(КомандыПечати.ВыгрузитьКолонку("Идентификатор"), "Имя");
		
		УсловияВидимостиПоТипамОбъектов = КомандыПечати.ВыгрузитьКолонку("УсловияВидимостиПоТипамОбъектов");
		УсловияВидимостиПоТипамОбъектовПредставление = Новый Массив;
		Для Каждого ТекСоответствие Из УсловияВидимостиПоТипамОбъектов Цикл
			ПредставлениеВидимости = "";
			Для Каждого ТекЭлем Из ТекСоответствие Цикл
				ПредставлениеВидимости = ПредставлениеВидимости + ТекЭлем.Ключ + "; ";
			КонецЦикла;
			УсловияВидимостиПоТипамОбъектовПредставление.Добавить(ПредставлениеВидимости);
		КонецЦикла;
		КомандыПечати.Колонки.Добавить("ПредставлениеВидимости");
		КомандыПечати.ЗагрузитьКолонку(УсловияВидимостиПоТипамОбъектовПредставление, "ПредставлениеВидимости");
		
		// Удаляет исходя из контекста, но в в нашем случае значения реквизитов пустые и не все формы остаются
		// Переносим анализ в печать
		//РегистрыСведений.НастройкиПечатиОбъектов.т1кИсправитьСоставКомплектаПоКонтекстуСсылок(КомандыПечати, Объекты);
		
		Если ОбщиеКомандыПечати = Неопределено Тогда
			
			ОбщиеКомандыПечати = КомандыПечати.Скопировать();
			
		Иначе
			
			Для каждого КП Из КомандыПечати Цикл
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Идентификатор", КП.Идентификатор);
				ПараметрыОтбора.Вставить("МенеджерПечати", КП.МенеджерПечати);
				ПараметрыОтбора.Вставить("Представление", КП.Представление);
				ПараметрыОтбора.Вставить("УникальныйИдентификатор", КП.УникальныйИдентификатор);
				НайденныеСтроки = ОбщиеКомандыПечати.НайтиСтроки(ПараметрыОтбора);
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					
					ЗаполнитьЗначенияСвойств(ОбщиеКомандыПечати.Добавить(), КП);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиНаУдаление = Новый Массив;
	Для каждого А Из ОбщиеКомандыПечати Цикл
		Если ПустаяСтрока(А.МенеджерПечати)
			ИЛИ А.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
			
			СтрокиНаУдаление.Добавить(А);
			
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаНаУдаление Из СтрокиНаУдаление Цикл
		ОбщиеКомандыПечати.Удалить(СтрокаНаУдаление);
	КонецЦикла;
	
	#КонецОбласти
	
	// Есть печатные формы с одинаковым полем УникальныйИдентификатор
	// Решили УникальныйИдентификатор свернуть и брать 1 строку
	
	ОбщиеКомандыПечатиСвод = ОбщиеКомандыПечати.Скопировать(, "УникальныйИдентификатор");
	ОбщиеКомандыПечатиСвод.Свернуть("УникальныйИдентификатор");
	
	Для Каждого ТекСтрока Из ДополнительныеПечатныеФормы Цикл
		ТекСтрока.Выбрать = Истина;
	КонецЦикла;
	
	Для каждого Строка_Свод Из ОбщиеКомандыПечатиСвод Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("УникальныйИдентификатор", Строка_Свод.УникальныйИдентификатор);
		НайденныеСтрокиОбщиеКомандыПечати = ОбщиеКомандыПечати.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого А Из НайденныеСтрокиОбщиеКомандыПечати Цикл
			
			СтрокаХранения = СтрШаблон(
				НСтр("ru = '%1 [%2][%3]'", "ru"),
				А.Представление,
				А.Идентификатор,
				А.УникальныйИдентификатор);
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ПечатнаяФорма", СтрокаХранения);
			НайденныеСтроки = ДополнительныеПечатныеФормы.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				НоваяСтрока = ДополнительныеПечатныеФормы.Добавить();
				НоваяСтрока.ВстроеннаяПечатнаяФорма = Истина;
				НоваяСтрока.ПечатнаяФорма = СтрокаХранения;
				НоваяСтрока.Наименование = А.Представление;
				НоваяСтрока.Имя = А.Имя;
				НоваяСтрока.ПредставлениеВидимости = А.ПредставлениеВидимости;
				
				Прервать;
				
			КонецЕсли;
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				НайденнаяСтрока.Выбрать = Истина;
				НайденнаяСтрока.ВстроеннаяПечатнаяФорма = Истина;
				НайденнаяСтрока.ПечатнаяФорма = СтрокаХранения;
				НайденнаяСтрока.Наименование = А.Представление;
				НайденнаяСтрока.Имя = А.Имя;
				НайденнаяСтрока.ПредставлениеВидимости = А.ПредставлениеВидимости;

				// Заполняем настройку подписания из соответствия
				ИмяПараметраЗП = "ЗП_" + ЭтотОбъект.НастройкаДокументаНаОтправку.ВидДокумента + "_" + СтрокаХранения;
				ЗначениеСвойстваЗП = ЭтотОбъект["т1кНастройкиПодписи"].Получить(ИмяПараметраЗП);
				Если ЗначениеСвойстваЗП = Неопределено Тогда
					НайденнаяСтрока.ЗП = Ложь;
				Иначе	
					НайденнаяСтрока.ЗП = ЗначениеСвойстваЗП;
				КонецЕсли;
				
				Прервать;
				
			КонецЦикла;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура шх_ДополнительныеПечатныеФормыВыбратьПриИзменении(Элемент)
	
	ТД = Элементы.ВстроенныеПечатныеФормы.ТекущиеДанные;
	Если НЕ ТД.Выбрать Тогда
		ТД.ЗП = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура шх_ОбработатьФормуПередСохранением()
	
	Если НЕ ЭтотОбъект.т1кОбработатьПередЗакрытием = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиНаУдаление = Новый Массив;
	Для каждого А Из ДополнительныеПечатныеФормы Цикл
		Если НЕ А.Выбрать = Истина Тогда
			
			СтрокиНаУдаление.Добавить(А);
			
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаНаУдаление Из СтрокиНаУдаление Цикл
		ДополнительныеПечатныеФормы.Удалить(СтрокаНаУдаление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура шх_ЗаполнитьПоДаннымНастройкиКонтрагента(Команда)
	
	ОрганизацияФормы = Неопределено;
	Если ЭтотОбъект.т1кДанныеОрганизации.Свойство("СвязанныйСправочник1")
		И ТипЗнч(ЭтотОбъект.т1кДанныеОрганизации.СвязанныйСправочник1) = Тип("СправочникСсылка.Организации") Тогда
		
		ОрганизацияФормы = ЭтотОбъект.т1кДанныеОрганизации.СвязанныйСправочник1;
		
	КонецЕсли;
	
	КонтрагентФормы = Неопределено;
	Если ЭтотОбъект.т1кДанныеКонтрагента.Свойство("СвязанныйСправочник1")
		И ТипЗнч(ЭтотОбъект.т1кДанныеКонтрагента.СвязанныйСправочник1) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КонтрагентФормы = ЭтотОбъект.т1кДанныеКонтрагента.СвязанныйСправочник1;
		
	ИначеЕсли ЭтотОбъект.т1кДанныеКонтрагента.Свойство("СвязанныйСправочник2")
		И ТипЗнч(ЭтотОбъект.т1кДанныеКонтрагента.СвязанныйСправочник2) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КонтрагентФормы = ЭтотОбъект.т1кДанныеКонтрагента.СвязанныйСправочник2;
		
	ИначеЕсли ЭтотОбъект.т1кДанныеКонтрагента.Свойство("СвязанныйСправочник3")
		И ТипЗнч(ЭтотОбъект.т1кДанныеКонтрагента.СвязанныйСправочник3) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КонтрагентФормы = ЭтотОбъект.т1кДанныеКонтрагента.СвязанныйСправочник3;
		
	КонецЕсли;
	
	Если КонтрагентФормы = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Неудачное получение Контрагента из настроек формы.'", "ru");
		ТекстЗаголовка = НСтр("ru = 'Внимание!'", "ru");
		ПоказатьПредупреждение(, ТекстПредупреждения, 60, ТекстЗаголовка);
		
		Возврат;
		
	КонецЕсли;
	
	// Открытие формы:
	ПараметрыФормы = Новый Структура;
	
	// Открытие с отбором
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент", КонтрагентФормы);
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	// Для выбора
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОрганизацияФормы", ОрганизацияФормы);
	ДополнительныеПараметры.Вставить("КонтрагентФормы", КонтрагентФормы);
	ОповещениеВыбора = Новый ОписаниеОповещения("шхВыбратьДоговорыКонтрагентовЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура шхВыбратьДоговорыКонтрагентовЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Соответствие = ПолучитьКоллекциюПечатныхФормИЗНастройкиПечатиОбъектов(ДополнительныеПараметры.ОрганизацияФормы, ДополнительныеПараметры.КонтрагентФормы, Значение);
	
	Если Соответствие = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Не найдены настройки печати.'", "ru");
		ТекстЗаголовка = НСтр("ru = 'Внимание!'", "ru");
		ПоказатьПредупреждение(, ТекстПредупреждения, 60, ТекстЗаголовка);
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого А Из ДополнительныеПечатныеФормы Цикл
		Если А.ВстроеннаяПечатнаяФорма = Истина Тогда
			А.Выбрать = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого эСоответствие Из Соответствие Цикл
		
		Для каждого А Из ДополнительныеПечатныеФормы Цикл
			Если А.ВстроеннаяПечатнаяФорма = Ложь
				ИЛИ А.Выбрать = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВРег(А.Наименование) = ВРег(эСоответствие.Значение) Тогда
				
				А.Выбрать = Истина;
				Прервать;
				
			КонецЕсли;
			
			Если ВРег(А.Имя) = ВРег(эСоответствие.Ключ) Тогда
				
				А.Выбрать = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоллекциюПечатныхФормИЗНастройкиПечатиОбъектов(Организация, Контрагент, Договор)
	
	мСсылкиДляОбработки = Новый Массив;
	
	Если НастройкаДокументаНаОтправку.ВидДокумента = "ID_СчетФактура" Тогда
		
		мСсылкиДляОбработки.Добавить(Документы.СчетФактураВыданный.ПустаяСсылка());
		
	ИначеЕсли НастройкаДокументаНаОтправку.ВидДокумента = "ID_УПД" Тогда
		
		мСсылкиДляОбработки.Добавить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
		мСсылкиДляОбработки.Добавить(Документы.ОтчетКомитенту.ПустаяСсылка());
		мСсылкиДляОбработки.Добавить(Документы.КорректировкаРеализации.ПустаяСсылка());
		
	ИначеЕсли НастройкаДокументаНаОтправку.ВидДокумента = "ID_УКД" Тогда
		
		мСсылкиДляОбработки.Добавить(Документы.КорректировкаРеализации.ПустаяСсылка());
		
	КонецЕсли;
	
	Соответствие = Новый Соответствие;
	
	РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "Партнер");
	
	Для каждого А Из мСсылкиДляОбработки Цикл
		
		ИзмеренияРегистра = Новый Структура;
		ИзмеренияРегистра.Вставить("ТипОбъекта",	А.Метаданные().ПолноеИмя());
		ИзмеренияРегистра.Вставить("Организация",	Организация);
		ИзмеренияРегистра.Вставить("Партнер",		РеквизитыКонтрагента.Партнер);
		ИзмеренияРегистра.Вставить("т1кДоговор",	Договор);
		
		КоллекцияПечатныхФорм = Неопределено;
		
		МенеджерЗаписи = РегистрыСведений.НастройкиПечатиОбъектов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ИзмеренияРегистра);
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			КоллекцияПечатныхФорм = МенеджерЗаписи.Настройки.Получить();
			
		Иначе
			
			ИзмеренияРегистра.Вставить("т1кДоговор",	Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
			
			МенеджерЗаписи = РегистрыСведений.НастройкиПечатиОбъектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ИзмеренияРегистра);
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				
				КоллекцияПечатныхФорм = МенеджерЗаписи.Настройки.Получить();
				
			Иначе
				
				ИзмеренияРегистра.Вставить("Партнер",	Справочники.Партнеры.ПустаяСсылка());
				
				МенеджерЗаписи = РегистрыСведений.НастройкиПечатиОбъектов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ИзмеренияРегистра);
				МенеджерЗаписи.Прочитать();
				
				Если МенеджерЗаписи.Выбран() Тогда
					
					КоллекцияПечатныхФорм = МенеджерЗаписи.Настройки.Получить();
					
				Иначе
					
					ИзмеренияРегистра.Вставить("Организация",	Справочники.Организации.ПустаяСсылка());
					МенеджерЗаписи = РегистрыСведений.НастройкиПечатиОбъектов.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ИзмеренияРегистра);
					МенеджерЗаписи.Прочитать();
					
					Если МенеджерЗаписи.Выбран() Тогда
						
						КоллекцияПечатныхФорм = МенеджерЗаписи.Настройки.Получить();
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КоллекцияПечатныхФорм = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Печатать", Истина);
		НайденныеСтроки = КоллекцияПечатныхФорм.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Соответствие.Вставить(НайденнаяСтрока.Имя, НайденнаяСтрока.Представление);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Соответствие.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Соответствие;
	
КонецФункции

// Функция создает ТаблицуФормы
Функция СоздатьТаблицуФормы(Элементы, Имя, Заголовок = "", ПутьКДанным, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, События = Неопределено)
	
	Если ВставитьПередЭлементом = Неопределено Тогда
		ТаблицаФормы = Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Родитель);
	Иначе
		ТаблицаФормы = Элементы.Вставить(Имя, Тип("ТаблицаФормы"), Родитель, ВставитьПередЭлементом);
	КонецЕсли;
	
	ТаблицаФормы.ПутьКДанным = ПутьКДанным;
	ТаблицаФормы.Заголовок = Заголовок;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ТаблицаФормы, ПараметрыЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(События) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из События Цикл
			ТаблицаФормы.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаФормы;
	
КонецФункции

// Функция создает группу формы
Функция СоздатьГруппуФормы(Элементы, Имя, Заголовок = "", Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, События = Неопределено) Экспорт
	
	Если ВставитьПередЭлементом = Неопределено Тогда
		Группа = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Родитель);
	Иначе
		Группа = Элементы.Вставить(Имя, Тип("ГруппаФормы"), Родитель, ВставитьПередЭлементом);
	КонецЕсли;
	
	Если Вид = Неопределено Тогда 
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Иначе
		Группа.Вид = Вид;
	КонецЕсли;
	Группа.Заголовок = Заголовок;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Группа, ПараметрыЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(События) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из События Цикл
			Группа.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

// Функция создает поле формы
Функция СоздатьПолеФормы(Элементы, Имя, Заголовок = "", ПутьКДанным, Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, СобытияЭлемента = Неопределено) Экспорт
	
	НайденноеПоле = Элементы.Найти(Имя);
	Если НайденноеПоле <> неопределено Тогда
		Поле = НайденноеПоле;
	ИначеЕсли ВставитьПередЭлементом = Неопределено Тогда
		Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель);
		Поле.ПутьКДанным = ПутьКДанным;
	Иначе
		Поле = Элементы.Вставить(Имя, Тип("ПолеФормы"), Родитель, ВставитьПередЭлементом);
		Поле.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Если Вид = Неопределено Тогда 
		Поле.Вид = ВидПоляФормы.ПолеВвода;
	Иначе
		Поле.Вид = Вид;
	КонецЕсли;
	
	Поле.Заголовок = Заголовок;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыЭлемента);
	ИначеЕсли Поле.Вид = ВидПоляФормы.ПолеВвода Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыПоляВводаПоУмолчанию());
	ИначеЕсли Поле.Вид = ВидПоляФормы.ПолеФлажка Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыПоляФлажкаПоУмолчанию());
	КонецЕсли;
	
	Если ТипЗнч(СобытияЭлемента) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из СобытияЭлемента Цикл
			Поле.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Поле;
	
КонецФункции

// Функция создает кнопку формы
Функция СоздатьКнопкуФормы(Элементы, Имя, Заголовок = "", ИмяКоманды, Вид = Неопределено, Родитель, ВставитьПередЭлементом = Неопределено, ПараметрыЭлемента = Неопределено, СобытияЭлемента = Неопределено) Экспорт
	
	Если ВставитьПередЭлементом = Неопределено Тогда
		Поле = Элементы.Добавить(Имя, Тип("КнопкаФормы"), Родитель);
	Иначе
		Поле = Элементы.Вставить(Имя, Тип("КнопкаФормы"), Родитель, ВставитьПередЭлементом);
	КонецЕсли;
	
	Если Вид = Неопределено Тогда 
		Поле.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Иначе
		Поле.Вид = Вид;
	КонецЕсли;
	Поле.Заголовок = Заголовок;
	Поле.ИмяКоманды = ИмяКоманды;
	
	Если ТипЗнч(ПараметрыЭлемента) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Поле, ПараметрыЭлемента);
	КонецЕсли;
	
	Если ТипЗнч(СобытияЭлемента) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из СобытияЭлемента Цикл
			Поле.УстановитьДействие(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Поле;
	
КонецФункции

// Функция создает команду формы
Функция СоздатьКоманду(Форма, ИмяКоманды, Заголовок, Действие, Картинка = Неопределено, Отображение = Неопределено) Экспорт
	
	//Элементы = Форма.Элементы;
	//Команды = Форма.Команды;
	
	Команда = Команды.Найти(ИмяКоманды);
	Если Команда = Неопределено Тогда
		Команда = Команды.Добавить(ИмяКоманды);
		Команда.Заголовок = Заголовок;
		Если Картинка <> Неопределено Тогда
			Команда.Картинка = Картинка;
			Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КонецЕсли;
		Команда.Действие = Действие;
	КонецЕсли;
	
	Возврат Команда;
	
КонецФункции

// параметры поля ввода по умолчанию
Функция ПараметрыПоляВводаПоУмолчанию() Экспорт
	
	ПараметрыПоляВвода28 = Новый Структура;
	ПараметрыПоляВвода28.Вставить("ПоложениеЗаголовка", 		ПоложениеЗаголовкаЭлементаФормы.Лево);
	ПараметрыПоляВвода28.Вставить("АвтоМаксимальнаяШирина",	Ложь);
	ПараметрыПоляВвода28.Вставить("МаксимальнаяШирина",		28);
	
	Возврат ПараметрыПоляВвода28;
	
КонецФункции

// параметры поля флажка по умолчанию
Функция ПараметрыПоляФлажкаПоУмолчанию() Экспорт
	
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("ПоложениеЗаголовка", 		ПоложениеЗаголовкаЭлементаФормы.Право);
	ПараметрыПоля.Вставить("АвтоМаксимальнаяШирина",	Ложь);
	ПараметрыПоля.Вставить("МаксимальнаяШирина",		28);
	
	Возврат ПараметрыПоля;
	
КонецФункции

#КонецОбласти
