////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем ОповещениеОЗавершенииЛок;

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;

&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	// BSLLS:UnusedLocalVariable-off
	ТребуетсяПодтверждениеОтПользователя = Истина;
	ВремяНачала = ТекущаяДата();
	// BSLLS:UnusedLocalVariable-on

	ИнициализироватьФорму(Параметры);
	
	ЯдроНаСервере = Модуль_ЯдроНаСервере();

	БиблиотекаКартинокЯдра = ЯдроНаСервере.БиблиотекаКартинок();
	КартинкаДлительнаяОперация = БиблиотекаКартинокЯдра.КартинкаДлительнаяОперация;
	// BSLLS:UnusedLocalVariable-off
	АдресКартинкиДлительнаяОперация = ПоместитьВоВременноеХранилище(КартинкаДлительнаяОперация, УникальныйИдентификатор);
	// BSLLS:UnusedLocalVariable-on
	
	ИнициализироватьИдентификаторТрассировки();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЕРВИСНЫЕ МЕТОДЫ

&НаКлиенте
Функция Модуль_ПлатформаНаКлиенте()
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	Результат = ПлатформаНаКлиенте.Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	ДействиеМетрики = Метрика_ДействиеПрерватьПодписание();
	Метрика_ДобавитьПоведение_НажатиеКнопки(ДействиеМетрики);
	
	Если ТребуетсяПодтверждениеОтПользователя Тогда
		
		ПодтвердитьОтказОтОжидания();
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОтказОтОжидания()
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	
	ОписаниеОбработчикаЗакрытия = ПлатформаНаКлиенте.НовыйОписаниеОповещения("ПослеОтказаОтОжидания", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru = 'Документы не подписаны.
		|Если вы прервете операцию, потребуется повторная отправка
		|документов или вы сможете подписать их другим способом.'");
		
	ЗаголовокВопроса = НСтр("ru = 'Подтверждение прерывания ожидания подписания Госключ'");
		
	КнопкаПоУмолчанию = КодВозвратаДиалога.Пропустить;
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Прервать);
	Кнопки.Добавить(КнопкаПоУмолчанию, "Продолжить");
	
	// BSLLS:MagicNumber-off
	ПлатформаНаКлиенте.ПоказатьВопросЛок(
		ОписаниеОбработчикаЗакрытия,
		ТекстВопроса,
		Кнопки,
		60,
		КнопкаПоУмолчанию,
		ЗаголовокВопроса);
	// BSLLS:MagicNumber-on
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтказаОтОжидания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Прервать Тогда
		// BSLLS:UnusedLocalVariable-off
		ТребуетсяПодтверждениеОтПользователя = Ложь;
		// BSLLS:UnusedLocalVariable-on
		ВыполнитьДействиеПослеОтказаОжидания();
		Закрыть();
	Иначе
		ПодключитьОбработчикОжидания("ПроверкаСтатусаПодписания", ИнтервалПроверкиСек(), Истина);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ВремяОжиданияПодписанияСек()
	
	// BSLLS:MagicNumber-off
	Возврат 60 * 60;
	// BSLLS:MagicNumber-on
	
КонецФункции

&НаКлиенте
Функция ИнтервалПроверкиСек()
	
	Возврат 5;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаСтатусаПодписания()
	
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	
	ТекущееВремя = ТекущаяДата();
	ПрошлоВремени = ТекущееВремя - ВремяНачала;
	ОсталосьВремени = ВремяОжиданияПодписанияСек() - ПрошлоВремени;
	
	РезультатПодписанияГосключ = ПлатформаНаКлиенте.ПроверитьЗаданиеОтправкиНаПодписьГосключ(ИдентификаторЗадания,
		ИдентификаторЯщика);
	
	ПодробноеОписаниеСтатуса = РезультатПодписанияГосключ.ПодробноеОписаниеСтатуса;
	Элементы.ДекорацияПодробноеОписаниеСтатуса.Заголовок = ПодробноеОписаниеСтатуса;
	
	Если РезультатПодписанияГосключ.РазрешитьДействие Тогда
		
		ВыполнитьДействиеПослеПодписания(РезультатПодписанияГосключ, ПрошлоВремени);
			
	ИначеЕсли ПрошлоВремени >= ВремяОжиданияПодписанияСек() Тогда
		
		ВыполнитьДействиеПослеТаймаутаПодписания();
		
	Иначе
		
		ОбновитьОставшеесяВремя(ОсталосьВремени);
		ПодключитьОбработчикОжидания("ПроверкаСтатусаПодписания", ИнтервалПроверкиСек(), Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПослеПодписания(РезультатПодписанияГосключ, ВремяПодписания)
	
	ДействиеМетрики = Метрика_ДействиеВремяПодписания();
	Метрика_ДобавитьСтатистику(ДействиеМетрики, ВремяПодписания);
	
	ЭтаФорма.Элементы.ГруппаОбратныйОтсчет.Видимость = Ложь;
	
	// BSLLS:UnusedLocalVariable-off
	ТребуетсяПодтверждениеОтПользователя = Ложь;
	// BSLLS:UnusedLocalVariable-on
	
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	ПлатформаНаКлиенте.ВыполнитьОбработкуОповещенияЛок(ОповещениеОЗавершенииЛок, РезультатПодписанияГосключ);
	
	СтатусыПодписанияГосключ = ПлатформаНаКлиенте.Перечисление_СтатусыПодписанияГосключ();
	
	Если РезультатПодписанияГосключ.СтатусПодписания = СтатусыПодписанияГосключ.УспешноеПодписание Тогда
		
		ДействиеМетрики = Метрика_ДействиеУспешноеПодписание();
		Метрика_ДобавитьСтатистику(ДействиеМетрики);
		
		Закрыть(РезультатПодписанияГосключ);
		
	ИначеЕсли РезультатПодписанияГосключ.СтатусПодписания = СтатусыПодписанияГосключ.ОтказПользователя Тогда
		
		ДействиеМетрики = Метрика_ДействиеОтказПодписи();
		Метрика_ДобавитьСтатистику(ДействиеМетрики);
		
		ТекстЗаголовка = НСтр("ru = 'Вы отклонили документы'");
		ТекстПредупреждения = НСтр("ru = 'Если вы отклонили случайно, отправьте их на подписание еще раз.'");
		
		ОписаниеОбработчикаПредупреждения = ПлатформаНаКлиенте.НовыйОписаниеОповещения("ПослеПредупреждения", ЭтаФорма);
		ПлатформаНаКлиенте.ПоказатьПредупреждениеЛок(
			ОписаниеОбработчикаПредупреждения,
			ТекстПредупреждения, ,
			ТекстЗаголовка
		);
		
	Иначе
		
		ДействиеМетрики = Метрика_ДействиеНепредвиденнаяОшибка();
		Метрика_ДобавитьСтатистику(ДействиеМетрики);
		
		ТекстЗаголовка = НСтр("ru = 'Непредвиденная ошибка'");
		ТекстПредупреждения = НСтр("ru = 'Во время подписания докуменов произошла непредвиденная ошибка
			|Проверьте введенные СНИЛС или OID и повторите отправку'");
		
		ОписаниеОбработчикаПредупреждения = ПлатформаНаКлиенте.НовыйОписаниеОповещения("ПослеПредупреждения", ЭтаФорма);
		ПлатформаНаКлиенте.ПоказатьПредупреждениеЛок(
			ОписаниеОбработчикаПредупреждения,
			ТекстПредупреждения, ,
			ТекстЗаголовка
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПредупреждения(ДополнительныеПараметры) Экспорт
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПослеТаймаутаПодписания()
	
	// BSLLS:UnusedLocalVariable-off
	ТребуетсяПодтверждениеОтПользователя = Ложь;
	// BSLLS:UnusedLocalVariable-on
	
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	РезультатПодписанияГосключ = ПлатформаНаКлиенте.РезультатПодписанияГосключ();
	РезультатПодписанияГосключ.РазрешитьДействие = Истина;
	РезультатПодписанияГосключ.ОшибкаПриПодписании = Истина;
	СтатусыПодписанияГосключ = ПлатформаНаКлиенте.Перечисление_СтатусыПодписанияГосключ();
	РезультатПодписанияГосключ.СтатусПодписания = СтатусыПодписанияГосключ.ПревышеноВремяОжидания;
	
	ДействиеМетрики = Метрика_ДействиеВремяИстекло();
	Метрика_ДобавитьСтатистику(ДействиеМетрики);

	ПлатформаНаКлиенте.ВыполнитьОбработкуОповещенияЛок(ОповещениеОЗавершенииЛок, РезультатПодписанияГосключ);
	
	ТекстЗаголовка = НСтр("ru = 'Истекло время подписания документов'");
	ТекстПредупреждения = НСтр("ru = 'Истекло время подписания документов в приложении Госключ.
	|Попробуйте отправить документы еще раз или подпишите другим способом.'");
	
	ОписаниеОбработчикаПредупреждения = ПлатформаНаКлиенте.НовыйОписаниеОповещения("ПослеПредупреждения", ЭтаФорма);
	ПлатформаНаКлиенте.ПоказатьПредупреждениеЛок(ОписаниеОбработчикаПредупреждения, ТекстПредупреждения, , ТекстЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПослеОтказаОжидания()
	
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	РезультатПодписанияГосключ = ПлатформаНаКлиенте.РезультатПодписанияГосключ();
	РезультатПодписанияГосключ.РазрешитьДействие = Истина;
	РезультатПодписанияГосключ.ОшибкаПриПодписании = Истина;
	СтатусыПодписанияГосключ = ПлатформаНаКлиенте.Перечисление_СтатусыПодписанияГосключ();
	РезультатПодписанияГосключ.СтатусПодписания = СтатусыПодписанияГосключ.ОтказПользователя;
	
	ДействиеМетрики = Метрика_ДействиеПрерватьПодписание();
	Метрика_ДобавитьСтатистику(ДействиеМетрики);
	
	ПлатформаНаКлиенте.ВыполнитьОбработкуОповещенияЛок(ОповещениеОЗавершенииЛок, РезультатПодписанияГосключ);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму(ПараметрыФормы) Экспорт
	
	// BSLLS:UnusedLocalVariable-off
	ИдентификаторЗадания = ПараметрыФормы.ИдентификаторЗадания;
	ИдентификаторЯщика = ПараметрыФормы.ИдентификаторЯщика;
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОставшеесяВремя(ОставшеесяВремяСек)
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	
	ШаблонЗаголовка = НСтр("ru = 'Осталось времени %1 мин. %2 сек. из %3 мин.'");
	ТекстЗаголовка = ЯдроНаКлиенте.Общее_ПодставитьПараметрыВСтроку(ШаблонЗаголовка,
		СекундыВМинуты(ОставшеесяВремяСек),
		СекундыВСекунды(ОставшеесяВремяСек),
		СекундыВМинуты(ВремяОжиданияПодписанияСек()));
	
	Элементы.ДекорацияОбратныйОтчет.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Функция СекундыВМинуты(Секунды)
	
	// BSLLS:MagicNumber-off
	Возврат Цел(Секунды / 60);
	// BSLLS:MagicNumber-on
	
КонецФункции

&НаКлиенте
Функция СекундыВСекунды(Секунды)
	
	// BSLLS:MagicNumber-off
	Возврат Секунды % 60;
	// BSLLS:MagicNumber-on
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ТребуетсяПодтверждениеОтПользователя Тогда
		Отказ = Истина;
		ПодтвердитьОтказОтОжидания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПроверкаСтатусаПодписания", ИнтервалПроверкиСек(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_НажатиеКнопки(Действие)
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	
	НазваниеФормы = Метрики_НаименованиеФормы();
	Категория = Метрика_КатегорияГосключ();
	Метка = Метрики_МеткаНажатиеНаКнопку();
	
	ЯдроНаКлиенте.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		Категория,
		Действие,
		Метка, ,
		ИдентификаторТрассировки
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику(Действие, ВремяПодписания = Неопределено)
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID", ИдентификаторЯщика);
	ДопПеременные.Вставить("taskId", ИдентификаторЗадания);
	Если Не ВремяПодписания = Неопределено Тогда
		ДопПеременные.Вставить("Время (сек)", ВремяПодписания);
	КонецЕсли;
	
	Категория = Метрика_КатегорияГосключ();
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	
	ЯдроНаКлиенте.Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		Категория,
		Действие,
		,
		ДопПеременные,
		,
		ИдентификаторТрассировки
	);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеПрерватьПодписание()
	Возврат "ПрерватьПодписание";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеВремяПодписания()
	Возврат "ВремяПодписания";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеВремяИстекло()
	Возврат "ВремяИстекло";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеОтказПодписи()
	Возврат "ОтказПодписи";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеУспешноеПодписание()
	Возврат "УспешноеПодписание";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеНепредвиденнаяОшибка()
	Возврат "НепредвиденнаяОшибка";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_НаименованиеФормы()
	Возврат "Госключ_ФормаОжиданияПодписания";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_КатегорияГосключ()
	Возврат "Госключ";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_МеткаНажатиеНаКнопку()
	Возврат "Нажатие на кнопку";
КонецФункции

&НаСервере
Процедура ИнициализироватьИдентификаторТрассировки()
	
	Метрики_НаименованиеФормы = Метрики_НаименованиеФормы();
	СтрокаИдентификатора = Строка(Новый УникальныйИдентификатор());
	
	// BSLLS:UnusedLocalVariable-off
	ИдентификаторТрассировки = Метрики_НаименованиеФормы + "_" + СтрокаИдентификатора;
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

