////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

&НаСервере
Перем _ОбработкаОбъект; // Программный интерфейс основного модуля

&НаСервере
Перем _МодульЯдроНаСервере; // Программный интерфейс модуля Ядро

&НаКлиенте
Перем _МодульПлатформаНаКлиенте; // Клиентский программный интерфейс основного модуля

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	ПрочитатьТекущиеНастройки();
	ПроверитьВерсиюПриложения();
	УстановитьСвойстваЭлементовТакси();
	УстановитьДоступностьНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения = "", СтандартнаяОбработка = Ложь)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	Если ВерсияПриложенияБольшеРавна8_3_8
		И ЗавершениеРаботы Тогда
		ТекстПредупреждения = "Данные были изменены. Все изменения будут потеряны.";
		Возврат;
	КонецЕсли;
	
	Платформа = Модуль_Платформа();
	ОповещениеСохранитьИЗакрыть = Платформа.НовыйОписаниеОповещения("ЗакрытиеФормыНастроекЗавершение", ЭтаФорма);
	Платформа.ПоказатьВопросЛок(
		ОповещениеСохранитьИЗакрыть,
		"Настройки приложения были изменены. Сохранить изменения?",
		РежимДиалогаВопрос.ДаНетОтмена,
		60,
		КодВозвратаДиалога.Да
	);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КлючПриложенияПриИзменении(Элемент)
	КлючПриложенияИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНастройкиПоУмолчаниюПриИзменении(Элемент)
	УстановитьДоступностьНастроек(ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	СохранитьНастройкиИЗакрытьФорму();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает форму для вызова сервера без контекста вызывающей формы
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Модуль_Платформа()
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Результат = ОсновнаяФорма().Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма()
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Процедура ПроверитьВерсиюПриложения()
	
	Ядро = Модуль_ЯдроНаСервере();
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПриложенияБольшеРавна8_3_8 = (Ядро.СравнитьВерсии(СисИнфо.ВерсияПриложения, "8.3.8") >= 0);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовТакси()
	
	ЗначенияСвойств = Новый Структура;
	ЗначенияСвойств.Вставить("ПодсказкаВвода", "");
	
	ЗначенияСвойств.ПодсказкаВвода = "Имя приложения в кабинете интегратора";
	ЗаполнитьЗначенияСвойств(Элементы.ИмяПриложения, ЗначенияСвойств);
	
	ЗначенияСвойств.ПодсказкаВвода = "Ключ приложения";
	ЗаполнитьЗначенияСвойств(Элементы.КлючПриложения, ЗначенияСвойств);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьНастроек(Форма)
	
	Форма.Элементы.ГруппаКонфигурацияПриложения.Доступность = Не Форма.ИспользоватьНастройкиПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиИЗакрытьФорму()
	
	Если Не ИспользоватьНастройкиПоУмолчанию Тогда
		Если Не ЗначениеЗаполнено(ИмяПриложения)
			Или Не ЗначениеЗаполнено(КлючПриложения) Тогда
			Платформа = Модуль_Платформа();
			Платформа.ПоказатьПредупреждениеЛок(, "Требуется указать имя и ключ приложения.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НастройкиИзменены = Ложь;
	
	Если Модифицированность Тогда
		ЗаписатьНастройки();
		НастройкиИзменены = Истина;
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть(НастройкиИзменены);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	Если КлючПриложенияИзменен Тогда
		КлючПриложенияЗначение = КлючПриложения;
		КлючПриложения = ?(ЗначениеЗаполнено(КлючПриложения), УникальныйИдентификатор, "");
	Иначе
		КлючПриложенияЗначение = ТекущиеНастройки.Ключ;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ИспользоватьСвоиНастройки = Не ИспользоватьНастройкиПоУмолчанию;
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Ядро.АутхКонфигурацияПриложенияНастройкиУстановить(ИмяПриложения, КлючПриложенияЗначение, ИспользоватьСвоиНастройки);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТекущиеНастройки()
	
	Ядро = Модуль_ЯдроНаСервере();
	Ядро.Пользователи_ПроверитьАдминистративныеПрава();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	ТекущиеНастройки = Ядро.АутхКонфигурацияПриложенияНастройки();
	УстановитьПривилегированныйРежим(Ложь);
	
	ИспользоватьНастройкиПоУмолчанию = Не ТекущиеНастройки.Использовать;
	ИмяПриложения = ТекущиеНастройки.Имя;
	КлючПриложения = ?(ЗначениеЗаполнено(ТекущиеНастройки.Ключ), УникальныйИдентификатор, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыНастроекЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиИЗакрытьФорму();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	Иначе
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры
