// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем ОсновнойМодуль Экспорт;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//{ СлужебныйПрограммныйИнтерфейс

// Событие возникает перед выполнением запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить выражения полей запроса для получения данных шапки.
//
// Параметры:
//  Реквизиты			 - Структура		 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение;
//  МетаданныеИсточника	 - ОбъектМетаданных	 - Метаданные документа-источника;
//  ВидЭД 				 - Строка			 - вид подгатавливаемого электронного документа (см. Перечисление_ВидыЭД());
//
// Пример:
//		Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузоотправитель") Тогда 
//			
//			Реквизиты.Грузоотправитель = 
//			"ВЫБОР
//			|	КОГДА Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//			|		ТОГДА Организация
//			|	ИНАЧЕ Грузоотправитель
//			|КОНЕЦ";
//			
//		КонецЕсли;
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника, ВидЭД) Экспорт
	
	Если Реквизиты.Свойство("БанковскийСчетОрганизации")
		И Не ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеИсточника, "БанковскийСчетОрганизации")
		И ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеИсточника, "СтруктурнаяЕдиница") Тогда
		
		Реквизиты.БанковскийСчетОрганизации = "СтруктурнаяЕдиница";
		
	КонецЕсли;
	
	Если Реквизиты.Свойство("ПолучательПлатежа")
		И ОсновнойМодуль.ЕстьРеквизитМетаданных(МетаданныеИсточника, "ОрганизацияПолучатель") Тогда
		Реквизиты.ПолучательПлатежа = "ОрганизацияПолучатель";
	КонецЕсли;
	
КонецПроцедуры

// Событие возникает после выполнения запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить или дополнить данные шапки документа.
//
// Параметры:
//  Шапка - Структура - Структура со значениями реквизитов документа.
//
// Пример:
//   Шапка.БанковскийСчетОрганизации = СчетОрганизации(Шапка.Организация);
//
Процедура ПослеПолученияДанныхШапкиДокумента(Шапка) Экспорт
	
	
	
КонецПроцедуры

// Событие возникает при получении сведений об организации, контрагенте или физическом лице.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие возникает при получении реквизитов договора, соглашения
// или иного основания передачи/перехода прав собственности.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие возникает при определении фактического места хранения контактной информации объекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации")
//			И СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
//			
//			СтандартнаяОбработка = Ложь;
//			ХранилищеКИ = СсылкаНаОбъект.ИндивидуальныйПредприниматель;
//			
//		КонецЕсли;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации")
		И СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		СтандартнаяОбработка = Ложь;
		ХранилищеКИ = СсылкаНаОбъект.ИндивидуальныйПредприниматель;
		
	КонецЕсли;
	
КонецПроцедуры

// Событие позволяет переопределить алгоритм вычисления вида контактной информации,
// соответствующего юр./физ. лицу и указанному типу контактной информации.
//
// Параметры:
//  ВидКИ - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации;
//  ЮрФизЛицо - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  ТипКИ - Строка - тип контактной информации (см. Перечисление_ВидыКИ);
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		
//		Если ТипКИ = Перечисление_ВидыКИ().ЮридическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
//		ИначеЕсли ТипКИ = Перечисление_ВидыКИ().ФактическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресФактический;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ВидКИ) Тогда
//			СтандартнаяОбработка = Ложь;
//		КонецЕсли;
//
Процедура ПриПолученииВидаКонтактнойИнформации(ВидКИ, ЮрФизЛицо, ТипКИ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Загружает сведения о маркировке из товарной части ЭД в информационную базу.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов.
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить загрузку средствами библиотеки интеграции ИС МП.
//
Процедура ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет список правил создания и заполнения документов учета.
//
// Параметры:
//  ПравилаСоздания - СписокЗначений - (возвращаемый параметр) идентификаторы правил создания и их представления.
//  ФорматЭД - Структура - см. ОсновнойМодуль.НовоеОписаниеФорматаЭлектронногоДокумента.
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения правил.
//
Процедура ПриЗаполненииПравилСозданияДокументовУчета(ПравилаСоздания, ФорматЭД, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФорматыЭД = МодульФорматыЭлектронныхДокументов();
	
	Если ФорматыЭД.ЭтоУниверсальныйПередаточныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоПередаточныйДокумент(ФорматЭД) Тогда
		
		Операция = ОперацияПоступлениеТоваровУслуг();
		Представление = "Поступление товаров и услуг";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияПоступлениеДопРасходов();
		Представление = "Поступление доп. расходов";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияВозвратОтПокупателя();
		Представление = "Возврат от покупателя";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияПоступлениеНМА();
		Представление = "Поступление НМА";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияПоступлениеОборудования();
		Представление = "Поступление оборудования";
		ПравилаСоздания.Добавить(Операция, Представление);
		
		Операция = ОперацияПоступлениеОбъектовСтроительства();
		Представление = "Поступление объектов строительства";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоУниверсальныйКорректировочныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоСоглашениеОбИзмененииСтоимости(ФорматЭД) Тогда
		
		Операция = ОперацияКорректировкаПоступления();
		Представление = "Корректировка поступления";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоСчетФактура(ФорматЭД) Тогда
		
		Операция = ОперацияСчетФактураПолученный();
		Представление = "Счет-фактура полученный";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	ИначеЕсли ФорматыЭД.ЭтоКорректировочныйСчетФактура(ФорматЭД) Тогда
		
		Операция = ОперацияКорректировочныйСчетФактураПолученный();
		Представление = "Счет-фактура полученный (корректировочный)";
		ПравилаСоздания.Добавить(Операция, Представление);
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка создания и заполнения документа учета по указанному правилу.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - (возвращаемый параметр) Заполняемый объект.
//  ИдентификаторОпераци - Строка - идентификатор правила создания и заполнения документа учета.
//  ПараметрыСоздания - Структура - см. ОсновнойМодуль.ПараметрыСозданияДокументаИнформационнойБазы.
//  ДанныеЭД - Структура - разобранное содержимое электронного документа (см. ОсновнойМодуль.ДанныеЭлектронногоДокумента)
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения объекта.
//
Процедура ПриСозданииДокументаУчета(ДокументОбъект, ИдентификаторОперации, ПараметрыСоздания, ДанныеЭД, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФорматЭД = ДанныеЭД.Формат;
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТабличнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	Если ИдентификаторОперации = ОперацияПоступлениеТоваровУслуг() Тогда
		
		ДокументОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		ЗаполнитьШапкуПоступленияТоваровУслуг(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьПоступленияТоваровУслуг(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияКорректировкаПоступления() Тогда
		
		ПроверитьЗаполнитьОснованиеКорректировкиПоступления(ПараметрыСоздания, ШапкаЭД, ФорматЭД);
		
		ДокументОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
		ЗаполнитьШапкуКорректировкиПоступления(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьКорректировкиПоступления(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияСчетФактураПолученный() Тогда
		
		ДокументОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		ЗаполнитьШапкуСчетаФактурыПолученного(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьОсновныеРеквизитыСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияКорректировочныйСчетФактураПолученный() Тогда
		
		ДокументОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		ЗаполнитьШапкуСчетаФактурыПолученного(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьОсновныеРеквизитыКорректировочногоСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияПоступлениеДопРасходов() Тогда
		
		ДокументОбъект = Документы.ПоступлениеДопРасходов.СоздатьДокумент();
		ЗаполнитьШапкуПоступленияДопРасходов(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьШапкуПоступленияДопРасходовПоТабличнойЧасти(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияВозвратОтПокупателя() Тогда
		
		ДокументОбъект = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
		ЗаполнитьШапкуВозвратОтПокупателя(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьВозвратОтПокупателя(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияПоступлениеНМА() Тогда
		
		ДокументОбъект = Документы.ПоступлениеНМА.СоздатьДокумент();
		ЗаполнитьШапкуПоступленияНМА(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьПоступленияНМА(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияПоступлениеОборудования() Тогда
		
		ДокументОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		ЗаполнитьШапкуПоступлениеОборудования(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьПоступлениеОборудования(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияПоступлениеОбъектовСтроительства() Тогда
		
		ДокументОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		ЗаполнитьШапкуПоступлениеОбъектаСтроительства(ДокументОбъект, ПараметрыСоздания, ШапкаЭД);
		ЗаполнитьТабличнуюЧастьПоступлениеОбъектаСтроительства(ДокументОбъект, ТабличнаяЧастьЭД);
		
	ИначеЕсли ИдентификаторОперации = ОперацияАктСверкиВзаиморасчетов() Тогда
		
		ДокументОбъект = Документы.АктСверкиВзаиморасчетов.СоздатьДокумент();
		ЗаполнитьШапкуАктаСверкиВзаиморасчетов(ДокументОбъект, ПараметрыСоздания, ШапкаЭД, ИтогиЭД);
		ЗаполнитьТабличнуюЧастьАктаСверкиВзаиморасчетов(ДокументОбъект, ТабличнаяЧастьЭД);
		
	Иначе
		
		Ошибка = "Неизвестный идентификатор операции (%1)";
		Ошибка = СтрЗаменить(Ошибка, "%1", ИдентификаторОперации);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Идентификатор Из ИдентификаторыНоменклатуры Цикл
		
		НоменклатураИБ = ПолучитьНоменклатуруИнформационнойБазы(ВладелецНоменклатуры, Идентификатор);
		Результат.Вставить(Идентификатор, НоменклатураИБ);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Номенклатура = НоменклатураИБ.Номенклатура;
	
	ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура);
	
КонецПроцедуры

// Заполняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента 
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы переопределить стандартный обработчик
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//  НаборНоменклатуры - Массив из ЛюбаяСсылка - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(СвойстваНоменклатурИБ, НаборНоменклатуры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

//{ Прослеживаемость

// Возвращает признак применения Федерального Закона 
// который вводит понятие прослеживаемости для определенных групп товаров
// Параметры:
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ применяется
//           Ложь   - ФЗ не применяется
Функция ИспользуетсяУчетПрослеживаемыхТоваров(Дата) Экспорт
		
	Результат = Ложь;
	
	ЕстьПрослеживаемостьВКонфигурации = КонфигурацияСПрослеживаемостью();
	Если ЕстьПрослеживаемостьВКонфигурации Тогда
		
		Если ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров") Тогда
		
			ДатаНачалаУчета = ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров();
			Если Дата > ДатаНачалаУчета Тогда
				Результат = Истина;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции 

Функция КонфигурацияСПрослеживаемостью()

	Результат = ОсновнойМодуль.СуществуетОбъектМетаданных("Константа.ВестиУчетПрослеживаемыхТоваров")
	            И ОсновнойМодуль.СуществуетОбъектМетаданных("Константа.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров")
				И ОсновнойМодуль.СуществуетОбъектМетаданных("ФункциональнаяОпция.ВестиУчетПрослеживаемыхТоваров");
	
	Возврат Результат;

КонецФункции

Функция ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров()
	
	Результат = Константы.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров.Получить();
	
	Возврат Результат;
	
КонецФункции

// Заполняет колонки "ДанныеПрослеживаемости" и "ПрослеживаемыйТовар" в строках таблицы товаров
// если колонок нет, то они добавляются
// Параметры:
// ТаблицаТоваров - ТаблицаЗначений - в данном параметре передается
// СсылкаНаОбъект - ДокументСсылка.РеализацияТоваровУслуг,
//					 ДокументСсылка.КорректировкаРеализации - владелец таблицы товаров
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправки(ТаблицаТоваров, СсылкаНаОбъект) Экспорт
	
	Если ИспользуетсяУчетПрослеживаемыхТоваров(СсылкаНаОбъект.Дата) Тогда
		
		Если ТаблицаТоваров.Колонки.Найти("ДанныеПрослеживаемости") = Неопределено Тогда
			ТаблицаТоваров.Колонки.Добавить("ДанныеПрослеживаемости");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("ПрослеживаемыйТовар") = Неопределено Тогда
			ТаблицаТоваров.Колонки.Добавить("ПрослеживаемыйТовар");
		КонецЕсли;
		
		Если ЭтоРТУ_ДД(СсылкаНаОбъект)
			ИЛИ ЭтоКорректировкаИсправление(СсылкаНаОбъект) Тогда
			
			ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(ТаблицаТоваров, СсылкаНаОбъект);
			
		ИначеЕсли ЭтоКорректировкаРеализации(СсылкаНаОбъект) Тогда
			
			ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(ТаблицаТоваров, СсылкаНаОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет колонки "ДанныеПрослеживаемости" и "ПрослеживаемыйТовар" в строках таблицы товаров
// если колонок нет, то они добавляются
// Параметры:
// ТаблицаТоваров - ТаблицаЗначений - в данном параметре передается
// СсылкаНаОбъект - ДокументСсылка.РеализацияТоваровУслуг,
//					 ДокументСсылка.КорректировкаРеализации - владелец таблицы товаров
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(ТаблицаТоваров, СсылкаНаОбъект)
	
	СтрокиТоваров			 = ТаблицаТоваров.НайтиСтроки(Новый Структура("ЭтоУслуга", Ложь)); 
	ИдентификаторыСтрок		 = ОсновнойМодуль.ВыгрузитьКолонку(СтрокиТоваров, "ИдентификаторСтроки");
	ОсновнойМодуль.УдалитьВсеВхожденияЗначенияИзМассива(ИдентификаторыСтрок, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяЕИ"				 , Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка"					 , СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИдентификаторыСтрок"		 , ИдентификаторыСтрок);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.РНПТ КАК РНПТ,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТТаблицаТоваров
	|ИЗ
	|	&ИмяМетаданныхТаблицыТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.НомерСтроки В(&ИдентификаторыСтрок)
	|	И ТаблицаТоваров.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НомераГТД.Код, """") КАК НомерГТДРегистрационныйНомер,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияПрослеживаемости,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК КодЕдиницыИзмеренияПрослеживаемости,
	|	ТаблицаТоваров.Количество КАК КоличествоПоРНПТ,
	|	ТаблицаТоваров.НомерСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура).БазоваяЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ТаблицаТоваров.РНПТ = НомераГТД.Ссылка";
	
	ИмяДокумента = СсылкаНаОбъект.Метаданные().Имя;
	ИмяМетаданныхТаблицыТоваров = СтрЗаменить("Документ.%ИмяДокумента%.Товары", "%ИмяДокумента%", ИмяДокумента);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхТаблицыТоваров" , ИмяМетаданныхТаблицыТоваров);
	
	СведенияПрослеживаемости = Запрос.Выполнить().Выгрузить();
	СведенияПрослеживаемости.Индексы.Добавить("ИдентификаторСтроки");
	
	Для Каждого СтрокаТЧ Из СтрокиТоваров Цикл
		
		СтрокиПрослеживаемости = СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки));
		
		Если СтрокиПрослеживаемости.Количество() > 0 Тогда
		
			СтрокаТЧ.ДанныеПрослеживаемости	 = Новый Массив;
			СтрокаТЧ.ПрослеживаемыйТовар	 = Истина;
			
			Для каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
				
				ЭлементПрослеживаемости = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").НовыеСвойстваЭлементаПрослеживаемости();
				ЗаполнитьЗначенияСвойств(ЭлементПрослеживаемости, СтрокаПрослеживаемости);
				СтрокаТЧ.ДанныеПрослеживаемости.Добавить(ЭлементПрослеживаемости);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет колонки "ДанныеПрослеживаемости" и "ПрослеживаемыйТовар" в строках таблицы товаров
// 
// Параметры:
// ТаблицаТоваров - ТаблицаЗначений - в данном параметре передается
// СсылкаНаОбъект - ДокументСсылка.КорректировкаРеализации - владелец таблицы товаров
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(ТаблицаТоваров, СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.РНПТ КАК РНПТ,
	|	СУММА(ТаблицаДокумента.Количество) КАК Количество,
	|	СУММА(ТаблицаДокумента.Количество) КАК КоличествоПрослеживаемости,
	|	ТаблицаДокумента.НомерСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.НомерСтроки В(&ИдентификаторыСтрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.РНПТ,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументаДоИзменения.Ссылка КАК Ссылка,
	|	ТаблицаДокументаДоИзменения.РНПТДо КАК РНПТ,
	|	СУММА(ТаблицаДокументаДоИзменения.КоличествоДоКорректировки) КАК Количество,
	|	СУММА(ТаблицаДокументаДоИзменения.КоличествоДоКорректировки) КАК КоличествоПрослеживаемости,
	|	ТаблицаДокументаДоИзменения.НомерСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ДанныеОснований
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТаблицаДокументаДоИзменения
	|ГДЕ
	|	ТаблицаДокументаДоИзменения.Ссылка = &Ссылка
	|	И ТаблицаДокументаДоИзменения.НомерСтроки В(&ИдентификаторыСтрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументаДоИзменения.Ссылка,
	|	ТаблицаДокументаДоИзменения.РНПТДо,
	|	ТаблицаДокументаДоИзменения.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаДокумента.РНПТ, ДанныеОснований.РНПТ) КАК НомерГТДРегистрационныйНомер,
	|	ЕСТЬNULL(ТаблицаДокумента.Количество, 0) КАК КоличествоПослеИзменения,
	|	ЕСТЬNULL(ДанныеОснований.Количество, 0) КАК КоличествоДоИзменения,
	|	ЕСТЬNULL(ТаблицаДокумента.ИдентификаторСтроки, ДанныеОснований.ИдентификаторСтроки) КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеОснований КАК ДанныеОснований
	|		ПО ТаблицаДокумента.РНПТ = ДанныеОснований.РНПТ
	|			И ТаблицаДокумента.Ссылка = ДанныеОснований.Ссылка
	|			И ТаблицаДокумента.ИдентификаторСтроки = ДанныеОснований.ИдентификаторСтроки
	|ГДЕ
	|	ЕСТЬNULL(ТаблицаДокумента.РНПТ, ДанныеОснований.РНПТ) <> &ПустойРНПТ
	|ИТОГИ
	|	СУММА(КоличествоПослеИзменения),
	|	СУММА(КоличествоДоИзменения)
	|ПО
	|	ИдентификаторСтроки,
	|	НомерГТДРегистрационныйНомер";

	СтрокиТоваров			 = ТаблицаТоваров.НайтиСтроки(Новый Структура("ЭтоУслуга", Ложь)); 
	ИдентификаторыСтрок		 = ОсновнойМодуль.ВыгрузитьКолонку(СтрокиТоваров, "ИдентификаторСтроки");
	Запрос.УстановитьПараметр("Ссылка"				 , СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИдентификаторыСтрок"	 , ИдентификаторыСтрок);
	Запрос.УстановитьПараметр("ДокументОснование"	 , СсылкаНаОбъект.ДокументРеализации);
	Запрос.УстановитьПараметр("ПустойРНПТ"			 , Справочники.НомераГТД.ПустаяСсылка());

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИдентификаторСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификаторСтроки.Следующий() Цикл
		
		СтрокаТовара = ТаблицаТоваров.Найти(ВыборкаИдентификаторСтроки.ИдентификаторСтроки, "ИдентификаторСтроки");
		
		Если СтрокаТовара = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовара.ДанныеПрослеживаемости		 = Новый Массив;
		СтрокаТовара.ПрослеживаемыйТовар		 = Истина;
		
		ВыборкаРегистрационныйНомер = ВыборкаИдентификаторСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаРегистрационныйНомер.Следующий() Цикл

			СтрокаПрослеживаемости =  ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке();
			ЗаполнитьЗначенияСвойств(СтрокаПрослеживаемости, ВыборкаРегистрационныйНомер);
			СтрокаПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости = СтрокаТовара.КодЕдиницыИзмерения;
			
			ЭтоУменьшение = СтрокаПрослеживаемости.КоличествоДоИзменения > СтрокаПрослеживаемости.КоличествоПослеИзменения; 
			Если ЭтоУменьшение Тогда
				КоличествоУменьшение = СтрокаПрослеживаемости.КоличествоДоИзменения - СтрокаПрослеживаемости.КоличествоПослеИзменения;
				СтрокаПрослеживаемости.КоличествоУменьшение = КоличествоУменьшение;
			КонецЕсли; 
			
			ЭтоУвеличение = СтрокаПрослеживаемости.КоличествоПослеИзменения > СтрокаПрослеживаемости.КоличествоДоИзменения;
			Если ЭтоУвеличение Тогда
				КоличествоУвеличение = СтрокаПрослеживаемости.КоличествоПослеИзменения - СтрокаПрослеживаемости.КоличествоДоИзменения;
				СтрокаПрослеживаемости.КоличествоУвеличение = КоличествоУвеличение;
			КонецЕсли; 
			
			СтрокаТовара.ДанныеПрослеживаемости.Добавить(СтрокаПрослеживаемости);
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнитьСтрокуТовараДаннымиПрослеживаемости(СтрокаТовара, ДанныеСтроки, ЭтоУКД = Ложь)
	
	СведенияПрослеживаемости = ДанныеСтроки.СведенияПрослеживаемости;
	
	НеТребуетсяЗаполнение = (СведенияПрослеживаемости = Неопределено
							Или СведенияПрослеживаемости.Количество() <> 1);
	
	Если НеТребуетсяЗаполнение Тогда
		
		Если ЭтоУКД Тогда
			СтрокаТовара.РНПТ = Неопределено;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПрослеживаемости Из СведенияПрослеживаемости Цикл
		НомерТовара = СтрокаПрослеживаемости.НомТовПрослеж;
		СтрокаТовара.РНПТ = НайтиСоздатьРНПТ(НомерТовара);
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСоздатьРНПТ(РегистрационныйНомер)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		
		Результат = НайтиСсылкуНаОбъектПоРеквизиту(Метаданные.Справочники.НомераГТД, "РегистрационныйНомер", РегистрационныйНомер);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = НайтиСсылкуНаОбъектПоРеквизиту(Метаданные.Справочники.НомераГТД, "Код", РегистрационныйНомер);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			НовыйРНПТ = Справочники.НомераГТД.СоздатьЭлемент();
			НовыйРНПТ.Код = РегистрационныйНомер;
			НовыйРНПТ.РегистрационныйНомер = РегистрационныйНомер;
			НовыйРНПТ.Записать();
			Результат = НовыйРНПТ.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции


//} Прослеживаемость

// Вызывается из Модуль_ИнтеграцияУниверсальнаяЛогика.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура	- ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат = Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Получает ссылку на документ, на который оформлена корректировка.
//
// Параметры:
//  КорректировочныйДокумент - ЛюбаяСсылка - Корректировочный документ (корректировка реализации или корректировочный счет-фактура)
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, Неопределено - ссылка на корректируемый документ.
//
Функция КорректируемыйДокумент(КорректировочныйДокумент) Экспорт
	
	ТипДокумента = ТипЗнч(КорректировочныйДокумент);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ИмяРеквизита = "ИсправляемыйСчетФактура";
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КорректировочныйДокумент, ИмяРеквизита);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ИмяРеквизита = "ИсправляемыйДокументРеализации";
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КорректировочныйДокумент, ИмяРеквизита);
		
	Иначе
		
		КонтекстПроверки = "ИнтеграционныйМодуль.КорректируемыйДокумент";
		ПараметрИмя = "КорректировочныйДокумент";
		ПараметрПредставление = Строка(КорректировочныйДокумент);
		Если КорректировочныйДокумент = Неопределено Тогда
			ПараметрПредставление = "Неопределено";
		КонецЕсли;
		
		Ошибка = ОсновнойМодуль.ПодставитьПараметрыВСтроку(
			"Недопустимое значение параметра %1 (передано значение: %2) в %3",
			ПараметрИмя,
			ПараметрПредставление,
			КонтекстПроверки
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} СлужебныйПрограммныйИнтерфейс



//{ СлужебныеПроцедурыИФункции

Функция ОперацияПоступлениеТоваровУслуг()
	Возврат "ПоступлениеТоваровУслуг";
КонецФункции

Функция ОперацияПоступлениеНМА()

	Возврат "ПоступлениеНМА";

КонецФункции

Функция ОперацияПоступлениеОборудования()

	Возврат "ПоступлениеОборудования";

КонецФункции

Функция ОперацияПоступлениеОбъектовСтроительства()

	Возврат "ПоступлениеОбъектовСтроительства";

КонецФункции

Функция ОперацияВозвратОтПокупателя()

	Возврат "ВозвратОтПокупателя";

КонецФункции

Функция ОперацияКорректировкаПоступления()
	Возврат "КорректировкаПоступления";
КонецФункции

Функция ОперацияСчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

Функция ОперацияКорректировочныйСчетФактураПолученный()
	Возврат "КорректировочныйСчетФактураПолученный";
КонецФункции

Функция ОперацияПоступлениеДопРасходов()
	Возврат "ПоступлениеДопРасходов";
КонецФункции

Функция ОперацияАктСверкиВзаиморасчетов()
	Возврат "АктСверкиВзаиморасчетов";
КонецФункции

Процедура ЗаполнитьШапкуПоступленияТоваровУслуг(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьСкладДокумента(ДокументОбъект);
	УстановитьСпособЗачетаАвансов(ДокументОбъект);
	УстановитьВидПоступленияПокупка(ДокументОбъект);
	
	ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект);
	
КонецПроцедуры

Функция НоменклатураЯвляетсяУслугойВЭД(ВидНоменклатурыЭД)
	
	Результат = Ложь;
	
	Если ВидНоменклатурыЭД = "2" Или ВидНоменклатурыЭД = "3" Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьПоступленияТоваровУслуг(ДокументОбъект, ТабличнаяЧасть)
	
	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ДокументОбъект.Дата);
	
	ВТоварахЕстьРНПТ = ЕстьРеквизитРНПТ(ДокументОбъект, "Товары");
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура = НоменклатураИБ.Номенклатура;
			Характеристика = НоменклатураИБ.Характеристика;
		Иначе
			Номенклатура = Неопределено;
			Характеристика = Неопределено;
		КонецЕсли;
		
		ЭтоУслуга = ЭтоНоменклатураУслуга(Номенклатура);
		НоменклатураЯвляетсяУслугойВЭД = НоменклатураЯвляетсяУслугойВЭД(СтрокаДанных.ВидНоменклатуры);
		
		Если (Номенклатура <> Неопределено И ЭтоУслуга) ИЛИ (Номенклатура = Неопределено И НоменклатураЯвляетсяУслугойВЭД) Тогда
			
			ИмяТЧ = "Услуги";
			
			СтрокаТЧ = ДокументОбъект.Услуги.Добавить();
			СтрокаТЧ.Номенклатура = Номенклатура;
			СтрокаТЧ.Содержание = СтрокаДанных.Наименование;
			
		Иначе
			
			ИмяТЧ = "Товары";
			
			СтрокаТЧ = ДокументОбъект.Товары.Добавить();
			СтрокаТЧ.Номенклатура = Номенклатура;
			СтрокаТЧ.ЕдиницаИзмерения = ЕдиницаИзмеренияПоКлассификатору(СтрокаДанных.КодЕдИзм);
			СтрокаТЧ.Коэффициент = 1;
			
			СтрокаТЧ.СтранаПроисхождения = НайтиСоздатьСтрануПроисхождения(СтрокаДанных.КодСтраны);
			
			Если ИспользуетсяУчетПрослеживаемыхТоваров
				И ВТоварахЕстьРНПТ
				И ЗначениеЗаполнено(СтрокаДанных.СведенияПрослеживаемости) Тогда
				ДополнитьСтрокуТовараДаннымиПрослеживаемости(СтрокаТЧ, СтрокаДанных);
			ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.НомерГТД) Тогда
				СтрокаТЧ.НомерГТД = НайтиСоздатьНомерГТД(СтрокаДанных.НомерГТД);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТЧ.Количество = СтрокаДанных.Количество;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
			СтрокаТЧ.Количество = 1;
		КонецЕсли;
		
		Сумма = СтрокаДанных.СуммаБезНДС;
		Цена = СтрокаДанных.Цена;
		
		Если ДокументОбъект.СуммаВключаетНДС Тогда
			Сумма = СтрокаДанных.СуммаСНДС;
			Цена = Сумма / СтрокаТЧ.Количество;
		КонецЕсли;

		СтрокаТЧ.Цена = Цена;
		СтрокаТЧ.Сумма = Сумма;
		СтрокаТЧ.СуммаНДС = СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС = ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
		ЗаполнитьСчетаУчетаСтрокиТабличнойЧасти(СтрокаТЧ, ДокументОбъект);
		
		ЗаполнитьОтражениеВУСН(СтрокаТЧ, ДокументОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуПоступленияНМА(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)

	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьСпособЗачетаАвансов(ДокументОбъект);
	
	ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект);

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоступленияНМА(ДокументОбъект, ТабличнаяЧасть)
    
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		СтрокаТЧ = ДокументОбъект.НематериальныеАктивы.Добавить();
		
		СтрокаТЧ.Сумма		= СтрокаДанных.СуммаБезНДС;
		СтрокаТЧ.СуммаНДС	= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС	= ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
		ДокументОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, "НематериальныеАктивы", Истина);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьШапкуПоступлениеОборудования(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьСкладДокумента(ДокументОбъект);
	УстановитьСпособЗачетаАвансов(ДокументОбъект);
	УстановитьВидПоступлениеОборудования(ДокументОбъект);
	
	ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоступлениеОборудования(ДокументОбъект, ТабличнаяЧасть)
	
	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ДокументОбъект.Дата);
	
	ВТоварахЕстьРНПТ = ЕстьРеквизитРНПТ(ДокументОбъект, "Оборудование");
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура	= НоменклатураИБ.Номенклатура;
			Характеристика	= НоменклатураИБ.Характеристика;
		Иначе
			Номенклатура	= Неопределено;
			Характеристика	= Неопределено;
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.Оборудование.Добавить();
		СтрокаТЧ.Номенклатура			= Номенклатура;
		СтрокаТЧ.ЕдиницаИзмерения		= ЕдиницаИзмеренияПоКлассификатору(СтрокаДанных.КодЕдИзм);
		СтрокаТЧ.Коэффициент			= 1;		
		СтрокаТЧ.СтранаПроисхождения	= НайтиСоздатьСтрануПроисхождения(СтрокаДанных.КодСтраны);
		
		Если ИспользуетсяУчетПрослеживаемыхТоваров
			И ВТоварахЕстьРНПТ
			И ЗначениеЗаполнено(СтрокаДанных.СведенияПрослеживаемости) Тогда
			ДополнитьСтрокуТовараДаннымиПрослеживаемости(СтрокаТЧ, СтрокаДанных);
		ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.НомерГТД) Тогда
			СтрокаТЧ.НомерГТД = НайтиСоздатьНомерГТД(СтрокаДанных.НомерГТД);
		КонецЕсли;
		
		Количество = СтрокаДанных.Количество;
		Если Не ЗначениеЗаполнено(Количество) Тогда
			Количество = 1;
		КонецЕсли;
		
		Сумма	= СтрокаДанных.СуммаБезНДС;
		Цена	= СтрокаДанных.Цена;
		
		Если ДокументОбъект.СуммаВключаетНДС Тогда
			Сумма	= СтрокаДанных.СуммаСНДС;
			Цена	= Сумма / Количество;
		КонецЕсли;
		
		СтрокаТЧ.Количество	= Количество;
		СтрокаТЧ.Цена		= Цена;
		СтрокаТЧ.Сумма		= Сумма;
		СтрокаТЧ.СуммаНДС	= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС	= ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
		ДокументОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, "Оборудование", Истина, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуПоступлениеОбъектаСтроительства(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьСкладДокумента(ДокументОбъект);
	УстановитьСпособЗачетаАвансов(ДокументОбъект);
	УстановитьВидПоступлениеОбъектаСтроительства(ДокументОбъект);
	
	ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоступлениеОбъектаСтроительства(ДокументОбъект, ТабличнаяЧасть)
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		СтрокаТЧ = ДокументОбъект.ОбъектыСтроительства.Добавить();
		
		СтрокаТЧ.Сумма		= СтрокаДанных.СуммаБезНДС;
		СтрокаТЧ.СуммаНДС	= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС	= ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
		ДокументОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства(СтрокаТЧ, Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуВозвратОтПокупателя(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)

	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьДоговорСПокупателем(ДокументОбъект);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьСкладДокумента(ДокументОбъект);
	УстановитьВидПродажаКомиссия(ДокументОбъект);
	
	ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект);

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьВозвратОтПокупателя(ДокументОбъект, ТабличнаяЧасть)
	
	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура	= НоменклатураИБ.Номенклатура;
			Характеристика	= НоменклатураИБ.Характеристика;
		Иначе
			Номенклатура	= Неопределено;
			Характеристика	= Неопределено;
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.Товары.Добавить();
		СтрокаТЧ.Номенклатура = Номенклатура;
		
		СтрокаТЧ.СтранаПроисхождения = НайтиСоздатьСтрануПроисхождения(СтрокаДанных.КодСтраны);
		
		Если ЗначениеЗаполнено(СтрокаДанных.НомерГТД) Тогда
			СтрокаТЧ.НомерГТД = НайтиСоздатьНомерГТД(СтрокаДанных.НомерГТД);
		КонецЕсли;
		
		Количество = СтрокаДанных.Количество;
		Если Не ЗначениеЗаполнено(Количество) Тогда
			Количество = 1;
		КонецЕсли;
		
		Сумма	= СтрокаДанных.СуммаБезНДС;
		Цена	= СтрокаДанных.Цена;
		
		Если ДокументОбъект.СуммаВключаетНДС Тогда
			Сумма	= СтрокаДанных.СуммаСНДС;
			Цена	= Сумма / Количество;
		КонецЕсли;
		
		СтрокаТЧ.Количество	= Количество;
		СтрокаТЧ.Цена		= Цена;
		СтрокаТЧ.Сумма		= Сумма;
		СтрокаТЧ.СуммаНДС	= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС	= ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС);
		
		ДокументОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, "Товары", Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуКорректировкиПоступления(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	ЗаполнитьПоДокументуОснованию(ДокументОбъект, ПараметрыСоздания.ДокументОснование);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВидКорректировкиСогласованноеИзменение(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьКорректировкиПоступления(ДокументОбъект, ТабличнаяЧасть)
	
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ДокументОбъект.Дата);
	
	ВладелецНоменклатуры = ДокументОбъект.Контрагент;
	
	ОбработанныеСтроки = Новый Массив;
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		НоменклатураНаименование = СтрокаДанных.Наименование;
		
		НоменклатураИБ = СтрокаДанных.НоменклатураИнформационнойБазы;
		
		Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
			Номенклатура = НоменклатураИБ.Номенклатура;
		КонецЕсли;
		
		Если Номенклатура = Неопределено Тогда
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		РеквизитыНоменклатуры	 = РеквизитыНоменклатурыИнформационнойБазы(Номенклатура);
		ЭтоУслуга				 = РеквизитыНоменклатуры.Услуга;
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Номенклатура"					, Номенклатура);
		СтруктураЗаполнения.Вставить("Количество"					, СтрокаДанных.Количество);
		СтруктураЗаполнения.Вставить("КоличествоДоИзменения"		, СтрокаДанных.Количество_До);
		СтруктураЗаполнения.Вставить("Цена"							, СтрокаДанных.Цена);
		СтруктураЗаполнения.Вставить("ЦенаДоИзменения"				, СтрокаДанных.Цена_До);
		СтруктураЗаполнения.Вставить("Сумма"						, СтрокаДанных.СуммаБезНДС);
		СтруктураЗаполнения.Вставить("СуммаДоИзменения"				, СтрокаДанных.СуммаБезНДС_До);
		СтруктураЗаполнения.Вставить("СуммаНДС"						, СтрокаДанных.СуммаНДС);
		СтруктураЗаполнения.Вставить("СуммаНДСДоИзменения"			, СтрокаДанных.СуммаНДС_До);
		СтруктураЗаполнения.Вставить("СтавкаНДС"					, ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС_До));
		СтруктураЗаполнения.Вставить("СтавкаНДСДоИзменения"			, ПолучитьСтавкуНДСДиадок(СтрокаДанных.СтавкаНДС_До));
		
		ПоляПоиска = "Номенклатура,СтавкаНДС";
		
		Если ЭтоУслуга Тогда
			ИмяТЧ = "Услуги";
			СтруктураЗаполнения.Вставить("Содержание"				, НоменклатураНаименование);
			СтруктураЗаполнения.Вставить("СодержаниеДоИзменения"	, НоменклатураНаименование);
		Иначе
			ИмяТЧ = "Товары";
		КонецЕсли;
		
		СтрокаТЧ = Неопределено;
		
		//Найдем исходную строку в документе корректировки
		СтруктураПоиска = Новый Структура(ПоляПоиска);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтруктураЗаполнения);
		
		ТабличнаяЧастьДокумента = ДокументОбъект[ИмяТЧ];
		СтрокиДокумента = ТабличнаяЧастьДокумента.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаДокумента Из СтрокиДокумента Цикл
			
			Если ОбработанныеСтроки.Найти(СтрокаДокумента) = Неопределено Тогда
				СтрокаТЧ = СтрокаДокумента;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		// Такой строки в документе корректировки нет - добавляем.
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ТабличнаяЧастьДокумента.Добавить();
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);
		
		Если ДокументОбъект.СуммаВключаетНДС Тогда
		
			// Включаем НДС в сумму
			СтрокаТЧ.Сумма 					= СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС;
			СтрокаТЧ.СуммаДоИзменения		= СтрокаТЧ.СуммаДоИзменения + СтрокаТЧ.СуммаНДСДоИзменения;
			
			// Пересчитаем цену
			РасчетноеКоличество = ?(СтрокаТЧ.Количество = 0, 1, СтрокаТЧ.Количество);
			СтрокаТЧ.Цена = СтрокаТЧ.Сумма / РасчетноеКоличество;
			
			РасчетноеКоличествоДоИзменения 	= ?(СтрокаТЧ.КоличествоДоИзменения = 0, 1, СтрокаТЧ.КоличествоДоИзменения);
			СтрокаТЧ.ЦенаДоИзменения 		= СтрокаТЧ.СуммаДоИзменения / РасчетноеКоличествоДоИзменения;
			
		КонецЕсли;
		
		ЗаполнитьСчетаУчетаСтрокиТабличнойЧасти(СтрокаТЧ, ДокументОбъект);
		
		// Проослеживаемость
		Если ИспользуетсяУчетПрослеживаемыхТоваров
			И НЕ ЭтоУслуга Тогда
			
			ДополнитьСтрокуТовараДаннымиПрослеживаемости(СтрокаТЧ, СтрокаДанных, Истина);
			СтрокаТЧ.СтранаПроисхождения = СтрокаТЧ.СтранаПроисхожденияДоИзменения
			
		КонецЕсли;
		
		ОбработанныеСтроки.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуСчетаФактурыПолученного(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	ЗаполнитьПоДокументуОснованию(ДокументОбъект, ПараметрыСоздания.ДокументОснование);
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьРеквизитыИсправленияВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьОбщиеРеквизитыСчетаФактуры(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьОсновныеРеквизитыСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД)

	ЭтоСчетФактураНаАванс	= ДанныеЭД.ЭтоАванс;
	Итоги					= ДанныеЭД.Итоги;

	ДокументОбъект.СуммаДокумента		= Итоги.СуммаВсего;
	ДокументОбъект.СуммаНДСДокумента	= Итоги.СуммаНДС;
	
	Если ЭтоСчетФактураНаАванс Тогда
		
		Для Каждого СтрокаСФ Из ДанныеЭД.ТабличнаяЧасть Цикл
			
			НоваяСтрокаАвансы = ДокументОбъект.Авансы.Добавить();
			
			НоваяСтрокаАвансы.Сумма		= СтрокаСФ.СуммаСНДС;
			НоваяСтрокаАвансы.СуммаНДС	= СтрокаСФ.СуммаНДС;
			НоваяСтрокаАвансы.СтавкаНДС	= ПолучитьСтавкуНДСДиадок(СтрокаСФ.СтавкаНДС);
			
		КонецЦикла;
		
		ДокументОбъект.КодВидаОперации = "02";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс;
		
	Иначе
		
		ДокументОбъект.КодВидаОперации = "01";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОсновныеРеквизитыКорректировочногоСчетаФактурыПолученного(ДокументОбъект, ДанныеЭД, ФорматЭД)

	ЭтоСчетФактураНаАванс	= ДанныеЭД.ЭтоАванс;	
	ИтогиУменьшение			= ДанныеЭД.ИтогиУменьшение;
	ИтогиУвеличение			= ДанныеЭД.ИтогиУвеличение;
	
	ДокументОбъект.СуммаУменьшение		= ИтогиУменьшение.СуммаВсего;
	ДокументОбъект.СуммаНДСУменьшение	= ИтогиУменьшение.СуммаНДС;
	
	ДокументОбъект.СуммаУвеличение		= ИтогиУвеличение.СуммаВсего;
	ДокументОбъект.СуммаНДСУвеличение	= ИтогиУвеличение.СуммаНДС;
	
	Если ЭтоСчетФактураНаАванс Тогда
		ДокументОбъект.КодВидаОперации = "02";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.КорректировочныйНаАванс;
	Иначе
		ДокументОбъект.КодВидаОперации = "01";
		ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбщиеРеквизитыСчетаФактуры(ДокументОбъект)

	ДокументОбъект.КодСпособаПолучения = 2;
	
	Если ДокументОбъект.ДокументыОснования.Количество() = 0 Тогда
		ДокументОбъект.ДокументыОснования.Добавить().ДокументОснование = Неопределено;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьШапкуПоступленияДопРасходов(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента)
	
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	УстановитьДоговорСПоставщиком(ДокументОбъект);
	
	УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	УстановитьВалютуДокумента(ДокументОбъект);
	УстановитьПараметрыУчетаНДС(ДокументОбъект, ПараметрыСоздания.ЦенаВключаетНДС);
	УстановитьСпособЗачетаАвансов(ДокументОбъект);
	
	ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьШапкуПоступленияДопРасходовПоТабличнойЧасти(ДокументОбъект, ТабличнаяЧастьЭД)
	
	Если Не ЗначениеЗаполнено(ТабличнаяЧастьЭД) Тогда
		Возврат;
	КонецЕсли;
	
	СуммаСНалогом = 0;
	СуммаНалога = 0;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Для Каждого СтрокаДанных Из ТабличнаяЧастьЭД Цикл
		
		СуммаСНалогом = СуммаСНалогом + ТипЧисло.ПривестиЗначение(СтрокаДанных.СуммаСНДС);
		СуммаНалога = СуммаНалога + ТипЧисло.ПривестиЗначение(СтрокаДанных.СуммаНДС);
		
	КонецЦикла;
	
	СуммаБезНалога = СуммаСНалогом - СуммаНалога;
	
	ПерваяСтрокаТЧ = ТабличнаяЧастьЭД[0];
	ДокументОбъект.СтавкаНДС = ПолучитьСтавкуНДСДиадок(ПерваяСтрокаТЧ.СтавкаНДС);
	ДокументОбъект.Содержание = ПерваяСтрокаТЧ.Наименование;
	ДокументОбъект.СуммаДокумента = СуммаСНалогом;
	ДокументОбъект.СуммаНДС = СуммаНалога;
	ДокументОбъект.Сумма = СуммаБезНалога;
	
	Если ДокументОбъект.СуммаВключаетНДС Тогда
		ДокументОбъект.Сумма = СуммаСНалогом;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуАктаСверкиВзаиморасчетов(ДокументОбъект, ПараметрыСоздания, РеквизитыЭлектронногоДокумента, ИтогиТЧ)
	
	УстановитьОрганизациюДокумента(ДокументОбъект, ПараметрыСоздания.Организация);
	УстановитьКонтрагентаДокумента(ДокументОбъект, ПараметрыСоздания.Контрагент);
	
	УстановитьОсновныеРеквизитыДокумента(ДокументОбъект);
	
	УстановитьРеквизитыСверкиВзаиморасчетов(ДокументОбъект, РеквизитыЭлектронногоДокумента, ИтогиТЧ);
	ЗаполнитьСчетаУчетаАктаСверкиВзаиморасчетов(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьАктаСверкиВзаиморасчетов(ДокументОбъект, ТабличнаяЧастьЭД)
	
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		
		Договор = ДоговорПоСтрокеАктаСверки(ДокументОбъект, СтрокаДоговора);
		
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ДокументОбъект.ПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.Договор = Договор;
				СтрокаПоДаннымКонтрагента.Дата = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.Представление = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.Дебет = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.Кредит = СтрокаОперации.СуммаКредит;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьРеквизитыСверкиВзаиморасчетов(ДокументОбъект, РеквизитыЭлектронногоДокумента, ИтогиТЧ)
	
	ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета();
	ДокументОбъект.ОстатокНаНачало = ИтогиТЧ.СальдоНачДеб - ИтогиТЧ.СальдоНачКр;
	ДокументОбъект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ДокументОбъект.СверкаСогласована = Ложь;
	ДокументОбъект.РазбитьПоДоговорам = Истина;
	ДокументОбъект.ВыводитьПолныеНазванияДокументов = Ложь;
	
	ДокументОбъект.ДатаНачала = РеквизитыЭлектронногоДокумента.ДатаНачала;
	ДокументОбъект.Датаокончания = РеквизитыЭлектронногоДокумента.Датаокончания;
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаАктаСверкиВзаиморасчетов(ДокументОбъект)
	
	СчетаПоУмолчанию = Новый Массив();
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
	
	Для Каждого Счет Из СчетаПоУмолчанию Цикл
		
		СтрокаСчета = ДокументОбъект.СписокСчетов.Добавить();
		СтрокаСчета.Счет = Счет;
		СтрокаСчета.УчаствуетВРасчетах = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДоговорПоСтрокеАктаСверки(ДокументОбъект, ДанныеДоговора)
	
	Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	ВалютаДоговора = ДокументОбъект.ВалютаДокумента;
	Организация = ДокументОбъект.Организация;
	Контрагент = ДокументОбъект.Контрагент;
	НомерДоговора = ДанныеДоговора.Номер;
	ДатаДоговора = ДанныеДоговора.Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ДоговорПоСтрокеАктаСверки();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дата", ДатаДоговора);
	Запрос.УстановитьПараметр("Номер", НомерДоговора);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДоговорПоСтрокеАктаСверки()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТаблицаДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ТаблицаДоговорыКонтрагентов
	|ГДЕ
	|	ТаблицаДоговорыКонтрагентов.Организация = &Организация
	|	И ТаблицаДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ТаблицаДоговорыКонтрагентов.Дата = &Дата
	|	И ТаблицаДоговорыКонтрагентов.Номер = &Номер
	|	И ТаблицаДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	|	И НЕ ТаблицаДоговорыКонтрагентов.ПометкаУдаления";
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыНоменклатурыИнформационнойБазы(Номенклатура)
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Услуга");
	ТребуемыеРеквизиты.Вставить("СтатьяЗатрат");
	ТребуемыеРеквизиты.Вставить("НоменклатурнаяГруппа");
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, ТребуемыеРеквизиты);
	Иначе
		Результат = ТребуемыеРеквизиты;
		Результат.Услуга = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНоменклатураУслуга(Номенклатура)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Услуга");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕдиницаИзмеренияПоКлассификатору(КодЕИ)
	
	Результат = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодЕИ);
	Возврат Результат;
	
КонецФункции

Функция НайтиСоздатьСтрануПроисхождения(КодСтраны)
	
	ДлинаКода = Метаданные.Справочники.КлассификаторСтранМира.ДлинаКода;
	
	Если Не ЗначениеЗаполнено(КодСтраны)
		ИЛИ СтрДлина(СокрЛП(КодСтраны)) <> ДлинаКода Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КлассификаторСтранМира.Ссылка
		|ИЗ
		|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
		|ГДЕ
		|	КлассификаторСтранМира.Код = &КодСтраны";
	
	Запрос.УстановитьПараметр("КодСтраны", КодСтраны);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Неопределено;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСоздатьНомерГТД(НомерДекларации)
	
	СоздатьНовый = Истина;
	Результат = ПолучитьСсылкуНомерГТД(НомерДекларации, СоздатьНовый);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПоДокументуОснованию(ДокументОбъект, ДокументОснование)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.Заполнить(ДокументОснование);
	
КонецПроцедуры

Процедура УстановитьОрганизациюДокумента(ДокументОбъект, Знач Организация)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ДокументОбъект.Организация = Организация;
	
КонецПроцедуры

Процедура УстановитьКонтрагентаДокумента(ДокументОбъект, Знач Контрагент)
	
	ДокументОбъект.Контрагент = Контрагент;
	
КонецПроцедуры

Процедура УстановитьСкладДокумента(ДокументОбъект)
	
	ДокументОбъект.Склад = СкладПоУмолчанию();
	
КонецПроцедуры

Процедура УстановитьСпособЗачетаАвансов(ДокументОбъект)
	
	ДокументОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	
КонецПроцедуры

Процедура УстановитьВалютуДокумента(ДокументОбъект)
	
	ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета();
	ДокументОбъект.КурсВзаиморасчетов = 1;
	ДокументОбъект.КратностьВзаиморасчетов = 1;
	
КонецПроцедуры

Процедура УстановитьОсновныеРеквизитыДокумента(ДокументОбъект)
	
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Ответственный = ТекущийПользователь();
	
КонецПроцедуры

Процедура УстановитьРеквизитыВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента)
	
	ДокументОбъект.ДатаВходящегоДокумента	= РеквизитыЭлектронногоДокумента.Дата;
	ДокументОбъект.НомерВходящегоДокумента	= РеквизитыЭлектронногоДокумента.Номер;
	
КонецПроцедуры

Процедура УстановитьРеквизитыИсправленияВходящегоДокумента(ДокументОбъект, РеквизитыЭлектронногоДокумента)

	ДокументОбъект.НомерИсправления	= РеквизитыЭлектронногоДокумента.НомерИсправления;
	ДокументОбъект.ДатаИсправления	= РеквизитыЭлектронногоДокумента.ДатаИсправления;
	
	Если ЗначениеЗаполнено(ДокументОбъект.НомерИсправления)
		И ЗначениеЗаполнено(ДокументОбъект.ДатаИсправления) Тогда
		ДокументОбъект.Исправление = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДоговорСПоставщиком(ДокументОбъект)
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(
		ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент,
		ДокументОбъект.Организация,
		ВидыДоговоров
	);
	
КонецПроцедуры

Процедура УстановитьДоговорСПокупателем(ДокументОбъект)
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(
		ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент,
		ДокументОбъект.Организация,
		ВидыДоговоров
	);
	
КонецПроцедуры

Процедура УстановитьПараметрыУчетаНДС(ДокументОбъект, ЦенаВключаетНДС)
	
	ДокументОбъект.УчитыватьНДС = Истина;
	ДокументОбъект.СуммаВключаетНДС = ЦенаВключаетНДС;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("НДСВключенВСтоимость", ДокументОбъект.Метаданные()) Тогда
		Если НалоговыйУчетУСН.ПрименениеУСН(ДокументОбъект.Организация, ДокументОбъект.Дата)
			ИЛИ НалоговыйУчетУСН.ПрименениеОсобогоПорядкаНалогообложения(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
			ДокументОбъект.НДСВключенВСтоимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидПоступленияПокупка(ДокументОбъект)
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
	
КонецПроцедуры

Процедура УстановитьВидПоступлениеОборудования(ДокументОбъект)
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование;
	
КонецПроцедуры

Процедура УстановитьВидПоступлениеОбъектаСтроительства(ДокументОбъект)
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства;
	
КонецПроцедуры

Процедура УстановитьВидПродажаКомиссия(ДокументОбъект)
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
	
КонецПроцедуры

Процедура УстановитьВидКорректировкиСогласованноеИзменение(ДокументОбъект)
	
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьОснованиеКорректировкиПоступления(ПараметрыСоздания, ШапкаЭД, ФорматЭД)
	
	Если ЗначениеЗаполнено(ПараметрыСоздания.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ФорматыЭД = МодульФорматыЭлектронныхДокументов();
	
	ТипыОснований = Новый Массив;
	
	Если ФорматыЭД.ЭтоУниверсальныйКорректировочныйДокумент(ФорматЭД)
		Или ФорматыЭД.ЭтоКорректировочныйСчетФактура(ФорматЭД) Тогда
		
		ТипыОснований.Добавить("СчетФактураПолученный");
		
	ИначеЕсли ФорматыЭД.ЭтоСоглашениеОбИзмененииСтоимости(ФорматЭД) Тогда
		
		ТипыОснований.Добавить("ПоступлениеТоваровУслуг");
		ТипыОснований.Добавить("ПоступлениеДопРасходов");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипыОснований) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОснования = ШапкаЭД.РеквизитыОснования;
	Если Не ЗначениеЗаполнено(РеквизитыОснования) Тогда
		ЗаписатьОшибкуСозданияДокумента(ШапкаЭД, ФорматЭД, "Не заполнены реквизиты основания Корректировочного документа"); 
		Возврат;
	ИначеЕсли РеквизитыОснования.Количество() > 1 Тогда
		ЗаписатьОшибкуСозданияДокумента(ШапкаЭД, ФорматЭД, "Не найден документ основания, т.к. в электронном документе указаны реквизиты нескольких оснований");
		Возврат;
	Иначе
		Основание = РеквизитыОснования[0];
		НомерЭД = Основание.Номер;
		ДатаЭД = Основание.Дата;
	КонецЕсли;
	
	Организация = ПараметрыСоздания.Организация;
	Контрагент = ПараметрыСоздания.Контрагент;
	
	Для Каждого ВидДокумента Из ТипыОснований Цикл
		
		СсылкаНаОбъект = НайтиДокументПоРеквизитам(
			ВидДокумента,
			Организация,
			Контрагент,
			ДатаЭД,
			НомерЭД
		);
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			
			Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
				СсылкаНаОбъект = СсылкаНаОбъект.ДокументОснование;
			КонецЕсли;
			
			ПараметрыСоздания.ДокументОснование = СсылкаНаОбъект;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиДокументПоРеквизитам(ВидДокумента, Организация, Контрагент, ДатаВходящегоДокумента, НомерВходящегоДокумента)
	
	ШаблонЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Дата КАК Дата
	|ИЗ
	|	&ПолноеИмяТаблицы КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ПометкаУдаления
	|	И Таблица.Организация = &Организация
	|	И Таблица.Контрагент = &Контрагент
	|	И Таблица.ДатаВходящегоДокумента = &ДатаДокумента
	|	И Таблица.НомерВходящегоДокумента = &НомерДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	ПолноеИмяТаблицы = "Документ." + ВидДокумента;
	ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаВходящегоДокумента);
	Запрос.УстановитьПараметр("НомерДокумента", НомерВходящегоДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект)
	
	СчетаРасчетов = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(
		ДокументОбъект.Организация,
		ДокументОбъект.Контрагент,
		ДокументОбъект.ДоговорКонтрагента
	);
	
	ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаРасчетов.СчетРасчетов;
	ДокументОбъект.СчетУчетаРасчетовПоАвансам = СчетаРасчетов.СчетАвансов;
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаСтрокиТабличнойЧасти(СтрокаТЧ, ДокументОбъект)
	
	СчетаУчетаНоменклатуры = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(ДокументОбъект.Организация, СтрокаТЧ.Номенклатура, ДокументОбъект.Склад);
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СчетаУчетаНоменклатуры);
	
	СчетУчета = СчетаУчетаНоменклатуры.СчетУчета;
	СчетаУчетаЗатрат = Новый Структура;
	СчетаУчетаЗатрат.Вставить("СчетЗатрат", СчетУчета);
	СчетаУчетаЗатрат.Вставить("СчетЗатратНУ", СчетУчета);
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СчетаУчетаЗатрат);
	
КонецПроцедуры

Процедура ЗаполнитьОтражениеВУСН(СтрокаТЧ, ДокументОбъект)
	
	ПрименяетсяУСН = НалоговыйУчетУСН.ПрименениеУСН(ДокументОбъект.Организация, ДокументОбъект.Дата);
	ПрименяетсяОсобыйПорядокНалогообложения = НалоговыйУчетУСН.ПрименениеОсобогоПорядкаНалогообложения(ДокументОбъект.Организация, ДокументОбъект.Дата);
	
	Если НЕ ПрименяетсяУСН ИЛИ ПрименяетсяОсобыйПорядокНалогообложения Тогда
		Возврат;
	КонецЕсли;
		
	ОтражениеВУСН_Товары = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ОтражениеВУСН", ДокументОбъект.Метаданные(), "Товары");
	ОтражениеВУСН_Услуги = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ОтражениеВУСН", ДокументОбъект.Метаданные(), "Услуги");
	
	Если ОтражениеВУСН_Товары ИЛИ ОтражениеВУСН_Услуги Тогда
		
		Если (ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
			И ДокументОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
			
			СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			
		ИначеЕсли ДокументОбъект.ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			
			СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВалютаРегламентированногоУчета()
	
	Результат = Константы.ВалютаРегламентированногоУчета.Получить();
	Возврат Результат;
	
КонецФункции

Функция ТекущийПользователь()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

Функция ОрганизацияПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнаяОрганизация");
	
	Возврат Результат;
	
КонецФункции

Функция ПоставщикПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойПоставщик");
	
	Возврат Результат;
	
КонецФункции

Функция ПодразделениеПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновноеПодразделение");
	
	Возврат Результат;
	
КонецФункции

Функция СкладПоУмолчанию()
	
	Пользователь = ТекущийПользователь();
	Результат = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойСклад");
	
	Возврат Результат;
	
КонецФункции

Функция НоваяНоменклатураИнформационнойБазы(Номенклатура, Характеристика = Неопределено, Упаковка = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Номенклатура);
	Результат.Вставить("Характеристика");
	Результат.Вставить("Упаковка");
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Результат.Характеристика = Характеристика;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Результат.Упаковка = Упаковка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНоменклатуруИнформационнойБазы(Владелец, ИдентификаторНоменклатуры)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК НоменклатураПоставщика,
	|	Т.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Упаковка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК Т
	|ГДЕ
	|	Т.Владелец = &Владелец
	|	И Т.Идентификатор = &Идентификатор
	|	И НЕ Т.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	
	Если Выборка.Следующий() Тогда
		
		Результат = НоваяНоменклатураИнформационнойБазы(
			Выборка.Номенклатура,
			Выборка.Характеристика,
			Выборка.Упаковка
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, Номенклатура)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК Т
	|ГДЕ
	|	Т.Владелец = &Владелец
	|	И Т.Идентификатор = &Идентификатор
	|	И НЕ Т.ПометкаУдаления";
	
	ВладелецНоменклатуры = НоменклатураКонтрагента.Владелец;
	ИдентификаторНоменклатуры = НоменклатураКонтрагента.Идентификатор;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НовыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		НовыйОбъект = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйОбъект, НоменклатураКонтрагента, , "Код");
	
	НовыйОбъект.Номенклатура = Номенклатура;
	
	НовыйОбъект.Записать();
	
КонецПроцедуры

Функция МодульФорматыЭлектронныхДокументов()
	
	ИмяМодуля = "ФорматыЭД";
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитРНПТ(Объект, ИмяТЧ)

	МетаданныеОбъекта = Объект.Метаданные();
	
	ВТоварахЕстьРНПТ = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("РНПТ", МетаданныеОбъекта, ИмяТЧ);
	
	Возврат ВТоварахЕстьРНПТ;

КонецФункции

Процедура ЗаписатьОшибкуСозданияДокумента(ШапкаЭД, ФорматЭД, ТекстОшибки = Неопределено)
	
	КомментарийЖР = ТекстОшибки + " (" + ФорматЭД.ИмяТипа + " " + ФорматЭД.ФункцияДокумента + " " + ШапкаЭД.Номер + " от " + ШапкаЭД.Дата + ")";
	
	ЗаписьЖурналаРегистрации(
		"Диадок.Создание учетного документа",
		УровеньЖурналаРегистрации.Предупреждение,
		Неопределено,
		Неопределено,
		КомментарийЖР
	);
	
КонецПроцедуры

//} СлужебныеПроцедурыИФункции

//{ ТЕЛО МОДУЛЯ

Функция ПолучитьМодульПрог(ИмяМодуля)
	
	Возврат ОсновнойМодуль.ПолучитьМодульПрог(ИмяМодуля);
	
КонецФункции 

Функция ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, дляСФ = Истина) Экспорт 
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, дляСФ);
КонецФункции 

Функция ПолучитьНомерНаПечатьДиадок(ДокументСсылка) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат ПолучитьНомераДляСФ(ДокументСсылка).НомерДокумента;
	Иначе
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомерНаПечатьДиадок(ДокументСсылка);
	КонецЕсли;
	
КонецФункции

Функция ЭтоСчетФактуранаАванс(СФ) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСчетФактуранаАванс(СФ);
КонецФункции	

Функция ПолучитьСуммуДокументаВВалютеРегламентированногоУчета_Диадок(ДокументСсылка) Экспорт
	Возврат ДокументСсылка.СуммаДокумента;
КонецФункции

Функция ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокументРеализации, СчетФактура = Неопределено, ФормированиеСФ = Ложь, ЭтоАкт = Ложь) Экспорт 
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокументРеализации, СчетФактура, ФормированиеСФ, ЭтоАкт);
КонецФункции	

Процедура ПерезаполнитьСуммыПоУЕвРублях(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки) Экспорт 
	
	Если ДанныеШапки.Свойство("СчетФактура") Тогда
		
		ДанныеШапки.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
		ПересчетВалюты_УПД(ДанныеШапки.СчетФактура, ТекущееОснование, ДанныеШапки);
		
	ИначеЕсли ТипЗнч(ТекущееОснование) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда 
		
		ПересчетВалюты_АктОбОказанииПроизводственныхУслуг(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
		
	ИначеЕсли ТипЗнч(ТекущееОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда 
		
		ПересчетВалюты_ВозвратТоваровПоставщику(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
		
	ИначеЕсли ТипЗнч(ТекущееОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		
		ПересчетВалюты_РеализацияТоваровУслуг(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчетВалюты_АктОбОказанииПроизводственныхУслуг(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки)
	
	//1. Рассчитываем по курсу документа
	Курс		= ЗаполнениеДокументов.КурсДокумента(ТекущееОснование, ПолучитьВалютуРегламентированногоУчета());
	Кратность	= ЗаполнениеДокументов.КратностьДокумента(ТекущееОснование, ПолучитьВалютуРегламентированногоУчета());
	
	ПересчетВалюты_ПоКурсуДокумента(ТабличнаяЧасть, Курс, Кратность);	
	
	//2. Считаем сумму в рублях с учетом аванса и распределяем
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ТекущееОснование);
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", ТекущееОснование.СчетУчетаРасчетовСКонтрагентом);
	Текст = 
	"ВЫБРАТЬ
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Ссылка
	|	И Хозрасчетный.СчетДт = &СчетУчетаРасчетовСКонтрагентом
	|	И Хозрасчетный.СчетКт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				АктОбОказанииПроизводственныхУслуг.СчетДоходов
	|			ИЗ
	|				Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслуг
	|			ГДЕ
	|				АктОбОказанииПроизводственныхУслуг.Ссылка = &Ссылка)
	|";
	Запрос.Текст = Текст;
	СуммаВзаиморасчетов = Запрос.Выполнить().Выгрузить()[0].Сумма;
	
	ПересчетВалюты_РаспределениеСуммы(ТабличнаяЧасть, ДанныеШапки, СуммаВзаиморасчетов);
	
	ДанныеШапки.ВалютаДокумента = ПолучитьВалютуРегламентированногоУчета();
	
КонецПроцедуры	

Процедура ПересчетВалюты_ВозвратТоваровПоставщику(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки)
	
	Курс		= ТекущееОснование.КурсВзаиморасчетов;
	Кратность	= ТекущееОснование.КратностьВзаиморасчетов;
	
	СуммаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	
	Для Каждого ТекСтрокаТЧ Из ТабличнаяЧасть Цикл
		
		ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(ТекСтрокаТЧ.СтавкаНДС);
		УчитыватьНДС = ЗначениеСтавкиНДС <> 0;
		
		Сумма		= ТекСтрокаТЧ.Сумма * Курс / Кратность;
		СуммаНДС	= Окр(УчетНДС.РассчитатьСуммуНДС(Сумма, УчитыватьНДС, СуммаВключаетНДС, ЗначениеСтавкиНДС), 2);
		
		ТекСтрокаТЧ.Сумма		= Окр(Сумма, 2);
		ТекСтрокаТЧ.СуммаНДС	= Окр(СуммаНДС, 2);
		
	КонецЦикла;
	
	ДанныеШапки.ВалютаДокумента = ПолучитьВалютуРегламентированногоУчета();
	
КонецПроцедуры

Процедура ПересчетВалюты_РеализацияТоваровУслуг(ТабличнаяЧасть, ТекущееОснование, ДанныеШапки)
	
	//1. Рассчитываем по курсу документа
	Курс		= ЗаполнениеДокументов.КурсДокумента(ТекущееОснование, ПолучитьВалютуРегламентированногоУчета());
	Кратность	= ЗаполнениеДокументов.КратностьДокумента(ТекущееОснование, ПолучитьВалютуРегламентированногоУчета());
	
	ПересчетВалюты_ПоКурсуДокумента(ТабличнаяЧасть, Курс, Кратность);	
	
	//2. Считаем сумму в рублях с учетом аванса и распределяем
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка"							, ТекущееОснование);
	Запрос.УстановитьПараметр("Содержание"						, "Реализация услуг");
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом"	, ТекущееОснование.СчетУчетаРасчетовСКонтрагентом);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Ссылка
	|	И Хозрасчетный.СчетДт = &СчетУчетаРасчетовСКонтрагентом
	|	И Хозрасчетный.СчетКт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РеализацияТоваровУслугТовары.СчетДоходов
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ГДЕ
	|				РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|		
	|			ОБЪЕДИНИТЬ
	|		
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РеализацияТоваровУслугУслуги.СчетДоходов
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|			ГДЕ
	|				РеализацияТоваровУслугУслуги.Ссылка = &Ссылка)
	|	И Хозрасчетный.Содержание = &Содержание
	|
	|ИМЕЮЩИЕ
	|	СУММА(Хозрасчетный.Сумма) ЕСТЬ НЕ NULL ";
	
	Если НЕ ДанныеШапки.Свойство("ЭтоАкт") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Хозрасчетный.Содержание = &Содержание", ""); 
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	СуммаВзаиморасчетов = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьРезультатЗапроса(Запрос, "Сумма", 0);	
	
	ПересчетВалюты_РаспределениеСуммы(ТабличнаяЧасть, ДанныеШапки, СуммаВзаиморасчетов);
		
	ДанныеШапки.ВалютаДокумента = ПолучитьВалютуРегламентированногоУчета();
	
КонецПроцедуры

Процедура ПересчетВалюты_УПД(СчетФактура, ТекущееОснование, ДанныеШапки)
	
	УчетНДС.ПерезаполнитьСуммыПоУЕвРублях(ДанныеШапки, ТекущееОснование, СчетФактура);
	
КонецПроцедуры

Процедура ПересчетВалюты_ПоКурсуДокумента(ТабличнаяЧасть, Курс, Кратность)
	
	Для Каждого ТекСтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Сумма		= ТекСтрокаТЧ.Сумма * Курс / Кратность;
		СуммаНДС	= ТекСтрокаТЧ.СуммаНДС * Курс / Кратность;
		
		ТекСтрокаТЧ.Сумма		= Окр(Сумма, 2);
		ТекСтрокаТЧ.СуммаНДС	= Окр(СуммаНДС, 2);
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПересчетВалюты_РаспределениеСуммы(ТабличнаяЧасть, ДанныеШапки, СуммаРегл)
	
	РасчетСуммыНДСПоСтавке	= УчетНДС.РасчетНДСвРубляхПоСтавкеДокумента(ДанныеШапки.Дата);
	
	Если СуммаРегл <> 0 Тогда
		
		ТабличнаяЧасть.Колонки.Добавить("СуммаБезНДС");
		ТабличнаяЧасть.Колонки.Добавить("СуммаРублевая");
		
		//1. Распределяем сумму регл пропорционально Сумме с НДС
		МассивРаспределения = Новый Массив;
		
		Для Каждого СтрокаТовар Из ТабличнаяЧасть Цикл
			
			СуммаСНДС	= СтрокаТовар.Сумма + ?(ДанныеШапки.СуммаВключаетНДС, 0, СтрокаТовар.СуммаНДС);
			СуммаБезНДС	= СуммаСНДС - СтрокаТовар.СуммаНДС;
			
			СтрокаТовар.СуммаБезНДС = СуммаБезНДС;
			
			МассивРаспределения.Добавить(СуммаСНДС);
			
		КонецЦикла;
		
		УчетНДС.РаспределитьСуммуПоСтолбцу(МассивРаспределения, СуммаРегл, ТабличнаяЧасть, "СуммаРублевая");
		
		//2. Пересчитываем СуммаНДС и Сумму
		Для Каждого СтрокаТовар Из ТабличнаяЧасть Цикл
			
			Если РасчетСуммыНДСПоСтавке Тогда
				
				ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(СтрокаТовар.СтавкаНДС);
				
				СтрокаТовар.СуммаНДС	= ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТовар.СуммаРублевая * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС), 2));
				СтрокаТовар.Сумма		= СтрокаТовар.СуммаРублевая - СтрокаТовар.СуммаНДС;
				
			Иначе
				
				МассивРаспределения.Очистить();
				МассивРаспределения.Добавить(СтрокаТовар.СуммаБезНДС);
				МассивРаспределения.Добавить(СтрокаТовар.СуммаНДС);
				
				МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьПропорционально(СтрокаТовар.СуммаРублевая, МассивРаспределения);
				
				Если МассивРаспределенныхСумм <> Неопределено Тогда
					СтрокаТовар.Сумма		= МассивРаспределенныхСумм[0];
					СтрокаТовар.СуммаНДС	= МассивРаспределенныхСумм[1];
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДанныеШапки.СуммаВключаетНДС Тогда
				СтрокаТовар.Сумма = СтрокаТовар.Сумма + СтрокаТовар.СуммаНДС;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ОснованиеОтчетКомитентаОПродажах_ОтчетОЗакупках(ДокументСсылка, СчетФактура)
	
	Если СчетФактура = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДокументСсылка.Метаданные().Реквизиты.Найти("ВидОперации") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках
		И ЗначениеЗаполнено(СчетФактура.Продавец)
		И СчетФактура.Контрагент <> СчетФактура.Продавец Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьПредставлениеХарактеристикиИСерии(выборка) Экспорт 
	Возврат "";
КонецФункции

Функция Документ_Организация(Документ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Документ_Организация(Документ);
	
КонецФункции

Функция Организация_КПП(Организация) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Организация_КПП(Организация);
	
КонецФункции

Функция ПолучитьДатуНомерВходящейНакладной(ДокСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДатуНомерВходящейНакладной(ДокСсылка)
	
КонецФункции

Функция ПолучитьДатуНомерВходящегоСчетаФактуры(ДокСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДатуНомерВходящегоСчетаФактуры(ДокСсылка);
	
КонецФункции

Процедура УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры

Процедура УстановитьДатуНомерВходящегоСчетаФактуры(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящегоСчетаФактуры(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры

Функция ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType);
	
КонецФункции

Функция ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType);
	
КонецФункции 

Функция ДокументБезНДС(СсылкаНаОбъект) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ДокументБезНДС(СсылкаНаОбъект);
	
КонецФункции

Функция ПустаяСсылкаНаНомерГТД() Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПустаяСсылкаНаНомерГТД(); 
	
КонецФункции

Функция НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка) Экспорт

	Возврат Ложь;  // не поддерживается в данной конфигурации

КонецФункции // НДСПоДокументуИсчисляетсяНалоговымАгентом()

//} ТЕЛО МОДУЛЯ

//{ ПОЛУЧЕНИЕ ДАННЫХ

//{ Получить...

Функция ПолучитьНаименованиеКолонкиКодаТовара() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНаименованиеКолонкиКодаТовара();
КонецФункции

Функция ПолучитьВалютуРегламентированногоУчета() 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьВалютуРегламентированногоУчета();
	
КонецФункции

Функция ПолучитьДатуНомерДокументовОплаты(СчетФактура) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДатуНомерДокументовОплаты(СчетФактура);
КонецФункции

Функция ПолучитьНомерГТД(НомерГТД) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомерГТД(НомерГТД);
	
КонецФункции

Функция ПолучитьСсылкуНомерГТД(НомерГТД, СоздатьНовый = Ложь) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуНомерГТД(НомерГТД, СоздатьНовый);
	
КонецФункции

Функция ПолучитьСсылкуСерииНоменклатуры(Номенклатура, НомерГТД, СтранаПроисхождения = "", СоздатьНовый = Ложь) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуСерииНоменклатуры(Номенклатура, НомерГТД, СтранаПроисхождения, СоздатьНовый);
	
КонецФункции

Функция ПолучитьДатуНомерДоговора(ДокументСсылка) Экспорт
	Договор = ДокументСсылка.ДоговорКонтрагента;
	Возврат Новый Структура("ДоговорНомер, ДоговорДата", Договор.Номер, Договор.Дата);
КонецФункции

Функция ПолучитьФИОРуководителяДляСчета(ДанныеШапки, ПараметрыОтправкиНаСогласование) Экспорт
	
	//как соответствие типовому функционалу заполнения параметра ФИОРуководителя в БП и БП КОРП
	СтруктураРуководители = ОбщегоНазначения.ОтветственныеЛица(ДанныеШапки.Организация, ДанныеШапки.Дата);
	Руководитель = СтруктураРуководители.РуководительПредставление;
	
	Если ЗначениеЗаполнено(Руководитель) = Истина Тогда
		ФИОРуководителя = Руководитель;
	Иначе
		ФИОРуководителя = "_";
	КонецЕсли;
	
	Возврат ФИОРуководителя;
	
КонецФункции

Функция ПолучитьГрузоотправителяГрузополучателя1С(Параметры) Экспорт
	
	Запрос= Новый Запрос;
	
	Запрос.Текст= 
		"ВЫБРАТЬ
      	|	Контрагенты.Ссылка КАК КонтрагентСсылка,
		|	Контрагенты.Наименование КАК Наименование
     	|ИЗ
      	|	Справочник.Контрагенты КАК Контрагенты
      	|ГДЕ
      	|	Контрагенты.ИНН = &ИНН
      	|	И Контрагенты.КПП = &КПП
      	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("ИНН", Параметры.инн);
	Запрос.УстановитьПараметр("КПП", Параметры.кпп);
	
	Выборка= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КонтрагентСсылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
				
КонецФункции

Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ДокументыОснованияСчетаФактуры(СчетФактура);
	
	Возврат Результат;
	
КонецФункции

//} Получить...

//{ ТЧПолучитьТекстЗапроса...

Функция ТЧПолучитьТекстЗапросаРеализацияТоваровУслуг(ФормированиеСФ)
	
	Возврат
	
	"ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.НомерСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ТЧ.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ТЧ.Номенклатура.Наименование
	|		ИНАЧЕ ТЧ.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ТЧ.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ТЧ.Номенклатура.Код КАК КодНоменклатуры,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Сумма КАК Сумма,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.НомерГТД КАК НомерГТД,
	|	ТЧ.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТЧ.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТЧ.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	ТЧ.ЕдиницаИзмерения КАК ВидУпаковки,
	|	ТЧ.Коэффициент КАК КоличествоВОдномМесте,
	|	ТЧ.КоличествоМест КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	1 КАК Порядок,
	|	ТЧ.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ТЧ.Содержание, 1, 10) = """"
	|			ТОГДА ТЧ.Номенклатура.Наименование
	|		ИНАЧЕ ТЧ.Содержание
	|	КОНЕЦ,
	|	ТЧ.Номенклатура.Ссылка,
	|	ТЧ.Номенклатура.Код,
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.Сумма,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.СуммаНДС,
	|	"""",
	|	"""",
	|	ТЧ.Ссылка.СуммаВключаетНДС,
	|	ТЧ.Ссылка.УчитыватьНДС,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|	"""",
	|	0,
	|	0,
	|	ИСТИНА,
	|	3,
	|	ТЧ.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ТЧ.Содержание, 1, 10) = """"
	|			ТОГДА ТЧ.Номенклатура.Наименование
	|		ИНАЧЕ ТЧ.Содержание
	|	КОНЕЦ,
	|	ТЧ.Номенклатура.Ссылка,
	|	ТЧ.Номенклатура.Код,
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.Сумма,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.СуммаНДС,
	|	"""",
	|	"""",
	|	ТЧ.Ссылка.СуммаВключаетНДС,
	|	ТЧ.Ссылка.УчитыватьНДС,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|	"""",
	|	0,
	|	0,
	|	ИСТИНА,
	|	4,
	|	ТЧ.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка" + ТЧПолучитьТекстЗапросаТара(ФормированиеСФ) + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаСчетФактураВыданный()
	
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(СчетФактураВыданныйАвансы.Содержание, 1, 10) <> """" Тогда СчетФактураВыданныйАвансы.Содержание
	|		КОГДА СчетФактураВыданныйАвансы.Номенклатура <> Значение(Справочник.Номенклатура.ПустаяСсылка) и 
	|           ПОДСТРОКА(СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное, 1, 10) <> """"
	|			Тогда СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное
	|		КОГДА СчетФактураВыданныйАвансы.Номенклатура <> Значение(Справочник.Номенклатура.ПустаяСсылка)  
	|			Тогда СчетФактураВыданныйАвансы.Номенклатура.Наименование
	|	Иначе ""Предварительная оплата""
	|	КОНЕЦ КАК Номенклатура,
	|	СчетФактураВыданныйАвансы.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	СчетФактураВыданныйАвансы.Номенклатура.Код КАК КодНоменклатуры,
	|	0 как Количество,
	|	0 как Цена,
	|	СчетФактураВыданныйАвансы.Сумма,
	|	СчетФактураВыданныйАвансы.СтавкаНДС,
	|	СчетФактураВыданныйАвансы.СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	Истина КАК СуммаВключаетНДС,
	|	Истина КАК УчитыватьНДС,
	|	""""  КАК ЕдиницаИзмерения,
	|	""""  КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0  как КоличествоМест,
	|	Истина КАК ЭтоУслуга
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";		  
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаСчетНаоплатуПокупателю()
	
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	Подзапрос.НомерСтроки КАК НомерСтроки,
	|	Подзапрос.Номенклатура,
	|	Подзапрос.НоменклатураСсылка,
	|	Подзапрос.КодНоменклатуры,
	|	Подзапрос.Количество,
	|	Подзапрос.Цена,
	|	Подзапрос.Сумма,
	|	Подзапрос.СтавкаНДС,
	|	Подзапрос.СуммаНДС,
	|	Подзапрос.НомерГТД,
	|	Подзапрос.СтранаПроисхождения,
	|	Подзапрос.СуммаВключаетНДС,
	|	Подзапрос.УчитыватьНДС,
	|	Подзапрос.ЕдиницаИзмерения,
	|	Подзапрос.КодЕдиницыИзмерения,
	|	Подзапрос.ВидУпаковки,
	|	Подзапрос.КоличествоВОдномМесте,
	|	Подзапрос.КоличествоМест,
	|	Подзапрос.ЭтоУслуга,
	|	Подзапрос.порядок КАК порядок,
	|	Подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		"""" КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(СчетНаОплатуТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА СчетНаОплатуТовары.Номенклатура.Наименование
	|			ИНАЧЕ СчетНаОплатуТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		СчетНаОплатуТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		СчетНаОплатуТовары.Номенклатура.Код КАК КодНоменклатуры,
	|		СчетНаОплатуТовары.Количество КАК Количество,
	|		СчетНаОплатуТовары.Цена КАК Цена,
	|		СчетНаОплатуТовары.Сумма КАК Сумма,
	|		СчетНаОплатуТовары.СтавкаНДС КАК СтавкаНДС,
	|		СчетНаОплатуТовары.СуммаНДС КАК СуммаНДС,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		СчетНаОплатуТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		СчетНаОплатуТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		СчетНаОплатуТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		СчетНаОплатуТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|		"""" КАК ВидУпаковки,
	|		"""" КАК КоличествоВОдномМесте,
	|		"""" КАК КоличествоМест,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		1 КАК порядок,
	|		НЕОПРЕДЕЛЕНО КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуТовары
	|	ГДЕ
	|		СчетНаОплатуТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		"""",
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(СчетНаОплатуУслуги.Содержание, 1, 10) = """"
	|				ТОГДА СчетНаОплатуУслуги.Номенклатура.Наименование
	|			ИНАЧЕ СчетНаОплатуУслуги.Содержание
	|		КОНЕЦ,
	|		СчетНаОплатуУслуги.Номенклатура.Ссылка,
	|		СчетНаОплатуУслуги.Номенклатура.Код,
	|		СчетНаОплатуУслуги.Количество,
	|		СчетНаОплатуУслуги.Цена,
	|		СчетНаОплатуУслуги.Сумма,
	|		СчетНаОплатуУслуги.СтавкаНДС,
	|		СчетНаОплатуУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		СчетНаОплатуУслуги.Ссылка.СуммаВключаетНДС,
	|		СчетНаОплатуУслуги.Ссылка.УчитыватьНДС,
	|		СчетНаОплатуУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		СчетНаОплатуУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		"""",
	|		"""",
	|		"""",
	|		ИСТИНА,
	|		2,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуУслуги
	|	ГДЕ
	|		СчетНаОплатуУслуги.Ссылка = &Ссылка) КАК Подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок";		  
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаКорректировкаРеализации()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	Подзапрос.НомерСтроки КАК НомерСтроки,
	|	Подзапрос.НомерСтроки КАК ИдентификаторСтроки,
	|	Подзапрос.Номенклатура,
	|	Подзапрос.НоменклатураСсылка,
	|	Подзапрос.КодНоменклатуры,
	|	Подзапрос.Количество,
	|	Подзапрос.Цена,
	|	Подзапрос.Сумма,
	|	Подзапрос.СтавкаНДС,
	|	Подзапрос.СуммаНДС,
	|	Подзапрос.НомерГТД,
	|	Подзапрос.СтранаПроисхождения,
	|	Подзапрос.СуммаВключаетНДС,
	|	Подзапрос.УчитыватьНДС,
	|	Подзапрос.ЕдиницаИзмерения,
	|	Подзапрос.КодЕдиницыИзмерения КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	Подзапрос.ЭтоУслуга,
	|	Подзапрос.порядок КАК порядок,
	|	Подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|		КорректировкаРеализацииТовары.НомерСтроки КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		КорректировкаРеализацииТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		КорректировкаРеализацииТовары.Номенклатура.Код КАК КодНоменклатуры,
	|		КорректировкаРеализацииТовары.Количество КАК Количество,
	|		КорректировкаРеализацииТовары.Цена КАК Цена,
	|		КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|		КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|		КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|		КорректировкаРеализацииТовары.НомерГТД КАК НомерГТД,
	|		КорректировкаРеализацииТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|		КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		КорректировкаРеализацииТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		1 КАК порядок,
	|		КорректировкаРеализацииТовары.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|	ГДЕ
	|		КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииУслуги.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииУслуги.Номенклатура.Код,
	|		КорректировкаРеализацииУслуги.Количество,
	|		КорректировкаРеализацииУслуги.Цена,
	|		КорректировкаРеализацииУслуги.Сумма,
	|		КорректировкаРеализацииУслуги.СтавкаНДС,
	|		КорректировкаРеализацииУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииУслуги.Ссылка.УчитыватьНДС,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		2,
	|		КорректировкаРеализацииУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	ГДЕ
	|		КорректировкаРеализацииУслуги.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииАгентскиеУслуги.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииАгентскиеУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииАгентскиеУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Код,
	|		КорректировкаРеализацииАгентскиеУслуги.Количество,
	|		КорректировкаРеализацииАгентскиеУслуги.Цена,
	|		КорректировкаРеализацииАгентскиеУслуги.Сумма,
	|		КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка.УчитыватьНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		3,
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	|	ГДЕ
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка = &Ссылка) КАК Подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаИКСФ()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	Подзапрос.НомерСтроки КАК НомерСтроки,
	|	Подзапрос.НомерСтроки КАК ИдентификаторСтроки,
	|	Подзапрос.Номенклатура,
	|	Подзапрос.НоменклатураСсылка,
	|	"""" КАК КодНоменклатуры,
	|	Подзапрос.Количество,
	|	Подзапрос.Цена,
	|	Подзапрос.Сумма,
	|	Подзапрос.СтавкаНДС,
	|	Подзапрос.СуммаНДС,
	|	Подзапрос.НомерГТД,
	|	Подзапрос.СтранаПроисхождения,
	|	Подзапрос.СуммаВключаетНДС,
	|	Подзапрос.УчитыватьНДС,
	|	Подзапрос.ЕдиницаИзмерения,
	|	Подзапрос.КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	Подзапрос.ЭтоУслуга,
	|	Подзапрос.порядок КАК порядок,
	|	Подзапрос.КоличествоДоИзменения,
	|	Подзапрос.ЦенаДоИзменения,
	|	Подзапрос.СуммаДоИзменения,
	|	Подзапрос.СтавкаНДСДоИзменения,
	|	Подзапрос.СуммаНДСДоИзменения,
	|	Подзапрос.НомерГТДДоИзменения,
	|	Подзапрос.СтранаПроисхожденияДоИзменения,
	|	Подзапрос.ЕдиницаИзмеренияДоИзменения,
	|	Подзапрос.КодЕдиницыИзмеренияДоИзменения,
	|	Подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		КорректировкаРеализацииТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		КорректировкаРеализацииТовары.Количество КАК Количество,
	|		КорректировкаРеализацииТовары.Цена КАК Цена,
	|		КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|		КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|		КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|		КорректировкаРеализацииТовары.НомерГТД КАК НомерГТД,
	|		КорректировкаРеализацииТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|		КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		КорректировкаРеализацииТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмеренияДоИзменения,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмеренияДоИзменения,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		1 КАК порядок,
	|		КорректировкаРеализацииТовары.КоличествоДоКорректировки КАК КоличествоДоИзменения,
	|		КорректировкаРеализацииТовары.ЦенаДоКорректировки КАК ЦенаДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаДоКорректировки КАК СуммаДоИзменения,
	|		КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаНДСДоКорректировки КАК СуммаНДСДоИзменения,
	|		КорректировкаРеализацииТовары.СтранаПроисхожденияДоИзменения КАК СтранаПроисхожденияДоИзменения,
	|		КорректировкаРеализацииТовары.НомерГТДДоИзменения КАК НомерГТДДоИзменения,
	|		КорректировкаРеализацииТовары.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|	ГДЕ
	|		КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииУслуги.НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииУслуги.Количество,
	|		КорректировкаРеализацииУслуги.Цена,
	|		КорректировкаРеализацииУслуги.Сумма,
	|		КорректировкаРеализацииУслуги.СтавкаНДС,
	|		КорректировкаРеализацииУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииУслуги.Ссылка.УчитыватьНДС,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		2,
	|		КорректировкаРеализацииУслуги.КоличествоДоКорректировки,
	|		КорректировкаРеализацииУслуги.ЦенаДоКорректировки,
	|		КорректировкаРеализацииУслуги.СуммаДоКорректировки,
	|		КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииУслуги.СуммаНДСДоКорректировки,
	|		NULL,
	|		NULL,
	|		КорректировкаРеализацииУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	ГДЕ
	|		КорректировкаРеализацииУслуги.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииАгентскиеУслуги.НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииАгентскиеУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииАгентскиеУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииАгентскиеУслуги.Количество,
	|		КорректировкаРеализацииАгентскиеУслуги.Цена,
	|		КорректировкаРеализацииАгентскиеУслуги.Сумма,
	|		КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка.УчитыватьНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		3,
	|		КорректировкаРеализацииАгентскиеУслуги.КоличествоДоКорректировки,
	|		КорректировкаРеализацииАгентскиеУслуги.ЦенаДоКорректировки,
	|		КорректировкаРеализацииАгентскиеУслуги.СуммаДоКорректировки,
	|		КорректировкаРеализацииАгентскиеУслуги.СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоКорректировки,
	|		NULL,
	|		NULL,
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	|	ГДЕ
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка = &Ссылка) КАК Подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаКСФ()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	Подзапрос.НомерСтроки КАК НомерСтроки,
	|	Подзапрос.НомерСтроки КАК ИдентификаторСтроки,
	|	Подзапрос.Номенклатура,
	|	Подзапрос.НоменклатураСсылка,
	|	Подзапрос.КодНоменклатуры,
	|	Подзапрос.Количество,
	|	Подзапрос.Цена,
	|	Подзапрос.Сумма,
	|	Подзапрос.СтавкаНДС,
	|	Подзапрос.СуммаНДС,
	|	Подзапрос.НомерГТД,
	|	Подзапрос.СтранаПроисхождения,
	|	Подзапрос.СуммаВключаетНДС,
	|	Подзапрос.УчитыватьНДС,
	|	Подзапрос.ЕдиницаИзмерения,
	|	Подзапрос.КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	Подзапрос.ЭтоУслуга,
	|	Подзапрос.порядок КАК порядок,
	|	Подзапрос.КоличествоДоИзменения,
	|	Подзапрос.ЦенаДоИзменения,
	|	Подзапрос.СуммаДоИзменения,
	|	Подзапрос.СтавкаНДСДоИзменения,
	|	Подзапрос.СуммаНДСДоИзменения,
	|	Подзапрос.НомерГТДДоИзменения,
	|	Подзапрос.СтранаПроисхожденияДоИзменения,
	|	Подзапрос.ЕдиницаИзмеренияДоИзменения,
	|	Подзапрос.КодЕдиницыИзмеренияДоИзменения,
	|	Подзапрос.ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК Номенклатура,
	|		КорректировкаРеализацииТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|		КорректировкаРеализацииТовары.Номенклатура.Код КАК КодНоменклатуры,
	|		КорректировкаРеализацииТовары.Количество КАК Количество,
	|		КорректировкаРеализацииТовары.Цена КАК Цена,
	|		КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|		КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
	|		КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
	|		КорректировкаРеализацииТовары.НомерГТД КАК НомерГТД,
	|		КорректировкаРеализацииТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|		КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		КорректировкаРеализацииТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмеренияДоИзменения,
	|		КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмеренияДоИзменения,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		1 КАК порядок,
	|		КорректировкаРеализацииТовары.КоличествоДоИзменения КАК КоличествоДоИзменения,
	|		КорректировкаРеализацииТовары.ЦенаДоИзменения КАК ЦенаДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаДоИзменения КАК СуммаДоИзменения,
	|		КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
	|		КорректировкаРеализацииТовары.СтранаПроисхожденияДоИзменения КАК СтранаПроисхожденияДоИзменения,
	|		КорректировкаРеализацииТовары.НомерГТДДоИзменения КАК НомерГТДДоИзменения,
	|		КорректировкаРеализацииТовары.Ссылка КАК ДокументОтгрузки
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|	ГДЕ
	|		КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииУслуги.НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииУслуги.Номенклатура.Код,
	|		КорректировкаРеализацииУслуги.Количество,
	|		КорректировкаРеализацииУслуги.Цена,
	|		КорректировкаРеализацииУслуги.Сумма,
	|		КорректировкаРеализацииУслуги.СтавкаНДС,
	|		КорректировкаРеализацииУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииУслуги.Ссылка.УчитыватьНДС,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		2,
	|		КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|		КорректировкаРеализацииУслуги.ЦенаДоИзменения,
	|		КорректировкаРеализацииУслуги.СуммаДоИзменения,
	|		КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	|		NULL,
	|		NULL,
	|		КорректировкаРеализацииУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	ГДЕ
	|		КорректировкаРеализацииУслуги.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализацииАгентскиеУслуги.НомерСтроки,
	|		ВЫБОР
	|			КОГДА ПОДСТРОКА(КорректировкаРеализацииАгентскиеУслуги.Содержание, 1, 10) = """"
	|				ТОГДА КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Наименование
	|			ИНАЧЕ КорректировкаРеализацииАгентскиеУслуги.Содержание
	|		КОНЕЦ,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Ссылка,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Код,
	|		КорректировкаРеализацииАгентскиеУслуги.Количество,
	|		КорректировкаРеализацииАгентскиеУслуги.Цена,
	|		КорректировкаРеализацииАгентскиеУслуги.Сумма,
	|		КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.СуммаНДС,
	|		"""",
	|		"""",
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка.УчитыватьНДС,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|		КорректировкаРеализацииАгентскиеУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|		ИСТИНА,
	|		3,
	|		КорректировкаРеализацииАгентскиеУслуги.КоличествоДоИзменения,
	|		КорректировкаРеализацииАгентскиеУслуги.ЦенаДоИзменения,
	|		КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения,
	|		КорректировкаРеализацииАгентскиеУслуги.СтавкаНДСДоИзменения,
	|		КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения,
	|		NULL,
	|		NULL,
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка
	|	ИЗ
	|		Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	|	ГДЕ
	|		КорректировкаРеализацииАгентскиеУслуги.Ссылка = &Ссылка) КАК Подзапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОказаниеУслуг()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ОказаниеУслугКонтрагенты.Ссылка.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ОказаниеУслугКонтрагенты.Ссылка.Номенклатура.Наименование
	|		ИНАЧЕ ОказаниеУслугКонтрагенты.Ссылка.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ОказаниеУслугКонтрагенты.Ссылка.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ОказаниеУслугКонтрагенты.Ссылка.Номенклатура.Код КАК КодНоменклатуры,
	|	ОказаниеУслугКонтрагенты.Количество КАК Количество,
	|	ОказаниеУслугКонтрагенты.Цена КАК Цена,
	|	ОказаниеУслугКонтрагенты.Сумма КАК Сумма,
	|	ОказаниеУслугКонтрагенты.Ссылка.СтавкаНДС КАК СтавкаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	ОказаниеУслугКонтрагенты.Ссылка.СуммаВключаетНДС КАК суммаВключаетНДС,
	|	ОказаниеУслугКонтрагенты.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ОказаниеУслугКонтрагенты.Ссылка.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОказаниеУслугКонтрагенты.Ссылка.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	ОказаниеУслугКонтрагенты.СуммаНДС,
	|	ОказаниеУслугКонтрагенты.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ОказаниеУслуг.Контрагенты КАК ОказаниеУслугКонтрагенты
	|ГДЕ
	|	ОказаниеУслугКонтрагенты.Ссылка = &Ссылка
	|	И ОказаниеУслугКонтрагенты.СчетФактура = &СчетФактура";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаАктОбОказанииПроизводственныхУслуг()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслугУслуги.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.Наименование
	|		ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.Код КАК КодНоменклатуры,
	|	АктОбОказанииПроизводственныхУслугУслуги.Количество,
	|	АктОбОказанииПроизводственныхУслугУслуги.Цена,
	|	АктОбОказанииПроизводственныхУслугУслуги.Сумма,
	|	АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	|	АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС,
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка.УчитыватьНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтчетКомиссионераОПродажах()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.НомерСтроки,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НоменклатураСсылка,
	|	ВложенныйЗапрос.КодНоменклатуры,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.НомерГТД,
	|	ВложенныйЗапрос.СтранаПроисхождения,
	|	ВложенныйЗапрос.СуммаВключаетНДС,
	|	ВложенныйЗапрос.УчитыватьНДС,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.КодЕдиницыИзмерения,
	|	ВложенныйЗапрос.ВидУпаковки,
	|	ВложенныйЗапрос.КоличествоВОдномМесте,
	|	ВложенныйЗапрос.КоличествоМест,
	|	ВложенныйЗапрос.ЭтоУслуга,
	|	ВложенныйЗапрос.Порядок,
	|	ВложенныйЗапрос.СуммаНДС,
	|	ВложенныйЗапрос.ДокументОтгрузки
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтчетКомиссионераОПродажахТовары.НомерСтроки КАК НомерСтроки,
	|			ВЫБОР
	|				КОГДА ПОДСТРОКА(ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|					ТОГДА ОтчетКомиссионераОПродажахТовары.Номенклатура.Наименование
	|				ИНАЧЕ ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное
	|			КОНЕЦ КАК Номенклатура,
	|			ОтчетКомиссионераОПродажахТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|			ОтчетКомиссионераОПродажахТовары.Номенклатура.Код КАК КодНоменклатуры,
	|			ОтчетКомиссионераОПродажахТовары.Количество КАК Количество,
	|			ОтчетКомиссионераОПродажахТовары.Цена КАК Цена,
	|			ОтчетКомиссионераОПродажахТовары.Сумма КАК Сумма,
	|			ОтчетКомиссионераОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|			ОтчетКомиссионераОПродажахТовары.НомерГТД КАК НомерГТД,
	|			ОтчетКомиссионераОПродажахТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|			ОтчетКомиссионераОПродажахТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|			ОтчетКомиссионераОПродажахТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|			ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|			ОтчетКомиссионераОПродажахТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|			ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения КАК ВидУпаковки,
	|			ОтчетКомиссионераОПродажахТовары.Коэффициент КАК КоличествоВОдномМесте,
	|			ОтчетКомиссионераОПродажахТовары.КоличествоМест КАК КоличествоМест,
	|			ЛОЖЬ КАК ЭтоУслуга,
	|			1 КАК Порядок,
	|			ОтчетКомиссионераОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|			ОтчетКомиссионераОПродажахТовары.КлючСтроки КАК КлючСтроки,
	|			ОтчетКомиссионераОПродажахТовары.Ссылка КАК ДокументОтгрузки
	|		ИЗ
	|			Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|		ГДЕ
	|			ОтчетКомиссионераОПродажахТовары.Ссылка = &Ссылка
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ОтчетКомиссионераОПродажахУслуги.НомерСтроки,
	|			ВЫБОР
	|				КОГДА ПОДСТРОКА(ОтчетКомиссионераОПродажахУслуги.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|					ТОГДА ОтчетКомиссионераОПродажахУслуги.Номенклатура.Наименование
	|				ИНАЧЕ ОтчетКомиссионераОПродажахУслуги.Номенклатура.НаименованиеПолное
	|			КОНЕЦ,
	|			ОтчетКомиссионераОПродажахУслуги.Номенклатура.Ссылка,
	|			ОтчетКомиссионераОПродажахУслуги.Номенклатура.Код,
	|			ОтчетКомиссионераОПродажахУслуги.Количество,
	|			ОтчетКомиссионераОПродажахУслуги.Цена,
	|			ОтчетКомиссионераОПродажахУслуги.Сумма,
	|			ОтчетКомиссионераОПродажахУслуги.СтавкаНДС,
	|			"""",
	|			"""",
	|			ОтчетКомиссионераОПродажахУслуги.Ссылка.СуммаВключаетНДС,
	|			ОтчетКомиссионераОПродажахУслуги.Ссылка.УчитыватьНДС,
	|			ОтчетКомиссионераОПродажахУслуги.Номенклатура.БазоваяЕдиницаИзмерения,
	|			ОтчетКомиссионераОПродажахУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код,
	|			"""",
	|			0,
	|			0,
	|			ИСТИНА,
	|			2,
	|			ОтчетКомиссионераОПродажахУслуги.СуммаНДС,
	|			ОтчетКомиссионераОПродажахУслуги.КлючСтроки,
	|			ОтчетКомиссионераОПродажахУслуги.Ссылка
	|		ИЗ
	|			Документ.ОтчетКомиссионераОПродажах.Услуги КАК ОтчетКомиссионераОПродажахУслуги
	|		ГДЕ
	|			ОтчетКомиссионераОПродажахУслуги.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|		ПО ОтчетКомиссионераОПродажахПокупатели.КлючСтроки = ВложенныйЗапрос.КлючСтроки
	|ГДЕ
	|	ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтчетОЗакупках()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	Товары.Количество,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Товары.Номенклатура.НомерГТД КАК НомерГТД,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	Товары.Ссылка.СуммаВключаетНДС,
	|	Товары.Номенклатура.Услуга КАК ЭтоУслуга,
	|	Товары.Номенклатура.Код КАК КодНоменклатуры,
	|	Товары.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(Товары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА Товары.Номенклатура.Наименование
	|		ИНАЧЕ Товары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	Товары.Номенклатура КАК НоменклатураСсылка,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК Поставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК Товары
	|		ПО Поставщики.Ссылка = Товары.Ссылка
	|			И Поставщики.КлючСтроки = Товары.КлючСтроки
	|ГДЕ
	|	Поставщики.Ссылка = &Ссылка
	|	И Поставщики.СчетФактура = &СчетФактура";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтчетКомитентуОПродажах()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	Подзапрос.Сумма,
	|	Подзапрос.СуммаНДС,
	|	Подзапрос.Количество,
	|	Подзапрос.Цена,
	|	Подзапрос.НомерГТД,
	|	Подзапрос.СтранаПроисхождения,
	|	Подзапрос.СуммаВключаетНДС,
	|	Подзапрос.ЕдиницаИзмерения,
	|	"""" КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	Подзапрос.ЭтоУслуга,
	|	ВЫБОР
	|		КОГДА Подзапрос.Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА ""Комиссионное вознаграждение""
	|		КОГДА ПОДСТРОКА(Подзапрос.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА Подзапрос.Номенклатура.Наименование
	|		ИНАЧЕ Подзапрос.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	Подзапрос.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ВЫБОР
	|		КОГДА Подзапрос.Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ПОДСТРОКА(Подзапрос.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА Подзапрос.Номенклатура.Наименование
	|		ИНАЧЕ Подзапрос.Номенклатура.Код
	|	КОНЕЦ КАК КодНоменклатуры,
	|	Подзапрос.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	Подзапрос.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК Сумма,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению КАК Номенклатура,
	|		ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|		0 КАК Количество,
	|		"""" КАК Цена,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		"""" КАК ЕдиницаИзмерения,
	|		ИСТИНА КАК ЭтоУслуга
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомитентуОПродажахТовары.Ссылка,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС) КАК Подзапрос";				
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаВозвратТоваровПоставщику()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.Наименование
	|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	ВозвратТоваровПоставщикуТовары.Количество,
	|	ВозвратТоваровПоставщикуТовары.Цена,
	|	ВозвратТоваровПоставщикуТовары.Сумма,
	|	ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	|	ВозвратТоваровПоставщикуТовары.НомерГТД,
	|	ВозвратТоваровПоставщикуТовары.СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуТовары.СуммаНДС,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения КАК ВидУпаковки,
	|	ВозвратТоваровПоставщикуТовары.Коэффициент КАК КоличествоВОдномМесте,
	|	ВозвратТоваровПоставщикуТовары.КоличествоМест,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщикуТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ВозвратТоваровПоставщикуТовары.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";				
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаОтражениеНачисленияНДС()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	ОтражениеНачисленияНДС.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ОтражениеНачисленияНДС.Номенклатура ССЫЛКА Справочник.ОбъектыСтроительства
	|			ТОГДА ОтражениеНачисленияНДС.Номенклатура.Наименование
	|		КОГДА ПОДСТРОКА(ОтражениеНачисленияНДС.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ОтражениеНачисленияНДС.Номенклатура.Наименование
	|		ИНАЧЕ ОтражениеНачисленияНДС.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ОтражениеНачисленияНДС.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ОтражениеНачисленияНДС.Номенклатура.Код КАК КодНоменклатуры,
	|	ОтражениеНачисленияНДС.Количество,
	|	ОтражениеНачисленияНДС.Цена,
	|	ОтражениеНачисленияНДС.Сумма,
	|	ОтражениеНачисленияНДС.СтавкаНДС,
	|	ОтражениеНачисленияНДС.НомерГТД,
	|	ОтражениеНачисленияНДС.СтранаПроисхождения,
	|	ОтражениеНачисленияНДС.СуммаНДС,
	|	ОтражениеНачисленияНДС.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОтражениеНачисленияНДС.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	ОтражениеНачисленияНДС.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ИСТИНА КАК УчитыватьНДС,
	|	ОтражениеНачисленияНДС.Номенклатура.Услуга КАК ЭтоУслуга,
	|	ОтражениеНачисленияНДС.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ОтражениеНачисленияНДС.ТоварыИУслуги КАК ОтражениеНачисленияНДС
	|ГДЕ
	|	ОтражениеНачисленияНДС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";				
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаРеализацияУслугПопереработке()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	РеализацияУслугПоПереработкеУслуги.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(РеализацияУслугПоПереработкеУслуги.Содержание, 1, 10) = """"
	|			ТОГДА РеализацияУслугПоПереработкеУслуги.Номенклатура.Наименование
	|		ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Содержание
	|	КОНЕЦ КАК Номенклатура,
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура.Код КАК КодНоменклатуры,
	|	РеализацияУслугПоПереработкеУслуги.Количество,
	|	РеализацияУслугПоПереработкеУслуги.Цена,
	|	РеализацияУслугПоПереработкеУслуги.Сумма,
	|	РеализацияУслугПоПереработкеУслуги.СтавкаНДС,
	|	РеализацияУслугПоПереработкеУслуги.СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияУслугПоПереработкеУслуги.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	РеализацияУслугПоПереработкеУслуги.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	|ГДЕ
	|	РеализацияУслугПоПереработкеУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";				
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаПередачаОС()
	
	ТекстЗапроса=	
	"ВЫБРАТЬ
	|	ПередачаОС.НомерСтроки КАК НомерСтроки,
	|	ПередачаОС.ОсновноеСредство.Наименование КАК Номенклатура,
	|	ПередачаОС.ОсновноеСредство.Ссылка КАК НоменклатураСсылка,
	|	ПередачаОС.ОсновноеСредство.Код КАК КодНоменклатуры,
	|	ПередачаОС.Количество,
	|	ПередачаОС.Цена,
	|	ПередачаОС.Сумма,
	|	ПередачаОС.СтавкаНДС,
	|	ПередачаОС.СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	ПередачаОС.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПередачаОС.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ПередачаОС.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПередачаОС.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ПередачаОС.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ПередачаОС
	|ГДЕ
	|	ПередачаОС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";				
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТЧПолучитьТекстЗапросаТара(ФормированиеСФ)
	
	Если ФормированиеСФ Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").РазделительОбъединенияЗапросов() + 
	
	"ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ТЧ.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ТЧ.Номенклатура.Наименование
	|		ИНАЧЕ ТЧ.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ТЧ.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|	ТЧ.Номенклатура.Код КАК КодНоменклатуры,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Сумма КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	ТЧ.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТЧ.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	2 КАК Порядок,
	|	ТЧ.Ссылка КАК ДокументОтгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка"    ;
	
КонецФункции 

Функция ТЧПолучитьТекстЗапроса(Документ, СчетФактура, ЭтоКСФ)
	
	ТекстЗапроса=	"";
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Возврат ТЧПолучитьТекстЗапросаРеализацияТоваровУслуг(НЕ СчетФактура = Неопределено);
		
	ИначеЕсли ЭтоСчетФактуранаАванс(СчетФактура) Тогда
		
		Возврат	ТЧПолучитьТекстЗапросаСчетФактураВыданный();	
		
	ИначеЕсли ЭтоКСФ = Ложь И Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Возврат	ТЧПолучитьТекстЗапросаКорректировкаРеализации();
		
	ИначеЕсли ЭтоКСФ = Истина И Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Если Строка(Документ.ВидОперации) = "Исправление в первичных документах" Тогда
			Возврат	ТЧПолучитьТекстЗапросаИКСФ();
		ИначеЕсли Строка(Документ.ВидОперации) = "Корректировка по согласованию сторон" Тогда
			Возврат	ТЧПолучитьТекстЗапросаКСФ();
		КонецЕсли;
		
	ИначеЕсли Метаданные.Документы.Найти("ОказаниеУслуг") <> Неопределено И ТипЗнч(Документ) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
		Возврат	ТЧПолучитьТекстЗапросаОказаниеУслуг();
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		Возврат ТЧПолучитьТекстЗапросаАктОбОказанииПроизводственныхУслуг();
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		Возврат ТЧПолучитьТекстЗапросаОтчетКомиссионераОПродажах();
		
	ИначеЕсли ТипЗнч(Документ)= Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда 
		
		Если Документ.Метаданные().Реквизиты.Найти("ВидОперации") <> Неопределено 
			И Документ.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках 
			И СчетФактура <> Неопределено 
			И ЗначениеЗаполнено(СчетФактура.Продавец) Тогда
			
			Возврат ТЧПолучитьТекстЗапросаОтчетОЗакупках();
		Иначе
			Возврат ТЧПолучитьТекстЗапросаОтчетКомитентуОПродажах();
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Возврат	ТЧПолучитьТекстЗапросаВозвратТоваровПоставщику();
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОтражениеНачисленияНДС") Тогда
		
		Возврат	ТЧПолучитьТекстЗапросаОтражениеНачисленияНДС();
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияУслугПопереработке") Тогда 
		
		Возврат	ТЧПолучитьТекстЗапросаРеализацияУслугПопереработке();
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПередачаОС") Тогда 
		
		Возврат	ТЧПолучитьТекстЗапросаПередачаОС();
		
	ИначеЕсли ТипЗнч(Документ) = тип("ДокументСсылка.СчетНаоплатуПокупателю") Тогда
		
		Возврат 	ТЧПолучитьТекстЗапросаСчетНаоплатуПокупателю();
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
	ВызватьИсключение "Не удалось сформировать текст запроса к табличной части документа " + Документ;
	
КонецФункции

Функция ПолучитьРезультатЗапросаТЧ(ДокументСсылка, СчетФактура, ЭтоКСФ) Экспорт
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст=	ТЧПолучитьТекстЗапроса(ДокументСсылка, СчетФактура, ЭтоКСФ);
	ЗапросТЧ.УстановитьПараметр("СчетФактура", СчетФактура);
	ЗапросТЧ.УстановитьПараметр("Ссылка", ДокументСсылка);
	Возврат ЗапросТЧ.Выполнить();
	
КонецФункции

Функция ПолучитьКодНоменклатурыДляТорг12(ТекущийКод, НоменклатураСсылка) Экспорт 
	КолонкаКодаТовара=	ПолучитьНаименованиеКолонкиКодаТовара();
	Если ЗначениеЗаполнено(НоменклатураСсылка) И КолонкаКодаТовара <> "Код" Тогда
		Возврат НоменклатураСсылка[КолонкаКодаТовара];
	Иначе 
		Возврат ТекущийКод;
	КонецЕсли;
	
КонецФункции

//}

//{ ПолучитьДанныеШапки...

Функция ШапкаТекстЗапроса_РеализацияТоваровУслуг()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА Т.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ""он же""
	|		ИНАЧЕ Т.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Т.Контрагент,
	|	ВЫБОР
	|		КОГДА Т.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Т.Контрагент
	|		ИНАЧЕ Т.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Т.АдресДоставки КАК АдресДоставки,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_ВозвратТоваровПоставщику()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА Т.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ""он же""
	|		ИНАЧЕ Т.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Т.Контрагент,
	|	ВЫБОР
	|		КОГДА Т.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Т.Контрагент
	|		ИНАЧЕ Т.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_ОтражениеНачисленияНДС()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА Т.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ""он же""
	|		ИНАЧЕ Т.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Т.Контрагент,
	|	ВЫБОР
	|		КОГДА Т.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Т.Контрагент
	|		ИНАЧЕ Т.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	ИСТИНА КАК УчитыватьНДС
	|ИЗ
	|	Документ.ОтражениеНачисленияНДС КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_ПередачаОС()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА Т.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ""он же""
	|		ИНАЧЕ Т.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Т.Контрагент,
	|	ВЫБОР
	|		КОГДА Т.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Т.Контрагент
	|		ИНАЧЕ Т.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.ПередачаОС КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_АктОбОказанииПроизводственныхУслуг()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Т.Контрагент,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_ОтчетКомиссионераОПродажах()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА Т.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ""он же""
	|		ИНАЧЕ Т.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	СФ.Контрагент,
	|	ВЫБОР
	|		КОГДА Т.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА СФ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА Т.Контрагент
	|					ИНАЧЕ СФ.Контрагент
	|				КОНЕЦ
	|		ИНАЧЕ Т.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СФ
	|		ПО (СФ.Ссылка = &СчетФактура)
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_ОтчетКомитентуОПродажах()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Т.Контрагент,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_РеализацияУслугПоПереработке()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Т.Контрагент,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_СчетФактураВыданный()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	"""" КАК Грузоотправитель,
	|	Т.Контрагент,
	|	"""" КАК Грузополучатель,
	|	"""" КАК АдресДоставки,
	|	Т.ВалютаДокумента,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ИСТИНА КАК УчитыватьНДС
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Т
	|ГДЕ
	|	Т.Ссылка = &СчетФактура"
	
КонецФункции

Функция ШапкаТекстЗапроса_ОтчетКомитентуОПродажах_ОтчетОЗакупках()
	
	Возврат
	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТЧ.Поставщик КАК Организация,
	|	ВЫБОР
	|		КОГДА ТЧ.Партия.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТЧ.Поставщик
	|		ИНАЧЕ ТЧ.Партия.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Т.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТЧ.Партия.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Т.Организация
	|		ИНАЧЕ ТЧ.Партия.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.Организация КАК Агент,
	|	Т.ДоговорКонтрагента КАК ДоговорАгента,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ИСТИНА КАК УчитыватьНДС,
	|	ТЧ.Поставщик.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Т
	|		ПО ТЧ.Ссылка = Т.Ссылка
	|ГДЕ
	|	ТЧ.Ссылка = &ДокументСсылка
	|	И ТЧ.СчетФактура = &СчетФактура"
	
КонецФункции

Функция ШапкаТекстЗапроса_ОказаниеУслуг()
	
	Возврат
	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ТЧ.Контрагент,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС,
	|	ТЧ.ДоговорКонтрагента
	|ИЗ
	|	Документ.ОказаниеУслуг КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Контрагенты КАК ТЧ
	|		ПО Т.Ссылка = ТЧ.Ссылка
	|			И (ТЧ.СчетФактура = &СчетФактура)
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_КорректировкаРеализации()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА Т.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ""он же""
	|		ИНАЧЕ Т.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Т.Контрагент,
	|	ВЫБОР
	|		КОГДА Т.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Т.Контрагент
	|		ИНАЧЕ Т.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Т.АдресДоставки,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса_СчетНаОплатуПокупателю()
	
	Возврат
	
	"ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	" + ?(ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СуществуетОбъектМетаданных("Документ.СчетНаОплатуПокупателю.Реквизит.ОрганизацияПолучатель"), "Т.ОрганизацияПолучатель,", "") + "
	|	Т.Контрагент,
	|	Т.ВалютаДокумента,
	|	Т.СуммаВключаетНДС,
	|	Т.УчитыватьНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК Т
	|ГДЕ
	|	Т.Ссылка = &ДокументСсылка"
	
КонецФункции

Функция ШапкаТекстЗапроса(ДокументСсылка, СчетФактура)
	
	Если ЭтоСчетФактуранаАванс(СчетФактура) = Истина Тогда
		
		ТекстЗапроса= ШапкаТекстЗапроса_СчетФактураВыданный();
		
	ИначеЕсли ОснованиеОтчетКомитентаОПродажах_ОтчетОЗакупках(ДокументСсылка, СчетФактура) = Истина Тогда
		
		ТекстЗапроса= ШапкаТекстЗапроса_ОтчетКомитентуОПродажах_ОтчетОЗакупках();
		
	Иначе 	
		
		ТекстЗапроса= Вычислить("ШапкаТекстЗапроса_" + ДокументСсылка.Метаданные().Имя + "()");
		
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьСтруктуруШапки(ДокументСсылка, СчетФактура = Неопределено) Экспорт
	
	Запрос = Новый Запрос(ШапкаТекстЗапроса(ДокументСсылка, СчетФактура));
	Запрос.УстановитьПараметр("СчетФактура"	  , СчетФактура);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Ошибка получения данных шапки, ДокументСсылка - " + ДокументСсылка + ", СчетФактура - " + СчетФактура;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СтруктураШапки = Новый Структура;
	
	// Значения по умолчанию для документов, в которых нет указанных полей.
	СтруктураШапки.Вставить("АдресДоставки", "");
	СтруктураШапки.Вставить("Грузоотправитель", "");
	СтруктураШапки.Вставить("Грузополучатель", "");
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураШапки.Вставить(Колонка.Имя, Выборка[Колонка.Имя])
	КонецЦикла;
	
	РезультатЗапроса = Неопределено;
	Выборка = Неопределено;
	
	Если СтруктураШапки.Свойство("ГоловнаяОрганизация")
		И ЗначениеЗаполнено(СтруктураШапки.ГоловнаяОрганизация)
		И СтруктураШапки.ГоловнаяОрганизация <> СтруктураШапки.Организация Тогда
		СтруктураШапки.Вставить("Поставщик", СтруктураШапки.ГоловнаяОрганизация);
		СтруктураШапки.Вставить("Грузоотправитель", СтруктураШапки.Организация);
	КонецЕсли;
	
	Если СчетФактура = Неопределено Тогда
		
		СтруктураШапки.Вставить("Дата", ДокументСсылка.Дата);
		СтруктураШапки.Вставить("Номер", ДокументСсылка.Номер);
		
	Иначе
		
		СтруктураШапки.Вставить("Дата", СчетФактура.Дата);
		СтруктураШапки.Вставить("Номер", СчетФактура.Номер);
		СтруктураШапки.ВалютаДокумента = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьВалютуДокумента(СтруктураШапки.ВалютаДокумента, СчетФактура);
		
		Если СчетФактура.Метаданные().Реквизиты.Найти("ИдентификаторГосконтракта") <> Неопределено Тогда
			СтруктураШапки.Вставить("ИдентификаторГосконтракта", СчетФактура.ИдентификаторГосконтракта);
		КонецЕсли;
		
	КонецЕсли;	
	
	СтруктураШапки.Вставить("ДопИнфо", Новый Массив); 
	
	Возврат СтруктураШапки;
	
КонецФункции

//} ПолучитьДанныеШапки...

//{ ПолучитьДанныеСФ...

Функция ПолучитьНомераДляКСФ(СчетФактура) Экспорт
	Возврат получитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомераДляКСФ(СчетФактура);
КонецФункции

Функция ПолучитьНомераДляСФ(СчетФактура) Экспорт
	
	Если Метаданные.Имя = "БухгалтерияПредприятияКОРП" Тогда
		
		Результат = ЗаполнитьДанныеДляПечатиШапки(СчетФактура);
		
	Иначе
		
		Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьНомераДляСФ(СчетФактура);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ДанныеДляПечатиШапкиСФ()
	
	Результат = Новый Структура;
	Результат.Вставить("НомерДокумента", Неопределено);
	Результат.Вставить("ДатаДокумента", Неопределено);
	Результат.Вставить("ЭтоИСФ", Ложь);
	Результат.Вставить("НомерИсправления", Неопределено);
	Результат.Вставить("ДатаИсправления", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДанныеДляПечатиШапки(СчетФактура)
	
	Результат = Новый_ДанныеДляПечатиШапкиСФ();
	
	ЭтоИсправление = (
		СчетФактура.Метаданные().Реквизиты.Найти("Исправление") <> Неопределено
		И СчетФактура.Исправление
	);
	
	ОбщиеДанныеДляПечати = ПолучитьОбщиеДанныеДляПечатиСФ(СчетФактура);
	
	ДатаСрезаДанных = СчетФактура.Дата;
	
	ИндексПодразделения = ПолучитьИндексОбособленногоПодразделенияНаДату(ОбщиеДанныеДляПечати, ДатаСрезаДанных);
	
	Если ИндексПодразделения <> 0 Тогда
		ОбщиеДанныеДляПечати.Номер = ОбщиеДанныеДляПечати.Номер + "/" + ИндексПодразделения;
	КонецЕсли;
	
	Результат.НомерДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(ОбщиеДанныеДляПечати);
	Результат.ДатаДокумента = СчетФактура.Дата;
	Результат.ЭтоИСФ = ЭтоИсправление;
	
	Если ЭтоИсправление Тогда
		
		Результат.НомерИсправления = Строка(СчетФактура.НомерИсправления);
		Результат.ДатаИсправления = СчетФактура.Дата;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИндексОбособленногоПодразделенияНаДату(ОбщиеДанныеДляПечати, ДатаСрезаДанных)
	
	Результат = 0;
	
	Если ЗначениеЗаполнено(ОбщиеДанныеДляПечати.Подразделение)
		И ОбщиеДанныеДляПечати.Подразделение.ОбособленноеПодразделение Тогда
		
		Результат = ОбщиеДанныеДляПечати.Подразделение.ЦифровойИндексОбособленногоПодразделения;
		
	ИначеЕсли ОбщегоНазначения.ЭтоОбособленноеПодразделение(ОбщиеДанныеДляПечати.Организация) Тогда
		
		СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			ОбщиеДанныеДляПечати.Организация,
			ДатаСрезаДанных
		);
		
		Результат = ОбщиеДанныеДляПечати.Организация.ЦифровойИндексОбособленногоПодразделения;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбщиеДанныеДляПечатиСФ(СчетФактура)
	
	СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
	
	ЭтоКорректировка = (
		СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный
		ИЛИ СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс
	);
	
	Если ЭтоКорректировка Тогда
		Результат = СчетФактураОбъект.ПодготовитьОбщиеДанныеДляПечатиКорректировочногоСчетаФактуры();
	Иначе
		Результат = СчетФактураОбъект.ПодготовитьОбщиеДанныеДляПечатиСчетаФактуры();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ДанныеПередаточногоДокументаДляПечати()
	
	Результат = Новый Структура();
	Результат.Вставить("Номер");
	Результат.Вставить("Дата");
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("ДоговорКонтрагента");
	Результат.Вставить("Руководитель");
	Результат.Вставить("ГлавныйБухгалтер");
	Результат.Вставить("ВалютаРегламентированногоУчета");
	Результат.Вставить("Подразделение");
	Результат.Вставить("ДокументОснование");
	Результат.Вставить("Ссылка");
	Результат.Вставить("ДокументСсылка");
	Результат.Вставить("ИдентификаторГосКонтракта");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбщиеДанныеДляПечатиПередаточногоДокумента(ДокументСсылка)
	
	ДанныеДокумента = Новый_ДанныеПередаточногоДокументаДляПечати();
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, ДокументСсылка);
	
	ДанныеДокумента.ДокументОснование = ДокументСсылка;
	ДанныеДокумента.Ссылка = Документы.СчетФактураВыданный.ПустаяСсылка();
	ДанныеДокумента.ДокументСсылка = ДокументСсылка;
	ДанныеДокумента.ИдентификаторГосКонтракта = "";
	
	Результат = УчетНДС.ПодготовитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(ДанныеДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКПППродавца(ДокументСсылка) Экспорт
	
	Результат = Неопределено;
	
	Если ЭтоСФ(ДокументСсылка)
		ИЛИ ЭтоКСФ(ДокументСсылка) Тогда
		
		ОбщиеДанныеДляПечати = ПолучитьОбщиеДанныеДляПечатиСФ(ДокументСсылка);
		
	Иначе
		
		ОбщиеДанныеДляПечати = ПолучитьОбщиеДанныеДляПечатиПередаточногоДокумента(ДокументСсылка);
		
	КонецЕсли;
	
	ПодразделениеДляПечати = ОсновнойМодуль.СвойствоСтруктуры(ОбщиеДанныеДляПечати, "Подразделение");
	
	Если ЗначениеЗаполнено(ПодразделениеДляПечати)
		И ПодразделениеДляПечати.ОбособленноеПодразделение Тогда
		
		Результат = ПодразделениеДляПечати.КПП;
		
	ИначеЕсли ОбщегоНазначения.ЭтоОбособленноеПодразделение(ОбщиеДанныеДляПечати.Организация) Тогда
		
		СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			ОбщиеДанныеДляПечати.Организация,
			ДокументСсылка.Дата
		);
		
		Результат = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КПП" , Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКПППокупателя(СчетФактура) Экспорт 
	Возврат получитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьКПППокупателя(СчетФактура);
КонецФункции

//} ПолучитьДанныеСФ...

//} КОД ДАВНО

//{ ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

Функция ОчиститьГрузополучателя(СтрокаТаблицы) Экспорт
	
	Возврат ЗначениеЗаполнено(СтрокаТаблицы.Грузополучатель) И СтрокаТаблицы.Грузополучатель.ИНН <> СтрокаТаблицы.Покупатель.ИНН;
	
КонецФункции

Функция ПроверитьТипДокумента(ДокСсылка, НаименованиеТипа)
	Возврат (метаданные.документы.найти(НаименованиеТипа) <> Неопределено) И (ТипЗнч(ДокСсылка) = Тип("ДокументСсылка." + НаименованиеТипа))
КонецФункции	

Функция ПолучитьТипДокумента(Док, ТаблицаНастроекПечати, ЭтоСчет, ФункцияУПД) Экспорт
	
	Если ЗначениеЗаполнено(ФункцияУПД) Тогда
		
		ТипДокумента = ОсновнойМодуль.ТипДокументаУПД(ФункцияУПД);
		
		Если ЗначениеЗаполнено(ТипДокумента) Тогда
			Возврат ТипДокумента;
		Иначе
			ТипДокумента = ОсновнойМодуль.ТипДокументаУКД(ФункцияУПД);
			Если ЗначениеЗаполнено(ТипДокумента) Тогда
				Возврат ТипДокумента;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоСчет ИЛИ ТипЗнч(Док) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Возврат "Счет на оплату";
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ЭтоКСФ = (Строка(Док.ВидСчетаФактуры) = "Корректировочный");
		Если ЭтоКСФ Тогда
			Возврат ?(Док.Исправление, "Исправление КСФ", "Корректировочный СФ");
		Иначе
			Возврат ?(Док.метаданные().реквизиты.найти("Исправление") <> Неопределено И Док.исправление, "Исправление СФ", "Счет-фактура");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда 
		СтрокиНастроек = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("Организация", Док.Организация));
		Возврат ?(СтрокиНастроек.Количество() = 0, "Торг-12", ?(СтрокиНастроек[0].ПечатнаяФормаДляТоваров = "", "Торг-12", СтрокиНастроек[0].ПечатнаяФормаДляТоваров  ) ); 
	ИначеЕсли (ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
		Или (ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров"))
		Или ПроверитьТипДокумента(Док, "КорректировкаРеализации") Тогда
		РНК = ?(ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров"), Док.ДокументОтгрузки, Док);
		СтрокиНастроек = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("Организация", РНК.Организация));
		Если СтрокиНастроек.количество() = 0 Тогда 
			ФормаДляУслуг = "Акт";
			ФормаДляТоваров = "Торг-12";
		Иначе 
			ФормаДляТоваров =  ?(СтрокиНастроек[0].ПечатнаяФормаДляТоваров = "", "Торг-12" , СтрокиНастроек[0].ПечатнаяФормаДляТоваров);
			ФормаДляУслуг  =   ?(СтрокиНастроек[0].ПечатнаяФормаДляУслуг  = "", "Акт"		, СтрокиНастроек[0].ПечатнаяФормаДляУслуг);
		КонецЕсли;	
		Возврат ?(РНК.товары.количество()
			= 0 И ((РНК.Услуги.Количество() > 0) Или (РНК.АгентскиеУслуги.Количество() > 0) ), ФормаДляУслуг, ФормаДляТоваров);
	ИначеЕсли  (ТипЗнч(Док) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")) Тогда
		Возврат ("Акт");
	ИначеЕсли  (ТипЗнч(Док) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"))
		Или (ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияУслугПоПереработке")) Тогда
		СтрокиНастроек = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("Организация", Док.Организация));
		Возврат ?(СтрокиНастроек.количество()
			= 0, "Акт", ?(СтрокиНастроек[0].ПечатнаяФормаДляУслуг  = "", "Акт", СтрокиНастроек[0].ПечатнаяФормаДляУслуг));
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда 
		Возврат "Акт сверки";
	Иначе 
		Возврат "";
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыСФ(Док) Экспорт
	
	Результат = Неопределено;
	
	УчетНДС.ПолучитьПараметрыСчетаФактуры(Док, ПолучитьВалютуРегламентированногоУчета(), Результат);
	
	Если Не ЗначениеЗаполнено(Результат.СуммаНДСДокумента) Тогда
		Результат.СуммаНДСДокумента = Док.СуммаНДСДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//{ Подготовка временных таблиц для списка отправки документов...

Функция ПодготовитьВТ_СпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц= Новый Массив;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 1 ИЛИ ТипыДокументов = 2 ИЛИ ТипыДокументов = 5 ИЛИ ТипыДокументов = 6 Тогда
		ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
		ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
		ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 1 Тогда
		ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 2 Тогда
		ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 3 Тогда
		ПодготовитьВТ_СчетаНаОплату(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Если ТипыДокументов = 0 ИЛИ ТипыДокументов = 4 Тогда
		ПодготовитьВТ_АктыСверки(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Возврат МассивВременныхТаблиц;
	
КонецФункции


Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Т.СуммаНДС КАК СуммаНДСЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Т.ВидСчетаФактуры,
	|	ОтборОрганизации.ФормироватьУПД КАК ОрганизацияФормироватьУПД,
	|	Т.Исправление,
	|	ЕСТЬNULL(ТЧ_ДокументыОснования.ДокументОснование, НЕОПРЕДЕЛЕНО) КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ТЧ_ДокументыОснования
	|		ПО (Т.Ссылка = ТЧ_ДокументыОснования.Ссылка)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаДокумента,
	|	Т.СуммаНДС,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	Т.ВидСчетаФактуры,
	|	ОтборОрганизации.ФормироватьУПД,
	|	Т.Исправление,
	|	ЕСТЬNULL(ТЧ_ДокументыОснования.ДокументОснование, НЕОПРЕДЕЛЕНО)
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ТЧ_ДокументыОснования
	|		ПО (Т.Ссылка = ТЧ_ДокументыОснования.Ссылка)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТИПЗНАЧЕНИЯ(ВТ_Основная.ДокументОснование) КАК ДокументОснованиеТип
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ДокументОснование ЕСТЬ НЕ NULL 
	|	И НЕ ВТ_Основная.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах";
	
	ТекстЗапросаГрузополучатели= "";
	РезультатЗапроса= Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка= РезультатЗапроса.Выбрать();
		РезультатЗапроса= Неопределено;
		
		Пока Выборка.Следующий() Цикл
			
			МетаданныеДокумента= Метаданные.НайтиПоТипу(Выборка.ДокументОснованиеТип);
			
			Если МетаданныеДокумента <> Неопределено И МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") <> Неопределено Тогда
				
				ТекстЗапросаГрузополучатели= ТекстЗапросаГрузополучатели + "
				|	
				|	ОБЪЕДИНИТЬ
				|	
				|ВЫБРАТЬ
				|	ВТ_Основная.Документ,
				|	ДанныеДокументаОснования.Грузополучатель
				|ИЗ
				|	ВТ_Основная КАК ВТ_Основная
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ "+МетаданныеДокумента.ПолноеИмя()+" КАК ДанныеДокументаОснования
				|		ПО ВТ_Основная.ДокументОснование = ДанныеДокументаОснования.Ссылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
				|		ПО (ВТ_Основная.Покупатель = ОтборГрузополучатели.Контрагент)
				|			И ДанныеДокументаОснования.Грузополучатель = ОтборГрузополучатели.Грузополучатель";
				
			КонецЕсли;
			
			МетаданныеДокумента= Неопределено;
			
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.Грузополучатель) КАК Грузополучатель
	|ПОМЕСТИТЬ ВТ_Грузополучатели
	|ИЗ
	|	(ВЫБРАТЬ
	|		NULL КАК Документ,
	|		NULL КАК Грузополучатель
	|	ГДЕ
	|		ЛОЖЬ "+ТекстЗапросаГрузополучатели+") КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено Тогда
		
		Запрос.Текст= Запрос.Текст +
		"ВЫБРАТЬ
		|	NULL КАК Документ,
		|	NULL КАК Контрагент
		|ПОМЕСТИТЬ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
		|ГДЕ
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	Иначе
		
		Запрос.Текст= Запрос.Текст +
		"ВЫБРАТЬ
		|	ВТ_Основная.Документ,
		|	ОтчетКомиссионераОПродажах.Контрагент
		|ПОМЕСТИТЬ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
		|ИЗ
		|	ВТ_Основная КАК ВТ_Основная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|		ПО ВТ_Основная.ДокументОснование = КорректировкаРеализации.Ссылка
		|			И (КорректировкаРеализации.ДокументРеализации ССЫЛКА Документ.СчетФактураВыданный)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО (КорректировкаРеализации.ДокументРеализации = СчетФактураВыданный.Ссылка)
		|			И (СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|		ПО (СчетФактураВыданный.ДокументОснование = ОтчетКомиссионераОПродажах.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	
	Запрос.Текст= Запрос.Текст +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	ВТ_Основная.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ДокументОснованиеID,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД) КАК ФормироватьУПД
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО ВТ_Основная.Покупатель = ОтборКонтрагенты.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Грузополучатели КАК ВТ_Грузополучатели
	|		ПО ВТ_Основная.Документ = ВТ_Грузополучатели.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров КАК ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
	|		ПО ВТ_Основная.Документ = ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО ВТ_Основная.ДокументОснование = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|ГДЕ
	|	НЕ ВТ_Основная.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|	И ВТ_Грузополучатели.Документ ЕСТЬ NULL 
	|	И ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Документ ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ОтчетКомиссионераОПродажах.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД)
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ПО ВТ_Основная.ДокументОснование = ОтчетКомиссионераОПродажах.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (ОтчетКомиссионераОПродажах.Контрагент = ОтборКонтрагенты.Контрагент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД)
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров КАК ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
	|		ПО ВТ_Основная.Документ = ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (ВТ_КонтрагентыКорректировокОтчетовКомиссионеров.Контрагент = ОтборКонтрагенты.Контрагент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Грузополучатели.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.ВидСчетаФактуры,
	|	ВТ_Основная.Исправление,
	|	ВТ_Основная.ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ВТ_Основная.ОрганизацияФормироватьУПД)
	|ИЗ
	|	ВТ_Грузополучатели КАК ВТ_Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Основная КАК ВТ_Основная
	|		ПО ВТ_Грузополучатели.Документ = ВТ_Основная.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (ВТ_Основная.Покупатель = ОтборГрузополучатели.Контрагент)
	|			И ВТ_Грузополучатели.Грузополучатель = ОтборГрузополучатели.Грузополучатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (ВТ_Основная.ДокументОснование = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_КонтрагентыКорректировокОтчетовКомиссионеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Грузополучатели";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	
КонецПроцедуры

Процедура ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	
КонецПроцедуры

Процедура ПодготовитьВТ_АктыСверки(Запрос, МассивВременныхТаблиц) Экспорт
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_АктыСверки(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_ВозвратТоваровПоставщику(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_РеализацияОтгруженныхТоваров(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_АктОбОказанииПроизводственныхУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_РеализацияУслугПоПереработке(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_ОтчетКомитентуОПродажах(Запрос, МассивВременныхТаблиц);
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено Тогда
		ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ВозвратТоваровПоставщику(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_ВозвратТоваровПоставщику(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияОтгруженныхТоваров(Запрос, МассивВременныхТаблиц) Экспорт
	
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
	|	ДанныеДокументаОтгрузки.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.СуммаДокумента,
	|	ДанныеДокументаОтгрузки.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И ОтборГрузополучатели.Контрагент ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	ДанныеДокументаОтгрузки.Грузополучатель,
	|	Т.СуммаДокумента,
	|	ДанныеДокументаОтгрузки.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	ДанныеДокументаОтгрузки.Грузополучатель,
	|	Т.СуммаДокумента,
	|	ДанныеДокументаОтгрузки.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборГрузополучатели.CounteragentID,
	|	Т.ДокументОтгрузки,
	|	ОтборОрганизации.ОтпрНеПроведенные,
	|	ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборГрузополучатели.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокументаОтгрузки
	|		ПО (Т.ДокументОтгрузки = ДанныеДокументаОтгрузки.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборГрузополучатели КАК ОтборГрузополучатели
	|		ПО (Т.Контрагент = ОтборГрузополучатели.Контрагент)
	|			И (ДанныеДокументаОтгрузки.Грузополучатель = ОтборГрузополучатели.Грузополучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ПО ВТ_Основная.ДокументОтгрузки = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|			ПО ВТ_Основная.ДокументОтгрузки = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.Грузополучатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.CounteragentID,
	|	ВТ_Основная.ФункцияУПД КАК ФункцияУПД,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_РеализацияОтгруженныхТоваров
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ";
	
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияОтгруженныхТоваров");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_АктОбОказанииПроизводственныхУслуг(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_АктОбОказанииПроизводственныхУслуг(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияУслугПоПереработке(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_Накладные_РеализацияУслугПоПереработке(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ОтчетКомитентуОПродажах(Запрос, МассивВременныхТаблиц)
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Организация КАК Продавец,
	|	Т.Контрагент КАК Покупатель,
	|	Т.СуммаВознаграждения КАК СуммаДокументаЗначение,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) КАК ФормироватьУПД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФункцияУПД,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (Т.Проведен)
	|			И (Т.СуммаВознаграждения <> 0 ИЛИ Т.УдержатьВознаграждение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	НЕ ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	Т.Организация,
	|	Т.Контрагент,
	|	Т.СуммаВознаграждения,
	|	Т.ВалютаДокумента,
	|	Т.Проведен,
	|	Т.Дата,
	|	Т.Номер,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """"),
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """"),
	|	ОтборКонтрагенты.CounteragentID,
	|	ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&СЧФДОП, &ДОП, &СЧФ_ДОП)
	|			ТОГДА &ДОП
	|		КОГДА ЕСТЬNULL(ОтборКонтрагенты.ФормироватьУПД, ОтборОрганизации.ФормироватьУПД) В (&ТОРГ12АКТ, &СФТОРГ12АКТ)
	|			ТОГДА &ТОРГ12АКТ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОтборОрганизации.ОтпрНеПроведенные
	|ИЗ
	|	ОтборОрганизации КАК ОтборОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Т
	|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (Т.Организация = ОтборОрганизации.Организация)
	|			И (НЕ Т.ПометкаУдаления)
	|			И (Т.СуммаВознаграждения <> 0 ИЛИ Т.УдержатьВознаграждение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
	|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
	|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусОтправляемыхВПФ
	|		ПО (Т.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДиадокСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Т.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	ОтборОрганизации.ОтпрНеПроведенные
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%""
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	СУММА(Товары.СуммаНДСВознаграждения) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК Товары
	|		ПО ВТ_Основная.Документ = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (СЧФ.Проведен)
	|ГДЕ
	|	НЕ ВТ_Основная.ОтпрНеПроведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|			И (НЕ СЧФ.ПометкаУдаления)
	|ГДЕ
	|	ВТ_Основная.ОтпрНеПроведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Продавец,
	|	ВТ_Основная.Покупатель,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.Проведен,
	|	ВТ_Основная.Дата,
	|	ВТ_Основная.Номер,
	|	ВТ_Основная.ID,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.ФункцияУПД,
	|	ВТ_Основная.CounteragentID,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ Накладные_ОтчетКомитентуОПродажах
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ОтчетКомитентуОПродажах");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_СчетаНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетаНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	
	Если Метаданные.Документы.Найти("КорректировкаРеализации") <> Неопределено Тогда
		ПодготовитьВТ_СчетаНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц)
		
		Запрос.Текст=
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Ссылка КАК Документ,
		|	Т.Организация КАК Продавец,
		|	Т.Контрагент КАК Покупатель,
		|	Т.СуммаДокумента КАК СуммаДокументаЗначение,
		|	Т.ВалютаДокумента КАК Валюта,
		|	ИСТИНА КАК Проведен,
		|	Т.Дата,
		|	Т.Номер,
		|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
		|	ОтборКонтрагенты.CounteragentID
		|ПОМЕСТИТЬ ВТ_Основная
		|ИЗ
		|	ОтборОрганизации КАК ОтборОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК Т
		|		ПО (Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (Т.Организация = ОтборОрганизации.Организация)
		|			И (НЕ Т.ПометкаУдаления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборКонтрагенты КАК ОтборКонтрагенты
		|		ПО (Т.Контрагент = ОтборКонтрагенты.Контрагент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ИдентификаторДокументаВДиадок
		|		ПО (Т.Ссылка = ИдентификаторДокументаВДиадок.Объект)
		|			И (ИдентификаторДокументаВДиадок.Свойство = &ИдентификаторДокументаВДиадокСч)
		|ГДЕ
		|	ОтборОрганизации.СпособОтправкиСчета = ""СчетНаОплату""
		|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
		|			ИЛИ ИдентификаторДокументаВДиадок.Значение ПОДОБНО ""усл:%"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Документ,
		|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ВТ_СуммаНДСЗначение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Основная.Документ КАК Документ,
		|		Товары.СуммаНДС КАК СуммаНДС
		|	ИЗ
		|		ВТ_Основная КАК ВТ_Основная
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК Товары
		|			ПО ВТ_Основная.Документ = Товары.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_Основная.Документ,
		|		Услуги.СуммаНДС
		|	ИЗ
		|		ВТ_Основная КАК ВТ_Основная
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Услуги КАК Услуги
		|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Основная.Документ,
		|	ВТ_Основная.Продавец,
		|	ВТ_Основная.Покупатель,
		|	ВТ_Основная.СуммаДокументаЗначение,
		|	ЕСТЬNULL(ВТ_СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСЗначение,
		|	ВТ_Основная.Валюта,
		|	ВТ_Основная.Проведен,
		|	ВТ_Основная.Дата,
		|	ВТ_Основная.Номер,
		|	ВТ_Основная.ID,
		|	ИСТИНА КАК ЭтоСчет,
		|	ВТ_Основная.CounteragentID,
		|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
		|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
		|	"""" КАК ФункцияУПД
		|ПОМЕСТИТЬ СчетаНаОплату_СчетНаОплатуПокупателю
		|ИЗ
		|	ВТ_Основная КАК ВТ_Основная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаНДСЗначение КАК ВТ_СуммаНДСЗначение
		|		ПО ВТ_Основная.Документ = ВТ_СуммаНДСЗначение.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Основная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СуммаНДСЗначение";
		
		Запрос.Выполнить();
		
		МассивВременныхТаблиц.Добавить("СчетаНаОплату_СчетНаОплатуПокупателю");
		
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПодготовитьВТ_СчетаНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

//} Подготовка временных таблиц для списка отправки документов...

//} ФОРМИРОВАНИЕ СПИСКА ВЫГРУЗКИ

//////////////////////////////////////////////////////
//функции генерации структуры для ФУФ счета-фактуры
///////////////////////////////////////////////////////

Функция ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(Организация) Экспорт 
  Если ЗначениеЗаполнено(Организация.СвидетельствоСерияНомер) и ЗначениеЗаполнено(Организация.СвидетельствоДатавыдачи) Тогда 
		Возврат  Организация.СвидетельствоСерияНомер + " от " + Формат(Организация.СвидетельствоДатавыдачи, "ДФ=dd.MM.yyyy")
	Иначе
		Возврат "";
  КонецЕсли;
	
КонецФункции

//Функция по ИСФ/КСФ возвращает сф-основание
Функция ПолучитьСФОснованиеДляИСФДиадок(ИСФ) Экспорт   
  	ДокОснование = ИСФ.ДокументыОснования[0].ДокументОснование;
	Если ДокОснование.Видоперации = перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
		Докоснование = ДокОснование.ДокументРеализации
	Иначе 	
		Пока (ТипЗнч(Докоснование) = Тип("ДокументСсылка.КорректировкаРеализации")) и (ДокОснование.ВидОперации = перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) Цикл 
			ДокОснование = ДокОснование.ДокументРеализации
		КонецЦикла;
	КонецЕсли;	
	
	//ищем СФ
	запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетФактураВыданныйДокументыОснования.ДокументОснование,
	               |	СчетФактураВыданныйДокументыОснования.Ссылка
	               |ИЗ
	               |	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	               |ГДЕ
	               |	СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления = Ложь
	               |	И СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("Документоснование", ДокОснование);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда 
		Возврат  выборка.ссылка;
	КонецЕсли;	
	
	Возврат Неопределено;
КонецФункции	

Функция СФОтправлена(ДокСсылка)
	ЗапросСФ = Новый Запрос;
	ЗапросСФ.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокСсылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Док
	|ГДЕ
	|	Док.ДокументОснование = &ДокОснование";
	ЗапросСФ.УстановитьПараметр("ДокОснование", ДокСсылка);
	ВыборкаСФ = ЗапросСФ.Выполнить().Выбрать();
	Пока ВыборкаСФ.Следующий() Цикл
		DocumentId = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов").Документ_2_DocumentID(ВыборкаСФ.ДокСсылка);
		Если ЗначениеЗаполнено(DocumentId) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ПолучитьПоследнееИсправление(КоррСтарт, ПоследнееОтправленное) Экспорт
	текКор = КоррСтарт;
	
	Пока Истина Цикл
		// получаем следующего кандидата, проверям его
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Док.Ссылка ДокСсылка
		|ИЗ
		|	Документ.КорректировкаРеализации КАК Док
		|ГДЕ
		|	Док.ДокументРеализации = &ДокСсылка
		|	И Док.ВидОперации = &ВидОперации";
		Запрос.УстановитьПараметр("ДокСсылка", текКор);
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			// Проверяем кандидата
			Если ПоследнееОтправленное И НЕ СФОтправлена(Выборка.ДокСсылка) Тогда
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
		текКор = Выборка.ДокСсылка;
	КонецЦикла;
	
	Возврат текКор;
КонецФункции

Функция ПолучитьДочернееИсправление(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокССылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Док
	|ГДЕ
	|	Док.ДокументРеализации = &ДокСсылка
	|	И Док.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокССылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьНеотправленнуюКорректировку(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Док.Ссылка ДокССылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Док
	|ГДЕ
	|	Док.ДокументРеализации = &ДокСсылка
	|	И Док.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ СФОтправлена(Выборка.ДокССылка) Тогда
			Возврат Выборка.ДокССылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьКорректировкуОбъект(ТипНовогоДокумента, КорректировкаРеализацииОснование) Экспорт
	КорректировкаОбъект = Документы.КорректировкаРеализации.СоздатьДокумент();
	Если ТипНовогоДокумента = "InvoiceRevision" ИЛИ ТипНовогоДокумента = "InvoiceCorrectionRevision" Тогда
		КорректировкаОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
	Иначе
		КорректировкаОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	КонецЕсли;
	
	КорректировкаОбъект.Заполнить(КорректировкаРеализацииОснование);
	
	Возврат КорректировкаОбъект;
КонецФункции

Функция ПолучитьПоследнююКорректировкуПоступления(ПоследняяКорректировка) Экспорт
	
	Пока Истина Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Док.Ссылка ДокКорректировка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК Док
		|ГДЕ
		|	Док.ДокументПоступления = &ДокСсылка
		|	И Док.ВидОперации = &ВидОперации";
		Запрос.УстановитьПараметр("ДокСсылка", ПоследняяКорректировка);
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПоследняяКорректировка = Выборка.ДокКорректировка;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоследняяКорректировка;
	
КонецФункции

Функция получитьДокументОснованиеДляКорректировкиПоступления(Document) Экспорт 
	Если Document.type =  "InvoiceRevision" Тогда 
		 запрос = Новый запрос;
		 запрос.Текст = "ВЫБРАТЬ
		                |	СчетФактураПолученныйДокументыОснования.ДокументОснование
		                |ИЗ
		                |	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		                |ГДЕ
		                |	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		                |	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента
		                |	И СчетФактураПолученныйДокументыОснования.Ссылка.Исправление = Ложь";
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalDocumentNumber);		
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalDocumentdate));		
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			 Док =  результат.ДокументОснование;
			 Возврат 	ПолучитьПоследнююКорректировкуПоступления(Док); 
		Иначе 
			Возврат Неопределено 
		КонецЕсли;	
	ИначеЕсли Document.type = "InvoiceCorrection"  Тогда 
	  запрос = Новый Запрос;
	  	Если ЗначениеЗаполнено(Document.OriginalInvoicerevisionNumber) = Ложь Тогда 
	 		Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетФактураПолученныйДокументыОснования.ДокументОснование
			|ИЗ
			|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|ГДЕ
			|	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
			|	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента
			|	И (СчетФактураПолученныйДокументыОснования.Ссылка.Исправление = Ложь)";
		Иначе 
			 Запрос.Текст =
			"ВЫБРАТЬ
		   |	СчетФактураПолученныйДокументыОснования.ДокументОснование,
		   |	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаИсправления,
		   |	СчетФактураПолученныйДокументыОснования.Ссылка.Исправление,
		   |	СчетФактураПолученныйДокументыОснования.Ссылка.НомерИсправления
		   |ИЗ
		   |	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		   |ГДЕ
		   |	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		   |	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента
		   |	И СчетФактураПолученныйДокументыОснования.Ссылка.Исправление
		   |	И СчетФактураПолученныйДокументыОснования.Ссылка.ДатаИсправления = &ДатаИсправления
		   |	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерИсправления = &НомерИсправления";
			Запрос.УстановитьПараметр("НомерИсправления", число(Document.OriginalInvoicerevisionNumber));		
			Запрос.УстановитьПараметр("ДатаИсправления", НачалоДня(Document.OriginalInvoicerevisionDate));		
		КонецЕсли;				
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalDocumentNumber);		
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalDocumentdate));
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Возврат результат.ДокументОснование;
		Иначе 
			Возврат Неопределено
		КонецЕсли;
	ИначеЕсли Document.type = "InvoiceCorrectionRevision"  Тогда 
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	СчетФактураПолученныйДокументыОснования.ДокументОснование
	                  |ИЗ
	                  |	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	                  |ГДЕ
	                  |	СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
	                  |	И СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента = &НомерВходящегоДокумента";
		Запрос.УстановитьПараметр("ДатаВходящегоДокумента", НачалоДня(Document.OriginalInvoiceCorrectionDate));
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", Document.OriginalInvoiceCorrectionNumber);
		результат = запрос.Выполнить().Выбрать();
		Если результат.следующий() Тогда 
			Возврат результат.ДокументОснование;
		Иначе 
			Возврат Неопределено
		КонецЕсли;
	Иначе 
		Возврат Неопределено
	КонецЕсли;	
		
КонецФункции	

Функция СчетФактураВыданныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СчетФактураВыданныйПоДокументуОснование(ДокументОснование);	
	
КонецФункции

Функция СчетФактураПолученныйПоДокументуОснование(ДокументОснование) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СчетФактураПолученныйПоДокументуОснование(ДокументОснование);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////
// функции генерации сотруктуры для генерации торг-12 или акта выполненных работ
//////////////////////////////////////////////////////////////////////////////

Функция ПолучитьПредставлениеАдресаДляДиадок(записьрегистра) Экспорт 
	Возврат УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(записьрегистра);
КонецФункции	

Функция ПолучитьВидЮрАдресаКонтрагента() Экспорт 
	 Возврат Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
 КонецФункции
 
Процедура ЗаполнитьСтруктуруАдреса(AddressInfo, ЮрФизЛицо, ИспользоватьЮрАдрес = Ложь, АдресСтрокой = "") Экспорт
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗаполнитьСтруктуруАдреса(AddressInfo, ЮрФизЛицо, ИспользоватьЮрАдрес, АдресСтрокой);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруГрузоПолучателяОтправителя(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, АдресСтрокой = "") Экспорт 
	СведенияОбОрганизации =  ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента);

	 Если стрДлина(СведенияОбОрганизации.ИНН)<>12 Тогда 
		НаименованиеОрганизации = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
		ЭтоИП = Ложь;
	Иначе 
		Если типЗнч(юрФизЛицо) = тип("СправочникСсылка.Организации") Тогда 
		  //для нашей организации - данные берем из нормализованного представления физлица
		  НаименованиеОрганизации  = юрФизЛицо.ИндивидуальныйПредприниматель.Наименование;
		Иначе 
		  НаименованиеОрганизации  = СведенияОбОрганизации.наименованиеДляпечатныхФорм 
		КонецЕсли;	  
		ЭтоИП = Истина;
	КонецЕсли;

	OrganizationInfo.Name = НаименованиеОрганизации;
    OrganizationInfo.IsSoleProprietor  =  ЭтоИП;
	OrganizationInfo.Ссылка = ЮрФизЛицо;
	OrganizationInfo.SameAsSellerOrBuyer = Ложь;
	
    ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ЮрФизЛицо, Ложь, АдресСтрокой);

КонецПроцедуры	

Функция ПолучитьГоловноеЮрлицо( ЮрФизЛицо)
	
	Перем ГоловноеЮрЛицо;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") 
		И ЮрФизЛицо.Метаданные().Реквизиты.Найти("ОбособленноеПодразделение") <> Неопределено И ЮрФизЛицо.ОбособленноеПодразделение Тогда
		
		ГоловноеЮрЛицо = ЮрФизЛицо.ГоловнойКонтрагент;		
		
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		ГоловноеЮрЛицо = ЮрФизЛицо.ГоловнаяОрганизация;
	КонецЕсли;

	Если ЗначениеЗаполнено(ГоловноеЮрЛицо)  Тогда
		Возврат ГоловноеЮрЛицо;
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьСтруктурируЮрФизЛица(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации = Неопределено,  ЮрАдрес, АдресДляСФ = Ложь, АдресСтрокой = "")  Экспорт 
	
	ГоловноеЮрЛицо = "";
	
	Если АдресДляСФ = Истина Тогда
		
		ГоловноеЮрЛицо = ПолучитьГоловноеЮрлицо(ЮрФизЛицо);
		Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
			СведенияОПодразделении 	= ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			СведенияОбОрганизации	= ПолучитьСведенияОбОрганизации(ГоловноеЮрЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			
			СведенияОбОрганизации.КПП = СведенияОПодразделении.КПП;
		Иначе
			СведенияОбОрганизации = ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
		КонецЕсли;	
	Иначе
		СведенияОбОрганизации = ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
	КонецЕсли;
	
	ЭтоИП = СтрДлина(СведенияОбОрганизации.ИНН) = 12;
	Если НЕ ЭтоИП Тогда 
		НаименованиеОрганизации = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
	Иначе 
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда 
		  //для нашей организации - данные берем из нормализованного представления физлица
		  НаименованиеОрганизации  = ЮрФизЛицо.ИндивидуальныйПредприниматель.Наименование;
		Иначе 
		  НаименованиеОрганизации  = СведенияОбОрганизации.НаименованиеДляпечатныхФорм;
		КонецЕсли;
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.Inn  = СведенияОбОрганизации.ИНН;
	
	Если ЗначениеЗаполнено(ЮрФизЛицо.ЮрФизЛицо) Тогда
		OrganizationInfo.Kpp  = СведенияОбОрганизации.КПП;
	Иначе
		OrganizationInfo.Kpp  = ЮрФизЛицо.КПП;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ГоловноеЮрЛицо, ЮрАдрес, АдресСтрокой);	
	Иначе
		ЗаполнитьСтруктуруАдреса(OrganizationInfo.Address, ЮрФизЛицо, ЮрАдрес, АдресСтрокой);
	КонецЕсли;
	
	OrganizationInfo.IsSoleProprietor  =  ЭтоИП;
	
	Если АдресДляСФ = Ложь Тогда
		OrganizationInfo.Okpo  = СведенияОбОрганизации.КодПоОкпо;
		
		Если найти(СведенияОбОрганизации.Телефоны, "факс:") > 0 Тогда 
			телефон = СокрЛП(Лев(СведенияОбОрганизации.Телефоны, найти(СведенияОбОрганизации.Телефоны, "факс:") - 1));
			Если прав(телефон, 1) = ","  Тогда
				телефон = Лев(телефон, стрДлина(телефон) - 1);
			КонецЕсли;
			факс = СокрЛП(прав(СведенияОбОрганизации.Телефоны, СтрДлина(СведенияОбОрганизации.Телефоны) - найти(СведенияОбОрганизации.Телефоны, "факс:") - 5));
		Иначе 
			Телефон = СведенияОбОрганизации.Телефоны;
			Факс = "";
		КонецЕсли;	
		OrganizationInfo.Phone = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СократитьПредставлениеТелефона(Телефон);
		OrganizationInfo.Fax   = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СократитьПредставлениеТелефона(Факс) ;
		OrganizationInfo.BankAccountNumber = ?(ЗначениеЗаполнено(СведенияОбОрганизации.НомерСчета),  СведенияОбОрганизации.НомерСчета, "") ;
		OrganizationInfo.BankName  =   ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк), СведенияОбОрганизации.Банк.наименование, "");
		OrganizationInfo.BankId =  ?(ЗначениеЗаполнено(СведенияОбОрганизации.БИК),  СокрЛП(СведенияОбОрганизации.БИК), "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		OrganizationInfo.вставить("Ссылка", ГоловноеЮрЛицо);
	Иначе
		OrganizationInfo.вставить("Ссылка", ЮрФизЛицо);
	КонецЕсли;
	
КонецПроцедуры	

Процедура Заполнить_ExtendedOrganizationInfo(ExtendedOrganizationInfo, ЮрФизЛицо, ДатаДокумента, ИспользоватьЮрАдрес, БанковскийСчет= Неопределено, АдресСтрокой = "") Экспорт
	
	СведенияОбОрганизации= ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента, БанковскийСчет);
	СведенияОбОрганизации.Вставить("Ссылка", ЮрФизЛицо);
	
	Если ИспользоватьЮрАдрес Тогда
		
		ГоловноеЮрЛицо= ПолучитьГоловноеЮрлицо(ЮрФизЛицо);
		
		Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
			
			СведенияОПодразделении= ПолучитьСведенияОбОрганизации(ЮрФизЛицо, ДатаДокумента,  БанковскийСчет);
			СведенияОбОрганизации=  ПолучитьСведенияОбОрганизации(ГоловноеЮрЛицо, ДатаДокумента, БанковскийСчет);
			
			СведенияОбОрганизации.Вставить("Ссылка", ГоловноеЮрЛицо);
			СведенияОбОрганизации.Вставить("КПП"   , СведенияОПодразделении.КПП);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоОрганизация= ТипЗнч(СведенияОбОрганизации.Ссылка) = Тип("СправочникСсылка.Организации");
	ЭтоИП= СтрДлина(СведенияОбОрганизации.ИНН) = 12;
	
	Если ЭтоИП И ЭтоОрганизация Тогда 
		СведенияОбОрганизации.НаименованиеДляпечатныхФорм = СведенияОбОрганизации.Ссылка.ИндивидуальныйПредприниматель.Наименование;
		
		Если ДатаДокумента >= ДатаРедакции425() Тогда
			
			Если ЕстьРеквизитМетаданных(ЮрФизЛицо.Метаданные(), "ОГРН") Тогда
				ОГРНОрганизации = ЗначенияРеквизитовОбъектаЛокальная(ЮрФизЛицо, "ОГРН").ОГРН;
			Иначе
				ОГРНОрганизации = "";
			КонецЕсли;
			
			ДатаРегистрации = "";
			
			ExtendedOrganizationInfo.IndividualEntityRegistrationCertificate = СтрокаНомерСВ_2026(
				ОГРНОрганизации,
				ДатаРегистрации
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбОрганизации.КПП) И НЕ ЗначениеЗаполнено(СведенияОбОрганизации.Ссылка.ЮрФизЛицо) Тогда
		СведенияОбОрганизации.КПП= СведенияОбОрганизации.Ссылка.КПП;
	КонецЕсли;
	
	
	ExtendedOrganizationInfo.Name= 					СведенияОбОрганизации.НаименованиеДляпечатныхФорм;
	ExtendedOrganizationInfo.Inn=  					СведенияОбОрганизации.ИНН;
	ExtendedOrganizationInfo.Kpp=  					СведенияОбОрганизации.КПП;
	ExtendedOrganizationInfo.Okpo= 					СведенияОбОрганизации.КодПоОкпо;
	ExtendedOrganizationInfo.CorrespondentAccount = СведенияОбОрганизации.КоррСчет;
	
	ExtendedOrganizationInfo.BankAccountNumber= ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Значение1C_В_СтрокаCOM(СведенияОбОрганизации.НомерСчета);
	ExtendedOrganizationInfo.BankName=   		ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Значение1C_В_СтрокаCOM(СведенияОбОрганизации.Банк);
	ExtendedOrganizationInfo.BankId=  			ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").Значение1C_В_СтрокаCOM(СведенияОбОрганизации.БИК);
	ExtendedOrganizationInfo.Phone = 			ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПредставлениеТелефона(СведенияОбОрганизации.Телефоны, "Телефон", 255);
	
	Если ЭтоОрганизация Тогда
		ExtendedOrganizationInfo.Okdp= СведенияОбОрганизации.Ссылка.КодОКВЭД;
	КонецЕсли;
	
	Если ЭтоИП Тогда
		ExtendedOrganizationInfo.Type= "IndividualEntity";
	ИначеЕсли ЭтоОрганизация Тогда
		Если СведенияОбОрганизации.Ссылка.ИностраннаяОрганизация
			И ПустаяСтрока(СведенияОбОрганизации.ИНН) Тогда
			// В организации может быть указано, что организация является отделением иностранной организации,
			//   но если у нее указан ИНН, значит, она встала на учет в России.
			// Будем считать ее иностранной только в том случае, если не указан ИНН.
			ExtendedOrganizationInfo.Type= "ForeignEntity";
		Иначе
			ExtendedOrganizationInfo.Type= "LegalEntity";
		КонецЕсли;
	Иначе //ветка для контрагента
		Если ПустаяСтрока(СведенияОбОрганизации.ИНН) Тогда
			// Логика такая же, как в организации выше.
			ExtendedOrganizationInfo.Type = "ForeignEntity"; 
		Иначе
			ExtendedOrganizationInfo.Type = "LegalEntity"; 	
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоОрганизация Тогда
		ExtendedOrganizationInfo.Email = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").АдресЭлектроннойПочты(СведенияОбОрганизации.Ссылка, Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
	КонецЕсли;
	
	ЗаполнитьСтруктуруАдреса(ExtendedOrganizationInfo.Address, СведенияОбОрганизации.Ссылка, ИспользоватьЮрАдрес, АдресСтрокой);	
	
	ExtendedOrganizationInfo.Вставить("Ссылка", СведенияОбОрганизации.Ссылка);
	
КонецПроцедуры	

Функция ДатаРедакции425()
	
	Возврат '20260101';
	
КонецФункции

Функция СтрокаНомерСВ_2026(ОГРН, ДатаРегистрации)
	
	Результат = "%1;%2";
	Результат = СтрЗаменить(Результат, "%1", ОГРН);
	Результат = СтрЗаменить(Результат, "%2", ДатаРегистрации);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруОснования(ДокСсылка, ЭтоАкт = Ложь, ЭтоУПД = Ложь)  Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСтруктуруОснованияПоДоговору(ДокСсылка.ДоговорКонтрагента, ЭтоУПД);
	
КонецФункции	

Функция ПолучитьСтруктуруОснованияУПД(ДокументСсылка, ДанныеШапки)  Экспорт
	
	Договор	= Неопределено;
	ЭтоУПД	= Истина;
	
	Если ДокументСсылка.Метаданные().Реквизиты.Найти("ДоговорКонтрагента") = Неопределено Тогда
		Договор	= ДанныеШапки.ДоговорКонтрагента;
	Иначе
		Договор	= ДокументСсылка.ДоговорКонтрагента;
	КонецЕсли;	
		
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСтруктуруОснованияПоДоговору(Договор, ЭтоУПД);
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьБанковскийСчетПоДокументу(ДокТоварный) Экспорт 
	БанковскийСчетОрганизации = ?(ДокТоварный.Метаданные().Реквизиты.Найти("БанковскийСчетОрганизации") = Неопределено, Неопределено, ДокТоварный.БанковскийСчетОрганизации);
	Если (ДокТоварный.Метаданные().Реквизиты.найти("СтруктурнаяЕдиница") <> Неопределено) И (ТипЗнч(ДокТоварный.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета")) Тогда 
		 БанковскийСчетОрганизации = ДокТоварный.СтруктурнаяЕдиница;
	ИначеЕсли (ДокТоварный.Метаданные().Реквизиты.найти("Банковскийсчет") <> Неопределено) И (ТипЗнч(ДокТоварный.Банковскийсчет) = Тип("СправочникСсылка.БанковскиеСчета")) Тогда 
		 БанковскийСчетОрганизации = ДокТоварный.Банковскийсчет;
	КонецЕсли;	 
	Если (ЗначениеЗаполнено(БанковскийСчетОрганизации) = Ложь) И ЗначениеЗаполнено(ДокТоварный.Организация.ОсновнойБанковскийСчет) Тогда 
		 БанковскийСчетОрганизации = ДокТоварный.Организация.ОсновнойБанковскийСчет
	 КонецЕсли;	
	 Возврат БанковскийСчетОрганизации;
КонецФункции

Функция ПолучитьСведенияОбОрганизации(Организация, Дата, Банковскийсчет = Неопределено)
	
	 Возврат УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата, , Банковскийсчет);
	
КонецФункции	

Функция ПолучитьОписаниеОрганизацииДляСчетаНаОплату(Контрагент, датаОперации, БанковскийСчет = Неопределено) Экспорт 
	СведенияОбОрганизации 	  = ПолучитьСведенияОбОрганизации(Контрагент, датаОперации, БанковскийСчет);
	Возврат ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
КонецФункции	

Функция ПолучитьРеквизитыОрганизацииДляСчетаНаОплату(контрагент, ДатаОперации)  Экспорт 
	  СведенияОбОрганизации 	  = ПолучитьСведенияОбОрганизации(Контрагент, датаОперации);
      Возврат Новый Структура("Наименование, ИНН, КПП", СведенияОбОрганизации.НаименованиеДляПечатныхФорм, СведенияОбОрганизации.ИНН, СведенияОбОрганизации.КПП);
КонецФункции

Функция ПолучитьСтруктуруБанковскогоСчета(Организация, БанковскийСчетОрганизации)  Экспорт 
	
	Если ЗначениеЗаполнено(БанковскийСчетОрганизации) Тогда
		БанкССылка = БанковскийСчетОрганизации;
		Если БанкСсылка <> Неопределено Тогда 
			мБанк = ?(НЕ ЗначениеЗаполнено(БанкСсылка.БанкДляРасчетов), БанкСсылка.Банк, БанкСсылка.БанкДляРасчетов);
			мГородБанка = мБанк.Город;
			мКоррСчет   = мБанк.КоррСчет;
			мБИК        = мБанк.Код;
			мНомерСчета = ?(БанкСсылка.БанкДляРасчетов.Пустая(), БанкСсылка.НомерСчета, БанкСсылка.Банк.КоррСчет);
			
			Если ПустаяСтрока(БанкСсылка.ТекстКорреспондента) Тогда
				мТекстПолучателя = Организация.НаименованиеПолное;
				Если ЗначениеЗаполнено(БанкСсылка.БанкДляРасчетов) Тогда
					мТекстПолучателя = мТекстПолучателя + " р/с " + БанкСсылка.НомерСчета + " в " + БанкСсылка.Банк + " " + БанкСсылка.Банк.Город;
				КонецЕсли;
			Иначе
				мТекстПолучателя = БанкСсылка.ТекстКорреспондента;
			КонецЕсли;
			
		КонецЕсли;
		Возврат Новый Структура ("Банк,БИК,КоррСчет,ГородБанка,НомерМсета,ТекстПолучателя,НомерСчета", мБанк, мБИК, мКоррСчет, мГородБанка, мНомерСчета, мТекстПолучателя, мНомерСчета);
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПодразделениеИзДокумента(ДокССылка) Экспорт 
	Возврат ""
КонецФункции

//////////////////////////////////////////////////////////
// функции генерации структуры акта сверки
////////////////////////////////////////////////////////////

Функция  ПолучитьПредставителяОрганизацииДляАктаСверки(ДокСсылка)
	ПредставительОрганизации = Новый Структура;
	ДанныеПредставителя = ОбщегоНазначения.ДанныеФизЛица(ДокСсылка.Организация, ДокСсылка.ПредставительОрганизации, ДокСсылка.Дата);
 	
	ПредставительОрганизации.Вставить("ФИО", сокрЛП(строка(ДанныеПредставителя.Фамилия) + " " + ДанныеПредставителя.Имя + " "+ДанныеПредставителя.Отчество));
	ПредставительОрганизации.Вставить("Должность", Строка(ДанныеПредставителя.Должность));
	
	Возврат ПредставительОрганизации;
КонецФункции

Функция  ПолучитьПредставителяКонтрагентаДляАктаСверки(ДокСсылка)
	ПредставительКонтрагента = Новый Структура;
	ПредставительКонтрагента.Вставить("ФИО", ДокСсылка.ПредставительКонтрагента.наименование);
	ПредставительКонтрагента.Вставить("Должность", ДокСсылка.ПредставительКонтрагента.Должность);
	
	Возврат ПредставительКонтрагента;
КонецФункции

Функция ИнициализироватьТЧДляСверки()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата");
	ТЗ.Колонки.Добавить("ПредставлениеДокумента");
	ТЗ.Колонки.Добавить("Дебет");
	ТЗ.Колонки.Добавить("Кредит");
	
	Возврат ТЗ;
КонецФункции		
	
Функция ПолучитьСтруктуруДанныхТекущегоДоговораАктаСверки(МассивДанныхПоДоговорам, ДоговорСсылка)
	
	Для Каждого элемент Из МассивДанныхПоДоговорам Цикл
		Если Элемент.ДоговорСсылка = ДоговорСсылка Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("ДанныеОрганизации", ИнициализироватьТЧДляСверки());
	СтруктураДанных.Вставить("ДанныеКонтрагента", ИнициализироватьТЧДляСверки());
	СтруктураДанных.Вставить("ДоговорСсылка"    , ДоговорСсылка);
	
	МассивДанныхПоДоговорам.Добавить(СтруктураДанных);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьДанныеТЧАктаСверки(ДокСсылка)
	 запрос = Новый Запрос;
	 запрос.Текст = "ВЫБРАТЬ
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки,
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата,
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ,
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление,
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет,
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит,
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор,
	                |	Истина КАК ЭтоДанныеОрганизации
	                |ИЗ
	                |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	                |ГДЕ
	                |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.НомерСтроки,
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Дата,
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Документ,
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Представление,
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Дебет,
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Кредит,
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Договор,
	                |	Ложь
	                |ИЗ
	                |	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК АктСверкиВзаиморасчетовПоДаннымКонтрагента
	                |ГДЕ
	                |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Ссылка = &Ссылка"; 
	 Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	 Выборка = запрос.Выполнить().Выбрать();
	 МассивДанныхПоДоговорам = Новый Массив;
	 
	 Пока выборка.Следующий() Цикл 
		 СтруктураДанныхПоДоговору = ПолучитьСтруктуруДанныхТекущегоДоговораАктаСверки(МассивДанныхПоДоговорам, ?(Докссылка.РазбитьПоДоговорам, Выборка.Договор, Неопределено) );
		 ТаблицаДанных = ?(выборка.ЭтоДанныеОрганизации, СтруктураДанныхПоДоговору.ДанныеОрганизации,  СтруктураДанныхПоДоговору.ДанныеКонтрагента);
		 стр = ТаблицаДанных.Добавить();
		 Стр.Дата = выборка.Дата;
		 Стр.представлениеДокумента = выборка.Представление;
		 стр.Дебет = Выборка.Дебет;
		 стр.Кредит = выборка.кредит;
	 КонецЦикла;	 
	 
	 
	 Возврат МассивДанныхПоДоговорам;
КонецФункции	

Функция ПолучитьДанныеДляФормированияАктаСверки(ДокСсылка) Экспорт
	
	ДанныеДляАктаСверки = Новый Структура();
	
	ДанныеДляАктаСверки.вставить("Дата", ДокСсылка.Дата);
	ДанныеДляАктаСверки.Вставить("Номер", ДокСсылка.Номер);
	ДанныеДляАктаСверки.Вставить("ДоговорКонтрагента", ДокСсылка.ДоговорКонтрагента);
	
	ДанныеДляАктаСверки.вставить("ДатаНачалаСверки", ДокСсылка.ДатаНачала);
	ДанныеДляАктаСверки.Вставить("ДатаокончанияСверки", ДокСсылка.Датаокончания);
	
	СведенияОбОрганизации    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДокСсылка.Организация, ДокСсылка.Дата);
	ДанныеДляАктаСверки.Вставить("ПредставлениеОрганизации", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,"));
	
	СведенияОКонтрагенте     = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДокСсылка.Контрагент, ДокСсылка.Дата);
	ДанныеДляАктаСверки.Вставить("ПредставлениеКонтрагента", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,"));
	
	ДанныеДляАктаСверки.Вставить("ПредставительОрганизации",  ПолучитьПредставителяОрганизацииДляАктаСверки(ДокСсылка));
	ДанныеДляАктаСверки.Вставить("ПредставительКонтрагента",  ПолучитьПредставителяКонтрагентаДляАктаСверки(ДокСсылка));
	
	ДанныеДляАктаСверки.вставить("ВалютаДокумента", ДокСсылка.ВалютаДокумента);
	ДанныеДляАктаСверки.вставить("МассивДанныхПоДоговорам",  ПолучитьДанныеТЧАктаСверки(ДокСсылка));
	
	ДанныеДляАктаСверки.Вставить("СальдоНачальное",  ДокСсылка.ОстатокНаНачало);
	ДанныеДляАктаСверки.Вставить("СверкаСогласована", ДокСсылка.СверкаСогласована);
	ДанныеДляАктаСверки.Вставить("Расхождение", ДокСсылка.Расхождение);
	
	Возврат ДанныеДляАктаСверки;
	
КонецФункции	

//////////////////////////////////////////////////////////
// функции для работы с формами 1С
//////////////////////////////////////////////////////////

Функция ПолучитьФормуВыбораДоговораКонтрагента(Элемент, Организация, ДатаДокумента, Контрагент, ВидыДоговоров, ДоговорКонтрагента) Экспорт
	
	ФрмВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(, Элемент);
	ФрмВыбора.ПараметрОтборПоВладельцу = Контрагент;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.ВидСравнения                    = ВидСравнения.ВСписке;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Значение                            = ВидыДоговоров;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Использование                       = Истина;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидДоговора.Доступность = Ложь;
	
	ФрмВыбора.СправочникСписок.Отбор.Организация.Значение                            = Организация;
	ФрмВыбора.СправочникСписок.Отбор.Организация.Использование                       = Истина;
	ФрмВыбора.СправочникСписок.Отбор.Организация.ВидСравнения                        = ВидСравнения.Равно;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Организация.Доступность = Ложь;

	ФрмВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
	Возврат ФрмВыбора;	
КонецФункции


/////////////////////////////////////////////////////////////
// функции создания новых доков на основании данных ДД
/////////////////////////////////////////////////////////////

Функция СоздатьДокументПоступлениеТоваровУслуг(параметры, стВероятныеПоля, ЭДОбъект, ТабличнаяЧасть = Неопределено, СуммаВключаетНДС = Истина, ВидОперации, ЗаполнениеГТД = Ложь) Экспорт
	
	Если видОперации = "ВозвратОтПокупателя" Тогда 
		ДокОбъект = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
		ДокОбъект.ВидОперации = перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
	Иначе 	
		ДокОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		Если видоперации =  "ПоступлениеОборудования" Тогда 
			ДокОбъект.ВидОперации =   Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование
		ИначеЕсли видОперации = "ПоступлениеНМА" Тогда
			ДокОбъект = Документы.ПоступлениеНМА.СоздатьДокумент();
		ИначеЕсли видОперации = "ПоступлениеДопРасходов" Тогда
			ДокОбъект = Документы.ПоступлениеДопРасходов.СоздатьДокумент();
		ИначеЕсли видОперации = "ПоступлениеОбъектовСтроительства"	Тогда 
			ДокОбъект.ВидОперации = перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства 
		Иначе 	
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		КонецЕсли;	
		ДокОбъект.ДатаВходящегоДокумента = параметры.ДатаВходящегоДокумента;
		ДокОбъект.НомерВходящегоДокумента = параметры.НомерВходящегоДокумента;
		
	КонецЕсли;
		
	Если (Параметры.свойство("Дата")) и ЗначениеЗаполнено(параметры.Дата) Тогда
		ДокОбъект.Дата=	параметры.Дата;
	КонецЕсли;
	
	Если стВероятныеПоля.Организация = Неопределено Тогда
		Сообщить("Организация в системе Диадок: """ + ЭДОбъект.Organization.Name + """, ИНН/КПП: " + ЭДОбъект.Organization.Inn + "/" + ЭДОбъект.Organization.Kpp + " не ассоциирована с организацией в 1С");
	Иначе
		ДокОбъект.Организация = стВероятныеПоля.Организация;
	КонецЕсли;
	
	Если стВероятныеПоля.Контрагент = Неопределено Тогда
		Сообщить("Контрагент в системе Диадок: """ + ЭДОбъект.counterAgent.Name + """, ИНН/КПП: " + ЭДОбъект.counterAgent.Inn + "/" + ЭДОбъект.counterAgent.Kpp + " не ассоциирован с контрагентом в 1С");
	Иначе
		ДокОбъект.Контрагент = стВероятныеПоля.Контрагент;
		
		Если ЗначениеЗаполнено(параметры.ДоговорКонтрагента) = Истина Тогда
			ДокОбъект.ДоговорКонтрагента = параметры.ДоговорКонтрагента;
		Иначе
			//Заполняем договор
			мСписокВидовДоговоров = Новый СписокЗначений;
			мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			Если Метаданные.Перечисления.ВидыДоговоровКонтрагентов.ЗначенияПеречисления.Найти("СКомиссионеромНаЗакупку") <> Неопределено Тогда
				мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			КонецЕсли;
			ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокОбъект, мСписокВидовДоговоров);
		КонецЕсли;
		
	КонецЕсли;
		
	ДокОбъект.ВалютаДокумента			= ДокОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	ДокОбъект.КратностьВзаиморасчетов 	= 1;
	
	Если ЗначениеЗаполнено(ДокОбъект.ДоговорКонтрагента) = Истина Тогда
		
		Если ВидОперации = "ВПереработку" Тогда
			СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
		Иначе
			СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
		КонецЕсли;
		
		СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокОбъект);

		ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокОбъект, ДокОбъект.ВалютаДокумента, ПолучитьВалютуРегламентированногоУчета(), СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары", ДокОбъект.ДоговорКонтрагента);
		
	КонецЕсли;
			
	ЗаполнятьСчетаРасчета=	Ложь;
	СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(ДокОбъект.Организация, ДокОбъект.Контрагент, ДокОбъект.ДоговорКонтрагента);
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураНеОбязательныхПолей = Новый Структура;	
	
	Если ДокОбъект.Метаданные().ТабличныеЧасти.Найти("ВозвратнаяТара") <> Неопределено Тогда
		Если ДокОбъект.ВозвратнаяТара.Количество() > 0 Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоТаре", СчетаУчета.СчетУчетаТары);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом", СчетаУчета.СчетРасчетов);			
		
	БухгалтерскийУчет.ПроверитьНеобходимостьПерезаполненияСчетовУчета(ДокОбъект, СтруктураОбязательныхПолей, СтруктураНеОбязательныхПолей, Ложь, ЗаполнятьСчетаРасчета);

	Если ЗаполнятьСчетаРасчета Тогда
		Если ДокОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовСКомитентом
		Иначе
			ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетов;
		КонецЕсли;
		ДокОбъект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансов;
		Если ДокОбъект.Метаданные().Реквизиты.Найти("СчетУчетаРасчетовПоТаре") <> Неопределено Тогда
			ДокОбъект.СчетУчетаРасчетовПоТаре 	   = СчетаУчета.СчетУчетаТары;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокОбъект.Метаданные().Реквизиты.Найти("СпособЗачетаАвансов")<>Неопределено Тогда
		ДокОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	КонецЕсли;
	
	Если ДокОбъект.Метаданные().Реквизиты.Найти("Склад")<>Неопределено Тогда
		ДокОбъект.Склад = параметры.Склад;
	КонецЕсли;
	
	ДокОбъект.СуммаВключаетНДС = СуммаВключаетНДС;
	ДокОбъект.УчитыватьНДС = Истина;
	
	Если НЕ ДокОбъект.Метаданные().Реквизиты.Найти("Грузоотправитель") = Неопределено 
		  И Параметры.Свойство("Грузоотправитель") 
		  И ЗначениеЗаполнено(Параметры.Грузоотправитель) Тогда
	
		ДокОбъект.Грузоотправитель = Параметры.Грузоотправитель; 
	КонецЕсли;
	
	Если НЕ ДокОбъект.Метаданные().Реквизиты.Найти("Грузополучатель") = Неопределено 
		  И Параметры.Свойство("Грузополучатель") 
		  И ЗначениеЗаполнено(Параметры.Грузополучатель) Тогда
	
		ДокОбъект.Грузополучатель= Параметры.Грузополучатель; 
	КонецЕсли;
	
	Если ВидОперации = "ПокупкаКомиссия" Тогда 
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокОбъект, глЗначениеПеременной("глТекущийПользователь"), ПолучитьВалютуРегламентированногоУчета(), "Покупка");
	КонецЕсли;	
    		
	Если ВидОперации =  "ПоступлениеДопРасходов" Тогда
		ДокОбъект.Сумма = (ЭДОбъект.total - ?(СуммаВключаетНДС, 0, ЭДОбъект.vat ));
		ДокОбъект.СуммаНДС = ЭДОбъект.vat;
	Иначе
		Если ТабличнаяЧасть <> Неопределено Тогда
			ЗаполнениеТабличнойЧасти(ТабличнаяЧасть, ВидОперации, ДокОбъект, ЗаполнениеГТД);
		КонецЕсли;	
	КонецЕсли;
			
	Возврат ДокОбъект;
	
КонецФункции

Функция СоздатьДокументВозвратТоваровОтПокупателя(параметры, стВероятныеПоля, ЭДОбъект) Экспорт
	ДокОбъект = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
	ДокОбъект.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
	
	ДокОбъект.КратностьВзаиморасчетов = 1;
	
	// Заполнение возможных полей
	Если стВероятныеПоля.Организация = Неопределено Тогда
		Сообщить("Организация в системе Диадок: """ + ЭДОбъект.Organization.Name + """, ИНН/КПП: " + ЭДОбъект.Organization.Inn + "/" + ЭДОбъект.Organization.Kpp + " не ассоциирована с организацией в 1С");
	Иначе
		ДокОбъект.Организация = стВероятныеПоля.Организация;
	КонецЕсли;
	Если стВероятныеПоля.Контрагент = Неопределено Тогда
		Сообщить("Контрагент в системе Диадок: """ + ЭДОбъект.counterAgent.Name + """, ИНН/КПП: " + ЭДОбъект.counterAgent.Inn + "/" + ЭДОбъект.counterAgent.Kpp + " не ассоциирован с контрагентом в 1С");
	Иначе
		ДокОбъект.Контрагент = стВероятныеПоля.Контрагент;
	КонецЕсли;
	
	мСписокВидовДоговоров = Новый СписокЗначений;
	мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Если ДокОбъект.ВидОперации <> Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Оборудование Тогда
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	КонецЕсли;
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокОбъект, мСписокВидовДоговоров);
	
	Возврат ДокОбъект;
КонецФункции

Процедура ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения) Экспорт
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения);
	
КонецПроцедуры

Функция СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения);
	
КонецФункции

Функция СоздатьДокумент_СчетФактураВыданный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СоздатьДокумент_СчетФактураВыданный(Document, ДокументОснование, ПараметрыЗаполнения);
	
КонецФункции

Процедура УстановитьДоговорВСчетеФактуреДляДиадокПР(СчетФактура) Экспорт
	мСписокВидовДоговоров = Новый СписокЗначений;
	Если ТипЗнч(СчетФактура) = тип("ДокументОбъект.СчетФактураПолученный") Тогда
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	Иначе 
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		мСписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	КонецЕсли;	
	

	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(СчетФактура, мСписокВидовДоговоров);
	
КонецПроцедуры

Функция ПолучитьСписокВидовДоговоров(ВидОперации = Неопределено) Экспорт
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	
	Если ВидОперации = "ВозвратОтПокупателя" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	КонецЕсли;
	
	Если Метаданные.Перечисления.ВидыДоговоровКонтрагентов.ЗначенияПеречисления.Найти("СКомиссионеромНаЗакупку") <> Неопределено Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
	КонецЕсли;	
	
	Возврат СписокВидовДоговоров;
	
КонецФункции

Функция ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, СписокВидовДоговоров) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, СписокВидовДоговоров);
	
КонецФункции


/////////////////////////////////////////////////////////////
// Связи объектов
/////////////////////////////////////////////////////////////

Функция ПолучитьСтавкуНДСДиадок(TaxRate) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСтавкуНДСДиадок(TaxRate);
	
КонецФункции

Функция ПолучитьЕдиницуИзмерения(Код, Наименование, Номенклатура) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ
	|	Классификатор.Ссылка,
	|	Классификатор.Код,
	|	Классификатор.Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК Классификатор
	|		ПО Т.БазоваяЕдиницаИзмерения = Классификатор.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Номенклатура");
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса= Запрос.Выполнить();
	Запрос= Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка= РезультатЗапроса.Выбрать();
		РезультатЗапроса= Неопределено;
		
		Выборка.Следующий();
		
		Если СокрЛП(Выборка.Код) = Код ИЛИ СокрЛП(Выборка.Наименование) = Наименование Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
		КоэффициентПересчета= ОсновнойМодуль.ПолучитьКоэффициентПересчета(Код, Выборка.Код);
		Если ЗначениеЗаполнено(КоэффициентПересчета) Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();

КонецФункции

Функция ПолучитьКоэффициентПересчета(КодЕИ, НаименованиеЕИ, НоваяЕдиницаИзмерения) Экспорт
	
	Если НоваяЕдиницаИзмерения.Код = КодЕИ ИЛИ НоваяЕдиницаИзмерения.наименование = НаименованиеЕИ Тогда 
		Возврат  1;
	КонецЕсли;	
	
	Коэф = ОсновнойМодуль.ПолучитьКоэффициентПересчета(КодЕИ, НоваяЕдиницаИзмерения.Код);
	
	Возврат ?(Коэф = Неопределено, 1, Коэф);
	
КонецФункции	

Процедура ЗаполнениеТабличнойЧасти(ТабличнаяЧасть, ВидОперации, ДокОбъект, ЗаполнениеГТД)
	
	ВТоварахЕстьРНПТ = ЕстьРеквизитРНПТ(ДокОбъект, "Товары");
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров(ТекущаяДата());
	
	Для каждого стр Из ТабличнаяЧасть Цикл
		
		ИменаТабличныхЧастей = ИменаТабличныхЧастейПоступлениеТоваровУслуг();
		ИмяТЧ = "";
		
		Если видОперации = "ВозвратОтПокупателя" Или стр.Тип = "Товар" Тогда
			
			стрОбъект = ДокОбъект.Товары.Добавить();
			Если видОперации <> "ВозвратОтПокупателя" Тогда
				стрОбъект.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
				стрОбъект.Коэффициент = 1;
			КонецЕсли;	
			ИмяТЧ = ИменаТабличныхЧастей.Товары;
			
		ИначеЕсли стр.Тип = "Оборудование" Тогда
			
			стрОбъект = ДокОбъект.Оборудование.Добавить();
			стрОбъект.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
			стрОбъект.Коэффициент = 1;
			ИмяТЧ = ИменаТабличныхЧастей.Оборудование;
			
		ИначеЕсли стр.Тип = "Объект стр" Тогда 	
			
			стрОбъект = ДокОбъект.ОбъектыСтроительства.Добавить();
			ИмяТЧ = ИменаТабличныхЧастей.ОбъектыСтроительства;
			
		ИначеЕсли стр.Тип = "НМА" Тогда	
			
			стрОбъект = ДокОбъект.НематериальныеАктивы.Добавить();
			ИмяТЧ = ИменаТабличныхЧастей.НематериальныеАктивы;
			
		ИначеЕсли (ВидОперации = "ПокупкаКомиссияАгент") и ЗначениеЗаполнено(стр.Комитент) Тогда
			
			стрОбъект = ДокОбъект.АгентскиеУслуги.Добавить();
			ИмяТЧ = ИменаТабличныхЧастей.АгентскиеУслуги;
			
		Иначе
			
			стрОбъект = ДокОбъект.Услуги.Добавить();
			стрОбъект.Содержание = стр.НоменклатураИзЭД;
			ИмяТЧ = ИменаТабличныхЧастей.Услуги;
			
		КонецЕсли;
		
		Если стр.Тип =  "Объект стр" Тогда 
			стрОбъект.ОбъектСтроительства =   стр.Номенклатура;
		ИначеЕсли стр.Тип =  "НМА" Тогда 
			стрОбъект.НематериальныйАктив =   стр.Номенклатура;
		Иначе 	
			стрОбъект.Номенклатура = стр.Номенклатура;
			стрОбъект.Количество = стр.Количество;
			стрОбъект.Цена = стр.Цена;
		КонецЕсли;
						
		Если ВидОперации = "ПокупкаКомиссияАгент" и ЗначениеЗаполнено(стр.Комитент) Тогда
			
			стрОбъект.Контрагент = стр.Комитент;
			стрОбъект.Содержание = стр.НоменклатураИзЭД;
			УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(стрОбъект.ДоговорКонтрагента, стрОбъект.Контрагент, ДокОбъект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			ЗаполнитьСчетаРасчетовСКонтрагентами(ДокОбъект, стрОбъект);
			
		КонецЕсли;
		
		стрОбъект.Сумма = стр.Сумма;
		стрОбъект.СуммаНДС = стр.СуммаНДС;
		стрОбъект.СтавкаНДС = стр.СтавкаНДС;
		
		Если НЕ (ВидОперации = "ПокупкаКомиссияАгент" и ЗначениеЗаполнено(стр.Комитент)) Тогда
			
			ЗаполнитьСчетаУчетаНоменклатуры(ДокОбъект, стрОбъект, стр);
			
		КонецЕсли;
		
		Если ВидОперации = "ПокупкаКомиссия" И стр.Тип = "Услуга" Тогда
			
			Если ДокОбъект.Метаданные().Реквизиты.Найти("ПодразделениеОрганизации") <> Неопределено Тогда 
				Подразделение = ДокОбъект.ПодразделениеОрганизации;
			Иначе
				Подразделение = Неопределено;
			КонецЕсли;
			
			#Если Клиент Тогда
				РаботаСДиалогами.УстановитьПодразделениеПоСчету(стрОбъект.ПодразделениеЗатрат, стрОбъект.СчетЗатрат, ДокОбъект.Организация, Подразделение);
			#КонецЕсли
			
		КонецЕсли;
		
		Если ИмяТЧ = ИменаТабличныхЧастей.Товары Тогда
			
			ЕстьСведенияПрослеживаемости = ИспользуетсяУчетПрослеживаемыхТоваров
											И (стр.СведенияПрослеживаемости <> Неопределено И стр.СведенияПрослеживаемости.Количество() > 0);
											
			Если ЕстьСведенияПрослеживаемости И ВТоварахЕстьРНПТ Тогда
				
				ДополнитьСтрокуТовараДаннымиПрослеживаемости(стрОбъект, стр);
				стрОбъект.СтранаПроисхождения = стр.СтранаПроисхождения;
				
			ИначеЕсли ЗаполнениеГТД И ЗначениеЗаполнено(стр.ГТД) Тогда 
				
				стрОбъект.НомерГТД = ПолучитьСсылкуНомерГТД(стр.ГТД, Истина);
				стрОбъект.СтранаПроисхождения = стр.СтранаПроисхождения;
				
			КонецЕсли;
			
		КонецЕсли;
						
	КонецЦикла;
	
КонецПроцедуры

Функция ИменаТабличныхЧастейПоступлениеТоваровУслуг()

	Результат = Новый Структура;
	Результат.Вставить("Товары"					 , "Товары");
	Результат.Вставить("Оборудование"			 , "Оборудование");
	Результат.Вставить("ОбъектыСтроительства"	 , "ОбъектыСтроительства");
	Результат.Вставить("НематериальныеАктивы"	 , "НематериальныеАктивы");
	Результат.Вставить("АгентскиеУслуги"		 , "АгентскиеУслуги");
	Результат.Вставить("Услуги"					 , "Услуги");
	
	Возврат Результат;
	
КонецФункции 


Процедура ЗаполнитьСчетаРасчетовСКонтрагентами(ДокОбъект, стрОбъект)
	СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(ДокОбъект.Организация, стрОбъект.Контрагент, стрОбъект.ДоговорКонтрагента);
	стрОбъект.СчетРасчетов = СчетаУчета.СчетРасчетовСКомитентом;	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаНоменклатуры(ДокОбъект, стрОбъект, СтрЭД)
	
	Если СтрЭД.Тип = "Объект стр" Тогда
		СчетаУчета = УправлениеВнеоборотнымиАктивами.ПолучитьСчетаУчетаОбъектовСтроительства(ДокОбъект.Организация, стрОбъект.ОбъектСтроительства);
	Иначе
		СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(ДокОбъект.Организация, ?(СтрЭД.Тип = "НМА", стрОбъект.НематериальныйАктив, стрОбъект.Номенклатура), ?(СтрЭД.Тип = "НМА", Неопределено, ДокОбъект.Склад));
	КонецЕсли;
	
	Если СтрЭД.Тип = "Оборудование" Тогда
		
		стрОбъект.СчетУчета  = СчетаУчета.СчетУчета;
		стрОбъект.СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
		
	ИначеЕсли  СтрЭД.Тип = "НМА"  Тогда
		
		Если стрОбъект.НематериальныйАктив.ВидОбъектаУчета = Перечисления.ВидыОбъектовУчетаНМА.НематериальныйАктив Тогда
			СчетаУчета.СчетУчета = ПланыСчетов.Хозрасчетный.ПриобретениеНематериальныхАктивов;
		Иначе
			СчетаУчета.СчетУчета = ПланыСчетов.Хозрасчетный.ВыполнениеНИОКР;
		КонецЕсли;
		
		стрОбъект.СчетУчета  = СчетаУчета.СчетУчета;
		стрОбъект.СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
		
	ИначеЕсли СтрЭД.Тип = "Объект стр" ИЛИ СтрЭД.Тип = "Товар" ИЛИ СтрЭД.Тип = "Услуга" Тогда
	
		Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
			
			стрОбъект.СчетУчета = СчетаУчета.СчетУчета;
			
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ПереданныеСчетУчета", ДокОбъект.Метаданные(), "Товары") Тогда
				стрОбъект.ПереданныеСчетУчета  = СчетаУчета.СчетПередачи;
			КонецЕсли;
			
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетДоходов", ДокОбъект.Метаданные(), "Товары") Тогда
				
				стрОбъект.СчетДоходов  = СчетаУчета.СчетДоходов;
				стрОбъект.СчетРасходов = СчетаУчета.СчетРасходов;
				
				Если стрОбъект.СчетДоходов.ВидыСубконто.Количество() > 0 Тогда
					стрОбъект.Субконто = Новый(стрОбъект.СчетДоходов.ВидыСубконто[0].ВидСубконто.ТипЗначения.Типы()[0]);
					Если ТипЗнч(стрОбъект.Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
						стрОбъект.Субконто = стрОбъект.Номенклатура.НоменклатурнаяГруппа;
					КонецЕсли;
				Иначе
					стрОбъект.Субконто = Неопределено;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаНДСПоРеализации", ДокОбъект.Метаданные(), "Товары") Тогда
				стрОбъект.СчетУчетаНДСПоРеализации = СчетаУчета.СчетУчетаНДСПродажи;
			КонецЕсли;
			
		Иначе
			
			Попытка
				ПрименяетсяУСН = НалоговыйУчетУСН.ПрименениеУСН(ДокОбъект.Организация, ДокОбъект.Дата);
				ПрименяетсяОсобыйПорядокНалогообложения = НалоговыйУчетУСН.ПрименениеОсобогоПорядкаНалогообложения(ДокОбъект.Организация, ДокОбъект.Дата);
			Исключение
				ПрименяетсяУСН = Ложь;
				ПрименяетсяОсобыйПорядокНалогообложения = Ложь;
			КонецПопытки;
			
			Если (ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
				И ДокОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
                Если СтрЭД.Тип = "Услуга" Тогда
                    стрОбъект.СчетЗатрат = СчетаУчета.СчетУчетаДоп;
                Иначе
                    стрОбъект.СчетУчета	= СчетаУчета.СчетУчетаДоп;
				КонецЕсли;				
			Иначе
				Если СтрЭД.Тип = "Услуга" Тогда
					стрОбъект.СчетЗатрат =	СчетаУчета.СчетУчета;
					стрОбъект.СчетУчетаНДС =	СчетаУчета.СчетУчетаНДС;
					стрОбъект.Субконто1 =	СчетаУчета.Субконто1;
					стрОбъект.Субконто2 =	СчетаУчета.Субконто2;
					стрОбъект.Субконто3 =	СчетаУчета.Субконто3;
					
					Если ПрименяетсяУСН ИЛИ НЕ ПрименяетсяОсобыйПорядокНалогообложения Тогда
						
						стрОбъект.СчетЗатратНУ 	= СчетаУчета.СчетУчета;
						стрОбъект.СубконтоНУ1 	= СчетаУчета.Субконто1;
						стрОбъект.СубконтоНУ2   = СчетаУчета.Субконто2;
						стрОбъект.СубконтоНУ3   = СчетаУчета.Субконто3;
						
					КонецЕсли;
					
				Иначе
					стрОбъект.СчетУчета = СчетаУчета.СчетУчета;
					Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаНДС", ДокОбъект.Метаданные(), "Товары") Тогда
						стрОбъект.СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПрименяетсяУСН ИЛИ НЕ ПрименяетсяОсобыйПорядокНалогообложения Тогда
				
				ОтражениеВУСН_Товары = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ОтражениеВУСН", ДокОбъект.Метаданные(), "Товары") И СтрЭД.Тип = "Товар";
				ОтражениеВУСН_Услуги = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ОтражениеВУСН", ДокОбъект.Метаданные(), "Услуги") И СтрЭД.Тип = "Услуга";
				
				Если ОтражениеВУСН_Товары ИЛИ ОтражениеВУСН_Услуги Тогда
					
					Если (ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
						И ДокОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
					
						стрОбъект.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
						
					ИначеЕсли ДокОбъект.ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда	
					    стрОбъект.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
					КонецЕсли;
					
				КонецЕсли;	
					
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;
		
 КонецПроцедуры

///////////////////////////////////////////////////////////
/// фукнции получения данных, общих для торг-12, акта и счета-фактуры
///////////////////////////////////////////////////////////////////////////

Функция ПолучитьСуммуПрописьюДиадок(Total, ВалютаДокумента) Экспорт 
	Возврат ОбщегоНазначения.СформироватьСуммуПрописью(Total, ВалютаДокумента);
КонецФункции	

Функция ДобавитьРазделитель(Стр, Префикс = "") 
	Возврат ?(ЗначениеЗаполнено(стр), Префикс + сокрЛП(Стр) + ", ", "");
КонецФункции

Функция ОтрезатьПравуюЗапятую(стр)
	результат = сокрЛП(стр);
	Пока Прав(результат, 1) = "," Цикл
		Результат = Лев(результат, СтрДлина(результат) - 1);
	КонецЦикла;	
	
	Возврат результат;
КонецФункции

Функция ПолучитьПредставлениеКонтрагентаДляАкта(Контрагент, ДатаОперации) Экспорт 
	СведенияОбОрганизации = ПолучитьСведенияОбОрганизации(Контрагент, ДатаОперации);
	Возврат ОтрезатьПравуюЗапятую(ДобавитьРазделитель(СведенияОбОрганизации.ПолноеНаименование) + ДобавитьРазделитель(СведенияОбОрганизации.ИНН, "ИНН: ") + ДобавитьРазделитель(СведенияОбОрганизации.КПП, "КПП: "));
КонецФункции

Функция ЕстьВозможностьЗаполненияГТД(Видоперации, ЭДОбъект) Экспорт
	
	Если Видоперации = "ПокупкаКомиссия"
		ИЛИ Видоперации = "ПоступлениеОборудования"
		ИЛИ Видоперации = "ВозвратОтПокупателя"
		ИЛИ Видоперации = "ПоступлениеАвтомобилей" Тогда
		
		Если ОсновнойМодуль.ПолучитьФорму("Форма_Диадок_ЭД").ДляDocumentЕстьГТД(ЭДОбъект) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ЕстьВозможностьЗаполненияСерий(Видоперации, ЭДОбъект) Экспорт
	Возврат Ложь;
КонецФункции

//{ СвязиМеждуДокументами

Функция НайтиПодходящийСчетФактуруИзРНК(МассивСсылокРНК) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").НайтиПодходящийСчетФактуруИзРНК(МассивСсылокРНК);
	
КонецФункции

Функция ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект);
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект);
	
КонецФункции

Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ ПометкаУдаления И СчетНаОплатуПокупателю = &СсылкаНаОбъект");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Неопределено;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		РезультатЗапроса = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект) Экспорт 
	
	Возврат СсылкаНаОбъект.СчетНаОплатуПокупателю;
	
КонецФункции

Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьИсправляемыйДокументРеализации(ДокРеализации);
	
КонецФункции

Функция СФПоМассивуДокументовОснованийИдентичны(МассивСсылок) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СФПоМассивуДокументовОснованийИдентичны(МассивСсылок);
	
КонецФункции

//} СвязиМеждуДокументами

//{ Приглашение Контрагентов

Функция ЕстьНовыеКонтрагентыДляПриглашения(МассивОрганизаций1С, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусКонтрагентаНеПодходит
	|ГДЕ
	|	СтатусКонтрагентаНеПодходит.Объект В(&МассивОрганизаций1С)
	|	И СтатусКонтрагентаНеПодходит.Свойство = &ПриглашенияДатаСтатусНеПодходит
	|	И ТИПЗНАЧЕНИЯ(СтатусКонтрагентаНеПодходит.Значение) = ТИП(ДАТА)
	|	И СтатусКонтрагентаНеПодходит.Значение > &ПериодАнализаДокументов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО Т.Контрагент = ЯщикиКонтрагентов.Объект
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)
	|			И (ЯщикиКонтрагентов.Значение <> """")
	|ГДЕ
	|	Т.Дата >= &ПериодАнализаДокументов
	|	И Т.Организация В(&МассивОрганизаций1С)
	|	И ЯщикиКонтрагентов.Объект ЕСТЬ NULL ");
	
	Запрос.УстановитьПараметр("МассивОрганизаций1С"			   , МассивОрганизаций1С);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"		   , ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"  					   , ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ПриглашенияДатаСтатусНеПодходит", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДиадокПриглашенияДатаСтатусНеПодходит"));

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ТаблицаКонтрагентовДляПриглашения(BoxID, ПериодАнализаДокументов) Экспорт
	
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН,
	|	ЯщикиОрганизаций.Значение КАК BoxID
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиОрганизаций
	|		ПО Организации.Ссылка = ЯщикиОрганизаций.Объект
	|			И (ЯщикиОрганизаций.Свойство = &ЯщикДиадокДляОрганизации)
	|			И (ЯщикиОрганизаций.Значение В (&BoxID))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.BoxID,
	|	ВложенныйЗапрос.Контрагент,
	|	СУММА(ВложенныйЗапрос.КоличествоДокументов) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ_СтатистикаДокументов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Организации.BoxID КАК BoxID,
	|		Т.Контрагент КАК Контрагент,
	|		1 КАК КоличествоДокументов
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Организации.BoxID,
	|		Т.Контрагент,
	|		1
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Организации.BoxID,
	|		Т.Контрагент,
	|		1
	|	ИЗ
	|		ВТ_Организации КАК ВТ_Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг КАК Т
	|			ПО ВТ_Организации.Организация = Т.Организация
	|				И (Т.Дата >= &ПериодАнализаДокументов)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.BoxID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Организации.BoxID,
	|	ВТ_Организации.ИНН
	|ПОМЕСТИТЬ ВТ_BoxID
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент1С,
	|	Контрагенты.Код КАК Контрагент1С_Код,
	|	Контрагенты.ИНН КАК Контрагент1С_ИНН,
	|	Контрагенты.КПП КАК Контрагент1С_КПП,
	|	ЕСТЬNULL(ЯщикиКонтрагентов.Значение, """") КАК КонтрагентЭДО_ID,
	|	ЕСТЬNULL(ВТ_СтатистикаДокументов.КоличествоДокументов, 0) КАК КоличествоДокументов,
	|	ВТ_BoxID.BoxID КАК ОрганизацияЭДО_ID,
	|	ВЫБОР
	|		КОГДА ЯщикиКонтрагентов.Значение ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Сопоставлен
	|ИЗ
	|	ВТ_BoxID КАК ВТ_BoxID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_BoxID.ИНН <> Контрагенты.ИНН
	|			И (НЕ Контрагенты.ЭтоГруппа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатистикаДокументов КАК ВТ_СтатистикаДокументов
	|		ПО ВТ_BoxID.BoxID = ВТ_СтатистикаДокументов.BoxID
	|			И (Контрагенты.Ссылка = ВТ_СтатистикаДокументов.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЯщикиКонтрагентов
	|		ПО (Контрагенты.Ссылка = ЯщикиКонтрагентов.Объект)
	|			И (ЯщикиКонтрагентов.Свойство = &ДДКонтр_)");
	
	Запрос.УстановитьПараметр("BoxID"					, BoxID);
	Запрос.УстановитьПараметр("ПериодАнализаДокументов"	, ПериодАнализаДокументов);
	Запрос.УстановитьПараметр("ДДКонтр_"				, ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ДДКонтр_"));
	Запрос.УстановитьПараметр("ЯщикДиадокДляОрганизации", ОсновнойМодуль.ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство("ЯщикДиадокДляОрганизации"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//{ Приглашение Контрагентов

//{ Внешние обработки

Функция ВнешняяОбработкаПоGUID(GUID) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВнешняяОбработкаПоGUID(GUID);
	
КонецФункции

//} Внешние обработки

//{ ИдентификацияДокументов

Функция ЭтоЗаказПокупателя(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоЗаказПокупателя(ДокументСсылка);
	
КонецФункции	

Функция ЭтоКорректировкаРеализации(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКорректировкаРеализации(ДокументСсылка);
	
КонецФункции

Функция ЭтоКорректировкаИсправление(ДокументСсылка) Экспорт
	
	Результат = ЭтоКорректировкаРеализации(ДокументСсылка)
		И ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКСФ(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКСФ(ДокументСсылка);
	
КонецФункции

Функция ЭтоРТУ_ДД(ДокументСсылка) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоРТУ_ДД(ДокументСсылка);
	
КонецФункции 

Функция ЭтоСФ(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФ(ДокументСсылка);
	
КонецФункции	

Функция ЭтоСФПолученный(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФПолученный(ДокументСсылка);
	
КонецФункции	

Функция ЭтоСчетНаОплату(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСчетНаОплату(ДокументСсылка);
	
КонецФункции	

//} ИдентификацияДокументов

//{ ОтправкаДокументов

Функция ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент);
	
КонецФункции	

Процедура УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок);
	
КонецПроцедуры

//} ОтправкаДокументов

//{ ПолучениеДанныхДляФУФ

Функция ГрузополучательПоДокументу(ДокументСсылка) Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ГрузополучательПоДокументу(ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция КонтрагентПоДокументу(ДокументСсылка) Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").КонтрагентПоДокументу(ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоговорПоДокументу(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДоговорПоДокументу(ДокументСсылка);
	
КонецФункции	

Функция ПолучитьСуммуДокумента(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуДокумента(ДокументСсылка);
	
КонецФункции	

Функция ПолучитьСуммуНДС(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуНДС(ДокументСсылка);
	
КонецФункции	

Функция ГрузоотправительПоДокументу(ДокументСсылка) Экспорт
	
		Результат = Неопределено;
		
		Если ЭтоСФ(ДокументСсылка)
			ИЛИ ЭтоКСФ(ДокументСсылка) Тогда
			
			ОбщиеДанныеДляПечати = ПолучитьОбщиеДанныеДляПечатиСФ(ДокументСсылка);
			
		Иначе
			
			ОбщиеДанныеДляПечати = ПолучитьОбщиеДанныеДляПечатиПередаточногоДокумента(ДокументСсылка);
			
		КонецЕсли;
		
		Результат = ОбщиеДанныеДляПечати.Организация;
		
		Возврат Результат;
		
КонецФункции

//} ПолучениеДанныхДляФУФ

//{ СвязиМеждуДокументами

Функция ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент);
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка);
	
КонецФункции

Функция ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента);
	
КонецФункции

//} СвязиМеждуДокументами

Функция ТекстЗапросаПодборНакладных(Direction) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборНакладных(Direction);
	
КонецФункции

Функция ТекстЗапросаПодборСчетовФактур(Direction) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборСчетовФактур(Direction);
	
КонецФункции

Процедура УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
	
КонецПроцедуры

//Возвращает именя реквизита "Склад" у документа поступления
//так как оно заданно в текущей конфигурации
//
//Возвращаемое значение:
//	Строка
Функция ИменаРеквизитов_Склад() Экспорт

	Результат = "Склад";
	
	Возврат Результат;
	
КонецФункции //ИменаРеквизитов_Склад()

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_НомерИДатаВходящегоДокумента"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Структура			- коллекция переопределяемых реквизитов 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента(Результат, ДокСсылка) Экспорт
	
	//По умолчанию используем результат из "Модуль_ИнтеграцияУниверсальнаяЛогика" 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента()

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_КодСпособаПолучения"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Строка			- имя переопределяемого реквизита 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_КодСпособаПолучения(Результат, ДокСсылка) Экспорт
	
	//По умолчанию используем результат из "Модуль_ИнтеграцияУниверсальнаяЛогика" 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_КодСпособаПолучения()

//{Внешние печатные формы

Функция ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ);
	
КонецФункции

Функция ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции);
	
КонецФункции

Функция ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ);
	
КонецФункции

Функция ВПФ_ДополнительныеПараметры(ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_ДополнительныеПараметры(ИдентификаторВПФ);
	
КонецФункции

Функция ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ);
	
КонецФункции

//}Внешние печатные формы

//{Обертки

Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь)
	
	Результат = ОсновнойМодуль.ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСсылкуНаОбъектПоРеквизиту(ОбъектМетаданных, ИмяРеквизита, ЗначРеквизита)
	
	Результат = ОсновнойМодуль.НайтиСсылкуНаОбъектПоРеквизиту(ОбъектМетаданных, ИмяРеквизита, ЗначРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты)
	
	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

//}Обертки

// Устаревшие

//Устарел в релизе 5.30.01. Необходимо использовать метод "ГрузополучательПоДокументу"
Функция ПолучитьГрузополучателяПоДокументу(ДокументСсылка) Экспорт 
	
	Результат = ГрузополучательПоДокументу(ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции
