
&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _МодульСМВ;

&НаКлиенте
Перем _МодульЯдроНаКлиенте;

// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем _МодульСтдСтрНаКлиенте; // Форма СтдСтр библиотеки работы со строками
// BSLLS:UnusedLocalVariable-on

&НаСервере
Перем _МодульЯдроНаСервере;

//{		Сервисные методы


&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция Модуль_Ядро()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте() Экспорт
	
	Если _МодульЯдроНаКлиенте <> Неопределено Тогда
		УстановитьКонтекстВызываемойФормы(_МодульЯдроНаКлиенте);
		Возврат _МодульЯдроНаКлиенте;
	КонецЕсли;
	
	ИмяФормыЯдро = "Обработка.КонтурДиадокЯдро.Форма.КлиентскиеВызовы";
	Если ПодключатьМодулиИзМакетов Тогда
		ИмяФормыЯдро = "Внешняя" + ИмяФормыЯдро;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	// BSLLS:GetFormMethod-off
	_МодульЯдроНаКлиенте = ПолучитьФорму(ИмяФормыЯдро, ПараметрыФормы, ЭтаФорма);
	// BSLLS:GetFormMethod-on
	
	Возврат _МодульЯдроНаКлиенте;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	Возврат ЭтаФорма;
КонецФункции

&НаКлиенте
Функция Модуль_СтдСтрНаКлиенте()
	
	Если _МодульСтдСтрНаКлиенте = Неопределено Тогда
		
		ИмяФормыЯдро = "Обработка.КонтурДиадокСтдСтр.Форма.Клиент";
		Если ПодключатьМодулиИзМакетов Тогда
			ИмяФормыЯдро = "Внешняя" + ИмяФормыЯдро;
		КонецЕсли;
		
		// BSLLS:GetFormMethod-off
		_МодульСтдСтрНаКлиенте = ПолучитьФорму(ИмяФормыЯдро, , ЭтаФорма);
		// BSLLS:GetFormMethod-on
	КонецЕсли;
	
	Возврат _МодульСтдСтрНаКлиенте;
	
КонецФункции

// Синхронизирует контекст вызываемой формы с контекстом текущей формы.
//
// Параметры:
//  ВызываемаяФорма - ФормаКлиентскогоПриложения - форма корневой обработки или ядра.
//
&НаКлиенте
Процедура УстановитьКонтекстВызываемойФормы(ВызываемаяФорма)
	
	ВызываемаяФорма.Объект.ОбщийКонтекстКлиентСервер = Объект.ОбщийКонтекстКлиентСервер;
	
КонецПроцедуры

&НаКлиенте
Функция Модуль_СинхронноМодальныеВызовы()
	
	Если _МодульСМВ = Неопределено Тогда
		
		// BSLLS:GetFormMethod-off
		_МодульСМВ = ПолучитьФорму(ПутьКФормам + "Модуль_СинхронныеМодальныеВызовы", , ЭтаФорма);
		// BSLLS:GetFormMethod-on
		
	КонецЕсли;
	
	Возврат _МодульСМВ;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ЭтаФорма;
	Если ВладелецФормы <> Неопределено Тогда
		Результат = ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МетодСервераБезКонтекста(ВозвращатьРезультат, ИмяМетода, Параметр0 = Неопределено, Параметр1 = Неопределено,
								 Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено) Экспорт
		
	Возврат МетодСервера(ВозвращатьРезультат, ИмяМетода, Параметр0, Параметр1, Параметр2, Параметр3, Параметр4);
	
КонецФункции

&НаСервере
Функция МетодСервера(Знач ВозвращатьРезультат, Знач ИмяМетода, Параметр0 = Неопределено, Параметр1 = Неопределено,
					 Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено)
		
	СтрокаПараметров = ПараметрыСтрокой(Параметр0, Параметр1, Параметр2, Параметр3, Параметр4);
	
	Если ВозвращатьРезультат Тогда
		Возврат Вычислить(ИмяМетода + "(" + СтрокаПараметров + ")");
	Иначе
		Выполнить(ИмяМетода + "(" + СтрокаПараметров + ")");
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПараметрыСтрокой(Параметр0 = Неопределено,
						 Параметр1 = Неопределено,
						 Параметр2 = Неопределено,
						 Параметр3 = Неопределено,
						 Параметр4 = Неопределено)
	
	Разделитель = "";
	ПараметрыСтрокой = "";
	ДобавитьПустойПараметр = Ложь;
	
	Если Не Параметр4 = Неопределено Тогда
		ПараметрыСтрокой= "Параметр4" + Разделитель + ПараметрыСтрокой;
		Разделитель = ", ";
		ДобавитьПустойПараметр = Истина;
		ИндексПоследнегоПараметра = 4;
	Иначе
		Если ДобавитьПустойПараметр Тогда
			ПараметрыСтрокой = Разделитель + ПараметрыСтрокой;
			Разделитель = ",";
		Иначе
			Разделитель = "";
		КонецЕсли;
	КонецЕсли;
	
	Если Не Параметр3 = Неопределено Тогда
		ПараметрыСтрокой = "Параметр3" + Разделитель + ПараметрыСтрокой;
		Разделитель = ", ";
		ДобавитьПустойПараметр = Истина;
	Иначе
		Если ДобавитьПустойПараметр Тогда
			ПараметрыСтрокой = Разделитель + ПараметрыСтрокой;
			Разделитель = ",";
		Иначе
			Разделитель = "";
		КонецЕсли;
	КонецЕсли;
	
	Если Не Параметр2 = Неопределено Тогда
		ПараметрыСтрокой = "Параметр2" + Разделитель + ПараметрыСтрокой;
		Разделитель = ", ";
		ДобавитьПустойПараметр = Истина;
	Иначе
		Если ДобавитьПустойПараметр Тогда
			ПараметрыСтрокой = Разделитель + ПараметрыСтрокой;
			Разделитель = ",";
		Иначе
			Разделитель = "";
		КонецЕсли;
	КонецЕсли;
	
	Если Не Параметр1 = Неопределено Тогда
		ПараметрыСтрокой = "Параметр1" + Разделитель + ПараметрыСтрокой;
		Разделитель = ", ";
		ДобавитьПустойПараметр = Истина;
	Иначе
		Если ДобавитьПустойПараметр Тогда
			ПараметрыСтрокой = Разделитель + ПараметрыСтрокой;
			Разделитель = ",";
		Иначе
			Разделитель = "";
		КонецЕсли;
	КонецЕсли;
	
	Если Не Параметр0 = Неопределено Тогда
		ПараметрыСтрокой = "Параметр0" + Разделитель + ПараметрыСтрокой;
	ИначеЕсли ДобавитьПустойПараметр Тогда
		ПараметрыСтрокой = Разделитель + ПараметрыСтрокой;
	КонецЕсли;
	
	Возврат ПараметрыСтрокой;
	
КонецФункции

// BSLLS:NumberOfOptionalParams-off
&НаКлиенте
Функция ПараметрыВМассивЛок(
	Параметр0 = NULL,
	Параметр1 = NULL,
	Параметр2 = NULL,
	Параметр3 = NULL,
	Параметр4 = NULL)
	
	ДлинаМассива = 5;
	
	Результат = Новый Массив(ДлинаМассива);
	
	Результат[0] = Параметр0;
	Результат[1] = Параметр1;
	Результат[2] = Параметр2;
	Результат[3] = Параметр3;
	Результат[4] = Параметр4;
	
	Для Сч = -Результат.ВГраница() По 0 Цикл
		
		Если Результат[-Сч] = NULL Тогда
			Результат.Удалить(-Сч);
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
// BSLLS:NumberOfOptionalParams-on

// BSLLS:NumberOfOptionalParams-off
// BSLLS:NumberOfParams-off
&НаКлиенте
Процедура ОткрытьФормуЛок(ИмяФормы,
		ПараметрыФормы = Неопределено,
		Владелец = Неопределено,
		Уникальность = Ложь,
		Окно = Неопределено,
		НавигационнаяСсылка = Неопределено,
		ОписаниеОповещенияОЗакрытии = Неопределено,
		РежимОткрытияОкна = Неопределено) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ОткрытьФорму(ИмяФормы,
		ПараметрыФормы,
		Владелец,
		Уникальность,
		Окно,
		НавигационнаяСсылка,
		ОписаниеОповещенияОЗакрытии,
		РежимОткрытияОкна
	);
	
КонецПроцедуры
// BSLLS:NumberOfOptionalParams-on
// BSLLS:NumberOfParams-on

&НаКлиенте
Процедура ОткрытьФормуДиадокМодальноЛок(
	мИмяФормы,
	мВладелецФормы,
	ПараметрыФормы = Неопределено,
	ОписаниеОповещения = Неопределено,
	РежимБлокирования = Неопределено) Экспорт
	
	Если РежимБлокирования = Неопределено Тогда
		РежимБлокирования = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	// Добавим стандартные параметры: Объект и ЗакрыватьПриЗакрытииВладельца
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("Объект", Объект);
	
	ОткрытьФормуЛок(ПутьКФормам + мИмяФормы, ПараметрыФормы, мВладелецФормы, , , , ОписаниеОповещения, РежимБлокирования);
	
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-off
&НаКлиенте
Функция ПолучитьФормуОбработки(
	ИмяФормы,
	Знач парамВладелецФормы = Неопределено,
	Знач ПараметрыФормы = Неопределено,
	КлючУникальности = Неопределено,
	ЗакрыватьПриЗакрытииВладельца = Ложь) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПараметрыФормы.Свойство("Объект") Тогда
		ПараметрыФормы.Вставить("Объект",	Объект);
	КонецЕсли;
	
	Если парамВладелецФормы = Неопределено Тогда
		парамВладелецФормы = ЭтаФорма;
	КонецЕсли;
	
	Если ЗакрыватьПриЗакрытииВладельца Тогда
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ЗакрыватьПриЗакрытииВладельца);
	КонецЕсли;
	
	// BSLLS:GetFormMethod-off
	Результат = ПолучитьФорму(ПутьКФормам + ИмяФормы, ПараметрыФормы, парамВладелецФормы, КлючУникальности);
	// BSLLS:GetFormMethod-on
	
	УстановитьКонтекстВызываемойФормы(Результат);
	
	Возврат Результат;
	
КонецФункции
// BSLLS:NumberOfOptionalParams-on

&НаКлиенте
Процедура ПоказатьПредупреждениеЛок(ОписаниеОповещения = Неопределено,
									Текст = Неопределено,
									Таймаут = 0,
									Заголовок = "") Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьПредупреждение(ОписаниеОповещения, Текст, Таймаут, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЛок(ОписаниеОповещенияОЗавершении,
										ТекстВопроса,
										Кнопки,
										Таймаут = 0,
										КнопкаПоУмолчанию = Неопределено,
										Заголовок = "",
										КнопкаТаймаута = Неопределено) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьВопрос(
		ОписаниеОповещенияОЗавершении,
		ТекстВопроса,
		Кнопки,
		Таймаут,
		КнопкаПоУмолчанию,
		Заголовок,
		КнопкаТаймаута
	);
	
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-off
&НаКлиенте
Процедура ПоказатьДиалогСохранение(
	ОписаниеОповещенияОЗавершении,
	Знач Фильтр = Неопределено,
	Заголовок = Неопределено,
	Каталог = Неопределено,
	ПолноеИмяФайла = Неопределено)
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьДиалогСохранение(ОписаниеОповещенияОЗавершении, Фильтр, Заголовок, Каталог, ПолноеИмяФайла);
	
КонецПроцедуры
// BSLLS:NumberOfOptionalParams-on

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла(ОписаниеОповещенияОЗавершении, РежимРаботы, ПараметрыВыбора) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьДиалогВыбораФайла(ОписаниеОповещенияОЗавершении, РежимРаботы, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораКаталога(
	ОписаниеОповещенияОЗавершении,
	Заголовок = Неопределено,
	Каталог = Неопределено,
	МножественныйВыбор = Ложь) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьДиалогВыбораКаталога(ОписаниеОповещенияОЗавершении, Заголовок, Каталог, МножественныйВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборЭлемента(
	Список,
	ОписаниеОповещенияОЗавершении = Неопределено,
	Заголовок = "",
	Элемент = Неопределено) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьВыборЭлемента(ОписаниеОповещенияОЗавершении, Заголовок, Элемент, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводДатыПереопределенная(ОписаниеОповещенияОЗавершении,
											ВыбраннаяДата = "",
											Подсказка = "",
											ЧастьДаты = Неопределено) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьВводДаты(ОписаниеОповещенияОЗавершении, ВыбраннаяДата, Подсказка, ЧастьДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначениеЛок(Значение, ОписаниеОповещенияОЗавершении = Неопределено) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьЗначение(ОписаниеОповещенияОЗавершении, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораИзСписка(СписокЗначений, ОписаниеОповещенияОЗавершении, Форма, ЭлементФормы, Значение = Неопределено) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ПоказатьДиалогВыбораИзСписка(СписокЗначений, ОписаниеОповещенияОЗавершении, Форма, ЭлементФормы, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеПользователюЛок(Текст, Данные = Неопределено, ФормаВывода = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.ИдентификаторНазначения = ?(ФормаВывода = Неопределено, ЭтаФорма, ФормаВывода).УникальныйИдентификатор;
	Сообщение.Текст = Текст;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Функция НовыйОписаниеОповещения(Знач ИмяПроцедуры,
								Знач Модуль = Неопределено,
								Знач ДополнительныеПараметры = Неопределено,
								Знач ИмяПроцедурыОбработкиОшибки = "",
								Знач МодульОбработкиОшибки = Неопределено) Экспорт
	
	Если Модуль = Неопределено Тогда
		Модуль = ЭтаФорма;
	КонецЕсли;
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	Результат = ИнтерфейсСМВ.смв_НовыйОписаниеОповещения(
		ИмяПроцедуры,
		Модуль,
		ДополнительныеПараметры,
		ИмяПроцедурыОбработкиОшибки,
		МодульОбработкиОшибки
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещения, РезультатОповещения = Неопределено) Экспорт
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_ВыполнитьОбработкуОповещения(ОписаниеОповещения, РезультатОповещения);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыВвода() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", "");
	Результат.Вставить("ТекстСообщения", "");
	Результат.Вставить("ТекстКнопкиВыполнить", "");
	Результат.Вставить("ВозможноПустоеЗначение", Истина);
	Результат.Вставить("ДлинаПоляВвода", Неопределено);
	Результат.Вставить("РежимПароля", Ложь);
	Результат.Вставить("ИдентификаторыДокумента", Неопределено);
	Результат.Вставить("Действие", "");
	Результат.Вставить("ИдентификаторЯщика", "");
	Результат.Вставить("ГрупповоеДействие", Ложь);
	Результат.Вставить("КатегорияМетрикиДокумента", "");
	Результат.Вставить("КонтрагентПоддерживаетМЧД", Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОшибкиОбработкиДанных(Действие, ФормаВыполнения, ЭтоМассоваяОбработка = Ложь) Экспорт
	
	ТекстВопроса			= "";
	КнопкиВопроса			= Новый СписокЗначений;
	КнопкаПоУмолчанию		= КодВозвратаДиалога.ОК;
	ПредставлениеДействия	= ПредставлениеДействияЭДО(Действие);
	
	Если ЭтоМассоваяОбработка Тогда
		ТекстСообщения = "Не для всех выделенных документов удалось выполнить операцию";
	Иначе
		ТекстСообщения = "Не удалось выполнить операцию";
	КонецЕсли;
	
	ТекстСообщения = ТекстСообщения + ": " + ПредставлениеДействия;
	
	КнопкиВопроса.Добавить(КодВозвратаДиалога.ОК);
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Посмотреть причины'"));
	
	ОписаниеОповещенияЗавершения = НовыйОписаниеОповещения(
		"ПослеСообщенияОНеполномВыполненииДействия",
		ЭтаФорма,
		ФормаВыполнения
	);
	
	ПоказатьВопросЛок(ОписаниеОповещенияЗавершения, ТекстСообщения, КнопкиВопроса, , КнопкаПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСообщенияОНеполномВыполненииДействия(ПараметрОповещения, ФормаВыполнения) Экспорт 
	
	Если ПараметрОповещения = КодВозвратаДиалога.Прервать Тогда
		ОткрытьФормуСпискаОшибокЛок(ФормаВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьИлиПерейтиПоСсылке(
		Знач АдресСсылки,
		ДополнительныеПараметры = Неопределено,
		ФормаСобытия = Неопределено) Экспорт
	
	Если ЭтоОповещение(АдресСсылки) Тогда
		ВыполнитьОповещение(АдресСсылки, ДополнительныеПараметры, ФормаСобытия);
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресСсылки(АдресСсылки) Тогда
		ПерейтиПоСсылке(АдресСсылки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоОповещение(Знач АдресСсылки)
	
	АдресСсылки = НРег(АдресСсылки);
	
	Результат = Найти(АдресСсылки, "alert:") > 0 ИЛИ Найти(АдресСсылки, "alertandclose:") > 0;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоАдресСсылки(Знач АдресСсылки)
	
	АдресСсылки = НРег(АдресСсылки);
	
	Результат = Ложь
	Или Найти(АдресСсылки, "e1cib/")	 = 1
	Или Найти(АдресСсылки, "http:")		 = 1
	Или Найти(АдресСсылки, "https:")	 = 1
	Или Найти(АдресСсылки, "e1c:")		 = 1
	Или Найти(АдресСсылки, "v8help:")	 = 1
	Или Найти(АдресСсылки, "mailto:")	 = 1
	Или Найти(АдресСсылки, "tel:")		 = 1
	Или Найти(АдресСсылки, "skype:")	 = 1;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОповещение(АдресСсылки, ДополнительныеПараметры, ФормаСобытия)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ПараметрыОповещения		= Ядро.ПараметрыОповещенияИзСтрокиHTMLСообщения(АдресСсылки);
	ОбработчикОповещения	= ПараметрыОповещения.ОбработчикОповещения;
	РезультатОповещения		= ПараметрыОповещения.РезультатОповещения;
	
	ОписаниеОповещения = НовыйОписаниеОповещения(ОбработчикОповещения, ФормаСобытия, ДополнительныеПараметры);
	
	ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещения, РезультатОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылке(АдресСсылки)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		// BSLLS:UsingSynchronousCalls-off
		ЗапуститьПриложение(АдресСсылки);
		// BSLLS:UsingSynchronousCalls-on
	#Иначе
		ПерейтиПоНавигационнойСсылке(АдресСсылки);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПереходПоВнешнейСсылке(ОписаниеОповещения, Знач ВнешняяСсылка) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Текст = Ядро.Общее_ПодставитьПараметрыВСтроку(
			"Вы собираетесь покинуть Диадок и перейти по ссылке '%1'.
			|
			|Не переходите по ссылке, если не уверены в безопасности её источника.
			|
			|Если всё же решите перейти, мы не рекомендуем вводить личные данные, номера телефонов и пароли.",
			ВнешняяСсылка);
	
	КнопкаОтмена = КодВозвратаДиалога.Отмена;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КнопкаОтмена, "Вернуться");
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Всё равно перейти");
	Таймаут = 30;
	
	ПоказатьВопросЛок(
		ОписаниеОповещения,
		Текст,
		Кнопки,
		Таймаут,
		КнопкаОтмена,
		"Переход по внешней ссылке",
		КнопкаОтмена);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьСвойствоЭлементаФормы(Элемент, СвойствоЭлемента, ЗначениеСвойства) Экспорт
	
	Если Элемент[СвойствоЭлемента] <> ЗначениеСвойства Тогда
		Элемент[СвойствоЭлемента] = ЗначениеСвойства;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПоляФормы(Отказ, Форма, ИмяПоля, Синоним = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Форма[ИмяПоля]) Тогда
		ВывестиСообщениеПользователюЛок(
			"Не заполнено поле """ + ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяПоля) + """",
			,
			Форма
		);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаЭлементаСоставногоТипа(ЭлементСоставногоТипа, ВыбранныйТип) Экспорт
	
	Типы = Новый Массив;
	Типы.Добавить(ВыбранныйТип);
	
	НовыйОписаниеТипов = Новый ОписаниеТипов(Типы);
	
	Если ЭлементСоставногоТипа.ОграничениеТипа <> НовыйОписаниеТипов Тогда
		ЭлементСоставногоТипа.ОграничениеТипа = НовыйОписаниеТипов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКнопокЭлементаСоставногоТипа(ЭлементСоставногоТипа) Экспорт
	
	Если ЭлементСоставногоТипа.ОграничениеТипа = ОграничениеТипа_Неопределено() Тогда
		ПоказатьВыборТипа = Истина;
	Иначе
		ПоказатьВыборТипа = Ложь;
	КонецЕсли;
	
	ЭлементСоставногоТипа.КнопкаОчистки = Не ПоказатьВыборТипа;
	ЭлементСоставногоТипа.ВыбиратьТип = ПоказатьВыборТипа;
	
КонецПроцедуры

&НаКлиенте
Функция ОграничениеТипа_Неопределено() Экспорт
	
	Результат = Новый ОписаниеТипов("Неопределено");
	
	Возврат Результат;
	
КонецФункции

//}		Сервисные методы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НужноИнициализироватьКонтекст = Не Параметры.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	Модуль = ОбработкаОбъект();
	
	Если НужноИнициализироватьКонтекст Тогда
		Модуль.ИнициализироватьОбщийКонтекст(УникальныйИдентификатор);
		Объект.ОбщийКонтекстКлиентСервер = Модуль.ОбщийКонтекстКлиентСервер;
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	ИспользуетсяПодсистемаДиадок = Объект.ОбщийКонтекстКлиентСервер.ИспользуетсяПодсистемаДиадок;
	ПутьКФормам = Модуль.Метаданные().ПолноеИмя() + ".Форма.";
	// BSLLS:UnusedLocalVariable-on
	
	ПроверяемыеСвойства = Новый Структура;
	ПроверяемыеСвойства.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПроверяемыеСвойства, Модуль);
	
	ЭтоВнешняяОбработка = (ПроверяемыеСвойства.ИспользуемоеИмяФайла <> Неопределено);
	ОписаниеЯдра = Объект.ОбщийКонтекстКлиентСервер.ПодключенныеОбработки["КонтурДиадокЯдро"];
	ПодключатьМодулиИзМакетов = (ЭтоВнешняяОбработка Или ОписаниеЯдра.ИсточникБиблиотеки = "Макет");
	
	Ядро = Модуль_Ядро();
	
	Конфиг = Неопределено;
	Если Параметры.Свойство("КонфигурационныйФайл", Конфиг) Тогда
		Ядро.КонфигурационныйФайл_ЗагрузитьПараметры(Конфиг);
	КонецЕсли;
	
	ЗначенияФункциональныхОпций = Ядро.ОбщийКонтекст_Прочитать("ФункциональныеОпции");
	
	АутхПровайдер = Ядро.АутхКонфигурацияПровайдера();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	АутхПриложение = Ядро.АутхКонфигурацияПриложения();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииРаботыМодуля(Знач ПродуктоваяАналитика) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрики_Отправить();
	
	ПриЗавершенииРаботыМодуляВызовСервера(ПродуктоваяАналитика);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗавершенииРаботыМодуляВызовСервера(Знач ПродуктоваяАналитика)
	
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.ПроверитьЗависимости();
	
	Ядро = Модуль_Ядро();
	
	Ядро.ПродуктоваяАналитика_ОтправитьДанныеБезопасно(ПродуктоваяАналитика);
	
	Ядро.Метрика_ДобавитьСтатистику_ИспользованиеПМ();
	
	_ИмяФормы = НазваниеОсновнойФормы();
	_Действие = "Инициализация модуля";
	_Открытие = Ложь;
	Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(
		_ИмяФормы,
		_Действие,
		_Открытие
	);
	
	Ядро.ЗавершитьРаботуЯдра();
	
	Модуль.ЗавершитьРаботуМодуля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииРаботыМодуляОткрытогоИзРасширения() Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрики_Отправить();
	
	ПриЗавершенииРаботыМодуляОткрытогоИзРасширенияВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗавершенииРаботыМодуляОткрытогоИзРасширенияВызовСервера()
	
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.ПроверитьЗависимости();
	
	Ядро = Модуль_Ядро();
	Ядро.ЗавершитьРаботуЯдра();
	
	Модуль.ЗавершитьРаботуМодуля();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовуюВерсиюМодуля() Экспорт
	
	УстановитьНовуюВерсиюМодуляВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовуюВерсиюМодуляВызовСервера()
	
	Модуль = ОбработкаОбъект();
	Модуль.УстановитьНовуюВерсиюМодуля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновитьТипыДокументов(СохраненнаяВерсияПриЗапуске) Экспорт
	
	ПроверитьОбновитьТипыДокументовВызовСервера(СохраненнаяВерсияПриЗапуске);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьОбновитьТипыДокументовВызовСервера(СохраненнаяВерсияПриЗапуске)
	
	Модуль = ОбработкаОбъект();
	Модуль.ПроверитьОбновитьТипыДокументов(СохраненнаяВерсияПриЗапуске);
	
КонецПроцедуры

// Сохраняет значения настроек периода отбора документов для текущего пользователя.
//
// Параметры:
//  Интервал - ВариантСтандартногоПериода - Идентификатор периода отбора документов.
//  РежимОтбора - Строка - Идентификатор режима отбора документов по дате документа или дате получения.
//
&НаКлиенте
Процедура ПользовательскиеНастройкиПериодаУстановить(Интервал, РежимОтбора) Экспорт
	
	ПользовательскиеНастройкиПериодаУстановитьВызовСервера(Интервал, РежимОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ПользовательскиеНастройкиПериодаУстановитьВызовСервера(Интервал, РежимОтбора)
	
	Модуль = ОбработкаОбъект();
	Модуль.ПользовательскиеНастройкиПериодаУстановить(Интервал, РежимОтбора);
	
КонецПроцедуры

// Открывает форму с данными из полей сертификата в HTML представлении
//
// Параметры:
//	ДанныеСертификата - Структура - см. Сертификаты_Контракт_ОписаниеСертификата
//	мВладелецФормы - Форма - владелец открываемого окна
//
&НаКлиенте
Процедура ПоказатьОписаниеСертификата(ДанныеСертификата, мВладелецФормы) Экспорт
	
	HTMLПредставление = ДанныеСертификата_HTMLПредставление(ДанныеСертификата);
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	ПараметрыОткрытияФормы.Вставить("ЗаголовокФормы"			, "Данные сертификата");	
	ПараметрыОткрытияФормы.Вставить("ТекстСообщения"			, HTMLПредставление.ТекстHTML);
	ПараметрыОткрытияФормы.Вставить("ТекстДляКопирования"		, HTMLПредставление.ТекстДляКопирования);
	ПараметрыОткрытияФормы.Вставить("ПоказатьКнопкуСкопировать"	, Истина);
	ПараметрыОткрытияФормы.Вставить("ЗаголовокКнопкиСкопировать", "Скопировать данные сертификата");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОтпечатокСертификата"		, ДанныеСертификата.ОтпечатокСертификата);
	ДополнительныеПараметры.Вставить("СрокДействия"				, ДанныеСертификата.СрокДействия);
	
	ПараметрыОткрытияФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	РежимБлокирования = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		мВладелецФормы,
		ПараметрыОткрытияФормы,
		,
		РежимБлокирования
	);
	
КонецПроцедуры

// Формирует HTML представление данных из полей сертификата
//
// Параметры: 
//	ДанныеСертификата - Структура - см. Сертификаты_Контракт_ОписаниеСертификата
//
// Возвращаемое значение:
//	Структура с ключами:	* ТекстHTML - HTML представление данных из полей сертификата
//							* ТекстДляКопирования - текст для команды "Скопировать данные сертификата"
&НаКлиенте
Функция ДанныеСертификата_HTMLПредставление(ДанныеСертификата)

	Результат = Новый Структура("ТекстHTML, ТекстДляКопирования", "", "");
	
	ТекстДляКопирования = "";
	ТекстHTML =
	"<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<STYLE type=""text/css"">p{
	|font-family: Arial; font-size: 16px; color: #000000; }</STYLE></HEAD>
	|<BODY>";
	
	ПоляПредставления = Новый СписокЗначений;
	ПоляПредставления.Добавить(ДанныеСертификата.Наименование, "ФИО");
	ПоляПредставления.Добавить(ДанныеСертификата.ОтпечатокСертификата, "Отпечаток");
	ПоляПредставления.Добавить(ДанныеСертификата.Организация, "Организация");
	
	ИНН_КПП = СокрЛП(ДанныеСертификата.ИНН);
	Если ЗначениеЗаполнено(ДанныеСертификата.КПП) Тогда
		ИНН_КПП = ИНН_КПП + "-" + ДанныеСертификата.КПП;
	КонецЕсли;
	
	ПоляПредставления.Добавить(ИНН_КПП, "ИНН-КПП");
	
	ПоляПредставления.Добавить(ДанныеСертификата.Издатель, "Издатель");
	
	ДатаВыдачи = "";
	Если ЗначениеЗаполнено(ДанныеСертификата.ДатаВыдачи) Тогда
		ДатаВыдачи = Формат(ДанныеСертификата.ДатаВыдачи, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	ПоляПредставления.Добавить(ДатаВыдачи, "Дата выдачи");
	
	СрокДействия = "";
	Если ЗначениеЗаполнено(ДанныеСертификата.СрокДействия) Тогда
		СрокДействия = Формат(ДанныеСертификата.СрокДействия, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	ПоляПредставления.Добавить(СрокДействия, "Срок действия");
	
	Для каждого ЭлементСписка Из ПоляПредставления Цикл
		
		Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			
			ТекстСтрокиHTML = "<P>" + ЭлементСписка.Представление + ": " + ЭлементСписка.Значение + "</P>";
			ТекстHTML = ТекстHTML + ТекстСтрокиHTML;
			
			ТекстСтроки = "" + ЭлементСписка.Представление + ": " + ЭлементСписка.Значение;
			ТекстДляКопирования = ТекстДляКопирования + ТекстСтроки + Символы.ПС;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстHTML = ТекстHTML + "</BODY></HTML>";
	
	Результат.ТекстHTML 			= ТекстHTML;
	Результат.ТекстДляКопирования 	= ТекстДляКопирования;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПредупреждениеОТарифе(НаименованиеФормы) Экспорт
	
	ЗаголовокСообщения = "";
	
	ТекстСообщения = НСтр(
			"ru = 'Некоторые возможности недоступны для тарифа ""Стартовый"". 
			|Перейдите на тариф ""Универсальный"" и получите доступ к расширенной функциональности модуля Диадок.'");
	
	КнопкаПоУмолчанию = КодВозвратаДиалога.Отмена;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Узнать подробнее");
	СписокКнопок.Добавить(КнопкаПоУмолчанию, "Закрыть");
	
	Таймаут = 0;
	
	ОповещениеОЗавершении = НовыйОписаниеОповещения(
			"ПослеВызоваПредупрежденияОТарифе",
			ЭтаФорма,
			НаименованиеФормы
	);
	
	ПоказатьВопросЛок(
		ОповещениеОЗавершении,
		ТекстСообщения,
		СписокКнопок,
		Таймаут,
		КнопкаПоУмолчанию,
		ЗаголовокСообщения
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВызоваПредупрежденияОТарифе(Результат, НаименованиеФормы) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		АдресСсылки = "https://promo.diadoc.ru/tariff-universal";
		
		ПерейтиПоНавигационнойСсылке(АдресСсылки);
		
		Метрика_УзнатьПодробнееОТарифе(НаименованиеФормы);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает список контрагентов в режиме выбора значения
//
// Параметры:
//  Организация - Строка - Идентификатор организации (BoxId)
//  ПараметрВладелец - ФормаКлиентскогоПриложения - (Необязательный) форма-владелец
//  ОбработчикЗакрытия - ОписаниеОповещения - (Необязательный) описание оповещения о закрытии формы
//
&НаКлиенте
Процедура Контрагенты_ВыбратьКонтрагента(Организация = Неопределено, Знач ПараметрВладелец = Неопределено, ОбработчикЗакрытия = Неопределено) Экспорт
	
	РежимСпискаКА = "ВашиКонтрагенты";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоОрганизации", Организация);
	ПараметрыФормы.Вставить("ТекущийРежимСписка", РежимСпискаКА);
	ПараметрыФормы.Вставить("РежимВыбораИзСписка", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("Объект", Объект);
	
	КлючУникальностиФормы = РежимСпискаКА;
	ИмяФормыСпискаКА = ПутьКФормам + "Контрагенты_ФормаСпискаV2Управляемая";
	
	Если ПараметрВладелец = Неопределено Тогда
		ПараметрВладелец = ОсновнаяФорма();
	КонецЕсли;
	
	ОткрытьФормуЛок(
		ИмяФормыСпискаКА,
		ПараметрыФормы,
		ПараметрВладелец,
		КлючУникальностиФормы,
		Неопределено,
		Неопределено,
		ОбработчикЗакрытия
	);
	
КонецПроцедуры

// Открывает список контрагентов
//
// Параметры:
//  Организация - Строка - (Необязательный) Идентификатор организации (BoxId)
//  ОбработчикЗакрытия - ОписаниеОповещения - (Необязательный) обработчик оповещения о закрытии списка контрагентов
//  СтрокаПоиска - Строка - (Необязательный) при открытии списка контрагентов будет произведен поиск по указанному значению
//
&НаКлиенте
Процедура Контрагенты_ПоказатьСписокКонтрагентов(Организация = Неопределено, ОбработчикЗакрытия = Неопределено, СтрокаПоиска = Неопределено) Экспорт
	
	РежимСпискаКА = "ВашиКонтрагенты";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоОрганизации", Организация);
	ПараметрыФормы.Вставить("ТекущийРежимСписка", РежимСпискаКА);
	ПараметрыФормы.Вставить("РежимВыбораИзСписка", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("Объект", Объект);
	ПараметрыФормы.Вставить("СтрокаПоиска", СтрокаПоиска);
	
	КлючУникальностиФормы = РежимСпискаКА;
	ИмяФормыСпискаКА = ПутьКФормам + "Контрагенты_ФормаСпискаV2Управляемая";
	
	ПараметрВладелец = ОсновнаяФорма();
	
	ОткрытьФормуЛок(
		ИмяФормыСпискаКА,
		ПараметрыФормы,
		ПараметрВладелец,
		КлючУникальностиФормы,
		Неопределено,
		Неопределено,
		ОбработчикЗакрытия
	);
	
КонецПроцедуры

// Открывает форму поиска и приглашения контрагентов
//
// Параметры:
//  Организация - Строка - (Необязательный) Идентификатор организации (BoxId)
//  ОбработчикЗакрытия - ОписаниеОповещения - (Необязательный) обработчик оповещения о закрытии списка контрагентов
//  СтрокаПоиска - Строка - (Необязательный) при открытии списка контрагентов будет произведен поиск по указанному значению
//
&НаКлиенте
Процедура Контрагенты_ПоказатьФормуПоискаИПриглашения(Организация = Неопределено, ОбработчикЗакрытия = Неопределено, СтрокаПоиска = Неопределено) Экспорт
	
	РежимСпискаКА = "ПоискИПриглашение";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоОрганизации", Организация);
	ПараметрыФормы.Вставить("ТекущийРежимСписка", РежимСпискаКА);
	ПараметрыФормы.Вставить("РежимВыбораИзСписка", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("Объект", Объект);
	ПараметрыФормы.Вставить("СтрокаПоиска", СтрокаПоиска);
	
	КлючУникальностиФормы = РежимСпискаКА;
	ИмяФормыСпискаКА = ПутьКФормам + "Контрагенты_ФормаСпискаV2Управляемая";
	
	ПараметрВладелец = ОсновнаяФорма();
	
	ОткрытьФормуЛок(
		ИмяФормыСпискаКА,
		ПараметрыФормы,
		ПараметрВладелец,
		КлючУникальностиФормы,
		Неопределено,
		Неопределено,
		ОбработчикЗакрытия
	);
	
КонецПроцедуры

// Проверяет, оценивал ли пользователь работу с указанной функциональностью модуля
// 
// Параметры:
//  ФункциональностьМодуля - Строка - см. Ядро.Перечисление_СценарииМодуляДляОтзывов()
//
// Возвращаемое значение:
//  Булево - Истина, если оценка уже есть
//
&НаКлиенте
Функция ОтзывПоРаботеСМодулем_ТребуетсяОценка(СценарийМодуляДляОтзыва) Экспорт
	
	Результат = ОтзывПоРаботеСМодулем_ТребуетсяОценкаВызовСервера(СценарийМодуляДляОтзыва);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтзывПоРаботеСМодулем_ТребуетсяОценкаВызовСервера(СценарийМодуляДляОтзыва)
	
	МодульОбъекта = РеквизитФормыВЗначение("Объект");
	Результат = МодульОбъекта.ОтзывПоРаботеСМодулем_ТребуетсяОценка(СценарийМодуляДляОтзыва);
	
	Возврат Результат;
	
КонецФункции

// Открывает форму предупреждения
//
// Параметры:
//  ТекстПредупреждения - Строка - Текст предупреждения пользователя
//  Комментарий - Строка - Дополнительный комментарий
//  Заголовок - Строка - Заголовок формы предупреждения
//  ОбработчикЗакрытия - ОписаниеОповещения - обработчик оповещения о закрытии
//
&НаКлиенте
Процедура ОткрытьФормуПредупреждения(ТекстПредупреждения, Комментарий = Неопределено, Заголовок = Неопределено, ОбработчикЗакрытия = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстПредупреждения", ТекстПредупреждения);
	ПараметрыФормы.Вставить("Комментарий", Комментарий);
	ПараметрыФормы.Вставить("Заголовок", Заголовок);
	ПараметрыФормы.Вставить("Объект", Объект);
	
	ИмяФормыПредупреждения = ПутьКФормам + "ФормаПредупрежденияУправляемая";
	
	ПараметрВладелец = ОсновнаяФорма();
	
	ОткрытьФормуЛок(
		ИмяФормыПредупреждения,
		ПараметрыФормы,
		ПараметрВладелец,
		Неопределено,
		Неопределено,
		Неопределено,
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуHTMLСообщения(
	ТекстСообщения,
	ЗаголовокФормы,
	ФормаВыполнения = Неопределено,
	ОписаниеОповещения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстСообщения", ТекстСообщения);
	ПараметрыФормы.Вставить("ЗаголовокФормы", ЗаголовокФормы);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("Объект", Объект);
	
	ИмяФормыHTMLСообщения = ПутьКФормам + "ФормаHTMLСообщенияУправляемая";
	
	Если ФормаВыполнения = Неопределено Тогда
		ФормаВыполнения = ОсновнаяФорма();
	КонецЕсли;
	
	ОткрытьФормуЛок(
		ИмяФормыHTMLСообщения,
		ПараметрыФормы,
		ФормаВыполнения,
		Неопределено,
		Неопределено,
		Неопределено,
		ОписаниеОповещения
	);
	
КонецПроцедуры

&НаКлиенте
Функция ВыгрузитьВложенныеОбработки() Экспорт
	
	Результат = ВыгрузитьВложенныеОбработкиВызовСервера();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыгрузитьВложенныеОбработкиВызовСервера()
	
	МодульОбъекта = РеквизитФормыВЗначение("Объект");
	
	Результат = МодульОбъекта.ВыгрузитьВложенныеОбработки();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьВозможностьПодключения(ИмяМодуля) Экспорт
	
	Результат = ПроверитьВозможностьПодключенияВызовСервера(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьПодключенияВызовСервера(ИмяМодуля)
	
	МодульОбъекта = РеквизитФормыВЗначение("Объект");
	
	Результат = МодульОбъекта.ПроверитьВозможностьПодключения(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

// Открывает форму мастера первого запуска в режиме конфигурирования модуля
//
// Параметры:
//  ОбработчикЗакрытия - ОписаниеОповещения - оповещение о закрытии формы мастера первого запуска
//
&НаКлиенте
Процедура ПоказатьМастерПервогоЗапуска(ОбработчикЗакрытия) Экспорт
	
	ПараметрыФормы = НастройкиМастераПервогоЗапуска();
	ПараметрыФормы.ПоказатьШагНастройкиОтправкиДокументов = Истина;
	ПараметрыФормы.ПоказатьНачальнуюСтраницу = Истина;
	
	ОткрытьМастерПервогоЗапуска(ПараметрыФормы, ОбработчикЗакрытия);
	
КонецПроцедуры

// Открывает форму мастера первого запуска в режиме настройк организации
//
&НаКлиенте
Процедура ЗапуститьНастройкуОрганизации(ОбработчикЗакрытия = Неопределено) Экспорт
	
	ПараметрыФормы = НастройкиМастераПервогоЗапуска();
	
	ОткрытьМастерПервогоЗапуска(ПараметрыФормы, ОбработчикЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМастерПервогоЗапуска(ПараметрыФормы, ОбработчикЗакрытия = Неопределено)
	
	ИмяФормыМастераПервогоЗапуска = ПутьКФормам + "МастерПервогоЗапускаУправляемая";
	ПараметрВладелец = ОсновнаяФорма();
	КлючУникальностиФормы = "МастерПервогоЗапуска";
	
	ОткрытьФормуЛок(
		ИмяФормыМастераПервогоЗапуска,
		ПараметрыФормы,
		ПараметрВладелец,
		КлючУникальностиФормы,
		Неопределено,
		Неопределено,
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Функция НастройкиМастераПервогоЗапуска()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоказатьШагНастройкиОтправкиДокументов", Ложь);
	ПараметрыФормы.Вставить("ПоказатьНачальнуюСтраницу", Ложь);
	ПараметрыФормы.Вставить("РежимВыбораИзСписка", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("Объект", Объект);
	
	Возврат ПараметрыФормы;
	
КонецФункции

// Открывает форму помощника поиска документа в модуле
//
// Параметры:
//
//  ОбработчикЗакрытия - Структура, ОписаниеОповещения - (Необязательный) оповещение о закрытии формы МПЗ
//
&НаКлиенте
Процедура ПоказатьПомощникПоискаДокумента(ОбработчикЗакрытия = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбораИзСписка", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("Объект", Объект);
	
	ИмяФормыПомощникаПоискаДокумента = ПутьКФормам + "ПомощникПоискаДокументаУправляемая";
	ПараметрВладелец = ОсновнаяФорма();
	КлючУникальностиФормы = "ПомощникПоискаДокументаУправляемая";
	ОкноПриложения = Неопределено;
	НавигационнаяСсылка = Неопределено;
	
	ОткрытьФормуЛок(
		ИмяФормыПомощникаПоискаДокумента,
		ПараметрыФормы,
		ПараметрВладелец,
		КлючУникальностиФормы,
		ОкноПриложения,
		НавигационнаяСсылка,
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуСопоставленияКонтрагента(КонтрагентИБ, ОрганизацияИБ = Неопределено,
	ОбработчикЗакрытия = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтрагентИБ", КонтрагентИБ);
	ПараметрыФормы.Вставить("ОрганизацияИБ", ОрганизацияИБ);
	ПараметрыФормы.Вставить("Объект", Объект);
	
	ИмяФормыПомощникаПоискаДокумента = ПутьКФормам + "Контрагенты_ФормаСопоставленияУправляемая";
	ПараметрВладелец = ОсновнаяФорма();
	КлючУникальностиФормы = "Контрагенты_ФормаСопоставленияУправляемая";
	ОкноПриложения = Неопределено;
	НавигационнаяСсылка = Неопределено;
	
	ОткрытьФормуЛок(
		ИмяФормыПомощникаПоискаДокумента,
		ПараметрыФормы,
		ПараметрВладелец,
		КлючУникальностиФормы,
		ОкноПриложения,
		НавигационнаяСсылка,
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйМодуль_НачатьВыборФайла(ОписаниеОповещения) Экспорт
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Фильтр", "Внешняя обработка 1С:Предприятия 8 (*.epf)|*.epf");
	ПараметрыВыбора.Вставить("Заголовок", "Выберите файл подключаемого модуля");
	ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	ПоказатьДиалогВыбораФайла(ОписаниеОповещения, Режим, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйМодуль_НачатьВыборВстроеннойОбработки(ОписаниеОповещения, ТекущееЗначение = Неопределено) Экспорт
	
	Список = ВстроенныеОбработки();
	
	ПоказатьВыборЭлемента(
		Список,
		ОписаниеОповещения,
		"Выберите встроенную обработку",
		ТекущееЗначение
	);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВстроенныеОбработки()
	
	Список = Новый СписокЗначений;
	
	Для Каждого Обработка Из Метаданные.Обработки Цикл
		Список.Добавить(Обработка.Имя);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура Метрика_УзнатьПодробнееОТарифе(НаименованиеФормы)
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Метрика_НастройкаНедоступна();
	ДействиеМетрики = Метрика_УзнатьПодробнее();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы, 
		КатегорияМетрики, 
		ДействиеМетрики);
		
	Модуль_Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(
		КатегорияМетрики, 
		ДействиеМетрики);

КонецПроцедуры

&НаКлиенте
Функция Метрика_УзнатьПодробнее()
	Возврат "УзнатьПодробнее";
КонецФункции

&НаКлиенте
Функция Метрика_НастройкаНедоступна()
	Возврат "НастройкаНедоступна";
КонецФункции

// Записывает дату закрытия пользователем баннера рекомендации покупки плагинов
//
&НаКлиенте
Процедура ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПлагинов() Экспорт
	
	ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПлагиновНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПлагиновНаСервере()
	
	Модуль = ОбработкаОбъект();
	
	Модуль.ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПлагинов();
	
КонецПроцедуры

// Записывает дату закрытия пользователем баннера рекомендации покупки пакета документов
//
&НаКлиенте
Процедура ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПакетаДокументов() Экспорт
	
	ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПакетаДокументовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПакетаДокументовНаСервере()
	
	Модуль = ОбработкаОбъект();
	
	Модуль.ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПакетаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаОшибокЛок(ФормаВыполнения, ОписаниеОповещения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", "СписокОшибок");
	
	ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ФормаВыполнения,
		ПараметрыФормы,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеДополнительнойКнопки(ПараметрыПМ) Экспорт
	
	// для совместимости со старыми ПМ добавим в ПараметрыПМ РежимОтображенияДокументов и ВыделенныеСтроки
	
	Если Не ПараметрыПМ.Свойство("РежимОтображенияДокументов") Тогда
		ПараметрыПМ.Вставить("РежимОтображенияДокументов", Неопределено);
	КонецЕсли;
	
	Если Не ПараметрыПМ.Свойство("ВыделенныеСтроки") Тогда
		ПараметрыПМ.Вставить("ВыделенныеСтроки", Неопределено);
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	РезультатПМ = Ядро.ПодключаемыйМодуль_ОбработатьСобытие("НажатиеДополнительнойКнопки", ПараметрыПМ);
	
	ПараметрыПМ.Вставить("ДополнительныеПараметры", РезультатПМ);
	
	Ядро.ПодключаемыйМодуль_ОбработатьСобытиеНаСервере("НажатиеДополнительнойКнопки", ПараметрыПМ);
	
КонецПроцедуры

// Процедура - Нажатие дополнительной кнопки второстепенной формы
//
// Параметры:
//  ПараметрыПМ	 - Структура - параметры для выполнения события ПМ
//
&НаКлиенте
Процедура НажатиеДополнительнойКнопкиДляВторостепеннойФормы(ПараметрыПМ) Экспорт 
	
	ПараметрыПМ.Вставить("РежимОтображенияДокументов", Неопределено);
	ПараметрыПМ.Вставить("ВыделенныеСтроки", Неопределено);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	РезультатПМ = Ядро.ПодключаемыйМодуль_ОбработатьСобытие("НажатиеДополнительнойКнопки", ПараметрыПМ);
	
	ПараметрыПМ.Вставить("ДополнительныеПараметры", РезультатПМ);
	
	РезультатПМ = Ядро.ПодключаемыйМодуль_ОбработатьСобытиеНаСервере("НажатиеДополнительнойКнопки", ПараметрыПМ);
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеДействияЭДО(Действие)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ПредставленияДействийЭДО = Ядро.Перечисление_ПредставленияДействийЭДО();
	Результат = ПредставленияДействийЭДО[Действие];
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = "Обработка";
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеДействияАннулирования(Действие) Экспорт
	
	Результат = "";
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействияЭДО = Ядро.Перечисление_ДействияЭДО();
	
	Если Действие = ДействияЭДО.Аннулировать Тогда
		Результат = "Аннулировать";
	ИначеЕсли Действие = ДействияЭДО.ОтказатьВАннулировании Тогда
		Результат = "Отказать в аннулировании";
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеСоздатьДокументы()
	Возврат "Создать";
КонецФункции

&НаКлиенте
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = Модуль_ЯдроНаКлиенте().СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

// Получает форму для отображения прогресса выполнения
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Форма_ПрогрессВыполнения() 
	
	Результат = ПолучитьФормуОбработки("ИндикацияПрогрессаОбработкиДанныхУправляемая", ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаменитьНедопустимыеСимволыИмениФайла(ИмяФайла)
	
	Результат = ИмяФайла;
	
	НедопустимыеСимволы = ":~!@/\#$%^&*=|`""?<>";
	КоличествоНедопустимыхСимволов = СтрДлина(НедопустимыеСимволы);
	
	Для Сч = 1 По КоличествоНедопустимыхСимволов Цикл
		Результат = СтрЗаменить(Результат, Сред(НедопустимыеСимволы, Сч, 1), "_");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбщийBoxId(ВыбранныеBoxId)
	
	Результат = Неопределено;
	
	Если ВыбранныеBoxId.Количество() > 0 Тогда
		
		Если ВыбранныеBoxId.Количество() <> 1 Тогда
			ПоказатьПредупреждениеЛок(, "В списке выбраны документы по различным организациям.
										|Выберите документы, относящиеся только к одной организации.");
		Иначе
			Результат = ВыбранныеBoxId[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция BoxIdИзДокументов(ДокументыДляОбработки) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Документ Из ДокументыДляОбработки Цикл
		
		BoxId = Документ.Идентификаторы.BoxId;
		
		Если Результат.Найти(BoxId) = Неопределено Тогда
			Результат.Добавить(BoxId);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция BoxIdИзСтрокСписка(СтрокиСписка)
	
	Результат = Новый Массив;
	Организации1С = Новый Массив;
	
	Для Каждого СтрокаСписка Из СтрокиСписка Цикл
		
		Организация = СтрокаСписка.Организация;
		
		Если Организации1С.Найти(Организация) = Неопределено Тогда
			Организации1С.Добавить(Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	УчастникиДО = Организации_ДанныеУчастниковДОПоОрганизациям1СНаСервере(Организации1С);
	
	Для Каждого УчастникДО Из УчастникиДО Цикл
		
		BoxId = УчастникДО.BoxId;
		
		Если Результат.Найти(BoxId) = Неопределено Тогда
			Результат.Добавить(BoxId);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Организации_ДанныеУчастниковДОПоОрганизациям1СНаСервере(Знач Организации1С)
	
	Модуль_Ядро = Модуль_Ядро();
	
	Результат = Модуль_Ядро.Организации_ДанныеУчастниковДОПоОрганизациям1С(Организации1С);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДокументыПакетов(Пакеты)
	
	Результат = Новый Массив;
	
	Для Каждого Пакет Из Пакеты Цикл
		
		Для Каждого Документ Из Пакет.Документы Цикл
			Результат.Добавить(Документ);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимыОтображения()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДляОтправки", "ОтправкаПакетов");
	Результат.Вставить("Исходящие", "ОтправленныеДокументы");
	Результат.Вставить("Входящие", "ПолученныеДокументы");
	Результат.Вставить("Внутренние", "ВнутренниеДокументы");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ОткрытьФайл(ИмяВременногоФайла, ИмяФайла) Экспорт
		
	Если ЗначениеЗаполнено(ИмяВременногоФайла) Тогда
		ЗапуститьПриложение(ИмяВременногоФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_КопироватьФайл(ИмяВременногоФайла, ИмяФайла) Экспорт 
	
	ОписаниеОповещения = НовыйОписаниеОповещения("Обработчик_КопироватьФайл_Завершение", ЭтаФорма, ИмяВременногоФайла);
	
	ПоказатьДиалогСохранение(ОписаниеОповещения, , "Сохранение документа на диск", , ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_КопироватьФайл_Завершение(ВыбранныеФайлы, ИмяВременногоФайла) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		КопироватьФайл(ИмяВременногоФайла, ВыбранныеФайлы[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменССерверомСФормойПрогресса(
	ИдентификаторОсновнойФормы = Неопределено,
	ОбработчикНастройкиСервисныхФункций = Неопределено
	) Экспорт
	
	СформироватьИзвещенияОПолучении();
	
	СформироватьОтменуФиксацииГИСМТ();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.ВнешнееХранение_ВыполнитьОчисткуУстаревшихДокументов();
	
	Если Объект.ОбщийКонтекстКлиентСервер.ИспользоватьСлужебнуюУчетнуюЗапись
		 И Не ПроверитьАвторизациюСлужебногоПользователяНаСервере() Тогда
		
		ТекстОшибкиАвторизации	= "В настройках введен неверный логин или пароль.
			|Не удалось выполнить обмен с сервером.";
		
		ПоказатьПредупреждениеОбОшибкеАвторизацииСлужебногоПользователя(
			ТекстОшибкиАвторизации,
			ОбработчикНастройкиСервисныхФункций
		);
		
		Возврат;
		
	КонецЕсли;
	
	СтрокиКонтекста = Ядро.КонтекстСеанса_СтрокиКонтекста();
	
	КоличествоОрганизаций = СтрокиКонтекста.Количество();
	
	ОрганизацииСОшибкамиАвторизации = Новый Массив;
	СчетчикОрганизаций = 0;
	
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		
		Если НЕ СтрокаКонтекста.Значение.Свойство("ОрганизацияДиадок") Тогда
			Продолжить;
		КонецЕсли;
		
		BoxId = СтрокаКонтекста.Ключ;
		
		КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().ОбменССервером;
		ДействиеМетрики = "Обмен с сервером";
		
		Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, КатегорияМетрики, ДействиеМетрики);
		
		СчетчикОрганизаций = СчетчикОрганизаций + 1;
		ОрганизацияДиадок = СтрокаКонтекста.Значение.ОрганизацияДиадок;
		
		ШаблонЗаголовкаФормыПрогресса = "Синхронизация (%1 из %2): %3";
		
		ЗаголовокФормыПрогресса = Ядро.Общее_ПодставитьПараметрыВСтроку(
			ШаблонЗаголовкаФормыПрогресса,
			СчетчикОрганизаций,
			КоличествоОрганизаций,
			ОрганизацияДиадок
		);
		
		ФормаПрогресса = Форма_ПрогрессВыполнения();
		ФормаПрогресса.МассоваяОбработка = Истина;
		ФормаПрогресса.УстановитьЗаголовок(ЗаголовокФормыПрогресса);
		ФормаПрогресса.УстановитьЗначениеПрогресса(0);
		ФормаПрогресса.СброситьНадписи();
		
		Если СтрокаКонтекста.Значение.ПраваПользователя.DocumentAccessLevel <> "AllDocuments"
			И Не Объект.ОбщийКонтекстКлиентСервер.ИспользоватьСлужебнуюУчетнуюЗапись Тогда
			
			ОрганизацииСОшибкамиАвторизации.Добавить(ОрганизацияДиадок);
			
			Продолжить;
			
		КонецЕсли;
		
		СчетчикЦикла = 0;
		
		Пока Истина Цикл
			
			ОбработкаПрерыванияПользователя();
			
			СчетчикЦикла = СчетчикЦикла + 1;
			
			ОсталосьСобытийВЯщике = ОсталосьСобытийВЯщикеВызовСервера(ОрганизацияДиадок);
			ВсегоИтерацийКОбработке = СчетчикЦикла + Цел(ОсталосьСобытийВЯщике / 100);
			
			ФормаПрогресса.УстановитьМаксимальноеЗначение(ВсегоИтерацийКОбработке);
			ФормаПрогресса.УвеличитьЗначениеПрогресса();
			
			Если ОсталосьСобытийВЯщике = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ФормаПрогресса.Закрыть();
		
	КонецЦикла;
	
	ИмяСобытия = "Диадок_ОбновитьГлавныйСписок";
	ПараметрыОповещения = Неопределено;
	
	Оповестить(
		ИмяСобытия,
		ПараметрыОповещения,
		ИдентификаторОсновнойФормы
	);
	
	Если ОрганизацииСОшибкамиАвторизации.Количество() > 0 Тогда
		
		ТекстОшибкиАвторизации	= "Не удалось выполнить обмен с сервером.
			|Укажите служебную учетную запись с полным доступом ко всем подразделениям организаций: ";
		
		ОрганизацииСтрокой = Ядро.СоединитьСтроку(ОрганизацииСОшибкамиАвторизации, ", ");
		ТекстОшибкиАвторизации = ТекстОшибкиАвторизации + ОрганизацииСтрокой;
		
		ПоказатьПредупреждениеОбОшибкеАвторизацииСлужебногоПользователя(
			ТекстОшибкиАвторизации,
			ОбработчикНастройкиСервисныхФункций
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИзвещенияОПолучении() Экспорт
	
	Перем ФормироватьУС;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СтрокиКонтекста = Ядро.КонтекстСеанса_СтрокиКонтекста();
	
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		
		BoxId = СтрокаКонтекста.Значение.Ящик.Идентификатор;
		
		Если ФормироватьУС = Истина Тогда
			Прервать;
		Иначе
			ФормироватьУС = Ядро.УС_ДоступноФормированиеУниверсальныхСообщений(BoxId);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ФормироватьУС = Неопределено Тогда
		СформироватьИзвещенияОПолученииУстаревшегоФормата();
	Иначе
		
		Если ФормироватьУС Тогда
			СформироватьУниверсальныеСообщенияДляИзвещенийОПолучении();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУниверсальныеСообщенияДляИзвещенийОПолучении()
	
	Состояние("Формирование и отправка извещений о получении СФ...");
	СформироватьИзвещенияОПолученииВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИзвещенияОПолученииВызовСервера()
	
	Ядро = Модуль_Ядро();
	
	ПодготовленныеИзвещенияВсехОрганизаций = Ядро.ИоП_ПодготовитьИзвещенияОПолучении();
	Ядро.ИоП_ОтправитьИзвещенияОПолучении(ПодготовленныеИзвещенияВсехОрганизаций);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИзвещенияОПолученииУстаревшегоФормата()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ЕстьОтпечатокСертификата = Ложь;
	
	СтрокиКонтекста = Ядро.КонтекстСеанса_СтрокиКонтекста();
	
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		Если СтрокаКонтекста.Значение.Свойство("ОтпечатокСертификата")
			И ЗначениеЗаполнено(СтрокаКонтекста.Значение.ОтпечатокСертификата) Тогда
			ЕстьОтпечатокСертификата = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОтпечатокСертификата Тогда
		
		Состояние("Формирование и отправка извещений о получении СФ...");
		
		ПодготовленныеИзвещенияВсехОрганизаций = Ядро.ИоП_ПодготовитьИзвещенияОПолучении();
		
		Попытка
			Ядро.ИоП_ПодписатьИзвещенияОПолучении(ПодготовленныеИзвещенияВсехОрганизаций);
		Исключение
			
			ВидОперации = НСтр("ru = 'Формирование извещений о получении'");
			ТекстСообщения = НСтр("ru = 'Не удалось подписать извещения'");
			Ошибка = ИнформацияОбОшибке();
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				Ошибка,
				ТекстСообщения
			);
			
			Возврат;
			
		КонецПопытки;
		
		Ядро.ИоП_ОтправитьИзвещенияОПолучении(ПодготовленныеИзвещенияВсехОрганизаций);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтменуФиксацииГИСМТ() Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ФормироватьКвитанцииОбОтменеФиксации =
		Ядро.ФормироватьКвитанцииОбОтменеФиксации();
	
	Если НЕ ФормироватьКвитанцииОбОтменеФиксации Тогда
		Возврат;
	КонецЕсли;
	
	Состояние("Формирование и отправка отмены фиксации ГИСМТ...");
	
	СтрокиКонтекста = Ядро.КонтекстСеанса_СтрокиКонтекста();
	
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		
		СтрокаКонтекста = СтрокаКонтекста.Значение;
		BoxId = СтрокаКонтекста.BoxId;
		ИНН = СтрокаКонтекста.Ящик.Организация.ИНН;
		ОтпечатокСертификата = Неопределено;
		СтрокаКонтекста.Свойство(
			"ОтпечатокСертификата",
			ОтпечатокСертификата);
		
		Если НЕ ЗначениеЗаполнено(BoxId)
			ИЛИ НЕ ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ДанныеОтменыФиксации = Ядро.ОтменаФиксации_ПолучитьДанные(BoxId, ИНН);
			
			Если НЕ ЗначениеЗаполнено(ДанныеОтменыФиксации) Тогда
				Продолжить;
			КонецЕсли;
			
			Ядро.ОтменаФиксации_Подписать(ОтпечатокСертификата, ДанныеОтменыФиксации);
			Ядро.ОтменаФиксации_Отправить(BoxId, ДанныеОтменыФиксации);
			
		Исключение
			
			ВидОперации = НСтр("ru = 'Подписание и отправка документов отмена фиксации'");
			ТекстСообщения = НСтр("ru = 'Не удалось подписать и отправить отмену фиксации'");
			Ошибка = ИнформацияОбОшибке();
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				Ошибка,
				ТекстСообщения);
			
			Возврат;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьАвторизациюСлужебногоПользователяНаСервере()
	
	Ядро = Модуль_Ядро();
	
	ЛогинДляОбмена = Ядро.ОбщиеНастройки_Прочитать("СлужебнаяУчетнаяЗаписьЛогин");
	ПарольДляОбмена = Ядро.ОбщиеНастройки_Прочитать("СлужебнаяУчетнаяЗаписьПароль");
	
	Результат = Ядро.Авторизация_ПроверкаАвторизации(Неопределено, ЛогинДляОбмена, ПарольДляОбмена);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПредупреждениеОбОшибкеАвторизацииСлужебногоПользователя(
	ТекстОшибкиАвторизации,
	ОбработчикНастройкиСервисныхФункций)
	
	ДопПараметры = Новый Структура;
	Доппараметры.Вставить("ОповещениеОЗакрытииНастроек", ОбработчикНастройкиСервисныхФункций);
	
	Оповещение = НовыйОписаниеОповещения("ОбработчикОткрытьНастройкуСервисныеФункции", ЭтаФорма, ДопПараметры);
	
	КнопкаПерейтиКНастройке = "Перейти к настройке";
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(КнопкаПерейтиКНастройке);
	КнопкиВопроса.Добавить("Закрыть");
	
	ПоказатьВопросЛок(Оповещение, ТекстОшибкиАвторизации, КнопкиВопроса, , КнопкаПерейтиКНастройке);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОткрытьНастройкуСервисныеФункции(
	ПараметрОповещения = Неопределено,
	ПараметрыОбработки = Неопределено) Экспорт
	
	Если ПараметрОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрОповещения <> "Перейти к настройке" Тогда
		Возврат;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	НазваниеФормы = НазваниеОсновнойФормы();
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().ОбменССервером;
	ДействиеМетрики = "Перейти к настройке";
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		КатегорияМетрики,
		ДействиеМетрики
	);
	Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьНастройкиНезависимо("СервисныеФункции", ПараметрыОбработки.ОповещениеОЗакрытииНастроек);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиНезависимо(РазделНастроек, ОповещениеОЗакрытииНастроек) Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РазделНастроек", РазделНастроек);
	ДопПараметры.Вставить("Объект", Объект);
	
	ИмяФормыСпискаНастроек = ПутьКФормам + "НастройкиУправляемая";
	КлючУникальностиФормы = Неопределено;
	ОкноПриложения = Неопределено;
	НавигационнаяСсылка = Неопределено;
	РежимБлокирования = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФормуЛок(
		ИмяФормыСпискаНастроек,
		ДопПараметры,
		ЭтаФорма,
		КлючУникальностиФормы,
		ОкноПриложения,
		НавигационнаяСсылка,
		ОповещениеОЗакрытииНастроек,
		РежимБлокирования
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(РазделНастроек, ОповещениеОЗакрытииНастроек) Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РазделНастроек", РазделНастроек);
	
	ОткрытьФормуДиадокМодальноЛок("НастройкиУправляемая", ЭтаФорма, ДопПараметры, ОповещениеОЗакрытииНастроек);
	
КонецПроцедуры

&НаСервере
Функция ОсталосьСобытийВЯщикеВызовСервера(ОрганизацияДиадок)
	
	Ядро = Модуль_Ядро();
	
	ОписаниеОрганизации = Ядро.Организации_ЗаполненныеРеквизиты(ОрганизацияДиадок);
	
	Результат = Ядро.Лента_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, 1);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НазваниеОсновнойФормы()
	
	Возврат "Основная форма";
	
КонецФункции

&НаКлиенте
Процедура ПроверитьДокументУчета(Знач ДокументУчета, Знач ПослеЗавершенияПроверки) Экспорт
	
	ЕстьОграниченияПоТарифу = ЕстьОграниченияПоТарифуНаСервере();
	
	Если ЕстьОграниченияПоТарифу Тогда
		НаименованиеФормы = "Команда расширения";
		ПоказатьПредупреждениеОТарифе(НаименованиеФормы);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", ДокументУчета);
	ПараметрыФормы.Вставить("Объект", Объект);
	ПараметрыФормы.Вставить("ФормироватьМетрикуСоСпискомОшибокИсточникаОткрытия", Истина);
	
	ПараметрыЗакрытияФормы = Новый Структура;
	ПараметрыЗакрытияФормы.Вставить("ПослеЗавершенияПроверки", ПослеЗавершенияПроверки);
	ПараметрыЗакрытияФормы = Новый ФиксированнаяСтруктура(ПараметрыЗакрытияФормы);
	
	ПриЗакрытииФормыПоискаДокументаСлужебный = НовыйОписаниеОповещения(
		"СлужебныйОбработчик_ПриЗакрытииФормыПоискаДокумента",
		ЭтаФорма,
		ПараметрыЗакрытияФормы
	);
	
	ИмяФормыПомощникаПроверкиДокумента = "ПомощникПоискаДокументаУправляемая";
	ФормаПроверкиДокумента = ПолучитьФорму(ПутьКФормам + ИмяФормыПомощникаПроверкиДокумента, ПараметрыФормы, ЭтаФорма);
	
	ДокументПрошелПроверку = ФормаПроверкиДокумента.ДокументПрошелПроверку();
	
	Если ДокументПрошелПроверку Тогда
		ВыполнитьОбработкуОповещенияЛок(ПриЗакрытииФормыПоискаДокументаСлужебный, ДокументПрошелПроверку);
	Иначе
		
		ПараметрыФормы.Вставить("ФормироватьМетрикуСоСпискомОшибокИсточникаОткрытия", Ложь);
		
		ОткрытьФормуДиадокМодальноЛок(
			ИмяФормыПомощникаПроверкиДокумента,
			ЭтаФорма,
			ПараметрыФормы,
			ПриЗакрытииФормыПоискаДокументаСлужебный
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебныйОбработчик_ПриЗакрытииФормыПоискаДокумента(
	Знач ПроверкаПройдена,
	Знач ПараметрыЗакрытияФормы = Неопределено) Экспорт
	
	ВыполнитьОбработкуОповещенияЛок(ПараметрыЗакрытияФормы.ПослеЗавершенияПроверки, ПроверкаПройдена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументУчета(Знач ДокументУчета, Знач ПослеЗакрытияДокумента) Экспорт
	
	ЕстьОграниченияПоТарифу = ЕстьОграниченияПоТарифуНаСервере();
	
	Если ЕстьОграниченияПоТарифу Тогда
		НаименованиеФормы = "Команда расширения";
		ПоказатьПредупреждениеОТарифе(НаименованиеФормы);
		Возврат;
	КонецЕсли;
	
	СтрокаСписка = СтрокаСпискаПоДокументуУчета(ДокументУчета);
	
	Если ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
		РежимОтображенияДокументов = "ОтправленныеДокументы";
	Иначе
		РежимОтображенияДокументов = "ОтправкаПакетов";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимОтображенияДокументов", РежимОтображенияДокументов);
	ПараметрыФормы.Вставить("РежимФормы", "ОтображениеПакета");
	ПараметрыФормы.Вставить("СтрокаСписка", СтрокаСписка);
	ПараметрыФормы.Вставить("ВыбранныеФайлы", Неопределено);
	ПараметрыФормы.Вставить("ИсточникОткрытия", ДокументУчета);
	
	ПараметрыЗакрытияФормы = Новый Структура;
	ПараметрыЗакрытияФормы.Вставить("ПослеЗакрытияДокумента", ПослеЗакрытияДокумента);
	ПараметрыЗакрытияФормы = Новый ФиксированнаяСтруктура(ПараметрыЗакрытияФормы);
	
	ПриЗакрытииФормыПакета = НовыйОписаниеОповещения(
		"СлужебныйОбработчик_ПриЗакрытииФормыПакета",
		ЭтаФорма,
		ПараметрыЗакрытияФормы
	);
	
	ОткрытьФормуДиадокМодальноЛок(
		"ФормаПакетаУправляемая",
		ЭтаФорма,
		ПараметрыФормы,
		ПриЗакрытииФормыПакета
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебныйОбработчик_ПриЗакрытииФормыПакета(
	Знач ПроверкаПройдена,
	Знач ПараметрыЗакрытияФормы = Неопределено) Экспорт
	
	ВыполнитьОбработкуОповещенияЛок(ПараметрыЗакрытияФормы.ПослеЗакрытияДокумента, ПроверкаПройдена);
	
КонецПроцедуры

&НаСервере
Функция СтрокаСпискаПоДокументуУчета(Знач ДокументУчета)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.ДокументыУчета_СтрокаСписка(ДокументУчета);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КонтекстСеанса_УстановитьКонтекст(Знач КонтекстСеанса) Экспорт
	
	КонтекстСеанса_УстановитьКонтекстНаСервере(КонтекстСеанса);
	
КонецПроцедуры

&НаСервере
Функция Пользователи_ЕстьАдминистративныеПраваВызовСервера() Экспорт
	
	Ядро = Модуль_Ядро();
	Результат = Ядро.Пользователи_ЕстьАдминистративныеПрава();
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификаторы ящика организации из документа 1С в двух форматах
//
// Параметры:
//  ДокументУчета	 - ДокументСсылка	 - Cсылка на учетный документ 1С
// 
// Возвращаемое значение:
//   - Структура	- структура данных с ключами АдресЯщика и BoxId
//
Функция ИдентификаторыОрганизацииДокумента(ДокументУчета) Экспорт
	
	Результат = ИдентификаторыОрганизацииДокументаНаСервере(ДокументУчета);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИдентификаторыОрганизацииДокументаНаСервере(ДокументУчета)
	
	Результат = Новый Структура("АдресЯщика, BoxId");
	
	Ядро = Модуль_Ядро();
	
	Организация = Ядро.ДокументыУчета_Организация(ДокументУчета);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ИдентификаторПоСсылке = Ядро.Организации_ИдентификаторПоСсылке(Организация);
		
		Если ЗначениеЗаполнено(ИдентификаторПоСсылке) Тогда
			
			Результат.АдресЯщика = Ядро.ИдентификаторВАдресЯщика(ИдентификаторПоСсылке);
			Результат.BoxId = Ядро.АдресЯщикаВИдентификатор(ИдентификаторПоСсылке);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеТиповДокументовAPI() Экспорт
	
	ПроверитьНаличиеТиповДокументовAPIНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеТиповДокументовAPIНаСервере()
	
	Ядро = Модуль_Ядро();
	Ядро.ТипыДокументовAPI_ПроверитьНаличие();
	
КонецПроцедуры

&НаСервере
Функция ЕстьОграниченияПоТарифуНаСервере()
	
	МодульЯдро = Модуль_Ядро();
	
	Результат = МодульЯдро.ЕстьОграниченияПоТарифу();
	
	Возврат Результат;
	
КонецФункции

// Открывает форму списка уведомлений пользователей
//
// Параметры:
//  ПараметрыФормы - Структура - Параметры формы открытия списка ЭУ
//  ПараметрВладелец - ФормаКлиентскогоПриложения - (Необязательный) форма-владелец
//  ОбработчикЗакрытия - Структура, ОписаниеОповещения - (Необязательный) оповещение о закрытии формы ЭУ
//
&НаКлиенте
Процедура ОткрытьФормуУведомлений(ПараметрыФормы, ПараметрВладелец = Неопределено,
	ОбработчикЗакрытия = Неопределено) Экспорт
	
	ИмяФормыСпискаУведомлений = ПутьКФормам + "ФормаСпискаУведомленийУправляемая";
	КлючУникальностиФормы = "СписокУведомлений";
	ОкноПриложения = Неопределено;
	НавигационнаяСсылка = Неопределено;
	
	Если ПараметрВладелец = Неопределено Тогда
		ПараметрВладелец = ОсновнаяФорма();
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Объект", Объект);
	
	ОткрытьФормуЛок(
		ИмяФормыСпискаУведомлений,
		ПараметрыФормы,
		ПараметрВладелец,
		КлючУникальностиФормы,
		ОкноПриложения,
		НавигационнаяСсылка,
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

// Формирует метрики при выполнении команды Отправить из документа 1С
//
// Параметры:
//  ИсточникОткрытия - ДокументСсылка - ссылка на документ 1С
//
&НаКлиенте
Процедура СформироватьМетрикуДействияОтправкиИзДокумента1С(ИсточникОткрытия) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ОтправитьЭД;
	
	СформироватьМетрикуДействияИзДокумента1С(ДействиеМетрики, ИсточникОткрытия);
	
КонецПроцедуры

// Формирует метрики при выполнении команды Отправить из документа 1С
//
// Параметры:
//  ИсточникОткрытия - ДокументСсылка - ссылка на документ 1С
//
&НаКлиенте
Процедура СформироватьМетрикуДействияОткрытияИзДокумента1С(ИсточникОткрытия) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ОткрытьЭД;
	
	СформироватьМетрикуДействияИзДокумента1С(ДействиеМетрики, ИсточникОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьМетрикуДействияИзДокумента1С(ДействиеМетрики, ИсточникОткрытия)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().ДействияИзДокумента1С;
	МеткаМетрики = "Нажать кнопку";
	ПредставлениеМетрики = "Документ1С";
	TraceId = "РаботаИзИнтерфейса1С" + ИсточникОткрытия.УникальныйИдентификатор();
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Источник", СокрЛП(ТипЗнч(ИсточникОткрытия)));
	
	ИдентификаторЯщика = ИдентификаторЯщикаОрганизацииДокумента(ИсточникОткрытия);
	
	Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		Неопределено,
		ДопПеременные,
		ПредставлениеМетрики,
		TraceId
	);
	Ядро.Метрика_ДобавитьПоведение(
		КатегорияМетрики,
		ДействиеМетрики,
		МеткаМетрики,
		Неопределено,
		ПредставлениеМетрики,
		TraceId
	);
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторЯщикаОрганизацииДокумента(Знач ДокументУчета)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.ДокументыУчета_ИдентификаторЯщикаОрганизацииДокумента(ДокументУчета);
	
	Возврат Результат;
	
КонецФункции

// #Область Авторизация

// Формирует новую сессию по отпечатку сертификата
//
// Параметры:
//  ОтпечатокСертификата - Строка - отпечаток сертификата для получения токена
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - описание сессии (см. Ядро.МодельСессияПользователя)
//
&НаКлиенте
Функция Авторизация_СессияПоСертификату(Знач ОтпечатокСертификата) Экспорт
	
	Если Не ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
		Ошибка = "ValueError: Не указан отпечаток сертификата";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Сессия = АвторизацияСлужебный_СессияПоСертификату(ОтпечатокСертификата);
	
	Возврат Сессия;
	
КонецФункции

// Формирует новую сессию по логину и паролю.
//
// Параметры:
//  Логин - Строка - логин пользователя Диадока
//  Пароль - Строка - пароль пользователя Диадока
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - описание сессии (см. Ядро.МодельСессияПользователя)
//
&НаКлиенте
Функция Авторизация_СессияПоЛогину(Знач Логин, Знач Пароль) Экспорт
	
	Если Не ЗначениеЗаполнено(Логин) Тогда
		Ошибка = "ValueError: Не указан логин";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пароль) Тогда
		Ошибка = "ValueError: Не указан пароль";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Сессия = АвторизацияСлужебный_СессияПоЛогинуВызовСервера(Логин, Пароль);
	
	Возврат Сессия;
	
КонецФункции

// Асинхронный метод получения авторизационного токена Диадока по протоколу Open ID Connect.
// Передает структуру Ядро.МодельСессияПользователя как результат в обработчик ПриПолученииСессии.
//
// Параметры:
//  ПриПолученииСессии - ОписаниеОповещения - обработчик, который будет вызван при получении токена
//
&НаКлиенте
Процедура Авторизация_НачатьПолучениеСессииЧерезБраузер(ПриПолученииСессии) Экспорт
	
	ПараметрыПолученияСессии = Новый Структура;
	ПараметрыПолученияСессии.Вставить("ПриПолученииСессии", ПриПолученииСессии);
	
	ПриПолученииСессииЧерезБраузер = НовыйОписаниеОповещения(
		"АвторизацияСлужебныйОбработчик_ПриПолученииСессииЧерезБраузер",
		ЭтаФорма,
		ПараметрыПолученияСессии
	);
	
	// BSLLS:UnusedLocalVariable-off
	КлючСессии = АутхКлючНастройки();
	// BSLLS:UnusedLocalVariable-on
	
	МодульАутх = МодульАутхСлужебныйНаКлиенте();
	МодульАутх.НачатьПолучениеСессии(ПриПолученииСессииЧерезБраузер);
	
КонецПроцедуры

// Метод для удаления авторизационного токена Диадока, полученного по протоколу Open ID Connect
//
&НаКлиенте
Процедура Авторизация_СброситьПортальнуюСессию() Экспорт
	
	МодульАутх = МодульАутхСлужебныйНаКлиенте();
	МодульАутх.ЗавершитьСессию();
	
КонецПроцедуры

// Открывает форму настройки конфигурации клиента OAuth (имя и ключ приложения).
//
// Параметры:
//  ПриИзменении - ОписаниеОповещения - обработчик, который будет вызван при успешном сохранении настроек.
//
&НаКлиенте
Процедура Аутх_РедактироватьКонфигурациюПриложения(ПриИзменении) Экспорт
	
	Если Не Пользователи_ЕстьАдминистративныеПраваВызовСервера() Тогда
		
		ТекстЛок = "Для редактирования конфигурации OAuth требуются права администратора.";
		ТаймаутЛок = 60;
		ЗаголовокЛок = "Контур.Диадок: Доступ запрещён";
		ПоказатьПредупреждениеЛок(Неопределено, ТекстЛок, ТаймаутЛок, ЗаголовокЛок);
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыРедактированияКонфигурации = Новый Структура;
	ПараметрыРедактированияКонфигурации.Вставить("ПриИзмененииКонфигурации", ПриИзменении);
	
	ПриИзмененииКонфигурацииПриложения = НовыйОписаниеОповещения(
		"АутхСлужебныйОбработчик_ПриИзмененииКонфигурацииПриложения",
		ЭтаФорма,
		ПараметрыРедактированияКонфигурации
	);
	
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФормуДиадокМодальноЛок(
		"АутхКонфигурацияПриложенияУправляемая",
		ПриИзменении.Модуль,
		ПараметрыФормы,
		ПриИзмененииКонфигурацииПриложения,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс
	);
	
КонецПроцедуры

&НаКлиенте
Процедура АутхСлужебныйОбработчик_ПриИзмененииКонфигурацииПриложения(Знач НастройкиИзменены, Знач ПараметрыРедактированияКонфигурации = Неопределено) Экспорт
	
	Если НастройкиИзменены <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещенияЛок(
		ПараметрыРедактированияКонфигурации.ПриИзмененииКонфигурации,
		НастройкиИзменены
	);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияСлужебныйОбработчик_ПриПолученииСессииЧерезБраузер(ПортальнаяСессия, ПараметрыПолученияСессии) Экспорт
	
	Если ТипЗнч(ПортальнаяСессия) <> Тип("ФиксированнаяСтруктура")
		И ТипЗнч(ПортальнаяСессия) <> Тип("Структура") Тогда
		// Пользователь не подтвердил доступы приложения в браузере
		Возврат;
	КонецЕсли;
	
	Сессия = АвторизацияСлужебный_СессияПорталБраузерВызовСервера(АутхКлючНастройки(), ПортальнаяСессия);
	
	ВыполнитьОбработкуОповещенияЛок(
		ПараметрыПолученияСессии.ПриПолученииСессии,
		Сессия
	);
	
КонецПроцедуры

&НаСервере
Функция АвторизацияСлужебный_СессияПорталБраузерВызовСервера(Знач КлючСессии, Знач ПортальнаяСессия)
	
	Ядро = Модуль_Ядро();
	Результат = Ядро.Новый_СессияПорталБраузер(КлючСессии, ПортальнаяСессия);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция АвторизацияСлужебный_СессияПоСертификату(ОтпечатокСертификата)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ТокенДоступа = Ядро.Авторизация_ПоСертификату(ОтпечатокСертификата);
	Результат = АвторизацияСлужебный_СессияПоСертификатуВызовСервера(ОтпечатокСертификата, ТокенДоступа);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция АвторизацияСлужебный_СессияПоСертификатуВызовСервера(Знач ОтпечатокСертификата, Знач ТокенДоступа)
	
	Ядро = Модуль_Ядро();
	Результат = Ядро.Новый_СессияДиадокСертификат(ОтпечатокСертификата, ТокенДоступа);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция АвторизацияСлужебный_СессияПоЛогинуВызовСервера(Знач Логин, Знач Пароль)
	
	Ядро = Модуль_Ядро();
	
	ТокенДоступа = Ядро.Токен_ПолучитьИзДиадока(Неопределено, Логин, Пароль);
	Результат = Ядро.Новый_СессияДиадокПароль(Логин, ТокенДоступа);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульАутхСлужебныйНаКлиенте()
	
	ИмяФормыАутх = "Обработка.КонтурДиадокАутентификатор.Форма.Клиент";
	Если ЭтоВнешняяОбработка Тогда
		ИмяФормыАутх = "ВнешняяОбработка.КонтурДиадокАутентификатор.Форма.Клиент";
	КонецЕсли;
	
	// BSLLS:GetFormMethod-off
	Результат = ПолучитьФорму(ИмяФормыАутх);
	// BSLLS:GetFormMethod-on
	
	Результат.УстановитьКонфигурациюПровайдера(АутхПровайдер);
	Результат.УстановитьКонфигурациюПриложения(АутхПриложение);
	Результат.УстановитьОтборСессий(АутхОтборСессий(Результат.СобратьКлючОбъекта()));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МодульАутхСлужебныйНаСервере()
	
	ИмяМодуляАутх = "ОбработкаОбъект.КонтурДиадокАутентификатор";
	Если ЭтоВнешняяОбработка Тогда
		ИмяМодуляАутх = "ВнешняяОбработкаОбъект.КонтурДиадокАутентификатор";
	КонецЕсли;
	
	Результат = Новый(ИмяМодуляАутх);
	Результат.УстановитьКонфигурациюПровайдера(АутхПровайдер);
	Результат.УстановитьКонфигурациюПриложения(АутхПриложение);
	Результат.УстановитьХранилищеСессий(Неопределено);
	Результат.УстановитьОтборСессий(АутхОтборСессий(Результат.СобратьКлючОбъекта()));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция АутхОтборСессий(Знач КлючОбъекта)
	
	Результат = Новый Структура("КлючОбъекта, КлючНастроек, Пользователь");
	Результат.КлючОбъекта = КлючОбъекта;
	Результат.КлючНастроек = АутхКлючНастройки();
	Результат.Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция АутхКлючНастройки()
	Возврат "e2714b37-0f4e-492e-dd1c-d01ab55ac000"; // Константа
КонецФункции

// #КонецОбласти Авторизация

// #Область СеансРаботыПользователя

// Запускает инициализацию сеанса пользователя. Если не удалось восстановить
// контекст предыдущего сеанса (его не было, истекло действие авторизационного
// токена и т.п.), открывается форма авторизации.
//
// Параметры:
//  ПриНачалеСеанса - ОписаниеОповещения - обработчик, который будет вызван
//                                         после иницилизации контекста сеанса
//
&НаКлиенте
Процедура Сеанс_Начать(Знач ПриНачалеСеанса) Экспорт
	
	СохраненныеНастройки = СеансСлужебный_НастройкиЯщиков();
	
	Если Не ЗначениеЗаполнено(СохраненныеНастройки) Тогда
		СеансСлужебный_ПоказатьФормуАвторизации("Авторизация", ПриНачалеСеанса);
		Возврат;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Попытка
		ЛокальныеСертификаты = СеансСлужебный_ОписанияСертификатов(СохраненныеНастройки);
	Исключение
		ОшибкаИнфо = ИнформацияОбОшибке();
		Ядро.Ошибка_Обработать("Получить описания сертификатов", ОшибкаИнфо);
		СеансСлужебный_ПоказатьФормуАвторизации("Авторизация", ПриНачалеСеанса);
		Возврат;
	КонецПопытки;
	
	Попытка
		Сессии = СеансСлужебный_Сессии(СохраненныеНастройки);
	Исключение
		ОшибкаИнфо = ИнформацияОбОшибке();
		Ядро.Ошибка_Обработать("Восстановить сессии", ОшибкаИнфо);
		СеансСлужебный_ПоказатьФормуАвторизации("Авторизация", ПриНачалеСеанса);
		Возврат;
	КонецПопытки;
	
	Контекст = Новый Соответствие;
	ЕстьОшибки = Ложь;
	
	Для Каждого НастройкаСеанса Из СохраненныеНастройки Цикл
		
		ИдентификаторЯщика = НастройкаСеанса.ИдентификаторЯщика;
		Сертификат = ЛокальныеСертификаты.Получить(НастройкаСеанса.ОтпечатокСертификата);
		Сессия = Сессии.Получить(НастройкаСеанса.КлючСессии);
		
		Попытка
			
			СтрокаКонтекста = Сеанс_НоваяСтрока(ИдентификаторЯщика, Сессия, Сертификат);
			
		Исключение
			
			ЕстьОшибки = Истина;
			ОшибкаИнфо = ИнформацияОбОшибке();
			Ядро.Ошибка_Обработать("Восстановление контекста", ОшибкаИнфо);
			
			Прервать;
			
		КонецПопытки;
		
		Контекст.Вставить(ИдентификаторЯщика, СтрокаКонтекста);
		
	КонецЦикла;
	
	Если ЕстьОшибки Или Не ЗначениеЗаполнено(Контекст) Тогда
		СеансСлужебный_ПоказатьФормуАвторизации("Авторизация", ПриНачалеСеанса);
	Иначе
		СеансСлужебный_ОбработатьПолучениеКонтекста(Контекст, ПриНачалеСеанса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СеансСлужебный_ОписанияСертификатов(СохраненныеНастройки)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ЛокальныеСертификаты = Новый Соответствие;
	
	Для Каждого НастройкаСеанса Из СохраненныеНастройки Цикл
		
		Отпечаток = НастройкаСеанса.ОтпечатокСертификата;
		Сертификат = ЛокальныеСертификаты.Получить(Отпечаток);
		
		Если ЗначениеЗаполнено(Отпечаток)
			И Не ЗначениеЗаполнено(Сертификат) Тогда
			
			СертификатДанные = Ядро.Сертификаты_ДанныеСертификата(Отпечаток);
			СертификатBase64 = Ядро.Сертификаты_СертификатВBase64(Отпечаток);
			Сертификат = Ядро.Сертификаты_ОписаниеСертификата(СертификатДанные);
			Сертификат.Вставить("Base64", СертификатBase64);
			
			ЛокальныеСертификаты.Вставить(Отпечаток, Сертификат);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЛокальныеСертификаты;
	
КонецФункции

&НаКлиенте
Функция СеансСлужебный_Сессии(СохраненныеНастройки)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Сессии = Новый Соответствие;
	
	СохраненныеСхемы = Новый Массив;
	Для Каждого НастройкаСеанса Из СохраненныеНастройки Цикл
		Если СохраненныеСхемы.Найти(НастройкаСеанса.СхемаАутентификации) = Неопределено Тогда
			СохраненныеСхемы.Добавить(НастройкаСеанса.СхемаАутентификации);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СохраненныеСхемы) Тогда
		Возврат Сессии;
	ИначеЕсли СохраненныеСхемы.Количество() > 1 Тогда
		Ошибка = "Одновременно может использоваться только одна схема аутентификации";
		ВызватьИсключение Ошибка;
	Иначе
		СхемаАутентификации = СохраненныеСхемы[0];
	КонецЕсли;
	
	ДоступныеСхемы = ДоступныеСхемыАутентификации(ЗначенияФункциональныхОпций);
	Если ДоступныеСхемы.Найти(СхемаАутентификации) = Неопределено Тогда
		Ошибка = СтрЗаменить("Схема аутентификации '%1' не поддерживается или отключена по функциональным опциям"
			, "%1", СхемаАутентификации);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Если СхемаАутентификации = СхемаАутентификацииПорталБраузер() Тогда
		
		НастройкаСеанса = СохраненныеНастройки[0];
		Сессия = СеансСлужебный_СессияПортал(НастройкаСеанса);
		Сессии.Вставить(НастройкаСеанса.КлючСессии, Сессия);
		
	Иначе
		
		Для Каждого НастройкаСеанса Из СохраненныеНастройки Цикл
			
			ТребуетсяОбновитьТокенДоступа = СеансСлужебный_СессияИстекает(НастройкаСеанса.ТокенДоступаСрокДействия);
			
			КлючСессии = НастройкаСеанса.КлючСессии;
			
			Если Не ТребуетсяОбновитьТокенДоступа Тогда
				Сессия = Ядро.КонтекстСеанса_ВосстановитьСессию(НастройкаСеанса);
			ИначеЕсли СхемаАутентификации = СхемаАутентификацииДиадокСертификат() Тогда
				Сессия = АвторизацияСлужебный_СессияПоСертификату(НастройкаСеанса.ОтпечатокСертификата);
			Иначе
				Ошибка = СтрЗаменить("Для схемы аутентификации '%1' обновление токена доступа не поддерживается!", "%1", СхемаАутентификации);
				ВызватьИсключение Ошибка;
			КонецЕсли;
			
			Если Сессия.Ключ <> КлючСессии Тогда
				Ошибка = "Изменился ключ сессии, требуется актуализировать контекст сеанса";
				ВызватьИсключение Ошибка;
			КонецЕсли;
			
			Сессии.Вставить(КлючСессии, Сессия);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Сессии;
	
КонецФункции

&НаСервере
Функция СеансСлужебный_СессияПортал(Знач НастройкаСеанса)
	
	Если НастройкаСеанса.ИмяПриложения <> АутхПриложение.Имя Тогда
		Ошибка = "Изменилось имя клиента аутентификации. Требуется актуализировать контекст сеанса.";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	КлючСессии = НастройкаСеанса.КлючСессии;
	Аутх = МодульАутхСлужебныйНаСервере();
	Ядро = Модуль_Ядро();
	
	ПортальнаяСессия = Аутх.ПолучитьСессию();
	Сессия = Ядро.Новый_СессияПорталБраузер(КлючСессии, ПортальнаяСессия);
	
	Возврат Сессия;
	
КонецФункции

// Открывает форму авторизации в режиме выбора ящиков для работы
//
// Параметры:
//  ПриИзмененииКонтекстаСеанса - ОписаниеОповещения - обработчик, который будет вызван
//                                                     после изменения контекста сеанса
//
&НаКлиенте
Процедура Сеанс_РедактироватьКонтекст(Знач ПриИзмененииКонтекстаСеанса) Экспорт
	
	СеансСлужебный_ПоказатьФормуАвторизации("ВыборОрганизаций", ПриИзмененииКонтекстаСеанса);
	
КонецПроцедуры

// Открывает форму авторизации
//
// Параметры:
//  Режим - Строка - "Авторизация" или "ВыборОрганизаций"
//  ПриЗакрытииФормыАвторизации - ОписаниеОповещения - оповещение, которое необходимо вызвать
//                                                     после закрытия формы авторизации.
//
&НаКлиенте
Процедура СеансСлужебный_ПоказатьФормуАвторизации(Знач Режим, Знач ПриЗакрытииФормыАвторизации)
	
	ПараметрыЗакрытияФормы = Новый Структура;
	ПараметрыЗакрытияФормы.Вставить("ПриЗакрытииФормыАвторизации", ПриЗакрытииФормыАвторизации);
	ПараметрыЗакрытияФормы = Новый ФиксированнаяСтруктура(ПараметрыЗакрытияФормы);
	
	ПриЗакрытииФормыАвторизацииСлужебный = НовыйОписаниеОповещения(
		"СеансСлужебныйОбработчик_ПриЗакрытииФормыАвторизации",
		ЭтаФорма,
		ПараметрыЗакрытияФормы
	);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийРежимФормы", Режим);
	ПараметрыФормы.Вставить("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	ОткрытьФормуЛок(
		ПутьКФормам + "АвторизацияУправляемая",
		ПараметрыФормы,
		ЭтаФорма,
		Неопределено,
		Неопределено,
		Неопределено,
		ПриЗакрытииФормыАвторизацииСлужебный,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

// Конструктор строки контекста сеанса
//
// Параметры:
//  ИдентификаторЯщика - Строка - идентификатор ящика организации
//  Сессия - Структура, ФиксированнаяСтруктура - см. Ядро.МодельСессияПользователя
//  Сертификат - Структура, ФиксированнаяСтруктура - Ядро.Сертификаты_ОписаниеСертификата + двоичка (Base64)
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. Ядро.МодельСтрокаКонтекстаСеанса
//
&НаКлиенте
Функция Сеанс_НоваяСтрока(Знач ИдентификаторЯщика, Знач Сессия, Знач Сертификат) Экспорт
	
	Результат = СеансСлужебный_НоваяСтрокаВызовСервера(ИдентификаторЯщика, Сессия, Сертификат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СеансСлужебный_НоваяСтрокаВызовСервера(Знач ИдентификаторЯщика, Знач Сессия, Знач Сертификат)
	
	Ядро = Модуль_Ядро();
	Результат = Ядро.СоздатьСтрокуКонтекстаСеанса(ИдентификаторЯщика, Сессия, Сертификат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СеансСлужебный_НастройкиЯщиков()
	
	Ядро = Модуль_Ядро();
	Настройки = Ядро.КонтекстСеанса_СохраненныеНастройки();
	
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Функция СеансСлужебный_СессияИстекает(Знач ТокенДоступаСрокДействия)
	
	ПрогнозируемаяДлительностьСессии = 14400; // 4 часа
	РасчетныйСрокДействия = ТекущаяУниверсальнаяДата() + ПрогнозируемаяДлительностьСессии;
	
	Результат = (ТокенДоступаСрокДействия < РасчетныйСрокДействия);
	
	Возврат Результат;
	
КонецФункции

// Обработчик закрытия формы авторизации
//
// Параметры:
//  ЗаполненныйКонтекст - Соответствие - Информация о доступных ящиках и их настройках
//  ПараметрыЗакрытияФормы - ФиксированнаяСтруктура - содержит ключи:
//   * ПриЗакрытииФормыАвторизации - ОписаниеОповещения - обработчик, который нужно вызвать изменении контекста сеанса
//
&НаКлиенте
Процедура СеансСлужебныйОбработчик_ПриЗакрытииФормыАвторизации(Знач ЗаполненныйКонтекст, Знач ПараметрыЗакрытияФормы = Неопределено) Экспорт
	
	СеансСлужебный_ОбработатьПолучениеКонтекста(ЗаполненныйКонтекст, ПараметрыЗакрытияФормы.ПриЗакрытииФормыАвторизации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СхемаАутентификацииПорталБраузер()
	Возврат "oidc/device_flow";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СхемаАутентификацииДиадокСертификат()
	Возврат "dd_auth/certificate";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СхемаАутентификацииДиадокПароль()
	Возврат "dd_auth/password";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступныеСхемыАутентификации(ЗначенияОпций)
	
	ДоступныеСхемы = Новый Массив;
	
	ТипБулево = Тип("Булево");
	
	ЗначениеОпции = ЗначенияОпций.Получить("Authorization.Tab.Certificate");
	Если Не ЗначениеЗаполнено(ЗначениеОпции)
		Или XMLЗначение(ТипБулево, ЗначениеОпции) Тогда
		ДоступныеСхемы.Добавить(СхемаАутентификацииДиадокСертификат());
	КонецЕсли;
	
	ЗначениеОпции = ЗначенияОпций.Получить("Authorization.Tab.Password");
	Если Не ЗначениеЗаполнено(ЗначениеОпции)
		Или XMLЗначение(ТипБулево, ЗначениеОпции) Тогда
		ДоступныеСхемы.Добавить(СхемаАутентификацииДиадокПароль());
	КонецЕсли;
	
	ЗначениеОпции = ЗначенияОпций.Получить("Authorization.Tab.Portal");
	Если Не ЗначениеЗаполнено(ЗначениеОпции)
		Или XMLЗначение(ТипБулево, ЗначениеОпции) Тогда
		ДоступныеСхемы.Добавить(СхемаАутентификацииПорталБраузер());
	КонецЕсли;
	
	Результат = Новый ФиксированныйМассив(ДоступныеСхемы);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СеансСлужебный_ОбработатьПолучениеКонтекста(Знач ЗаполненныйКонтекст, Знач ПриЗаполненииКонтекста)
	
	Если ЗначениеЗаполнено(ЗаполненныйКонтекст) Тогда
		ПослеИнициализацииКонтекстаСеансаНаСервере(ЗаполненныйКонтекст);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещенияЛок(ПриЗаполненииКонтекста, ЗаполненныйКонтекст);
	
КонецПроцедуры

&НаСервере
Процедура ПослеИнициализацииКонтекстаСеансаНаСервере(Знач Контекст)
	
	КонтекстСеанса_УстановитьКонтекстНаСервере(Контекст);
	
	Ядро = Модуль_Ядро();
	
	Ядро.КонтекстСеанса_ЗаписатьНастройки(Контекст, АутхПриложение);
	
	Ядро.Метрика_ДобавитьСтатистику_Авторизации();
	Ядро.Метрика_ДобавитьСтатистику_НастройкиОрганизацияПриАвторизации();
	Ядро.Метрика_ДобавитьСтатистику_ВидыДокументовПриАвторизации();
	Ядро.Метрика_ДобавитьСтатистику_Плагины();
	
КонецПроцедуры

&НаСервере
Процедура КонтекстСеанса_УстановитьКонтекстНаСервере(Знач Контекст)
	
	Ядро = Модуль_Ядро();
	Ядро.КонтекстСеанса_Очистить();
	
	Для Каждого КлючЗначение Из Контекст Цикл
		
		ИдентификаторЯщика = КлючЗначение.Ключ;
		СтрокаКонтекста = КлючЗначение.Значение;
		
		Ядро.КонтекстСеанса_ДобавитьСтроку(ИдентификаторЯщика, СтрокаКонтекста);
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти СеансРаботыПользователя

// #Область Аннулирование

&НаКлиенте
Процедура ОбработкаАннулирования(ПараметрыОбработки) Экспорт
	
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	Действие			= ПараметрыОбработки.Действие;
	ФормаВыполнения		= ПараметрыОбработки.ФормаВыполнения;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ДоступныеДанныеДляОбработки = Ядро.Документы_ДоступныеДляАннулированияДокументы(
		ДанныеДляОбработки,
		Действие
	);
	
	КоличествоВыбранныхДокументов = ДанныеДляОбработки.Количество();
	КоличествоДоступныхДокументов = ДоступныеДанныеДляОбработки.Количество();
	
	Если КоличествоДоступныхДокументов = 0 Тогда
		
		ПоказатьПредупреждениеОНевозможностиВыполненияДействия(ПараметрыОбработки);
		
	Иначе
		
		ПараметрыОбработки.ДанныеДляОбработки = ДоступныеДанныеДляОбработки;
		
		ПараметрыФормы = ПараметрыФормыАннулированияОтказаВАннулировании(
			Действие,
			КоличествоВыбранныхДокументов,
			КоличествоДоступныхДокументов,
			ПараметрыОбработки
		);
		
		ОписаниеОповещения = НовыйОписаниеОповещения(
			"ОбработчикЗавершенияАннулированияОтказаВАннулировании",
			ЭтаФорма,
			ПараметрыОбработки
		);
		
		ОткрытьФормуДиадокМодальноЛок(
			"ФормаВводаУправляемая",
			ФормаВыполнения,
			ПараметрыФормы,
			ОписаниеОповещения
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыАннулированияОтказаВАннулировании(Действие, КоличествоДокументов, КоличествоДоступныхДокументов, ПараметрыОбработки)

	Результат = ПараметрыФормыВвода();
	Результат.Заголовок					 = "";
	Результат.ТекстСообщения			 = "";
	Результат.ТекстКнопкиВыполнить		 = "";
	Результат.РежимПароля				 = Ложь;
	Результат.ВозможноПустоеЗначение	 = Истина;
	Результат.Действие					 = "";
	Результат.ИдентификаторЯщика		 = ПараметрыОбработки.ИдентификаторЯщика;
	Результат.ГрупповоеДействие			 = ПараметрыОбработки.ГрупповоеДействие;
	Результат.КатегорияМетрикиДокумента	 = ПараметрыОбработки.КатегорияМетрики;
	Результат.КонтрагентПоддерживаетМЧД	 = ПараметрыОбработки.КонтрагентПоддерживаетМЧД;
	 
	Если НЕ Результат.ГрупповоеДействие 
		И КоличествоДоступныхДокументов = 1 Тогда
		
		Документ							 = ПараметрыОбработки.ДанныеДляОбработки[0];
		Результат.ИдентификаторыДокумента	 = Документ.Идентификаторы;
		
	КонецЕсли;
	
	Если КоличествоДокументов = КоличествоДоступныхДокументов Тогда
		
		Если Действие = "Аннулировать" Тогда
			
			Результат.Заголовок					= "Аннулирование документа";
			Результат.ТекстСообщения			= "По каждому документу будет подписано соответствующее уведомление или соглашение об аннулировании";
			Результат.ТекстКнопкиВыполнить		= "Аннулировать";
			Результат.ВозможноПустоеЗначение	= Ложь;
			Результат.Действие					= "Аннулировать";
			
			Если ПараметрыОбработки.Свойство("ДействиеАннулироватьВложение") Тогда
				Результат.Заголовок					= "Аннулирование приглашений с вложениями";
			КонецЕсли;
			
		Иначе
			
			Результат.Заголовок					= "Отказ в аннулировании";
			Результат.ТекстСообщения			= "Документ сохранит юридическую значимость после отказа в аннулировании";
			Результат.ТекстКнопкиВыполнить		= "Отказать";
			Результат.Действие					= "ОтказатьВАннулировании";
			
		КонецЕсли;
		
	ИначеЕсли КоличествоДокументов > КоличествоДоступныхДокументов
		И Не КоличествоДоступныхДокументов = 0 Тогда
		
		Если Действие = "Аннулировать" Тогда
			
			Результат.Заголовок					= "Аннулирование доступных документов";
			Результат.ТекстСообщения			= "Среди выбранных есть документы, которые уже аннулированы или недоступны для аннулирования. "
												+ "Для аннулирования доступных документов оставьте комментарий в поле ниже";
			Результат.ТекстКнопкиВыполнить		= "Аннулировать доступные документы (" + Формат(КоличествоДоступныхДокументов, "ЧГ=0") + ")";
			Результат.ВозможноПустоеЗначение	= Ложь;
			Результат.Действие					= "Аннулировать";
			
		Иначе
			
			Результат.Заголовок					= "Отказ в аннулировании";
			Результат.ТекстСообщения			= "Среди выбранных есть документы, которые уже аннулированы или недоступны для аннулирования";
			Результат.ТекстКнопкиВыполнить		= "Отказать в аннулировании доступных документов (" + Формат(КоличествоДоступныхДокументов, "ЧГ=0") + ")";
			Результат.Действие					= "ОтказатьВАннулировании";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗавершенияАннулированияОтказаВАннулировании(РезультатАннулирования, ПараметрыОбработки) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(РезультатАннулирования) Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = РезультатАннулирования.Комментарий;
	КонтрактМЧД = РезультатАннулирования.КонтрактМЧД;
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	ИсточникОткрытия	= ПараметрыОбработки.ИсточникОткрытия;
	ОписаниеОповещения	= СвойствоСтруктуры(ПараметрыОбработки, "ОписаниеОповещения");
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		Документ.СлужебнаяИнформация.Вставить("КонтентОтвета", Комментарий);
	КонецЦикла;
	
	Если НЕ ПараметрыОбработки.ГрупповоеДействие Тогда
		// при групповом дейтсвии контракт уже заполнен в документе
		ДополнитьДокументыСведениямиМЧДНаКлиенте(ДанныеДляОбработки, КонтрактМЧД);
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
	
	ОбрабатываютсяДокументыНаОтправку = Ложь;
	
	ВыполнитьМассовуюОбработкуДанных(
		"ОбработатьДокументыСПодписанием",
		ПакетыДокументов,
		Действие,
		Действие,
		ОписаниеОповещения,
		ОбрабатываютсяДокументыНаОтправку
	);
	
	Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(
		КатегорияМетрики,
		ДействиеМетрики,
		ДанныеДляОбработки,
		ИсточникОткрытия
	);
	
КонецПроцедуры

// #КонецОбласти Аннулирование

// #Область МЧД

&НаКлиенте
Функция ТребуетсяМЧД(ИдентификаторЯщика) Экспорт
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ИдентификаторЯщика) Тогда
		Ядро = Модуль_ЯдроНаКлиенте();
		КонтекстСеансаПоЯщику = Ядро.КонтекстСеанса_СтрокаКонтекста(ИдентификаторЯщика);
		Результат = КонтекстСеансаПоЯщику.ТребуетсяМЧД = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает параметры для формы выбора МЧД 
// 
// Параметры:
//    ЗаголовокФормы			 - Строка - .
//    ЗаголовокКнопки			 - Строка - .
//    ИдентификаторЯщика		 - Строка - .
//    ДействиеЭДО				 - Строка - элемент структуры ДействияЭДО().
//    КатегорияМетрикиДокумента	 - Строка - категория метрики документа.
//    КонтрагентПоддерживаетМЧД	 - Булево - Истина если оператор контрагента поддерживает отправку МЧД в роуминге.
// 
// Возвращаемое значение:
//    Структура
//
// BSLLS:NumberOfOptionalParams-off
&НаКлиенте
Функция ПараметрыФормыВыбораМЧД(
	ЗаголовокФормы = "",
	ЗаголовокКнопки = "",
	ИдентификаторЯщика = "",
	ДействиеЭДО = "",
	КатегорияМетрикиДокумента = "",
	КонтрагентПоддерживаетМЧД = Истина) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ЗаголовокФормы"				, ЗаголовокФормы);
	Результат.Вставить("ЗаголовокКнопкиДействия"	, ЗаголовокКнопки);
	Результат.Вставить("ИдентификаторЯщика"			, ИдентификаторЯщика);
	Результат.Вставить("ДействиеЭДО"				, ДействиеЭДО);
	Результат.Вставить("КатегорияМетрикиДокумента"	, КатегорияМетрикиДокумента);
	Результат.Вставить("КонтрагентПоддерживаетМЧД"	, КонтрагентПоддерживаетМЧД);
	Результат.Вставить("ДопПеременныеМетрик", Новый Соответствие);

	Возврат Результат;
	
КонецФункции
// BSLLS:NumberOfOptionalParams-on

// Возвращает праметры для метода проверки МЧД 
// 
// Параметры:
//    ОповещениеЗавершения		 - Структура - описание оповещения выполняемого после проверки МЧД.
//    ИдентификаторЯщика		 - Строка - .
//    ВыбраннаяМЧД				 - Структура - см. Модуль_Ядро.Контракт_МЧД().
//    ДействиеЭДО				 - Строка - элемент структуры ДействияЭДО().
//    ГрупповоеДействие			 - Булево - признак, что выполняется групповое действие.
// 
// Возвращаемое значение:
//    Структура
// 
&НаКлиенте
Функция ПараметрыДляПроверкиМЧД(
	ОповещениеЗавершения,
	ИдентификаторЯщика,
	ВыбраннаяМЧД,
	ДействиеЭДО,
	ГрупповоеДействие = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	Результат.Вставить("ИдентификаторЯщика", ИдентификаторЯщика);
	Результат.Вставить("ВыбраннаяМЧД", ВыбраннаяМЧД);
	Результат.Вставить("ДействиеЭДО", ДействиеЭДО);
	Результат.Вставить("ГрупповоеДействие", ГрупповоеДействие);
	Результат.Вставить("ВызовИзТитулаИлиОтказа", Ложь);
	Результат.Вставить("ОшибкиПроверокМЧД", Новый Массив);
	
	Результат.Вставить("РезультатПроверкиМЧД");
	Результат.Вставить("НазваниеФормыДляМетрики");
	Результат.Вставить("РежимОтображенияДокументов", "");
	
	Результат.Вставить("ОписаниеОповещенияДобавленияМетрики");
	
	Результат.Вставить("ДопПеременныеМетрик", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку переданной мчд и по результатам выводит сообщения пользователю
//
// Параметры:
//    ПараметрыДляПроверкиМЧД	 - Структура - см.ПараметрыДляПроверкиМЧД().
//
&НаКлиенте
Процедура ПроверитьМЧДИВыполнитьОповещение(ПараметрыДляПроверкиМЧД) Экспорт
	
	ТребуетсяМЧД = ТребуетсяМЧД(ПараметрыДляПроверкиМЧД.ИдентификаторЯщика);
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	ВыбраннаяМЧД = ПараметрыДляПроверкиМЧД.ВыбраннаяМЧД;
	ОбработчикПослеПроверкиМЧД = НовыйОписаниеОповещения(
			"ОбработчикПослеПроверкиМЧД",
			ЭтаФорма,
			ПараметрыДляПроверкиМЧД);
	
	Если ТребуетсяМЧД
		И НЕ ЗначениеЗаполнено(ВыбраннаяМЧД) Тогда
		
		ПоказатьВопрос_НеВыбранаМЧД(
			ОбработчикПослеПроверкиМЧД,
			ПараметрыДляПроверкиМЧД);
		
		Возврат;
		
	КонецЕсли;
	
	Если ТребуетсяМЧД Тогда
		
		ПараметрыДляПроверкиМЧД.РезультатПроверкиМЧД = МЧД_БыстраяПроверка(
				ВыбраннаяМЧД,
				ПараметрыДляПроверкиМЧД.ИдентификаторЯщика);
		
		Если ПараметрыДляПроверкиМЧД.РезультатПроверкиМЧД.ЭтоДействующаяМЧД Тогда
			
			ВыполнитьОбработкуОповещенияЛок(
				ОбработчикПослеПроверкиМЧД,
				ДействияНаФормеВопросаМЧД.ДействоватьСМЧД);
			
		ИначеЕсли ПараметрыДляПроверкиМЧД.РезультатПроверкиМЧД.ЭтоПредупреждение Тогда
			
			ПоказатьВопрос_ВыбраннаяМЧДИмеетПредупреждения(
				ОбработчикПослеПроверкиМЧД,
				ПараметрыДляПроверкиМЧД);
			
		Иначе
			
			ПоказатьВопрос_ВыбраннаяМЧДНеПодходит(
				ОбработчикПослеПроверкиМЧД,
				ПараметрыДляПроверкиМЧД);
			
		КонецЕсли;
		
	Иначе
		
		ВыполнитьОбработкуОповещенияЛок(
			ОбработчикПослеПроверкиМЧД,
			ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из ПроверитьМЧДИВыполнитьОповещение()
//
// Параметры:
//    ВыбранноеДействие			 - Строка - см.ДействияНаФормеВопросаМЧД().
//    ПараметрыДляПроверкиМЧД	 - Структура - см.ПараметрыДляПроверкиМЧД().
&НаКлиенте
Процедура ОбработчикПослеПроверкиМЧД(ВыбранноеДействие, ПараметрыДляПроверкиМЧД) Экспорт
	
	Результат = РезультатВыбораМЧД(Ложь, Неопределено);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Метрика_НазваниеКатегории = Ядро.Метрика_НазваниеКатегории();
	Метрика_НазваниеДействий = Ядро.Метрика_НазваниеДействий();
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	НазваниеФормыДляМетрики = ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики;
	ЛейблМетрики = Метрика_НазваниеДействий.НажатиеКнопки;
	ПредставлениеМетрики = Метрика_ЛейблПоНазваниюФормыМЧД(НазваниеФормыДляМетрики);
	ДопПеременные = Метрика_ДополнительныеПеременныеМЧД(ПараметрыДляПроверкиМЧД);
	
	Если ПараметрыДляПроверкиМЧД.ГрупповоеДействие Тогда
		КатегорияМетрики = Метрика_НазваниеКатегории.УведомлениеПриМассовыхДействиях;
	Иначе
		КатегорияМетрики = Метрика_НазваниеКатегории.УведомлениеИзформыПакета;
	КонецЕсли;
	
	Если ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД Тогда
		
		ДействиеМетрики = Метрика_НазваниеДействий.ДействоватьБезДоверенности;
		
		Результат.РазрешитьДействие = Истина;
		
	ИначеЕсли ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ДействоватьСМЧД
		ИЛИ ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ПродолжитьСМЧД Тогда
		
		ДействиеМетрики = Метрика_НазваниеДействий.ДействоватьСДоверенностью;
		
		Результат.РазрешитьДействие = Истина;
		Результат.КонтрактМЧД = ПараметрыДляПроверкиМЧД.ВыбраннаяМЧД;
		
	Иначе
		
		ДействиеМетрики = Метрика_НазваниеДействий.ЗакрытиеФормы;
		
	КонецЕсли;
	
	ИдентификаторТрассировки = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(НазваниеФормыДляМетрики) Тогда
		ИдентификаторТрассировки = Ядро.TraceId();
	КонецЕсли;
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		ЛейблМетрики,
		ПредставлениеМетрики,
		ИдентификаторТрассировки
	);
	Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
		ПараметрыДляПроверкиМЧД.ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		Неопределено,
		ДопПеременные,
		Неопределено
	);
	
	ВыполнитьОбработкуОповещенияЛок(ПараметрыДляПроверкиМЧД.ОповещениеЗавершения, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопрос_НеВыбранаМЧД(Оповещение, ПараметрыДляПроверкиМЧД)
	
	ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики = Метрика_НазванияФормМЧД().НеВыбранаДоверенность;
	
	Метрика_ОткрытиеФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД);
	
	ГрупповоеДействие = ПараметрыДляПроверкиМЧД.ГрупповоеДействие И НЕ ПараметрыДляПроверкиМЧД.ВызовИзТитулаИлиОтказа;
	
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД, ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД);
	Если ГрупповоеДействие Тогда
		КнопкиВопроса.Добавить(
			ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок,
			ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок
		);
	КонецЕсли;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.Закрыть, ДействияНаФормеВопросаМЧД.Закрыть);
	
	ТекстВопроса = 
	"С 1 сентября 2024 года при работе с электронными документами требуется подтверждать полномочия подписанта "
	+ "машиночитаемой доверенностью (МЧД). Если подтверждаете полномочия иным способом, продолжите без МЧД.";
	
	Если ГрупповоеДействие Тогда
		ОписаниеОповещенияОЗавершении = НовыйОписаниеОповещения(
			"ОбработатьРезультатПриГрупповыхДействияхНаФормеВопросаМЧД",
			ЭтаФорма,
			ПараметрыДляПроверкиМЧД
		);
	Иначе
		ОписаниеОповещенияОЗавершении = Оповещение;
	КонецЕсли;
	
	ПоказатьВопросЛок(
		ОписаниеОповещенияОЗавершении,
		ТекстВопроса,
		КнопкиВопроса,
		,
		ДействияНаФормеВопросаМЧД.Закрыть,
		"Не выбрана доверенность"
	);
	
КонецПроцедуры

// BSLLS:MissingReturnedValueDescription-off
// BSLLS:MissingParameterDescription-off
&НаКлиенте
Процедура ПоказатьВопрос_ВыбраннаяМЧДИмеетПредупреждения(Оповещение, ПараметрыДляПроверкиМЧД)
	// BSLLS:MissingReturnedValueDescription-on
	// BSLLS:MissingParameterDescription-on
	ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики = Метрика_НазванияФормМЧД().ВыбраннаяДоверенностьИмеетПредупреждения;
	
	Метрика_ОткрытиеФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД);
	Метрика_ЗаписатьСтатистику_ДоверенностьСПредупреждениями(ПараметрыДляПроверкиМЧД);
	
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.ПродолжитьСМЧД, ДействияНаФормеВопросаМЧД.ПродолжитьСМЧД);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД, ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.Закрыть, ДействияНаФормеВопросаМЧД.Закрыть);
	
	ШаблонВопроса =
		"%1
		|
		|%2 
		|
		|Если хотите выполнить действие с выбранной доверенностью, то продолжите с МЧД. При необходимости выберите другую 
		|доверенность или продолжите действие без МЧД.";
	
	МассивОшибок = Новый Массив;
	Для Каждого ОписаниеОшибки Из ПараметрыДляПроверкиМЧД.РезультатПроверкиМЧД.СписокОшибок Цикл
		РасшифровкаОшибки = "- " + ОписаниеОшибки.Расшифровка;
		МассивОшибок.Добавить(РасшифровкаОшибки);
	КонецЦикла;
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	СписокОшибокСтрокой = Модуль_Ядро.СоединитьСтроку(МассивОшибок, Символы.ПС);
	ПредставлениеМЧД = ПараметрыДляПроверкиМЧД.ВыбраннаяМЧД.ПредставлениеМЧД;
	
	ТекстВопроса = Модуль_Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонВопроса, ПредставлениеМЧД, СписокОшибокСтрокой);
	
	ПоказатьВопросЛок(
		Оповещение,
		ТекстВопроса,
		КнопкиВопроса,
		,
		ДействияНаФормеВопросаМЧД.ПродолжитьСМЧД,
		"Выбранная доверенность с предупреждениями");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопрос_ВыбраннаяМЧДНеПодходит(Оповещение, ПараметрыДляПроверкиМЧД)
	
	ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики = Метрика_НазванияФормМЧД().ВыбраннаяДоверенностьНеПодходит;
	
	Метрика_ОткрытиеФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД);
	
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД, ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.Закрыть, ДействияНаФормеВопросаМЧД.Закрыть);
	
	ШаблонВопроса = 
	"%1
	|
	|%2 
	|
	|Выберите другую доверенность или выпустите новую.";
	
	МассивОшибок = Новый Массив;
	Для каждого ОписаниеОшибки Из ПараметрыДляПроверкиМЧД.РезультатПроверкиМЧД.СписокОшибок Цикл
		РасшифровкаОшибки	 = "- " + ОписаниеОшибки.Расшифровка;
		МассивОшибок.Добавить(РасшифровкаОшибки);
	КонецЦикла;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СписокОшибокСтрокой = Ядро.СоединитьСтроку(МассивОшибок, Символы.ПС);
	ПредставлениеМЧД = ПараметрыДляПроверкиМЧД.ВыбраннаяМЧД.ПредставлениеМЧД;
	ТекстВопроса = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонВопроса, ПредставлениеМЧД, СписокОшибокСтрокой);
	
	ПоказатьВопросЛок(
		Оповещение,
		ТекстВопроса,
		КнопкиВопроса,
		,
		ДействияНаФормеВопросаМЧД.Закрыть,
		"Выбранная доверенность не подходит"
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопрос_НетПодходящейДоверенности(ПараметрыДляПроверкиМЧД, ОбработчикВопроса) Экспорт
	
	ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики = Метрика_НазванияФормМЧД().НетПодходящихДовереностей;
	
	Метрика_ОткрытиеФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД);
	
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД	, ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок, ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.Закрыть			, ДействияНаФормеВопросаМЧД.Закрыть);
	
	ТекстВопроса =
	"С 1 сентября 2024 года при работе с электронными документами требуется подтверждать полномочия подписанта "
	+ "машиночитаемой доверенностью (МЧД).
	|
	|При выполнении действия с доверенностями произошли ошибки. Перейдите по кнопке ""Подробнее"" для просмотра причин";
	
	ПоказатьВопросЛок(
		ОбработчикВопроса,
		ТекстВопроса,
		КнопкиВопроса,
		,
		ДействияНаФормеВопросаМЧД.Закрыть,
		"Нет подходящих доверенностей"
	);
	
КонецПроцедуры

// BSLLS:MissingReturnedValueDescription-off
// BSLLS:MissingParameterDescription-off
&НаСервере
Функция МЧД_БыстраяПроверка(Знач ВыбраннаяМЧД, Знач ИдентификаторЯщика)
	// BSLLS:MissingReturnedValueDescription-on
	// BSLLS:MissingParameterDescription-on
	Модуль_Ядро = Модуль_Ядро();
	
	Результат = Модуль_Ядро.МЧД_БыстраяПроверка(ВыбраннаяМЧД, ИдентификаторЯщика);
	
	Возврат Результат;
	
КонецФункции

// Открывает форму выбора МЧД 
// 
// Параметры:
//    ОписаниеОбработчикаЗакрытия.
//    ПараметрыОткрытияФормы		 - Структура - см. ПараметрыФормыВыбораМЧД().
// 
&НаКлиенте
Процедура ОткрытьФормуВыбораДоверенности(ОписаниеОбработчикаЗакрытия, ПараметрыОткрытияФормы) Экспорт
	
	ОткрытьФормуДиадокМодальноЛок(
		"МЧД_ФормаВыбораУправляемая",
		ОписаниеОбработчикаЗакрытия.Модуль,
		ПараметрыОткрытияФормы,
		ОписаниеОбработчикаЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Функция РезультатВыбораМЧД(РазрешитьДействие, КонтрактМЧД) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РазрешитьДействие", РазрешитьДействие);
	Результат.Вставить("КонтрактМЧД", КонтрактМЧД);
	
	Возврат Результат;
	
КонецФункции

// см. ДополнитьДокументыСведениямиМЧДКлиентСервер()
// 
&НаКлиенте
Процедура ДополнитьДокументыСведениямиМЧДНаКлиенте(КонтрактыДокументов, КонтрактМЧД) Экспорт
	
	Для Каждого Документ Из КонтрактыДокументов Цикл	
		ДополнитьДокументСведениямиМЧДКлиентСервер(Документ, КонтрактМЧД);
	КонецЦикла;
	
КонецПроцедуры

// Дополняет служебную информацию переданных документов КонтрактомМЧД 
// 
// Параметры:
//    Документ		 - Структура - ДокументДД, см. Модуль_Ядро.Контракт_Документ().
//    КонтрактМЧД	 - Структура - см. Модуль_Ядро.Контракт_МЧД().
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ДополнитьДокументСведениямиМЧДКлиентСервер(Документ, КонтрактМЧД)
	
	Если НЕ Документ.СлужебнаяИнформация.Свойство("КонтрактМЧД") Тогда
		Документ.СлужебнаяИнформация.Вставить("КонтрактМЧД", КонтрактМЧД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МЧД_ПоказатьСведенияОДоверенности(КонтрактМЧД, ФормаВызова) Экспорт
	
	СведенияОМЧД = МЧД_ПредставлениеСведенийОДоверенностиНаСервере_HTML(КонтрактМЧД);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ЗаголовокФормы", НСтр("ru='Данные МЧД'"));	
	ПараметрыОткрытияФормы.Вставить("ТекстСообщения", СведенияОМЧД.ТекстHTML);
	ПараметрыОткрытияФормы.Вставить("ТекстДляКопирования", СведенияОМЧД.Текст);
	ПараметрыОткрытияФормы.Вставить("ПоказатьКнопкуСкопировать"	, Истина);
	
	ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ФормаВызова,
		ПараметрыОткрытияФормы,
		Неопределено,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаСервере
Функция МЧД_ПредставлениеСведенийОДоверенностиНаСервере_HTML(КонтрактМЧД)
	
	Результат = ОбработкаОбъект().МЧД_ПредставлениеСведенийОДоверенности_HTML(КонтрактМЧД);
	Возврат Результат;
	
КонецФункции

// Обрабатывает нажатие гиперссылки на скачивание файлов доверенности в формах пакета и сообщения HTML
//
// Параметры:
//  ПараметрыСкачиванияФайловМЧД - Строка - см. Ядро.Новый_ПараметрыГиперссылкиСкачатьФайлыДоверенности()
//
&НаКлиенте
Процедура ОбработатьНажатиеГиперссылкиСкачатьФайлыМЧД(ПараметрыСкачиванияФайловМЧД) Экспорт
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ОкончаниеВыбораКаталогаПриНажатииСкачатьФайлыДоверенности", ЭтаФорма, ПараметрыСкачиванияФайловМЧД);
	ПоказатьДиалогВыбораКаталога(ОписаниеОповещения, НСтр("ru = 'Сохранение файлов доверенности на диск'"));
	
КонецПроцедуры

// Открывает форму ввода СНИЛС
//  ОповещениеОЗавершении содержит описание процедуры, которая будет вызвана после закрытия окна ввода значения
//  со следующими параметрами:
//  РезультатВводаСНИЛС_OID - Неопределено, Структура - см. РезультатВводаСНИЛС_OID результат ввода СНИЛС/OID
//  ДополнительныеПараметры - Произвольный - значение, которое было указано при создании объекта ОписаниеОповещения.
//
// Параметры:
//  ОповещениеОЗавершении	 - ОписаниеОповещения	 - оповещение, вызываемое после ввода СНИЛС/OID
//  ПараметрыОткрытияФормы	 - Структура			 - см. ПараметрыФормыВводаСНИЛС_OID переметры
//
&НаКлиенте
Процедура ОткрытьФормуВводаСНИЛС_OID(ОповещениеОЗавершении, ПараметрыОткрытияФормы) Экспорт
	
	ОткрытьФормуДиадокМодальноЛок("Госключ_ФормаВводаСНИЛСOIDУправляемая", ЭтаФорма,
		ПараметрыОткрытияФормы, ОповещениеОЗавершении);
	
КонецПроцедуры

// Возвращает параметры для формы ожидания подписания Госключ
//
// Параметры:
//  ИдентификаторЗадания	 - Строка		 - Идентификатор задания
//  ИдентификаторЯщика		 - Строка		 - Идентификатор ящика
// 
// Возвращаемое значение:
//  Структура - параметры формы ожидания подписания Госключ
//
&НаКлиенте
Функция ПараметрыФормыПодписанияГосключ(ИдентификаторЗадания, ИдентификаторЯщика) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЗадания"	, ИдентификаторЗадания);
	Результат.Вставить("ИдентификаторЯщика"		, ИдентификаторЯщика);

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыФормыВводаСНИЛС_OID(ИдентификаторЯщика) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЯщика"		, ИдентификаторЯщика);

	Возврат Результат;
	
КонецФункции

// Открывает форму ожидания подписания Госключ
//  ОповещениеОЗавершении содержит описание процедуры, которая будет вызвана после закрытия окна ожидания
//  со следующими параметрами:
//  РезультатПодписанияГосключ - Неопределено, Структура - см. РезультатПодписанияГосключ результат подписания Госключ
//  ДополнительныеПараметры - Произвольный - значение, которое было указано при создании объекта ОписаниеОповещения.
//
// Параметры:
//  ОповещениеОЗавершении	 - ОписаниеОповещения	 - Оповещение, вызываемое при окончании подписания
//  ПараметрыОткрытияФормы	 - Структура			 - см. ПараметрыФормыПодписанияГосключ()
//
&НаКлиенте
Процедура ОткрытьФормуОжиданияПодписанияГосключ(ОповещениеОЗавершении, ПараметрыОткрытияФормы) Экспорт
	
	ОткрытьФормуДиадокМодальноЛок("Госключ_ФормаОжиданияПодписанияУправляемая", ЭтаФорма,
		ПараметрыОткрытияФормы, ОповещениеОЗавершении);
	
КонецПроцедуры

// Возвращает праметры для метода проверки СНИЛС
//
// Параметры:
//  ВведенныйСНИЛС		 - Строка	 - Веденный СНИЛС
//  ВведенныйOID		 - Строка	 - Веденный OID
// 
// Возвращаемое значение:
//  Структура - Параметры для проверки СНИЛС/OID
//
&НаКлиенте
Функция ПараметрыДляПроверкиСНИЛС_OID(ВведенныйСНИЛС, ВведенныйOID) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВведенныйСНИЛС", ВведенныйСНИЛС);
	Результат.Вставить("ВведенныйOID", ВведенныйOID);
	
	Результат.Вставить("СНИЛСВалиден", Ложь);
	Результат.Вставить("OIDВалиден", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ВыбранныйСпособПодписанияГосключ() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("СНИЛС", "СНИЛС");
	Результат.Вставить("OID", "OID");
	
	Возврат Результат;
КонецФункции

// Выполняет проверку введенного СНИЛС/OID, по результатам выводит сообщения пользователю
//
// Параметры:
//  ПараметрыДляПроверкиСНИЛС_OID	 - Структура - см. ПараметрыДляПроверкиСНИЛС_OID().
// 
// Возвращаемое значение:
//  Структура - см. РезультатВводаСНИЛС_OID()
//
&НаКлиенте
Функция ПроверитьСНИЛС_OID(ПараметрыДляПроверкиСНИЛС_OID) Экспорт
	
	ВведенныйСНИЛС = ПараметрыДляПроверкиСНИЛС_OID.ВведенныйСНИЛС;
	ВведенныйOID = ПараметрыДляПроверкиСНИЛС_OID.ВведенныйOID;
	
	РезультатВводаСНИЛС_OID = РезультатВводаСНИЛС_OID();
	
	Если Не ЗначениеЗаполнено(ВведенныйСНИЛС)
		И Не ЗначениеЗаполнено(ВведенныйOID) Тогда
		
		РезультатВводаСНИЛС_OID.ПодробноеОписаниеСтатуса = НСтр("ru = 'СНИЛС/OID не введен'");
		
	Иначе
		ПараметрыДляПроверкиСНИЛС_OID.СНИЛСВалиден = ЭтоВалидныйСНИЛС(ВведенныйСНИЛС);
		ПараметрыДляПроверкиСНИЛС_OID.OIDВалиден = ЭтоВалидныйOID(ВведенныйOID);
		
		Если ПараметрыДляПроверкиСНИЛС_OID.СНИЛСВалиден Тогда
		
			РезультатВводаСНИЛС_OID.РазрешитьДействие = Истина;
			РезультатВводаСНИЛС_OID.ВведенныйСНИЛС = ВведенныйСНИЛС;
			РезультатВводаСНИЛС_OID.ВыбранноеДействие = Перечисление_ВыбранныйСпособПодписанияГосключ().СНИЛС;
			
		ИначеЕсли ПараметрыДляПроверкиСНИЛС_OID.OIDВалиден Тогда
			
			РезультатВводаСНИЛС_OID.РазрешитьДействие = Истина;
			РезультатВводаСНИЛС_OID.ВведенныйOID = ВведенныйOID;
			РезультатВводаСНИЛС_OID.ВыбранноеДействие = Перечисление_ВыбранныйСпособПодписанияГосключ().OID;
			
		Иначе
			
			РезультатВводаСНИЛС_OID.ПодробноеОписаниеСтатуса = НСтр("ru = 'Введен ошибочный СНИЛС/OID'");
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВводаСНИЛС_OID;
	
КонецФункции

&НаКлиенте
Функция РезультатВводаСНИЛС_OID() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РазрешитьДействие", Ложь);
	Результат.Вставить("ВведенныйСНИЛС", Неопределено);
	Результат.Вставить("ВведенныйOID", Неопределено);
	Результат.Вставить("ВыбранноеДействие", Неопределено);
	Результат.Вставить("ПодробноеОписаниеСтатуса", "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_СтатусыПодписанияГосключ() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("УспешноеПодписание", "УспешноеПодписание");
	Результат.Вставить("ОшибкаПодписания", "ОшибкаПодписания");
	Результат.Вставить("ОтказПользователя", "ОтказПользователя");
	Результат.Вставить("ПревышеноВремяОжидания", "ПревышеноВремяОжидания");
	Результат.Вставить("Ожидание", "Ожидание");
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция РезультатПодписанияГосключ() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РазрешитьДействие", Ложь);
	Результат.Вставить("ОшибкаПриПодписании", Ложь);
	Результат.Вставить("СтатусПодписания", Перечисление_СтатусыПодписанияГосключ().Ожидание);
	Результат.Вставить("РезультатПодписания", Неопределено);
	Результат.Вставить("ПодробноеОписаниеСтатуса", "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаданиеОтправкиНаПодписьГосключ(ИдентификаторЗадания, ИдентификаторЯщика) Экспорт
	
	РезультатПодписанияГосключ = РезультатПодписанияГосключ();
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	
	РезультатПодписания = ЯдроНаКлиенте.Госключ_ПроверитьЗаданиеОтправкиНаПодпись(ИдентификаторЗадания,
		ИдентификаторЯщика);

	ПодробноеОписаниеСтатуса = РезультатПодписания.ПодробноеОписаниеСтатуса;
	
	РезультатПодписанияГосключ.ПодробноеОписаниеСтатуса = ПодробноеОписаниеСтатуса;
	
	Если РезультатПодписания.Завершено Тогда
		РезультатПодписанияГосключ.РазрешитьДействие = Истина;
		РезультатПодписанияГосключ.ОшибкаПриПодписании = РезультатПодписания.ОшибкаПриПодписании;
		РезультатПодписанияГосключ.РезультатПодписания = РезультатПодписания;
		
		Если РезультатПодписанияГосключ.ОшибкаПриПодписании Тогда
			Если РезультатПодписания.ОтказПользователя Тогда
				РезультатПодписанияГосключ.СтатусПодписания = Перечисление_СтатусыПодписанияГосключ().ОтказПользователя;
			Иначе
				РезультатПодписанияГосключ.СтатусПодписания = Перечисление_СтатусыПодписанияГосключ().ОшибкаПодписания;
			КонецЕсли;
		Иначе
			РезультатПодписанияГосключ.СтатусПодписания = Перечисление_СтатусыПодписанияГосключ().УспешноеПодписание;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПодписанияГосключ;
	
КонецФункции

// Проверяет валидность СНИЛС по контрольному числу
//
// Параметры:
//  ВведенныйСНИЛС	 - Строка	 - формата "XXXX-XXXX-XXX YY"
// 
// Возвращаемое значение:
//  Булево - Истина, если СНИЛС валиден
//
&НаКлиенте
Функция ЭтоВалидныйСНИЛС(Знач ВведенныйСНИЛС)
	// BSLLS:MagicNumber-off
	
	// https://info.gosuslugi.ru/articles/%D0%92%D0%B0%D0%BB%D0%B8%D0%B4%D0%B0%D1%86%D0%B8%D1%8F/
	
	СНИЛС = ВведенныйСНИЛС;
	СНИЛС = СтрЗаменить(СНИЛС, "-", "");
	СНИЛС = СтрЗаменить(СНИЛС, " ", "");
	
	Если СтрДлина(СНИЛС) <> 11
		Или Не Модуль_СтдСтрНаКлиенте().ТолькоЦифрыВСтрокеЛок(СНИЛС) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КонтрольноеЧисло = 0;
	
	Для Инд = 1 По 9 Цикл
		
		ПроверяемыйРазряд = Сред(СНИЛС, 10 - Инд, 1);
		ПроверяемыйРазрядЧислом = Число(ПроверяемыйРазряд);
		
		КонтрольноеЧисло = КонтрольноеЧисло + ПроверяемыйРазрядЧислом * Инд;
		
	КонецЦикла;
	
	КонтрольноеЧислоСтрокой = "";
	
	Если КонтрольноеЧисло > 100 Тогда
		КонтрольноеЧисло = КонтрольноеЧисло % 101;
	КонецЕсли;
	
	Если КонтрольноеЧисло < 100 Тогда
		КонтрольноеЧислоСтрокой = Формат(КонтрольноеЧисло, "ЧЦ=2; ЧВН=; ЧГ=");
	Иначе
		// тут должно остаться только КонтрольноеЧисло = 100
		КонтрольноеЧислоСтрокой = "00";
	КонецЕсли;
	
	КонтрольноеЧислоВведенное = Сред(СНИЛС, 10, 2);
	
	Возврат КонтрольноеЧислоВведенное = КонтрольноеЧислоСтрокой;
	
	// BSLLS:MagicNumber-on
КонецФункции

// Проверяет валидность OID
// пока просто на заполненность
//
// Параметры:
//  ВведенныйOID	 - Строка	 - OID на проверку
// 
// Возвращаемое значение:
//  Булево - Истина, если OID валиден
//
&НаКлиенте
Функция ЭтоВалидныйOID(Знач ВведенныйOID)
	
	Если ПустаяСтрока(ВведенныйOID) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОкончаниеВыбораКаталогаПриНажатииСкачатьФайлыДоверенности(ВыбранныйКаталог, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйКаталог) Тогда
		Возврат;
	КонецЕсли;
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	ПредставлениеТекущегоДокумента = ДополнительныеПараметры.ПредставлениеТекущегоДокумента;
	ПрефиксКаталога = "МЧД к ";
	ИмяКаталога = ЗаменитьНедопустимыеСимволыИмениФайла(ПрефиксКаталога + ПредставлениеТекущегоДокумента);
	ПолноеИмяКаталога = Модуль_Ядро.ОбъединитьПути(ВыбранныйКаталог[0], ИмяКаталога);
	
	СоздатьКаталог(ПолноеИмяКаталога);
	
	ФайлыДоверенности = Модуль_Ядро.Документы_СобытияМЧД_ФайлыДоверенности(ДополнительныеПараметры.ПараметрыГиперссылки);
	
	СохранитьФайлыДоверенностиНаДиск(ФайлыДоверенности, ПолноеИмяКаталога);
	
	Если ФайлыДоверенности.ДанныеФайловДелегированныхМЧД.Количество() > 0 Тогда
		
		ПрефиксКаталогаДелегированныхМЧД = "Передоверие ";
		ИмяКаталогаДелегированныхМЧД = ЗаменитьНедопустимыеСимволыИмениФайла(ПрефиксКаталогаДелегированныхМЧД + ФайлыДоверенности.ИмяФайла);
		ПолноеИмяКаталогаДелегированныхМЧД = Модуль_Ядро.ОбъединитьПути(ПолноеИмяКаталога, ИмяКаталогаДелегированныхМЧД);
		
		СоздатьКаталог(ПолноеИмяКаталогаДелегированныхМЧД);
		
		Для Каждого ДанныеФайловДелегированнойМЧД Из ФайлыДоверенности.ДанныеФайловДелегированныхМЧД Цикл
			СохранитьФайлыДоверенностиНаДиск(ДанныеФайловДелегированнойМЧД, ПолноеИмяКаталогаДелегированныхМЧД);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеСкачатьФайлЭлектроннойПодписи(ДанныеЭлектроннойПодписи) Экспорт
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
		"ОкончаниеВыбораКаталогаПриНажатииСкачатьФайлЭлектроннойПодписи",
		ЭтаФорма,
		ДанныеЭлектроннойПодписи
	);
	
	ПоказатьДиалогВыбораКаталога(ОписаниеОповещения, НСтр("ru = 'Сохранение файла электронной подписи'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораКаталогаПриНажатииСкачатьФайлЭлектроннойПодписи(
	ВыбранныйКаталог,
	ДанныеЭлектроннойПодписи) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйКаталог) Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяКаталога = ВыбранныйКаталог[0];
	// BSLLS:UsingSynchronousCalls-off
	СоздатьКаталог(ПолноеИмяКаталога);
	// BSLLS:UsingSynchronousCalls-on
	ДанныеПодписи = ДанныеЭлектроннойПодписи.ДанныеПодписи;
	ИмяФайлаПодписи = ДанныеЭлектроннойПодписи.ИмяФайлаПодписи;
	ДвоичныеДанныеПодписи = Base64Значение(ДанныеПодписи);
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_СохранитьДвоичныеДанныеВФайл(
		ДвоичныеДанныеПодписи,
		ИмяФайлаПодписи,
		ПолноеИмяКаталога
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеСкачатьФайлСертификата(ДанныеЭлектроннойПодписи) Экспорт
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
		"ОкончаниеВыбораКаталогаПриНажатииСкачатьФайлСертификата",
		ЭтаФорма,
		ДанныеЭлектроннойПодписи
	);
	
	ПоказатьДиалогВыбораКаталога(ОписаниеОповещения, НСтр("ru = 'Сохранение файла электронной подписи'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораКаталогаПриНажатииСкачатьФайлСертификата(
	ВыбранныйКаталог,
	ДанныеЭлектроннойПодписи) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйКаталог) Тогда
		Возврат;
	КонецЕсли;
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	ПолноеИмяКаталога = ВыбранныйКаталог[0];
	// BSLLS:UsingSynchronousCalls-off
	СоздатьКаталог(ПолноеИмяКаталога);
	// BSLLS:UsingSynchronousCalls-on
	ДанныеПодписи = ДанныеЭлектроннойПодписи.ДанныеПодписи;
	ДвоичныеДанныеПодписи = Base64Значение(ДанныеПодписи);
	ДанныеСертификата = Модуль_Ядро.ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи);
	ИмяФайлаСертификата = ДанныеСертификата.СерийныйНомер + ".crt";
	
	ИнтерфейсСМВ = Модуль_СинхронноМодальныеВызовы();
	ИнтерфейсСМВ.смв_СохранитьДвоичныеДанныеВФайл(
		ДанныеСертификата.ДвоичныеДанные,
		ИмяФайлаСертификата,
		ПолноеИмяКаталога
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыДоверенностиНаДиск(ФайлыДоверенности, ПолноеИмяКаталога)
	
	ДанныеДоверенности = ФайлыДоверенности.Данные;
	ДанныеПодписи = ФайлыДоверенности.Подпись.ДанныеПодписи;
	
	ИмяФайлаДоверенности = ФайлыДоверенности.ИмяФайла + ".xml";
	ИмяФайлаПодписи	 = ФайлыДоверенности.ИмяФайла + ".sig";
	
	Модуль_смв = Модуль_СинхронноМодальныеВызовы();
	
	Модуль_смв.смв_СохранитьДвоичныеДанныеВФайл(ДанныеДоверенности, ИмяФайлаДоверенности, ПолноеИмяКаталога);
	Модуль_смв.смв_СохранитьДвоичныеДанныеВФайл(ДанныеПодписи, ИмяФайлаПодписи, ПолноеИмяКаталога);
	
КонецПроцедуры

// Для переданных данных групповой операции выполняет проверку сертификатов на КЭП.
//
// Параметры:
//	ДанныеДляОбработки - Массив - см. Новый_ПараметрыГрупповойОбработки().ДанныеДляОбработки
//	ДействиеЭДО - Строка - значение перечисления Перечисление_ДействияЭДО()
//
// Возвращаемое значение:
//  Структура
//		* ОшибкиПроверки				 - Массив- Список ошибок проверки. См Ядро.Новый_ОписаниеОшибкиПроверкиКЭП() 
//		* ДанныеДляОбработкиБезОшибок	 - Массив- ДанныеДляОбработки без ошибок КЭП 
//
&НаСервере
Функция КЭП_ПроверитьДанныеГрупповойОперацииНаСервере(ДанныеДляОбработки, ДействиеЭДО) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОшибкиПроверки", Новый Массив);
	Результат.Вставить("ДанныеДляОбработкиБезОшибок", Новый Массив);
	
	Модуль_Ядро = Модуль_Ядро();
	
	СгруппированныеДанные = СгруппироватьДанныеДляОбработкиПоИдентификаторуЯщика(ДанныеДляОбработки);
	
	Для каждого КлючЗначение Из СгруппированныеДанные Цикл
		
		BoxID = КлючЗначение.Ключ;
		
		ОписаниеОшибкиПроверкиКЭП = Модуль_Ядро.КЭП_ДоступноДействиеЭДО(ДействиеЭДО, BoxID);
		Если ЗначениеЗаполнено(ОписаниеОшибкиПроверкиКЭП) Тогда
			
			СгруппированныеДанные.Вставить(BoxId, Новый Массив);
			Модуль_Ядро.ДополнитьМассив(Результат.ОшибкиПроверки, ОписаниеОшибкиПроверкиКЭП);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ДанныеПоBoxID Из СгруппированныеДанные Цикл
		Модуль_Ядро.ДополнитьМассив(Результат.ДанныеДляОбработкиБезОшибок, ДанныеПоBoxID.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СгруппироватьДанныеДляОбработкиПоИдентификаторуЯщика(ДанныеДляОбработки)
	
	Модуль_Ядро = Модуль_Ядро();
	Результат = Новый Соответствие;
	
	Если ЕстьСвойствоИдентификаторыВОбрабатываемыхДанных(ДанныеДляОбработки) Тогда
		
		Для каждого Документ Из ДанныеДляОбработки Цикл
			
			BoxId = Документ.Идентификаторы.BoxId;
			
			Если Модуль_Ядро.ЭтоАдресЯщика(BoxId) Тогда
				BoxId = Модуль_Ядро.АдресЯщикаВИдентификатор(BoxId);
			КонецЕсли;
			
			ДанныеПоBoxId = Результат.Получить(BoxId);
			
			Если ДанныеПоBoxId = Неопределено Тогда
				Результат.Вставить(BoxId, Новый Массив);
				ДанныеПоBoxId = Результат.Получить(BoxId);
			КонецЕсли;
			
			ДанныеПоBoxId.Добавить(Документ);
			
		КонецЦикла;
		
	Иначе
		
		Организации1С = Новый Массив;
		Для Каждого СтрокаСписка Из ДанныеДляОбработки Цикл
			Организация = СтрокаСписка.Организация;
			Если Организации1С.Найти(Организация) = Неопределено Тогда
				Организации1С.Добавить(Организация);
			КонецЕсли;
		КонецЦикла;
		
		УчастникиДО = Модуль_Ядро.Организации_ДанныеУчастниковДОПоОрганизациям1С(Организации1С);
		
		Для каждого УчастникДО Из УчастникиДО Цикл
			
			BoxId = УчастникДО.BoxId;
			ПараметрыОтбора = Новый Структура("Организация", УчастникДО.Организация);
			ДокументыПоОрганизации = Модуль_Ядро.МассивСтруктур_НайтиСтроки(ДанныеДляОбработки, ПараметрыОтбора);
			Результат.Вставить(BoxId, ДокументыПоОрганизации);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьСвойствоИдентификаторыВОбрабатываемыхДанных(ДанныеДляОбработки)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеДляОбработки) Тогда
		
		ЭлементКоллекцииДанных = ДанныеДляОбработки[0];
		
		Если ТипЗнч(ЭлементКоллекцииДанных) = Тип("Структура")
			И ЭлементКоллекцииДанных.Свойство("Идентификаторы")
			И ЭлементКоллекцииДанных.Идентификаторы <> Неопределено Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьИПроверитьМЧДпоУмолчаниюПередОтправкойДокументов(ДанныеДляОбработки) Экспорт
	
	ДокументыБезМЧД = Новый Массив;
	Для каждого Документ Из ДанныеДляОбработки Цикл
		Если НЕ Документ.СлужебнаяИнформация.Свойство("КонтрактМЧД") Тогда
			ДокументыБезМЧД.Добавить(Документ);
		КонецЕсли;
	КонецЦикла;
	
	СписокОшибок = Новый Массив;
	
	Модуль_Ядро = Модуль_Ядро();
	
	СгруппированныеДанные = СгруппироватьДанныеДляОбработкиПоИдентификаторуЯщика(ДокументыБезМЧД);
	ИдентификаторыЯщиков = Модуль_Ядро.ВыгрузитьКолонку(СгруппированныеДанные, "Ключ", Истина);
	
	КонтрактыМЧД = ПолучитьДействующиеМЧДпоУмолчанию(ИдентификаторыЯщиков, СписокОшибок);
	
	Для Каждого ИдентификаторЯщика Из ИдентификаторыЯщиков Цикл
		
		КонтрактМЧД = КонтрактыМЧД.Получить(ИдентификаторЯщика);
		
		ДокументыПоИдентификатору = СгруппированныеДанные.Получить(ИдентификаторЯщика);
		Для Каждого Документ Из ДокументыПоИдентификатору Цикл
			ДополнитьДокументСведениямиМЧДКлиентСервер(Документ, КонтрактМЧД);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СписокОшибок;
	
КонецФункции

&НаСервере
Функция ПолучитьДействующиеМЧДпоУмолчанию(ИдентификаторыЯщиков, СписокОшибок) Экспорт
	
	Результат = Новый Соответствие;
	
	Модуль_Ядро = Модуль_Ядро();
	
	КонекстыДанныхМЧД = Модуль_Ядро.МЧД_ДанныеПоИспользованиюДоверенностейПоСпискуBoxId(ИдентификаторыЯщиков);
	РазделыОшибок = Модуль_Ядро.МЧД_РазделыОшибокПроверкиМЧД();
	Метрика_ВидыОшибокПроверокМЧД = Метрика_ВидыОшибокПроверокМЧД();
	
	Для Каждого ИдентификаторЯщика Из ИдентификаторыЯщиков Цикл
		
		КонтекстМЧД = КонекстыДанныхМЧД.Получить(ИдентификаторЯщика);
		
		Если НЕ КонтекстМЧД.ТребуетсяМЧД Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрактМЧД = Неопределено;
		
		Если ЗначениеЗаполнено(КонтекстМЧД.МЧД) Тогда
			
			КонтрактМЧД = КонтекстМЧД.СписокМЧД.Получить(КонтекстМЧД.МЧД);
			
			РезультатПроверкиМЧД = КонтекстМЧД.РезультатПроверкиМЧД;
			Если НЕ РезультатПроверкиМЧД.ЭтоДействующаяМЧД 
				И НЕ РезультатПроверкиМЧД.ЭтоПредупреждение Тогда
				
				НаименованиеОрганизации = Модуль_Ядро.КонтекстСеанса_Прочитать(ИдентификаторЯщика, "ОрганизацияНаименование");
				
				ТекстОшибки = Модуль_Ядро.Общее_ПодставитьПараметрыВСтроку(
					"Для организации ""%1"" доверенность ""%2"" не прошла проверку",
					НаименованиеОрганизации,
					КонтрактМЧД.Представитель.Наименование
				);
				
				ОписаниеОшибки = Новый_ОписаниеОшибкиПроверкиМЧДпоУмолчанию(
					РазделыОшибок.МЧДнеПодходит,
					ТекстОшибки,
					РезультатПроверкиМЧД.СписокОшибок,
					Метрика_ВидыОшибокПроверокМЧД.ДоверенностьНеПодходит,
					ИдентификаторЯщика
				);
				
				СписокОшибок.Добавить(ОписаниеОшибки);
				
				КонтрактМЧД = Неопределено;
				
			КонецЕсли;
			
		Иначе
			
			НаименованиеОрганизации = Модуль_Ядро.КонтекстСеанса_Прочитать(ИдентификаторЯщика, "ОрганизацияНаименование");
			
			ОписаниеОшибки = Новый_ОписаниеОшибкиПроверкиМЧДпоУмолчанию(
				РазделыОшибок.НетМЧДПоУмолчанию,
				НаименованиеОрганизации,
				Новый Массив,
				Метрика_ВидыОшибокПроверокМЧД.НеУказанаДоверенность,
				ИдентификаторЯщика
			);
			
			СписокОшибок.Добавить(ОписаниеОшибки);
			
		КонецЕсли;
		
		Результат.Вставить(ИдентификаторЯщика, КонтрактМЧД);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МЧД_ПоказатьСведенияОПолномочияхДоверенности(КонтрактМЧД, ФормаВызова) Экспорт
	
	СведенияОМЧД = МЧД_ПредставлениеПолномочийСервер_HTML(КонтрактМЧД);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ЗаголовокФормы", НСтр("ru='Сведения о полномочиях'"));
	ПараметрыОткрытияФормы.Вставить("ТекстСообщения", СведенияОМЧД.ТекстHTML);
	ПараметрыОткрытияФормы.Вставить("ТекстДляКопирования", СведенияОМЧД.Текст);
	ПараметрыОткрытияФормы.Вставить("ПоказатьКнопкуСкопировать"	, Истина);
	
	ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ФормаВызова,
		ПараметрыОткрытияФормы
	);
	
КонецПроцедуры

&НаСервере
Функция МЧД_ПредставлениеПолномочийСервер_HTML(КонтрактМЧД)
	
	Результат = ОбработкаОбъект().МЧД_ПредставлениеПолномочий_HTML(КонтрактМЧД);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МЧД_ПоказатьЦепочкуПередоверия(ДанныеМЧД, ПредставлениеТекущегоДокумента, ФормаВызова) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДанныеМЧД", ДанныеМЧД);
	ПараметрыОткрытияФормы.Вставить("Режим", "ПередовериеМЧД");
	ПараметрыОткрытияФормы.Вставить("ПредставлениеТекущегоДокумента", ПредставлениеТекущегоДокумента);
	
	ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ФормаВызова,
		ПараметрыОткрытияФормы
	);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Новый_ОписаниеОшибкиПроверкиМЧДпоУмолчанию(
	Раздел,
	РасшифровкаСтатуса,
	СписокОшибок,
	Метрика_ВидОшибкиПроверкиМЧД,
	ИдентификаторЯщика)
	
	Результат = Новый Структура;
	Результат.Вставить("Раздел", Раздел);
	Результат.Вставить("РасшифровкаСтатуса", РасшифровкаСтатуса);
	Результат.Вставить("СписокОшибок", СписокОшибок);
	Результат.Вставить("Метрика_ВидОшибкиПроверкиМЧД", Метрика_ВидОшибкиПроверкиМЧД);
	Результат.Вставить("ИдентификаторЯщика", ИдентификаторЯщика);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ВидыОшибокПроверокМЧД()
	
	Результат = Новый Структура; 
	Результат.Вставить("НеУказанаДоверенность", "НеУказанаДоверенность");
	Результат.Вставить("ДоверенностьНеПодходит", "ДоверенностьНеПодходит");
	Результат.Вставить("ОператорНеПоддерживаетМЧДВРоуминге", "ОператорНеПоддерживаетМЧДВРоуминге");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДействияНаФормеВопросаМЧД() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПродолжитьБезМЧД", "Продолжить без МЧД");
	Результат.Вставить("ДействоватьСМЧД", "Действовать с МЧД");
	Результат.Вставить("ПродолжитьСМЧД", "Продолжить с МЧД");
	Результат.Вставить("ОткрытьСписокОшибок", "Подробнее");
	Результат.Вставить("Закрыть", "Закрыть");
	Результат.Вставить("Продолжить", "Продолжить");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_НазванияФормМЧД() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НеВыбранаДоверенность", "НеВыбранаДоверенность");
	Результат.Вставить("ВыбраннаяДоверенностьНеПодходит", "ВыбраннаяДоверенностьНеПодходит");
	Результат.Вставить("ВыбраннаяДоверенностьИмеетПредупреждения", "ВыбраннаяДоверенностьИмеетПредупреждения");
	Результат.Вставить("ОписаниеОшибокСМЧД", "ОписаниеОшибокСМЧД");
	Результат.Вставить("НетПодходящихДовереностей", "НетПодходящихДовереностей");
	Результат.Вставить("ПоддержкаОператоромМЧД", "ПоддержкаОператоромМЧД");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_ЛейблПоНазваниюФормыМЧД(НазваниеФормы) Экспорт
	
	НазванияФормМЧД = Метрика_НазванияФормМЧД();
	
	Результат = "";
	
	Если НазваниеФормы = НазванияФормМЧД.НеВыбранаДоверенность Тогда
		Результат = "Не выбрана доверенность";
	ИначеЕсли НазваниеФормы = НазванияФормМЧД.ВыбраннаяДоверенностьНеПодходит Тогда
		Результат = "Выбранная доверенность не подходит";
	ИначеЕсли НазваниеФормы = НазванияФормМЧД.ОписаниеОшибокСМЧД Тогда
		Результат = "Описание ошибок с МЧД";
	ИначеЕсли НазваниеФормы = НазванияФормМЧД.НетПодходящихДовереностей Тогда
		Результат = "Нет подходящих доверенностей";
	ИначеЕсли НазваниеФормы = НазванияФормМЧД.ПоддержкаОператоромМЧД Тогда
		Результат = "Поддержка оператором МЧД";
	ИначеЕсли НазваниеФормы = НазванияФормМЧД.ВыбраннаяДоверенностьИмеетПредупреждения Тогда
		Результат = "Выбранная доверенность с предупреждениями";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ОткрытиеФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	НазваниеФормыДляМетрики = ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики;
	ДопПеременные = Метрика_ДополнительныеПеременныеМЧД(ПараметрыДляПроверкиМЧД);
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ОткрытиеФормы;
	ЛейблМетрики = Ядро.Метрика_НазваниеДействий().НажатиеКнопки;
	ПредставлениеМетрики = Метрика_ЛейблПоНазваниюФормыМЧД(НазваниеФормыДляМетрики);
	
	Если ПараметрыДляПроверкиМЧД.ГрупповоеДействие Тогда
		КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().УведомлениеПриМассовыхДействиях;
	Иначе
		КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().УведомлениеИзФормыПакета;
	КонецЕсли;
	
	Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		Истина,
		ЛейблМетрики,
		ПредставлениеМетрики
	);
	
	Для каждого ОписаниеОшибки Из ПараметрыДляПроверкиМЧД.ОшибкиПроверокМЧД Цикл
		
		Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
			ОписаниеОшибки.ИдентификаторЯщика,
			КатегорияМетрики,
			ДействиеМетрики,
			ЛейблМетрики,
			ДопПеременные,
			ПредставлениеМетрики
		);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает дополнительные переменные для отправки метрик по МЧД на основании параметров формы проверки МЧД
// 
// Параметры:
//    ПараметрыДляПроверкиМЧД - Структура - см. ПараметрыДляПроверкиМЧД().
// 
// Возвращаемое значение:
//    Структура
// 
&НаКлиенте
Функция Метрика_ДополнительныеПеременныеМЧД(ПараметрыДляПроверкиМЧД) Экспорт
	
	Результат = Новый Соответствие;
	ВыбраннаяМЧДИдентификатор = СвойствоСтруктуры(ПараметрыДляПроверкиМЧД.ВыбраннаяМЧД, "Идентификатор"	, "");
	ИспользуетсяМЧДПоУмолчанию = СвойствоСтруктуры(ПараметрыДляПроверкиМЧД.ВыбраннаяМЧД, "ПоУмолчанию");
	
	РезультатПроверкиМЧД = СвойствоСтруктуры(ПараметрыДляПроверкиМЧД, "РезультатПроверкиМЧД");
	СписокОшибок = СвойствоСтруктуры(РезультатПроверкиМЧД, "СписокОшибок", Новый Массив);
	
	Если ЗначениеЗаполнено(СписокОшибок) Тогда
		Результат.Вставить("Список ошибок", СписокОшибок);
	КонецЕсли;
	
	Результат.Вставить("Рег.номер МЧД", ВыбраннаяМЧДИдентификатор);
	Результат.Вставить("МЧД по умолчанию", Формат(ИспользуетсяМЧДПоУмолчанию, "БЛ=False; БИ=True"));
	
	ПредставленияДействийЭДО = Модуль_ЯдроНаКлиенте().Перечисление_ПредставленияДействийЭДО();
	ПредставлениеДействия = СвойствоСтруктуры(
		ПредставленияДействийЭДО,
		ПараметрыДляПроверкиМЧД.ДействиеЭДО,
		ПараметрыДляПроверкиМЧД.ДействиеЭДО
	);
	
	Если ПараметрыДляПроверкиМЧД.РежимОтображенияДокументов = РежимыОтображения().Входящие Тогда
		НаправлениеДокумента = "Входящий";
	Иначе	
		НаправлениеДокумента = "Исходящий";
	КонецЕсли;
	
	Результат.Вставить("Направление документа", НаправлениеДокумента);
	Результат.Вставить("Действие", ПредставлениеДействия);
	
	ДопПеременныеМетрик = СвойствоСтруктуры(ПараметрыДляПроверкиМЧД, "ДопПеременныеМетрик", Новый Соответствие);
	Для Каждого ДопПеременнаяМетрик Из ДопПеременныеМетрик Цикл
		Результат.Вставить(ДопПеременнаяМетрик.Ключ, ДопПеременнаяМетрик.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ЗаписатьСтатистику_ДоверенностьСПредупреждениями(ПараметрыДляПроверкиМЧД)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Метрика_НазваниеКатегории = Ядро.Метрика_НазваниеКатегории();
	Метрика_НазваниеДействий = Ядро.Метрика_НазваниеДействий();
	
	Если ПараметрыДляПроверкиМЧД.ГрупповоеДействие Тогда
		КатегорияМетрики = Метрика_НазваниеКатегории.УведомлениеПриМассовыхДействиях;
	Иначе
		КатегорияМетрики = Метрика_НазваниеКатегории.УведомлениеИзформыПакета;
	КонецЕсли;
	
	ИдентификаторЯщика = ПараметрыДляПроверкиМЧД.ИдентификаторЯщика;
	ДействиеМетрики = Метрика_НазваниеДействий.ОткрытиеФормы;
	Переменные = Метрика_ДополнительныеПеременныеМЧД(ПараметрыДляПроверкиМЧД);
	Метка = Неопределено;
	Представление = Неопределено;
	
	Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		Метка,
		Переменные,
		Представление
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаДоверенностей(ИдентификаторЯщика) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторЯщика", ИдентификаторЯщика);
	
	ОткрытьФормуДиадокМодальноЛок(
		"МЧД_ФормаСпискаУправляемая",
		ЭтаФорма,
		ПараметрыФормы
	);

КонецПроцедуры

// #КонецОбласти МЧД

// #Область КЭП

// Показывает пользователям форму с визуализацией ошибок проверки КЭП для Пакета
//
// Параметры:
//  СписокОшибокКЭП - Массив - см. КЭП_ПолучитьОшибкиПоСтрокеКонтекста()
//  ДополнительныеПараметры - Структура - произвольные параметры
//
&НаКлиенте
Процедура ПоказатьВопрос_ДляДокументаНевозможноВыполнитьДействиеКЭП(СписокОшибокКЭП) Экспорт
	
	ДействияНаФормеВопросаКЭП = ДействияНаФормеВопросаКЭП();
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаКЭП.ОткрытьСписокОшибок, ДействияНаФормеВопросаКЭП.ОткрытьСписокОшибок);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаКЭП.Закрыть, ДействияНаФормеВопросаКЭП.Закрыть);
	
	ТекстВопроса = 
	"Для работы с электронными документами в Диадоке требуется выпустить квалифицированный сертификат (КЭП).
	|
	|Чтобы узнать о возможных причинах ошибки и посмотреть инструкции, нажмите на кнопку ""Подробнее""."; 
	
	ОбработчикЗакрытияВопроса = НовыйОписаниеОповещения(
		"ОбработатьРезультатВыбора_ДляДокументаНевозможноВыполнитьДействиеКЭП",
		ЭтаФорма,
		СписокОшибокКЭП
	);
	ПоказатьВопросЛок(
		ОбработчикЗакрытияВопроса,
		ТекстВопроса,
		КнопкиВопроса,
		,
		ДействияНаФормеВопросаКЭП.Закрыть,
		"Сертификат не является квалифицированным"
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыбора_ДляДокументаНевозможноВыполнитьДействиеКЭП(ВыбранноеДействие, СписокОшибокКЭП) Экспорт
	
	ДействияНаФормеВопросаКЭП = ДействияНаФормеВопросаКЭП();
	
	ПродолжитьДляДоступных = ВыбранноеДействие = ДействияНаФормеВопросаКЭП.Продолжить;
	ОткрытьСписокОшибок = ВыбранноеДействие = ДействияНаФормеВопросаКЭП.ОткрытьСписокОшибок;
	
	Если ОткрытьСписокОшибок Тогда
		
		Метрика_СписокОшибокКЭП(СписокОшибокКЭП);
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Режим", "ОшибкиКЭППриДействии");
		ПараметрыОткрытияФормы.Вставить("СписокОшибокКЭП", СписокОшибокКЭП);
		
		ОткрытьФормуДиадокМодальноЛок(
			"ФормаHTMLСообщенияУправляемая",
			ЭтаФорма,
			ПараметрыОткрытияФормы
		);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ДействияНаФормеВопросаКЭП() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Продолжить", "Продолжить");
	Результат.Вставить("ОткрытьСписокОшибок", "Подробнее");
	Результат.Вставить("Закрыть", "Закрыть");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_СписокОшибокКЭП(СписокОшибокКЭП) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().НеквалифицированныйСертификат;
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().Подробнее;
	ЛейблМетрики = "";
	ПредставлениеМетрики = "";
	НазваниеФормыДляМетрики = "Неквалифицированный сертификат";
	TraceId = Ядро.TraceId();
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		ЛейблМетрики,
		ПредставлениеМетрики,
		TraceId
	);
	
	Для каждого ОписаниеОшибкиКЭП Из СписокОшибокКЭП Цикл
		Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
			ОписаниеОшибкиКЭП.BoxID,
			КатегорияМетрики,
			ДействиеМетрики,
			ЛейблМетрики,
			,
			ПредставлениеМетрики,
			TraceId
		);
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти КЭП

// #Область ПолучениеПечатныхФорм

&НаКлиенте
Процедура НачатьПолучениеДанныхПечатнойФормы(
		ОписаниеОповещенияОЗавершении,
		ОписаниеОповещенияОбОшибке,
		Идентификаторы) Экспорт
	
	Попытка
		
		Результат = Документы_СгенерироватьПечатнуюФормуДиадокВызовСервера(Идентификаторы);
		ВыполнитьОбработкуОповещенияЛок(
			ОписаниеОповещенияОЗавершении,
			Результат);
		
	Исключение
		
		ВидОперации = "Получение печатной формы документа";
		ТекстСообщения = "Не удалось получить печатную форму документа";
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(
				ИнформацияОбОшибке);
		
		МодульЯдро = Модуль_ЯдроНаКлиенте();
		
		МодульЯдро.Ошибка_Обработать(
			ВидОперации,
			ПодробныйТекстОшибки,
			ТекстСообщения);
		
		ВыполнитьОбработкуОповещенияЛок(
			ОписаниеОповещенияОбОшибке,
			ПодробныйТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПечатнуюФормуСервераДиадок(Документ, ДопПеременныеДляМетрики = Неопределено) Экспорт
	
	ДвоичныеДанныеПечатнойФормы = Документы_ПечатнаяФормаСервераДиадокВызовСервера(Документ.Идентификаторы);
	
	Метрика_ДобавитьСтатистику_СкачиваниеДокументовВызовСервера(
		"Получить печатную форму",
		Документ,
		ДопПеременныеДляМетрики
	);
	
	Если ТипЗнч(ДвоичныеДанныеПечатнойФормы) = Тип("ДвоичныеДанные") Тогда
		
		ПредставлениеДокумента = Документы_ПредставлениеДокументаВызовСервера(Документ);
		
		ИмяФайлаПечатнойФормы = ПредставлениеДокумента + " - " + Документ.Идентификаторы.DocumentId + ".pdf";
		ИмяФайлаПечатнойФормы = ЗаменитьНедопустимыеСимволыИмениФайла(ИмяФайлаПечатнойФормы);
		
		#Если ВебКлиент Тогда
			
			АдресПечатнойФормы = ПоместитьВоВременноеХранилище(ДвоичныеДанныеПечатнойФормы, УникальныйИдентификатор);
			
			ПолучитьФайл(АдресПечатнойФормы, ИмяФайлаПечатнойФормы, Истина);
			
		#Иначе
			
			ПутьКФайлуПечатнойФормы = КаталогВременныхФайлов() + ИмяФайлаПечатнойФормы;
			
			ДвоичныеДанныеПечатнойФормы.Записать(ПутьКФайлуПечатнойФормы);
			
			ЗапуститьПриложение(ПутьКФайлуПечатнойФормы);
			
		#КонецЕсли
		
	Иначе
		
		ОчиститьСообщения();
		Сообщить("Печатная форма не сформирована!", СтатусСообщения.Важное);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Документы_ПечатнаяФормаСервераДиадокВызовСервера(Идентификаторы)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.Документы_ПечатнаяФормаСервераДиадок(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
// BSLLS:MissingReturnedValueDescription-off
// BSLLS:MissingParameterDescription-off
Функция Документы_СгенерироватьПечатнуюФормуДиадокВызовСервера(Идентификаторы)
	// BSLLS:MissingReturnedValueDescription-on
	// BSLLS:MissingParameterDescription-on
	Ядро = Модуль_Ядро();
	Результат = Ядро.Документы_СгенерироватьПечатнуюФормуДиадок(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Метрика_ДобавитьСтатистику_СкачиваниеДокументовВызовСервера(Действие, Документ, ДопПеременныеДляМетрики)
	
	Ядро = Модуль_Ядро();
	Ядро.Метрика_ДобавитьСтатистику_СкачиваниеДокументов(Действие, Документ, , ДопПеременныеДляМетрики);
	
КонецПроцедуры

&НаСервере
Функция Документы_ПредставлениеДокументаВызовСервера(Документ)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.Документы_ПредставлениеДокумента(Документ);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти ПолучениеПечатныхФорм

// #Область МассоваяОбработкаДокументов

&НаСервере
Функция ДлительныеОперации_ПодготовитьПакетыДляОтправки(Знач Пакеты)
	
	Ядро = Модуль_Ядро();
	
	ПроверятьXDTO = Ложь;
	ПараметрыМетода = Ядро.ПараметрыВМассив(Пакеты, ПроверятьXDTO);
	
	Результат = Ядро.ДлительныеОперации_ВыполнитьОперацию(
		"Пакеты_ПодготовитьПакетыДляОтправки",
		ПараметрыМетода
	);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДлительныеОперации_ВыполнитьОперациюВызовСервера(Знач ИмяМетода, Знач ПараметрыМетода)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.ДлительныеОперации_ВыполнитьОперацию(ИмяМетода, ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// #Область ОтправкаПакетов

&НаКлиенте
Процедура ПакетДляОтправки(КонтекстФункции)
	
	Пакеты = КонтекстФункции.Данные;
	ПараметрыСогласования = КонтекстФункции.Параметры;
	
	ТекущаяОперация = ДлительныеОперации_ПодготовитьПакетыДляОтправки(Пакеты);
	
	КонтекстФункции.Очистить();
	КонтекстФункции.Вставить("Обработчик", "ОтправитьПакет");
	КонтекстФункции.Вставить("ТекущаяОперация", ТекущаяОперация);
	КонтекстФункции.Вставить("ПараметрыСогласования", ПараметрыСогласования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПакет(КонтекстФункции) 
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ТекущаяОперация = СвойствоСтруктуры(КонтекстФункции, "ТекущаяОперация");
	
	Если ТекущаяОперация = Неопределено Тогда
		Пакеты = КонтекстФункции.Данные;
	Иначе
		Пакеты = КонтекстФункции.ТекущаяОперация.Результат;
		КонтекстФункции.Удалить("ТекущаяОперация");
	КонецЕсли;
	
	ПакетыДляОтправки = Новый Массив;
	
	Для каждого Пакет Из Пакеты Цикл
		
		ОшибкиОтправки = СвойствоСтруктуры(Пакет.СлужебнаяИнформация, "ОшибкиОтправки");
		
		Если ЗначениеЗаполнено(ОшибкиОтправки) Тогда
			Ядро.Пакеты_Сохранить(Пакет);
		ИначеЕсли Пакет <> Неопределено Тогда
			ПакетыДляОтправки.Добавить(Пакет);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыСогласования = КонтекстФункции.ПараметрыСогласования;
	
	Если ПараметрыСогласования = Неопределено Тогда
		
		ПакетыДляОтправки = Пакеты_ПередПодписаниемПакетовНаОтправкуВызовСервера(ПакетыДляОтправки);
		
		Для каждого ПакетНаПодпись Из ПакетыДляОтправки Цикл
			
			Если НЕ ПакетНаПодпись.Шаблон Тогда
				Ядро.Пакеты_ДобавитьПодписиФайловПакета(ПакетНаПодпись, "");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого Пакет Из ПакетыДляОтправки Цикл
			Для Каждого ОписаниеДокумента Из Пакет.Документы Цикл
				ОписаниеДокумента.СлужебнаяИнформация.Вставить("Маршрутизация", ПараметрыСогласования);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПакетыДляОтправки) Тогда
		
		Для каждого Пакет Из ПакетыДляОтправки Цикл
			
			ЗашифрованныйПакет = СвойствоСтруктуры(Пакет.СлужебнаяИнформация, "ЗашифрованныйПакет");
			
			Если ЗашифрованныйПакет = Истина Тогда
				Ядро.Пакеты_ЗашифроватьФайлыВПакете(Пакет);
			КонецЕсли;
			
		КонецЦикла;
		
		ИмяМетода = "Пакеты_ОтправитьИСохранитьПоСписку";
		ПараметрыМетода = ПараметрыВМассивЛок(ПакетыДляОтправки);
		
		ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
		
	КонецЕсли;
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

&НаСервере
Функция Пакеты_ПередПодписаниемПакетовНаОтправкуВызовСервера(Пакеты)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.Пакеты_ПередПодписаниемПакетовНаОтправку(Пакеты);
	
	Возврат результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПакетыНаОтправку(ПараметрОповещения = Неопределено, ПараметрыОбработки = Неопределено) Экспорт
	
	РежимыОтображения = РежимыОтображения();
	
	Действие = ПараметрыОбработки.Действие;
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики = ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики = ПараметрыОбработки.ДействиеМетрики;
	РежимОтображенияДокументов = ПараметрыОбработки.РежимОтображенияДокументов;
	
	Если РежимОтображенияДокументов = РежимыОтображения.Исходящие Тогда
		
		ДанныеДляОбработки = Документы_ОтложенныеДокументыДляОтправкиКонтрагентуВызовСервера(ДанныеДляОбработки);
		
		ОбрабатываемыеПакеты = Новый Массив;
		ДоступныеДанныеДляОбработки = Новый Массив;
		
		Для Каждого СтрокаСписка Из ДанныеДляОбработки Цикл
			
			Если ОбрабатываемыеПакеты.Найти(СтрокаСписка.LetterId) = Неопределено Тогда
				
				ОбрабатываемыеПакеты.Добавить(СтрокаСписка.LetterId);
				ДоступныеДанныеДляОбработки.Добавить(СтрокаСписка);
				
			КонецЕсли;
		
		КонецЦикла;
		
	ИначеЕсли РежимОтображенияДокументов = РежимыОтображения.Внутренние Тогда
		
		ДанныеДляОбработки = Документы_ОтложенныеДокументыДляОтправкиВПодразделениеВызовСервера(ДанныеДляОбработки);
		
		ОбрабатываемыеПакеты = Новый Массив;
		ДоступныеДанныеДляОбработки = Новый Массив;
		
		Для Каждого СтрокаСписка Из ДанныеДляОбработки Цикл
			
			Если ОбрабатываемыеПакеты.Найти(СтрокаСписка.LetterId) = Неопределено Тогда
				
				ОбрабатываемыеПакеты.Добавить(СтрокаСписка.LetterId);
				ДоступныеДанныеДляОбработки.Добавить(СтрокаСписка);
				
			КонецЕсли;
		
		КонецЦикла;
		
	Иначе
		ДоступныеДанныеДляОбработки = ДанныеДляОбработки;
	КонецЕсли;
	
	КоличествоДоступныхДокументов = ДоступныеДанныеДляОбработки.Количество();
	
	Если КоличествоДоступныхДокументов = 0 Тогда
		
		ПоказатьПредупреждениеОНевозможностиВыполненияДействия(ПараметрыОбработки);
		
	Иначе
		
		ПараметрыСогласования = СвойствоСтруктуры(ПараметрыОбработки, "ПараметрыСогласования");
		ОписаниеОповещения = СвойствоСтруктуры(ПараметрыОбработки, "ОписаниеОповещения");
		
		ВыполнитьМассовуюОбработкуДанных(
			"ПакетДляОтправки",
			ДоступныеДанныеДляОбработки,
			Действие,
			ПараметрыСогласования,
			ОписаниеОповещения,
			Истина
		);
		
		Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(
			КатегорияМетрики,
			ДействиеМетрики,
			ДоступныеДанныеДляОбработки
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Документы_ОтложенныеДокументыДляОтправкиКонтрагентуВызовСервера(ДанныеДляОбработки)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.Документы_ОтложенныеДокументыДляОтправкиКонтрагенту(ДанныеДляОбработки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ОтложенныеДокументыДляОтправкиВПодразделениеВызовСервера(ДанныеДляОбработки)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.Документы_ОтложенныеДокументыДляОтправкиВПодразделение(ДанныеДляОбработки);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти ОтправкаПакетов

// #Область Перезаполнение

&НаКлиенте
Процедура ПерезаполнитьПакет(КонтекстФункции)
	
	ИмяМетода = "Пакеты_ПерезаполнитьПакетыПоСтрокамСписка";
	СтрокиСписка = КонтекстФункции.Данные;
	
	ПараметрыМетода = ПараметрыВМассивЛок(СтрокиСписка);
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	КонтекстФункции.Вставить("Обработчик", "ЗаполнитьПараметрыПереотправки");
	КонтекстФункции.Вставить("ТекущаяОперация", ТекущаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПереотправки(КонтекстФункции)
	
	ОписаниеПакетов = КонтекстФункции.ТекущаяОперация.Результат;
	
	ПакетыДляОтправки	 = Новый Массив;
	ПакетыДляСохранения	 = Новый Массив;
	
	Для каждого ОписаниеПакета Из ОписаниеПакетов Цикл
	
		ПерезаполненныйПакет	= ОписаниеПакета.ПерезаполненныйПакет;
		СтрокаСписка			= ОписаниеПакета.СтрокаСписка;
		ПерезаполняемыйПакет	= ОписаниеПакета.ПерезаполняемыйПакет;
		ПакетОтправлен			= ОписаниеПакета.ПакетОтправлен;
		
		Если ПерезаполненныйПакет = Неопределено Тогда
			
			ЕстьОшибкиВалидации = ВыполнитьВалидациюПереотправляемогоПакета(СтрокаСписка);
			
			Если НЕ ЕстьОшибкиВалидации Тогда
				
				ТекстСообщения = "Не удалось переотправить пакет документов: " + ПерезаполняемыйПакет.ПакетЭДО;
				
				Ядро = Модуль_ЯдроНаКлиенте();
				Ядро.Ошибка_Обработать(
					"Не удалось переотправить пакет документов",
					ТекстСообщения
				);
				
			КонецЕсли;
			
		Иначе
			
			ПараметрыПереотправки	 = ПерезаполненныйПакет.СлужебнаяИнформация.ПараметрыПереотправки;
			
			Если ПакетОтправлен Тогда
				
				ПараметрыПереотправки.ПереотправляемыйПакет = ПерезаполняемыйПакет;
				
				Если Не ЗначениеЗаполнено(ПерезаполняемыйПакет.ПакетЭДО) Тогда
					ПараметрыПереотправки.ВыполнитьУдалениеНеактуальныхДокументовПакета = Истина;
				КонецЕсли;	
				
				ПакетыДляОтправки.Добавить(ПерезаполненныйПакет);
				
			Иначе
				
				Если ПерезаполняемыйПакет <> Неопределено Тогда
					
					ПараметрыПереотправки.ВыполнитьУдалениеНеактуальныхДокументовПакета = Истина;
					ПерезаполненныйПакет.Идентификаторы.ПакетЭДО	= ПерезаполняемыйПакет.ПакетЭДО;
					СтрокаСписка.Пакет								= ПерезаполняемыйПакет.ПакетЭДО;
					
				КонецЕсли;
				
				ПакетыДляСохранения.Добавить(ПерезаполненныйПакет);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПакетыДляСохранения.Количество() Тогда
		Пакеты_СохранитьПоСпискуВызовСервера(ПакетыДляСохранения);
	КонецЕсли;
	
	Если ПакетыДляОтправки.Количество() Тогда
		
		КонтекстФункции.Удалить("ТекущаяОперация");
		
		КонтекстФункции.Вставить("Данные"				, ПакетыДляОтправки);
		КонтекстФункции.Вставить("Обработчик"			, "ОтправитьПакет");
		КонтекстФункции.Вставить("ПараметрыСогласования", Неопределено);
		
	Иначе
		
		ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьВалидациюПереотправляемогоПакета(СтрокаСписка)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.СписокДокументов_ВалидацияПереотправляемогоПакета(СтрокаСписка);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Пакеты_СохранитьПоСпискуВызовСервера(Знач ПакетыДляСохранения)
	
	Ядро = Модуль_Ядро();
	Ядро.Пакеты_СохранитьПоСписку(ПакетыДляСохранения);
	
КонецПроцедуры

// #КонецОбласти Перезаполнение

// #Область ПередачаВПодразделение

&НаКлиенте
Процедура ПередатьВПодразделение(КонтекстФункции)
	
	ИмяМетода = "Документы_ПереместитьМассивДокументовВПодразделение";
	
	ДокументыДляОбработки = ОчередьЗадач_ВыгрузитьДокументыИзМассиваПакетов(КонтекстФункции.Данные);
	BoxId = КонтекстФункции.Параметры.BoxId;
	DepartmentId = КонтекстФункции.Параметры.DepartmentId;
		
	ПараметрыМетода = ПараметрыВМассивЛок(BoxId, DepartmentId, ДокументыДляОбработки);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПередатьВПодразделение(ПараметрОповещения = Неопределено, ПараметрыОбработки = Неопределено) Экспорт
	
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	
	ВыбранныеBoxId	= BoxIdИзДокументов(ДанныеДляОбработки);
	BoxId = ОбщийBoxId(ВыбранныеBoxId);
	
	Если НЕ ЗначениеЗаполнено(BoxId) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработки.Вставить("BoxId", BoxId);
	
	ПараметрыФормы = Новый Структура("BoxId, Действие", ПараметрыОбработки.BoxId, ПараметрыОбработки.Действие);
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПередатьВПодразделениеОкончаниеВыбора", ЭтаФорма, ПараметрыОбработки);
	
	ОткрытьФормуДиадокМодальноЛок("СогласованиеУправляемая", ЭтаФорма, ПараметрыФормы, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПодразделениеОкончаниеВыбора(ПараметрыПеремещения, ПараметрыОбработки) Экспорт 
	
	Если ПараметрыПеремещения <> Неопределено Тогда
		
		Действие = ПараметрыОбработки.Действие;
		ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
		ОписаниеОповещения = СвойствоСтруктуры(ПараметрыОбработки, "ОписаниеОповещения");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("BoxId",			ПараметрыПеремещения.BoxId);
		ДополнительныеПараметры.Вставить("DepartmentId",	ПараметрыПеремещения.DepartmentId);
		
		Ядро = Модуль_ЯдроНаКлиенте();
		
		ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
		
		ВыполнитьМассовуюОбработкуДанных(
			"ПередатьВПодразделение",
			ПакетыДокументов,
			Действие,
			ДополнительныеПараметры,
			ОписаниеОповещения
		);
		Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(
			ПараметрыОбработки.КатегорияМетрики,
			ПараметрыОбработки.ДействиеМетрики,
			ДанныеДляОбработки,
			ПараметрыОбработки.ИсточникОткрытия
		);
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти ПередачаВПодразделение

// #Область Согласование

&НаКлиенте
Процедура ОтправитьДокументыНаМаршрутизацию(КонтекстФункции)
	
	ИмяМетода = "Пакеты_МаршрутизироватьДокументыПакетов";
	ДокументыДляОбработки = КонтекстФункции.Данные;
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументыДляОбработки);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура УведомитьОбУспешномВыполненииОперации(ПараметрыОбработки) Экспорт
	
	Перем ДокументыОтправлены;
	
	Действие = ПараметрыОбработки.Действие;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействияЭДО = Ядро.Перечисление_ДействияЭДО();
	
	Если Действие = ДействияЭДО.ПередатьНаСогласование Тогда
		
		ТекстСообщения = "Документ передан на согласование";
		
	ИначеЕсли Действие = ДействияЭДО.ПередатьНаПодпись Тогда
		
		ТекстСообщения = "Документ передан на подпись";
		
	ИначеЕсли Действие = ДействияЭДО.ПередатьПоМаршруту Тогда
		
		ТекстСообщения = "Документ передан по маршруту";
		
	ИначеЕсли Действие = ДействияЭДО.Согласование Тогда
		
		ТекстСообщения = "Документ согласован";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказВСогласовании Тогда
		
		ТекстСообщения = "Отказано в согласовании документа";
		
	ИначеЕсли Действие = ДействияЭДО.Аннулировать Тогда
		
		ТекстСообщения = "Документ аннулирован";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказатьВАннулировании Тогда
		
		ТекстСообщения = "Отказано в аннулировании документа";
		
	ИначеЕсли Действие = ДействияЭДО.ПодписатьВходящий Тогда
		
		ТекстСообщения = "Документ подписан";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказатьВПодписи Тогда
		
		ТекстСообщения = "Отказано в подписании документа";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказВЗапросеПодписи Тогда
		
		ТекстСообщения = "Отказано в запросе подписи";
		
	ИначеЕсли Действие = ДействияЭДО.ЗапроситьУточнение Тогда
		
		ТекстСообщения = "Запрошено уточнение";	
		
	ИначеЕсли Действие = ДействияЭДО.ПередатьВПодразделение Тогда
		
		ТекстСообщения = "Документ передан в подразделение";
		
	ИначеЕсли Действие = ДействияЭДО.ПометитьКакЗавершенный Тогда
		
		ТекстСообщения = "Документ помечен как завершенный";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		Если ПараметрыОбработки.Свойство("ДокументыОтправлены", ДокументыОтправлены)
			И ДокументыОтправлены = Ложь Тогда
			
			ТекстСообщения = СтрЗаменить(НРег(ТекстСообщения), "документ", "пакет");
			ТекстСообщения = Врег(Лев(ТекстСообщения, 1)) + Сред(ТекстСообщения, 2);
			
		КонецЕсли;
		
		Состояние(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДействиеПоМаршрутизации(
	ПараметрОповещения = Неопределено,
	ПараметрыОбработки = Неопределено) Экспорт
	
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	ДокументыОтправлены = ПараметрыОбработки.ДокументыОтправлены;
	ФормаВыполнения = ПараметрыОбработки.ФормаВыполнения;
	РежимОтображенияДокументов = ПараметрыОбработки.РежимОтображенияДокументов;
	ФормаВыполненияНеОсновнаяФорма = ФормаВыполнения <> ОсновнаяФорма();
	
	BoxId = BoxIdИзДанныхДляОбработки(ДокументыОтправлены, ФормаВыполненияНеОсновнаяФорма, ДанныеДляОбработки);
	
	Если НЕ ЗначениеЗаполнено(BoxId) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработки.Вставить("BoxId", BoxId);
	
	ОтправкаИзФормыНовогоПакета = НЕ ДокументыОтправлены И ФормаВыполненияНеОсновнаяФорма;
	
	Если ОтправкаИзФормыНовогоПакета Тогда
		ДокументыДляОбработки = ДокументыПакетов(ДанныеДляОбработки);
	Иначе
		ДокументыДляОбработки = ДанныеДляОбработки;
	КонецЕсли;
	
	Если РежимОтображенияДокументов = РежимыОтображения().ДляОтправки Тогда
		ДокументыДоступныеДляОбработки = ДокументыДляОбработки;
	Иначе
		ДокументыДоступныеДляОбработки = Документы_ДоступныеДляСогласованияДокументыВызовСервера(
			ДокументыДляОбработки,
			ПараметрыОбработки.Действие
		);
	КонецЕсли;
	
	КоличествоВыбранныхДокументов = ДокументыДляОбработки.Количество();
	КоличествоДоступныхДокументов = ДокументыДоступныеДляОбработки.Количество();
	ДоступныНеВсеДокументы = (КоличествоВыбранныхДокументов <> КоличествоДоступныхДокументов);
	
	Если КоличествоДоступныхДокументов = 0
		Или ДоступныНеВсеДокументы И ОтправкаИзФормыНовогоПакета Тогда
		
		ПоказатьПредупреждениеОНевозможностиВыполненияДействия(ПараметрыОбработки);
		
	Иначе
		
		Если ДоступныНеВсеДокументы Тогда
			
			ПараметрыОбработки.ДанныеДляОбработки = ДокументыДоступныеДляОбработки;
			
			ОписаниеОповещенияЗавершения = НовыйОписаниеОповещения(
				"ПослеВопросаОЧастичномСогласовании",
				ЭтаФорма,
				ПараметрыОбработки
			);
			ПоказатьВопросОЧастичномВыполненииДействия(ПараметрыОбработки, ОписаниеОповещенияЗавершения);
			
		Иначе
			ОткрытьФормуСогласования(ПараметрыОбработки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция BoxIdИзДанныхДляОбработки(ДокументыОтправлены, ФормаВыполненияНеОсновнаяФорма, ДанныеДляОбработки)
	
	Если ДокументыОтправлены
		ИЛИ ФормаВыполненияНеОсновнаяФорма Тогда
		ВыбранныеBoxId = BoxIdИзДокументов(ДанныеДляОбработки);
	Иначе
		ВыбранныеBoxId = BoxIdИзСтрокСписка(ДанныеДляОбработки);
	КонецЕсли;
	
	Результат = ОбщийBoxId(ВыбранныеBoxId);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Документы_ДоступныеДляСогласованияДокументыВызовСервера(ДокументыДляОбработки, Действие)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.Документы_ДоступныеДляСогласованияДокументы(ДокументыДляОбработки, Действие);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСогласования(ПараметрыОбработки)
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ФормаСогласованияПослеЗакрытия", ЭтаФорма, ПараметрыОбработки);
	
	ПараметрыФормы = Новый Структура("BoxId, Действие", ПараметрыОбработки.BoxId, ПараметрыОбработки.Действие);
	ОткрытьФормуДиадокМодальноЛок("СогласованиеУправляемая", ЭтаФорма, ПараметрыФормы, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаСогласованияПослеЗакрытия(
	ПараметрыСогласования = Неопределено,
	ПараметрыОбработки = Неопределено) Экспорт
	
	Если ПараметрыСогласования <> Неопределено Тогда
		
		Если ПараметрыОбработки.ВыполнениеИзФормыПакета Тогда
			ОбработатьДействиеПоМаршрутизацииДляФормыПакета(ПараметрыСогласования, ПараметрыОбработки);
		Иначе
			ОбработатьДействиеПоМаршрутизацииДляОсновнойФормы(ПараметрыСогласования, ПараметрыОбработки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДействиеПоМаршрутизацииДляОсновнойФормы(ПараметрыСогласования, ПараметрыОбработки)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ДокументыОтправлены = ПараметрыОбработки.ДокументыОтправлены;
	
	Если ДокументыОтправлены Тогда
		
		ОписаниеОповещения = СвойствоСтруктуры(ПараметрыОбработки, "ОписаниеОповещения");
		ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
		
		Для Каждого Документ Из ДанныеДляОбработки Цикл
			Документ.СлужебнаяИнформация.Вставить("Маршрутизация", ПараметрыСогласования);
		КонецЦикла;
		
		ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
		
		ВыполнитьМассовуюОбработкуДанных(
			"ОтправитьДокументыНаМаршрутизацию",
			ПакетыДокументов,
			ПараметрыОбработки.Действие,
			Неопределено,
			ОписаниеОповещения
		);
		Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(
			ПараметрыОбработки.КатегорияМетрики,
			ПараметрыОбработки.ДействиеМетрики,
			ДанныеДляОбработки
		);
		
	Иначе
		
		ПараметрыОбработки.Действие = Ядро.Перечисление_ДействияЭДО().Отправить;
		ПараметрыОбработки.Вставить("ПараметрыСогласования", ПараметрыСогласования);
		
		ОбработатьПакетыНаОтправку(, ПараметрыОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДействиеПоМаршрутизацииДляФормыПакета(ПараметрыСогласования, ПараметрыОбработки)
	
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	ДокументыОтправлены = ПараметрыОбработки.ДокументыОтправлены;
	
	Если ДокументыОтправлены Тогда
		РезультатОбработки = МаршрутизироватьОтправленныеДокументыНаСервере(ДанныеДляОбработки, ПараметрыСогласования);
	Иначе
		РезультатОбработки = МаршрутизироватьИОтправитьДокументыНаСервере(ДанныеДляОбработки, ПараметрыСогласования);
	КонецЕсли;
	
	Действие = ПараметрыОбработки.Действие;
	ФормаВыполнения = ПараметрыОбработки.ФормаВыполнения;
	
	Если РезультатОбработки.Отказ Тогда
		ЗавершениеОбработкиДокументов(Действие, ФормаВыполнения);
	Иначе
		
		ФормаВыполнения.ОбновитьФорму(РезультатОбработки.Пакет);
		ФормаВыполнения.ОповеститьОбИзмененииПакета();
		
		Пакеты_ВыполнитьОчисткуУстаревшихПодготовленных(Действие);
		
		Если ПараметрыОбработки.ГрупповоеДействие Тогда
			
			ИмяСобытия = "Диадок_ОбновитьГлавныйСписок";
			ПараметрыОповещения = Неопределено;
			ИсточникОповещения = ПараметрыОбработки.ИдентификаторОсновнойФормы;
			
			Оповестить(
				ИмяСобытия,
				ПараметрыОповещения,
				ИсточникОповещения
			);
			
		КонецЕсли;
		
		УведомитьОбУспешномВыполненииОперации(ПараметрыОбработки);
		
		Ядро = Модуль_ЯдроНаКлиенте();
		Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(
			ПараметрыОбработки.КатегорияМетрики,
			ПараметрыОбработки.ДействиеМетрики,
			ДанныеДляОбработки,
			ПараметрыОбработки.ИсточникОткрытия
		);
		
		Если НЕ ДокументыОтправлены Тогда
			ФормаВыполнения.Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МаршрутизироватьОтправленныеДокументыНаСервере(Знач ДанныеДляОбработки, Знач ПараметрыСогласования)
	
	Результат = Новый Структура;
	Результат.Вставить("Пакет", Неопределено);
	Результат.Вставить("Отказ", Ложь);
	
	Ядро = Модуль_Ядро();
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		Документ.СлужебнаяИнформация.Вставить("Маршрутизация", ПараметрыСогласования);
	КонецЦикла;
	
	ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
	
	Для Каждого Пакет Из ПакетыДокументов Цикл
		РезультатМаршрутизации = Ядро.Пакеты_МаршрутизироватьДокументы(Пакет);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Результат, РезультатМаршрутизации);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МаршрутизироватьИОтправитьДокументыНаСервере(Знач ДанныеДляОбработки, Знач ПараметрыСогласования)
	
	Результат = Новый Структура;
	Результат.Вставить("Пакет", Неопределено);
	Результат.Вставить("Отказ", Ложь);
	
	Ядро = Модуль_Ядро();
	
	Для Каждого Пакет Из ДанныеДляОбработки Цикл
		
		Для Каждого Документ Из Пакет.Документы Цикл
			Документ.СлужебнаяИнформация.Вставить("Маршрутизация", ПараметрыСогласования);
		КонецЦикла;
		
		ЗашифрованныйПакет = Ядро.СвойствоСтруктуры(Пакет.СлужебнаяИнформация, "ЗашифрованныйПакет");
		
		Если ЗашифрованныйПакет = Истина Тогда
			Ядро.Пакеты_ЗашифроватьФайлыВПакете(Пакет);
		КонецЕсли;
		
		РезультатОтправки = Ядро.Пакеты_ОтправитьИСохранить(Пакет);
		
	КонецЦикла;
	
	Результат.Пакет = Пакет;
	
	Если НЕ РезультатОтправки Тогда
		Результат.Отказ = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОЧастичномСогласовании(ПараметрОповещения, ПараметрыОбработки) Экспорт 
	
	Если ПараметрОповещения = КодВозвратаДиалога.Да Тогда
		
		ОткрытьФормуСогласования(ПараметрыОбработки);
		
	ИначеЕсли ПараметрОповещения = КодВозвратаДиалога.Прервать Тогда
		
		ОткрытьФормуСпискаОшибокЛок(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти Согласование

// #Область СохранениеДокументовНаДиск

&НаКлиенте
Процедура СохранитьДокументы(КонтекстФункции)
	
	ИмяМетода = "Сохранение_СохранитьДокументы";
	
	ДокументыДляОбработки = ОчередьЗадач_ВыгрузитьДокументыИзМассиваПакетов(КонтекстФункции.Данные);
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументыДляОбработки);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти СохранениеДокументовНаДиск

// #Область Расшифровка

&НаКлиенте
Процедура РасшифроватьДокументы(КонтекстФункции)
	
	ДокументыДляРасшифровки = КонтекстФункции.Данные;
	
	Для каждого Документ Из ДокументыДляРасшифровки Цикл
	
		ХранилищеКонтента = Модуль_ЯдроНаКлиенте().Документы_Расшифровать(Документ.Идентификаторы);
	
	КонецЦикла;
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции);
	
КонецПроцедуры

// #КонецОбласти Расшифровка

// #Область ПометкаДокументовЗавершенными

&НаКлиенте
Процедура ПометитьДокументыКакЗавершенные(КонтекстФункции)
	
	ИмяМетода = "ХранениеДанных_ОбновлениеРеквизитовДокументов";
	
	ДокументыДляОбработки	= КонтекстФункции.Данные;
	ОбновляемыеРеквизиты	= КонтекстФункции.Параметры; 
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументыДляОбработки, ОбновляемыеРеквизиты);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти ПометкаДокументовЗавершенными

// #Область ВыполнитьТребуемыедействия

&НаКлиенте
Процедура ТребуемоеДействие(КонтекстФункции)
	
	ИмяМетода = "Документы_ВыполнитьТребуемоеДействиеПоВходящимДокументам";
	
	ДокументыДляОбработки = КонтекстФункции.Данные;
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументыДляОбработки);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти ВыполнитьТребуемыедействия

// #Область АнализДокументов

&НаКлиенте
Процедура АнализДокументов(КонтекстФункции)
	
	ИмяМетода = "Документы_ПровестиАнализВходящихДокументов";
	
	ДокументЭДО = КонтекстФункции.Данные;
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументЭДО);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти АнализДокументов

// #Область АнализПакетов

&НаКлиенте
Процедура АнализПакетов(КонтекстФункции)
	
	ИмяМетода = "Пакеты_ПровестиАнализВходящихПакетов";
	
	ПакетыДляОбработки = КонтекстФункции.Данные;
	
	ПараметрыМетода = ПараметрыВМассивЛок(ПакетыДляОбработки);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти АнализПакетов

// #Область СопоставлениеДокументов

&НаКлиенте
Процедура СопоставитьДокументы(КонтекстФункции)
	
	ИмяМетода = "Документы_СопоставитьДокументы";
	
	ДокументыДляОбработки = КонтекстФункции.Данные;
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументыДляОбработки);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти СопоставлениеДокументов

// #Область СозданиеДокументов

&НаКлиенте
Процедура СоздатьДокументы(КонтекстФункции)
	
	ИмяМетода = "Документы_СоздатьДокументы";
	
	ДокументыДляОбработки				= КонтекстФункции.Данные;
	ИдентификаторОперации				= КонтекстФункции.Параметры.ИдентификаторОперации;
	ДополнительныеПараметры				= КонтекстФункции.Параметры.ДополнительныеПараметры;
	АдресНоменклатурыДляСопоставления	= КонтекстФункции.Параметры.АдресНоменклатурыДляСопоставления;
	
	ПараметрыМетода = ПараметрыВМассивЛок(
		ДокументыДляОбработки,
		ИдентификаторОперации,
		ДополнительныеПараметры,
		АдресНоменклатурыДляСопоставления
	);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПоПравилу(КонтекстФункции)
	
	Пакеты = КонтекстФункции.Данные;
	
	ИмяМетода = "Пакеты_СоздатьДокументыПоПравилу";
	ПараметрыМетода = ПараметрыВМассивЛок(Пакеты);
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуСозданияДокументовУчета(
	ПараметрОповещения = Неопределено,
	ПараметрыОбработки = Неопределено) Экспорт
	
	ВыбранныеДокументы = ПараметрыОбработки.ДанныеДляОбработки;
	ДанныеДляОбработки = НесопоставленныеЭлектронныеДокументы(ВыбранныеДокументы);
	
	Если Не ЗначениеЗаполнено(ДанныеДляОбработки) Тогда
		
		ТекстПредупреждения = "Выбранные электронные документы уже сопоставлены с документами учета!";
		ТаймаутПредупреждения = 60;
		ЗаголовокПредупреждения = "Создание документов учета";
		
		ПоказатьПредупреждениеЛок(
			Неопределено,
			ТекстПредупреждения,
			ТаймаутПредупреждения,
			ЗаголовокПредупреждения
		);
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("ДанныеДляОбработки", ДанныеДляОбработки);
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
		"ПослеЗакрытияФормыСозданияДокументов",
		ЭтаФорма,
		ПараметрыОбработки
	);
	
	ОткрытьФормуДиадокМодальноЛок(
		"СозданиеДокументовУчетаУправляемая",
		ЭтаФорма,
		ПараметрыСоздания,
		ОписаниеОповещения
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСозданияДокументов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Действие = Ядро.Перечисление_ДействияЭДО().СоздатьДокумент;
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().СозданиеДокументов;
	ДействиеМетрики = Метрика_ДействиеСоздатьДокументы();
	ФормаВыполнения = СвойствоСтруктуры(ДополнительныеПараметры, "ФормаВыполнения");
	ВыполнениеИзФормыПакета = СвойствоСтруктуры(ДополнительныеПараметры, "ВыполнениеИзФормыПакета", Ложь);
	
	ОбщиеПараметрыОбработки = Новый Структура;
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		РезультатЗакрытия,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики,
		ФормаВыполнения,
		,
		,
		ВыполнениеИзФормыПакета
	);
	
	ПараметрыОбработки.Вставить("ДополнительныеПараметры", ОбщиеПараметрыОбработки);
	
	ОбработатьСоздатьДокументыВерсия2(ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСоздатьДокументы(ПараметрОповещения = Неопределено, ПараметрыОбработки = Неопределено) Экспорт
	
	Перем ДополнительныеПараметры;
	
	Действие = ПараметрыОбработки.Действие;
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики = ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики = ПараметрыОбработки.ДействиеМетрики;
	
	ПараметрыОбработки.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		
		ХранилищеКонтента = Ядро.Документы_Расшифровать(Документ.Идентификаторы);
		Документ.Документооборот.Вставить("ХранилищеКонтента", ХранилищеКонтента);
		
	КонецЦикла;
	
	ПараметрыСоздания = ДополнительныеПараметрыСозданияДокументов();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСоздания, ДополнительныеПараметры);
	КонецЕсли;
	
	ПараметрыОбработки.Вставить("АдресНоменклатурыДляСопоставления", ПараметрыСоздания.АдресНоменклатурыДляСопоставления);
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
		"ОбработчикЗавершенияСозданияДокументов",
		ЭтаФорма,
		ПараметрыОбработки
	);
	
	ВыполнитьМассовуюОбработкуДанных(
		"СоздатьДокументы",
		ДанныеДляОбработки,
		Действие,
		ПараметрыСоздания,
		ОписаниеОповещения
	);
	
	Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияСозданияДокументов(
	ПараметрОповещения = Неопределено,
	ПараметрыОбработки = Неопределено) Экспорт
	
	ФормаВыполнения = ПараметрыОбработки.ФормаВыполнения;
	АдресВХ = ПараметрыОбработки.АдресНоменклатурыДляСопоставления;
	
	ЕстьНесопоставленнаяНоменклатура = ЗначениеЗаполненоИзВременногоХранилищаВызовСервера(АдресВХ);
	
	Если ЕстьНесопоставленнаяНоменклатура Тогда
		
		АдресСписокДокументов = ПоместитьВоВременноеХранилище(
			ПараметрыОбработки.ДанныеДляОбработки,
			Новый УникальныйИдентификатор
		);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокКнопкиОК", "Сопоставить номенклатуру и создать документы");
		ПараметрыФормы.Вставить("АдресТаблицыНоменклатурыДляСопоставления" , АдресВХ);
		ПараметрыФормы.Вставить("АдресСписокДокументов" , АдресСписокДокументов);
		
		ОписаниеОповещения = НовыйОписаниеОповещения(
			"ОбработчикЗавершенияСопоставленияНоменклатуры",
			ЭтаФорма,
			ПараметрыОбработки
		);
		ОткрытьФормуДиадокМодальноЛок(
			"СопоставлениеНоменклатурыУправляемая",
			ФормаВыполнения,
			ПараметрыФормы,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
		
	Иначе
		
		ЗавершениеОбработкиДокументов(ПараметрыОбработки.Действие, ФормаВыполнения);
		
		Если ПараметрыОбработки.ВыполнениеИзФормыПакета Тогда
			ФормаВыполнения.ОбновитьФорму();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияСопоставленияНоменклатуры(ПовторитьОбработку, ПараметрыОбработки) Экспорт
	
	Если ПовторитьОбработку = Истина Тогда
		ОбработатьСоздатьДокументы(, ПараметрыОбработки);
	Иначе
		ЗавершениеОбработкиДокументов(ПараметрыОбработки.Действие, ПараметрыОбработки.ФормаВыполнения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСоздатьДокументыВерсия2(ПараметрыОбработки) Экспорт
	
	Перем ОбщиеПараметрыОбработки;
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	ПараметрыОбработки.Свойство("ДополнительныеПараметры", ОбщиеПараметрыОбработки);
	
	ПослеСозданияДокументов = НовыйОписаниеОповещения(
		"ОбработчикЗавершенияСозданияДокументовВерсия2",
		ЭтаФорма,
		ПараметрыОбработки
	);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
	
	ВыполнитьМассовуюОбработкуДанных(
		"СоздатьДокументыПоПравилу",
		ПакетыДокументов,
		Действие,
		ОбщиеПараметрыОбработки,
		ПослеСозданияДокументов
	);
	
	Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияСозданияДокументовВерсия2(
	ПараметрОповещения = Неопределено,
	ПараметрыОбработки = Неопределено) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Действие = Ядро.Перечисление_ДействияЭДО().СоздатьДокумент;
	ФормаВыполнения = ПараметрыОбработки.ФормаВыполнения;
	
	ЗавершениеОбработкиДокументов(Действие, ФормаВыполнения);
	
	Если ПараметрыОбработки.ВыполнениеИзФормыПакета Тогда
		ФормаВыполнения.ОбновитьФорму();
	Иначе
		ФормаВыполнения.ОбновитьСписок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НесопоставленныеЭлектронныеДокументы(КоллекцияДокументов)
	
	Результат = Новый Массив;
	
	Для Каждого Документ Из КоллекцияДокументов Цикл
		
		Если Не ЗначениеЗаполнено(Документ.ДокументУчета) Тогда
			Результат.Добавить(Документ);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДополнительныеПараметрыСозданияДокументов()
	
	АдресВХ = НовыйАдресТаблицыСопоставленияНоменклатуры();
	
	Результат = Новый Структура;
	Результат.Вставить("АдресНоменклатурыДляСопоставления", АдресВХ);
	Результат.Вставить("ИдентификаторОперации");
	Результат.Вставить("ДополнительныеПараметры");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйАдресТаблицыСопоставленияНоменклатуры()
	
	Результат = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗначениеЗаполненоИзВременногоХранилищаВызовСервера(АдресВХ)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.ЗначениеЗаполненоИзВременногоХранилища(АдресВХ);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти СозданиеДокументов

// #Область ОбработкаДокументовДляДействийСПодписанием

&НаКлиенте
Процедура ОбработатьДокументыСПодписанием(КонтекстФункции)
	
	ИмяМетода = "Документы_ДанныеДляMessagePatchToPost";
	ДокументыДляОбработки = ОчередьЗадач_ВыгрузитьДокументыИзМассиваПакетов(КонтекстФункции.Данные);
	Действие = КонтекстФункции.Параметры;
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументыДляОбработки, Действие);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	КонтекстФункции.Очистить();
	КонтекстФункции.Вставить("Обработчик", "ЗавершитьОбработкуДокументовСПодписанием");
	КонтекстФункции.Вставить("ТекущаяОперация", ТекущаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбработкуДокументовСПодписанием(КонтекстФункции)

	ПодготовленныеДанные = КонтекстФункции.ТекущаяОперация.Результат;
	
	КонтекстФункции.Удалить("ТекущаяОперация");
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	Модуль_Ядро.Документы_ПодписатьДанныеДляMessagePatchToPost(ПодготовленныеДанные);
	
	ИмяМетода = "Документы_ОтправитьДанныеДляMessagePatchToPost";
	
	ПараметрыМетода = ПараметрыВМассивЛок(ПодготовленныеДанные);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти ОбработкаДокументовДляДействийСПодписанием

// #Область ОбработкаДокументовДляДействийБезПодписания

&НаКлиенте
Процедура ОбработатьДокументыБезПодписания(КонтекстФункции)
	
	ИмяМетода = "Документы_ВыполнитьДействиеСДокументами";
	ДокументыДляОбработки = ОчередьЗадач_ВыгрузитьДокументыИзМассиваПакетов(КонтекстФункции.Данные);
	Действие = КонтекстФункции.Параметры;
	
	ПараметрыМетода = ПараметрыВМассивЛок(ДокументыДляОбработки, Действие);
	
	ТекущаяОперация = ДлительныеОперации_ВыполнитьОперациюВызовСервера(ИмяМетода, ПараметрыМетода);
	
	ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация);
	
КонецПроцедуры

// #КонецОбласти ОбработкаДокументовДляДействийБезПодписания

// #КонецОбласти МассоваяОбработкаДокументов

// #Область ОбработкаОчередиЗадач

// BSLLS:NumberOfOptionalParams-off
// BSLLS:NumberOfParams-off
&НаКлиенте
Функция Новый_ПараметрыГрупповойОбработки(
	ДанныеДляОбработки,
	Действие,
	КатегорияМетрики,
	ДействиеМетрики,
	ФормаВыполнения,
	ИдентификаторЯщика = Неопределено,
	КонтрагентПоддерживаетМЧД = Истина,
	ВыполнениеИзФормыПакета = Ложь,
	РежимОтображенияДокументов = Неопределено,
	ИдентификаторОсновнойФормы = Неопределено,
	ОписаниеОповещения = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеДляОбработки", ДанныеДляОбработки);
	Результат.Вставить("Действие", Действие);
	Результат.Вставить("КатегорияМетрики", КатегорияМетрики);
	Результат.Вставить("ДействиеМетрики", ДействиеМетрики);
	Результат.Вставить("ФормаВыполнения", ФормаВыполнения);
	Результат.Вставить("ГрупповоеДействие", Ложь);
	Результат.Вставить("ИдентификаторЯщика", ИдентификаторЯщика);
	Результат.Вставить("КонтрагентПоддерживаетМЧД", КонтрагентПоддерживаетМЧД);
	Результат.Вставить("ВыполнениеИзФормыПакета", ВыполнениеИзФормыПакета);
	Результат.Вставить("РежимОтображенияДокументов", РежимОтображенияДокументов);
	Результат.Вставить("ИдентификаторОсновнойФормы", ИдентификаторОсновнойФормы);
	Результат.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	Результат.Вставить("ИсточникОткрытия", Неопределено);
	
	Возврат Результат;
	
КонецФункции
// BSLLS:NumberOfOptionalParams-on
// BSLLS:NumberOfParams-on

&НаКлиенте
Процедура ПоказатьПредупреждениеОНевозможностиВыполненияДействия(ПараметрыОбработки) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Действие = ПараметрыОбработки.Действие;
	ДействияЭДО = Ядро.Перечисление_ДействияЭДО();
	
	ЗаголовокПредупреждения	= "";
	ТекстПредупреждения		= "";
	
	Если Действие = ДействияЭДО.ПередатьНаСогласование Тогда
		
		ЗаголовокПредупреждения	= "Невозможно передать документы на согласование";
		ТекстПредупреждения		= "Выбранные документы нельзя передать на согласование.";
		
	ИначеЕсли Действие = ДействияЭДО.ПередатьНаПодпись Тогда
		
		ЗаголовокПредупреждения	= "Невозможно передать документы на подпись";
		ТекстПредупреждения		= "Выбранные документы нельзя передать на подпись.";
		
	ИначеЕсли Действие = ДействияЭДО.ПередатьПоМаршруту Тогда
		
		ЗаголовокПредупреждения	= "Невозможно передать документы по маршруту";
		ТекстПредупреждения		= "Выбранные документы нельзя передать по маршруту";
		
	ИначеЕсли Действие = ДействияЭДО.Согласование Тогда
		
		ЗаголовокПредупреждения	= "Не удалось согласовать документы.";
		ТекстПредупреждения		= "Возможно, документы уже согласованы.";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказВСогласовании Тогда
		
		ЗаголовокПредупреждения	= "Не удалось отказать в согласовании по документам.";
		ТекстПредупреждения		= "Возможно, по документам уже отказано в согласовании.";
		
	ИначеЕсли Действие = ДействияЭДО.Аннулировать Тогда
		
		ЗаголовокПредупреждения = "Невозможно аннулировать документы по одной из причин:";
		ТекстПредупреждения = " - Документы уже аннулированы
							  | - Документы недоступны для аннулирования";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказатьВАннулировании Тогда
		
		ЗаголовокПредупреждения = "Невозможно отказать в аннулировании по одной из причин:";
		ТекстПредупреждения = " - Документы уже аннулированы
							  | - Документы не требуют аннулирования";
		
	ИначеЕсли Действие = ДействияЭДО.ПодписатьИОтправить Тогда
		
		ЗаголовокПредупреждения	= "Невозможно отправить документы";
		ТекстПредупреждения		= "Выбранные документы должны быть в статусе ""Требуется подписать и отправить"" и не быть на согласовании.";
		
	ИначеЕсли Действие = ДействияЭДО.ОтправитьОтвет Тогда
		
		ЗаголовокПредупреждения	= "Невозможно отправить готовые ответы";
		ТекстПредупреждения		= "Не найдены подготовленные ответы для выбранных документов";
		
	ИначеЕсли Действие = ДействияЭДО.ПодписатьВходящий Тогда
		
		ЗаголовокПредупреждения	= "Невозможно подписать документы";
		ТекстПредупреждения		= "Выбранные документы нельзя подписать по причине:
								  |статус документа не позволяет осуществить действие.";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказатьВПодписи Тогда
		
		ЗаголовокПредупреждения	= "Невозможно отказать в подписи по документам";
		ТекстПредупреждения		= "Выбранные документы нельзя отказать в подписи по причине:
								  |статус документа не позволяет осуществить действие.";
		
	ИначеЕсли Действие = ДействияЭДО.ПереотправитьПакет Тогда
		
		ЗаголовокПредупреждения = "Переотправка документов";
		ТекстПредупреждения = "Выбранные документы недоступны для переотправки";
		
	Иначе
		ВызватьИсключение "Попытка выполнить неизвестное действие!";
	КонецЕсли;
	
	ПоказатьПредупреждениеЛок(Неопределено, ТекстПредупреждения, , ЗаголовокПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМассовуюОбработкуДанных(
	ИмяОбработчика,
	ДанныеДляОбработки,
	Действие,
	ДополнительныеПараметры = Неопределено,
	ОписаниеОповещения = Неопределено,
	ОбрабатываютсяДокументыНаОтправку = Ложь
	) Экспорт
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	ОчередьЗадач = Новый_ОчередьАсинхронныхЗадач();
	ОчередьЗадач.ЗаголовокФормыПрогресса = ЗаголовокФормыПрогресса(ОбрабатываютсяДокументыНаОтправку);
	ОчередьЗадач.ЗаголовокВыполненнойОчереди = ПредставлениеДействияЭДО(Действие);
	
	КатегорияМетрики = Метрика_НазваниеКатегорийМассовыхДействий(Действие);
	
	Если ЗначениеЗаполнено(КатегорияМетрики) Тогда
		Модуль_Ядро.Метрика_ДобавитьЗамер_СУчетомЗаполненияКонтекста(КатегорияМетрики);
	КонецЕсли;
	
	КоличествоПакетовВПорции = Модуль_Ядро.КоличествоПакетовВГрупповойОперации();
	
	ПорцииДанных = Модуль_Ядро.ПорцииДанныхМассива(ДанныеДляОбработки, КоличествоПакетовВПорции);
	
	Для Каждого ПорцияДанных Из ПорцииДанных Цикл
		
		КонтекстФункции = Новый Структура;
		КонтекстФункции.Вставить("Обработчик", ИмяОбработчика);
		КонтекстФункции.Вставить("Данные", ПорцияДанных);
		КонтекстФункции.Вставить("Параметры", ДополнительныеПараметры);
		
		ОчередьЗадач.ПулЗадач.Добавить(КонтекстФункции);
		
	КонецЦикла;
	
	Модуль_Ядро.СписокОшибок_Очистить();
	
	ОбработатьОчередьЗадач(ОчередьЗадач);
	
	Если ЗначениеЗаполнено(КатегорияМетрики) Тогда
		
		КоличествоДокументов = ДанныеДляОбработки.Количество();
		
		ДопПеременные = Новый Соответствие;
		ДопПеременные.Вставить("Количество документов", КоличествоДокументов);
		
		Модуль_Ядро.Метрика_ДобавитьЗамер_СУчетомЗаполненияКонтекста(КатегорияМетрики, Ложь, ДопПеременные);
		
	КонецЕсли;
	
	Если ОписаниеОповещения = Неопределено Тогда
		
		ФормаВыполнения = СвойствоСтруктуры(ДополнительныеПараметры, "ФормаВыполнения");
		ЗавершениеОбработкиДокументов(Действие, ФормаВыполнения);
		
	Иначе
		ОписаниеОповещения.ДополнительныеПараметры.Вставить("Действие", Действие);
		ОписаниеОповещения.ДополнительныеПараметры.Вставить("ПредыдущееДействие", Истина);
		ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбработкиДокументов(Действие, ФормаВыполнения) Экспорт
	
	Пакеты_ВыполнитьОчисткуУстаревшихПодготовленных(Действие);
	
	СписокОшибок = СписокОшибокВызовСервера();
	
	Если ЗначениеЗаполнено(СписокОшибок) Тогда
		ПоказатьОшибкиОбработкиДанных(Действие, ФормаВыполнения, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СписокОшибокВызовСервера()
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.СписокОшибок();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОчередьЗадач(ОчередьЗадач)
	
	КоличествоПотоков	 = ОчередьЗадач.КоличествоПотоков;
	НовыеЗадачи			 = ОчередьЗадач.ПулЗадач;
	ВсегоЗадач			 = НовыеЗадачи.Количество();
	ВыполненоЗадач		 = 0;
	
	КоличествоДокументовДляОбработки = ОчередьЗадач_КоличествоДокументовВЗадачах(НовыеЗадачи);
	
	Если КоличествоДокументовДляОбработки > 1 Тогда
		
		ФормаПрогресса = Форма_ПрогрессВыполнения();
		
		ФормаПрогресса.МассоваяОбработка = Истина;
		ФормаПрогресса.УстановитьМаксимальноеЗначение(КоличествоДокументовДляОбработки);
		ФормаПрогресса.УстановитьЗаголовок(СтрЗаменить(ОчередьЗадач.ЗаголовокФормыПрогресса, "%количество%", КоличествоДокументовДляОбработки));
		ФормаПрогресса.УстановитьЗаголовокВыполненнойОчереди(ОчередьЗадач.ЗаголовокВыполненнойОчереди);
		ФормаПрогресса.УстановитьНадписиПриОтправкеПакетов(КоличествоДокументовДляОбработки, 0);
		ФормаПрогресса.УстановитьЗначениеПрогресса(0);
		
	КонецЕсли;
	
	ТекущиеЗадачи = Новый Массив;
	НачалоОбработки = Истина;
	
	Пока ВсегоЗадач > ВыполненоЗадач Цикл
		
		ЕстьСвободныеПотоки				 = ТекущиеЗадачи.Количество() < КоличествоПотоков;
		МожноДобавитьЗадачиДляВыполнения = ЕстьСвободныеПотоки И ЗначениеЗаполнено(НовыеЗадачи);
		
		Если Не НачалоОбработки И Не МожноДобавитьЗадачиДляВыполнения Тогда
			ОчередьЗадач_ПодождатьЗавершенияЛюбойОперации(ТекущиеЗадачи);
		КонецЕсли;
		
		Если МожноДобавитьЗадачиДляВыполнения Тогда
			ОчередьЗадач_ДобавитьЗадачиДляВыполнения(ТекущиеЗадачи, НовыеЗадачи, КоличествоПотоков);
		КонецЕсли;
		
		ВыполненоЗадачДо = ВыполненоЗадач;
		
		ОчередьЗадач_ВыполнитьЗадачи(ТекущиеЗадачи);
		
		ВыполненоЗадач = ВсегоЗадач - НовыеЗадачи.Количество() - ТекущиеЗадачи.Количество();
		
		ОсталосьОбработатьДокументов = ОчередьЗадач_КоличествоДокументовВЗадачах(НовыеЗадачи);
		
		Если ФормаПрогресса <> Неопределено
			И ОсталосьОбработатьДокументов > 0 Тогда
			
			УжеОбработаноДокументов = КоличествоДокументовДляОбработки - ОсталосьОбработатьДокументов;
			ФормаПрогресса.УстановитьЗначениеПрогресса(УжеОбработаноДокументов);
			ФормаПрогресса.УстановитьНадписиПриОтправкеПакетов(КоличествоДокументовДляОбработки, УжеОбработаноДокументов);
		КонецЕсли;
		
		НачалоОбработки = Ложь;
		
	КонецЦикла;
	
	Если ФормаПрогресса <> Неопределено Тогда
		ФормаПрогресса.фЗакрытьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пакеты_ВыполнитьОчисткуУстаревшихПодготовленных(ДействиеЭДО) Экспорт
	
	Если ИспользуетсяПодсистемаДиадок Тогда
		
		Ядро = Модуль_ЯдроНаКлиенте();
		ДействияЭДО = Ядро.Перечисление_ДействияЭДО();
		
		Если ДействиеЭДО = ДействияЭДО.ПодписатьИОтправить
			ИЛИ ДействиеЭДО = ДействияЭДО.ПередатьНаСогласование
			ИЛИ ДействиеЭДО = ДействияЭДО.ПередатьНаПодпись
			ИЛИ ДействиеЭДО = ДействияЭДО.ПередатьПоМаршруту Тогда
			
			Пакеты_ВыполнитьОчисткуУстаревшихПодготовленныхВызовСервера();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Пакеты_ВыполнитьОчисткуУстаревшихПодготовленныхВызовСервера()
	
	Модуль_Ядро().Пакеты_ВыполнитьОчисткуУстаревшихПодготовленных();
	
КонецПроцедуры

&НаКлиенте
Функция ОчередьЗадач_КоличествоДокументовВЗадачах(Задачи)
	
	Результат = 0;
	
	Для каждого Задача Из Задачи Цикл
		Результат = Результат + Задача.Данные.Количество();
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОчередьЗадач_ДобавитьЗадачиДляВыполнения(ТекущиеЗадачи, НовыеЗадачи, МаксимальноеКоличествоЗадач)
	
	Для Сч = -НовыеЗадачи.ВГраница() По 0 Цикл
		
		Если ТекущиеЗадачи.Количество() >= МаксимальноеКоличествоЗадач Тогда
			Прервать;
		КонецЕсли;
		
		КонтекстФункции = НовыеЗадачи[-Сч];
		
		НовыеЗадачи.Удалить(-Сч);
		ТекущиеЗадачи.Вставить(0, КонтекстФункции);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЗадач_ВыполнитьЗадачи(ТекущиеЗадачи)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Для Сч = -ТекущиеЗадачи.ВГраница() По 0 Цикл
		
		ИндексЗадачи = -Сч;
		
		КонтекстФункции = ТекущиеЗадачи[ИндексЗадачи];
		
		Если КонтекстФункции.Свойство("ТекущаяОперация")
			И НЕ КонтекстФункции.ТекущаяОперация.Завершено Тогда
			
			ДлительнаяОперация_ПроверитьРезультатВызовСервера(КонтекстФункции.ТекущаяОперация);
			
			Если КонтекстФункции.ТекущаяОперация.Завершено Тогда
				
				Если ЗначениеЗаполнено(КонтекстФункции.ТекущаяОперация.ТекстОшибки) Тогда
					ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции);
				КонецЕсли;
				
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если КонтекстФункции.Свойство("ЗавершитьЗадачу") Тогда
			ТекущиеЗадачи.Удалить(ИндексЗадачи);
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ОчередьЗадач_ВыполнитьЗадачуБезопасно(КонтекстФункции);
			
		Исключение
			
			Ошибка = ИнформацияОбОшибке();
			ТекстСообщения = КраткоеПредставлениеОшибки(Ошибка);
			
			Ядро.Ошибка_Обработать(
				КонтекстФункции.Обработчик,
				Ошибка,
				ТекстСообщения
			);
			
			ТекущиеЗадачи.Удалить(ИндексЗадачи);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЗадач_ВыполнитьЗадачуБезопасно(КонтекстФункции)
	
	Обработчик = КонтекстФункции.Обработчик;
	
	Если Обработчик = "ПакетДляОтправки" Тогда
		
		ПакетДляОтправки(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ОтправитьПакет" Тогда
		
		ОтправитьПакет(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ПерезаполнитьПакет" Тогда
		
		ПерезаполнитьПакет(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ЗаполнитьПараметрыПереотправки" Тогда
		
		ЗаполнитьПараметрыПереотправки(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ОтправитьДокументыНаМаршрутизацию" Тогда
		
		ОтправитьДокументыНаМаршрутизацию(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ПередатьВПодразделение" Тогда
		
		ПередатьВПодразделение(КонтекстФункции);
		
	ИначеЕсли Обработчик = "СохранитьДокументы" Тогда
		
		СохранитьДокументы(КонтекстФункции);
		
	ИначеЕсли Обработчик = "РасшифроватьДокументы" Тогда
		
		РасшифроватьДокументы(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ПометитьДокументыКакЗавершенные" Тогда
		
		ПометитьДокументыКакЗавершенные(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ТребуемоеДействие" Тогда
		
		ТребуемоеДействие(КонтекстФункции);
		
	ИначеЕсли Обработчик = "АнализДокументов" Тогда
		
		АнализДокументов(КонтекстФункции);
		
	ИначеЕсли Обработчик = "АнализПакетов" Тогда
		
		АнализПакетов(КонтекстФункции);
		
	ИначеЕсли Обработчик = "СопоставитьДокументы" Тогда
		
		СопоставитьДокументы(КонтекстФункции);
		
	ИначеЕсли Обработчик = "СоздатьДокументы" Тогда
		
		СоздатьДокументы(КонтекстФункции);
		
	ИначеЕсли Обработчик = "СоздатьДокументыПоПравилу" Тогда
		
		СоздатьДокументыПоПравилу(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ОбработатьДокументыСПодписанием" Тогда
		
		ОбработатьДокументыСПодписанием(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ЗавершитьОбработкуДокументовСПодписанием" Тогда
		
		ЗавершитьОбработкуДокументовСПодписанием(КонтекстФункции);
		
	ИначеЕсли Обработчик = "ОбработатьДокументыБезПодписания" Тогда
		
		ОбработатьДокументыБезПодписания(КонтекстФункции);
		
	Иначе
		
		ТекстОшибки = Модуль_ЯдроНаКлиенте().Общее_ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неизвестный обработчик асинхронной задачи %1'"), Обработчик);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЗадач_ЗавершитьЗадачу(КонтекстФункции, ТекущаяОперация = Неопределено)
	
	КонтекстФункции.Очистить();
	
	КонтекстФункции.Вставить("ЗавершитьЗадачу");
	
	Если ТекущаяОперация <> Неопределено Тогда
		КонтекстФункции.Вставить("ТекущаяОперация", ТекущаяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЗадач_ПодождатьЗавершенияЛюбойОперации(ОчередьЗадач)
	
	ИдентификаторыЗаданий = Новый Массив;
	
	Для каждого КонтекстФункции Из ОчередьЗадач Цикл
	
		ТекущаяОперация = СвойствоСтруктуры(КонтекстФункции, "ТекущаяОперация");
		ИдентификаторЗадания = СвойствоСтруктуры(ТекущаяОперация, "ИдентификаторЗадания");
		
		Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
			ИдентификаторыЗаданий.Добавить(ИдентификаторЗадания);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдентификаторыЗаданий) Тогда
		ФоновоеЗадание_ПодождатьЗавершенияЛюбогоЗадания(ИдентификаторыЗаданий);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОчередьЗадач_ВыгрузитьДокументыИзМассиваПакетов(Пакеты)
	
	Результат = Новый Массив;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Для каждого Пакет Из Пакеты Цикл
		Ядро.ДополнитьМассив(Результат, Пакет.Документы, Ложь);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ФоновоеЗадание_ПодождатьЗавершенияЛюбогоЗадания(Знач ИдентификаторыЗаданий)
	
	Ядро = Модуль_Ядро();
	Ядро.ФоновоеЗадание_ПодождатьЗавершенияЛюбогоЗадания(ИдентификаторыЗаданий);
	
КонецПроцедуры

&НаСервере
Процедура ДлительнаяОперация_ПроверитьРезультатВызовСервера(ОписаниеОперации, Знач ОжидатьЗавершения = Ложь)
	
	Ядро = Модуль_Ядро();
	Ядро.ДлительнаяОперация_ПроверитьРезультат(ОписаниеОперации, ОжидатьЗавершения);
	
КонецПроцедуры

// Возвращает категорию метрики на основании значения действия ЭДО.
// 
// Параметры:
//    Действие - Строка - Значение метода Перечисление_ДействияЭДО Модуля Ядро.
// 
// Возвращаемое значение:
//    Строка - Наименование категории метрики из метода Метрика_НазваниеКатегории Модуля Ядро.
// 
&НаКлиенте
Функция Метрика_НазваниеКатегорийМассовыхДействий(Действие)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействияЭДО = Ядро.Перечисление_ДействияЭДО();
	Метрика_НазваниеКатегории = Ядро.Метрика_НазваниеКатегории();
	
	Если Действие = ДействияЭДО.СоздатьДокумент Тогда
		КатегорияМетрики = Метрика_НазваниеКатегории.СозданиеДокументов;
	ИначеЕсли Действие = ДействияЭДО.СопоставитьДокумент Тогда
		КатегорияМетрики = Метрика_НазваниеКатегории.СопоставлениеДокументов;
	ИначеЕсли Действие = ДействияЭДО.ПодписатьИОтправить Тогда
		КатегорияМетрики = Метрика_НазваниеКатегории.ОтправкаДокумента;
	ИначеЕсли Действие = ДействияЭДО.ОтправитьОтвет Тогда
		КатегорияМетрики = Метрика_НазваниеКатегории.ПодписаниеВходящегоДокумента;
	Иначе
		КатегорияМетрики = Метрика_НазваниеКатегории.ДействиеНеОпределено;
	КонецЕсли;
	
	Возврат КатегорияМетрики;

КонецФункции

&НаКлиенте
Функция Новый_ОчередьАсинхронныхЗадач()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПулЗадач", Новый Массив);
	Результат.Вставить("КоличествоПотоков", 10);
	Результат.Вставить("ЗаголовокФормыПрогресса");
	Результат.Вставить("ЗаголовокВыполненнойОчереди");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаголовокФормыПрогресса(ОбрабатываютсяДокументыНаОтправку)
	
	ОбрабатываемаяСущность = НРег(ОбрабатываемаяСущность(ОбрабатываютсяДокументыНаОтправку));
	
	Результат = "Обработка %количество% " + ОбрабатываемаяСущность + "ов";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбрабатываемаяСущность(ОбрабатываютсяДокументыНаОтправку)
	
	Если ОбрабатываютсяДокументыНаОтправку Тогда
		Результат = "Пакет";
	Иначе
		Результат = "Документ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросОЧастичномВыполненииДействия(ПараметрыОбработки, ОписаниеОповещенияЗавершения) Экспорт
	
	ТекстВопроса		= "";
	КнопкиВопроса		= Новый СписокЗначений;
	КнопкаПоУмолчанию	= КодВозвратаДиалога.Да;
	ЗаголовокВопроса	= "";
	Действие			= ПараметрыОбработки.Действие;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДействияЭДО = Ядро.Перечисление_ДействияЭДО();
	
	Если Действие = ДействияЭДО.ПередатьНаСогласование Тогда
		
		ЗаголовокВопроса	= "Невозможно передать на согласование все документы";
		ТекстВопроса		= "Среди выбранных есть документы, которые невозможно передать на согласование.";
		ТекстКнопки			= "Передать на согласование доступные документы";
		
	ИначеЕсли Действие = ДействияЭДО.ПередатьНаПодпись Тогда
		
		ЗаголовокВопроса	= "Невозможно передать на подпись все документы";
		ТекстВопроса 		= "Среди выбранных есть документы, которые невозможно передать на подпись.";
		ТекстКнопки			= "Передать на подпись доступные документы";
		
	ИначеЕсли Действие = ДействияЭДО.ПередатьПоМаршруту Тогда
		
		ЗаголовокВопроса	= "Невозможно передать по маршруту все документы";
		ТекстВопроса		= "Среди выбранных есть документы, которые невозможно передать по маршруту.";
		ТекстКнопки			= "Передать по маршруту доступные документы";
		
	ИначеЕсли Действие = ДействияЭДО.Согласование Тогда
		
		ЗаголовокВопроса	= "Невозможно согласовать все документы";
		ТекстВопроса		= "Среди выбранных есть документы, которые невозможно согласовать.";
		ТекстКнопки			= "Согласовать доступные документы";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказВСогласовании Тогда
		
		ЗаголовокВопроса	= "Невозможно отказать в согласовании всех документов";
		ТекстВопроса		= "Среди выбранных есть документы, по которым невозможно отказать в согласовании.";
		ТекстКнопки			= "Отказать в согласовании доступных документов";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказВЗапросеПодписи Тогда
		
		ЗаголовокВопроса	= "Невозможно отказать в запросе сотруднику всех документов";
		ТекстВопроса		= "Среди выбранных есть документы, по которым невозможно отказать в запросе сотруднику.";
		ТекстКнопки			= "Отказать в запросе сотруднику доступных документов";
		
	ИначеЕсли Действие = ДействияЭДО.ПодписатьВходящий Тогда
		
		ЗаголовокВопроса	= "Невозможно подписать все документы";
		ТекстВопроса		= "Среди выбранных есть документы, которые нельзя подписать.";
		ТекстКнопки			= "Подписать доступные документы";
		
	ИначеЕсли Действие = ДействияЭДО.ОтказатьВПодписи Тогда
		
		ЗаголовокВопроса	= "Невозможно отказать в подписи по всем документам";
		ТекстВопроса		= "Среди выбранных есть документы, по которым нельзя отказать в подписи.";
		ТекстКнопки			= "Отказать в подписи по доступным документам";
		
	ИначеЕсли Действие = ДействияЭДО.ОтправитьОтвет Тогда
		
		ЗаголовокВопроса	= "Невозможно отправить готовые ответы для всех документов";
		ТекстВопроса		= "Среди выбранных есть документы, по которым не подготовлены ответы.";
		ТекстКнопки			= "Отправить подготовленные ответы";
		
	ИначеЕсли Действие = ДействияЭДО.ПереотправитьПакет Тогда
		
		ЗаголовокВопроса	= "Невозможно переотправить все документы";
		ТекстВопроса		= "Среди выбранных есть документы, для которых нельзя выполнить действие ""Переотправить""";
		ТекстКнопки			= "Переотправить";
		
	КонецЕсли;
	
	КоличествоДоступныхПрописью = Формат(ПараметрыОбработки.ДанныеДляОбработки.Количество(), "ЧГ=0");
	
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, ТекстКнопки + " (" + КоличествоДоступныхПрописью + ")");
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена);
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Прервать, "Подробнее...");
	
	ПоказатьВопросЛок(ОписаниеОповещенияЗавершения, ТекстВопроса, КнопкиВопроса, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

// #КонецОбласти ОбработкаОчередиЗадач

// #Область ТЕХПОДДЕРЖКА

// Открывает окно выбора ораганизации и затем - страницу Центра поддержки
//
// Параметры:
//  КатегорияМетрики - Строка, Неопределено - категоря метрики
//  НазваниеФормы - Строка, Неопределено - Название формы для записи TraceId
//  РежимОткрытияЦП - Строка, Неопределено - см Ядро.ЦП_РежимыОткрытияЦП()
// 
&НаКлиенте
Процедура ЦентрПоддержки_Открыть(
	Знач КатегорияМетрики = Неопределено,
	Знач НазваниеФормы = Неопределено,
	РежимОткрытияЦП = Неопределено) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Если НЕ ЗначениеЗаполнено(КатегорияМетрики) Тогда
		КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().Техподдержка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НазваниеФормы) Тогда
		НазваниеФормы = НазваниеОсновнойФормы();
	КонецЕсли;
	
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ЗадатьВопросОнлайнКонсультанту;
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, КатегорияМетрики, ДействиеМетрики);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КатегорияМетрики"	, КатегорияМетрики);
	ДополнительныеПараметры.Вставить("РежимОткрытияЦП"	, РежимОткрытияЦП);
	
	ОбработкаВыбораОрганизации = НовыйОписаниеОповещения(
		"ОткрытьЦентрПоддержкиПродолжение",
		ЭтаФорма,
		ДополнительныеПараметры
	);
	
	ПоказатьПредупреждениеПриПустомСписке = Ложь;
	
	ВыбратьОрганизациюДляОбращения(
		ОбработкаВыбораОрганизации,
		ПоказатьПредупреждениеПриПустомСписке
	);
	
КонецПроцедуры

// Обработчик оповещения. Продолжает метод ЦентрПоддержки_Открыть()
//
// Параметры:
//  ВыбранныйЭлемент - ЭлементСпискаЗначений, Неопределено - выбранная организация, см. ВыбратьОрганизациюДляОбращения()
//  ДополнительныеПараметры - Структура
//
&НаКлиенте
Функция ОткрытьЦентрПоддержкиПродолжение(ВыбранныйЭлемент = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	КатегорияМетрики = ДополнительныеПараметры.КатегорияМетрики;
	РежимОткрытияЦП = ДополнительныеПараметры.РежимОткрытияЦП;
	
	Если ВыбранныйЭлемент = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(ВыбранныйЭлемент.Значение) Тогда
		BoxId = "";
	Иначе
		BoxId = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	ПараметрыИнициализации = ЦП_НовыйПараметрыОткрытияСессии(BoxId, РежимОткрытияЦП);
	
	МодульЯдро = Модуль_ЯдроНаКлиенте();
	РаботаСHTTP = МодульЯдро;
	РаботаСJson = МодульЯдро;
	
	Модуль_ЦП = МодульЯдро.Модуль_ЦентрПоддержки(ЭтаФорма);
	Модуль_ЦП.Инит(
		ПараметрыИнициализации.ИмяИнтеграции,
		РаботаСHTTP,
		РаботаСJson,
		ПараметрыИнициализации.ТестовоеОкружение
	);
	
	ПараметрыСессии = Модуль_ЦП.МодельПараметрыСессии();
	ПараметрыСессии.ИНН = ПараметрыИнициализации.ИНН;
	ПараметрыСессии.КПП = ПараметрыИнициализации.КПП;
	ПараметрыСессии.Организация = ПараметрыИнициализации.Организация;
	ПараметрыСессии.Логин = ПараметрыИнициализации.Логин;
	ПараметрыСессии.ИмяПользователя = ПараметрыИнициализации.ИмяПользователя;
	ПараметрыСессии.ДополнительныеПараметры = ПараметрыИнициализации.ДополнительныеПараметры;
	
	ОписаниеФайла = Модуль_ЦП.МодельФайла();
	ОписаниеФайла.Данные = ПараметрыИнициализации.ВложениеДвоичныеДанные;
	ОписаниеФайла.ИмяФайла = ПараметрыИнициализации.ВложениеИмяФайла;
	ПараметрыСессии.Файлы.Добавить(ОписаниеФайла);
	
	БраузерОткрылся = Ложь;
	МодульПоддержки = "Главная";
	
	Результат = Модуль_ЦП.ОткрытьЦентрПоддержки(
			ПараметрыСессии,
			МодульПоддержки,
			БраузерОткрылся);
	
	Если НЕ ЗначениеЗаполнено(КатегорияМетрики) Тогда
		КатегорияМетрики = МодульЯдро.Метрика_НазваниеКатегории().Техподдержка;
	КонецЕсли;
	
	ДействиеМетрики = МодульЯдро.Метрика_НазваниеДействий().ЗадатьВопросОнлайнКонсультанту;
	
	ПеременныеМетрики = Новый Структура;
	ПеременныеМетрики.Вставить("БраузерОткрылся", БраузерОткрылся);
	
	МодульЯдро.Метрика_ДобавитьСтатистику_ДляОрганизации(
		BoxId,
		КатегорияМетрики,
		ДействиеМетрики,
		,
		ПеременныеМетрики);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЦП_НовыйПараметрыОткрытияСессии(BoxId, РежимОткрытияЦП = Неопределено) Экспорт
	
	Результат = ЦП_НовыйПараметрыОткрытияСессииВызовСервера(BoxId, РежимОткрытияЦП);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЦП_НовыйПараметрыОткрытияСессииВызовСервера(BoxId, РежимОткрытияЦП) Экспорт
	
	Модуль = ОбработкаОбъект();
	
	Результат = Модуль.ЦП_НовыйПараметрыОткрытияСессии(BoxId, РежимОткрытияЦП);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ОтправитьEmail(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбработкаВыбораОрганизации = НовыйОписаниеОповещения("ОтправитьEmailПродолжение", ЭтаФорма, ДополнительныеПараметры);
	
	ВыбратьОрганизациюДляОбращения(ОбработкаВыбораОрганизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьEmailПродолжение(ВыбранныйЭлемент = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйЭлемент.Значение) Тогда
		
		// вызов из формы экстренного уведомления - авторизация не пройдена, и из формы авторизации
		BoxId = "";
		РеквизитыОрганизации = Новый Структура;
		РеквизитыОрганизации.Вставить("Наименование", "");
		РеквизитыОрганизации.Вставить("ИНН", "");
		РеквизитыОрганизации.Вставить("КПП", "");
		
	Иначе
		
		BoxId = ВыбранныйЭлемент.Значение; // BoxId
		РеквизитыОрганизации = РеквизитыОрганизацииИзКонтекстаВызовСервера(BoxId);
		
	КонецЕсли;
	
	ИнформацияДляТехПоддержки = Новый ТекстовыйДокумент;
	
	ИнформацияДляТехподдержки.ДобавитьСтроку("Описание проблемы:");
	ИнформацияДляТехподдержки.ДобавитьСтроку("");
	ИнформацияДляТехподдержки.ДобавитьСтроку("");
	
	ИнформацияДляТехПоддержки.ДобавитьСтроку("----------------------------");
	ВывестиИнформациюОбОрганизацииВТекстовыйДокумент(ИнформацияДляТехПоддержки, РеквизитыОрганизации);
	
	ИнформацияДляТехПоддержки.ДобавитьСтроку("----------------------------");
	ТехИнфоТекст = ТекстовоеПредставлениеТехническойИнформации(BoxId);
	ИнформацияДляТехподдержки.ДобавитьСтроку(ТехИнфоТекст);
	
	ПереводСтроки = "%0A";
	ТелоПисьма = ПереводСтроки;
	КоличествоСтрок = ИнформацияДляТехПоддержки.КоличествоСтрок();
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл 
		
		ТекСтрока = ИнформацияДляТехПоддержки.ПолучитьСтроку(НомерСтроки);
		ТекСтрока = СтрЗаменить(ТекСтрока, "\"	, "%2F");
		ТекСтрока = СтрЗаменить(ТекСтрока, """"	, "%22");
		
		ТелоПисьма = ТелоПисьма + ПереводСтроки + ТекСтрока;
		
	КонецЦикла;
	
	Гиперссылка = "mailto:[кому]?subject=[тема]&body=[тело]";
	Гиперссылка = СтрЗаменить(Гиперссылка, "[кому]", "diadoc@skbkontur.ru");
	Гиперссылка = СтрЗаменить(Гиперссылка, "[тема]", "Диадок. Модуль 1С");
	Гиперссылка = СтрЗаменить(Гиперссылка, "[тело]", ТелоПисьма);
	
	ЗапуститьПриложение(Гиперссылка);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики = "Написать письмо в техподдержку";
	
	Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаСервере
Функция ТекстовоеПредставлениеТехническойИнформации(BoxId)
	
	Ядро = Модуль_Ядро();
	ТехИнфо = Ядро.ТехническаяИнформацияV2(BoxId);
	Результат = Ядро.ТехническаяИнформацияКакТекст(ТехИнфо);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция РеквизитыОрганизацииИзКонтекстаВызовСервера(BoxId)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.РеквизитыОрганизацииИзКонтекста(BoxId);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СформироватьТехническуюИнформациюВызовСервера(BoxId, ВыводитьНезаполненныеПараметры)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	Результат = ОбработкаОбъект.СформироватьТехническуюИнформацию(BoxId, ВыводитьНезаполненныеПараметры);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьОрганизациюДляОбращения(ОписаниеОповещения, ПоказатьПредупреждениеПриПустомСписке = Истина)
	
	СписокВыбора = Организации_СписокОрганизацийДляВыбораВызовСервера(Истина);
	СписокПустой = СписокВыбора.Количество() = 0;
	
	Если СписокПустой 
		И ПоказатьПредупреждениеПриПустомСписке Тогда 
		
		ТекстПредупреждения = НСтр("ru = 'Список организаций пуст!'");
		ТаймаутЛок = 60;
		ПоказатьПредупреждениеЛок(Неопределено, ТекстПредупреждения, ТаймаутЛок);
		
	ИначеЕсли СписокПустой Тогда
		
		ВыбранныйЭлемент = Неопределено;
		ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещения, ВыбранныйЭлемент);
		
	ИначеЕсли СписокВыбора.Количество() = 1 Тогда 
		
		ВыбранныйЭлемент = СписокВыбора[0];
		ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещения, ВыбранныйЭлемент);
		
	Иначе
		
		ЗаголовокВыбораОрганизации	= НСтр("ru = 'Выберите организацию, от которой идет обращение'");
		ПоказатьВыборЭлемента(СписокВыбора, ОписаниеОповещения, ЗаголовокВыбораОрганизации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Организации_СписокОрганизацийДляВыбораВызовСервера(ДобавитьНеоплаченные)
	
	Ядро = Модуль_Ядро();
	
	Результат = Ядро.Организации_СписокОрганизацийДляВыбора(ДобавитьНеоплаченные);
	
	Возврат Результат;
	
КонецФункции

// Добавляет в текстовый документ сведения об организации:
// Наименование, ИНН, КПП
//
// Параметры:
//  ТекстовыйДокумент - ТекстовыйДокумент - заполняемый текстовый документ
&НаКлиенте
Процедура ВывестиИнформациюОбОрганизацииВТекстовыйДокумент(ТекстовыйДокумент, РеквизитыОрганизации)
	
	ТекстовыйДокумент.ДобавитьСтроку("Организация: " + РеквизитыОрганизации.Наименование);
	ТекстовыйДокумент.ДобавитьСтроку("ИНН: " + РеквизитыОрганизации.ИНН);
	ТекстовыйДокумент.ДобавитьСтроку("КПП: " + РеквизитыОрганизации.КПП);
	
КонецПроцедуры

// #КонецОбласти ТЕХПОДДЕРЖКА

// #Область УниверсальныеСообщения

// Возвращает текст HTML с предупреждением об отсутствии прав на формирование УС
//
// Параметры:
//  ЯщикиБезПраваНаФормированиеУС	 - Массив	 - Идентификаторы ящиков, для которых требуются права
// 
// Возвращаемое значение:
//   - Строка
//
&НаКлиенте
Функция HTML_ПредупреждениеОбОтсутствииПравНаФормированиеУС(ЯщикиБезПраваНаФормированиеУС) Экспорт
	
	Результат = HTML_ПредупреждениеОбОтсутствииПравНаФормированиеУСВызовСервера(ЯщикиБезПраваНаФормированиеУС);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция HTML_ПредупреждениеОбОтсутствииПравНаФормированиеУСВызовСервера(ЯщикиБезПраваНаФормированиеУС)
	
	Модуль = ОбработкаОбъект();
	
	Результат = Модуль.HTML_ПредупреждениеОбОтсутствииПравНаФормированиеУС(ЯщикиБезПраваНаФормированиеУС);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти УниверсальныеСообщения
