////////////////////////////////////////////////////////////////////////////////
// Методы общего назначения клиент сервер
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Модуль содержит процедуры и функции из Библиотеки стандартных подсистем,
// распространяемой под лицензией Attribution 4.0 International (CC BY 4.0)
// https://creativecommons.org/licenses/by/4.0/legalcode производны от нее
// или вдохновлены ею, является ООО 1С-Софт (https://1c.ru/).
// Авторские права 2024 г. принадлежат ООО 1С-Софт. Все права защищены.
//
// Процедуры и функции из Библиотеки стандартных подсистем:
// - СравнитьВерсииЛок
// - СравнитьВерсииБезНомераСборкиЛок
// - ВерсияКонфигурацииБезНомераСборкиЛок
// - ВерсияПлатформыБольшеИлиРавна
// - АдресаЭлектроннойПочтыИзСтрокиЛок
// - АдресЭлектроннойПочтыСоответствуетТребованиямЛок
// - РазобратьСтрокуСПочтовымиАдресамиЛок
// - ДополнитьТаблицуЛок
// - ДополнитьМассивЛок
// - ДополнитьСтруктуруЛок
// - ДополнитьСоответствиеЛок
// - УдалитьВсеВхожденияЗначенияИзМассиваЛок
// - УдалитьЗначениеИзМассиваЛок
// - СвернутьМассивЛок
// - ЗначениеВМассивеЛок
// - СвойствоСтруктурыЛок
// - ЕстьРеквизитИлиСвойствоОбъектаЛок
// - СтрокаВДатуЛок
// - СообщениеПользователюЛок
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// БСП: ВЕРСИОНИРОВАНИЕ

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсия1  - Строка - номер версии.
//  СтрокаВерсия2  - Строка - номер сравниваемой версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
Функция СравнитьВерсииЛок(Знач СтрокаВерсия1, Знач СтрокаВерсия2) Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.СравнитьВерсииЛок(СтрокаВерсия1, СтрокаВерсия2);
	
КонецФункции // СравнитьВерсииЛок

// Сравнить две строки версий. Номером сборки считается 4 разряд версии
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
Функция СравнитьВерсииБезНомераСборкиЛок(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.СравнитьВерсииБезНомераСборкиЛок(СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции // СравнитьВерсииБезНомераСборкиЛок

// Получает номер версии конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС - номер сборки, который будет удален.
//
// Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
Функция ВерсияКонфигурацииБезНомераСборкиЛок(Знач Версия) Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.ВерсияКонфигурацииБезНомераСборкиЛок(Версия);
	
КонецФункции // ВерсияКонфигурацииБезНомераСборкиЛок

// БСП: EMAIL АДРЕСА

// Разбирает строку с адресами электронной почты. При разборе проверяет корректность адресов.
//
// Параметры:
//  СписокАдресов - Строка - адреса электронной почты, разделитель - запятая, либо точка с запятой:
//                           Получатель1 <Адрес1>, Получатель 2 <Адрес2>,...
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Псевдоним      - Строка - представление адресата.
//   * Адрес          - Строка - найденный и соответствующий требованиям почтовый адрес.
//                               Если текст, похожий на адрес найден, но не соответствует требованиям
//                               стандартов, то такой текст записывается в поле "Псевдоним".
//   * ОписаниеОшибки - Строка - текстовое представление ошибки, либо пустая строка, если ошибок нет.
//
Функция АдресаЭлектроннойПочтыИзСтрокиЛок(Знач СписокАдресов) Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.АдресаЭлектроннойПочтыИзСтрокиЛок(СписокАдресов);
	
КонецФункции // АдресаЭлектроннойПочтыИзСтрокиЛок

// Проверяет email-адрес на соответствие требованиям стандартов RFC 5321, RFC 5322,
// а также RFC 5335, RFC 5336 и RFC 3696.
// Кроме того, функция ограничивает использование спецсимволов.
//
// Параметры:
//  Адрес - Строка - проверяемый email.
//  РазрешитьЛокальныеАдреса - Булево - не выдавать ошибку в случае отсутствия зоны домена в адресе.
//
// Возвращаемое значение:
//  Булево - Истина, если ошибок нет.
//
Функция АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Знач Адрес, РазрешитьЛокальныеАдреса = Ложь) Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Адрес, РазрешитьЛокальныеАдреса);
	
КонецФункции // АдресЭлектроннойПочтыСоответствуетТребованиямЛок

// Проверяет, что введенная строка с email-адресами введена правильно.
//
// Формат строки:
//  Z = ИмяПользователя|[Имя Пользователя] [<]пользователь@почтовый_сервер[>], Строка = Z[<разделитель*>Z].
//
//  Прим.: разделитель* - имеется ввиду любой разделитель адресов.
//
// Параметры:
//  СтрокаПереданныхАдресов - Строка - правильная строка с почтовыми адресами.
//  ВызыватьИсключение - Булево - передать Ложь, чтобы в случае неуспешного разбора не выдавалось исключение.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Адрес - Строка - e-mail получателя.
//   * Представление - Строка - имя получателя.
//
Функция РазобратьСтрокуСПочтовымиАдресамиЛок(Знач СтрокаПереданныхАдресов, ВызыватьИсключение = Истина) Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.РазобратьСтрокуСПочтовымиАдресамиЛок(СтрокаПереданныхАдресов, ВызыватьИсключение);
	
КонецФункции // РазобратьСтрокуСПочтовымиАдресамиЛок

// БСП: КОЛЛЕКЦИИ

// Добавляет в таблицу приемник строки из таблицы источника
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой нужно взять строки
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую нужно добавить строки
//
Процедура ДополнитьТаблицуЛок(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	КонтурДиадокСтдКоллекцииКлиентСервер.ДополнитьТаблицуЛок(ТаблицаИсточник, ТаблицаПриемник);
	
КонецПроцедуры // ДополнитьТаблицуЛок

// Дополняет массив значениями из другого массива
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник - Массив - массив, из которого нужно взять значения;
//  ТолькоНовые - Булево - (необязательный) Истина, если в приемник
//					нужно добавить только те значения, которых там еще нет;
//
Процедура ДополнитьМассивЛок(МассивПриемник, МассивИсточник, ТолькоНовые = Ложь) Экспорт
	
	КонтурДиадокСтдКоллекцииКлиентСервер.ДополнитьМассивЛок(МассивПриемник, МассивИсточник, ТолькоНовые);
	
КонецПроцедуры // ДополнитьМассивЛок

// Дополняет структуру значениями из другой структуры.
//
// Параметры:
//   СтруктураПриемник - Структура - коллекция, в которую будут добавляться новые значения.
//   СтруктураИсточник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь   - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
Процедура ДополнитьСтруктуруЛок(СтруктураПриемник, СтруктураИсточник, Заменять = Неопределено) Экспорт
	
	КонтурДиадокСтдКоллекцииКлиентСервер.ДополнитьСтруктуруЛок(СтруктураПриемник, СтруктураИсточник, Заменять);
	
КонецПроцедуры // ДополнитьСтруктуруЛок

// Дополняет соответствие значениями из другой соответствия.
//
// Параметры:
//   СоответствиеПриемник - Соответствие - коллекция, в которую будут добавляться новые значения.
//   СоответствиеИсточник - Соответствие - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
Процедура ДополнитьСоответствиеЛок(СоответствиеПриемник, СоответствиеИсточник, Заменять = Неопределено) Экспорт
	
	КонтурДиадокСтдКоллекцииКлиентСервер.ДополнитьСоответствиеЛок(СоответствиеПриемник, СоответствиеИсточник, Заменять);
	
КонецПроцедуры // ДополнитьСоответствиеЛок

// Удаляет все вхождения переданного значения из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Произвольный - удаляемое значение из массива.
//
Процедура УдалитьВсеВхожденияЗначенияИзМассиваЛок(Массив, Значение) Экспорт
	
	КонтурДиадокСтдКоллекцииКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассиваЛок(Массив, Значение);
	
КонецПроцедуры // УдалитьВсеВхожденияЗначенияИзМассиваЛок

// Удаляет одно значение из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Массив - удаляемое значение из массива.
//
Процедура УдалитьЗначениеИзМассиваЛок(Массив, Значение) Экспорт
	
	КонтурДиадокСтдКоллекцииКлиентСервер.УдалитьЗначениеИзМассиваЛок(Массив, Значение);
	
КонецПроцедуры // УдалитьЗначениеИзМассиваЛок

// Возвращает копию исходного массива с уникальными значениями.
//
// Параметры:
//  Массив - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив - массив уникальных элементов.
//
Функция СвернутьМассивЛок(Знач Массив) Экспорт
	Возврат КонтурДиадокСтдКоллекцииКлиентСервер.СвернутьМассивЛок(Массив);
КонецФункции // СвернутьМассивЛок

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив - массив из одного элемента.
//
Функция ЗначениеВМассивеЛок(Знач Значение) Экспорт
	Возврат КонтурДиадокСтдКоллекцииКлиентСервер.ЗначениеВМассивеЛок(Значение);
КонецФункции // ЗначениеВМассивеЛок

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
//
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре 
//                                       нет указанного свойства.
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат КонтурДиадокСтдКоллекцииКлиентСервер.СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции // СвойствоСтруктурыЛок

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции // ЕстьРеквизитИлиСвойствоОбъектаЛок

// БСП: ПРИВЕДЕНИЕ ЗНАЧЕНИЙ

// Приводит строковое значение к дате.
//
// Параметры:
//  Значение - Строка - строковое значение, которое приводится к дате.
//
// Возвращаемое значение:
//   Дата - приведенное значение.
//
Функция СтрокаВДатуЛок(Знач Значение) Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.СтрокаВДатуЛок(Значение);
	
КонецФункции // СтрокаВДатуЛок

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция СообщениеПользователюЛок(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных,
		Знач Поле,
		Знач ПутьКДанным = "",
		Отказ = Ложь,
		ЭтоОбъект = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Отказ = Истина;
	
	Возврат Сообщение;
	
КонецФункции // СообщениеПользователюЛок