// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
// Булево - Истина, если используется сервис Контур.Маркировка
Перем _ИспользоватьКМ;

// Соответствие - см. ПравилаКонвертацииУпаковокКонтурМаркировка()
Перем _ПравилаКонвертацииУпаковокКМ;

// Соответствие - см. ПравилаКонвертацииТоварныхГруппКонтурМаркировка()
Перем _ПравилаКонвертацииТоварныхГруппКМ;

// Соответствие - см. ПравилаКонвертацииУпаковокИСМП()
Перем _ПравилаКонвертацииУпаковокИСМП;

// Соответствие - см. ПравилаКонвертацииВидаПродукцииИСМП()
Перем _ПравилаКонвертацииВидаПродукцииИСМП;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, "0.0.1");
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(ИспользоватьСервисКонтурМаркировка) Экспорт
	
	_ИспользоватьКМ = ИспользоватьСервисКонтурМаркировка;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//{		ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ЗаполнитьСведенияОМаркировке970(Контент) Экспорт
	
	Если _ИспользоватьКМ Тогда
		
		ЗаполнитьСведенияОМаркировке970_КонтурМаркировка(Контент);
		
	Иначе
		
		ЗаполнитьСведенияОМаркировке970_ИСМП(Контент);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает версию подсистемы Контур.Маркировки
// 
// Возвращаемое значение:
//  Строка, Неопределено - Версия подсистемы Контур Маркировки.
//                         Если подсистема установлена, но не компилится, то вернется 0.0.0.
//                         Если подсистема не найдена то возвращается Неопределено
//
Функция ВерсияПодсистемыКонтурМаркировки() Экспорт
	
	Результат = ВерсияУстановленнойПодсистемыКонтурМаркировка();
	
	Возврат Результат;
	
КонецФункции

// Возвращает версию модуля Контур.Маркировки
// 
// Возвращаемое значение:
//  Строка, Неопределено - Версия модуля Контур Маркировки.
//                         Если установленная подсистема ниже версии 3.0.0, то вернется 0.0.0.
//                         Если подсистема установлена, но не компилится, то вернется 0.0.0.
//                         Если подсистема или модуль не найдены, то возвращается Неопределено.
//
Функция ВерсияМодуляКонтурМаркировки() Экспорт
	
	Результат = ВерсияУстановленногоМодуляКонтурМаркировка();
	
	Возврат Результат;
	
КонецФункции

//}		ПРОГРАММНЫЙ ИНТЕРФЕЙС

//{		СВЕДЕНИЯ О МАРКИРОВКЕ КОНТУР МАРКИРОВКА

Процедура ЗаполнитьСведенияОМаркировке970_КонтурМаркировка(Контент)
	
	ПроверитьПодсистемуКонтурМаркировка();
	
	Если ИспользуетсяКонтурМаркировка33() Тогда
		
		РазвернутаяТаблицаУпаковок = Новый_РазвернутаяТаблицаУпаковок_КонтурМаркировка33();
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтента(РазвернутаяТаблицаУпаковок, Контент);
		КонтурМаркировка_ЗаполнитьСведенияОМаркировке(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка970(Контент, ОшибкиЗаполнения);
		
		ЗаполнитьСведенияОМаркировкеВКонтенте970_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок);
		ЗаполнитьПризнакиМаркируемыхТоваровВКонтенте970_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = Новый_РазвернутаяТаблицаУпаковок();
		ДокументыПередачи = ВладельцыКодовМаркировки(Контент);
		ОшибкиЗаполнения = Новый Массив;
		
		ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(РазвернутаяТаблицаУпаковок, ДокументыПередачи, ОшибкиЗаполнения);
		ОбработатьОшибкиПолученияКодовКонтурМаркировка970(Контент, ОшибкиЗаполнения);
		
		ЗаполнитьСведенияОМаркировкеВКонтенте970(Контент, РазвернутаяТаблицаУпаковок);
		ЗаполнитьПризнакиМаркируемыхТоваровВКонтенте970_КонтурМаркировка(Контент, РазвернутаяТаблицаУпаковок)
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьРазвернутуюТаблицуУпаковокИзКонтента(РазвернутаяТаблицаУпаковок, Контент)
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТЧ Из Контент.Table.Items Цикл
		
		СлужебнаяИнформацияСтрокиТЧ = СтрокаТЧ.СлужебнаяИнформация;
		
		СтрокаТаблицыУпаковок = РазвернутаяТаблицаУпаковок.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыУпаковок, СлужебнаяИнформацияСтрокиТЧ);
		
		СтрокаТаблицыУпаковок.ИндексСтроки = НомерСтроки;
		СтрокаТаблицыУпаковок.Количество = СтрокаТЧ.Quantity;
		СтрокаТаблицыУпаковок.ПервичныйДокумент = СлужебнаяИнформацияСтрокиТЧ.ДокументОтгрузки;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет таблицу кодов по данным подсистемы Контур.Маркировка
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. Новый_РазвернутаяТаблицаУпаковок)
//  СсылкаНаОбъект - ЛюбаяСсылка - объект-владелец штрихкода
//  ОшибкиЗаполнения - Массив - (Необязательный) Коллекция ошибок получения кодов (возвращаемый параметр).
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов_КонтурМаркировка(Результат, ДокументыПередачи, ОшибкиЗаполнения)
	
	ДанныеШтрихкодовУпаковок = КонтурМаркировка_РазвернутаяТаблицаУпаковок(ДокументыПередачи, ОшибкиЗаполнения);
	
	Если Не ЗначениеЗаполнено(ДанныеШтрихкодовУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиШтрихкодов = ДанныеШтрихкодовУпаковок.Колонки;
	ЕстьПараметрыНоменклатуры = (КолонкиШтрихкодов.Найти("ИспользоватьХарактеристики") <> Неопределено);
	ПараметрыНоменклатурыПоУмолчанию = ПараметрыУчетаНоменклатуры();
	ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокКонтурМаркировка();
	ПравилаКонвертацииТоварныхГрупп = ПравилаКонвертацииТоварныхГруппКонтурМаркировка();
	
	Для Каждого УпаковкаКМ Из ДанныеШтрихкодовУпаковок Цикл
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, УпаковкаКМ);
		
		НоваяСтрока.ВидУпаковки = ВидУпаковкиПоДаннымКонтурМаркировка(УпаковкаКМ.ВидУпаковки, ПравилаКонвертацииУпаковок);
		НоваяСтрока.КодТоварнойГруппы = КодТоварнойГруппыПоДаннымКонтурМаркировка(УпаковкаКМ.ВидПродукции, ПравилаКонвертацииТоварныхГрупп);
		
		Если Не ЕстьПараметрыНоменклатуры Тогда
			НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатурыПоУмолчанию.ИспользоватьХарактеристики;
			НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатурыПоУмолчанию.ИспользоватьСерии;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте970_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок)
	
	ВКонтурМаркировкеЕстьИнформацияПоПартиям = ВКонтурМаркировкеЕстьИнформацияПоПартиям();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляОбработкиСведенийОМаркировке();
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаКонтента Из Контент.Table.Items Цикл
		
		СтрокаТаблицы = РазвернутаяТаблицаУпаковок.Найти(НомерСтроки, "ИндексСтроки");
		СведенияОМаркировке = СтрокаТаблицы.СведенияОМаркировке;
		
		НомерСтроки = НомерСтроки + 1;
		
		Если СведенияОМаркировке.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ВКонтурМаркировкеЕстьИнформацияПоПартиям Тогда
			ДобавитьКолонкуПартииВСведенияОМаркировке(СведенияОМаркировке);
		КонецЕсли;
		
		СведенияОМаркировкеДляСтрокиКонтента = Новый Массив;
		
		Запрос.УстановитьПараметр("СведенияОМаркировке", СведенияОМаркировке);
		
		ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
		РезультатПоПартиям = ПакетРезультатовЗапроса[1];
		РезультатПоGTIN = ПакетРезультатовЗапроса[2];
		
		ВыборкаПоGTIN = РезультатПоGTIN.Выбрать();
		НесколькоGTINДляСтрокиДокумента = ВыборкаПоGTIN.Количество() > 1;
		
		ИтогиПоПартиям = РезультатПоПартиям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ИтогиПоПартиям.Следующий() Цикл
			
			СведенияОПартииМаркировки = Новый_СведенияОМаркировке();
			СведенияОПартииМаркировки.НомерПартии = ИтогиПоПартиям.НомерПартии;
			
			ЗаполнитьСведенияОПартииКодамиМаркировки(
				СведенияОПартииМаркировки,
				ИтогиПоПартиям,
				НесколькоGTINДляСтрокиДокумента
			);
			
			СведенияОМаркировкеДляСтрокиКонтента.Добавить(СведенияОПартииМаркировки);
			
		КонецЦикла;
		
		ЗаполнитьКодыМаркировкиНесколькихПартийВСтрокеКонтента970(СтрокаКонтента, СведенияОМаркировкеДляСтрокиКонтента);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПартииКодамиМаркировки(
	СведенияОПартииМаркировки,
	ИтогиПоПартиям,
	НесколькоGTINДляСтрокиДокумента)
	
	ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
	УпаковкаГрупповая = ВидыУпаковокКМ.Групповая;
	УпаковкаЛогистическая = ВидыУпаковокКМ.Логистическая;
	УпаковкаОбъемноСортовойУчет = ВидыУпаковокКМ.ОбъемноСортовойУчет;
	
	СведенияОМаркировке = ИтогиПоПартиям.Выбрать();
	
	Пока СведенияОМаркировке.Следующий() Цикл
		
		ВидУпаковки = СведенияОМаркировке.ВидУпаковки;
		ЗначениеШК = СведенияОМаркировке.ЗначениеШтрихкода;
		
		Если ВидУпаковки = УпаковкаЛогистическая Тогда
			
			СведенияОПартииМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			
		ИначеЕсли ВидУпаковки = УпаковкаГрупповая Тогда
			
			СведенияОПартииМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			
		ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет Тогда
			
			Если НесколькоGTINДляСтрокиДокумента Тогда
				
				СведенияОПартииМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				
			Иначе
				
				СведенияОПартииМаркировки.ГТИН = СведенияОМаркировке.GTIN;
				СведенияОПартииМаркировки.КоличествоТовараВУпаковке = СведенияОМаркировке.Количество;
				
			КонецЕсли;
			
		Иначе
			СведенияОПартииМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиМаркируемыхТоваровВКонтенте970_КонтурМаркировка33(Контент, РазвернутаяТаблицаУпаковок)
	
	ЕстьМаркировка = Ложь;
	ЕстьАлкогольнаяПродукция = Ложь;
	ЕстьТабачнаяПродукция = Ложь;
	
	ТипТаблицаЗначений = Тип("ТаблицаЗначений");
	
	Для Каждого СтрокаТаблицыУпаковок Из РазвернутаяТаблицаУпаковок Цикл
		
		СведенияОМаркировке = СтрокаТаблицыУпаковок.СведенияОМаркировке;
		
		Если НЕ ЕстьМаркировка
			И ТипЗнч(СведенияОМаркировке) = ТипТаблицаЗначений
			И СведенияОМаркировке.Количество() > 0 Тогда
			
			ЕстьМаркировка = Истина;
			
		КонецЕсли;
		
		Если ЕстьМаркировка
			И НЕ ЕстьАлкогольнаяПродукция Тогда
			
			ЕстьАлкогольнаяПродукция = ЭтоАлкогольнаяПродукция(СтрокаТаблицыУпаковок.КодТоварнойГруппы);
			
		КонецЕсли;
		
		Если ЕстьМаркировка
			И НЕ ЕстьТабачнаяПродукция Тогда
			
			ЕстьТабачнаяПродукция = ЭтоТабачнаяПродукция(СтрокаТаблицыУпаковок.КодТоварнойГруппы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВидыТоваровДокумента = Контент.СлужебнаяИнформация.ContentsDocumentProductsType;
	ВидыТоваровДокумента.ContainsMarkedProducts = ЕстьМаркировка;
	ВидыТоваровДокумента.ContainsAlcoholeProducts = ЕстьАлкогольнаяПродукция;
	ВидыТоваровДокумента.ContainsTobaccoProducts = ЕстьТабачнаяПродукция;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиМаркируемыхТоваровВКонтенте970_КонтурМаркировка(Контент, РазвернутаяТаблицаУпаковок)
	
	ЕстьМаркировка = Ложь;
	ЕстьАлкогольнаяПродукция = Ложь;
	ЕстьТабачнаяПродукция = Ложь;
	
	Для Каждого СтрокаТаблицыУпаковок Из РазвернутаяТаблицаУпаковок Цикл
		
		Если НЕ ЕстьМаркировка
			И ЗначениеЗаполнено(СтрокаТаблицыУпаковок.ЗначениеШтрихкода) Тогда
			
			ЕстьМаркировка = Истина;
			
		КонецЕсли;
		
		Если ЕстьМаркировка
			И НЕ ЕстьАлкогольнаяПродукция Тогда
			
			ЕстьАлкогольнаяПродукция = ЭтоАлкогольнаяПродукция(СтрокаТаблицыУпаковок.КодТоварнойГруппы);
			
		КонецЕсли;
		
		Если ЕстьМаркировка
			И НЕ ЕстьТабачнаяПродукция Тогда
			
			ЕстьТабачнаяПродукция = ЭтоТабачнаяПродукция(СтрокаТаблицыУпаковок.КодТоварнойГруппы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВидыТоваровДокумента = Контент.СлужебнаяИнформация.ContentsDocumentProductsType;
	ВидыТоваровДокумента.ContainsMarkedProducts = ЕстьМаркировка;
	ВидыТоваровДокумента.ContainsAlcoholeProducts = ЕстьАлкогольнаяПродукция;
	ВидыТоваровДокумента.ContainsTobaccoProducts = ЕстьТабачнаяПродукция;
	
КонецПроцедуры

// Получает таблицу упаковок, развернутую по номенклатуре, из подсистемы Контур.Маркировка.
// Аналог функции ЧастичноеСодержимоеИСМП.
//
// Параметры:
//  ДокументыПередачи - Массив - коллекция объектов-владельцев кодов.
//  ОшибкиЗаполнения - Массив - (Необязательный) Коллекция ошибок получения кодов (возвращаемый параметр).
// 
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция КонтурМаркировка_РазвернутаяТаблицаУпаковок(ДокументыПередачи, ОшибкиЗаполнения)
	
	ИмяМодуля = ИмяМодуляВзаимодействиеКонтурМаркировка();
	
	МодульВзаимодействиеКонтурМаркировка = Вычислить(ИмяМодуля);
	
	Результат = МодульВзаимодействиеКонтурМаркировка.РазвернутаяТаблицаУпаковок(ДокументыПередачи, ОшибкиЗаполнения);
	
	Возврат Результат;
	
КонецФункции

Процедура КонтурМаркировка_ЗаполнитьСведенияОМаркировке(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения)
	
	ИмяМодуля = ИмяМодуляВзаимодействиеКонтурМаркировка();
	
	МодульВзаимодействиеКонтурМаркировка = Вычислить(ИмяМодуля);
	
	МодульВзаимодействиеКонтурМаркировка.ЗаполнитьСведенияОМаркировке(РазвернутаяТаблицаУпаковок, ОшибкиЗаполнения);
	
КонецПроцедуры


Функция СформироватьКодОСУ_КонтурМаркировка33(СведенияОКоде)
	
	Результат = СтрШаблонЛок("%1%2%3%4",
		"02",
		СведенияОКоде.GTIN,
		"37",
		XMLСтрока(Цел(СведенияОКоде.Количество))
	);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьОшибкиПолученияКодовКонтурМаркировка970(Контент, КоллекцияОшибок)
	
	Если Не ЗначениеЗаполнено(КоллекцияОшибок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Ошибка Из КоллекцияОшибок Цикл
		
		ТекстОшибки = "<Контур.Маркировка> " + Ошибка.ТекстОшибки;
		СсылкаНаОбъект = Ошибка.ДокументМаркировки;
		
		ДобавитьОшибкуВалидации970(Контент.СлужебнаяИнформация.ОшибкиВДанных, ТекстОшибки, СсылкаНаОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, что подсистема "Контур.Маркировка" установлена.
// Если подсистема не установлена, записывает ошибку в журнал
// и генерирует исключение.
//
Процедура ПроверитьПодсистемуКонтурМаркировка()
	
	Если ЕстьИнтеграцияКонтурМаркировка() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = Нстр("ru = 'Подсистема ""Контур.Маркировка"" не подключена!'");
	
	ВызватьИсключение ТекстСообщения;
	
КонецПроцедуры

// Проверяет, что подсистема Контур.Маркировка подключена.
// 
// Возвращаемое значение:
//  Булево - Истина, если подсистема подключена.
//
Функция ЕстьИнтеграцияКонтурМаркировка()
	
	ИмяМодуля = ИмяМодуляВзаимодействиеКонтурМаркировка();
	
	Результат = Метаданные.Подсистемы.Найти("КонтурМаркировка") <> Неопределено
		И Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяКонтурМаркировка33()
	
	Результат = Истина;
	НеобходимаяВерсияМодуляМаркировки = "3.3.0";
	
	УстановленнаяВерсияМодуляМаркировки = ВерсияУстановленногоМодуляКонтурМаркировка();
	
	Если УстановленнаяВерсияМодуляМаркировки = Неопределено Тогда
		Результат = Ложь;
	Иначе
		Результат = СравнитьВерсии(УстановленнаяВерсияМодуляМаркировки, НеобходимаяВерсияМодуляМаркировки) >= 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВКонтурМаркировкеЕстьИнформацияПоПартиям()
	
	Результат = Истина;
	НеобходимаяВерсияМодуляМаркировки = "3.8.0";
	
	УстановленнаяВерсияМодуляМаркировки = ВерсияУстановленногоМодуляКонтурМаркировка();
	
	Если УстановленнаяВерсияМодуляМаркировки = Неопределено Тогда
		Результат = Ложь;
	Иначе
		Результат = СравнитьВерсии(УстановленнаяВерсияМодуляМаркировки, НеобходимаяВерсияМодуляМаркировки) >= 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует правила преобразования видов упаковок подсистемы КонтурМаркировка во внутреннее представление,
// которое используется для заполнения развернутой таблицы упаковок.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки в формате КонтурМаркировка.
//   * Значение - Строка - Внутреннее представление вида упаковки.
//
Функция ПравилаКонвертацииУпаковокКонтурМаркировка()
	
	Если _ПравилаКонвертацииУпаковокКМ <> Неопределено Тогда
		Возврат _ПравилаКонвертацииУпаковокКМ;
	КонецЕсли;
	
	_ПравилаКонвертацииУпаковокКМ = Новый Соответствие;
	
	МетаданныеВидыУпаковокКонтурМаркировка = Метаданные.Перечисления.Найти("КонтурМаркировка_ВидыУпаковок");
	Если МетаданныеВидыУпаковокКонтурМаркировка <> Неопределено Тогда
		
		ВидыУпаковокКМ = Перечисления.КонтурМаркировка_ВидыУпаковок;
		
		_ПравилаКонвертацииУпаковокКМ.Вставить(ВидыУпаковокКМ.Групповая, УпаковкаГрупповая());
		_ПравилаКонвертацииУпаковокКМ.Вставить(ВидыУпаковокКМ.Логистическая, УпаковкаЛогистическая());
		_ПравилаКонвертацииУпаковокКМ.Вставить(ВидыУпаковокКМ.Потребительская, УпаковкаПотребительская()); 
		
		ЕстьОбъемноСортовойУчет = МетаданныеВидыУпаковокКонтурМаркировка.ЗначенияПеречисления.Найти("ОбъемноСортовойУчет") <> Неопределено;
		Если ЕстьОбъемноСортовойУчет Тогда
			_ПравилаКонвертацииУпаковокКМ.Вставить(ВидыУпаковокКМ.ОбъемноСортовойУчет, УпаковкаОбъемноСортовойУчет());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _ПравилаКонвертацииУпаковокКМ;
	
КонецФункции

Функция ПравилаКонвертацииТоварныхГруппКонтурМаркировка()
	
	Если _ПравилаКонвертацииТоварныхГруппКМ <> Неопределено Тогда
		Возврат _ПравилаКонвертацииТоварныхГруппКМ;
	КонецЕсли;
	
	_ПравилаКонвертацииТоварныхГруппКМ = Новый Соответствие;
	
	МетаданныеВидыПродукцииКМ = Метаданные.Перечисления.Найти("КонтурМаркировка_ВидыПродукции");
	
	Если МетаданныеВидыПродукцииКМ <> Неопределено Тогда
		
		_ПравилаКонвертацииТоварныхГруппКМ.Вставить(Перечисления.КонтурМаркировка_ВидыПродукции.ПустаяСсылка(), 0);
		
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Легпром", 1, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Обувь", 2, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Табак", 3, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Парфюмерия", 4, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Шины", 5, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Фототовары", 6, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Молоко", 8, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Велосипеды", 9, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "МедицинскиеИзделия", 10, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "АльтернативныйТабак", 12, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Вода", 13, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Пиво", 15, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "НикотиносодержащаяПродукция", 16, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Бады", 17, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Антисептики", 19, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "Морепродукты", 21, МетаданныеВидыПродукцииКМ);
		ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(_ПравилаКонвертацииТоварныхГруппКМ, "БезалкогольныеНапитки", 23, МетаданныеВидыПродукцииКМ);
		
	КонецЕсли;
	
	Возврат _ПравилаКонвертацииТоварныхГруппКМ;
	
КонецФункции

Процедура ДобавитьПравилоКонвертацииТоварнойГруппыКонтурМаркировка(Результат, ИмяТоварнойГруппы, КодТоварнойГруппы, МетаданныеВидыПродукцииКМ)
	
	Если МетаданныеВидыПродукцииКМ.ЗначенияПеречисления.Найти(ИмяТоварнойГруппы) <> Неопределено Тогда
		
		Результат.Вставить(Перечисления.КонтурМаркировка_ВидыПродукции[ИмяТоварнойГруппы], КодТоварнойГруппы);
		
	КонецЕсли;
	
КонецПроцедуры

// Преобразовывает вид упаковки подсистемы КонтурМаркировка во внутренее представление.
//
// Параметры:
//  ВидУпаковкиКМ - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки в формате КМ.
//  ПравилаКонвертацииУпаковок - Соответствие - правила преобразования (см. ПравилаКонвертацииУпаковокКонтурМаркировка)
// 
// Возвращаемое значение:
//  Строка - Возможные значения описаны функциями УпаковкаПотребительская(), УпаковкаЛогистическая() и УпаковкаГрупповая()
//
Функция ВидУпаковкиПоДаннымКонтурМаркировка(ВидУпаковкиКМ, ПравилаКонвертацииУпаковок)
	
	ЗначениеПоУмолчанию = УпаковкаПотребительская();
	
	Результат = ПравилаКонвертацииУпаковок.Получить(ВидУпаковкиКМ);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодТоварнойГруппыПоДаннымКонтурМаркировка(ВидПродукцииКМ, ПравилаКонвертацииТоварныхГрупп)
	
	ЗначениеПоУмолчанию = 0;
	
	Результат = ПравилаКонвертацииТоварныхГрупп.Получить(ВидПродукцииКМ);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоАлкогольнаяПродукция(КодТоварнойГруппы)
	
	Результат = КодТоварнойГруппы = 15;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоТабачнаяПродукция(КодТоварнойГруппы)
	
	Результат = КодТоварнойГруппы = 3 ИЛИ КодТоварнойГруппы = 12 ИЛИ КодТоварнойГруппы = 16;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияУстановленнойПодсистемыКонтурМаркировка()
	
	ИмяМодуля = "ОбновлениеИнформационнойБазыКонтурМаркировка";
	
	МетаданныеМодуля = Метаданные.ОбщиеМодули.Найти(ИмяМодуля);
	
	Если МетаданныеМодуля <> Неопределено Тогда
		
		Попытка
			
			МодульОбновлениеИнформационнойБазыКонтурМаркировка = Вычислить(ИмяМодуля);
			
			Результат = МодульОбновлениеИнформационнойБазыКонтурМаркировка.ВерсияБиблиотеки();
			
		Исключение
			Возврат НеизвестнаяВерсияПродукта();
		КонецПопытки;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияУстановленногоМодуляКонтурМаркировка()
	
	ИмяМодуля = ИмяМодуляВзаимодействиеКонтурМаркировка();
	
	МетаданныеМодуля = Метаданные.ОбщиеМодули.Найти(ИмяМодуля);
	
	Если МетаданныеМодуля <> Неопределено Тогда
		
		УстановленнаяВерсияПодсистемыКМ = ВерсияУстановленнойПодсистемыКонтурМаркировка();
		НеобходимаяВерсияПодсистемыКМ = "3.0.0";
		
		Если СравнитьВерсии(УстановленнаяВерсияПодсистемыКМ, НеобходимаяВерсияПодсистемыКМ) >= 0 Тогда
			
			// На всякий случай, чтобы мы не падали,
			// если подсистему обновили криво,
			// либо если подсистему обновили нормально, а модуль обновили криво
			Попытка
				
				МодульВзаимодействиеКонтурМаркировка = Вычислить(ИмяМодуля);
				
				Результат = МодульВзаимодействиеКонтурМаркировка.ВерсияМодуля();
				
			Исключение
				Результат = НеизвестнаяВерсияПродукта();
			КонецПопытки;
			
		Иначе
			Результат = НеизвестнаяВерсияПродукта();
		КонецЕсли;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяМодуляВзаимодействиеКонтурМаркировка()
	Возврат "ВзаимодействиеКонтурМаркировка";
КонецФункции

Функция НеизвестнаяВерсияПродукта()
	Возврат "0.0.0";
КонецФункции

Процедура ДобавитьКолонкуПартииВСведенияОМаркировке(СведенияОМаркировке)
	
	Длина = 1024;
	
	ТипСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(Длина));
	
	СведенияОМаркировке.Колонки.Добавить("НомерПартии", ТипСтрока);
	
КонецПроцедуры

Функция ТекстЗапросаДляОбработкиСведенийОМаркировке()
	
	Результат = "ВЫБРАТЬ
		|	СведенияОмаркировке.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	СведенияОмаркировке.ВидУпаковки КАК ВидУпаковки,
		|	СведенияОмаркировке.GTIN КАК GTIN,
		|	СведенияОмаркировке.Количество КАК Количество,
		|	СведенияОмаркировке.НомерПартии КАК НомерПартии
		|ПОМЕСТИТЬ ВТСведенияОмаркировке
		|ИЗ
		|	&СведенияОмаркировке КАК СведенияОмаркировке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОмаркировке.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	ВТСведенияОмаркировке.ВидУпаковки КАК ВидУпаковки,
		|	ВТСведенияОмаркировке.GTIN КАК GTIN,
		|	ВТСведенияОмаркировке.Количество КАК Количество,
		|	ВТСведенияОмаркировке.НомерПартии КАК НомерПартии
		|ИЗ
		|	ВТСведенияОмаркировке КАК ВТСведенияОмаркировке
		|ИТОГИ ПО
		|	НомерПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	GTIN Как GTIN
		|ИЗ
		|	ВТСведенияОмаркировке КАК ВТСведенияОмаркировке
		|СГРУППИРОВАТЬ ПО
		|	GTIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСведенияОмаркировке";
	
	Возврат Результат;
	
КонецФункции

//}		СВЕДЕНИЯ О МАРКИРОВКЕ КОНТУР МАРКИРОВКА


//{		СВЕДЕНИЯ О МАРКИРОВКЕ ИСМП

Процедура ЗаполнитьСведенияОМаркировке970_ИСМП(Контент)
	
	Если НЕ ЕстьИнтеграцияИСМП() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПередачи = ВладельцыКодовМаркировки(Контент);
	ТаблицаУпаковок = ТаблицаУпаковокИСМП(ДокументыПередачи);
	
	Если Не ЗначениеЗаполнено(ТаблицаУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяИнтеграцияИСМП10127() Тогда
		
		РазвернутаяТаблицаУпаковок = Новый_РазвернутаяТаблицаУпаковок_ИСМП10127();
		ТаблицаТоваров = ТаблицаТоваровИСМП(Контент.Table.Items);
		ДанныеШтрихкодовУпаковок = ИСМП_ЧастичноеСодержимоеИКодыОСУ(ТаблицаУпаковок, ТаблицаТоваров, ДокументыПередачи);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		ЗаполнитьСведенияОМаркировкеВКонтенте970_ИСМП10127(Контент, РазвернутаяТаблицаУпаковок);
		ЗаполнитьПризнакиМаркируемыхТоваровВКонтенте970_ИСМП(Контент, РазвернутаяТаблицаУпаковок);
		
	Иначе
		
		РазвернутаяТаблицаУпаковок = Новый_РазвернутаяТаблицаУпаковок();
		ДанныеШтрихкодовУпаковок = ИСМП_ЧастичноеСодержимое(ТаблицаУпаковок);
		
		ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(РазвернутаяТаблицаУпаковок, ДанныеШтрихкодовУпаковок);
		ЗаполнитьСведенияОМаркировкеВКонтенте970(Контент, РазвернутаяТаблицаУпаковок);
		ЗаполнитьПризнакиМаркируемыхТоваровВКонтенте970_ИСМП(Контент, РазвернутаяТаблицаУпаковок);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет таблицу кодов средствами типовой библиотеки интеграции с ИС МП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов_ИСМП(Результат, ДанныеШтрихкодовУпаковок)
	
	ЕстьВидУпаковки = (ДанныеШтрихкодовУпаковок.Колонки.Найти("ВидУпаковки") <> Неопределено);
	ИсключаемыеСвойства = "";
	
	Если ЕстьВидУпаковки Тогда 
		ИсключаемыеСвойства = "ВидУпаковки";
	КонецЕсли;
	
	ПараметрыНоменклатуры = ПараметрыУчетаНоменклатуры();
	ПравилаКонвертацииУпаковок = ПравилаКонвертацииУпаковокИСМП();
	ПравилаКонвертацииВидаПродукции = ПравилаКонвертацииВидаПродукцииИСМП();
	
	Для Каждого УпаковкаИСМП Из ДанныеШтрихкодовУпаковок Цикл
		
		ВидУпаковкиИСМП = Неопределено;
		Если ЕстьВидУпаковки Тогда
			ВидУпаковкиИСМП = УпаковкаИСМП.ВидУпаковки;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, УпаковкаИСМП, , ИсключаемыеСвойства);
		НоваяСтрока.ВидУпаковки = ВидУпаковкиПоДаннымИСМП(ВидУпаковкиИСМП, ПравилаКонвертацииУпаковок);
		НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатуры.ИспользоватьХарактеристики;
		НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатуры.ИспользоватьСерии;
		НоваяСтрока.КодТоварнойГруппы = КодТоварнойГруппыПоДаннымИСМП(УпаковкаИСМП.ВидПродукции, ПравилаКонвертацииВидаПродукции);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте970_ИСМП10127(Контент, РазвернутаяТаблицаУпаковок)
	
	Для Каждого СтрокаКонтента Из Контент.Table.Items Цикл
		
		ТребуемоеКоличество = СтрокаКонтента.Quantity;
		
		Если Не ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			Продолжить;
		КонецЕсли;
		
		КодыМаркировки = Новый_СведенияОМаркировке();
		
		ПодобратьКодыМаркировки970_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаКонтента.СлужебнаяИнформация, ТребуемоеКоличество);
		ЗаполнитьКодыМаркировкиВСтрокеКонтента970(СтрокаКонтента, КодыМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиМаркируемыхТоваровВКонтенте970_ИСМП(Контент, РазвернутаяТаблицаУпаковок)
	
	ЕстьМаркировка = Ложь;
	
	Для Каждого СтрокаКонтента Из Контент.Table.Items Цикл
		
		Если СтрокаКонтента.ItemIdentificationNumbers.Количество() > 0 Тогда
			ЕстьМаркировка = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьАлкогольнаяПродукция = Ложь;
	ЕстьТабачнаяПродукция = Ложь;
	
	Если ЕстьМаркировка Тогда
		
		Для Каждого СтрокаТаблицыУпаковок Из РазвернутаяТаблицаУпаковок Цикл
			
			Если НЕ ЕстьАлкогольнаяПродукция Тогда
				ЕстьАлкогольнаяПродукция = ЭтоАлкогольнаяПродукция(СтрокаТаблицыУпаковок.КодТоварнойГруппы);
			КонецЕсли;
			
			Если НЕ ЕстьТабачнаяПродукция Тогда
				ЕстьТабачнаяПродукция = ЭтоТабачнаяПродукция(СтрокаТаблицыУпаковок.КодТоварнойГруппы);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВидыТоваровДокумента = Контент.СлужебнаяИнформация.ContentsDocumentProductsType;
	ВидыТоваровДокумента.ContainsMarkedProducts = ЕстьМаркировка;
	ВидыТоваровДокумента.ContainsAlcoholeProducts = ЕстьАлкогольнаяПродукция;
	ВидыТоваровДокумента.ContainsTobaccoProducts = ЕстьТабачнаяПродукция;
	
КонецПроцедуры

Процедура ПодобратьКодыМаркировки970_ИСМП10127(КодыМаркировки, РазвернутаяТаблицаУпаковок, СлужебнаяИнформация, ТребуемоеКоличество)
	
	Для Каждого СтрокаУпаковки Из РазвернутаяТаблицаУпаковок Цикл
		
		Если СтрокаУпаковки.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.Номенклатура <> СлужебнаяИнформация.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьХарактеристики
			И СтрокаУпаковки.Характеристика <> СлужебнаяИнформация.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		
		ВидУпаковки = СтрокаУпаковки.ВидУпаковки;
		
		Если (ВидУпаковки <> УпаковкаОбъемноСортовойУчет() ИЛИ ЗначениеЗаполнено(СтрокаУпаковки.Штрихкод))
			И СтрокаУпаковки.ИспользоватьСерии
			И ЗначениеЗаполнено(СлужебнаяИнформация.Серия)
			И СтрокаУпаковки.Серия <> СлужебнаяИнформация.Серия Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШК = СтрокаУпаковки.ЗначениеШтрихкода;
		
		Если ЗначениеЗаполнено(ЗначениеШК) Тогда
			
			Если ВидУпаковки = УпаковкаЛогистическая() Тогда
				КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаГрупповая() Тогда
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
				
				Если ЗначениеЗаполнено(СтрокаУпаковки.Штрихкод) Тогда
					КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
				Иначе
					
					Если СтрокаУпаковки.КоличествоВПотребительскойУпаковке = 0 Тогда
						КодыМаркировки.КоличествоТовараВУпаковке = 0;
					Иначе
						КодыМаркировки.КоличествоТовараВУпаковке = Окр(ТребуемоеКоличество / СтрокаУпаковки.КоличествоВПотребительскойУпаковке);
					КонецЕсли;
					
					КодыМаркировки.ГТИН = СтрокаУпаковки.ЗначениеШтрихкода;
					
					Прервать;
					
				КонецЕсли;
				
			Иначе
				КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаУпаковки.Обработан = Истина;
		
	КонецЦикла;
	
КонецПроцедуры


// Разворачивает таблицу транспортных и индивидуальных штрихкодов до номенклатуры, характеристики, серии
//   для дальнейшего сопоставления информации об упаковках с товарной частью.
//   Для транспортных упаковок номенклатура (характеристика, серия)- это номенклатура (характеристика, серия)
//   первого вложенного (на любом уровне) индивидуального штрихкода.
// 
// Параметры:
// 	ТаблицаУпаковок - ТаблицаЗначений - исходная таблица упаковок:
// 	 * Ссылка   - Произвольный - объект-владелец штрихкода
// 	 * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров
// Возвращаемое значение - ТаблицаЗначений - таблица упаковок с товарными данными:
// 	 * Ссылка             - Произвольный - объект-владелец штрихкода - исходная колонка
// 	 * Штрихкод           - СправочникСсылка.ШтрихкодыУпаковокТоваров - ссылка на индивидуальный штрихкод содержимого
// 	 * Номенклатура       - ОпределяемыйТип.Номенклатура - содержимое
// 	 * Характеристика     - ОпределяемыйТип.ХарактеристикаНоменклатуры - содержимое
// 	 * Серия              - ОпределяемыйТип.СерияНоменклатуры - содержимое
// 	 * ЗначениеШтрихкода  - Строка - текстовое представление исходного штрихкода для передачи в ЭДО
// 	 * Обработан          - Булево - признак сопоставления строки товарной части документа
//
Функция ИСМП_ЧастичноеСодержимое(ТаблицаУпаковок)
	
	МодульЭлектронноеВзаимодействиеИСМП = Вычислить("ЭлектронноеВзаимодействиеИСМП");
	Результат = МодульЭлектронноеВзаимодействиеИСМП.ЧастичноеСодержимое(ТаблицаУпаковок);
	
	Возврат Результат;
	
КонецФункции

// Разворачивает таблицу транспортных и индивидуальных штрихкодов до номенклатуры, характеристики, серии
//   для дальнейшего сопоставления информации об упаковках с товарной частью.
// Добавляет в таблицу коды ОСУ для строк, по которым коды маркировки не указывались. Считаем что таблица товаров
//   уже соответствует таблице штрихкодов упаковок (с учетом невнесенных ОСУ).
//
// Параметры:
// 	ТаблицаУпаковок - ТаблицаЗначений - исходная таблица упаковок:
// 	 * Ссылка   - Произвольный - объект-владелец штрихкода
// 	 * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкод
//  ТаблицаТоваров	 - ТаблицаЗначений - исходная таблица товаров: 
// 	 * Ссылка         - Произвольный - объект-владелец штрихкода
// 	 * Номенклатура   - ОпределяемыйТип.Номенклатура - номенклатура
// 	 * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика
// 	 * Количество     - Число - количество
//  ПараметрыСканирования - См. ШтрихкодированиеИС.ПараметрыСканирования
// Возвращаемое значение:
//  ТаблицаЗначений - См. ЧастичноеСодержимое
//
Функция ИСМП_ЧастичноеСодержимоеИКодыОСУ(ТаблицаУпаковок, ТаблицаТоваров, ДокументыОснования)
	
	Если ДокументыОснования.Количество() Тогда
		ДокументОснование = ДокументыОснования[0];
	ИначеЕсли ТаблицаТоваров.Количество() Тогда
		ДокументОснование = ТаблицаТоваров[0].Ссылка;
	КонецЕсли;
	
	Если ИспользуетсяРасширеннаяВерсияГосИС() Тогда
		МодульШтрихкодированиеИС = Вычислить("ШтрихкодированиеОбщегоНазначенияИС");
	Иначе
		МодульШтрихкодированиеИС = Вычислить("ШтрихкодированиеИС");
	КонецЕсли;
	
	ПараметрыСканирования = МодульШтрихкодированиеИС.ПараметрыСканирования(ДокументОснование);
	МодульЭлектронноеВзаимодействиеИСМП = Вычислить("ЭлектронноеВзаимодействиеИСМП");
	
	Результат = МодульЭлектронноеВзаимодействиеИСМП.ЧастичноеСодержимоеИКодыОСУ(
		ТаблицаУпаковок,
		ТаблицаТоваров,
		ПараметрыСканирования);
	
	Возврат Результат;
	
КонецФункции


// Возвращает таблицу упаковок, сформированную по данным библиотеки интеграции с ИС МП.
//
// Параметры:
//  ДокументыПередачи - Массив - ссылки на документы, по которым необходимо получить таблицу упаковок
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок:
//   * Ссылка   - Произвольный - объект-владелец штрихкода
//   * Штрихкод - СправочникСсылка.ШтрихкодыУпаковокТоваров
//
Функция ТаблицаУпаковокИСМП(ДокументыПередачи)
	
	ВладельцыШтрихкодов = Новый Массив;
	ТипыСсылок = Новый Соответствие;
	ТекстыЗапросов = Новый Массив;
	
	Для Каждого СсылкаНаДокумент Из ДокументыПередачи Цикл
		
		Тип = ТипЗнч(СсылкаНаДокумент);
		
		Если ТипыСсылок[Тип] = Неопределено Тогда
			
			МетаданныеОбъекта = СсылкаНаДокумент.Метаданные();
			ЕстьШК = ЕстьШтрихкодыУпаковокИСМП(МетаданныеОбъекта);
			
			ТипыСсылок.Вставить(Тип, ЕстьШК);
			
			Если ЕстьШК Тогда
				ТекстЗапросаШК = ТекстЗапросаТаблицыУпаковокИСМП(МетаданныеОбъекта.ПолноеИмя());
				ТекстыЗапросов.Добавить(ТекстЗапросаШК);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипыСсылок[Тип] Тогда
			ВладельцыШтрихкодов.Добавить(СсылкаНаДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ТекстыЗапросов) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединитьЛок(ТекстыЗапросов, РазделительОбъединенияЗапросов());
		Запрос.УстановитьПараметр("ВладельцыШтрихкодов", ВладельцыШтрихкодов);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаТоваровИСМП(СтрокиКонтента)
	
	Результат = Новый_ТаблицаТоваровИСМП(СтрокиКонтента);
	
	Для Каждого СтрокаКонтента Из СтрокиКонтента Цикл
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокаКонтента.СлужебнаяИнформация;
		
		СтрокаТаблицыТоваров = Результат.Добавить();
		СтрокаТаблицыТоваров.Номенклатура = СлужебнаяИнформацияСтрокиКонтента.Номенклатура;
		СтрокаТаблицыТоваров.Характеристика = СлужебнаяИнформацияСтрокиКонтента.Характеристика;
		СтрокаТаблицыТоваров.Ссылка = СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки;
		СтрокаТаблицыТоваров.Количество = СтрокаКонтента.Quantity;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ТаблицаТоваровИСМП(СтрокиКонтента)
	
	ОписаниеТипаНоменклатура = Новый ОписаниеТипов(Справочники.ТипВсеСсылки());
	ОписаниеТипаСсылка = Новый ОписаниеТипов(Документы.ТипВсеСсылки());
	ОписаниеТипаХарактеристика = Неопределено;
	
	Если ПлатформаПоддерживаетОпределяемыеТипы() Тогда
		
		ОпределяемыеТипы = Метаданные["ОпределяемыеТипы"];
		ОпределяемыйТипХарактеристики = ОпределяемыеТипы.Найти("ХарактеристикаНоменклатуры");
		
		Если НЕ ОпределяемыйТипХарактеристики = Неопределено Тогда
			ОписаниеТипаХарактеристика = ОпределяемыйТипХарактеристики.Тип;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеТипаХарактеристика) Тогда
		ОписаниеТипаХарактеристика = Новый ОписаниеТипов(Справочники.ТипВсеСсылки());
	КонецЕсли;
	
	Если СтрокиКонтента.Количество() Тогда
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокиКонтента[0].СлужебнаяИнформация;
		
		Если ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.Номенклатура) Тогда
			ОписаниеТипаНоменклатура = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.Номенклатура);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.Характеристика) Тогда
			ОписаниеТипаХарактеристика = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.Характеристика);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки) Тогда
			ОписаниеТипаСсылка = ОписаниеТиповЗначения(СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура", ОписаниеТипаНоменклатура);
	Результат.Колонки.Добавить("Характеристика", ОписаниеТипаХарактеристика);
	Результат.Колонки.Добавить("Ссылка", ОписаниеТипаСсылка);
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Возврат Результат;
	
КонецФункции

// Проверяет, встроена ли в конфигурацию библиотека интеграции с ИС МП.
// 
// Возвращаемое значение:
//  Булево - Истина, если подсистема есть.
//
Функция ЕстьИнтеграцияИСМП()
	
	Результат = Ложь;
	
	Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыПовтИсп") <> Неопределено Тогда
		
		МодульСтандартныеПодсистемыПовтИсп = Вычислить("СтандартныеПодсистемыПовтИсп");
		
		ОписанияПодсистем = МодульСтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
		
		Если ОписанияПодсистем.Получить("БиблиотекаИнтеграцииИСМП") <> Неопределено Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат = Ложь И Метаданные.ОбщиеМодули.Найти("ОбновлениеИнформационнойБазыИСМП") <> Неопределено Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, поддерживает-ли встроенная версия библиотеки интеграции с ИС МП распределение одного кода ОСУ по нескольким строкам
// 
// Возвращаемое значение:
//  Булево - Истина, если библиотека поддерживает функционал.
//
Функция ИспользуетсяИнтеграцияИСМП10127()
	
	Результат = Ложь;
	
	ВерсияПодсистемыИСМП = "";
	
	Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыПовтИсп") <> Неопределено Тогда
		
		МодульСтандартныеПодсистемыПовтИсп = Вычислить("СтандартныеПодсистемыПовтИсп");
		
		ОписанияПодсистем = МодульСтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
		ОписаниеПодсистемыБиблиотекиИнтеграцииИСМП = ОписанияПодсистем.Получить("БиблиотекаИнтеграцииИСМП");
		
		Если НЕ ОписаниеПодсистемыБиблиотекиИнтеграцииИСМП = Неопределено Тогда
			ВерсияПодсистемыИСМП = ОписаниеПодсистемыБиблиотекиИнтеграцииИСМП.Версия;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВерсияПодсистемыИСМП) Тогда
		
		ОписаниеПодсистемы = Новый Структура;
		ОписаниеПодсистемы.Вставить("Имя", "");
		ОписаниеПодсистемы.Вставить("Версия", "");
		ОписаниеПодсистемы.Вставить("ТребуемыеПодсистемы", Новый Массив);
		
		МодульОбновлениеИнформационнойБазыИСМП = Вычислить("ОбновлениеИнформационнойБазыИСМП");
		МодульОбновлениеИнформационнойБазыИСМП.ПриДобавленииПодсистемы(ОписаниеПодсистемы);
		
		ВерсияПодсистемыИСМП = ОписаниеПодсистемы.Версия;
		
	КонецЕсли;
	
	Если СравнитьВерсии(ВерсияПодсистемыИСМП, "10.1.27") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, есть ли у объекта метаданных табличная часть с штрихкодами упаковок товаров.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - проверяемый объект метаданных.
// 
// Возвращаемое значение:
//  Булево - Истина, если у объекта есть табличная часть "ШтрихкодыУпаковок".
//
Функция ЕстьШтрихкодыУпаковокИСМП(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТаблицыУпаковокИСМП(ПолноеИмяОбъекта)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.ШтрихкодУпаковки КАК Штрихкод
	|ИЗ
	|	&ТЧШтрихкоды КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В (&ВладельцыШтрихкодов)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТЧШтрихкоды", ПолноеИмяОбъекта + ".ШтрихкодыУпаковок");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ИспользуетсяРасширеннаяВерсияГосИС()
	
	Результат = Ложь;
	
	Подсистема = "ГосИС.БазоваяФункциональность.Расширенная";
	
	Попытка
		Результат = Вычислить("ОбщегоНазначения.ПодсистемаСуществует(Подсистема)");
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Формирует правила преобразования видов упаковок подсистемы ИСМП во внутреннее представление,
// которое используется для заполнения развернутой таблицы упаковок.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки в формате ИСМП.
//   * Значение - Строка - Внутреннее представление вида упаковки.
//
Функция ПравилаКонвертацииУпаковокИСМП()
	
	Если _ПравилаКонвертацииУпаковокИСМП <> Неопределено Тогда
		Возврат _ПравилаКонвертацииУпаковокИСМП;
	КонецЕсли;
	
	_ПравилаКонвертацииУпаковокИСМП = Новый Соответствие;
	
	МетаданныеВидыУпаковокИС = Метаданные.Перечисления.Найти("ВидыУпаковокИС");
	Если МетаданныеВидыУпаковокИС <> Неопределено Тогда
		
		ВидыУпаковокИСМП = Перечисления.ВидыУпаковокИС;
		
		_ПравилаКонвертацииУпаковокИСМП.Вставить(ВидыУпаковокИСМП.Групповая, УпаковкаГрупповая());
		_ПравилаКонвертацииУпаковокИСМП.Вставить(ВидыУпаковокИСМП.Логистическая, УпаковкаЛогистическая());
		_ПравилаКонвертацииУпаковокИСМП.Вставить(ВидыУпаковокИСМП.Потребительская, УпаковкаПотребительская()); 
		
		ЕстьОбъемноСортовойУчет = МетаданныеВидыУпаковокИС.ЗначенияПеречисления.Найти("ОбъемноСортовойУчет") <> Неопределено;
		Если ЕстьОбъемноСортовойУчет Тогда
			_ПравилаКонвертацииУпаковокИСМП.Вставить(ВидыУпаковокИСМП.ОбъемноСортовойУчет, УпаковкаОбъемноСортовойУчет());
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _ПравилаКонвертацииУпаковокИСМП;
	
КонецФункции

Функция ПравилаКонвертацииВидаПродукцииИСМП()
	
	Если _ПравилаКонвертацииВидаПродукцииИСМП <> Неопределено Тогда
		Возврат _ПравилаКонвертацииВидаПродукцииИСМП;
	КонецЕсли;
	
	_ПравилаКонвертацииВидаПродукцииИСМП = Новый Соответствие;
	
	МетаданныеВидыПродукцииИС = Метаданные.Перечисления.Найти("ВидыПродукцииИС");
	
	Если МетаданныеВидыПродукцииИС <> Неопределено Тогда
		
		_ПравилаКонвертацииВидаПродукцииИСМП.Вставить(Перечисления.ВидыПродукцииИС.ПустаяСсылка(), 0);
		
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "ЛегкаяПромышленность", 1, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Обувь", 2, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Табак", 3, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Духи", 4, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Шины", 5, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Фотоаппараты", 6, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "МолочнаяПродукцияПодконтрольнаяВЕТИС", 8, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "МолочнаяПродукцияБезВЕТИС", 8, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Велосипеды", 9, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "КреслаКоляски", 10, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "АльтернативныйТабак", 12, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "УпакованнаяВода", 13, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "ПродукцияИзНатуральногоМеха", 14, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Пиво", 15, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Алкогольная", 15, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "НикотиносодержащаяПродукция", 16, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "БАДы", 17, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "Антисептики", 19, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "СоковаяПродукция", 23, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "БезалкогольноеПиво", 23, МетаданныеВидыПродукцииИС);
		ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(_ПравилаКонвертацииВидаПродукцииИСМП, "ПивоВПотребительскихУпаковках", 15, МетаданныеВидыПродукцииИС);
		
	КонецЕсли;
	
	Возврат _ПравилаКонвертацииВидаПродукцииИСМП;
	
КонецФункции

Процедура ДобавитьПравилоКонвертацииТоварнойГруппыИСМП(Результат, ИмяТоварнойГруппы, КодТоварнойГруппы, МетаданныеВидыПродукцииИС)
	
	Если МетаданныеВидыПродукцииИС.ЗначенияПеречисления.Найти(ИмяТоварнойГруппы) <> Неопределено Тогда
		
		Результат.Вставить(Перечисления.ВидыПродукцииИС[ИмяТоварнойГруппы], КодТоварнойГруппы);
		
	КонецЕсли;
	
КонецПроцедуры

// Преобразовывает вид упаковки подсистемы ИСМП во внутренее представление.
//
// Параметры:
//  ВидУпаковкиИСМП - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки в формате ИСМП.
//  ПравилаКонвертацииУпаковок - Соответствие - правила преобразования (см. ПравилаКонвертацииУпаковокИСМП)
// 
// Возвращаемое значение:
//  Строка - Возможные значения описаны функциями УпаковкаПотребительская(), УпаковкаЛогистическая() и УпаковкаГрупповая()
//
Функция ВидУпаковкиПоДаннымИСМП(ВидУпаковкиИСМП, ПравилаКонвертацииУпаковок)
	
	ЗначениеПоУмолчанию = УпаковкаПотребительская();
	
	Результат = ПравилаКонвертацииУпаковок.Получить(ВидУпаковкиИСМП);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодТоварнойГруппыПоДаннымИСМП(ВидПродукцииИСМП, ПравилаКонвертацииВидаПродукции)
	
	ЗначениеПоУмолчанию = 0;
	
	Результат = ПравилаКонвертацииВидаПродукции.Получить(ВидПродукцииИСМП);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		СВЕДЕНИЯ О МАРКИРОВКЕ ИСМП


//{		СВЕДЕНИЯ О МАРКИРОВКЕ ОБЩЕЕ

Процедура ЗаполнитьСведенияОМаркировкеВКонтенте970(Контент, РазвернутаяТаблицаУпаковок)
	
	Для Каждого СтрокаКонтента Из Контент.Table.Items Цикл
		
		ТребуемоеКоличество = СтрокаКонтента.Quantity;
		
		Если Не ЗначениеЗаполнено(ТребуемоеКоличество) Тогда
			Продолжить;
		КонецЕсли;
		
		КодыМаркировки = Новый_СведенияОМаркировке();
		
		ПодобратьКодыМаркировки(КодыМаркировки, РазвернутаяТаблицаУпаковок, СтрокаКонтента.СлужебнаяИнформация, ТребуемоеКоличество);
		ЗаполнитьКодыМаркировкиВСтрокеКонтента970(СтрокаКонтента, КодыМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

// Переносит коды маркировки в строку контента.
//
// Параметры:
//  СтрокаКонтента - Структура - содержит объект Item970 (см. МодульИнтеграции.Контракт_Item970())
//  КодыМаркировки - Структура - содержит коллекции кодов маркировки (см. Новый_СведенияОМаркировке)
//
Процедура ЗаполнитьКодыМаркировкиВСтрокеКонтента970(СтрокаКонтента, КодыМаркировки)
	
	ИдентификационныйНомер = Неопределено;
	
	Для Каждого Элемент Из КодыМаркировки.ТранспортныеУпаковки Цикл
		
		ИдентификационныйНомер = Новый_ItemIdentificationNumber();
		ИдентификационныйНомер.TransPackageId = Элемент;
		СтрокаКонтента.ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КодыМаркировки.ИндивидуальныеУпаковки) Тогда
		
		ИдентификационныйНомер = Новый_ItemIdentificationNumber();
		
		Для Каждого Элемент Из КодыМаркировки.ИндивидуальныеУпаковки Цикл
			ИдентификационныйНомер.PackageIds.Добавить(Элемент);
		КонецЦикла;
		
		СтрокаКонтента.ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодыМаркировки.КонтрольныеИдентификационныеЗнаки) Тогда
		
		ИдентификационныйНомер = Новый_ItemIdentificationNumber();
		
		Для Каждого Элемент Из КодыМаркировки.КонтрольныеИдентификационныеЗнаки Цикл
			ИдентификационныйНомер.Units.Добавить(Элемент);
		КонецЦикла;
		
		СтрокаКонтента.ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодыМаркировки.ГТИН) И КодыМаркировки.КоличествоТовараВУпаковке > 0 Тогда
		
		ИдентификационныйНомер = Новый_ItemIdentificationNumber();
		ИдентификационныйНомер.MarkedItemsQuantity = КодыМаркировки.КоличествоТовараВУпаковке;
		
		СтрокаКонтента.ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
		СтрокаКонтента.GTIN = КодыМаркировки.ГТИН;
		
	КонецЕсли;
	
	Если ИдентификационныйНомер <> Неопределено
		И ЗначениеЗаполнено(КодыМаркировки.НомерПартии) Тогда
		ИдентификационныйНомер.BatchCode = КодыМаркировки.НомерПартии;
	КонецЕсли;
	
КонецПроцедуры

// Переносит коды маркировки в строку контента.
//
// Параметры:
//  СтрокаКонтента - Структура - содержит объект Item970 (см. МодульИнтеграции.Контракт_Item970())
//  СведенияОМаркировке - Массив - содержит коллекции кодов маркировки (см. Новый_СведенияОМаркировке)
//
Процедура ЗаполнитьКодыМаркировкиНесколькихПартийВСтрокеКонтента970(СтрокаКонтента, СведенияОМаркировке)
	
	Для Каждого СведенияОПартииМаркировки Из СведенияОМаркировке Цикл
		
		ЗаполнитьКодыМаркировкиВСтрокеКонтента970(СтрокаКонтента, СведенияОПартииМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры


// Подбирает требуемое количество кодов маркировки, удовлетворяющих параметрам номенклатуры.
// В исходной таблице кодов строки с подобранными кодами отмечаются как обработанные.
//
// Параметры:
//  КодыМаркировки		 - Структура - результат подбора (см. Новый_СведенияОМаркировке)
//  ТаблицаКодов		 - ТаблицаЗначений - таблица штрихкодов упаковок (см. РазвернутаяТаблицаУпаковок)
//  СлужебнаяИнформация	 - Структура - содержит параметры номенклатуры (см. НоваяСлужебнаяИнформацияСтроки)
//  ТребуемоеКоличество	 - Число - Количество кодов, которые нужно подобрать
//
Процедура ПодобратьКодыМаркировки(КодыМаркировки
	, РазвернутаяТаблицаУпаковок
	, СлужебнаяИнформация
	, Знач ТребуемоеКоличество
	, ПодобратьКодДляПолногоВозрата = Ложь)
	
	Для Каждого СтрокаУпаковки Из РазвернутаяТаблицаУпаковок Цикл
		
		МожноПодобратьКодПоУпаковке = МожноПодобратьКодМаркировкиПоУпаковке(СтрокаУпаковки, ТребуемоеКоличество, ПодобратьКодДляПолногоВозрата);
		
		Если НЕ МожноПодобратьКодПоУпаковке Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.Номенклатура <> СлужебнаяИнформация.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьХарактеристики
			И СтрокаУпаковки.Характеристика <> СлужебнаяИнформация.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ИспользоватьСерии
			И ЗначениеЗаполнено(СлужебнаяИнформация.Серия)
			И СтрокаУпаковки.Серия <> СлужебнаяИнформация.Серия Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШК = СтрокаУпаковки.ЗначениеШтрихкода; 
		
		Если ЗначениеЗаполнено(ЗначениеШК) Тогда
			
			ВидУпаковки = СтрокаУпаковки.ВидУпаковки;
			
			Если ВидУпаковки = УпаковкаЛогистическая() Тогда
				КодыМаркировки.ТранспортныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаГрупповая() Тогда
				КодыМаркировки.ИндивидуальныеУпаковки.Добавить(ЗначениеШК);
			ИначеЕсли ВидУпаковки = УпаковкаОбъемноСортовойУчет() Тогда
				
				СоставКодаОСУ = СоставКодаОСУ(ЗначениеШК);
				
				КодыМаркировки.КоличествоТовараВУпаковке = СоставКодаОСУ.КоличествоТовара;
				КодыМаркировки.ГТИН = СоставКодаОСУ.GTIN;
				
			Иначе
				КодыМаркировки.КонтрольныеИдентификационныеЗнаки.Добавить(ЗначениеШК);
			КонецЕсли;
			
			ТребуемоеКоличество = ТребуемоеКоличество - 1;
			
		КонецЕсли;
		
		СтрокаУпаковки.Обработан = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Функция МожноПодобратьКодМаркировкиПоУпаковке(СтрокаУпаковки, ТребуемоеКоличество, ПодобратьКодДляПолногоВозрата)
	
	Результат = Истина;
	
	Если СтрокаУпаковки.Обработан Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ПодобратьКодДляПолногоВозрата 
		И ТребуемоеКоличество = 0 Тогда
		
		ЭтоОСУ = СтрокаУпаковки.ВидУпаковки = УпаковкаОбъемноСортовойУчет();
		
		Если НЕ ЭтоОСУ Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТребуемоеКоличество <= 0 Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// Конструктор таблицы кодов маркировки, развернутой по номенклатуре.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок с товарными данными:
//   * Ссылка             - Произвольный - объект-владелец штрихкода - исходная колонка
//   * Номенклатура       - ОпределяемыйТип.Номенклатура - содержимое
//   * Характеристика     - ОпределяемыйТип.ХарактеристикаНоменклатуры - содержимое
//   * Серия              - ОпределяемыйТип.СерияНоменклатуры - содержимое
//   * ЗначениеШтрихкода  - Строка - текстовое представление исходного штрихкода для передачи в ЭДО
//   * ВидУпаковки        - Строка - вид упаковки номенклатуры для кодировки значения штрихкода. Допустимые значения:
//                                   УпаковкаПотребительская(), УпаковкаЛогистическая(), УпаковкаГрупповая(), Неопределено.
//   * Обработан          - Булево - признак сопоставления строки товарной части документа
//
//
Функция Новый_РазвернутаяТаблицаУпаковок()
	
	ТипСтрока200 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200));
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Серия");
	Результат.Колонки.Добавить("ЗначениеШтрихкода", ТипСтрока200);
	Результат.Колонки.Добавить("ВидУпаковки", ТипСтрока200);
	Результат.Колонки.Добавить("Обработан", ТипБулево);
	Результат.Колонки.Добавить("ИспользоватьХарактеристики", ТипБулево);
	Результат.Колонки.Добавить("ИспользоватьСерии", ТипБулево);
	Результат.Колонки.Добавить("КодТоварнойГруппы", ТипЧисло);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_РазвернутаяТаблицаУпаковок_ИСМП10127()
	
	Результат = Новый_РазвернутаяТаблицаУпаковок();
	
	Результат.Колонки.Добавить("КоличествоВПотребительскойУпаковке", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ШтрихКод");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_РазвернутаяТаблицаУпаковок_КонтурМаркировка33()
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипЧисло5 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 0));
	ТипЧисло15_3 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 3));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИндексСтроки", ТипЧисло5);
	Результат.Колонки.Добавить("Количество", ТипЧисло15_3);
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("Серия");
	Результат.Колонки.Добавить("Упаковка");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("ПервичныйДокумент");
	Результат.Колонки.Добавить("СведенияОМаркировке");
	Результат.Колонки.Добавить("КодТоварнойГруппы", ТипЧисло);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру с коллекциями кодов маркировки.
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * ТранспортныеУпаковки - Массив - Идентификаторы транспортных упаковок (TransPackageId, ИдентТрансУпак)
//   * ИндивидуальныеУпаковки - Массив - Идентификаторы потребительских упаковок (PackageIds, НомУпак)
//   * КонтрольныеИдентификационныеЗнаки - Массив - Контрольные идентификационные знаки (Units, КИЗ)
//
Функция Новый_СведенияОМаркировке()
	
	Результат = Новый Структура;
	Результат.Вставить("КонтрольныеИдентификационныеЗнаки", Новый Массив);
	Результат.Вставить("ИндивидуальныеУпаковки", Новый Массив);
	Результат.Вставить("ТранспортныеУпаковки", Новый Массив);
	Результат.Вставить("КоличествоТовараВУпаковке", 0);
	Результат.Вставить("ГТИН", "");
	Результат.Вставить("НомерПартии", "");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ItemIdentificationNumber()
	
	Результат = Новый Структура;
	
	Результат.Вставить("TransPackageId");
	Результат.Вставить("Units", Новый Массив);
	Результат.Вставить("PackageIds", Новый Массив);
	Результат.Вставить("MarkedItemsQuantity", 0);
	Результат.Вставить("BatchCode", "");
	
	Возврат Результат;
	
КонецФункции


Функция СоставКодаОСУ(КодОСУ)
	
	Результат = Новый Структура("GTIN, КоличествоТовара");
	
	ДлинаGTIN = 14;
	ДлинаКодаОСУ = СтрДлина(КодОСУ);
	ДлинаРазделителей = 4; // 02 и 37
	
	Результат.GTIN = Сред(КодОСУ, 3, ДлинаGTIN);
	Результат.КоличествоТовара = Число(Прав(КодОСУ, ДлинаКодаОСУ - ДлинаGTIN - ДлинаРазделителей));
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьКодОСУИзGTIN(КоличествоТовара, СтрокаУпаковки)
	
	Если СтрокаУпаковки.КоличествоВПотребительскойУпаковке = 0 Тогда
		КоличествоПоТегу37 = 0;
	Иначе
		КоличествоПоТегу37 = Окр(КоличествоТовара / СтрокаУпаковки.КоличествоВПотребительскойУпаковке);
	КонецЕсли;
	
	Результат = НовыйКодОСУ(СтрокаУпаковки.ЗначениеШтрихкода, КоличествоПоТегу37);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйКодОСУ(GTIN, Количество)
	
	КоличествоСтрокой = Формат(Количество, "ЧДЦ=0; ЧН=0; ЧГ=;");
	
	ЧастиКодаОСУ = Новый Массив;
	ЧастиКодаОСУ.Добавить("02");
	ЧастиКодаОСУ.Добавить(GTIN);
	ЧастиКодаОСУ.Добавить("37");
	ЧастиКодаОСУ.Добавить(КоличествоСтрокой);
	
	Результат = СтрСоединитьЛок(ЧастиКодаОСУ);
	
	Возврат Результат;
		
КонецФункции

Функция ВладельцыКодовМаркировки(Контент)
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаКонтента Из Контент.Table.Items Цикл
		
		СлужебнаяИнформацияСтрокиКонтента = СтрокаКонтента.СлужебнаяИнформация;
		ДокументОтгрузки = СлужебнаяИнформацияСтрокиКонтента.ДокументОтгрузки;
		
		Если НЕ ЗначениеЗаполнено(ДокументОтгрузки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Результат.Найти(ДокументОтгрузки) = Неопределено Тогда
			Результат.Добавить(ДокументОтгрузки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает параметры учета номенклатуры в текущей информационной базе.
// 
// Возвращаемое значение:
//  ФикисированнаяСтруктура - содержит ключи:
//    * ИспользоватьХарактеристики - Булево - Истина, если используются характеристики номенклатуры
//    * ИспользоватьСерии - Булево - Истина, если используются серии номенклатуры
//
Функция ПараметрыУчетаНоменклатуры()
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьХарактеристики", Ложь);
	Результат.Вставить("ИспользоватьСерии", Ложь);
	
	Если Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьХарактеристики = Истина;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("СерииНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьСерии = Истина;
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции


Функция УпаковкаГрупповая()
	Возврат "Групповая";
КонецФункции

Функция УпаковкаЛогистическая()
	Возврат "Логистическая";
КонецФункции

Функция УпаковкаПотребительская()
	Возврат "Потребительская";
КонецФункции

Функция УпаковкаОбъемноСортовойУчет()
	Возврат "ОбъемноСортовойУчет";
КонецФункции

//}		СВЕДЕНИЯ О МАРКИРОВКЕ ОБЩЕЕ


//{		СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Дополняет коллекцию ошибок валидации электронного документа.
//
// Параметры:
//  Ошибки - Массив - коллекция ошибок
//  ТекстОшибки - Строка - шаблон текста ошибки.
//  Ссылка - Строка, ЛюбаяСсылка - адрес гиперссылки.
//
Процедура ДобавитьОшибкуВалидации970(Ошибки, ТекстОшибки, Ссылка = "") Экспорт
	
	НоваяОшибка = Новый_ОшибкаВалидации970(ТекстОшибки, Ссылка);
	Ошибки.Добавить(НоваяОшибка);
	
КонецПроцедуры

Функция Новый_ОшибкаВалидации970(ТекстОшибки, Ссылка)
	
	Результат = Контракт_ОшибкаВалидацииДокумента970();
	Результат.ТекстОшибки = ТекстОшибки;
	Результат.СсылкаДляИсправления = Ссылка;
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ОшибкаВалидацииДокумента970()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТекстОшибки");
	Результат.Вставить("СсылкаДляИсправления");
	Результат.Вставить("ЭтоГруппа", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Версии типа "1.0.1b" сравнивать нельзя.
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(СтрокаВерсии1) ИЛИ НЕ ПустаяСтрока(СтрокаВерсии2) Цикл
		
		Поз = Найти(СтрокаВерсии1, ".");
		Если Поз > 0 Тогда
			НомерПервойВерсии = ПривестиКЧислуЛок(Лев(СтрокаВерсии1, Поз - 1));
			СтрокаВерсии1 = Сред(СтрокаВерсии1, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(СтрокаВерсии1), 0, ПривестиКЧислуЛок(СтрокаВерсии1));
			СтрокаВерсии1 = "";
		КонецЕсли;
		
		Поз = Найти(СтрокаВерсии2, ".");
		Если Поз > 0 Тогда
			НомерВторойВерсии = ПривестиКЧислуЛок(Лев(СтрокаВерсии2, Поз - 1));
			СтрокаВерсии2 = Сред(СтрокаВерсии2, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(СтрокаВерсии2), 0, ПривестиКЧислуЛок(СтрокаВерсии2));
			СтрокаВерсии2 = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПривестиКЧислуЛок(Значение)
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// ВАЖНО: В результирующую строку добавляются только непустые значения!
// Платформенный метод СтрСоединить объединяет строки безусловно.
// Нужно это учитывать, если в качестве разделителя задана непустая строка.
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - коллекция объединяемых строк.
//  Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
// Пример:
//   
//   Строки = Новый Массив;
//   Строки.Добавить("Элемент0");
//   Строки.Добавить("");
//   Строки.Добавить("Элемент2");
//   
//   СоединитьСтроку(Строки, "#") = "Элемент0#Элемент2"
//   СтрСоединить(Строки, "#") = "Элемент0##Элемент2"
//   СоединитьСтроку(Строки, "") = СтрСоединить(Строки, "") = "Элемент0Элемент2"
//
Функция СтрСоединитьЛок(Строки, Разделитель = "")
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон содержащий маркеры подстановки вида: "%1..%N"
//                        . Нумерация маркеров начинается с 1.
//                          N не может быть более 5.
//  Параметр<n>  - Строка - подставляемые параметры.
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
Функция СтрШаблонЛок(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Возвращает шаблон текста для объединения запросов.
//
// Возвращаемое значение:
//   Строка
//
Функция РазделительОбъединенияЗапросов()
	
	Результат = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеТиповЗначения(Значение)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(Значение));
	
	Результат = Новый ОписаниеТипов(МассивТипов);
	
	Возврат Результат;
	
КонецФункции

Функция ПлатформаПоддерживаетОпределяемыеТипы()
	
	Результат = Истина;
	
	СисИнфо = Новый СистемнаяИнформация;
	ТекущаяВерсияПлатформы = СисИнфо.ВерсияПриложения;
	НеобходимаяВерсияПлатформы = "8.3.3";
	
	Результат = СравнитьВерсии(ТекущаяВерсияПлатформы, НеобходимаяВерсияПлатформы) >= 0;
	
	Возврат Результат;
	
КонецФункции

//}		СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
