// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Кэш;

//******************************************
//{		ПОДКЛЮЧЕНИЕ В DDPro

Перем ОсновнойМодуль Экспорт;

//}		ПОДКЛЮЧЕНИЕ В DDPro

//******************************************
//{		ПОДКЛЮЧЕНИЕ В DDStandart

Перем Манифест 				Экспорт;
Перем ОбработкаОбъект 		Экспорт;
Перем ПараметрыКлиентСервер Экспорт;
Перем НомерИтерацииВызоваМодуля;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля = 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект			 = Неопределено;
		ПараметрыКлиентСервер	 = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Может пригодиться при отладке в режиме управляемых форм, когда точки остановки в открытом модуле не срабатывают.
// Достаточно вставить вызов данной процедуры в нужном месте и включить остановку по ошибке.
Процедура ПриглашениеОтладки() Экспорт
	
	//// Удалите комментарий напротив оператора "ВызватьИсключение", чтобы получить приглашение для начала отладки модуля.
	//ВызватьИсключение "Нажмите кнопку ""Подробно"", а затем ""Конфигуратор"", чтобы начать отладку модуля!"; 
	
КонецПроцедуры

Процедура ЗаполнитьМанифест(Модуль, ИмяМодуля) Экспорт
	
	ФункцииМодуля = ФункцииМодуля();
	
	Манифест = Новый Структура;
	Манифест.Вставить("Функции", ФункцииМодуля);
	
КонецПроцедуры

Функция ФункцииМодуля()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПечатнаяФормаПротоКонтента");
	Результат.Вставить("ПредставлениеПротоСтруктурыАдреса");
	Результат.Вставить("ПараметрыИсчисленияВалюты");
	
	Возврат Результат;
	
КонецФункции

//}		ПОДКЛЮЧЕНИЕ В DDStandart


//**************************************
//{		ВЕРСИЯ

Функция ВерсияОбработки()
	
	Версия = "1.7.0";
	
	Результат = Версия + "." + НомерСборки();
	
	Возврат Результат;
	
КонецФункции

Функция НомерСборки()
	
	Возврат "107";
	
КонецФункции

//}		ВЕРСИЯ


//**************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид"				, "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование"	, "Диадок (СКБ Контур): Печатные формы");
	ПараметрыРегистрации.Вставить("БезопасныйРежим"	, Истина);
	ПараметрыРегистрации.Вставить("Версия"			, ВерсияОбработки());
	ПараметрыРегистрации.Вставить("Информация"		, "Модуль для построения печатных форм");
	
	ПараметрыРегистрации.Вставить("Команды", Новый ТаблицаЗначений);
	ПараметрыРегистрации.Команды.Колонки.Добавить("Представление"		, Новый ОписаниеТипов("Строка")); 
	ПараметрыРегистрации.Команды.Колонки.Добавить("Идентификатор"		, Новый ОписаниеТипов("Строка"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("Использование"		, Новый ОписаниеТипов("Строка"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("Модификатор"		 	, Новый ОписаниеТипов("Строка"));
	
	//НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	//НоваяКоманда.Использование = "ОткрытиеФормы";
	//НоваяКоманда.Представление = ПараметрыРегистрации.Наименование;
	//НоваяКоманда.Идентификатор = "ФормаОтладкиУправлемая";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

//**********************************************
//{		КЭШИРОВАНИЕ

// Возвращает значение из кэша.
//
// Параметры:
//  Ключ - Строка - см. процедуру Кэш_Поместить.
//
// Возвращаемое значение: 
//   Произвольный - см. процедуру Кэш_Поместить.
//
Функция Кэш_Прочитать(Ключ)
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Возврат Кэш[Ключ];
	
КонецФункции

// Помещает значение в кэш.
//
// Параметры:
//  Ключ     - Строка       - уникальный ключ помещаемого значения.
//  Значение - Произвольный - помещаемое значение.
//
Процедура Кэш_Поместить(Ключ, Значение)
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Кэш.Вставить(Ключ, Значение);
	
КонецПроцедуры

//}		КЭШИРОВАНИЕ

//******************************************
//{		ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает печатную форму прото контента.
//
// Параметры:
//  ПротоКонтент  - Структура - титул продавца в прото формате;
//  ТипКонтента   - Строка    - идентификатор типа контента;
//  ТипДокумента  - Строка    - идентификатор типа документа;
//  ДопПараметры  - Структура - содержит свойства:
//    ДанныеШтампа        - Структура - (необязательный), данные для формирования штампа о подписях;
//    ПротоКонтентОтвета  - Структура - (необязательный), титул покупателя в прото формате;
//    ДокументЗашифрован  - Булево    - (Необязательный), если Истина, то возвращается надпись "Документ зашифрован";
//    ПоказатьДопСведения - Булево    - (Необязательный), если Истина, то в печатной форме отображаются доп. сведения;
//    ВыводитьНаименованиеТовараСКодами - Булево - (Необязательный): 
//    									  если Истина, то в печатной форме выводится наименование товара с кодами и характеристиками,
//                                        если Ложь, в наименование товара выводится только одно из заполненных значений
//
// Возвращаемое значение:
//   Табличный документ - печатная форма
//
Функция ПечатнаяФормаПротоКонтента(ПротоКонтент, ТипКонтента, ТипДокумента, ДопПараметры) Экспорт
	
	ДанныеШтампа			 = СвойствоСтруктуры(ДопПараметры, "ДанныеШтампа");	
	ПротоКонтентОтвета		 = СвойствоСтруктуры(ДопПараметры, "ПротоКонтентОтвета");
	ДокументЗашифрован		 = СвойствоСтруктуры(ДопПараметры, "ДокументЗашифрован"				, Ложь);
	ПоказатьДопСведения		 = СвойствоСтруктуры(ДопПараметры, "ПоказатьДопСведения"			, Ложь);
	
	ВыводитьНаименованиеТовараСКодами = СвойствоСтруктуры(ДопПараметры, "ВыводитьНаименованиеТовараСКодами", Истина);
	
	Параметры = Новый Структура;
	Параметры.Вставить("Content"				, ПротоКонтент);
	Параметры.Вставить("BuyerContent"			, ПротоКонтентОтвета);
	Параметры.Вставить("ДанныеШтампа"			, ДанныеШтампа);
	Параметры.Вставить("ПоказатьДопСведения"	, ПоказатьДопСведения);
	Параметры.Вставить("ДокументЗашифрован"		, ДокументЗашифрован);
	
	Параметры.Вставить("ВыводитьНаименованиеТовараСКодами", ВыводитьНаименованиеТовараСКодами);
	
	ДополнитьПараметрыФорматамиЦеныКоличества(Параметры, ДопПараметры);
	
	Результат = ПечатнаяФорма(Параметры, ТипКонтента, ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьПараметрыФорматамиЦеныКоличества(Параметры, ДопПараметры)
	
	ТочностьКоличества		 = СвойствоСтруктуры(ДопПараметры, "ТочностьКоличества"	, Неопределено);
	Если ЗначениеЗаполнено(ТочностьКоличества) Тогда
		ФорматКоличества	 = ФорматКоличества(ТочностьКоличества);
	Иначе
		ФорматКоличества	 = ФорматКоличества();
	КонецЕсли;
	
	ТочностьЦены			 = СвойствоСтруктуры(ДопПараметры, "ТочностьЦены"			, Неопределено);
	Если ЗначениеЗаполнено(ТочностьЦены) Тогда
		ФорматСуммы			 = ФорматСуммы(ТочностьЦены);
	Иначе
		ФорматСуммы			 = ФорматСуммы();
	КонецЕсли;

	Параметры.Вставить("ФорматКоличества"		, ФорматКоличества);
	Параметры.Вставить("ФорматСуммы"			, ФорматСуммы);

КонецПроцедуры


// Возвращает представление структуры адреса в прото формате.
//
// Параметры:
//  СтруктураАдреса - Структура - адрес в прото формате;
//
// Возвращаемое значение:
//   Строка - представление адреса
//
Функция ПредставлениеПротоСтруктурыАдреса(СтруктураАдреса) Экспорт
	
	Результат = СтрокаАдрес(СтруктураАдреса);
	
	Возврат Результат;
	
КонецФункции

//}		ПРОГРАММНЫЙ ИНТЕРФЕЙС


//******************************************
//{		ТИПЫ ПРОТО

Функция КонтентИнформацияПродавца970()
	Возврат "Utd970SellerContent";
КонецФункции

Функция КонтентИнформацияПродавца820()
	Возврат "Utd820SellerContent";
КонецФункции

Функция КонтентИнформацияПродавца155()
	Возврат "UtdSellerContent";
КонецФункции

Функция КонтентИнформацияПродавца736()
	Возврат "UcdSellerContent";
КонецФункции

Функция КонтентИнформацияПродавца551()
	Возврат "TovTorgSellerContent";
КонецФункции

Функция КонтентИнформацияПродавца552()
	Возврат "Act552SellerContent";
КонецФункции

Функция КонтентИнформацияПродавцаНакладная172()
	Возврат "Torg12SellerContent";
КонецФункции

Функция КонтентИнформацияПродавцаАкт172()
	Возврат "AcceptanceCertificateSellerContent";
КонецФункции

Функция КонтентИнформацияПродавцаСФ93()
	Возврат "InvoiceContent";
КонецФункции

Функция КонтентИнформацияПродавцаКСФ93()
	Возврат "InvoiceCorrectionContent";
КонецФункции

Функция КонтентИнформацияПродавцаСчетНаОплату()
	Возврат "ProformaInvoiceSellerContent";
КонецФункции

Функция КонтентИнформацияОтправителяАктСверки405()
	Возврат "ReconciliationActSenderTitle";
КонецФункции

Функция КонтентИнформацияПродавцаСчетНаОплату29()
	Возврат "ProformaInvoice29SellerContent";
КонецФункции

//}		ТИПЫ ПРОТО


//******************************************
//{		ТИПЫ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

Функция ТипУниверсальныйПередаточныйДокумент()
	Возврат "UniversalTransferDocument";
КонецФункции

Функция ТипУниверсальныйПередаточныйДокументИсправление()
	Возврат "UniversalTransferDocumentRevision";
КонецФункции

Функция ТипУниверсальныйКорректировочныйДокумент()
	Возврат "UniversalCorrectionDocument";
КонецФункции

Функция ТипУниверсальныйКорректировочныйДокументИсправление()
	Возврат "UniversalCorrectionDocumentRevision";
КонецФункции

Функция ТипТоварнаяНакладная()
	Возврат "XmlTorg12";
КонецФункции

Функция ТипАктОбОказанииУслуг()
	Возврат "XmlAcceptanceCertificate";
КонецФункции

Функция ТипСчетФактура()
	Возврат "Invoice";
КонецФункции

Функция ТипСчетФактураИсправление()
	Возврат "InvoiceRevision";
КонецФункции

Функция ТипКорректировочныйСчетФактура()
	Возврат "InvoiceCorrection";
КонецФункции

Функция ТипКорректировочныйСчетФактураИсправление()
	Возврат "InvoiceCorrectionRevision";
КонецФункции

Функция ТипАктОРасхождениях()
	Возврат "Torg2";
КонецФункции

Функция ТипСчетНаОплату()
	Возврат "ProformaInvoice";
КонецФункции

Функция ТипСчетОфертаФНС29()
	Возврат "XmlInvoiceOffer";
КонецФункции

//}		ТИПЫ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

//******************************************
//{		ФУНКЦИИ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

Функция ФункцияСЧФДОП()
	Возврат "СЧФДОП";
КонецФункции

Функция ФункцияСЧФ()
	Возврат "СЧФ";
КонецФункции

Функция ФункцияДОП()
	Возврат "ДОП";
КонецФункции

Функция ФункцияКСЧФДИС()
	Возврат "КСЧФДИС";
КонецФункции

Функция ФункцияКСЧФ()
	Возврат "КСЧФ";
КонецФункции

Функция ФункцияДИС()
	Возврат "ДИС";
КонецФункции

Функция ФункцияWithAdditionalInfo()
	Возврат "WithAdditionalInfo";
КонецФункции

Функция ФункцияNoAdditionalInfo()
	Возврат "NoAdditionalInfo";
КонецФункции

Функция ФункцияПоУмолчанию()
	Возврат "default";
КонецФункции

//}		ФУНКЦИИ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

//******************************************
//{		ПРОТОФУНКЦИИ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

Функция ПротофункцияInvoiceAndBasic()
	Возврат "InvoiceAndBasic";
КонецФункции

Функция ПротофункцияInvoice()
	Возврат "Invoice";
КонецФункции

Функция ПротофункцияBasic()
	Возврат "Basic";
КонецФункции

Функция ПротофункцияWithInfo()
	Возврат "WithInfo";
КонецФункции

Функция ПротофункцияNoInfo()
	Возврат "NoInfo";
КонецФункции

//}		ПРОТОФУНКЦИИ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

//******************************************
//{		БАЗОВЫЕ ФОРМАТЫ

// УПД, акт или накладная в формате приказа 820@
//
Функция БазовыйФормат820()
	Возврат "utd820";
КонецФункции

// УПД, акт или накладная в формате приказа 155@
//
Функция БазовыйФормат155()
	Возврат "utd";
КонецФункции

// УКД, КСФ или документ об изменении стоимости в формате приказа 736@
//
Функция БазовыйФормат736()
	Возврат "ucd736";
КонецФункции

// УКД, КСФ или документ об изменении стоимости в формате приказа 189@
//
Функция БазовыйФормат189()
	Возврат "ucd";
КонецФункции

// Товарная накладная в формате приказа 551@
//
Функция БазовыйФормат551()
	Возврат "tovtorg";
КонецФункции

// Акт выполненных работ в формате приказа 552@
//
Функция БазовыйФормат552()
	Возврат "rezru";
КонецФункции

// Счет-фактура в формате приказа 93@
//
Функция БазовыйФорматСФ93()
	Возврат "invoice";
КонецФункции

// Корректировочный счет-фактура в формате приказа 93@
//
Функция БазовыйФорматКСФ93()
	Возврат "invoicecor";
КонецФункции

// Акт выполненных работ в формате приказа 172@
//
Функция БазовыйФорматАкт172()
	Возврат "act";
КонецФункции

// Товарная накладная в формате приказа 172@
//
Функция БазовыйФорматНакладная93()
	Возврат "torg12";
КонецФункции

// Акт о расхождениях в формате приказа 423@
//
Функция БазовыйФормат423()
	Возврат "torg2";
КонецФункции

// Формализованный счет на оплату
//
Функция БазовыйФорматСчетНаОплату()
	Возврат "proformainvoice";
КонецФункции

// Неформализованный документ
//
Функция БазовыйФорматНеформализованный()
	Возврат "v1";
КонецФункции

// Формат неизвестен
//
Функция БазовыйФорматНеизвестный()
	Возврат "unknown";
КонецФункции

// }		БАЗОВЫЕ ФОРМАТЫ

// ******************************************
// {		ПЕЧАТНЫЕ ФОРМЫ

Функция ПечатнаяФорма_ОшибкиФормирования(ПредставлениеДокумента, ТекстОшибки) Экспорт
	
	Таб = НовыйТабличныйДокумент("DD_ERRORS");
	
	Макет = ПолучитьМакет("ПФ_MXL_ОшибкиФормированияПечатнойФормы");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ПредставлениеДокумента = ПредставлениеДокумента;
	Таб.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ТехническаяИнформация");
	Область.Параметры.ТекстОшибки = ТекстОшибки;
	Таб.Вывести(Область);
	
	Возврат Таб;
	
КонецФункции

Функция ПечатнаяФормаЗаглушка(ТипДокумента, ТипКонтента, ФункцияДокумента = "")
	
	Таб = НовыйТабличныйДокумент("DD_UNDEFINED");
	
	Макет = ПолучитьМакет("ПФ_MXL_ПечатнаяФормаОтсутствует");
	
	ПФ_Заглушка_ВывестиЗаголовок(Таб, Макет);
	
	Детали = Новый Массив;
	
	ДобавитьКлючЗначение(Детали, "Тип контента", ТипКонтента);
	ДобавитьКлючЗначение(Детали, "Тип документа", ТипДокумента);
	
	Если ЗначениеЗаполнено(ФункцияДокумента) Тогда
		ДобавитьКлючЗначение(Детали, "Функция документа", ФункцияДокумента);
	КонецЕсли;
	
	Для Каждого Элемент Из Детали Цикл
		
		ПФ_Заглушка_ДобавитьТехническуюИнформацию(
			Таб,
			Макет,
			Элемент.Ключ,
			Элемент.Значение
		);
		
	КонецЦикла;
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_Заглушка_ВывестиЗаголовок(Таб, Макет)
	
	ТекстЗаголовка = "Просмотр печатной формы недоступен.";
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = ТекстЗаголовка;
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Заглушка_ДобавитьТехническуюИнформацию(Таб, Макет, ЗаголовокПараметра, ЗначениеПараметра)
	
	Область = Макет.ПолучитьОбласть("ТехническаяИнформация");
	
	Область.Параметры.ЗаголовокПараметра = ЗаголовокПараметра;
	Область.Параметры.ЗначениеПараметра = ЗначениеПараметра;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Функция ПечатнаяФорма970(Параметры, ТипДокумента)
	
	Если ТипДокумента = НРег(ТипСчетФактура())
		Или ТипДокумента = НРег(ТипСчетФактураИсправление()) Тогда
		
		Результат = ПФ_СФ_УПД_970(Параметры);
		
	ИначеЕсли ТипДокумента = НРег(ТипТоварнаяНакладная()) Тогда
		
		Результат = ПФ_Торг12_УПД_970(Параметры);
		
	ИначеЕсли ТипДокумента = НРег(ТипАктОбОказанииУслуг()) Тогда
		
		Результат = ПФ_Акт_УПД_970(Параметры);
		
	Иначе
		
		Результат = ПФ_УПД_970(Параметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФорма155(Параметры, ТипДокумента)
	
	Если ТипДокумента = НРег(ТипСчетФактура())
		Или ТипДокумента = НРег(ТипСчетФактураИсправление()) Тогда
		
		Результат = ПФ_СФ_УПД(Параметры);
		
	ИначеЕсли ТипДокумента = НРег(ТипТоварнаяНакладная()) Тогда
		
		Результат = ПФ_Торг12_УПД(Параметры);
		
	ИначеЕсли ТипДокумента = НРег(ТипАктОбОказанииУслуг()) Тогда
		
		Результат = ПФ_Акт_УПД(Параметры);
		
	Иначе
		
		Результат = ПФ_УПД(Параметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФорма820(Параметры, ТипДокумента)
	
	Если ТипДокумента = НРег(ТипСчетФактура())
		Или ТипДокумента = НРег(ТипСчетФактураИсправление()) Тогда
		
		Результат = ПФ_СФ_УПД_820(Параметры);
		
	ИначеЕсли ТипДокумента = НРег(ТипТоварнаяНакладная()) Тогда
		
		Результат = ПФ_Торг12_УПД_820(Параметры);
		
	ИначеЕсли ТипДокумента = НРег(ТипАктОбОказанииУслуг()) Тогда
		
		Результат = ПФ_Акт_УПД_820(Параметры);
		
	Иначе
		
		Результат = ПФ_УПД_820(Параметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФорма189(Параметры, ТипДокумента)
	
	Если ТипДокумента = НРег(ТипКорректировочныйСчетФактура())
		Или ТипДокумента = НРег(ТипКорректировочныйСчетФактураИсправление()) Тогда
		
		Результат = ПФ_КСФ_УКД(Параметры);
		
	Иначе
		
		Результат = ПФ_УКД(Параметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФорма736(Параметры, ТипДокумента)
	
	Если ТипДокумента = НРег(ТипКорректировочныйСчетФактура())
		Или ТипДокумента = НРег(ТипКорректировочныйСчетФактураИсправление()) Тогда
		
		Результат = ПФ_КСФ_УКД_736(Параметры);
		
	Иначе
		
		Результат = ПФ_УКД_736(Параметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФорма(Параметры, Знач ТипКонтента, Знач ТипДокумента)
	
	ТипКонтента	 = НРег(ТипКонтента);
	ТипДокумента = НРег(ТипДокумента);
	
	Если Параметры.ДокументЗашифрован Тогда
		
		Результат = ПолучитьМакет("НадписьДокументЗашифрован");
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавца970()) Тогда
		
		Результат = ПечатнаяФорма970(Параметры, ТипДокумента);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавца155()) Тогда
		
		Результат = ПечатнаяФорма155(Параметры, ТипДокумента);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавца820()) Тогда
		
		Результат = ПечатнаяФорма820(Параметры, ТипДокумента);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавца736()) Тогда
		
		БазовыйФормат = Неопределено;
		Параметры.Content.Свойство("FormatVersion", БазовыйФормат);
		
		Если БазовыйФормат = БазовыйФормат736() Тогда
			
			Результат = ПечатнаяФорма736(Параметры, ТипДокумента);
			
		Иначе
			
			Результат = ПечатнаяФорма189(Параметры, ТипДокумента);
			
		КонецЕсли;
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавца551()) Тогда
		
		Результат = ПФ_Торг12_551(Параметры);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавца552()) Тогда
		
		Результат = ПФ_Акт_552(Параметры);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавцаНакладная172()) Тогда
		
		Результат = ПФ_Торг12(Параметры);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавцаАкт172()) Тогда
		
		Результат = ПФ_Акт(Параметры);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавцаСФ93()) Тогда
		
		Результат = ПФ_СФ(Параметры);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавцаКСФ93()) Тогда
		
		Результат = ПФ_КСФ(Параметры);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияОтправителяАктСверки405()) Тогда
		
		Результат = ПФ_АктСверки_405(Параметры);
		
	ИначеЕсли ТипКонтента = НРег(КонтентИнформацияПродавцаСчетНаОплату29()) Тогда
		
		Результат = ПФ_СчетНаОплату_29(Параметры, ТипДокумента);
		
	Иначе
		
		Результат = ПечатнаяФормаЗаглушка(ТипДокумента, ТипКонтента);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПФ_Торг12(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("ТОРГ12"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfo);
	
	Таб = НовыйТабличныйДокумент("DD_ТОРГ12");
	
	ПФ_Торг12_ШапкаДокумента(Таб, Параметры);
	ПФ_Торг12_ШапкаТаблицы(Таб, Параметры);
	ПФ_Торг12_СтрокиТаблицы(Таб, Параметры);
	ПФ_Торг12_ПодвалТаблицы(Таб, Параметры);
	ПФ_Торг12_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_Торг12_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("Колонтитул"));
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	// Грузоотправитель, Грузополучатель, Продавец, Покупатель, Договор основание 
	Область = Параметры.Макет.ПолучитьОбласть("Шапка1");
	Область.Параметры.Грузоотправитель		 = СтрокаДанныеКонтрагента(Content.Shipper);
	Область.Параметры.подразделение			 = Content.ShipperDepartment;
	Область.Параметры.ГрузоотправительПоОКПО = Content.Shipper.Okpo;
	Область.Параметры.ВидДеятельностиПоОКДП	 = Content.ShipperOkdp;
	Область.Параметры.Грузополучатель		 = СтрокаДанныеКонтрагента(Content.Consignee);
	Область.Параметры.ГрузополучательПоОКПО	 = Content.Consignee.Okpo;
	
	Область.Параметры.Продавец 	   	 = СтрокаДанныеКонтрагента(Content.Seller);
	Область.Параметры.ПродавецПоОКПО = Content.Seller.Okpo;
	
	Область.Параметры.Покупатель	   = СтрокаДанныеКонтрагента(Content.Buyer);
	Область.Параметры.ПокупательПоОКПО = Content.Buyer.Okpo;
	
	Область.Параметры.Основание		 = СтрокаОснованиеНакладной(Content.GroundName, Content.GroundNumber, Content.GroundDate);
	Область.Параметры.ОснованиеДата  = ДатаСтрокой(Content.GroundDate);
	Область.Параметры.ОснованиеНомер = Content.GroundNumber;
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
	// Номер и дата документа, номер и дата транспортной накладной, вид операции
	Область = Параметры.Макет.ПолучитьОбласть("Шапка2");
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата	= ДатаСтрокой(Content.Date);
	Область.Параметры.ВидОперации = Content.OperationCode;
	
	Область.Параметры.ТранспортнаяНакладнаяНомер = Content.WaybillNumber;
	Область.Параметры.ТранспортнаяНакладнаяДата	 = ДатаСтрокой(Content.WaybillDate);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_ШапкаТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Область.Параметры.Валюта = ПредставлениеВалютыТорг12("643");
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для Каждого Item Из Параметры.Content.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Параметры.ПоказатьДопСведения И ЗначениеЗаполнено(Item.AdditionalInfo) Тогда 
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", Item.AdditionalInfo);
		Иначе 	
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = СтрокаНаименованиеСтрокиНакладной(Item);
		Область.Параметры.Код		   = Item.ProductCode;
		
		Область.Параметры.ЕдиницаИзмерения	  = Item.UnitName;
		Область.Параметры.ЕдиницаИзмеренияКод =	Item.UnitCode;
		Область.Параметры.ВидУпаковки		  = Item.ParcelType;
		
		Область.Параметры.КоличествоВОдномМесте = Число_В_Формат(Item.ParcelCapacity);
		Область.Параметры.КоличествоМест 		= Число_В_Формат(Item.ParcelsQuantity);
		Область.Параметры.Масса					= КоличествоСтрокой(Item.GrossQuantity);
		
		Область.Параметры.Количество  = КоличествоСтрокой(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокой(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = Число_В_Формат(Item.TotalWithVatExcluded, "ЧДЦ=2; ЧН=");
		Область.Параметры.СуммаНДС	  = Число_В_Формат(Item.Vat  , "ЧДЦ=2; ЧН=");
		Область.Параметры.СуммаВсего  = Число_В_Формат(Item.Total, "ЧДЦ=2; ЧН=");
		Область.Параметры.СтавкаНДС	  = СтрокаСтавкаНДС(Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_Торг12_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.КоличествоМест = Число_В_Формат(Параметры.Content.Totals.ParcelsQuantity);
	Область.Параметры.Масса			 = КоличествоСтрокой(Параметры.Content.Totals.GrossQuantity);
	Область.Параметры.Количество	 = КоличествоСтрокой(Параметры.Content.Totals.Quantity, Параметры.ФорматКоличества);
	
	Область.Параметры.СуммаБезНДС	 = Число_В_Формат(Параметры.Content.Totals.TotalWithVatExcluded, "ЧДЦ=2; ЧН=");
	Область.Параметры.СуммаНДС		 = Число_В_Формат(Параметры.Content.Totals.Vat				   , "ЧДЦ=2; ЧН=");
	Область.Параметры.СуммаВсего	 = Число_В_Формат(Параметры.Content.Totals.Total			   , "ЧДЦ=2; ЧН=");
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = КоличествоЗаписейПрописью(Content.Items.Количество());
	
	Область.Параметры.ВсегоМестПрописью = Content.Commons.TotalParcelsQuantityInWords;
	Область.Параметры.СуммаПрописью 	= Content.Commons.TotalSumInWords;
	
	Область.Параметры.МассаНеттоПрописью = Content.Commons.TotalQuantityInWords;
	Область.Параметры.МассаНетто		 = Content.Commons.TotalQuantity;
	
	Область.Параметры.МассаГрузаПрописью = Content.Commons.TotalGrossQuantityInWords;
	Область.Параметры.МассаГруза		 = Content.Commons.TotalGrossQuantity;
	
	Область.Параметры.КоличествоПриложений = Число_В_Формат(Content.AttachmentSheetsQuantity);
	
	Область.Параметры.ГлавБух			= СтрокаФИО(Content.ChiefAccountant);
	Область.Параметры.ПродавецПодписант	= СтрокаФИО(Content.SupplyAllowedBy);
	Область.Параметры.ПродавецДолжность = Content.SupplyAllowedBy.JobTitle;
	
	Область.Параметры.ПродавецРаботник			= СтрокаФИО(Content.SupplyPerformedBy);
	Область.Параметры.ПродавецРаботникДолжность = Content.SupplyPerformedBy.JobTitle;
	
	Область.Параметры.ДатаОтпуска = Формат(Content.SupplyDate, "ДФ='dd MMMM yyyy ""года""'");
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) Тогда
		
		Область.Параметры.ПокупательДолжность  = Параметры.BuyerContent.Receiver.JobTitle;
		Область.Параметры.ПокупательПодписант  = СтрокаФИО(Параметры.BuyerContent.Receiver);
		
		Область.Параметры.ПокупательРаботник	   	  = СтрокаФИО(Параметры.BuyerContent.Accepter);
		Область.Параметры.ПокупательРаботникДолжность = Параметры.BuyerContent.Accepter.JobTitle;
		
		Область.Параметры.ДоверенностьНомер	   = Параметры.BuyerContent.Attorney.Number;
		Область.Параметры.ДоверенностьДата	   = ДатаСтрокой(Параметры.BuyerContent.Attorney.Date);
		
		Область.Параметры.ДоверенностьВыдана   = СтрокаДоверенностьВыдана(Параметры.BuyerContent.Attorney);
		Область.Параметры.ДоверенностьПолучена = СтрокаДоверенностьПолучена(Параметры.BuyerContent.Attorney);
		
		Область.Параметры.ДатаПолучения = Формат(Параметры.BuyerContent.ShipmentReceiptDate, "ДФ='dd MMMM yyyy ""года""'");
		
	КонецЕсли;	
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Торг12_УПД(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("ТОРГ12"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_ТОРГ12");
	
	ПФ_Торг12_УПД_ШапкаДокумента(Таб, Параметры);
	ПФ_Торг12_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_СтрокиТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_ПодвалТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_Торг12_УПД_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("Колонтитул"));
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка1");
	
	Если Content.Shipper.SameAsSeller = Ложь И ЗначениеЗаполнено(Content.Shipper.OrganizationInfo.Name) Тогда
		Грузоотправитель = Content.Shipper.OrganizationInfo;
	Иначе
		Грузоотправитель = Content.Seller;
	КонецЕсли;
	
	Область.Параметры.Грузоотправитель		 = СтрокаДанныеКонтрагента(Грузоотправитель);
	Область.Параметры.Подразделение 		 = Грузоотправитель.Department;
	Область.Параметры.ГрузоотправительПоОКПО = Грузоотправитель.Okpo;
	Область.Параметры.ВидДеятельностиПоОКДП	 = Грузоотправитель.Okdp;
	
	Область.Параметры.Грузополучатель		 = СтрокаДанныеКонтрагента(Content.Consignee);
	Область.Параметры.ГрузополучательПоОКПО	 = Content.Consignee.Okpo;
	
	Область.Параметры.Продавец		 = СтрокаДанныеКонтрагента(Content.Seller);
	Область.Параметры.ПродавецПоОКПО = Content.Seller.Okpo;
	
	Область.Параметры.Покупатель	   = СтрокаДанныеКонтрагента(Content.Buyer);
	Область.Параметры.ПокупательПоОКПО = Content.Buyer.Okpo;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferBases) Тогда
		TransferBase = Content.TransferInfo.TransferBases[0]; 
		Область.Параметры.Основание		 = СтрокаДокументыОснованияУПД(Content.TransferInfo.TransferBases);
		Область.Параметры.ОснованиеДата	 = ДатаСтрокой(TransferBase.DocumentDate);
		Область.Параметры.ОснованиеНомер = TransferBase.DocumentNumber;
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
	Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Content.Date);
	
	Таб.Вывести(Область);
	
	// Номер и дата документа, номер и дата транспортной накладной
	Область = Параметры.Макет.ПолучитьОбласть("Шапка2");
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата	= ДатаСтрокой(Content.Date);
	
	Область.Параметры.ВидОперации = Content.TransferInfo.OperationType;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.Waybills) Тогда
		Waybill = Content.TransferInfo.Waybills[0];
		Область.Параметры.ТранспортнаяНакладнаяНомер = Waybill.DocumentNumber;
		Область.Параметры.ТранспортнаяНакладнаяДата	 = ДатаСтрокой(Waybill.DocumentDate);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_ШапкаТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Область.Параметры.Валюта = ПредставлениеВалютыТорг12(Параметры.Content.Currency);
	
	Таб.Вывести(Область);	
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для Каждого Item Из Параметры.Content.InvoiceTable.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = СтрокаИлиДефис(Item.Product);
		Область.Параметры.Код		   = СтрокаИлиДефис(Item.VendorCode);
		
		Область.Параметры.ЕдиницаИзмерения	  = СтрокаЕдиницаИзмерения(Item.UnitCode, Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаИлиДефис(Item.UnitCode);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = Число_В_Формат(Item.SubtotalWithVatExcluded, "ЧДЦ=2; ЧН=", СтрокаДефис());
		Область.Параметры.СуммаВсего  = СтрокаСуммаВсего(Item.SubTotal, Item.TaxRate, "ЧДЦ=2; ЧН=");
		Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС(Item.Vat, Item.TaxRate);
		Область.Параметры.СтавкаНДС	  = СтрокаСтавкаНДС(Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Параметры.Content.InvoiceTable.TotalNet, Параметры.ФорматКоличества);
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceTable.TotalWithVatExcluded);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Параметры.Content.InvoiceTable.Items) Тогда
		Область.Параметры.СуммаВсего = СтрокаДефис();
		Область.Параметры.СуммаНДС	 = СтрокаДефис();
	Иначе
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceTable.Total);
		Область.Параметры.СуммаНДС	 = ПодвалСуммаНДС(Параметры.Content.InvoiceTable.Vat);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалУПД");
	
	Область.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = КоличествоЗаписейПрописью(Content.InvoiceTable.Items.Количество());
	
	Сумма = ?(ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Content.InvoiceTable.Items), Content.InvoiceTable.TotalWithVatExcluded, Content.InvoiceTable.Total);
	Область.Параметры.СуммаПрописью = СуммаПрописью(Сумма, Content.Currency);
	Область.Параметры.МассаНетто = Content.InvoiceTable.TotalNet;
	
	Подписи = СтрокиПодписей(Content.Signers);
	Область.Параметры.ПродавецПодписант	= Подписи.ФИО;
	Область.Параметры.ПродавецДолжность = Подписи.Должность;
	
	Работник = РаботникИлиИноеЛицо(Content.TransferInfo);
	Если Работник <> Неопределено Тогда
		Область.Параметры.ПродавецРаботник			= СтрокаФИО(Работник);
		Область.Параметры.ПродавецРаботникДолжность = Работник.EmployeePosition;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
		Область.Параметры.ДатаОтпуска = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	Иначе
		Область.Параметры.ДатаОтпуска = Формат(Content.Date, "ДФ='dd MMMM yyyy ""года""'");
	КонецЕсли;	
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) И ЗначениеЗаполнено(Параметры.BuyerContent.OperationContent) Тогда
		
		Если ЗначениеЗаполнено(Параметры.BuyerContent.AcceptanceDate) Тогда
			ДатаПолучения = Параметры.BuyerContent.AcceptanceDate;
		ИначеЕсли ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
			ДатаПолучения = Content.TransferInfo.TransferDate;
		Иначе
			ДатаПолучения = Content.Date;
		КонецЕсли;
		
		Область.Параметры.ДатаПолучения		 = Формат(ДатаПолучения, "ДФ='dd MMMM yyyy ""года""'");
		Область.Параметры.СодержаниеОперации = Параметры.BuyerContent.OperationContent;
		
		Работник = РаботникИлиИноеЛицо(Параметры.BuyerContent);
		Если Работник <> Неопределено Тогда
			Область.Параметры.ГрузПринялФИО		  = СтрокаФИО(Работник);
			Область.Параметры.ГрузПринялДолжность = Работник.EmployeePosition;
		КонецЕсли;
		
		Подписи = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ГрузПолучилФИО	   = Подписи.ФИО;
		Область.Параметры.ГрузПолучилДолжность = Подписи.Должность;
		
	КонецЕсли;	
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Торг12_УПД_820(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("ТОРГ12"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_ТОРГ12");
	
	ПФ_Торг12_УПД_820_ШапкаДокумента(Таб, Параметры);
	ПФ_Торг12_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_820_СтрокиТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_820_ПодвалТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_820_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_Торг12_УПД_820_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Seller		 = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer		 = ПервыйЭлементКоллекции(Content.Buyers);
	Consignee	 = ПервыйЭлементКоллекции(Content.Consignees);
	Shipper		 = ПервыйЭлементКоллекции(Content.Shippers);
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("Колонтитул"));
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка1");
	
	Если ЗначениеЗаполнено(Shipper) 
		И Shipper.SameAsSeller = Ложь 
		И ЗначениеЗаполнено(Shipper.OrganizationInfo.Name) Тогда
		
		Грузоотправитель = Shipper.OrganizationInfo;
	Иначе
		Грузоотправитель = Seller;
	КонецЕсли;
	
	Область.Параметры.Грузоотправитель		 = СтрокаДанныеКонтрагента_820(Грузоотправитель);
	Область.Параметры.Подразделение 		 = Грузоотправитель.Department;
	Область.Параметры.ГрузоотправительПоОКПО = Грузоотправитель.Okpo;
	Область.Параметры.ВидДеятельностиПоОКДП	 = Грузоотправитель.Okdp;
	
	Если ЗначениеЗаполнено(Consignee) Тогда
		Область.Параметры.Грузополучатель		 = СтрокаДанныеКонтрагента_820(Consignee);
		Область.Параметры.ГрузополучательПоОКПО	 = Consignee.Okpo;
	КонецЕсли;
	
	Область.Параметры.Продавец		 = СтрокаДанныеКонтрагента_820(Seller);
	Область.Параметры.ПродавецПоОКПО = Seller.Okpo;
	
	Область.Параметры.Покупатель	   = СтрокаДанныеКонтрагента_820(Buyer);
	Область.Параметры.ПокупательПоОКПО = Buyer.Okpo;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferBases) Тогда
		TransferBase = Content.TransferInfo.TransferBases[0]; 
		Область.Параметры.Основание		 = СтрокаДокументыОснованияУПД(Content.TransferInfo.TransferBases);
		Область.Параметры.ОснованиеДата	 = ДатаСтрокой(TransferBase.DocumentDate);
		Область.Параметры.ОснованиеНомер = TransferBase.DocumentNumber;
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
	Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Content.DocumentDate);
	
	Таб.Вывести(Область);
	
	// Номер и дата документа, номер и дата транспортной накладной
	Область = Параметры.Макет.ПолучитьОбласть("Шапка2");
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата	= ДатаСтрокой(Content.DocumentDate);
	
	Область.Параметры.ВидОперации = Content.TransferInfo.OperationType;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.Waybills) Тогда
		Waybill = Content.TransferInfo.Waybills[0];
		Область.Параметры.ТранспортнаяНакладнаяНомер = Waybill.DocumentNumber;
		Область.Параметры.ТранспортнаяНакладнаяДата	 = ДатаСтрокой(Waybill.DocumentDate);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_820_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для Каждого Item Из Параметры.Content.Table.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_Торг12(Item);
		
		Область.Параметры.Код				  = СтрокаИлиДефис(Item.ItemVendorCode);
		Область.Параметры.ЕдиницаИзмерения	  = СтрокаЕдиницаИзмерения(Item.Unit, Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаИлиДефис(Item.Unit);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = Число_В_Формат(Item.SubtotalWithVatExcluded, "ЧДЦ=2; ЧН=", СтрокаДефис());
		
		Область.Параметры.СуммаВсего  = СтрокаСуммаВсего_820(Item.SubTotal, Item.HyphenSubtotal);
		Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС_820(Item.Vat, Item.WithoutVat, Item.HyphenVat, Item.TaxRate);
		Область.Параметры.СтавкаНДС	  = СтрокаСтавкаНДС(Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_820_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	Table	= Параметры.Content.Table;
	
	Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Table.TotalNet, Параметры.ФорматКоличества);
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Table.TotalWithVatExcluded);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Table.Items) Тогда
		Область.Параметры.СуммаВсего = ПодвалСуммаВсего_820(Table.Total, Table.HyphenTotal);
		Область.Параметры.СуммаНДС	 = СтрокаДефис();
	Иначе
		Область.Параметры.СуммаВсего = ПодвалСуммаВсего_820(Table.Total, Table.HyphenTotal);
		Область.Параметры.СуммаНДС	 = ПодвалСуммаНДС_820(Table.Vat, Table.WithoutVat, Table.HyphenVat);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_820_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	Table	= Content.Table;
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалУПД");
	
	КоличествоСтрок = Table.Items.Количество();
	Область.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = КоличествоЗаписейПрописью(КоличествоСтрок);
	
	Если ЭтоИстина(Table.HyphenTotal) Тогда
		Область.Параметры.СуммаПрописью = СтрокаДефис();
	Иначе
		Сумма = ?(ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Table.Items), Table.TotalWithVatExcluded, Table.Total);
		Область.Параметры.СуммаПрописью = СуммаПрописью(Сумма, Content.Currency);
	КонецЕсли;
	
	Область.Параметры.МассаНетто = КоличествоСтрокой(Table.TotalNet, Параметры.ФорматКоличества);
	
	Подписи = СтрокиПодписей(Content.Signers);
	Область.Параметры.ПродавецПодписант	= Подписи.ФИО;
	Область.Параметры.ПродавецДолжность = Подписи.Должность;
	
	Работник = РаботникИлиИноеЛицо(Content.TransferInfo);
	Если Работник <> Неопределено Тогда
		Область.Параметры.ПродавецРаботник			= СтрокаФИО(Работник);
		Область.Параметры.ПродавецРаботникДолжность = Работник.EmployeePosition;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
		Область.Параметры.ДатаОтпуска = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	Иначе
		Область.Параметры.ДатаОтпуска = Формат(Content.DocumentDate, "ДФ='dd MMMM yyyy ""года""'");
	КонецЕсли;	
	
	// Титул покупателя
	Если Параметры.Свойство("BuyerContent")
		И Параметры.BuyerContent <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Параметры.BuyerContent.AcceptanceDate) Тогда
			ДатаПолучения = Параметры.BuyerContent.AcceptanceDate;
		ИначеЕсли ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
			ДатаПолучения = Content.TransferInfo.TransferDate;
		Иначе
			ДатаПолучения = Content.DocumentDate;
		КонецЕсли;
		
		Область.Параметры.ДатаПолучения			= Формат(ДатаПолучения, "ДФ='dd MMMM yyyy ""года""'");
		Область.Параметры.СодержаниеОперации	= СтрокаСодержаниеОперации(Параметры.BuyerContent);
		
		Работник = РаботникИлиИноеЛицо(Параметры.BuyerContent);
		Если Работник <> Неопределено Тогда
			Область.Параметры.ГрузПринялФИО		  = СтрокаФИО(Работник);
			Область.Параметры.ГрузПринялДолжность = Работник.EmployeePosition;
		КонецЕсли;
		
		Подписи = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ГрузПолучилФИО	   = Подписи.ФИО;
		Область.Параметры.ГрузПолучилДолжность = Подписи.Должность;
		
	КонецЕсли;	
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Торг12_УПД_970(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("ТОРГ12"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_ТОРГ12");
	
	ПФ_Торг12_УПД_970_ШапкаДокумента(Таб, Параметры);
	ПФ_Торг12_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_970_СтрокиТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_970_ПодвалТаблицы(Таб, Параметры);
	ПФ_Торг12_УПД_970_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_Торг12_УПД_970_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Seller = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer = ПервыйЭлементКоллекции(Content.Buyers);
	Consignee = ПервыйЭлементКоллекции(Content.Consignees);
	Shipper	= ПервыйЭлементКоллекции(Content.Shippers);
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("Колонтитул"));
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка1");
	
	Грузоотправитель = Seller;
	Если ЗначениеЗаполнено(Shipper) Тогда
		
		ОнЖе = (Shipper.SameAsSeller = Истина);
		Если Не ОнЖе И ЗначениеЗаполнено(Shipper.OrganizationInfo.Name) Тогда
			Грузоотправитель = Shipper.OrganizationInfo;
		КонецЕсли;
		
	КонецЕсли;
	
	Область.Параметры.Грузоотправитель = СтрокаПредставлениеКонтрагента_970(Грузоотправитель);
	Область.Параметры.Подразделение = Грузоотправитель.Department;
	Область.Параметры.ГрузоотправительПоОКПО = Грузоотправитель.Okpo;
	
	Если ЗначениеЗаполнено(Consignee) Тогда
		Область.Параметры.Грузополучатель = СтрокаПредставлениеКонтрагента_970(Consignee);
		Область.Параметры.ГрузополучательПоОКПО = Consignee.Okpo;
	КонецЕсли;
	
	Область.Параметры.Продавец = СтрокаПредставлениеКонтрагента_970(Seller);
	Область.Параметры.ПродавецПоОКПО = Seller.Okpo;
	
	Область.Параметры.Покупатель = СтрокаПредставлениеКонтрагента_970(Buyer);
	Область.Параметры.ПокупательПоОКПО = Buyer.Okpo;
	
	Если Content.TransferInfo.WithoutTransferBase = Истина Тогда
		Область.Параметры.Основание = СтрокаБезДокументаОснования();
	Иначе
		TransferBase = Content.TransferInfo.TransferBases[0]; 
		Область.Параметры.Основание = СтрокаДокументыОснованияУПД970(Content.TransferInfo.TransferBases);
		Область.Параметры.ОснованиеДата = ДатаСтрокой(TransferBase.Date);
		Область.Параметры.ОснованиеНомер = TransferBase.Number;
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
	Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
	Область.Параметры.ИдентификаторГосконтракта	= Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта = НадписьИдентификаторГосконтракта(Content.DocumentDate);
	
	Таб.Вывести(Область);
	
	// Номер и дата документа, номер и дата транспортной накладной
	Область = Параметры.Макет.ПолучитьОбласть("Шапка2");
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата = ДатаСтрокой(Content.DocumentDate);
	
	Область.Параметры.ВидОперации = Content.TransferInfo.OperationType;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_970_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для Каждого Item Из Параметры.Content.Table.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_Торг12(Item);
		
		Область.Параметры.Код = СтрокаИлиДефис(Item.ItemVendorCode);
		Область.Параметры.ЕдиницаИзмерения = СтрокаЕдиницаИзмерения_970(Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаИлиДефис(Item.Unit);
		
		Область.Параметры.Количество = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = Число_В_Формат(Item.SubtotalWithVatExcluded, "ЧДЦ=2; ЧН=", СтрокаДефис());
		
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Item.SubTotal);
		Область.Параметры.СуммаНДС = СтрокаСуммаНДС_970(Item.Vat, Item.WithoutVat, Item.TaxRate);
		Область.Параметры.СтавкаНДС = СтрокаСтавкаНДС(Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_970_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	Table = Параметры.Content.Table;
	
	Область.Параметры.Количество = КоличествоСтрокойИлиДефис(Table.TotalNet, Параметры.ФорматКоличества);
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Table.TotalWithVatExcluded);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Table.Items) Тогда
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Table.Total);
		Область.Параметры.СуммаНДС = СтрокаДефис();
	Иначе
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Table.Total);
		Область.Параметры.СуммаНДС = ПодвалСуммаНДС_970(Table.Vat, Table.WithoutVat);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_УПД_970_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	Table = Content.Table;
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалУПД");
	
	КоличествоСтрок = Table.Items.Количество();
	Область.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = КоличествоЗаписейПрописью(КоличествоСтрок);
	
	Если ЗначениеЗаполнено(Table.Total) Тогда
		Сумма = ?(ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Table.Items), Table.TotalWithVatExcluded, Table.Total);
		Область.Параметры.СуммаПрописью = СуммаПрописью(Сумма, Content.Currency);
	Иначе
		Область.Параметры.СуммаПрописью = СтрокаДефис();	
	КонецЕсли;
	
	Область.Параметры.МассаНетто = КоличествоСтрокой(Table.TotalNet, Параметры.ФорматКоличества);
	
	ПодписиПродавца = СтрокиПодписей_970(Content.Signers);
	
	Область.Параметры.ПродавецПодписант	= ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецДолжность = ПодписиПродавца.Должность;
	
	TransferInfo = Content.TransferInfo;
	
	Работник = РаботникИлиИноеЛицо(TransferInfo);
	Если Работник <> Неопределено Тогда
		Область.Параметры.ПродавецРаботник = СтрокаФИО(Работник);
		Область.Параметры.ПродавецРаботникДолжность = Работник.EmployeePosition;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(TransferInfo.TransferDate) Тогда
		ДатаОтпуска = TransferInfo.TransferDate;
	Иначе
		ДатаОтпуска = Content.DocumentDate;
	КонецЕсли;
	Область.Параметры.ДатаОтпуска = Формат(ДатаОтпуска, "ДФ='dd MMMM yyyy ""года""'");
	
	// Титул покупателя
	Если Параметры.Свойство("BuyerContent")
		И Параметры.BuyerContent <> Неопределено Тогда
		
		BuyerContent = Параметры.BuyerContent;
		
		Если ЗначениеЗаполнено(BuyerContent.AcceptanceDate) Тогда
			ДатаПолучения = BuyerContent.AcceptanceDate;
		ИначеЕсли ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
			ДатаПолучения = Content.TransferInfo.TransferDate;
		Иначе
			ДатаПолучения = Content.DocumentDate;
		КонецЕсли;
		
		Область.Параметры.ДатаПолучения	= Формат(ДатаПолучения, "ДФ='dd MMMM yyyy ""года""'");
		Область.Параметры.СодержаниеОперации = СтрокаСодержаниеОперации_970(BuyerContent);
		
		Работник = РаботникИлиИноеЛицо(BuyerContent);
		Если Работник <> Неопределено Тогда
			Область.Параметры.ГрузПринялФИО = СтрокаФИО(Работник);
			Область.Параметры.ГрузПринялДолжность = Работник.EmployeePosition;
		КонецЕсли;
		
		ПодписиBuyer = СтрокиПодписей_970(BuyerContent.Signers);
		Область.Параметры.ГрузПолучилФИО = ПодписиBuyer.ФИО;
		Область.Параметры.ГрузПолучилДолжность = ПодписиBuyer.Должность;
		
	КонецЕсли;	
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Торг12_551(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("ТОРГ12"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_ТОРГ12");
	
	ПФ_Торг12_551_ШапкаДокумента(Таб, Параметры);
	ПФ_Торг12_551_ШапкаТаблицы(Таб, Параметры);
	ПФ_Торг12_551_СтрокиТаблицы(Таб, Параметры);
	ПФ_Торг12_551_ПодвалТаблицы(Таб, Параметры);
	ПФ_Торг12_551_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_Торг12_551_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("Колонтитул"));
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка1");
	
	Область.Параметры.Грузоотправитель		 = СтрокаДанныеКонтрагента(Content.Shipper);
	Область.Параметры.Подразделение 		 = Content.Shipper.Department;
	Область.Параметры.ГрузоотправительПоОКПО = Content.Shipper.Okpo;
	Область.Параметры.ВидДеятельностиПоОКДП	 = Content.Shipper.Okdp;
	
	Область.Параметры.Грузополучатель		= СтрокаДанныеКонтрагента(Content.Consignee);
	Область.Параметры.ГрузополучательПоОКПО = Content.Consignee.Okpo;
	
	Область.Параметры.Продавец		 = СтрокаДанныеКонтрагента(Content.Seller);
	Область.Параметры.ПродавецПоОКПО = Content.Seller.Okpo;
	
	Область.Параметры.Покупатель	   = СтрокаДанныеКонтрагента(Content.Buyer);
	Область.Параметры.ПокупательПоОКПО = Content.Buyer.Okpo;
	
	Если ЗначениеЗаполнено(Content.Grounds) Тогда
		Ground = Content.Grounds[0];
		Область.Параметры.Основание		 = СтрокаОснованиеНакладной(Ground.Name, Ground.Number, Ground.Date, Ground.Info);
		Область.Параметры.ОснованиеНомер = Ground.Number;
		Область.Параметры.ОснованиеДата  = ДатаСтрокой(Ground.Date);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
	Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Content.DocumentDate);
	
	Таб.Вывести(Область);
	
	// Номер и дата документа, номер и дата транспортной накладной, вид операции
	Область = Параметры.Макет.ПолучитьОбласть("Шапка2");
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата	= ДатаСтрокой(Content.DocumentDate);
	Область.Параметры.ВидОперации = Content.OperationType;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.Waybills) Тогда
		Waybill = Content.TransferInfo.Waybills[0];
		Область.Параметры.ТранспортнаяНакладнаяНомер = Waybill.DocumentNumber;
		Область.Параметры.ТранспортнаяНакладнаяДата	 = ДатаСтрокой(Waybill.DocumentDate);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаИсправление");
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_551_ШапкаТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Область.Параметры.Валюта = ПредставлениеВалютыТорг12(Параметры.Content.Currency);
	
	Таб.Вывести(Область);	
	
КонецПроцедуры

Процедура ПФ_Торг12_551_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для Каждого Item Из Параметры.Content.Table.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = СтрокаНаименованиеСтрокиНакладной(Item);
		Область.Параметры.Код		   = СтрокаИлиДефис(Item.ProductCode);
		
		Область.Параметры.ЕдиницаИзмерения	  = СтрокаЕдиницаИзмерения(Item.Unit, Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаИлиДефис(Item.Unit);
		Область.Параметры.ВидУпаковки		  = Item.PackageType;
		
		Область.Параметры.КоличествоВОдномМесте = Число_В_Формат(Item.QuantityInPack);
		Область.Параметры.КоличествоМест 		= Число_В_Формат(Item.Quantity);
		Область.Параметры.Масса					= КоличествоСтрокой(Item.Gross);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Net, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		
		Область.Параметры.СуммаБезНДС = Число_В_Формат(Item.SubtotalWithVatExcluded, "ЧДЦ=2; ЧН=", СтрокаДефис());
		Область.Параметры.СуммаВсего  = СтрокаСуммаВсего(Item.SubTotal, Item.TaxRate, "ЧДЦ=2; ЧН=");
		Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС(Item.Vat, Item.TaxRate);
		Область.Параметры.СтавкаНДС	  = СтрокаСтавкаНДС(Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_Торг12_551_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.КоличествоМест = Число_В_Формат(Параметры.Content.Table.TotalQuantity);
	Область.Параметры.Масса			 = КоличествоСтрокой(Параметры.Content.Table.TotalGross);
	Область.Параметры.Количество	 = КоличествоСтрокой(Параметры.Content.Table.TotalNet, Параметры.ФорматКоличества);
	
	Область.Параметры.СуммаБезНДС	 = Число_В_Формат(Параметры.Content.Table.TotalWithVatExcluded, "ЧДЦ=2; ЧН=");
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Параметры.Content.Table.Items) Тогда
		Область.Параметры.СуммаВсего = СтрокаДефис();
		Область.Параметры.СуммаНДС	 = СтрокаДефис();
	Иначе
		Область.Параметры.СуммаВсего = Число_В_Формат(Параметры.Content.Table.Total			   	  , "ЧДЦ=2; ЧН=");
		Область.Параметры.СуммаНДС	 = ПодвалСуммаНДС(Параметры.Content.Table.TotalVat);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Торг12_551_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалУПД");
	
	Область.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = КоличествоЗаписейПрописью(Content.Table.Items.Количество());
	
	Сумма = ?(ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Content.Table.Items), Content.Table.TotalWithVatExcluded, Content.Table.Total);
	Область.Параметры.СуммаПрописью = СуммаПрописью(Сумма, Content.Currency);
	
	Область.Параметры.МассаНетто = Content.Table.TotalNet;
	Область.Параметры.МассаГруза = Content.Table.TotalGross;
	
	Область.Параметры.КоличествоПриложений = Content.TransferInfo.Attachment;
	
	Подписи = СтрокиПодписей(Content.Signers);
	Область.Параметры.ПродавецПодписант = Подписи.ФИО;
	Область.Параметры.ПродавецДолжность = Подписи.Должность;
	
	Работник = РаботникИлиИноеЛицо(Content.TransferInfo);
	Если Работник <> Неопределено Тогда
		Область.Параметры.ПродавецРаботник			= СтрокаФИО(Работник);
		Область.Параметры.ПродавецРаботникДолжность = Работник.EmployeePosition;
	КонецЕсли;
	
	Область.Параметры.ДатаОтпуска = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) И ЗначениеЗаполнено(Параметры.BuyerContent.OperationContent) Тогда
		
		Подписи = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ГрузПринялФИО		  = Подписи.ФИО;
		Область.Параметры.ГрузПринялДолжность = Подписи.Должность;
		
		Работник = РаботникИлиИноеЛицо(Параметры.BuyerContent);
		Если Работник <> Неопределено Тогда
			Область.Параметры.ГрузПолучилФИО	   = СтрокаФИО(Работник);
			Область.Параметры.ГрузПолучилДолжность = Работник.EmployeePosition;
		КонецЕсли;
		
		Область.Параметры.СодержаниеОперации = Параметры.BuyerContent.OperationContent;
		Область.Параметры.ДатаПолучения = Формат(Параметры.BuyerContent.AcceptanceDate, "ДФ='dd MMMM yyyy ""года""'");
		
	КонецЕсли;	
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_СФ(Параметры)
	
	Параметры.Вставить("Макет"		 , ПолучитьМакет("СФ1137"));
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.Date, Параметры.Content.InvoiceRevisionDate));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_СФ1137_" + Параметры.ДатаРедакции);
	
	ПФ_СФ_ШапкаДокумента(Таб, Параметры);
	ПФ_СФ_ШапкаТаблицы(Таб, Параметры);
	ПФ_СФ_СтрокиТаблицы(Таб, Параметры);
	ПФ_СФ_ПодвалТаблицы(Таб, Параметры);
	ПФ_СФ_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции	 

Процедура ПФ_СФ_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата  = ДатаСтрокой(Content.Date);
	
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.InvoiceRevisiondate);
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.InvoiceRevisionNumber);
	
	Область.Параметры.Продавец		= Content.Seller.Name;
	Область.Параметры.ПродавецАдрес	= СтрокаИлиДефис(СтрокаАдрес(Content.Seller.Address));
	Область.Параметры.ПродавецИНН	= СтрокаИННКПП(Content.Seller);
	
	Область.Параметры.Грузоотправитель = ?(Content.Shipper.SameAsSellerOrBuyer = Истина, "он же", СтрокаНаименованиеАдрес(Content.Shipper));
	Область.Параметры.Грузополучатель  = СтрокаНаименованиеАдрес(Content.Consignee);
	
	Область.Параметры.Покупатель	  = Content.Buyer.Name;
	Область.Параметры.ПокупательАдрес = СтрокаИлиДефис(СтрокаАдрес(Content.Buyer.Address));
	Область.Параметры.ПокупательИНН	  = СтрокаИННКПП(Content.Buyer);
	
	Область.Параметры.Валюта = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.ПлатежноРасчетныеДокументы = СтрокаПРД(Content.PaymentDocuments);
	
	Таб.Вывести(Область);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции625() Тогда
		
		Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосконтракта");
		Область.Параметры.НадписьИдентификаторГосконтракта = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
		
		Таб.Вывести(Область);
		
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_СФ_ШапкаТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Область.Параметры.НадписьНомерТД = ?(Параметры.ДатаРедакции >= ДатаРедакции981(), "Регистрационный номер таможенной декларации", "Номер таможенной декларации");
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_СФ_СтрокиТаблицы(Таб, Параметры)
	
	Для каждого Item Из Параметры.Content.Items Цикл 
		
		СтрокаДопСведений = "";

		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокой(Item.StructedAdditionalInfos);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Если Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаДефис();
		КонецЕсли;
		
		Область.Параметры.Наименование 		  = СтрокаИлиДефис(Item.Product);
		Область.Параметры.ЕдиницаИзмерения    = СтрокаИлиДефис(НаименованиеЕдиницыИзмерения(Item.UnitCode));
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаИлиДефис(Item.UnitCode);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.TotalWithVatExcluded);
		Область.Параметры.СуммаВсего  = СуммаСтрокойИлиДефис(Item.Total);
		Область.Параметры.СтавкаНДС	  = СтрокаСтавкаНДС(Item.TaxRate);
		Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС(Item.Vat, Item.TaxRate);
		Область.Параметры.Акциз		  = СтрокаАкциз(Item.Excise, Item.TaxRate);
		
		Область.Параметры.Страна 	= СтрокаИлиДефис(НаименованиеСтраны(Item.CountriesOfOrigin));
		Область.Параметры.СтранаКод	= СтрокаИлиДефис(Item.CountriesOfOrigin);
		Область.Параметры.НомерТД 	= СтрокаИлиДефис(Item.CustomsDeclarationNumbers);
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_СФ_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Параметры.Content.Totals.TotalWithVatExcluded);
	Область.Параметры.СуммаВсего  = СуммаСтрокойИлиДефис(Параметры.Content.Totals.Total);
	Область.Параметры.СуммаНДС	  = ПодвалСуммаНДС(Параметры.Content.Totals.Vat);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_СФ_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Если Параметры.Content.Signer.IsSoleProprietor = Истина Тогда 
		Область.Параметры.ПодписьФЛ	  = "Электронная подпись";
		Область.Параметры.ПодписантФЛ = СтрокаФИО(Параметры.Content.Signer);
		Область.Параметры.НомерСВ	  =	Параметры.Content.Signer.SoleProprietorRegistrationCertificate;
	Иначе 
		Область.Параметры.ПодписьЮЛ	  = "Электронная подпись";
		Область.параметры.ПодписантЮЛ = СтрокаФИО(Параметры.Content.Signer);
	КонецЕсли;	
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель = "Индивидуальный предприниматель" + ?(Параметры.ДатаРедакции >= ДатаРедакции981(), " или иное уполномоченное лицо", "");
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_СФ_УПД(Параметры)
	
	Параметры.Вставить("Макет"		 , ПолучитьМакет("СФ1137"));
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.Date, Параметры.Content.RevisionDate));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_СФ1137_" + Параметры.ДатаРедакции);
	
	ПФ_СФ_УПД_ШапкаДокумента(Таб, Параметры);
	ПФ_СФ_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_СтрокиТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_ПодвалТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_СФ_УПД_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата	= ДатаСтрокой(Content.Date);
	
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	
	Область.Параметры.Продавец		= Content.Seller.Name;
	Область.Параметры.ПродавецАдрес = СтрокаИлиДефис(СтрокаАдрес(Content.Seller.Address));
	Область.Параметры.ПродавецИНН	= СтрокаИННКПП(Content.Seller);
	
	Область.Параметры.Грузоотправитель = ?(Content.Shipper.SameAsSeller = Истина, "он же", СтрокаНаименованиеАдрес(Content.Shipper.OrganizationInfo));
	Область.Параметры.Грузополучатель  = СтрокаНаименованиеАдрес(Content.Consignee);
	
	Область.Параметры.Покупатель	  = СтрокаИлиДефис(Content.Buyer.Name);
	Область.Параметры.ПокупательАдрес = СтрокаИлиДефис(СтрокаАдрес(Content.Buyer.Address));
	Область.Параметры.ПокупательИНН	  = СтрокаИННКПП(Content.Buyer);
	
	Область.Параметры.Валюта = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.ПлатежноРасчетныеДокументы = СтрокаПРД(Content.PaymentDocuments);
	
	Таб.Вывести(Область);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции625() Тогда
		
		Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосконтракта");
		Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
		Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
		
		Таб.Вывести(Область);
		
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_ШапкаТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	НадписьНомерТД = "";
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		НадписьНомерТД = "Регистрационный номер декларации на товары или регистрационный номер партии товара, подлежащего прослеживаемости";
	ИначеЕсли Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
		НадписьНомерТД = "Регистрационный номер таможенной декларации";
	Иначе
		НадписьНомерТД = "Номер таможенной декларации";
	КонецЕсли;
	
	Область.Параметры.НадписьНомерТД = НадписьНомерТД;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_СтрокиТаблицы(Таб, Параметры)
	
	Для каждого Item Из Параметры.Content.InvoiceTable.Items Цикл 
		
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Если Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаДефис();
		КонецЕсли;
		
		Область.Параметры.Наименование		  = СтрокаИлиДефис(Item.Product);
		Область.Параметры.ЕдиницаИзмерения 	  = СтрокаЕдиницаИзмерения(Item.UnitCode, Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаИлиДефис(Item.UnitCode);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена	      = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		Область.Параметры.СуммаВсего  = СуммаСтрокойИлиДефис(Item.SubTotal);
		Область.Параметры.СтавкаНДС   = СтрокаСтавкаНДС(Item.TaxRate);
		Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС(Item.Vat, Item.TaxRate);
		Область.Параметры.Акциз		  = СтрокаАкциз(Item.Excise, Item.TaxRate);
		
		Строки = СтрокиНомеровТД(Item.CustomDeclarations);
		Область.Параметры.Страна 	= Строки.Страны;
		Область.Параметры.СтранаКод = Строки.КодыСтран;
		Область.Параметры.НомерТД	= Строки.НомераТД;
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceTable.TotalWithVatExcluded);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Параметры.Content.InvoiceTable.Items) Тогда
		Область.Параметры.СуммаВсего = СтрокаДефис();
		Область.Параметры.СуммаНДС	 = СтрокаДефис();
	Иначе
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceTable.Total);
		Область.Параметры.СуммаНДС	 = ПодвалСуммаНДС(Параметры.Content.InvoiceTable.Vat);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	ПодписантыДокумента = СтрокиПодписей_ЮЛ_ФЛ(Параметры.Content.Signers);
	
	Область.Параметры.ПодписьЮЛ	  = ПодписантыДокумента.ЮЛ.Подпись;
	Область.Параметры.ПодписантЮЛ = ПодписантыДокумента.ЮЛ.ФИО;
	
	Область.Параметры.ПодписьФЛ	  = ПодписантыДокумента.ФЛ.Подпись;
	Область.Параметры.ПодписантФЛ = ПодписантыДокумента.ФЛ.ФИО;
	Область.Параметры.НомерСВ	  =	ПодписантыДокумента.ФЛ.НомерСВ;
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель = "Индивидуальный предприниматель" + ?(Параметры.ДатаРедакции >= ДатаРедакции981(), " или иное уполномоченное лицо", "");
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_СФ_УПД_820(Параметры)
	
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.DocumentDate, Параметры.Content.RevisionDate));
	Параметры.Вставить("ЕстьСведенияОПрослеживаемости", ЕстьСведенияОПрослеживаемости820(Параметры.Content));

	Если Параметры.ДатаРедакции = ДатаРедакции1096() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("СФ1137_1096_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("СФ1137_534"));	
		КонецЕсли;
		
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("СФ1137_534_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("СФ1137_534"));	
		КонецЕсли;
		
	Иначе
		Параметры.Вставить("Макет", ПолучитьМакет("СФ1137"));	
		
	КонецЕсли;

	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_СФ1137_" + Параметры.ДатаРедакции);
	
	ПФ_СФ_УПД_820_ШапкаДокумента(Таб, Параметры);
	ПФ_СФ_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_820_СтрокиТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_820_ПодвалТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_СФ_УПД_820_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Seller		 = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer		 = ПервыйЭлементКоллекции(Content.Buyers);
	Consignee	 = ПервыйЭлементКоллекции(Content.Consignees);
	Shipper		 = ПервыйЭлементКоллекции(Content.Shippers);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата	= ДатаСтрокой(Content.DocumentDate);
	
	Область.Параметры.ДатаИсправления  = СтрокаДатаИсправления_820(Content.RevisionDate, Content.HyphenRevisionDate);
	Область.Параметры.НомерИсправления = СтрокаНомерИсправления_820(Content.RevisionNumber, Content.HyphenRevisionNumber);
	
	Если Seller <> Неопределено Тогда
		Область.Параметры.Продавец		= Seller.Name;
		Область.Параметры.ПродавецАдрес = СтрокаИлиДефис(СтрокаАдрес(Seller.Address));
		Область.Параметры.ПродавецИНН	= СтрокаИННКПП_820(Seller);
	КонецЕсли;
	
	Если Shipper <> Неопределено Тогда
		Область.Параметры.Грузоотправитель = ?(Shipper.SameAsSeller = Истина, "он же", СтрокаНаименованиеАдрес(Shipper.OrganizationInfo));
	КонецЕсли;
	
	Если Consignee <> Неопределено Тогда
		Область.Параметры.Грузополучатель  = СтрокаНаименованиеАдрес(Consignee);
	КонецЕсли;
	
	Если Buyer <> Неопределено Тогда
		Область.Параметры.Покупатель	  = СтрокаИлиДефис(Buyer.Name);
		Область.Параметры.ПокупательАдрес = СтрокаИлиДефис(СтрокаАдрес(Buyer.Address));
		Область.Параметры.ПокупательИНН	  = СтрокаИННКПП_820(Buyer);
	КонецЕсли;
	
	Область.Параметры.Валюта = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.ПлатежноРасчетныеДокументы = СтрокаПРД(Content.PaymentDocuments);
	
	Если Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузке(Content.DocumentShipments);
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции1096() Тогда
	    Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузкеВРедакции1096(Content.DocumentShipments);
	КонецЕсли;
	
	Если Область.Области.Найти("АвансовыеДокументы") <> Неопределено Тогда
		Область.УдалитьОбласть(Область.Область("АвансовыеДокументы"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции625() Тогда
		
		Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосконтракта");
		Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
		Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
		
		Таб.Вывести(Область);
		
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_820_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.Table.Items Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) И КоличествоСтрокСПрослеживаемостью <= 1 Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
			Область.Параметры.НомерСтроки = НомерСтроки;
		КонецЕсли;
		
		Если Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаИлиДефис(Item.ItemTypeCode);
		КонецЕсли;
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_СФ_Акт(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		Область.Параметры.ЕдиницаИзмерения	  = СтрокаЕдиницаИзмерения(Item.Unit, Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаКодЕдиницыИзмерения820(Item.Unit, Item.HyphenUnit);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена	      = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		
		Область.Параметры.СуммаВсего  = СтрокаСуммаВсего_820(Item.SubTotal, Item.HyphenSubtotal);
		Область.Параметры.СтавкаНДС   = СтрокаСтавкаНДС(Item.TaxRate);
		Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС_820(Item.Vat, Item.WithoutVat, Item.HyphenVat, Item.TaxRate);
		Область.Параметры.Акциз		  = СтрокаАкциз_820(Item.Excise);
		
		Строки = СтрокиНомеровТД_820(Item.CustomDeclarations);
		Область.Параметры.Страна 	= Строки.Страны;
		Область.Параметры.СтранаКод = Строки.КодыСтран;
		Область.Параметры.НомерТД	= Строки.НомераТД;
		
		Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
			ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УПД(Область, Item, Строки.НомераТД, Параметры);
		КонецЕсли;
		
		Таб.Вывести(Область);
		
		Если Параметры.ДатаРедакции >= ДатаРедакции534() И КоличествоСтрокСПрослеживаемостью > 1 Тогда
			ЗаполнитьПараметрыПрослеживаемостиСтрок_УПД(Таб, Item, СтрокаДопСведений, НомераКолонок_СФ1137_534_Прослеж(Параметры), Параметры);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_820_ПодвалТаблицы(Таб, Параметры)
	
	Область	 = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	Table	 = Параметры.Content.Table;
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Table.TotalWithVatExcluded);
	Область.Параметры.СуммаВсего = ПодвалСуммаВсего_820(Table.Total, Table.HyphenTotal);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Table.Items) Тогда
		
		Область.Параметры.СуммаНДС = СтрокаДефис();
		
	Иначе
		
		Область.Параметры.СуммаНДС	 = ПодвалСуммаНДС_820(Table.Vat, Table.WithoutVat, Table.HyphenVat);
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры


Функция ПФ_СФ_УПД_970(Параметры)
	
	ДатаРедакции = ДатаРедакцииСФ(Параметры.Content.DocumentDate, Параметры.Content.RevisionDate);
	ЕстьСведенияОПрослеживаемости = ЕстьСведенияОПрослеживаемости970(Параметры.Content);
	
	Если ЕстьСведенияОПрослеживаемости И ДатаРедакции = ДатаРедакции1096() Тогда
		Макет = ПолучитьМакет("СФ1137_1096_Прослеж");
	ИначеЕсли ЕстьСведенияОПрослеживаемости Тогда
		Макет = ПолучитьМакет("СФ1137_534_Прослеж");
	Иначе
		Макет = ПолучитьМакет("СФ1137_534");
	КонецЕсли;

	Параметры.Вставить("Макет", Макет);
	Параметры.Вставить("ДатаРедакции", ДатаРедакции);
	Параметры.Вставить("ЕстьСведенияОПрослеживаемости", ЕстьСведенияОПрослеживаемости);

	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Если ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_СФ1137_" + Параметры.ДатаРедакции);
	
	ПФ_СФ_УПД_970_ШапкаДокумента(Таб, Параметры);
	ПФ_СФ_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_970_СтрокиТаблицы(Таб, Параметры);
	ПФ_СФ_УПД_970_ПодвалТаблицы(Таб, Параметры);
	ПФ_СФ_970_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_СФ_УПД_970_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Sellers = Content.Sellers;
	Buyers = Content.Buyers;
	Consignees = Content.Consignees;
	Shippers = Content.Shippers;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата = ДатаСтрокой(Content.DocumentDate);
	
	Область.Параметры.ДатаИсправления = СтрокаДатаИсправления_970(Content.RevisionDate);
	Область.Параметры.НомерИсправления = СтрокаНомерИсправления_970(Content.RevisionNumber);
	
	ПФ_УПД_СФ_970_ШапкаДокумента_Продавцы(Область, Sellers);
	
	ПФ_УПД_СФ_970_ШапкаДокумента_Грузоотправители(Область, Shippers);
	
	ПФ_УПД_970_ШапкаДокумента_Грузополучатели(Область, Consignees);
	
	ПФ_УПД_СФ_970_ШапкаДокумента_Покупатели(Область, Buyers);
	
	Область.Параметры.Валюта = СтрокаПредставлениеВалюты_970(Content.CurrencyName, Content.Currency);
	Область.Параметры.ПлатежноРасчетныеДокументы = СтрокаПРД(Content.PaymentDocuments);
	
	Если Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузке(Content.DocumentShipments);
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции1096() Тогда
	    Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузкеВРедакции1096(Content.DocumentShipments);
	КонецЕсли;
	
	Если Параметры.ДатаРедакции >= ДатаРедакции425() Тогда
		Область.Параметры.НадписьАвансовыеДокументы = НадписьАвансовыеДокументы();
		Область.Параметры.АвансовыеДокументы = СтрокаАвансовыеДокументы(Content.AccompanyingDocuments);
	Иначе
		Область.УдалитьОбласть(Область.Область("АвансовыеДокументы"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосконтракта");
	Область.Параметры.ИдентификаторГосконтракта	= Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_970_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.Table.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаДопСведений) И КоличествоСтрокСПрослеживаемостью <= 1 Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_СФ_Акт(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		Если Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаИлиДефис(Item.ItemTypeCode);
		КонецЕсли;
		
		Область.Параметры.ЕдиницаИзмерения = СтрокаЕдиницаИзмерения_970(Item.UnitName);
		
		Если ЗначениеЗаполнено(Item.Unit) Тогда
			ЕдиницаИзмеренияКод = Item.Unit;
		Иначе
			ЕдиницаИзмеренияКод = СтрокаДефис();
		КонецЕсли;
		Область.Параметры.ЕдиницаИзмеренияКод = ЕдиницаИзмеренияКод;
		
		Область.Параметры.Количество = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Item.SubTotal);
		
		Область.Параметры.СтавкаНДС = СтрокаСтавкаНДС(Item.TaxRate);
		Область.Параметры.СуммаНДС = СтрокаСуммаНДС_970(Item.Vat, Item.WithoutVat, Item.TaxRate);
		Область.Параметры.Акциз = СтрокаАкциз_970(Item.Excise);
		
		Строки = СтрокиНомеровДТ_970(Item.CustomDeclarations);
		Область.Параметры.Страна = Строки.Страны;
		Область.Параметры.СтранаКод = Строки.КодыСтран;
		Область.Параметры.НомерТД = Строки.НомераДТ;
		
		ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УПД(Область, Item, Строки.НомераДТ, Параметры);

		Таб.Вывести(Область);
		
		Если КоличествоСтрокСПрослеживаемостью > 1 Тогда
			ЗаполнитьПараметрыПрослеживаемостиСтрок_УПД(Таб, Item, СтрокаДопСведений, НомераКолонок_СФ1137_534_Прослеж(Параметры), Параметры);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_СФ_УПД_970_ПодвалТаблицы(Таб, Параметры)

	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	ПФ_УПД_СФ_970_ЗаполнитьСуммыИтогоТаблицы(Область, Параметры);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_СФ_970_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Если Параметры.ДатаРедакции >= ДатаРедакции425() Тогда
		ПФ_УПД_СФ_970_ПодписьСоставителя425(Область, Параметры);
	Иначе
		ПФ_СФ_970_ПодписьСоставителя(Область, Параметры);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры

Процедура ПФ_СФ_970_ПодписьСоставителя(Область, Параметры)
	
	Подписанты = Параметры.Content.Signers;
	Если Подписанты.Количество() > 0 Тогда
		
		ПодписиПродавца = СтрокиПодписей_970(Подписанты);
		
		ВидыЮрФизЛиц = Перечисление_ВидыЮрФизЛиц();
		
		Seller = ПервыйЭлементКоллекции(Параметры.Content.Sellers);
		
		Если Seller.Type = ВидыЮрФизЛиц.ЮридическоеЛицо
			Или Seller.Type = ВидыЮрФизЛиц.ИностраннаяОрганизация Тогда
			Область.Параметры.ПодписьЮЛ = ПодписиПродавца.Подпись;
			Область.Параметры.ПодписантЮЛ = ПодписиПродавца.ФИО;
		Иначе
			Область.Параметры.ПодписьФЛ = ПодписиПродавца.Подпись;
			Область.Параметры.ПодписантФЛ = ПодписиПродавца.ФИО;
			Область.Параметры.НомерСВ = Seller.IndividualEntityRegistrationCertificate;
		КонецЕсли;
		
	КонецЕсли;
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель =
		"Индивидуальный предприниматель или иное уполномоченное лицо";
	
КонецПроцедуры

Функция ПФ_КСФ(Параметры)
	
	Параметры.Вставить("Макет"		 , ПолучитьМакет("КСФ1137"));
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.InvoiceCorrectionDate, Параметры.Content.InvoiceCorrectionRevisionDate));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_КСФ1137_" + Параметры.ДатаРедакции);
	
	ПФ_КСФ_ШапкаДокумента(Таб, Параметры);
	ПФ_КСФ_ШапкаТаблицы(Таб, Параметры);
	ПФ_КСФ_СтрокиТаблицы(Таб, Параметры);
	ПФ_КСФ_ПодвалТаблицы(Таб, Параметры);
	ПФ_КСФ_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_КСФ_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	
	Область.Параметры.Номер	= СтрокаИлиДефис(Content.InvoiceCorrectionNumber);
	Область.Параметры.Дата	= ДатаСтрокойИлиДефис(Content.InvoiceCorrectionDate);
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.InvoiceCorrectionRevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.InvoiceCorrectionRevisionDate);
	
	Область.Параметры.Продавец		= Content.Seller.Name;
	Область.Параметры.ПродавецАдрес = СтрокаИлиДефис(СтрокаАдрес(Content.Seller.Address));
	Область.Параметры.ПродавецИНН	= СтрокаИННКПП(Content.Seller);
	
	Область.Параметры.Покупатель 	  = Content.Buyer.Name;
	Область.Параметры.ПокупательАдрес = СтрокаИлиДефис(СтрокаАдрес(Content.Buyer.Address));
	Область.Параметры.ПокупательИНН	  = СтрокаИННКПП(Content.Buyer);
	
	Область.Параметры.Валюта = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.СчетаФактуры = СтрокаСчетаФактурыКСФ(Content.OriginalInvoices);
	
	Таб.Вывести(Область);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции625() Тогда
		
		Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосконтракта");
		Область.Параметры.НадписьИдентификаторГосконтракта = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
		
		Таб.Вывести(Область);
		
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_КСФ_ШапкаТаблицы(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
КонецПроцедуры

Процедура ПФ_КСФ_СтрокиТаблицы(Таб, Параметры)
	
	НомераКолонок = НомераКолонок_КСФ1137();
	НомераКолонокПодстрок = Неопределено;
	НомерКолонкиКодВидаТовара = НомерКолонки_КСФ1137_КодВидаТовара();
	
	Для Каждого Item Из Параметры.Content.Items Цикл 
		
		НомерПервойСтроки = Таб.ВысотаТаблицы + 1;
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаА");
		
		Если Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаДефис();
		КонецЕсли;
		
		Область.Параметры.Наименование = СтрокаИлиДефис(Item.Product);
		
		ПФ_КСФ_СтрокаТаблицыДоПосле(Таб, Область, Item.OriginalValues, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаБ");
		ПФ_КСФ_СтрокаТаблицыДоПосле(Таб, Область, Item.CorrectedValues, Параметры, "После");
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаВ");
		ПФ_КСФ_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаГ");
		ПФ_КСФ_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, "Уменьшение");
		
		ПФ_СтрокаДопСведений_КСФ_УКД(Таб, Item, НомерПервойСтроки, НомераКолонок, НомерКолонкиКодВидаТовара, Параметры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_КСФ_СтрокаТаблицыДоПосле(Таб, Область, InvoiceItemFields, Параметры, Суффикс = "До")
	
	Область.Параметры["ЕдиницаИзмеренияКод" + Суффикс] = СтрокаИлиДефис(InvoiceItemFields.UnitCode);
	Область.Параметры["ЕдиницаИзмерения" + Суффикс] = СтрокаИлиДефис(НаименованиеЕдиницыИзмерения(InvoiceItemFields.UnitCode));
	Область.Параметры["Количество" + Суффикс] = КоличествоСтрокойИлиДефис(InvoiceItemFields.Quantity, Параметры.ФорматКоличества);
	Область.Параметры["Цена" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.Price, Параметры.ФорматСуммы);
	Область.Параметры["СуммаБезНДС" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.TotalWithVatExcluded);
	Область.Параметры["СтавкаНДС" + Суффикс] = СтрокаСтавкаНДС(InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаНДС" + Суффикс] = СтрокаСуммаНДС(InvoiceItemFields.Vat, InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаВсего" + Суффикс] = Число_В_Формат(InvoiceItemFields.Total , ФорматСуммы(), "0");
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_КСФ_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, Суффикс = "Увеличение")
	
	AmountsDiff = ?(Суффикс = "Увеличение", Item.AmountsInc, Item.AmountsDec);
	
	Область.Параметры["СуммаБезНДС" + Суффикс] = СуммаСтрокойИлиДефис(AmountsDiff.TotalWithVatExcluded);
	Область.Параметры["СуммаНДС" + Суффикс] = СтрокаСумма(AmountsDiff.Vat, "ЧДЦ=2; ЧН=", СтрокаДефис());
	Область.Параметры["СуммаВсего" + Суффикс] = Число_В_Формат(AmountsDiff.Total, "ЧДЦ=2; ЧН=", "0");
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_СтрокаДопСведений_КСФ_УКД(Таб, Item, НомерПервойСтроки, НомераКолонок, НомерКолонкиКодВидаТовара, Параметры)
	
	СтрокаДопСведений = "";
	
	Если Параметры.ПоказатьДопСведения Тогда
		СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
		Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Таб.Вывести(Область);
	КонецЕсли;
	
	НомерПоследнейСтроки = Таб.ВысотаТаблицы;
	ОбъединитьЯчейкиКолонокТабличногоДокумента(Таб, НомерПервойСтроки, НомерПоследнейСтроки, НомераКолонок);
	
	Если Параметры.ПоказатьДопСведения И ЗначениеЗаполнено(СтрокаДопСведений) Тогда
		НомерПоследнейСтроки = НомерПоследнейСтроки - 1;
	КонецЕсли;
	
	Если Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
		ОбъединитьЯчейкиКолонокТабличногоДокумента(Таб, НомерПервойСтроки, НомерПоследнейСтроки, НомерКолонкиКодВидаТовара);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_КСФ_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.СуммаБезНДСУвеличение = СуммаСтрокойИлиДефис(Параметры.Content.TotalsInc.TotalWithVatExcluded);
	Область.Параметры.СуммаБезНДСУменьшение = СуммаСтрокойИлиДефис(Параметры.Content.TotalsDec.TotalWithVatExcluded);
	
	Область.Параметры.СуммаНДСУвеличение = СтрокаСумма(Параметры.Content.TotalsInc.Vat, "ЧДЦ=2; ЧН=", СтрокаДефис());
	Область.Параметры.СуммаНДСУменьшение = СтрокаСумма(Параметры.Content.TotalsDec.Vat, "ЧДЦ=2; ЧН=", СтрокаДефис());
	
	Область.Параметры.СуммаВсегоУвеличение = Число_В_Формат(Параметры.Content.TotalsInc.Total, "ЧДЦ=2; ЧН=", "0");
	Область.Параметры.СуммаВсегоУменьшение = Число_В_Формат(Параметры.Content.TotalsDec.Total, "ЧДЦ=2; ЧН=", "0");
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_КСФ_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Если Параметры.Content.Signer.IsSoleProprietor = Истина Тогда 
		Область.Параметры.ПодписьФЛ	  = "Электронная подпись";
		Область.Параметры.ПодписантФЛ = СтрокаФИО(Параметры.Content.Signer);
		Область.Параметры.НомерСВ	  =	Параметры.Content.Signer.SoleProprietorRegistrationCertificate;
	Иначе
		Область.Параметры.ПодписьЮЛ	  = "Электронная подпись";
		Область.параметры.ПодписантЮЛ = СтрокаФИО(Параметры.Content.Signer);
	КонецЕсли;	
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель = "Индивидуальный предприниматель" + ?(Параметры.ДатаРедакции >= ДатаРедакции981(), " или иное уполномоченное лицо", "");
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_КСФ_УКД(Параметры)
	
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.Date, Параметры.Content.RevisionDate));
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		Параметры.Вставить("ИмяМакета", "КСФ1137_534");
	Иначе
		Параметры.Вставить("ИмяМакета", "КСФ1137");
	КонецЕсли;
	
	Параметры.Вставить("Макет", ПолучитьМакет(Параметры.ИмяМакета));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_КСФ1137_" + Параметры.ДатаРедакции);
	
	ПФ_КСФ_УКД_ШапкаДокумента(Таб, Параметры);
	ПФ_КСФ_УКД_ШапкаТаблицы(Таб, Параметры);
	ПФ_КСФ_УКД_СтрокиТаблицы(Таб, Параметры);
	ПФ_КСФ_УКД_ПодвалТаблицы(Таб, Параметры);
	ПФ_КСФ_УКД_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_КСФ_УКД_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата  = ДатаСтрокой(Content.Date);
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокой(Content.RevisionDate);
	
	Область.Параметры.Продавец		= Content.Seller.Name;
	Область.Параметры.ПродавецАдрес = СтрокаАдрес(Content.Seller.Address);
	Область.Параметры.ПродавецИНН	= СтрокаИННКПП(Content.Seller);
	
	Область.Параметры.Покупатель	  = Content.Buyer.Name;
	Область.Параметры.ПокупательАдрес = СтрокаАдрес(Content.Buyer.Address);
	Область.Параметры.ПокупательИНН	  = СтрокаИННКПП(Content.Buyer);
	
	Область.Параметры.Валюта = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.СчетаФактуры = СтрокаСтрокаСчетаФактурыУКД(Content.Invoices);
	
	Таб.Вывести(Область);
	
	Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосконтракта");
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_ШапкаТаблицы(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_СтрокиТаблицы(Таб, Параметры)
	
	Если Параметры.ИмяМакета = "КСФ1137" Тогда
		НомераКолонок = НомераКолонок_КСФ1137();
		НомераКолонокПодстрок = Неопределено;
		НомерКолонкиКодВидаТовара = НомерКолонки_КСФ1137_КодВидаТовара();
	Иначе
		НомераКолонок = НомераКолонок_КСФ1137_534_Прослеж();
		НомераКолонокПодстрок = НомераКолонок_КСФ1137_534_Прослеж(Истина);
		НомерКолонкиКодВидаТовара = НомерКолонки_КСФ1137_534_Прослеж_КодВидаТовара();
	КонецЕсли;
	
	НомерСтроки = 0;
	ДатаДокумента = Параметры.ДатаРедакции;
	
	Для Каждого Item Из Параметры.Content.InvoiceCorrectionTable.Items Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		НомерПервойСтроки = Таб.ВысотаТаблицы + 1;
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаА");
		
		Если ДатаДокумента >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаДефис();
		КонецЕсли;
		
		ПФ_КСФУКД_ЗаполнитьНомерСтрокиТаблицы(
			Область,
			Item,
			ДатаДокумента,
			НомерСтроки
		);
		
		Область.Параметры.Наименование = Item.Product;
		
		ПФ_КСФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаБ");
		ПФ_КСФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры, "После");
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаВ");
		ПФ_УКД_736_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, НомераКолонокПодстрок, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаГ");
		ПФ_УКД_736_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, НомераКолонокПодстрок, Параметры, "Уменьшение");
		
		ПФ_СтрокаДопСведений_КСФ_УКД(Таб, Item, НомерПервойСтроки, НомераКолонок, НомерКолонкиКодВидаТовара, Параметры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.СуммаБезНДСУвеличение = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded);
	Область.Параметры.СуммаБезНДСУменьшение = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded);
	
	ВоВсехСтрокахСтавкаНДСИсчНалАг = ВсеСтрокиУКДСодержатСтавкуНДС_ИсчНалАг(Параметры.Content.InvoiceCorrectionTable.Items);
	
	ЕстьСтавкаНДС = ЕстьСтрокиСПрямымиСтавкамиНДС736(Параметры.Content);
	
	ЭтоУвеличение = Привести_К_Числу(Параметры.Content.InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded) >= Привести_К_Числу(Параметры.Content.InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded);
	
	УвеличениеУменьшение = ВСтрокахУКДЕстьУвеличениеУменьшение(Параметры.Content.InvoiceCorrectionTable.Items);
	
	Область.Параметры.СуммаНДСУвеличение = СтрокаСумНДСУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsInc.Vat, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЕстьСтавкаНДС, Не УвеличениеУменьшение.ЕстьУвеличение);
	Область.Параметры.СуммаНДСУменьшение = СтрокаСумНДСУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsDec.Vat, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЕстьСтавкаНДС, Не УвеличениеУменьшение.ЕстьУменьшение);
	
	Область.Параметры.СуммаВсегоУвеличение = СтрокаВсегоУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsInc.Total, ВоВсехСтрокахСтавкаНДСИсчНалАг, Не ЭтоУвеличение);
	Область.Параметры.СуммаВсегоУменьшение = СтрокаВсегоУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsDec.Total, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЭтоУвеличение);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Подписи = СтрокиПодписей_ЮЛ_ФЛ(Параметры.Content.Signers);
	
	Область.Параметры.ПодписьЮЛ	  = Подписи.ЮЛ.Подпись;
	Область.Параметры.ПодписантЮЛ = Подписи.ЮЛ.ФИО;
	
	Область.Параметры.ПодписьФЛ	  = Подписи.ФЛ.Подпись;
	Область.Параметры.ПодписантФЛ = Подписи.ФЛ.ФИО;
	Область.Параметры.НомерСВ	  =	Подписи.ФЛ.НомерСВ;
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель = "Индивидуальный предприниматель" + ?(Параметры.ДатаРедакции >= ДатаРедакции981(), " или иное уполномоченное лицо", "");
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_КСФ_УКД_736(Параметры)
	
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.Date, Параметры.Content.RevisionDate));
	Параметры.Вставить("ЕстьСведенияОПрослеживаемости", ЕстьСведенияОПрослеживаемости736(Параметры.Content));
	
	Если Параметры.ДатаРедакции = ДатаРедакции1096()
		Или Параметры.ДатаРедакции = ДатаРедакции425() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("ИмяМакета", "КСФ1137_1096_Прослеж");	
		Иначе
			Параметры.Вставить("ИмяМакета", "КСФ1137_534");	
		КонецЕсли;
		
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("ИмяМакета", "КСФ1137_534_Прослеж");	
		Иначе
			Параметры.Вставить("ИмяМакета", "КСФ1137_534");	
		КонецЕсли;
		
	Иначе
		Параметры.Вставить("ИмяМакета", "КСФ1137");	
		
	КонецЕсли;
	
	Параметры.Вставить("Макет", ПолучитьМакет(Параметры.ИмяМакета));

	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_КСФ1137_" + Параметры.ДатаРедакции);
	
	ПФ_КСФ_УКД_736_ШапкаДокумента(Таб, Параметры);
	ПФ_КСФ_УКД_736_ШапкаТаблицы(Таб, Параметры);
	ПФ_КСФ_УКД_736_СтрокиТаблицы(Таб, Параметры);
	ПФ_КСФ_УКД_736_ПодвалТаблицы(Таб, Параметры);
	ПФ_КСФ_УКД_736_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_КСФ_УКД_736_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата  = ДатаСтрокой(Content.Date);
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокой(Content.RevisionDate);
	
	Область.Параметры.Продавец		= Content.Seller.Name;
	Область.Параметры.ПродавецАдрес = СтрокаАдрес_736(Content.Seller.Address);
	Область.Параметры.ПродавецИНН	= СтрокаИННКПП(Content.Seller);
	
	Область.Параметры.Покупатель	  = Content.Buyer.Name;
	Область.Параметры.ПокупательАдрес = СтрокаАдрес_736(Content.Buyer.Address);
	Область.Параметры.ПокупательИНН	  = СтрокаИННКПП(Content.Buyer);
	
	Область.Параметры.Валюта = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.СчетаФактуры = СтрокаСтрокаСчетаФактурыУКД(Content.Invoices);
	
	Таб.Вывести(Область);
	
	Область = Параметры.Макет.ПолучитьОбласть("ИдентификаторГосконтракта");
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_736_ШапкаТаблицы(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_736_СтрокиТаблицы(Таб, Параметры)
	
	Если Параметры.ИмяМакета = "КСФ1137" Тогда
		НомераКолонок = НомераКолонок_КСФ1137();
		НомераКолонокПодстрок = Неопределено;
		НомерКолонкиКодВидаТовара = НомерКолонки_КСФ1137_КодВидаТовара();
	Иначе
		НомераКолонок = НомераКолонок_КСФ1137_534_Прослеж();
		НомераКолонокПодстрок = НомераКолонок_КСФ1137_534_Прослеж(Истина);
		НомерКолонкиКодВидаТовара = НомерКолонки_КСФ1137_534_Прослеж_КодВидаТовара();
	КонецЕсли;
	
	НомерСтроки = 0;
	ДатаДокумента = Параметры.ДатаРедакции;
	
	Для Каждого Item Из Параметры.Content.InvoiceCorrectionTable.Items Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		НомерПервойСтроки = Таб.ВысотаТаблицы + 1;
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаА");
		
		Область.Параметры.КодВТ = СтрокаИлиДефис(Item.ItemTypeCode);
		
		ПФ_КСФУКД_ЗаполнитьНомерСтрокиТаблицы(
			Область,
			Item,
			ДатаДокумента,
			НомерСтроки
		);
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_УПД_УКД(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		ПФ_КСФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаБ");
		ПФ_КСФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры, "После");
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаВ");
		ПФ_УКД_736_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, НомераКолонокПодстрок, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаГ");
		ПФ_УКД_736_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, НомераКолонокПодстрок, Параметры, "Уменьшение");
		
		ПФ_СтрокаДопСведений_КСФ_УКД(Таб, Item, НомерПервойСтроки, НомераКолонок, НомерКолонкиКодВидаТовара, Параметры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры, Суффикс = "До")
	
	InvoiceItemFields = ?(Суффикс = "До", Item.OriginalValues, Item.CorrectedValues);
	КоличествоСтрокСПрослеживаемостью = 0;
	Если ЗначениеЗаполнено(Item.ItemTracingInfos) Тогда
		КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
	КонецЕсли;
	
	Область.Параметры["ЕдиницаИзмеренияКод" + Суффикс] = СтрокаИлиДефис(InvoiceItemFields.UnitCode);
	Область.Параметры["ЕдиницаИзмерения" + Суффикс] = СтрокаИлиДефис(НаименованиеЕдиницыИзмерения(InvoiceItemFields.UnitCode));
	Область.Параметры["Количество" + Суффикс] = КоличествоСтрокойИлиДефис(InvoiceItemFields.Quantity, Параметры.ФорматКоличества);
	Область.Параметры["Цена" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.Price, Параметры.ФорматСуммы);
	Область.Параметры["СуммаБезНДС" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.TotalWithVatExcluded);
	Если Параметры.ИмяМакета <> "КСФ1137" Тогда
		Область.Параметры["Акциз" + Суффикс] = СтрокаАкциз(InvoiceItemFields.Excise, InvoiceItemFields.TaxRate);
	КонецЕсли;
	Область.Параметры["СтавкаНДС" + Суффикс] = СтрокаСтавкаНДС(InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаНДС" + Суффикс] = СтрокаСуммаНДС_736(InvoiceItemFields.Vat, InvoiceItemFields.WithoutVat, InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаВсего" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.Total);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		ЗаполнитьПараметрыСтраныПроисхождения_УКД(Область, Item);
		
		Если КоличествоСтрокСПрослеживаемостью > 0 Тогда
			ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УКД(Область, Item, СтрокаДефис(), Параметры);
		КонецЕсли;
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() И КоличествоСтрокСПрослеживаемостью > 1 Тогда
		ИмяОбласти = ?(Суффикс = "До", "СтрокаА", "СтрокаБ");
		ЗаполнитьПараметрыПрослеживаемостиСтрок_УКД(Таб, ИмяОбласти, Item, НомераКолонок_КСФ1137_534_Прослеж(Истина), Параметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_736_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	TotalsInc = Параметры.Content.InvoiceCorrectionTable.TotalsInc;
	TotalsDec = Параметры.Content.InvoiceCorrectionTable.TotalsDec;
	
	Область.Параметры.СуммаБезНДСУвеличение = СуммаСтрокойИлиДефис(TotalsInc.TotalWithVatExcluded);
	Область.Параметры.СуммаБезНДСУменьшение = СуммаСтрокойИлиДефис(TotalsDec.TotalWithVatExcluded);
	
	ВоВсехСтрокахСтавкаНДСИсчНалАг = ВсеСтрокиУКДСодержатСтавкуНДС_ИсчНалАг(Параметры.Content.InvoiceCorrectionTable.Items);
	
	ЕстьСтавкаНДС = ЕстьСтрокиСПрямымиСтавкамиНДС736(Параметры.Content);
	
	ЭтоУвеличение = Привести_К_Числу(TotalsInc.TotalWithVatExcluded) >= Привести_К_Числу(TotalsDec.TotalWithVatExcluded);
	
	УвеличениеУменьшение = ВСтрокахУКДЕстьУвеличениеУменьшение(Параметры.Content.InvoiceCorrectionTable.Items);
	
	Область.Параметры.СуммаНДСУвеличение = СтрокаСумНДСУвелУм(TotalsInc.Vat, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЕстьСтавкаНДС И Не ЭтоИстина(TotalsInc.WithoutVat), Не УвеличениеУменьшение.ЕстьУвеличение);
	Область.Параметры.СуммаНДСУменьшение = СтрокаСумНДСУвелУм(TotalsDec.Vat, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЕстьСтавкаНДС И Не ЭтоИстина(TotalsDec.WithoutVat), Не УвеличениеУменьшение.ЕстьУменьшение);
	
	Область.Параметры.СуммаВсегоУвеличение = СтрокаВсегоУвелУм(TotalsInc.Total, ВоВсехСтрокахСтавкаНДСИсчНалАг, Не ЭтоУвеличение);
	Область.Параметры.СуммаВсегоУменьшение = СтрокаВсегоУвелУм(TotalsDec.Total, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЭтоУвеличение);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_736_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Если Параметры.ДатаРедакции >= ДатаРедакции425() Тогда
		
		ПФ_КСФ_УКД_736_ПодписьСоставителя425(Область, Параметры);
		
	Иначе
		
		ПФ_КСФ_УКД_736_ПодписьСоставителя(Область, Параметры);
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_736_ПодписьСоставителя425(Область, Параметры)
	
	Подписи = СтрокиПодписей_ЮЛ_ФЛ(Параметры.Content.Signers);
	ВидыЮрФизЛиц = Перечисление_ВидыЮрФизЛиц();
	Seller = Параметры.Content.Seller;
	
	Если Seller.Type = ВидыЮрФизЛиц.ЮридическоеЛицо
		Или Seller.Type = ВидыЮрФизЛиц.ИностраннаяОрганизация Тогда
		
		Область.Параметры.ПодписьЮЛ = Подписи.ЮЛ.Подпись;
		Область.Параметры.ПодписантЮЛ = Подписи.ЮЛ.ФИО;
		
	Иначе
		
		Область.Параметры.ПодписьФЛ = Подписи.ФЛ.Подпись;
		Область.Параметры.ПодписантФЛ = Подписи.ФЛ.ФИО;
		Область.Параметры.НомерСВ = СтрокаНомерСВ425(Seller.IndividualEntityRegistrationCertificate);
		
	КонецЕсли;
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель =
		"Индивидуальный предприниматель или иное уполномоченное лицо";
	
КонецПроцедуры

Процедура ПФ_КСФ_УКД_736_ПодписьСоставителя(Область, Параметры)
	
	Подписи = СтрокиПодписей_ЮЛ_ФЛ(Параметры.Content.Signers);
	
	Область.Параметры.ПодписьЮЛ = Подписи.ЮЛ.Подпись;
	Область.Параметры.ПодписантЮЛ = Подписи.ЮЛ.ФИО;
	
	Область.Параметры.ПодписьФЛ = Подписи.ФЛ.Подпись;
	Область.Параметры.ПодписантФЛ = Подписи.ФЛ.ФИО;
	Область.Параметры.НомерСВ = Подписи.ФЛ.НомерСВ;
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель =
		"Индивидуальный предприниматель"
		+ ?(Параметры.ДатаРедакции >= ДатаРедакции981(), " или иное уполномоченное лицо", "");
	
КонецПроцедуры

Функция ПФ_Акт(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("Акт"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfo);
	
	Таб = НовыйТабличныйДокумент("DD_Акт", ОриентацияСтраницы.Портрет);
	
	ПФ_Акт_ШапкаДокумента(Таб, Параметры);
	ПФ_Акт_Таблица(Таб, Параметры);
	ПФ_Акт_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб; 
	
КонецФункции

Процедура ПФ_Акт_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата	= Формат(Content.Date, "ДФ=dd.MM.yy");
	Область.Параметры.Заголовок = Content.Title;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_Акт_Таблица(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
	СуммаБезНДС = 0;
	СуммаНДС	= 0;
	СуммаВсего  = 0;
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.Items Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Параметры.ПоказатьДопСведения И ЗначениеЗаполнено(Item.AdditionalInfo) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", Item.AdditionalInfo);
		Иначе 
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;	
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = ?(ЗначениеЗаполнено(Item.Name), Item.Name, Item.Description);
		Область.Параметры.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(Item.UnitName), Item.UnitName, СтрокаДефис());
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.TotalWithVatExcluded);
		Область.Параметры.СуммаНДС	  = СуммаСтрокойИлиДефис(Item.Vat);
		Область.Параметры.СуммаВсего  = СуммаСтрокойИлиДефис(Item.Total);
		
		Таб.Вывести(Область);
		
		СуммаБезНДС = СуммаБезНДС + ?(ЗначениеЗаполнено(Item.TotalWithVatExcluded), Item.TotalWithVatExcluded, 0);
		СуммаНДС	= СуммаНДС 	  + ?(ЗначениеЗаполнено(Item.Vat), Item.Vat, 0);
		СуммаВсего	= СуммаВсего  + ?(ЗначениеЗаполнено(Item.Total), Item.Total, 0);
		
	КонецЦикла;	
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	Область.Параметры.СуммаБезНДС	 = СуммаСтрокой(СуммаБезНДС);
	Область.Параметры.СуммаНДС		 = СуммаСтрокой(СуммаНДС);
	Область.Параметры.СуммаВсего	 = СуммаСтрокой(СуммаВсего);
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Акт_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.Продавец	  	= Content.Seller.Name;
	Область.Параметры.ПродавецИНН 	= Content.Seller.Inn;
	Область.Параметры.ПродавецКПП 	= Content.Seller.Kpp;
	Область.Параметры.ПродавецАдрес = СтрокаАдресТелефонФакс(Content.Seller);
	Область.Параметры.ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Seller);
	
	Область.Параметры.ПродавецПодписант		 = СтрокаФИО(Content.Official);
	Область.Параметры.ПродавецДолжность		 = Content.Official.JobTitle;
	Область.Параметры.ПродавецДоверенность 	 = СтрокаДоверенность(Content.Attorney);
	Область.Параметры.ПродавецДатаПодписания = Формат(Content.SignatureDate, "ДФ='""Дата подписания: ""dd.MM.yy'");
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) Тогда
		
		Область.Параметры.ПокупательПодписант	   = СтрокаФИО(Параметры.BuyerContent.Signer);
		Область.Параметры.ПокупательДолжность	   = Параметры.BuyerContent.Signer.JobTitle;
		Область.Параметры.ПокупательДоверенность   = СтрокаДоверенность(Параметры.BuyerContent.Attorney);
		Область.Параметры.ПокупательДатаПодписания = Формат(Параметры.BuyerContent.SignatureDate, "ДФ='""Дата приема: ""dd.MM.yy'");
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Акт_УПД(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("АктУПД"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_АктУПД", ОриентацияСтраницы.Портрет);
	
	ПФ_Акт_УПД_ШапкаДокумента(Таб, Параметры);
	ПФ_Акт_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_СтрокиТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_ПодвалТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб; 
	
КонецФункции

Процедура ПФ_Акт_УПД_ШапкаДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата  = ДатаСтрокой(Content.Date);
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	
	Таб.Вывести(Область);
	
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаЗаголовок");
	
	Исполнитель = Content.Seller.Name;
	Заказчик = Content.Buyer.Name;
	
	Область.Параметры.Заголовок = Исполнитель + " выполнил, " + Заказчик + " принял следующие работы (услуги)";
	
	Таб.Вывести(Область);
	
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferBases) Тогда
		Область = Параметры.Макет.ПолучитьОбласть("ШапкаОснования");
		Область.Параметры.Основания = СтрокаДокументыОснованияУПД(Content.TransferInfo.TransferBases);
		Таб.Вывести(Область);
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_ШапкаТаблицы(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.InvoiceTable.Items Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки  = НомерСтроки;
		
		Область.Параметры.Наименование	   = Item.Product;
		Область.Параметры.ЕдиницаИзмерения = СтрокаЕдиницаИзмерения(Item.UnitCode, Item.UnitName);
		
		Область.Параметры.Количество   = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		   = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС  = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		Область.Параметры.СуммаВсего   = СуммаСтрокойИлиДефис(Item.Subtotal);
		Область.Параметры.СуммаНДС	   = СтрокаСуммаНДС(Item.Vat, Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокой(Параметры.Content.InvoiceTable.TotalWithVatExcluded);
	Область.Параметры.СуммаВсего  = СуммаСтрокой(Параметры.Content.InvoiceTable.Total);
	Область.Параметры.СуммаНДС	  = ПодвалСуммаНДС(Параметры.Content.InvoiceTable.Vat);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.СуммаВсегоПрописью = СуммаПрописью(Content.InvoiceTable.Total, Content.Currency);
	Если ЗначениеЗаполнено(Content.InvoiceTable.Vat) Тогда
		Область.Параметры.СуммаНДСПрописью = СуммаПрописью(Content.InvoiceTable.Vat, Content.Currency);
	КонецЕсли;
	
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Content.Date);
	
	Область.Параметры.Продавец		= Content.Seller.Name;
	Область.Параметры.ПродавецИНН	= Content.Seller.Inn;
	Область.Параметры.ПродавецКПП	= Content.Seller.Kpp;
	Область.Параметры.ПродавецАдрес = СтрокаАдресТелефонЭлПочта(Content.Seller);
	Область.Параметры.ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Seller);
	
	Подписи = СтрокиПодписей(Content.Signers);
	Область.Параметры.ПродавецПодписант	= Подписи.ФИО;
	Область.Параметры.ПродавецДолжность = Подписи.Должность;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда 
		Область.Параметры.ПродавецДатаПодписания = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	Иначе
		Область.Параметры.ПродавецДатаПодписания = Формат(Content.Date, "ДФ='dd MMMM yyyy ""года""'");
	КонецЕсли;
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) И ЗначениеЗаполнено(Параметры.BuyerContent.OperationContent) Тогда 
		
		Область.Параметры.Покупатель 	= Content.Buyer.Name;
		Область.Параметры.ПокупательИНН	= Content.Buyer.Inn;
		Область.Параметры.ПокупательКПП	= Content.Buyer.Kpp;
		
		Область.Параметры.СодержаниеОперации = Параметры.BuyerContent.OperationContent;
		
		Подписи = СтрокиПодписей_Акт_УПД(Параметры.BuyerContent);
		Область.Параметры.ПокупательПодписант = Подписи.ФИО;
		Область.Параметры.ПокупательДолжность = Подписи.Должность;
		
		Если ЗначениеЗаполнено(Параметры.BuyerContent.AcceptanceDate) Тогда 
			Область.Параметры.ПокупательДатаПодписания = Формат(Параметры.BuyerContent.AcceptanceDate, "ДФ='dd MMMM yyyy ""года""'");
		Иначе
			// Согласно формата @155, тег "ДатаПрин" в титуле покупателя не обязателен.
			// Если он не указан, то считается, что покупатель согласен с датой продавца.
			// Тогда берем просто дату из титула продавца.
			Область.Параметры.ПокупательДатаПодписания = Формат(Параметры.Content.Date, "ДФ='dd MMMM yyyy ""года""'");
		КонецЕсли;
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Акт_УПД_820(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("АктУПД"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_АктУПД", ОриентацияСтраницы.Портрет);
	
	ПФ_Акт_УПД_820_ШапкаДокумента(Таб, Параметры);
	ПФ_Акт_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_820_СтрокиТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_820_ПодвалТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_820_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб; 
	
КонецФункции

Процедура ПФ_Акт_УПД_820_ШапкаДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата  = ДатаСтрокой(Content.DocumentDate);
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	
	Таб.Вывести(Область);
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаЗаголовок");
	
	Seller	 = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer	 = ПервыйЭлементКоллекции(Content.Buyers);
	
	Исполнитель	= Seller.Name;
	Заказчик	= Buyer.Name;
	
	Область.Параметры.Заголовок = Исполнитель + " выполнил, " + Заказчик + " принял следующие работы (услуги)";
	
	Таб.Вывести(Область);
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferBases) Тогда
		Область = Параметры.Макет.ПолучитьОбласть("ШапкаОснования");
		Область.Параметры.Основания = СтрокаДокументыОснованияУПД(Content.TransferInfo.TransferBases);
		Таб.Вывести(Область);
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_820_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.Table.Items Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки  = НомерСтроки;
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_СФ_Акт(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		Область.Параметры.ЕдиницаИзмерения = СтрокаЕдиницаИзмерения(Item.Unit, Item.UnitName);
		
		Область.Параметры.Количество   = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		   = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС  = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		Область.Параметры.СуммаВсего   = СтрокаСуммаВсего_820(Item.SubTotal, Item.HyphenSubtotal);
		Область.Параметры.СуммаНДС	   = СтрокаСуммаНДС_820(Item.Vat, Item.WithoutVat, Item.HyphenVat, Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_820_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	Table	= Параметры.Content.Table;
	
	Область.Параметры.СуммаБезНДС	 = СуммаСтрокой(Table.TotalWithVatExcluded);
	Область.Параметры.СуммаВсего	 = ПодвалСуммаВсего_820(Table.Total, Table.HyphenTotal);
	Область.Параметры.СуммаНДС		 = ПодвалСуммаНДС_820(Table.Vat, Table.WithoutVat, Table.HyphenVat);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_820_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Seller	 = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer	 = ПервыйЭлементКоллекции(Content.Buyers);
	
	Область.Параметры.СуммаВсегоПрописью = СуммаВсегоПрописью_820(Content.Table.Total
	, Content.Table.HyphenTotal, Content.Currency);
	
	Область.Параметры.СуммаНДСПрописью = СуммаНДСПрописью_820(Content.Table.Vat
	, Content.Table.HyphenVat, Content.Currency);
	
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Content.DocumentDate);
	
	Область.Параметры.Продавец		= Seller.Name;
	Область.Параметры.ПродавецИНН	= СтрокаИНН_820(Seller.Inn, Seller.HyphenInn);
	Область.Параметры.ПродавецКПП	= Seller.Kpp;
	Область.Параметры.ПродавецАдрес = СтрокаАдресТелефонЭлПочта(Seller);
	Область.Параметры.ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Seller);
	
	Подписи = СтрокиПодписей(Content.Signers);
	Область.Параметры.ПродавецПодписант	= Подписи.ФИО;
	Область.Параметры.ПродавецДолжность = Подписи.Должность;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда 
		Область.Параметры.ПродавецДатаПодписания = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	Иначе
		Область.Параметры.ПродавецДатаПодписания = Формат(Content.DocumentDate, "ДФ='dd MMMM yyyy ""года""'");
	КонецЕсли;
	
	// Титул покупателя
	Если Параметры.Свойство("BuyerContent")
		И Параметры.BuyerContent <> Неопределено Тогда 
		
		Область.Параметры.Покупатель 			= Buyer.Name;
		Область.Параметры.ПокупательИНН			= СтрокаИНН_820(Buyer.Inn, Buyer.HyphenInn);
		Область.Параметры.ПокупательКПП			= Buyer.Kpp;
		Область.Параметры.СодержаниеОперации	= СтрокаСодержаниеОперации(Параметры.BuyerContent);
		
		Подписи = СтрокиПодписей_Акт_УПД(Параметры.BuyerContent);
		Область.Параметры.ПокупательПодписант = Подписи.ФИО;
		Область.Параметры.ПокупательДолжность = Подписи.Должность;
		
		Если ЗначениеЗаполнено(Параметры.BuyerContent.AcceptanceDate) Тогда 
			Область.Параметры.ПокупательДатаПодписания = Формат(Параметры.BuyerContent.AcceptanceDate, "ДФ='dd MMMM yyyy ""года""'");
		Иначе
			Область.Параметры.ПокупательДатаПодписания = Формат(Параметры.Content.DocumentDate, "ДФ='dd MMMM yyyy ""года""'");
		КонецЕсли;
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Акт_УПД_970(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("АктУПД"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_АктУПД", ОриентацияСтраницы.Портрет);
	
	ПФ_Акт_УПД_970_ШапкаДокумента(Таб, Параметры);
	ПФ_Акт_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_970_СтрокиТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_970_ПодвалТаблицы(Таб, Параметры);
	ПФ_Акт_УПД_970_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб; 
	
КонецФункции

Процедура ПФ_Акт_УПД_970_ШапкаДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата = ДатаСтрокой(Content.DocumentDate);
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления = ДатаСтрокойИлиДефис(Content.RevisionDate);
	
	Таб.Вывести(Область);
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаЗаголовок");
	
	Seller = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer = ПервыйЭлементКоллекции(Content.Buyers);
	
	Исполнитель	= Seller.Name;
	Заказчик = Buyer.Name;
	
	Область.Параметры.Заголовок = Общее_ПодставитьПараметрыВСтроку(
		"%1 выполнил, %2 принял следующие работы (услуги)", Исполнитель, Заказчик);
	
	Таб.Вывести(Область);
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferBases) Тогда
		Область = Параметры.Макет.ПолучитьОбласть("ШапкаОснования");
		Область.Параметры.Основания = СтрокаДокументыОснованияУПД970(Content.TransferInfo.TransferBases);
		Таб.Вывести(Область);
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_970_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.Table.Items Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.НомерСтроки  = НомерСтроки;
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_СФ_Акт(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		Область.Параметры.ЕдиницаИзмерения = СтрокаЕдиницаИзмерения_970(Item.UnitName);
		
		Область.Параметры.Количество = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Item.SubTotal);
		Область.Параметры.СуммаНДС = СтрокаСуммаНДС_970(Item.Vat, Item.WithoutVat, Item.TaxRate);
		
		Таб.Вывести(Область);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_970_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	Table = Параметры.Content.Table;
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокой(Table.TotalWithVatExcluded);
	Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Table.Total);
	Область.Параметры.СуммаНДС = ПодвалСуммаНДС_970(Table.Vat, Table.WithoutVat);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Акт_УПД_970_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Seller = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer = ПервыйЭлементКоллекции(Content.Buyers);
	
	Если Content.Table.Total = Неопределено Тогда
		СуммаПрописью = СтрокаДефис();
	Иначе
		СуммаПрописью = СуммаПрописью(Content.Table.Total, Content.Currency);
	КонецЕсли;
	Область.Параметры.СуммаВсегоПрописью = СуммаПрописью;
	
	Если НЕ Значениезаполнено(Content.Table.Vat) Тогда
		СуммаНДСПрописью = СтрокаДефис();
	Иначе
		СуммаНДСПрописью = СуммаПрописью(Content.Table.Vat, Content.Currency);
	КонецЕсли;
	Область.Параметры.СуммаНДСПрописью = СуммаНДСПрописью;
	
	Область.Параметры.ИдентификаторГосконтракта	= Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта = НадписьИдентификаторГосконтракта(Content.DocumentDate);
	
	Область.Параметры.Продавец = Seller.Name;
	Область.Параметры.ПродавецИНН = СтрокаИлиДефис(Seller.Inn);
	Область.Параметры.ПродавецКПП = Seller.Kpp;
	Область.Параметры.ПродавецАдрес = СтрокаАдресТелефонЭлПочта_970(Seller);
	Область.Параметры.ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Seller);
	
	Подписи = СтрокиПодписей_970(Content.Signers);
	Область.Параметры.ПродавецПодписант	= Подписи.ФИО;
	Область.Параметры.ПродавецДолжность = Подписи.Должность;
	
	TransferInfo = Content.TransferInfo;
	Если ЗначениеЗаполнено(TransferInfo.TransferDate) Тогда
		ДатаПодписания = TransferInfo.TransferDate;
	Иначе
		ДатаПодписания = Content.DocumentDate;
	КонецЕсли;
	Область.Параметры.ПродавецДатаПодписания = Формат(ДатаПодписания, "ДФ='dd MMMM yyyy ""года""'");
	
	// Титул покупателя
	Если Параметры.Свойство("BuyerContent")
		И Параметры.BuyerContent <> Неопределено Тогда 
		
		BuyerContent = Параметры.BuyerContent;
		
		Область.Параметры.Покупатель = Buyer.Name;
		Область.Параметры.ПокупательИНН = СтрокаИлиДефис(Buyer.Inn);
		Область.Параметры.ПокупательКПП	= Buyer.Kpp;
		Область.Параметры.СодержаниеОперации = СтрокаСодержаниеОперации_970(BuyerContent);
		
		Employee = BuyerContent.Employee;
		Если ЗначениеЗаполнено(Employee.Surname) Тогда
			
			ФИО	= СтрокаФИО(Employee);
			Должность = Employee.EmployeePosition;
			
		Иначе
			
			ПодписиBuyer = СтрокиПодписей_970(BuyerContent.Signers);
			
			ФИО = ПодписиBuyer.ФИО;
			Должность = ПодписиBuyer.Должность;
			
		КонецЕсли;

		Область.Параметры.ПокупательПодписант = ФИО;
		Область.Параметры.ПокупательДолжность = Должность;
		
		Если ЗначениеЗаполнено(BuyerContent.AcceptanceDate) Тогда 
			ДатаПодписания = BuyerContent.AcceptanceDate;
		Иначе
			ДатаПодписания = Content.DocumentDate;
		КонецЕсли;
		
		Область.Параметры.ПокупательДатаПодписания = Формат(ДатаПодписания, "ДФ='dd MMMM yyyy ""года""'");
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_Акт_552(Параметры)
	
	Параметры.Вставить("Макет", ПолучитьМакет("АктУПД"));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfo.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_Акт552", ОриентацияСтраницы.Портрет);
	
	ПФ_Акт_552_ШапкаДокумента(Таб, Параметры);
	ПФ_Акт_552_ШапкаТаблицы(Таб, Параметры);
	ПФ_Акт_552_СтрокиТаблицы(Таб, Параметры);
	ПФ_Акт_552_ПодвалТаблицы(Таб, Параметры);
	ПФ_Акт_552_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб; 
	
КонецФункции

Процедура ПФ_Акт_552_ШапкаДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Номер = Content.DocumentNumber;
	Область.Параметры.Дата  = ДатаСтрокой(Content.DocumentDate);
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	
	Таб.Вывести(Область);
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаЗаголовок");
	Область.Параметры.Заголовок  = Content.OperationTitle;
	Таб.Вывести(Область);
	
	Если ЗначениеЗаполнено(Content.Grounds) Тогда
		Область = Параметры.Макет.ПолучитьОбласть("ШапкаОснования");
		Область.Параметры.Основания = СтрокаДокументыОснованияАкта552(Content.Grounds);
		Таб.Вывести(Область);
	КонецЕсли;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_Акт_552_ШапкаТаблицы(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
КонецПроцедуры

Процедура ПФ_Акт_552_СтрокиТаблицы(Таб, Параметры)
	
	WorkItems = Параметры.Content.Works;
	
	НомерСтроки = 0;
	
	Для Каждого WorkItem Из Workitems Цикл
		
		Для Каждого Item Из WorkItem.Items Цикл
			
			НомерСтроки = НомерСтроки + 1;
			СтрокаДопСведений = "";
			
			Если Параметры.ПоказатьДопСведения Тогда
				СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
				Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
			Иначе
				Область = Параметры.Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			
			Область.Параметры.НомерСтроки = НомерСтроки;
			
			Область.Параметры.Наименование 		= ?(ЗначениеЗаполнено(Item.Name), Item.Name, Item.Description);
			Область.Параметры.ЕдиницаИзмерения 	= СтрокаЕдиницаИзмерения(Item.UnitCode, Item.UnitName);
			
			Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
			Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
			Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
			Область.Параметры.СуммаВсего  = СуммаСтрокойИлиДефис(Item.Subtotal);
			Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС(Item.Vat, Item.TaxRate);
			
			Таб.Вывести(Область);
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_Акт_552_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	TotalWithVatExcluded = 0;
	Total = 0;
	TotalVat = 0;
	
	WorkItems = Параметры.Content.Works;
	
	Для Каждого WorkItem Из WorkItems Цикл
		
		TotalWithVatExcluded = TotalWithVatExcluded + ?(WorkItem.TotalWithVatExcluded = Неопределено, 0, WorkItem.TotalWithVatExcluded);
		
		Total = Total + WorkItem.Total;
		
		TotalVat = TotalVat + ?(WorkItem.TotalVat = Неопределено, 0, WorkItem.TotalVat);
		
	КонецЦикла;
	
	Область.Параметры.СуммаБезНДС	= СуммаСтрокой(TotalWithVatExcluded);
	Область.Параметры.СуммаВсего	= СуммаСтрокой(Total);
	Область.Параметры.СуммаНДС		= ПодвалСуммаНДС(TotalVat);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_Акт_552_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Total = 0;
	TotalVat = 0;
	
	WorkItems = Параметры.Content.Works;
	
	Для Каждого WorkItem Из WorkItems Цикл
		
		Total = Total + WorkItem.Total;
		
		TotalVat = TotalVat + ?(WorkItem.TotalVat = Неопределено, 0, WorkItem.TotalVat);
		
	КонецЦикла;
	
	Область.Параметры.СуммаВсегоПрописью = СуммаПрописью(Total, Content.Currency);
	Если ЗначениеЗаполнено(WorkItem.TotalVat) Тогда
		Область.Параметры.СуммаНДСПрописью = СуммаПрописью(TotalVat, Content.Currency);
	КонецЕсли;
	
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Content.DocumentDate);
	
	Область.Параметры.Продавец		= Content.Seller.Name;
	Область.Параметры.ПродавецИНН	= Content.Seller.Inn;
	Область.Параметры.ПродавецКПП	= Content.Seller.Kpp;
	Область.Параметры.ПродавецАдрес = СтрокаАдресТелефонЭлПочта(Content.Seller);
	Область.Параметры.ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Seller);
	
	Подписи = СтрокиПодписей(Content.Signers);
	Область.Параметры.ПродавецПодписант	= Подписи.ФИО;
	Область.Параметры.ПродавецДолжность = Подписи.Должность;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда 
		Область.Параметры.ПродавецДатаПодписания = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	Иначе
		Область.Параметры.ПродавецДатаПодписания = Формат(Content.DocumentDate, "ДФ='dd MMMM yyyy ""года""'");
	КонецЕсли;
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) И ЗначениеЗаполнено(Параметры.BuyerContent.OperationContent) Тогда 
		
		Область.Параметры.Покупатель	= Content.Buyer.Name;
		Область.Параметры.ПокупательИНН	= Content.Buyer.Inn;
		Область.Параметры.ПокупательКПП	= Content.Buyer.Kpp;
		
		Подписи = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ПокупательПодписант = Подписи.ФИО;
		Область.Параметры.ПокупательДолжность = Подписи.Должность;
		
		Область.Параметры.СодержаниеОперации = Параметры.BuyerContent.OperationContent;
		
		Если ЗначениеЗаполнено(Параметры.BuyerContent.AcceptanceDate) Тогда 
			Область.Параметры.ПокупательДатаПодписания = Формат(Параметры.BuyerContent.AcceptanceDate, "ДФ='dd MMMM yyyy ""года""'");
		Иначе
			Область.Параметры.ПокупательДатаПодписания = Формат(Параметры.Content.DocumentDate, "ДФ='dd MMMM yyyy ""года""'");
		КонецЕсли;
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_УПД(Параметры)
	
	Параметры.Вставить("Макет"		 , ПолучитьМакет("УПД"));
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.Date, Параметры.Content.RevisionDate));
	Параметры.Вставить("ПодписиПродавца", СтрокиПодписей(Параметры.Content.Signers));
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_УПД_" + Параметры.ДатаРедакции);
	
	ПФ_УПД_ШапкаДокумента(Таб, Параметры);
	ПФ_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_УПД_СтрокиТаблицы(Таб, Параметры);
	
	ПФ_УПД_ПодвалТаблицы(Таб, Параметры);
	ПФ_УПД_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_УПД_ШапкаДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	БазоваяФункция = ProtoFunctionType(Content.Function);
	Если БазоваяФункция <> ПротофункцияBasic() Тогда
		Область.Параметры.Постановление = СтрокаПостановлениеУПД_УКД();
		Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	КонецЕсли;
	
	Область.Параметры.Дата  = ДатаСтрокой(Content.Date);
	Область.Параметры.Номер	= Content.Number;
	
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	
	Область.Параметры.Продавец		   = Content.Seller.Name;
	Область.Параметры.ПродавецАдрес	   = СтрокаИлиДефис(СтрокаАдрес(Content.Seller.Address));
	Область.Параметры.ПродавецИНН	   = СтрокаИННКПП(Content.Seller);
	
	ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Seller);
	Если ПродавецБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПродавецБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПродавецБанковскиеРеквизиты = ПродавецБанковскиеРеквизиты;
	КонецЕсли;
	
	ПродавецКонтакты = СтрокаТелефонЭлПочта(Content.Seller);
	Если ЗначениеЗаполнено(ПродавецКонтакты) Тогда
		Область.Параметры.ПродавецКонтакты = ПродавецКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПродавецКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Область.Параметры.Грузоотправитель = ?(Content.Shipper.SameAsSeller = Истина, "он же", СтрокаНаименованиеАдрес(Content.Shipper.OrganizationInfo));
	Область.Параметры.Грузополучатель  = СтрокаНаименованиеАдрес(Content.Consignee);
	
	Область.Параметры.Покупатель		 = Content.Buyer.Name;
	Область.Параметры.ПокупательАдрес	 = СтрокаИлиДефис(СтрокаАдрес(Content.Buyer.Address));
	Область.Параметры.ПокупательИНН		 = СтрокаИННКПП(Content.Buyer);
	
	ПокупательБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Buyer);
	Если ПокупательБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПокупательБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПокупательБанковскиеРеквизиты = ПокупательБанковскиеРеквизиты;
	КонецЕсли;
	
	ПокупательКонтакты = СтрокаТелефонЭлПочта(Content.Buyer);
	Если ЗначениеЗаполнено(ПокупательКонтакты) Тогда
		Область.Параметры.ПокупательКонтакты = ПокупательКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПокупательКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Область.Параметры.Валюта					 = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.СтатусУПД					 = СтрокаСтатусУПД(Content.Function);
	Область.Параметры.ПлатежноРасчетныеДокументы = СтрокаПРД(Content.PaymentDocuments);
	
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
	
	Область.УдалитьОбласть(Область.Область("ДокументыОбОтгрузке"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УПД_ШапкаТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		Область.Параметры.ЗаголовокНомерТД = "Регистрационный номер декларации на товары или регистрационный номер партии товара, подлежащего прослеживаемости";
	ИначеЕсли Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
		Область.Параметры.ЗаголовокНомерТД = "Регистрационный номер таможенной декларации";
	Иначе
		Область.Параметры.ЗаголовокНомерТД = "Номер таможенной декларации";
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УПД_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.InvoiceTable.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Если Параметры.ДатаРедакции >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаДефис();
		КонецЕсли;
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Код		   = СтрокаИлиДефис(Item.VendorCode);
		Область.Параметры.Наименование = СтрокаИлиДефис(Item.Product);
		
		Область.Параметры.ЕдиницаИзмерения	  = СтрокаЕдиницаИзмерения(Item.UnitCode, Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаИлиДефис(Item.UnitCode);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		Область.Параметры.СуммаВсего  = СтрокаСуммаВсего(Item.SubTotal, Item.TaxRate, ФорматСуммы());
		Область.Параметры.СтавкаНДС	  = СтрокаСтавкаНДС(Item.TaxRate);
		Область.Параметры.СуммаНДС	  = СтрокаСуммаНДС(Item.Vat, Item.TaxRate);
		Область.Параметры.Акциз		  = СтрокаАкциз(Item.Excise, Item.TaxRate);
		
		Строки = СтрокиНомеровТД(Item.CustomDeclarations);
		Область.Параметры.Страна	= Строки.Страны;
		Область.Параметры.СтранаКод = Строки.КодыСтран;
		Область.Параметры.НомерТД	= Строки.НомераТД;
		
		Таб.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_УПД_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceTable.TotalWithVatExcluded);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Параметры.Content.InvoiceTable.Items) Тогда
		Область.Параметры.СуммаВсего = СтрокаДефис();
		Область.Параметры.СуммаНДС	 = СтрокаДефис();
	Иначе	
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceTable.Total);
		Область.Параметры.СуммаНДС   = ПодвалСуммаНДС(Параметры.Content.InvoiceTable.Vat);
	КонецЕсли;
	
	Область.Параметры.ПродавецПодписант = Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись 	= Параметры.ПодписиПродавца.Подпись;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УПД_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.Основания = СтрокаДокументыОснованияУПД(Content.TransferInfo.TransferBases);
	Область.Параметры.ПродавецСоставитель  = Content.Creator;
	Область.Параметры.ПродавецИныеСведения = Параметры.ДопСведения.top;
	Область.Параметры.СведенияОТранспортировкеИГрузе = Content.TransferInfo.TransferTextInfo;
	
	Работник = РаботникИлиИноеЛицо(Content.TransferInfo);
	Если Работник <> Неопределено Тогда
		Область.Параметры.ПродавецРаботник			= СтрокаФИО(Работник);
		Область.Параметры.ПродавецРаботникДолжность = Работник.EmployeePosition;
	КонецЕсли;
	
	Область.Параметры.ПродавецПодписант = Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись 	= Параметры.ПодписиПродавца.Подпись;
	Область.Параметры.ПродавецДолжность = Параметры.ПодписиПродавца.Должность;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
		Область.Параметры.ДатаОтпуска = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	Иначе
		Область.Параметры.ДатаОтпуска = Формат(Content.Date, "ДФ='dd MMMM yyyy ""года""'");
	КонецЕсли;
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) Тогда
		
		Если ЗначениеЗаполнено(Параметры.BuyerContent.AcceptanceDate) Тогда
			ДатаПолучения = Параметры.BuyerContent.AcceptanceDate;
		ИначеЕсли ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
			ДатаПолучения = Content.TransferInfo.TransferDate;
		Иначе
			ДатаПолучения = Content.Date;
		КонецЕсли;
		
		Область.Параметры.ДатаПолучения			= Формат(ДатаПолучения, "ДФ='dd MMMM yyyy ""года""'");
		Область.Параметры.РезультатыПриемки 	= Параметры.BuyerContent.OperationContent;
		Область.Параметры.ПокупательСоставитель = Параметры.BuyerContent.Creator;
		
		Работник = РаботникИлиИноеЛицо(Параметры.BuyerContent);
		Если Работник <> Неопределено Тогда
			Область.Параметры.ПокупательРаботник		  = СтрокаФИО(Работник);
			Область.Параметры.ПокупательРаботникДолжность = Работник.EmployeePosition;
		КонецЕсли;
		
		ПодписиBuyer = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ПокупательПодписант = ПодписиBuyer.ФИО;
		Область.Параметры.ПокупательПодпись   = ПодписиBuyer.Подпись;
		Область.Параметры.ПокупательДолжность = ПодписиBuyer.Должность;
		
	КонецЕсли;
	
	МассивИнфПолФХЖ3 = Content.TransferInfo.AdditionalInfoId.StructedAdditionalInfos;
	
	Если ЗначениеЗаполнено(МассивИнфПолФХЖ3) Тогда
		
		ИнфПолФХЖ3 = ДопСведенияСтрокой(МассивИнфПолФХЖ3);
		
		Область.Параметры.ИнфПолФХЖ3 = ИнфПолФХЖ3;
		
	Иначе
		Область.УдалитьОбласть(Область.Область("ИнфПолФХЖ3"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры

Функция ЭтоИзвестнаяФункцияУПД(ЗначениеФункции)
	
	ВозможныеЗначения = Новый Массив;
	ВозможныеЗначения.Добавить(ФункцияСЧФДОП());
	ВозможныеЗначения.Добавить(ФункцияСЧФ());
	ВозможныеЗначения.Добавить(ФункцияДОП());
	ВозможныеЗначения.Добавить(ПротофункцияInvoiceAndBasic());
	ВозможныеЗначения.Добавить(ПротофункцияInvoice());
	ВозможныеЗначения.Добавить(ПротофункцияBasic());
	
	Результат = (ВозможныеЗначения.Найти(ЗначениеФункции) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПФ_УПД_820(Параметры)
	
	ЗначениеФункции = Параметры.Content.Function;
	
	Если Не ЭтоИзвестнаяФункцияУПД(ЗначениеФункции) Тогда
		
		Если ЕстьСведенияОИсправлении(Параметры.Content) Тогда
			ТипДокумента = ТипУниверсальныйПередаточныйДокументИсправление();
		Иначе
			ТипДокумента = ТипУниверсальныйПередаточныйДокумент();
		КонецЕсли;
		ТипКонтента = КонтентИнформацияПродавца820();
		Таб = ПечатнаяФормаЗаглушка(ТипДокумента, ТипКонтента, ЗначениеФункции);
		
		Возврат Таб;
		
	КонецЕсли;
	
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.DocumentDate, Параметры.Content.RevisionDate));
	Параметры.Вставить("ПодписиПродавца", СтрокиПодписей(Параметры.Content.Signers));
	Параметры.Вставить("ЕстьСведенияОПрослеживаемости", ЕстьСведенияОПрослеживаемости820(Параметры.Content));
	
	Если Параметры.ДатаРедакции = ДатаРедакции1096() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_1096_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_534"));	
		КонецЕсли;
		
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_534_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_534"));	
		КонецЕсли;
		
	Иначе
		Параметры.Вставить("Макет", ПолучитьМакет("УПД"));	
		
	КонецЕсли;
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
			
	Таб = НовыйТабличныйДокумент("DD_УПД_" + Параметры.ДатаРедакции);
	
	ПФ_УПД_820_ШапкаДокумента(Таб, Параметры);
	ПФ_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_УПД_820_СтрокиТаблицы(Таб, Параметры);
	
	ПФ_УПД_820_ПодвалТаблицы(Таб, Параметры);
	ПФ_УПД_820_ПодвалДокумента(Таб, Параметры);
	
	Если Параметры.Свойство("ДанныеШтампа") Тогда
		ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	КонецЕсли;
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_УПД_820_ШапкаДокумента_Продавец(Область, Seller)
	
	Если Seller = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Продавец		   = Seller.Name;
	Область.Параметры.ПродавецАдрес	   = СтрокаИлиДефис(СтрокаАдрес(Seller.Address));
	Область.Параметры.ПродавецИНН	   = СтрокаИННКПП_820(Seller);
	
	ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Seller);
	Если ПродавецБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПродавецБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПродавецБанковскиеРеквизиты = ПродавецБанковскиеРеквизиты;
	КонецЕсли;
	
	ПродавецКонтакты = СтрокаТелефонЭлПочта(Seller);
	Если ЗначениеЗаполнено(ПродавецКонтакты) Тогда
		Область.Параметры.ПродавецКонтакты = ПродавецКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПродавецКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_УПД_820_ШапкаДокумента_Покупатель(Область, Buyer)
	
	Если Buyer = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Покупатель		 = Buyer.Name;
	Область.Параметры.ПокупательАдрес	 = СтрокаИлиДефис(СтрокаАдрес(Buyer.Address));
	Область.Параметры.ПокупательИНН		 = СтрокаИННКПП_820(Buyer);
	
	ПокупательБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Buyer);
	Если ПокупательБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПокупательБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПокупательБанковскиеРеквизиты = ПокупательБанковскиеРеквизиты;
	КонецЕсли;
	
	ПокупательКонтакты = СтрокаТелефонЭлПочта(Buyer);
	Если ЗначениеЗаполнено(ПокупательКонтакты) Тогда
		Область.Параметры.ПокупательКонтакты = ПокупательКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПокупательКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_УПД_820_ШапкаДокумента_Грузоотправитель(Область, Shipper)
	
	Если Shipper = Неопределено Тогда
		ПредставлениеГрузоотправителя = СтрокаДефис();
	ИначеЕсли Shipper.SameAsSeller = Истина Тогда
		ПредставлениеГрузоотправителя = "он же";
	Иначе
		ПредставлениеГрузоотправителя = СтрокаНаименованиеАдрес(Shipper.OrganizationInfo);
	КонецЕсли;
	
	Область.Параметры.Грузоотправитель = ПредставлениеГрузоотправителя;
	
КонецПроцедуры

Процедура ПФ_УПД_820_ШапкаДокумента_Грузополучатель(Область, Consignee)
	
	Если Consignee = Неопределено Тогда
		ПредставлениеГрузополучателя = СтрокаДефис();
	Иначе
		ПредставлениеГрузополучателя = СтрокаНаименованиеАдрес(Consignee);
	КонецЕсли;
	
	Область.Параметры.Грузополучатель = ПредставлениеГрузополучателя;
	
КонецПроцедуры

Процедура ПФ_УПД_820_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Seller		 = ПервыйЭлементКоллекции(Content.Sellers);
	Buyer		 = ПервыйЭлементКоллекции(Content.Buyers);
	Consignee	 = ПервыйЭлементКоллекции(Content.Consignees);
	Shipper		 = ПервыйЭлементКоллекции(Content.Shippers);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	БазоваяФункция = ProtoFunctionType(Content.Function);
	Если БазоваяФункция <> ПротофункцияBasic() Тогда
		Область.Параметры.Постановление = СтрокаПостановлениеУПД_УКД();
		Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	КонецЕсли;
	
	Область.Параметры.Дата  = ДатаСтрокой(Content.DocumentDate);
	Область.Параметры.Номер	= Content.DocumentNumber;
	
	Область.Параметры.ДатаИсправления  = СтрокаДатаИсправления_820(Content.RevisionDate, Content.HyphenRevisionDate);
	Область.Параметры.НомерИсправления = СтрокаНомерИсправления_820(Content.RevisionNumber, Content.HyphenRevisionNumber);
	
	ПФ_УПД_820_ШапкаДокумента_Продавец(Область, Seller);
	
	ПФ_УПД_820_ШапкаДокумента_Грузоотправитель(Область, Shipper);
	
	ПФ_УПД_820_ШапкаДокумента_Грузополучатель(Область, Consignee);
	
	ПФ_УПД_820_ШапкаДокумента_Покупатель(Область, Buyer);
	
	Область.Параметры.Валюта					 = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.СтатусУПД					 = СтрокаСтатусУПД(Content.Function);
	Область.Параметры.ПлатежноРасчетныеДокументы = СтрокаПРД(Content.PaymentDocuments);
	
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
	
	Если Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузке(Content.DocumentShipments);
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции1096() Тогда
		Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузкеВРедакции1096(Content.DocumentShipments);
	Иначе
		Область.УдалитьОбласть(Область.Область("ДокументыОбОтгрузке"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Если Область.Области.Найти("АвансовыеДокументы") <> Неопределено Тогда
		Область.УдалитьОбласть(Область.Область("АвансовыеДокументы"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УПД_820_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.Table.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		
		КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
		
		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) И КоличествоСтрокСПрослеживаемостью <= 1 Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.КодВТ = СтрокаИлиДефис(Item.ItemTypeCode);
		
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_УПД_УКД(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		Область.Параметры.Код = ПредставлениеКодТов(Item, Параметры.ВыводитьНаименованиеТовараСКодами);				
		
		Область.Параметры.ЕдиницаИзмерения	  = СтрокаЕдиницаИзмерения(Item.Unit,	Item.UnitName);
		Область.Параметры.ЕдиницаИзмеренияКод = СтрокаКодЕдиницыИзмерения820(Item.Unit, Item.HyphenUnit);
		
		Область.Параметры.Количество  = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена		  = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		
		Область.Параметры.СуммаВсего  = СтрокаСуммаВсего_820(Item.SubTotal, Item.HyphenSubtotal);
		Область.Параметры.СтавкаНДС	  = СтрокаСтавкаНДС(Item.TaxRate);
		Область.Параметры.СуммаНДС    = СтрокаСуммаНДС_820(Item.Vat, Item.WithoutVat, Item.HyphenVat, Item.TaxRate);
		Область.Параметры.Акциз		  = СтрокаАкциз_820(Item.Excise);
		
		Строки = СтрокиНомеровТД_820(Item.CustomDeclarations);
		Область.Параметры.Страна	= Строки.Страны;
		Область.Параметры.СтранаКод = Строки.КодыСтран;
		Область.Параметры.НомерТД	= Строки.НомераТД;
		
		Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
			ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УПД(Область, Item, Строки.НомераТД, Параметры);
		КонецЕсли;
		
		Таб.Вывести(Область);
		
		Если Параметры.ДатаРедакции >= ДатаРедакции534() И КоличествоСтрокСПрослеживаемостью > 1 Тогда
			ЗаполнитьПараметрыПрослеживаемостиСтрок_УПД(Таб, Item, СтрокаДопСведений, НомераКолонок_УПД_534_Прослеж(Параметры), Параметры);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_УПД_820_ПодвалТаблицы(Таб, Параметры)
	
	Область	 = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	Table	 = Параметры.Content.Table;
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Table.TotalWithVatExcluded);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Table.Items) Тогда
		Область.Параметры.СуммаВсего = СтрокаДефис();
		Область.Параметры.СуммаНДС	 = СтрокаДефис();
	Иначе
		Область.Параметры.СуммаВсего = ПодвалСуммаВсего_820(Table.Total, Table.HyphenTotal);
		Область.Параметры.СуммаНДС	 = ПодвалСуммаНДС_820(Table.Vat, Table.WithoutVat, Table.HyphenVat);
	КонецЕсли;
	
	Область.Параметры.ПродавецПодписант = Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись 	= Параметры.ПодписиПродавца.Подпись;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УПД_820_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.Основания = СтрокаДокументыОснованияУПД(Content.TransferInfo.TransferBases);
	Область.Параметры.ПродавецСоставитель  = Content.DocumentCreator;
	Область.Параметры.ПродавецИныеСведения = Параметры.ДопСведения.top;
	Область.Параметры.СведенияОТранспортировкеИГрузе = Content.TransferInfo.TransferTextInfo;
	
	Работник = РаботникИлиИноеЛицо(Content.TransferInfo);
	Если Работник <> Неопределено Тогда
		Область.Параметры.ПродавецРаботник			= СтрокаФИО(Работник);
		Область.Параметры.ПродавецРаботникДолжность = Работник.EmployeePosition;
	КонецЕсли;
	
	Область.Параметры.ПродавецПодписант = Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись 	= Параметры.ПодписиПродавца.Подпись;
	Область.Параметры.ПродавецДолжность = Параметры.ПодписиПродавца.Должность;
	
	Если ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
		Область.Параметры.ДатаОтпуска = Формат(Content.TransferInfo.TransferDate, "ДФ='dd MMMM yyyy ""года""'");
	Иначе
		Область.Параметры.ДатаОтпуска = Формат(Content.DocumentDate, "ДФ='dd MMMM yyyy ""года""'");
	КонецЕсли;
	
	// Титул покупателя
	Если Параметры.Свойство("BuyerContent")
		И Параметры.BuyerContent <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Параметры.BuyerContent.AcceptanceDate) Тогда
			ДатаПолучения = Параметры.BuyerContent.AcceptanceDate;
		ИначеЕсли ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
			ДатаПолучения = Content.TransferInfo.TransferDate;
		Иначе
			ДатаПолучения = Content.DocumentDate;
		КонецЕсли;
		
		Область.Параметры.ДатаПолучения			= Формат(ДатаПолучения, "ДФ='dd MMMM yyyy ""года""'");
		Область.Параметры.ПокупательСоставитель = Параметры.BuyerContent.DocumentCreator;
		Область.Параметры.РезультатыПриемки		= СтрокаСодержаниеОперации(Параметры.BuyerContent);
		
		Работник = РаботникИлиИноеЛицо(Параметры.BuyerContent);
		Если Работник <> Неопределено Тогда
			Область.Параметры.ПокупательРаботник		  = СтрокаФИО(Работник);
			Область.Параметры.ПокупательРаботникДолжность = Работник.EmployeePosition;
		КонецЕсли;
		
		ПодписиBuyer = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ПокупательПодписант = ПодписиBuyer.ФИО;
		Область.Параметры.ПокупательПодпись   = ПодписиBuyer.Подпись;
		Область.Параметры.ПокупательДолжность = ПодписиBuyer.Должность;
		
	КонецЕсли;
	
	МассивИнфПолФХЖ3 = Content.TransferInfo.AdditionalInfoId.StructedAdditionalInfos;
	
	Если ЗначениеЗаполнено(МассивИнфПолФХЖ3) Тогда
		
		ИнфПолФХЖ3 = ДопСведенияСтрокой(МассивИнфПолФХЖ3);
		
		Область.Параметры.ИнфПолФХЖ3 = ИнфПолФХЖ3;
		
	Иначе
		Область.УдалитьОбласть(Область.Область("ИнфПолФХЖ3"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры


Функция ПФ_УПД_970(Параметры)
	
	ЗначениеФункции = Параметры.Content.Function;
	
	Если Не ЭтоИзвестнаяФункцияУПД(ЗначениеФункции) Тогда
		
		Если ЕстьСведенияОИсправлении(Параметры.Content) Тогда
			ТипДокумента = ТипУниверсальныйПередаточныйДокументИсправление();
		Иначе
			ТипДокумента = ТипУниверсальныйПередаточныйДокумент();
		КонецЕсли;
		ТипКонтента = КонтентИнформацияПродавца970();
		Таб = ПечатнаяФормаЗаглушка(ТипДокумента, ТипКонтента, ЗначениеФункции);
		
		Возврат Таб;
		
	КонецЕсли;
	
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.DocumentDate, Параметры.Content.RevisionDate));
	Параметры.Вставить("ПодписиПродавца", СтрокиПодписей_970(Параметры.Content.Signers));
	Параметры.Вставить("ЕстьСведенияОПрослеживаемости", ЕстьСведенияОПрослеживаемости970(Параметры.Content));
	
	Если Параметры.ДатаРедакции = ДатаРедакции1096()
		ИЛИ Параметры.ДатаРедакции = ДатаРедакции425() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_1096_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_534"));	
		КонецЕсли;
		
	Иначе
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_534_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("УПД_534"));	
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
			
	Таб = НовыйТабличныйДокумент("DD_УПД_" + Параметры.ДатаРедакции);
	
	ПФ_УПД_970_ШапкаДокумента(Таб, Параметры);
	ПФ_УПД_ШапкаТаблицы(Таб, Параметры);
	ПФ_УПД_970_СтрокиТаблицы(Таб, Параметры);
	
	ПФ_УПД_970_ПодвалТаблицы(Таб, Параметры);
	ПФ_УПД_970_ПодвалДокумента(Таб, Параметры);
	
	Если Параметры.Свойство("ДанныеШтампа") Тогда
		ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	КонецЕсли;
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_УПД_970_ШапкаДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	
	Sellers = Content.Sellers;
	Buyers = Content.Buyers;
	Consignees = Content.Consignees;
	Shippers = Content.Shippers;
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	БазоваяФункция = ProtoFunctionType(Content.Function);
	Если БазоваяФункция <> ПротофункцияBasic() Тогда
		Область.Параметры.Постановление = СтрокаПостановлениеУПД_УКД();
		Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	КонецЕсли;
	
	ДатаДокумента = ДатаСтрокой(Content.DocumentDate);
	НомерДокумента = Content.DocumentNumber;
	
	Область.Параметры.Дата  = ДатаДокумента;
	Область.Параметры.Номер = НомерДокумента;
	
	Область.Параметры.ДатаИсправления  = СтрокаДатаИсправления_970(Content.RevisionDate);
	Область.Параметры.НомерИсправления = СтрокаНомерИсправления_970(Content.RevisionNumber);
	
	ПФ_УПД_970_ШапкаДокумента_Продавцы(Область, Sellers);
	
	ПФ_УПД_СФ_970_ШапкаДокумента_Грузоотправители(Область, Shippers);
	
	ПФ_УПД_970_ШапкаДокумента_Грузополучатели(Область, Consignees);
	
	ПФ_УПД_970_ШапкаДокумента_Покупатели(Область, Buyers);
	
	Область.Параметры.Валюта = СтрокаПредставлениеВалюты_970(Content.CurrencyName, Content.Currency);
	Область.Параметры.СтатусУПД	= СтрокаСтатусУПД(Content.Function);
	Область.Параметры.ПлатежноРасчетныеДокументы = СтрокаПРД(Content.PaymentDocuments);
	
	Область.Параметры.ИдентификаторГосконтракта	= Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции);
	
	Если Content.Function = ФункцияСЧФДОП() Тогда
		
		НаименованиеДокумента = Content.DocumentName;
		СтрокаДокументаОбОтгрузке = ПредставлениеДокумента(
			НаименованиеДокумента, 
			НомерДокумента, 
			ДатаДокумента);
			
		Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументаОбОтгрузке;
		
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузке(Content.DocumentShipments);
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции1096() Тогда
	    Область.Параметры.ДокументыОбОтгрузке = СтрокаДокументыОбОтгрузкеВРедакции1096(Content.DocumentShipments);
	КонецЕсли;
	
	Если Content.DocumentDate >= ДатаРедакции425() Тогда
		Область.Параметры.НадписьАвансовыеДокументы = НадписьАвансовыеДокументы();
		Область.Параметры.АвансовыеДокументы = СтрокаАвансовыеДокументы(Content.AccompanyingDocuments);
	Иначе
		Область.УдалитьОбласть(Область.Область("АвансовыеДокументы"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УПД_970_ШапкаДокумента_Продавцы(Область, Sellers)
	
	Если Sellers = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиПродавец = Новый Массив;
	ЧастиПродавецАдрес = Новый Массив;
	ЧастиПродавецИНН = Новый Массив;
	ЧастиПродавецБанковскиеРеквизиты = Новый Массив;
	ЧастиПродавецКонтакты = Новый Массив;
	
	Для Каждого Seller Из Sellers Цикл
		Если Seller = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЧастиПродавец.Добавить(Seller.Name);
		ЧастиПродавецАдрес.Добавить(СтрокаИлиДефис(СтрокаАдрес_970(Seller.Address)));
		ЧастиПродавецИНН.Добавить(СтрокаИННКПП_970(Seller));
		
		СтрокаБанковскиеРеквизитыЛок = СтрокаБанковскиеРеквизиты(Seller);
		Если Не СтрокаБанковскиеРеквизитыЛок = СтрокаДефис() Тогда
			ЧастиПродавецБанковскиеРеквизиты.Добавить(СтрокаБанковскиеРеквизитыЛок);
		КонецЕсли;
		
		ЧастиПродавецКонтакты.Добавить(СтрокаКонтактныеДанные_970(Seller));
		
	КонецЦикла;
	
	Область.Параметры.Продавец = СоединитьСтроку(ЧастиПродавец, ";");
	Область.Параметры.ПродавецАдрес = СоединитьСтроку(ЧастиПродавецАдрес, ";");
	Область.Параметры.ПродавецИНН = СоединитьСтроку(ЧастиПродавецИНН, ";");
	
	ПродавецБанковскиеРеквизиты = СоединитьСтроку(ЧастиПродавецБанковскиеРеквизиты, ";");
	
	Если ЗначениеЗаполнено(ПродавецБанковскиеРеквизиты) Тогда
		Область.Параметры.ПродавецБанковскиеРеквизиты = ПродавецБанковскиеРеквизиты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПродавецБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	ПродавецКонтакты = СоединитьСтроку(ЧастиПродавецКонтакты, ";");
	
	Если ЗначениеЗаполнено(ПродавецКонтакты) Тогда
		Область.Параметры.ПродавецКонтакты = ПродавецКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПродавецКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;

КонецПроцедуры

Процедура ПФ_УПД_970_ШапкаДокумента_Покупатели(Область, Buyers)
	
	Если Не ЗначениеЗаполнено(Buyers) Тогда
		Возврат;
	КонецЕсли;
	
	ПФ_УПД_СФ_970_ШапкаДокумента_Покупатели(Область, Buyers);
	
	БанковскиеРеквизитыПокупателей = Новый Массив;
	КонтактыПокупателей = Новый Массив;

	Для Каждого Buyer Из Buyers Цикл
		
		СтрокаБанковскиеРеквизитыЛок = СтрокаБанковскиеРеквизиты(Buyer);
		Если СтрокаБанковскиеРеквизитыЛок <> СтрокаДефис() Тогда
			БанковскиеРеквизитыПокупателей.Добавить(СтрокаБанковскиеРеквизитыЛок);
		КонецЕсли;
		
		КонтактыПокупателя = СтрокаКонтактныеДанные_970(Buyer);
		Если ЗначениеЗаполнено(КонтактыПокупателя) Тогда
			КонтактыПокупателей.Добавить(КонтактыПокупателя);
		КонецЕсли;
		
	КонецЦикла;
	
	Разделитель = "; ";
	
	Если ЗначениеЗаполнено(БанковскиеРеквизитыПокупателей) Тогда
		Область.Параметры.ПокупательБанковскиеРеквизиты = СоединитьСтроку(БанковскиеРеквизитыПокупателей, Разделитель);
	Иначе
		ОбластьБанковскихРеквизитов = Область.Область("ПокупательБанковскиеРеквизиты");
		Область.УдалитьОбласть(ОбластьБанковскихРеквизитов, ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактыПокупателей) Тогда
		Область.Параметры.ПокупательКонтакты = СоединитьСтроку(КонтактыПокупателей, Разделитель);
	Иначе
		ОбластьКонтактов = Область.Область("ПокупательКонтакты");
		Область.УдалитьОбласть(ОбластьКонтактов, ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_УПД_СФ_970_ШапкаДокумента_Покупатели(Область, Buyers)
	
	Если Не ЗначениеЗаполнено(Buyers) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованияПокупателей = Новый Массив;
	АдресаПокупателей = Новый Массив;
	ИННПокупателей = Новый Массив;

	Для Каждого Buyer Из Buyers Цикл
		
		НаименованияПокупателей.Добавить(Buyer.Name);
		АдресаПокупателей.Добавить(СтрокаИлиДефис(СтрокаАдрес_970(Buyer.Address)));
		ИННПокупателей.Добавить(СтрокаИННКПП_970(Buyer));
		
	КонецЦикла;
	
	Разделитель = "; ";
	
	Область.Параметры.Покупатель = СоединитьСтроку(НаименованияПокупателей, Разделитель);
	Область.Параметры.ПокупательАдрес = СоединитьСтроку(АдресаПокупателей, Разделитель);
	Область.Параметры.ПокупательИНН = СоединитьСтроку(ИННПокупателей, Разделитель);
	
КонецПроцедуры

Процедура ПФ_УПД_СФ_970_ШапкаДокумента_Продавцы(Область, Sellers)

	Если Sellers = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиПродавец = Новый Массив;
	ЧастиПродавецАдрес = Новый Массив;
	ЧастиПродавецИНН = Новый Массив;
	
	Для Каждого Seller Из Sellers Цикл
		Если Seller = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЧастиПродавец.Добавить(Seller.Name);
		ЧастиПродавецАдрес.Добавить(СтрокаИлиДефис(СтрокаАдрес_970(Seller.Address)));
		ЧастиПродавецИНН.Добавить(СтрокаИННКПП_970(Seller));
		
	КонецЦикла;
	
	Область.Параметры.Продавец = СоединитьСтроку(ЧастиПродавец, ";");
	Область.Параметры.ПродавецАдрес = СоединитьСтроку(ЧастиПродавецАдрес, ";");
	Область.Параметры.ПродавецИНН = СоединитьСтроку(ЧастиПродавецИНН, ";");
	
КонецПроцедуры

Процедура ПФ_УПД_СФ_970_ШапкаДокумента_Грузоотправители(Область, Shippers)
	
	ЧастиПредставленияГрузоотправителей = Новый Массив;
	
	Для Каждого Shipper Из Shippers Цикл
		
		Если Shipper = Неопределено Тогда
			Продолжить;
		ИначеЕсли Shipper.SameAsSeller = Истина Тогда
			ПредставлениеГрузоотправителя = "он же";
		Иначе
			ПредставлениеГрузоотправителя = СтрокаНаименованиеАдрес_970(Shipper.OrganizationInfo);
		КонецЕсли;
		
		ЧастиПредставленияГрузоотправителей.Добавить(ПредставлениеГрузоотправителя);
		
	КонецЦикла;
	
	Если ЧастиПредставленияГрузоотправителей.Количество() = 0 Тогда
		ПредставлениеГрузоотправителей = СтрокаДефис();
	Иначе
		ПредставлениеГрузоотправителей = СоединитьСтроку(ЧастиПредставленияГрузоотправителей, "; ");
	КонецЕсли;
	
	Область.Параметры.Грузоотправитель = ПредставлениеГрузоотправителей;
	
КонецПроцедуры

Процедура ПФ_УПД_970_ШапкаДокумента_Грузополучатели(Область, Consignees)
	
	ЧастиПредставленияГрузополучателя = Новый Массив;
	
	Для Каждого Consignee Из Consignees Цикл
		
		Если Consignee = Неопределено Тогда
			Продолжить;
		Иначе
			ПредставлениеГрузополучателя = СтрокаНаименованиеАдрес_970(Consignee);
		КонецЕсли;
		
		ЧастиПредставленияГрузополучателя.Добавить(ПредставлениеГрузополучателя);
		
	КонецЦикла;
	
	Если ЧастиПредставленияГрузополучателя.Количество() = 0 Тогда
		ПредставлениеГрузоотправителей = СтрокаДефис();
	Иначе
		ПредставлениеГрузоотправителей = СоединитьСтроку(ЧастиПредставленияГрузополучателя, "; ");
	КонецЕсли;
	
	Область.Параметры.Грузополучатель = ПредставлениеГрузоотправителей;
	
КонецПроцедуры

Процедура ПФ_УПД_970_СтрокиТаблицы(Таб, Параметры)
	
	НомерСтроки = 0;
	
	Для каждого Item Из Параметры.Content.Table.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДопСведений = "";
		КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();

		Если Параметры.ПоказатьДопСведения Тогда
			СтрокаДопСведений = ДопСведенияСтрокиУПД(Item);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) И КоличествоСтрокСПрослеживаемостью <= 1 Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;

		Область.Параметры.НомерСтроки = НомерСтроки;
		
		Область.Параметры.Код = ПредставлениеКодТов(Item, Параметры.ВыводитьНаименованиеТовараСКодами);				
		
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_УПД_УКД(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		Область.Параметры.КодВТ = СтрокаИлиДефис(Item.ItemTypeCode);
		
		Область.Параметры.ЕдиницаИзмерения = СтрокаЕдиницаИзмерения_970(Item.UnitName);
		
		Если ЗначениеЗаполнено(Item.Unit) Тогда
			ЕдиницаИзмеренияКод = Item.Unit;
		Иначе
			ЕдиницаИзмеренияКод = СтрокаДефис();
		КонецЕсли;
		Область.Параметры.ЕдиницаИзмеренияКод = ЕдиницаИзмеренияКод;
		
		Область.Параметры.Количество = КоличествоСтрокойИлиДефис(Item.Quantity, Параметры.ФорматКоличества);
		Область.Параметры.Цена = СуммаСтрокойИлиДефис(Item.Price, Параметры.ФорматСуммы);
		Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Item.SubtotalWithVatExcluded);
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Item.SubTotal);
		
		Область.Параметры.СтавкаНДС = СтрокаСтавкаНДС(Item.TaxRate);
		Область.Параметры.СуммаНДС = СтрокаСуммаНДС_970(Item.Vat, Item.WithoutVat, Item.TaxRate);
		Область.Параметры.Акциз = СтрокаАкциз_970(Item.Excise);
		
		Строки = СтрокиНомеровДТ_970(Item.CustomDeclarations);
		Область.Параметры.Страна = Строки.Страны;
		Область.Параметры.СтранаКод = Строки.КодыСтран;
		Область.Параметры.НомерТД = Строки.НомераДТ;
		
		ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УПД(Область, Item, Строки.НомераДТ, Параметры);
		
		Таб.Вывести(Область);

		Если КоличествоСтрокСПрослеживаемостью > 1 Тогда
			ЗаполнитьПараметрыПрослеживаемостиСтрок_УПД(Таб, Item, СтрокаДопСведений, НомераКолонок_УПД_534_Прослеж(Параметры), Параметры);
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_УПД_970_ПодвалТаблицы(Таб, Параметры)
	
	Если Параметры.ДатаРедакции >= ДатаРедакции425() Тогда
		
		Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицыЮЛФЛ");
		ПФ_УПД_СФ_970_ПодписьСоставителя425(Область, Параметры);
		
	Иначе
		
		Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
		ПФ_УПД_970_ПодписьСоставителя(Область, Параметры);
		
	КонецЕсли;
	
	ПФ_УПД_СФ_970_ЗаполнитьСуммыИтогоТаблицы(Область, Параметры);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УПД_СФ_970_ЗаполнитьСуммыИтогоТаблицы(Область, Параметры)
	
	Table = Параметры.Content.Table;
	
	Область.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Table.TotalWithVatExcluded);
	
	Если ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Table.Items) Тогда
		Область.Параметры.СуммаВсего = СтрокаДефис();
		Область.Параметры.СуммаНДС	 = СтрокаДефис();
	Иначе
		Область.Параметры.СуммаВсего = СуммаСтрокойИлиДефис(Table.Total);
		Область.Параметры.СуммаНДС	 = ПодвалСуммаНДС_970(Table.Vat, Table.WithoutVat);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_УПД_970_ПодписьСоставителя(Область, Параметры)
	
	Область.Параметры.ПродавецПодписант = Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись = Параметры.ПодписиПродавца.Подпись;
	
КонецПроцедуры

Процедура ПФ_УПД_СФ_970_ПодписьСоставителя425(Область, Параметры)
	
	Подписанты = Параметры.Content.Signers;
	Если Подписанты.Количество() > 0 Тогда
		
		ПодписиПродавца = СтрокиПодписей_970(Подписанты);
		
		ВидыЮрФизЛиц = Перечисление_ВидыЮрФизЛиц();
		
		Seller = ПервыйЭлементКоллекции(Параметры.Content.Sellers);
		
		Если Seller.Type = ВидыЮрФизЛиц.ЮридическоеЛицо
			Или Seller.Type = ВидыЮрФизЛиц.ИностраннаяОрганизация Тогда
			Область.Параметры.ПодписьЮЛ = ПодписиПродавца.Подпись;
			Область.Параметры.ПодписантЮЛ = ПодписиПродавца.ФИО;
		Иначе
			Область.Параметры.ПодписьФЛ = ПодписиПродавца.Подпись;
			Область.Параметры.ПодписантФЛ = ПодписиПродавца.ФИО;
			Область.Параметры.НомерСВ = ПФ_СтрокаНомерСВ_УПД_СФ(Seller.IndividualEntityRegistrationNumber,
				Seller.IndividualEntityRegistrationDate);
		КонецЕсли;
		
	КонецЕсли;
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель =
		"Индивидуальный предприниматель или иное уполномоченное лицо";
	
КонецПроцедуры

Функция ПФ_СтрокаНомерСВ_УПД_СФ(IndividualEntityRegistrationNumber, IndividualEntityRegistrationDate)
	
	ШаблонСтрокиНомерСВ = "ОГРНИП %1, дата регистрации %2";
	
	Результат = Общее_ПодставитьПараметрыВСтроку(
		ШаблонСтрокиНомерСВ,
		IndividualEntityRegistrationNumber,
		ДатаСтрокойИлиДефис(IndividualEntityRegistrationDate)
	);
	
	Возврат Результат;
	
КонецФункции

Процедура ПФ_УПД_970_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	TransferInfo = Content.TransferInfo;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Если TransferInfo.WithoutTransferBase = Истина Тогда
		Область.Параметры.Основания = СтрокаБезДокументаОснования();
	Иначе
		Область.Параметры.Основания = СтрокаДокументыОснованияУПД970(TransferInfo.TransferBases);
	КонецЕсли;
	
	Область.Параметры.ПродавецСоставитель  = Content.DocumentCreator;
	Область.Параметры.ПродавецИныеСведения = Параметры.ДопСведения.top;
	Область.Параметры.СведенияОТранспортировкеИГрузе = TransferInfo.TransferTextInfo;
	
	Работник = РаботникИлиИноеЛицо(TransferInfo);
	Если Работник <> Неопределено Тогда
		Область.Параметры.ПродавецРаботник			= СтрокаФИО(Работник);
		Область.Параметры.ПродавецРаботникДолжность = Работник.EmployeePosition;
	КонецЕсли;
	
	Область.Параметры.ПродавецПодписант = Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись 	= Параметры.ПодписиПродавца.Подпись;
	Область.Параметры.ПродавецДолжность = Параметры.ПодписиПродавца.Должность;
	
	Если ЗначениеЗаполнено(TransferInfo.TransferDate) Тогда
		ДатаОтпуска = TransferInfo.TransferDate;
	Иначе
		ДатаОтпуска = Content.DocumentDate;
	КонецЕсли;
	Область.Параметры.ДатаОтпуска = Формат(ДатаОтпуска, "ДФ='dd MMMM yyyy ""года""'");
	
	// Титул покупателя
	Если Параметры.Свойство("BuyerContent")
		И Параметры.BuyerContent <> Неопределено Тогда
		
		BuyerContent = Параметры.BuyerContent;
		
		Если ЗначениеЗаполнено(BuyerContent.AcceptanceDate) Тогда
			ДатаПолучения = BuyerContent.AcceptanceDate;
		ИначеЕсли ЗначениеЗаполнено(Content.TransferInfo.TransferDate) Тогда
			ДатаПолучения = Content.TransferInfo.TransferDate;
		Иначе
			ДатаПолучения = Content.DocumentDate;
		КонецЕсли;
		
		Область.Параметры.ДатаПолучения	= Формат(ДатаПолучения, "ДФ='dd MMMM yyyy ""года""'");
		Область.Параметры.ПокупательСоставитель = BuyerContent.DocumentCreator;
		Область.Параметры.РезультатыПриемки	= СтрокаСодержаниеОперации_970(BuyerContent);
		
		Работник = РаботникИлиИноеЛицо(BuyerContent);
		Если Работник <> Неопределено Тогда
			Область.Параметры.ПокупательРаботник = СтрокаФИО(Работник);
			Область.Параметры.ПокупательРаботникДолжность = Работник.EmployeePosition;
		КонецЕсли;
		
		ПодписиBuyer = СтрокиПодписей_970(BuyerContent.Signers);
		Область.Параметры.ПокупательПодписант = ПодписиBuyer.ФИО;
		Область.Параметры.ПокупательПодпись   = ПодписиBuyer.Подпись;
		Область.Параметры.ПокупательДолжность = ПодписиBuyer.Должность;
		
		ЕстьИнфПолФХЖ4 = ЕстьРеквизитИлиСвойствоОбъектаЛокальная(BuyerContent.AdditionalInfoId, "StructedAdditionalInfos");
		Если ЕстьИнфПолФХЖ4 Тогда
			
			МассивИнфПолФХЖ4 = BuyerContent.AdditionalInfoId.StructedAdditionalInfos;
			Если ЗначениеЗаполнено(МассивИнфПолФХЖ4) Тогда
				СтрокаИнфПолФХЖ4 = ДопСведенияСтрокой(МассивИнфПолФХЖ4);
			    Область.Параметры.ПокупательИныеСведения = СтрокаИнфПолФХЖ4;
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	МассивИнфПолФХЖ3 = TransferInfo.AdditionalInfoId.StructedAdditionalInfos;
	
	Если ЗначениеЗаполнено(МассивИнфПолФХЖ3) Тогда
		
		ИнфПолФХЖ3 = ДопСведенияСтрокой(МассивИнфПолФХЖ3);
		
		Область.Параметры.ИнфПолФХЖ3 = ИнфПолФХЖ3;
		
	Иначе
		Область.УдалитьОбласть(Область.Область("ИнфПолФХЖ3"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры

Функция ПФ_УКД(Параметры)
	
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.Date, Параметры.Content.RevisionDate));
	Параметры.Вставить("ПодписиПродавца", СтрокиПодписей(Параметры.Content.Signers));
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		Параметры.Вставить("Макет", ПолучитьМакет("УКД_534"));
	Иначе
		Параметры.Вставить("Макет", ПолучитьМакет("УКД"));
	КонецЕсли;
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Если Параметры.ДатаРедакции < ДатаРедакции981() Тогда
		Параметры.Макет.УдалитьОбласть(Параметры.Макет.Область("КодВидаТовара"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Таб = НовыйТабличныйДокумент("DD_УКД_" + Параметры.ДатаРедакции);
	
	ПФ_УКД_ШапкаДокумента(Таб, Параметры);
	ПФ_УКД_ШапкаТаблицы(Таб, Параметры);
	ПФ_УКД_СтрокиТаблицы(Таб, Параметры);
	
	ПФ_УКД_ПодвалТаблицы(Таб, Параметры);
	ПФ_УКД_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_УКД_ШапкаДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	БазоваяФункция = ProtoFunctionType(Content.Function);
	Если БазоваяФункция <> ПротофункцияBasic() Тогда
		Область.Параметры.Постановление = СтрокаПостановлениеУПД_УКД(Истина);
		Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	КонецЕсли;
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата	= Дата_В_Формат(Content.Date, "ДФ=dd.MM.yyyy; ДП=-");
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	
	Область.Параметры.Продавец		   = Content.Seller.Name;
	Область.Параметры.ПродавецАдрес	   = СтрокаАдрес(Content.Seller.Address);
	Область.Параметры.ПродавецИНН	   = СтрокаИННКПП(Content.Seller);
	
	ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Seller);
	Если ПродавецБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПродавецБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПродавецБанковскиеРеквизиты = ПродавецБанковскиеРеквизиты;
	КонецЕсли;
	
	ПродавецКонтакты = СтрокаТелефонЭлПочта(Content.Seller);
	Если ЗначениеЗаполнено(ПродавецКонтакты) Тогда
		Область.Параметры.ПродавецКонтакты = ПродавецКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПродавецКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Область.Параметры.Покупатель		 = Content.Buyer.Name;
	Область.Параметры.ПокупательАдрес	 = СтрокаАдрес(Content.Buyer.Address);
	Область.Параметры.ПокупательИНН		 = СтрокаИННКПП(Content.Buyer);
	
	ПокупательБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Buyer);
	Если ПокупательБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПокупательБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПокупательБанковскиеРеквизиты = ПокупательБанковскиеРеквизиты;
	КонецЕсли;
	
	ПокупательКонтакты = СтрокаТелефонЭлПочта(Content.Buyer);
	Если ЗначениеЗаполнено(ПокупательКонтакты) Тогда
		Область.Параметры.ПокупательКонтакты = ПокупательКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПокупательКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Область.Параметры.Валюта		 = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.СтатусУКД		 = СтрокаСтатусУКД(Content.Function);
	Область.Параметры.СчетаФактуры	 = СтрокаСтрокаСчетаФактурыУКД(Content.Invoices);
	
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции, Истина);
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_УКД_ШапкаТаблицы(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
КонецПроцедуры

Процедура ПФ_УКД_СтрокиТаблицы(Таб, Параметры)
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		НомераКолонокДляПодстрок = НомераКолонок_УКД_534_Прослеж(Параметры, Истина);
		НомераКолонок = НомераКолонок_УКД_534_Прослеж(Параметры);
		НомерКолонкиКодВидаТовара = НомерКолонки_УКД_534_Прослеж_КодВидаТовара();
	Иначе
		НомераКолонокДляПодстрок = НомераКолонок_УКД();
		НомераКолонок = НомераКолонок_УКД();
		НомерКолонкиКодВидаТовара = НомерКолонки_УКД_КодВидаТовара();
	КонецЕсли;
	
	НомерСтроки = 0;
	ДатаДокумента = Параметры.ДатаРедакции;
	
	Для каждого Item Из Параметры.Content.InvoiceCorrectionTable.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		НомерПервойСтроки = Таб.ВысотаТаблицы + 1;
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаА");
		
		Если ДатаДокумента >= ДатаРедакции981() Тогда
			Область.Параметры.КодВТ = СтрокаДефис();
		КонецЕсли;
		
		ПФ_КСФУКД_ЗаполнитьНомерСтрокиТаблицы(
			Область,
			Item,
			ДатаДокумента,
			НомерСтроки
		);
		
		Область.Параметры.Код		   = СтрокаДефис();
		Область.Параметры.Наименование = СтрокаИлиДефис(Item.Product);
		
		ПФ_УКД_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаБ");
		ПФ_УКД_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры, "После");
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаВ");
		ПФ_УКД_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаГ");
		ПФ_УКД_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, Параметры, "Уменьшение");
		
		ПФ_СтрокаДопСведений_КСФ_УКД(Таб, Item, НомерПервойСтроки, НомераКолонок, НомерКолонкиКодВидаТовара, Параметры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_УКД_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры, Суффикс = "До")
	
	InvoiceItemFields = ?(Суффикс = "До", Item.OriginalValues, Item.CorrectedValues);
	
	Область.Параметры["ЕдиницаИзмеренияКод" + Суффикс] = СтрокаИлиДефис(InvoiceItemFields.UnitCode);
	Область.Параметры["ЕдиницаИзмерения" + Суффикс] = СтрокаИлиДефис(НаименованиеЕдиницыИзмерения(InvoiceItemFields.UnitCode));
	Область.Параметры["Количество" + Суффикс] = КоличествоСтрокойИлиДефис(InvoiceItemFields.Quantity, Параметры.ФорматКоличества);
	Область.Параметры["Цена" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.Price, Параметры.ФорматСуммы);
	Область.Параметры["СуммаБезНДС" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.TotalWithVatExcluded);
	Область.Параметры["Акциз" + Суффикс] = СтрокаАкциз(InvoiceItemFields.Excise, InvoiceItemFields.TaxRate);
	Область.Параметры["СтавкаНДС" + Суффикс] = СтрокаСтавкаНДС(InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаНДС" + Суффикс] = СтрокаСуммаНДС(InvoiceItemFields.Vat, InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаВсего" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.Total);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УКД(Область, Item, СтрокаДефис(), Параметры);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УКД_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, Параметры, Суффикс = "Увеличение")
	
	AmountsDiff = ?(Суффикс = "Увеличение", Item.AmountsInc, Item.AmountsDec);
	
	Область.Параметры["СуммаБезНДС" + Суффикс] = СуммаСтрокойИлиДефис(AmountsDiff.TotalWithVatExcluded);
	Область.Параметры["СуммаНДС" + Суффикс] = СтрокаРазнСумНал(AmountsDiff.Vat, Item.CorrectedValues.TaxRate);
	Область.Параметры["СуммаВсего" + Суффикс] = СтрокаСтоим(AmountsDiff.Total, Item.CorrectedValues.TaxRate);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УКД(Область, Item, СтрокаХ(), Параметры);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УКД_ПодвалТаблицы(Таб, Параметры)
	
	Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	Область.Параметры.СуммаБезНДСУвеличение = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded);
	Область.Параметры.СуммаБезНДСУменьшение = СуммаСтрокойИлиДефис(Параметры.Content.InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded);
	
	ВоВсехСтрокахСтавкаНДСИсчНалАг = ВсеСтрокиУКДСодержатСтавкуНДС_ИсчНалАг(Параметры.Content.InvoiceCorrectionTable.Items);
	
	ЕстьСтавкаНДС = ЕстьСтрокиСПрямымиСтавкамиНДС736(Параметры.Content);
	
	ЭтоУвеличение = Привести_К_Числу(Параметры.Content.InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded) >= Привести_К_Числу(Параметры.Content.InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded);
	
	УвеличениеУменьшение = ВСтрокахУКДЕстьУвеличениеУменьшение(Параметры.Content.InvoiceCorrectionTable.Items);
	
	Область.Параметры.СуммаНДСУвеличение = СтрокаСумНДСУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsInc.Vat, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЕстьСтавкаНДС, Не УвеличениеУменьшение.ЕстьУвеличение);
	Область.Параметры.СуммаНДСУменьшение = СтрокаСумНДСУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsDec.Vat, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЕстьСтавкаНДС, Не УвеличениеУменьшение.ЕстьУменьшение);
	
	Область.Параметры.СуммаВсегоУвеличение = СтрокаВсегоУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsInc.Total, ВоВсехСтрокахСтавкаНДСИсчНалАг, Не ЭтоУвеличение);
	Область.Параметры.СуммаВсегоУменьшение = СтрокаВсегоУвелУм(Параметры.Content.InvoiceCorrectionTable.TotalsDec.Total, ВоВсехСтрокахСтавкаНДСИсчНалАг, ЭтоУвеличение);
	
	Область.Параметры.ПродавецПодписант	= Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись	= Параметры.ПодписиПродавца.Подпись;
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УКД_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.ПродавецПодписант	= Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись	= Параметры.ПодписиПродавца.Подпись;
	Область.Параметры.ПродавецДолжность = Параметры.ПодписиПродавца.Должность;
	
	Область.Параметры.ИныеСведения		 	 = Content.EventContent.CostChangeInfo;
	Область.Параметры.ПередаточныеДокументы  = Content.EventContent.TransferDocDetails;
	Область.Параметры.ОснованияКорректировки = СтрокаОснованияКорректировки(Content.EventContent.CorrectionBases);
	
	Область.Параметры.ПродавецСоставитель	  	 = Content.Creator;
	Область.Параметры.ПродавецСодержаниеОперации = Content.EventContent.OperationContent;
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) Тогда
		
		Область.Параметры.ПокупательСоставитель		   = Параметры.BuyerContent.Creator;
		Область.Параметры.ПокупательСодержаниеОперации = Параметры.BuyerContent.OperationContent;
		
		ПодписиBuyer = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ПокупательПодписант = ПодписиBuyer.ФИО;
		Область.Параметры.ПокупательПодпись	  = ПодписиBuyer.Подпись;
		Область.Параметры.ПокупательДолжность = ПодписиBuyer.Должность;
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры

Функция ЭтоИзвестнаяФункцияУКД(ЗначениеФункции)
	
	ВозможныеЗначения = Новый Массив;
	ВозможныеЗначения.Добавить(ФункцияКСЧФДИС());
	ВозможныеЗначения.Добавить(ФункцияКСЧФ());
	ВозможныеЗначения.Добавить(ФункцияДИС());
	ВозможныеЗначения.Добавить(ПротофункцияInvoiceAndBasic());
	ВозможныеЗначения.Добавить(ПротофункцияInvoice());
	ВозможныеЗначения.Добавить(ПротофункцияBasic());
	
	Результат = (ВозможныеЗначения.Найти(ЗначениеФункции) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПФ_УКД_736(Параметры)
	
	ЗначениеФункции = Параметры.Content.Function;
	
	Если Не ЭтоИзвестнаяФункцияУКД(ЗначениеФункции) Тогда
		
		Если ЕстьСведенияОИсправлении(Параметры.Content) Тогда
			ТипДокумента = ТипУниверсальныйКорректировочныйДокументИсправление();
		Иначе
			ТипДокумента = ТипУниверсальныйКорректировочныйДокумент();
		КонецЕсли;
		ТипКонтента = КонтентИнформацияПродавца736();
		Таб = ПечатнаяФормаЗаглушка(ТипДокумента, ТипКонтента, ЗначениеФункции);
		
		Возврат Таб;
		
	КонецЕсли;
	
	Параметры.Вставить("ДатаРедакции", ДатаРедакцииСФ(Параметры.Content.Date, Параметры.Content.RevisionDate));
	Параметры.Вставить("ПодписиПродавца", СтрокиПодписей(Параметры.Content.Signers));
	Параметры.Вставить("ЕстьСведенияОПрослеживаемости", ЕстьСведенияОПрослеживаемости736(Параметры.Content));
	
	Если Параметры.ДатаРедакции = ДатаРедакции1096()
		ИЛИ Параметры.ДатаРедакции = ДатаРедакции425() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("УКД_1096_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("УКД_534"));	
		КонецЕсли;
		
	ИначеЕсли Параметры.ДатаРедакции = ДатаРедакции534() Тогда
		
		Если Параметры.ЕстьСведенияОПрослеживаемости Тогда
			Параметры.Вставить("Макет", ПолучитьМакет("УКД_534_Прослеж"));	
		Иначе
			Параметры.Вставить("Макет", ПолучитьМакет("УКД_534"));	
		КонецЕсли;
		
	Иначе
		Параметры.Вставить("Макет", ПолучитьМакет("УКД"));	
		
	КонецЕсли;
	
	ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, Параметры.Content.AdditionalInfoId.StructedAdditionalInfos);
	
	Таб = НовыйТабличныйДокумент("DD_УКД_" + Параметры.ДатаРедакции);
	
	ПФ_УКД_736_ШапкаДокумента(Таб, Параметры);
	ПФ_УКД_736_ШапкаТаблицы(Таб, Параметры);
	ПФ_УКД_736_СтрокиТаблицы(Таб, Параметры);
	
	ПФ_УКД_736_ПодвалТаблицы(Таб, Параметры);
	ПФ_УКД_736_ПодвалДокумента(Таб, Параметры);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;	
КонецФункции

Процедура ПФ_УКД_736_ШапкаДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.head);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Шапка");
	
	БазоваяФункция = ProtoFunctionType(Content.Function);
	Если БазоваяФункция <> ПротофункцияBasic() Тогда
		Область.Параметры.Постановление = СтрокаПостановлениеУПД_УКД(Истина);
		Область.Параметры.Редакция = СтрокаРедакцииУПД(Параметры.ДатаРедакции);
	КонецЕсли;
	
	Область.Параметры.Номер = Content.Number;
	Область.Параметры.Дата	= Дата_В_Формат(Content.Date, "ДФ=dd.MM.yyyy; ДП=-");
	
	Область.Параметры.НомерИсправления = СтрокаИлиДефис(Content.RevisionNumber);
	Область.Параметры.ДатаИсправления  = ДатаСтрокойИлиДефис(Content.RevisionDate);
	
	Область.Параметры.Продавец		   = Content.Seller.Name;
	Область.Параметры.ПродавецАдрес	   = СтрокаАдрес_736(Content.Seller.Address);
	Область.Параметры.ПродавецИНН	   = СтрокаИННКПП(Content.Seller);
	
	ПродавецБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Seller);
	Если ПродавецБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПродавецБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПродавецБанковскиеРеквизиты = ПродавецБанковскиеРеквизиты;
	КонецЕсли;
	
	ПродавецКонтакты = СтрокаТелефонЭлПочта(Content.Seller);
	Если ЗначениеЗаполнено(ПродавецКонтакты) Тогда
		Область.Параметры.ПродавецКонтакты = ПродавецКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПродавецКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Область.Параметры.Покупатель		 = Content.Buyer.Name;
	Область.Параметры.ПокупательАдрес	 = СтрокаАдрес_736(Content.Buyer.Address);
	Область.Параметры.ПокупательИНН		 = СтрокаИННКПП(Content.Buyer);
	
	ПокупательБанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(Content.Buyer);
	Если ПокупательБанковскиеРеквизиты = СтрокаДефис() Тогда
		Область.УдалитьОбласть(Область.Область("ПокупательБанковскиеРеквизиты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	Иначе
		Область.Параметры.ПокупательБанковскиеРеквизиты = ПокупательБанковскиеРеквизиты;
	КонецЕсли;
	
	ПокупательКонтакты = СтрокаТелефонЭлПочта(Content.Buyer);
	Если ЗначениеЗаполнено(ПокупательКонтакты) Тогда
		Область.Параметры.ПокупательКонтакты = ПокупательКонтакты;
	Иначе
		Область.УдалитьОбласть(Область.Область("ПокупательКонтакты"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Область.Параметры.Валюта		 = СтрокаВалютаКод(Content.Currency);
	Область.Параметры.СтатусУКД		 = СтрокаСтатусУКД(Content.Function);
	Область.Параметры.СчетаФактуры	 = СтрокаСтрокаСчетаФактурыУКД(Content.Invoices);
	
	Область.Параметры.ИдентификаторГосконтракта			 = Content.GovernmentContractInfo;
	Область.Параметры.НадписьИдентификаторГосконтракта	 = НадписьИдентификаторГосконтракта(Параметры.ДатаРедакции, Истина);
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ШапкаДопСведения", Параметры.ДопСведения.top);
	
КонецПроцедуры

Процедура ПФ_УКД_736_ШапкаТаблицы(Таб, Параметры)
	
	Таб.Вывести(Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
КонецПроцедуры

Процедура ПФ_УКД_736_СтрокиТаблицы(Таб, Параметры)
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		НомераКолонокДляПодстрок = НомераКолонок_УКД_534_Прослеж(Параметры, Истина);
		НомераКолонок = НомераКолонок_УКД_534_Прослеж(Параметры);
		НомерКолонкиКодВидаТовара = НомерКолонки_УКД_534_Прослеж_КодВидаТовара();
	Иначе
		НомераКолонокДляПодстрок = НомераКолонок_УКД_534(Параметры, Истина);
		НомераКолонок = НомераКолонок_УКД_534(Параметры);
		НомерКолонкиКодВидаТовара = НомерКолонки_УКД_534_КодВидаТовара();
	КонецЕсли;
	
	НомерСтроки = 0;
	ДатаДокумента = Параметры.ДатаРедакции;
	
	Для каждого Item Из Параметры.Content.InvoiceCorrectionTable.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		НомерПервойСтроки = Таб.ВысотаТаблицы + 1;
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаА");
		
		Область.Параметры.КодВТ = СтрокаИлиДефис(Item.ItemTypeCode);
		
		ПФ_КСФУКД_ЗаполнитьНомерСтрокиТаблицы(
			Область,
			Item,
			ДатаДокумента,
			НомерСтроки
		);
		
		Область.Параметры.Код = ПредставлениеКодТов(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		Область.Параметры.Наименование = ПредставлениеНоменклатуры_УПД_УКД(Item, Параметры.ВыводитьНаименованиеТовараСКодами);
		
		ПФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаБ");
		ПФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры, "После");
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаВ");
		ПФ_УКД_736_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, НомераКолонокДляПодстрок, Параметры);
		
		Область = Параметры.Макет.ПолучитьОбласть("СтрокаГ");
		ПФ_УКД_736_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, НомераКолонокДляПодстрок, Параметры, "Уменьшение");
		
		ПФ_СтрокаДопСведений_КСФ_УКД(Таб, Item, НомерПервойСтроки, НомераКолонок, НомерКолонкиКодВидаТовара, Параметры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_УКД_736_СтрокаТаблицыДоПосле(Таб, Область, Item, Параметры, Суффикс = "До")
	
	InvoiceItemFields = ?(Суффикс = "До", Item.OriginalValues, Item.CorrectedValues);
	КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
	
	Область.Параметры["ЕдиницаИзмеренияКод" + Суффикс] = СтрокаИлиДефис(InvoiceItemFields.UnitCode);
	Область.Параметры["ЕдиницаИзмерения" + Суффикс] = СтрокаИлиДефис(InvoiceItemFields.UnitName);
	Область.Параметры["Количество" + Суффикс] = КоличествоСтрокойИлиДефис(InvoiceItemFields.Quantity, Параметры.ФорматКоличества);
	Область.Параметры["Цена" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.Price, Параметры.ФорматСуммы);
	Область.Параметры["СуммаБезНДС" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.TotalWithVatExcluded);
	Область.Параметры["Акциз" + Суффикс] = СтрокаАкциз(InvoiceItemFields.Excise, InvoiceItemFields.TaxRate);
	Область.Параметры["СтавкаНДС" + Суффикс] = СтрокаСтавкаНДС(InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаНДС" + Суффикс] = СтрокаСуммаНДС_736(InvoiceItemFields.Vat, InvoiceItemFields.WithoutVat, InvoiceItemFields.TaxRate);
	Область.Параметры["СуммаВсего" + Суффикс] = СуммаСтрокойИлиДефис(InvoiceItemFields.Total);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		ЗаполнитьПараметрыСтраныПроисхождения_УКД(Область, Item);
		
		Если КоличествоСтрокСПрослеживаемостью > 0 Тогда
			ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УКД(Область, Item, СтрокаДефис(), Параметры);
		КонецЕсли;
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() И КоличествоСтрокСПрослеживаемостью > 1 Тогда
		ИмяОбласти = ?(Суффикс = "До", "СтрокаА", "СтрокаБ");
		ЗаполнитьПараметрыПрослеживаемостиСтрок_УКД(Таб, ИмяОбласти, Item, НомераКолонок_УКД_534_Прослеж(Параметры, Истина), Параметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_УКД_736_СтрокаТаблицыУвеличениеУменьшение(Таб, Область, Item, НомераКолонок, Параметры, Суффикс = "Увеличение")
	
	AmountsDiff = ?(Суффикс = "Увеличение", Item.AmountsInc, Item.AmountsDec);
	
	Область.Параметры["СуммаБезНДС" + Суффикс] = СуммаСтрокойИлиДефис(AmountsDiff.TotalWithVatExcluded);
	Область.Параметры["СуммаНДС" + Суффикс] = СтрокаРазнСумНал(AmountsDiff.Vat, Item.CorrectedValues.TaxRate);
	Область.Параметры["СуммаВсего" + Суффикс] = СтрокаСтоим(AmountsDiff.Total, Item.CorrectedValues.TaxRate);
	
	ПараметрыАкциз = Новый Структура;
	ПараметрыАкциз.Вставить("Акциз" + Суффикс, СуммаСтрокойИлиДефис(AmountsDiff.Excise));
	Область.Параметры.Заполнить(ПараметрыАкциз);
	
	Если Параметры.ДатаРедакции >= ДатаРедакции534() Тогда
		ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УКД(Область, Item, СтрокаХ(), Параметры);
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
	Если Параметры.ДатаРедакции >= ДатаРедакции534() И КоличествоСтрокСПрослеживаемостью > 1 Тогда
		ИмяОбласти = ?(Суффикс = "Увеличение", "СтрокаВ", "СтрокаГ");
		ЗаполнитьПараметрыПрослеживаемостиСтрок_УКД(Таб, ИмяОбласти, Item, НомераКолонок, Параметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_УКД_736_ПодвалТаблицы(Таб, Параметры)
	
	Если Параметры.ДатаРедакции >= ДатаРедакции425() Тогда
		
		Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицыЮЛФЛ");
		ПФ_УКД_736_ПодписьСоставителя425(Область, Параметры);
		
	Иначе
		
		Область = Параметры.Макет.ПолучитьОбласть("ПодвалТаблицы");
		ПФ_УКД_736_ПодписьСоставителя(Область, Параметры);
		
	КонецЕсли;
	
	ПФ_УКД_736_ЗаполнитьСуммыИтогоТаблицы(Область, Параметры);
	
	Таб.Вывести(Область);
	
КонецПроцедуры

Процедура ПФ_УКД_736_ПодписьСоставителя425(Область, Параметры)
	
	ПодписиПродавца = Параметры.ПодписиПродавца;
	ВидыЮрФизЛиц = Перечисление_ВидыЮрФизЛиц();
	Seller = Параметры.Content.Seller;
	
	Если Seller.Type = ВидыЮрФизЛиц.ЮридическоеЛицо
		Или Seller.Type = ВидыЮрФизЛиц.ИностраннаяОрганизация Тогда
		
		Область.Параметры.ПодписьЮЛ = ПодписиПродавца.Подпись;
		Область.Параметры.ПодписантЮЛ = ПодписиПродавца.ФИО;
		
	Иначе
		
		Область.Параметры.ПодписьФЛ = ПодписиПродавца.Подпись;
		Область.Параметры.ПодписантФЛ = ПодписиПродавца.ФИО;
		Область.Параметры.НомерСВ = СтрокаНомерСВ425(Seller.IndividualEntityRegistrationCertificate);
		
	КонецЕсли;
	
	Область.Параметры.НадписьИндивидуальныйПредприниматель =
		"Индивидуальный предприниматель или иное уполномоченное лицо";
	
КонецПроцедуры

Процедура ПФ_УКД_736_ПодписьСоставителя(Область, Параметры)
	
	Область.Параметры.ПродавецПодписант = Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись = Параметры.ПодписиПродавца.Подпись;
	
КонецПроцедуры

Процедура ПФ_УКД_736_ЗаполнитьСуммыИтогоТаблицы(Область, Параметры)
	
	TotalsInc = Параметры.Content.InvoiceCorrectionTable.TotalsInc;
	TotalsDec = Параметры.Content.InvoiceCorrectionTable.TotalsDec;
	
	Область.Параметры.СуммаБезНДСУвеличение = СуммаСтрокойИлиДефис(TotalsInc.TotalWithVatExcluded);
	Область.Параметры.СуммаБезНДСУменьшение = СуммаСтрокойИлиДефис(TotalsDec.TotalWithVatExcluded);
	
	ВоВсехСтрокахСтавкаНДСИсчНалАг = ВсеСтрокиУКДСодержатСтавкуНДС_ИсчНалАг(
		Параметры.Content.InvoiceCorrectionTable.Items
	);
	
	ЕстьСтавкаНДС = ЕстьСтрокиСПрямымиСтавкамиНДС736(Параметры.Content);
	ЭтоУвеличение = Привести_К_Числу(TotalsInc.TotalWithVatExcluded) >= Привести_К_Числу(TotalsDec.TotalWithVatExcluded);
	УвеличениеУменьшение = ВСтрокахУКДЕстьУвеличениеУменьшение(Параметры.Content.InvoiceCorrectionTable.Items);
	
	Область.Параметры.СуммаНДСУвеличение = СтрокаСумНДСУвелУм(
		TotalsInc.Vat,
		ВоВсехСтрокахСтавкаНДСИсчНалАг,
		ЕстьСтавкаНДС И Не ЭтоИстина(TotalsInc.WithoutVat),
		Не УвеличениеУменьшение.ЕстьУвеличение
	);
	Область.Параметры.СуммаНДСУменьшение = СтрокаСумНДСУвелУм(
		TotalsDec.Vat,
		ВоВсехСтрокахСтавкаНДСИсчНалАг,
		ЕстьСтавкаНДС И Не ЭтоИстина(TotalsDec.WithoutVat),
		Не УвеличениеУменьшение.ЕстьУменьшение
	);
	Область.Параметры.СуммаВсегоУвеличение = СтрокаВсегоУвелУм(
		TotalsInc.Total,
		ВоВсехСтрокахСтавкаНДСИсчНалАг,
		Не ЭтоУвеличение
	);
	Область.Параметры.СуммаВсегоУменьшение = СтрокаВсегоУвелУм(
		TotalsDec.Total,
		ВоВсехСтрокахСтавкаНДСИсчНалАг,
		ЭтоУвеличение
	);
	
КонецПроцедуры

Процедура ПФ_УКД_736_ПодвалДокумента(Таб, Параметры)
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.bottom);
	
	Content = Параметры.Content;
	
	Область = Параметры.Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.ПродавецПодписант	= Параметры.ПодписиПродавца.ФИО;
	Область.Параметры.ПродавецПодпись	= Параметры.ПодписиПродавца.Подпись;
	Область.Параметры.ПродавецДолжность = Параметры.ПодписиПродавца.Должность;
	
	Область.Параметры.ИныеСведения		 	 = Content.EventContent.CostChangeInfo;
	Область.Параметры.ПередаточныеДокументы  = СтрокаПередаточныеДокументы_736(Content.EventContent.TransferDocDetails736);
	Область.Параметры.ОснованияКорректировки = СтрокаОснованияКорректировки_736(Content.EventContent.CorrectionBases);
	
	Область.Параметры.ПродавецСоставитель	  	 = Content.Creator;
	Область.Параметры.ПродавецСодержаниеОперации = Content.EventContent.OperationContent;
	
	// Титул покупателя
	Если ЗначениеЗаполнено(Параметры.BuyerContent) Тогда
		
		Область.Параметры.ПокупательСоставитель		   = Параметры.BuyerContent.Creator;
		Область.Параметры.ПокупательСодержаниеОперации = Параметры.BuyerContent.OperationContent;
		
		ПодписиBuyer = СтрокиПодписей(Параметры.BuyerContent.Signers);
		Область.Параметры.ПокупательПодписант = ПодписиBuyer.ФИО;
		Область.Параметры.ПокупательПодпись	  = ПодписиBuyer.Подпись;
		Область.Параметры.ПокупательДолжность = ПодписиBuyer.Должность;
		
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	ДобавитьДопСведения(Таб, Параметры.Макет, "ДопСведения", Параметры.ДопСведения.ground);
	
КонецПроцедуры

Процедура ПФ_КСФУКД_ЗаполнитьНомерСтрокиТаблицы(Область, Item, ДатаДокумента, НомерПоПорядку)
	
	ЗначенияПараметров = Новый Структура;
	ЗначенияПараметров.Вставить("НомерСтроки", НомерПоПорядку);
	
	Если ДатаДокумента >= ДатаРедакции534() Тогда
		ЗначенияПараметров.НомерСтроки = Item.OriginalNumber;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Область.Параметры, ЗначенияПараметров);
	
КонецПроцедуры


Функция ПФ_АктСверки_405(Параметры)
	
	Таб = НовыйТабличныйДокумент("DD_АктСверки", ОриентацияСтраницы.Портрет);
	
	SenderContent = Параметры.Content;
	RecipientContent = Параметры.BuyerContent;
	SignDisagreement = СвойствоСтруктуры(RecipientContent, "SignDisagreement", "WithoutDisagreements");
	ЕстьРазногласия = НРег(SignDisagreement) = НРег("WithDisagreements");
	
	Если ЕстьРазногласия Тогда
		Макет = ПолучитьМакет("АктСверки_405_СРазногласиями");
	Иначе
		Макет = ПолучитьМакет("АктСверки_405_БезРазногласий");
	КонецЕсли;
	
	Параметры.Вставить("Макет", Макет);
	
	ПФ_АктСверки405_ШапкаДокумента(Таб, Макет, SenderContent);
	
	Если ЕстьРазногласия Тогда
		
		ПФ_АктСверки405_ТаблицаДокумента_СРазногласиями_ДанныеПолучателя(Таб, Макет, RecipientContent, SenderContent);
		
		Таб.Вывести(Макет.ПолучитьОбласть("Разделитель"));
		
		ПФ_АктСверки405_ТаблицаДокумента_СРазногласиями_ДанныеОтправителя(Таб, Макет, SenderContent);
		
	Иначе
		
		ПФ_АктСверки405_ТаблицаДокумента_БезРазногласий(Таб, Макет, SenderContent, RecipientContent);
		
	КонецЕсли;
	
	ПФ_АктСверки405_ПодписиДокумента(Таб, Макет, SenderContent, RecipientContent);
	
	ДобавитьШтамп(Таб, Параметры.ДанныеШтампа);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_АктСверки405_ШапкаДокумента(Таб, Макет, Content)
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	Отправитель = Content.ReconciliationAct.AdditionalInfoReconciliationAct.Sender;
	Получатель = Content.ReconciliationAct.AdditionalInfoReconciliationAct.Recipient;
	
	Шапка.Параметры.НомерДокумента = Content.ActNumber;
	Шапка.Параметры.ДатаНачПер = ДатаСтрокойИлиДефис(Content.ReconcilationDateFrom);
	Шапка.Параметры.ДатаОкПер = ДатаСтрокойИлиДефис(Content.ReconcilationDateTo);
	
	Шапка.Параметры.ДанныеОтправителя = АктСверки405_ПредставлениеСтороны(Отправитель);
	Шапка.Параметры.ДанныеПолучателя = АктСверки405_ПредставлениеСтороны(Получатель);
	
	Таб.Вывести(Шапка);
	
КонецПроцедуры


Процедура ПФ_АктСверки405_ТаблицаДокумента_СРазногласиями_ДанныеПолучателя(Таб, Макет, RecipientContent, SenderContent)
	
	SenderReconciliationAct = SenderContent.ReconciliationAct;
	
	ДанныеПолучателя = SenderReconciliationAct.AdditionalInfoReconciliationAct.Recipient.Name;
	Валюта = SenderReconciliationAct.AdditionalInfoReconciliationAct.Currency;
	НачалоПериодаСверки = SenderContent.ReconcilationDateFrom;
	ОкончаниеПериодаСверки = SenderContent.ReconcilationDateTo;
	RecipientReconciliationActTable = RecipientContent.ReconciliationAct.ReconciliationActTable;
	
	ПФ_АктСверки405_ШапкаТаблицы_СРазногласиями(
		Таб,
		Макет,
		ДанныеПолучателя,
		Валюта,
		НачалоПериодаСверки,
		RecipientReconciliationActTable
	);
	
	ContractInfo = RecipientReconciliationActTable.ContractInfo;
	
	Для Каждого Contract Из ContractInfo Цикл
		
		ПФ_АктСверки405_СтрокаДоговора_СРазногласиями(
			Таб,
			Макет,
			Contract,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЦикла;
	
	ПФ_АктСверки405_ПодвалТаблицы(
		Таб,
		Макет,
		RecipientReconciliationActTable,
		ОкончаниеПериодаСверки
	);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ТаблицаДокумента_СРазногласиями_ДанныеОтправителя(Таб, Макет, SenderContent)
	
	SenderReconciliationAct = SenderContent.ReconciliationAct;
	ДанныеОтправителя = SenderReconciliationAct.AdditionalInfoReconciliationAct.Sender.Name;
	Валюта = SenderReconciliationAct.AdditionalInfoReconciliationAct.Currency;
	НачалоПериодаСверки = SenderContent.ReconcilationDateFrom;
	ОкончаниеПериодаСверки = SenderContent.ReconcilationDateTo;
	SenderReconciliationActTable = SenderReconciliationAct.ReconciliationActTable;
	
	ПФ_АктСверки405_ШапкаТаблицы_СРазногласиями(
		Таб,
		Макет,
		ДанныеОтправителя,
		Валюта,
		НачалоПериодаСверки,
		SenderReconciliationActTable
	);
	
	ContractInfo = SenderReconciliationActTable.ContractInfo;
	
	Для Каждого Contract Из ContractInfo Цикл
		
		ПФ_АктСверки405_СтрокаДоговора_СРазногласиями(
			Таб,
			Макет,
			Contract,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЦикла;
	
	ПФ_АктСверки405_ПодвалТаблицы(
		Таб,
		Макет,
		SenderReconciliationActTable,
		ОкончаниеПериодаСверки
	);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ШапкаТаблицы_СРазногласиями(Таб, Макет, ДанныеОрганизации, Валюта, НачалоПериодаСверки, ReconciliationActTable)
	
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ШапкаТаблицы.Параметры.ДанныеОрганизации = ДанныеОрганизации;
	ШапкаТаблицы.Параметры.Валюта = СимвольныйКодВалюты(Валюта);
	ШапкаТаблицы.Параметры.ДатаНачПер = ДатаСтрокойИлиДефис(НачалоПериодаСверки);
	ШапкаТаблицы.Параметры.СальдоНачДеб = ReconciliationActTable.BalanceDebitFrom;
	ШапкаТаблицы.Параметры.СальдоНачКр = ReconciliationActTable.BalanceAmountFrom;
	
	Таб.Вывести(ШапкаТаблицы);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_СтрокаДоговора_СРазногласиями(Таб, Макет, ContractInfo, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	ПФ_АктСверки405_ТаблицаОтправителяШапкаСтрокиДоговора(Таб, Макет, ContractInfo, НачалоПериодаСверки);
	
	DocumentInfo = ContractInfo.DocumentInfo;
	
	Для Каждого Document Из DocumentInfo Цикл
		
		ПФ_АктСверки405_ТаблицаОтправителяСтрокаДокумент(Таб, Макет, Document);
		
	КонецЦикла;
	
	ПФ_АктСверки405_ТаблицаОтправителяПодвалСтрокиДоговора(Таб, Макет, ContractInfo, ОкончаниеПериодаСверки);
	
КонецПроцедуры


Процедура ПФ_АктСверки405_ТаблицаДокумента_БезРазногласий(Таб, Макет, Content, RecipientContent)
	
	НачалоПериодаСверки = Content.ReconcilationDateFrom;
	ОкончаниеПериодаСверки = Content.ReconcilationDateTo;
	
	ReconciliationAct = Content.ReconciliationAct;
	
	ПФ_АктСверки405_ШапкаТаблицы(
		Таб,
		Макет,
		ReconciliationAct,
		НачалоПериодаСверки
	);
	
	ReconciliationActTable = ReconciliationAct.ReconciliationActTable;
	ContractInfo = ReconciliationActTable.ContractInfo;
	
	Для Каждого Contract Из ContractInfo Цикл
		
		ПФ_АктСверки405_ТаблицаОтправителяСтрокаДоговор(
			Таб,
			Макет,
			Contract,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЦикла;
	
	ПФ_АктСверки405_ПодвалТаблицы(
		Таб,
		Макет,
		ReconciliationActTable,
		ОкончаниеПериодаСверки
	);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ШапкаТаблицы(Таб, Макет, Content, НачалоПериодаСверки)
	
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ШапкаТаблицы.Параметры.ДанныеОтправителя = Content.AdditionalInfoReconciliationAct.Sender.Name;
	ШапкаТаблицы.Параметры.ДанныеПолучателя = Content.AdditionalInfoReconciliationAct.Recipient.Name;
	ШапкаТаблицы.Параметры.Валюта = СимвольныйКодВалюты(Content.AdditionalInfoReconciliationAct.Currency);
	ШапкаТаблицы.Параметры.ДатаНачПер = ДатаСтрокойИлиДефис(НачалоПериодаСверки);
	ШапкаТаблицы.Параметры.СальдоНачДеб = Content.ReconciliationActTable.BalanceDebitFrom;
	ШапкаТаблицы.Параметры.СальдоНачКр = Content.ReconciliationActTable.BalanceAmountFrom;
	
	Таб.Вывести(ШапкаТаблицы);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ТаблицаОтправителяСтрокаДоговор(Таб, Макет, ContractInfo, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	ПФ_АктСверки405_ТаблицаОтправителяШапкаСтрокиДоговора(Таб, Макет, ContractInfo, НачалоПериодаСверки);
	
	DocumentInfo = ContractInfo.DocumentInfo;
	
	Для Каждого Document Из DocumentInfo Цикл
		
		ПФ_АктСверки405_ТаблицаОтправителяСтрокаДокумент(Таб, Макет, Document);
		
	КонецЦикла;
	
	ПФ_АктСверки405_ТаблицаОтправителяПодвалСтрокиДоговора(Таб, Макет, ContractInfo, ОкончаниеПериодаСверки);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ПодвалТаблицы(Таб, Макет, ReconciliationActTable, ОкончаниеПериодаСверки)
	
	ИтогоПоТаблице = Макет.ПолучитьОбласть("ИтогоПоТаблице");
	
	ИтогоПоТаблице.Параметры.ОборотДеб = ReconciliationActTable.TurnoverDebit;
	ИтогоПоТаблице.Параметры.ОборотКр = ReconciliationActTable.TurnoverAmount;
	ИтогоПоТаблице.Параметры.СальдоКонДеб = ReconciliationActTable.BalanceDebitEnd;
	ИтогоПоТаблице.Параметры.СальдоКонКр = ReconciliationActTable.BalanceAmountEnd;
	ИтогоПоТаблице.Параметры.ДатаОкПер = ДатаСтрокойИлиДефис(ОкончаниеПериодаСверки);
	ИтогоПоТаблице.Параметры.ИтогоРасхДеб = СвойствоСтруктуры(ReconciliationActTable, "TotalConsumptionDebit", "Х");
	ИтогоПоТаблице.Параметры.ИтогоРасхКр = СвойствоСтруктуры(ReconciliationActTable, "TotalConsumptionAmount", "Х");
	
	Таб.Вывести(ИтогоПоТаблице);
	
КонецПроцедуры


Процедура ПФ_АктСверки405_ТаблицаОтправителяШапкаСтрокиДоговора(Таб, Макет, ContractInfo, НачалоПериодаСверки)
	
	СтрокаДоговор = Макет.ПолучитьОбласть("СтрокаДоговор");
	
	СтрокаДоговор.Параметры.НомДог = ContractInfo.ContractNumber;
	СтрокаДоговор.Параметры.ДатаДог = ДатаСтрокойИлиДефис(ContractInfo.ContractDate);
	СтрокаДоговор.Параметры.ДатаНачПер = ДатаСтрокойИлиДефис(НачалоПериодаСверки);
	СтрокаДоговор.Параметры.СальдоНачДеб = ContractInfo.BalanceDebitFrom;
	СтрокаДоговор.Параметры.СальдоНачКр = ContractInfo.BalanceAmountFrom;
	
	Таб.Вывести(СтрокаДоговор);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ТаблицаОтправителяПодвалСтрокиДоговора(Таб, Макет, ContractInfo, ОкончаниеПериодаСверки)
	
	ИтогоПоДоговору = Макет.ПолучитьОбласть("ИтогоПоДоговору");
	
	ИтогоПоДоговору.Параметры.НомДог = ContractInfo.ContractNumber;
	ИтогоПоДоговору.Параметры.ОборотДеб = ContractInfo.TurnoverDebit;
	ИтогоПоДоговору.Параметры.ОборотКр = ContractInfo.TurnoverAmount;
	ИтогоПоДоговору.Параметры.СальдоКонДеб = ContractInfo.BalanceDebitEnd;
	ИтогоПоДоговору.Параметры.СальдоКонКр = ContractInfo.BalanceAmountEnd;
	ИтогоПоДоговору.Параметры.ДатаОкПер = ДатаСтрокойИлиДефис(ОкончаниеПериодаСверки);
	ИтогоПоДоговору.Параметры.ИтогоРасхДеб = СвойствоСтруктуры(ContractInfo, "TotalConsumptionDebit", "Х");
	ИтогоПоДоговору.Параметры.ИтогоРасхКр = СвойствоСтруктуры(ContractInfo, "TotalConsumptionAmount", "Х");
	
	Таб.Вывести(ИтогоПоДоговору);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ТаблицаОтправителяСтрокаДокумент(Таб, Макет, DocumentInfo)
	
	ПФ_АктСверки405_ТаблицаОтправителяШапкаСтрокиДокумента(Таб, Макет, DocumentInfo);
	
	OperationInfo = DocumentInfo.OperationInfo;
	РасхождениеПоДокументу = СвойствоСтруктуры(DocumentInfo, "TotalConsumption", "Х");
	
	Для Каждого Operation Из OperationInfo Цикл
		
		ПФ_АктСверки405_ТаблицаОтправителяСтрокаОперация(Таб, Макет, Operation);
		
	КонецЦикла;
	
	ПФ_АктСверки405_ТаблицаОтправителяПодвалСтрокиДокумента(Таб, Макет, DocumentInfo);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ТаблицаОтправителяШапкаСтрокиДокумента(Таб, Макет, DocumentInfo)
	
	СтрокаДокумент = Макет.ПолучитьОбласть("СтрокаДокумент");
	
	СтрокаДокумент.Параметры.НомДок = НомерСтрокойИлиБезНомера(DocumentInfo.DocumentNumber);
	СтрокаДокумент.Параметры.ДатаДок = ДатаСтрокойИлиДефис(DocumentInfo.DocumentDate);
	
	Таб.Вывести(СтрокаДокумент);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ТаблицаОтправителяПодвалСтрокиДокумента(Таб, Макет, DocumentInfo)
	
	ИтогоПоДокументу = Макет.ПолучитьОбласть("ИтогоПоДокументу");
	
	ИтогоПоДокументу.Параметры.ИтогоРасх = СвойствоСтруктуры(DocumentInfo, "TotalConsumption", "Х");
	
	Таб.Вывести(ИтогоПоДокументу);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ТаблицаОтправителяСтрокаОперация(Таб, Макет, OperationInfo)
	
	СтрокаОперация = Макет.ПолучитьОбласть("СтрокаОперация");
	
	СтрокаОперация.Параметры.ДатаОпер = OperationInfo.OperationDate;
	СтрокаОперация.Параметры.НаимОпер = OperationInfo.OperationName;
	СтрокаОперация.Параметры.СумДебет = OperationInfo.SumDebit;
	СтрокаОперация.Параметры.СумКредит = OperationInfo.SumAmount;
	
	Таб.Вывести(СтрокаОперация);
	
КонецПроцедуры


Процедура ПФ_АктСверки405_ПодписиДокумента(Таб, Макет, SenderContent, RecipientContent)
	
	Если ЗначениеЗаполнено(RecipientContent)
		И НЕ СвойствоСтруктуры(RecipientContent, "SignDisagreement", Неопределено) = Неопределено Тогда
		
		// Титул получателя
		
		ПФ_АктСверки405_ПодписиТитулаПолучателя(
			Таб,
			Макет,
			SenderContent,
			RecipientContent
		);
		
	Иначе
		
		// Титул отправителя
		
		ПФ_АктСверки405_ПодписиТитулаОтправителя(
			Таб,
			Макет,
			SenderContent
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ПодписиТитулаОтправителя(Таб, Макет, SenderContent)
	
	ПодписиСторон = Макет.ПолучитьОбласть("ПодписиСторон");
	
	ReconciliationAct = SenderContent.ReconciliationAct;
	
	Sender = ReconciliationAct.AdditionalInfoReconciliationAct.Sender;
	Recipient = ReconciliationAct.AdditionalInfoReconciliationAct.Recipient;
	
	СуммаЗадолженностиПоДаннымОтправителя = ReconciliationAct.ReconciliationActTable.BalanceDebitEnd - ReconciliationAct.ReconciliationActTable.BalanceAmountEnd;
	
	Если СуммаЗадолженностиПоДаннымОтправителя >= 0 Тогда
		ЗадолженностьПоДаннымОтправителя = Sender.Name
	Иначе
		ЗадолженностьПоДаннымОтправителя = Recipient.Name
	КонецЕсли;
	
	СуммаПоДаннымОтправителя = МодульЧисла(СуммаЗадолженностиПоДаннымОтправителя);
	
	ПодписиСторон.Параметры.НаимОргОтправителя = Sender.Name;
	ПодписиСторон.Параметры.ЗадолженностьОтправителя = ЗадолженностьПоДаннымОтправителя;
	ПодписиСторон.Параметры.СуммаПоДаннымОтправителя = СтрокаСумма(СуммаПоДаннымОтправителя, "ЧДЦ=2; ЧН=", "0");
	ПодписиСторон.Параметры.ДатаОкПерОтправителя = ДатаСтрокойИлиДефис(SenderContent.ReconcilationDateTo);
	ПодписиСторон.Параметры.ДолжнОтправителя = ReconciliationAct.Signer.JobTitle;
	ПодписиСторон.Параметры.ФИОПодписантаОтправителя = СтрокаФИО(ReconciliationAct.Signer.Official);
	
	Таб.Вывести(ПодписиСторон);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ПодписиТитулаПолучателя(Таб, Макет, SenderContent, RecipientContent)
	
	ПодписиСторон = Макет.ПолучитьОбласть("ПодписиСторон");
	
	// Даные отправителя
	
	ПФ_АктСверки405_ПодписьОтправителя(ПодписиСторон, SenderContent);
	
	// Даные получателя
	
	ПризнакРазногласий = RecipientContent.SignDisagreement;
	
	Если НРег(ПризнакРазногласий) = НРег("WithoutDisagreements") Тогда
		
		ПФ_АктСверки405_ПодписьПолучателяБезРазногласий(
			ПодписиСторон,
			SenderContent,
			RecipientContent
		);
		
	ИначеЕсли НРег(ПризнакРазногласий) = НРег("WithDisagreements") Тогда
		
		ПФ_АктСверки405_ПодписьПолучателяСРазногласиями(
			ПодписиСторон,
			SenderContent,
			RecipientContent
		);
		
	Иначе
		
		ШаблонОшибки = "Неожиданный результат разногласий: %1";
		ТекстОшибки = Общее_ПодставитьПараметрыВСтроку(
			ШаблонОшибки,
			ПризнакРазногласий
		);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Таб.Вывести(ПодписиСторон);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ПодписьОтправителя(ОбластьМакета, SenderContent)
	
	SenderReconciliationAct = SenderContent.ReconciliationAct;
	
	Sender = SenderReconciliationAct.AdditionalInfoReconciliationAct.Sender;
	Recipient = SenderReconciliationAct.AdditionalInfoReconciliationAct.Recipient;
	
	СуммаЗадолженностиПоДаннымОтправителя = SenderReconciliationAct.ReconciliationActTable.BalanceDebitEnd - SenderReconciliationAct.ReconciliationActTable.BalanceAmountEnd;
	
	Если СуммаЗадолженностиПоДаннымОтправителя >= 0 Тогда
		ЗадолженностьПоДаннымОтправителя = Sender.Name
	Иначе
		ЗадолженностьПоДаннымОтправителя = Recipient.Name
	КонецЕсли;
	
	СуммаПоДаннымОтправителя = МодульЧисла(СуммаЗадолженностиПоДаннымОтправителя);
	
	ОбластьМакета.Параметры.НаимОргОтправителя = Sender.Name;
	ОбластьМакета.Параметры.ЗадолженностьОтправителя = ЗадолженностьПоДаннымОтправителя;
	ОбластьМакета.Параметры.СуммаПоДаннымОтправителя = СтрокаСумма(СуммаПоДаннымОтправителя, "ЧДЦ=2; ЧН=", "0");
	ОбластьМакета.Параметры.ДатаОкПерОтправителя = ДатаСтрокойИлиДефис(SenderContent.ReconcilationDateTo);
	ОбластьМакета.Параметры.ДолжнОтправителя = SenderReconciliationAct.Signer.JobTitle;
	ОбластьМакета.Параметры.ФИОПодписантаОтправителя = СтрокаФИО(SenderReconciliationAct.Signer.Official);
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ПодписьПолучателяБезРазногласий(ОбластьМакета, SenderContent, RecipientContent)
	
	SenderReconciliationAct = SenderContent.ReconciliationAct;
	RecipientReconciliationAct = RecipientContent;
	
	Sender = SenderReconciliationAct.AdditionalInfoReconciliationAct.Sender;
	Recipient = SenderReconciliationAct.AdditionalInfoReconciliationAct.Recipient;
	
	СуммаЗадолженностиПоДаннымОтправителя = SenderReconciliationAct.ReconciliationActTable.BalanceDebitEnd - SenderReconciliationAct.ReconciliationActTable.BalanceAmountEnd;
	
	Если СуммаЗадолженностиПоДаннымОтправителя >= 0 Тогда
		ЗадолженностьПоДаннымОтправителя = Sender.Name
	Иначе
		ЗадолженностьПоДаннымОтправителя = Recipient.Name
	КонецЕсли;
	
	СуммаПоДаннымОтправителя = МодульЧисла(СуммаЗадолженностиПоДаннымОтправителя);
	
	Signer = СвойствоСтруктуры(RecipientReconciliationAct, "Signer");
	
	Если ЗначениеЗаполнено(Signer) Тогда
		ДолжнПолучателя = Signer.JobTitle;
		ФИОПодписантаПолучателя = СтрокаФИО(Signer.Official);
	Иначе
		ДолжнПолучателя = "";
		ФИОПодписантаПолучателя = "";
	КонецЕсли;
	
	ОбластьМакета.Параметры.НаимОргПолучателя = Recipient.Name;
	ОбластьМакета.Параметры.ЗадолженностьПолучателя = ЗадолженностьПоДаннымОтправителя;
	ОбластьМакета.Параметры.СуммаПоДаннымПолучателя = СтрокаСумма(СуммаПоДаннымОтправителя, "ЧДЦ=2; ЧН=", "0");
	ОбластьМакета.Параметры.ДатаОкПерПолучателя = ДатаСтрокойИлиДефис(SenderContent.ReconcilationDateTo);
	ОбластьМакета.Параметры.ДолжнПолучателя = ДолжнПолучателя;
	ОбластьМакета.Параметры.ФИОПодписантаПолучателя = ФИОПодписантаПолучателя;
	
КонецПроцедуры

Процедура ПФ_АктСверки405_ПодписьПолучателяСРазногласиями(ОбластьМакета, SenderContent, RecipientContent)
	
	SenderReconciliationAct = SenderContent.ReconciliationAct;
	RecipientReconciliationAct = RecipientContent.ReconciliationAct;
	
	Sender = SenderReconciliationAct.AdditionalInfoReconciliationAct.Sender;
	Recipient = SenderReconciliationAct.AdditionalInfoReconciliationAct.Recipient;
	
	СуммаЗадолженностиПоДаннымПолучателя = RecipientReconciliationAct.ReconciliationActTable.BalanceDebitEnd - RecipientReconciliationAct.ReconciliationActTable.BalanceAmountEnd;
	
	Если СуммаЗадолженностиПоДаннымПолучателя >= 0 Тогда
		ЗадолженностьПоДаннымПолучателя = Recipient.Name
	Иначе
		ЗадолженностьПоДаннымПолучателя = Sender.Name
	КонецЕсли;
	
	СуммаПоДаннымПолучателя = МодульЧисла(СуммаЗадолженностиПоДаннымПолучателя);
	
	Signer = СвойствоСтруктуры(RecipientReconciliationAct, "Signer");
	
	Если ЗначениеЗаполнено(Signer) Тогда
		ДолжнПолучателя = Signer.JobTitle;
		ФИОПодписантаПолучателя = СтрокаФИО(Signer.Official);
	Иначе
		ДолжнПолучателя = "";
		ФИОПодписантаПолучателя = "";
	КонецЕсли;
	
	ОбластьМакета.Параметры.НаимОргПолучателя = Recipient.Name;
	ОбластьМакета.Параметры.ЗадолженностьПолучателя = ЗадолженностьПоДаннымПолучателя;
	ОбластьМакета.Параметры.СуммаПоДаннымПолучателя = СтрокаСумма(СуммаПоДаннымПолучателя, "ЧДЦ=2; ЧН=", "0");
	ОбластьМакета.Параметры.ДатаОкПерПолучателя = ДатаСтрокойИлиДефис(SenderContent.ReconcilationDateTo);
	ОбластьМакета.Параметры.ДолжнПолучателя = ДолжнПолучателя;
	ОбластьМакета.Параметры.ФИОПодписантаПолучателя = ФИОПодписантаПолучателя;
	
КонецПроцедуры

Функция ПФ_СчетНаОплату_29(Параметры, ТипДокумента)
	
	Если НРег(ТипДокумента) = НРег(ТипСчетОфертаФНС29()) Тогда
		НазваниеДокумента = "Счет - оферта";
	Иначе
		НазваниеДокумента = "Счет на оплату";
	КонецЕсли;
	
	Параметры.Вставить("Макет", ПолучитьМакет("СчетНаОплату_29"));
	
	Таб = НовыйТабличныйДокумент("DD_СчетНаОплату_29");
	
	ПФ_СчетНаОплату_29_ШапкаДокумента(Таб, Параметры, НазваниеДокумента);
	ПФ_СчетНаОплату_29_ТабличнаяЧастьДокумента(Таб, Параметры);
	ПФ_СчетНаОплату_29_ПодвалТаблицы(Таб, Параметры);
	ПФ_СчетНаОплату_29_ПодвалДокумента(Таб, Параметры);
	
	Возврат Таб;
	
КонецФункции

Процедура ПФ_СчетНаОплату_29_ШапкаДокумента(Таб, Параметры, НазваниеДокумента)
	
	Content = Параметры.Content;
	
	Если ЗначениеЗаполнено(Content.MoneyRecipient.Name) Тогда
		ПФ_СчетНаОплату_29_ШапкаДокумента_СведенияОБанке(Таб, Content.MoneyRecipient, Параметры.Макет);
	Иначе
		ПФ_СчетНаОплату_29_ШапкаДокумента_СведенияОБанке(Таб, Content.Seller, Параметры.Макет);
	КонецЕсли;
	
	ШаблонЗаголовкаДокумента = "%1 № %2 от %3 г.";
	
	ЗаголовокДокумента = Общее_ПодставитьПараметрыВСтроку(
		ШаблонЗаголовкаДокумента,
		НазваниеДокумента,
		Content.DocumentNumber,
		ДатаСтрокой(Content.DocumentDate)
	);
	
	ОбластьСчетаДокумент = Параметры.Макет.ПолучитьОбласть("ШапкаСчетаДокумент");
	ОбластьСчетаДокумент.Параметры.Заголовок = ЗаголовокДокумента;
	Таб.Вывести(ОбластьСчетаДокумент);

	ПФ_СчетНаОплату_29_ШапкаДокумента_СведенияУчастников(Таб, Content, Параметры.Макет);
	ПФ_СчетНаОплату_29_ШапкаДокумента_ОснованиеСчета(Таб, Content, Параметры.Макет);
	
	СтрокаДопСведений = "";
	Разделитель = "";
	
	Для Каждого AdditionalInfoId Из Content.AdditionalInfoId Цикл
		StructedAdditionalInfos = AdditionalInfoId.StructedAdditionalInfos;
		
		СтрокаДопСведений = СтрокаДопСведений + Разделитель + ДопСведенияСтрокой(StructedAdditionalInfos);
		Разделитель = ", ";
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
		ОбластьСчетаИныеСведения = Параметры.Макет.ПолучитьОбласть("ШапкаСчетаИныеСведения");
		ОбластьСчетаИныеСведения.Параметры.ИныеСведения = СтрокаДопСведений;
		Таб.Вывести(ОбластьСчетаИныеСведения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПФ_СчетНаОплату_29_ШапкаДокумента_СведенияОБанке(Таб, Контент, Макет)
	
	ОбластьСчетаБанк = Макет.ПолучитьОбласть("ШапкаСчетаБанк");
	ОбластьСчетаБанк.Параметры.БанкПолучателя = Контент.BankName;
	ОбластьСчетаБанк.Параметры.БИКБанкаПолучателя = Контент.BankId;
	ОбластьСчетаБанк.Параметры.СчетБанкаПолучателя = Контент.CorrespondentAccount;
	ОбластьСчетаБанк.Параметры.СчетПолучателя = Контент.BankAccountNumber;
	ОбластьСчетаБанк.Параметры.ИННПолучателя = Контент.Inn;
	ОбластьСчетаБанк.Параметры.КПППолучателя = Контент.Kpp;
	
	Если ЗначениеЗаполнено(Контент.ShortOrgName) Тогда
		ОбластьСчетаБанк.Параметры.Получатель = Контент.ShortOrgName;
	Иначе
		ОбластьСчетаБанк.Параметры.Получатель = Контент.Name;
	КонецЕсли;
	
	Таб.Вывести(ОбластьСчетаБанк);
	
КонецПроцедуры

Процедура ПФ_СчетНаОплату_29_ШапкаДокумента_СведенияУчастников(Таб, Контент, Макет)
	
	ОбластьСчетаПоставщик = Макет.ПолучитьОбласть("ШапкаСчетаПоставщик");
	ОбластьСчетаПоставщик.Параметры.Поставщик = ПФ_СчетНаОплату_29_СведенияУчастника(Контент.Seller);
	Таб.Вывести(ОбластьСчетаПоставщик);
	
	ОбластьСчетаПокупатель = Макет.ПолучитьОбласть("ШапкаСчетаПокупатель");
	ОбластьСчетаПокупатель.Параметры.Покупатель = ПФ_СчетНаОплату_29_СведенияУчастника(Контент.Buyer);
	Таб.Вывести(ОбластьСчетаПокупатель);
	
	Если ЗначениеЗаполнено(Контент.Payer.Type) Тогда
		ОбластьСчетаПлательщик = Макет.ПолучитьОбласть("ШапкаСчетаПлательщик");
		ОбластьСчетаПлательщик.Параметры.Плательщик = ПФ_СчетНаОплату_29_СведенияУчастника(Контент.Payer);
		Таб.Вывести(ОбластьСчетаПлательщик);
	КонецЕсли;
	Если ЗначениеЗаполнено(Контент.Shipper.Type) Тогда
		ОбластьСчетаГрузоотправитель = Макет.ПолучитьОбласть("ШапкаСчетаГрузоотправитель");
		ОбластьСчетаГрузоотправитель.Параметры.Грузоотправитель = ПФ_СчетНаОплату_29_СведенияУчастника(Контент.Shipper);
		Таб.Вывести(ОбластьСчетаГрузоотправитель);
	КонецЕсли;
	Если ЗначениеЗаполнено(Контент.Consignee.Type) Тогда
		ОбластьСчетаГрузополучатель = Макет.ПолучитьОбласть("ШапкаСчетаГрузополучатель");
		ОбластьСчетаГрузополучатель.Параметры.Грузополучатель = ПФ_СчетНаОплату_29_СведенияУчастника(Контент.Consignee);
		Таб.Вывести(ОбластьСчетаГрузополучатель);
	КонецЕсли;
	
КонецПроцедуры

Функция ПФ_СчетНаОплату_29_СведенияУчастника(Контент)
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(Контент.Name);
	
	// BSLLS:IfElseIfEndsWithElse-off
	Если ЗначениеЗаполнено(Контент.Inn) Тогда
		ЧастиСтроки.Добавить("ИНН: " + Контент.Inn);
	ИначеЕсли ЗначениеЗаполнено(Контент.OrganizationOrPersonInfo) Тогда
		ЧастиСтроки.Добавить("Иные сведения: " + Контент.OrganizationOrPersonInfo);
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-on
	
	Если ЗначениеЗаполнено(Контент.Kpp) Тогда
		ЧастиСтроки.Добавить("КПП: " + Контент.Kpp);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контент.LegalEntityId) Тогда
		ЧастиСтроки.Добавить(Контент.LegalEntityId);
	КонецЕсли;
	
	ЧастиСтроки.Добавить(СтрокаАдрес_970(Контент.Address));
	ЧастиСтроки.Добавить(СтрокаКонтактныеДанные_970(Контент));
	
	Результат = СоединитьСтроку(ЧастиСтроки, ", ");
	
	Возврат Результат;
	
КонецФункции

Процедура ПФ_СчетНаОплату_29_ШапкаДокумента_ОснованиеСчета(Таб, Контент, Макет)
	
	Разделитель = "";
	СимволНПП = Символы.НПП;
	ОснованиеСчета = "";
	Для Каждого ProformaInvoiceBase Из Контент.ProformaInvoiceBases Цикл
		
		НаименованиеДокумента = ProformaInvoiceBase.ProformaInvoiceBaseDocument.DocumentName;
		Номер = ProformaInvoiceBase.ProformaInvoiceBaseDocument.DocumentNumber;
		Дата = ProformaInvoiceBase.ProformaInvoiceBaseDocument.DocumentDate;
		
		Если ЗначениеЗаполнено(НаименованиеДокумента) Тогда
			
			ОснованиеСчета = ОснованиеСчета + Разделитель + НаименованиеДокумента;
			ОснованиеСчета = ОснованиеСчета + " №" + СимволНПП + Номер;
			ОснованиеСчета = ОснованиеСчета + СимволНПП + "от" + СимволНПП + ДатаСтрокой(Дата);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ProformaInvoiceBase.OtherBase) Тогда
			ОснованиеСчета = ОснованиеСчета + Разделитель + ProformaInvoiceBase.OtherBase;
		КонецЕсли;
		
		Разделитель = "; ";
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ОснованиеСчета) Тогда
		ОснованиеСчета = СтрокаДефис();
	КонецЕсли;
	
	ОбластьСчетаОснование = Макет.ПолучитьОбласть("ШапкаСчетаОснование");
	ОбластьСчетаОснование.Параметры.Основание = ОснованиеСчета;
	Таб.Вывести(ОбластьСчетаОснование);
	
КонецПроцедуры

Процедура ПФ_СчетНаОплату_29_ТабличнаяЧастьДокумента(Таб, Параметры)
	
	Table = Параметры.Content.Table;
	
	ЕстьСкидка = ЗначениеЗаполнено(Параметры.Content.Table.TotalDiscountSum);
	
	Если ЕстьСкидка Тогда
		ОбластьШапкаТаблицы = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы");
	Иначе
		ОбластьШапкаТаблицы = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицыБезСкидок");
	КонецЕсли;
	
	Таб.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтроки = 0;
	
	Для Каждого Item Из Table.Items Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ПФ_СчетНаОплату_29_СтрокаТабличнойЧасти(Таб, Item, Параметры, НомерСтроки, ЕстьСкидка);
		
	КонецЦикла;
	
	Подвал = Параметры.Макет.ПолучитьОбласть("Подвал");
	Таб.Вывести(Подвал);
	
КонецПроцедуры

Процедура ПФ_СчетНаОплату_29_СтрокаТабличнойЧасти(Таб, Контент, Параметры, НомерСтроки, ЕстьСкидка)
	
	СтрокаДопСведений = "";
	
	Если Параметры.ПоказатьДопСведения Тогда
		
		Разделитель = "";
		
		Для Каждого AdditionalInfoId Из Контент.AdditionalInfoId Цикл
			StructedAdditionalInfos = AdditionalInfoId.StructedAdditionalInfos;
			
			СтрокаДопСведений = СтрокаДопСведений + Разделитель + ДопСведенияСтрокой(StructedAdditionalInfos);
			Разделитель = ", ";
		КонецЦикла;
		
		Разделитель = ?(ЗначениеЗаполнено(СтрокаДопСведений), "; ", "");
		
		Если ЗначениеЗаполнено(Контент.AdditionalProperty) Тогда
			СтрокаДопСведений = СтрокаДопСведений + Разделитель + Контент.AdditionalProperty;
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьДопСведения = ЗначениеЗаполнено(СтрокаДопСведений);
	
	ИмяОбласти = "Строка";
	
	Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
		ИмяОбласти = ИмяОбласти + "ДопСведения";
	КонецЕсли;
	
	Если НЕ ЕстьСкидка Тогда
		ИмяОбласти = ИмяОбласти + "БезСкидок";
	КонецЕсли;
	
	ОбластьСтрока = Параметры.Макет.ПолучитьОбласть(ИмяОбласти);
	ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
	ОбластьСтрока.Параметры.Артикул = ПредставлениеКодТов_СчетНаОплату_29(Контент);
	ОбластьСтрока.Параметры.Товар = ПредставлениеНоменклатуры_СчетНаОплату_29(Контент);
	ОбластьСтрока.Параметры.Количество = КоличествоСтрокойИлиДефис(Контент.Quantity, Параметры.ФорматКоличества);
	ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаЕдиницаИзмерения_970(Контент.UnitName);
	ОбластьСтрока.Параметры.Цена = СуммаСтрокойИлиДефис(Контент.PriceWithoutDiscount, Параметры.ФорматСуммы);
	ОбластьСтрока.Параметры.СуммаБезНДС = СуммаСтрокойИлиДефис(Контент.SubtotalWithVatExcluded);
	ОбластьСтрока.Параметры.СуммаНДС = СтрокаСуммаНДС_970(Контент.Vat, Контент.WithoutVat, Контент.TaxRate);
	ОбластьСтрока.Параметры.Всего = СуммаСтрокойИлиДефис(Контент.SubTotal);
	
	Если ЗначениеЗаполнено(Контент.OtherTaxRate) Тогда
		ОбластьСтрока.Параметры.СтавкаНДС = СокрЛП(Контент.OtherTaxRate);
	Иначе
		ОбластьСтрока.Параметры.СтавкаНДС = СтрокаСтавкаНДС(Контент.TaxRate);
	КонецЕсли;
	
	Если ЕстьСкидка Тогда
		Если ЗначениеЗаполнено(Контент.DiscountPercent) Тогда
			Скидка = СуммаСтрокой(Контент.DiscountPercent) + "%";
		Иначе
			Скидка = СуммаСтрокойИлиДефис(Контент.DiscountSum);
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Скидка = Скидка;
	КонецЕсли;
	
	Если ЕстьДопСведения Тогда
		ОбластьСтрока.Параметры.ДопСведения = СтрокаДопСведений;
	КонецЕсли;
	
	Таб.Вывести(ОбластьСтрока);
	
КонецПроцедуры

Процедура ПФ_СчетНаОплату_29_ПодвалТаблицы(Таб, Параметры)
	
	Table = Параметры.Content.Table;
	
	Если ЗначениеЗаполнено(Table.TotalDiscountSum) Тогда
		ОбластьПодвалСкидкаПоДокументу = Параметры.Макет.ПолучитьОбласть("ПодвалСкидкаПоДокументу");
		ОбластьПодвалСкидкаПоДокументу.Параметры.СуммаСкидки = Table.TotalDiscountSum;
		Таб.Вывести(ОбластьПодвалСкидкаПоДокументу);
	КонецЕсли;
	
	ОбластьПодвалИтого = Параметры.Макет.ПолучитьОбласть("ПодвалИтого");
	ОбластьПодвалИтого.Параметры.Всего = Table.TotalWithVatExcluded;
	Таб.Вывести(ОбластьПодвалИтого);
	
	Если Table.WithoutVat Тогда
		ЗаголовокНДС = "Без налога (НДС)";
		ВсегоНДС = "-";
	Иначе
		ЗаголовокНДС = "НДС:";
		ВсегоНДС = СуммаСтрокойИлиДефис(Table.Vat);
	КонецЕсли;
	
	ОбластьПодвалНДС = Параметры.Макет.ПолучитьОбласть("ПодвалНДС");
	ОбластьПодвалНДС.Параметры.НДС = ЗаголовокНДС;
	ОбластьПодвалНДС.Параметры.ВсегоНДС = ВсегоНДС;
	Таб.Вывести(ОбластьПодвалНДС);
	
	ПФ_СчетНаОплату_29_ПодвалТаблицы_ИтогоКОплате(Таб, Параметры.Content, Параметры.Макет);
	
КонецПроцедуры

Процедура ПФ_СчетНаОплату_29_ПодвалТаблицы_ИтогоКОплате(Таб, Контент, Макет)
	
	ИтогоКОплате = Контент.Table.Total;
	
	ОбластьПодвалИтогоКОплате = Макет.ПолучитьОбласть("ПодвалИтогоКОплате");
	ОбластьПодвалИтогоКОплате.Параметры.ИтогоКОплате = ИтогоКОплате;
	Таб.Вывести(ОбластьПодвалИтогоКОплате);
	
	Если ЗначениеЗаполнено(Контент.TotalItems) Тогда
		ВсегоПозиций = Контент.TotalItems;
	Иначе
		ВсегоПозиций = Контент.Table.Items.Количество();
	КонецЕсли;
	
	ШаблонИтоговойСтроки = НСтр("ru='Всего наименований %1, на сумму %2 %3'");
	
	Если Контент.IsConventionalUnit Тогда
		ВалютаДляСчета = Контент.ConventionalUnitDefinition;
		
		СуммаПрописью = ЧислоПрописью_УЕ(ИтогоКОплате, ВалютаДляСчета);
	Иначе
		
		ВалютаДляСчета = НаименованиеВалюты(Контент.Currency, Истина);
		
		ПараметрыИсчисленияВалюты = ПараметрыИсчисленияВалюты(Контент.Currency);
		
		Если ЗначениеЗаполнено(ПараметрыИсчисленияВалюты) Тогда
			СуммаПрописью = ЧислоПрописью_Обертка(ИтогоКОплате, ПараметрыИсчисленияВалюты);
		Иначе
			СуммаПрописью = ЧислоПрописью_Обертка(ИтогоКОплате, ПараметрыИсчисленияВалюты) + " " + ВалютаДляСчета;
		КонецЕсли;
	
	КонецЕсли;
	
	ИтоговаяСтрока = Общее_ПодставитьПараметрыВСтроку(
		ШаблонИтоговойСтроки,
		ВсегоПозиций,
		Формат(ИтогоКОплате, "ЧЦ=15; ЧДЦ=2"),
		ВалютаДляСчета
	);
	
	ОбластьПодвалСуммаПрописью = Макет.ПолучитьОбласть("ПодвалСуммаПрописью");
	ОбластьПодвалСуммаПрописью.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
	ОбластьПодвалСуммаПрописью.Параметры.СуммаПрописью = СуммаПрописью;
	Таб.Вывести(ОбластьПодвалСуммаПрописью);
	
КонецПроцедуры

Функция ЧислоПрописью_УЕ(Значение, ВалютаДляСчета)
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПараметрыПредметаИсчисления = Общее_ПодставитьПараметрыВСтроку(
	"%1, %1, %1, N, , , , N, ",
	ВалютаДляСчета);
	
	Попытка
		Результат = ЧислоПрописью(Значение, ФормСтрока, ПараметрыПредметаИсчисления);
	Исключение
		Результат = Строка(Значение);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПФ_СчетНаОплату_29_ПодвалДокумента(Таб, Параметры)
	
	Content = Параметры.Content;
	ProformaInvoiceAdditionalInfo = Content.ProformaInvoiceAdditionalInfo;
	
	ПФ_СчетНаОплату_29_ПодвалДокумента_ОплатитьДо(Таб, ProformaInvoiceAdditionalInfo, Параметры.Макет);
	
	Разделитель = Символы.ПС;
	
	УсловияОплаты = СоединитьСтроку(ProformaInvoiceAdditionalInfo.PaymentTerms, Разделитель);
	Если ЗначениеЗаполнено(УсловияОплаты) Тогда
		ОбластьПодвалУсловияОплаты = Параметры.Макет.ПолучитьОбласть("ПодвалУсловияОплаты");
		ОбластьПодвалУсловияОплаты.Параметры.УсловияОплаты = УсловияОплаты;
		Таб.Вывести(ОбластьПодвалУсловияОплаты);
	КонецЕсли;
	
	УсловияОказанияУслуги = СоединитьСтроку(ProformaInvoiceAdditionalInfo.ShipmentTerms, Разделитель);
	Если ЗначениеЗаполнено(УсловияОказанияУслуги) Тогда
		ОбластьПодвалУсловияОказанияУслуги = Параметры.Макет.ПолучитьОбласть("ПодвалУсловияОказанияУслуги");
		ОбластьПодвалУсловияОказанияУслуги.Параметры.УсловияОказанияУслуги = УсловияОказанияУслуги;
		Таб.Вывести(ОбластьПодвалУсловияОказанияУслуги);
	КонецЕсли;
	
	СтрокаДопСведений = "";
	Разделитель = "";
	
	Для Каждого AdditionalInfoId Из ProformaInvoiceAdditionalInfo.AdditionalInfoId Цикл
		StructedAdditionalInfos = AdditionalInfoId.StructedAdditionalInfos;
		
		СтрокаДопСведений = СтрокаДопСведений + Разделитель + ДопСведенияСтрокой(StructedAdditionalInfos);
		Разделитель = ", ";
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
		ОбластьПодвалДопСведения = Параметры.Макет.ПолучитьОбласть("ПодвалДопСведения");
		ОбластьПодвалДопСведения.Параметры.ДопСведения = СтрокаДопСведений;
		Таб.Вывести(ОбластьПодвалДопСведения);
	КонецЕсли;
	
	ОбластьПодвалСчета = Параметры.Макет.ПолучитьОбласть("ПодвалСчета");
	Таб.Вывести(ОбластьПодвалСчета);
	
	Для Каждого Signer Из Content.Signers Цикл
		ОбластьПодвалПодписант = Параметры.Макет.ПолучитьОбласть("ПодвалПодписант");
		ОбластьПодвалПодписант.Параметры.ДолжностьПодписанта = Signer.JobTitle;
		ОбластьПодвалПодписант.Параметры.ФИОПодписанта = СтрокаФИО(Signer);
		Таб.Вывести(ОбластьПодвалПодписант);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПФ_СчетНаОплату_29_ПодвалДокумента_ОплатитьДо(Таб, Контент, Макет)
	
	Если ЗначениеЗаполнено(Контент.DateRestriction) Тогда
		ОплатитьДо = ДатаСтрокой(Контент.DateRestriction);
	ИначеЕсли ЗначениеЗаполнено(Контент.DateAndTimeRestriction) Тогда
		ОплатитьДоДата = Лев(Контент.DateAndTimeRestriction, 10);
		ОплатитьДоВремя = Сред(Контент.DateAndTimeRestriction, 12, 5);
		
		ОплатитьДо = ОплатитьДоВремя + " " + ОплатитьДоДата;
	Иначе
		ОплатитьДо = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОплатитьДо) Тогда
		ОбластьПодвалДатаОплаты = Макет.ПолучитьОбласть("ПодвалДатаОплаты");
		ОбластьПодвалДатаОплаты.Параметры.ОплатитьДо = ОплатитьДо;
		Таб.Вывести(ОбластьПодвалДатаОплаты);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает печатную форму счета на оплату по форме ДД
//
// Параметры: 
//  Данные - Структура - внутреннее представление сведений о счете на оплату (см. МенеджерИнтеграции.СчетаНаОплату_Данные)
// 
// Возвращаемое значение:
//  ТабличныйДокумент
//
Функция ПФ_СчетНаОплатуДиадок(Данные) Экспорт
	
	ДанныеШапки = Данные.Шапка;
	ДанныеТабличнойЧасти = Данные.ТабличнаяЧасть;
	
	Таб = НовыйТабличныйДокумент("DD_СчетНаОплату", ОриентацияСтраницы.Портрет);
	
	Макет = ПолучитьМакет("ПФ_MXL_СчетНаОплату");
	
	Сумма = ДанныеТабличнойЧасти.Итог("Сумма");
	СуммаНДС = ДанныеТабличнойЧасти.Итог("СуммаНДС");
	ВсегоНаименований = ДанныеТабличнойЧасти.Количество();
	
	СчетаНаОплату_ШапкаДокумента(Таб, Макет, ДанныеШапки);
	
	СчетНаОплату_ТабличнаяЧастьДокумента(Таб, Макет, ДанныеТабличнойЧасти);
	
	СчетаНаОплату_ПодвалДокумента(Таб, Макет, ДанныеШапки, Сумма, СуммаНДС, ВсегоНаименований);
	
	Возврат Таб;
	
КонецФункции

Процедура СчетаНаОплату_ШапкаДокумента(Таб, Макет, ДанныеШапки)
	
	ШапкаДанныеОтправителяПолучателя = Макет.ПолучитьОбласть("ШапкаСчета1");
	ШапкаДанныеОтправителяПолучателя.Параметры.БанкПолучателя = ДанныеШапки.ПродавецБанкПредставление;
	ШапкаДанныеОтправителяПолучателя.Параметры.БИКБанкаПолучателя = ДанныеШапки.ПродавецБанкБИК;
	ШапкаДанныеОтправителяПолучателя.Параметры.СчетБанкаПолучателя = ДанныеШапки.ПродавецБанковскийСчетКорСчет;
	ШапкаДанныеОтправителяПолучателя.Параметры.СчетПолучателя = ДанныеШапки.ПродавецБанковскийСчетНомер;
	ШапкаДанныеОтправителяПолучателя.Параметры.ИННПолучателя = ДанныеШапки.ПродавецИНН;
	ШапкаДанныеОтправителяПолучателя.Параметры.КПППолучателя = ДанныеШапки.ПродавецКПП;
	ШапкаДанныеОтправителяПолучателя.Параметры.Получатель = ДанныеШапки.ПродавецПредставление;
	Таб.Вывести(ШапкаДанныеОтправителяПолучателя);
	
	ШапкаДанныеСчетаНаОплату = Макет.ПолучитьОбласть("ШапкаСчета2");
	ШапкаДанныеСчетаНаОплату.Параметры.Заголовок = ДанныеШапки.Заголовок;
	Таб.Вывести(ШапкаДанныеСчетаНаОплату);
	
	ШапкаОписаниеОтправителя = Макет.ПолучитьОбласть("ШапкаСчета3");
	ШапкаОписаниеОтправителя.Параметры.Поставщик = ДанныеШапки.ПродавецОписание;
	Таб.Вывести(ШапкаОписаниеОтправителя);
	
	ШапкаОписаниеПолучателя = Макет.ПолучитьОбласть("ШапкаСчета4");
	ШапкаОписаниеПолучателя.Параметры.Покупатель = ДанныеШапки.ПокупательОписание;
	Таб.Вывести(ШапкаОписаниеПолучателя);
	
КонецПроцедуры

Процедура СчетНаОплату_ТабличнаяЧастьДокумента(Таб, Макет, ДанныеТабличнойЧасти)
	
	ИмяОбластиШапка = "ШапкаТаблицыБезСкидок";
	ИмяОбластиСтрока = "СтрокаБезСкидок";
	
	ЕстьСкидки = (ДанныеТабличнойЧасти.Итог("СуммаСкидки") <> 0);
	
	Если ЕстьСкидки Тогда
		ИмяОбластиШапка = "ШапкаТаблицы";
		ИмяОбластиСтрока = "Строка";
	КонецЕсли;
	
	ШапкаТаблицы = Макет.ПолучитьОбласть(ИмяОбластиШапка);
	СтрокаТаблицы = Макет.ПолучитьОбласть(ИмяОбластиСтрока);
	
	Таб.Вывести(ШапкаТаблицы);
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеТабличнойЧасти Цикл
		
		СтрокаТаблицы.Параметры.Заполнить(СтрокаТабличнойЧасти);
		
		СтрокаТаблицы.Параметры.Товар = СтрокаТабличнойЧасти.НоменклатураПредставление;
		СтрокаТаблицы.Параметры.Артикул = СтрокаТабличнойЧасти.НоменклатураАртикул;
		СтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
		
		НомерСтроки = НомерСтроки + 1;
		
		Таб.Вывести(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчетаНаОплату_ПодвалДокумента(Таб, Макет, ДанныеШапки, Сумма, СуммаНДС, ВсегоНаименований)
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Таб.Вывести(Подвал);
	
	ПодвалИтого = Макет.ПолучитьОбласть("ПодвалИтого");
	ПодвалИтого.Параметры.Всего = Сумма;
	Таб.Вывести(ПодвалИтого);
	
	ПодвалНДС = Макет.ПолучитьОбласть("ПодвалНДС");
	
	Если ДанныеШапки.ОблагаетсяНДСУПокупателя Тогда
		
		ПодвалНДС.Параметры.НДС = "НДС исчисляется налоговым агентом";
		ПодвалНДС.Параметры.ВсегоНДС = "-";
		
	ИначеЕсли ДанныеШапки.УчитыватьНДС Тогда
		
		ПодвалНДС.Параметры.НДС = ?(ДанныеШапки.ЦенаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
		ПодвалНДС.Параметры.ВсегоНДС = Формат(СуммаНДС, "ЧЦ=15; ЧДЦ=2");
		
	Иначе
		
		ПодвалНДС.Параметры.НДС = "Без налога (НДС)";
		ПодвалНДС.Параметры.ВсегоНДС = "-";
		
	КонецЕсли;
	
	Таб.Вывести(ПодвалНДС);
	
	СуммаИтого = Сумма + ?(ДанныеШапки.ЦенаВключаетНДС, 0, СуммаНДС);
	
	ПодвалИтого = Макет.ПолучитьОбласть("ПодвалИтогоКОплате");
	ПодвалИтого.Параметры.ИтогоКОплате = СуммаИтого;
	Таб.Вывести(ПодвалИтого);
	
	ШаблонИтоговойСтроки = НСтр("ru='Всего наименований %1, на сумму %2 %3'");
	
	ИтоговаяСтрока = Общее_ПодставитьПараметрыВСтроку(
		ШаблонИтоговойСтроки,
		ВсегоНаименований,
		Формат(СуммаИтого, "ЧЦ=15; ЧДЦ=2"),
		СокрП(ДанныеШапки.Валюта)
	);
	
	ПарПредмета = ПараметрыИсчисленияВалюты(ДанныеШапки.Валюта.Код);
	СуммаПрописью = ЧислоПрописью(СуммаИтого, , ПарПредмета);
	
	ПодвалСуммаПрописью = Макет.ПолучитьОбласть("ПодвалСуммаПрописью");
	ПодвалСуммаПрописью.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
	ПодвалСуммаПрописью.Параметры.СуммаПрописью = СуммаПрописью;
	Таб.Вывести(ПодвалСуммаПрописью);
	
	ПодвалСчета = Макет.ПолучитьОбласть("ПодвалСчета");
	ПодвалСчета.Параметры.ФИОРуководителя = ДанныеШапки.РуководительФИО;
	
	Таб.Вывести(ПодвалСчета);
	
КонецПроцедуры

// Возвращает печатную форму акта сверки взаиморасчетов по форме ДД
//
// Параметры:
//  Данные - Структура - внутреннее представление акта сверки взаиморасчетов (см. МенеджерИнтеграции.АктыСверок_Данные)
// 
// Возвращаемое значение:
//  ТабличныйДокумент
//
Функция ПФ_АктСверкиДиадок(Данные) Экспорт
	
	Таб = НовыйТабличныйДокумент("DD_АктСверкиВзаиморасчетов", ОриентацияСтраницы.Портрет);
	
	Макет = ПолучитьМакет("ПФ_MXL_АктСверкиВзаиморасчетов");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ЗаголовокАктаСверки = АктСверки_Подзаголовок(Данные.Шапка);
	ОбластьЗаголовок.Параметры.ЗаголовокТаблицы = АктСверки_СтороныСверки(Данные.Шапка);
	Таб.Вывести(ОбластьЗаголовок);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка|Секция");
	
	ОбластьШапкаТаблицы.Параметры.Шапка = Общее_ПодставитьПараметрыВСтроку(
		"По данным %1, %2",
		Данные.Шапка.ОрганизацияПредставление,
		Данные.Шапка.ВалютаПредставление
	);
	Таб.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьШапкаТаблицы.Параметры.Шапка = Общее_ПодставитьПараметрыВСтроку(
		"По данным %1, %2",
		Данные.Шапка.КонтрагентПредставление,
		Данные.Шапка.ВалютаПредставление
	);
	Таб.Присоединить(ОбластьШапкаТаблицы);
	
	ОстатокНач = Данные.Шапка.ОстатокНаНачало;
	
	СальдоНачДт = Макс(ОстатокНач, 0);
	СальдоНачКт = Макс(-ОстатокНач, 0);
	
	СтрокаСальдо = Макет.ПолучитьОбласть("Сальдо|Секция");
	СтрокаСальдо.Параметры.Дебет = СальдоНачДт;
	СтрокаСальдо.Параметры.Кредит = СальдоНачКт;
	Таб.Вывести(СтрокаСальдо);
	
	СтрокаСальдо.Параметры.Дебет = СальдоНачКт;
	СтрокаСальдо.Параметры.Кредит = СальдоНачДт;
	Таб.Присоединить(СтрокаСальдо);
	
	Если Данные.Шапка.ГруппироватьПоАналитике Тогда
		АктСверки_ВывестиДеталиПоГруппировкам(Таб, Макет, Данные);
	Иначе
		АктСверки_ВывестиДеталиБезГруппировок(Таб, Макет, Данные);
	КонецЕсли;
	
	ОрганизацияОборотДт = Данные.ДанныеОрганизации.Итог("Дебет");
	ОрганизацияОборотКт = Данные.ДанныеОрганизации.Итог("Кредит");
	
	ОрганизацияКонОст = ОстатокНач + ОрганизацияОборотДт - ОрганизацияОборотКт;
	
	Если ОрганизацияКонОст <= 0 Тогда
		
		ОрганизацияСальдоКонДт = 0;
		ОрганизацияСальдоКонКт = - ОрганизацияКонОст;
		
	Иначе
		
		ОрганизацияСальдоКонДт = ОрганизацияКонОст;
		ОрганизацияСальдоКонКт = 0;
		
	КонецЕсли;
	
	КонтрагентОборотДт = Данные.ДанныеКонтрагента.Итог("Дебет");
	КонтрагентОборотКт = Данные.ДанныеКонтрагента.Итог("Кредит");
	
	КонтрагентКонОст = ОстатокНач + КонтрагентОборотКт - КонтрагентОборотДт;
	
	Если КонтрагентКонОст <= 0 Тогда
		
		КонтрагентСальдоКонДт = - КонтрагентКонОст;
		КонтрагентСальдоКонКт = 0;
		
	Иначе
		
		КонтрагентСальдоКонДт = 0;
		КонтрагентСальдоКонКт = КонтрагентКонОст;
		
	КонецЕсли;
	
	ВалютаПредставление = Данные.Шапка.ВалютаПредставление;
	ВалютаКод = Данные.Шапка.ВалютаКод;
	
	ПодвалИтоги = Макет.ПолучитьОбласть("ПодвалИтоги|Секция");
	ПодвалИтоги.Параметры.ОборотыДт = ОрганизацияОборотДт;
	ПодвалИтоги.Параметры.ОборотыКт = ОрганизацияОборотКт;
	ПодвалИтоги.Параметры.Дебет  = ОрганизацияСальдоКонДт;
	ПодвалИтоги.Параметры.Кредит = ОрганизацияСальдоКонКт;
	ПодвалИтоги.Параметры.ПредставлениеОрганизации = "По данным " + Данные.Шапка.ОрганизацияПредставление;
	ПодвалИтоги.Параметры.РезультатыСверки = АктСверки_ПредставлениеРезультатов(Данные.Шапка, ОрганизацияКонОст);
	Таб.Вывести(ПодвалИтоги);
	
	Если Данные.Шапка.СверкаСогласована Тогда
		
		ПодвалИтоги.Параметры.ОборотыДт = КонтрагентОборотДт;
		ПодвалИтоги.Параметры.ОборотыКт = КонтрагентОборотКт;
		ПодвалИтоги.Параметры.Дебет  = КонтрагентСальдоКонДт;
		ПодвалИтоги.Параметры.Кредит = КонтрагентСальдоКонКт;
		ПодвалИтоги.Параметры.ПредставлениеОрганизации = "По данным " + Данные.Шапка.КонтрагентПредставление;
		ПодвалИтоги.Параметры.РезультатыСверки = АктСверки_ПредставлениеРезультатов(Данные.Шапка, КонтрагентКонОст);
		
	Иначе
		
		ПодвалИтоги.Параметры.ОборотыДт = "";
		ПодвалИтоги.Параметры.ОборотыКт = "";
		ПодвалИтоги.Параметры.Дебет  = "";
		ПодвалИтоги.Параметры.Кредит = "";
		ПодвалИтоги.Параметры.ПредставлениеОрганизации = "";
		ПодвалИтоги.Параметры.РезультатыСверки = "";
		
	КонецЕсли;
	Таб.Присоединить(ПодвалИтоги);
	
	СверкаСогласована = Данные.Шапка.СверкаСогласована;
	
	СуммаРасхождения = ОрганизацияКонОст - КонтрагентКонОст;
	
	Если СверкаСогласована И СуммаРасхождения <> 0 Тогда
		
		ПодвалРасхождение = Макет.ПолучитьОбласть("Расхождение");
		СуммаРасхождения = ?(СуммаРасхождения < 0, - СуммаРасхождения, СуммаРасхождения);
		
		ПодвалРасхождение.Параметры.Расхождение = Общее_ПодставитьПараметрыВСтроку(
			"В результате сверки выявлено расхождение информации о состоянии расчетов в размере %1",
			АктСверки_РазвернутоеПредставлениеСуммы(СуммаРасхождения, ВалютаПредставление, ВалютаКод)
		);
		
		Таб.Вывести(ПодвалРасхождение);
		
	КонецЕсли;
	
	ПодвалПодписи = Макет.ПолучитьОбласть("ПодвалПодпись|Секция");
	ПодвалПодписи.Параметры.ПредставлениеОрганизации = Данные.Шапка.ОрганизацияПредставление;
	ПодвалПодписи.Параметры.Должность = Данные.Шапка.ПредставительОрганизацииДолжность;
	ПодвалПодписи.Параметры.ФИО = Данные.Шапка.ПредставительОрганизацииФИО;
	Таб.Вывести(ПодвалПодписи);
	
	ПодвалПодписи.Параметры.ПредставлениеОрганизации = Данные.Шапка.КонтрагентПредставление;
	ПодвалПодписи.Параметры.Должность = Данные.Шапка.ПредставительКонтрагентаДолжность;
	ПодвалПодписи.Параметры.ФИО = Данные.Шапка.ПредставительКонтрагентаФИО;
	Таб.Присоединить(ПодвалПодписи);
	
	Возврат Таб;
	
КонецФункции

Процедура АктСверки_ВывестиДеталиБезГруппировок(Таб, Макет, Данные)
	
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка|Секция");
	ПустойШаблон = Новый Структура("Дата, ДокументПредставление, Дебет, Кредит");
	
	МаксИндекс = Макс(Данные.ДанныеОрганизации.Количество(), Данные.ДанныеКонтрагента.Количество()) - 1;
	
	Для Индекс = 0 По МаксИндекс Цикл
		
		ЗначенияЗаполнения = ПустойШаблон;
		Если Индекс < Данные.ДанныеОрганизации.Количество() Тогда
			ЗначенияЗаполнения = Данные.ДанныеОрганизации[Индекс];
		КонецЕсли;
		СтрокаТаблицы.Параметры.Заполнить(ЗначенияЗаполнения);
		Таб.Вывести(СтрокаТаблицы);
		
		ЗначенияЗаполнения = ПустойШаблон;
		Если Индекс < Данные.ДанныеКонтрагента.Количество() Тогда
			ЗначенияЗаполнения = Данные.ДанныеКонтрагента[Индекс];
		КонецЕсли;
		СтрокаТаблицы.Параметры.Заполнить(ЗначенияЗаполнения);
		Таб.Присоединить(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АктСверки_ВывестиДеталиПоГруппировкам(Таб, Макет, Данные)
	
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка|Секция");
	СтрокаНачалоДоговора = Макет.получитьОбласть("ДоговорНачалоСекции|Секция");
	СтрокаКонецДоговора = Макет.получитьОбласть("ДоговорКонецСекции|Секция");
	ПустойШаблон = Новый Структура("Дата, ДокументПредставление, Дебет, Кредит");
	
	ПоляГруппировки = Новый Массив;
	
	ИмяКлючевогоПоля = "Аналитика";
	ТолькоУникальныеЗначения = Истина;
	
	АналитикаОрганизации = Данные.ДанныеОрганизации.ВыгрузитьКолонку(ИмяКлючевогоПоля);
	ДополнитьМассивЛокальная(ПоляГруппировки, АналитикаОрганизации, ТолькоУникальныеЗначения);
	
	АналитикаКонтрагента = Данные.ДанныеКонтрагента.ВыгрузитьКолонку(ИмяКлючевогоПоля);
	ДополнитьМассивЛокальная(ПоляГруппировки, АналитикаКонтрагента, ТолькоУникальныеЗначения);
	
	Для Каждого Аналитика Из ПоляГруппировки Цикл
		
		СтрокаНачалоДоговора.Параметры.Договор = Аналитика;
		Таб.Вывести(СтрокаНачалоДоговора);
		Таб.Присоединить(СтрокаНачалоДоговора);
		
		КлючевыеПоля = Новый Структура(ИмяКлючевогоПоля, Аналитика);
		
		ДанныеОрганизации = Данные.ДанныеОрганизации.НайтиСтроки(КлючевыеПоля);
		ДанныеКонтрагента = Данные.ДанныеКонтрагента.НайтиСтроки(КлючевыеПоля);
		
		МаксИндекс = Макс(ДанныеОрганизации.Количество(), ДанныеКонтрагента.Количество()) - 1;
		
		ОрганизацияОборотДт = 0;
		ОрганизацияОборотКт = 0;
		
		КонтрагентОборотДт = 0;
		КонтрагентОборотКт = 0;
		
		Для Индекс = 0 По МаксИндекс Цикл
			
			ЗначенияЗаполнения = ПустойШаблон;
			Если Индекс < ДанныеОрганизации.Количество() Тогда
				
				ЗначенияЗаполнения = ДанныеОрганизации[Индекс];
				ОрганизацияОборотДт = ОрганизацияОборотДт + ЗначенияЗаполнения.Дебет;
				ОрганизацияОборотКт = ОрганизацияОборотКт + ЗначенияЗаполнения.Кредит;
				
			КонецЕсли;
			
			СтрокаТаблицы.Параметры.Заполнить(ЗначенияЗаполнения);
			Таб.Вывести(СтрокаТаблицы);
			
			ЗначенияЗаполнения = ПустойШаблон;
			
			Если Индекс < ДанныеКонтрагента.Количество() Тогда
				
				ЗначенияЗаполнения = ДанныеКонтрагента[Индекс];
				КонтрагентОборотДт = КонтрагентОборотДт + ЗначенияЗаполнения.Дебет;
				КонтрагентОборотКт = КонтрагентОборотКт + ЗначенияЗаполнения.Кредит;
				
			КонецЕсли;
			
			СтрокаТаблицы.Параметры.Заполнить(ЗначенияЗаполнения);
			Таб.Присоединить(СтрокаТаблицы);
			
		КонецЦикла;
		
		СтрокаКонецДоговора.Параметры.Дебет = ОрганизацияОборотДт;
		СтрокаКонецДоговора.Параметры.Кредит = ОрганизацияОборотКт;
		Таб.Вывести(СтрокаКонецДоговора);
		
		СтрокаКонецДоговора.Параметры.Дебет = КонтрагентОборотДт;
		СтрокаКонецДоговора.Параметры.Кредит = КонтрагентОборотКт;
		Таб.Присоединить(СтрокаКонецДоговора);
		
	КонецЦикла;
	
КонецПроцедуры

Функция АктСверки_Подзаголовок(Шапка)
	
	ПериодСверки = ПредставлениеПериода(НачалоДня(Шапка.НачалоПериода), КонецДня(Шапка.КонецПериода), "ФП = Истина");
	Подзаголовок = Общее_ПодставитьПараметрыВСтроку(
		"взаимных расчетов за период: %1
		|между %2
		|и %3",
		ПериодСверки,
		Шапка.ОрганизацияПредставление,
		Шапка.КонтрагентПредставление
	);
	
	Если Шапка.СверкаПоДоговору Тогда
		Подзаголовок = Подзаголовок + Символы.ПС + "по договору " + Шапка.ДоговорПредставление;
	КонецЕсли;
	
	Возврат Подзаголовок;
	
КонецФункции

Функция АктСверки_СтороныСверки(Шапка)
	
	СторонаОрганизации = АктСверки_ПредставлениеСтороны(
		Шапка.ОрганизацияПредставление,
		Шапка.ПредставительОрганизацииФИО,
		Шапка.ПредставительОрганизацииДолжность
	);
	
	СторонаКонтрагента = АктСверки_ПредставлениеСтороны(
		Шапка.КонтрагентПредставление,
		Шапка.ПредставительКонтрагентаФИО,
		Шапка.ПредставительКонтрагентаДолжность
	);
	
	// BSLLS:LineLength-off
	Стороны = Общее_ПодставитьПараметрыВСтроку(
		"Мы, нижеподписавшиеся, представитель %1, с одной стороны, и %2, с другой стороны, составили настоящий акт сверки в том, что состояние взаимных расчетов по данным учета следующее:",
		СторонаОрганизации,
		СторонаКонтрагента
	);
	// BSLLS:LineLength-on
	
	Возврат Стороны;
	
КонецФункции

Функция АктСверки_ПредставлениеРезультатов(Шапка, ОрганизацияИтогСальдо)
	
	ЕстьЗадолженность = (ОрганизацияИтогСальдо <> 0);
	НаДату = Формат(Шапка.КонецПериода, "ДФ=dd.MM.yyyy");
	
	Если ЕстьЗадолженность Тогда
		
		Если ОрганизацияИтогСальдо > 0 Тогда
			Кредитор = Шапка.ОрганизацияПредставление;
			Сумма = ОрганизацияИтогСальдо;
		Иначе
			Кредитор = Шапка.КонтрагентПредставление;
			Сумма = -ОрганизацияИтогСальдо;
		КонецЕсли;
		
		ПредставлениеСуммы = АктСверки_РазвернутоеПредставлениеСуммы(Сумма, Шапка.ВалютаПредставление, Шапка.ВалютаКод);
		
		Результат = Общее_ПодставитьПараметрыВСтроку(
			"на %1 задолженность в пользу %2 %3",
			НаДату,
			Кредитор,
			ПредставлениеСуммы
		);
		
	Иначе
		
		Результат = Общее_ПодставитьПараметрыВСтроку(
			"на %1 задолженность отсутствует",
			НаДату
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки_ПредставлениеСтороны(Знач СторонаПредставление, Знач ПредставительФИО, Знач ПредставительДолжность)
	
	ЧастиПредставления = Новый Массив;
	ЧастиПредставления.Добавить(ПредставительДолжность);
	ЧастиПредставления.Добавить(СторонаПредставление);
	Если ЗначениеЗаполнено(ПредставительФИО) Тогда
		ЧастиПредставления.Добавить(ПредставительФИО);
	КонецЕсли;
	
	Результат = СоединитьСтроку(ЧастиПредставления, " ");
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки_РазвернутоеПредставлениеСуммы(Сумма, ВалютаПредставление, ВалютаКод)
	
	СуммаПрописью = СуммаПрописью(Сумма, ВалютаКод);
	
	Результат = Общее_ПодставитьПараметрыВСтроку(
		"%1 %2 (%3)",
		Формат(Сумма, "ЧДЦ=2"),
		ВалютаПредставление,
		СуммаПрописью
	);
	
	Возврат Результат;
	
КонецФункции

//{ Строковые представления полей

Функция СтрокиПодписей(Signers)
	
	Результат = Новый Структура("ФИО, Подпись, Должность, НомерСВ", "", "", "", "");
	Разделитель = "";
	
	Для Каждого Signer Из Signers Цикл
		
		Результат.ФИО	    = Результат.ФИО		  + Разделитель + СтрокаФИО(Signer.SignerDetails);
		Результат.Подпись   = Результат.Подпись	  + Разделитель + "Электронная подпись";
		Результат.Должность = Результат.Должность + Разделитель + Signer.SignerDetails.JobTitle;
		Результат.НомерСВ   = Результат.НомерСВ	  + Разделитель + Signer.SignerDetails.RegistrationCertificate;
		
		Разделитель = Символы.ПС;
		
		Прервать; // По аналогии с вэбом
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиПодписей_970(СведенияОПодписантах)
	
	Результат = Новый Структура("ФИО, Подпись, Должность", "", "", "");
	Разделитель = "";
	
	Если СведенияОПодписантах.Количество() > 0 Тогда
		
		Результат.ФИО = СтрокаФИО(СведенияОПодписантах[0]);
		Результат.Подпись = "Электронная подпись";
		Результат.Должность = СведенияОПодписантах[0].JobTitle;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиПодписей_ЮЛ_ФЛ(Signers)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ЮЛ", Новый Структура("ФИО, Подпись, Должность", "", "", ""));
	Результат.Вставить("ФЛ", Новый Структура("ФИО, Подпись, Должность, НомерСВ", "", "", "", ""));
	
	РазделительЮЛ = "";
	РазделительФЛ = "";
	
	Для Каждого Signer Из Signers Цикл
		
		Если Signer.SignerDetails.SignerType = "LegalEntity" Тогда
			
			Результат.ЮЛ.ФИО	   = Результат.ЮЛ.ФИО		+ РазделительЮЛ + СтрокаФИО(Signer.SignerDetails);
			Результат.ЮЛ.Подпись   = Результат.ЮЛ.Подпись	+ РазделительЮЛ + "Электронная подпись";
			Результат.ЮЛ.Должность = Результат.ЮЛ.Должность + РазделительЮЛ + Signer.SignerDetails.JobTitle;
			
			РазделительЮЛ = Символы.ПС;
			
		Иначе
			
			Результат.ФЛ.ФИО	   = Результат.ФЛ.ФИО		+ РазделительФЛ + СтрокаФИО(Signer.SignerDetails);
			Результат.ФЛ.Подпись   = Результат.ФЛ.Подпись	+ РазделительФЛ + "Электронная подпись";
			Результат.ФЛ.Должность = Результат.ФЛ.Должность + РазделительФЛ + Signer.SignerDetails.JobTitle;
			Результат.ФЛ.НомерСВ   = Результат.ФЛ.НомерСВ	+ РазделительФЛ + Signer.SignerDetails.RegistrationCertificate;
			
			РазделительФЛ = Символы.ПС;
			
		КонецЕсли;
		
		Прервать; // По аналогии с вэбом
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиПодписей_Акт_УПД(Content)
	
	Результат = Новый Структура("ФИО, Должность", "", "");
	
	Employee = Content.Employee;
	
	Если ЗначениеЗаполнено(Employee.Surname) Тогда
		
		Результат.ФИО	    = СтрокаФИО(Employee);
		Результат.Должность = Employee.EmployeePosition;
			
	Иначе
	
		Signers = Content.Signers;
		
		Разделитель = "";
		
		Для Каждого Signer Из Signers Цикл
			
			Результат.ФИО	    = Результат.ФИО		  + Разделитель + СтрокаФИО(Signer.SignerDetails);
			Результат.Должность = Результат.Должность + Разделитель + Signer.SignerDetails.JobTitle;
			
			Разделитель = Символы.ПС;
			
			Прервать; // По аналогии с вэбом
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиНомеровТД(CustomDeclarations)
	
	Результат = Новый Структура("Страны, КодыСтран, НомераТД", "", "", "");
	
	Если ЗначениеЗаполнено(CustomDeclarations) Тогда
		
		Разделитель = "";
		
		Для Каждого CustomDeclaration Из CustomDeclarations Цикл
			
			Если ЗначениеЗаполнено(CustomDeclaration.CountryCode) ИЛИ ЗначениеЗаполнено(CustomDeclaration.DeclarationNumber) Тогда
				
				НаименованиеСтраны = НаименованиеСтраны(CustomDeclaration.CountryCode);
				
				Результат.Страны 	= Результат.Страны	  + Разделитель + СтрокаИлиДефис(НаименованиеСтраны);
				Результат.КодыСтран	= Результат.КодыСтран + Разделитель + СтрокаИлиДефис(CustomDeclaration.CountryCode);
				Результат.НомераТД	= Результат.НомераТД  + Разделитель + СтрокаИлиДефис(CustomDeclaration.DeclarationNumber);
				
				Разделитель = Символы.ПС;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Результат.Страны	= СтрокаДефис();
		Результат.КодыСтран	= СтрокаДефис();
		Результат.НомераТД	= СтрокаДефис();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиНомеровТД_820(CustomDeclarations)
	
	Результат = Новый Структура("Страны, КодыСтран, НомераТД", "", "", "");
	
	Если ЗначениеЗаполнено(CustomDeclarations) Тогда
		
		КодыСтран	= Новый Массив;
		НомераТД	= Новый Массив;
		
		Разделитель	= "";
		
		Для Каждого CustomDeclaration Из CustomDeclarations Цикл
			
			Если ЭтоИстина(CustomDeclaration.HyphenCountry) Тогда
				Страна		 = СтрокаДефис();
				КодСтраны	 = СтрокаДефис();
			Иначе
				Страна		 = СтрокаИлиДефис(НаименованиеСтраны(CustomDeclaration.CountryCode));
				КодСтраны	 = СтрокаИлиДефис(CustomDeclaration.CountryCode);
			КонецЕсли;
			
			Если КодыСтран.Найти(КодСтраны) = Неопределено Тогда
				
				Результат.Страны	 = Результат.Страны		 + Разделитель + Страна;
				Результат.КодыСтран	 = Результат.КодыСтран	 + Разделитель + КодСтраны;
				
				КодыСтран.Добавить(КодСтраны);
				
			КонецЕсли;
			
			НомерТД = СтрокаИлиДефис(CustomDeclaration.DeclarationNumber);
			
			Если НомераТД.Найти(НомерТД) = Неопределено Тогда
				
				Результат.НомераТД = Результат.НомераТД + Разделитель + НомерТД;
				
				НомераТД.Добавить(НомерТД);
				
			КонецЕсли;
			
			Разделитель = ", ";
			
		КонецЦикла;
		
	Иначе
		
		Результат.Страны	= СтрокаДефис();
		Результат.КодыСтран	= СтрокаДефис();
		Результат.НомераТД	= СтрокаДефис();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиНомеровДТ_970(CustomDeclarations)
	
	Результат = Новый Структура("Страны, КодыСтран, НомераДТ", "", "", "");
	
	Если ЗначениеЗаполнено(CustomDeclarations) Тогда
		
		КодыСтран	= Новый Массив;
		НомераДТ	= Новый Массив;
		
		Разделитель	= "";
		
		Для Каждого CustomDeclaration Из CustomDeclarations Цикл
			
			Страна = СтрокаИлиДефис(НаименованиеСтраны(CustomDeclaration.CountryCode));
			КодСтраны = СтрокаИлиДефис(CustomDeclaration.CountryCode);	
			
			Если КодыСтран.Найти(КодСтраны) = Неопределено Тогда
				
				Результат.Страны = Результат.Страны + Разделитель + Страна;
				Результат.КодыСтран	= Результат.КодыСтран + Разделитель + КодСтраны;
				
				КодыСтран.Добавить(КодСтраны);
				
			КонецЕсли;
			
			НомерДТ = СтрокаИлиДефис(CustomDeclaration.DeclarationNumber);
			
			Если НомераДТ.Найти(НомерДТ) = Неопределено Тогда
				
				Результат.НомераДТ = Результат.НомераДТ + Разделитель + НомерДТ;
				
				НомераДТ.Добавить(НомерДТ);
				
			КонецЕсли;
			
			Разделитель = ", ";
			
		КонецЦикла;
		
	Иначе
		
		Результат.Страны	= СтрокаДефис();
		Результат.КодыСтран	= СтрокаДефис();
		Результат.НомераДТ	= СтрокаДефис();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаНаименованиеСтрокиНакладной(Item)
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(Item, "VendorCode")
		И ЗначениеЗаполнено(Item.VendorCode) Тогда
		Артикул = Item.VendorCode;
	ИначеЕсли ЕстьРеквизитИлиСвойствоОбъектаЛокальная(Item, "Article") 
		И ЗначениеЗаполнено(Item.Article) Тогда
		Артикул = Item.Article;
	Иначе
		Артикул = "";
	КонецЕсли;
	
	ЧастиНаименования = Новый Массив;
	
	ДополнитьМассивНепустымЗначением(ЧастиНаименования, Item.Product); // Наименование
	ДополнитьМассивНепустымЗначением(ЧастиНаименования, Item.Feature); // Характеристика
	ДополнитьМассивНепустымЗначением(ЧастиНаименования, Item.Sort); // Сорт
	ДополнитьМассивНепустымЗначением(ЧастиНаименования, Артикул); // Артикул
	
	Разделитель = ", ";
	Результат = СоединитьСтроку(ЧастиНаименования, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаОснованиеНакладной(Name, Number, Date, Info = "")
	
	Результат = Name;
	
	СтрокаНомерДата = "";
	
	// НомОсн
	Если ЗначениеЗаполнено(Number) Тогда
		СтрокаНомерДата = СтрокаНомерДата + " № " + Number;
	КонецЕсли;
	
	// ДатаОсн
	Если ЗначениеЗаполнено(Date) Тогда
		СтрокаНомерДата = СтрокаНомерДата + " от " + ДатаСтрокой(Date);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаНомерДата) И Найти(Результат, СтрокаНомерДата) = 0 Тогда
		Результат = Результат + СтрокаНомерДата;
	КонецЕсли;
	
	// ДопСвОсн
	Если ЗначениеЗаполнено(Info) Тогда
		Результат = Результат + ", " + Info;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаОснованияКорректировки(CorrectionBases)
	
	Результат = "";
	Разделитель = "";
	
	Для Каждого CorrectionBase Из CorrectionBases Цикл
		
		Результат = Результат + Разделитель + CorrectionBase.BaseDocumentName
		+ ?(ЗначениеЗаполнено(CorrectionBase.BaseDocumentNumber), " № " + CorrectionBase.BaseDocumentNumber, "")
		+ ?(ЗначениеЗаполнено(CorrectionBase.BaseDocumentDate), " от " + ДатаСтрокой(CorrectionBase.BaseDocumentDate), "");
		
		Разделитель = ", ";
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = "отсутствует";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаОснованияКорректировки_736(CorrectionBases)
	
	Результат = "";
	Разделитель = "";
	
	Для Каждого CorrectionBase Из CorrectionBases Цикл
		
		Результат = Результат + Разделитель + CorrectionBase.BaseDocumentName
		+ ?(ЗначениеЗаполнено(CorrectionBase.BaseDocumentNumber), " № " + CorrectionBase.BaseDocumentNumber, "")
		+ ?(ЗначениеЗаполнено(CorrectionBase.BaseDocumentDate), " от " + ДатаСтрокой(CorrectionBase.BaseDocumentDate), "")
		+ ?(ЗначениеЗаполнено(CorrectionBase.AdditionalInfo), ", " + CorrectionBase.AdditionalInfo, "");
		
		Разделитель = ", ";
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = "Без документа-основания";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаПередаточныеДокументы_736(TransferDocDetails)
	
	Результат = "";
	Разделитель = "";
	
	Для Каждого TransferDocDetail Из TransferDocDetails Цикл
		
		Результат = Результат + Разделитель + TransferDocDetail.BaseDocumentName
		+ ?(ЗначениеЗаполнено(TransferDocDetail.BaseDocumentNumber), " № " + TransferDocDetail.BaseDocumentNumber, "")
		+ ?(ЗначениеЗаполнено(TransferDocDetail.BaseDocumentDate), " от " + ДатаСтрокой(TransferDocDetail.BaseDocumentDate), "")
		+ ?(ЗначениеЗаполнено(TransferDocDetail.AdditionalInfo), ", " + TransferDocDetail.AdditionalInfo, "");
		
		Разделитель = ", ";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаИсправленийСФ(Invoices)
	
	Результат = "";
	Разделитель = "";
	
	КоличествоИсправлений = 0;
	
	Для Каждого Invoice Из Invoices Цикл
		
		Для Каждого InvoiceRevision Из Invoice.InvoiceRevisions Цикл
			
			КоличествоИсправлений = КоличествоИсправлений + 1;
			
			Результат = Результат + Разделитель
			+ "№ " + InvoiceRevision.RevisionNumber
			+ " от " + ДатаСтрокой(InvoiceRevision.RevisionDate);
			
			Разделитель = ", ";
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если КоличествоИсправлений = 0 Тогда
		Результат = "исправления № - от - ";
	ИначеЕсли КоличествоИсправлений = 1 Тогда
		Результат = "исправления " + Результат;
	Иначе
		Результат = "исправлений " + Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция СтрокаВалютаКод(КодВалюты)
	
	НаименованиеВалюты = НаименованиеВалюты(КодВалюты, Истина);
	
	Возврат ?(ЗначениеЗаполнено(НаименованиеВалюты), НаименованиеВалюты, СтрокаДефис()) + ?(ЗначениеЗаполнено(КодВалюты), ", " + КодВалюты, "");
	
КонецФункции

Функция СтрокаПредставлениеВалюты_970(Знач Наименование, Код)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = НаименованиеВалюты(Код, Истина);
	КонецЕсли;
	
	Результат = Наименование + ", " + Код;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДокументыОснованияУПД(TransferBases)
	
	Результат	= "";
	Разделитель = "";
	
	Для Каждого TransferBase Из TransferBases Цикл
		
		Результат = Результат + Разделитель + TransferBase.DocumentName 
		+ ?(ЗначениеЗаполнено(TransferBase.DocumentNumber), " № "  + TransferBase.DocumentNumber, "")
		+ ?(ЗначениеЗаполнено(TransferBase.DocumentDate)  , " от " + ДатаСтрокой(TransferBase.DocumentDate), "")
		+ ?(ЗначениеЗаполнено(TransferBase.DocumentInfo)  , ", "   + TransferBase.DocumentInfo, "");
		
		Разделитель = "; ";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДокументыОснованияУПД970(TransferBases)
	
	ПредставлениеДокументов = Новый Массив;
	
	Для Каждого TransferBase Из TransferBases Цикл
		
		РеквизитыДокументаСтрокой = ПредставлениеДокумента(TransferBase.Name, TransferBase.Number, TransferBase.Date);
		
		Если ЗначениеЗаполнено(TransferBase.AdditionalInfo) Тогда
			РеквизитыДокументаСтрокой = РеквизитыДокументаСтрокой + ", " + TransferBase.AdditionalInfo;
		КонецЕсли;
		
		ПредставлениеДокументов.Добавить(РеквизитыДокументаСтрокой);
		
	КонецЦикла;
	
	Результат = СоединитьСтроку(ПредставлениеДокументов, "; ");
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДокументыОснованияАкта552(Grounds)
	
	Результат	= "";
	Разделитель = "";
	
	Для Каждого GroundInfo Из Grounds Цикл
		
		Результат = Результат + Разделитель + GroundInfo.Name 
		+ ?(ЗначениеЗаполнено(GroundInfo.Number), " № "  + GroundInfo.Number, "")
		+ ?(ЗначениеЗаполнено(GroundInfo.Date)  , " от " + ДатаСтрокой(GroundInfo.Date), "")
		+ ?(ЗначениеЗаполнено(GroundInfo.Info)  , ", "   + GroundInfo.Info, "");
		
		Разделитель = "; ";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаИННКПП(OrgInfo)
	
	Если СтрДлина(OrgInfo.Inn) = 10 Тогда
		Возврат OrgInfo.Inn + "/" + СтрокаИлиДефис(OrgInfo.Kpp);
	Иначе
		Возврат СтрокаИлиДефис(OrgInfo.Inn);
	КонецЕсли;
	
КонецФункции

Функция СтрокаИННКПП_820(OrgInfo)
	
	Результат = СтрокаИНН_820(OrgInfo.Inn, OrgInfo.HyphenInn);
	
	Если ЗначениеЗаполнено(OrgInfo.Kpp) Тогда
		Результат = Результат + "/" + OrgInfo.Kpp;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаИННКПП_970(СведенияЮрФизЛица)
	
	ВидыЮрФизЛиц = Перечисление_ВидыЮрФизЛиц();
	
	Если СведенияЮрФизЛица.Type = ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		
		ИНН = СведенияЮрФизЛица.Inn;
		КПП = СведенияЮрФизЛица.Kpp;
		
		Если Не ЗначениеЗаполнено(КПП) Тогда
			КПП = СтрокаДефис();
		КонецЕсли;
		
		Результат = Общее_ПодставитьПараметрыВСтроку("%1/%2", ИНН, КПП);
		
	ИначеЕсли СведенияЮрФизЛица.Type = ВидыЮрФизЛиц.ИндивидуальныйПредприниматель Тогда
		
		Результат = СведенияЮрФизЛица.Inn;
		
	ИначеЕсли СведенияЮрФизЛица.Type = ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		Если ЗначениеЗаполнено(СведенияЮрФизЛица.Inn) Тогда
			Результат = СведенияЮрФизЛица.Inn;
		Иначе
			Результат = СтрокаДефис();
		КонецЕсли;
		
	Иначе
		
		Результат = СтрокаДефис();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаИНН_820(Inn, HyphenInn)
	
	Если ЭтоИстина(HyphenInn) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СтрокаИлиДефис(Inn);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаНаименованиеАдрес(OrgInfo)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(OrgInfo.Name) Тогда
		Адрес = СтрокаАдрес(OrgInfo.Address);
		Результат = OrgInfo.Name + ?(ЗначениеЗаполнено(Адрес), ", ", "") + Адрес;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаНаименованиеАдрес_970(СведенияЮрФизЛица)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СведенияЮрФизЛица.Name) Тогда
		Адрес = СтрокаАдрес_970(СведенияЮрФизЛица.Address);
		Результат = СведенияЮрФизЛица.Name + ?(ЗначениеЗаполнено(Адрес), ", ", "") + Адрес;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАдресТелефонЭлПочта(OrgInfo)
	
	Результат = "";
	Разделитель = "";
	
	// Адрес
	СтрокаАдрес = СтрокаАдрес(OrgInfo.Address);
	Если ЗначениеЗаполнено(СтрокаАдрес) Тогда
		Результат = Результат + Разделитель + СтрокаАдрес;
		Разделитель = ", ";
	КонецЕсли;
	
	// Телефон
	Если ЗначениеЗаполнено(OrgInfo.Phone) Тогда
		Результат = Результат + Разделитель + "тел: " + OrgInfo.Phone;
		Разделитель = ", ";
	КонецЕсли;
	
	// эл. почта
	Если ЗначениеЗаполнено(OrgInfo.Email) Тогда
		Результат = Результат + Разделитель + "e-mail: " + OrgInfo.Email;
		Разделитель = ", ";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАдресТелефонЭлПочта_970(OrgInfo)
	
	ЧастиСтроки = Новый Массив;
	
	Адрес = СтрокаАдрес_970(OrgInfo.Address);
	ЧастиСтроки.Добавить(Адрес);
	
	КонтактныеДанные = СтрокаКонтактныеДанные_970(OrgInfo);
	ЧастиСтроки.Добавить(КонтактныеДанные);
	
	Результат = СоединитьСтроку(ЧастиСтроки, ", ");
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАдресТелефонФакс(OrgInfo)
	
	Результат = "";
	Разделитель = "";
	
	// Адрес
	СтрокаАдрес = СтрокаАдрес(OrgInfo.Address);
	Если ЗначениеЗаполнено(СтрокаАдрес) Тогда
		Результат = Результат + Разделитель + СтрокаАдрес;
		Разделитель = ", ";
	КонецЕсли;
	
	// Телефон
	Если ЗначениеЗаполнено(OrgInfo.Phone) Тогда
		Результат = Результат + Разделитель + "тел: " + OrgInfo.Phone;
		Разделитель = ", ";
	КонецЕсли;
	
	// Факс
	Если ЗначениеЗаполнено(OrgInfo.Fax) Тогда
		Результат = Результат + Разделитель + "факс: " + OrgInfo.Fax;
		Разделитель = ", ";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаТелефонЭлПочта(OrgInfo)
	
	Результат = "";
	Разделитель = "";
	
	// Телефон
	Если ЗначениеЗаполнено(OrgInfo.Phone) Тогда
		Результат = Результат + Разделитель + "Тел: " + OrgInfo.Phone;
		Разделитель = ", ";
	КонецЕсли;
	
	// эл. почта
	Если ЗначениеЗаполнено(OrgInfo.Email) Тогда
		Результат = Результат + Разделитель + "e-mail: " + OrgInfo.Email;
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаКонтактныеДанные_970(OrgInfo)
	
	Разделитель = ", ";
	
	НомерТелефона = СоединитьСтроку(OrgInfo.Phone, Разделитель);
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		НомерТелефона = Общее_ПодставитьПараметрыВСтроку("Тел: %1", НомерТелефона);
	КонецЕсли;
		
	ЭлПочта = СоединитьСтроку(OrgInfo.Email, Разделитель);
	Если ЗначениеЗаполнено(ЭлПочта) Тогда
		ЭлПочта = Общее_ПодставитьПараметрыВСтроку("e-mail: %1", ЭлПочта);
	КонецЕсли;
	
	ИныеКонтакты = OrgInfo.OtherContactInfo;
	Если ЗначениеЗаполнено(ИныеКонтакты) Тогда
		ИныеКонтакты = Общее_ПодставитьПараметрыВСтроку("Иные контакты: %1", ИныеКонтакты);
	КонецЕсли;
	
	ЧастиКИ = Новый Массив;
	ЧастиКИ.Добавить(НомерТелефона);
	ЧастиКИ.Добавить(ЭлПочта);
	ЧастиКИ.Добавить(ИныеКонтакты);
	
	Результат = СоединитьСтроку(ЧастиКИ, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаБанковскиеРеквизиты(OrgInfo)
	
	Результат = "";
	Разделитель = "";
	
	// Номер расчетного счета
	Если ЗначениеЗаполнено(OrgInfo.BankAccountNumber) Тогда
		Результат = Результат + Разделитель + "Р/с: " + OrgInfo.BankAccountNumber;
		Разделитель = ", ";
	КонецЕсли;
	
	// Наименование банка
	Если ЗначениеЗаполнено(OrgInfo.BankName) Тогда
		Результат = Результат + Разделитель + "банк: " + OrgInfo.BankName;
		Разделитель = ", ";
	КонецЕсли;
	
	// БИК
	Если ЗначениеЗаполнено(OrgInfo.BankId) Тогда
		Результат = Результат + Разделитель + "БИК: " + OrgInfo.BankId;
		Разделитель = ", ";
	КонецЕсли;
	
	// Кор. счет
	Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(OrgInfo, "CorrespondentAccount") И ЗначениеЗаполнено(OrgInfo.CorrespondentAccount) Тогда
		Результат = Результат + Разделитель + "к/с: " + OrgInfo.CorrespondentAccount;
		Разделитель = ", ";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаЕдиницаИзмерения(UnitCode, UnitName)
	
	Результат = "";
	
	Если UnitCode = "0000" Тогда
		Результат = UnitName;
	Иначе
		Результат = НаименованиеЕдиницыИзмерения(UnitCode);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаЕдиницаИзмерения_970(UnitName)
	
	Результат = UnitName;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаКодЕдиницыИзмерения820(Unit, HyphenUnit)
	
	Если ЭтоИстина(HyphenUnit) Или Не ЗначениеЗаполнено(Unit) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = Unit;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСуммаВсего_820(Subtotal, HyphenSubtotal)
	
	Если ЭтоИстина(HyphenSubtotal)
		Или Не ЗначениеЗаполнено(Subtotal) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СуммаСтрокой(SubTotal);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция _ПредставлениеНоменклатуры(Часть1, Часть2, Часть3, Часть4, ВыводитьНаименованиеТовараСКодами)
	
	Если ВыводитьНаименованиеТовараСКодами Тогда
		Результат = ПредставлениеНоменклатуры_Полное(Часть1, Часть2, Часть3, Часть4);
	Иначе
		Результат = ПредставлениеНоменклатуры_ПоПриоритету(Часть1, Часть2, Часть3, Часть4);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры_Полное(Часть1, Часть2, Часть3, Часть4)
	
	Результат	 = "";
	Разделитель	 = "";
	
	Если ЗначениеЗаполнено(Часть1) Тогда
		Результат = Результат + Разделитель + Часть1;
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Часть2) Тогда
		Результат = Результат + Разделитель + Часть2;
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Часть3) Тогда
		Результат = Результат + Разделитель + Часть3;
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Часть4) Тогда
		Результат = Результат + Разделитель + Часть4;
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ПредставлениеНоменклатуры_ПоПриоритету(Часть1, Часть2, Часть3, Часть4)
	
	Если ЗначениеЗаполнено(Часть1) Тогда
		Результат = Часть1;
	ИначеЕсли ЗначениеЗаполнено(Часть3) Тогда
		Результат = Часть3;
	ИначеЕсли ЗначениеЗаполнено(Часть2) Тогда
		Результат = Часть2;
	ИначеЕсли ЗначениеЗаполнено(Часть4) Тогда
		Результат = Часть4;
	Иначе
		Результат = "";
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры_УПД_УКД(Item, ВыводитьНаименованиеТовараСКодами)
	
	Результат = _ПредставлениеНоменклатуры(
		Item.Product,
		Item.ItemCharact,
		Item.ItemArticle,
		Неопределено,
		ВыводитьНаименованиеТовараСКодами);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры_СФ_Акт(Item, ВыводитьНаименованиеТовараСКодами)
	
	Результат = _ПредставлениеНоменклатуры(
		Item.Product,
		Item.ItemCharact,
		Item.ItemArticle,
		Item.ItemVendorCode,
		ВыводитьНаименованиеТовараСКодами);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры_Торг12(Item)
	
	ВыводитьНаименованиеТовараСКодами = Истина;
	
	Результат = _ПредставлениеНоменклатуры(
		Item.Product,
		Item.ItemCharact,
		Item.ItemKind,
		Item.ItemArticle,
		ВыводитьНаименованиеТовараСКодами);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры_СчетНаОплату_29(Item)
	
	Результат = "";
	Разделитель = "";
	
	Если ЗначениеЗаполнено(Item.Product) Тогда
		Результат = Item.Product;
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Item.ItemCharact) Тогда
		Результат = Результат + Разделитель + Item.ItemCharact;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = СтрокаДефис();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеКодТов(Item, ВыводитьНаименованиеТовараСКодами)
	
	Результат = "";
	
	Если ВыводитьНаименованиеТовараСКодами Тогда
		Результат = СтрокаИлиДефис(Item.ItemVendorCode);
	Иначе
		
		Если ЗначениеЗаполнено(Item.Product) ИЛИ ЗначениеЗаполнено(Item.ItemCharact)
			ИЛИ ЗначениеЗаполнено(Item.ItemArticle) Тогда
			
			Результат = СтрокаДефис();
			
		КонецЕсли;
		
		Если Результат = "" Тогда 
			Результат = СтрокаИлиДефис(Item.ItemVendorCode);
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеКодТов_СчетНаОплату_29(Item)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Item.ItemArticle) Тогда
		Результат = Строка(Item.ItemArticle);
	Иначе
		Результат = СтрокаИлиДефис(Item.ItemVendorCode);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ПредставлениеСтороны(OrgInfo)
	
	Результат = "";
	Разделитель = ", ";
	
	ЧастиПредставления = Новый Массив;
	
	Наименование = "";
	Если ЗначениеЗаполнено(OrgInfo.Name) Тогда
		Наименование = СокрЛП(OrgInfo.Name);
	КонецЕсли;
	
	ИНН = "";
	Если ЗначениеЗаполнено(OrgInfo.Inn) Тогда
		ИНН = "ИНН " + СокрЛП(OrgInfo.Inn);
	КонецЕсли;
	
	КПП = "";
	Если ЗначениеЗаполнено(OrgInfo.Kpp) Тогда
		КПП = "КПП " + СокрЛП(OrgInfo.Kpp);
	КонецЕсли;
	
	ОГРН = "";
	Если ЗначениеЗаполнено(OrgInfo.Ogrn) Тогда
		ОГРН = "ОГРН " + СокрЛП(OrgInfo.Ogrn);
	КонецЕсли;
	
	ДополнитьМассивНепустымЗначением(ЧастиПредставления, Наименование);
	ДополнитьМассивНепустымЗначением(ЧастиПредставления, ИНН);
	ДополнитьМассивНепустымЗначением(ЧастиПредставления, КПП);
	ДополнитьМассивНепустымЗначением(ЧастиПредставления, ОГРН);
	
	Результат = СоединитьСтроку(
		ЧастиПредставления,
		Разделитель
	);
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаФИО(Content)
	
	Возврат СокрЛП(СокрЛП(Content.Surname) + " " + СокрЛП(Content.FirstName) + " " + СокрЛП(Content.Patronymic));
	
КонецФункции	

Функция СтрокаДоверенность(Attorney)
	
	Результат = "";
	
	Если СтруктураЗаполнена(Attorney) Тогда
		
		Результат = "Доверенность №" + Attorney.Number + " от " + Формат(Attorney.Date, "ДФ=dd.MM.yy") + " выдал " + СтрокаДоверенностьВыдана(Attorney);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция СтрокаДоверенностьВыдана(Attorney)
	
	Результат	= "";
	Разделитель = "";
	
	Если ЗначениеЗаполнено(Attorney.IssuerOrganizationName) Тогда
		Результат = Результат + Разделитель + Attorney.IssuerOrganizationName;
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Attorney.Issuer.JobTitle) Тогда
		Результат = Результат + Разделитель + Attorney.Issuer.JobTitle;
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Attorney.Issuer.FirstName) Тогда
		Результат = Результат + Разделитель + СтрокаФИО(Attorney.Issuer);
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Attorney.IssuerAdditionalInfo) Тогда
		Результат = Результат + Разделитель + Attorney.IssuerAdditionalInfo;
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция СтрокаДоверенностьПолучена(Attorney)
	
	Результат 	= "";
	Разделитель = "";
	
	Если ЗначениеЗаполнено(Attorney.Recipient.JobTitle) Тогда
		Результат = Результат + Разделитель + Attorney.Recipient.JobTitle;
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Attorney.Recipient.FirstName) Тогда
		Результат = Результат + Разделитель + СтрокаФИО(Attorney.Recipient);
		Разделитель = ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Attorney.RecipientAdditionalInfo) Тогда
		Результат = Результат + Разделитель + Attorney.RecipientAdditionalInfo;
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДанныеКонтрагента(OrgInfo)
	
	Результат = "";
	Разделитель = "";
	
	// Наименование
	Если ЗначениеЗаполнено(OrgInfo.Name) Тогда
		Результат = Результат + Разделитель + OrgInfo.Name;
		Разделитель = ", ";
	КонецЕсли;
	
	// ИНН/КПП
	Если ЗначениеЗаполнено(OrgInfo.Inn) Тогда
		Если ЗначениеЗаполнено(OrgInfo.Kpp) Тогда
			Результат = Результат + Разделитель + "ИНН/КПП: " + OrgInfo.Inn + "/" + OrgInfo.Kpp;
			Разделитель = ", ";
		Иначе
			Результат = Результат + Разделитель + "ИНН: " + OrgInfo.Inn;
			Разделитель = ", ";
		КонецЕсли;
	КонецЕсли;
	
	// Адрес
	Адрес = СтрокаАдрес(OrgInfo.Address);
	Если ЗначениеЗаполнено(Адрес) Тогда
		Результат = Результат + Разделитель + Адрес;
		Разделитель = ", ";
	КонецЕсли;
	
	// Телефон
	Если ЗначениеЗаполнено(OrgInfo.Phone) Тогда
		Результат = Результат + Разделитель + OrgInfo.Phone;
		Разделитель = ", ";
	КонецЕсли;
	
	// Факс
	Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(OrgInfo, "Fax") И ЗначениеЗаполнено(OrgInfo.Fax) Тогда
		Результат = Результат + Разделитель + "факс: " + OrgInfo.Fax;
		Разделитель = ", ";
	КонецЕсли;
	
	// Расчетный счет
	Если ЗначениеЗаполнено(OrgInfo.BankAccountNumber) Тогда
		Результат = Результат + Разделитель + "р/с: " + OrgInfo.BankAccountNumber;
		Разделитель = ", ";
	КонецЕсли;
	
	// Наименование банка
	Если ЗначениеЗаполнено(OrgInfo.BankName) Тогда
		Результат = Результат + Разделитель + "в банке " + OrgInfo.BankName;
		Разделитель = ", ";
	КонецЕсли;
	
	// БИК банка
	Если ЗначениеЗаполнено(OrgInfo.BankId) Тогда
		Результат = Результат + Разделитель + "БИК " + OrgInfo.BankId;
		Разделитель = ", ";
	КонецЕсли;
	
	// Кор. счет
	Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(OrgInfo, "CorrespondentAccount") И ЗначениеЗаполнено(OrgInfo.CorrespondentAccount) Тогда
		Результат = Результат + Разделитель + "к/с: " + OrgInfo.CorrespondentAccount;
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 	

Функция СтрокаДанныеКонтрагента_820(OrgInfo)
	
	Результат = "";
	Разделитель = "";
	
	// Наименование
	Если ЗначениеЗаполнено(OrgInfo.Name) Тогда
		Результат = Результат + Разделитель + OrgInfo.Name;
		Разделитель = ", ";
	КонецЕсли;
	
	// ИНН/КПП
	ИННКПП = СтрокаИННКПП_820(OrgInfo);
	Если ЗначениеЗаполнено(OrgInfo.Kpp) Тогда 
		Результат = Результат + Разделитель + "ИНН/КПП: " + ИННКПП;
		Разделитель = ", ";
	Иначе
		Результат = Результат + Разделитель + "ИНН: " + ИННКПП;
		Разделитель = ", ";
	КонецЕсли;
	
	// Адрес
	Адрес = СтрокаАдрес(OrgInfo.Address);
	Если ЗначениеЗаполнено(Адрес) Тогда
		Результат = Результат + Разделитель + Адрес;
		Разделитель = ", ";
	КонецЕсли;
	
	// Телефон
	Если ЗначениеЗаполнено(OrgInfo.Phone) Тогда
		Результат = Результат + Разделитель + OrgInfo.Phone;
		Разделитель = ", ";
	КонецЕсли;
	
	// Факс
	Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(OrgInfo, "Fax") И ЗначениеЗаполнено(OrgInfo.Fax) Тогда
		Результат = Результат + Разделитель + "факс: " + OrgInfo.Fax;
		Разделитель = ", ";
	КонецЕсли;
	
	// эл. почта 
	Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(OrgInfo, "Email") И ЗначениеЗаполнено(OrgInfo.Email) Тогда
		Результат = Результат + Разделитель + OrgInfo.Email;
		Разделитель = ", ";
	КонецЕсли;
	
	// Расчетный счет
	Если ЗначениеЗаполнено(OrgInfo.BankAccountNumber) Тогда
		Результат = Результат + Разделитель + "р/с: " + OrgInfo.BankAccountNumber;
		Разделитель = ", ";
	КонецЕсли;
	
	// Наименование банка
	Если ЗначениеЗаполнено(OrgInfo.BankName) Тогда
		Результат = Результат + Разделитель + "в банке " + OrgInfo.BankName;
		Разделитель = ", ";
	КонецЕсли;
	
	// БИК банка
	Если ЗначениеЗаполнено(OrgInfo.BankId) Тогда
		Результат = Результат + Разделитель + "БИК " + OrgInfo.BankId;
		Разделитель = ", ";
	КонецЕсли;
	
	// Кор. счет
	Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(OrgInfo, "CorrespondentAccount") И ЗначениеЗаполнено(OrgInfo.CorrespondentAccount) Тогда
		Результат = Результат + Разделитель + "к/с: " + OrgInfo.CorrespondentAccount;
		Разделитель = ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 	

Функция СтрокаПредставлениеКонтрагента_970(OrgInfo)
	
	ДанныеКонтрагента = Новый Массив;
	Разделитель = ", ";
	
	ДанныеКонтрагента.Добавить(OrgInfo.Name);
	
	ИННКПП = СтрокаИННКПП_970(OrgInfo);
	Если ЗначениеЗаполнено(ИННКПП) Тогда
		Если ЗначениеЗаполнено(OrgInfo.Kpp) Тогда
			ДанныеКонтрагента.Добавить("ИНН/КПП: " + ИННКПП);
		Иначе
			ДанныеКонтрагента.Добавить("ИНН: " + ИННКПП);
		КонецЕсли;
	КонецЕсли;
	
	АдресИКонтакты = СтрокаАдресТелефонЭлПочта_970(OrgInfo);
	ДанныеКонтрагента.Добавить(АдресИКонтакты);
	
	БанковскиеРеквизиты = СтрокаБанковскиеРеквизиты(OrgInfo);
	Если БанковскиеРеквизиты <> СтрокаДефис() Тогда
		ДанныеКонтрагента.Добавить(БанковскиеРеквизиты);
	КонецЕсли;
	
	Результат = СоединитьСтроку(ДанныеКонтрагента, Разделитель);
	
	Возврат Результат;
	
КонецФункции 	

Процедура ДополнитьМассивНепустымЗначением(Массив, Значение)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Массив.Добавить(Значение);
	КонецЕсли;
	
КонецПроцедуры

Функция ПредставлениеАдрРФ(AddressInfo)
	
	ЧастиАдреса = Новый Массив;
	
	КодРегиона = AddressInfo.RegionCode;
	Регион = НаименованиеРегионаПоКоду(КодРегиона);
	
	Дом = "";
	Если ЗначениеЗаполнено(AddressInfo.Building) Тогда
		Дом = "дом № " + AddressInfo.Building;
	КонецЕсли;
	
	Корпус = "";
	Если ЗначениеЗаполнено(AddressInfo.Block) Тогда
		Корпус = "корпус " + AddressInfo.Block;
	КонецЕсли;
	
	Квартира = "";
	Если ЗначениеЗаполнено(AddressInfo.Apartment) Тогда
		Квартира = "кв " + AddressInfo.Apartment;
	КонецЕсли;
	
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, AddressInfo.ZipCode); // Индекс
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, Регион); // Регион
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, AddressInfo.Territory); // Район
	
	Если НЕ ЭтоГородФедеральногоЗначения(КодРегиона) Тогда
		ДополнитьМассивНепустымЗначением(ЧастиАдреса, AddressInfo.City); // Город
	КонецЕсли;
	
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, AddressInfo.Locality); // Населенный пункт
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, AddressInfo.Street); // Улица
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, Дом); // Дом
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, Корпус); // Корпус
	ДополнитьМассивНепустымЗначением(ЧастиАдреса, Квартира); // Квартира
	
	Разделитель = ", ";
	Результат = СоединитьСтроку(ЧастиАдреса, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция ГородаРегионыФедеральногоЗначения()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("77", "г. Москва");
	Результат.Вставить("78", "г. Санкт-Петербург");
	Результат.Вставить("92", "г. Севастополь");
	Результат.Вставить("99", "иные территории, включая город и космодром Байконур");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеРегионаПоКоду(КодСубъектаРФ)
	
	Регион = НаименованиеРегиона(КодСубъектаРФ);
	
	ГородаФедеральногоЗначения = ГородаРегионыФедеральногоЗначения();
	ГородФедеральногоЗначения = ГородаФедеральногоЗначения.Получить(СокрЛП(КодСубъектаРФ));
	
	Если ГородФедеральногоЗначения <> Неопределено Тогда
		Регион = ГородФедеральногоЗначения;
	КонецЕсли;
	
	Возврат Регион;
	
КонецФункции

Функция ЭтоГородФедеральногоЗначения(КодСубъектаРФ)
	
	ГородаФедеральногоЗначения = ГородаРегионыФедеральногоЗначения();
	РезультатГород = ГородаФедеральногоЗначения.Получить(СокрЛП(КодСубъектаРФ));
	
	Результат = РезультатГород <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеАдрИнф(AddressInfo)
	
	КодСтраны = СокрЛП(AddressInfo.CountryCode);
	
	НаименованиеСтраны = СвойствоСтруктуры(AddressInfo, "Country");
	Если Не ЗначениеЗаполнено(НаименованиеСтраны) Тогда
		НаименованиеСтраны = НаименованиеСтраны(КодСтраны);
	КонецЕсли;
	
	ТекстАдреса = AddressInfo.AddressText;
	
	ЧастиАдреса = Новый Массив;
	
	Если ЗначениеЗаполнено(НаименованиеСтраны) Тогда
		
		ТекстАдресаНеСодержитСтрану = Найти(ТекстАдреса, НаименованиеСтраны) = 0;
		
		Если ТекстАдресаНеСодержитСтрану Тогда
			ЧастиАдреса.Добавить(НаименованиеСтраны);
		КонецЕсли;
		
	Иначе
		ЧастиАдреса.Добавить(КодСтраны);
	КонецЕсли;
	
	ЧастиАдреса.Добавить(ТекстАдреса);
	
	Разделитель = ", ";
	Результат = СоединитьСтроку(ЧастиАдреса, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеАдрГАР(AddressInfo)
	
	ЧастиАдреса = Новый Массив;
	
	ЧастиАдреса.Добавить(AddressInfo.ZipCode);
	
	КодРегиона = AddressInfo.RegionCode;
	
	Если Не ЗначениеЗаполнено(AddressInfo.Region)
		И ЗначениеЗаполнено(КодРегиона) Тогда
		Регион = НаименованиеРегионаПоКоду(КодРегиона);
	Иначе
		Регион = AddressInfo.Region;
	КонецЕсли;
	
	ЧастиАдреса.Добавить(Регион);
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	
	ВидМуниципальногоРайона = НаименованиеВидаМуниципальногоРайонаПоКоду(AddressInfo.MunicipalDistrictCode);
	МуниципальныйРайон = СоединитьЭлементыАдресногоОбъекта(ВидМуниципальногоРайона, AddressInfo.MunicipalDistrict);
	ЧастиАдреса.Добавить(МуниципальныйРайон);
	
	ВидПоселения = НаименованиеВидаПоселенияПоКоду(AddressInfo.SettlementCode);
	ГородПоселение = СоединитьЭлементыАдресногоОбъекта(ВидПоселения, AddressInfo.Settlement);
	ЧастиАдреса.Добавить(ГородПоселение);
	
	НаселенныйПункт = СоединитьЭлементыАдресногоОбъекта(AddressInfo.LocalityType, AddressInfo.Locality);
	ЧастиАдреса.Добавить(НаселенныйПункт);
	
	ЭлементПланировочнойСтруктуры = СоединитьЭлементыАдресногоОбъекта(AddressInfo.PlanningElementType, AddressInfo.PlanningElement);
	ЧастиАдреса.Добавить(ЭлементПланировочнойСтруктуры);
	
	ЭлементУличнойДорожнойСети = СоединитьЭлементыАдресногоОбъекта(AddressInfo.StreetElementType, AddressInfo.StreetElement);
	ЧастиАдреса.Добавить(ЭлементУличнойДорожнойСети);
	
	ЗемельныйУчасток = AddressInfo.LandPlot;
	ЧастиАдреса.Добавить(ЗемельныйУчасток);
	
	Для Каждого ЗданиеСооружение Из AddressInfo.Buildings Цикл
		ЭлЗданиеСооружение = СоединитьЭлементыАдресногоОбъекта(ЗданиеСооружение.Type, ЗданиеСооружение.Number);
		ЧастиАдреса.Добавить(ЭлЗданиеСооружение);
	КонецЦикла;
	
	ПомещениеВЗдании = СоединитьЭлементыАдресногоОбъекта(AddressInfo.HouseType, AddressInfo.House);
	ЧастиАдреса.Добавить(ПомещениеВЗдании);
	
	ПомещениеВКвартире = СоединитьЭлементыАдресногоОбъекта(AddressInfo.ApartmentType, AddressInfo.Apartment);
	ЧастиАдреса.Добавить(ПомещениеВКвартире);

	Разделитель = ", ";
	Результат = СоединитьСтроку(ЧастиАдреса, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)
	
	ЭлементыОбъекта = Новый Массив;
	ЭлементыОбъекта.Добавить(Элемент1);
	ЭлементыОбъекта.Добавить(Элемент2);
	
	Результат = СоединитьСтроку(ЭлементыОбъекта, " ");
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеКодГАР(AddressInfo)
	
	КодГар = СокрЛП(AddressInfo.AddressCode);
	Результат = "Код адреса: " + КодГар;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАдрес(AddressInfo)
	
	Если AddressInfo.IsForeign = Ложь И ЗначениеЗаполнено(AddressInfo.RegionCode) Тогда
		
		Результат = ПредставлениеАдрРФ(AddressInfo);
		
	ИначеЕсли ЗначениеЗаполнено(AddressInfo.AddressText) Тогда
		
		Результат = ПредставлениеАдрИнф(AddressInfo);
		
	Иначе
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАдрес_970(AddressInfo)
	
	ВидыАдресов = Перечисление_ВидыАдресов();
	
	Если AddressInfo.Type = ВидыАдресов.АдресРФ Тогда
		
		Результат = ПредставлениеАдрРФ(AddressInfo.AddressRF);
		ДополнитьСтрокуАдресаРФИнымиСведениями(Результат, AddressInfo.AddressRF);
				
	ИначеЕсли AddressInfo.Type = ВидыАдресов.АдресГАР Тогда
		
		Результат = ПредставлениеАдрГАР(AddressInfo.AddressSAR);
		
	ИначеЕсли AddressInfo.Type = ВидыАдресов.АдресСтрокой Тогда
		
		Результат = ПредставлениеАдрИнф(AddressInfo.AddressText);
		
	Иначе
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСтрокуАдресаРФИнымиСведениями(Результат, AddressRF)

	ИныеСведения = AddressRF.AdditionalInfo;
	
	Если ЗначениеЗаполнено(ИныеСведения) Тогда
		
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(Результат);
		ЧастиСтроки.Добавить(ИныеСведения);
		
		Разделитель = ", ";
		Результат = СоединитьСтроку(ЧастиСтроки, Разделитель);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция СтрокаАдрес_736(AddressInfo)
	
	Если AddressInfo.IsForeign = Ложь И ЗначениеЗаполнено(AddressInfo.RegionCode) Тогда
		
		Результат = ПредставлениеАдрРФ(AddressInfo);
		
	ИначеЕсли ЗначениеЗаполнено(AddressInfo.AddressText) Тогда
		
		Результат = ПредставлениеАдрИнф(AddressInfo);
	
	ИначеЕсли ЗначениеЗаполнено(AddressInfo.AddressCode) Тогда
		
		Результат = ПредставлениеКодГАР(AddressInfo);
		
	Иначе
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаПРД(PaymentDocuments)
	
	Результат = "";
	Разделитель = "";
	
	Для Каждого PaymentDocument Из PaymentDocuments Цикл
		
		Если ЗначениеЗаполнено(PaymentDocument.Number)
			ИЛИ ЗначениеЗаполнено(PaymentDocument.Date) Тогда
			
			Результат = Результат + Разделитель + "№ " + PaymentDocument.Number + " от " + ДатаСтрокой(PaymentDocument.Date);
			Разделитель = ", ";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = ?(ЗначениеЗаполнено(Результат), Результат, СтрокаДефис());
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДокументыОбОтгрузке(DocumentShipments)
	
	Результат 	= "";
	Разделитель = "";
	СимволНПП 	= Символы.НПП;
	
	Для Каждого DocumentShipment Из DocumentShipments Цикл
		
		Номер 	= DocumentShipment.Number;
		Дата 	= DocumentShipment.Date;
		
		Если НЕ ЗначениеЗаполнено(Номер)
			И НЕ ЗначениеЗаполнено(Дата) Тогда
			Продолжить;				
		КонецЕсли;
		
		Результат = Результат + Разделитель + "№" + СимволНПП + Номер;
		
		Если ЗначениеЗаполнено(Дата) Тогда
			
			Результат = Результат + СимволНПП + "от" + СимволНПП + ДатаСтрокой(Дата);
			
		КонецЕсли;

		Разделитель = "; ";
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
	
		Результат = СтрокаДефис();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДокументыОбОтгрузкеВРедакции1096(DocumentShipments)
	
	СимволНПП = Символы.НПП;
	
	ДокументыОбОтгрузке = Новый Массив;
	
	Для Каждого DocumentShipment Из DocumentShipments Цикл
		
		Наименование = DocumentShipment.Name;
		Номер = DocumentShipment.Number;
		Дата = DocumentShipment.Date;
		
		Если НЕ ЗначениеЗаполнено(Наименование)
			И НЕ ЗначениеЗаполнено(Номер) Тогда
			Продолжить;				
		КонецЕсли;
		
		ПредставлениеДокумента = ПредставлениеДокумента(Наименование, Номер, Дата);
		
		ДокументыОбОтгрузке.Добавить(ПредставлениеДокумента);
		
	КонецЦикла;
	
	Если ДокументыОбОтгрузке.Количество() = 0 Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СоединитьСтроку(ДокументыОбОтгрузке, "; ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеДокумента(Наименование, Номер, Дата)
	
	СимволНПП = Символы.НПП;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(Наименование);
	
	Если ЗначениеЗаполнено(Номер) Тогда
		ЧастиСтроки.Добавить("№" + СимволНПП + Номер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		ЧастиСтроки.Добавить("от" + СимволНПП + ДатаСтрокой(Дата));
	КонецЕсли;
	
	Результат = СоединитьСтроку(ЧастиСтроки, СимволНПП);
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАвансовыеДокументы(AccompanyingDocuments)
	
	Результат = СтрокаДефис();
	
	СопроводительныеДокументы = Новый Массив;
	
	Для Каждого Элемент Из AccompanyingDocuments Цикл
		
		Если Элемент.Name <> Конст_имяДокументаАСЧФ() Тогда
			Продолжить;
		КонецЕсли;
		
		ДопСведения = СвойствоСтруктуры(Элемент, "AdditionalInfo");
		
		ПредставлениеДокумента = ПредставлениеАвансовогоДокумента(Элемент.Number, Элемент.Date, ДопСведения);
		СопроводительныеДокументы.Добавить(ПредставлениеДокумента);
		
	КонецЦикла;
	
	Если СопроводительныеДокументы.Количество() > 0 Тогда
		Результат = СоединитьСтроку(СопроводительныеДокументы, "; ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Конст_ИмяДокументаАСЧФ()
	Возврат "АСЧФ";
КонецФункции

Функция ПредставлениеАвансовогоДокумента(Номер, Дата, ДопСведения)
	
	СимволНПП = Символы.НПП;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить("№" + СимволНПП + Номер);
	ЧастиСтроки.Добавить("от" + СимволНПП + ДатаСтрокой(Дата));
	
	Результат = СоединитьСтроку(ЧастиСтроки, СимволНПП);
	
	Если ЗначениеЗаполнено(ДопСведения) Тогда
		Результат = Результат + "," + СимволНПП + ДопСведения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСтавкаНДС(TaxRate)
	
	Если НРег(TaxRate) = "исчналаг" Тогда
		Возврат "НДС исчисляется налоговым агентом";
	ИначеЕсли НРег(TaxRate) = НРег(СтрокаБезНДС()) Или НЕ ЗначениеЗаполнено(TaxRate) Тогда
		Возврат СтрокаБезНДС();
	Иначе
		Если Найти(TaxRate, "/") > 0 Тогда // Авансовые ставки: "20/120", "18/118", "10/110".
			Возврат СокрЛП(TaxRate);
		Иначе
			Возврат СокрЛП(TaxRate) + "%";
		КонецЕсли;			
	КонецЕсли;
	
КонецФункции

Функция СтрокаСуммаНДС(Vat, TaxRate)
	
	// Заполнение строк графы 8 счета-фактуры и аналогичных колонок КСФ.
	
	Если ЗначениеЗаполнено(Vat) Тогда
		// Если СуммаНДС отличается от нуля - выведем ее в любом случае, ошибочно это или нет.
		Результат = Число_В_Формат(Vat, "ЧДЦ=2; ЧН=");
	
	// Если СуммаНДС не заполнено (0 или Неопределено), то посмотрим на ставку НДС и интерпретируем ее.
	ИначеЕсли НРег(TaxRate) = "исчналаг" Тогда
		Результат = СтрокаДефис();
	ИначеЕсли НРег(TaxRate) = НРег(СтрокаБезНДС()) Тогда
		Результат = СтрокаБезНДС();
	ИначеЕсли НРег(TaxRate) = "0" Тогда
		Результат = "0";
	ИначеЕсли Vat = 0 Тогда
		// Если после этого СуммаНДС = 0, то ее надо указать именно как 0
		Результат = Число_В_Формат(Vat, "ЧДЦ=2; ЧН=");
	Иначе
		// Если СуммаНДС Неопределено, но при этом налоговая ставка не соответствует, то покажем это явно.
		Результат = "#ОШИБКА#";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСуммаНДС_820(Vat, WithoutVat, HyphenVat, TaxRate)
	
	Если ЭтоИстина(WithoutVat) Тогда
		Результат = СтрокаБезНДС();
	ИначеЕсли ЭтоИстина(HyphenVat)
		Или Не ЗначениеЗаполнено(Vat) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СтрокаСуммаНДС(Vat, TaxRate);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСуммаНДС_970(СуммаНДС, БезНДС, СтавкаНДС)
	
	Если ЭтоИстина(БезНДС) Тогда
		Результат = СтрокаБезНДС();
	ИначеЕсли Не ЗначениеЗаполнено(СуммаНДС) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СтрокаСуммаНДС(СуммаНДС, СтавкаНДС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСуммаНДС_736(Vat, WithoutVat, TaxRate)
	
	Если ЭтоИстина(WithoutVat) Тогда
		Результат = СтрокаБезНДС();
	Иначе
		Результат = СтрокаСуммаНДС(Vat, TaxRate);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодвалСуммаНДС(Сумма)
	
	// Заполнение итогов графы 8 счета-фактуры и аналогичных колонок КСФ.
	
	Если ЕстьЗначениеСуммы(Сумма) Тогда
		Результат = Число_В_Формат(Сумма, "ЧДЦ=2; ЧН=");
	ИначеЕсли НЕ ЗначениеЗаполнено(Сумма) Тогда
		Результат = СтрокаБезНДС();
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодвалСуммаНДС_820(Vat, WithoutVat, HyphenVat)
	
	Если ЭтоИстина(WithoutVat) Тогда
		Результат = СтрокаБезНДС();
	ИначеЕсли ЭтоИстина(HyphenVat)
		Или Не ЗначениеЗаполнено(Vat) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СуммаСтрокой(Vat);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПодвалСуммаНДС_970(СуммаНДС, БезНДС)
	
	Если ЭтоИстина(БезНДС) Тогда
		Результат = СтрокаБезНДС();
	ИначеЕсли Не ЗначениеЗаполнено(СуммаНДС) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СуммаСтрокой(СуммаНДС);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПодвалСуммаВсего_820(Total, HyphenTotal)
	
	Если ЭтоИстина(HyphenTotal)
		Или Не ЗначениеЗаполнено(Total) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СуммаСтрокой(Total);
	КонецЕсли;	
		
	Возврат Результат;
	
КонецФункции

Функция СтрокаСуммаВсего(Subtotal, TaxRate = "", СтрокаФормат)
	// заполнение графы 9 счета-фактуры и аналогичных колонок КСФ
	
	Если ЗначениеЗаполнено(Subtotal) Тогда
		// выведем сумму в любом случае, даже если она указана ошибочно
		Возврат Число_В_Формат(SubTotal, СтрокаФормат);
	КонецЕсли;
	
	Если НРег(TaxRate) = "исчналаг" Тогда
		Возврат СтрокаДефис();
	Иначе	
		Возврат Число_В_Формат(SubTotal, СтрокаФормат);
	КонецЕсли;
	
КонецФункции

Функция СтрокаСумма(Сумма, ФорматнаяСтрока, ПустоеЗначение)
	
	Если Сумма = 0 Тогда
		Возврат Число_В_Формат(Сумма, ФорматнаяСтрока);
	Иначе
		Возврат Число_В_Формат(Сумма, ФорматнаяСтрока, ПустоеЗначение);
	КонецЕсли;
	
КонецФункции

Функция СуммаВсегоПрописью_820(Total, HyphenTotal, Currency)
	
	Если ЭтоИстина(HyphenTotal)
		Или Total = Неопределено Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СуммаПрописью(Total, Currency);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуммаНДСПрописью_820(Vat, HyphenVat, Currency)
	
	Если ЭтоИстина(HyphenVat)
		Или Не ЗначениеЗаполнено(Vat) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = СуммаПрописью(Vat, Currency);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАкциз(Excise, TaxRate = "")
	
	Если Найти(TaxRate, "/") > 0 Тогда // Авансовые ставки: "20/120", "18/118", "10/110".
		
		Если Нрег(СокрЛП(Excise)) = СтрокаБезАкциза() Тогда
			Возврат СтрокаДефис();
		Иначе
			Возврат СуммаСтрокойИлиДефис(Excise);
		КонецЕсли;
		
	Иначе
		Возврат Число_В_Формат(Excise, ФорматСуммы(), СтрокаБезАкциза());
	КонецЕсли;
	
КонецФункции

Функция СтрокаАкциз_820(Excise)
	
	Если Excise = Неопределено Тогда
		Результат = "без акциза";
	Иначе
		Результат = СуммаСтрокойИлиДефис(Excise);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаАкциз_970(СуммаАкциза)
	
	Если СуммаАкциза = Неопределено Тогда
		Результат = СтрокаБезАкциза();
	Иначе
		Результат = СуммаСтрокойИлиДефис(СуммаАкциза);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеВалютыТорг12(КодВалюты)
	
	Если КодВалюты = "643" Тогда
		Возврат "руб. коп.";
	Иначе
		Возврат НаименованиеВалюты(КодВалюты);
	КонецЕсли;
	
КонецФункции

// Возвращает представление коллекции OriginalInvoices, пример:
//  № 10 от 10.10.2017, с учетом исправления № 1 от 11.10.2017
//  № 15 от 10.10.2017, с учетом исправления № 1 от 12.10.2017
//
Функция СтрокаСчетаФактурыКСФ(OriginalInvoices)
	
	Результат = "";
	Разделитель = "";
	
	Для каждого OriginalInvoice Из OriginalInvoices Цикл
		
		Результат = Результат + Разделитель
		+ "№ " + СтрокаИлиДефис(OriginalInvoice.Number)
		+ " от " + ДатаСтрокойИлиДефис(OriginalInvoice.Date)
		+ ", с учетом исправления № " + СтрокаИлиДефис(OriginalInvoice.InvoiceRevisionNumber)
		+ " от " + ДатаСтрокойИлиДефис(OriginalInvoice.InvoiceRevisionDate);
		
		Разделитель = Символы.ПС;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = "№ - от -, с учетом исправления № - от -";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление коллекции Invoices, пример:
//  № 10 от 10.10.2017, с учетом исправлений № 1 от 11.10.2017, № 2 от 12.10.2017
//  № 15 от 10.10.2017, с учетом исправления № 1 от 12.10.2017
//
Функция СтрокаСтрокаСчетаФактурыУКД(Invoices)
	
	Результат = "";
	Разделитель = "";
	
	Для каждого Invoice Из Invoices Цикл
		
		СтрокаСчетаФактуры = "№ " + СтрокаИлиДефис(Invoice.InvoiceNumber) + " от " + ДатаСтрокойИлиДефис(Invoice.InvoiceDate);
		
		СтрокаИсправлений = "";
		
		Если Invoice.InvoiceRevisions.Количество() > 1 Тогда
			РазделительИсправлений = ", с учетом исправлений ";
		Иначе
			РазделительИсправлений = ", с учетом исправления ";
		КонецЕсли;
		
		Для каждого InvoiceRevision Из Invoice.InvoiceRevisions Цикл
			
			СтрокаИсправлений = СтрокаИсправлений + РазделительИсправлений
			+ " № " + СтрокаИлиДефис(InvoiceRevision.RevisionNumber)
			+ " от " + ДатаСтрокойИлиДефис(InvoiceRevision.RevisionDate);
			
			РазделительИсправлений = ", ";
			
		КонецЦикла; 
		
		Если НЕ ЗначениеЗаполнено(СтрокаИсправлений) Тогда
			СтрокаИсправлений = ", с учетом исправления № - от -";
		КонецЕсли;
		
		Результат = Результат + Разделитель + СтрокаСчетаФактуры + СтрокаИсправлений;
		Разделитель = Символы.ПС;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = "№ - от -, с учетом исправления № - от -";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаРазнСумНал(Vat, TaxRate)
	
	СуммаНДСНеопределена	= (Vat = Неопределено);
		
	НеобходимоВывестиДефис = 	СуммаНДСНеопределена
							Или ЭтоСтавка_ИсчисляетсяНалоговымАгентом(TaxRate)
							Или ЭтоСтавка_БезНДС(TaxRate);
	
	Если НеобходимоВывестиДефис Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = Число_В_Формат(Vat, "ЧДЦ=2; ЧН=");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСтоим(Total, TaxRate)
	
	Если Total = Неопределено Или НРег(TaxRate) = "исчналаг" Тогда
		Возврат СтрокаДефис();
	Иначе
		Возврат Число_В_Формат(Total, "ЧДЦ=2; ЧН=");
	КонецЕсли;
	
КонецФункции

Функция СтрокаСумНДСУвелУм(Сумма, НДС_ИсчНалАг, ЕстьСтавкаНДС, ВыводитьПрочерк)
	
	Результат = "";
	
	Если НДС_ИсчНалАг Тогда
		
		Результат = СтрокаДефис();
		
	ИначеЕсли Не ЕстьСтавкаНДС И Не ВыводитьПрочерк Тогда
		
		Результат = СтрокаБезНДС();
		
	ИначеЕсли ЕстьЗначениеСуммы(Сумма) Тогда
		
		Результат = Число_В_Формат(Сумма, "ЧДЦ=2; ЧН=");
		
	Иначе
		
		Результат = СтрокаДефис();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаВсегоУвелУм(Сумма, НДСИНА, ВыводитьПрочерк)
	
	Результат = "";
	
	Если НДСИНА Тогда 
		
		Результат = СтрокаДефис();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Сумма) И ВыводитьПрочерк Тогда
		
		Результат = СтрокаДефис();
		
	Иначе
		
		Результат = Число_В_Формат(Сумма, "ЧДЦ=2; ЧН=");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСтатусУПД(ФункцияУПД)
	
	БазоваяФункция = ProtoFunctionType(ФункцияУПД);
	
	Если БазоваяФункция = ПротофункцияInvoice() Тогда
		
		Результат = "Счет-фактура - 1";
		
	ИначеЕсли БазоваяФункция = ПротофункцияInvoiceAndBasic() Тогда
		
		Результат = "Счет-фактура и передаточный документ - 1";
		
	ИначеЕсли БазоваяФункция = ПротофункцияBasic() Тогда
		
		Результат = "Передаточный документ - 2";
		
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСтатусУКД(ФункцияУКД)
	
	БазоваяФункция = ProtoFunctionType(ФункцияУКД);
	
	Если БазоваяФункция = ПротофункцияInvoice() Тогда
		
		Результат = "Корректировочный счет-фактура - 1";
		
	ИначеЕсли БазоваяФункция = ПротофункцияInvoiceAndBasic() Тогда
		
		Результат = "Корректировочный счет-фактура и соглашение (уведомление) - 1";
		
	ИначеЕсли БазоваяФункция = ПротофункцияBasic() Тогда
		
		Результат = "Соглашение (уведомление) -2";
		
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строку с постановлением редакции УПД в зависимости от даты
//
// Параметры:
//  ДатаРедакции - Дата - значение, представление которого нужно получить
//  БазовыйФормат - Строка - базовый формат документа
//
// Возвращаемое значение:
//  Строка
//
Функция СтрокаРедакцииУПД(ДатаРедакции)
	
	Если ДатаРедакции >= ДатаРедакции1096() Тогда
		
		Результат =
		"(в ред. Постановления Правительства РФ от 16 августа 2024 г. № 1096)
		|(печатная форма может содержать дополнительные реквизиты)";
		
	ИначеЕсли ДатаРедакции >= ДатаРедакции534() Тогда
		
		Результат = 
		"(в ред. Постановления Правительства РФ от 2 апреля 2021 г. N 534)
		|(печатная форма может содержать дополнительные реквизиты)";
		
	ИначеЕсли ДатаРедакции >= ДатаРедакции981() Тогда
		
		Результат =
		"(в ред. Постановления Правительства РФ от 19.08.2017 №981)
		|(печатная форма может содержать дополнительные реквизиты)";
		
	ИначеЕсли ДатаРедакции >= ДатаРедакции625() Тогда
		
		Результат =
		"(в ред. Постановления Правительства РФ от 25.05.2017 №625)
		|(печатная форма может содержать дополнительные реквизиты)";
		
	Иначе
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаПостановлениеУПД_УКД(ДляУКД = Ложь)
	
	НомерПриложения = "1";
	Если ДляУКД Тогда
		НомерПриложения = "2";
	КонецЕсли;
	
	Результат = "Приложение № " + НомерПриложения + " к постановлению Правительства Российской Федерации от 26 декабря 2011 г. № 1137";
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДатаИсправления_820(RevisionDate, HyphenRevisionDate)
	
	Если ЭтоИстина(HyphenRevisionDate)
		Или Не ЗначениеЗаполнено(RevisionDate) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = ДатаСтрокой(RevisionDate);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДатаИсправления_970(ДатаИсправительногоДокумента)
	
	Если ЗначениеЗаполнено(ДатаИсправительногоДокумента) Тогда
		Результат = ДатаСтрокой(ДатаИсправительногоДокумента);	
	Иначе
		Результат = СтрокаДефис();	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаНомерИсправления_820(RevisionNumber, HyphenRevisionNumber)
	
	Если ЭтоИстина(HyphenRevisionNumber)
		Или Не ЗначениеЗаполнено(RevisionNumber) Тогда
		Результат = СтрокаДефис();
	Иначе
		Результат = RevisionNumber;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаНомерИсправления_970(НомерИсправительногоДокумента)
	
	Если ЗначениеЗаполнено(НомерИсправительногоДокумента) Тогда
		Результат = НомерИсправительногоДокумента;	
	Иначе
		Результат = СтрокаДефис();	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСодержаниеОперации(BuyerContent)
	
	Если ЗначениеЗаполнено(BuyerContent.OperationContent) Тогда
		Результат = BuyerContent.OperationContent;
	ИначеЕсли ЗначениеЗаполнено(BuyerContent.ContentOperCode) Тогда
		Результат = СтрокаКодСодержанияОперации(BuyerContent.ContentOperCode);
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСодержаниеОперации_970(BuyerContent)
	
	Если ЗначениеЗаполнено(BuyerContent.OperationContent) Тогда
		Результат = BuyerContent.OperationContent;
	ИначеЕсли ЗначениеЗаполнено(BuyerContent.ContentOperCode) Тогда
		Результат = СтрокаКодСодержанияОперации_970(BuyerContent.ContentOperCode);
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаКодСодержанияОперации(ContentOperCode)
	
	НаимДокРасх	 = ContentOperCode.NameDiscrepDocument;
	ВидДокРасх	 = ContentOperCode.TypeDiscrepDocument;
	НомДокРасх	 = ContentOperCode.NumberDiscrepDocument;
	ДатаДокРасх	 = ContentOperCode.DateDiscrepDocument;
	
	Если Не ЗначениеЗаполнено(НаимДокРасх) Тогда
		
		Если ВидДокРасх = "2" Тогда
			НаимДокРасх = "Документ о приемке с расхождениями";
		ИначеЕсли ВидДокРасх = "3" Тогда
			НаимДокРасх = "Документ о расхождениях";
		Иначе
			Если ЗначениеЗаполнено(НомДокРасх)
				Или ЗначениеЗаполнено(ДатаДокРасх) Тогда
				НаимДокРасх = "Документ";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаимДокРасх) Тогда
		НаимДокРасх = ": " + НаимДокРасх;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомДокРасх) Тогда
		НомДокРасх = " №" + НомДокРасх;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаДокРасх) Тогда
		ДатаДокРасх = " от " + ДатаСтрокой(ДатаДокРасх);
	Иначе
		ДатаДокРасх = "";
	КонецЕсли;
	
	РезультатПриемки = РезультатПриемкиУПД(ContentOperCode.TotalCode);
	
	Результат = РезультатПриемки + НаимДокРасх + НомДокРасх + ДатаДокРасх;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаКодСодержанияОперации_970(ContentOperCode)
	
	ЧастиСтроки = Новый Массив;
	
	РезультатПриемки = РезультатПриемкиУПД(ContentOperCode.TotalCode);
	ЧастиСтроки.Добавить(РезультатПриемки);
	
	DiscrepDocument = ContentOperCode.DiscrepDocument;
	Если ЗначениеЗаполнено(DiscrepDocument.Name) Тогда
		ПредставлениеДокумента = ПредставлениеДокумента(DiscrepDocument.Name, DiscrepDocument.Number, DiscrepDocument.Date);
		ЧастиСтроки.Добавить(ПредставлениеДокумента);
	КонецЕсли;
			
	Результат = СоединитьСтроку(ЧастиСтроки, ": ");

	Возврат Результат;
	
КонецФункции

Функция РезультатПриемкиУПД(КодПриемки)
	
	РезультатыПриемки = Новый Соответствие;
	РезультатыПриемки.Вставить("1", "Товары (работы, услуги, права) приняты без расхождений (претензий)");
	РезультатыПриемки.Вставить("2", "Товары (работы, услуги, права) приняты с расхождениями (претензией)");
	РезультатыПриемки.Вставить("3", "Товары (работы, услуги, права) не приняты");
	
	Результат = РезультатыПриемки[КодПриемки];
	
	Возврат Результат;
	
КонецФункции

Функция НадписьИдентификаторГосконтракта(ДатаРедакции, ПеренестиСтрокуПриНаличии = Ложь)
	
	Результат = "Идентификатор государственного контракта, договора (соглашения)";
	
	Если ДатаРедакции >= ДатаРедакции981() Тогда
		
		Разделитель = ?(ПеренестиСтрокуПриНаличии, Символы.ПС, " ");
		
		Результат = Результат + Разделитель + "(при наличии)";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НадписьАвансовыеДокументы()
	
	Результат = "К счету-фактуре (счетам-фактурам), выставленному (выставленным) при получении оплаты, частичной оплаты";
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает произвольное значение в число.
//
// Параметры:
//  Значение - Произвольный - произвольное значение.
// 
// Возвращаемое значение:
//  Число - результат преобразования.
//
// Пример:
//   Цена = Привести_К_Числу("1 000,50"); // результат 1000.5
//
Функция Привести_К_Числу(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда // нечего преобразовывать
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда // удалим пробелы
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьЗначениеСуммы(Сумма)
	
	Результат = (ЗначениеЗаполнено(Сумма) Или Сумма = 0);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеВидаМуниципальногоРайонаПоКоду(Код)
	
	Если Код = "1" Тогда
		Результат = "м.р-н"; // муниципальный район
	ИначеЕсли Код = "2" Тогда
		Результат = "г.о."; // городской округ
	ИначеЕсли Код = "3" Тогда
		Результат = "вн.тер.г."; // внутригородская территория города федерального значения
	ИначеЕсли Код = "4" Тогда
		Результат = "м.о."; // муниципальный округ
	ИначеЕсли Код = "5" Тогда
		Результат = "ф.т."; // федеральная территория
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция НаименованиеВидаПоселенияПоКоду(Код)
	
	Если Код = "1" Тогда
		Результат = "г.п."; // городское поселение
	ИначеЕсли Код = "2" Тогда
		Результат = "с.п."; // сельское поселение
	ИначеЕсли Код = "3" Тогда
		Результат = "меж.тер."; // межселенная территория в составе муниципального района
	ИначеЕсли Код = "4" Тогда
		Результат = "вн.р-н"; // внутригородской район городского округа
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаНомерСВ425(IndividualEntityRegistrationCertificate)
	
	МассивДанных = РазделитьСтрокуЛок(IndividualEntityRegistrationCertificate, ";");
	
	// BSLLS:MagicNumber-off
	Пока МассивДанных.Количество() < 2 Цикл
		МассивДанных.Добавить("");
	КонецЦикла;
	// BSLLS:MagicNumber-on
	
	ШаблонСтрокиНомерСВ = "ОГРНИП %1, дата регистрации %2";
	
	Результат = Общее_ПодставитьПараметрыВСтроку(
		ШаблонСтрокиНомерСВ,
		МассивДанных[0],
		СтрокаИлиДефис(МассивДанных[1])
	);
	
	Возврат Результат;
	
КонецФункции

//} Строковые представления полей

//{ Вспомогательные методы печатных форм

// Возвращает представление числа в указанном формате, число можно передавать строкой.
// Увеличивает точность формата под точность числа, увеличивая в форматной строке значение ключа ЧДЦ=.
//
// Важно! Для числа 0 метод Формат с пустой форматной строкой работает иначе чем преобразование к строке:
// 	Формат(0) = ""
// 	Строка(0) = "0"
//
Функция Число_В_Формат(ЧислоСтрока, Знач ФорматнаяСтрока = "", ПустоеЗначение = Неопределено)
	
	Попытка
		Значение = Число(ЧислоСтрока);
	Исключение
		Значение = ЧислоСтрока;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Значение) И ПустоеЗначение <> Неопределено Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	// Расточка точности форматной строки под точность значения,
	// для отображения значений большей точности чем в указанном формате.
	Если ЗначениеЗаполнено(ФорматнаяСтрока) И ТипЗнч(Значение) = Тип("Число") Тогда
		
		ПозицияЧДЦ = Найти(ФорматнаяСтрока, "ЧДЦ=");
		Если ПозицияЧДЦ > 0 Тогда
			
			ТочностьЗначения = СтрДлина(Сред(СтрЗаменить(Формат(Значение - Цел(Значение), "ЧГ=0"), СтрокаДефис(), ""), 3));
			Если ТочностьЗначения > 0 Тогда
				
				СтрокаЧДЦ = Сред(ФорматнаяСтрока, ПозицияЧДЦ, Найти(Сред(ФорматнаяСтрока, ПозицияЧДЦ), ";") - 1);
				ЗначениеЧДЦ = СтрЗаменить(СтрокаЧДЦ, "ЧДЦ=", "");
				
				Если ЗначениеЗаполнено(ЗначениеЧДЦ) И Число(ЗначениеЧДЦ) < ТочностьЗначения Тогда
					ФорматнаяСтрока = СтрЗаменить(ФорматнаяСтрока, СтрокаЧДЦ, "ЧДЦ=" + Формат(ТочностьЗначения, "ЧГ=0"));
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Формат(Значение, ФорматнаяСтрока);
	
КонецФункции

// Возвращает представление даты в указанном формате, дату можно передавать строкой.
//
// Важно! Для пустой даты метод Формат с пустой форматной строкой работает иначе чем преобразование к строке:
// 	Формат('00010101') = ""
// 	Строка('00010101') = "01.01.0001 0:00:00"
//
Функция Дата_В_Формат(ДатаСтрока, ФорматнаяСтрока = "", ПустоеЗначение = Неопределено)
	
	Если ПустаяСтрока(ДатаСтрока) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Попытка
		Значение = Дата(ДатаСтрока);
	Исключение
		Значение = ДатаСтрока;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Значение) И ПустоеЗначение <> Неопределено Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Возврат Формат(Значение, ФорматнаяСтрока);
	
КонецФункции

// Возвращает представление значения или представление пустого значения
//
// Параметры:
//  Значение       - Произвольный - значение, представление которого нужно получить
//  ПустоеЗначение - Строка       - представление пустого значения
//
// Возвращаемое значение:
//  Строка - представление значения или ПустоеЗначение
//
Функция СтрокаПустоеЗначение(Значение, ПустоеЗначение)
	
	Результат = "";
	
	Попытка
		Результат = Строка(Значение);
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ПустоеЗначение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление значения или дефис
//
// Параметры:
//  Значение - Произвольный - значение, представление которого нужно получить
//
// Возвращаемое значение:
//  Строка - представление значения или дефис
//
Функция СтрокаИлиДефис(Значение)
	
	Результат = СтрокаПустоеЗначение(Значение, СтрокаДефис());
	
	Возврат Результат;
	
КонецФункции

// Обертка для обхода ошибки метода ЧислоПрописью со значением длиной более 17 знаков.
//
Функция ЧислоПрописью_Обертка(Значение, ПараметрыПредметаИсчисления = Неопределено)
	
	Попытка
		Результат = ЧислоПрописью(Значение, , ПараметрыПредметаИсчисления);
	Исключение
		Результат = Строка(Значение);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоСтрокой(Значение, ФорматКоличества = "")

	Если НЕ ЗначениеЗаполнено(ФорматКоличества) Тогда
		ФорматКоличества = ФорматКоличества();
	КонецЕсли;

	Результат = Число_В_Формат(Значение, ФорматКоличества);
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоСтрокойИлиДефис(Значение, ФорматКоличества)
	
	Если НЕ ЗначениеЗаполнено(ФорматКоличества) Тогда
		ФорматКоличества = ФорматКоличества();
	КонецЕсли;
	
	Результат = Число_В_Формат(Значение, ФорматКоличества, СтрокаДефис());
	
	Возврат Результат;
	
КонецФункции

Функция СуммаСтрокой(Значение, ФорматСуммы = "")

	Если НЕ ЗначениеЗаполнено(ФорматСуммы) Тогда
		ФорматСуммы = ФорматСуммы();
	КонецЕсли;
	
	Результат = Число_В_Формат(Значение, ФорматСуммы);
	
	Возврат Результат;
	
КонецФункции

Функция СуммаСтрокойИлиДефис(Значение, ФорматСуммы = "")
	
	Если НЕ ЗначениеЗаполнено(ФорматСуммы) Тогда
		ФорматСуммы = ФорматСуммы();
	КонецЕсли;
	
	Результат = Число_В_Формат(Значение, ФорматСуммы, СтрокаДефис());
	
	Возврат Результат;
	
КонецФункции

Функция СуммаСтрокойСОтображениемНуля(Знач Значение)
	
	Если Значение = Неопределено Тогда
		Значение = 0;
	КонецЕсли;
	
	Результат = Число_В_Формат(Значение, "ЧДЦ=2; ЧН=");
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСтрокой(Значение)
	
	Результат = Дата_В_Формат(Значение, ФорматДаты());
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСтрокойИлиДефис(Значение)
	
	Результат = Дата_В_Формат(Значение, ФорматДаты(), СтрокаДефис());
	
	Возврат Результат;
	
КонецФункции

Функция НомерСтрокойИлиБезНомера(Значение)
	
	Результат = СтрокаПустоеЗначение(
		Значение,
		СтрокаБезНомера()
	);
	
	Возврат Результат;
	
КонецФункции


// Возвращает модуль числа
//
// Параметры:
//  Значение - Число - значение, модуль которого нужно получить
// 
// Возвращаемое значение:
//  Число - Модуль числа
//
Функция МодульЧисла(Значение)
	
	Результат = Макс(-Значение, Значение);
	
	Возврат Результат;
	
КонецФункции

Функция СуммаПрописью(Значение, КодВалюты)
	
	ПараметрыИсчисления = ПараметрыИсчисленияВалюты(КодВалюты);
	
	Результат = ЧислоПрописью_Обертка(Значение, ПараметрыИсчисления);
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоЗаписейПрописью(Значение)
	
	ПараметрыИсчисления = ",,,м ,,,,,0";
	
	Результат = ЧислоПрописью_Обертка(Значение, ПараметрыИсчисления);
	
	Возврат Результат;
	
КонецФункции


// Возвращает дату редакции счета-фактуры с учетом даты её исправления.
//
// Параметры:
//  ДатаДокумента - Дата - Дата счета-фактуры.
//  НеИспользуется_ДатаИсправления - Дата - (Не используется) Дата исправления счета-фактуры.
// 
// Возвращаемое значение:
//  Дата - Дата редакции или пустая дата, если редакции в этот период не было.
//
Функция ДатаРедакцииСФ(Знач ДатаДокумента, Знач НеИспользуется_ДатаИсправления = Неопределено)
	
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = '00010101';
	КонецЕсли;
	
	Если ДатаДокумента >= ДатаРедакции425() Тогда
		Результат = ДатаРедакции425();
	ИначеЕсли ДатаДокумента >= ДатаРедакции1096() Тогда
		Результат = ДатаРедакции1096();
	ИначеЕсли ДатаДокумента >= ДатаРедакции534() Тогда
		Результат = ДатаРедакции534();
	ИначеЕсли ДатаДокумента >= ДатаРедакции981() Тогда
		Результат = ДатаРедакции981();
	ИначеЕсли ДатаДокумента >= ДатаРедакции625() Тогда
		Результат = ДатаРедакции625();
	Иначе
		Результат = '00010101';
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаРедакции1096()
	
	Возврат '20241001';
	
КонецФункции

Функция ДатаРедакции534()
	
	Возврат '20210701';
	
КонецФункции

Функция ДатаРедакции625()
	
	Возврат '20170701';
	
КонецФункции

Функция ДатаРедакции981()
	
	Возврат '20171001';
	
КонецФункции

Функция ДатаРедакции425()
	
	Возврат '20260101';
	
КонецФункции

// Возвращает ключи сведений о таможенной декларации и стране происхождения.
//
// Возвращаемое значение:
//   Структура - Ключи сведений о ТД
//
Функция Перечисление_ИдентификаторыСведенийОСтранеПроисхождения()

	СведенияТД = Новый Структура;
	СведенияТД.Вставить("КодСтраны"				, "цифровой код страны происхождения");
	СведенияТД.Вставить("НаименованиеСтраны"	, "краткое наименование страны происхождения");
	СведенияТД.Вставить("НомерТД"				, "регистрационный номер декларации на товары");
	
	Возврат СведенияТД;

КонецФункции

Функция Перечисление_ВидыАдресов()
	
	Результат = Новый Структура;
	Результат.Вставить("АдресРФ", "AddressRF");
	Результат.Вставить("АдресГАР", "AddressSAR");
	Результат.Вставить("АдресСтрокой", "AddressText");
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ВидыЮрФизЛиц()
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическоеЛицо", "LegalEntity");
	Результат.Вставить("ИндивидуальныйПредприниматель", "IndividualEntity");
	Результат.Вставить("ФизическоеЛицо", "PhysicalEntity");
	Результат.Вставить("ОрганИсполнительнойВласти", "AuthorityEntitry");
	Результат.Вставить("ИностраннаяОрганизация", "ForeignEntity");
	Результат.Вставить("ИностранныйГражданин", "ForeignPhysicalEntity");
	
	Возврат Результат;
	
КонецФункции

// Возвращает функцию УПД/УКД в терминах Proto структуры Диадока FunctionType.
//
// Параметры:
//	 ФункцияУПД	- Строка - Функция УПД/УКД в формате ФНС или в формате Proto структуры Диадока FunctionType.
//
// Возвращаемое значение:
//	 Строка - ФункцияУПД в терминах Proto структуры Диадока FunctionType: Invoice, Basic, InvoiceAndBasic.
//			  http://api-docs.diadoc.ru/ru/latest/proto/utd/UniversalTransferDocumentSellerTitleInfo.html?highlight=functiontype
//
Функция ProtoFunctionType(ФункцияУПД)
	
	Если ФункцияУПД = ФункцияСЧФДОП()
		Или ФункцияУПД = ФункцияКСЧФДИС()
		Или ФункцияУПД = ПротофункцияInvoiceAndBasic() Тогда
		
		Результат = ПротофункцияInvoiceAndBasic();
		
	ИначеЕсли ФункцияУПД = ФункцияДОП()
		Или ФункцияУПД = ФункцияДИС()
		Или ФункцияУПД = ПротофункцияBasic() Тогда
		
		Результат = ПротофункцияBasic();
		
	ИначеЕсли ФункцияУПД = ФункцияСЧФ()
		Или ФункцияУПД = ФункцияКСЧФ()
		Или ФункцияУПД = ПротофункцияInvoice() Тогда
		
		Результат = ПротофункцияInvoice();
		
	Иначе
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РаботникИлиИноеЛицо(Content)
	
	Если ЗначениеЗаполнено(Content.Employee.Surname) Тогда
		
		Результат = Content.Employee;
		
	ИначеЕсли ЗначениеЗаполнено(Content.OtherIssuer.Surname) Тогда
		
		Результат = Content.OtherIssuer;
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Возвращает новую структуру с разделами,
// в которые могут быть помещены дополнительные сведения
// 
// Возвращаемое значение:
//  Структура - содержит поля, в которые можно поместить доп. сведения:
//   * head   - над шапкой документа
//   * top    - над табличной частью
//   * bottom - под табличной частью
//   * ground - в подвале документа
//
Функция НовыеДопСведенияПоРазделам()
	
	Результат = Новый Структура;
	Результат.Вставить("head"	, "");
	Результат.Вставить("top"	, "");
	Результат.Вставить("bottom"	, "");
	Результат.Вставить("ground"	, "");
	
	Возврат Результат;
	
КонецФункции

// Добавляет в параметры печатной формы свойство ДопСведения
//
// Параметры:
//  Параметры - Структура  - содержит поля:
//   * ПоказатьДопСведения - Булево - Истина, если доп. сведения
//                                    нужно отобразить в печатной форме
//  ИсходныеДанные - Строка, Массив - см. функцию ДопСведенияПоРазделам()
//
Процедура ДобавитьДопСведенияВПараметрыПечатнойФормы(Параметры, ИсходныеДанные)
	
	Если Параметры.ПоказатьДопСведения
		И ЗначениеЗаполнено(ИсходныеДанные) Тогда
		
		СтруктураДопСведений = ДопСведенияПоРазделам(ИсходныеДанные);
	Иначе
		СтруктураДопСведений = НовыеДопСведенияПоРазделам();
	КонецЕсли;
	
	Параметры.Вставить("ДопСведения", СтруктураДопСведений);
	
КонецПроцедуры

// Соединяет коллекцию строк доп. сведений в одну строку
//
// Параметры:
//  ИсходныеДанные - Массив - содержит структуры с полями:
//                    * Key   - Строка - ключ дополнительных сведений
//                    * Value - Строка - значение дополнительных сведений
// 
// Возвращаемое значение:
//  Строка
//
Функция ДопСведенияСтрокой(ИсходныеДанные)
	
	Результат = "";
	
	Для Каждого Элемент Из ИсходныеДанные Цикл
		
		Ключ	 = Элемент.Key;
		Значение = Элемент.Value;
		
		Если Ключ = "_" Тогда
			Ключ = "";
		КонецЕсли;
		
		Результат = ДополнитьСтрокуДопСведений(Результат, Значение, Ключ);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разделяет коллекцию строк доп. сведений на разделы
//
// Параметры:
//  ИсходныеДанные - Строка - значение дополнительных сведений
//                 - Массив - содержит структуры с полями:
//                    * Key   - Строка - ключ дополнительных сведений
//                    * Value - Строка - значение дополнительных сведений
// 
// Возвращаемое значение:
//  Структура - см. функцию НовыеДопСведенияПоРазделам()
//
Функция ДопСведенияПоРазделам(ИсходныеДанные)
	
	Если ТипЗнч(ИсходныеДанные) = Тип("Строка") Тогда
		МассивДопСведений = ЗначениеВМассивKeyValue(ИсходныеДанные);
	Иначе
		МассивДопСведений = ИсходныеДанные;
	КонецЕсли;
	
	Результат = НовыеДопСведенияПоРазделам();
	
	Для Каждого Элемент Из МассивДопСведений Цикл
		
		Ключ	 = Элемент.Key;
		Значение = Элемент.Value;
		
		Если Ключ = "_" Тогда
			Ключ = "";
		КонецЕсли;
		
		СтруктураДопСведений = РазделитьСтрокуДопСведенийПоРазделам(Значение);
		
		Если ЗначениеЗаполнено(СтруктураДопСведений) Тогда
			ДополнитьРазделыДопСведений(Результат, СтруктураДопСведений, Ключ);
		Иначе
			Результат.top = ДополнитьСтрокуДопСведений(Результат.top, Значение, Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разделяет строку дополнительных сведений на разделы
//
// Параметры:
//  СтрокаДопСведений - Строка - значение дополнительных сведений
// 
// Возвращаемое значение:
//  Структура - см. функцию НовыеДопСведенияПоРазделам()
//
Функция РазделитьСтрокуДопСведенийПоРазделам(СтрокаДопСведений)
	
	РазделыЗаполнены	 = Ложь;
	СтрокаДляПоиска		 = НРег(СтрокаДопСведений);
	СтруктураДопСведений = НовыеДопСведенияПоРазделам();
	
	Для Каждого Элемент Из СтруктураДопСведений Цикл
		
		Раздел = Элемент.Ключ;
		
		Тег = "<" + Раздел + ">";
		ПозНачало = Найти(СтрокаДляПоиска, Тег);
		
		Если ПозНачало > 0 Тогда
			ПозНачало = ПозНачало + СтрДлина(Тег);
		КонецЕсли;
		
		Тег = "</" + Раздел + ">";
		ПозКонец = Найти(СтрокаДляПоиска, Тег);
		
		Если ПозНачало > 0 И ПозКонец > 0 Тогда
			
			ДлинаСтроки = ПозКонец - ПозНачало;
			ЗначениеРаздела = Сред(СтрокаДопСведений, ПозНачало, ДлинаСтроки);
			ЗначениеРаздела = СокрЛП(ЗначениеРаздела);
			
			СтруктураДопСведений[Раздел] = СтруктураДопСведений[Раздел] + ЗначениеРаздела;
			
			РазделыЗаполнены = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если РазделыЗаполнены Тогда
		Результат = СтруктураДопСведений;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет разделы доп. сведений приемника данными из разделов доп. сведений источника
//
// Параметры:
//  Приемник        - Структура - см. функцию НовыеДопСведенияПоРазделам()
//  Источник        - Структура - см. функцию НовыеДопСведенияПоРазделам()
//  КлючДопСведений - Строка    - ключ дополнительных сведений источника
//
Процедура ДополнитьРазделыДопСведений(Приемник, Источник, КлючДопСведений)
	
	Для каждого Элемент Из Приемник Цикл
		
		Раздел = Элемент.Ключ;
		ЗначениеПриемника = Приемник[Раздел];
		ЗначениеИсточника = Источник[Раздел];
		
		Если ЗначениеЗаполнено(ЗначениеИсточника) Тогда
			
			ЗначениеРаздела	 = ДополнитьСтрокуДопСведений(ЗначениеПриемника, ЗначениеИсточника, КлючДопСведений);
			Приемник[Раздел] = ЗначениеРаздела;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Дополняет строку доп. сведений новым ключем и значением
//
// Параметры:
//  СтрокаДопСведений - Строка - строка, в которую нужно добавить новые дополнительные сведения
//  Значение          - Строка - значение новых дополнительных сведений
//  Ключ              - Строка - ключ новых дополнительных сведений
// 
// Возвращаемое значение:
//  Строка
//
Функция ДополнитьСтрокуДопСведений(СтрокаДопСведений, Значение, Ключ)
	
	РазделительКлюча		 = "";
	РазделительДопСведений	 = "";
	
	Если ЗначениеЗаполнено(Ключ) Тогда
		РазделительКлюча = ": ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДопСведений) Тогда
		РазделительДопСведений = ", ";
	КонецЕсли;
	
	Результат = СтрокаДопСведений + РазделительДопСведений + Ключ + РазделительКлюча + Значение;
	
	Возврат Результат;
	
КонецФункции

Функция ДопСведенияСтрокиУПД(Item)
	
	Результат = ДопСведенияСтрокой(Item.StructedAdditionalInfos);
	
	Если НЕ ЗначениеЗаполнено(Результат) И ЕстьРеквизитИлиСвойствоОбъектаЛокальная(Item, "AdditionalProperty") Тогда
		Результат = СокрЛП(Item.AdditionalProperty);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйТабличныйДокумент(ИмяПараметровПечати, _ОриентацияСтраницы = Неопределено)
	
	Если _ОриентацияСтраницы = Неопределено Тогда
		_ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	
	Результат = Новый ТабличныйДокумент;
	Результат.ОриентацияСтраницы  = _ОриентацияСтраницы;
	Результат.АвтоМасштаб		  = Истина;
	
	Если Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт Тогда
		
		Результат.ПолеСлева  = 10;
		Результат.ПолеСправа = 10;
		Результат.ПолеСверху = 15;
		Результат.ПолеСнизу  = 10;
		
	Иначе
		
		Результат.ПолеСлева  = 15;
		Результат.ПолеСправа = 10;
		Результат.ПолеСверху = 10;
		Результат.ПолеСнизу  = 10;
		
	КонецЕсли; 
	
	Результат.ИмяПараметровПечати = ИмяПараметровПечати;
	
	Возврат Результат;
	
КонецФункции

Функция ОбластьДопСведений(Макет, ИмяОбласти, ДопСведения)
	
	Область = Макет.ПолучитьОбласть(ИмяОбласти); 
	
	Область.Параметры.ДопСведения = ДопСведения;
	
	Возврат Область;
	
КонецФункции

Процедура ДобавитьДопСведения(Таб, Макет, ИмяОбласти, ДопСведения)
	
	Если ЗначениеЗаполнено(ДопСведения) Тогда
		
		Таб.Вывести(ОбластьДопСведений(Макет, ИмяОбласти, ДопСведения));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДатаЭлектроннойПодписи(Подпись)
	
	Результат = Подпись.SignDate;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Подпись.SignatureAuthenticityDate;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РасшифровкаРезультатаПроверкиПодписиОтправителя(СтатусПодписиОтправителя)
	
	Если СтатусПодписиОтправителя = "SenderSignatureUnchecked" Тогда
		Результат = "Идет доставка подписи";
	ИначеЕсли СтатусПодписиОтправителя = "SenderSignatureCheckedAndValid" Тогда
		Результат = "Соответствует файлу документа";
	Иначе
		Результат = "Не подтверждена";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура Штамп_ЗаполнитьОбщиеРеквизиты(Область, МетаданныеДокумента)
	
	МеткаВремени = МетаданныеДокумента.Timestamp;
	Область.Параметры.ДатаОтправки  = ДатаСтрокой(МеткаВремени);
	Область.Параметры.ВремяОтправки = Формат(МеткаВремени, "ДФ=ЧЧ:мм:сс");
	
	ДлинаUUID = 36;
	ПолныйИдентификаторДокумента = МетаданныеДокумента.DocumentID;
	Область.Параметры.ИдентификаторДокумента = Прав(ПолныйИдентификаторДокумента, ДлинаUUID);
	
КонецПроцедуры

Процедура Штамп_ЗаполнитьСторонуОтправителя(Область, ПодписьОтправителя, МетаданныеДокумента)
	
	ДатаПодписи = ДатаЭлектроннойПодписи(ПодписьОтправителя);
	
	Область.Параметры.Отправитель = МетаданныеДокумента.SenderName;
	Область.Параметры.ОтправительПодписант = ПодписьОтправителя.Certificate.Name;
	Область.Параметры.ОтправительДолжность = ПодписьОтправителя.Certificate.JobTitle;
	Область.Параметры.ОтправительДатаПодписи = ДатаСтрокой(ДатаПодписи);
	
	Штамп_ЗаполнитьРезультатПроверкиПодписиОтправителя(Область, МетаданныеДокумента);
	
КонецПроцедуры

Процедура Штамп_ЗаполнитьРезультатПроверкиПодписиОтправителя(Область, МетаданныеДокумента)
	
	СтатусПодписиОтправителя = МетаданныеДокумента.SenderSignatureStatus;
	РасшифровкаРезультатаПроверки = РасшифровкаРезультатаПроверкиПодписиОтправителя(СтатусПодписиОтправителя);
	Область.Параметры.ОтправительПроверкаПодписи = РасшифровкаРезультатаПроверки;
	
КонецПроцедуры

Процедура Штамп_ЗаполнитьСторонуПолучателя(Область, ПодписьПолучателя, МетаданныеДокумента)
	
	Если Не ЗначениеЗаполнено(ПодписьПолучателя.Certificate.Name) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПодписи = ДатаЭлектроннойПодписи(ПодписьПолучателя);
	
	Область.Параметры.Получатель = МетаданныеДокумента.RecipientName;
	Область.Параметры.ПолучательПодписант = ПодписьПолучателя.Certificate.Name;
	Область.Параметры.ПолучательДолжность = ПодписьПолучателя.Certificate.JobTitle;
	Область.Параметры.ПолучательДатаПодписи = ДатаСтрокой(ДатаПодписи);
	
	Штамп_ЗаполнитьРезультатПроверкиПодписиПолучателя(Область, ПодписьПолучателя);
	
КонецПроцедуры

Процедура Штамп_ЗаполнитьРезультатПроверкиПодписиПолучателя(Область, ПодписьПолучателя)
	
	Если ЗначениеЗаполнено(ПодписьПолучателя.SignatureAuthenticityDate) Тогда
		РасшифровкаРезультатаПроверки = "Соответствует файлу документа";
	Иначе
		РасшифровкаРезультатаПроверки = "Не подтверждена";
	КонецЕсли;
	
	Область.Параметры.ПолучательПроверкаПодписи = РасшифровкаРезультатаПроверки;
	
КонецПроцедуры

Процедура ДобавитьШтамп(Таб, ДанныеШтампа)
	
	Если Не ЗначениеЗаполнено(ДанныеШтампа) Тогда
		Возврат;
	КонецЕсли;
	
	ПодписьОтправителя = ДанныеШтампа.SenderSignature;
	
	Если Не ЗначениеЗаполнено(ПодписьОтправителя.Certificate.Name) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеШтампа.Свойство("ШтампБезПечати") И ДанныеШтампа.ШтампБезПечати = Истина Тогда
		Область = ПолучитьМакет("Штампы").ПолучитьОбласть("ШтампБезПечати");
	Иначе
		Область = ПолучитьМакет("Штампы").ПолучитьОбласть("Штамп");
	КонецЕсли;
	
	ПодписьПолучателя = ДанныеШтампа.RecipientSignature;
	МетаданныеДокумента = ДанныеШтампа.DocumentMetaData;
	
	Штамп_ЗаполнитьОбщиеРеквизиты(Область, МетаданныеДокумента);
	Штамп_ЗаполнитьСторонуОтправителя(Область, ПодписьОтправителя, МетаданныеДокумента);
	Штамп_ЗаполнитьСторонуПолучателя(Область, ПодписьПолучателя, МетаданныеДокумента);
	
	Таб.Вывести(Область);
	
КонецПроцедуры


Функция СтруктураЗаполнена(Структура) Экспорт
	
	Результат = Ложь;
	
	Для Каждого КлючИЗначение Из Структура Цикл
		
		ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
		
		Если ТипЗначения = Тип("Структура") Тогда
			Результат = СтруктураЗаполнена(КлючИЗначение.Значение);
		ИначеЕсли ТипЗначения = Тип("Булево") Тогда
			Результат = КлючИЗначение.Значение = Истина;
		Иначе
			Результат = ЗначениеЗаполнено(КлючИЗначение.Значение);
		КонецЕсли;
		
		Если Результат = Истина Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ВсеСтрокиПротоТаблицыИмеютСтавкуНдсИсчНалАг(Таблица)
	
	Результат = Истина;
	
	Если Таблица.Количество() = 0 Тогда
		Результат = Ложь;
	Иначе
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			Если НРег(СтрокаТаблицы.TaxRate) <> "исчналаг" Тогда
				Результат = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ВсеСтрокиУКДСодержатСтавкуНДС_ИсчНалАг(ExtendedInvoiceCorrectionItems)
	
	Результат = Истина;
	
	Для Каждого ExtendedInvoiceCorrectionItem Из ExtendedInvoiceCorrectionItems Цикл
		Если НРег(ExtendedInvoiceCorrectionItem.CorrectedValues.Taxrate) <> "исчналаг" Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что это ставка прямого налогообложения.
// Проверка основана на исключении особых случаев налогообложения: 
// НДС не облагается или НДС исчисляется налоговым агентом.
//
// Параметры:
//  TaxRate - Строка - значение ставки НДС.
// 
// Возвращаемое значение:
//  Булево - Истина, если это основная (20%), пониженная (10%) или нулевая (0%) ставка НДС.
//
Функция ЭтоПрямаяСтавкаНДС(Знач TaxRate)
	
	Результат = Истина;
	
	ПроверяемоеЗначение = НРег(TaxRate);
	СтавкаИсчНалАг = НРег("ИсчНалАг");
	СтавкаБезНДС = НРег(СтрокаБезНДС());
	
	Если ПроверяемоеЗначение = СтавкаБезНДС
		Или ПроверяемоеЗначение = СтавкаИсчНалАг Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьСтрокиСПрямымиСтавкамиНДС736(Контент736)
	
	Результат = Ложь;
	
	СтрокиУКД = Контент736.InvoiceCorrectionTable.Items;
	
	Для Каждого СтрокаТЧ Из СтрокиУКД Цикл
		
		СтавкаПослеИзменения = СтрокаТЧ.CorrectedValues.TaxRate;
		
		Если ЭтоПрямаяСтавкаНДС(СтавкаПослеИзменения) Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВСтрокахУКДЕстьУвеличениеУменьшение(ExtendedInvoiceCorrectionItems)
	
	ЕстьУвеличение = Ложь;
	ЕстьУменьшение = Ложь;
	
	Для Каждого ExtendedInvoiceCorrectionItem Из ExtendedInvoiceCorrectionItems Цикл
		
		Если (ЗначениеЗаполнено(ExtendedInvoiceCorrectionItem.AmountsInc.TotalWithVatExcluded) Или ExtendedInvoiceCorrectionItem.AmountsInc.TotalWithVatExcluded = 0)
			И (ЗначениеЗаполнено(ExtendedInvoiceCorrectionItem.AmountsInc.Vat) Или ExtendedInvoiceCorrectionItem.AmountsInc.Vat = 0) Тогда
			ЕстьУвеличение = Истина;
		КонецЕсли;
		
		Если (ЗначениеЗаполнено(ExtendedInvoiceCorrectionItem.AmountsDec.TotalWithVatExcluded) Или ExtendedInvoiceCorrectionItem.AmountsDec.TotalWithVatExcluded = 0) 
			И (ЗначениеЗаполнено(ExtendedInvoiceCorrectionItem.AmountsDec.Vat) Или ExtendedInvoiceCorrectionItem.AmountsDec.Vat = 0) Тогда
			ЕстьУменьшение = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("ЕстьУвеличение, ЕстьУменьшение", ЕстьУвеличение, ЕстьУменьшение);
	
КонецФункции

Функция СвойствоПрото_ItemTracingInfos()
	Возврат "ItemTracingInfos";
КонецФункции

Функция ЕстьСведенияОПрослеживаемости820(Контент820)
	
	СтрокиТЧ = Контент820.Table.Items;
	
	Результат = ЕстьСтрокиСПрослеживаемостью(СтрокиТЧ);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьСведенияОПрослеживаемости970(Контент970)
	
	СтрокиТЧ = Контент970.Table.Items;
	
	Результат = ЕстьСтрокиСПрослеживаемостью(СтрокиТЧ);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьСведенияОПрослеживаемости736(Контент736)
	
	СтрокиТЧ = Контент736.InvoiceCorrectionTable.Items;
	
	Результат = ЕстьСтрокиСПрослеживаемостью(СтрокиТЧ);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьСтрокиСПрослеживаемостью(Items)
	
	Результат = Ложь;
	
	ИмяСвойства = СвойствоПрото_ItemTracingInfos();
	
	Для Каждого Item Из Items Цикл
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛокальная(Item, ИмяСвойства)
			И ЗначениеЗаполнено(Item[ИмяСвойства]) Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьСведенияОИсправлении(Контент)
	
	Результат = Ложь;
	
	ИмяСвойства_НомерИсправления	= "RevisionNumber";
	ИмяСвойства_ДатаИсправления		= "RevisionDate";
	
	ЗаполненНомерИсправления = ЕстьРеквизитИлиСвойствоОбъектаЛокальная(Контент, ИмяСвойства_НомерИсправления)
								И ЗначениеЗаполнено(Контент[ИмяСвойства_НомерИсправления]);
								
	ЗаполненаДатаИсправления = ЕстьРеквизитИлиСвойствоОбъектаЛокальная(Контент, ИмяСвойства_ДатаИсправления)
								И ЗначениеЗаполнено(Контент[ИмяСвойства_ДатаИсправления]);
	
	Если ЗаполненНомерИсправления И ЗаполненаДатаИсправления Тогда
									
		Результат = Истина;							
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомераКолонок_СФ1137_534_Прослеж(Параметры)
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1", "2", "2"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1а", "3", "4"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1б", "5", "5"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2", "6", "6"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2а", "7", "8"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "3", "9", "9"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "4", "10", "10"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "5", "11", "11"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "6", "12", "12"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "7", "13", "13"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "8", "14", "14"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "9", "15", "15"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10", "16", "17"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10а", "18", "18"));
	
	Если Не Параметры.ЕстьСведенияОПрослеживаемости Тогда
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "11", "19", "20"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомераКолонок_УПД_534_Прослеж(Параметры)
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "А", "2", "4"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1", "5", "6"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1а", "7", "10"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1б", "11", "11"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2", "12", "12"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2а", "13", "13"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "3", "14", "14"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "4", "15", "17"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "5", "18", "19"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "6", "20", "21"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "7", "22", "22"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "8", "23", "24"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "9", "25", "27"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10", "28", "28"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10а", "29", "29"));
	
	Если Не Параметры.ЕстьСведенияОПрослеживаемости Тогда
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "11", "30", "31"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомераКолонок_УКД()
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "А", "2", "2"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "Б", "3", "4"));
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1", "5", "10"));
	
	Возврат Результат;
	
КонецФункции

Функция НомерКолонки_УКД_КодВидаТовара()
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1б", "13", "13"));
	
	Возврат Результат;
	
КонецФункции

Функция НомераКолонок_КСФ1137()
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1", "2", "3"));
	
	Возврат Результат;
	
КонецФункции

Функция НомерКолонки_КСФ1137_КодВидаТовара()
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1б", "7", "7"));
	
	Возврат Результат;
	
КонецФункции

Функция НомераКолонок_КСФ1137_534_Прослеж(ДляПодстрок = Ложь)
	
	Результат = Новый Массив;
	
	Если ДляПодстрок Тогда
		
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1б", "5", "7"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2", "9", "9"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2а", "10", "10"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "3", "11", "12"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "4", "13", "13"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "5", "14", "14"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "6", "15", "15"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "7", "16", "16"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "8", "17", "17"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "9", "18", "19"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10", "20", "20"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10а", "21", "21"));
		
	Иначе
		
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1", "2", "2"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1а", "3", "4"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомерКолонки_КСФ1137_534_Прослеж_КодВидаТовара()
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1в", "8", "8"));
	
	Возврат Результат;
	
КонецФункции

Функция НомераКолонок_УКД_534(Параметры, ДляПодстрок = Ложь)
	
	Результат = Новый Массив;
	
	Если ДляПодстрок Тогда
		
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1а", "11", "12"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2", "14", "14"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2а", "15", "17"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "3", "18", "20"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "4", "21", "22"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "5", "23", "25"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "6", "26", "28"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "7", "29", "29"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "8", "30", "30"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "9", "31", "32"));
	
	Иначе
		
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "А", "2", "2"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "Б", "3", "4"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1", "5", "10"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомераКолонок_УКД_534_Прослеж(Параметры, ДляПодстрок = Ложь)
	
	Результат = Новый Массив;
	
	Если ДляПодстрок Тогда
		
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1б", "11", "12"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2", "14", "14"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "2а", "15", "17"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "3", "18", "20"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "4", "21", "22"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "5", "23", "25"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "6", "26", "28"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "7", "29", "29"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "8", "30", "30"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "9", "31", "32"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10", "33", "33"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "10а", "34", "34"));
	
	Иначе
		
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "А", "2", "4"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1", "5", "6"));
		Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1а", "7", "10"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомерКолонки_УКД_534_Прослеж_КодВидаТовара()
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1в", "13", "13"));
	
	Возврат Результат;
	
КонецФункции

Функция НомерКолонки_УКД_534_КодВидаТовара()
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Графа, НомерПервойКолонки, НомерПоследнейКолонки", "1в", "13", "13"));
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УПД(Область, Item, НомерТД, Параметры)
	
	Если Item.ItemTracingInfos.Количество() = 0 Тогда
		ItemTracingInfo = Новый Структура;
		ItemTracingInfo.Вставить("RegNumberUnit", НомерТД);
		ItemTracingInfo.Вставить("Unit", СтрокаДефис());
		ItemTracingInfo.Вставить("UnitName", СтрокаДефис());
		ItemTracingInfo.Вставить("Quantity", СтрокаДефис());
		ItemTracingInfo.Вставить("SumWithoutVat", СтрокаДефис());
	Иначе
		ItemTracingInfo = Item.ItemTracingInfos[0];
	КонецЕсли;
	
	ЗаполнитьПараметрыПрослеживаемости_УПД(Область, ItemTracingInfo, Параметры);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПрослеживаемостиСтрок_УПД(Таб, Item, СтрокаДопСведений, НомераКолонок, Параметры)
	
	КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
	НомерПервойСтроки = Таб.ВысотаТаблицы;
	НомерПоследнейСтроки = НомерПервойСтроки + КоличествоСтрокСПрослеживаемостью - 1;
	
	Для сц = 1 По КоличествоСтрокСПрослеживаемостью - 1 Цикл
		
		Если ЗначениеЗаполнено(СтрокаДопСведений) И сц = КоличествоСтрокСПрослеживаемостью - 1 Тогда
			Область = ОбластьДопСведений(Параметры.Макет, "СтрокаДопСведения", СтрокаДопСведений);
		Иначе
			Область = Параметры.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		ItemTracingInfo = Item.ItemTracingInfos[сц];
		ЗаполнитьПараметрыПрослеживаемости_УПД(Область, ItemTracingInfo, Параметры);
		Таб.Вывести(Область);
		
	КонецЦикла;
	
	ОбъединитьЯчейкиКолонокТабличногоДокумента(Таб, НомерПервойСтроки, НомерПоследнейСтроки, НомераКолонок);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПрослеживаемости_УПД(Область, ItemTracingInfo, Параметры)
	
	ЗначенияПараметровОбласти = Новый Структура;
	ЗначенияПараметровОбласти.Вставить("НомерТД", ItemTracingInfo.RegNumberUnit);
	ЗначенияПараметровОбласти.Вставить("КоличествоПрослеж", ItemTracingInfo.Quantity);
	ЗначенияПараметровОбласти.Вставить("ЕдиницаИзмеренияПрослеж", ItemTracingInfo.UnitName);
	ЗначенияПараметровОбласти.Вставить("ЕдиницаИзмеренияПрослежКод", ItemTracingInfo.Unit);
	
	Если ItemTracingInfo.Свойство("SumWithoutVat") Тогда
		СтоимостьПрослеж = СуммаСтрокойИлиДефис(ItemTracingInfo.SumWithoutVat, "ЧДЦ=2");
	Иначе
		СтоимостьПрослеж = "";
	КонецЕсли;
	ЗначенияПараметровОбласти.Вставить("СтоимостьПрослеж", СтоимостьПрослеж);
	
	Область.Параметры.Заполнить(ЗначенияПараметровОбласти);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПрослеживаемостиПервойСтроки_УКД(Область, Item, НомерТДПустоеЗначение, Параметры)
	
	КоллекцияСведПрослеж = Item.ItemTracingInfos;
	
	Если ЗначениеЗаполнено(КоллекцияСведПрослеж) Тогда
		
		ItemTracingInfo = КоллекцияСведПрослеж[0];
		
	Иначе
		
		QuantityDiff = Новый Структура;
		QuantityDiff.Вставить("OriginalQuantity", СтрокаДефис());
		QuantityDiff.Вставить("CorrectedQuantity", СтрокаДефис());
		QuantityDiff.Вставить("QuantityInc", СтрокаДефис());
		QuantityDiff.Вставить("QuantityDec", СтрокаДефис());
		
		ItemTracingInfo = Новый Структура;
		ItemTracingInfo.Вставить("RegNumberUnit", НомерТДПустоеЗначение);
		ItemTracingInfo.Вставить("QuantityDiff", QuantityDiff);
		
	КонецЕсли;
	
	ЗаполнитьПараметрыПрослеживаемости_УКД(Область, ItemTracingInfo, Параметры);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПрослеживаемостиСтрок_УКД(Таб, ИмяОбласти, Item, НомераКолонок, Параметры)
	
	КоличествоСтрокСПрослеживаемостью = Item.ItemTracingInfos.Количество();
	НомерПервойСтроки = Таб.ВысотаТаблицы;
	НомерПоследнейСтроки = НомерПервойСтроки + КоличествоСтрокСПрослеживаемостью - 1;
	
	Для сц = 1 По КоличествоСтрокСПрослеживаемостью - 1 Цикл
		
		Область = Параметры.Макет.ПолучитьОбласть(ИмяОбласти);
		
		ItemTracingInfo = Item.ItemTracingInfos[сц];
		ЗаполнитьПараметрыПрослеживаемости_УКД(Область, ItemTracingInfo, Параметры);
		Таб.Вывести(Область);
		
	КонецЦикла;
	
	ОбъединитьЯчейкиКолонокТабличногоДокумента(Таб, НомерПервойСтроки, НомерПоследнейСтроки, НомераКолонок);
	
КонецПроцедуры

// Заполняет колонки 10, 10а и 11 табличного документа УКД_534 и КСФ1137_534
//
// Параметры:
//  Область	- ТабличныйДокумент - Область табличного документа формы УКД
//  Item	- Массив - Массив структур - сведений об импотных товарах из поля ИнфПолФХЖ2
//
Процедура ЗаполнитьПараметрыСтраныПроисхождения_УКД(Область, Item)
	
	КоллекцияИнфПолФХЖ2 = Item.StructedAdditionalInfos;
	
	КодыСтран			= Новый Массив;
	НаименованияСтран	= Новый Массив;
	НомераДеклараций	= Новый Массив;
	
	КлючИнфПолФХЖ2 = Перечисление_ИдентификаторыСведенийОСтранеПроисхождения();
	
	Для Каждого ИнфПолФХЖ2 Из КоллекцияИнфПолФХЖ2 Цикл
		
		Если НРег(ИнфПолФХЖ2.Key) = НРег(КлючИнфПолФХЖ2.КодСтраны) Тогда
			КодыСтран.Добавить(ИнфПолФХЖ2.Value);
		ИначеЕсли НРег(ИнфПолФХЖ2.Key) = НРег(КлючИнфПолФХЖ2.НаименованиеСтраны) Тогда
			НаименованияСтран.Добавить(ИнфПолФХЖ2.Value);
		ИначеЕсли НРег(ИнфПолФХЖ2.Key) = НРег(КлючИнфПолФХЖ2.НомерТД) Тогда
			НомераДеклараций.Добавить(ИнфПолФХЖ2.Value);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеКодСтраны			= СоединитьСтроку(КодыСтран			, ", ");
	ЗначениеНаименованиеСтраны	= СоединитьСтроку(НаименованияСтран	, ", ");
	ЗначениеНомерТД				= СоединитьСтроку(НомераДеклараций	, ", ");
	
	Область.Параметры["КодСтраны"]			= СтрокаИлиДефис(ЗначениеКодСтраны);
	Область.Параметры["НаименованиеСтраны"]	= СтрокаИлиДефис(ЗначениеНаименованиеСтраны);
	Область.Параметры["НомерТД"]			= СтрокаИлиДефис(ЗначениеНомерТД);

КонецПроцедуры

Процедура ЗаполнитьПараметрыПрослеживаемости_УКД(Область, ItemTracingInfo, Параметры)
	
	ЗначенияПараметровОбласти = Новый Структура;
	ЗначенияПараметровОбласти.Вставить("НомерТД", ItemTracingInfo.RegNumberUnit);
	
	Unit = СвойствоСтруктуры(ItemTracingInfo, "Unit", СтрокаДефис());
	UnitName = ?(Unit = СтрокаДефис(), СтрокаДефис(), НаименованиеЕдиницыИзмерения(Unit));
	
	ЗначенияПараметровОбласти.Вставить("ЕдиницаИзмеренияПрослежКод", Unit);
	ЗначенияПараметровОбласти.Вставить("ЕдиницаИзмеренияПрослеж", UnitName);
	
	Если Не Область.Области.Найти("СтрокаА") = Неопределено Тогда
		
		КоличествоПрослежДо = СтрокаИлиДефис(ItemTracingInfo.QuantityDiff.OriginalQuantity);
		ЗначенияПараметровОбласти.Вставить("КоличествоПрослежДо", КоличествоПрослежДо);
		
	КонецЕсли;
	
	Если Не Область.Области.Найти("СтрокаБ") = Неопределено Тогда
		
		КоличествоПрослежПосле = СтрокаИлиДефис(ItemTracingInfo.QuantityDiff.CorrectedQuantity);
		ЗначенияПараметровОбласти.Вставить("КоличествоПрослежПосле", КоличествоПрослежПосле);
		
	КонецЕсли;
	
	Если Не Область.Области.Найти("СтрокаВ") = Неопределено Тогда
		
		КоличествоПрослежУвеличение = СтрокаИлиДефис(СвойствоСтруктуры(ItemTracingInfo.QuantityDiff, "QuantityInc"));
		ЗначенияПараметровОбласти.Вставить("КоличествоПрослежУвеличение", КоличествоПрослежУвеличение);
		
	КонецЕсли;
	
	Если Не Область.Области.Найти("СтрокаГ") = Неопределено Тогда
		
		КоличествоПрослежУменьшение = СтрокаИлиДефис(СвойствоСтруктуры(ItemTracingInfo.QuantityDiff, "QuantityDec"));
		ЗначенияПараметровОбласти.Вставить("КоличествоПрослежУменьшение", КоличествоПрослежУменьшение);
		
	КонецЕсли;
	
	Область.Параметры.Заполнить(ЗначенияПараметровОбласти);
	
КонецПроцедуры

Процедура ОбъединитьЯчейкиКолонокТабличногоДокумента(ТабличныйДокумент, НомерПервойСтроки, НомерПоследнейСтроки, НомераКолонок)
	
	Для Каждого Элемент Из НомераКолонок Цикл
		ОбластьОбъединения = ТабличныйДокумент.Область(НомерПервойСтроки, Элемент.НомерПервойКолонки,
													   НомерПоследнейСтроки, Элемент.НомерПоследнейКолонки);
		ОбластьОбъединения.Объединить();
	КонецЦикла;
	
КонецПроцедуры

//} Вспомогательные методы печатных форм

//}		ПЕЧАТНЫЕ ФОРМЫ


//******************************************
//{		КЛАССИФИКАТОРЫ

Функция КодыРегионов()
	
	Результат = Кэш_Прочитать("КодыРегионов");
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Соответствие;
		
		// Сериализуем через произвольный ОбъектXDTO для совместимости с 8.1
		ОбъектXDTO = XML_В_XDTO(ПолучитьМакет("КодыРегионов").ПолучитьТекст());
		
		Для Каждого СтрокаXDTO Из ОбъектXDTO.pair Цикл
			Результат.Вставить(СтрокаXDTO.Key, СтрокаXDTO.Value);
		КонецЦикла;
		
		Кэш_Поместить("КодыРегионов", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОКВ()
	
	Результат = Кэш_Прочитать("ОКВ");
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый ТаблицаЗначений;
		
		// Сериализуем через произвольный ОбъектXDTO для совместимости с 8.1
		ОбъектXDTO = XML_В_XDTO(ПолучитьМакет("ОКВ").ПолучитьТекст());
		
		МассивКолонок = РазделитьСтрокуЛок(ОбъектXDTO.Columns);
		Для Каждого ИмяКолонки Из МассивКолонок Цикл
			
			Если ИмяКолонки = "RBCLoading" Тогда
				ТипКолонки = Новый ОписаниеТипов("Булево");
			Иначе
				ТипКолонки = Новый ОписаниеТипов("Строка");
			КонецЕсли;
			
			Результат.Колонки.Добавить(ИмяКолонки, ТипКолонки);
			
		КонецЦикла;
		
		Для Каждого СтрокаXDTO Из ОбъектXDTO.Item Цикл
			
			НоваяСтрока = Результат.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаXDTO, , "RBCLoading");
			
			НоваяСтрока.RBCLoading = НРег(СтрокаXDTO.RBCLoading) = "истина";
			
		КонецЦикла;
		
		Результат.Колонки.Code.Имя					= "Код";
		Результат.Колонки.CodeSymbol.Имя			= "КодСимвольный";
		Результат.Колонки.Name.Имя					= "Наименование";
		Результат.Колонки.Description.Имя			= "Описание";
		Результат.Колонки.RBCLoading.Имя			= "ЗагрузкаИзИнтернета";
		Результат.Колонки.NumerationItemOptions.Имя = "ПараметрыИсчисления";
		
		Результат.Индексы.Добавить("Код");
		
		ДобавитьСтроковыйИндексВТаблицуЗначений(Результат, "КодСимвольный");
		ДобавитьСтроковыйИндексВТаблицуЗначений(Результат, "Наименование");
		
		Кэш_Поместить("ОКВ", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОКСМ()
	
	Результат = Кэш_Прочитать("ОКСМ");
	
	Если Результат = Неопределено Тогда
		
		// Сериализуем через произвольный ОбъектXDTO для совместимости с 8.1
		Результат = XDTO_В_Таблицу(XML_В_XDTO(ПолучитьМакет("ОКСМ").ПолучитьТекст()));
		
		Результат.Колонки.Наименование.Имя = "НаименованиеКраткое";
		
		ДобавитьСтрокуВ_ОКСМ(Результат, "Евросоюз",			"", "", "980", "Европейский союз");
		ДобавитьСтрокуВ_ОКСМ(Результат, "ЕС",				"", "", "980", "Европейский союз");
		ДобавитьСтрокуВ_ОКСМ(Результат, "Европейский союз",	"", "", "980", "Европейский союз");
		ДобавитьСтрокуВ_ОКСМ(Результат, "ЕАЭС",				"", "", "981", "Евразийский экономический союз");
		
		ДобавитьСтроковыйИндексВТаблицуЗначений(Результат, "НаименованиеКраткое");
		ДобавитьСтроковыйИндексВТаблицуЗначений(Результат, "НаименованиеПолное");
		
		Кэш_Поместить("ОКСМ", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОКЕИ()
	
	Результат = Кэш_Прочитать("ОКЕИ");
	
	Если Результат = Неопределено Тогда
		
		// Сериализуем через произвольный ОбъектXDTO для совместимости с 8.1
		Дерево = XDTO_В_Дерево(XML_В_XDTO(ПолучитьМакет("ОКЕИ").ПолучитьТекст()));
		Дерево.Строки.Удалить(Дерево.Строки.Найти("Международные единицы измерения, не включенные в ОКЕИ"));
		
		Результат = Дерево_В_Таблицу(Дерево, Ложь);
		Дерево = Неопределено;
		
		Результат.Колонки.КодЧисловой.Имя					  = "Код";
		Результат.Колонки.Наименование.Имя					  = "НаименованиеПолное";
		Результат.Колонки.УсловноеОбозначениеНациональное.Имя = "НаименованиеКраткое";
		
		Для каждого СтрокаТЗ Из Результат Цикл
			СтрокаТЗ.НаименованиеПолное	 = СтрЗаменить(СтрокаТЗ.НаименованиеПолное , Символы.ПС, "/");
			СтрокаТЗ.НаименованиеКраткое = СтрЗаменить(СтрокаТЗ.НаименованиеКраткое, Символы.ПС, "/");
		КонецЦикла;
		
		Результат.Индексы.Добавить("Код");
		
		ДополнитьТаблицуОКЕИ(Результат);
		
		ДобавитьСтроковыйИндексВТаблицуЗначений(Результат, "НаименованиеКраткое");
		ДобавитьСтроковыйИндексВТаблицуЗначений(Результат, "НаименованиеПолное");
		
		Кэш_Поместить("ОКЕИ", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает наименование единицы измерения по коду.
//
// Параметры:
//	 КодОКЕИ			- Строка - Код единицы измерения.
//	 ПолноеНаименование - Булево - (необязательное) Признак того, что нужно вернуть полное наименование.
//
// Возвращаемое значение:
//	 Строка	- Наименование единицы измерения, пример:
//   	шт	  - Краткое Наименование
//		Штука - Полное наименование
//
Функция НаименованиеЕдиницыИзмерения(КодОКЕИ, ПолноеНаименование = Ложь)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(КодОКЕИ) Тогда
		
		СтрокаОКЕИ = ПолучитьОКЕИ().Найти(СокрЛП(КодОКЕИ), "Код");
		
		Если СтрокаОКЕИ <> Неопределено Тогда
			
			Если ПолноеНаименование = Истина Тогда
				Результат = СтрокаОКЕИ.НаименованиеПолное;
			Иначе
				Результат = СтрокаОКЕИ.НаименованиеКраткое;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции		

// Возвращает наименование страны по коду.
//
// Параметры:
//	 КодСтраны		    - Строка - Код страны.
//	 ПолноеНаименование - Булево - (необязательное) Признак того, что нужно вернуть полное наименование.
//
// Возвращаемое значение:
//	 Строка	- Наименование страны, пример:
//   	РОССИЯ				 - Краткое Наименование
//		Российская Федерация - Полное наименование
//
Функция НаименованиеСтраны(КодСтраны, ПолноеНаименование = Ложь)
	
	Результат = "";
	
	СтрокаОКСМ = ПолучитьОКСМ().Найти(КодСтраны, "Код");
	
	Если СтрокаОКСМ <> Неопределено Тогда
		
		Если ПолноеНаименование = Истина Тогда
			Результат = СтрокаОКСМ.НаименованиеПолное;
		Иначе
			Результат = СтрокаОКСМ.НаименованиеКраткое;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает символьный код или наименование валюты по коду.
//
// Параметры:
//	 КодВалюты	  - Строка - Код валюты
//	 Наименование - Булево - (необязательное) Признак того, что нужно вернуть наименование валюты.
//
// Возвращаемое значение:
//	 Строка	- Наименование валюты, пример:
//   	RUB 			 - Символьный код валюты
//		Российский рубль - Наименование валюты
//
Функция НаименованиеВалюты(КодВалюты, Наименование = Ложь)
	
	Результат = "";
	
	СтрокаОКВ = ПолучитьОКВ().Найти(КодВалюты, "Код");
	
	Если СтрокаОКВ <> Неопределено Тогда
		
		Если Наименование = Истина Тогда
			Результат = СтрокаОКВ.Наименование;
		Иначе
			Результат = СтрокаОКВ.КодСимвольный;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает символьный код валюты по коду
//
// Параметры:
//  КодВалюты - Строка - Код валюты
//
// Возвращаемое значение:
//  Строка - Наименование валюты
//
Функция СимвольныйКодВалюты(КодВалюты)
	
	ВернутьНаименованиеВалюты = Ложь;
	
	Результат = НаименованиеВалюты(
		КодВалюты,
		ВернутьНаименованиеВалюты
	);
	
	Возврат Результат;
	
КонецФункции

// Возвращает параметры исчисления валюты по коду.
// Параметры исчисления есть только для RUB, EUR, USD.
//
// Параметры:
//	 КодВалюты - Строка - Код валюты.
//
// Возвращаемое значение:
//	 Строка	- Параметры исчисления валюты, пример: "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2 знака"
//
Функция ПараметрыИсчисленияВалюты(КодВалюты) Экспорт
	
	Результат = "";
	
	СтрокаОКВ = ПолучитьОКВ().Найти(КодВалюты, "Код");
	
	Если СтрокаОКВ <> Неопределено Тогда
		Результат = СтрокаОКВ.ПараметрыИсчисления;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает наименование региона России, по числовому коду.
//
// Параметры:
//	 КодРегиона - Число, Строка - Код региона.
//
Функция НаименованиеРегиона(КодРегиона) Экспорт
	
	КодРегионаЧислом = Привести_К_Числу(КодРегиона);
	Результат = КодыРегионов()[КодРегионаЧислом];
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтроковыйИндексВТаблицуЗначений(ТаблицаЗначений, ИмяКолонки)
	
	ИмяКолонкиИндекса = "Индекс_" + ИмяКолонки;
	
	ТаблицаЗначений.Колонки.Добавить(ИмяКолонкиИндекса, ТаблицаЗначений.Колонки[ИмяКолонки].ТипЗначения);
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		Строка[ИмяКолонкиИндекса] = Врег(СтрЗаменить(СтрЗаменить(Строка[ИмяКолонки], " ", ""), ".", ""));
	КонецЦикла;
	
	ТаблицаЗначений.Индексы.Добавить(ИмяКолонкиИндекса);
	
КонецПроцедуры

Процедура ДобавитьСтрокуВ_ОКСМ(ОКСМ, НаименованиеКраткое, КодАльфа2, КодАльфа3, Код, НаименованиеПолное)
	
	НоваяСтрока = ОКСМ.Добавить();
	НоваяСтрока.НаименованиеКраткое	= НаименованиеКраткое;
	НоваяСтрока.КодАльфа2			= КодАльфа2;
	НоваяСтрока.КодАльфа3			= КодАльфа3;
	НоваяСтрока.Код					= Код;
	НоваяСтрока.НаименованиеПолное	= НаименованиеПолное;
	
КонецПроцедуры

Процедура ДополнитьТаблицуОКЕИ(ОКЕИ)
	
	// Добавляем строку "Литр" с кратким наименованием "л".
	// Причем строка "л" будет основной, а строка "л (дм3)" - дополнительной.
	СтрокаТЗ = ОКЕИ.Найти("112", "Код");
	ЗаполнитьЗначенияСвойств(ОКЕИ.Добавить(), СтрокаТЗ);
	СтрокаТЗ.НаименованиеКраткое = "л";
	
	// Добавляем строку "Сутки" с кратким наименованием "сут".
	// Причем строка "сут" будет основной, а строка "сут/дн" - дополнительной.
	СтрокаТЗ = ОКЕИ.Найти("359", "Код");
	ЗаполнитьЗначенияСвойств(ОКЕИ.Добавить(), СтрокаТЗ);
	СтрокаТЗ.НаименованиеКраткое = "сут";
	
	// Добавляем строку "Тысяча штук" с кратким наименованием "тыс. шт".
	// Причем строка "тыс. шт" будет основной, а строка "тыс. шт/1000 шт" - дополнительной.
	СтрокаТЗ = ОКЕИ.Найти("798", "Код");
	ЗаполнитьЗначенияСвойств(ОКЕИ.Добавить(), СтрокаТЗ);
	СтрокаТЗ.НаименованиеКраткое = "тыс. шт";
	
	// Добавляем строку "Год" с кратким наименованием "г".
	// Причем строка "г" будет основной, а строка "г/лет" - дополнительной.
	СтрокаТЗ = ОКЕИ.Найти("366", "Код");
	ЗаполнитьЗначенияСвойств(ОКЕИ.Добавить(), СтрокаТЗ);
	СтрокаТЗ.НаименованиеКраткое = "г";
	
	// Добавляем строку "Километр" с кратким наименованием "км".
	// Причем строка "км" будет основной, а строка "км/1000 м" - дополнительной.
	СтрокаТЗ = ОКЕИ.Найти("008", "Код");
	ЗаполнитьЗначенияСвойств(ОКЕИ.Добавить(), СтрокаТЗ);
	СтрокаТЗ.НаименованиеКраткое = "км";
	
	// Добавляем строку "Тысяча кубических метров" с кратким наименованием "10^3 м3".
	// Причем строка "1000 м3" будет основной, а строка "10^3 м3" - дополнительной.
	СтрокаТЗ = ОКЕИ.Найти("114", "Код");
	ЗаполнитьЗначенияСвойств(ОКЕИ.Добавить(), СтрокаТЗ);
	СтрокаТЗ.НаименованиеКраткое = "10^3 м3";
	
КонецПроцедуры

//}		КЛАССИФИКАТОРЫ

//**************************************
//{ ФУНКЦИИ СЕРИАЛИЗАЦИИ

Функция XML_В_XDTO(СтрокаXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

Функция XDTO_В_Таблицу(ОбъектXDTO)
	
	Таблица = Новый ТаблицаЗначений;
	
	СвойстваОбъектаXDTO = ОбъектXDTO.Свойства();
	
	Если СвойстваОбъектаXDTO.Получить("column") <> Неопределено Тогда
		Добавить_КолонкиXDTO_В_КоллекциюКолонок(ОбъектXDTO.column, Таблица.Колонки);
	КонецЕсли;
	
	Для Каждого СтрокаXDTO Из ОбъектXDTO.row Цикл
		
		НоваяСтрока = Таблица.Добавить();
		
		ИндексКолонки = -1;
		Для Каждого ЗначениеКолонки Из СтрокаXDTO.Value Цикл
			
			ИндексКолонки = ИндексКолонки + 1;
			
			Если ТипЗнч(ЗначениеКолонки) <> Тип("ОбъектXDTO") Тогда
				НоваяСтрока[ИндексКолонки] = ЗначениеКолонки;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если СвойстваОбъектаXDTO.Получить("index") <> Неопределено Тогда
		Добавить_ИндексыXDTO_В_ИндексыКоллекции(ОбъектXDTO.index, Таблица.Индексы);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция XDTO_В_Дерево(ОбъектXDTO)
	
	Дерево = Новый ДеревоЗначений;
	
	Добавить_КолонкиXDTO_В_КоллекциюКолонок(ОбъектXDTO.column, Дерево.Колонки);
	
	Добавить_СписокXDTO_В_Дерево(ОбъектXDTO.row, Дерево.Строки);
	
	Возврат Дерево;
	
КонецФункции

Функция Дерево_В_Таблицу(Дерево, СИерархией)
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из Дерево.Колонки Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	ЗаполнитьТаблицуИзДерева(Таблица, Дерево, СИерархией);
	
	Возврат Таблица;
	
КонецФункции

// Проверяет, содержит ли описание типов XDTO тип "Число".
// Если в описании типов есть тип "Число", его квалификаторы
// возвращатся во втором параметре.
//
// Параметры:
//  ТипОбъектаXDTO - ОбъектXDTO - объект модели XDTO.
//  Квалификаторы - КвалификаторыЧисла - квалификаторы числа (возвращаемый параметр).
// 
// Возвращаемое значение:
//  Булево - Истина, есть тип "Число".
//
Функция ТипXDTOСодержитТипЧисло(ТипОбъектаXDTO, Квалификаторы)
	
	Результат = Ложь;
	
	СвойстваValueType = ТипОбъектаXDTO.Свойства();
	
	Если СвойстваValueType.Получить("NumberQualifiers") <> Неопределено
		И ТипОбъектаXDTO.NumberQualifiers <> Неопределено Тогда
		
		Результат = Истина;
		
		Квалификаторы = КвалификаторыЧислаИзXDTO(ТипОбъектаXDTO.NumberQualifiers);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает квалификаторы числа из квалификаторов числа объекта XDTO.
//
// Параметры:
//  КвалификаторЧислаXDTO - NumberQualifiers - описание допустимых значений числового типа.
// 
// Возвращаемое значение:
//  КвалификаторыЧисла.
//
Функция КвалификаторыЧислаИзXDTO(КвалификаторЧислаXDTO)
	
	РазрядностьЦелойЧасти = Число(КвалификаторЧислаXDTO.Digits);
	РазрядностьДробнойЧасти = Число(КвалификаторЧислаXDTO.FractionDigits);
	
	Если ТипЗнч(КвалификаторЧислаXDTO.AllowedSign) = Тип("ДопустимыйЗнак") Тогда
		_ДопустимыйЗнак = КвалификаторЧислаXDTO.AllowedSign;
	Иначе
		_ДопустимыйЗнак = ДопустимыйЗнак[КвалификаторЧислаXDTO.AllowedSign];
	КонецЕсли;
	
	Результат = Новый КвалификаторыЧисла(РазрядностьЦелойЧасти,
		РазрядностьДробнойЧасти,
		_ДопустимыйЗнак);
	
	Возврат Результат;
	
КонецФункции


// Проверяет, содержит ли описание типов XDTO тип "Строка".
// Если в описании типов есть тип "Строка", его квалификаторы
// возвращатся во втором параметре.
//
// Параметры:
//  ТипОбъектаXDTO - ОбъектXDTO - объект модели XDTO.
//  Квалификаторы - КвалификаторыСтроки - квалификаторы строки (возвращаемый параметр).
// 
// Возвращаемое значение:
//  Булево - Истина, если есть тип "Строка".
//
Функция ТипXDTOСодержитТипСтрока(ТипОбъектаXDTO, Квалификаторы)
	
	Результат = Ложь;
	
	СвойстваValueType = ТипОбъектаXDTO.Свойства();
	
	Если СвойстваValueType.Получить("StringQualifiers") <> Неопределено 
		И ТипОбъектаXDTO.StringQualifiers <> Неопределено Тогда
		
		Результат = Истина;
		
		Квалификаторы = КвалификаторыСтрокиИзXDTO(ТипОбъектаXDTO.StringQualifiers);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает квалификаторы строки из квалификаторов строки объекта XDTO.
//
// Параметры:
//  КвалификаторСтрокиXDTO - StringQualifiers - описание допустимых значений строкового типа.
// 
// Возвращаемое значение:
//  КвалификаторыСтроки.
//
Функция КвалификаторыСтрокиИзXDTO(КвалификаторСтрокиXDTO)
	
	Длина = Число(КвалификаторСтрокиXDTO.Length);
	
	Если ТипЗнч(КвалификаторСтрокиXDTO.AllowedLength) = Тип("ДопустимаяДлина") Тогда
		_ДопустимаяДлина = КвалификаторСтрокиXDTO.AllowedLength;
	Иначе
		_ДопустимаяДлина = ДопустимаяДлина[КвалификаторСтрокиXDTO.AllowedLength];
	КонецЕсли;
	
	Результат = Новый КвалификаторыСтроки(Длина, _ДопустимаяДлина);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, содержит ли описание типов XDTO тип "Дата".
// Если в описании типов есть тип "Дата", его квалификаторы
// возвращатся во втором параметре.
//
// Параметры:
//  ТипОбъектаXDTO - ОбъектXDTO - объект модели XDTO.
//  Квалификаторы - КвалификаторыДаты - квалификаторы даты (возвращаемый параметр).
// 
// Возвращаемое значение:
//  Булево - Истина, если есть тип "Дата".
//
Функция ТипXDTOСодержитТипДата(ТипОбъектаXDTO, Квалификаторы)
	
	Результат = Ложь;
	
	СвойстваValueType = ТипОбъектаXDTO.Свойства();
	
	Если СвойстваValueType.Получить("DateQualifiers") <> Неопределено 
		И ТипОбъектаXDTO.DateQualifiers <> Неопределено Тогда
		
		Результат = Истина;
		
		Квалификаторы = КвалификаторыДатыИзXDTO(ТипОбъектаXDTO.DateQualifiers);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает квалификаторы даты из квалификаторов даты объекта XDTO.
//
// Параметры:
//  КвалификаторДатыXDTO - DateQualifiers - описание допустимых значений типа "Дата".
// 
// Возвращаемое значение:
//  КвалификаторыДаты.
//
Функция КвалификаторыДатыИзXDTO(КвалификаторДатыXDTO)
	
	Если ТипЗнч(КвалификаторДатыXDTO.DateFractions) = Тип("ЧастиДаты") Тогда
		_ЧастиДаты = КвалификаторДатыXDTO.DateFractions;
	Иначе
		_ЧастиДаты = ЧастиДаты[КвалификаторДатыXDTO.DateFractions];
	КонецЕсли;
	
	Результат = Новый КвалификаторыДаты(_ЧастиДаты);
	
	Возврат Результат;
	
КонецФункции

Функция ТипXDTOСодержитТипБулево(ТипXDTO)
	
	Результат = Ложь;
	
	Если Найти(НРег(ТипXDTO.Type), "boolean") > 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеТиповПоТипуXDTO(ТипXDTO)
	
	МассивТипов = Новый Массив;
	КвалификаторыЧисла  = Неопределено;
	КвалификаторыСтроки = Неопределено;
	КвалификаторыДаты 	= Неопределено;
	
	Если ТипXDTOСодержитТипЧисло(ТипXDTO, КвалификаторыЧисла) Тогда
		МассивТипов.Добавить(Тип("Число"));
	КонецЕсли;
	
	Если ТипXDTOСодержитТипСтрока(ТипXDTO, КвалификаторыСтроки) Тогда
		МассивТипов.Добавить(Тип("Строка"));
	КонецЕсли;
	
	Если ТипXDTOСодержитТипДата(ТипXDTO, КвалификаторыДаты) Тогда
		МассивТипов.Добавить(Тип("Дата"));
	КонецЕсли;
	
	Если ТипXDTOСодержитТипБулево(ТипXDTO) Тогда
		МассивТипов.Добавить(Тип("Булево"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивТипов) Тогда
		
		Результат = Новый ОписаниеТипов(МассивТипов,
			КвалификаторыЧисла,
			КвалификаторыСтроки,
			КвалификаторыДаты);
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура Добавить_КолонкиXDTO_В_КоллекциюКолонок(КолонкиXDTO, КоллекцияКолонок)
	
	Для Каждого КолонкаXDTO Из КолонкиXDTO Цикл
		
		ТипКолонкиXDTO = КолонкаXDTO.ValueType;
		ОписаниеТипаКолонки = ОписаниеТиповПоТипуXDTO(ТипКолонкиXDTO);
		
		КоллекцияКолонок.Добавить(КолонкаXDTO.Name, ОписаниеТипаКолонки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Добавить_ИндексыXDTO_В_ИндексыКоллекции(ИндексыXDTO, ИндексыКоллекции)
	
	Для Каждого ИндексXDTO Из ИндексыXDTO Цикл
		
		Если ТипЗнч(ИндексXDTO.column) = Тип("СписокXDTO") Тогда
			
			КолонкиИндекса = "";
			Разделитель = "";
			
			Для Каждого КолонкаИндекса Из ИндексXDTO.column Цикл
				КолонкиИндекса = КолонкиИндекса + Разделитель + КолонкаИндекса;
				Разделитель = ", ";
			КонецЦикла;
			
		Иначе
			КолонкиИндекса = ИндексXDTO.column;
		КонецЕсли;
		
		ИндексыКоллекции.Добавить(КолонкиИндекса);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Добавить_СписокXDTO_В_Дерево(СписокXDTO, СтрокиДерева)
	
	Для Каждого СтрокаXDTO Из СписокXDTO Цикл
		
		НоваяСтрока = СтрокиДерева.Добавить();
		
		ИндексКолонки = -1;
		Для Каждого ЗначениеКолонки Из СтрокаXDTO.Value Цикл
			
			ИндексКолонки = ИндексКолонки + 1;
			
			Если ТипЗнч(ЗначениеКолонки) <> Тип("ОбъектXDTO") Тогда
				НоваяСтрока[ИндексКолонки] = ЗначениеКолонки;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаXDTO.Свойства().Получить("row") <> Неопределено Тогда
			
			Добавить_СписокXDTO_В_Дерево(СтрокаXDTO.row, НоваяСтрока.Строки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуИзДерева(Таблица, Дерево, СИерархией)
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.Строки) Тогда
			
			Если СИерархией Тогда
				ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
			КонецЕсли;
			
			ЗаполнитьТаблицуИзДерева(Таблица, СтрокаДерева, СИерархией);
			
		Иначе
			ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//} ФУНКЦИИ СЕРИАЛИЗАЦИИ

//**********************************************
//{		ОБЩЕГО НАЗНАЧЕНИЯ

Функция ОписаниеСистемнойИнформации()
	
	Результат = Новый Структура;
	Результат.Вставить("ВерсияОС");
	Результат.Вставить("ВерсияПриложения");
	Результат.Вставить("ИдентификаторКлиента");
	Результат.Вставить("ИнформацияПрограммыПросмотра");
	Результат.Вставить("ОперативнаяПамять");
	Результат.Вставить("Процессор");
	Результат.Вставить("ТипПлатформы");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЗаполнитьЗначенияСвойств(Результат, СистемнаяИнформация);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПлатформа82ИлиВыше()
	
	СисИнфо = ОписаниеСистемнойИнформации();
	ВерсияПриложения = СисИнфо.ВерсияПриложения;
	
	ДлинаЗначимойЧасти = 3;
	РедакцияПлатформы = Лев(ВерсияПриложения, ДлинаЗначимойЧасти);
	
	Результат = Истина;
	
	Если РедакцияПлатформы = "8.0" Или РедакцияПлатформы = "8.1" Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Полное имя ключа с учетом вложенности структур,
//                                       имена свойств вложенных структур отделяются точкой.
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = ЗначениеПоУмолчанию;
	
	Если Не ЭтоСтруктура(Структура) Или Не ЗначениеЗаполнено(Ключ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗначениеПолучено = Ложь;
	ТекущееЗначение	 = Неопределено;
	ТекущаяСтруктура = Структура;
	МассивКлючей	 = РазделитьСтрокуЛок(Ключ, ".");
	ВГраницаКлючей	 = МассивКлючей.ВГраница();
	
	Для Сч = 0 По ВГраницаКлючей Цикл
		
		ЧастьКлюча = МассивКлючей[Сч];
		
		Если ТекущаяСтруктура.Свойство(ЧастьКлюча, ТекущееЗначение) Тогда
			
			Если Сч = ВГраницаКлючей Тогда
				
				// Это последняя часть ключа,
				// значит значение получить удалось.
				ЗначениеПолучено = Истина;
				
			ИначеЕсли ЭтоСтруктура(ТекущееЗначение) Тогда
				
				// Это следующая вложенная структура, копаем дальше.
				ТекущаяСтруктура = ТекущееЗначение;
				
			Иначе
				
				// Это не последняя часть ключа
				// но при этом нет следующей вложенной структуры,
				// значит возжности получить значение нет.
				Прервать;
				
			КонецЕсли;
			
		Иначе
			
			Прервать; // Значение получить не удалось.
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеПолучено Тогда
		Результат = ТекущееЗначение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
// 
// Возвращаемое значение:
//   Массив - массив со строками, которые получились в результате разделения исходной строки.
//
Функция РазделитьСтрокуЛок(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// 
// Параметры:
//  Строки - Массив из Строка - коллекция строк, которые нужно соединить.
//  Разделитель - Строка - (Необязательный) Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
Функция СоединитьСтроку(Строки, Разделитель = "")
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник      - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник      - Массив - массив, из которого нужно взять значения;
//  ТолькоНовыеЗначения - Булево - (необязательный) Истина, если в применик нужно добавить
//                                 только те значения, которых в нем еще нет;
//
Процедура ДополнитьМассивЛокальная(МассивПриемник, МассивИсточник, ТолькоНовыеЗначения = Ложь)
	
	Если ТолькоНовыеЗначения Тогда
		
		ЗначенияПриемника = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			ЗначенияПриемника.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			
			Если ЗначенияПриемника[Значение] = Неопределено Тогда
				
				МассивПриемник.Добавить(Значение);
				
				ЗначенияПриемника.Вставить(Значение, Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура") Тогда
		
		Результат = Истина;
		
	ИначеЕсли ЭтоПлатформа82ИлиВыше() И ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитИлиСвойствоОбъектаЛокальная(Объект, ИмяСвойства)
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("ОбъектXDTO") Тогда
		
		Результат = Объект.Свойства().Получить(ИмяСвойства) <> Неопределено;
		
	ИначеЕсли ТипОбъекта = Тип("Структура") Тогда
		
		Результат = Объект.Свойство(ИмяСвойства);
		
	ИначеЕсли ТипОбъекта = Тип("СтрокаТаблицыЗначений") Тогда
		
		Результат = Объект.Владелец().Колонки.Найти(ИмяСвойства) <> Неопределено;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон строки с параметрами;
//  Параметр<n>	 - Строка - подставляемый параметр.
//
// Пример:
//  Общее_ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
// 
// Возвращаемое значение:
//  Строка - строка с подставленными параметрами.
//
Функция Общее_ПодставитьПараметрыВСтроку(ШаблонСтроки
	, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено
	)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Преобразует доп. сведения в виде строки в доп. сведения
// в виде массива структур
//
// Параметры:
//  Значение - Строка - значение дополнительных сведений
//  Ключ     - Строка - ключ дополнительных сведений
// 
// Возвращаемое значение:
//  Массив - содержит структуры с полями:
//           * Key   - Строка - ключ дополнительных сведений
//           * Value - Строка - значение дополнительных сведений
//
Функция ЗначениеВМассивKeyValue(Значение, Ключ = "")
	
	Результат = Новый Массив;
	
	Элемент = Новый Структура;
	Элемент.Вставить("Key"	, Ключ);
	Элемент.Вставить("Value", Значение);
	
	Результат.Добавить(Элемент);
	
	Возврат Результат;
	
КонецФункции

Функция ПервыйЭлементКоллекции(Коллекция)
	
	Если ЗначениеЗаполнено(Коллекция) Тогда
		Результат = Коллекция[0];
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИстина(Значение)
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Результат = (НРег(Значение) = "true");
	Иначе
		Результат = (Значение = Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСтавка_БезНДС(TaxRate)
	
	Результат = (НРег(TaxRate) = НРег(СтрокаБезНДС()));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСтавка_ИсчисляетсяНалоговымАгентом(TaxRate)
	
	Результат = (НРег(TaxRate) = НРег(СтрокаИсчНалАг()));
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаДефис()
	
	Возврат "-";
	
КонецФункции

Функция СтрокаХ()
	
	Возврат "Х";
	
КонецФункции

Функция СтрокаБезНДС()
	
	Возврат "без НДС";
	
КонецФункции

Функция СтрокаИсчНалАг()
	
	Возврат "исчналаг";
	
КонецФункции

Функция СтрокаБезАкциза()
	
	Возврат "без акциза";
	
КонецФункции

Функция СтрокаБезНомера()
	
	Возврат "б/н";
	
КонецФункции

Функция СтрокаПустая()
	
	Возврат "";
	
КонецФункции

Функция СтрокаБезДокументаОснования()

	Возврат "Без документа-основания отгрузки товаров (передачи результатов работ), передачи имущественных прав (предъявления оказанных услуг)";	
	
КонецФункции

Функция ФорматПустогоЗначенияЧисла(ФорматЧисла)
	
	Возврат ФорматЧисла + "; ЧН=";
	
КонецФункции

Функция ФорматКоличества(Точность = 3)
	
	Возврат "ЧДЦ=" + СокрЛП(Точность);
	
КонецФункции

Функция ФорматСуммы(Точность = 2)
	
	Возврат "ЧДЦ=" + СокрЛП(Точность);
	
КонецФункции

Функция ФорматДаты()
	
	Возврат "ДФ=dd.MM.yyyy";
	
КонецФункции

// Конструктор структуры с полями "Ключ" и "Значение".
//
// Параметры:
//  Ключ - Строка - значение поля "Ключ".
//  Значение - Строка - значение поля "Значение".
// 
// Возвращаемое значение:
//  Структура:
//    * Ключ - Строка
//    * Значение - Строка
//
Функция НовыйКлючЗначение(Ключ, Значение)
	
	Результат = Новый Структура;
	Результат.Вставить("Ключ", Ключ);
	Результат.Вставить("Значение", Значение);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКлючЗначение(КлючиИЗначения, Ключ, Значение)
	
	Элемент = НовыйКлючЗначение(Ключ, Значение);
	КлючиИЗначения.Добавить(Элемент);
	
КонецПроцедуры

Функция Тест_ПредставлениеАдрРФ(AddressInfo) Экспорт
	Возврат ПредставлениеАдрРФ(AddressInfo);
КонецФункции


//}		ОБЩЕГО НАЗНАЧЕНИЯ
