////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off

&НаКлиенте
Перем ОповещениеОЗавершенииЛок;

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЕРВИСНЫЕ МЕТОДЫ

// Возвращает форму для вызова сервера без контекста вызывающей формы
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Модуль_ПлатформаНаКлиенте()
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	
	Результат = ПлатформаНаКлиенте.Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	ПлатформаНаКлиенте = Модуль_ПлатформаНаКлиенте();
	ПараметрыДляПроверкиСНИЛС_OID = ПлатформаНаКлиенте.ПараметрыДляПроверкиСНИЛС_OID(ВведенныйСНИЛС, ВведенныйOID);
	
	РезультатПроверкиСНИЛС_OID = ПлатформаНаКлиенте.ПроверитьСНИЛС_OID(ПараметрыДляПроверкиСНИЛС_OID);
	ДействиеМетрики = Метрика_ДействиеПродолжить();
	
	Если РезультатПроверкиСНИЛС_OID.РазрешитьДействие = Истина Тогда
		
		ПлатформаНаКлиенте.ВыполнитьОбработкуОповещенияЛок(ОповещениеОЗавершенииЛок, РезультатПроверкиСНИЛС_OID);
		
		ВыбранноеДействие = РезультатПроверкиСНИЛС_OID.ВыбранноеДействие;
		
		Метрика_ДобавитьСтатистику_НажатиеКнопки(ДействиеМетрики, ВыбранноеДействие);
		
		Закрыть(РезультатПроверкиСНИЛС_OID);
		
	Иначе
		ПодробноеОписаниеСтатуса = РезультатПроверкиСНИЛС_OID.ПодробноеОписаниеСтатуса;
		
		ТекстЗаголовка = НСтр("ru = 'Ошибка ввода СНИЛС/OID'");
		ТекстПредупреждения = ПодробноеОписаниеСтатуса;
		
		ПлатформаНаКлиенте.ПоказатьПредупреждениеЛок(, ТекстПредупреждения, , ТекстЗаголовка);
		
	КонецЕсли;
	
	Метрика_ДобавитьПоведение_НажатиеКнопки(ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВведенныйСНИЛСПриИзменении(Элемент)
	УстановитьДоступностьПолейФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВведенныйOIDПриИзменении(Элемент)
	УстановитьДоступностьПолейФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПолейФормы()
	Если Не ПустаяСтрока(ВведенныйСНИЛС) Тогда
		Элементы.ВведенныйOID.Доступность = Ложь;
	ИначеЕсли Не ПустаяСтрока(ВведенныйOID) Тогда
		Элементы.ВведенныйСНИЛС.Доступность = Ложь;
	Иначе
		Элементы.ВведенныйOID.Доступность = Истина;
		Элементы.ВведенныйСНИЛС.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_НажатиеКнопки(Действие)
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	
	НазваниеФормы = Метрики_НаименованиеФормы();
	Категория = Метрика_КатегорияГосключ();
	Метка = Метрики_МеткаНажатиеНаКнопку();
	
	ПредставлениеМетрики = Метрики_ПредставлениеНажатиеНаКнопку();
	
	ЯдроНаКлиенте.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		Категория,
		Действие,
		Метка,
		ПредставлениеМетрики,
		ИдентификаторТрассировки
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_НажатиеКнопки(Действие, ВыбранноеДействие)
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID", ИдентификаторЯщика);
	ДопПеременные.Вставить("СНИЛС / OID", ВыбранноеДействие);
	Категория = Метрика_КатегорияГосключ();
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	
	ЯдроНаКлиенте.Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		Категория,
		Действие, ,
		ДопПеременные, ,
		ИдентификаторТрассировки
	);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеПродолжить()
	Возврат "ВводСНИЛС_OID";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_НаименованиеФормы()
	Возврат "Госключ_ФормаВводаСНИЛСOID";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_КатегорияГосключ()
	Возврат "Госключ";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_МеткаНажатиеНаКнопку()
	Возврат "Нажатие на кнопку";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_ПредставлениеНажатиеНаКнопку()
	Возврат "Данные пользователя в приложении Госключ";
КонецФункции

&НаСервере
Процедура ИнициализироватьИдентификаторТрассировки()
	
	Метрики_НаименованиеФормы = Метрики_НаименованиеФормы();
	СтрокаИдентификатора = Строка(Новый УникальныйИдентификатор());
	
	// BSLLS:UnusedLocalVariable-off
	ИдентификаторТрассировки = Метрики_НаименованиеФормы + "_" + СтрокаИдентификатора;
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму(Параметры);
	
	ИнициализироватьИдентификаторТрассировки();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму(ПараметрыФормы) Экспорт
	
	// BSLLS:UnusedLocalVariable-off
	ИдентификаторЯщика = ПараметрыФормы.ИдентификаторЯщика;
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

