//******************************************
//{		ПОДКЛЮЧЕНИЕ В DDStandart
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Манифест Экспорт;
Перем ОбработкаОбъект Экспорт;
Перем ПараметрыКлиентСервер Экспорт;
Перем НомерИтерацииВызоваМодуля;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля = 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект = Неопределено;
		ПараметрыКлиентСервер = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьМанифест(Модуль, ИмяМодуля) Экспорт
	
	ФункцииМодуля = ФункцииМодуля();
	
	Манифест = Новый Структура;
	Манифест.Вставить("Функции", ФункцииМодуля);
	
КонецПроцедуры

Функция ФункцииМодуля()
	
	Результат = Новый Структура;
	
	Возврат Результат;
	
КонецФункции

//}		ПОДКЛЮЧЕНИЕ В DDStandart


//**********************************************
//{		ПрограммныйИнтерфейс

// Проверяет, что электронный документ является передаточным документом и счетом-фактурой.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
// Возвращаемое значение:
//  Булево - Истина, если это УПД с функцией СЧФДОП.
//
Функция ЭтоУниверсальныйПередаточныйДокумент(ФорматЭД) Экспорт
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	
	ЭтоУПД = (ТипДокумента = Тип_УПД() ИЛИ ТипДокумента = Тип_ИсправлениеУПД());
	
	Результат = (ЭтоУПД И ФункцияДокумента = Функция_СЧФДОП());
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является счетом-фактурой.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
// Возвращаемое значение:
//  Булево - Истина, если это СФ или УПД с функцией СЧФ.
//
Функция ЭтоСчетФактура(ФорматЭД) Экспорт
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	
	ЭтоУПД = (ТипДокумента = Тип_УПД() ИЛИ ТипДокумента = Тип_ИсправлениеУПД());
	ЭтоСФ = (ТипДокумента = Тип_СФ() ИЛИ ТипДокумента = Тип_ИсправлениеСФ());
	
	Результат = Ложь;
	
	Если ЭтоУПД И ФункцияДокумента = Функция_СЧФ()
		ИЛИ ЭтоСФ Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является передаточным документом.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
// Возвращаемое значение:
//  Булево - Истина, если это накладная, акт или УПД с функцией ДОП.
//
Функция ЭтоПередаточныйДокумент(ФорматЭД) Экспорт
	
	Результат = Ложь;
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	
	ЭтоУПД = (ТипДокумента = Тип_УПД() ИЛИ ТипДокумента = Тип_ИсправлениеУПД());
	
	Если ЭтоУПД И ФункцияДокумента = Функция_ДОП()
		ИЛИ ТипДокумента = Тип_Накладная()
		ИЛИ ТипДокумента = Тип_АктОбОказанииУслуг() Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является соглашением об изменении стоимости и корректировочным счетом-фактурой.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
// Возвращаемое значение:
//  Булево - Истина, если это УКД с функцией КСЧФДИС.
//
Функция ЭтоУниверсальныйКорректировочныйДокумент(ФорматЭД) Экспорт
	
	Результат = Ложь;
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	
	ЭтоУКД = (ТипДокумента = Тип_УКД() ИЛИ ТипДокумента = Тип_ИсправлениеУКД());
	
	Если ЭтоУКД И ФункцияДокумента = Функция_КСЧФДИС() Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является корректировочным счетом-фактурой.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
// Возвращаемое значение:
//  Булево - Истина, если это УКД с функцией КСЧФДИС или ДИС.
//
Функция ЭтоКорректировочныйСчетФактура(ФорматЭД) Экспорт
	
	Результат = Ложь;
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	
	ЭтоУКД = (ТипДокумента = Тип_УКД() ИЛИ ТипДокумента = Тип_ИсправлениеУКД());
	ЭтоКСФ = (ТипДокумента = Тип_КСФ() ИЛИ ТипДокумента = Тип_ИсправлениеКСФ());
	
	Если ЭтоУКД И ФункцияДокумента = Функция_КСЧФ()
		ИЛИ ЭтоКСФ Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является соглашением об изменении стоимости.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
// Возвращаемое значение:
//  Булево - Истина, если это УКД с функцией ДИС.
//
Функция ЭтоСоглашениеОбИзмененииСтоимости(ФорматЭД) Экспорт
	
	Результат = Ложь;
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	ФункцияДокумента = ФорматЭД.ФункцияДокумента;
	
	ЭтоУКД = (ТипДокумента = Тип_УКД() ИЛИ ТипДокумента = Тип_ИсправлениеУКД());
	
	Если ЭтоУКД И ФункцияДокумента = Функция_ДИС() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является актом сверки взаиморасчетов в формате 405@.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
// Возвращаемое значение:
//  Булево - Истина, если это Акт сверки взаиморасчетов в формате 405@.
//
Функция ЭтоАктСверкиВзаиморасчетов(ФорматЭД) Экспорт
	
	Результат = Ложь;
	
	ТипДокумента = ФорматЭД.ИмяТипа;
	
	Если ТипДокумента = Тип_АктСверкиВзаиморасчетов() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ПрограммныйИнтерфейс


//**********************************************
//{		СлужебныйПрограммныйИнтерфейс

// Версия обработки в стандартном формате
// Подробнее: https://semver.org/lang/ru/
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * СС - номер сборки      - номер сборки;
//
Функция ВерсияОбработки() Экспорт
	
	Возврат "0.1.0";
	
КонецФункции

//}		СлужебныйПрограммныйИнтерфейс


//**********************************************
//{		СлужебныеПроцедурыИФункции

Функция Функция_СЧФДОП()
	Возврат "СЧФДОП";
КонецФункции

Функция Функция_СЧФ()
	Возврат "СЧФ";
КонецФункции

Функция Функция_ДОП()
	Возврат "ДОП";
КонецФункции

Функция Функция_КСЧФДИС()
	Возврат "КСЧФДИС";
КонецФункции

Функция Функция_КСЧФ()
	Возврат "КСЧФ";
КонецФункции

Функция Функция_ДИС()
	Возврат "ДИС";
КонецФункции

Функция Функция_default()
	Возврат "default";
КонецФункции

Функция Тип_УПД()
	Возврат "UniversalTransferDocument";
КонецФункции

Функция Тип_ИсправлениеУПД()
	Возврат "UniversalTransferDocumentRevision";
КонецФункции

Функция Тип_УКД()
	Возврат "UniversalCorrectionDocument";
КонецФункции

Функция Тип_ИсправлениеУКД()
	Возврат "UniversalCorrectionDocumentRevision";
КонецФункции

Функция Тип_СФ()
	Возврат "Invoice";
КонецФункции

Функция Тип_ИсправлениеСФ()
	Возврат "InvoiceRevision";
КонецФункции

Функция Тип_КСФ()
	Возврат "InvoiceCorrection";
КонецФункции

Функция Тип_ИсправлениеКСФ()
	Возврат "InvoiceCorrectionRevision";
КонецФункции

Функция Тип_Накладная()
	Возврат "XmlTorg12";
КонецФункции

Функция Тип_АктОбОказанииУслуг()
	Возврат "XmlAcceptanceCertificate";
КонецФункции

Функция Тип_АктСверкиВзаиморасчетов()
	Возврат "ReconciliationAct";
КонецФункции

//}		СлужебныеПроцедурыИФункции