// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Ядро Экспорт;

Перем ЧитатьВСоответствие;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//**************************************
//{		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Истина);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Версия = "1.0.1";
	
	Результат = Версия + "." + НомерСборки();
	
	Возврат Результат;
	
КонецФункции

// Сквозной номер сборки, обновляется автоматически
//
Функция НомерСборки()
	
	Возврат "2";
	
КонецФункции

//}		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

//**********************************************
//{		ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция Прочитать(Строка) Экспорт

	ЧитатьВСоответствие = Ложь;

	Результат = ПереопределенныйПрочитатьJSON(Строка);
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьВСоответствие(Строка) Экспорт

	ЧитатьВСоответствие = Истина;

	Результат = ПереопределенныйПрочитатьJSON(Строка);
	
	Возврат Результат;
	
КонецФункции

Функция ПереопределенныйПрочитатьJSON(Строка)

	Если ПриложениеСтаршеВерсии("8.3.6") Тогда
		Результат = Парсер_ПрочитатьJSON(Строка);
	Иначе
		Результат = Платформа_ПрочитатьJSON(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Записать(Значение) Экспорт
	
	Если ПриложениеСтаршеВерсии("8.3.6") Тогда
		Результат = Парсер_ЗаписатьJSON(Значение);
	Иначе
		Результат = Платформа_ЗаписатьJSON(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ПРОГРАММНЫЙ ИНТЕРФЕЙС


//**********************************************
//{		КЭШИРОВАНИЕ

// Возвращает значение из общего для всех обработок кэша
//
// Параметры:
//  Ключ - Строка - см. процедуру Кэш_Поместить.
//
// Возвращаемое значение: 
//   Произвольный - см. процедуру Кэш_Поместить.
//
Функция Кэш_Прочитать(Ключ)
	
	Результат = Ядро.Кэш_Прочитать(Ключ);
	
	Возврат Результат;
	
КонецФункции

// Помещает значение в общий для всех обработок кэш
//
// Параметры:
//  Ключ     - Строка       - уникальный ключ помещаемого значения.
//  Значение - Произвольный - помещаемое значение.
//
Процедура Кэш_Поместить(Ключ, Значение)
	
	Ядро.Кэш_Поместить(Ключ, Значение);
	
КонецПроцедуры

//}		КЭШИРОВАНИЕ


//**********************************************
//{		ОБЩЕГО НАЗНАЧЕНИЯ

// Сравнивает текущую версию приложения с переданной версией.
// Параметры:
//  СтрокаВерсии1 - Строка - номер версии
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция ПриложениеСтаршеВерсии(Версия)
	
	РезультатыФункции = Кэш_Прочитать("РезультатыФункции_ПриложениеСтаршеВерсии");
	
	Если РезультатыФункции = Неопределено Тогда
		РезультатыФункции = Новый Соответствие;
	КонецЕсли;
	
	Результат = РезультатыФункции[Версия];
	
	Если Результат = Неопределено Тогда
		
		СисИнфо = Новый СистемнаяИнформация;
		
		Результат = (СравнитьВерсии(СисИнфо.ВерсияПриложения, Версия) < 0);
		
		РезультатыФункции.Вставить(Версия, Результат);
		
		Кэш_Поместить("РезультатыФункции_ПриложениеСтаршеВерсии", РезультатыФункции);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Версии типа "1.0.1b" сравнивать нельзя.
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(СтрокаВерсии1) ИЛИ НЕ ПустаяСтрока(СтрокаВерсии2) Цикл
		
		Поз = Найти(СтрокаВерсии1, ".");
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(СтрокаВерсии1, Поз - 1));
			СтрокаВерсии1 = Сред(СтрокаВерсии1, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(СтрокаВерсии1), 0, Число(СтрокаВерсии1));
			СтрокаВерсии1 = "";
		КонецЕсли;
		
		Поз = Найти(СтрокаВерсии2, ".");
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(СтрокаВерсии2, Поз - 1));
			СтрокаВерсии2 = Сред(СтрокаВерсии2, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(СтрокаВерсии2), 0, Число(СтрокаВерсии2));
			СтрокаВерсии2 = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат
	
КонецФункции

Функция ИдентификаторСобытияЖурналаРегистрации(ИмяСобытия)
	
	Результат = "Диадок.ПарсерJSON." + СокрЛП(ИмяСобытия);
	Возврат Результат;
	
КонецФункции

Процедура ЖурналРегистрации_ЗаписатьОшибку(ИмяСобытия, Ошибка)
	
	СобытиеЖР = ИдентификаторСобытияЖурналаРегистрации(ИмяСобытия);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖР,
		УровеньЖурналаРегистрации.Ошибка,
		Неопределено,
		Неопределено,
		Ошибка
	);
	
КонецПроцедуры

Процедура ЖурналРегистрации_ЗаписатьПредупреждение(ИмяСобытия, Ошибка)
	
	СобытиеЖР = ИдентификаторСобытияЖурналаРегистрации(ИмяСобытия);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖР,
		УровеньЖурналаРегистрации.Предупреждение,
		Неопределено,
		Неопределено,
		Ошибка
	);
	
КонецПроцедуры

//}		ОБЩЕГО НАЗНАЧЕНИЯ


//**********************************************
//{		ЧТЕНИЕ И ЗАПИСЬ JSON

Функция Платформа_ПрочитатьJSON(Строка)
	
	ЕстьОшибкаЧтенияИзСтроки = Ложь;
	ЕстьОшибкаЧтенияИзФайла = Ложь;
	
	Результат = Платформа_ПрочитатьИзСтроки(
			Строка,
			ЕстьОшибкаЧтенияИзСтроки
		);
	
	Если ЕстьОшибкаЧтенияИзСтроки Тогда
		
		Результат = Платформа_ПрочитатьИзФайла(
				Строка,
				ЕстьОшибкаЧтенияИзФайла
			);
		
	КонецЕсли;
	
	Отказ = (ЕстьОшибкаЧтенияИзСтроки И ЕстьОшибкаЧтенияИзФайла);
	
	Если Отказ Тогда
		
		ЖурналРегистрации_ЗаписатьОшибку(
			"ОшибкаЧтенияJSON",
			Строка
		);
		
		ВызватьИсключение "Не удалось прочитать JSON";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Платформа_ПрочитатьИзСтроки(Строка, Отказ)
	
	Чтение = Новый("ЧтениеJSON");
	Чтение.УстановитьСтроку(Строка);
	
	Попытка
		
		Результат = Вычислить("ПрочитатьJSON(Чтение, ЧитатьВСоответствие)");
		
	Исключение
		
		Отказ = Истина;
		
		Инфо = ИнформацияОбОшибке();
		Ошибка = КраткоеПредставлениеОшибки(Инфо);
		
		ЖурналРегистрации_ЗаписатьПредупреждение(
			"ЧтениеИзСтроки",
			Ошибка
		);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция Платформа_ПрочитатьИзФайла(Строка, Отказ)
	
	Кодировка = "utf-8";
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
	
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(Строка);
	ТД.Записать(ИмяВремФайла, Кодировка);
	ТД = Неопределено;
	
	Чтение = Новый("ЧтениеJSON");
	Чтение.ОткрытьФайл(ИмяВремФайла, Кодировка);
	
	Попытка
		
		Результат = Вычислить("ПрочитатьJSON(Чтение, ЧитатьВСоответствие)");
		
	Исключение
		
		Отказ = Истина;
		Инфо = ИнформацияОбОшибке();
		Ошибка = КраткоеПредставлениеОшибки(Инфо);
		
		ЖурналРегистрации_ЗаписатьПредупреждение(
			"ЧтениеИзФайла",
			Ошибка
		);
		
	КонецПопытки;
	
	Чтение.Закрыть();
	
	Попытка
		УдалитьФайлы(ИмяВремФайла);
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Ошибка = ПодробноеПредставлениеОшибки(Инфо);
		ЖурналРегистрации_ЗаписатьПредупреждение("УдалениеВременногоФайла", Ошибка);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция Платформа_ЗаписатьJSON(Значение)
	
	Запись = Новый ("ЗаписьJSON");
	Запись.УстановитьСтроку();
	
	Выполнить("ЗаписатьJSON(Запись, Значение)");
	
	Результат = Запись.Закрыть();
	
	Возврат Результат;
	
КонецФункции

//}		ЧТЕНИЕ И ЗАПИСЬ JSON


//**********************************************
//{		АЛЬТЕРНАТИВНОЕ ЧТЕНИЕ JSON

Функция Парсер_ПрочитатьJSON(Знач Строка)
	
	// Выполним замену экранируемых символов.
	Замены = Новый Массив;
	Замены.Добавить(Новый Структура("До, ИД, После", "\\", "71769bf9-6d91-4bc6-9dbf-362c8fd37354", "\"));
	Замены.Добавить(Новый Структура("До, ИД, После", "\""", "ec0cd866-326b-497f-9612-9041e977653d", """"""));
	
	ВыполнитьЗаменыДоОбработки(Строка, Замены);
	
	// Нарежем строку на куски, так она будет быстрее обрабатываться
	СимволыДляПереноса = "{}[]:,";
	Для Сч = 1 По СтрДлина(СимволыДляПереноса) Цикл
		ТекСимвол = Сред(СимволыДляПереноса, Сч, 1);
		Строка = СтрЗаменить(Строка, ТекСимвол, Символы.ПС + ТекСимвол + Символы.ПС);
	КонецЦикла;
	
	// Преобразуем строку в Массив строк, так обрабатывается гораздо быстрее
	МассивСтрок = ТекстВМассивСтрок(Строка);
	НомерТекущейСтроки = 1;
	
	// Распарсим
	Результат = ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки);
	
	// Вернем на место экранированные символы.
	ТекстСЗаменами = ЗначениеВСтрокуВнутр(Результат);
	ВыполнитьЗаменыПослеОбработки(ТекстСЗаменами, Замены);
	
	Результат = ЗначениеИзСтрокиВнутр(ТекстСЗаменами);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьЗаменыДоОбработки(Строка, Замены)
	
	Для Каждого Элемент Из Замены Цикл
		Строка = СтрЗаменить(Строка, Элемент.До, Элемент.ИД);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаменыПослеОбработки(Строка, Замены)
	
	Для Каждого Элемент Из Замены Цикл
		Строка = СтрЗаменить(Строка, Элемент.ИД, Элемент.После);
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки)
	
	ВсегоСтрок = МассивСтрок.Количество();
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		ТекСтрока = МассивСтрок[НомерТекущейСтроки];
	
		Если ПустаяСтрока(ТекСтрока) Тогда
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			Продолжить;
			
		ИначеЕсли СтрДлина(ТекСтрока) = 1 Тогда
			
			Если ТекСтрока = "{" Тогда
				
				// Начинается новая структура/соответствие.
				Результат = ЗаполнитьКоллекциюПоМассивуСтрок(МассивСтрок, НомерТекущейСтроки);
				Возврат Результат;
				
			ИначеЕсли ТекСтрока = "[" Тогда
				
				// Начинается новый массив.
				Результат = ОбработатьНовыйМассив(МассивСтрок, НомерТекущейСтроки);
				Возврат Результат;
				
			ИначеЕсли ТекСтрока = "," Или ТекСтрока = ":" Тогда
				
				// пустота, идем дальше
				
			Иначе// Таки значение
				
				Результат = ОбработатьКонечноеЗначение(МассивСтрок, НомерТекущейСтроки);
				Возврат Результат;
				
				
			КонецЕсли;
			
				
		ИначеЕсли СокрЛП(ТекСтрока = "") Тогда
			
				// Пустота, идем дальше
				
		Иначе
			
			// Мы попадаем на конечное значение. Оно может быть в кавычках или без
			Результат = ОбработатьКонечноеЗначение(МассивСтрок, НомерТекущейСтроки);
			Возврат Результат;
			
		КонецЕсли;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
	КонецЦикла;
	
КонецФункции

Функция ОбработатьКонечноеЗначение(МассивСтрок, НомерТекущейСтроки)
	
	// В этой строке может быть: одна кавычка, две, ноль
	НачальнаяСтрока = СокрЛП(МассивСтрок[НомерТекущейСтроки]);
	КавычкаОткрыта = (Лев(НачальнаяСтрока, 1) = """");
	КавычкаЗакрыта = (Прав(НачальнаяСтрока, 1) = """") И СтрДлина(НачальнаяСтрока) > 1;
	ЧислоКавычек = 0;
	
	Если КавычкаОткрыта И КавычкаЗакрыта Тогда
		
		Результат = НачальнаяСтрока;
		Результат = СтрЗаменить(Результат, """", "");
		
	ИначеЕсли Не КавычкаЗакрыта И Не КавычкаОткрыта Тогда
		
		// Тут еще будут преобразования: булево, числа, даты
		Результат = НачальнаяСтрока;
		
		Если Результат = "true" Тогда
			Возврат Истина;
		ИначеЕсли Результат = "false" Тогда
			Возврат Ложь;
		ИначеЕсли ВСтрокеТолькоЦифры(Результат) Тогда
			Возврат Число(Результат);
		КонецЕсли;
		
		Возврат Результат;
		
	Иначе// Многострочное значение, склеим
		//и оно началось с кавычки
		
		Результат	 = НачальнаяСтрока;
		ВсегоСтрок	 = МассивСтрок.Количество();
		
		Пока НомерТекущейСтроки < ВсегоСтрок Цикл
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
			ТекСтрока = МассивСтрок[НомерТекущейСтроки];
			
			Результат = Результат + ТекСтрока;
			
			Если Найти(ТекСтрока, """") > 0 Тогда 
				Результат = СокрЛП(Сред(Результат, 2, СтрДлина(Результат) - 2)); // уберем левую и правую кавычку
				Возврат Результат; // Вернемся Тогда, когда значение кончится, т.е. встретится кавычка (мы ведь все экранированные кавычки поменяли на гуиды)
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьКоллекциюПоМассивуСтрок(МассивСтрок, НомерТекущейСтроки)
	
	Если ЧитатьВСоответствие Тогда
		Результат = Новый Соответствие;
	Иначе
		Результат = Новый Структура;
	КонецЕсли;
	
	ВсегоСтрок = МассивСтрок.Количество();
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
		ТекСтрока = МассивСтрок[НомерТекущейСтроки];
		
		Если ТекСтрока = "}" Тогда
			// Структура закончилась
			Возврат Результат;
			
		ИначеЕсли ТекСтрока = "," Тогда
			
			Продолжить; // Дальше должен быть еще одна пара ключ-значение
			
		ИначеЕсли СокрЛП(ТекСтрока) = "" Тогда//пробелы и т.д.
			
			Продолжить;
			
		Иначе // Будем считать, что началась пара ключ-значение
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			ТекЗначение = ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки);
			Результат.Вставить(СтрЗаменить(ТекСтрока, """", ""), ТекЗначение);

		КонецЕсли;
	
	КонецЦикла;
	
	НомерТекущейСтроки = НомерТекущейСтроки + 1;
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьНовыйМассив(МассивСтрок, НомерТекущейСтроки)
	
	Результат	 = Новый Массив;
	ВсегоСтрок	 = МассивСтрок.Количество();
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
		ТекСтрока = МассивСтрок[НомерТекущейСтроки];
		
		Если ТекСтрока = "]" Тогда
			// Массив кончился, выходим, оставаясь на текущей строке
			Возврат Результат;
			
		ИначеЕсли ТекСтрока = "," Тогда
			
			// Будет еще один элемент массива
			Продолжить;
			
		ИначеЕсли СокрЛП(ТекСтрока) = "" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Результат.Добавить(ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки));
		
	КонецЦикла;
	
	//можно добавить проверку, что именно кончилось: массив или файл
	НомерТекущейСтроки = НомерТекущейСтроки + 1;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстВМассивСтрок(Знач мТекст)
	
	мТекст = Символы.ПС + мТекст + Символы.ПС; // Чтобы точно было больше 1 строки
	
	мЧислоСтрок = СтрЧислоСтрок(мТекст);
	
	мТекст = СтрЗаменить(мТекст, """", """"""); // Одинарные кавычки на двойные
	мТекст = СтрЗаменить(мТекст, Символы.ПС, """}," + Символы.ПС + "{""S"","""); 
	
	мТекст = "{""#"",51e7a0d2-530b-11d4-b98a-008048da3034,
	|{" + Формат(мЧислоСтрок + 1, "ЧГ=0") + ",
	|" //+ 1 фиктивный элемент
	+ "{""S"",""" 
	
	+ мТекст
	
	+ """}" // Фиктивный элемент массива в конце, чтоб избежать проблем с запятой
	+ "
	|}
	|}";
	
	Возврат ЗначениеИзСтрокиВнутр(мТекст);
	
КонецФункции

//}		АЛЬТЕРНАТИВНОЕ ЧТЕНИЕ JSON


//**********************************************
//{		АЛЬТЕРНАТИВНАЯ ЗАПИСЬ JSON

Функция Парсер_ЗаписатьJSON(Значение)
	
	Разделитель = "";
	
	ТипЗн = ТипЗнч(Значение);

	Если ТипЗн = Тип("Строка") Тогда
		Стр = """" + ЭкранироватьЗаменитьНедопустимыеСимволы(Значение) + """";

	ИначеЕсли ТипЗн = Тип("Число") Или ТипЗнч(Значение) = Тип("Булево") Тогда
		Стр = XMLСтрока(Значение);

	ИначеЕсли ТипЗн = Тип("Дата") Тогда
		Стр = """" + ?(ЗначениеЗаполнено(Значение), XMLСтрока(Значение), "") + """";

	ИначеЕсли ТипЗн = Тип("Структура") 
		Или ТипЗн = Тип("Соответствие") 
		Или ТипЗн = Тип("ФиксированнаяСтруктура")
		Или ТипЗн = Тип("ФиксированноеСоответствие")
		Тогда
		Стр = "{";
		Для Каждого Параметр Из Значение Цикл
			Стр = Стр + Разделитель + Символы.ПС + """" + Параметр.Ключ + """:" + Парсер_ЗаписатьJSON(Параметр.Значение);
			Разделитель = ",";
		КонецЦикла;
		Стр = Стр + Символы.ПС + "}";

	ИначеЕсли ТипЗн = Тип("Массив")
		ИЛИ ТипЗн = Тип("ФиксированныйМассив") Тогда
		Стр = "[";
		Для Каждого Элемент Из Значение Цикл
			Стр = Стр + Разделитель + Символы.ПС + Парсер_ЗаписатьJSON(Элемент);
			Разделитель = ",";
		КонецЦикла;
		Стр = Стр + Символы.ПС + "]";

	ИначеЕсли ТипЗн = Тип("ТаблицаЗначений") Тогда
		Колонки = Значение.Колонки;
		Массив = Новый Массив;
		Для Каждого СтрокаТЗ Из Значение Цикл
			Структура = Новый Структура;
			Для Каждого Колонка Из Колонки Цикл
				Структура.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
			КонецЦикла;
			Массив.Добавить(Структура);
		КонецЦикла;
		Стр = Парсер_ЗаписатьJSON(Массив);

	ИначеЕсли Значение = Неопределено Тогда
		Стр = "null";

	Иначе
		Стр = """" + ЭкранироватьЗаменитьНедопустимыеСимволы(Значение) + """";
	КонецЕсли;

	Возврат Стр;
	
КонецФункции

Функция ЭкранироватьЗаменитьНедопустимыеСимволы(Стр)
	
	Результат = СтрЗаменить(Стр			, "\"	, "\\");
	Результат = СтрЗаменить(Результат	, """"	, "\""");
	Результат = СтрЗаменить(Результат	, "/"	, "\/");
	
	Результат = СтрЗаменить(Результат, Символ(8)	, "\b");
	Результат = СтрЗаменить(Результат, Символы.ПФ	, "\f");
	Результат = СтрЗаменить(Результат, Символы.ПС	, "\n");
	Результат = СтрЗаменить(Результат, Символы.ВК	, "\r");
	Результат = СтрЗаменить(Результат, Символы.ВТаб	, "\t");
	
	Возврат Результат;
	
КонецФункции

//}		АЛЬТЕРНАТИВНАЯ ЗАПИСЬ JSON
