#Область ОписаниеПеременных

// Интерфейсы
&НаКлиенте
Перем ЦП_Сервис	Экспорт;

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьЦентрПоддержки(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("param2", "pampam2");
	
	Файлы = Новый Массив;
	Файл1 = ЦП_Сервис.МодельФайла();
	Файл1.ИмяФайла = "22021614extern.txt";
	Файл1.Данные = Новый ДвоичныеДанные("C:\Users\platonov\Downloads\22021614extern.txt");	
	файлы.Добавить(Файл1);
	
	Файл1 = ЦП_Сервис.МодельФайла();
	Файл1.ИмяФайла = "test.txt";
	Файл1.Данные = Новый ДвоичныеДанные("C:\Users\platonov\Downloads\test.txt");
	файлы.Добавить(Файл1);
	
	ПараметрыСессии = ЦП_Сервис.МодельПараметрыСессии();
	ПараметрыСессии.ИНН = "6699000022";
	ПараметрыСессии.КПП = "123456789";
	ПараметрыСессии.Телефон = 89999999999;
	ПараметрыСессии.Организация = "ООО Рога и Копыта";
	ПараметрыСессии.ДополнительныеПараметры.Вставить("param", "пампам");
	ПараметрыСессии.ДополнительныеПараметры.Вставить("ТекущаяДата", ТекущаяДата());
	ПараметрыСессии.Файлы = Файлы;
	
	ЦП_Сервис.ОткрытьЦентрПоддержки(ПараметрыСессии, "Чат");	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояние(Команда)
	
	ЦП_Сервис.УстановитьСостояние();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнитЦп("ВнешняяОбработка");
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаКлиенте
Процедура ИнитЦп(ТипМетаданных) Экспорт
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЦП_Сервис = ПолучитьФорму("ЦП_Сервис_ОФ");
	#Иначе
		ЦП_Сервис = ПолучитьФорму(ТипМетаданных + ".SupportCenter.Форма.ЦП_Сервис");	
	#КонецЕсли
	
	ЦП_Сервис.Инит("ke-1c",,, Истина);
	
КонецПроцедуры

#КонецОбласти