// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_ТиповойМодуль;
Перем НеИспользуется_РежимУправляемыхФорм;

Перем Ядро;
Перем ОсновнойМодуль;
Перем ГенерацияXML;
Перем ПечатныеФормы;
Перем РаботаСМаркировкой;

// Структура - содержит поля:
//   * Идентификатор - Строка - идентификатор категории пакета
//   * Представление - Строка - пользовательское представление категории пакета
Перем _ТекущаяКатегорияПакетов;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормы = Модуль_ПечатныеФормы;
	РаботаСМаркировкой = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормы = Неопределено;
	РаботаСМаркировкой = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html
    
	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		Возврат ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);
		
		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
	
		
		///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
		
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "УстановитьУсловноеОформление" Тогда
		
		Возврат УстановитьУсловноеОформление(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd970");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd970",	Неопределено,	"ID_СчетФактура");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd970",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd970",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd970",	"ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd970",	"СЧФДОП",		"ID_УПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"СЧФ",			"ID_УПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"ДОП",			"ID_УПД_ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)", 		"ProformaInvoice", 						"");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверкиФормализованный", "Акт сверки (формализованный)",	"ReconciliationAct",					"reconciliationact405");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ВНУТР", "УПД (перемещение)", "UniversalTransferDocumentInternal", "utd970", "ДОП");
	
	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	
	КатегорииПакетов = КатегорииПакетов();

	НужнаВТДокументыБезНДС = Ложь;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ВидПакетаID		= ОписаниеВидаПакета.ID;
		КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
		
		Если 		ВидПакетаID = "ID_ОсновнойПакет" 
				ИЛИ ВидПакетаID = "ID_УПД"
				ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Продажа", Ложь);
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета);
			
		ИначеЕсли 	ВидПакетаID = "ID_УКД" 
				ИЛИ ВидПакетаID = "ID_УКД_раздельно"
				ИЛИ ВидПакетаID = "ID_КСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировка", Ложь);
			
		ИначеЕсли	ВидПакетаID = "ID_УПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Аванс", Ложь);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД" 
				ИЛИ ВидПакетаID = "ID_ИУПД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Продажа", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУКД" 
				ИЛИ ВидПакетаID = "ID_ИУКД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИКСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировка", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_ИСФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Аванс", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" 
				ИЛИ ВидПакетаID = "ID_УПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_ИУПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_УКД_БезНДС" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
			
			НужнаВТДокументыБезНДС = Истина;
			
		ИначеЕсли	ВидПакетаID = "ID_Счет" 
				ИЛИ ВидПакетаID = "ID_СчетФормализованный" Тогда
			
			ИспользуютсяТолькоОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
			
			Если ИспользуютсяТолькоОснованияПоУмолчанию Тогда
				
				Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
				
			Иначе
				
				ТипОснования_СчетНаОплату 		= ТипОснованияСчетаНаОплату_СчетНаОплату();
				ТипОснования_ЗаказПокупателя	= ТипОснованияСчетаНаОплату_ЗаказПокупателя();
				ТипОснования_ДокументПродажи	= ТипОснованияСчетаНаОплату_ДокументПродажи();
				
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "СчетНаОплату", ТипОснования_СчетНаОплату);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ЗаказПокупателя", ТипОснования_ЗаказПокупателя);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "АктВыполненныхРабот", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ОтчетКомитенту", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ОтчетОПереработке", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "РасходнаяНакладная", ТипОснования_ДокументПродажи);
				
			КонецЕсли;
			
		ИначеЕсли ВидПакетаID = "ID_АктСверки"
			ИЛИ ВидПакетаID = "ID_АктСверкиФормализованный" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		Если НужнаВТДокументыБезНДС Тогда
			ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы);
		КонецЕсли;
		
		ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса_ВременныеТаблицы);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию()
	
	Результат = Ядро.Настройки_ОснованияВидовДокументов_ИспользуютсяНастройкиПоУмолчанию();
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;
	
	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_ДИС");
		
	// Исправления первичных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_ИУПД_ДОП");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Корректировочные документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_КСЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_УКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_КСФ");
		
	// Исправления корректировочных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД_КСЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_ИУКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИКСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИКСФ");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
	// Исправления СФ на аванс
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Прочие документы
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверкиФормализованный" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверкиФормализованный");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_ВНУТР" Тогда
		
		Пакет.Направление = "Внутреннее";
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ВНУТР");
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html

	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника		= Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый)
		Или ОсновнойМодуль.ТипСоответствуетКонтентуУКД(ВидДокументаРазвернутый) Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		ДополнительныеПараметры = Новый Структура;
		
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
		
		ДополнительныеПараметры.Вставить("ПараметрыСогласования", Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"		, ДанныеСотрудника); // Графа 10 (РабОргПрод)
		
		ДополнительныеПараметры.Вставить("ФИОПодписанта", " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД"	, ФункцияУПД);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверкиФормализованный" Тогда
		
		ДополнительныеПараметры = Неопределено;
		
		Content = Ядро.ТиповойМодуль_ПолучитьКонтент(
			Документ1С,
			ТипКонтента_XDTO,
			ДополнительныеПараметры
		);
		
		Ядро.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" ИЛИ ID = "ID_Счет" Тогда
		
		Если ID = "ID_АктСверки" Тогда
			ИмяПечатнойФормы = "АктСверки";
		Иначе 
			ИмяПечатнойФормы = "СчетНаОплату";
		КонецЕсли;
		
		ДополнительныеПараметры = Неопределено;
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ИмяПечатнойФормы, ДополнительныеПараметры);
		
		Результат.Метаданные.DocumentNumber = СокрЛП(ДанныеПечатнойФормы.Номер);
		Результат.Метаданные.DocumentDate = ДанныеПечатнойФормы.Дата;
		Результат.Метаданные.FileName = ДанныеПечатнойФормы.ИмяФайла;
		
		Если TypeNamedId = "ProformaInvoice" Тогда
			Результат.Метаданные.TotalSum = ДанныеПечатнойФормы.Сумма;
			Результат.Метаданные.TotalVat = ДанныеПечатнойФормы.СуммаНДС;
			Результат.Метаданные.CurrencyCode = ДанныеПечатнойФормы.КодВалюты;
		КонецЕсли;
		
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры)
	
	ЗаполнитьРеквизитыДокумента(Параметры);
	
	Документ				= Параметры.Документ;
	РеквизитыДокумента		= Документ.Реквизиты;
	ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
	ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
	
	ДанныеПечатнойФормы = СформироватьВнешнююПечатнуюФорму(Документ.ДокументУчета, ВнешняяПечатнаяФорма, ИдентификаторКоманды);
	
	Документ.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	Документ.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
	Документ.Метаданные.DocumentDate	= РеквизитыДокумента.Дата;
	Документ.Метаданные.DocumentNumber	= РеквизитыДокумента.Номер;
	
	Если Документ.Метаданные.Свойство("TotalSum") Тогда
		Документ.Метаданные.TotalSum = РеквизитыДокумента.Сумма;
	КонецЕсли;
	
	Если Документ.Метаданные.Свойство("TotalVat") Тогда
		Документ.Метаданные.TotalVat = РеквизитыДокумента.СуммаНДС;
	КонецЕсли;
	
	ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
	ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
	ХранилищеКонтента.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	СлужебнаяИнформация = Документ.СлужебнаяИнформация;
	СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
	
	УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html

	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	ИменаРеквизитов = "Номер, Дата";
	
	РеквизитыДокумента = ДокументУчета.Метаданные().Реквизиты;
	
	ЕстьСуммаДокумента = РеквизитыДокумента.Найти("СуммаДокумента") <> Неопределено;
	
	Если ЕстьСуммаДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаДокумента";
	КонецЕсли;
	
	ЕстьСуммаНДСДокумента = РеквизитыДокумента.Найти("СуммаНДСДокумента") <> Неопределено;
	
	Если ЕстьСуммаНДСДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаНДСДокумента";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОсновнойМодуль.Общее_ЗначенияРеквизитовОбъекта(ДокументУчета, ИменаРеквизитов);
	
	Реквизиты.Номер	= СокрЛП(ЗначенияРеквизитов.Номер);
	Реквизиты.Дата = ЗначенияРеквизитов.Дата;
	
	Если ЕстьСуммаДокумента Тогда
		
		Реквизиты.Сумма	= ЗначенияРеквизитов.СуммаДокумента;
		
		Если ЕстьСуммаНДСДокумента Тогда
			Реквизиты.Сумма = Реквизиты.Сумма + ЗначенияРеквизитов.СуммаНДСДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html
	
	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента = Документ.Тип;
	ФункцияДокумента = Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация"		, Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент"		, Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента"	, Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента"	, Документ.Реквизиты.Номер);
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоАктОРасхождениях(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "АктОРасхожденияхПолученный");
		
	ИначеЕсли ЭтоФормализованныйАктСверки405(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		НачалоПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.BeginDate);
		ОкончаниеПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.EndDate);
		
		Результат = НайтиАктыСверкиВзаиморасчетов(
			Организация,
			Контрагент,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктСверки405(ТипЭД)
	
	Результат = НРег(ТипЭД.ТипДокумента) = НРег("ReconciliationAct")
				И НРег(ТипЭД.ТипКонтента) = НРег("reconciliationact405");
	
	Возврат Результат;
	
КонецФункции

Функция НайтиАктыСверкиВзаиморасчетов(Организация, Контрагент, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериодаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументАктСверки.Ссылка
	|ИЗ
	|	Документ.СверкаВзаиморасчетов КАК ДокументАктСверки
	|ГДЕ
	|	НЕ ДокументАктСверки.ПометкаУдаления
	|	И ДокументАктСверки.Организация = &Организация
	|	И ДокументАктСверки.Контрагент = &Контрагент
	|	И ДокументАктСверки.НачалоПериода = &ДатаНачала
	|	И ДокументАктСверки.КонецПериода = &ДатаОкончания";
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	ПроверитьЗаполнитьИдентификаторОперации(Параметры);
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Документ = Параметры.Документ;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Документ.Тип.ФункцияДокумента) Тогда
		Результат.ОписаниеОшибки = "Не задана операция для создания учетного документа!";
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторОперации = Параметры.ИдентификаторОперации;
	
	РезультатПроверки = ПроверкаДокументаОснования(Документ, ИдентификаторОперации);
	
	Если ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки) Тогда
		
		Результат.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	Параметры.ДополнительныеПараметры.Вставить("ДокументОснование", РезультатПроверки.ОсновнойОбъект);
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Если ИспользоватьДатуЭД
		И НЕ ЭтоФормализованныйАктСверки405(Документ.Тип) Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаСопоставленияНоменклатуры = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаСопоставленияНоменклатуры, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html

	Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	
	ДокументДД	= Параметры.ДокументДД;
	ПакетДД		= Параметры.ПакетДД;
	
	Ошибки		= Новый Массив;
	Документ1С	= Неопределено;
	
	СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	
	ТипДокумента 	= НРег(СтруктураДанных.ТипДокумента);
	ТипКонтента 	= НРег(СтруктураДанных.ТипКонтента);
	ФункцияДокумента = НРег(СтруктураДанных.ФункцияДокумента);
	
	Контрагент	= СтруктураДанных.Контрагент;
	Организация	= СтруктураДанных.Организация;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда			
		Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
		Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	КонецЕсли;	
	
	// Выполним сопоставление документа
	МассивДокументов1С = ОсновнойМодуль.НайтиСопоставлениеДокумента(Параметры.Документ);
	
	Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
		Документ1С = МассивДокументов1С[0];
	КонецЕсли;
	
    // НАКЛАДНЫЕ
	Если ТипДокумента = "xmltorg12" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда		
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
		Иначе			
			ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
		КонецЕсли;		
		
	// СЧЕТА-ФАКТУРЫ
	ИначеЕсли ТипДокумента = "invoice" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда		
						
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
		КонецЕсли;
		
		ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820" ИЛИ ТипКонтента = ТипКонтентаUtd970());
		
		Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
			Ошибки.Добавить("Счет-фактура в старом формате.");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("ДокументДляСопоставления", Документ1С);
	Результат.Вставить("Ошибки", Ошибки);	
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html

	Пакет			= Параметры.Пакет;	
	ДокументыПакета	= Параметры.ДокументыПакета;
	
	ДокументыПакета.Колонки.Добавить("ДанныеДокумента");
	
	СуммаНакладной 					= Неопределено;
	СуммаСчетаФактуры 				= Неопределено;
	ЕстьНесопоставленныеДокументы 	= Ложь;	
	ЕстьКритичнаяОшибкаПакета 		= Ложь;
	
	Ошибки = Новый Массив;
	
	// 1. Анализ всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ТекДокумент.Ссылка, Пакет);
		ТекДокумент.ДанныеДокумента = ДанныеДокумента;
		
		ДокументДД 		= ТекДокумент.Ссылка;		
		ТипДокумента 	= НРег(ДанныеДокумента.ТипДокумента);
		ФункцияДокумента = НРег(ДанныеДокумента.ФункцияДокумента);
		
		//ошибки, выявленные при выполнении события ПровестиАнализДокумента, распространяем на весь пакет
		Если ЗначениеЗаполнено(ДанныеДокумента.ТекстОшибки) Тогда
			Ошибки.Добавить(ДанныеДокумента.ТекстОшибки);
		КонецЕсли;
		
		Если ТипДокумента = "xmltorg12" 
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
		    СуммаНакладной = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если ТипДокумента = "invoice"
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
			СуммаСчетаФактуры = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
						
		Если (ТипДокумента = "xmltorg12" ИЛИ ТипДокумента = "invoice" ИЛИ ТипДокумента = "universaltransferdocument")
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
			ЕстьНесопоставленныеДокументы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// 2. Интерпретация ошибок
	
	Если СуммаНакладной = Неопределено Тогда
		Ошибки.Добавить("Нет накладной.");
	КонецЕсли;
	
	Если СуммаСчетаФактуры = Неопределено Тогда
		Ошибки.Добавить("Нет счета-фактуры.");
	КонецЕсли;
	
	Если СуммаНакладной <> Неопределено И СуммаСчетаФактуры <> Неопределено И СуммаНакладной <> СуммаСчетаФактуры Тогда
		Ошибки.Добавить("Не совпадают суммы счета-фактуры и первичного документа.");
		//ЕстьКритичнаяОшибкаПакета = Истина; //иногда в СФ могут не включать позиции без НДС, Тогда несовпадение сумм приемлемо
	КонецЕсли;
		
	ТекстВсехОшибокПакета = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
	
	ЕстьКритичнаяОшибкаПакета = (ЕстьКритичнаяОшибкаПакета 
								ИЛИ Найти(ТекстВсехОшибокПакета, "ДУБЛИКАТ") <> 0
								ИЛИ Найти(ТекстВсехОшибокПакета, "Счет-фактура в старом формате") <> 0);
	
	//ОшибокНет = (СокрЛП(ТекстВсехОшибокПакета) = ""); //самый жесткий вариант выполнения анализа пакета
	ОшибокНет = НЕ ЕстьКритичнаяОшибкаПакета;           //менее жесткий вариант выполнения анализа пакета
	
	
	// 3. Формирование контента ответа всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ТекДокумент.ДанныеДокумента;
		
		ДокументДД	= ТекДокумент.Ссылка;		
		Документ1С	= ДанныеДокумента.ДокументВ1С;
		ТекстОшибки	= ДанныеДокумента.ТекстОшибки;
		
		НеИзменятьДействиеВДД = ЗначениеЗаполнено(ДанныеДокумента.ТребуемоеДействиеВДД)
								И ДанныеДокумента.ТребуемоеДействиеВДД <> "Подписать";
		
		Если НеИзменятьДействиеВДД ИЛИ Не ЗначениеЗаполнено(Документ1С) Тогда
			Продолжить;
		КонецЕсли;
						
		РезультатАнализа = ОсновнойМодуль.ЭДО_НовыйРезультатАнализаВходящегоДокумента();
		
		РезультатАнализа.Ошибки = ТекстОшибки; // сохраняем ошибки, относящиеся только к текущему документу
		//РезультатАнализа.Ошибки = ТекстВсехОшибокПакета; // сохраняем ошибки всего пакета для каждого документа из пакета
		
		СписокДействийТекДокумента = ОсновнойМодуль.ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументДД, ОшибокНет);		
		РезультатАнализа.ДействиеВДД = ?(СписокДействийТекДокумента.Количество() = 0, "", СписокДействийТекДокумента[0].Значение);
				
		Если ЗначениеЗаполнено(РезультатАнализа.ДействиеВДД) Тогда						
			РезультатАнализа.Вставить("КонтентОтвета", ПолучитьКонтентОтвета(ДокументДД, Документ1С, РезультатАнализа.ДействиеВДД, ТекстВсехОшибокПакета));			
		КонецЕсли;
		
		РезультатАнализа.Вставить("ДокументДляСопоставления", Документ1С);
		ОсновнойМодуль.СохранитьРезультатАнализа(ДокументДД, РезультатАнализа);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html

	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
		ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
		ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
	
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
	
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПриобретениеТоваровУслуг",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратТоваровОтКлиента",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеОтПереработчика",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеПредметовЛизинга",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеАрендованныхОС",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеСырьяОтДавальца",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",			Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПриобретениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПриобретениеУслугПрочихАктивов",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПриобретениеУслугПоЛизингу",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионера",				Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетПереработчика",				Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			ОтборСФ.Вставить("Корректировочный", Ложь); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный",				ОтборСФ);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученныйАванс",			ОтборСФ);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученныйНалоговыйАгент", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			ОтборКоррСФ.Вставить("Корректировочный", Истина);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПриобретения",	Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СверкаВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ЗаказПоставщику",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ЗаказПереработчику",	Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			Элемент
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции


///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html
	
	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И РеализацияТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслуг.Ссылка)
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНачала
	|	И ПоступлениеТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьУсловноеОформление(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Ustanovit%27_Uslovnoye_Oformleniye.html
	
	Форма = Параметры.Форма;
	
	//входящие документ на подпись
	//ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Направление");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение 	= "Входящее";
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Статус");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Содержит;
	//ОтборЭлемента.ПравоеЗначение 	= "Требуется подпись";
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	Возврат Истина;

КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_Основная(), "Первичные документы");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД", "УПД", "ID_УПД, ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ОсновнойПакет", "СФ + ТОРГ12/Акт", "ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_раздельно", "УПД СЧФ + УПД ДОП", "ID_УПД_СЧФ, ID_УПД_ДОП");
	
	Пакеты_НачатьКатегорию("КорректировочныйПакет", "Корректировочные документы");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД", "УКД", "ID_УКД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД_раздельно", "УКД КСЧФ + УКД ДИС", "ID_УКД_КСЧФ, ID_УКД_ДИС");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_КСФ", "КСФ", "ID_КСФ");
	
	Пакеты_НачатьКатегорию("СчетФактураНаАванс", "Счет-фактура на аванс");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_СФ_НаАванс", "СФ (на аванс)", "ID_СчетФактура");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_НаАванс", "УПД СЧФ (на аванс)", "ID_УПД_СЧФ");
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_СчетаНаОплату(), "Счет на оплату");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_Счет", "Счет (неформализованный)", "ID_Счет");
	
	Пакеты_НачатьКатегорию("АктCверки", "Акт сверки");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_АктСверки", "Акт сверки", "ID_АктСверки");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_АктСверкиФормализованный", "Акт сверки (формализованный)", "ID_АктСверкиФормализованный");
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_БезКатегории(), "");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД", "УПД (исправление)", "ID_ИУПД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_раздельно", "УПД СЧФ + УПД ДОП (исправление)", "ID_ИУПД_СЧФ, ID_ИУПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИСФ", "СФ (исправление)", "ID_ИСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУКД", "УКД (исправление)", "ID_ИУКД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУКД_раздельно", "УКД КСЧФ + УКД ДИС (исправление)", "ID_ИУКД_КСЧФ, ID_ИУКД_ДИС");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИКСФ", "КСФ (исправление)", "ID_ИКСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_НаАванс", "УПД (исправление на аванс)", "ID_ИУПД_СЧФ");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИСФ_НаАванс", "СФ (исправление на аванс)", "ID_ИСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ТОРГ12_Акт_БезНДС", "ТОРГ12/Акт (без СФ)", "ID_АктФормализованный, ID_ТОРГ12");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_БезНДС", "УПД ДОП (без СФ)", "ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_БезНДС", "УПД ДОП (исправление без СФ)", "ID_ИУПД_ДОП");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД_БезНДС", "УКД ДИС (без СФ)", "ID_УКД_ДИС");
	
	Пакеты_НачатьКатегорию("ВнутренниеПеремещения", "Внутренние перемещения");
	Пакет = Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_ВНУТР", "УПД (перемещение)", "ID_УПД_ВНУТР");
	Пакет.ВнутреннийДО = Истина;
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Если ВидПакетаID <> "ID_УПД_ВНУТР" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ПеремещениеЗапасов) Тогда
		ИмяВТ = ДобавитьТаблицу_ПеремещениеТоваров(Запрос);
		Результат.Добавить(ИмяВТ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей  
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	ЭтоСчетФактура = (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетФактура")); 
		
	Если ЭтоСчетФактура Тогда
		
		ОснованияСФ = ДокументыОснованияСчетаФактуры(Документ1С);
		Если ОснованияСФ.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ИсточникДанных = ОснованияСФ[0];
		
	Иначе
		
		ИсточникДанных = Документ1С;
		
	КонецЕсли;
	
	МетаданныеИсточникаДанных = ИсточникДанных.Метаданные();
	
	ЕстьРеквизитПодразделение	= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Подразделение");
	ЕстьРеквизитОрганизация		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Организация");
	ЕстьРеквизитКонтрагент		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Контрагент");
	
	ИменаРеквизитов = Новый Массив;
		
	Если ЕстьРеквизитПодразделение Тогда
		ИменаРеквизитов.Добавить("Подразделение");
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
		
	Разделитель 		= ",";
	ТребуемыеРеквизиты 	= Ядро.СоединитьСтроку(ИменаРеквизитов, Разделитель);
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		Реквизиты = Ядро.Общее_ЗначенияРеквизитовОбъекта(ИсточникДанных, ТребуемыеРеквизиты);
	КонецЕсли;
	
	// В коллекции ПоляОтправителя и ПоляПолучателя индекс элементов соответствует приоритету этих элементов.
	// Чем меньше индекс, тем выше приоритет.
	
	Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(Реквизиты.Подразделение) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Подразделение);
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Организация);
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ПоляПолучателя.Добавить(Реквизиты.Контрагент);
	КонецЕсли;
		
КонецПроцедуры

// Получает по счету-фактуре список документов-оснований.
//
// Параметры:
//  СФ - ДокументСсылка.СчетФактура - счет-фактура, основания которого требуется получить.
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на документы-основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Ядро.Общее_ВыборкаДанныхОбъекта(СчетФактура, "ДокументыОснования", "ДокументОснование");
			
	Пока Выборка.Следующий() Цикл 
		
		ДокументОснование = Выборка.ДокументОснование;
		
		Если Результат.Найти(ДокументОснование) = Неопределено Тогда
			Результат.Добавить(ДокументОснование);
		КонецЕсли;
		
	КонецЦикла;
				
	Возврат Результат;
	
КонецФункции

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	ОснованиеСчетаНаОплату = ПараметрыМетодаПечати.МассивОбъектов[0];
	МетаданныеОснованияСчета = ОснованиеСчетаНаОплату.Метаданные();
	ИмяДокументаОснованияСчета = МетаданныеОснованияСчета.ПолноеИмя();
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяДокументаОснованияСчета);
	
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета = "СчетНаОплату";
	НовыйЭлементТаблицы.ИмяВРЕГ = ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Результат = ПредставлениеНомера(Документ.Номер);
	
	Возврат Результат;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
	
	СписокОснований.Добавить("СчетНаОплату", "Счет на оплату");
	СписокОснований.Добавить("ЗаказПокупателя", "Заказ покупателя");
	СписокОснований.Добавить("ДокументПродажи", "Документ продажи");
	
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетНаОплату"));
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  ДокументыПоТипам - Соответствие - Соотвествие типов документов где ключ это Тип документа а значение это массив документов
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Организация");	
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Контрагент");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(КоллекцияДокументов, Реквизиты, Истина);
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив ссылок на связанные документы учета 1С.
// Для получения подчиненных документов используется критерии отбора СвязанныеДокументы.
//
// Параметры:
//  ДокументУчета	 - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(Документ) Экспорт
	
	Результат = Новый Массив;
		
	СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, Документ);
	
	Если ЭтоСчетНаОплату(Документ) Тогда
		
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДокументОснование");
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Результат.Добавить(ДокументОснование);
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, ДокументОснование);			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Добавить(Документ);
		
	Возврат Результат;	
	
КонецФункции

// Находит связи с учетным документом, на основании которого формируется электронный счет на оплату.
// Если в аргументе передается счет на оплату, то в результат функции добавляются связи
// второго порядка. Например, документ реализации - это связь первого порядка.
// А счет-фактура на реализацию - это связь второго порядка.
//
// Параметры:
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - учетный документ (счет, заказ, документ продажи),
//                               на основании которого формируется электронный счет на оплату.
// 
// Возвращаемое значение:
//  Массив из ЛюбаяСсылка.
//
Функция СчетаНаОплату_СвязанныеДокументы(ОснованиеЭлектронногоСчета) Экспорт
	
	Если ЭтоСчетНаОплату(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоСчетуНаОплату(ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоЗаказПокупателя(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоЗаказуКлиента(ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоДокументПродажи(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоДокументуПродажи(ОснованиеЭлектронногоСчета);
		
	Иначе
		
		Результат = Новый Массив;
		
	КонецЕсли;
	
	Результат.Добавить(ОснованиеЭлектронногоСчета);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоСчетуНаОплату(СчетНаОплату)
		
	Результат = Новый Массив;
	
	ОснованиеСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетНаОплату, "ДокументОснование");
	
	Если ЗначениеЗаполнено(ОснованиеСчета) Тогда
		
		Если ЭтоЗаказПокупателя(ОснованиеСчета) Тогда
			
			Результат = СчетаНаОплату_СвязиПоЗаказуКлиента(ОснованиеСчета);
			
		ИначеЕсли ЭтоДокументПродажи(ОснованиеСчета) Тогда
			
			Результат = СчетаНаОплату_СвязиПоДокументуПродажи(ОснованиеСчета);
			
		Иначе
			
			Результат = Новый Массив;
			
		КонецЕсли;
		
	Иначе	
		
		Результат = СчетаНаОплату_СвязиПоСчетуНаОплатуБезОснования(СчетНаОплату);
		
	КонецЕсли;
	
	Результат.Добавить(СчетНаОплату);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоСчетуНаОплатуБезОснования(СчетНаОплату)
	
	Результат = Новый Массив;
	
	ТекстЗапроса =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_СвязанныеПервичныеДокументы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	НЕ ЗаказПокупателя.ПометкаУдаления
	|	И ЗаказПокупателя.ДокументОснование = &СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_СвязанныеВторичныеДокументы
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = РасходнаяНакладнаяЗапасы.ЗаказПокупателя
	|ГДЕ
	|	НЕ РасходнаяНакладнаяЗапасы.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = РасходнаяНакладнаяЗапасы.Заказ
	|ГДЕ
	|	НЕ РасходнаяНакладнаяЗапасы.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	НЕ РасходнаяНакладная.ПометкаУдаления
	|	И РасходнаяНакладная.ДокументОснование = &СчетНаОплату
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АктВыполненныхРабот.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = АктВыполненныхРабот.ЗаказПокупателя
	|ГДЕ
	|	НЕ АктВыполненныхРабот.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АктВыполненныхРабот.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = АктВыполненныхРабот.ДокументОснование
	|ГДЕ
	|	НЕ АктВыполненныхРабот.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.РаботыИУслуги КАК АктВыполненныхРаботРаботыИУслуги
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = АктВыполненныхРаботРаботыИУслуги.ЗаказПокупателя
	|ГДЕ
	|	НЕ АктВыполненныхРаботРаботыИУслуги.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АктВыполненныхРабот.Ссылка
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|ГДЕ
	|	НЕ АктВыполненныхРабот.ПометкаУдаления
	|	И АктВыполненныхРабот.ДокументОснование = &СчетНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураДокументыОснования.Ссылка КАК Документ
	|ИЗ
	|	ВТ_СвязанныеВторичныеДокументы КАК ВТ_СвязанныеВторичныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ПО ВТ_СвязанныеВторичныеДокументы.Документ = СчетФактураДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураДокументыОснования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязанныеПервичныеДокументы.Документ
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязанныеВторичныеДокументы.Документ
	|ИЗ
	|	ВТ_СвязанныеВторичныеДокументы КАК ВТ_СвязанныеВторичныеДокументы";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СчетНаОплату", СчетНаОплату);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
		
КонецФункции

Функция СчетаНаОплату_СвязиПоЗаказуКлиента(ЗаказПокупателя)
	
	Результат = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктВыполненныхРабот.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_СвязанныеПервичныеДокументы
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|ГДЕ
	|	НЕ АктВыполненныхРабот.ПометкаУдаления
	|	И АктВыполненныхРабот.ЗаказПокупателя = &ЗаказПокупателя
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка
	|ИЗ
	|	Документ.АктВыполненныхРабот.РаботыИУслуги КАК АктВыполненныхРаботРаботыИУслуги
	|ГДЕ
	|	АктВыполненныхРаботРаботыИУслуги.ЗаказПокупателя = &ЗаказПокупателя
	|	И НЕ АктВыполненныхРаботРаботыИУслуги.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОтчетОПереработке.Ссылка
	|ИЗ
	|	Документ.ОтчетОПереработке КАК ОтчетОПереработке
	|ГДЕ
	|	НЕ ОтчетОПереработке.ПометкаУдаления
	|	И ОтчетОПереработке.ЗаказПокупателя = &ЗаказПокупателя
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	НЕ РасходнаяНакладнаяЗапасы.Ссылка.ПометкаУдаления
	|	И РасходнаяНакладнаяЗапасы.ЗаказПокупателя = &ЗаказПокупателя
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Заказ = &ЗаказПокупателя
	|	И НЕ РасходнаяНакладная.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Заказ = &ЗаказПокупателя
	|	И НЕ РасходнаяНакладнаяЗапасы.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплату.Ссылка
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.ДокументОснование = &ЗаказПокупателя
	|	И НЕ СчетНаОплату.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ЗаказПокупателя
	|	И НЕ ЗаказПокупателя.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктВыполненныхРабот.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_СвязанныеВторичныеДокументы
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = АктВыполненныхРабот.ДокументОснование
	|ГДЕ
	|	НЕ АктВыполненныхРабот.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = РасходнаяНакладная.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураДокументыОснования.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ПО ВТ_СвязанныеПервичныеДокументы.Документ = СчетФактураДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураДокументыОснования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязанныеПервичныеДокументы.Документ
	|ИЗ
	|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_СвязанныеПервичныеДокументы
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СчетФактураДокументыОснования.Ссылка
	|ИЗ
	|	ВТ_СвязанныеВторичныеДокументы КАК ВТ_СвязанныеВторичныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ПО ВТ_СвязанныеВторичныеДокументы.Документ = СчетФактураДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураДокументыОснования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязанныеВторичныеДокументы.Документ
	|ИЗ
	|	ВТ_СвязанныеВторичныеДокументы КАК ВТ_СвязанныеВторичныеДокументы";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоДокументуПродажи(ДокументПродажи)
	
	Результат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СФДокументыОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК СФДокументыОснования
	|ГДЕ
	|	СФДокументыОснования.ДокументОснование = &ДокументПродажи
	|	И НЕ СФДокументыОснования.Ссылка.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции


Процедура СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, Документ)
	
	СвязанныеДокументы = СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ);
	
	Для Каждого СсылкаНаОбъект Из СвязанныеДокументы Цикл
		Если КоллекцияПриемник.Найти(СсылкаНаОбъект) = Неопределено Тогда
			КоллекцияПриемник.Добавить(СсылкаНаОбъект); 
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, СсылкаНаОбъект)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  Документ - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
//
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ)
	
	Результат = КритерииОтбора.СтруктураПодчиненности.Найти(Документ);
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетНаОплату(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетНаОплату"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗаказПокупателя(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоДокументПродажи(Документ)
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
	Результат = МассивТипов.Найти(ТипЗнч(Документ)) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции


// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
	
	Если НЕ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактура") Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияОснований = ДокументыОснованияСчетаФактуры(ДокументУчета);
	
КонецПроцедуры

Функция АктСверки405_ИнформацияОтправителя(ДокСсылка) Экспорт
	
	Если НЕ ИспользуетсяСверкаВзаиморасчетов3_0_2() Тогда
		
		ТекстОшибки = НСтр("ru='Текущая версия конфигурации не поддерживает работу с актом сверки в формате 405@'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	РеквизитыДокумента = АктСверки405_ШапкаИнформацииОтправителя(ДокСсылка);
	
	Результат = Новый_ReconciliationActSenderTitle();
	
	АктСверки405_ЗаполнитьШапкуТитулаОтправителя(
		Результат,
		РеквизитыДокумента
	);
	
	АктСверки405_ПроверитьВозможностьОтправки(Результат, ДокСсылка);
	
	АктСверки405_ЗаполнитьРеквизитыОтправителя(
		Результат,
		РеквизитыДокумента.Организация,
		РеквизитыДокумента.Дата
	);
	
	АктСверки405_ЗаполнитьРеквизитыПолучателя(
		Результат,
		РеквизитыДокумента.Контрагент,
		РеквизитыДокумента.Дата
	);
	
	ВыборкаПоДоговорам = АктСверки405_ТабличнаяЧастьИнформацииОтправителя(ДокСсылка);
	
	АктСверки405_ЗаполнитьТабличнуюЧастьТитулаОтправителя(
		Результат,
		ВыборкаПоДоговорам,
		ДокСсылка
	);
	
	ТаблицаИтоги = АктСверки405_ИтогиИнформацииОтправителя(ДокСсылка);
	
	ОборотПоДебету = ТаблицаИтоги.Итог("Дебет");
	ОборотПоКредиту = ТаблицаИтоги.Итог("Кредит");
	
	ОстатокНаНачало = РеквизитыДокумента.ОстатокНаНачало;
	
	АктСверки405_ЗаполнитьИтогиПоТабличнойЧастиТитулаОтправителя(
		Результат,
		ОстатокНаНачало,
		ОборотПоДебету,
		ОборотПоКредиту
	);
	
	АктСверки405_ЗаполнитьПодписанта(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  СправочникСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = "без НДС";
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("5/105", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5/105";
		ИначеЕсли СтрНайти("7/107", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7/107";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - СправочникСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			
			// Представление ставки НДС получить не удалось,
			// поэтому возвращаем признак ошибки через зарезервированную строку "##".
			// Такую строку умеет обрабатывать валидация контента.
			Результат = "##";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	Результат.Вставить("0", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("10", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("18", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("20", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("10/110", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("18/118", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("20/120", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("5", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("7", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("22", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("5/105", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("7/107", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("22/122", Справочники.СтавкиНДС.ПустаяСсылка());
	Результат.Вставить("без НДС", Справочники.СтавкиНДС.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	""0"" КАК Ставка,
	|	СтавкиНДС.Ссылка КАК Значение
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 0
	|	И НЕ СтавкиНДС.НеОблагается
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""10"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 10
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""18"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 18
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""20"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 20
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""10/110"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 10
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""18/118"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 18
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""20/120"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 20
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""5"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 5
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""7"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 7
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""22"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 22
	|	И НЕ СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""5/105"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 5
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""7/107"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 7
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""22/122"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 22
	|	И СтавкиНДС.Расчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""без НДС"",
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = 0
	|	И СтавкиНДС.НеОблагается";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ставка, Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	ДокументыКонфигурации = Метаданные.Документы;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументыКонфигурации.ЗаказПокупателя);
	Результат.Добавить(ДокументыКонфигурации.РасходнаяНакладная);
	Результат.Добавить(ДокументыКонфигурации.КорректировкаРеализации);
	Результат.Добавить(ДокументыКонфигурации.АктВыполненныхРабот);
	Результат.Добавить(ДокументыКонфигурации.ПриходнаяНакладная);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомиссионера);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомитенту);
	Результат.Добавить(ДокументыКонфигурации.СчетНаОплату);	
	Результат.Добавить(ДокументыКонфигурации.СчетФактура);
	
	Возврат Результат;                                               	
	
КонецФункции

Функция ЭтоПеремещениеЗапасов(ДокументСсылка)
	
	ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВидОперации");
	
	Результат = (ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	
	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ

//*****************************************************************************
//{ СБОР КОНТЕНТА УПД970

//{ УПД970. Программный интерфейс

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка - ДокументСсылка - ссылка на учетный документ 1С,
//                               по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаПродавца(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры) Экспорт
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактура") Тогда
		
		Если ЭтоСчетФактураНаАванс(ДокСсылка) Тогда
			
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураНаАванс(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
				
		Иначе
			
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактура(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
				
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуРасходнаяНакладная(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализации(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуАктВыполненныхРабот(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуЗаказПокупателя(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомитенту(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомиссионера(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуПеремещениеЗапасов(
			ДокСсылка,
			ДополнительныеПараметры);
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетОПереработке") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуОтчетОПереработке(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
			
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ДокСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//} УПД970. Программный интерфейс

//{ УПД970. Заполнение протоструктуры по документам

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактура(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактура(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		ДанныеПоДокументу.СведенияОДокументахОплаты
	);
	
	ДокументыОснования = ДанныеПоДокументу.ДокументыОснования;
	ДокументОснование = ДокументыОснования[0];
	
	ДанныеПоДокументуОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументОснование, ДокСсылка);
	
	ДанныеШапкиОснования = ДанныеПоДокументуОснования.ДанныеШапки;
	
	УПД970_ЗаполнитьДатуНомерСчетФактуры(Контент, ДанныеШапки, ДанныеШапкиОснования.ЦифровойИндексОП);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапкиОснования.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументуОснования.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументуОснования,
		ДополнительныеПараметры
	);
	
	Для Индекс = 1 По ДокументыОснования.ВГраница() Цикл
		
		ДокументОснование = ДокументыОснования[Индекс];
		
		ДанныеПоДокументуОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументОснование, ДокСсылка);
		
		УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
			Контент,
			ДанныеПоДокументуОснования,
			ДополнительныеПараметры);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОснования, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьСведенияОбАвансовыхСФ(
		Контент.AccompanyingDocuments,
		ДанныеПоДокументу.АвансовыеДокументы
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураНаАванс(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		ДанныеПоДокументу.СведенияОДокументахОплаты);
		
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуРасходнаяНакладная(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаРасходнаяНакладная(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализации(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомерКорректировкаРеализации(Контент, ДанныеШапки);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуАктВыполненныхРабот(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаАктВыполненныхРабот(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуЗаказПокупателя(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаЗаказПокупателя(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомитенту(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаОтчетКомитенту(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомиссионера(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаОтчетКомиссионера(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуПеремещениеЗапасов(ДокСсылка, ДополнительныеПараметры)
	
	Если НЕ ЭтоПеремещениеЗапасов(ДокСсылка) Тогда
		
		ТекстОшибки = НСтр("ru='Отправка ТОРГ-13 поддержана только для видом операции ""Перемещение""'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета();
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаПеремещениеЗапасов(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокументаУПД_ДОП();
	Контент.CircumFormatInvoice = "00051";
	Контент.Currency = ВалютаРегламентированногоУчета.Код;
	Контент.DocumentNumber = ДанныеШапки.Номер;
	Контент.DocumentDate = ДанныеШапки.Дата;
	Контент.DocumentName = НаименованияДокументов.УПД;
	
	DocumentShipment = УПД970_НовыйDocumentShipments970(
		Контент.DocumentName,
		Контент.DocumentNumber,
		Контент.DocumentDate
	);
	
	Контент.DocumentShipments.Добавить(DocumentShipment);
	
	УПД970_ЗаполнитьСведенияОбУчастникахВнутреннегоЭДО(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымПеремещения(
		Контент,
		ДанныеПоДокументу.ТаблицаДокумента,
		ДополнительныеПараметры
	);
	
	УПД970_ЗаполнитьРеквизитыОснованияПеремещенияЗапасов(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуОтчетОПереработке(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаОтчетОПереработке(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

//{ УПД970. Заполнение протоструктуры по документам. Общее

Процедура УПД970_ЗаполнитьДатуНомер(Контент, НомерДокумента, ДатаДокумента)
	
	Контент.DocumentNumber = ПредставлениеНомера(НомерДокумента);
	Контент.DocumentDate = ДатаДокумента;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки, ЦифровойИндексОП)
	
	Контент.RevisionNumber = ДанныеШапки.НомерИсправления;
	Контент.RevisionDate = ДанныеШапки.Дата;
	
	Если ЗначениеЗаполнено(ДанныеШапки.НомерИсходногоДокумента) Тогда
		DocumentNumber = ПредставлениеНомера(ДанныеШапки.НомерИсходногоДокумента);
		
		УПД970_ДополнитьНомерЦифровымИндексомОП(DocumentNumber, ЦифровойИндексОП);
	Иначе
		DocumentNumber = ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДатаИсходногоДокумента) Тогда
		DocumentDate = ДанныеШапки.ДатаИсходногоДокумента;
	Иначе
		DocumentDate = ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Контент.DocumentNumber = DocumentNumber;
	Контент.DocumentDate = DocumentDate;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуНомерСчетФактуры(Контент, ДанныеШапки, ЦифровойИндексОП)
	
	Если ДанныеШапки.Исправление Тогда
		УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки, ЦифровойИндексОП);
	Иначе
		УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
		УПД970_ДополнитьНомерЦифровымИндексомОП(Контент.DocumentNumber, ЦифровойИндексОП);
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуНомерКорректировкаРеализации(Контент, ДанныеШапки)
	
	Если ДанныеШапки.Исправление Тогда
		ЦифровойИндексОП = Неопределено;
		УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки, ЦифровойИндексОП);
	Иначе
		УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ДополнитьНомерЦифровымИндексомОП(DocumentNumber, ЦифровойИндексОП)
	
	Если НЕ ЗначениеЗаполнено(ЦифровойИндексОП) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонНомера = "%1/%2";
	
	DocumentNumber = СтрШаблон(ШаблонНомера, DocumentNumber, ЦифровойИндексОП);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВалюту(Контент, ВалютаКод)
	
	Контент.Currency = ВалютаКод;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, СведенияОДокументахОплаты)
	
	Для Каждого СтрокаТаблицы Из СведенияОДокументахОплаты Цикл
		
		PaymentDocument = Контракт_PaymentDocumentInfo();
		
		PaymentDocument.Number = СтрокаТаблицы.НомерДокумента;
		PaymentDocument.Date = СтрокаТаблицы.ДатаДокумента;
		
		Контент.PaymentDocuments.Добавить(PaymentDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
	Контент,
	ОснованияПередачиТоваров,
	ДополнительныеПараметры)
	
	Перем УказыватьОтсутствиеОснованияУПД;
	
	TransferInfo = Контракт_TransferInfo970();
	Контент.TransferInfo = TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	ДополнительныеПараметры.Свойство("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
	
	Для Каждого РеквизитыОснования Из ОснованияПередачиТоваров Цикл
		
		РеквизитыЗаполнены = УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования);
		
		Если Не РеквизитыЗаполнены
			И УказыватьОтсутствиеОснованияУПД = Истина Тогда
			
			TransferInfo.TransferBases.Очистить();
			Прервать;
			
		Иначе
			
			TransferBase = УПД970_НовыйTransferBase(РеквизитыОснования);
			TransferInfo.TransferBases.Добавить(TransferBase);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если TransferInfo.TransferBases.Количество() = 0 Тогда
		TransferInfo.WithoutTransferBase = Истина;
	КонецЕсли;
	
	УПД970_ЗаполнитьДатуОтгрузки(Контент);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбАвансовыхСФ(AccompanyingDocuments, АвансовыеДокументы)
	
	Для Каждого АвансовыйДокумент Из АвансовыеДокументы Цикл
		
		AccompanyingDocument = Контракт_AccompanyingDocument970();
		AccompanyingDocument.Name = Конст_ИмяДокументаАСЧФ();
		AccompanyingDocument.Date = АвансовыйДокумент.ДатаСчетаФактурыНаАванс;
		AccompanyingDocument.Number = XMLСтрока(АвансовыйДокумент.НомерСчетаФактурыНаАванс);
		
		ЭтоИсправление = ЗначениеЗаполнено(АвансовыйДокумент.НомерИсправленияСчетаФактурыНаАванс)
			Или ЗначениеЗаполнено(АвансовыйДокумент.ДатаИсправленияСчетаФактурыНаАванс);
		
		Если ЭтоИсправление Тогда
			AccompanyingDocument.AdditionalInfo = СтрШаблон(
				"ИспАСЧФ № %1 от %2",
				XMLСтрока(АвансовыйДокумент.НомерИсправленияСчетаФактурыНаАванс),
				Формат(АвансовыйДокумент.ДатаИсправленияСчетаФактурыНаАванс, "ДФ=dd.MM.yyyy")
			);
		КонецЕсли;
		
		AccompanyingDocuments.Добавить(AccompanyingDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Конст_ИмяДокументаАСЧФ()
	Возврат "АСЧФ";
КонецФункции

Функция УПД970_НовыйTransferBase(РеквизитыОснования)
	
	Результат = Контракт_TransferBases970();
	
	Результат.Name = РеквизитыОснования.Наименование;
	Результат.Number = РеквизитыОснования.Номер;
	Результат.Date = РеквизитыОснования.Дата;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДатуОтгрузки(Контент)
	
	Если Контент.Function <> ФункцияДокументаУПД_СЧФ() Тогда
		
		ДатаОтгрузки = Контент.DocumentDate;
		
		Для Каждого DocumentShipment Из Контент.DocumentShipments Цикл
			ДатаОтгрузки = DocumentShipment.Date;
			Прервать;
		КонецЦикла;
		
		Контент.TransferInfo.TransferDate = ДатаОтгрузки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, СведенияОбУчастникахЭДО)
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОбУчастникахЭДО.Организация);
	Seller.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОбУчастникахЭДО.Контрагент);
	Buyer.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Контрагент.Ссылка;
	
	Грузоотправитель = СведенияОбУчастникахЭДО.Грузоотправитель;
	Если Грузоотправитель <> Неопределено Тогда
		
		Shipper = Контракт_Shipper970();
		Shipper.SameAsSeller = Ложь;
		
		Контент.Shippers.Добавить(Shipper);
		
		Если Грузоотправитель.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка Тогда
			
			Shipper.SameAsSeller = Истина;
			
		Иначе
			
			ShipperInfo = Контракт_ExtendedOrganizationInfo970();
			Shipper.OrganizationInfo = ShipperInfo;
			УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, Грузоотправитель);
			ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СведенияОбУчастникахЭДО.Грузополучатель <> Неопределено Тогда
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		Контент.Consignees.Добавить(Consignee);
		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, СведенияОбУчастникахЭДО.Грузополучатель);
		Consignee.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Грузополучатель.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьExtendedOrganizationInfo(Content, ДанныеУчастникаЭДО)
	
	Content.Type = УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО);
	
	Content.Name = ДанныеУчастникаЭДО.Наименование;
	
	Content.Inn = ДанныеУчастникаЭДО.ИНН;
	Content.Kpp = ДанныеУчастникаЭДО.КПП;
	Content.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	Content.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
	
	Content.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРНИП;
	Content.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаОГРНИП;
	
	Content.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	
	Content.Country = ДанныеУчастникаЭДО.СтранаНаименование;
	Content.CountryCode = ДанныеУчастникаЭДО.СтранаКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		Content.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.ЭлектроннаяПочта) Тогда
		Content.Email.Добавить(ДанныеУчастникаЭДО.ЭлектроннаяПочта);
	КонецЕсли;
	
	Content.BankName = ДанныеУчастникаЭДО.НаименованиеБанка;
	Content.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	Content.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	Content.BankId = ДанныеУчастникаЭДО.БИК;
	
	УПД970_ЗаполнитьAddressInfo(Content, ДанныеУчастникаЭДО.Адрес);
	
	Content.СлужебнаяИнформация.Ссылка = ДанныеУчастникаЭДО.Ссылка;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьAddressInfo(OrganizationInfo, СведенияОбАдресе)
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат;
	КонецЕсли;
	
	AddressInfo = Контракт_AddressInfo970();
	OrganizationInfo.Address = AddressInfo;
	
	ВидыАдресов = ГенерацияXML.Перечисление_ВидыАдресов();
	
	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		AddressSAR = УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе);
		
		AddressInfo.AddressSAR = AddressSAR;
		AddressInfo.Type = ВидыАдресов.АдресГАР;
		
	ИначеЕсли ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		AddressRF = УПД970_ЗаполненныйAddressRF(СведенияОбАдресе);
		
		AddressInfo.AddressRF = AddressRF;
		AddressInfo.Type = ВидыАдресов.АдресРФ;
		
	Иначе
		
		AddressText = УПД970_ЗаполненныйAddressText(СведенияОбАдресе);
		
		AddressInfo.AddressText = AddressText;
		AddressInfo.Type = ВидыАдресов.АдресСтрокой;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ТипыПомещенийКвартиры()
	
	Результат = Новый Массив;
	Результат.Добавить("Комната");
	Результат.Добавить("Бокс");
	Результат.Добавить("А/Я");
	Результат.Добавить("В/Ч");
	Результат.Добавить("П/О");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипыПомещенийЗдания()
	
	Результат = Новый Массив;
	Результат.Добавить("Офис");
	Результат.Добавить("Квартира");
	Результат.Добавить("Помещение");
	Результат.Добавить("Этаж");
	Результат.Добавить("Гараж");
	Результат.Добавить("Павильон");
	Результат.Добавить("Котельная");
	Результат.Добавить("Погреб");
	Результат.Добавить("Рабочий Участок");
	Результат.Добавить("Склад");
	Результат.Добавить("Торговый Зал");
	Результат.Добавить("Цех");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе)
	
	Результат = Контракт_AddressSARInfo();
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома) Тогда
		Результат.ID = СведенияОбАдресе.ИдентификаторДома;
	Иначе
		Результат.ID = СведенияОбАдресе.ИдентификаторАдресногоОбъекта;
	КонецЕсли;
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = УПД970_ПредставлениеРегиона(СведенияОбАдресе);
	
	Результат.MunicipalDistrict = СведенияОбАдресе.МуниципальныйРайон;
	Результат.MunicipalDistrictCode = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
	
	УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОНаселенномПункте(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОТерритории(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОУлице(Результат, СведенияОбАдресе);
	
	Результат.LandPlot = СведенияОбАдресе.НомерЗемельногоУчастка;
	
	УПД970_ЗаполнитьСведенияОЗданиях(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииЗдания(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииКвартиры(Результат, СведенияОбАдресе);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КодМуниципальногоРайона(ТипМуниципальногоРайона)
	
	Результат = "";
	
	Если ВРег(ТипМуниципальногоРайона) = ВРег("м.р-н") Тогда
		
		Результат = "1";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("г.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("ф.т.") Тогда
		
		Результат = "2";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер. г.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.г.") Тогда
		
		Результат = "3";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("мун. окр.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("м.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("мун.окр.") Тогда
		
		Результат = "4";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressRF(СведенияОбАдресе)
	
	Результат = Контракт_AddressRFInfo();
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = СведенияОбАдресе.Регион;
	Результат.Territory = СведенияОбАдресе.Район;
	
	Результат.City = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Город,
		СведенияОбАдресе.ГородСокращение);
	
	Результат.Locality = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.НаселенныйПункт,
		СведенияОбАдресе.НаселенныйПунктСокращение);
		
	Результат.Street = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Улица,
		СведенияОбАдресе.УлицаСокращение);
	
	ИмяПоляНомер = "Номер";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание) Тогда 
		СведенияОбАдресе.Здание.Свойство(ИмяПоляНомер, Результат.Building);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса) Тогда 
		СведенияОбАдресе.Корпуса[0].Свойство(ИмяПоляНомер, Результат.Block);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда 
		СведенияОбАдресе.Помещения[0].Свойство(ИмяПоляНомер, Результат.Apartment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressText(СведенияОбАдресе)
	
	Результат = Контракт_AddressTextInfo();
	
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса)
		И ЗначениеЗаполнено(СведенияОбАдресе.МуниципальноеПредставление) Тогда
		
		ПредставлениеАдреса = СведенияОбАдресе.МуниципальноеПредставление;
		
	КонецЕсли;
	
	Результат.AddressText = ПредставлениеАдреса;
	Результат.CountryCode = СведенияОбАдресе.КодСтраны;
	Результат.Country = СведенияОбАдресе.Страна;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеРегиона(СведенияОбАдресе)
	
	КодыРегионов = ГенерацияXML_КодыРегионов();
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		Результат = КодыРегионов.Получить(XMLЗначение(Тип("Число"), СведенияОбАдресе.КодРегиона));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		ЧастиРегиона = Новый Массив;
		ЧастиРегиона.Добавить(СокрЛП(СведенияОбАдресе.Регион));
		ЧастиРегиона.Добавить(НРег(СведенияОбАдресе.РегионТипКраткий));
		
		Результат = СтрСоединить(ЧастиРегиона, " ");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Поселение) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.Поселение;
		AddressSAR.SettlementCode = СведенияОбАдресе.КодПоселения;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.ВнутригородскойРайон) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.ВнутригородскойРайон;
		AddressSAR.SettlementCode = "4";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОНаселенномПункте(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.НаселенныйПункт) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.НаселенныйПункт;
		AddressSAR.LocalityType = СведенияОбАдресе.НаселенныйПунктТипКраткий;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.Город) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.Город;
		AddressSAR.LocalityType = СведенияОбАдресе.ГородТипКраткий;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТерритории(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Территория) Тогда
		AddressSAR.PlanningElement = СведенияОбАдресе.Территория;
		AddressSAR.PlanningElementType = СведенияОбАдресе.ТерриторияТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОУлице(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Улица) Тогда
		AddressSAR.StreetElement = СведенияОбАдресе.Улица;
		AddressSAR.StreetElementType = СведенияОбАдресе.УлицаТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОЗданиях(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание.Номер)
		И ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания) Тогда
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = СведенияОбАдресе.Здание.Номер;
		AddressObject.Type = СведенияОбАдресе.Здание.ТипЗдания;
		
	КонецЕсли;
	
	Для Каждого Корпус Из СведенияОбАдресе.Корпуса Цикл
		
		Если Не ЗначениеЗаполнено(Корпус.Номер)
			И Не ЗначениеЗаполнено(Корпус.ТипКорпуса) Тогда
			Продолжить;
		КонецЕсли;
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = Корпус.Номер;
		AddressObject.Type = Корпус.ТипКорпуса;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииЗдания(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыПомещенийВПорядкеПриоритета = УПД970_ТипыПомещенийЗдания();
	
	Для Каждого ТипПомещения Из ТипыПомещенийВПорядкеПриоритета Цикл
		
		ПомещениеЗдания = Ядро.МассивСтруктур_Найти(Помещения, ТипПомещения, "ТипПомещения");
		Если ПомещениеЗдания <> Неопределено Тогда
			
			AddressSAR.House = ПомещениеЗдания.Номер;
			AddressSAR.HouseType = ПомещениеЗдания.ТипПомещения;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииКвартиры(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ПомещениеКвартиры = УПД970_ПолучитьПомещениеКвартиры(Помещения);
	
	Если ПомещениеКвартиры = Неопределено Тогда
		ПомещениеКвартиры = УПД970_ПолучитьНеклассифицированноеПомещение(Помещения);
	КонецЕсли;
	
	Если ПомещениеКвартиры <> Неопределено Тогда
		AddressSAR.Apartment = ПомещениеКвартиры.Номер;
		AddressSAR.ApartmentType = ПомещениеКвартиры.ТипПомещения;
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ПолучитьПомещениеКвартиры(СписокПомещений)
	
	ПомещениеКвартиры = Неопределено;
	
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	Для Каждого ИмяТипаПомещения Из ТипыПомещенийКвартиры Цикл
		
		ПомещениеКвартиры = Ядро.МассивСтруктур_Найти(СписокПомещений, ИмяТипаПомещения, "ТипПомещения");
		
		Если ПомещениеКвартиры <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПомещениеКвартиры;
	
КонецФункции

Функция УПД970_ПолучитьНеклассифицированноеПомещение(СписокПомещений)
	
	Результат = Неопределено;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	
	Для Каждого Помещение Из СписокПомещений Цикл
		
		ТипПомещения = Помещение.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		Если Не ЭтоПомещениеЗдания
			И Не ЭтоПомещениеКвартиры Тогда
			Результат = Помещение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент)
	
	Контент.DocumentCreator = "";
	Контент.DocumentCreatorBase = "";
	
	Если Контент.Sellers.Количество() > 0 Тогда
		
		ПродавецИнфо = Контент.Sellers[0];
		Контент.DocumentCreator = НаименованиеИННКПП(ПродавецИнфо.Name, ПродавецИнфо.Inn, ПродавецИнфо.Kpp);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(Контент, ДанныеПоДокументу, ДополнительныеПараметры)
	
	Перем СведенияПрослеживаемости;
	
	ТабличныеДанные = ДанныеПоДокументу.ТабличныеДанные;
	ДанныеПоДокументу.Свойство("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	
	ВсеСтрокиБезНДС = Истина;
	
	Если Контент.Table = Неопределено Тогда
		Контент.Table = Контракт_InvoiceTable970();
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы);
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			Item.Quantity = Окр(СтрокаТаблицы.Количество, ТочностьКоличества);
		КонецЕсли;
		
		ПредставлениеСтавки = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		
		Item.TaxRate = ПредставлениеСтавки;
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		
		Item.Price = УПД970_ЦенаБезНДС(Item, СтрокаТаблицы.Цена, ТочностьЦены);
		
		Item.Excise = СтрокаТаблицы.СуммаАкциза;
		
		УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(
			Item,
			СтрокаТаблицы,
			СведенияПрослеживаемости);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Контент.Table.Items.Добавить(Item);
		
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		УПД970_ПересчитатьИтоговыеЗначенияТаблицы(Контент.Table, Item);
		
	КонецЦикла;
	
	Контент.Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(Контент, ТабличныеДанные, ДополнительныеПараметры)
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Содержание) Тогда
			НаименованиеНоменклатуры = СтрокаТаблицы.Содержание;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПолноеНаименование) Тогда
			НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураПолноеНаименование;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураНаименование) Тогда
			НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураНаименование;
		Иначе
			НаименованиеНоменклатуры = "Предварительная оплата";
		КонецЕсли;
		
		Item.Product = НаименованиеНоменклатуры;
		Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
		
		Item.ItemVendorCode = СтрокаТаблицы.КодИлиАртикулНоменклатуры;
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияСтроки();
		Item.СлужебнаяИнформация.Номенклатура = СтрокаТаблицы.Номенклатура;
		Item.СлужебнаяИнформация.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.Vat = ТабличныеДанные.Итог("СуммаНДС");
	Table.Total = ТабличныеДанные.Итог("СуммаВсего");
	
КонецПроцедуры

Процедура УПД970_ПересчитатьИтоговыеЗначенияТаблицы(Table, Item)
	
	Если Table.TotalNet = Неопределено Тогда
		Table.TotalNet = 0;
	КонецЕсли;
	
	Если Table.TotalWithVatExcluded = Неопределено Тогда
		Table.TotalWithVatExcluded = 0;
	КонецЕсли;
	
	Если Table.Vat = Неопределено Тогда
		Table.Vat = 0;
	КонецЕсли;
	
	Если Table.Total = Неопределено Тогда
		Table.Total = 0;
	КонецЕсли;
	
	Если Item.Quantity <> Неопределено Тогда
		Table.TotalNet = Table.TotalNet + Item.Quantity;
	КонецЕсли;
	
	Table.Vat = Table.Vat + Item.Vat;
	Table.TotalWithVatExcluded = Table.TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
	Table.Total = Table.Total + Item.Subtotal;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы)
	
	Item.Product = УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы);
	Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
	
	Item.ItemVendorCode = СтрокаТаблицы.КодИлиАртикулНоменклатуры;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
		
		КодЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод);
		ИмяЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
		
		Item.Unit = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕИ);
		Item.UnitName = ИмяЕИ;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы)
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ТоварСодержание) Тогда
		Возврат СтрокаТаблицы.ТоварСодержание;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ТоварПолноеНаименование) Тогда
		НаименованиеНоменклатуры = СтрокаТаблицы.ТоварПолноеНаименование;
	Иначе
		НаименованиеНоменклатуры = СтрокаТаблицы.ТоварНаименование;
	КонецЕсли;
	
	ДопСведенияОНоменклатуре = Новый Массив;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ХарактеристикаНоменклатурыНаименование) Тогда
		Результат = СтрШаблон("%1 (%2)", НаименованиеНоменклатуры, СтрокаТаблицы.ХарактеристикаНоменклатурыНаименование);
	Иначе
		Результат = НаименованиеНоменклатуры;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыВТерминахПрото(ТипНоменклатуры)
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Если ТипНоменклатуры = УПД970_ТипНоменклатурыУслуга() Тогда
		Результат = ТипыНоменклатуры.Услуга;
	ИначеЕсли ТипНоменклатуры = УПД970_ТипНоменклатурыРабота() Тогда
		Результат = ТипыНоменклатуры.Работа;
	Иначе
		Результат = ТипыНоменклатуры.Имущество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(Item, СтрокаТаблицы, СведенияПрослеживаемости)
	
	УПД970_ЗаполнитьСведенияОТаможеннойДекларации(
		Item,
		СтрокаТаблицы);
	
	Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
		
		УПД970_ЗаполнитьСведенияПрослеживаемости(
			Item,
			СведенияПрослеживаемости,
			СтрокаТаблицы.ИдентификаторСтроки,
			СтрокаТаблицы.СтранаПроисхожденияКод,
			СтрокаТаблицы.НоменклатураТНВЭД
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияПрослеживаемости(
		Item,
		СведенияПрослеживаемостиДокумента,
		ИдентификаторСтроки,
		СтранаСтроки,
		ТНВЭДСтроки)
	
	Если СведенияПрослеживаемостиДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Item.CustomDeclarations.Очистить();
	
	ТаблицаСведенийГТД = Новый ТаблицаЗначений;
	ТаблицаСведенийГТД.Колонки.Добавить("СтранаПроисхожденияКод");
	ТаблицаСведенийГТД.Колонки.Добавить("НомерГТД");
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	СтрокиПрослеживаемости = СведенияПрослеживаемостиДокумента.НайтиСтроки(Отбор);
	
	ДляСтрокиКонтентаНесколькоСтрокПрослеживаемости = (СтрокиПрослеживаемости.Количество() > 1);
	
	Для Каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
		
		ItemTracingInfo = Контракт_ItemTracingInfo970();
		
		ItemTracingInfo.RegNumberUnit = СокрЛП(СтрокаПрослеживаемости.НомерРНПТ);
		ItemTracingInfo.Quantity = СтрокаПрослеживаемости.КоличествоПрослеживаемости;
		
		Если ЗначениеЗаполнено(СтрокаПрослеживаемости.Сумма) Тогда
			ItemTracingInfo.SumWithoutVat = СтрокаПрослеживаемости.Сумма;
		ИначеЕсли ДляСтрокиКонтентаНесколькоСтрокПрослеживаемости Тогда
			ItemTracingInfo.SumWithoutVat = СтрокаПрослеживаемости.КоличествоПрослеживаемости * Item.Price;
		Иначе
			ItemTracingInfo.SumWithoutVat = Item.SubtotalWithVatExcluded;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПрослеживаемости.НоменклатураТНВЭД) Тогда
			
			ДанныеЕдиницыИзмерения = УПД_ДанныеЕдиницыИзмеренияТНВЭД(СтрокаПрослеживаемости.НоменклатураТНВЭД);
			
			ItemTracingInfo.Unit = ДанныеЕдиницыИзмерения.Код;
			ItemTracingInfo.UnitName = ДанныеЕдиницыИзмерения.Наименование;
			
		ИначеЕсли ЗначениеЗаполнено(ТНВЭДСтроки) Тогда
			
			ДанныеЕдиницыИзмерения = УПД_ДанныеЕдиницыИзмеренияТНВЭД(ТНВЭДСтроки);
			
			ItemTracingInfo.Unit = ДанныеЕдиницыИзмерения.Код;
			ItemTracingInfo.UnitName = ДанныеЕдиницыИзмерения.Наименование;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ItemTracingInfo.Unit) Тогда
			ItemTracingInfo.Unit = Item.Unit;
			ItemTracingInfo.UnitName = Item.UnitName;
		КонецЕсли;
		
		Item.ItemTracingInfos.Добавить(ItemTracingInfo);
		
		СтрокаСведенийГТД = ТаблицаСведенийГТД.Добавить();
		СтрокаСведенийГТД.НомерГТД = СтрокаПрослеживаемости.НомерГТД;
		
		Если ЗначениеЗаполнено(СтрокаПрослеживаемости.СтранаПроисхожденияКод) Тогда
			СтрокаСведенийГТД.СтранаПроисхожденияКод = СтрокаПрослеживаемости.СтранаПроисхожденияКод;
		Иначе
			СтрокаСведенийГТД.СтранаПроисхожденияКод = СтранаСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаСведенийГТД.Свернуть("СтранаПроисхожденияКод, НомерГТД");
	
	Для Каждого СтрокаСведенийГТД Из ТаблицаСведенийГТД Цикл
		УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаСведенийГТД);
	КонецЦикла;
	
КонецПроцедуры

Функция УПД_ДанныеЕдиницыИзмеренияТНВЭД(ТоварнаяНоменклатураВЭД)
	
	Результат = Новый Структура("Код, Наименование", "", "");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК Код,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК Наименование
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО КлассификаторТНВЭД.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	КлассификаторТНВЭД.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ТоварнаяНоменклатураВЭД);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаТаблицы)
	
	ЭтоСтранаПроисхожденияРоссия = СтрокаТаблицы.СтранаПроисхожденияКод = ОсновнаяСтрана().Код;
	Если ЭтоСтранаПроисхожденияРоссия Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД)
		И (Не ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхожденияКод)
			Или СтрокаТаблицы.СтранаПроисхожденияУчастникЕАЭС) Тогда
		Возврат;
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = СтрокаТаблицы.СтранаПроисхожденияКод;
	CustomDeclaration.DeclarationNumber = СокрЛП(СтрокаТаблицы.НомерГТД);
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	Результат.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	Результат.Номенклатура = СтрокаТаблицы.Товар;
	Результат.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
	Результат.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
	Результат.НомерГТД = СтрокаТаблицы.НомерГТД;
	Результат.ПрослеживаемыйТовар = СтрокаТаблицы.ПрослеживаемыйТовар;
	Результат.Серия = СтрокаТаблицы.СерияНоменклатуры;
	Результат.Характеристика = СтрокаТаблицы.ХарактеристикаНоменклатуры;
	Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка;
	Результат.ИдентификаторСтроки = СтрокаТаблицы.НомерСтроки;
	Результат.ПутьКИдентификаторуСтроки = СтрокаТаблицы.ИмяТабличнойЧасти;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItemПеремещения(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	ЗаполнитьЗначенияСвойств(Результат, СтрокаТаблицы);
	
	Результат.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	Результат.Номенклатура = СтрокаТаблицы.Товар;
	Результат.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
	Результат.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавкиБезНДС());
	Результат.Серия = СтрокаТаблицы.СерияНоменклатуры;
	Результат.Характеристика = СтрокаТаблицы.ХарактеристикаНоменклатуры;
	Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка;
	
	Если Не ЗначениеЗаполнено(Результат.ПрослеживаемыйТовар) Тогда
		Результат.ПрослеживаемыйТовар = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, КоллекцияДокументов, ФункцияДокумента)
	
	ДокументыОтгрузки = УПД970_ДокументыОтгрузки(КоллекцияДокументов);
	
	СтрокиТаблицы = Контент.Table.Items;
	
	НаименованиеДокумента = УПД970_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		РеквизитыДокументовОтгрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДокументыОтгрузки, "Номер,Дата");
		
		Для Каждого КлючЗначение Из РеквизитыДокументовОтгрузки Цикл
			
			РеквизитыДокумента = КлючЗначение.Значение;
			
			НомерДокумента = ПредставлениеНомера(РеквизитыДокумента.Номер);
			ДатаДокумента = РеквизитыДокумента.Дата;
			
			DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
			Контент.DocumentShipments.Добавить(DocumentShipment);
			
		КонецЦикла;
		
	Иначе
		
		НомерДокумента = Контент.DocumentNumber;
		ДатаДокумента = Контент.DocumentDate;
		
		DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
		Контент.DocumentShipments.Добавить(DocumentShipment);
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента)
	
	Результат = Контракт_DocumentShipments970();
	
	Результат.Name = НаименованиеДокумента;
	Результат.Number = НомерДокумента;
	Результат.Date = ДатаДокумента;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента)
	
	Если ФункцияДокумента <> ФункцияДокументаУПД_СЧФ()
		И Контент.DocumentShipments.Количество() > 0 Тогда
		Контент.DocumentName = Контент.DocumentShipments[0].Name;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры)
	
	Перем ДанныеСотрудника;
	
	ДополнительныеПараметры.Свойство("ДанныеСотрудника", ДанныеСотрудника);
		
	ЕстьТовары = УПД970_ВДокументеЕстьТовары(Контент.Table.Items);
	
	НеобходимоЗаполнитьСведения = (ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность)
		И Контент.Function <> ФункцияДокументаУПД_СЧФ()
		И ЕстьТовары);
	
	Если НеобходимоЗаполнитьСведения Тогда
		
		Employee = Контракт_Employee970();
		
		Employee.Surname = ДанныеСотрудника.Фамилия;
		Employee.FirstName = ДанныеСотрудника.Имя;
		Employee.Patronymic = ДанныеСотрудника.Отчество;
		Employee.EmployeePosition = ДанныеСотрудника.Должность;
		
		Контент.TransferInfo.Employee = Employee;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент)
	
	ЕстьПрослеживаемыеТовары = Ложь;
	
	Для Каждого Item Из Контент.Table.Items Цикл
		Если Item.ItemTracingInfos.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТовары = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПризнакиТоваров = ГенерацияXML.Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваровУПД970(ЕстьПрослеживаемыеТовары);
	
	ГенерацияXML.Заполнить_ПризнакиПрослеживаемыхИМаркируемыхТоваровДокументаУПД970(Контент, ПризнакиТоваров);

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаОбъект)
	
	Попытка
		
		РаботаСМаркировкой.ЗаполнитьСведенияОМаркировке970(Контент);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ПодробнаяОшибка = СтрШаблон(
			"Не удалось заполнить сведения о маркировке по причине:
			|%1",
			ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
			"Диадок.РаботаСМаркировкой",
			УровеньЖурналаРегистрации.Ошибка,
			СсылкаНаОбъект.Метаданные(),
			СсылкаНаОбъект,
			ПодробнаяОшибка);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымПеремещения(Контент, ТабличныеДанные, ДополнительныеПараметры)
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	
	ВсеСтрокиБезНДС = Истина;
	
	Если Контент.Table = Неопределено Тогда
		Контент.Table = Контракт_InvoiceTable970();
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы);
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			Item.Quantity = Окр(СтрокаТаблицы.Количество, ТочностьКоличества);
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиБезНДС();
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		Item.Price = Окр(СтрокаТаблицы.Цена, ТочностьЦены);
		Item.Subtotal = СтрокаТаблицы.Сумма;
		Item.Vat = 0;
		Item.SubtotalWithVatExcluded = Item.Subtotal - Item.Vat;
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItemПеремещения(СтрокаТаблицы);
		
		Контент.Table.Items.Добавить(Item);
		
		УПД970_ПересчитатьИтоговыеЗначенияТаблицы(Контент.Table, Item);
		
	КонецЦикла;
	
	Контент.Table.TotalNet = ТабличныеДанные.Итог("Количество");
	Контент.Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	Контент.Table.Vat = 0;
	Контент.Table.Total = ТабличныеДанные.Итог("Сумма");
	Контент.Table.TotalWithVatExcluded = Контент.Table.Total - Контент.Table.Vat;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьРеквизитыОснованияПеремещенияЗапасов(Контент, Знач ДополнительныеПараметры)
	
	TransferInfo = Контракт_TransferInfo970();
	Контент.TransferInfo = TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	TransferInfo.WithoutTransferBase = Истина;
	
	УПД970_ЗаполнитьДатуОтгрузки(Контент);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбУчастникахВнутреннегоЭДО(Контент, ДанныеШапки)
	
	ДатаСведений = Контент.DocumentDate;
	ДанныеОрганизации = УПД970_ДанныеУчастникаЭДО(ДанныеШапки.Организация, ДатаСведений);
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, ДанныеОрганизации);
	Seller.СлужебнаяИнформация.Ссылка = ДанныеШапки.Организация.Ссылка;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, ДанныеОрганизации);
	Buyer.СлужебнаяИнформация.Ссылка = ДанныеШапки.Организация.Ссылка;
	
	Грузоотправитель = ДанныеШапки.ПодразделениеОтправитель;
	Если Грузоотправитель <> Неопределено Тогда
		
		Shipper = Контракт_Shipper970();
		Shipper.SameAsSeller = Ложь;
		
		Контент.Shippers.Добавить(Shipper);
		
		ДанныеГрузоотправителя = УПД970_Контракт_ДанныеУчастникаЭДО();
		ЗаполнитьЗначенияСвойств(ДанныеГрузоотправителя, ДанныеОрганизации, "ИНН,КПП,ОГРНИП,ЭтоФизЛицо,ЭтоЮрЛицо,Нерезидент");
		ДанныеГрузоотправителя.Адрес = УПД970_СведенияОФактическомАдресе(Грузоотправитель, ДатаСведений);
		ДанныеГрузоотправителя.Наименование = Грузоотправитель.НаименованиеПолное;
		Если НЕ ЗначениеЗаполнено(ДанныеГрузоотправителя.Наименование) Тогда
			ДанныеГрузоотправителя.Наименование = Грузоотправитель.Наименование;
		КонецЕсли;
		
		ShipperInfo = Контракт_ExtendedOrganizationInfo970();
		Shipper.OrganizationInfo = ShipperInfo;
		УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, ДанныеГрузоотправителя);
		ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель.Ссылка;
		
	КонецЕсли;
	
	Грузополучатель = ДанныеШапки.ПодразделениеПолучатель;
	Если Грузополучатель <> Неопределено Тогда
		
		ДанныеГрузополучателя = УПД970_Контракт_ДанныеУчастникаЭДО();
		ЗаполнитьЗначенияСвойств(ДанныеГрузополучателя, ДанныеОрганизации, "ИНН,КПП,ОГРНИП,ЭтоФизЛицо,ЭтоЮрЛицо,Нерезидент");
		ДанныеГрузополучателя.Адрес = УПД970_СведенияОФактическомАдресе(Грузополучатель, ДатаСведений);
		ДанныеГрузополучателя.Наименование = Грузополучатель.НаименованиеПолное;
		Если НЕ ЗначениеЗаполнено(ДанныеГрузополучателя.Наименование) Тогда
			ДанныеГрузополучателя.Наименование = Грузополучатель.Наименование;
		КонецЕсли;
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		Контент.Consignees.Добавить(Consignee);
		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, ДанныеГрузополучателя);
		Consignee.СлужебнаяИнформация.Ссылка = Грузополучатель.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

//} УПД970. Заполнение протоструктуры по документам. Общее

//} УПД970. Заполнение протоструктуры по документам

//{ УПД970. Исходные данные по документам

Функция УПД970_ИсходныеДанныеДокументаСчетФактура(ДокСсылка)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактура();
	ТекстЗапросаДанныхОДокументахОплаты = УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактуры();
	ТекстЗапросаДокументыОснования = УПД970_ТекстЗапросаДокументовОснованияСчетФактура();
	ТекстЗапросаАвансовыхДокументов = УПД970_ТекстЗапросаАвансовыхДокументовСчетФактуры();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхОДокументахОплаты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДокументыОснования);
	ТекстыЗапросов.Добавить(ТекстЗапросаАвансовыхДокументов);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	СведенияОДокументахОплаты = РезультатыЗапроса[1].Выгрузить();
	ДокументыОснования = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку(0);
	АвансовыеДокументы = РезультатыЗапроса[3].Выгрузить();
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(
		ДокументыОснования
	);
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	Результат = УПД970_Контракт_ДанныеСчетФактура();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ДокументыОснования = ДокументыОснования;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоСчетФактураНаАванс = Ложь;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.ОснованияПередачиТоваров = ОснованияПередачиТоваров;
	Результат.АвансовыеДокументы = АвансовыеДокументы;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументСсылка, СчетФактура)
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаРасходнаяНакладная(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаАктВыполненныхРабот(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаЗаказПокупателя(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомитенту(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетКомиссионера(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетОПереработке") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаОтчетОПереработке(ДокументСсылка, СчетФактура);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа-основания счета-фактура выданный: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ДокументСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураНаАванс();
	ТекстЗапросаДанныхОДокументахОплаты = УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураНаАванс();
	ТекстЗапросаДокументыОснования = УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыНаАванс();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхОДокументахОплаты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДокументыОснования);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	СведенияОДокументахОплаты = РезультатыЗапроса[2].Выгрузить();
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	Результат = УПД970_Контракт_ДанныеСчетФактура();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоСчетФактураНаАванс = Истина;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.ВидОперации = ДанныеШапки.ВидОперации;
	Результат.СведенияОбУчастникахЭДО = СведенияОбУчастникахЭДО;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаРасходнаяНакладная(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаРасходнаяНакладная());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаРасходнаяНакладная());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаРасходнаяНакладная());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	СведенияПрослеживаемости = РезультатыЗапроса[2];
	
	Результат = УПД970_ПодготовитьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаКорректировкаРеализации());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаКорректировкаРеализации());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	СведенияПрослеживаемости = РезультатыЗапроса[2];
	
	Результат = УПД970_ПодготовитьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаАктВыполненныхРабот(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаАктВыполненныхРабот());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаАктВыполненныхРабот());
	
	Если ВДокументеЕстьТабличнаяЧасть("АктВыполненныхРабот", "СведенияПрослеживаемости") Тогда
		ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаАктВыполненныхРабот());
	КонецЕсли;
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	
	Если РезультатыЗапроса.Количество() > 2 Тогда
		СведенияПрослеживаемости = РезультатыЗапроса[2];
	Иначе
		СведенияПрослеживаемости = Неопределено;
	КонецЕсли;
	
	Результат = УПД970_ПодготовитьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаЗаказПокупателя(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаЗаказПокупателя());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаЗаказПокупателя());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаЗаказПокупателя());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	СведенияПрослеживаемости = РезультатыЗапроса[2];
	
	Результат = УПД970_ПодготовитьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомитенту(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитенту());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаОтчетКомитенту());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	СведенияПрослеживаемости = Неопределено;
	
	Результат = УПД970_ПодготовитьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомиссионера(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионера());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаОтчетКомиссионера());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаОтчетКомиссионера());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаСведенияОПокупателеДокументаОтчетКомиссионера());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	СведенияПрослеживаемости = РезультатыЗапроса[2];
	СведенияОПокупателе = РезультатыЗапроса[3];
	
	Результат = УПД970_ПодготовитьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура
	);
	
	УПД970_ЗаполнитьДанныеПокупателяГрузополучателяПоОтчетуКомиссионера(Результат.СведенияОбУчастникахЭДО, СведенияОПокупателе);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетОПереработке(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетОПереработке());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаОтчетОПереработке());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", УПД970_ПредставлениеКодовВПечатныхФормах());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	
	СведенияПрослеживаемости = Неопределено;
	
	Результат = УПД970_ПодготовитьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		СведенияПрослеживаемости,
		СчетФактура
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаПеремещениеЗапасов(ДокСсылка, СчетФактура = Неопределено)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокСсылка);
	
	ПредставлениеКодовВПечатныхФормах = УПД970_ПредставлениеКодовВПечатныхФормах();
	ИспользоватьБазовыеЕИ = ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента();
	
	ТекстЗапроса = УПД970_ТекстЗапросаДанныеПоДокументуПеремещениеЗапасов();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИспользоватьБазовыеЕИ", ИспользоватьБазовыеЕИ);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПредставлениеКодовВПечатныхФормах", ПредставлениеКодовВПечатныхФормах);
	Запрос.УстановитьПараметр("ВидЦен", ДокСсылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен);
	Запрос.УстановитьПараметр("ДатаДокумента", ДокСсылка.Дата);
	Запрос.УстановитьПараметр("СписокНоменклатура", ДокСсылка.Запасы.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СписокХарактеристика", ДокСсылка.Запасы.ВыгрузитьКолонку("Характеристика"));
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатЗапроса[4].Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТаблицаДокумента", ТаблицаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПодготовитьДанныеПервичногоДокумента(
	РезультатЗапросаПоШапке,
	РезультатЗапросаПоТаблицам,
	РезультатЗапросаПоПрослеживаемости,
	СчетФактура)
	
	ДанныеШапкиТаблица = РезультатЗапросаПоШапке.Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеШапкиТаблица[0]);
	
	ТабличныеДанные = РезультатЗапросаПоТаблицам.Выгрузить();
	
	УПД970_УстановитьНомерСтрокиВТабличнойЧастиДляДоставки(ТабличныеДанные);
	
	Если УПД970_НеобходимоВыполнитьПересчетСуммВВалютеРегУчета(ДанныеШапки, СчетФактура) Тогда
		УПД970_ПерезаполнитьСуммыДокументаВВалютеРегУчета(ДанныеШапки, ТабличныеДанные);
		УПД970_ПерезаполнитьВалютуДокумента(ДанныеШапки);
	КонецЕсли;
	
	Если РезультатЗапросаПоПрослеживаемости = Неопределено Тогда
		СведенияПрослеживаемости = Неопределено;
	Иначе
		СведенияПрослеживаемости = РезультатЗапросаПоПрослеживаемости.Выгрузить();
	КонецЕсли;
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	Если УПД970_ВТабличныхДанныхДокументаНетТоваров(ТабличныеДанные) Тогда
		СведенияОбУчастникахЭДО.Грузоотправитель = Неопределено;
		СведенияОбУчастникахЭДО.Грузополучатель = Неопределено;
	КонецЕсли;
	
	ДокументыПередачиТоваров = ЗначениеВМассив(ДанныеШапки.Ссылка);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(
		ДокументыПередачиТоваров
	);
	
	Результат = УПД970_Контракт_ДанныеПервичногоДокумента();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияПрослеживаемости = СведенияПрослеживаемости;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.СчетФактура = СчетФактура;
	Результат.СведенияОбУчастникахЭДО = СведенияОбУчастникахЭДО;
	Результат.ОснованияПередачиТоваров = ОснованияПередачиТоваров;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДанныеПокупателяГрузополучателяПоОтчетуКомиссионера(СведенияОбУчастникахЭДО, ДанныеДокументаПокупателя)
	
	ДанныеДокументаПокупателяТаблица = ДанныеДокументаПокупателя.Выгрузить();
	Данные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеДокументаПокупателяТаблица[0]);
	
	СведенияОПокупателе = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Данные.Покупатель,
		Данные.ДатаСФ
	);
	
	СведенияОбУчастникахЭДО.Контрагент = СведенияОПокупателе;
	
	Если ЗначениеЗаполнено(СведенияОбУчастникахЭДО.Грузополучатель) Тогда
		СведенияОбУчастникахЭДО.Грузополучатель = СведенияОПокупателе;
	КонецЕсли;
	
КонецПроцедуры

//{ УПД970. Исходные данные по документам. Тексты запросов

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактура()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактура.Ссылка КАК Ссылка,
	|	&НомерСчетФактуры КАК Номер,
	|	СчетФактура.Дата КАК Дата,
	|	СчетФактура.ВидОперации КАК ВидОперации,
	|	СчетФактура.Исправление КАК Исправление,
	|	СчетФактура.НомерИсправления КАК НомерИсправления,
	|	СчетФактура.Договор КАК ДоговорКонтрагента,
	|	СчетФактура.Договор.ВидДоговора КАК ВидДоговора,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	&НомерИсправляемогоСчетФактуры КАК НомерИсходногоДокумента,
	|	ВЫРАЗИТЬ(СчетФактура.ИсправляемыйСчетФактура КАК Документ.СчетФактура).Дата КАК ДатаИсходногоДокумента,
	|	СчетФактура.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактура.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	СчетФактура.Ссылка = &Ссылка";
	
	УПД970_УстановитьВТекстЗапросаНомерСчетФактуры(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактуры()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента КАК ДатаДокумента,
	|	ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента КАК НомерДокумента
	|ИЗ
	|	Документ.СчетФактура.ДатаНомерДокументовОплаты КАК ДатаНомерДокументовОплаты
	|ГДЕ
	|	ДатаНомерДокументовОплаты.Ссылка = &Ссылка
	|	И ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента <> """"";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДокументовОснованияСчетФактура()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Основания.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК Основания
	|ГДЕ
	|	Основания.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаАвансовыхДокументовСчетФактуры()
	
	Результат =
	"ВЫБРАТЬ
	|	&НомерСчетаФактурыНаАванс КАК НомерСчетаФактурыНаАванс,
	|	&ДатаСчетаФактурыНаАванс КАК ДатаСчетаФактурыНаАванс,
	|	&НомерИсправленияСчетаФактурыНаАванс КАК НомерИсправленияСчетаФактурыНаАванс,
	|	&ДатаИсправленияСчетаФактурыНаАванс КАК ДатаИсправленияСчетаФактурыНаАванс
	|ИЗ
	|	Документ.СчетФактура.ДатаНомерДокументовОплаты КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И &ДанныеАСЧФ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ЕстьФункционалСведенийОбАвансах = ЕстьФункционалСведенийОбАвансах();
	
	Если ЕстьФункционалСведенийОбАвансах Тогда
		
		ВыражениеНомерСчетаФактурыНаАванс = "Таблица.НомерСчетаФактурыНаАванс";
		ВыражениеДатаСчетаФактурыНаАванс = "Таблица.ДатаСчетаФактурыНаАванс";
		ВыражениеНомерИсправленияСчетаФактурыНаАванс = "Таблица.НомерИсправленияСчетаФактурыНаАванс";
		ВыражениеДатаИсправленияСчетаФактурыНаАванс = "Таблица.ДатаИсправленияСчетаФактурыНаАванс";
		
		ВыражениеДанныеАСЧФ = "(Таблица.НомерСчетаФактурыНаАванс <> """"
			|	ИЛИ Таблица.ДатаСчетаФактурыНаАванс <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	ИЛИ Таблица.НомерИсправленияСчетаФактурыНаАванс <> """"
			|	ИЛИ Таблица.ДатаИсправленияСчетаФактурыНаАванс <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))";
		
	Иначе
		
		НеопределеноДляЗапроса = "НЕОПРЕДЕЛЕНО";
		
		ВыражениеНомерСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		ВыражениеДатаСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		ВыражениеНомерИсправленияСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		ВыражениеДатаИсправленияСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		
		ВыражениеДанныеАСЧФ = "ЛОЖЬ";
		
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&НомерСчетаФактурыНаАванс", ВыражениеНомерСчетаФактурыНаАванс);
	Замены.Добавить("&ДатаСчетаФактурыНаАванс", ВыражениеДатаСчетаФактурыНаАванс);
	Замены.Добавить("&НомерИсправленияСчетаФактурыНаАванс", ВыражениеНомерИсправленияСчетаФактурыНаАванс);
	Замены.Добавить("&ДатаИсправленияСчетаФактурыНаАванс", ВыражениеДатаИсправленияСчетаФактурыНаАванс);
	Замены.Добавить("&ДанныеАСЧФ", ВыражениеДанныеАСЧФ);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураНаАванс()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактура.Ссылка КАК Ссылка,
	|	&НомерСчетФактуры КАК Номер,
	|	СчетФактура.Дата КАК Дата,
	|	СчетФактура.ВидОперации КАК ВидОперации,
	|	СчетФактура.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетФактура.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СчетФактура.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	СчетФактура.Договор КАК ДоговорКонтрагента,
	|	СчетФактура.Организация КАК Организация,
	|	СчетФактура.Организация.КПП КАК ОрганизацияКПП,
	|	СчетФактура.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ГоловноеПодразделение,
	|	"""" КАК ПодразделениеКПП,
	|	"""" КАК ПодразделениеНаименование,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетФактура.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ СчетФактура.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	СчетФактура.Контрагент.КПП КАК КонтрагентКПП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	&НомерИсправляемогоСчетФактуры КАК НомерИсходногоДокумента,
	|	ВЫРАЗИТЬ(СчетФактура.ИсправляемыйСчетФактура КАК Документ.СчетФактура).Дата КАК ДатаИсходногоДокумента,
	|	СчетФактура.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактура.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	СчетФактура.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизации,
	|	СчетФактура.Контрагент.БанковскийСчетПоУмолчанию КАК БанковскийСчетКонтрагента,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СчетФактура.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	СчетФактура.Ссылка = &Ссылка";
	
	УПД970_УстановитьВТекстЗапросаНомерСчетФактуры(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураНаАванс()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Прочее"" КАК ТипНоменклатуры,
	|	ТабАвансы.Ссылка КАК Ссылка,
	|	ТабАвансы.НомерСтроки КАК НомерСтроки,
	|	ТабАвансы.Сумма КАК СуммаВсего,
	|	ТабАвансы.СуммаНДС КАК СуммаНДС,
	|	ТабАвансы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ТабАвансы.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	ТабАвансы.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры
	|ИЗ
	|	Документ.СчетФактура.Авансы КАК ТабАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабАвансы.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ТабАвансы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыНаАванс()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента КАК ДатаДокумента,
	|	ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента КАК НомерДокумента
	|ИЗ
	|	Документ.СчетФактура.ДатаНомерДокументовОплаты КАК ДатаНомерДокументовОплаты
	|ГДЕ
	|	ДатаНомерДокументовОплаты.Ссылка = &Ссылка
	|	И ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента <> """"";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаРасходнаяНакладная()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.НаименованиеПолное, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДанныеШапки.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель.ГоловнойКонтрагент = ДанныеШапки.Контрагент ТОГДА
	|			ЕСТЬNULL(ДанныеШапки.Грузополучатель.КПП, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеШапки.Контрагент.КПП, """")
	|	КОНЕЦ КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НЕ ДанныеШапки.Организация = ДанныеШапки.Организация.ГоловнаяОрганизация
	|			ТОГДА ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Подразделения.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И Подразделения.ГоловнаяОрганизация = ДанныеШапки.Организация
	|			ТОГДА Подразделения.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчет
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетКонтрагента
	|	КОНЕЦ КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ДанныеШапки.Курс КАК КурсВзаиморасчетов,
	|	ДанныеШапки.Кратность КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.РасходнаяНакладная КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК Подразделения
	|		ПО ДанныеШапки.Подразделение = Подразделения.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	ВыражениеАдресДоставкиЗначение = "ДанныеШапки.АдресДоставкиЗначение";
	
	Если НЕ ЕстьРеквизитОбъектаЛок("АдресДоставкиЗначение", Метаданные.Документы.КорректировкаРеализации) Тогда
		 ВыражениеАдресДоставкиЗначение = """"""; // 1.6.26 и ниже
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&АдресДоставкиЗначение", ВыражениеАдресДоставкиЗначение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаРасходнаяНакладная()
	
	ТекстЗапросаЗапасы =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ТипНоменклатурыЗапас
	|			ТОГДА ""Товар""
	|		ИНАЧЕ ""Услуга""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	""Запасы"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок,
	|	ТчЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчЗапасы.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫРАЗИТЬ(ТчЗапасы.Содержание КАК СТРОКА(1000)) КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	ТчЗапасы.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	ТчЗапасы.СерииНоменклатуры КАК СерияНоменклатурыНаименование,
	|	ТчЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТчЗапасы.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТчЗапасы.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ) КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТчЗапасы.НомерГТД.Код КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И НЕ &ИспользоватьБазовыеЕИ
	|			ТОГДА ТчЗапасы.Количество * ТчЗапасы.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТчЗапасы.Количество
	|	КОНЕЦ КАК Количество,
	|	ТчЗапасы.Цена КАК Цена,
	|	ТчЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ТчЗапасы.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма - ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма + ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	&СуммаАкциза КАК СуммаАкциза,
	|	ТчЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТчЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТчЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ТчЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК ТчЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК ДанныеШапки
	|		ПО ТчЗапасы.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчЗапасы.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТчЗапасы.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	ТчЗапасы.Ссылка = &Ссылка";
	
	ТекстЗапросаУпорядочить = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|";
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаЗапасы);
	ТекстыЗапросов.Добавить(ТекстЗапроса_ОбъединитьВсе());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаУслугиДоставкиОбщее("РасходнаяНакладная"));
	ТекстыЗапросов.Добавить(ТекстЗапросаУпорядочить);
	
	Результат = СтрСоединить(ТекстыЗапросов);
	
	ИспользоватьБазовыеЕИ = ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента();
	
	Результат = СтрЗаменить(Результат, "&ИспользоватьБазовыеЕИ", ИспользоватьБазовыеЕИ);
	
	УПД970_УстановитьВТекстЗапросаПрослеживаемыйКомплект(Результат, "РасходнаяНакладная", "Запасы");
	УПД970_УстановитьВТекстЗапросаСуммуАкциза(Результат, "РасходнаяНакладная", "Запасы");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаРасходнаяНакладная()
	
	ТипДокумента = "РасходнаяНакладная";
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.НомерИсправления КАК НомерИсправления,
	|	ДанныеШапки.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	ДанныеШапки.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.НаименованиеПолное, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДанныеШапки.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НЕ ДанныеШапки.Организация = ДанныеШапки.Организация.ГоловнаяОрганизация
	|			ТОГДА ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Подразделения.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И Подразделения.ГоловнаяОрганизация = ДанныеШапки.Организация
	|			ТОГДА Подразделения.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчет
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетКонтрагента
	|	КОНЕЦ КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ДанныеШапки.Курс КАК КурсВзаиморасчетов,
	|	ДанныеШапки.Кратность КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ИсправлениеОшибки)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Исправление
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК Подразделения
	|		ПО ДанныеШапки.Подразделение = Подразделения.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	ВыражениеАдресДоставкиЗначение = "ДанныеШапки.АдресДоставкиЗначение";
	
	Если НЕ ЕстьРеквизитОбъектаЛок("АдресДоставкиЗначение", Метаданные.Документы.КорректировкаРеализации) Тогда
		 ВыражениеАдресДоставкиЗначение = """"""; // 1.6.27 и ниже
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&АдресДоставкиЗначение", ВыражениеАдресДоставкиЗначение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаКорректировкаРеализации()
	
	ТекстЗапросаЗапасы =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ТипНоменклатурыЗапас
	|			ТОГДА ""Товар""
	|		ИНАЧЕ ""Услуга""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	""Запасы"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок,
	|	ТчЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчЗапасы.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫРАЗИТЬ(ТчЗапасы.Содержание КАК СТРОКА(1000)) КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	ТчЗапасы.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	ТчЗапасы.СерииНоменклатуры КАК СерияНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА ТчЗапасы.СтранаПроисхождения
	|		ИНАЧЕ СпрНоменклатура.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА СтраныМираЗапасы.Код
	|		ИНАЧЕ СтраныМира.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА СтраныМираЗапасы.УчастникЕАЭС
	|		ИНАЧЕ СтраныМира.УчастникЕАЭС
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТчЗапасы.НомерГТД.Код КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И НЕ &ИспользоватьБазовыеЕИ
	|			ТОГДА ТчЗапасы.Количество * ТчЗапасы.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТчЗапасы.Количество
	|	КОНЕЦ КАК Количество,
	|	ТчЗапасы.Цена КАК Цена,
	|	ТчЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ТчЗапасы.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма - ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма + ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	&СуммаАкциза КАК СуммаАкциза,
	|	ТчЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТчЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТчЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ТчЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Запасы КАК ТчЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ПО ТчЗапасы.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчЗапасы.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТчЗапасы.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = СтраныМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМираЗапасы
	|		ПО ТчЗапасы.СтранаПроисхождения = СтраныМираЗапасы.Ссылка
	|ГДЕ
	|	ТчЗапасы.Ссылка = &Ссылка";
	
	ТекстЗапросаУпорядочить = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаЗапасы);
	ТекстыЗапросов.Добавить(ТекстЗапроса_ОбъединитьВсе());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаУслугиДоставкиОбщее("КорректировкаРеализации"));
	ТекстыЗапросов.Добавить(ТекстЗапросаУпорядочить);
	
	Результат = СтрСоединить(ТекстыЗапросов);
	
	ИспользоватьБазовыеЕИ = ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента();
	
	Результат = СтрЗаменить(Результат, "&ИспользоватьБазовыеЕИ", ИспользоватьБазовыеЕИ);
	
	УПД970_УстановитьВТекстЗапросаПрослеживаемыйКомплект(Результат, "КорректировкаРеализации", "Запасы");
	УПД970_УстановитьВТекстЗапросаСуммуАкциза(Результат, "КорректировкаРеализации", "Запасы");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаКорректировкаРеализации()
	
	ТипДокумента = "КорректировкаРеализации";
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаАктВыполненныхРабот()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.НаименованиеПолное, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДанныеШапки.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НЕ ДанныеШапки.Организация = ДанныеШапки.Организация.ГоловнаяОрганизация
	|			ТОГДА ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Подразделения.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И Подразделения.ГоловнаяОрганизация = ДанныеШапки.Организация
	|			ТОГДА Подразделения.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК АдресДоставки,
	|	"""" КАК АдресДоставкиЗначение,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.Контрагент.БанковскийСчетПоУмолчанию КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ДанныеШапки.Курс КАК КурсВзаиморасчетов,
	|	ДанныеШапки.Кратность КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК Подразделения
	|		ПО ДанныеШапки.Подразделение = Подразделения.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаАктВыполненныхРабот()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТчРаботыИУслуги.Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ""Работа""
	|		ИНАЧЕ ""Услуга""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	""РаботыИУслуги"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок,
	|	ТчРаботыИУслуги.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчРаботыИУслуги.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫРАЗИТЬ(ТчРаботыИУслуги.Содержание КАК СТРОКА(1000)) КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	ТчРаботыИУслуги.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	"""" КАК СерияНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ИСТИНА КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ТчРаботыИУслуги.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчРаботыИУслуги.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчРаботыИУслуги.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТчРаботыИУслуги.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчРаботыИУслуги.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчРаботыИУслуги.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ТчРаботыИУслуги.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчРаботыИУслуги.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчРаботыИУслуги.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТчРаботыИУслуги.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И НЕ &ИспользоватьБазовыеЕИ
	|			ТОГДА ТчРаботыИУслуги.Количество * ТчРаботыИУслуги.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТчРаботыИУслуги.Количество
	|	КОНЕЦ КАК Количество,
	|	ТчРаботыИУслуги.Цена КАК Цена,
	|	ТчРаботыИУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТчРаботыИУслуги.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчРаботыИУслуги.Сумма - ТчРаботыИУслуги.СуммаНДС
	|		ИНАЧЕ ТчРаботыИУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчРаботыИУслуги.Сумма + ТчРаботыИУслуги.СуммаНДС
	|		ИНАЧЕ ТчРаботыИУслуги.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	0 КАК СуммаАкциза,
	|	ТчРаботыИУслуги.НомерСтроки КАК НомерСтроки,
	|	ТчРаботыИУслуги.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТчРаботыИУслуги.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ТчРаботыИУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктВыполненныхРабот.РаботыИУслуги КАК ТчРаботыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК ДанныеШапки
	|		ПО ТчРаботыИУслуги.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчРаботыИУслуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТчРаботыИУслуги.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	ТчРаботыИУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ИспользоватьБазовыеЕИ = ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента();
	
	Результат = СтрЗаменить(Результат, "&ИспользоватьБазовыеЕИ", ИспользоватьБазовыеЕИ);
	
	УПД970_УстановитьВТекстЗапросаПрослеживаемыйКомплект(Результат, "АктВыполненныхРабот", "РаботыИУслуги");
	УПД970_УстановитьВТекстЗапросаИдентификаторСтроки(Результат, "АктВыполненныхРабот", "РаботыИУслуги");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаАктВыполненныхРабот()
	
	ТипДокумента = "АктВыполненныхРабот";
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаЗаказПокупателя()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ГоловноеПодразделение,
	|	"""" КАК ПодразделениеКПП,
	|	"""" КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДанныеШапки.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НЕ ДанныеШапки.Организация = ДанныеШапки.Организация.ГоловнаяОрганизация
	|			ТОГДА ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.АдресДоставки КАК АдресДоставки,
	|	ДанныеШапки.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчет
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетКонтрагента
	|	КОНЕЦ КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ДанныеШапки.Курс КАК КурсВзаиморасчетов,
	|	ДанныеШапки.Кратность КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаЗаказПокупателя()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТчЗапасы.Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ""Работа""
	|		КОГДА ТчЗапасы.Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	""Запасы"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок,
	|	ТчЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчЗапасы.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫРАЗИТЬ(ТчЗапасы.Содержание КАК СТРОКА(1000)) КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	ТчЗапасы.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	ТчЗапасы.СерииНоменклатуры КАК СерияНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА ТчЗапасы.СтранаПроисхождения
	|		ИНАЧЕ СпрНоменклатура.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА СтраныМираЗапасы.Код
	|		ИНАЧЕ СтраныМира.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА СтраныМираЗапасы.УчастникЕАЭС
	|		ИНАЧЕ СтраныМира.УчастникЕАЭС
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТчЗапасы.НомерГТД.Код КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И НЕ &ИспользоватьБазовыеЕИ
	|			ТОГДА ТчЗапасы.Количество * ТчЗапасы.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТчЗапасы.Количество
	|	КОНЕЦ КАК Количество,
	|	ТчЗапасы.Цена КАК Цена,
	|	ТчЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ТчЗапасы.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма - ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма + ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	0 КАК СуммаАкциза,
	|	ТчЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТчЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТчЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ТчЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ТчЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ДанныеШапки
	|		ПО ТчЗапасы.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчЗапасы.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТчЗапасы.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = СтраныМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМираЗапасы
	|		ПО ТчЗапасы.СтранаПроисхождения = СтраныМираЗапасы.Ссылка
	|ГДЕ
	|	ТчЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТчРаботы.ТипНоменклатурыУслуга
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Работа""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	""Работы"" КАК ИмяТабличнойЧасти,
	|	2 КАК Порядок,
	|	ТчРаботы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчРаботы.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫРАЗИТЬ(ТчРаботы.Содержание КАК СТРОКА(1000)) КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	ТчРаботы.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	"""" КАК СерияНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ИСТИНА КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТчРаботы.Количество КАК Количество,
	|	ТчРаботы.Цена КАК Цена,
	|	ТчРаботы.СтавкаНДС КАК СтавкаНДС,
	|	ТчРаботы.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчРаботы.Сумма - ТчРаботы.СуммаНДС
	|		ИНАЧЕ ТчРаботы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчРаботы.Сумма + ТчРаботы.СуммаНДС
	|		ИНАЧЕ ТчРаботы.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	0 КАК СуммаАкциза,
	|	ТчРаботы.НомерСтроки КАК НомерСтроки,
	|	ТчРаботы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТчРаботы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ТчРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя.Работы КАК ТчРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ДанныеШапки
	|		ПО ТчРаботы.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчРаботы.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТчРаботы.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	ТчРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ИспользоватьБазовыеЕИ = ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента();
	
	Результат = СтрЗаменить(Результат, "&ИспользоватьБазовыеЕИ", ИспользоватьБазовыеЕИ);
	
	УПД970_УстановитьВТекстЗапросаПрослеживаемыйКомплект(Результат, "ЗаказПокупателя", "Запасы");
	УПД970_УстановитьВТекстЗапросаПрослеживаемыйКомплект(Результат, "ЗаказПокупателя", "Работы");
	УПД970_УстановитьВТекстЗапросаИдентификаторСтроки(Результат, "ЗаказПокупателя", "Работы");
	УПД970_УстановитьВТекстЗапросаПрослеживаемыйТовар(Результат, "ЗаказПокупателя", "Работы");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаЗаказПокупателя()
	
	ТипДокумента = "ЗаказПокупателя";
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитенту()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.НаименованиеПолное, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДанныеШапки.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НЕ ДанныеШапки.Организация = ДанныеШапки.Организация.ГоловнаяОрганизация
	|			ТОГДА ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Подразделения.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И Подразделения.ГоловнаяОрганизация = ДанныеШапки.Организация
	|			ТОГДА Подразделения.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	"""" КАК АдресДоставки,
	|	"""" КАК АдресДоставкиЗначение,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.Контрагент.БанковскийСчетПоУмолчанию КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ДанныеШапки.Курс КАК КурсВзаиморасчетов,
	|	ДанныеШапки.Кратность КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК Подразделения
	|		ПО ДанныеШапки.Подразделение = Подразделения.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаОтчетКомитенту()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Услуга"" КАК ТипНоменклатуры,
	|	""Запасы"" КАК ИмяТабличнойЧасти,
	|	3 КАК Порядок,
	|	1 КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Товар,
	|	""Комиссионное вознаграждение"" КАК ТоварПолноеНаименование,
	|	""Комиссионное вознаграждение"" КАК ТоварНаименование,
	|	"""" КАК ТоварСодержание,
	|	"""" КАК КодИлиАртикулНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	"""" КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	"""" КАК СерияНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Шт) КАК ЕдиницаИзмерения,
	|	""шт."" КАК ЕдиницаИзмеренияНаименование,
	|	""796"" КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	1 КАК Количество,
	|	СУММА(ТчЗапасы.СуммаВознаграждения) КАК Цена,
	|	ДанныеШапки.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	СУММА(ТчЗапасы.СуммаНДСВознаграждения) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.СуммаВознаграждения - ТчЗапасы.СуммаНДСВознаграждения
	|		ИНАЧЕ ТчЗапасы.СуммаВознаграждения
	|	КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.СуммаВознаграждения + ТчЗапасы.СуммаНДСВознаграждения
	|		ИНАЧЕ ТчЗапасы.СуммаВознаграждения
	|	КОНЕЦ) КАК СуммаВсего,
	|	0 КАК СуммаАкциза,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	НЕОПРЕДЕЛЕНО КАК НоменклатураТНВЭД,
	|	ТчЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитенту.Запасы КАК ТчЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК ДанныеШапки
	|		ПО ТчЗапасы.Ссылка = ДанныеШапки.Ссылка
	|ГДЕ
	|	ТчЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеШапки.СтавкаНДСВознаграждения,
	|	ТчЗапасы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионера()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.НаименованиеПолное, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДанныеШапки.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ДанныеШапки.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НЕ ДанныеШапки.Организация = ДанныеШапки.Организация.ГоловнаяОрганизация
	|			ТОГДА ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Подразделения.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И Подразделения.ГоловнаяОрганизация = ДанныеШапки.Организация
	|			ТОГДА Подразделения.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОП,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ДанныеШапки.Контрагент КАК Грузополучатель,
	|	"""" КАК АдресДоставки,
	|	"""" КАК АдресДоставкиЗначение,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.Контрагент.БанковскийСчетПоУмолчанию КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ДанныеШапки.Курс КАК КурсВзаиморасчетов,
	|	ДанныеШапки.Кратность КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК Подразделения
	|		ПО ДанныеШапки.Подразделение = Подразделения.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаОтчетКомиссионера()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товар"" КАК ТипНоменклатуры,
	|	""Запасы"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок,
	|	ТчЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчЗапасы.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	"""" КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	ТчЗапасы.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	ТчЗапасы.СерииНоменклатуры КАК СерияНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА ТчЗапасы.СтранаПроисхождения
	|		ИНАЧЕ СпрНоменклатура.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА СтраныМираЗапасы.Код
	|		ИНАЧЕ СтраныМира.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА СтраныМираЗапасы.УчастникЕАЭС
	|		ИНАЧЕ СтраныМира.УчастникЕАЭС
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТчЗапасы.НомерГТД.Код КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТчЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И НЕ &ИспользоватьБазовыеЕИ
	|			ТОГДА ТчЗапасы.Количество * ТчЗапасы.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТчЗапасы.Количество
	|	КОНЕЦ КАК Количество,
	|	ТчЗапасы.Цена КАК Цена,
	|	ТчЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ТчЗапасы.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма - ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчЗапасы.Сумма + ТчЗапасы.СуммаНДС
	|		ИНАЧЕ ТчЗапасы.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	0 КАК СуммаАкциза,
	|	ТчЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТчЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТчЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ТчЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ТчЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ТчПокупатели
	|		ПО ТчЗапасы.Ссылка = ТчПокупатели.Ссылка
	|			И ТчЗапасы.КлючСвязи = ТчПокупатели.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера КАК ДанныеШапки
	|		ПО ТчЗапасы.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчЗапасы.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТчЗапасы.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = СтраныМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМираЗапасы
	|		ПО ТчЗапасы.СтранаПроисхождения = СтраныМираЗапасы.Ссылка
	|ГДЕ
	|	ТчЗапасы.Ссылка = &Ссылка
	|	И ТчПокупатели.СчетФактура = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ИспользоватьБазовыеЕИ = ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента();
	
	Результат = СтрЗаменить(Результат, "&ИспользоватьБазовыеЕИ", ИспользоватьБазовыеЕИ);
	
	УПД970_УстановитьВТекстЗапросаПрослеживаемыйКомплект(Результат, "ОтчетКомиссионера", "Запасы");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаОтчетКомиссионера()
	
	ТипДокумента = "ОтчетКомиссионера";
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенияОПокупателеДокументаОтчетКомиссионера()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Покупатель КАК Покупатель,
	|	Т.ДатаСФ КАК ДатаСФ
	|ИЗ
	|	Документ.ОтчетКомиссионера.Покупатели КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|	И Т.СчетФактура = &СчетФактура";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетОПереработке()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеШапки.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.НаименованиеПолное, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДанныеШапки.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДанныеШапки.Контрагент
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель.ГоловнойКонтрагент = ДанныеШапки.Контрагент ТОГДА
	|			ЕСТЬNULL(ДанныеШапки.Грузополучатель.КПП, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеШапки.Контрагент.КПП, """")
	|	КОНЕЦ КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И НЕ ДанныеШапки.Организация = ДанныеШапки.Организация.ГоловнаяОрганизация
	|			ТОГДА ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Подразделения.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И Подразделения.ГоловнаяОрганизация = ДанныеШапки.Организация
	|			ТОГДА Подразделения.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчет
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.БанковскийСчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ДанныеШапки.БанковскийСчетКонтрагента
	|	КОНЕЦ КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ДанныеШапки.Курс КАК КурсВзаиморасчетов,
	|	ДанныеШапки.Кратность КАК КратностьВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаДоговора КАК ДоговорДата,
	|	ДоговорыКонтрагентов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.ОтчетОПереработке КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ДанныеШапки.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК Подразделения
	|		ПО ДанныеШапки.Подразделение = Подразделения.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	ВыражениеАдресДоставкиЗначение = "ДанныеШапки.АдресДоставкиЗначение";
	
	Если НЕ ЕстьРеквизитОбъектаЛок("АдресДоставкиЗначение", Метаданные.Документы.КорректировкаРеализации) Тогда
		 ВыражениеАдресДоставкиЗначение = """"""; // 1.6.26 и ниже
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&АдресДоставкиЗначение", ВыражениеАдресДоставкиЗначение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаОтчетОПереработке()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товар"" КАК ТипНоменклатуры,
	|	""Продукция"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок,
	|	3 КАК ИдентификаторСтроки,
	|	ТчПродукция.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	"""" КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	ТчПродукция.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	ТчПродукция.СерииНоменклатуры КАК СерияНоменклатурыНаименование,
	|	СпрНоменклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ) КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ТчПродукция.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчПродукция.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчПродукция.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТчПродукция.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчПродукция.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчПродукция.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ТчПродукция.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И ТчПродукция.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТчПродукция.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТчПродукция.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И НЕ &ИспользоватьБазовыеЕИ
	|			ТОГДА ТчПродукция.Количество * ТчПродукция.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ ТчПродукция.Количество
	|	КОНЕЦ КАК Количество,
	|	ТчПродукция.Цена КАК Цена,
	|	ТчПродукция.СтавкаНДС КАК СтавкаНДС,
	|	ТчПродукция.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчПродукция.Сумма - ТчПродукция.СуммаНДС
	|		ИНАЧЕ ТчПродукция.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчПродукция.Сумма + ТчПродукция.СуммаНДС
	|		ИНАЧЕ ТчПродукция.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	НЕОПРЕДЕЛЕНО КАК СуммаАкциза,
	|	ТчПродукция.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ТчПродукция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетОПереработке.Продукция КАК ТчПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОПереработке КАК ДанныеШапки
	|		ПО ТчПродукция.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчПродукция.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТчПродукция.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	ТчПродукция.Ссылка = &Ссылка";
	
	ИспользоватьБазовыеЕИ = ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента();
	
	Результат = СтрЗаменить(Результат, "&ИспользоватьБазовыеЕИ", ИспользоватьБазовыеЕИ);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее(ТипДокумента)
	
	Результат =
	"ВЫБРАТЬ
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СведенияПрослеживаемости.Количество КАК Количество,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	&ПрослеживаемостьСтрана КАК СтранаПроисхождения,
	|	&ПрослеживаемостьСтранаКод КАК СтранаПроисхожденияКод,
	|	&ПрослеживаемостьСтранаУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	&НоменклатураТНВЭД КАК НоменклатураТНВЭД,
	|	&СведенияПрослеживаемостиСумма КАК Сумма,
	|	НомераГТД.Код КАК НомерРНПТ,
	|	""Прослеж"" КАК НомерГТД
	|ИЗ
	|	Документ.РасходнаяНакладная.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
	|
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка";
	
	БазовыйТипДокумента = "РасходнаяНакладная";
	Результат = СтрЗаменить(Результат, БазовыйТипДокумента, ТипДокумента);
	
	УПД970_УстановитьВТекстЗапросаСведенияПрослеживаемостиСтрана(Результат, ТипДокумента);
	УПД970_УстановитьВТекстЗапросаСведенияПрослеживаемостиСумма(Результат, ТипДокумента);
	УПД970_УстановитьВТекстЗапросаСведенияПрослеживаемостиТНВЭД(Результат, ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаУслугиДоставкиОбщее(ТипДокумента)
	
	Результат = "
	|ВЫБРАТЬ
	|	""Услуга"" КАК ТипНоменклатуры,
	|	""Запасы"" КАК ИмяТабличнойЧасти,
	|	2 КАК Порядок,
	|	0 КАК ИдентификаторСтроки,
	|	ДанныеШапки.НоменклатураДоставки КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	"""" КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	"""" КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	"""" КАК СерияНоменклатурыНаименование,
	|	СпрНоменклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	СтраныМира.Код КАК СтранаПроисхожденияКод,
	|	СтраныМира.УчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	1 КАК Количество,
	|	ДанныеШапки.СтоимостьДоставки КАК Цена,
	|	ДанныеШапки.СтавкаНДСДоставки КАК СтавкаНДС,
	|	ДанныеШапки.СуммаНДСДоставки КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ДанныеШапки.СтоимостьДоставки - ДанныеШапки.СуммаНДСДоставки
	|		ИНАЧЕ ДанныеШапки.СтоимостьДоставки
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ДанныеШапки.СтоимостьДоставки + ДанныеШапки.СуммаНДСДоставки
	|		ИНАЧЕ ДанныеШапки.СтоимостьДоставки
	|	КОНЕЦ КАК СуммаВсего,
	|	"""" КАК СуммаАкциза,
	|	0 КАК НомерСтроки,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.ТоварнаяНоменклатураВЭД КАК НоменклатураТНВЭД,
	|	ДанныеШапки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ДанныеШапки.НоменклатураДоставки = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = СтраныМира.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка
	|	И ДанныеШапки.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И &ВыводитьБесплатнуюДоставку";
	
	БазовыйТипДокумента = "РасходнаяНакладная";
	Результат = СтрЗаменить(Результат, БазовыйТипДокумента, ТипДокумента);
	
	ЗначениеКонстанты = Константы.ВариантПечатиДоставки.Получить();
	Если ЗначениеКонстанты = Перечисления.ВариантыПечатиДоставки.НеВыводитьБесплатнуюДоставку Тогда
		ВыводитьБесплатнуюДоставку = "ДанныеШапки.СтоимостьДоставки > 0";
	Иначе
		ВыводитьБесплатнуюДоставку = "ИСТИНА";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ВыводитьБесплатнуюДоставку", ВыводитьБесплатнуюДоставку);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныеПоДокументуПеремещениеЗапасов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.Организация КАК Организация,
	|	Т.СтруктурнаяЕдиница КАК ПодразделениеОтправитель,
	|	Т.СтруктурнаяЕдиницаПолучатель КАК ПодразделениеПолучатель,
	|	Т.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК Т
	|ГДЕ
	|	Т.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Дата,
	|	Т.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.ВидЦен.ВалютаЦены КАК ВалютаЦены,
	|	Т.ВидЦен КАК ВидЦен,
	|	Т.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатурыСрезПоследних
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|		&ДатаДокумента,
	|		Номенклатура В (&СписокНоменклатура)
	|			И Характеристика В (&СписокХарактеристика)
	|			И ВидЦен = &ВидЦен) КАК Т;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Валюта КАК Валюта,
	|	Т.Курс КАК Курс,
	|	Т.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_КурсыУпрВалюты
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|		&ДатаДокумента,
	|		Валюта В
	|			(ВЫБРАТЬ
	|				Константы.ВалютаУчета КАК ВалютаУчета
	|			ИЗ
	|				Константы КАК Константы)) КАК Т;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Валюта КАК Валюта,
	|	Т.Курс КАК Курс,
	|	Т.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_КурсыЦенВалюты
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|		&ДатаДокумента,
	|		Валюта В
	|			(ВЫБРАТЬ
	|				ЦеныНоменклатурыСрезПоследних.ВалютаЦены КАК ВалютаЦены
	|			ИЗ
	|				ВТ_ЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних)) КАК Т;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товар"" КАК ТипНоменклатуры,
	|	Запасы.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	"""" КАК ТоварСодержание,
	|	ВЫБОР
	|		КОГДА &ПредставлениеКодовВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.КодыНоменклатурыВДокументах.Артикул)
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	Запасы.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	Запасы.СерииНоменклатуры КАК СерияНоменклатурыНаименование,
	|	Запасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЕСТЬNULL(Запасы.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(Запасы.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ) КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И НЕ &ИспользоватьБазовыеЕИ
	|			ТОГДА Запасы.Количество * Запасы.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ Запасы.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И &ИспользоватьБазовыеЕИ
	|				И Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код, """")
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * Запасы.Количество * КурсыЦенВалюты.Курс * КурсыУпрВалюты.Кратность /
	|		(КурсыУпрВалюты.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2)), 0) КАК Сумма,
	|	Запасы.ИдентификаторСтроки КАК НомерСтроки,
	|	Запасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК Запасы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Запасы.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО Запасы.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО Запасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И Запасы.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			И Запасы.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыУпрВалюты КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыЦенВалюты КАК КурсыЦенВалюты
	|		ПО ЦеныНоменклатурыСрезПоследних.ВалютаЦены = КурсыЦенВалюты.Валюта
	|ГДЕ
	|	Запасы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_УстановитьВТекстЗапросаНомерСчетФактуры(ТекстЗапроса)
	
	МетаданныеСчетФактура = Метаданные.Документы.СчетФактура;
	
	Если Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеСчетФактура, "НомерНаПечать") Тогда
		
		НомерСчетФактуры = 
		"ВЫБОР
		|		КОГДА ДЛИНАСТРОКИ(СчетФактура.НомерНаПечать) > 0
		|			ТОГДА СчетФактура.НомерНаПечать
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ";
		
		НомерИсправляемогоСчетФактуры =
		"ВЫБОР
		|		КОГДА ДЛИНАСТРОКИ(ВЫРАЗИТЬ(СчетФактура.ИсправляемыйСчетФактура КАК Документ.СчетФактура).НомерНаПечать) > 0
		|			ТОГДА ВЫРАЗИТЬ(СчетФактура.ИсправляемыйСчетФактура КАК Документ.СчетФактура).НомерНаПечать
		|		ИНАЧЕ ВЫРАЗИТЬ(СчетФактура.ИсправляемыйСчетФактура КАК Документ.СчетФактура).Номер
		|	КОНЕЦ";
		
	Иначе
		НомерСчетФактуры = "СчетФактура.Номер";
		НомерИсправляемогоСчетФактуры = "ВЫРАЗИТЬ(СчетФактура.ИсправляемыйСчетФактура КАК Документ.СчетФактура).Номер";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НомерСчетФактуры", НомерСчетФактуры);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НомерИсправляемогоСчетФактуры", НомерИсправляемогоСчетФактуры);
	
КонецПроцедуры

Процедура УПД970_УстановитьВТекстЗапросаПрослеживаемыйКомплект(ТекстЗапроса, ТипДокумента, ИмяТабЧасти)
	
	МетаданныеТабЧасти = Метаданные.Документы[ТипДокумента].ТабличныеЧасти[ИмяТабЧасти];
	
	Если НЕ Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеТабЧасти, "ПрослеживаемыйКомплект") Тогда
		ЗаменяемоеПоле = СтрШаблон("Тч%1.ПрослеживаемыйКомплект", ИмяТабЧасти);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЗаменяемоеПоле, "Ложь");
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_УстановитьВТекстЗапросаПрослеживаемыйТовар(ТекстЗапроса, ТипДокумента, ИмяТабЧасти)
	
	МетаданныеТабЧасти = Метаданные.Документы[ТипДокумента].ТабличныеЧасти[ИмяТабЧасти];
	
	Если НЕ Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеТабЧасти, "ПрослеживаемыйТовар") Тогда
		ЗаменяемоеПоле = СтрШаблон("Тч%1.ПрослеживаемыйТовар", ИмяТабЧасти);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЗаменяемоеПоле, "Ложь");
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_УстановитьВТекстЗапросаИдентификаторСтроки(ТекстЗапроса, ТипДокумента, ИмяТабЧасти)
	
	МетаданныеТабЧасти = Метаданные.Документы[ТипДокумента].ТабличныеЧасти[ИмяТабЧасти];
	
	Если НЕ Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеТабЧасти, "ИдентификаторСтроки") Тогда
		ЗаменяемоеПоле = СтрШаблон("Тч%1.ИдентификаторСтроки", ИмяТабЧасти);
		ЗаменяющееПоле = СтрШаблон("Тч%1.НомерСтроки", ИмяТабЧасти);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЗаменяемоеПоле, ЗаменяющееПоле);
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_УстановитьВТекстЗапросаСведенияПрослеживаемостиСтрана(ТекстЗапроса, ТипДокумента)
	
	МетаданныеПрослеживаемости = Метаданные.Документы[ТипДокумента].ТабличныеЧасти.СведенияПрослеживаемости;
	
	ЕстьСтрана = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеПрослеживаемости, "СтранаПроисхождения");
	ЕстьНоменклатура = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеПрослеживаемости, "Номенклатура");
	
	Если ЕстьСтрана И ЕстьНоменклатура Тогда
		ПрослеживаемостьСтрана = "ВЫБОР
			|		КОГДА СведенияПрослеживаемости.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
			|			ТОГДА СведенияПрослеживаемости.СтранаПроисхождения
			|		ИНАЧЕ СведенияПрослеживаемости.Номенклатура.СтранаПроисхождения
			|	КОНЕЦ";
		ПрослеживаемостьСтранаКод = "ВЫБОР
			|		КОГДА СведенияПрослеживаемости.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
			|			ТОГДА СведенияПрослеживаемости.СтранаПроисхождения.Код
			|		ИНАЧЕ СведенияПрослеживаемости.Номенклатура.СтранаПроисхождения.Код
			|	КОНЕЦ";
		ПрослеживаемостьСтранаУчастникЕАЭС = "ВЫБОР
			|		КОГДА СведенияПрослеживаемости.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
			|			ТОГДА СведенияПрослеживаемости.СтранаПроисхождения.УчастникЕАЭС
			|		ИНАЧЕ СведенияПрослеживаемости.Номенклатура.СтранаПроисхождения.УчастникЕАЭС
			|	КОНЕЦ";
	ИначеЕсли ЕстьНоменклатура Тогда
		ПрослеживаемостьСтрана = "СведенияПрослеживаемости.Номенклатура.СтранаПроисхождения";
		ПрослеживаемостьСтранаКод = "СведенияПрослеживаемости.Номенклатура.СтранаПроисхождения.Код";
		ПрослеживаемостьСтранаУчастникЕАЭС = "СведенияПрослеживаемости.Номенклатура.СтранаПроисхождения.УчастникЕАЭС";
	Иначе
		ПрослеживаемостьСтрана = "НЕОПРЕДЕЛЕНО";
		ПрослеживаемостьСтранаКод = """""";
		ПрослеживаемостьСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПрослеживаемостьСтранаУчастникЕАЭС", ПрослеживаемостьСтранаУчастникЕАЭС);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПрослеживаемостьСтранаКод", ПрослеживаемостьСтранаКод);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПрослеживаемостьСтрана", ПрослеживаемостьСтрана);
	
КонецПроцедуры

Процедура УПД970_УстановитьВТекстЗапросаСведенияПрослеживаемостиСумма(ТекстЗапроса, ТипДокумента)
	
	МетаданныеПрослеживаемости = Метаданные.Документы[ТипДокумента].ТабличныеЧасти.СведенияПрослеживаемости;
	
	Если Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеПрослеживаемости, "Сумма") Тогда
		СведенияПрослеживаемостиСумма = "СведенияПрослеживаемости.Сумма";
	Иначе
		СведенияПрослеживаемостиСумма = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СведенияПрослеживаемостиСумма", СведенияПрослеживаемостиСумма);
	
КонецПроцедуры

Процедура УПД970_УстановитьВТекстЗапросаСведенияПрослеживаемостиТНВЭД(ТекстЗапроса, ТипДокумента)
	
	МетаданныеПрослеживаемости = Метаданные.Документы[ТипДокумента].ТабличныеЧасти.СведенияПрослеживаемости;
	
	ЕстьНоменклатура = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеПрослеживаемости, "Номенклатура");
	
	Если ЕстьНоменклатура Тогда
		
		НоменклатураТНВЭД = "СведенияПрослеживаемости.Номенклатура.ТоварнаяНоменклатураВЭД";
		
	Иначе
		
		НоменклатураТНВЭД = "НЕОПРЕДЕЛЕНО";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НоменклатураТНВЭД", НоменклатураТНВЭД);
	
КонецПроцедуры

Процедура УПД970_УстановитьВТекстЗапросаСуммуАкциза(ТекстЗапроса, ТипДокумента, ИмяТабЧасти)
	
	ЗаменяемоеПоле = "&СуммаАкциза";
	МетаданныеТабЧасти = Метаданные.Документы[ТипДокумента].ТабличныеЧасти[ИмяТабЧасти];
	
	Если Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеТабЧасти, "СуммаАкциза") Тогда
		
		Если Ядро.Общее_ЕстьРеквизитМетаданных(Метаданные.Справочники.Номенклатура, "ПодакцизныйТовар") Тогда
			ШаблонЗаменяющегоПоля = 
			"ВЫБОР
			|		КОГДА СпрНоменклатура.ПодакцизныйТовар
			|			ТОГДА Тч%1.СуммаАкциза
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ";
		Иначе
			ШаблонЗаменяющегоПоля = "Тч%1.СуммаАкциза";
		КонецЕсли;
		
		ЗаменяющееПоле = СтрШаблон(ШаблонЗаменяющегоПоля, ИмяТабЧасти);
		
	Иначе
		ЗаменяющееПоле = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЗаменяемоеПоле, ЗаменяющееПоле);
	
КонецПроцедуры

//} УПД970. Исходные данные по документам. Тексты запросов

//} УПД970. Исходные данные по документам

//{ УПД970. Служебные процедуры и функции

Функция УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента)
	
	Результат = Неопределено;
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		Результат = УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу);
		
	Иначе
		
		Результат = УПД970_ОбстоятельстваФормированияУПД(ДанныеПоДокументу);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияУПД(ДанныеПоДокументу)
	
	Результат = Неопределено;
	
	Если ДанныеПоДокументу.ЭтоДоговорСКомиссионером Тогда
		Результат = "00005";
	КонецЕсли;
	
	Если ДанныеПоДокументу.ЭтоДоговорСКомитентом Тогда
		Результат = "00007";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу)
	
	Перем Результат;
	
	ЭтоПродажа = ДанныеПоДокументу.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Продажа;
	ЭтоКомиссионнаяТорговля = (ДанныеПоДокументу.ЭтоДоговорСКомитентом Или ДанныеПоДокументу.ЭтоДоговорСКомиссионером);
	
	Если ДанныеПоДокументу.ЭтоСчетФактураНаАванс Тогда
		Результат = "2";
	ИначеЕсли ЭтоПродажа И ЭтоКомиссионнаяТорговля Тогда
		Результат = "1";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументыОснования)
	
	Результат = Новый Массив;
	
	Для Каждого ДокументОснования Из ДокументыОснования Цикл
		
		ДоговорДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснования, "Договор");
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорДокумента, "НомерДоговора, ДатаДоговора");
		
		РеквизитыОснования = Новый Структура;
		РеквизитыОснования.Вставить("Наименование", "Договор");
		РеквизитыОснования.Вставить("Номер", РеквизитыДоговора.НомерДоговора);
		РеквизитыОснования.Вставить("Дата", РеквизитыДоговора.ДатаДоговора);
		
		Результат.Добавить(РеквизитыОснования);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования)
	
	ОбязательныеРеквизитыЗаполнены = (РеквизитыОснования <> Неопределено
		И ЗначениеЗаполнено(РеквизитыОснования.Наименование)
		И ЗначениеЗаполнено(РеквизитыОснования.Номер)
		И ЗначениеЗаполнено(РеквизитыОснования.Дата));
	
	Возврат ОбязательныеРеквизитыЗаполнены;
	
КонецФункции

Функция УПД970_СведенияОбУчастникахЭДО(ДанныеШапки)
	
	// Продавец
	
	Если ЗначениеЗаполнено(ДанныеШапки.ГоловнаяОрганизация)
		И ДанныеШапки.Организация <> ДанныеШапки.ГоловнаяОрганизация Тогда
		ЭтоОПНаОтдельномБалансе = Истина;
	Иначе
		ЭтоОПНаОтдельномБалансе = Ложь;
	КонецЕсли;
	
	ЭтоОПНаОбщемБалансе = ЗначениеЗаполнено(ДанныеШапки.ГоловноеПодразделение);
	
	Если ЭтоОПНаОтдельномБалансе Тогда
		Организация = ДанныеШапки.ГоловнаяОрганизация;
	Иначе
		Организация = ДанныеШапки.Организация;
	КонецЕсли;
	
	СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Организация,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетОрганизации
	);
	
	Если ЭтоОПНаОтдельномБалансе Тогда
		КППОрганизации = ДанныеШапки.ОрганизацияКПП;
	ИначеЕсли ЭтоОПНаОбщемБалансе Тогда
		КППОрганизации = ДанныеШапки.ПодразделениеКПП;
	Иначе
		КППОрганизации = СведенияОбОрганизации.КПП;
	КонецЕсли;
	
	СведенияОбОрганизации.КПП = КППОрганизации;
	
	// Покупатель
	Если ЗначениеЗаполнено(ДанныеШапки.ГоловнойКонтрагент) Тогда
		Контрагент = ДанныеШапки.ГоловнойКонтрагент;
	Иначе
		Контрагент = ДанныеШапки.Контрагент;
	КонецЕсли;
	
	СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Контрагент,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетКонтрагента
	);
	
	Если ЗначениеЗаполнено(ДанныеШапки.КонтрагентКПП) Тогда
		СведенияОКонтрагенте.КПП = ДанныеШапки.КонтрагентКПП;
	КонецЕсли;
	
	// Грузоотправитель
	Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузоотправитель,
			ДанныеШапки.Дата
		);
		
	ИначеЕсли ЭтоОПНаОтдельномБалансе Тогда
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Организация,
			ДанныеШапки.Дата
		);
		
	ИначеЕсли ЭтоОПНаОбщемБалансе Тогда
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДО(ДанныеШапки.Организация, ДанныеШапки.Дата);
		
		СведенияОГрузоотправителе.Ссылка = ДанныеШапки.Подразделение;
		СведенияОГрузоотправителе.Адрес = УПД970_СведенияОФактическомАдресе(ДанныеШапки.Подразделение, ДанныеШапки.Дата);
		СведенияОГрузоотправителе.Наименование = ДанныеШапки.ПодразделениеНаименование;
		СведенияОГрузоотправителе.КПП = ДанныеШапки.ПодразделениеКПП;
		
	Иначе
		
		СведенияОГрузоотправителе = Неопределено;
		
	КонецЕсли;
	
	// Грузополучатель
	СведенияОГрузополучателе = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		
		СведенияОГрузополучателе = УПД970_ДанныеГрузополучателя(
			ДанныеШапки.Грузополучатель,
			ДанныеШапки.Дата,
			ДанныеШапки.АдресДоставки,
			ДанныеШапки.АдресДоставкиЗначение
		);
		
	КонецЕсли;
	
	Результат = УПД970_Контракт_УчастникиЭДО();
	Результат.Организация = СведенияОбОрганизации;
	Результат.Контрагент = СведенияОКонтрагенте;
	Результат.Грузоотправитель = СведенияОГрузоотправителе;
	Результат.Грузополучатель = СведенияОГрузополучателе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсЮрАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсФактАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_Контракт_ДанныеУчастникаЭДО();
	
	МодульЭлектронныеДокументы = ОбщийМодульПоИмениЛок("УправлениеНебольшойФирмойЭлектронныеДокументыСервер");
	
	СведенияОЮрФизЛице = МодульЭлектронныеДокументы.ПолучитьДанныеЮрФизЛица(Ссылка, ДатаСведений, БанковскийСчет);
	
	Результат.Ссылка = Ссылка;
	
	Результат.Наименование = СведенияОЮрФизЛице.ПолноеНаименование;
	Результат.ИНН = СведенияОЮрФизЛице.ИНН;
	Результат.КПП = СведенияОЮрФизЛице.КПП;
	Результат.КодПоОКПО = СведенияОЮрФизЛице.КодПоОКПО;
	
	Если ЗначениеЗаполнено(СведенияОЮрФизЛице.Банк) Тогда
		Результат.НаименованиеБанка = СведенияОЮрФизЛице.Банк.Наименование;
	Иначе
		Результат.НаименованиеБанка = "";
	КонецЕсли;
	
	Результат.НомерСчета = СведенияОЮрФизЛице.НомерСчета;
	Результат.КоррСчет = СведенияОЮрФизЛице.КоррСчет;
	Результат.БИК = СведенияОЮрФизЛице.БИК;
	Результат.Телефоны = СведенияОЮрФизЛице.Телефоны;
	Результат.ЭлектроннаяПочта = СведенияОЮрФизЛице.ЭлектроннаяПочта;
	Результат.ЭтоЮрЛицо = (СведенияОЮрФизЛице.ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	
	Если СведенияОЮрФизЛице.Свойство("ВидКонтрагента") Тогда
		Результат.ЭтоФизЛицо = (СведенияОЮрФизЛице.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
	Иначе
		Результат.ЭтоФизЛицо = Ложь;
	КонецЕсли;
	
	Если СведенияОЮрФизЛице.ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		Если СведенияОЮрФизЛице.Свойство("ОГРН") Тогда
			ОГРНИП = СведенияОЮрФизЛице.ОГРН;
		ИначеЕсли Ссылка.Метаданные().Реквизиты.Найти("ОГРН") <> Неопределено Тогда
			ОГРНИП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ОГРН");
		ИначеЕсли Ссылка.Метаданные().Реквизиты.Найти("РегистрационныйНомер") <> Неопределено Тогда
			ОГРНИП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "РегистрационныйНомер");
		Иначе
			ОГРНИП = "";
		КонецЕсли;
		
		Результат.ОГРНИП = ОГРНИП;
		
		Если Ссылка.Метаданные().Реквизиты.Найти("ДатаРегистрации") <> Неопределено Тогда
			Результат.ДатаОГРНИП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаРегистрации");
		КонецЕсли;
		
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			Результат.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НаименованиеПолное");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОЮрФизЛице.СтранаРегистрации) Тогда
		ДанныеСтраны = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СведенияОЮрФизЛице.СтранаРегистрации, "Код, Наименование");
		
		Результат.СтранаКод = ДанныеСтраны.Код;
		Результат.СтранаНаименование = ДанныеСтраны.Наименование;
	Иначе
		Результат.СтранаКод = ОсновнаяСтрана().Код;
		Результат.СтранаНаименование = ОсновнаяСтрана().Наименование;
	КонецЕсли;
	
	Если Результат.СтранаКод <> ОсновнаяСтрана().Код Тогда
		Результат.Нерезидент = Истина;
		
		СведенияОЮрФизЛице.Свойство("РегистрационныйНомер", Результат.НалоговыйНомерВСтранеРегистрации);
	Иначе
		Результат.Нерезидент = Ложь;
	КонецЕсли;
	
	Результат.Свидетельство = УПД970_СвидетельствоОГосРегистрации(
		СведенияОЮрФизЛице.СвидетельствоСерияНомер,
		СведенияОЮрФизЛице.СвидетельствоДатаВыдачи
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СвидетельствоОГосРегистрации(СвидетельствоСерияНомер, СвидетельствоДатаВыдачи)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СвидетельствоСерияНомер) Тогда
		Результат = "свидетельство " + СвидетельствоСерияНомер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвидетельствоДатаВыдачи) Тогда
		Результат = Результат + " от " + Формат(СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеГрузополучателя(Ссылка, ДатаСведений, АдресДоставки, АдресДоставкиЗначение)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений);
	
	СведенияОбАдресе = УПД970_СведенияОбАдресеДоставки(
		АдресДоставки,
		АдресДоставкиЗначение);
		
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений);
	КонецЕсли;
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеДоставки(АдресДоставки, АдресДоставкиЗначение)

	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(АдресДоставки) Тогда
		
		Если ЗначениеЗаполнено(АдресДоставкиЗначение) Тогда
			Результат = УПД970_СведенияОбАдресе(АдресДоставкиЗначение);
		КонецЕсли;
		
		ПредставлениеАдресаПоJSON = УПД970_ПредставлениеАдресаИзСтруктуры(Результат);
		
		ПредставленияАдресаРазличаются = (НРег(АдресДоставки) <> НРег(ПредставлениеАдресаПоJSON));
		
		СведенияОбАдресеПоПредставлениюИзДокумента = (Не ЗначениеЗаполнено(Результат)
			Или ПредставленияАдресаРазличаются);
			
		Если СведенияОбАдресеПоПредставлениюИзДокумента Тогда
			
			МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
			
			АдресСтрокойJSON = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
				АдресДоставки,
				ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес")
			);
			
			Результат = УПД970_СведенияОбАдресе(АдресСтрокойJSON);
			
			Результат.Представление = АдресДоставки;
			Результат.ТипАдреса = ТипАдресаВСвободнойФорме();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресе(АдресСтрокойJSON)
	
	Перем Результат;
	
	Если Не ЗначениеЗаполнено(АдресСтрокойJSON) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СведенияОбАдресеЛок(АдресСтрокойJSON);
	
	СохраненноеПредставление = ПредставлениеАдреса(АдресСтрокойJSON);
	Результат.Вставить("СохраненноеПредставление", СохраненноеПредставление);
	
	ЭтоАдминистративноТерриториальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressRF(Результат);
	
	ЭтоМуниципальныйАдрес = Ложь;
	Если Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		ЭтоМуниципальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressSAR(Результат);
	КонецЕсли;
	
	Если Не ЭтоМуниципальныйАдрес
		И Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		
		Результат.Представление = Результат.СохраненноеПредставление;
		Результат.ТипАдреса = ТипАдресаВСвободнойФорме();
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ПредставлениеАдресаИзСтруктуры(СведенияОбАдресе)
	
	Перем Результат;
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		Результат = СвойствоСтруктурыЛок(СведенияОбАдресе, "МуниципальноеПредставление");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СведенияОбАдресе.Представление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений)
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	Результат = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ЮридическийАдрес, ДатаСведений);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений)
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	Результат = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ФактическийАдрес, ДатаСведений);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидАдреса, ДатаСведений)
	
	Результат = Неопределено;
	
	ВидКИ = ВидАдресаЮрФизЛица(Ссылка, ВидАдреса);
	ТолькоПредставлениеКИ = Ложь;
	
	МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	
	КонтактнаяИнформация = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Ссылка,
		ВидКИ,
		ДатаСведений,
		ТолькоПредставлениеКИ
	);
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
		
		АдресСтрокойJSON = КонтактнаяИнформация[0].Значение;
		
		Результат = УПД970_СведенияОбАдресе(АдресСтрокойJSON);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressRF(СведенияОбАдресе)
	
	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	ЭтоКодГородаФедеральногоЗначения = УПД970_ЭтоКодГородаФедеральногоЗначения(СведенияОбАдресе.КодРегиона);
	
	ПомещенияНеЗаполнены = (СведенияОбАдресе.Помещения.Количество() = 0);
	ТипПомещенияСоответствуетАдрРФ = (СведенияОбАдресе.Помещения.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Помещения[0].ТипПомещения) = ВРЕГ(ТипПомещенияАдрРФ()));
		
	ПомещенияСоответствуютАдрРФ = (ПомещенияНеЗаполнены Или ТипПомещенияСоответствуетАдрРФ);
	
	КорпусаНеЗаполнены = (СведенияОбАдресе.Корпуса.Количество() = 0);
	ТипКорпусаСоответствуетАдрРФ = (СведенияОбАдресе.Корпуса.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Корпуса[0].ТипКорпуса) = ВРЕГ(ТипКорпусаАдрРФ()));
		
	КорпусаСоответствуютАдрРФ = (КорпусаНеЗаполнены Или ТипКорпусаСоответствуетАдрРФ);
		
	ТипЗданияСоответствуетАдрРФ = Не ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания)
		Или ВРЕГ(СведенияОбАдресе.Здание.ТипЗдания) = ВРЕГ(ТипЗданияАдрРФ());
		
	АдресНеСоответствуетСтруктуреАдрРФ = ЕстьНесоответствующиеСтруктуреАдрРФПоля(СведенияОбАдресе);
		
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	ПредставленияАдресаСовпадают = (ПредставлениеАдреса = СведенияОбАдресе.СохраненноеПредставление);

	Результат = ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса)
		И ЕстьКодРегиона
		И ПомещенияСоответствуютАдрРФ
		И КорпусаСоответствуютАдрРФ
		И ТипЗданияСоответствуетАдрРФ
		И ПредставленияАдресаСовпадают
		И Не АдресНеСоответствуетСтруктуреАдрРФ
		И Не ЭтоКодГородаФедеральногоЗначения;

	Возврат Результат;
	
КонецФункции

Функция УПД970_ЭтоКодГородаФедеральногоЗначения(КодРегиона)

	КодыРегионов = Новый Массив;
	КодыРегионов.Добавить("77"); // г. Москва
	КодыРегионов.Добавить("78"); // г. Санкт-Петербург
	КодыРегионов.Добавить("92"); // г. Севастополь
	КодыРегионов.Добавить("99"); // иные территории, включая город и космодром Байконур

	Результат = (КодыРегионов.Найти(КодРегиона) <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressSAR(СведенияОбАдресе)
	
	Результат = Ложь;
	
	Если Не ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	ЕстьНаименованиеМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.МуниципальныйРайон);
	
	ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.КодМуниципальногоРайона);
	Если Не ЕстьКодМуниципальногоРайона Тогда
		КодМуниципальногоРайона = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
		ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(КодМуниципальногоРайона);
	КонецЕсли;
	
	ЕстьИдентификаторАдресногоОбъекта = ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторАдресногоОбъекта);
	
	ЕстьНесколькоТиповПомещений = УПД970_АдресСодержитНесколькоТиповПомещений(СведенияОбАдресе);
	ЕстьНесколькоТиповАпартаментов = УПД970_АдресСодержитНесколькоТиповАпартаментов(СведенияОбАдресе);
	
	МуниципальноеПредставление = СвойствоСтруктурыЛок(СведенияОбАдресе, "МуниципальноеПредставление");
	ПредставленияАдресаСовпадают = (МуниципальноеПредставление = СведенияОбАдресе.СохраненноеПредставление);
	
	Результат = ЕстьКодРегиона
		И ЕстьНаименованиеМуниципальногоРайона
		И ЕстьКодМуниципальногоРайона
		И ЕстьИдентификаторАдресногоОбъекта
		И ПредставленияАдресаСовпадают
		И Не ЕстьНесколькоТиповПомещений
		И Не ЕстьНесколькоТиповАпартаментов;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповПомещений(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	
	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		Если ТипыПомещенийЗдания.Найти(Элемент.ТипПомещения) <> Неопределено Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповАпартаментов(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	
	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		ТипПомещения = Элемент.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		ЭтоНеклассифицированноеПомещениеКвартиры = (Не ЭтоПомещениеЗдания И Не ЭтоПомещениеКвартиры);
		
		Если ЭтоПомещениеКвартиры Или ЭтоНеклассифицированноеПомещениеКвартиры Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыТовар()
	Возврат "Товар";
КонецФункции

Функция УПД970_ТипНоменклатурыУслуга()
	Возврат "Услуга";
КонецФункции

Функция УПД970_ТипНоменклатурыРабота()
	Возврат "Работа";
КонецФункции

Функция УПД970_РегистрационныйНомерПрослеживаемогоТовара()
	Возврат "Прослеж";
КонецФункции

Функция УПД970_ДокументыОтгрузки(ИсходныеДокументы)
	
	Результат = Новый Массив;
	
	Для Каждого ИсходныйДокумент Из ИсходныеДокументы Цикл
		
		ДокументОтгрузки = УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент);
		
		Результат.Добавить(ДокументОтгрузки);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент)
	
	Если ЗначениеЗаполнено(ИсходныйДокумент)
		И ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ДокументРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокумент, "ИсправляемыйДокументРеализации");
		Результат = УПД970_ИсправляемыйДокументОтгрузки(ДокументРеализации);
		
	Иначе
		
		Результат = ИсходныйДокумент;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция УПД970_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФДОП() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьТовары(СтрокиТаблицы)
	
	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы)
	
	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВТабличныхДанныхДокументаНетТоваров(ТабличныеДанные)
	
	ОтборСтрок = Новый Структура("ТипНоменклатуры", УПД970_ТипНоменклатурыТовар());
	СтрокиСТоварами = ТабличныеДанные.НайтиСтроки(ОтборСтрок);
	
	Результат = (СтрокиСТоварами.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО)
	
	ВидыЮрФизЛиц = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	ЭтоРезидент = НЕ ДанныеУчастникаЭДО.Нерезидент;
	
	Если НЕ ДанныеУчастникаЭДО.ЭтоЮрЛицо
		И НЕ ДанныеУчастникаЭДО.ЭтоФизЛицо
		И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИндивидуальныйПредприниматель;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ЮридическоеЛицо;
		
	ИначеЕсли НЕ ДанныеУчастникаЭДО.ЭтоЮрЛицо И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностранныйГражданин;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо
		И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностраннаяОрганизация;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоФизЛицо Тогда
		
		Результат = ВидыЮрФизЛиц.ФизическоеЛицо;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Не удалось определить тип участника ЭДО.
				|Заполните корректные реквизиты участников ЭДО в базе 1С 
				|(организация, грузоотправитель, контрагент, грузополучатель)'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЦенаБезНДС(Item, ЦенаИзДокумента, Разрядность)
	
	ДопустимоеОтклонение = 0.03;
	
	Если Item.Quantity = 0 Тогда
		
		Результат = 0;
		
	Иначе
		
		Результат = Окр(Item.SubtotalWithVatExcluded / Item.Quantity, Разрядность);
		ОтклонениеВЦене = (Результат - ЦенаИзДокумента) * Item.Quantity;
		
		ОтклонениеВЦенеПоМодулю = Макс(ОтклонениеВЦене, -ОтклонениеВЦене);
		
		Если ОтклонениеВЦенеПоМодулю <= ДопустимоеОтклонение Тогда
			Результат = Окр(ЦенаИзДокумента, Разрядность);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеКодовВПечатныхФормах()
	
	Результат = Константы.ПредставлениеКодовВПечатныхФормах.Получить();
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НеобходимоВыполнитьПересчетСуммВВалютеРегУчета(ДанныеШапки, СчетФактура)
	
	Перем Результат;
	
	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	
	Если ЭтоСчетФактураНаАванс(СчетФактура) Тогда
		
		Результат = Истина;
		
	ИначеЕсли ДанныеШапки.РасчетыВУсловныхЕдиницах
		И ДанныеШапки.ВалютаДокумента <> ВалютаРеглУчета Тогда
		
		Результат = Истина;
		
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ПерезаполнитьСуммыДокументаВВалютеРегУчета(ДанныеШапки, ТабличныеДанные)
	
	СуммыДокументаВВалютеРегУчета = УПД970_СуммыДокументаВВалютеРегУчетаПоДаннымРегистра(ДанныеШапки.Ссылка);
	ПересчитатьПоКурсу = Ложь;
	ТочностьЦены = 2;
	
	Если Не ЗначениеЗаполнено(СуммыДокументаВВалютеРегУчета) Тогда
		ПересчитатьПоКурсу = Истина;
		КоэффициентПересчета = ДанныеШапки.КурсВзаиморасчетов / ДанныеШапки.КратностьВзаиморасчетов;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Если ПересчитатьПоКурсу Тогда
			
			ВсегоРегл = Окр(СтрокаТаблицы.СуммаВсего * КоэффициентПересчета, ТочностьЦены);
			НДСРегл = Окр(СтрокаТаблицы.СуммаНДС * КоэффициентПересчета, ТочностьЦены);
			
		Иначе
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ТабличнаяЧастьДокумента", ИдентификаторТабличнойЧасти(СтрокаТаблицы.ИмяТабличнойЧасти));
			ПараметрыОтбора.Вставить("НомерСтрокиДокумента", СтрокаТаблицы.НомерСтроки);
			
			НайденныеСтроки = СуммыДокументаВВалютеРегУчета.НайтиСтроки(ПараметрыОтбора);
			
			Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
				Продолжить;
			КонецЕсли;
			
			ВсегоРегл = НайденныеСтроки[0].Всего;
			НДСРегл = НайденныеСтроки[0].НДС;
			
		КонецЕсли;
		
		СтрокаТаблицы.СуммаВсего = ВсегоРегл;
		СтрокаТаблицы.СуммаНДС = НДСРегл;
		СтрокаТаблицы.СуммаБезНДС = ВсегоРегл - НДСРегл;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			СтрокаТаблицы.Цена = Окр(СтрокаТаблицы.СуммаБезНДС / СтрокаТаблицы.Количество, ТочностьЦены);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УПД970_СуммыДокументаВВалютеРегУчетаПоДаннымРегистра(ДокСсылка)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СуммыДокументовРегл.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	СуммыДокументовРегл.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	СуммыДокументовРегл.Всего КАК Всего,
	|	СуммыДокументовРегл.НДС КАК НДС
	|ИЗ
	|	РегистрСведений.СуммыДокументовРегламентированныйУчет КАК СуммыДокументовРегл
	|ГДЕ
	|	СуммыДокументовРегл.Регистратор = &ДокСсылка
	|	И СуммыДокументовРегл.Активность";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("ТабличнаяЧастьДокумента, НомерСтрокиДокумента");
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ПерезаполнитьВалютуДокумента(ДанныеШапки)
	
	ДанныеШапки.ВалютаДокумента = ВалютаРегламентированногоУчета();
	
	РеквизитыВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеШапки.ВалютаДокумента, "Код, НаименованиеПолное");
	
	ДанныеШапки.ВалютаДокументаКод = РеквизитыВалюты.Код;
	ДанныеШапки.ВалютаДокументаНаименование = РеквизитыВалюты.НаименованиеПолное;
	
КонецПроцедуры

Функция УПД970_ЕстьТабличнаяЧастьДокументыРасчетовСКонтрагентом(Документ)
	
	ТипДокумента = ТипЗнч(Документ);
	
	Результат = (ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
		Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
		
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеПервичногоДокумента()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("СведенияПрослеживаемости");
	
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");
	Результат.Вставить("СчетФактура");
	Результат.Вставить("СведенияОбУчастникахЭДО");
	Результат.Вставить("ОснованияПередачиТоваров");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеСчетФактура()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("ДокументыОснования");
	Результат.Вставить("СведенияОДокументахОплаты");
	Результат.Вставить("СведенияОбУчастникахЭДО");
	Результат.Вставить("АвансовыеДокументы");
	
	Результат.Вставить("ЭтоСчетФактураНаАванс");
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");
	Результат.Вставить("ВидОперации");
	Результат.Вставить("ОснованияПередачиТоваров");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_УчастникиЭДО()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Грузоотправитель");
	Результат.Вставить("Грузополучатель");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеУчастникаЭДО()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("Наименование");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("ЭтоЮрЛицо");
	Результат.Вставить("ЭтоФизЛицо");
	Результат.Вставить("КодПоОКПО");
	Результат.Вставить("ОГРНИП");
	Результат.Вставить("ДатаОГРНИП");
	Результат.Вставить("Телефоны");
	Результат.Вставить("ЭлектроннаяПочта");
	Результат.Вставить("СтранаНаименование");
	Результат.Вставить("СтранаКод");
	Результат.Вставить("Нерезидент");
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации");
	Результат.Вставить("Свидетельство");
	Результат.Вставить("НаименованиеБанка");
	Результат.Вставить("НомерСчета");
	Результат.Вставить("КоррСчет");
	Результат.Вставить("БИК");
	Результат.Вставить("Адрес");
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_УстановитьНомерСтрокиВТабличнойЧастиДляДоставки(ТабличныеДанные)
	
	ИндексПоследнейСтроки = ТабличныеДанные.Количество() - 1;
	
	ПоследняяСтрока = ТабличныеДанные[ИндексПоследнейСтроки];
	
	Если ПоследняяСтрока.НомерСтроки = 0 Тогда
		ПоследняяСтрока.НомерСтроки = ТабличныеДанные.Количество();
	КонецЕсли;
	
КонецПроцедуры

//} УПД970. Служебные процедуры и функции

//{ УПД970. Контракты протоструктуры

Функция Контракт_ПротоструктураУПД970()
	
	ИмяТипа = "Utd970SellerContent";
	
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформация();
	
	Результат.AdditionalInfoId = Контракт_AdditionalInfoId();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформация()
	
	ИмяТипа = "СлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.ContentsDocumentProductsType = Контракт_ContentsDocumentProductsType();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ContentsDocumentProductsType()
	
	ИмяТипа = "ContentsDocumentProductsType";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ExtendedOrganizationInfo970()

	ИмяТипа = "ExtendedOrganizationInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияОрганизации();
	
	Возврат Результат;

КонецФункции

Функция Контракт_Shipper970()

	ИмяТипа = "Shipper970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_СлужебнаяИнформацияОрганизации()
	
	ИмяТипа = "OrganizationСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressInfo970()

	ИмяТипа = "AddressInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressRFInfo()

	ИмяТипа = "AddressRFInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressSARInfo()

	ИмяТипа = "AddressSARInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressTextInfo()

	ИмяТипа = "AddressTextInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressObjectNumberInfo()

	ИмяТипа = "AddressObjectNumberInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentShipments970()

	ИмяТипа = "DocumentShipment970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferInfo970()

	ИмяТипа = "TransferInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferBases970()

	ИмяТипа = "TransferBase970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_Employee970()
	
	ИмяТипа = "Employee970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_InvoiceTable970()
	
	ИмяТипа = "InvoiceTable970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemTracingInfo970()
	
	ИмяТипа = "ItemTracingInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_CustomDeclarations()

	ИмяТипа = "CustomDeclaration";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияСтроки()
	
	ИмяТипа = "ItemСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Item970()
	
	ИмяТипа = "Item970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_PaymentDocumentInfo()

	ИмяТипа = "PaymentDocumentInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AdditionalInfoId()
	
	ИмяТипа = "AdditionalInfoId";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_AccompanyingDocument970()
	
	ИмяТипа = "AccompanyingDocument970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Контракты протоструктуры

//} СБОР КОНТЕНТА УПД970

//*****************************************************************************
//{ СБОР КОНТЕНТА ФНС29

Функция СчетФНС29(СсылкаНаОбъект) Экспорт
	Ошибка = "ИнтеграцияУНФ: формирование электронных счетов в формате ФНС 29@ не реализовано";
	ВызватьИсключение Ошибка;
КонецФункции

//} СБОР КОНТЕНТА ФНС29
//*****************************************************************************

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция ИспользуетсяНоменклатураКонтрагентовБЭД()
	
	Результат = Истина;
	
	Если Метаданные.РегистрыСведений.Найти("НоменклатураКонтрагентовБЭД") = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	Если ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		
		МетаданныеНоменклатурыКонтрагентов = Метаданные.РегистрыСведений.НоменклатураКонтрагентовБЭД;
		
		ВладелецТип = Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип;
		
		НоменклатураТип = Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип;
		ХарактеристикаТип = Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатурыБЭД.Тип;
		УпаковкаТип = Метаданные.ОпределяемыеТипы.Упаковка.Тип;
		
		НаименованиеТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Артикул.Тип;
		КодТип = АртикулТип; // поля "Код" в регистре нет
		
	Иначе
		
		МетаданныеНоменклатурыПоставщиков = Метаданные.Справочники.НоменклатураПоставщиков;
		
		ВладелецТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Владелец.Тип;
		
		НоменклатураТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Номенклатура.Тип;
		ХарактеристикаТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Характеристика.Тип;
		УпаковкаТип = Неопределено;
		
		НаименованиеТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Артикул.Тип;
		КодТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Идентификатор.Тип;
		
	КонецЕсли;
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("Характеристика"         , ХарактеристикаТип);
	Результат.Колонки.Добавить("Упаковка"               , УпаковкаТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, НоменклатураКонтрагента)
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент				= Контрагент;
	НоваяСтрока.Наименование			= НоменклатураКонтрагента.Наименование;
	НоваяСтрока.Код						= НоменклатураКонтрагента.Код;
	НоваяСтрока.Артикул					= НоменклатураКонтрагента.Артикул;
	НоваяСтрока.НоменклатураКонтрагента = НоменклатураКонтрагента;
	
КонецПроцедуры

Функция ИспользуетсяСверкаВзаиморасчетов3_0_2()
	
	ВерсияПодсистемыУНФ = ВерсияПодсистемыУНФ();
	Результат = Ядро.СравнитьВерсии(ВерсияПодсистемыУНФ, "3.0.2") > 0;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяПодсистема_1_6_26()
	
	ВерсияПодсистемыУНФ = ВерсияПодсистемыУНФ();
	Результат = Ядро.СравнитьВерсии(ВерсияПодсистемыУНФ, "1.6.26") >= 0;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияПодсистемыУНФ()
	
	ИмяПодсистемы = "УправлениеНебольшойФирмой";
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		ИмяПодсистемы = ИмяПодсистемы + "Базовая";
	КонецЕсли;
	
	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
	
	Если ОписаниеПодсистемы = Неопределено Тогда
		
		ИмяПодсистемы = "Розница";
		Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
			ИмяПодсистемы = ИмяПодсистемы + "Базовая";
		КонецЕсли;
		
		ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
		ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
		
	КонецЕсли;
	
	Результат = ОписаниеПодсистемы.Версия;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьФункционалСведенийОбАвансах()
	
	ВерсияПодсистемыУНФ = ВерсияПодсистемыУНФ();
	Результат = Ядро.СравнитьВерсии(ВерсияПодсистемыУНФ, "3.0.12.237") >= 0;
	
	Возврат Результат;
	
КонецФункции

// Возвращает описания всех библиотек конфигурации, включая
// описание самой конфигурации.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка - имя подсистемы, например, "СтандартныеПодсистемы".
//   * Значение - Структура - описание подсистемы:
//     ** Имя - Строка - имя подсистемы.
//     ** Версия - Строка - версия подсистемы.
//     ** ЭтоКонфигурация - Булево - Истина, если данная подсистема является основной конфигурацией.
//     ** ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах интернет-поддержки.
//
Функция ОписанияПодсистемКонфигурации()
	
	Результат = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыПодписантаПоОрганизации1С(Организация, Дата)
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Должность", "", "", "", "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подписи.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПРЕДСТАВЛЕНИЕ(Подписи.Должность) КАК Должность
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подписи КАК Подписи
	|		ПО Организации.ПодписьРуководителя = Подписи.Ссылка
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|		И НЕ Организация.ПодписьРуководителя = ЗНАЧЕНИЕ(Справочник.Подписи.ПустаяСсылка)"
	);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ФИОКратко = Ложь;
	
		ДанныеФизЛица = Справочники.ФизическиеЛица.ДанныеФизЛица(
			Организация,
			Выборка.ФизическоеЛицо,
			Дата,
			ФИОКратко);
		
		Результат.Фамилия 	= ДанныеФизЛица.Фамилия;
		Результат.Имя 		= ДанныеФизЛица.Имя;
		Результат.Отчество 	= ДанныеФизЛица.Отчество;
		Результат.Должность = Выборка.Должность;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеТоваровУслуг" Тогда				
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Организация = &Организация
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетФактураПолученный.НомерВходящегоДокумента = &НомерДокумента";		
		
	ИначеЕсли ВидДокумента1С = "АктОРасхожденияхПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктОРасхожденияхПолученный.Ссылка
		|ИЗ
		|	Документ.АктОРасхожденияхПолученный КАК АктОРасхожденияхПолученный
		|ГДЕ
		|	НЕ АктОРасхожденияхПолученный.ПометкаУдаления
		|	И АктОРасхожденияхПолученный.Организация = &Организация
		|	И АктОРасхожденияхПолученный.Контрагент = &Контрагент
		|	И АктОРасхожденияхПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И АктОРасхожденияхПолученный.НомерВходящегоДокумента = &НомерДокумента";
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_ПриходнаяНакладная();
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_КорректировкаПоступления();
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_СчетФактураПолученный();
		
	ИначеЕсли ОсновнойМодуль.ЭтоАктОРасхождениях(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_АктОРасхожденияхПолученный();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторОперации_ПриходнаяНакладная()

	Возврат "ПриходнаяНакладная";

КонецФункции

Функция ИдентификаторОперации_КорректировкаПоступления()

	Возврат "КорректировкаПоступления";

КонецФункции

Функция ИдентификаторОперации_СчетФактураПолученный()

	Возврат "СчетФактураПолученный";

КонецФункции

Функция ИдентификаторОперации_АктОРасхожденияхПолученный()

	Возврат "АктОРасхожденияхПолученный";

КонецФункции

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия)
	
	Если ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭД = ПараметрыСобытия.Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
КонецПроцедуры

Функция ПроверкаДокументаОснования(Документ, ВыбранныйВид)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Если ВыбранныйВид = "КорректировкаПоступления" Тогда
		
		ТипДокумента		= Документ.Тип.ТипДокумента;
		ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
		Контент				= Документ.Документооборот.ХранилищеКонтента;
		ДвоичныеДанные		= Контент.Данные;
		ДеревоКонтента		= ОсновнойМодуль.XML_В_XDTO(ДвоичныеДанные);
		
		НомерДатаСФ = Неопределено;		
		
		Если ТипДокумента = "UniversalCorrectionDocument" Тогда
			
			НомерДатаСФ = ДеревоКонтента.Документ.СвКСчФ.СчФ;
		
			Если ТипЗнч(НомерДатаСФ) = Тип("СписокXDTO") Тогда
				
				НомерДатаСФ = Неопределено;
				
				Результат.ОписаниеОшибки = "Создание корректировки по нескольким документам-оснований недоступно. Вы можете вручную создать документ в 1С и сопоставить его с текущим документом";
				
			КонецЕсли;
			
		ИначеЕсли ТипДокумента = "UniversalTransferDocumentRevision" Тогда
			
			НомерДатаСФ = ДеревоКонтента.Документ.СвСчФакт;
			
		КонецЕсли;	
		
		Если НомерДатаСФ <> Неопределено Тогда
			
			НомерОснования = НомерДатаСФ.НомерСчФ;
			ДатаОснования  = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаСФ.ДатаСчФ);

			ДокументОснование = Неопределено;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
			ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
			ПараметрыОтбора.Вставить("ДатаДокумента",	ДатаОснования);
			ПараметрыОтбора.Вставить("НомерДокумента",	НомерОснования);
			
			Если ФункцияДокумента = "InvoiceAndBasic" Тогда
				
				ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
				
				Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 
					И ДокументыОснования1С[0].ДокументыОснования.Количество() = 1 Тогда
					ДокументОснование = ДокументыОснования1С[0].ДокументыОснования[0].ДокументОснование;
				КонецЕсли;
				
			ИначеЕсли ФункцияДокумента = "Basic" Тогда
				
				ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
				
				Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
					ДокументОснование = ДокументыОснования1С[0];
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДокументОснование = Неопределено Тогда
				
				СоздаватьСчетаФактуры = ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СоздаватьСчетаФактуры;
								
				Результат.ОписаниеОшибки = "Для корректировки не найден документ-основание №" + НомерОснования + " от " + Формат(ДатаОснования, "ДФ=dd.MM.yyyy");
												
				Если СоздаватьСчетаФактуры = Истина Тогда
					Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ". Создайте счет-фактуру для документа-основания и повторите создание документа";
				Иначе
					Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ". Сопоставьте документ вручную из карточки документа.";
				КонецЕсли;
				
			КонецЕсли;
			
			Результат.ОсновнойОбъект = ДокументОснование;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции			

Функция ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных)
	
	МетаданныеОснованийСФ = Метаданные.Документы.СчетФактураПолученный.ВводитсяНаОсновании;
	Результат = МетаданныеОснованийСФ.Содержит(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	Результат = Ложь;
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Если ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных) Тогда
		
		ТипНалогообложения = ДокументОбъект.НалогообложениеНДС;
		Результат = (ТипНалогообложения = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		ИЛИ НЕ ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйСФ)
		ИЛИ ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	ОснованиеСФ = ДокументОбъект.Ссылка;
	
	ДатаДокумента = ТекущаяДата();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	ДокументСФ.Заполнить(ОснованиеСФ);
	ДокументСФ.НомерВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Номер;
	ДокументСФ.ДатаВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.КодСпособаВыставления = 2;
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.Записать();
	
	Если НЕ ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента)
		Или ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактура")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		
		Для Каждого СтрокаОснование Из ДокументУчета.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(СтрокаОснование.ДокументОснование, ДобавляемыйКомментарий);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Общее_СтрокаВДату(Значение)
	
	Результат = СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ДанныеЮрФизЛица()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ЮрФизЛицо", "");
	Результат.Вставить("СтранаРегистрации", "");
	Результат.Вставить("ПолноеНаименование", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ОГРН", "");
	Результат.Вставить("Телефоны", "");
	Результат.Вставить("ЭлектроннаяПочта", "");
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеЮрФизЛица(Участник, ДатаСведений)
	
	МодульЭлектронныеДокументы = ОбщийМодульПоИмениЛок("УправлениеНебольшойФирмойЭлектронныеДокументыСервер");
	
	ДанныеУчастникаЭДО = МодульЭлектронныеДокументы.ПолучитьДанныеЮрФизЛица(Участник, ДатаСведений);
	
	Результат = Контракт_ДанныеЮрФизЛица();
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеУчастникаЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаРегламентированногоУчета()
	
	Результат = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	
	Возврат Результат;
	
КонецФункции

Функция РазрешеноЧтениеТаблицы(ОбъектМетаданных)
	
	Результат = ПравоДоступа("Чтение", ОбъектМетаданных);
	Возврат Результат;
	
КонецФункции

Процедура АктСверки405_ЗаполнитьШапкуТитулаОтправителя(Content, РеквизитыДокумента)
	
	АктСверки405_ЗаполнитьНомер(Content, РеквизитыДокумента.Номер);
	АктСверки405_ЗаполнитьПериод(Content, РеквизитыДокумента.ДатаНачала, РеквизитыДокумента.ДатаОкончания);
	АктСверки405_ЗаполнитьВалюту(Content, РеквизитыДокумента.КодВалюты);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьНомер(Content, НомерАктаСверки)
	
	Content.ActNumber = ПредставлениеНомера(НомерАктаСверки);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьПериод(Content, ДатаНачала, ДатаОкончания)
	
	Content.ReconcilationDateFrom = ДатаНачала;
	Content.ReconcilationDateTo = ДатаОкончания;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьВалюту(Content, КодВалюты)
	
	AdditionalInfoReconciliationAct = Новый_AdditionalInfoReconciliationAct();
	AdditionalInfoReconciliationAct.Currency = КодВалюты;
	
	SenderData_ReconciliationAct = Новый_SenderData_ReconciliationAct();
	SenderData_ReconciliationAct.AdditionalInfoReconciliationAct = AdditionalInfoReconciliationAct;
	
	Content.ReconciliationAct = SenderData_ReconciliationAct;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьТабличнуюЧастьТитулаОтправителя(Content, ВыборкаПоДоговорам, ДокСсылка)
	
	ReconciliationActTable = Новый_SenderReconciliationActTable();
	
	Пока ВыборкаПоДоговорам.Следующий() Цикл
		
		ContractInfo = Новый_SenderContractInfo_ReconciliationAct();
		
		АктСверки405_ЗаполнитьContractInfoТитулаОтправителя(
			ContractInfo,
			ВыборкаПоДоговорам,
			ДокСсылка.ВалютаДокумента,
			ДокСсылка.НачалоПериода,
			ДокСсылка.КонецПериода
		);
		
		ReconciliationActTable.ContractInfo.Добавить(ContractInfo);
		
		ВыборкаПоДокументам = ВыборкаПоДоговорам.Выбрать();
		
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			DocumentInfo = Новый_SenderDocumentInfo_ReconciliationAct();
			OperationInfo = Новый_SenderOperationInfo_ReconciliationAct();
			
			АктСверки405_ЗаполнитьDocumentInfoТитулаОтправителя(DocumentInfo, ВыборкаПоДокументам);
			АктСверки405_ЗаполнитьOperationInfoТитулаОтправителя(OperationInfo, ВыборкаПоДокументам);
			
			ContractInfo.DocumentInfo.Добавить(DocumentInfo);
			DocumentInfo.OperationInfo.Добавить(OperationInfo);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Content.ReconciliationAct.ReconciliationActTable = ReconciliationActTable;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьContractInfoТитулаОтправителя(ContractInfo, ВыборкаПоДоговорам, ВалютаДокумента, НачалоПериода, КонецПериода)
	
	НачальноеСальдоПоДоговору = АктСверки405_СальдоПоДоговоруНаДату(
		ВыборкаПоДоговорам.Договор,
		ВалютаДокумента,
		НачалоПериода
	);
	
	КонечноеСальдоПоДоговору = АктСверки405_СальдоПоДоговоруНаДату(
		ВыборкаПоДоговорам.Договор,
		ВалютаДокумента,
		КонецПериода
	);
	
	НачОстатокПоДоговоруДт = Макс(НачальноеСальдоПоДоговору, 0);
	НачОстатокПоДоговоруКт = Макс(-НачальноеСальдоПоДоговору, 0);
	
	КонОстатокПоДоговоруДт = Макс(КонечноеСальдоПоДоговору, 0);
	КонОстатокПоДоговоруКт = Макс(-КонечноеСальдоПоДоговору, 0);
	
	СуммаОборотДт = КонОстатокПоДоговоруДт - НачОстатокПоДоговоруДт;
	СуммаОборотКт = КонОстатокПоДоговоруКт - НачОстатокПоДоговоруКт;
	
	ContractInfo.ContractAdditionalInfo = Строка(ВыборкаПоДоговорам.ВидДоговора);
	ContractInfo.ContractNumber = ВыборкаПоДоговорам.НомерДоговора;
	ContractInfo.ContractDate = ВыборкаПоДоговорам.ДатаДоговора;
	ContractInfo.BalanceDebitFrom = НачОстатокПоДоговоруДт;
	ContractInfo.BalanceAmountFrom = НачОстатокПоДоговоруКт;
	ContractInfo.TurnoverDebit = СуммаОборотДт;
	ContractInfo.TurnoverAmount = СуммаОборотКт;
	ContractInfo.BalanceDebitEnd = ?(КонечноеСальдоПоДоговору > 0, КонечноеСальдоПоДоговору, 0);
	ContractInfo.BalanceAmountEnd = ?(КонечноеСальдоПоДоговору < 0, -КонечноеСальдоПоДоговору, 0);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьDocumentInfoТитулаОтправителя(Content, ВыборкаПоДокументам)
	
	Content.DocumentName = ВыборкаПоДокументам.НаименованиеДокумента;
	Content.DocumentNumber = ВыборкаПоДокументам.НомерДокумента;
	Content.DocumentDate = ВыборкаПоДокументам.ДатаДокумента;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьOperationInfoТитулаОтправителя(Content, ВыборкаПоДокументам)
	
	Content.StringNumber = ВыборкаПоДокументам.НомерСтроки;
	Content.OperationDate = ВыборкаПоДокументам.ДатаОперации;
	Content.OperationName = ВыборкаПоДокументам.НаименованиеОперации;
	Content.SumDebit = ВыборкаПоДокументам.СуммаДебет;
	Content.SumAmount = ВыборкаПоДокументам.СуммаКредит;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьИтогиПоТабличнойЧастиТитулаОтправителя(Content, ОстатокНаНачало, ОборотПодебету, ОборотПоКредиту)
	
	СальдоНаНачалоПериодаДебет = 0;
	СальдоНаНачалоПериодаКредит = 0;
	
	Если ОстатокНаНачало > 0 Тогда
		СальдоНаНачалоПериодаДебет = ОстатокНаНачало;
	Иначе
		СальдоНаНачалоПериодаКредит = - ОстатокНаНачало;
	КонецЕсли;
	
	СальдоНаКонецПериодаДебет = СальдоНаНачалоПериодаДебет + ОборотПоДебету;
	СальдоНаКонецПериодаКредит = СальдоНаНачалоПериодаКредит + ОборотПоКредиту;
	
	ReconciliationActTable = Content.ReconciliationAct.ReconciliationActTable;
	
	ReconciliationActTable.BalanceDebitFrom = СальдоНаНачалоПериодаДебет;
	ReconciliationActTable.BalanceAmountFrom = СальдоНаНачалоПериодаКредит;
	ReconciliationActTable.TurnoverDebit = ОборотПоДебету;
	ReconciliationActTable.TurnoverAmount = ОборотПоКредиту;
	ReconciliationActTable.BalanceDebitEnd = СальдоНаКонецПериодаДебет;
	ReconciliationActTable.BalanceAmountEnd = СальдоНаКонецПериодаКредит;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьРеквизитыОтправителя(Content, Организация, ДатаСведений)
	
	АктСверки405_ЗаполнитьРеквизитыУчастника(
		Content.ReconciliationAct.AdditionalInfoReconciliationAct.Sender,
		Организация,
		ДатаСведений
	);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьРеквизитыПолучателя(Content, Контрагент, ДатаСведений)
	
	АктСверки405_ЗаполнитьРеквизитыУчастника(
		Content.ReconciliationAct.AdditionalInfoReconciliationAct.Recipient,
		Контрагент,
		ДатаСведений
	);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьРеквизитыУчастника(Content, Участник, ДатаСведений)
	
	СведенияОбУчастнике = ДанныеЮрФизЛица(Участник, ДатаСведений);
	
	Content = Новый_ExtendedOrganizationInfo_ReconciliationAct();
	
	Content.Name = СведенияОбУчастнике.ПолноеНаименование;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.Телефоны) Тогда
		Content.Phone = СведенияОбУчастнике.Телефоны;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.ЭлектроннаяПочта) Тогда
		Content.Email = СведенияОбУчастнике.ЭлектроннаяПочта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.СтранаРегистрации)
		И СведенияОбУчастнике.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда
		
		Content.LegalEntityId = СведенияОбУчастнике.РегистрационныйНомер;
		Content.Type = "ForeignEntity";
		
	ИначеЕсли СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		Content.Inn = СведенияОбУчастнике.ИНН;
		Content.Kpp = СведенияОбУчастнике.КПП;
		Content.Ogrn = СведенияОбУчастнике.ОГРН;
		Content.Type = "LegalEntity";
		
	Иначе
		
		Content.Type = "IndividualEntity";
		Content.Inn = СведенияОбУчастнике.ИНН;
		Content.Ogrn = СведенияОбУчастнике.ОГРН;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьПодписанта(Content)
	
	Signer = Новый_Signer_ReconciliationAct();
	Signer.Official = Новый_Official();
	Signer.DigitalAttorneyInfo = Новый_DigitalAttorneyInfo_ReconciliationAct();
	Signer.PaperAttorneyInfo = Новый_PaperAttorneyInfo_ReconciliationAct();
	
	Content.ReconciliationAct.Signer = Signer;
	
КонецПроцедуры

Функция АктСверки405_СальдоПоДоговоруНаДату(Договор, Валюта, ДатаСальдо)
	
	Результат = 0;
	
	Документы.СверкаВзаиморасчетов.НачальноеСальдоПоДоговорам(
		Договор.Организация,
		ДатаСальдо,
		Договор,
		Валюта,
		Результат
	);
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ШапкаИнформацииОтправителя(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_АктСверки405Шапка();
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизитыДокумента = РезультатЗапроса.Выгрузить();
	
	Результат = ТаблицаРеквизитыДокумента[0];
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ТабличнаяЧастьИнформацииОтправителя(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_АктСверки405ДетальныеДанные();
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ИтогиИнформацииОтправителя(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_АктСверки405Итоги();
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктСверки405Шапка()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумент.Номер КАК Номер,
	|	ТаблицаДокумент.Дата КАК Дата,
	|	ТаблицаДокумент.Организация КАК Организация,
	|	ТаблицаДокумент.Контрагент КАК Контрагент,
	|	ТаблицаДокумент.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумент.НачалоПериода КАК ДатаНачала,
	|	ТаблицаДокумент.КонецПериода КАК ДатаОкончания,
	|	- ТаблицаДокумент.СальдоНачалоПериода КАК ОстатокНаНачало,
	|	ЕСТЬNULL(Валюты.Код, ""643"") КАК КодВалюты
	|ИЗ
	|	Документ.СверкаВзаиморасчетов КАК ТаблицаДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ТаблицаДокумент.ВалютаДокумента = Валюты.Ссылка
	|ГДЕ
	|	ТаблицаДокумент.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктСверки405Итоги()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТабличнаяЧастьДанныеОрганизации.СуммаДолгКонтрагента) КАК Дебет,
	|	СУММА(ТабличнаяЧастьДанныеОрганизации.СуммаДолгОрганизации) КАК Кредит
	|ИЗ
	|	Документ.СверкаВзаиморасчетов.ДанныеОрганизации КАК ТабличнаяЧастьДанныеОрганизации
	|ГДЕ
	|	ТабличнаяЧастьДанныеОрганизации.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктСверки405ДетальныеДанные()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабличнаяЧастьДанныеОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧастьДанныеОрганизации.Договор КАК Договор,
	|	ТабличнаяЧастьДанныеОрганизации.ДатаОперации КАК ДатаОперации,
	|	ТабличнаяЧастьДанныеОрганизации.СуммаДолгКонтрагента КАК СуммаДебет,
	|	ТабличнаяЧастьДанныеОрганизации.СуммаДолгОрганизации КАК СуммаКредит,
	|	ТабличнаяЧастьДанныеОрганизации.НомерДокумента КАК НомерДокумента,
	|	ТабличнаяЧастьДанныеОрганизации.ДатаДокумента КАК ДатаДокумента,
	|	ТабличнаяЧастьДанныеОрганизации.ОписаниеДокумента КАК НаименованиеДокумента,
	|	ТабличнаяЧастьДанныеОрганизации.НаименованиеОперации КАК НаименованиеОперации,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДатаДоговора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.НомерДоговора, """") КАК НомерДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ПустаяСсылка)) КАК ВидДоговора
	|ИЗ
	|	Документ.СверкаВзаиморасчетов.ДанныеОрганизации КАК ТабличнаяЧастьДанныеОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ТабличнаяЧастьДанныеОрганизации.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ТабличнаяЧастьДанныеОрганизации.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(СуммаДебет),
	|	СУММА(СуммаКредит),
	|	МАКСИМУМ(ДатаДоговора),
	|	МАКСИМУМ(НомерДоговора),
	|	МАКСИМУМ(ВидДоговора)
	|ПО
	|	Договор";
	
	Возврат Результат;
	
КонецФункции

Процедура АктСверки405_ПроверитьВозможностьОтправки(Результат, ДокСсылка)
	
	ЭтоЭлектронныйАктСверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "ЭтоЭлектронныйДокумент");
	
	Если НЕ ЭтоЭлектронныйАктСверки Тогда
		
		ШаблонОшибки = НСтр("ru='Установите переключатель ""В электронном виде"" в документе <%1>'");
		
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ДокСсылка);
		
		ГенерацияXML.ДобавитьОшибкуВалидации(
			Результат.ОшибкиВДанных,
			ТекстОшибки,
			ДокСсылка
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм)
	
	НовыйЭлементТаблицы = КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета = "АктБезРасхождений";
	НовыйЭлементТаблицы.ИмяВРЕГ = ВРег(НовыйЭлементТаблицы.ИмяМакета);
	НовыйЭлементТаблицы.Экземпляров = 1;

КонецПроцедуры

// Метод является констркутором служебной коллекции "КоллекцияПечатныхФорм"
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция НовыйКоллекцияПечатныхФормДляПечатиДокумента()
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции 

Функция СчетаНаОплату_ПечатнаяФорма1С(ДокСсылка) Экспорт
	
	ДокументПечати = Новый Массив;
	ДокументПечати.Добавить(ДокСсылка);
	
	СтруктураТипов = Новый Соответствие;
	СтруктураТипов.Вставить(ДокСсылка.Метаданные().ПолноеИмя(), ДокументПечати);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	КоллекцияПечатныхФорм = СчетаНаОплату_НовыйКоллекцияПечатныхФормДляПечатиДокумента();
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Новый Структура;
	
	ПараметрыОтправки = Новый Структура;
	
	ПараметрыОтправки.Вставить("Получатель"	, "");
	ПараметрыОтправки.Вставить("Тема"		, "");
	ПараметрыОтправки.Вставить("Текст"		, "");
	
	ПараметрыВывода.Вставить("ПараметрыОтправки", ПараметрыОтправки);
	
	Документы.СчетНаОплату.Печать(
		ДокументПечати,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода
	);
	
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			
			ТабличныйДокумент = Стр.ТабличныйДокумент;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Метод является констркутором служебной коллекции "КоллекцияПечатныхФорм"
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция СчетаНаОплату_НовыйКоллекцияПечатныхФормДляПечатиДокумента()
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	
	НовыйЭлементТаблицы = КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета = "СчетНаОплату";
	НовыйЭлементТаблицы.ИмяВРЕГ = ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции

// Заполняет модель данных электронного счета на оплату.
//
// Параметры:
//	Шапка - Контракт шапки неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - Контракт табличной части неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату() 
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанные(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета) Экспорт
	
	Если ЭтоСчетНаОплату(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоСчетуНаОплату(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоЗаказПокупателя(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоЗаказуПокупателя(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоДокументПродажи(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоДокументуПродажи(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	СчетаНаОплату_ОчиститьСкидки(МодельТабличнаяЧасть);
		
КонецПроцедуры

// Формирует модель данных электронного счета на оплату на основании счета.
//
// Параметры:
//  СчетНаОплату - ДокументСсылка.СчетНаОплату - основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанныеПоСчетуНаОплату(МодельШапка, МодельТабличнаяЧасть, Счет)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	ВЫРАЗИТЬ(ДанныеДокумента.ПодписьРуководителя.РасшифровкаПодписи КАК СТРОКА(1000)) КАК ПодписантФамилияИО,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.НалогообложениеНДС <> &ТипНалогообложения_НеОблагаетсяНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СчетНаОплату КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ДанныеДокумента.Содержание КАК СодержаниеУслуги,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	&ПолеХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	&ПолеСуммаСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.СчетНаОплату.Запасы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК НомерТабличнойЧасти,
	|	1 КАК НомерСтроки,
	|	ДанныеДокумента.НоменклатураДоставки КАК Номенклатура,
	|	&ПолеНоменклатураДоставкиАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураДоставкиНаименование КАК НоменклатураНаименование,
	|	"""" КАК СодержаниеУслуги,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	"""" КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	ДанныеДокумента.СтоимостьДоставки КАК Цена,
	|	ДанныеДокумента.СтавкаНДСДоставки КАК СтавкаНДС,
	|	0 КАК СуммаСкидки,
	|	ДанныеДокумента.СтоимостьДоставки КАК Сумма,
	|	ДанныеДокумента.СуммаНДСДоставки КАК СуммаНДС
	|ИЗ
	|	Документ.СчетНаОплату КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|	И &УсловиеВыводитьДоставку
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ЗаполнитьВыраженияЗапросаПоУмолчанию(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Счет);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	МодельШапка.РуководительФИО = ДанныеШапки.ПодписантФамилияИО;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
		
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			Запись.НоменклатураНаименование,
			Запись.ХарактеристикаНаименование,
			Запись.СодержаниеУслуги
		);
		
		Если Запись.СуммаСкидки <> 0 Тогда
			СчетаНаОплату_ПересчитатьЦену(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Формирует модель данных электронного счета на оплату на основании заказа.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанныеПоЗаказуПокупателя(МодельШапка, МодельТабличнаяЧасть, Заказ)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	ВЫРАЗИТЬ(ДанныеДокумента.ПодписьРуководителя.РасшифровкаПодписи КАК СТРОКА(1000)) КАК ПодписантФамилияИО,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.НалогообложениеНДС <> &ТипНалогообложения_НеОблагаетсяНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ДанныеДокумента.Содержание КАК СодержаниеУслуги,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	&ПолеХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	&ПолеСуммаСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ДанныеДокумента.Содержание КАК СодержаниеУслуги,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	&ПолеХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаСкидкиНаценки + СуммаАвтоматическойСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Работы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3 КАК НомерТабличнойЧасти,
	|	1 КАК НомерСтроки,
	|	ДанныеДокумента.НоменклатураДоставки КАК Номенклатура,
	|	&ПолеНоменклатураДоставкиАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураДоставкиНаименование КАК НоменклатураНаименование,
	|	"""" КАК СодержаниеУслуги,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	"""" КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	ДанныеДокумента.СтоимостьДоставки КАК Цена,
	|	ДанныеДокумента.СтавкаНДСДоставки КАК СтавкаНДС,
	|	0 КАК СуммаСкидки,
	|	ДанныеДокумента.СтоимостьДоставки КАК Сумма,
	|	ДанныеДокумента.СуммаНДСДоставки КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|	И &УсловиеВыводитьДоставку
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ЗаполнитьВыраженияЗапросаПоУмолчанию(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Заказ);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	МодельШапка.РуководительФИО = ДанныеШапки.ПодписантФамилияИО;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			Запись.НоменклатураНаименование,
			Запись.ХарактеристикаНаименование,
			Запись.СодержаниеУслуги
		);
		
		Если Запись.СуммаСкидки <> 0 Тогда
			СчетаНаОплату_ПересчитатьЦену(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует модель данных электронного счета на оплату на основании документа продажи.
//
// Параметры:
//  ДокументПродажи - ДокументСсылка.АктВыполненныхРабот, ДокументСсылка.ОтчетОПереработке
//                    ДокументСсылка.РасходнаяНакладная, ДокументСсылка.КорректировкаРеализации - основание электронного счета
// 
// Возвращаемое значение:
//  Структура - см. СчетаНаОплату_Данные
//
Процедура СчетаНаОплату_ЗаполнитьДанныеПоДокументуПродажи(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи)
	
	ТипСсылки = ТипЗнч(ДокументПродажи);
	
	Если ТипСсылки = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		
		СчетаНаОплату_ДокументПродажи_АктВыполненныхРабот(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОтчетОПереработке") Тогда
		
		СчетаНаОплату_ДокументПродажи_ОтчетОПереработке(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		СчетаНаОплату_ДокументПродажи_РасходнаяНакладная(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		
		СчетаНаОплату_ДокументПродажи_ОтчетКомитенту(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа: %1'");
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипСсылки);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ДокументПродажи_АктВыполненныхРабот(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	ВЫРАЗИТЬ(ДанныеДокумента.ПодписьРуководителя.РасшифровкаПодписи КАК СТРОКА(1000)) КАК ПодписантФамилияИО,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.НалогообложениеНДС <> &ТипНалогообложения_НеОблагаетсяНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ДанныеДокумента.Содержание КАК СодержаниеУслуги,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	&ПолеХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	&ПолеСуммаСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.РаботыИУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ЗаполнитьВыраженияЗапросаПоУмолчанию(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	МодельШапка.РуководительФИО = ДанныеШапки.ПодписантФамилияИО;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			Запись.НоменклатураНаименование,
			Запись.ХарактеристикаНаименование,
			Запись.СодержаниеУслуги
		);
		
		Если Запись.СуммаСкидки <> 0 Тогда
			СчетаНаОплату_ПересчитатьЦену(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура СчетаНаОплату_ДокументПродажи_РасходнаяНакладная(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	ВЫРАЗИТЬ(ДанныеДокумента.ПодписьРуководителя.РасшифровкаПодписи КАК СТРОКА(1000)) КАК ПодписантФамилияИО,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.НалогообложениеНДС <> &ТипНалогообложения_НеОблагаетсяНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РасходнаяНакладная КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ДанныеДокумента.Содержание КАК СодержаниеУслуги,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	&ПолеХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	&ПолеСуммаСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК НомерТабличнойЧасти,
	|	1 КАК НомерСтроки,
	|	ДанныеДокумента.НоменклатураДоставки КАК Номенклатура,
	|	&ПолеНоменклатураДоставкиАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураДоставкиНаименование КАК НоменклатураНаименование,
	|	"""" КАК СодержаниеУслуги,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	"""" КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.НоменклатураДоставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	ДанныеДокумента.СтоимостьДоставки КАК Цена,
	|	ДанныеДокумента.СтавкаНДСДоставки КАК СтавкаНДС,
	|	0 КАК СуммаСкидки,
	|	ДанныеДокумента.СтоимостьДоставки КАК Сумма,
	|	ДанныеДокумента.СуммаНДСДоставки КАК СуммаНДС
	|ИЗ
	|	Документ.РасходнаяНакладная КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|	И &УсловиеВыводитьДоставку
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ЗаполнитьВыраженияЗапросаПоУмолчанию(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
		
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	МодельШапка.РуководительФИО = ДанныеШапки.ПодписантФамилияИО;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
		
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			Запись.НоменклатураНаименование,
			Запись.ХарактеристикаНаименование,
			Запись.СодержаниеУслуги
		);
		
		Если Запись.СуммаСкидки <> 0 Тогда
			СчетаНаОплату_ПересчитатьЦену(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчетаНаОплату_ДокументПродажи_ОтчетОПереработке(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	ВЫРАЗИТЬ(ДанныеДокумента.ПодписьРуководителя.РасшифровкаПодписи КАК СТРОКА(1000)) КАК ПодписантФамилияИО,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.НалогообложениеНДС <> &ТипНалогообложения_НеОблагаетсяНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетОПереработке КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ДанныеДокумента.Содержание КАК СодержаниеУслуги,
	|	ДанныеДокумента.Характеристика КАК Характеристика,
	|	&ПолеХарактеристикаНаименование КАК ХарактеристикаНаименование,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	&ПолеСуммаСкидки КАК СуммаСкидки,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОПереработке.Продукция КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ЗаполнитьВыраженияЗапросаПоУмолчанию(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	МодельШапка.РуководительФИО = ДанныеШапки.ПодписантФамилияИО;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			Запись.НоменклатураНаименование,
			Запись.ХарактеристикаНаименование,
			Запись.СодержаниеУслуги
		);
		
		Если Запись.СуммаСкидки <> 0 Тогда
			СчетаНаОплату_ПересчитатьЦену(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчетаНаОплату_ДокументПродажи_ОтчетКомитенту(МодельШапка, МодельТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	ВЫРАЗИТЬ(ДанныеДокумента.ПодписьРуководителя.РасшифровкаПодписи КАК СТРОКА(1000)) КАК ПодписантФамилияИО,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.НалогообложениеНДС <> &ТипНалогообложения_НеОблагаетсяНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	1 КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	"""" КАК НоменклатураАртикул,
	|	""Комиссионное вознаграждение"" КАК НоменклатураНаименование,
	|	""Комиссионное вознаграждение"" КАК СодержаниеУслуги,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	"""" КАК ХарактеристикаНаименование,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	0 КАК СуммаСкидки,
	|	СУММА(ДанныеДокумента.СуммаВознаграждения) КАК Цена,
	|	СУММА(ДанныеДокумента.СуммаВознаграждения) КАК Сумма,
	|	СУММА(ДанныеДокумента.СуммаНДСВознаграждения) КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетКомитенту.Запасы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.СтавкаНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", Справочники.КлассификаторЕдиницИзмерения.Шт);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	МодельШапка.РуководительФИО = ДанныеШапки.ПодписантФамилияИО;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			Запись.НоменклатураНаименование,
			Запись.ХарактеристикаНаименование,
			Запись.СодержаниеУслуги
		);
		
		Если Запись.СуммаСкидки <> 0 Тогда
			СчетаНаОплату_ПересчитатьЦену(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВыраженияЗапросаПоУмолчанию(ТекстЗапроса)
	
	Подстановки = Новый Соответствие;
	Подстановки.Вставить(
		"&ПолеНоменклатураНаименование",
		ВыражениеЗапросаНоменклатураНаименование("ДанныеДокумента.Номенклатура")
	);
	Подстановки.Вставить(
		"&ПолеНоменклатураДоставкиНаименование",
		ВыражениеЗапросаНоменклатураНаименование("ДанныеДокумента.НоменклатураДоставки")
	);
	Подстановки.Вставить(
		"&ПолеНоменклатураАртикул",
		ВыражениеЗапросаНоменклатураАртикул("ДанныеДокумента.Номенклатура")
	);
	Подстановки.Вставить(
		"&ПолеНоменклатураДоставкиАртикул",
		ВыражениеЗапросаНоменклатураАртикул("ДанныеДокумента.НоменклатураДоставки")
	);
	Подстановки.Вставить(
		"&ПолеХарактеристикаНаименование",
		ВыражениеЗапросаХарактеристикаНаименование("ДанныеДокумента.Характеристика")
	);
	Подстановки.Вставить(
		"&ПолеСуммаСкидки",
		ВыражениеЗапросаСуммаСкидки("ДанныеДокумента.СуммаСкидкиНаценки", "ДанныеДокумента.СуммаАвтоматическойСкидки")
	);
	Подстановки.Вставить(
		"&УсловиеВыводитьДоставку",
		ВыражениеЗапросаУсловиеВыводитьДоставку("ДанныеДокумента.НоменклатураДоставки", "ДанныеДокумента.СтоимостьДоставки")
	);
	
	Для Каждого Элемент Из Подстановки Цикл
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			Элемент.Ключ,
			Элемент.Значение
		);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыражениеЗапросаНоменклатураАртикул(ПолеНоменклатура)
	
	ЗначениеКонстанты = Константы.ПредставлениеКодовВПечатныхФормах.Получить();
	
	Если ЗначениеКонстанты = Перечисления.КодыНоменклатурыВДокументах.Артикул Тогда
		Выражение = "ПсевдонимТаблицы.Номенклатура.Артикул";
	ИначеЕсли ЗначениеКонстанты = Перечисления.КодыНоменклатурыВДокументах.Код Тогда
		Выражение = "ПсевдонимТаблицы.Номенклатура.Код";
	ИначеЕсли ЗначениеКонстанты = Перечисления.КодыНоменклатурыВДокументах.Штрихкод Тогда
		Выражение = "ПсевдонимТаблицы.Номенклатура.Штрихкод";
	Иначе
		Выражение = """""";
	КонецЕсли;
	
	Результат = СтрЗаменить(
		Выражение,
		"ПсевдонимТаблицы.Номенклатура",
		ПолеНоменклатура
	);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеЗапросаНоменклатураНаименование(ПолеНоменклатура)
	
	Выражение = 
	"ВЫБОР
	|		КОГДА НЕ (ПсевдонимТаблицы.Номенклатура.НаименованиеПолное ПОДОБНО """")
	|			ТОГДА ПсевдонимТаблицы.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ПсевдонимТаблицы.Номенклатура.Наименование
	|	КОНЕЦ";
	
	Результат = СтрЗаменить(
		Выражение,
		"ПсевдонимТаблицы.Номенклатура",
		ПолеНоменклатура
	);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеЗапросаХарактеристикаНаименование(ПолеХарактеристика)
	
	Выражение = 
	"ВЫБОР
	|		КОГДА НЕ (ПсевдонимТаблицы.Характеристика.НаименованиеДляПечати ПОДОБНО """")
	|			ТОГДА ПсевдонимТаблицы.Характеристика.НаименованиеДляПечати
	|		ИНАЧЕ ПсевдонимТаблицы.Характеристика.Наименование
	|	КОНЕЦ";
	
	Результат = СтрЗаменить(Выражение, "ПсевдонимТаблицы.Характеристика", ПолеХарактеристика);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеЗапросаСуммаСкидки(ПолеСуммаСкидкиНаценки, ПолеСуммаАвтоматическойСкидки)
	
	Результат = "ПсевдонимТаблицы.СуммаСкидкиНаценки + ПсевдонимТаблицы.СуммаАвтоматическойСкидки";
	
	Результат = СтрЗаменить(Результат, "ПсевдонимТаблицы.СуммаСкидкиНаценки", ПолеСуммаСкидкиНаценки);
	Результат = СтрЗаменить(Результат, "ПсевдонимТаблицы.СуммаАвтоматическойСкидки", ПолеСуммаАвтоматическойСкидки);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеЗапросаУсловиеВыводитьДоставку(ПолеНоменклатураДоставки, ПолеСтоимостьДоставки)
	
	ЗначениеКонстанты = Константы.ВариантПечатиДоставки.Получить();
	
	Результат = "ПсевдонимТаблицы.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Если ЗначениеКонстанты = Перечисления.ВариантыПечатиДоставки.НеВыводитьБесплатнуюДоставку Тогда
		Результат = "ПсевдонимТаблицы.СтоимостьДоставки > 0";
	КонецЕсли;
	
	Результат = СтрЗаменить(
		Результат,
		"ПсевдонимТаблицы.НоменклатураДоставки",
		ПолеНоменклатураДоставки
	);
	
	Результат = СтрЗаменить(
		Результат,
		"ПсевдонимТаблицы.СтоимостьДоставки",
		ПолеСтоимостьДоставки
	);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыБанковскогоСчета(БанковскийСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.Банк.Наименование КАК БанкНаименование,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеНоменклатурыЛок(Номенклатура, Характеристика, Содержание)
	
	ПараметрыНоменклатуры = Новый Структура;
	ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СокрЛП(Номенклатура));
	ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СокрЛП(Характеристика));
	ПараметрыНоменклатуры.Вставить("Содержание", СокрЛП(Содержание));
	
	ИнтерфейсУНФ = ОбщийМодульПоИмениЛок("ПечатьДокументовУНФ");
	Результат = ИнтерфейсУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры);
	
	Возврат Результат;
	
КонецФункции

Функция АртикулНоменклатуры(Номенклатура)
	
	ДополнительнаяКолонкаНоменклатуры = Константы.ПредставлениеКодовВПечатныхФормах.Получить();
	
	Если ДополнительнаяКолонкаНоменклатуры = Перечисления.КодыНоменклатурыВДокументах.Артикул Тогда
		
		Результат = Номенклатура.Артикул;
		
	ИначеЕсли ДополнительнаяКолонкаНоменклатуры = Перечисления.КодыНоменклатурыВДокументах.Код Тогда
		
		Результат = Номенклатура.Код;
		
	ИначеЕсли ДополнительнаяКолонкаНоменклатуры = Перечисления.КодыНоменклатурыВДокументах.Штрихкод Тогда
		
		Результат = Номенклатура.ШтрихКод;
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает реквизиты участника сделки с учетом истории изменения и настроек
//
// Параметры:
//  Участник - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - участник сделки
//  ДатаСведений - Дата - дата, на которую нужно получить реквизиты
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура - значения реквизитов:
//    * ПолноеНаименование - Строка - Общество с ограниченной ответственностью "Ромашка"
//    * СокращенноеНаименование - Строка - ООО "Ромашка"
//    * НаименованиеДляПечатныхФорм - Строка - Полное или сокращенное наименование (определяется настройкой организации)
//    * ИНН - Строка - ИНН участника
//    * КПП - Строка - КПП участника
//    * Телефоны - Строка - Телефоны участника
//    * ЮридическийАдрес - Строка - Юридический адрес участника
//
Функция СчетаНаОплату_ДанныеЮрФизЛица(Участник, ДатаСведений)
	
	Модель = Новый Структура;
	Модель.Вставить("ПолноеНаименование", "");
	Модель.Вставить("СокращенноеНаименование", "");
	Модель.Вставить("НаименованиеДляПечатныхФорм", "");
	Модель.Вставить("ИНН", "");
	Модель.Вставить("КПП", "");
	Модель.Вставить("Телефоны", "");
	Модель.Вставить("ЮридическийАдрес", "");
	
	МодульЭлектронныеДокументы = ОбщийМодульПоИмениЛок("УправлениеНебольшойФирмойЭлектронныеДокументыСервер");
	
	Данные = МодульЭлектронныеДокументы.ПолучитьДанныеЮрФизЛица(Участник, ДатаСведений);
	
	Модель.ПолноеНаименование = Данные.ПолноеНаименование;
	Модель.НаименованиеДляПечатныхФорм = Данные.ОфициальноеНаименование;
	Модель.ИНН = Данные.ИНН;
	Модель.КПП = Данные.КПП;
	Модель.Телефоны = Данные.Телефоны;
	Модель.ЮридическийАдрес = Данные.ЮридическийАдрес;
	
	Если Данные.Свойство("СокращенноеНаименование") Тогда
		Модель.СокращенноеНаименование = Данные.СокращенноеНаименование;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Модель.СокращенноеНаименование) Тогда
		Модель.СокращенноеНаименование = Данные.Представление;
	КонецЕсли;
	
	Если ТипЗнч(Участник) = Тип("СправочникСсылка.Контрагенты") Тогда
		// функция Справочники.Контрагенты.НаименованияНаДату возвращает
		// наименование элемента, а не официальное наименование
		Модель.СокращенноеНаименование = Модель.ПолноеНаименование;
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ПредставлениеЮрФизЛица(РеквизитыЮрФизЛица)
	
	Результат = РеквизитыЮрФизЛица.НаименованиеДляПечатныхФорм;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = РеквизитыЮрФизЛица.СокращенноеНаименование;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует строку с наименованием и реквизитами юридического или физического лица
//
// Параметры:
//   Реквизиты - Структура - см. СчетаНаОплату_ДанныеЮрФизЛица
//
// Возвращаемое значение:
//   Строка - строковое представление реквизитов
//
Функция СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(Реквизиты)
	
	ШаблонПредставления = "СокращенноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны";
	Результат = ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления);
	
	Возврат Результат;

КонецФункции

Функция ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления)
	
	Перем Префикс, СтрокаДополнения;
	
	СоответствиеПараметров = Новый Структура;
	СоответствиеПараметров.Вставить("ПолноеНаименование", " ");
	СоответствиеПараметров.Вставить("СокращенноеНаименование", " ");
	СоответствиеПараметров.Вставить("НаименованиеДляПечатныхФорм", " ");
	СоответствиеПараметров.Вставить("ИНН", " ИНН ");
	СоответствиеПараметров.Вставить("КПП", " КПП ");
	СоответствиеПараметров.Вставить("Свидетельство", " ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи", " от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес", " ");
	СоответствиеПараметров.Вставить("ФактическийАдрес", " ");
	СоответствиеПараметров.Вставить("Телефоны", " тел.: ");
	СоответствиеПараметров.Вставить("Факс", " факс: ");
	СоответствиеПараметров.Вставить("НомерСчета", " р/с ");
	СоответствиеПараметров.Вставить("Банк", " в банке ");
	СоответствиеПараметров.Вставить("БИК", " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет", " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО", " Код по ОКПО ");
	
	ПропускатьПустыеСтроки = Истина;
	Разделитель = ",";
	СписокПараметров = СтрРазделить(
		ШаблонПредставления,
		Разделитель,
		ПропускатьПустыеСтроки
	);
	
	Результат = Новый Массив;
	
	Для Каждого ИмяПараметра Из СписокПараметров Цикл
		
		Если Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения) Тогда
			
			Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения);
			Если ПустаяСтрока(СтрокаДополнения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СоответствиеПараметров.Свойство(ИмяПараметра, Префикс) Тогда
				Результат.Добавить(Префикс + СтрокаДополнения);
			Иначе
				Результат.Добавить(СтрокаДополнения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаРезультата = СтрСоединить(Результат, ",");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "  ", " ");
	
	Возврат СокрЛП(СтрокаРезультата);
	
КонецФункции

// Пересчитывает цену в строке модели табличной части счета на оплату
//
// Параметры:
//  СтрокаСчетаНаОплату - СтрокаТабличнойЧасти - см. СчетаНаОплату_Данные.ТабличнаяЧасть
//
Процедура СчетаНаОплату_ПересчитатьЦену(СтрокаСчетаНаОплату)
	
	Знаменатель = СтрокаСчетаНаОплату.Количество;
	Если СтрокаСчетаНаОплату.Количество = 0 Тогда
		Знаменатель = 1;
	КонецЕсли;
	
	ТочностьЦены = 2;
	
	СтрокаСчетаНаОплату.Цена = Окр(
		СтрокаСчетаНаОплату.Сумма / Знаменатель,
		ТочностьЦены
	);
	
КонецПроцедуры

Функция СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента)
	
	Результат = СтрШаблон(
		"Счет на оплату № %1 от %2",
		НомерДокумента,
		Формат(ДатаДокумента, "ДФ=dd.MM.yyyy")
	);
	
	Возврат Результат;
	
КонецФункции

// Очищает колонку "СуммаСкидки" в модели табличной части счета на оплату.
// В интеграционном модуле текущей конфигурации скидка уже учтена в цене и
// сумме документа, поэтому выводить её в печатную форму не следует.
//
// Параметры:
//  ТабличнаяЧасть - ТаблицаЗначений - см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату
//
Процедура СчетаНаОплату_ОчиститьСкидки(ТабличнаяЧасть)
	
	ТабличнаяЧасть.ЗаполнитьЗначения(0, "СуммаСкидки");
	
КонецПроцедуры

// Получает код валюты в соответствии с ОКВ
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты - валюта, код которой требуется определить
// 
// Возвращаемое значение:
//  Строка - код валюты по ОКВ
//
Функция КодВалютыПоКлассификатору(Валюта)
	
	РеквизитыВалюты = Новый Структура;
	РеквизитыВалюты.Вставить("Код");
	РеквизитыВалюты.Вставить("ЗагружаетсяИзИнтернета");
	РеквизитыВалюты.Вставить("ОсновнаяВалютаКод", "ОсновнаяВалюта.Код");
	
	ЗначенияРеквизитов = БСП_ЗначенияРеквизитовОбъекта(Валюта, РеквизитыВалюты);
	
	Результат = СокрЛП(ЗначенияРеквизитов.Код);
	Если Не ЗначенияРеквизитов.ЗагружаетсяИзИнтернета
		И ЗначениеЗаполнено(ЗначенияРеквизитов.ОсновнаяВалютаКод) Тогда
		Результат = СокрЛП(ЗначенияРеквизитов.ОсновнаяВалютаКод);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция БСП_ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты)
	
	ВыбиратьРазрешенные = Истина;
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СсылкаНаОбъект,
		Реквизиты,
		ВыбиратьРазрешенные
	);
	
	Возврат Результат;
	
КонецФункции

Функция АктыСверок_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	Если ТипОбъекта <> Тип("ДокументСсылка.СверкаВзаиморасчетов") Тогда
		
		Ошибка = СтрШаблон(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ДокументПечати = Новый Массив;
	ДокументПечати.Добавить(СсылкаНаОбъект);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	КоллекцияПечатныхФорм = НовыйКоллекцияПечатныхФормДляПечатиДокумента();
	
	АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм);
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Контракт_ПараметрыВывода_Печать();
	
	МенеджерПечати = Документы.СверкаВзаиморасчетов;
	МенеджерПечати.Печать(
		ДокументПечати,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода
	);
	
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			
			ТабличныйДокумент = Стр.ТабличныйДокумент;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Контракт_ПараметрыОтправки_Печать()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Получатель", "");
	Результат.Вставить("Тема", "");
	Результат.Вставить("Текст", "");
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ПараметрыВывода_Печать()
	
	ПараметрыОтправки = Контракт_ПараметрыОтправки_Печать();
	
	Результат = Новый Структура;
	
	
	Результат.Вставить("ПараметрыОтправки", ПараметрыОтправки);
	Результат.Вставить("КодЯзыка", "");
	Результат.Вставить("ЗаголовокФормы", "");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправлениеРеализации(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВидОперации");
		Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураНаАванс(СФ) Экспорт
	
	Если ТипЗнч(СФ) = Тип("ДокументСсылка.СчетФактура") Тогда
		Возврат СФ.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	Возврат "без НДС";
КонецФункции

Функция ОсновнаяСтрана()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "РОССИЯ");
	Результат.Вставить("Код", "643");
	
	Возврат Результат;
	
КонецФункции

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКонтактнойИнформации() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес", "ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	Результат.Вставить("Телефон", "Телефон");
	Результат.Вставить("Факс", "Факс");
	
	Возврат Результат;
	
КонецФункции

Функция ВидАдресаЮрФизЛица(Ссылка, ТипАдреса)
	
	Перем Результат, ИмяВладельца;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ИмяВладельца = "Организации";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяВладельца = "Контрагента";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		ИмяВладельца = "СтруктурнойЕдиницы";
	Иначе
		ИмяВладельца = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВладельца) Тогда
		
		ВидыКИЮридическийАдрес = Перечисление_ВидыКонтактнойИнформации().ЮридическийАдрес;
		
		Если ТипАдреса = ВидыКИЮридическийАдрес Тогда
			ИмяВида = "ЮрАдрес";
		Иначе
			ИмяВида = "ФактАдрес";
		КонецЕсли;
		
		ВидЭлементаКИ = ИмяВида + ИмяВладельца;
		
		Результат = Справочники.ВидыКонтактнойИнформации[ВидЭлементаКИ];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АдминистративноТерриториальныйАдрес()
	
	ОбщийМодульИмя = "РаботаСАдресамиКлиентСервер";
	
	Если НЕ Метаданные.ОбщиеМодули.Найти(ОбщийМодульИмя) = Неопределено Тогда
		ОбщийМодульРаботаСАдресами = ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ОбщийМодульИмя);
		
		Результат = ОбщийМодульРаботаСАдресами.АдминистративноТерриториальныйАдрес();
	Иначе
		Результат = "Административно-территориальный";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторТабличнойЧасти(ИмяТабличнойЧасти)
	
	Результат = Перечисления.ТабличныеЧастиДокументов[ИмяТабличнойЧасти];
	
	Возврат Результат;
	
КонецФункции

Функция ИспользоватьБазовыеЕдиницыИзмеренияВТабличнойЧастиДокумента()
	
	НастройкаПользовательскаяЕИ = Константы.ПечатьПользовательскихЕдиницИзмерения.Получить();
	ПеречислениеПользовательскиеЕИ = Перечисления.ПечатьПользовательскихЕдиницИзмерения;
	ЗначениеПользовательскаяЕИ = ПеречислениеПользовательскиеЕИ.ФормироватьПечатныйДокументВПользовательскойЕдинице;
	
	Результат = (НастройкаПользовательскаяЕИ = ЗначениеПользовательскаяЕИ);
	Результат = Формат(Результат, "БИ='ИСТИНА'; БЛ='ЛОЖЬ'");
	
	Возврат Результат;
	
КонецФункции

Функция ВДокументеЕстьТабличнаяЧасть(ТипДокумента, ИмяТабличнойЧасти)
	
	Результат = Истина;
	
	ТабличныеЧастиДокумента = Метаданные.Документы[ТипДокумента].ТабличныеЧасти;
	
	Если ТабличныеЧастиДокумента.Найти(ИмяТабличнойЧасти) = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет мету электронных актов и накладных
//
// Параметры:
//  Мета - Структура - модель меты передаточного документа
//  УчетныйДокумент - ЛюбаяСсылка - основание электронного акта или накладной
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартный обработчик заполнения меты
//
Процедура ПередаточныеДокументы_ЗаполнитьМету(Мета, УчетныйДокумент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ТипОснования = ТипЗнч(УчетныйДокумент);
	
	Если ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ПередаточныеДокументы_ЗаполнитьМетуПоРасходнойНакладной(Мета, УчетныйДокумент);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		
		ПередаточныеДокументы_ЗаполнитьМетуПоАктуВыполненныхРабот(Мета, УчетныйДокумент);
		
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередаточныеДокументы_ЗаполнитьМетуПоРасходнойНакладной(Мета, РасходнаяНакладная)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ВалютаДокумента.Код КАК ВалютаКод,
	|	Шапка.НалогообложениеНДС = &ТипНалогообложения_НеОблагаетсяНДС КАК БезНДС,
	|	Шапка.СуммаДокумента КАК СуммаДокумента,
	|	Шапка.СуммаНДСДоставки КАК СуммаНДСДоставки,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК ТЧ
	|		ПО Шапка.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка,
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.ВалютаДокумента.Код,
	|	Шапка.СуммаДокумента,
	|	Шапка.СуммаНДСДоставки,
	|	Шапка.НалогообложениеНДС = &ТипНалогообложения_НеОблагаетсяНДС";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", РасходнаяНакладная);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Мета.Дата = Выборка.Дата;
	Мета.Номер = ПредставлениеНомера(Выборка.Номер);
	Мета.Сумма = Выборка.СуммаДокумента;
	Мета.СуммаНДС = Выборка.СуммаНДС + Выборка.СуммаНДСДоставки;
	Мета.ДокументБезНДС = Выборка.БезНДС;
	Мета.КодВалюты = Выборка.ВалютаКод;
	
КонецПроцедуры

Процедура ПередаточныеДокументы_ЗаполнитьМетуПоАктуВыполненныхРабот(Мета, АктВыполненныхРабот)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ВалютаДокумента.Код КАК ВалютаКод,
	|	Шапка.НалогообложениеНДС = &ТипНалогообложения_НеОблагаетсяНДС КАК БезНДС,
	|	Шапка.СуммаДокумента КАК СуммаДокумента,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.РаботыИУслуги КАК ТЧ
	|		ПО Шапка.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка,
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.ВалютаДокумента.Код,
	|	Шапка.СуммаДокумента,
	|	Шапка.НалогообложениеНДС = &ТипНалогообложения_НеОблагаетсяНДС";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", АктВыполненныхРабот);
	Запрос.УстановитьПараметр("ТипНалогообложения_НеОблагаетсяНДС", Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Мета.Дата = Выборка.Дата;
	Мета.Номер = ПредставлениеНомера(Выборка.Номер);
	Мета.Сумма = Выборка.СуммаДокумента;
	Мета.СуммаНДС = Выборка.СуммаНДС;
	Мета.ДокументБезНДС = Выборка.БезНДС;
	Мета.КодВалюты = Выборка.ВалютаКод;
	
КонецПроцедуры

Функция СведенияОбАдресеЛок(АдресСтрокойJSON)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПроверитьАдрес", Ложь);
	ДопПараметры.Вставить("КодыАдреса", Истина);
	
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("РаботаСАдресами");
	
	Результат = ИнтерфейсБСП.СведенияОбАдресе(АдресСтрокойJSON, ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМуниципальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Муниципальный"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоАдминистративноТерриториальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Административно-территориальный"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоТипАдреса_ВСвободнойФорме(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег(ТипАдресаВСвободнойФорме()));
	Возврат Результат;
	
КонецФункции

Функция ЕстьНесоответствующиеСтруктуреАдрРФПоля(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ПоляНеПоАдресРФ = Новый Массив;
	ПоляНеПоАдресРФ.Добавить("Округ");
	ПоляНеПоАдресРФ.Добавить("Поселение");
	ПоляНеПоАдресРФ.Добавить("ВнутригородскойРайон");
	ПоляНеПоАдресРФ.Добавить("Территория");
	ПоляНеПоАдресРФ.Добавить("ДополнительнаяТерритория");
	ПоляНеПоАдресРФ.Добавить("ЭлементДополнительнойТерритории");
	ПоляНеПоАдресРФ.Добавить("НомерЗемельногоУчастка");
	
	Для Каждого ИмяПоля Из ПоляНеПоАдресРФ Цикл 
		
		ЗначениеПоля = СвойствоСтруктурыЛок(СведенияОбАдресе, ИмяПоля);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТипКорпусаАдрРФ()
	
	Возврат "Корпус";
	
КонецФункции

Функция ТипПомещенияАдрРФ()
	
	Возврат "Квартира";
	
КонецФункции

Функция ТипЗданияАдрРФ()
	
	Возврат "Дом";
	
КонецФункции

// ВАЖНО! Возвращает сохраненное представление адреса из строки JSON, если оно заполнено.
// В противном случае представление составляется по данным полей JSON и полученное таким образом
// представления аналогично тому, что возвращается в поле Представление структуры, полученнной
// в результате вызова метода РаботаСАдресами.СведенияОбАдресе()
//
// Параметры:
//  АдресСтрокойJSON - Строка - строка JSON с данными адреса
// 
// Возвращаемое значение:
//  Строка - представление адреса
//
Функция ПредставлениеАдреса(АдресСтрокойJSON)
	
	МодульУправленияКИ = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	Результат = МодульУправленияКИ.ПредставлениеКонтактнойИнформации(АдресСтрокойJSON);
	
	Возврат Результат;
	
КонецФункции

Функция ТипАдресаВСвободнойФорме()
	Возврат "ВСвободнойФорме";
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Пакеты_НачатьКатегорию(Знач Идентификатор, Знач Представление)
	
	_ТекущаяКатегорияПакетов = Новый Структура;
	_ТекущаяКатегорияПакетов.Вставить("Идентификатор", Идентификатор);
	_ТекущаяКатегорияПакетов.Вставить("Представление", Представление);
	
КонецПроцедуры

Функция Пакеты_ДобавитьВидПакета(ВидыПакетов, Знач Идентификатор, Знач Представление, Знач Состав)
	
	Если Не ЗначениеЗаполнено(_ТекущаяКатегорияПакетов) Тогда
		Пакеты_НачатьКатегорию(КатегорииПакетов_БезКатегории(), "");
	КонецЕсли;
	
	ОписаниеПакета = ВидыПакетов.Добавить();
	ОписаниеПакета.ID = Идентификатор;
	ОписаниеПакета.Наименование = Представление;
	ОписаниеПакета.СоставПакета = Состав;
	ОписаниеПакета.КатегорияПакета = _ТекущаяКатегорияПакетов.Идентификатор;
	ОписаниеПакета.НаименованиеКатегории = _ТекущаяКатегорияПакетов.Представление;
	
	Возврат ОписаниеПакета;
	
КонецФункции

Функция КатегорииПакетов_Основная()
	Возврат "ОсновнойПакет";
КонецФункции

Функция КатегорииПакетов_СчетаНаОплату()
	Возврат "СчетНаОплату";
КонецФункции

Функция КатегорииПакетов_БезКатегории()
	Возврат "БезКатегории";
КонецФункции

//{ Взаимодействие с библиотекой ГенерацияXML

Функция ФункцияДокументаУПД_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции

Функция ФункцияДокументаУПД_ДОП()
	Возврат ГенерацияXML_ФункцииУПД().ДОП;
КонецФункции

Функция ФункцияДокументаУПД_СЧФДОП()
	Возврат ГенерацияXML_ФункцииУПД().СЧФДОП;
КонецФункции

Функция ГенерацияXML_ФункцииУПД()
	Результат = ГенерацияXML.Перечисление_ФункцииУПД();
	Возврат Результат;	
КонецФункции

Функция ГенерацияXML_Перечисление_ВидыЮрФизЛиц()
	
	Результат = ГенерацияXML.Перечисление_ВидыЮрФизЛиц();
	Возврат Результат;
	
КонецФункции

Функция ГенерацияXML_КодыРегионов()
	
	Результат = ГенерацияXML.КодыРегионов();
	Возврат Результат;
	
КонецФункции

Функция Новый_ЭлементПрото(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы);
	
	Возврат Результат;
	
КонецФункции

//} Взаимодействие с библиотекой ГенерацияXML

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблон("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность = "")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция КатегорииПакетов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"ОсновнойПакет");
	Результат.Вставить("КорректировочныйПакет", "КорректировочныйПакет");
	Результат.Вставить("СчетФактураНаАванс", 	"СчетФактураНаАванс");
	Результат.Вставить("СчетНаОплату", 			"СчетНаОплату");
	Результат.Вставить("АктCверки", 			"АктCверки");
	Результат.Вставить("БезКатегории",			"БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКатегории()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"Первичные документы");
	Результат.Вставить("КорректировочныйПакет", "Корректировочные документы");
	Результат.Вставить("СчетФактураНаАванс", 	"Счет-фактура на аванс");
	Результат.Вставить("СчетНаОплату", 			"Счет на оплату");
	Результат.Вставить("АктCверки", 			"Акт сверки");
	Результат.Вставить("БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Функция МожноСформироватьПередаточныйДокумент(Документ1С)
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	Результат = (ИсключаемыеТипы.Найти(ТипДокумента) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(
		Пакет,
		Документ1С,
		"ID_УПД_ДОП"
	);
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоУслуги = ДокументСодержитТолькоУслуги(Документ1С);
	ВидДокумента = "ID_ТОРГ12";
	
	Если ТолькоУслуги Тогда
		ВидДокумента = "ID_АктФормализованный";
	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, ВидДокумента);
	
КонецПроцедуры

Функция ДокументСодержитТолькоУслуги(Документ1С)
	
	Результат = Истина;
	
	ЕстьТовары = Документ1С.Метаданные().ТабличныеЧасти.Найти("Запасы") <> Неопределено;
	ЭтоОтчетКомитенту = ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомитенту");
	
	Если ЕстьТовары И Не ЭтоОтчетКомитенту Тогда
		
		ШаблонЗапроса =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК ВсегоСтрок,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТЧ.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьУслуги,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ ТЧ.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслуги)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьТовары
		|ИЗ
		|	&ПолноеИмяТаблицы КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &СсылкаНаОбъект";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СсылкаНаОбъект", Документ1С);
		Запрос.УстановитьПараметр("ТипыНоменклатурыУслуги", ТипыНоменклатурыУслуги());
		
		ПолноеИмяТаблицы = СтрШаблон("%1.%2", Документ1С.Метаданные().ПолноеИмя(), "Запасы");
		
		Запрос.Текст = СтрЗаменить(ШаблонЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ВсегоСтрок > 0 Тогда
				Результат = Выборка.ЕстьУслуги И Не Выборка.ЕстьТовары;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипыНоменклатурыУслуги()
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	Результат.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Результат)
		
	// Ищем ТОРГ-12 или УПД, относящийся к другому (не к текущему) пакету, и находящийся в статусе "Требуется подпись" или "Подписан".
	// Еще искомый документ должен быть уже проверен и признан "хорошим" (возможно, его еще не подписали, но уже проверили)
	// Если такой есть, то по текущему документу будем отказывать в подписи, т.к. это дубль
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить("XmlTorg12");
	ТипыДокументов.Добавить("UniversalTransferDocument");
	
	Статусы  = Новый Массив;
	Статусы.Добавить("Подписан");
	Статусы.Добавить("Требуется подпись");
	
	Если ОсновнойМодуль.ЭДО_Использовать1СЭДО() Тогда 
		//TODO добавить проверку дублей для 1С-ЭДО
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.АнализПроведен КАК АнализПроведен,
		|	Диадок_Документы.ТекстОшибки КАК ОшибкиПроверкиТекст
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка <> &ТекущийДокументДД
		|	И Диадок_Документы.LetterId <> &LetterId
		|	И Диадок_Документы.Документ = &Документ1С
		|	И (Диадок_Документы.Направление = ""Inbound"" или Диадок_Документы.Направление = ""Входящее"" )  //переходный период перед релизом 1.0.0
		|	И Диадок_Документы.ТипДокумента В(&ТипДокумента)
		|	И Диадок_Документы.АнализПроведен
		|	И Диадок_Документы.Статус В(&Статусы)
		|	И Выразить(Диадок_Документы.ТекстОшибки как строка(1)) = """"     //  ТекстОшибки сейчас неограниченная строка. Выразить работает в сторону уменьшения длины, но не увеличения
		//|	И Диадок_Документы.ДатаЗагрузки <= &ДатаЗагрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диадок_Документы.ДатаЗагрузки";
		
		Запрос.УстановитьПараметр("ТекущийДокументДД",	ДокументДД);
		Запрос.УстановитьПараметр("Документ1С",			Документ1С);
		Запрос.УстановитьПараметр("ТипДокумента",		ТипыДокументов);
		Запрос.УстановитьПараметр("Статусы",			Статусы);		
		Запрос.УстановитьПараметр("LetterId",			ДокументДД.LetterId);
		Запрос.УстановитьПараметр("ДатаЗагрузки",		ДокументДД.ДатаЗагрузки);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 И ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда
			Док = Выборка[0].Ссылка;
			Результат.Добавить("ДУБЛИКАТ: накладная уже была учтена в электронном виде (дата " + формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy")
			+ ", номер " + Док.НомерДокумента + ", загружен из Диадок " + Док.ДатаЗагрузки + ")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтентОтвета(ДокументДД, Документ1С, ДействиеВДД, ТекстВсехОшибок)
	
	Content = ОсновнойМодуль.ЭДО_ПолучитьПустойКонтентОтветаДляДокумента(ДокументДД, ДействиеВДД);
	
	ИмяТипаОбъектаXDTO = НРег(Content.Тип().Имя);
	
	Если ИмяТипаОбъектаXDTO = "torg12buyercontent" Тогда
		
		Content.ShipmentReceiptDate = Документ1С.Дата;
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Receiver, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, получившее груз
		ЗаполнитьПодпись(Content.Accepter, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, принявшее груз

	ИначеЕсли ИмяТипаОбъектаXDTO = "utdbuyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.Creator				= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.CreatorBase			= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd820buyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.DocumentCreator		= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.DocumentCreatorBase	= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";	
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd970buyercontent" Тогда
		
		Content.AcceptanceDate	 = Документ1С.Дата;
		Content.DocumentCreator	 = "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.OperationContent = "Товары и услуги получены, претензий нет";
		
		Content.ContentOperCode.TotalCode = "1";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта);
		
		Content.Employee.EmployeePosition = ДанныеПодписанта.Должность;
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "acceptancecertificatebuyercontent" Тогда
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Official, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, подписывающее со стороны заказчика
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "correctionrequestcontent"	// запрос на уточнение по СФ
		Или ИмяТипаОбъектаXDTO = "formalizedrejectioncontent"  // отказ по формализованному
		Или ИмяТипаОбъектаXDTO = "rejectioncontent" Тогда		// отказ по неформализованному
				
		Content.Comment = ТекстВсехОшибок;
		
	КонецЕсли;	
	
	Возврат Content;
	
КонецФункции

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат =
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Документ,
	|	СчетФактура.Номер КАК НомерДокумента,
	|	СчетФактура.Дата КАК ДатаДокумента,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.Организация КАК Организация,
	|	&СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетФактурыПоОтчетуКомиссионера КАК СчетФактурыПоОтчетуКомиссионера
	|		ПО СчетФактура.Ссылка = СчетФактурыПоОтчетуКомиссионера.Документ
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетФактура.Проведен
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетФактура.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактура.Продажа)
	|	И НЕ СчетФактура.Исправление
	|	И СчетФактурыПоОтчетуКомиссионера.Документ ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка,
	|	СчетФактура.Номер,
	|	СчетФактура.Дата,
	|	СчетФактура.Контрагент,
	|	СчетФактура.Организация,
	|	&СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетФактурыПоОтчетуКомиссионера КАК СчетФактурыПоОтчетуКомиссионера
	|		ПО СчетФактура.Ссылка = СчетФактурыПоОтчетуКомиссионера.Документ
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И НЕ СчетФактура.ПометкаУдаления
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетФактура.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактура.Продажа)
	|	И СчетФактурыПоОтчетуКомиссионера.Документ ЕСТЬ NULL
	|	И НЕ СчетФактура.Исправление";
	
	ЕстьРеквизитСуммаНДСДокумента = ЕстьРеквизитИлиСвойствоОбъектаЛок(
		Документы.СчетФактура.ПустаяСсылка(),
		"СуммаНДСДокумента"
	);
	
	Если ЕстьРеквизитСуммаНДСДокумента Тогда
		ВыражениеСумма = "СчетФактура.СуммаДокумента + СчетФактура.СуммаНДСДокумента";
	Иначе
		ВыражениеСумма = "СчетФактура.СуммаДокумента";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&СуммаДокумента", ВыражениеСумма);
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
										   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Исправление", "СчетФактура.Исправление");
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "Продажа",		ВидСчетаФактуры);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;

	Результат = 
	"ВЫБРАТЬ
	|	СчетФактурыПоОтчетуКомиссионера.Документ КАК Документ,
	|	СчетФактурыПоОтчетуКомиссионера.НомерДокумента КАК НомерДокумента,
	|	СчетФактурыПоОтчетуКомиссионера.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактурыПоОтчетуКомиссионера.Контрагент КАК Контрагент,
	|	СчетФактурыПоОтчетуКомиссионера.Организация КАК Организация,
	|	СчетФактурыПоОтчетуКомиссионера.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	ВТ_СчетФактурыПоОтчетуКомиссионера КАК СчетФактурыПоОтчетуКомиссионера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактурыПоОтчетуКомиссионера.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактурыПоОтчетуКомиссионера.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактурыПоОтчетуКомиссионера.Документ = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ СчетФактурыПоОтчетуКомиссионера.Сводный
	|	И ВЫБОР
	|			КОГДА ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СчетФактурыПоОтчетуКомиссионера.Проведен
	|		КОНЕЦ";
		
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	   		    	        	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;

	Результат =
	"ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
	|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И ВТ_ДокументыБезНДС.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
	|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";	
	    	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(Результат, "И (ВТ_ДокументыБезНДС.ЭтоИсправление)", "И (НЕ ВТ_ДокументыБезНДС.ЭтоИсправление)");
	КонецЕсли;
	
	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		Результат = СтрЗаменить(Результат, "И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)", "И (ВТ_ДокументыБезНДС.ЭтоКорректировка)");
	КонецЕсли;

	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
										   
	Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
									   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
										   
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
	|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
	|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
	|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
	|	СчетНаОплатуПокупателю.Организация КАК Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетНаОплатуПокупателю.Проведен
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка,
	|	СчетНаОплатуПокупателю.Номер,
	|	СчетНаОплатуПокупателю.Дата,
	|	СчетНаОплатуПокупателю.Контрагент,
	|	СчетНаОплатуПокупателю.Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
		Результат,
		ОписаниеВидаПакета,
		ИмяТаблицыМетаданных,
		ЗначениеОснования)
		
	ТаблицаМетаданныхОтчетКомитенту = "ОтчетКомитенту";
		
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка 			КАК Документ,
		|	ТаблицаДокумент.Номер 			КАК НомерДокумента,
		|	ТаблицаДокумент.Дата 			КАК ДатаДокумента,
		|	ТаблицаДокумент.Контрагент 		КАК Контрагент,
		|	ТаблицаДокумент.Организация 	КАК Организация,
		|	&СуммаДокумента 	КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Проведен
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка,
		|	ТаблицаДокумент.Номер,
		|	ТаблицаДокумент.Дата,
		|	ТаблицаДокумент.Контрагент,
		|	ТаблицаДокумент.Организация,
		|	ТаблицаДокумент.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыМетаданных", "Документ." + ИмяТаблицыМетаданных);
	
	ВидДокументаID = ВидДокументаIDПоВидуПакетаID(ВидПакетаID);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДокументаID", """" + ВидДокументаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеНастройкиФормироватьНаОсновании", """" + ЗначениеОснования + """");
	
	Если ИмяТаблицыМетаданных = ТаблицаМетаданныхОтчетКомитенту Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДокумента", "ТаблицаДокумент.СуммаВознаграждения");
		
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДокумента", "ТаблицаДокумент.СуммаДокумента");
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета);
	
	Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса;
	
КонецПроцедуры

Функция ВидДокументаIDПоВидуПакетаID(ВидПакетаID)
	
	Результат = "";
	
	Если 	ВидПакетаID = "ID_Счет"
		Или ВидПакетаID = "ID_СчетФормализованный" Тогда
		
		Результат = ВидПакетаID;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
	|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
	|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СверкаВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	|	&ЭтоДокументКонтрагента
	|";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов3_0_2(Результат);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов3_0_2(ТекстЗапроса)
	
	ЭтоДокументКонтрагента = "";
	Если ИспользуетсяСверкаВзаиморасчетов3_0_2() Тогда
		ЭтоДокументКонтрагента = "И НЕ АктСверкиВзаиморасчетов.ЭтоДокументКонтрагента";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоДокументКонтрагента", ЭтоДокументКонтрагента);
	
КонецПроцедуры

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	КатегорииПакетов = КатегорииПакетов();
	ОсновнойПакет = КатегорииПакетов.ОсновнойПакет;
	
	ПодстрокаПоиска = "&УсловиеСвязиПоКатегорииПакета";
	
	Если ЗначениеЗаполнено(КатегорияПакета) Тогда
		ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """"
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета ЕСТЬ NULL";
	Иначе
		ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID
			+ " ИЛИ ОтправленныеДокументы.ВидПакета ЕСТЬ NULL";
	КонецЕсли;
	
	Если КатегорияПакета = КатегорииПакетов.СчетНаОплату Тогда
		
		ПодстрокаЗамены = ПодстрокаЗамены
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета = """ + ОсновнойПакет + """";
		
		ИспользоватьСХ2 = НЕ ОсновнойМодуль.ИспользоватьПодсистемуДиадока();
		ОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
		
		Если ИспользоватьСХ2 И ОснованияПоУмолчанию Тогда
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Результат = Ядро.СписокНаОтправку_ТекстЗапроса_ВременныеТаблицы();
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса)
	
	ТекстЗапросаВременныхТаблиц = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактура.Ссылка КАК Документ,
	|	СчетФактура.Проведен КАК Проведен,
	|	СчетФактура.Номер КАК НомерДокумента,
	|	СчетФактура.Дата КАК ДатаДокумента,
	|	СчетФактура.Организация КАК Организация,
	|	&СуммаДокумента КАК СуммаДокумента,
	|	СчетФактура.СводныйКомиссионный КАК Сводный,
	|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.Контрагент КАК Справочник.Контрагенты) КАК Контрагент
	|ПОМЕСТИТЬ ВТ_СчетФактурыПоОтчетуКомиссионера
	|ИЗ
	|	Документ.СчетФактура.ДокументыОснования КАК СФ_ДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактура
	|		ПО (СчетФактура.Ссылка = СФ_ДокументыОснования.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера КАК ОтчетКомиссионераОПродажах
	|		ПО СФ_ДокументыОснования.ДокументОснование = ОтчетКомиссионераОПродажах.Ссылка
	|ГДЕ
	|	СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетФактура.ПометкаУдаления
	|	И СчетФактура.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактура.Продажа)
	|	И НЕ ОтчетКомиссионераОПродажах.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ";
	
	ЕстьРеквизитСуммаНДСДокумента = ЕстьРеквизитИлиСвойствоОбъектаЛок(
		Документы.СчетФактура.ПустаяСсылка(),
		"СуммаНДСДокумента"
	);
	
	Если ЕстьРеквизитСуммаНДСДокумента Тогда
		ВыражениеСумма = "СчетФактура.СуммаДокумента + СчетФактура.СуммаНДСДокумента";
	Иначе
		ВыражениеСумма = "СчетФактура.СуммаДокумента";
	КонецЕсли;
	
	ТекстЗапросаВременныхТаблиц = СтрЗаменить(ТекстЗапросаВременныхТаблиц, "&СуммаДокумента", ВыражениеСумма);
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапросаВременныхТаблиц;
	
КонецПроцедуры

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса)
	
	Запросы = Новый Массив;
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктВыполненныхРабот"	, "РаботыИУслуги");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборРасходнаяНакладнаяКромеПередачиНаКомиссиюИВозвратов();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РасходнаяНакладная"	, "Запасы", ТекстОтбораДокументов);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ОтчетКомитенту"		, "Запасы");
	
	ДокументыБезСФ_ДобавитьТекстЗапросаПоРасходнаяНакладнаяПередачаНаКомиссию(Запросы);
	ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратПоставщику(Запросы);
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Запасы", ТекстОтбораДокументов, "Истина");

	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Запасы", ТекстОтбораДокументов, , "Истина");
	
	ТекстОтбораДокументов = Текстзапрос_ОтборЗаказПокупателяЗаказНаряд();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ЗаказПокупателя", "Работы", ТекстОтбораДокументов);
	
	ТекстЗапроса_ДокументыБезСФ = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ДокументыБезСФ;
	
КонецПроцедуры

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ИмяДокумента, ИмяТабличнойЧасти, Условие = "", Исправление = "Ложь", Корректировка = "Ложь")
	
	ИмяДокументаОтчетКомитенту = "ОтчетКомитенту";
	
	Результат =
	"ВЫБРАТЬ //РАЗРЕШЕННЫЕ
	|	ТабличнаяЧасть.Ссылка 				КАК Документ, 
	|	РеквизитыДокументов.Проведен 		КАК Проведен,
	|	РеквизитыДокументов.Номер 			КАК НомерДокумента,
	|	РеквизитыДокументов.Дата 			КАК ДатаДокумента,
	|	РеквизитыДокументов.Контрагент 		КАК Контрагент,
	|	РеквизитыДокументов.Организация 	КАК Организация,
	|	&СуммаДокумента 	КАК СуммаДокумента,
	|	&ЭтоИсправление 					КАК ЭтоИсправление,
	|	&ЭтоКорректировка					КАК ЭтоКорректировка
	|
	|//ИМЯ_ВРЕМЕННОЙ_ТАБЛИЦЫ
	|ИЗ
	|	&ТабличнаяЧастьДокументов КАК ТабличнаяЧасть
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ &ТаблицаРеквизитовДокументов КАК РеквизитыДокументов
	|	ПО ТабличнаяЧасть.Ссылка = РеквизитыДокументов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|	ПО ТабличнаяЧасть.СтавкаНДС = СтавкиНДС.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
	|	ПО ТабличнаяЧасть.Ссылка = СчетФактураДокументыОснования.ДокументОснование
	|
	|ГДЕ
	|	НЕ РеквизитыДокументов.ПометкаУдаления
	|	И РеквизитыДокументов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетФактураДокументыОснования.Ссылка ЕСТЬ NULL
	|
	|	&ДОП_УСЛОВИЯ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабличнаяЧасть.Ссылка, 
	|	РеквизитыДокументов.Проведен,
	|	РеквизитыДокументов.Номер,
	|	РеквизитыДокументов.Дата,
	|	РеквизитыДокументов.Контрагент,
	|	РеквизитыДокументов.Организация,
	|	&СуммаДокумента
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(СтавкиНДС.НеОблагается) = ИСТИНА";
	
	ТаблицаРеквизитовДокументов = "Документ." + ИмяДокумента;
	ТабличнаяЧастьДокументов 	= ТаблицаРеквизитовДокументов + "." + ИмяТабличнойЧасти;

	Результат = СтрЗаменить(Результат, "&ТабличнаяЧастьДокументов"		, ТабличнаяЧастьДокументов);
	Результат = СтрЗаменить(Результат, "&ТаблицаРеквизитовДокументов"	, ТаблицаРеквизитовДокументов);
	Результат = СтрЗаменить(Результат, "&ЭтоИсправление"				, Исправление);
	Результат = СтрЗаменить(Результат, "&ЭтоКорректировка"				, Корректировка);
	Результат = СтрЗаменить(Результат, "&ДОП_УСЛОВИЯ"					, Условие);
	
	Если ИмяДокумента = ИмяДокументаОтчетКомитенту Тогда
		
		Результат = СтрЗаменить(Результат, "&СуммаДокумента", "РеквизитыДокументов.СуммаВознаграждения");
		
	Иначе
		
		Результат = СтрЗаменить(Результат, "&СуммаДокумента", "РеквизитыДокументов.СуммаДокумента");
		
	КонецЕсли;
	
	ДобавитьВПакетТекстЗапросаДокументовБезСФ(Запросы, Результат);
	
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоРасходнаяНакладнаяПередачаНаКомиссию(Запросы)
	
	Результат = 
	"ВЫБРАТЬ
	|	РеквизитыДокументов.Ссылка 			КАК Документ, 
	|	РеквизитыДокументов.Проведен 		КАК Проведен,
	|	РеквизитыДокументов.Номер 			КАК НомерДокумента,
	|	РеквизитыДокументов.Дата 			КАК ДатаДокумента,
	|	РеквизитыДокументов.Контрагент 		КАК Контрагент,
	|	РеквизитыДокументов.Организация 	КАК Организация,
	|	РеквизитыДокументов.СуммаДокумента 	КАК СуммаДокумента,
	|	ЛОЖЬ			 					КАК ЭтоИсправление,
	|	ЛОЖЬ								КАК ЭтоКорректировка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РеквизитыДокументов
	|ГДЕ
	|	НЕ РеквизитыДокументов.ПометкаУдаления
	|	И РеквизитыДокументов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеквизитыДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)";
	            
	ДобавитьВПакетТекстЗапросаДокументовБезСФ(Запросы, Результат);   
	
КонецПроцедуры  

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратПоставщику(Запросы)
	
	Результат = 
	"ВЫБРАТЬ
	|	РеквизитыДокументов.Ссылка 			КАК Документ,
	|	РеквизитыДокументов.Проведен 		КАК Проведен,
	|	РеквизитыДокументов.Номер 			КАК НомерДокумента,
	|	РеквизитыДокументов.Дата 			КАК ДатаДокумента,
	|	РеквизитыДокументов.Контрагент 		КАК Контрагент,
	|	РеквизитыДокументов.Организация 	КАК Организация,
	|	РеквизитыДокументов.СуммаДокумента 	КАК СуммаДокумента,
	|	ЛОЖЬ			 					КАК ЭтоИсправление,
	|	ЛОЖЬ								КАК ЭтоКорректировка    
	
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РеквизитыДокументов
	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
	|	ПО РеквизитыДокументов.Ссылка = СчетФактураДокументыОснования.ДокументОснование
	
	|ГДЕ
	|	НЕ РеквизитыДокументов.ПометкаУдаления
	|	И РеквизитыДокументов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|И (РеквизитыДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|	ИЛИ РеквизитыДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту))
	|	И СчетФактураДокументыОснования.Ссылка ЕСТЬ NULL";
	
	ДобавитьВПакетТекстЗапросаДокументовБезСФ(Запросы, Результат);
	
КонецПроцедуры

Процедура ДобавитьВПакетТекстЗапросаДокументовБезСФ(Запросы, ТекстЗапроса)
	
	Если Запросы.Количество() = 0 Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//РАЗРЕШЕННЫЕ"			, "РАЗРЕШЕННЫЕ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ИМЯ_ВРЕМЕННОЙ_ТАБЛИЦЫ"	, "ПОМЕСТИТЬ ВТ_ДокументыБезНДС");
		
	КонецЕсли;
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах()
	
	Результат = " И РеквизитыДокументов.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон()
	
	Результат = " И РеквизитыДокументов.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборРасходнаяНакладнаяКромеПередачиНаКомиссиюИВозвратов()
	
	Результат = " 
	|   И ТабличнаяЧасть.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию)
	|   И ТабличнаяЧасть.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
	|   И ТабличнаяЧасть.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)";
	
	Возврат Результат;
	
КонецФункции

Функция Текстзапрос_ОтборЗаказПокупателяЗаказНаряд()
	
	Результат = " И РеквизитыДокументов.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)";
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьТаблицу_ПеремещениеТоваров(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Организация КАК Организация,
	|	ВТ_Отправители.Подразделение1С КАК ПодразделениеОтправитель,
	|	ВТ_Получатели.Подразделение1С КАК ПодразделениеПолучатель,
	|	ТаблицаДокументов.Номер КАК НомерДокумента,
	|	ТаблицаДокументов.Дата КАК ДатаДокумента,
	|	0 КАК СуммаДокумента,
	|	ТаблицаДокументов.Ссылка КАК Документ
	|ПОМЕСТИТЬ Диадок_ПеремещениеТоваров
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиВнутреннегоДокументооборота КАК ВТ_Настройки
	|		ПО ТаблицаДокументов.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакета = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Отправители
	|		ПО ТаблицаДокументов.Организация = ВТ_Отправители.Организация1С
	|			И ТаблицаДокументов.СтруктурнаяЕдиница = ВТ_Отправители.Подразделение1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Получатели
	|		ПО ТаблицаДокументов.Организация = ВТ_Получатели.Организация1С
	|			И ТаблицаДокументов.СтруктурнаяЕдиницаПолучатель = ВТ_Получатели.Подразделение1С
	|ГДЕ
	|	ТаблицаДокументов.Проведен
	|	И ТаблицаДокументов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ВТ_Отправители.Подразделение1С ЕСТЬ NULL
	|	И НЕ ВТ_Получатели.Подразделение1С ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Возврат "Диадок_ПеремещениеТоваров";
	
КонецФункции

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	ИначеЕсли TypeNamedId = "InvoiceCorrection" ИЛИ TypeNamedId = "InvoiceCorrectionRevision" Тогда
		Результат = "КСЧФ";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ, ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы = Неопределено, ДопПараметры = Неопределено)
			
	РезультатПечати 	= Неопределено;	
	ПараметрыВывода 	= Неопределено;	
	ОбъектыНазначения 	= Новый Массив;
	ПараметрыИсточника 	= Новый Структура("ИдентификаторКоманды, ОбъектыНазначения", ИдентификаторКомандыПечатнойФормы, ОбъектыНазначения);
	ОбъектыПечати 		= Новый СписокЗначений;
	
	ОбъектыНазначения.Добавить(Документ);
	
	МодульДополнительныеОтчетыИОбработки = ОбщийМодульПоИмениЛок("ДополнительныеОтчетыИОбработки");
	МодульДополнительныеОтчетыИОбработки.ПечатьПоВнешнемуИсточнику(ВнешняяПечатнаяФорма, ПараметрыИсточника, РезультатПечати, ОбъектыПечати, ПараметрыВывода);
		
	Если ТипЗнч(РезультатПечати) <> Тип("ТаблицаЗначений") ИЛИ РезультатПечати.Количество() <> 1 Тогда
		ВызватьИсключение "Не удалось сформировать печатную форму """ + ВнешняяПечатнаяФорма + """ для документа " + Документ;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ИмяФайла = РезультатПечати[0].СинонимМакета + " № " + Документ.Номер + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
	
	ИмяФайла = ЗаменитьНедопустимыеСимволы(ИмяФайла);
	
	РезультатПечати[0].ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);		
			
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(НомерДокумента)
		
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(НомерДокумента, ТекСимвол) <> 0 Тогда
			НомерДокумента = СтрЗаменить(НомерДокумента, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат НомерДокумента;
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита)
	
	Результат = ОсновнойМодуль.ЭДО_Служебные_ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитОбъектаЛок(ИмяРеквизита, ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Результат = Ядро.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	Возврат Результат;
КонецФункции

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  НомерДокумента - Строка - Номер документа учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПредставлениеНомера(НомерДокумента)
	
	УдалитьПрефиксИнформационнойБазы = Константы.ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы.Получить();
	УдалитьПользовательскийПрефикс = Константы.ПредставлениеНомераДокументаБезПрефиксаПользователя.Получить();
	
	МодульПрефиксацияОбъектов = ОбщийМодульПоИмениЛок("ПрефиксацияОбъектовКлиентСервер");
	Результат = МодульПрефиксацияОбъектов.НомерНаПечать(НомерДокумента, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеИННКПП(Наименование, ИНН, КПП)
	
	Если ЗначениеЗаполнено(КПП) Тогда
		Результат = СтрШаблон("%1, ИНН/КПП %2/%3", Наименование, ИНН, КПП);
	Иначе
		Результат = СтрШаблон("%1, ИНН %2", Наименование, ИНН);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа СчетНаОплатуКлиенту
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_СчетНаОплату()
	
	Возврат "СчетНаОплату";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа ЗаказКлиента
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ЗаказПокупателя()
	
	Возврат "ЗаказПокупателя";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документов продажи
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ДокументПродажи()
	
	Возврат "ДокументПродажи";
	
КонецФункции

Функция Новый_ЭлементПротоКонтента(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства
	);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)
	
	ЭлементыАдресногоОбъекта = Новый Массив;
	ЭлементыАдресногоОбъекта.Добавить(Элемент1);
	ЭлементыАдресногоОбъекта.Добавить(Элемент2);
	
	Результат = СокрЛП(СтрСоединить(ЭлементыАдресногоОбъекта, " "));
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{ ПРОТОКОНТЕНТ

//{ Акт сверки 405@

// Инициализирует конревой элемент контента ответного титула АС405@
// 
// Возвращаемое значение:
//  Структура - содержит элементы:
//   * ReconciliationAct - Структура - Данные ответного титула акта сверки (см. Новый_RecipientData_ReconciliationAct);
//   * DateCreateFile - Дата - Дата формирования файла обмена информации получателя;
//   * TimeCreateFile - Строка - Время формирования файла обмена информации получателя;
//   * SignDisagreement - Строка - Признак наличия разногласий.
//
Функция Новый_ReconciliationActRecipientTitle()
	
	ИмяКонтента = "ReconciliationActRecipientTitle";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует конревой элемент контента титула отправителя АС405@
// 
// Возвращаемое значение:
//  Структура - содержит элементы:
//   * ReconciliationAct - Структура - Данные акта сверки (см. Новый_SenderData_ReconciliationAct);
//   * DateCreateFile - Дата - Дата формирования файла обмена информации отправителя;
//   * TimeCreateFile - Строка - Время формирования файла обмена информации отправителя;
//   * ReconcilationDateFrom - Дата - Дата начала периода сверки взаимных расчетов;
//   * ReconcilationDateTo - Дата - Дата окончания периода сверки взаимных расчетов;
//   * ActNumber - Строка - Номер акта сверки.
//
Функция Новый_ReconciliationActSenderTitle()
	
	ИмяКонтента = "ReconciliationActSenderTitle";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру ReconciliationAct объекта ReconciliationActRecipientTitle.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * IdentityInfoSender - Структура - Информация об отправителе (см. Новый_IdentityInfoSender());
//   * Signer - Структура - Сведения о подписанте (см. Новый_Signer_ReconciliationAct());
//   * ReconciliationActTable - Структура - Табличная часть акта сверки (см. Новый_RecipientReconciliationActTable());
//
Функция Новый_RecipientData_ReconciliationAct()
	
	ИмяКонтента = "RecipientData_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру ReconciliationAct объекта ReconciliationActSenderTitle.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * AdditionalInfoReconciliationAct - Структура - Информация об отправителе, получателе и валюте документа (см. Новый_AdditionalInfoReconciliationAct());
//   * ReconciliationActTable - Структура - Табличная часть акта сверки (см. Новый_SenderReconciliationActTable());
//   * Signer - Структура - Сведения о подписанте (см. Новый_Signer_ReconciliationAct());
//
Функция Новый_SenderData_ReconciliationAct()
	
	ИмяКонтента = "SenderData_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру AdditionalInfoReconciliationAct объекта SenderData_ReconciliationAct.
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Sender - Структура - Данные отправителя АС405@ (см. Новый_ExtendedOrganizationInfo_ReconciliationAct)
//   * Recipient - Структура - Данные получателя АС405@ (см. Новый_ExtendedOrganizationInfo_ReconciliationAct)
//   * Currency - Строка - Код валюты документа
//
Функция Новый_AdditionalInfoReconciliationAct()
	
	ИмяКонтента = "AdditionalInfoReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру ExtendedOrganizationInfo_ReconciliationAct (данные участников сверки).
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * AdditionalCont - Строка - Дополнительные контактные данные учатника сверки;
//   * AdditionalInfo - Строка - Информация для участника документооборота;
//   * Department - Строка - Структурное подразделение;
//   * Email - Строка - Адрес электронной почты;
//   * FnsParticipantId - Строка - Идентификатор участника ЭДО;
//   * Inn - Строка - ИНН;
//   * Kpp - Строка - КПП;
//   * LegalEntityId - Строка - Идентификатор иностранной организации;
//   * Name - Строка - Наименование организации и ИП (ФИО для ФЛ);
//   * Ogrn - Строка - ОГРН;
//   * OrganizationOrPersonInfo - Строка - Седения, идентифицирующие иностранную организацию;
//   * Phone - Строка - Номер контактного телефона или факс;
//   * Type - Строка - Тип организации.
//
Функция Новый_ExtendedOrganizationInfo_ReconciliationAct()
	
	ИмяКонтента = "ExtendedOrganizationInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру IdentityInfoSender объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * BaseIdFile - Строка - Идентификатор файла обмена информации отправителя;
//   * DateFileInfoSender - Дата - Дата формирования файла обмена информации отправителя;
//   * TimeFileInfoSender - Строка - Время формирования файла обмена информации отправителя;
//   * SignSender - Строка - Подпись отправителя;
//
Функция Новый_IdentityInfoSender()
	
	ИмяКонтента = "IdentityInfoSender";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру Signer объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Official - Структура - ФИО подписанта;
//   * JobTitle - Строка - Должность подписанта;
//   * SignatureType - Строка - (Необязательный) Тип подписи;
//   * IdSystemStorage - Строка - (Необязательный) Место хранения доверенности;
//   * DigitalAttorneyInfo - Структура - Информация об электронной доверенности (см. Новый_DigitalAttorneyInfo_ReconciliationAct());
//   * PaperAttorneyInfo - Структура - Информация о бумажной доверенности (см. Новый_PaperAttorneyInfo_ReconciliationAct());
//
Функция Новый_Signer_ReconciliationAct()
	
	ИмяКонтента = "Signer_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру DigitalAttorneyInfo объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Number - Строка - (Необязательный) Номер доверенности;
//   * Date - Дата - (Необязательный) Дата доверенности;
//   * CancelAdditionalInfo - Строка - (Необязательный) Место хранения доверенности;
//
Функция Новый_DigitalAttorneyInfo_ReconciliationAct()
	
	ИмяКонтента = "DigitalAttorneyInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру PaperAttorneyInfo объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Official - Строка - (Необязательный) ФИО лица, подписавшего доверенность;
//   * Date - Дата - (Необязательный) Дата доверенности;
//   * InternalNumber - Строка - (Необязательный) Внутренний номер доверенности;
//   * IssuerAdditionalInfo - Строка - (Необязательный) Место хранения доверенности.
//
Функция Новый_PaperAttorneyInfo_ReconciliationAct()
	
	ИмяКонтента = "PaperAttorneyInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует табличную часть объекта ReconciliationAct ответного титула АС405@.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * BalanceDebitFrom - Число - (Необязательный) Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - (Необязательный) Сальдо на начало Кт;
//   * TurnoverDebit - Число - (Необязательный) Оборот за период Дт;
//   * TurnoverAmount - Число - (Необязательный) Оборот за период Кт;
//   * BalanceDebitEnd - Число - (Необязательный) Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - (Необязательный) Сальдо на конец Кт;
//   * TotalConsumptionDebit - Число - (Необязательный) Итого расхождение Дт;
//   * TotalConsumptionAmount - Число - (Необязательный) Итого расхождение Кт;
//   * ContractInfo - Массив - Информация о договорах, содержит структуры ContractInfo (см. Новый_RecipientContractInfo_ReconciliationAct());
//
Функция Новый_RecipientReconciliationActTable()
	
	ИмяКонтента = "RecipientReconciliationActTable";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует табличную часть объекта ReconciliationAct титула отправителя АС405@.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * BalanceDebitFrom - Число - (Необязательный) Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - (Необязательный) Сальдо на начало Кт;
//   * TurnoverDebit - Число - (Необязательный) Оборот за период Дт;
//   * TurnoverAmount - Число - (Необязательный) Оборот за период Кт;
//   * BalanceDebitEnd - Число - (Необязательный) Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - (Необязательный) Сальдо на конец Кт;
//   * ContractInfo - Массив - Информация о договорах, содержит структуры ContractInfo (см. Новый_SenderContractInfo_ReconciliationAct());
//
Функция Новый_SenderReconciliationActTable()
	
	ИмяКонтента = "SenderReconciliationActTable";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру Official подписанта АС405@
// 
// Возвращаемое значение:
//  Структура содержит ключи:
//   * JobTitle - Строка - Должность
//   * FirstName - Строка - Имя
//   * Surname - Строка - Фамилия
//   * Patronymic - Строка - Отчество
//
Функция Новый_Official()
	
	ИмяКонтента = "Official";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ReconciliationActTable ответного титула АС405@.
// Содержит сведения о договоре.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * ContractAdditionalInfo - Строка - (Необязательный) Описание вида договора;
//   * ContractNumber - Строка - (Необязательный) Номер договора;
//   * ContractDate - Дата - (Необязательный) Дата договора;
//   * BalanceDebitFrom - Число - (Необязательный) Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - (Необязательный) Сальдо на начало Кт;
//   * TurnoverDebit - Число - (Необязательный) Оборот за период Дт;
//   * TurnoverAmount - Число - (Необязательный) Оборот за период Кт;
//   * BalanceDebitEnd - Число - (Необязательный) Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - (Необязательный) Сальдо на конец Кт;
//   * TotalConsumptionDebit - Число - (Необязательный) Итого расхождение Дт;
//   * TotalConsumptionAmount - Число - (Необязательный) Итого расхождение Кт;
//   * DocumentInfo - Массив - Информация о документах, содержит структуры DocumentInfo (см. Новый_RecipientDocumentInfo_ReconciliationAct());
//
Функция Новый_RecipientContractInfo_ReconciliationAct()
	
	ИмяКонтента = "RecipientContractInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ContractInfo ответного титула АС405@.
// Содержит сведения о документе.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * DocumentName - Строка - Наименование документа;
//   * DocumentNumber - Строка - Номер документа;
//   * DocumentDate - Дата - Дата документа;
//   * TotalConsumption - Число - Расхождение суммы по документу;
//   * OperationInfo - Массив - Информация об операциях, содержит структуры OperationInfo (см. Новый_RecipientOperationInfo_ReconciliationAct());
//
Функция Новый_RecipientDocumentInfo_ReconciliationAct()
	
	ИмяКонтента = "RecipientDocumentInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта DocumentInfo ответного титула АС405@.
// Содержит сведения об операции.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * StringNumber - Строка - номер строки операции;
//   * OperationName - Строка - наименование операции;
//   * OperationDate - Дата - Дата операции;
//   * SumDebit - Число - (Необязательный) Сумма операции Дт;
//   * SumAmount - Число - (Необязательный) Сумма операции Кт;
//
Функция Новый_RecipientOperationInfo_ReconciliationAct()
	
	ИмяКонтента = "RecipientOperationInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ReconciliationActTable титула отправителя АС405@.
// Содержит сведения о договоре.
// 
// Возвращаемое значение:
//  Структура:
//   * DocumentInfo - Массив - Информация о документах, содержит структуры DocumentInfo (см. Новый_SenderReconciliationAct_DocumentInfo());
//   * ContractId - Строка - (Необязательный) Идентификатор договора в учетной системе отправителя;
//   * ContractAdditionalInfo - Строка- (Необязательный) Описание вида договора;
//   * ContractNumber - Строка - (Необязательный) Номер договора;
//   * ContractDate - Дата - (Необязательный) Дата договора;
//   * BalanceDebitFrom - Число - Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - Сальдо на начало Кт;
//   * TurnoverDebit - Число - Оборот за период Дт;
//   * TurnoverAmount - Число - Оборот за период Кт;
//   * BalanceDebitEnd - Число - Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - Сальдо на конец Кт;
//
Функция Новый_SenderContractInfo_ReconciliationAct()
	
	ИмяКонтента = "SenderContractInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ContractInfo титула отправителя АС405@.
// Содержит сведения о документе.
// 
// Возвращаемое значение:
//  Структура:
//   * OperationInfo - Массив - Информация об операциях, содержит структуры OperationInfo (см. Новый_ReconciliationAct_OperationInfo());
//   * DocumentName - Строка - Наименование документа;
//   * DocumentNumber - Строка - Номер документа;
//   * DocumentDate - Дата - Дата документа;
//   * DocumentId - Число - Идентификатор документа в учетной системе отправителя;
//   * AdditionalInfo - Строка - Дополнительная информация о договоре.
//
Функция Новый_SenderDocumentInfo_ReconciliationAct()
	
	ИмяКонтента = "SenderDocumentInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта DocumentInfo титула отправителя АС405@.
// Содержит сведения об операции.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * StringNumber - Строка - номер строки операции;
//   * OperationName - Строка - наименование операции;
//   * OperationDate - Дата - Дата операции;
//   * SumDebit - Число - (Необязательный) Сумма операции Дт;
//   * SumAmount - Число - (Необязательный) Сумма операции Кт;
//
Функция Новый_SenderOperationInfo_ReconciliationAct()
	
	ИмяКонтента = "SenderOperationInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

//} Акт сверки 405@

//} ПРОТОКОНТЕНТ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

НеИспользуется_РежимУправляемыхФорм = Истина; // Определяет версию типового модуля: ОФ / УФ

