////////////////////////////////////////////////////////////////////////////////
// Методы общего назначения на клиенте
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Модуль содержит процедуры и функции из Библиотеки стандартных подсистем,
// распространяемой под лицензией Attribution 4.0 International (CC BY 4.0)
// https://creativecommons.org/licenses/by/4.0/legalcode производны от нее
// или вдохновлены ею, является ООО 1С-Софт (https://1c.ru/).
// Авторские права 2024 г. принадлежат ООО 1С-Софт. Все права защищены.
//
// Процедуры и функции из Библиотеки стандартных подсистем:
// - СообщитьПользователюЛок
// - ОбщийМодульЛок
// - ЭтоWindowsКлиентЛок
// - ЭтоLinuxКлиентЛок
// - ЭтоMacOSКлиентЛок
// - ОперативнаяПамятьДоступнаяКлиентскомуПриложениюЛок
// - СистемнаяИнформацияКлиентаЛок
// - КлиентПодключенЧерезВебСерверЛок
// - СкопироватьРекурсивноЛок
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// БСП: ОПОВЕЩЕНИЕ ПОЛЬЗОВАТЕЛЯ

// Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// См. ОбщегоНазначения.СообщитьПользователю
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимого.
//   3. Установка ссылки без установки поля (и/или пути к данным).
//
Процедура СообщитьПользователюЛок(Знач ТекстСообщенияПользователю, Знач КлючДанных = Неопределено,
		Знач Поле = "", Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Сообщение = КонтурДиадокСтдОбщегоНазначенияКлиентСервер.СообщениеПользователюЛок(ТекстСообщенияПользователю,
			КлючДанных, Поле, ПутьКДанным, Отказ);
	
	Сообщение.Сообщить();
	
КонецПроцедуры // СообщитьПользователюЛок

// БСП: НЕОБЯЗАТЕЛЬНЫЕ ПОДСИСТЕМЫ

// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//   ОбщийМодуль
//   МодульМенеджераОбъекта
//
// Пример:
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодульЛок(Имя) Экспорт
	
	// BSLLS:ExecuteExternalCodeInCommonModule-off
	// Ограничение не распространяется на код, выполняемый на клиенте.
	Модуль = Вычислить(Имя);
	// BSLLS:ExecuteExternalCodeInCommonModule-on
	
	#Если Не ВебКлиент Тогда
	
	// В веб-клиенте не проверяется
	// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Общий модуль ""%1"" не существует.'"),
			Имя);
	КонецЕсли;
	
	#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции // ОбщийМодульЛок

// БСП: СРЕДА ИСПОЛНЕНИЯ

// Возвращает Истина, если приложение запущено под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Windows
//
Функция ЭтоWindowsКлиентЛок() Экспорт
	
	Возврат КонтурДиадокСтдОСКлиентСервер.ЭтоWindows();
	
КонецФункции // ЭтоWindowsКлиентЛок

// Возвращает Истина, если приложение запущено под управлением ОС Linux.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Linux
//
Функция ЭтоLinuxКлиентЛок() Экспорт
	
	Возврат КонтурДиадокСтдОСКлиентСервер.ЭтоLinux();
	
КонецФункции // ЭтоLinuxКлиентЛок

// Возвращает Истина, если приложение запущено под управлением macOS.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением macOS
//
Функция ЭтоMacOSКлиентЛок() Экспорт
	
	Возврат КонтурДиадокСтдОСКлиентСервер.ЭтоMacOS();
	
КонецФункции // ЭтоMacOSКлиентЛок

// Возвращает объем оперативной памяти, доступной клиентскому  приложению.
//
// См. ОбщегоНазначения.ОперативнаяПамятьДоступнаяКлиентскомуПриложению
//
// Возвращаемое значение:
//  Число - количество гигабайтов оперативной памяти с точностью до десятых долей.
//  Неопределено - нет клиентского приложения, то есть ТекущийРежимЗапуска() = Неопределено.
//
Функция ОперативнаяПамятьДоступнаяКлиентскомуПриложениюЛок() Экспорт
	
	Возврат КонтурДиадокСтдОСКлиентСервер.ОперативнаяПамятьДоступнаяПриложению();
	
КонецФункции // ОперативнаяПамятьДоступнаяКлиентскомуПриложениюЛок

// Возвращает системную информацию клиента, если есть клиентское приложение.
// До первого серверного вызова с клиента вернет Неопределено.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ВерсияОС - Строка
//    * ВерсияПриложения - Строка
//    * ИдентификаторКлиента - УникальныйИдентификатор
//    * ИнформацияПрограммыПросмотра - Строка
//    * ОперативнаяПамять - Число
//    * Процессор - Строка
//    * ТипПлатформы - см. ИмяТипаПлатформы
//  Неопределено - если нет клиентского приложения или информация запрашивается
//   до первого серверного вызова, например, при первом вызове события
//   платформы УстановкаПараметровСеанса в модуле сеанса.
//
Функция СистемнаяИнформацияКлиентаЛок() Экспорт
	
	Результат = Новый Структура(
			"ВерсияОС,
			|ВерсияПриложения,
			|ИдентификаторКлиента,
			|ИнформацияПрограммыПросмотра,
			|ОперативнаяПамять,
			|Процессор,
			|ТипПлатформы");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ЗаполнитьЗначенияСвойств(Результат, СистемнаяИнформация);
	
	Результат.ТипПлатформы = ЗначениеТипаПлатформыСистемнойИнформацииКлиента(СистемнаяИнформация.ТипПлатформы);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // СистемнаяИнформацияКлиентаЛок

// Определяет что клиентское приложение подключено к базе через веб-сервер.
//
// Возвращаемое значение:
//  Булево - Истина, если подключен.
Функция КлиентПодключенЧерезВебСерверЛок() Экспорт
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(ВРег(СтрокаСоединенияИнформационнойБазы()), "WS=") = 1;
	
КонецФункции // КлиентПодключенЧерезВебСерверЛок

// БСП: КОЛЛЕКЦИИ

// Создает полную копию структуры, соответствия, массива, таблицы значений или списка, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// Параметры:
//  Источник - Структура, ФиксированнаяСтруктура - объект, который необходимо скопировать
//           - Соответствие, ФиксированноеСоответствие - объект, который необходимо скопировать
//           - Массив, ФиксированныйМассив - объект, который необходимо скопировать
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево - Истина/Ложь Зафиксировать/снять фиксацию
//                    - Неопределено - Не изменять (По умолчанию)
//
// Возвращаемое значение:
//  - Структура, ФиксированнаяСтруктура - Копия объекта, переданного в параметре Источник
//  - Соответствие, ФиксированноеСоответствие - Копия объекта, переданного в параметре Источник
//  - Массив, ФиксированныйМассив - Копия объекта, переданного в параметре Источник
//  - СписокЗначений - Копия объекта, переданного в параметре Источник
//
Функция СкопироватьРекурсивноЛок(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Возврат КонтурДиадокСтдКоллекцииКлиентСервер.СкопироватьРекурсивноЛок(Источник, ФиксироватьДанные);
	
КонецФункции // СкопироватьРекурсивноЛок

// ПРОЧЕЕ

// Запускает выполнение процедуры (или функции), описанной в параметре <ВыполняемоеОповещение>.
//
// Параметры:
//  ВыполняемоеОповещение - ОписаниеОповещения - Содержит описание процедуры, вызов которой будет произведен
//  Результат - Произвольный - Значение, которое будет передано в процедуру, описанную
//    параметром <ВыполняемоеОповещение>. Необязательный, значение по умолчанию Ложь.
//
Процедура ВыполнитьОбработкуОповещенияЛок(ВыполняемоеОповещение, Результат = Null) Экспорт
	
	Если ВыполняемоеОповещение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыполняемоеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Если Результат = Null Тогда
			МассивПараметров = Неопределено;
		Иначе
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Результат);
		КонецЕсли;
		ВыполнитьОбработкуОповещенияСлужебный(ВыполняемоеОповещение, МассивПараметров);
	Иначе
		КонтурДиадокСтдОбщегоНазначенияСлужебный83Клиент.ВыполнитьОбработкуОповещенияЛок(ВыполняемоеОповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьОбработкуОповещенияЛок

// Используется для описания вызова процедуры программного модуля, который будет осуществлен при наступлении
// какого-либо ожидаемого события, такого как закрытие формы или немодального диалога.
//
// Параметры:
//  ИмяПроцедуры - Строка - имя экспортируемой процедуры модуля
//  Модуль - ФормаКлиентскогоПриложения - для вызова метода модуля указанной формы
//         - КомандаКомандногоИнтерфейса - для вызова метода модуля команды командного интерфейса
//         - ОбщийМодуль - для вызова метода общего неглобального модуля
//  ДополнительныеПараметры - Произвольный - значение любого типа, которое будет передано в вызываемую функцию
//  ИмяПроцедурыОбработкиОшибки - Строка - имя экспортируемой процедуры модуля, которая будет вызвана при ошибке
//  МодульОбработкиОшибки - см. Модуль - аналогичный модуль для обработки ошибки
//
// Возвращаемое значение:
//   ОписаниеОповещения, ФиксированнаяСтруктура - Описание оповещения
//
Функция ОписаниеОповещения(ИмяПроцедуры, Модуль,
		ДополнительныеПараметры = Неопределено,
		ИмяПроцедурыОбработкиОшибки = Неопределено,
		МодульОбработкиОшибки = Неопределено) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ИмяПроцедуры);
	МассивПараметров.Добавить(Модуль);
	МассивПараметров.Добавить(ДополнительныеПараметры);
	
	Если ИмяПроцедурыОбработкиОшибки <> Неопределено
		И МодульОбработкиОшибки <> Неопределено Тогда
		МассивПараметров.Добавить(ИмяПроцедурыОбработкиОшибки);
		МассивПараметров.Добавить(МодульОбработкиОшибки);
	КонецЕсли;
	
	Попытка
		
		ОписаниеОповещения = Новый(Тип("ОписаниеОповещения"), МассивПараметров);
		
	Исключение
		
		Если КонтурДиадокСтдСтрКлиентСервер.ВерсияПлатформыБольшеИлиРавна("8.3.3") Тогда
			ВызватьИсключение;
		КонецЕсли;
		
		ОписаниеОповещения = Новый Структура;
		ОписаниеОповещения.Вставить("ИмяПроцедуры", ИмяПроцедуры);
		ОписаниеОповещения.Вставить("Модуль", Модуль);
		ОписаниеОповещения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		ОписаниеОповещения.Вставить("ИмяПроцедурыОбработкиОшибки", ИмяПроцедурыОбработкиОшибки);
		ОписаниеОповещения.Вставить("МодульОбработкиОшибки", МодульОбработкиОшибки);
		ОписаниеОповещения = Новый ФиксированнаяСтруктура(ОписаниеОповещения);
		
	КонецПопытки;
	
	Возврат ОписаниеОповещения;
	
КонецФункции // ОписаниеОповещения

// Контракт описания обработчика оповещения
//
// Параметры:
//  Обработчик - Строка - имя обработчика;
//  Модуль - ФормаКлиентскогоПриложения - форма, в которой расположен модуль обработчика;
//  ДопПараметры - Структура - дополнительные параметры для передачи в указанный обработчик;
//
// Возвращаемое значение:
//  Структура - содержит входящие параметры
//
Функция ОписаниеОбработчикаОповещения(Обработчик, Модуль, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Модуль", Модуль);
	Результат.Вставить("Обработчик", Обработчик);
	Результат.Вставить("ДопПараметры", ДопПараметры);
	
	Возврат Результат;
	
КонецФункции // ОписаниеОбработчикаОповещения

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ВыполнитьОбработкуОповещенияСлужебный(ВыполняемоеОповещение, МассивПараметров = Неопределено)
	
	Если ВыполняемоеОповещение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокаПараметров = Новый Массив;
	Если ТипЗнч(МассивПараметров) = Тип("Массив")
		ИЛИ ТипЗнч(МассивПараметров) = Тип("ФиксированныйМассив") Тогда
		Для Сч = 0 По МассивПараметров.ВГраница() Цикл
			МассивСтрокаПараметров.Добавить("МассивПараметров[" + Формат(Сч, "ЧН=0; ЧГ=0") + "]");
		КонецЦикла;
	КонецЕсли;
	МассивСтрокаПараметров.Добавить("ВыполняемоеОповещение.ДополнительныеПараметры");
	СтрокаПараметров = КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(МассивСтрокаПараметров, ", ");
	
	Скрипт = "ВыполняемоеОповещение.Модуль.%1(%2)";
	Скрипт = СтрЗаменить(Скрипт, "%1", ВыполняемоеОповещение.ИмяПроцедуры);
	Скрипт = СтрЗаменить(Скрипт, "%2", СтрокаПараметров);
	
	// BSLLS:ExecuteExternalCodeInCommonModule-off
	// Ограничение не распространяется на код, выполняемый на клиенте.
	Выполнить(Скрипт);
	// BSLLS:ExecuteExternalCodeInCommonModule-on
	
КонецПроцедуры // ВыполнитьОбработкуОповещенияСлужебный

Функция ЗначениеТипаПлатформыСистемнойИнформацииКлиента(Значение)
	
	Массив = Новый Массив;
	Массив.Добавить("Android_ARM");
	Массив.Добавить("Android_ARM_64");
	Массив.Добавить("Android_x86");
	Массив.Добавить("Android_x86_64");
	Массив.Добавить("iOS_ARM");
	Массив.Добавить("iOS_ARM_64");
	Массив.Добавить("Linux_ARM64");
	Массив.Добавить("Linux_E2K");
	Массив.Добавить("Linux_x86");
	Массив.Добавить("Linux_x86_64");
	Массив.Добавить("MacOS_x86");
	Массив.Добавить("MacOS_x86_64");
	Массив.Добавить("Windows_x86");
	Массив.Добавить("Windows_x86_64");
	Массив.Добавить("WinRT_ARM");
	Массив.Добавить("WinRT_x86");
	Массив.Добавить("WinRT_x86_64");
	
	Соответствие = Новый Соответствие;
	
	Для Каждого Элемент Из Массив Цикл
		Попытка
			Соответствие.Вставить(ТипПлатформы[Элемент], Элемент);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	Результат = Соответствие.Получить(Значение);
	Если Результат = Неопределено Тогда
		Результат = "Неопределено";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗначениеТипаПлатформыСистемнойИнформацииКлиента