////////////////////////////////////////////////////////////////////////////////
// Методы работы с криптографией:
// - Подписание;
// - Шифрование;
// - прочее.
//
////////////////////////////////////////////////////////////////////////////////
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
////////////////////////////////////////////////////////////////////////////////

//**********************************************
//{		Получение списка сертификатов

&НаКлиенте
Функция ПолучитьВсе() Экспорт
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	СписокСертификатов = ПолучитьСписокСертификатов(ПараметрыПоиска);
	
	Результат = ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПолучениеВсех(Знач ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения(
			"НачатьПолучениеВсехЗавершение_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения(
			"ПолучитьВсе_ИнициализацияМенеджера_Завершение",
			ЭтаФорма,
			ОповещениеЗавершения);
	
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеВсехЗавершение_Завершение(СертификатыКриптографии, ДополнительныеПараметры) Экспорт
	
	СписокСертификатов = Новый Массив;
	
	Для Каждого СертификатКриптографии Из СертификатыКриптографии Цикл
		СписокСертификатов.Добавить(Новый_ОписаниеСертификата(СертификатКриптографии));
	КонецЦикла;
	
	Результат = ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов);
	ВыполнитьОбработкуОповещенияПереопределенная(ДополнительныеПараметры.ОповещениеЗавершения, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсе_ИнициализацияМенеджера_Завершение(
		МенеджерКриптографии,
		ОписаниеОповещения) Экспорт
	
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
	КонецЕсли;
	
	Оповещение = НовыйОписаниеОповещения(
			"ПолучитьВсе_ПолучениеХранилищаСертификатов_Завершение",
			ЭтаФорма,
			ОписаниеОповещения);
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(
		Оповещение,
		ПараметрыПоиска.ТипХранилища,
		ПараметрыПоиска.РасположениеХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсе_ПолучениеХранилищаСертификатов_Завершение(
		Хранилище,
		ОписаниеОповещения) Экспорт
	
	Хранилище.НачатьПолучениеВсех(ОписаниеОповещения);
	
КонецПроцедуры

//}		Получение списка сертификатов


//**********************************************
//{		Получение сертификата

&НаКлиенте
Функция НайтиПоОтпечатку(ОтпечатокСертификата) Экспорт
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	Результат = ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПоискПоОтпечатку(ОтпечатокСертификата, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения(
			"НачатьПоискПоОтпечатку_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения(
			"НачатьПоискПоОтпечатку_ИнициализацияМенеджера_Завершение",
			ЭтаФорма,
			ОповещениеЗавершения);
	
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПоискПоОтпечатку_Завершение(СертификатыКриптографии, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ОтпечатокСертификата = СвойствоСтруктуры(ДополнительныеПараметры, "ОтпечатокСертификата");
	
	Если ТипЗнч(СертификатыКриптографии) = Тип("Массив") Тогда
		
		СертификатКриптографии = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	Иначе
		
		СертификатКриптографии = СертификатыКриптографии;
		
	КонецЕсли;
	
	НачатьПолучениеОписанияСертификата(СертификатКриптографии, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПоискПоОтпечатку_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт
	
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
	КонецЕсли;
	
	Оповещение = НовыйОписаниеОповещения(
			"НачатьПоискПоОтпечатку_ПолучениеХранилищаСертификатов_Завершение",
			ЭтаФорма,
			ОписаниеОповещения);
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(
		Оповещение,
		ПараметрыПоиска.ТипХранилища,
		ПараметрыПоиска.РасположениеХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПоискПоОтпечатку_ПолучениеХранилищаСертификатов_Завершение(Хранилище, ОписаниеОповещения) Экспорт
	
	ОтпечатокСетификата = ОписаниеОповещения.ДополнительныеПараметры.ОтпечатокСертификата;
	
	Если ТипЗнч(ОтпечатокСетификата) = Тип("ДвоичныеДанные") Тогда
		Хранилище.НачатьПоискПоОтпечатку(ОписаниеОповещения, ОтпечатокСетификата);
	Иначе
		Хранилище.НачатьПолучениеВсех(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПоСерийномуНомеру(СерийныйНомер) Экспорт
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ТипЗнч(СерийныйНомер) = Тип("ДвоичныеДанные") Тогда
		
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоСерийномуНомеру(СерийныйНомер);
		
	Иначе
		
		СертификатыКриптографии = ХранилищеСертификатовКриптографии.ПолучитьВсе();
		СертификатКриптографии = НайтиСертификатВМассивеСерийномуНомеру(СертификатыКриптографии, СерийныйНомер);
		
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии);
	Результат.ДвоичныеДанные = СертификатКриптографии.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПоискПоСерийномуНомеру(СерийныйНомер, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("СерийныйНомер", СерийныйНомер);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения(
			"НачатьПоискПоСерийномуНомеру_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения(
			"НачатьПоискПоСерийномуНомеру_ИнициализацияМенеджера_Завершение",
			ЭтаФорма,
			ОповещениеЗавершения);
	
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПоискПоСерийномуНомеру_Завершение(СертификатыКриптографии, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	СерийныйНомер = СвойствоСтруктуры(ДополнительныеПараметры, "СерийныйНомер");
	
	Если ТипЗнч(СертификатыКриптографии) = Тип("Массив") Тогда
		
		СертификатКриптографии = НайтиСертификатВМассивеСерийномуНомеру(СертификатыКриптографии, СерийныйНомер);
		
	Иначе
		
		СертификатКриптографии = СертификатыКриптографии;
		
	КонецЕсли;
	
	НачатьПолучениеОписанияСертификата(СертификатКриптографии, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПоискПоСерийномуНомеру_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт
	
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
	КонецЕсли;
	
	Оповещение = НовыйОписаниеОповещения(
			"НачатьПоискПоСерийномуНомеру_ПолучениеХранилищаСертификатов_Завершение",
			ЭтаФорма,
			ОписаниеОповещения);
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(
		Оповещение,
		ПараметрыПоиска.ТипХранилища,
		ПараметрыПоиска.РасположениеХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПоискПоСерийномуНомеру_ПолучениеХранилищаСертификатов_Завершение(Хранилище, ОписаниеОповещения) Экспорт
	
	СерийныйНомер = ОписаниеОповещения.ДополнительныеПараметры.СерийныйНомер;
	
	Если ТипЗнч(СерийныйНомер) = Тип("ДвоичныеДанные") Тогда
		Хранилище.НайтиПоСерийномуНомеру(ОписаниеОповещения, СерийныйНомер);
	Иначе
		Хранилище.НачатьПолучениеВсех(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

//}		Получение сертификата


//**********************************************
//{		Подпись

&НаКлиенте
Функция Подписать(ДвоичныеДанные, ОтпечатокСертификата) Экспорт
	
	Результат = ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПодпись(ДвоичныеДанные, ОтпечатокСертификата, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	ДополнительныеПараметры.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения(
			"ПодписатьДанные_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	ОповещениеПолучениеСертификатаЗавершение = НовыйОписаниеОповещения(
			"ПодписатьДанные_ПолучитьСертификат_Завершение",
			ЭтаФорма,
			ОповещениеЗавершения);
	
	НайтиСертификатПоОтпечатку_Нативный(ОтпечатокСертификата,
		ОповещениеПолучениеСертификатаЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДанные_Завершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ДвоичныеДанные = СвойствоСтруктуры(ДополнительныеПараметры, "ДвоичныеДанные");
	СертификатКриптографии = СвойствоСтруктуры(ДополнительныеПараметры, "СертификатКриптографии");
	
	МенеджерКриптографии.НачатьПодписывание(ОповещениеЗавершения, ДвоичныеДанные, СертификатКриптографии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДанные_ПолучитьСертификат_Завершение(СертификатКриптографии, ОписаниеОповещения) Экспорт
	
	ОписаниеОповещения.ДополнительныеПараметры.Вставить("СертификатКриптографии", СертификатКриптографии);
	НачатьИнициализациюМенеджераКриптографии(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСертификатПоОтпечатку_Нативный_Завершение(СертификатыКриптографии, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ОтпечатокСертификата = СвойствоСтруктуры(ДополнительныеПараметры, "ОтпечатокСертификата");
	
	Если ТипЗнч(СертификатыКриптографии) = Тип("Массив") Тогда
		
		СертификатКриптографии = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	Иначе
		
		СертификатКриптографии = СертификатыКриптографии;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещенияПереопределенная(ОповещениеЗавершения, СертификатКриптографии);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСертификатПоОтпечатку_Нативный_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт
	
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
	КонецЕсли;
	
	Оповещение = НовыйОписаниеОповещения(
			"НайтиСертификатПоОтпечатку_Нативный_ПолучениеХранилищаСертификатов_Завершение",
			ЭтаФорма,
			ОписаниеОповещения);
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(
		Оповещение,
		ПараметрыПоиска.ТипХранилища,
		ПараметрыПоиска.РасположениеХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСертификатПоОтпечатку_Нативный_ПолучениеХранилищаСертификатов_Завершение(Хранилище, ОписаниеОповещения) Экспорт
	
	ОтпечатокСетификата = ОписаниеОповещения.ДополнительныеПараметры.ОтпечатокСертификата;
	
	Если ТипЗнч(ОтпечатокСетификата) = Тип("ДвоичныеДанные") Тогда
		Хранилище.НачатьПоискПоОтпечатку(ОписаниеОповещения, ОтпечатокСетификата);
	Иначе
		Хранилище.НачатьПолучениеВсех(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСертификатПоОтпечатку_Нативный(ОтпечатокСертификата, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения(
			"НайтиСертификатПоОтпечатку_Нативный_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения(
			"НайтиСертификатПоОтпечатку_Нативный_ИнициализацияМенеджера_Завершение",
			ЭтаФорма,
			ОповещениеЗавершения);
	
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

//}		Подпись


//**********************************************
//{		Шифрование

&НаКлиенте
Функция Зашифровать(ДвоичныеДанные, МассивСертификатов) Экспорт
	
	Результат = ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьШифрование(ДвоичныеДанные, МассивСертификатов, ОписаниеОповещения) Экспорт
	
	Для Каждого ОписаниеСертификата Из МассивСертификатов Цикл
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДвоичныеДанные", ДвоичныеДанные);
		ДополнительныеПараметры.Вставить("МассивСертификатов", МассивСертификатов);
		ДополнительныеПараметры.Вставить("ИндексСертификата", МассивСертификатов.Найти(ОписаниеСертификата));
		ДополнительныеПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		
		ОповещениеПродолжения = НовыйОписаниеОповещения(
				"ЗашифроватьДанные_ПолучениеДвоичныхДанныхСертификатовПродолжение",
				ЭтаФорма,
				ДополнительныеПараметры);
		
		НайтиСертификатПоОтпечатку_Нативный(ОписаниеСертификата.ОтпечатокСертификата, ОповещениеПродолжения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗашифроватьДанные_ПолучениеДвоичныхДанныхСертификатовПродолжение(Сертификат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.МассивСертификатов[ДополнительныеПараметры.ИндексСертификата] = Сертификат;
	
	Если ДополнительныеПараметры.ИндексСертификата = ДополнительныеПараметры.МассивСертификатов.Вграница() Тогда
		
		НачатьШифрование_Завершение(
			ДополнительныеПараметры.ДвоичныеДанные,
			ДополнительныеПараметры.МассивСертификатов,
			ДополнительныеПараметры.ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьШифрование_Завершение(ДвоичныеДанные, МассивСертификатов, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	ДополнительныеПараметры.Вставить("СертификатыКриптографии", МассивСертификатов);
	
	Оповещение = НовыйОписаниеОповещения("ЗашифроватьДанные_Завершение", ЭтаФорма, ДополнительныеПараметры);
	
	НачатьИнициализациюМенеджераКриптографии(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗашифроватьДанные_Завершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
	КонецЕсли;
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ДвоичныеДанные = СвойствоСтруктуры(ДополнительныеПараметры, "ДвоичныеДанные");
	СертификатыКриптографии = СвойствоСтруктуры(ДополнительныеПараметры, "СертификатыКриптографии");
	
	МенеджерКриптографии.НачатьШифрование(ОповещениеЗавершения, ДвоичныеДанные, СертификатыКриптографии);
	
КонецПроцедуры

//}		Шифрование


//**********************************************
//{		Расшифровка

&НаКлиенте
Функция Расшифровать(ЗашифрованныеДвоичныеДанные) Экспорт
	
	Результат = РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьРасшифровку(ЗашифрованныеДвоичныеДанные, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ЗашифрованныеДвоичныеДанные", ЗашифрованныеДвоичныеДанные);
	
	Оповещение = НовыйОписаниеОповещения(
			"РасшифроватьДанные_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	НачатьИнициализациюМенеджераКриптографии(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьДанные_Завершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
	КонецЕсли;
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ЗашифрованныеДвоичныеДанные = СвойствоСтруктуры(ДополнительныеПараметры, "ЗашифрованныеДвоичныеДанные");
	
	МенеджерКриптографии.НачатьРасшифровку(ОповещениеЗавершения, ЗашифрованныеДвоичныеДанные);
	
КонецПроцедуры

//}		Расшифровка


//**********************************************
//{		Проверка подписи

&НаКлиенте
Функция ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи) Экспорт
	
	СертификатКриптографии = Неопределено;
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	МенеджерКриптографии.ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи, СертификатКриптографии);
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии);
	Результат.ДвоичныеДанные = СертификатКриптографии.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПроверкуПодписи(ДвоичныеДанные, ДвоичныеДанныеПодписи, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеПодписи", ДвоичныеДанныеПодписи);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения(
			"ПроверитьПодпись_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения(
			"ПроверитьПодпись_ИнициализацияМенеджера_Завершение",
			ЭтаФорма,
			ОповещениеЗавершения);
	
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодпись_Завершение(СертификатКриптографии, ДополнительныеПараметры) Экспорт
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	
	НачатьПолучениеОписанияСертификата(СертификатКриптографии, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодпись_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт
	
	ДвоичныеДанные = СвойствоСтруктуры(ОписаниеОповещения.ДополнительныеПараметры, "ДвоичныеДанные");
	ДвоичныеДанныеПодписи = СвойствоСтруктуры(ОписаниеОповещения.ДополнительныеПараметры, "ДвоичныеДанныеПодписи");
	
	МенеджерКриптографии.НачатьПроверкуПодписи(ОписаниеОповещения, ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
КонецПроцедуры

//}		Проверка подписи


//**********************************************
//{		Получение сертификата из подписи

&НаКлиенте
Функция ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи) Экспорт
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	СертификатыКриптографии = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(ДвоичныеДанныеПодписи);
	
	СертификатКриптографии = Неопределено;
	
	Если ЗначениеЗаполнено(СертификатыКриптографии) Тогда
		СертификатКриптографии = СертификатыКриптографии[0];
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии);
	Результат.ДвоичныеДанные = СертификатКриптографии.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатыИзПодписи(ДвоичныеДанныеПодписи) Экспорт
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	СертификатыКриптографии = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(ДвоичныеДанныеПодписи);
	
	Результат = Новый Массив;
	
	Для Каждого СертификатКриптографии Из СертификатыКриптографии Цикл
		
		КонтрактСертификата = Новый_ОписаниеСертификата(СертификатКриптографии);
		КонтрактСертификата.ДвоичныеДанные = СертификатКриптографии.Выгрузить();
		
		Результат.Добавить(КонтрактСертификата);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПолучениеСертификатаИзПодписи(ДвоичныеДанныеПодписи, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеПодписи", ДвоичныеДанныеПодписи);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения(
			"ПолучитьСертификатИзПодписи_Завершение",
			ЭтаФорма,
			ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения(
			"ПолучитьСертификатИзПодписи_ИнициализацияМенеджера_Завершение",
			ЭтаФорма,
			ОповещениеЗавершения);
	
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатИзПодписи_Завершение(СертификатыКриптографии, ДополнительныеПараметры) Экспорт
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	
	СертификатКриптографии = Неопределено;
	
	Если СертификатыКриптографии.Количество() > 0 Тогда
		СертификатКриптографии = СертификатыКриптографии[0];
	КонецЕсли;
	
	НачатьПолучениеОписанияСертификата(СертификатКриптографии, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатИзПодписи_ИнициализацияМенеджера_Завершение(
		МенеджерКриптографии,
		ОписаниеОповещения) Экспорт
	
	ДвоичныеДанныеПодписи = СвойствоСтруктуры(ОписаниеОповещения.ДополнительныеПараметры, "ДвоичныеДанныеПодписи");
	МенеджерКриптографии.НачатьПолучениеСертификатовИзПодписи(ОписаниеОповещения, ДвоичныеДанныеПодписи);
	
КонецПроцедуры

//}		Получение сертификата из подписи

&НаКлиенте
Функция ПолучитьСписокСертификатов(ПараметрыПоиска)
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ПараметрыПоиска.Свойство("Отпечаток") Тогда
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ПараметрыПоиска.Отпечаток);
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска);
	КонецЕсли;
	
	Если ПараметрыПоиска.Свойство("СерийныйНомер") Тогда
		СерийныйНомерСертификата = Base64Значение(ПараметрыПоиска.СерийныйНомер);
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоСерийномуНомеру(СерийныйНомерСертификата);
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска);
	КонецЕсли;
	
	СертификатыКриптографии = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатыКриптографии, ПараметрыПоиска);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов)
	
	Результат = Новый Массив;
	
	Для Каждого ТекСертификат Из СписокСертификатов Цикл
		
		Если ЭтоВалидныйСертификат(ТекСертификат) Тогда
			
			ОписаниеСертификата = ОписаниеСертификата(ТекСертификат);
			Результат.Добавить(ОписаниеСертификата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеСертификата(Сертификат) Экспорт
	
	Результат = Контракт_ОписаниеСертификата();
	
	СубъектСертификата = Сертификат.Субъект;
	
	Результат.Наименование = НаименованиеСертификата(СубъектСертификата);
	Результат.ДатаВыдачи = Сертификат.ДатаНачала;
	Результат.СрокДействия = Сертификат.ДатаОкончания;
	Результат.ОтпечатокСертификата = ВРег(Сертификат.Отпечаток);
	Результат.СерийныйНомер = Сертификат.СерийныйНомер;
	Результат.Издатель = Сертификат.Издатель.CN;
	Результат.ОрганизацияИздателя = СвойствоСтруктуры(Сертификат.Издатель, "O", "");
	Результат.Организация = СвойствоСтруктуры(СубъектСертификата, "O", "");
	Результат.ИНН = ИННСертификата(СубъектСертификата);
	Результат.КПП = КППСертификата(СубъектСертификата);
	Результат.Тип = ТипСертификата(СубъектСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контракт_ОписаниеСертификата() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Наименование");
	Результат.Вставить("ДатаВыдачи");
	Результат.Вставить("СрокДействия");
	Результат.Вставить("ОтпечатокСертификата");
	Результат.Вставить("СерийныйНомер");
	Результат.Вставить("Издатель");
	Результат.Вставить("ОрганизацияИздателя");
	Результат.Вставить("Организация");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("Тип");
	Результат.Вставить("Ошибка");
	Результат.Вставить("ЭтоКЭП", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НаименованиеСертификата(СубъектСертификата)
	
	Если ТипЗнч(СубъектСертификата) = Тип("Структура") Тогда
		
		Результат = НаименованиеСубъекта(СубъектСертификата);
		
	ИначеЕсли ТипЗнч(СубъектСертификата) = Тип("Массив") Тогда
		
		Для Каждого Субъект Из СубъектСертификата Цикл
			
			Результат = НаименованиеСубъекта(Субъект);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип значения субъекта сертификата: " + Строка(ТипЗнч(СубъектСертификата));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НаименованиеСубъекта(Субъект)
	
	Если Субъект.Свойство("SN") И Субъект.Свойство("GN") Тогда
		Результат = Субъект.SN + " " + Субъект.GN;
	ИначеЕсли Субъект.Свойство("CN") Тогда
		Результат = Субъект.CN;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИННСертификата(СубъектСертификата)
	
	Если ТипЗнч(СубъектСертификата) = Тип("Структура") Тогда
		
		Результат = ИННСубъекта(СубъектСертификата);
		
	ИначеЕсли ТипЗнч(СубъектСертификата) = Тип("Массив") Тогда
		
		Для Каждого Субъект Из СубъектСертификата Цикл
			
			Результат = ИННСубъекта(Субъект);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип значения субъекта сертификата: " + Строка(ТипЗнч(СубъектСертификата));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИННСубъекта(Субъект)
	
	Если Субъект.Свойство("ИННЮЛ") Тогда
		Результат = Субъект.ИННЮЛ;
	ИначеЕсли Субъект.Свойство("ИНН") Тогда
		Результат = Субъект.ИНН;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Если Лев(Результат, 2) = "00" Тогда
		Результат = Сред(Результат, 3);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КППСертификата(СубъектСертификата)
	
	Если ТипЗнч(СубъектСертификата) = Тип("Структура") Тогда
		
		Результат = КППСубъекта(СубъектСертификата);
		
	ИначеЕсли ТипЗнч(СубъектСертификата) = Тип("Массив") Тогда
		
		Для Каждого Субъект Из СубъектСертификата Цикл
			
			Результат = КППСубъекта(Субъект);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип значения субъекта сертификата: " + Строка(ТипЗнч(СубъектСертификата));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КППСубъекта(Субъект)
	
	Результат = "";
	
	НеструктурированноеИмя = СвойствоСтруктуры(Субъект, "_1_2_840_113549_1_9_2");
	
	Если ЗначениеЗаполнено(НеструктурированноеИмя) Тогда
		
		ЭлементыЗначения = РазделитьСтрокуЛок(НеструктурированноеИмя, "-");
		
		Если ЭлементыЗначения.Количество() > 1 Тогда
			Результат = ЭлементыЗначения[1];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТипСертификата(СубъектСертификата)
	
	ТипыСертификатовКЭП = Перечисление_ТипыСертификатовКЭП();
	
	ИННЮЛ = СвойствоСтруктуры(СубъектСертификата, "ИННЮЛ");
	ИНН = СвойствоСтруктуры(СубъектСертификата, "ИНН");
	ОГРН = СвойствоСтруктуры(СубъектСертификата, "ОГРН");
	ОГРНИП = СвойствоСтруктуры(СубъектСертификата, "ОГРНИП");
	
	Если Лев(ИНН, 2) = "00" Тогда
		ИНН = Сред(ИНН, 3);
	КонецЕсли;
	
	ПустойИННЮЛ = "0000000000";
	ПустойИННФЛ = "000000000000";
	ПустойОГРН = "0000000000000";
	ПустойОГРНИП = "000000000000000";
	
	ДлинаИННЮЛ = СтрДлина(ПустойИННЮЛ);
	ДлинаИННФЛ = СтрДлина(ПустойИННФЛ);
	ДлинаОГРН = СтрДлина(ПустойОГРН);
	ДлинаОГРНИП = СтрДлина(ПустойОГРНИП);
	
	ПрефиксНерезидента = "9909";
	
	Резидент = Лев(ИННЮЛ, СтрДлина(ПрефиксНерезидента)) <> ПрефиксНерезидента
		И Лев(ИНН, СтрДлина(ПрефиксНерезидента)) <> ПрефиксНерезидента;
	
	ЗаполненИННЮЛ = СтрДлина(ИННЮЛ) = ДлинаИННЮЛ
		И ИННЮЛ <> ПустойИННЮЛ;
	
	ЗаполненИНН = СтрДлина(ИНН) = ДлинаИННФЛ
		И ИНН <> ПустойИННФЛ;
	
	ЗаполненИНН_ЮЛ = СтрДлина(ИНН) = ДлинаИННЮЛ
		И ИНН <> ПустойИННЮЛ;
	
	ЗаполненОГРНИП = СтрДлина(ОГРНИП) = ДлинаОГРНИП
		И ОГРНИП <> ПустойОГРНИП;
	
	ЗаполненОГРН = СтрДлина(ОГРН) = ДлинаОГРН
		И ОГРН <> ПустойОГРН;
	
	ЗаполненОГРН = (Резидент И ЗаполненОГРН
			ИЛИ НЕ Резидент И НЕ ЗаполненОГРН)
		И НЕ ЗначениеЗаполнено(ОГРНИП);
	
	Если ЗаполненИННЮЛ
		И ЗаполненОГРН Тогда
		
		Результат = ТипыСертификатовКЭП.ЮЛ;
		
	ИначеЕсли НЕ ЗаполненИННЮЛ
		И ЗаполненИНН_ЮЛ
		И ЗаполненОГРН Тогда
		
		Результат = ТипыСертификатовКЭП.ЮЛ;
		
	ИначеЕсли НЕ ЗаполненИННЮЛ
		И ЗаполненИНН
		И ЗаполненОГРНИП
		И НЕ ЗаполненОГРН Тогда
		
		Результат = ТипыСертификатовКЭП.ИП;
		
	ИначеЕсли НЕ ЗаполненИННЮЛ
		И ЗаполненИНН
		И НЕ ЗаполненОГРНИП
		И НЕ ЗаполненОГРН Тогда
		
		Результат = ТипыСертификатовКЭП.ФЛ;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазобратьОтвет_ПолучитьСписокСертификатов(Ответ, ПараметрыПоиска)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		
		Если ТипЗнч(Ответ) = Тип("Массив") Тогда
			
			Для Каждого СертификатКриптографии Из Ответ Цикл
				
				Результат.Добавить(Новый_ОписаниеСертификата(СертификатКриптографии));
				
				Если СвойствоСтруктуры(ПараметрыПоиска, "ТолькоПервый") = Истина Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			Результат.Добавить(Новый_ОписаниеСертификата(Ответ));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска)
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда
		
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);
		
	Иначе
		
		СертификатыКриптографии = ХранилищеСертификатовКриптографии.ПолучитьВсе();
		СертификатКриптографии = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии);
	Результат.ДвоичныеДанные = СертификатКриптографии.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата)
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	
	Результат = ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата)
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда
		
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);
		
	Иначе
		
		СертификатыКриптографии = ХранилищеСертификатовКриптографии.ПолучитьВсе();
		СертификатКриптографии = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	КонецЕсли;
	
	Результат = МенеджерКриптографии.Подписать(ДвоичныеДанные, СертификатКриптографии);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов)
	
	СертификатыКриптографии = Новый Массив;
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	Для Каждого СертификатЭлемент Из МассивСертификатов Цикл
		
		Если ТипЗнч(СертификатЭлемент) = Тип("Структура") Тогда
			Сертификат = ПолучитьДанныеСертификата(СертификатЭлемент.ОтпечатокСертификата, ПараметрыПоиска);
			ДвоичныеДанныеСертификата = Сертификат.ДвоичныеДанные;
		ИначеЕсли ТипЗнч(СертификатЭлемент) = Тип("Строка") Тогда
			Сертификат = ПолучитьДанныеСертификата(СертификатЭлемент, ПараметрыПоиска);
			ДвоичныеДанныеСертификата = Сертификат.ДвоичныеДанные;
		ИначеЕсли ТипЗнч(СертификатЭлемент) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанныеСертификата = СертификатЭлемент;
		КонецЕсли;
		
		СертификатКриптографии = Новый СертификатКриптографии(ДвоичныеДанныеСертификата);
		
		СертификатыКриптографии.Добавить(СертификатКриптографии);
		
	КонецЦикла;
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	
	Результат = МенеджерКриптографии.Зашифровать(ДвоичныеДанные, СертификатыКриптографии);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные)
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	
	Результат = МенеджерКриптографии.Расшифровать(ЗашифрованныеДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоВалидныйСертификат(ДанныеСертификата)
	
	ВалидныйСубъектСертификата = ДанныеСертификата.Свойство("Субъект")
		И ТипЗнч(ДанныеСертификата.Субъект) = Тип("Структура")
		И ДанныеСертификата.Субъект.Свойство("CN")
		И (ДанныеСертификата.Субъект.Свойство("ИНН") ИЛИ ДанныеСертификата.Субъект.Свойство("ИННЮЛ"));
	
	ВалидныеСубъектыСертификата = ДанныеСертификата.Свойство("Субъект")
		И ТипЗнч(ДанныеСертификата.Субъект) = Тип("Массив")
		И ЕстьСвойствоСубъектаСертификата(ДанныеСертификата.Субъект, "CN")
		И (ЕстьСвойствоСубъектаСертификата(ДанныеСертификата.Субъект, "ИНН")
			ИЛИ ЕстьСвойствоСубъектаСертификата(ДанныеСертификата.Субъект, "ИННЮЛ"));
	
	ВалидныйИздательСертификата = ДанныеСертификата.Свойство("Издатель")
		И ТипЗнч(ДанныеСертификата.Издатель) = Тип("Структура")
		И ДанныеСертификата.Издатель.Свойство("CN");
	
	ВалидныйПериодДействия = ДанныеСертификата.ДатаОкончания >= НачалоДня(ТекущаяДата());
	
	Результат = ТипЗнч(ДанныеСертификата) = Тип("Структура")
		И (ВалидныйСубъектСертификата ИЛИ ВалидныеСубъектыСертификата)
		И ВалидныйИздательСертификата
		И ВалидныйПериодДействия;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьСвойствоСубъектаСертификата(СубъектыСертификата, ИмяСвойства)
	
	Результат = Ложь;
	
	Для Каждого Субъект Из СубъектыСертификата Цикл
		
		Если Субъект.Свойство(ИмяСвойства) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИнициализироватьМенеджерКриптографии()
	
	ТипМодуляКриптографии = 80;
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("");
	
	ПутиМодулейКриптографии = ПутиКМодулямКриптоПроLinux();
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПутьМодуляКриптографии = ПутиМодулейКриптографии.Получить(Строка(СистемнаяИнформация.ТипПлатформы));
	Если ПутьМодуляКриптографии = Неопределено Тогда
		ПутьМодуляКриптографии = "";
	КонецЕсли;
	ПараметрыКонструктора.Добавить(ПутьМодуляКриптографии);
	ПараметрыКонструктора.Добавить(ТипМодуляКриптографии);
	
	Если НЕ ПриложениеСтаршеВерсии("8.3.13") Тогда
		ПараметрыКонструктора.Добавить(Вычислить("ИспользованиеИнтерактивногоРежимаКриптографии.Использовать"));
	КонецЕсли;
	
	МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
	
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
	КонецЕсли;
	
	Возврат МенеджерКриптографии;
	
КонецФункции

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографии(Знач ОписаниеОповещения)
	
	ТипМодуляКриптографии = 80;
	ПутиМодулейКриптографии = ПутиКМодулямКриптоПроLinux();
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПутьМодуляКриптографии = ПутиМодулейКриптографии.Получить(Строка(СистемнаяИнформация.ТипПлатформы));
	Если ПутьМодуляКриптографии = Неопределено Тогда
		ПутьМодуляКриптографии = "";
	КонецЕсли;
	
	МенеджерКриптографии = Новый("МенеджерКриптографии");
	
	ИспользоватьИнтерактивноеПолучениеПароля = Истина;
	Если ЗначениеЗаполнено(ПарольСертификата) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольСертификата;
		ИспользоватьИнтерактивноеПолучениеПароля = Ложь;
	КонецЕсли;
	
	Если ИспользоватьИнтерактивноеПолучениеПароля Тогда
		РежимВводаПароля = Вычислить("ИспользованиеИнтерактивногоРежимаКриптографии.Использовать");
	Иначе
		РежимВводаПароля = Вычислить("ИспользованиеИнтерактивногоРежимаКриптографии.НеИспользовать");
	КонецЕсли;
	
	МенеджерКриптографии.НачатьИнициализацию(
		ОписаниеОповещения,
		"",
		ПутьМодуляКриптографии,
		ТипМодуляКриптографии,
		РежимВводаПароля);
	
КонецПроцедуры

&НаКлиенте
Функция ТипыМодулейКриптографии()
	
	Результат = Новый Массив;
	Результат.Добавить(80);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьХранилищеСертификатов(ПараметрыПоиска)
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	
	ТипХранилища = СвойствоСтруктуры(ПараметрыПоиска, "ТипХранилища");
	РасположениеХранилища = СвойствоСтруктуры(ПараметрыПоиска, "РасположениеХранилища");
	
	Возврат МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища);
	
КонецФункции

&НаКлиенте
Функция Новый_ОписаниеСертификата(СертификатКриптографии)
	
	Результат = Новый Структура();
	
	Результат.Вставить("Отпечаток", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.Отпечаток));
	Результат.Вставить("СерийныйНомер", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.СерийныйНомер));
	Результат.Вставить("Издатель", Новый Структура(СертификатКриптографии.Издатель));
	
	Результат.Вставить("Субъект", Новый Структура(СертификатКриптографии.Субъект));
	
	Если СертификатКриптографии.Субъект.Свойство("OGRN") Тогда
		Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OGRN);
	ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_1") Тогда
		Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OID1_2_643_100_1);
	КонецЕсли;
	
	Если СертификатКриптографии.Субъект.Свойство("OGRNIP") Тогда
		Результат.Субъект.Вставить("ОГРНИП", СертификатКриптографии.Субъект.OGRNIP);
	ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_5") Тогда
		Результат.Субъект.Вставить("ОГРНИП" , СертификатКриптографии.Субъект.OID1_2_643_100_5);
	КонецЕсли;
	
	Если СертификатКриптографии.Субъект.Свойство("SNILS") Тогда
		Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.SNILS);
	ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_3") Тогда
		Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.OID1_2_643_100_3);
	КонецЕсли;
	
	ЗаполнитьИНН(Результат.Субъект, СертификатКриптографии.Субъект);
	
	Результат.Вставить("ДатаНачала", СертификатКриптографии.ДатаНачала);
	Результат.Вставить("ДатаОкончания", СертификатКриптографии.ДатаОкончания);
	Результат.Вставить("РасширенныеСвойства", Новый Структура(СертификатКриптографии.РасширенныеСвойства));
	Результат.Вставить("ДвоичныеДанные", Неопределено);
	Результат.Вставить("АлгоритмКлюча", "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИНН(Свойства, Данные)
	
	ИННЮЛ = Неопределено;
	ИНН = Неопределено;
	
	Если Данные.Свойство("INN") Тогда
		ИНН = Данные.INN;
	ИначеЕсли Данные.Свойство("OID1_2_643_3_131_1_1") Тогда
		ИНН = Данные.OID1_2_643_3_131_1_1;
	КонецЕсли;
	
	Если Данные.Свойство("INNLE") Тогда
		ИННЮЛ = Данные.INNLE;
	ИначеЕсли Данные.Свойство("OID1_2_643_100_4")
			И СтрДлина(Данные.OID1_2_643_100_4) = 10 Тогда
		ИННЮЛ = Данные.OID1_2_643_100_4;
	ИначеЕсли Данные.Свойство("_1_2_643_100_4") Тогда
		ИННЮЛ = Данные._1_2_643_100_4;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИННЮЛ) Тогда
		Свойства.Вставить("ИННЮЛ", ИННЮЛ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		Свойства.Вставить("ИНН", ИНН);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция HexСтрокаИзДвоичныхДанных(ДвоичныеДанные)
	
	Если ПриложениеСтаршеВерсии("8.3.10") Тогда
		
		Результат = СтрЗаменить(Строка(ДвоичныеДанные), " ", "");
		
	Иначе
		
		Результат = Вычислить("ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанные)");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыПоискаСертификатов()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипХранилища", ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Результат.Вставить("РасположениеХранилища", РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПолучениеОписанияСертификата(СертификатКриптографии, ОписаниеОповещения)
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии);
	
	ДопПарам = Новый Структура;
	ДопПарам.Вставить("ОписаниеСертификата", Результат);
	ДопПарам.Вставить("ОповещениеОЗавершении", ОписаниеОповещения);
	
	ОписаниеОповещенияОЗавершении = НовыйОписаниеОповещения(
			"ДополнитьОписаниеСертификатаЗавершение",
			ЭтаФорма,
			ДопПарам);
	
	СертификатКриптографии.НачатьВыгрузку(ОписаниеОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьОписаниеСертификатаЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	ОписаниеСертификата = ДополнительныеПараметры.ОписаниеСертификата;
	ОповещениеОЗавершении = ДополнительныеПараметры.ОповещениеОЗавершении;
	
	ОписаниеСертификата.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	ОписаниеСертификата.Вставить("АлгоритмКлюча", "");
	
	ВыполнитьОбработкуОповещенияПереопределенная(ОповещениеОЗавершении, ОписаниеСертификата);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСертификатВМассивеПоОтпечатку(МассивСертификатов, ОтпечатокСертификата)
	
	Результат = Неопределено;
	
	Для Каждого Сертификат Из МассивСертификатов Цикл
		
		ТекущийОтпечаток = HexСтрокаИзДвоичныхДанных(Сертификат.Отпечаток);
		
		Если ВРЕГ(ТекущийОтпечаток) = ВРЕГ(ОтпечатокСертификата) Тогда
			
			Результат = Сертификат;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиСертификатВМассивеСерийномуНомеру(МассивСертификатов, СерийныйНомер)
	
	Результат = Неопределено;
	
	Для Каждого Сертификат Из МассивСертификатов Цикл
		
		ТекущийОтпечаток = HexСтрокаИзДвоичныхДанных(Сертификат.СерийныйНомер);
		
		Если ВРЕГ(ТекущийОтпечаток) = ВРЕГ(СерийныйНомер) Тогда
			
			Результат = Сертификат;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыСертификатовКЭП() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ЮЛ", "ЮЛ");
	Результат.Вставить("ИП", "ИП");
	Результат.Вставить("ФЛ", "ФЛ");
	
	Возврат Результат;
	
КонецФункции


//**********************************************
//{		ОБЩЕГО НАЗНАЧЕНИЯ

// Сравнивает текущую версию приложения с указанной версией.
//
// Параметры:
//  Версия - Строка - номер версии, с которой нужно сравнить текущую версию приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая версия приложения старше чем версия параметра.
//            Например, 8.2 старше чем 8.3.
//
&НаКлиентеНаСервереБезКонтекста
Функция ПриложениеСтаршеВерсии(Версия)
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Результат = (СравнитьВерсии(СисИнфо.ВерсияПриложения, Версия) < 0);
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Версии типа "1.0.1b" сравнивать нельзя.
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
&НаКлиентеНаСервереБезКонтекста
Функция СравнитьВерсии(Знач ПерваяВерсия, Знач ВтораяВерсия, Разделитель = ".")
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(ПерваяВерсия) ИЛИ НЕ ПустаяСтрока(ВтораяВерсия) Цикл
		
		Поз = Найти(ПерваяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(ПерваяВерсия, Поз - 1));
			ПерваяВерсия = Сред(ПерваяВерсия, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(ПерваяВерсия), 0, Число(ПерваяВерсия));
			ПерваяВерсия = "";
		КонецЕсли;
		
		Поз = Найти(ВтораяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(ВтораяВерсия, Поз - 1));
			ВтораяВерсия = Сред(ВтораяВерсия, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(ВтораяВерсия), 0, Число(ВтораяВерсия));
			ВтораяВерсия = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
//
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаКлиенте
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
//
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
//
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если Значение = Неопределено Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		
		Результат = Истина;
		
	ИначеЕсли ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
//
// Возвращаемое значение:
//  Массив - массив со строками, которые получились в результате разделения исходной строки.
//
&НаКлиенте
Функция РазделитьСтрокуЛок(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока = СокрЛП(Строка);
			Строка = "";
		Иначе
			Подстрока = СокрЛП(Лев(Строка, Поз - 1));
			Строка = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строки - Произвольный - значение тип которого нужно определить.
//  Разделитель - ФиксированныйМассив; Массив - значение тип которого нужно определить.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
&НаКлиенте
Функция СоединитьСтроку(Строки, Разделитель = "") Экспорт
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат = "";
	ТекРазделитель = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат = Результат + ТекРазделитель + Строка;
				ТекРазделитель = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйОписаниеОповещения(
		ИмяПроцедуры = Неопределено,
		Модуль = Неопределено,
		ДополнительныеПараметры = Неопределено)
	
	Если ПриложениеСтаршеВерсии("8.3") Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ИмяПроцедуры", ИмяПроцедуры);
		Результат.Вставить("Модуль", Модуль);
		Результат.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		
	Иначе
		
		ПараметрыКонструктора = Новый Массив;
		ПараметрыКонструктора.Добавить(ИмяПроцедуры);
		ПараметрыКонструктора.Добавить(Модуль);
		ПараметрыКонструктора.Добавить(ДополнительныеПараметры);
		
		Результат = Новый("ОписаниеОповещения", ПараметрыКонструктора);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, Результат = Неопределено, КоличествоПараметровОбработчика = 2) Экспорт
	
	Если ОписаниеОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);
	
	#Иначе
	
	Если МодальностьЗапрещена() Тогда
		Выполнить("ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат)");
	Иначе
		// Если модальность не запрещена, то в ОписаниеОповещения у нас будет Структура
		Если КоличествоПараметровОбработчика = 2 Тогда
			Выполнить("ОписаниеОповещения.Модуль."
				+ ОписаниеОповещения.ИмяПроцедуры
				+ "(Результат, ОписаниеОповещения.ДополнительныеПараметры)");
		ИначеЕсли КоличествоПараметровОбработчика = 1 Тогда
			Выполнить("ОписаниеОповещения.Модуль."
				+ ОписаниеОповещения.ИмяПроцедуры
				+ "(ОписаниеОповещения.ДополнительныеПараметры)");
		КонецЕсли;
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МодальностьЗапрещена() Экспорт
	
	Если НЕ ПриложениеСтаршеВерсии("8.3.3") Тогда
		Попытка
			Если Строка(Метаданные.РежимИспользованияМодальности) = "Использовать" Тогда
				Возврат Ложь;
			Иначе
				Возврат Истина;
			КонецЕсли;
		Исключение
			//платфома не в курсе, что есть режим отказа от модальности
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПутиКМодулямКриптоПроLinux() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Linux_x86", ПутиКМодулямПрограммыКриптоПроНаLinux32());
	Результат.Вставить("Linux_x86_64", ПутиКМодулямПрограммыКриптоПроНаLinux64());
	Результат.Вставить("MacOS_x86", ПутиКМодулямПрограммыКриптоПроНаMacOS());
	Результат.Вставить("MacOS_x86_64", ПутиКМодулямПрограммыКриптоПроНаMacOS());
	Результат.Вставить("Linux_E2K", ПутиКМодулямПрограммыКриптоПроНаLinuxE2K());
	Результат.Вставить("Linux_ARM64", ПутиКМодулямПрограммыКриптоПроНаLinuxARM64());
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПутиКМодулямПрограммыКриптоПроНаLinuxE2K()
	
	МодулиПрограммы = Новый Массив;
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/lib64/libcapi10.so");
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/lib64/libcapi20.so");
	
	Возврат СоединитьСтроку(МодулиПрограммы, ":");
	
КонецФункции

&НаКлиенте
Функция ПутиКМодулямПрограммыКриптоПроНаLinuxARM64()
	
	МодулиПрограммы = Новый Массив;
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/lib64/libcapi10.so");
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/lib64/libcapi20.so");
	
	Возврат СоединитьСтроку(МодулиПрограммы, ":");
	
КонецФункции

&НаКлиенте
Функция ПутиКМодулямПрограммыКриптоПроНаLinux64()
	
	МодулиПрограммы = Новый Массив;
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/amd64/libcapi10.so");
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/amd64/libcapi20.so");
	
	Возврат СоединитьСтроку(МодулиПрограммы, ":");
	
КонецФункции

&НаКлиенте
Функция ПутиКМодулямПрограммыКриптоПроНаLinux32()
	
	МодулиПрограммы = Новый Массив;
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/ia32/libcapi10.so");
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/ia32/libcapi20.so");
	
	Возврат СоединитьСтроку(МодулиПрограммы, ":");
	
КонецФункции

&НаКлиенте
Функция ПутиКМодулямПрограммыКриптоПроНаMacOS()
	
	МодулиПрограммы = Новый Массив;
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/libcapi10.dylib");
	МодулиПрограммы.Добавить("/opt/cprocsp/lib/libcapi20.dylib");
	
	Возврат СоединитьСтроку(МодулиПрограммы, ":");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуВЖурналРегистрации(Знач ИмяСобытия, Знач ПодробноеПредставлениеОшибки)
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка, , ,
		ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

//}		ОБЩЕГО НАЗНАЧЕНИЯ
