// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем Ядро;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

&НаКлиенте
Процедура ИнициализироватьМодуль(ЯдроНаКлиенте) Экспорт
	
	Ядро = ЯдроНаКлиенте;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция ПодключаемыйМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыПМ) Экспорт
	
	Результат = Ядро.ПодключаемыйМодуль_ОбработатьСобытиеНаСервере(ИмяСобытия, ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументыДляСтрокСписка(СтрокиСписка, ДополнительныеПараметрыПМ) Экспорт

	ОсновнаяФорма = Ядро.ОсновнаяФорма();
	
	ДанныеДляОбработки	= ОсновнаяФорма.МассивДокументовИзДанныхДокументов(СтрокиСписка);
	Действие			= ОсновнаяФорма.ДействияЭДО().СоздатьДокумент;
	КатегорияМетрики	= ОсновнаяФорма.Метрика_НазваниеКатегории().СозданиеДокументов;
	ДействиеМетрики		= "Создать";
	
	ПараметрыСоздания = ПараметрыСозданияДокументов(ДополнительныеПараметрыПМ);
	ПараметрыОбработки = ОсновнаяФорма.Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, Действие, КатегорияМетрики, ДействиеМетрики);
	ПараметрыОбработки.Вставить("ДополнительныеПараметры", ПараметрыСоздания);
	
	ОсновнаяФорма.ОбработатьСоздатьДокументы(, ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(ОтборПоПакету = Неопределено) Экспорт

	Ядро.ОсновнаяФорма().ОбновитьСписок(,ОтборПоПакету);
	
КонецПроцедуры

&НаКлиенте
Функция ПодписьДанных(BoxId, ДвоичныеДанные, ОтпечатокСертификата = "") Экспорт
	
	Результат = Ядро.ПодписьДанных(BoxId, ДвоичныеДанные, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭДО_ОтправитьСогласующуюПодпись(ДокументЭДО, ОтпечатокСертификата = "") Экспорт
	
	Действие = Ядро.Перечисление_ДействияЭДО().ПодписатьСогласующейПодписью;
	
	Результат = ВыполнитьДействиеСДокументомЭДО(ДокументЭДО, Действие, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьДействиеСДокументомЭДО(ДокументЭДО, Действие, Знач ОтпечатокСертификата = "")
	
	Результат = Неопределено;
	
	Идентификаторы = ДокументЭДО;
	Если ТипЗнч(ДокументЭДО) <> Тип("Структура") Тогда
		Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	КонецЕсли;
	
	СохраненныйДокумент = Ядро.ХранениеДанных_ДанныеДокумента(Идентификаторы);
	
	МассивДокументов = Ядро.ЗначениеВМассив(СохраненныйДокумент);
	
	Если МассивДокументов.Количество() > 0 Тогда
		Результат = Ядро.Документы_ВыполнитьДействиеСДокументами(МассивДокументов, Действие, ОтпечатокСертификата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_Идентификаторы(ДокументЭДО = Неопределено, ПакетЭДО = Неопределено, BoxId = "", LetterId = "", DocumentId = "")
	
	Результат = Ядро.Контракт_Идентификаторы();
	
	Результат.ДокументЭДО = ДокументЭДО;
	Результат.ПакетЭДО = ПакетЭДО;
	Результат.BoxId = BoxId;
	Результат.LetterId = LetterId;
	Результат.DocumentId = DocumentId;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыСозданияДокументов(ДополнительныеПараметрыПМ)
	
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныеПараметры", ДополнительныеПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции


//**********************************************
//{		КОНТУР.ПЛАГИНЫ

&НаКлиенте
Процедура КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды) Экспорт
	
	Ядро.КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды);
	
КонецПроцедуры

//}		КОНТУР.ПЛАГИНЫ