// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;

&НаСервере
Перем ИменаСправочниковДиадок;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		Сервисные методы
	
&НаСервере
Функция ОбработкаОбъект()

	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

//}		Сервисные методы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	ОбновитьСписокНаСервере();
	
	ЭтаФорма.Заголовок = "Подразделения: " + Параметры.ДанныеВладельца.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	СписокПодразделений	= Модуль_ЯдроНаСервере().Подразделения_СписокПодразделений(Параметры.ДанныеВладельца, Параметры.ДанныеОрганизации);
	
	мДеревоПодразделений = РеквизитФормыВЗначение("ДеревоПодразделений");
	мДеревоПодразделений.Строки.Очистить();
	
	ОбработкаОбъект().ЗаполнитьДеревоПодразделений(мДеревоПодразделений, СписокПодразделений, "ID_РодительПодразделения", "");
	
	Если ЗначениеЗаполнено(Параметры.ДанныеВладельца) И Не ЗначениеЗаполнено(Параметры.ДанныеОрганизации) Тогда
		ИмяСправочника = ИменаСправочников_Диадок().Организации;
	Иначе
		ИмяСправочника = ИменаСправочников_Диадок().Контрагенты;
	КонецЕсли;
	
	ОбработкаОбъект().ЗаполнитьПредставлениеСвязейВДеревеПодразделений(	мДеревоПодразделений.Строки,
																		ИмяСправочника,
																		Параметры.ДанныеВладельца.ID);
	
	ЗначениеВРеквизитФормы(мДеревоПодразделений, "ДеревоПодразделений");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Диадок_Сохранение_Подразделение" Тогда
		ОбновитьСписокНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьЭлементСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементСписка()
	
	ТекСтрока = Элементы.ДеревоПодразделений.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда

		ДанныеПодразделения = ПодразделениеИзСтрокиДанных(ТекСтрока.ДанныеПодразделения);
		ЭтаФорма.Закрыть(ДанныеПодразделения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодразделениеИзСтрокиДанных(ДанныеСтрокиТЧ)
	
	Результат = ЗначениеИзСтрокиВнутр(ДанныеСтрокиТЧ);
	
	Возврат Результат;
	
КонецФункции

Функция ИменаСправочников_Диадок()
	
	Если ИменаСправочниковДиадок = Неопределено Тогда
		ИменаСправочниковДиадок = Модуль_ЯдроНаСервере().Перечисление_ИменаСправочников_Диадок();
	КонецЕсли;
	
	Возврат ИменаСправочниковДиадок;
	
КонецФункции

