// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем Настройка_ИспользоватьВнешнийHTTP;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

&НаКлиенте
Процедура ИнициализироватьМодуль(ИспользоватьВнешнийHTTP) Экспорт
	
	Настройка_ИспользоватьВнешнийHTTP = ИспользоватьВнешнийHTTP;	
	
КонецПроцедуры

//**********************************************
//{		Http запрос

&НаКлиенте
Функция ПараметрыHTTPЗапроса() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Метод");
	Результат.Вставить("АдресМетода");
	Результат.Вставить("ТелоЗапроса");
	Результат.Вставить("Параметры"					, Новый Структура);
	Результат.Вставить("Заголовки"					, Новый Соответствие);
	Результат.Вставить("ДопустимыеКодыОтвета"		, Новый Массив);
	Результат.Вставить("ТелоОтветаКакДвоичныеДанные", Ложь);
	
	Результат.Метод = "GET";
	
	Результат.Заголовки.Вставить("Accept"		, "application/json");
	Результат.Заголовки.Вставить("Content-Type"	, "application/json;charset=utf-8");
	
	Результат.ДопустимыеКодыОтвета.Добавить(200);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса) Экспорт
	
	Попытка
		
		Если ИспользоватьВнешнийHTTP() Тогда
			
			Результат = ВыполнитьHTTPЗапрос_Plugin(ПараметрыСервиса, ПараметрыЗапроса);
			
		Иначе
			
			Результат = ВыполнитьHTTPЗапрос_Native(ПараметрыСервиса, ПараметрыЗапроса);
			
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если НЕ Результат.КодОтветаДопустимый Тогда
		
		КодОтвета = Результат.КодОтвета;
		ТелоОтветаСтрокой = "";
		Если ТипЗнч(Результат.ТелоОтвета) = Тип("Строка") Тогда
			ТелоОтветаСтрокой = НРег(Результат.ТелоОтвета);
		КонецЕсли;
		
		Если ЭтоОшибкаАвторизации(КодОтвета, ТелоОтветаСтрокой) Тогда
			
			ОчиститьКонтекстСеанса();
			
			ТекстОшибки = НСтр("ru = 'Прошло слишком много времени с последней авторизации.
					|Для продолжения работы необходимо перезапустить модуль Диадока.'");
			
		Иначе
			
			СтрокаОшибки = НСтр(
					"ru = 'Ошибка HTTP запроса
					|Код ошибки: %1
					|%2'");
			
			ТекстОшибки = Общее_ПодставитьПараметрыВСтроку(СтрокаОшибки, КодОтвета, ТелоОтветаСтрокой);
			
		КонецЕсли;
		
		ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаление токена из контекста сеанса.
//
// Параметры:
//  Токен - Строка - Токен, по которому нужно очистить контекст сеанса.
//
&НаКлиенте
Процедура ОчиститьКонтекстСеанса()
	
	Ядро().ОчиститьКонтекстИКэшСеанса();
	
КонецПроцедуры

// Проверяет ответ HTTP-запроса на предмет наличия ошибки авторизации по токену.
//
// Параметры:
//  КодОтвета  - Число - Код ответа HTTP-сервиса.
//  ТелоОтвета - Строка - Текстовый ответ HTTP-сервиса.
//
// Возвращаемое значение:
//   Булево - Результат проверки ошибки авторизации.
//     * Истина - Произошла ошибка авторизации.
//     * Ложь   - Авторизация прошла учпешно.
//
&НаКлиенте
Функция ЭтоОшибкаАвторизации(КодОтвета, ТелоОтвета)
	
	Результат = КодОтвета = 401
				И ТелоОтвета = "invalid auth token";
									
	Возврат Результат

КонецФункции

//}		Http запрос


//**********************************************
//{		Получение списка сертификатов

&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов() Экспорт
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата();
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		ПараметрыПоиска.Вставить("ЕстьЗакрытыйКлюч", Истина);
		СписокСертификатов = Плагин_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	Иначе
		СписокСертификатов = ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	Результат = ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокЛокальныхСертификатов_Асинхронно(Знач ОписаниеОповещения) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения",	 ОписаниеОповещения);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения("ПолучитьСписокЛокальныхСертификатов_Завершение", ЭтаФорма, ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения("ПолучитьСписокЛокальныхСертификатов_ИнициализацияМенеджера_Завершение", ЭтаФорма, ОповещениеЗавершения);
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокЛокальныхСертификатов_Завершение(СертификатыКриптографии, ДополнительныеПараметры) Экспорт 
	
	СвойстваСертификата = ВсеСвойстваСертификата();
	
	СписокСертификатов = Новый Массив;
	
	Для Каждого СертификатКриптографии Из СертификатыКриптографии Цикл
		СписокСертификатов.Добавить(Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата));
	КонецЦикла;
	
	Результат = ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов);
	ВыполнитьОбработкуОповещенияПереопределенная(ДополнительныеПараметры.ОповещениеЗавершения, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокЛокальныхСертификатов_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт 
	
	Оповещение = НовыйОписаниеОповещения("ПолучитьСписокЛокальныхСертификатов_ПолучениеХранилищаСертификатов_Завершение", ЭтаФорма, ОписаниеОповещения);
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(Оповещение, ПараметрыПоиска.ТипХранилища, ПараметрыПоиска.РасположениеХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокЛокальныхСертификатов_ПолучениеХранилищаСертификатов_Завершение(Хранилище, ОписаниеОповещения) Экспорт 
	
	Хранилище.НачатьПолучениеВсех(ОписаниеОповещения);
	
КонецПроцедуры

//}		Получение списка сертификатов


//**********************************************
//{		Получение сертификата

&НаКлиенте
Функция ПолучитьСертификат(ОтпечатокСертификата) Экспорт
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата(Истина);
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		ПараметрыПоиска.Вставить("Отпечаток", ОтпечатокСертификата);
		Результат = Плагин_ПолучитьДанныеСертификата(ПараметрыПоиска, СвойстваСертификата);
	Иначе
		Результат = ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСертификат_Асинхронно(Знач ОписаниеОповещения, ОтпечатокСертификата) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения",	ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ОтпечатокСертификата",	ОтпечатокСертификата);
	ДополнительныеПараметры.Вставить("СвойстваСертификата",		ВсеСвойстваСертификата(Истина));
	
	ОповещениеЗавершения = НовыйОписаниеОповещения("ПолучитьСертификат_Завершение", ЭтаФорма, ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения("ПолучитьСертификат_ИнициализацияМенеджера_Завершение", ЭтаФорма, ОповещениеЗавершения);
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификат_Завершение(СертификатыКриптографии, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ОтпечатокСертификата = СвойствоСтруктуры(ДополнительныеПараметры, "ОтпечатокСертификата");
	СвойстваСертификата	 = СвойствоСтруктуры(ДополнительныеПараметры, "СвойстваСертификата");
	
	Если ТипЗнч(СертификатыКриптографии) = Тип("Массив") Тогда
		
		СертификатКриптографии = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	Иначе
		
		СертификатКриптографии = СертификатыКриптографии;
		
	КонецЕсли;
	
	НачатьПолучениеОписанияСертификата(ОповещениеЗавершения, СертификатКриптографии, СвойстваСертификата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификат_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт 
	
	Оповещение = НовыйОписаниеОповещения("ПолучитьСертификат_ПолучениеХранилищаСертификатов_Завершение", ЭтаФорма, ОписаниеОповещения);
	
	ПараметрыПоиска = ПараметрыПоискаСертификатов();
	
	МенеджерКриптографии.НачатьПолучениеХранилищаСертификатов(Оповещение, ПараметрыПоиска.ТипХранилища, ПараметрыПоиска.РасположениеХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификат_ПолучениеХранилищаСертификатов_Завершение(Хранилище, ОписаниеОповещения) Экспорт 
	
	ОтпечатокСертификата = ОписаниеОповещения.ДополнительныеПараметры.ОтпечатокСертификата;
	
	Если ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда 
		Хранилище.НачатьПоискПоОтпечатку(ОписаниеОповещения, ОтпечатокСертификата);
	Иначе
		Хранилище.НачатьПолучениеВсех(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

//}		Получение сертификата


//**********************************************
//{		Подпись

&НаКлиенте
Функция ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера = Неопределено) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата);
	Иначе
		Результат = ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодписатьДанные_Асинхронно(Знач ОписаниеОповещения, ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера = Неопределено) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения",	ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанные",			ДвоичныеДанные);
	ДополнительныеПараметры.Вставить("ОтпечатокСертификата",	ОтпечатокСертификата);
	ДополнительныеПараметры.Вставить("ПарольКонтейнера",		ПарольКонтейнера);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения("ПодписатьДанные_Завершение", ЭтаФорма, ДополнительныеПараметры);
	
	ОповещениеПолучениеСертификатаЗавершение = НовыйОписаниеОповещения("ПодписатьДанные_ПолучитьСертификат_Завершение", ЭтаФорма, ОповещениеЗавершения);
	ПолучитьСертификат_Асинхронно(ОповещениеПолучениеСертификатаЗавершение, ОтпечатокСертификата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДанные_Завершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт 
	
	ОповещениеЗавершения	 = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ДвоичныеДанные			 = СвойствоСтруктуры(ДополнительныеПараметры, "ДвоичныеДанные");
	СертификатКриптографии	 = СвойствоСтруктуры(ДополнительныеПараметры, "СертификатКриптографии");
	ПарольКонтейнера		 = СвойствоСтруктуры(ДополнительныеПараметры, "ПарольКонтейнера");
	
	УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольКонтейнера);
	МенеджерКриптографии.НачатьПодписывание(ОповещениеЗавершения, ДвоичныеДанные, СертификатКриптографии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДанные_ПолучитьСертификат_Завершение(Сертификат, ОписаниеОповещения) Экспорт 
	
	СертификатКриптографии = Новый СертификатКриптографии(Сертификат.ДвоичныеДанные);
	ОписаниеОповещения.ДополнительныеПараметры.Вставить("СертификатКриптографии", СертификатКриптографии);
	НачатьИнициализациюМенеджераКриптографии(ОписаниеОповещения);
	
КонецПроцедуры

//}		Подпись


//**********************************************
//{		Шифрование

&НаКлиенте
Функция ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов);
	Иначе 
		Результат = ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗашифроватьДанные_Асинхронно(Знач ОписаниеОповещения, ДвоичныеДанные, МассивСертификатов) Экспорт 
	
	СертификатыКриптографии = Новый Массив;
	
	Для Каждого ДвоичныеДанныеСертификата Из МассивСертификатов Цикл 
		СертификатыКриптографии.Добавить(Новый СертификатКриптографии(ДвоичныеДанныеСертификата));
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения",	ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанные",			ДвоичныеДанные);
	ДополнительныеПараметры.Вставить("СертификатыКриптографии",	СертификатыКриптографии);
	
	Оповещение = НовыйОписаниеОповещения("ЗашифроватьДанные_Завершение", ЭтаФорма, ДополнительныеПараметры);
	НачатьИнициализациюМенеджераКриптографии(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗашифроватьДанные_Завершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт 
	
	ОповещениеЗавершения	 = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ДвоичныеДанные			 = СвойствоСтруктуры(ДополнительныеПараметры, "ДвоичныеДанные");
	СертификатыКриптографии	 = СвойствоСтруктуры(ДополнительныеПараметры, "СертификатыКриптографии");
	
	МенеджерКриптографии.НачатьШифрование(ОповещениеЗавершения, ДвоичныеДанные, СертификатыКриптографии);
	
КонецПроцедуры


//}		Шифрование


//**********************************************
//{		Расшифровка

&НаКлиенте
Функция РасшифроватьДанные(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера = Неопределено) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные);
	Иначе
		Результат = РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РасшифроватьДанные_Асинхронно(Знач ОписаниеОповещения, ЗашифрованныеДвоичныеДанные, ПарольКонтейнера = Неопределено) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения",		ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ЗашифрованныеДвоичныеДанные",	ЗашифрованныеДвоичныеДанные);
	ДополнительныеПараметры.Вставить("ПарольКонтейнера",			ПарольКонтейнера);
	
	Оповещение = НовыйОписаниеОповещения("РасшифроватьДанные_Завершение", ЭтаФорма, ДополнительныеПараметры);
	НачатьИнициализациюМенеджераКриптографии(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьДанные_Завершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт 
	
	ОповещениеЗавершения		 = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	ЗашифрованныеДвоичныеДанные	 = СвойствоСтруктуры(ДополнительныеПараметры, "ЗашифрованныеДвоичныеДанные");
	ПарольКонтейнера			 = СвойствоСтруктуры(ДополнительныеПараметры, "ПарольКонтейнера");
	
	УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольКонтейнера);
	МенеджерКриптографии.НачатьРасшифровку(ОповещениеЗавершения, ЗашифрованныеДвоичныеДанные);
	
КонецПроцедуры

//}		Расшифровка


//**********************************************
//{		Проверка подписи

&НаКлиенте
Функция ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	Иначе
		Результат = ПроверитьПодпись_Native(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодпись_Асинхронно(Знач ОписаниеОповещения, ДвоичныеДанные, ДвоичныеДанныеПодписи) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения",			ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанные",					ДвоичныеДанные);
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеПодписи",			ДвоичныеДанныеПодписи);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения("ПроверитьПодпись_Завершение", ЭтаФорма, ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения("ПроверитьПодпись_ИнициализацияМенеджера_Завершение", ЭтаФорма, ОповещениеЗавершения);
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодпись_Завершение(СертификатКриптографии, ДополнительныеПараметры) Экспорт 
	
	ОповещениеЗавершения	 = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	
	НачатьПолучениеОписанияСертификата(ОповещениеЗавершения, СертификатКриптографии, ВсеСвойстваСертификата(Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодпись_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт 
	
	ДвоичныеДанные			 = СвойствоСтруктуры(ОписаниеОповещения.ДополнительныеПараметры, "ДвоичныеДанные");
	ДвоичныеДанныеПодписи	 = СвойствоСтруктуры(ОписаниеОповещения.ДополнительныеПараметры, "ДвоичныеДанныеПодписи");
	
	МенеджерКриптографии.НачатьПроверкуПодписи(ОписаниеОповещения, ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
КонецПроцедуры

//}		Проверка подписи


//**********************************************
//{		Получение сертификата из подписи

&НаКлиенте
Функция ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи);
	Иначе
		Результат = ПолучитьСертификатИзПодписи_Native(ДвоичныеДанныеПодписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСертификатИзПодписи_Асинхронно(Знач ОписаниеОповещения, ДвоичныеДанныеПодписи) Экспорт 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения",			ОписаниеОповещения);
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеПодписи",			ДвоичныеДанныеПодписи);
	
	ОповещениеЗавершения = НовыйОписаниеОповещения("ПолучитьСертификатИзПодписи_Завершение", ЭтаФорма, ДополнительныеПараметры);
	
	ОповещениеИнициализацияМенеджераЗавершение = НовыйОписаниеОповещения("ПолучитьСертификатИзПодписи_ИнициализацияМенеджера_Завершение", ЭтаФорма, ОповещениеЗавершения);
	НачатьИнициализациюМенеджераКриптографии(ОповещениеИнициализацияМенеджераЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатИзПодписи_Завершение(СертификатыКриптографии, ДополнительныеПараметры) Экспорт 
	
	ОповещениеЗавершения = СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеЗавершения");
	
	СертификатКриптографии = Неопределено;
	
	Если СертификатыКриптографии.Количество() > 0 Тогда
		СертификатКриптографии = СертификатыКриптографии[0];
	КонецЕсли;
	
	НачатьПолучениеОписанияСертификата(ОповещениеЗавершения, СертификатКриптографии, ВсеСвойстваСертификата(Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатИзПодписи_ИнициализацияМенеджера_Завершение(МенеджерКриптографии, ОписаниеОповещения) Экспорт 
	
	ДвоичныеДанныеПодписи = СвойствоСтруктуры(ОписаниеОповещения.ДополнительныеПараметры, "ДвоичныеДанныеПодписи");
	МенеджерКриптографии.НачатьПолучениеСертификатовИзПодписи(ОписаниеОповещения, ДвоичныеДанныеПодписи);
	
КонецПроцедуры

//}		Получение сертификата из подписи


//{		Расширение работы с криптографией

&НаСервере
Процедура РасширениеРаботыСКриптографией_Установить(Знач ОписаниеОповещения) Экспорт 
	
	Выполнить("НачатьУстановкуРасширенияРаботыСКриптографией(ОписаниеОповещения)");
	
КонецПроцедуры

&НаСервере
Процедура РасширениеРаботыСКриптографией_Подключить(Знач ОписаниеОповещения) Экспорт 
	
	Выполнить("НачатьПодключениеРасширенияРаботыСКриптографией(ОписаниеОповещения)");
	
КонецПроцедуры

//}		Расширение работы с криптографией




//**************************************
//{		ПЛАГИН

&НаКлиенте
Функция Плагин_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса)
	
	Результат = Модуль_Плагин().ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата) Экспорт
	
	Результат = Модуль_Плагин().ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_ПолучитьДанныеСертификата(ПараметрыПоиска, СвойстваСертификата)
	
	Результат = Модуль_Плагин().ПолучитьДанныеСертификата(ПараметрыПоиска, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи)
	
	Результат = Модуль_Плагин().ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи)
	
	СвойстваСертификата = ВсеСвойстваСертификата(Истина, Ложь);
	
	Результат = Модуль_Плагин().ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата)
	
	Сертификат = Новый Структура;
	Сертификат.Вставить("Отпечаток"				, ОтпечатокСертификата);
	Сертификат.Вставить("ТипХранилища"			, "ПерсональныеСертификаты");
	Сертификат.Вставить("РасположениеХранилища"	, "ДанныеПользователяОС");
	
	Результат = Модуль_Плагин().ПодписатьКонтент(ДвоичныеДанные, Сертификат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов)
	
	Сертификаты = Новый Массив;
	
	Для Каждого ДвоичныеДанныеСертификата Из МассивСертификатов Цикл
		Сертификаты.Добавить(Новый Структура("ДвоичныеДанные", ДвоичныеДанныеСертификата));
	КонецЦикла;
	
	Результат = Модуль_Плагин().ЗашифроватьКонтент(ДвоичныеДанные, Сертификаты);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные)
	
	Результат = Модуль_Плагин().РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Плагин_ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка = "utf-8")
	
	Результат = Модуль_Плагин().ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка);
	
	Возврат Результат;
	
КонецФункции

//}		ПЛАГИН


//**********************************************
//{		HTTP

// Определяет какой транспорт нужно использовать
// в зависимости от версии приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если приложение старше 8.3.6.
//
&НаКлиенте
Функция ИспользоватьВнешнийHTTP()
	
	ИспользоватьНативныйHTTP = НЕ ПриложениеСтаршеВерсии("8.3.6");
	НеИспользоватьВнешнийHTTP = НЕ Настройка_ИспользоватьВнешнийHTTP;
	
	Если ИспользоватьНативныйHTTP 
		И НеИспользоватьВнешнийHTTP Тогда
		
		// В версии "8.3.6" HTTPЗапрос получил необходимый нам параметр ИспользоватьBOM.
		
		Результат = Ложь;
		
	Иначе
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает объект HTTP cоединение по адресу вэб сервиса.
//
// Параметры:
//  ПараметрыСервиса - Структура - см. функцию ядра ПараметрыСервиса().
//
// Возвращаемое значение:
//   HTTPСоединение
//
&НаКлиенте
Функция HTTPСоединение(ПараметрыСервиса)
	
	Результат = Неопределено;
	
	АдресВебСервиса				 = ПараметрыСервиса.АдресВебСервиса;
	ИспользоватьНовоеСоединение	 = ПараметрыСервиса.ИспользоватьНовоеСоединение;
	
	Если ИспользоватьНовоеСоединение Тогда
		Кэш_Поместить("HTTPСоединения", Неопределено);
	КонецЕсли;
	
	HTTPСоединения = Кэш_Прочитать("HTTPСоединения");
	
	Если HTTPСоединения = Неопределено Тогда
		HTTPСоединения = Новый Соответствие;
		Кэш_Поместить("HTTPСоединения", HTTPСоединения);
	КонецЕсли;
	
	Результат = HTTPСоединения.Получить(АдресВебСервиса);
	
	Если Результат = Неопределено Тогда
		
		Прокси		 = НовыйИнтернетПрокси(ПараметрыСервиса.НастройкиПрокси);
		Результат	 = НовоеHTTPСоединение(ПараметрыСервиса, Прокси);
		
		Если НЕ ИспользоватьНовоеСоединение Тогда
			HTTPСоединения.Вставить(АдресВебСервиса, Результат);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки)
	
	Метод			 = ПараметрыЗапроса.Метод;
	АдресМетода		 = ПараметрыЗапроса.АдресМетода;
	АдресВебСервиса	 = ПараметрыСервиса.АдресВебСервиса;
	ДопИнформация	 = Новый Массив;
	
	ВидОперации = Общее_ПодставитьПараметрыВСтроку(НСтр(
	"ru = 'HTTP запрос в сервис %1'"), АдресВебСервиса);
	
	ДопИнформация.Добавить(Общее_ПодставитьПараметрыВСтроку(НСтр(
	"ru = 'Метод: %1'"), Метод));
	
	ДопИнформация.Добавить(Общее_ПодставитьПараметрыВСтроку(НСтр(
	"ru = 'Адрес метода: https:// %1%2'"), АдресВебСервиса, АдресМетода));
	
	Если ИспользоватьВнешнийHTTP() Тогда
		ДопИнформация.Добавить("Использован внешний HTTP транспорт");
	КонецЕсли;
	
	Ядро().Ошибка_Обработать(ВидОперации, ТекстОшибки, ДопИнформация);
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьHTTPЗапрос_Native(ПараметрыСервиса, ПараметрыЗапроса)
	
	ДопустимыеКодыОтвета		 = ПараметрыЗапроса.ДопустимыеКодыОтвета;
	ТелоОтветаКакДвоичныеДанные	 = ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Ответ = ОтправитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета			 = Ответ.КодСостояния;
	ЗаголовкиОтвета		 = Ответ.Заголовки;
	КодОтветаДопустимый	 = ДопустимыеКодыОтвета.Найти(КодОтвета) <> Неопределено;
	
	Если ТелоОтветаКакДвоичныеДанные И КодОтветаДопустимый Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Иначе
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета"			, КодОтвета);
	Результат.Вставить("ТелоОтвета"			, ТелоОтвета);
	Результат.Вставить("Заголовки"			, ЗаголовкиОтвета);
	Результат.Вставить("КодОтветаДопустимый", КодОтветаДопустимый);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьHTTPЗапрос_Plugin(ПараметрыСервиса, ПараметрыЗапроса)
	
	ДопустимыеКодыОтвета		 = ПараметрыЗапроса.ДопустимыеКодыОтвета;
	ТелоОтветаКакДвоичныеДанные	 = ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Ответ = ОтправитьHTTPЗапрос_Plugin(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета			 = Число(Ответ.КодСостояния);
	ЗаголовкиОтвета		 = Ответ.Заголовки;
	КодОтветаДопустимый	 = ДопустимыеКодыОтвета.Найти(КодОтвета) <> Неопределено;
	
	Если ТелоОтветаКакДвоичныеДанные Тогда
		
		Если КодОтветаДопустимый Тогда
			ТелоОтвета = Ответ.ТелоОтвета;
		Иначе
			ТелоОтвета = Плагин_ПреобразоватьКонтент(Ответ.ТелоОтвета, Новый Структура("Строка"));
		КонецЕсли;
		
	Иначе
		
		ТелоОтвета = Ответ.ТелоОтвета;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета"			, КодОтвета);
	Результат.Вставить("ТелоОтвета"			, ТелоОтвета);
	Результат.Вставить("Заголовки"			, ЗаголовкиОтвета);
	Результат.Вставить("КодОтветаДопустимый", КодОтветаДопустимый);
	
	Возврат Результат;
	
КонецФункции

// Вычисляет адрес ресурса по имени метода API и его параметрам.
//
&НаКлиенте
Функция АдресРесурсаHTTP(ИмяМетода, Параметры = Неопределено)
	
	ПараметрыСтрокой = "";
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		
		Если Найти(ИмяМетода, "?") = 0 Тогда
			Разделитель = "?";
		Иначе
			Разделитель = "&";
		КонецЕсли;
		
		Для Каждого Параметр Из Параметры Цикл
			// Метод Общее_ПодставитьПараметрыВСтроку использовать нельзя, в параметрах может быть %n
			ПараметрыСтрокой = ПараметрыСтрокой + Разделитель + Параметр.Ключ + "=" + Параметр.Значение;
			Разделитель = "&";
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = ИмяМетода + ПараметрыСтрокой;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтправитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса)
	
	Метод		 = ПараметрыЗапроса.Метод;
	АдресМетода	 = ПараметрыЗапроса.АдресМетода;
	ТелоЗапроса	 = ПараметрыЗапроса.ТелоЗапроса;
	Параметры	 = ПараметрыЗапроса.Параметры;
	Заголовки	 = ПараметрыЗапроса.Заголовки;
	
	Соединение	 = HTTPСоединение(ПараметрыСервиса);
	АдресРесурса = АдресРесурсаHTTP(АдресМетода, Параметры);
	HTTPЗапрос	 = НовыйHTTPЗапрос(АдресРесурса, Заголовки);
	
	Если Метод = "GET" Тогда
		
		Результат = Соединение.Получить(HTTPЗапрос);
		
	ИначеЕсли Метод = "POST" Тогда
		
		Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
			
			Если ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
				
				HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8,
				ПредопределенноеЗначение("ИспользованиеByteOrderMark.НеИспользовать"));
				
			Иначе
				
				HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтправитьHTTPЗапрос_Plugin(ПараметрыСервиса, ПараметрыЗапроса)
	
	Метод			 = ПараметрыЗапроса.Метод;
	АдресМетода		 = ПараметрыЗапроса.АдресМетода;
	ТелоЗапроса		 = ПараметрыЗапроса.ТелоЗапроса;
	Параметры		 = ПараметрыЗапроса.Параметры;
	Заголовки		 = ПараметрыЗапроса.Заголовки;
	СтрокаЗапроса	 = "https://" + ПараметрыСервиса.АдресВебСервиса + АдресМетода;
	
	ПараметрыЗапросаДляПлагина = Новый Структура;
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		ПараметрыЗапросаДляПлагина.Вставить("Параметры", Параметры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		ПараметрыЗапросаДляПлагина.Вставить("Заголовки", Заголовки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		ПараметрыЗапросаДляПлагина.Вставить("ТелоЗапроса", ТелоЗапроса);
	КонецЕсли;
	
	Если ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные Тогда
		ПараметрыЗапросаДляПлагина.Вставить("ТелоОтвета", Новый Структура("ДвоичныеДанные"));
	Иначе
		ПараметрыЗапросаДляПлагина.Вставить("ТелоОтвета", Новый Структура("Строка"));
	КонецЕсли;
	
	Результат = Плагин_ВыполнитьHTTPЗапрос(Метод, СтрокаЗапроса, ПараметрыЗапросаДляПлагина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыПрокси_COM(ПараметрыСервиса, Соединение)
	
	// Значения констант: https://msdn.microsoft.com/en-us/library/windows/desktop/aa384059(v=vs.85).aspx
	
	НастройкиПрокси	 = ПараметрыСервиса.НастройкиПрокси;
	РежимПрокси		 = НастройкиПрокси.РежимПрокси;
	
	Если РежимПрокси = "NoProxy" Тогда
		
		Соединение.SetProxy(1, "");  // HTTPREQUEST_PROXYSETTING_DIRECT = 1
		
	ИначеЕсли РежимПрокси = "UseDefaultProxy" Тогда
		
		Соединение.SetProxy(0, "");  // HTTPREQUEST_PROXYSETTING_PRECONFIG = 0
		
	ИначеЕсли РежимПрокси = "UseProxy" Тогда
		
		АдресПроксиСервера	= НастройкиПрокси.АдресПроксиСервера;
		Порт				= НастройкиПрокси.ПортПроксиСервера;
		
		Если Не ЗначениеЗаполнено(АдресПроксиСервера) Тогда
			ВызватьИсключение "Заполните настройки прокси";
		КонецЕсли;
		
		ProxyServer = АдресПроксиСервера + ":" + Формат(Порт, "ЧГ=0");
		
		Соединение.SetProxy(2, ProxyServer);  // HTTPREQUEST_PROXYSETTING_PROXY = 2
			
		// Логин и пароль необходимо указать после установки соединения - т.е. после вызова метода Open
		// Это вынесено в отдельный метод - ВыполнитьАвторизациюНаПрокси_COM
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НовыйИнтернетПрокси(НастройкиПрокси)
	
	РежимПрокси = НастройкиПрокси.РежимПрокси;
	
	Если РежимПрокси = "UseProxy" Тогда
		
		Результат = Новый ИнтернетПрокси;
		
		АдресПроксиСервера = НастройкиПрокси.АдресПроксиСервера;
		Порт = НастройкиПрокси.ПортПроксиСервера;
		Логин = НастройкиПрокси.ЛогинПроксиСервера;
		Пароль = НастройкиПрокси.ПарольПроксиСервера;
		
		Если НЕ ЗначениеЗаполнено(АдресПроксиСервера) Тогда
			ВызватьИсключение "Заполните настройки прокси";
		КонецЕсли;
		
		Протокол1 = "http";
		Протокол2 = "https";
		Если ЗначениеЗаполнено(Логин) Тогда
			
			Если РежимСовместимостиКонфигурацииНижеВерсии("8.3.6") Тогда
				
				Результат.Установить(Протокол1, АдресПроксиСервера, Порт);
				Результат.Установить(Протокол2, АдресПроксиСервера, Порт);
				
				Результат.Пользователь = Логин;
				Результат.Пароль = Пароль;
				
			ИначеЕсли РежимСовместимостиКонфигурацииНижеВерсии("8.3.7") Тогда
				
				Результат.Установить(Протокол1, АдресПроксиСервера, Порт, Логин, Пароль);
				Результат.Установить(Протокол2, АдресПроксиСервера, Порт, Логин, Пароль);
				
			Иначе
				
				Результат.Установить(Протокол1, АдресПроксиСервера, Порт, Логин, Пароль, Ложь);
				Результат.Установить(Протокол2, АдресПроксиСервера, Порт, Логин, Пароль, Ложь);
				
			КонецЕсли;
			
		Иначе
			
			Результат.Установить(Протокол1, АдресПроксиСервера, Порт);
			Результат.Установить(Протокол2, АдресПроксиСервера, Порт);
			
		КонецЕсли;
		
	ИначеЕсли РежимПрокси = "UseDefaultProxy" Тогда
		
		Результат = Новый ИнтернетПрокси(Истина);
		// Будет использован прокси по умолчанию:
		// либо из файла inetcfg.xml, если он расположен на данной машине, либо из настроек Internet Explorer.
		// Пример файла inetcfg.xml можно найти в официальной документации:
		// https://its.1c.ru/db/v8doc#content:26:1:issogl1_3.13.inetcfg.xml
		
	Иначе
		
		Результат = Новый ИнтернетПрокси(Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовоеHTTPСоединение(ПараметрыСервиса, Прокси)
	
	АдресВебСервиса = ПараметрыСервиса.АдресВебСервиса;
	
	Порт				 = 443;
	ИмяПользователя		 = Неопределено;
	Пароль				 = Неопределено;
	Таймаут				 = Неопределено;
	ЗащищенноеСоединение = ЗащищенноеСоединениеOpenSSL();
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(АдресВебСервиса);
	ПараметрыКонструктора.Добавить(Порт);
	ПараметрыКонструктора.Добавить(ИмяПользователя);
	ПараметрыКонструктора.Добавить(Пароль);
	ПараметрыКонструктора.Добавить(Прокси);
	ПараметрыКонструктора.Добавить(Таймаут);
	ПараметрыКонструктора.Добавить(ЗащищенноеСоединение);
	
	Результат = Новый("HTTPСоединение", ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйHTTPЗапрос(Знач АдресРесурса, Знач Заголовки)
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(АдресРесурса);
	ПараметрыКонструктора.Добавить(Заголовки);
	
	Результат = Новый("HTTPЗапрос", ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗащищенноеСоединениеOpenSSL()
	
	Результат = Новый("ЗащищенноеСоединениеOpenSSL");
	
	Возврат Результат;
	
КонецФункции

//}		HTTP


//**********************************************
//{		КРИПТОГРАФИЯ

&НаКлиенте
Функция ИспользоватьВнешнююКриптографию()
	
	// DD1C-424 Используем пока только внешнюю криптографию,
	// из-за отсутствия функциональности ввода пароля от ключевого контейнера в 1С.
	Возврат Истина;
	
	Если ПриложениеСтаршеВерсии("8.3") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВсеСвойстваСертификата(ДобавитьДвоичныеДанные = Ложь, ДобавитьЗакрытыйКлюч = Истина)
	
	Результат = Новый Структура("СерийныйНомер, Издатель, Субъект, ДатаНачала, ДатаОкончания, АлгоритмКлюча");
	
	Если ДобавитьДвоичныеДанные = Истина Тогда
		Результат.Вставить("ДвоичныеДанные");
	КонецЕсли;
	
	Если ДобавитьЗакрытыйКлюч = Истина Тогда
		Результат.Вставить("ЕстьЗакрытыйКлюч");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата)
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ПараметрыПоиска.Свойство("Отпечаток") Тогда
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ПараметрыПоиска.Отпечаток);
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	Если ПараметрыПоиска.Свойство("СерийныйНомер") Тогда
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоСерийномуНомеру(Base64Значение(ПараметрыПоиска.СерийныйНомер));
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	СертификатыКриптографии = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатыКриптографии, ПараметрыПоиска, СвойстваСертификата);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов)
	
	Результат = Новый Массив;
	
	Для Каждого ТекСертификат Из СписокСертификатов Цикл
		
		Если ЭтоВалидныйСертификат(ТекСертификат) Тогда
			
			ОписаниеСертификата = ОписаниеСертификата(ТекСертификат);
			Результат.Добавить(ОписаниеСертификата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеСертификата(Сертификат) Экспорт
	
	Результат = Контракт_ОписаниеСертификата();
	
	СубъектСертификата = Сертификат.Субъект;
	
	Результат.Наименование			= НаименованиеСертификата(СубъектСертификата);
	Результат.ДатаВыдачи			= Сертификат.ДатаНачала;
	Результат.СрокДействия			= Сертификат.ДатаОкончания;
	Результат.ОтпечатокСертификата	= ВРег(Сертификат.Отпечаток);
	Результат.Издатель				= Сертификат.Издатель.CN;
	Результат.ОрганизацияИздателя	= СвойствоСтруктуры(Сертификат.Издатель, "O", "");
	Результат.Организация			= СвойствоСтруктуры(СубъектСертификата, "O", "");
	Результат.ИНН					= ИННСертификата(СубъектСертификата);
	Результат.КПП					= КППСертификата(СубъектСертификата);
	Результат.Тип					= ТипСертификата(СубъектСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Контракт_ОписаниеСертификата() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Наименование");
	Результат.Вставить("ДатаВыдачи");
	Результат.Вставить("СрокДействия");
	Результат.Вставить("ОтпечатокСертификата");
	Результат.Вставить("Издатель");
	Результат.Вставить("ОрганизацияИздателя");
	Результат.Вставить("Организация");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("Тип");
	Результат.Вставить("Ошибка");
	Результат.Вставить("ЭтоКЭП", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НаименованиеСертификата(СубъектСертификата)
	
	Если ТипЗнч(СубъектСертификата) = Тип("Структура") Тогда
		
		Результат = НаименованиеСубъекта(СубъектСертификата);
		
	ИначеЕсли ТипЗнч(СубъектСертификата) = Тип("Массив") Тогда
		
		Для Каждого Субъект Из СубъектСертификата Цикл
			
			Результат = НаименованиеСубъекта(Субъект);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип значения субъекта сертификата: " + Строка(ТипЗнч(СубъектСертификата));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НаименованиеСубъекта(Субъект)
	
	Если Субъект.Свойство("SN") И Субъект.Свойство("G") Тогда
		Результат = Субъект.SN + " " + Субъект.G;
	ИначеЕсли Субъект.Свойство("CN") Тогда
		Результат = Субъект.CN;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИННСертификата(СубъектСертификата)
	
	Если ТипЗнч(СубъектСертификата) = Тип("Структура") Тогда
		
		Результат = ИННСубъекта(СубъектСертификата);
		
	ИначеЕсли ТипЗнч(СубъектСертификата) = Тип("Массив") Тогда
		
		Для Каждого Субъект Из СубъектСертификата Цикл
			
			Результат = ИННСубъекта(Субъект);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип значения субъекта сертификата: " + Строка(ТипЗнч(СубъектСертификата));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИННСубъекта(Субъект)
	
	Если Субъект.Свойство("ИННЮЛ") Тогда
		Результат = Субъект.ИННЮЛ;
	ИначеЕсли Субъект.Свойство("ИНН") Тогда
		Результат = Субъект.ИНН;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Если Лев(Результат, 2) = "00" Тогда 
		Результат = Сред(Результат, 3);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КППСертификата(СубъектСертификата)
	
	Если ТипЗнч(СубъектСертификата) = Тип("Структура") Тогда
		
		Результат = КППСубъекта(СубъектСертификата);
		
	ИначеЕсли ТипЗнч(СубъектСертификата) = Тип("Массив") Тогда
		
		Для Каждого Субъект Из СубъектСертификата Цикл
			
			Результат = КППСубъекта(Субъект);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип значения субъекта сертификата: " + Строка(ТипЗнч(СубъектСертификата));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КППСубъекта(Субъект)
	
	Результат = "";
	
	НеструктурированноеИмя = СвойствоСтруктуры(Субъект, "_1_2_840_113549_1_9_2");
	
	Если ЗначениеЗаполнено(НеструктурированноеИмя) Тогда
		
		ЭлементыЗначения = РазделитьСтрокуЛок(НеструктурированноеИмя, "-");
		
		Если ЭлементыЗначения.Количество() > 1 Тогда
			Результат = ЭлементыЗначения[1];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТипСертификата(СубъектСертификата)
	
	ТипыСертификатовКЭП = Перечисление_ТипыСертификатовКЭП();
	
	ИННЮЛ = ЗначениеСвойстваСубъектаСертификата(СубъектСертификата, "ИННЮЛ");
	ИНН = ЗначениеСвойстваСубъектаСертификата(СубъектСертификата, "ИНН");
	ОГРН = ЗначениеСвойстваСубъектаСертификата(СубъектСертификата, "ОГРН");
	ОГРНИП = ЗначениеСвойстваСубъектаСертификата(СубъектСертификата, "ОГРНИП");
	
	Если Лев(ИНН, 2) = "00" Тогда
		ИНН = Сред(ИНН, 3);
	КонецЕсли;
	
	ПустойИННЮЛ		= "0000000000";
	ПустойИННФЛ		= "000000000000";
	ПустойОГРН		= "0000000000000";
	ПустойОГРНИП	= "000000000000000";
	
	ДлинаИННЮЛ	= СтрДлина(ПустойИННЮЛ);
	ДлинаИННФЛ	= СтрДлина(ПустойИННФЛ);
	ДлинаОГРН	= СтрДлина(ПустойОГРН);
	ДлинаОГРНИП	= СтрДлина(ПустойОГРНИП);
	
	ПрефиксНерезидента = "9909";
	
	Резидент		= Лев(ИННЮЛ, СтрДлина(ПрефиксНерезидента)) <> ПрефиксНерезидента
					И Лев(ИНН,	СтрДлина(ПрефиксНерезидента)) <> ПрефиксНерезидента;
					
	ЗаполненИННЮЛ	= СтрДлина(ИННЮЛ) = ДлинаИННЮЛ
					И ИННЮЛ <> ПустойИННЮЛ;
					
	ЗаполненИНН		= СтрДлина(ИНН) = ДлинаИННФЛ
					И ИНН <> ПустойИННФЛ;
					
	ЗаполненИНН_ЮЛ	= СтрДлина(ИНН) = ДлинаИННЮЛ
					И ИНН <> ПустойИННЮЛ;
					
	ЗаполненОГРНИП	= СтрДлина(ОГРНИП) = ДлинаОГРНИП
					И ОГРНИП <> ПустойОГРНИП;
					
	ЗаполненОГРН	= СтрДлина(ОГРН) = ДлинаОГРН
					И ОГРН <> ПустойОГРН;
					
	ЗаполненОГРН	= (Резидент И ЗаполненОГРН
					ИЛИ НЕ Резидент И НЕ ЗаполненОГРН)
					И НЕ ЗначениеЗаполнено(ОГРНИП);
					
	Если 	ЗаполненИННЮЛ 
			И ЗаполненОГРН Тогда
	
			Результат = ТипыСертификатовКЭП.ЮЛ;
			
	ИначеЕсли НЕ ЗаполненИННЮЛ 
			И ЗаполненИНН_ЮЛ 
			И ЗаполненОГРН Тогда
	
			Результат = ТипыСертификатовКЭП.ЮЛ;
	
	ИначеЕсли НЕ ЗаполненИННЮЛ
			И ЗаполненИНН
		    И ЗаполненОГРНИП
            И НЕ ЗаполненОГРН Тогда
	
		Результат = ТипыСертификатовКЭП.ИП;
		
	ИначеЕсли НЕ ЗаполненИННЮЛ
			И ЗаполненИНН
			И НЕ ЗаполненОГРНИП
			И НЕ ЗаполненОГРН Тогда
	
		Результат = ТипыСертификатовКЭП.ФЛ;
	
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗначениеСвойстваСубъектаСертификата(СубъектСертификата, ИмяСвойства)
	
	Если ТипЗнч(СубъектСертификата) = Тип("Структура") Тогда
		
		Результат = СвойствоСтруктуры(СубъектСертификата, ИмяСвойства);
		
	ИначеЕсли ТипЗнч(СубъектСертификата) = Тип("Массив") Тогда
		
		Для Каждого Субъект Из СубъектСертификата Цикл
			
			Результат = СвойствоСтруктуры(Субъект, ИмяСвойства);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип значения субъекта сертификата: " + Строка(ТипЗнч(СубъектСертификата));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Перечисление_ТипыСертификатовКЭП()
	
	Результат = Ядро().Перечисление_ТипыСертификатовКЭП();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РазобратьОтвет_ПолучитьСписокСертификатов(Ответ, ПараметрыПоиска, СвойстваСертификата)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		
		Если ТипЗнч(Ответ) = Тип("Массив") Тогда
			
			Для Каждого СертификатКриптографии Из Ответ Цикл
				
				Результат.Добавить(Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата));
				
				Если СвойствоСтруктуры(ПараметрыПоиска, "ТолькоПервый") = Истина Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			Результат.Добавить(Новый_ОписаниеСертификата(Ответ, СвойстваСертификата));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата)
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда
		
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);
		
	Иначе
		
		СертификатыКриптографии	 = ХранилищеСертификатовКриптографии.ПолучитьВсе();
		СертификатКриптографии	 = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера)
	
	ТипыМодулей = ТипыМодулейКриптографии(ОтпечатокСертификата);
	
	Для Каждого ТипМодуля Из ТипыМодулей Цикл
		
		МенеджерКриптографии = ИнициализироватьМенеджерКриптографии(ПарольКонтейнера, ТипМодуля);
		
		Попытка
			Результат = ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
			Прервать;
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ТипыМодулей.Найти(ТипМодуля) = ТипыМодулей.ВГраница() Тогда
				ВызватьИсключение;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗапомнитьПодходящийТипМодуляКриптографии(ТипМодуля, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера)
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата(Истина);
	
	Сертификат				 = ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата);
	СертификатКриптографии	 = Новый СертификатКриптографии(Сертификат.ДвоичныеДанные);
	
	Результат = МенеджерКриптографии.Подписать(ДвоичныеДанные, СертификатКриптографии);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов)
	
	СертификатыКриптографии = Новый Массив;
	
	Для Каждого ДвоичныеДанныеСертификата Из МассивСертификатов Цикл 
		СертификатыКриптографии.Добавить(Новый СертификатКриптографии(ДвоичныеДанныеСертификата));
	КонецЦикла;
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	
	Результат = МенеджерКриптографии.Зашифровать(ДвоичныеДанные, СертификатыКриптографии);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера)
	
	ТипыМодулей = ТипыМодулейКриптографии();
	
	Для Каждого ТипМодуля Из ТипыМодулей Цикл
		
		МенеджерКриптографии = ИнициализироватьМенеджерКриптографии(ПарольКонтейнера, ТипМодуля);
		
		Попытка
			Результат = МенеджерКриптографии.Расшифровать(ЗашифрованныеДвоичныеДанные);
			Прервать;
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ТипыМодулей.Найти(ТипМодуля) = ТипыМодулей.ВГраница() Тогда
				ВызватьИсключение;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗапомнитьПодходящийТипМодуляКриптографии(ТипМодуля);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьПодпись_Native(ДвоичныеДанные, ДвоичныеДанныеПодписи)
	
	СертификатКриптографии = Неопределено;
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	МенеджерКриптографии.ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи, СертификатКриптографии);
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, ВсеСвойстваСертификата(Истина));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатИзПодписи_Native(ДвоичныеДанныеПодписи)
	
	МенеджерКриптографии	 = ИнициализироватьМенеджерКриптографии();
	СертификатыКриптографии	 = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(ДвоичныеДанныеПодписи);
	
	СертификатКриптографии = Неопределено;
	
	Если ЗначениеЗаполнено(СертификатыКриптографии) Тогда
		СертификатКриптографии = СертификатыКриптографии[0];
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, ВсеСвойстваСертификата(Истина));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоВалидныйСертификат(ДанныеСертификата)
	
	ВалидныйСубъектСертификата = ДанныеСертификата.Свойство("Субъект")
		И ТипЗнч(ДанныеСертификата.Субъект) = Тип("Структура")
		И ДанныеСертификата.Субъект.Свойство("CN")
		И (ДанныеСертификата.Субъект.Свойство("ИНН") ИЛИ ДанныеСертификата.Субъект.Свойство("ИННЮЛ"));
	
	ВалидныеСубъектыСертификата = ДанныеСертификата.Свойство("Субъект")
		И ТипЗнч(ДанныеСертификата.Субъект) = Тип("Массив")
		И ЕстьСвойствоСубъектаСертификата(ДанныеСертификата.Субъект, "CN")
		И (ЕстьСвойствоСубъектаСертификата(ДанныеСертификата.Субъект, "ИНН")
			ИЛИ ЕстьСвойствоСубъектаСертификата(ДанныеСертификата.Субъект, "ИННЮЛ"));
	
	ВалидныйИздательСертификата = ДанныеСертификата.Свойство("Издатель")
		И ТипЗнч(ДанныеСертификата.Издатель) = Тип("Структура")
		И ДанныеСертификата.Издатель.Свойство("CN");
	
	ВалидныйПериодДействия = ДанныеСертификата.ДатаОкончания >= НачалоДня(ТекущаяДата());
	
	Результат = ТипЗнч(ДанныеСертификата) = Тип("Структура")
		И (ВалидныйСубъектСертификата ИЛИ ВалидныеСубъектыСертификата)
		И ВалидныйИздательСертификата
		И ВалидныйПериодДействия;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЕстьСвойствоСубъектаСертификата(СубъектыСертификата, ИмяСвойства)
	
	Результат = Ложь;
	
	Для Каждого Субъект Из СубъектыСертификата Цикл
		
		Если Субъект.Свойство(ИмяСвойства) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИнициализироватьМенеджерКриптографии(ПарольКонтейнера = Неопределено, ТипМодуляКриптографии = Неопределено)
	
	Если ТипМодуляКриптографии = Неопределено Тогда
		
		ТипМодуляКриптографии = ПодходящийТипМодуляКриптографии();
		
		Если Не ЗначениеЗаполнено(ТипМодуляКриптографии) Тогда
			ТипМодуляКриптографии = ТипыМодулейКриптографии().Получить(0);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить(ТипМодуляКриптографии);
	
	МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
	
	УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольКонтейнера);
	
	Возврат МенеджерКриптографии;
	
КонецФункции

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографии(Знач ОписаниеОповещения)
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить(75);
	
	МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
	
	МенеджерКриптографии.НачатьИнициализацию(ОписаниеОповещения, "", "", 75);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольКонтейнера)
	
	Если ЗначениеЗаполнено(ПарольКонтейнера) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольКонтейнера;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьПодходящийТипМодуляКриптографии(ТипМодуляКриптографии, ОтпечатокСертификата = "")
	
	ПодходящиеТипы = Кэш_Прочитать("ПодходящиеТипыМодулейКриптографии");
	
	Если ПодходящиеТипы = Неопределено Тогда
		ПодходящиеТипы = Новый Соответствие;
		Кэш_Поместить("ПодходящиеТипыМодулейКриптографии", ПодходящиеТипы);
	КонецЕсли;
	
	ПодходящиеТипы.Вставить(ОтпечатокСертификата, ТипМодуляКриптографии);
	
КонецПроцедуры

&НаКлиенте
Функция ПодходящийТипМодуляКриптографии(ОтпечатокСертификата = "")
	
	Результат = Неопределено;
	
	ПодходящиеТипы = Кэш_Прочитать("ПодходящиеТипыМодулейКриптографии");
	
	Если ЗначениеЗаполнено(ПодходящиеТипы) Тогда
		Результат = ПодходящиеТипы[ОтпечатокСертификата];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ТипыМодулейКриптографии(ОтпечатокСертификата = "")
	
	Результат = Новый Массив;
	Результат.Добавить(80);
	Результат.Добавить(75);
	
	ПодходящийТипМодуля = ПодходящийТипМодуляКриптографии(ОтпечатокСертификата);
	
	Если ЗначениеЗаполнено(ПодходящийТипМодуля) Тогда
		
		ИндексПодходящего = Результат.Найти(ПодходящийТипМодуля);
		
		Если ИндексПодходящего > 0 Тогда
			
			// Переместим подходящий модуль в начало массива
			Результат.Удалить(ИндексПодходящего);
			Результат.Вставить(0, ПодходящийТипМодуля);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьХранилищеСертификатов(ПараметрыПоиска)
	
	МенеджерКриптографии	 = ИнициализироватьМенеджерКриптографии();
	
	ТипХранилища			 = СвойствоСтруктуры(ПараметрыПоиска, "ТипХранилища");
	РасположениеХранилища	 = СвойствоСтруктуры(ПараметрыПоиска, "РасположениеХранилища");
	
	Возврат МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища);
	
КонецФункции

&НаКлиенте
Функция Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отпечаток", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.Отпечаток));
	
	Если СвойстваСертификата.Свойство("СерийныйНомер") Тогда
		Результат.Вставить("СерийныйНомер", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.СерийныйНомер));
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("Издатель") Тогда
		Результат.Вставить("Издатель", Новый Структура(СертификатКриптографии.Издатель));
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("Субъект") Тогда
		
		Результат.Вставить("Субъект", Новый Структура(СертификатКриптографии.Субъект));
		
		Если СертификатКриптографии.Субъект.Свойство("OGRN") Тогда
			Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OGRN);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_1") Тогда
			Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OID1_2_643_100_1);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("SNILS") Тогда
			Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.SNILS);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_3") Тогда
			Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.OID1_2_643_100_3);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("INN") Тогда
			Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.INN);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_3_131_1_1") Тогда
			Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.OID1_2_643_3_131_1_1);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДвоичныеДанные") Тогда
		Результат.Вставить("ДвоичныеДанные", СертификатКриптографии.Выгрузить());
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДатаНачала") Тогда
		Результат.Вставить("ДатаНачала", СертификатКриптографии.ДатаНачала);
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДатаОкончания") Тогда
		Результат.Вставить("ДатаОкончания", СертификатКриптографии.ДатаОкончания);
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("РасширенныеСвойства") Тогда
		Результат.Вставить("РасширенныеСвойства", Новый Структура(СертификатКриптографии.РасширенныеСвойства));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыПоискаСертификатов()
	
	Результат = Новый Структура;
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		
		Результат.Вставить("ТипХранилища",			"ПерсональныеСертификаты");
		Результат.Вставить("РасположениеХранилища",	"ДанныеПользователяОС");
		
	Иначе
		
		Результат.Вставить("ТипХранилища",			ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
		Результат.Вставить("РасположениеХранилища",	РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, Результат)
	
	Если ЭтоСтруктура(ОписаниеОповещения) Тогда
		
		Если ЗначениеЗаполнено(ОписаниеОповещения.ДополнительныеПараметры) Тогда 
			Выполнить("ОписаниеОповещения.Модуль.ОписаниеОповещения.ИмяПроцедуры(Результат, ОписаниеОповещения.ДополнительныеПараметры)");
		КонецЕсли;
		
	Иначе
		Выполнить("ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеОписанияСертификата(Знач ОписаниеОповещения, СертификатКриптографии, СвойстваСертификата)
	
	ДобавитьДвоичныеДанные = Ложь;
	
	Если СвойстваСертификата.Свойство("ДвоичныеДанные") Тогда
		СвойстваСертификата.Удалить("ДвоичныеДанные");
		ДобавитьДвоичныеДанные = Истина;
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата);
	
	Если ДобавитьДвоичныеДанные Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОповещениеЗавершения",	 ОписаниеОповещения);
		ДополнительныеПараметры.Вставить("Результат",				 Результат);
		
		Оповещение = НовыйОписаниеОповещения("ПолучениеОписанияСертификата_Native_Завершение", ЭтаФорма, ДополнительныеПараметры);
		
		СертификатКриптографии.НачатьВыгрузку(Оповещение);
		
	Иначе
		ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСертификатВМассивеПоОтпечатку(МассивСертификатов, ОтпечатокСертификата)
	
	Результат = Неопределено;
	
	Для Каждого Сертификат Из МассивСертификатов Цикл
		
		ТекущийОтпечаток = HexСтрокаИзДвоичныхДанных(Сертификат.Отпечаток);
		
		Если ТекущийОтпечаток = ОтпечатокСертификата Тогда
			
			Результат = Сертификат;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//}		КРИПТОГРАФИЯ


//**********************************************
//{		КЭШИРОВАНИЕ

&НаКлиенте
Функция Кэш_Прочитать(ИмяЗначения)
	
	Ядро = Ядро();
	
	Если Ядро <> Неопределено Тогда
		Результат = Ядро.Кэш_Прочитать(ИмяЗначения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Кэш_Поместить(ИмяЗначения, Значение)
	
	Ядро = Ядро();
	
	Если Ядро <> Неопределено Тогда
		Ядро.Кэш_Поместить(ИмяЗначения, Значение);
	КонецЕсли;
	
КонецПроцедуры

//}		КЭШИРОВАНИЕ


//**********************************************
//{		ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Функция Ядро()
	
	Возврат ВладелецФормы;
	
КонецФункции

&НаКлиенте
Функция Модуль_Плагин()
	
	Результат = Ядро().Модуль_Плагин(ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

// Сравнивает текущую версию приложения с указанной версией.
// 
// Параметры:
//  Версия - Строка - номер версии, с которой нужно сравнить текущую версию приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая версия приложения старше чем версия параметра.
//            Например, 8.2 старше чем 8.3.
//
&НаКлиенте
Функция ПриложениеСтаршеВерсии(Версия)
	
	Результаты = Кэш_Прочитать("РезультатыФункции_ПриложениеСтаршеВерсии");
	
	Если Результаты = Неопределено Тогда
		Результаты = Новый Соответствие;
	КонецЕсли;
	
	Результат = Результаты[Версия];
	
	Если Результат = Неопределено Тогда
		
		СисИнфо = Новый СистемнаяИнформация;
		
		Результат = (СравнитьВерсии(СисИнфо.ВерсияПриложения, Версия) < 0);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сравнивает текущую версию режима совместимости с указанной версией.
// 
// Параметры:
//  Версия - Строка - номер версии, с которой нужно сравнить текущую версию режима совместимости.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая версия режима совместимости ниже чем версия параметра.
//            Например, 8.3.10 ниже чем 8.3.15.
//
&НаКлиенте
Функция РежимСовместимостиКонфигурацииНижеВерсии(Версия)
	
	Результат = РежимСовместимостиКонфигурацииНижеВерсииВызовСервера(Версия);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция РежимСовместимостиКонфигурацииНижеВерсииВызовСервера(Знач Версия)
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	Результат = МодульОбработки.РежимСовместимостиКонфигурацииНижеВерсии(Версия);
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Версии типа "1.0.1b" сравнивать нельзя.
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
&НаКлиентеНаСервереБезКонтекста
Функция СравнитьВерсии(Знач ПерваяВерсия, Знач ВтораяВерсия, Разделитель = ".")
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(ПерваяВерсия) ИЛИ НЕ ПустаяСтрока(ВтораяВерсия) Цикл
		
		Поз = Найти(ПерваяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(ПерваяВерсия, Поз - 1));
			ПерваяВерсия = Сред(ПерваяВерсия, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(ПерваяВерсия), 0, Число(ПерваяВерсия));
			ПерваяВерсия = "";
		КонецЕсли;
		
		Поз = Найти(ВтораяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(ВтораяВерсия, Поз - 1));
			ВтораяВерсия = Сред(ВтораяВерсия, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(ВтораяВерсия), 0, Число(ВтораяВерсия));
			ВтораяВерсия = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаКлиенте
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если Значение = Неопределено Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		
		Результат = Истина;
		
	ИначеЕсли ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
// 
// Возвращаемое значение:
//  Массив - массив со строками, которые получились в результате разделения исходной строки.
//
&НаКлиенте
Функция РазделитьСтрокуЛок(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// 
// Параметры:
//  Строки - Произвольный - значение тип которого нужно определить.
//  Разделитель - ФиксированныйМассив; Массив - значение тип которого нужно определить.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
&НаКлиенте
Функция СоединитьСтроку(Строки, Разделитель = "") Экспорт
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон строки с параметрами;
//  Параметр<n>  - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//   Строка - строка с подставленными параметрами.
//
&НаКлиенте
Функция Общее_ПодставитьПараметрыВСтроку(ШаблонСтроки,
								   Параметр1,
								   Параметр2 = Неопределено,
								   Параметр3 = Неопределено,
								   Параметр4 = Неопределено,
								   Параметр5 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Преобразует двоичные данные в строку формата Base 16 (Hex).
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - двоичные данные, из которых нужно получить строку.
//
// Возвращаемое значение:
//   Строка - Hex строка.
//
&НаКлиенте
Функция HexСтрокаИзДвоичныхДанных(ДвоичныеДанные)
	
	Если ПриложениеСтаршеВерсии("8.3.10") Тогда
		
		Результат = СтрЗаменить(Строка(ДвоичныеДанные), " ", "");
		
	Иначе
		
		Результат = Вычислить("ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанные)");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйОписаниеОповещения(ИмяПроцедуры = Неопределено, Модуль = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Если ПриложениеСтаршеВерсии("8.3") Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ИмяПроцедуры",				ИмяПроцедуры);
		Результат.Вставить("Модуль",					Модуль);
		Результат.Вставить("ДополнительныеПараметры",	ДополнительныеПараметры);
		
	Иначе
		
		ПараметрыКонструктора = Новый Массив;
		ПараметрыКонструктора.Добавить(ИмяПроцедуры);
		ПараметрыКонструктора.Добавить(Модуль);
		ПараметрыКонструктора.Добавить(ДополнительныеПараметры);
		
		Результат = Новый("ОписаниеОповещения", ПараметрыКонструктора);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Строковое представление объекта ИнтернетПрокси.
//
// Параметры:
//  Прокси 		- ИнтернетПрокси	- объект ИнтернетПрокси.
//  Протокол 	- Строка			- имя протокола (напр. "http" или "https").
//
// Возвращаемое значение:
//   Строка - строковое представление ИнтернетПрокси.
//
&НаКлиенте
Функция ПредставлениеИнтернетПрокси(Прокси, Протокол = Неопределено)
	
	Журнал = Новый Массив;
	
	Если ЗначениеЗаполнено(Протокол) Тогда
		
		СтрокаЖурнала = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, Протокол);
		Журнал.Добавить(СтрокаЖурнала);
		
	Иначе
		
		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси);
		Журнал.Добавить(ПредставлениеАдреса);
		
		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, "http");
		Журнал.Добавить(ПредставлениеАдреса);

		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, "https");
		Журнал.Добавить(ПредставлениеАдреса);

		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, "ftp");
		Журнал.Добавить(ПредставлениеАдреса);
		
	КонецЕсли;
	
	НастройкиАвторизации = НастройкиАвторизацииИнтернетПрокси(Прокси, "");
	
	Если НастройкиАвторизации.ИспользоватьАутентификациюОС Тогда 
		
		СтрокаЖурнала = НСтр("ru = 'Используется аутентификация операционной системы'");
		
	Иначе 
		
		Пользователь = НастройкиАвторизации.Пользователь;
		Пароль 		 = НастройкиАвторизации.Пароль;
		
		Если ПустаяСтрока(Пароль) Тогда
			СостояниеПароля = НСтр("ru = '<не указан>'");
		Иначе
			СостояниеПароля = НСтр("ru = '********'");
		КонецЕсли;
		
		СтрокаЖурнала = НСтр("ru = 'Используется аутентификация по имени пользователя и паролю'");
		Журнал.Добавить(СтрокаЖурнала);
		
		ШаблонСтрокиЖурнала = НСтр("ru = 'Пользователь: %1
			           					 |Пароль: %2'");
										 
		СтрокаЖурнала = Общее_ПодставитьПараметрыВСтроку(
			ШаблонСтрокиЖурнала,
			Пользователь,
			СостояниеПароля);
			
	КонецЕсли;
	
	Журнал.Добавить(СтрокаЖурнала);
	
	Если Прокси.НеИспользоватьПроксиДляЛокальныхАдресов Тогда 
		
		Журнал.Добавить(НСтр("ru = 'Не использовать прокси для локальных адресов'"));
		
	КонецЕсли;
	
	Если Прокси.НеИспользоватьПроксиДляАдресов.Количество() > 0 Тогда 
		
		Журнал.Добавить(НСтр("ru = 'Не использовать для следующих адресов:'"));
		
		Для Каждого ИсключаемыйАдрес Из Прокси.НеИспользоватьПроксиДляАдресов Цикл
			Журнал.Добавить(ИсключаемыйАдрес);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СоединитьСтроку(Журнал, Символы.ПС);
	
КонецФункции

// см. метод модуля "ПредставлениеАдресаПрокси"
//
&НаКлиенте
Функция ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, Протокол = Неопределено)
	
	Если ЗначениеЗаполнено(Протокол) Тогда
		
		Сервер 	= Прокси.Сервер(Протокол);
		Порт 	= Прокси.Порт(Протокол);
		
		Если ЗначениеЗаполнено(Сервер)
			И Не ЗначениеЗаполнено(Порт) Тогда
		
			Порт = ПортПоУмолчанию(Протокол);
			
		Иначе
			
			Сервер 	= Прокси.Сервер();
			Порт 	= Прокси.Порт();
			
		КонецЕсли;
		
	Иначе
		
		Сервер 	= Прокси.Сервер();
		Порт 	= Прокси.Порт();
		
	КонецЕсли;
		
	ПортСтрокой = Формат(Порт, "ЧГ=");
	
	Если Протокол = Неопределено Тогда
		ПредставлениеПротокола = "Адрес";
	Иначе
		ПредставлениеПротокола = ВРег(Протокол);
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru = '%1: %2:%3'");
	
	Результат = Общее_ПодставитьПараметрыВСтроку(
		ШаблонСтроки,
		ПредставлениеПротокола,
		Сервер,
		ПортСтрокой);
		
	Возврат Результат;
	
КонецФункции

// Возвращает настройки авторизации объекта ИнтернетПрокси.
// Функция является "оберткой" для старых платформ.
//
// Параметры:
//  Прокси 		- ИнтернетПрокси	- объект ИнтернетПрокси.
//  Протокол 	- Строка			- имя протокола (напр. "http" или "https").
//
// Возвращаемое значение:
//   Структура - настройки авторизации ИнтернетПрокси.
//
&НаКлиенте
Функция НастройкиАвторизацииИнтернетПрокси(Прокси, Протокол = Неопределено)
	
	Результат = Новый Структура;
	
	Если ПриложениеСтаршеВерсии("8.3.7") Тогда
		ИспользоватьАутентификациюОС = Истина;
	Иначе
		ИспользоватьАутентификациюОС = Вычислить("Прокси.ИспользоватьАутентификациюОС(Протокол)");
	КонецЕсли;
		
	Результат.Вставить("ИспользоватьАутентификациюОС", ИспользоватьАутентификациюОС);
	
	Если ПриложениеСтаршеВерсии("8.3.6") Тогда
		Пользователь 	= "";
		Пароль 			= "";
	Иначе
		Пользователь 	= Вычислить("Прокси.Пользователь(Протокол)");
		Пароль 			= Вычислить("Прокси.Пароль(Протокол)");
	КонецЕсли;
	
	Результат.Вставить("Пользователь", Пользователь);
	Результат.Вставить("Пароль", Пароль);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоWindowsСервер()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
КонецФункции

&НаКлиенте
Функция ЭтоLinuxСервер()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

&НаКлиенте
Функция ПортПоУмолчанию(Протокол)
	
	ПортыПоУмолчанию = Новый Соответствие;
	ПортыПоУмолчанию.Вставить("http", 80);
	ПортыПоУмолчанию.Вставить("https", 443);
	ПортыПоУмолчанию.Вставить("ftp", 21);
	ПортыПоУмолчанию.Вставить("ftps", 990);
	
	Возврат ПортыПоУмолчанию[НРег(Протокол)];
	
КонецФункции

//}		ОБЩЕГО НАЗНАЧЕНИЯ
