#Область ОписаниеПеременных

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшНаКлиенте;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Открывает основную форму библиотеки плагинов.
//
// Параметры:
//  КонтекстИлиВызвающийМодуль - Структура, ФормаКлиентскогоПриложения - см. НовыйКонтекстВызывающегоМодуля
//  ПараметрВладелец - ФормаКлиентскогоПриложения - форма или элемент управления другой формы.
//
&НаКлиенте
Процедура ОткрытьОсновнуюФорму(КонтекстИлиВызвающийМодуль, ПараметрВладелец) Экспорт
	
	Если ТипЗнч(КонтекстИлиВызвающийМодуль) = Тип("Структура") Тогда
		Контекст = КонтекстИлиВызвающийМодуль;
	Иначе
		Контекст = НовыйКонтекстВызывающегоМодуля(КонтекстИлиВызвающийМодуль);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ИмяОсновнойФормы = "Форма";
	
	ПараметрКлючУникальности = Неопределено;
	ПараметрЗакрыватьПриЗакрытииВладельца = Истина;
	
	ФормаОбработки = ПолучитьФормуОбработки(
		ИмяОсновнойФормы,
		ПараметрВладелец,
		ПараметрыФормы,
		ПараметрКлючУникальности,
		ПараметрЗакрыватьПриЗакрытииВладельца
	);
	
	ФормаОбработки.Инициализировать(Контекст, ЭтаФорма);
	ФормаОбработки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, КонтекстИлиВызвающийМодуль) Экспорт
	
	Если ТипЗнч(КонтекстИлиВызвающийМодуль) = Тип("Структура") Тогда
		Контекст = КонтекстИлиВызвающийМодуль;
	Иначе
		Контекст = НовыйКонтекстВызывающегоМодуля(КонтекстИлиВызвающийМодуль);
	КонецЕсли;
	
	МассивПлагинов = СписокПлагинов();
	
	Если МассивПлагинов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Плагин ИЗ МассивПлагинов Цикл
		
		Если Не ЭтоАктивныйПлагин(Плагин) Тогда
			Продолжить;
		КонецЕсли;
		
		Плагин_ОбработатьСобытие(Плагин, ИмяСобытия, ПараметрыСобытия);
		
	КонецЦикла;

КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Открывает список опубликованных плагинов.
//
// Параметры:
//  ПараметрВладелец - ФормаКлиентскогоПриложения - форма или элемент управления другой формы.
//
&НаКлиенте
Процедура ОткрытьБиблиотекуПлагинов(ПараметрВладелец) Экспорт
	
	ИмяФормыБиблиотеки = "Форма_БиблиотекаПлагинов";
	
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФормуОбработкиМодально(
		ИмяФормыБиблиотеки,
		ПараметрыФормы,
		ПараметрВладелец
	);
	
КонецПроцедуры

// Открывает настройки выбранного плагина.
//
// Параметры:
//  ИдентификаторПлагина - Строка - идентификатор плагина.
//  ПараметрВладелец - ФормаКлиентскогоПриложения - форма или элемент управления другой формы.
//
&НаКлиенте
Процедура ОткрытьНастройкиПлагина(ИдентификаторПлагина, ПараметрВладелец) Экспорт
	
	ИмяФормыПлагина = "ВнешняяОбработка." + ИдентификаторПлагина + ".Форма.КлиентскиеВызовы";
	
	ПараметрыФормы = Новый Структура;
	
	ПлагинКлиент = ПолучитьФорму(
		ИмяФормыПлагина,
		ПараметрыФормы,
		ПараметрВладелец
	);
	
	ПлагинКлиент.ОткрытьНастройки();
	
КонецПроцедуры

// Загружает плагин в хранилище плагинов. Если файл не указан, то он будет загружен из сервиса.
//
// Параметры:
//  Идентификатор - Строка - идентификатор плагина.
//  Представление - Строка - (Необязательный) представление плагина.
//  Версия - Строка - (Необязательный) версия плагина.
//  ДвоичныеДанные - ДвоичныеДанные - (Необязательный) файл плагина. Если не указан, плагин будет загружен из сервиса.
// 
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево - Ложь, если есть ошибки
//    * ОписаниеОшибки - Строка - текст ошибки.
//
&НаКлиенте
Функция ЗагрузитьПлагин(Идентификатор, Знач Представление = "", Знач Версия = "", Знач ДвоичныеДанные = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = Идентификатор;
	КонецЕсли;
	
	ПараметрыСобытия = Новый Структура();
	ПараметрыСобытия.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	ПараметрыСобытия.Вставить("Идентификатор", Идентификатор);
	ПараметрыСобытия.Вставить("Представление", Представление);
	ПараметрыСобытия.Вставить("Версия", Версия);
	
	ОсновнойМодуль_ОбработатьСлужебнуюКоманду(
		КомандаЗагрузитьПлагин(),
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИмяОбработки() Экспорт
	
	КлючКэш = "ИмяОбработки";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ИмяОбработкиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормыОбработки, ПараметрыФормы = Неопределено, Владелец = Неопределено
	, Обработчик = Неопределено, МодульОбработчика = Неопределено, ПараметрыОбработчика = Неопределено
	, БлокироватьВладельца = Ложь) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если Владелец <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	КонецЕсли;
	
	ПутьКФорме = ИмяОбработки() + ".Форма." + ИмяФормыОбработки;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		Если ЗначениеЗаполнено(Обработчик) Тогда
			ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		Иначе
			ОповещениеОЗакрытии = Неопределено;
		КонецЕсли;
		
		Если БлокироватьВладельца Тогда
			РежимОткрытияНовогоОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Иначе
			РежимОткрытияНовогоОкна = Неопределено;
		КонецЕсли;
		
		Выполнить("ОткрытьФорму(ПутьКФорме, ПараметрыФормы, Владелец,
		|, , , ОповещениеОЗакрытии, РежимОткрытияНовогоОкна)");
		
	Иначе
		
		Если ЗначениеЗаполнено(Обработчик) Тогда
			
			Результат = ОткрытьФормуМодально(ПутьКФорме, ПараметрыФормы, Владелец);
			
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Результат, ПараметрыОбработчика);
			
		Иначе
			
			ОткрытьФорму(ПутьКФорме, ПараметрыФормы, Владелец, , Окно);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбработкиМодально(ИмяФормыОбработки, ПараметрыФормы = Неопределено, Владелец
	, Обработчик = Неопределено, МодульОбработчика = Неопределено, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если Владелец <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	КонецЕсли;
	
	ПутьКФорме = ИмяОбработки() + ".Форма." + ИмяФормыОбработки;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		Если ЗначениеЗаполнено(Обработчик) Тогда
			ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		Иначе
			ОповещениеОЗакрытии = Неопределено;
		КонецЕсли;
		
		Выполнить("ОткрытьФорму(ПутьКФорме, ПараметрыФормы, Владелец,
		|, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
		
	Иначе
		
		Результат = ОткрытьФормуМодально(ПутьКФорме, ПараметрыФормы, Владелец);
		
		Если ЗначениеЗаполнено(Обработчик) Тогда
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Результат, ПараметрыОбработчика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбъектаИС(СсылкаНаОбъект) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		Выполнить("ПоказатьЗначение( , СсылкаНаОбъект)");
	Иначе
		ОткрытьЗначение(СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораОбъектаИС(ОписаниеОбъектаДляВыбора, Владелец
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = ОписаниеОбъектаДляВыбора.ПолноеИмяОбъекта;
	ИмяФормыВыбора	 = ОписаниеОбъектаДляВыбора.ИмяФормыВыбора;
	ПараметрыФормы	 = ОписаниеОбъектаДляВыбора.ПараметрыФормы;
	
	Если ЗначениеЗаполнено(ИмяФормыВыбора) Тогда
		ПутьКФормеВыбора = ПолноеИмяОбъекта + ".Форма." + ИмяФормыВыбора;
	Иначе
		ПутьКФормеВыбора = ПолноеИмяОбъекта + ".ФормаВыбора";
	КонецЕсли;
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	Если ДоступныАсинхронныеФормы() И ЭтоУправляемаяФормаВыбора(ПутьКФормеВыбора) Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Выполнить("ОткрытьФорму(ПутьКФормеВыбора, ПараметрыФормы, Владелец,
		|, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
		
	Иначе
		
		Результат = ОткрытьФормуМодально(ПутьКФормеВыбора, ПараметрыФормы, Владелец);
		
		ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Результат, ПараметрыОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПолноеИмяОбработки = ОбработкаОбъект.Метаданные().ПолноеИмя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта = Неопределено Тогда
		КэшМодуляОбъекта = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция ОсновнойМодуль()
	Возврат ВладелецФормы;
КонецФункции


// Кэш

// Возвращает значение из кэша на время вызова сервера
//
// Параметры:
//  Ключ - Строка - см. процедуру Кэш_Поместить
//
// Возвращаемое значение: 
//  Произвольный - см. процедуру Кэш_Поместить
//
&НаКлиенте
Функция Кэш_Прочитать(Ключ)
	
	Если ЗначениеЗаполнено(КэшНаКлиенте) Тогда
		Результат = КэшНаКлиенте.Получить(Ключ);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Помещает значение в кэш на время вызова сервера
//
// Параметры:
//  Ключ     - Строка       - уникальный ключ помещаемого значения;
//  Значение - Произвольный - помещаемое значение;
//
&НаКлиенте
Процедура Кэш_Поместить(Ключ, Значение)
	
	Если КэшНаКлиенте = Неопределено Тогда
		КэшНаКлиенте = Новый Соответствие;
	КонецЕсли;
	
	КэшНаКлиенте.Вставить(Ключ, Значение);
	
КонецПроцедуры

// Открытие форм

&НаСервере
Функция ИмяОбработкиНаСервере()
	
	Возврат МодульОбъекта().Метаданные().ПолноеИмя();
	
КонецФункции

&НаКлиенте
Функция ПолучитьФормуОбработки(ПараметрИмяФормы,
								парамВладелецФормы = Неопределено,
								ПараметрыФормы = Неопределено,
								КлючУникальности = Неопределено,
								ЗакрыватьПриЗакрытииВладельца = Ложь)
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПараметрыФормы.Свойство("Объект") Тогда
		ПараметрыФормы.Вставить("Объект",	Объект);
	КонецЕсли;
	
	Если парамВладелецФормы = Неопределено Тогда
		парамВладелецФормы = ЭтаФорма;
	КонецЕсли;
	
	Если ЗакрыватьПриЗакрытииВладельца Тогда
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ЗакрыватьПриЗакрытииВладельца);
	КонецЕсли;
	
	ПолноеИмяФормы = ПолноеИмяОбработки + ".Форма." + ПараметрИмяФормы;
	
	Результат = ПолучитьФорму(
		ПолноеИмяФормы,
		ПараметрыФормы,
		парамВладелецФормы,
		КлючУникальности
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НовыйКонтекстВызывающегоМодуля(ВызывающийМодуль)
	
	Результат = Новый Структура;
	Результат.Вставить("ВызывающийМодуль", ВызывающийМодуль);
	Результат.Вставить("РежимОтладки", Ложь);
	Результат.Вставить("КаталогОтладки", "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПлагинСодержитСобытие(Плагин, ИмяСобытия)
	
	Результат = (Плагин.События.Найти(ИмяСобытия) <> Неопределено);
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоАктивныйПлагин(Плагин)
	
	СостоянияПлагинов = Перечисление_СостоянияПлагинов();
	
	Результат = (Плагин.Состояние = СостоянияПлагинов.Включен);
	
	Возврат Результат;
	
КонецФункции

//Обработчики клиентских процедур

&НаКлиенте
Процедура ОсновнойМодуль_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды)
	
	ОсновнойМодуль().КонтурПлагины_ОбработатьСлужебнуюКоманду(
		ИмяКоманды,
		ПараметрыКоманды
	);
	
КонецПроцедуры

&НаКлиенте
Функция СписокПлагинов()
	
	Результат = Неопределено;
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат");
	
	ОсновнойМодуль_ОбработатьСлужебнуюКоманду(
		КомандаПолучитьСписокПлагинов(),
		ПараметрыСобытия
	);
	
	Результат = ПараметрыСобытия.Результат;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Перечисление_СостоянияПлагинов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Включен",				СостояниеВключен());
	Результат.Вставить("Отключен",				"Отключен");
	Результат.Вставить("НеИспользуется",		"Не используется");
	Результат.Вставить("ЕстьОшибки",			"Есть ошибки");
	Результат.Вставить("ТребуетсяНастройка",	"Требуется настройка");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостояниеВключен()
	Возврат "Включен";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КомандаПолучитьНастройки()
	Возврат "Плагин_ПолучитьНастройки";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КомандаЗагрузитьПлагин()
	Возврат "Плагин_Загрузить";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КомандаПолучитьСписокПлагинов()
	Возврат "Плагины_ПолучитьСписок";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КомандаЗафиксироватьОшибкуПлагина()
	Возврат "Плагин_ЗафиксироватьОшибку";
КонецФункции

&НаКлиенте
Процедура Плагин_ОбработатьСобытие(Плагин, ИмяСобытия, ПараметрыСобытия)
	
	Если Не ПлагинСодержитСобытие(Плагин, ИмяСобытия) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПлагина = Неопределено;
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Результат");
	ПараметрыКоманды.Вставить("Идентификатор", Плагин.Идентификатор);
	
	ОсновнойМодуль_ОбработатьСлужебнуюКоманду(
		КомандаПолучитьНастройки(),
		ПараметрыКоманды
	);
	
	РезультатНастроек = ПараметрыКоманды.Результат;
	
	Если РезультатНастроек.Успешно Тогда
		НастройкиПлагина = РезультатНастроек.Данные;	
	КонецЕсли;
	
	МодульПлагина = Плагин_СоздатьОбъект(Плагин.Идентификатор);
	
	Попытка
		
		МодульПлагина.ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, НастройкиПлагина);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		ЗафиксироватьОшибкуПлагина(Плагин, ИмяСобытия, ТекстОшибки)
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Функция Плагин_СоздатьОбъект(Идентификатор = Неопределено)
	
	Результат = Неопределено; 
	
	Попытка
		
		Результат = ПолучитьФорму("ВнешняяОбработка." + Идентификатор + ".Форма.КлиентскиеВызовы",, ВладелецФормы);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		Сообщить(ТекстОшибки);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции 

// Добавляет ошибку плагина в массив ошибок и запись в журнал регистрации
//
// Параметры:
//  ОписаниеПлагина - Структура - см. Новый_ОписаниеПлагина();
//  ИмяСобытия - Строка - имя события;
//  ТекстОшибки - Строка - текст ошибки;
//
&НаКлиенте
Процедура ЗафиксироватьОшибкуПлагина(Плагин, ИмяСобытия, ТекстОшибки) 
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Плагин", Плагин);
	ПараметрыКоманды.Вставить("ИмяСобытия", ИмяСобытия);
	ПараметрыКоманды.Вставить("ТекстОшибки", ТекстОшибки);
	
	ОсновнойМодуль_ОбработатьСлужебнуюКоманду(
		КомандаЗафиксироватьОшибкуПлагина(),
		ПараметрыКоманды
	);
	
КонецПроцедуры

// Диалоги

&НаКлиенте
Процедура ВывестиПредупреждение(ТекстПредупреждения, Таймаут = 0, Заголовок = ""
	, МодульОбработчика = Неопределено, Обработчик = Неопределено, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок = НаименованиеМодуля();
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = Неопределено;
		
		Если ЗначениеЗаполнено(Обработчик) Тогда
			ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		КонецЕсли;
		
		Выполнить("ПоказатьПредупреждение(ОповещениеОЗакрытии, ТекстПредупреждения, Таймаут, Заголовок)");
		
	Иначе
		
		Предупреждение(ТекстПредупреждения, Таймаут, Заголовок);
		
		Если ЗначениеЗаполнено(Обработчик) Тогда
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждениеСКнопкойПодробно(ТекстПредупреждения, ТекстПодробно, Форма, Заголовок = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок = НаименованиеМодуля();
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ОК");
	Кнопки.Добавить("Подробно...");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Форма", Форма);
	ДопПараметры.Вставить("ТекстПодробно", ТекстПодробно);
	
	ПоказатьДиалогВопроса(ТекстПредупреждения, Кнопки
	, "ВывестиПредупреждениеСКнопкойПодробно_ПослеПредупреждения", ЭтаФорма, ДопПараметры, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждениеСКнопкойПодробно_ПослеПредупреждения(Ответ, ДопПараметры) Экспорт
	
	Если Ответ <> "Подробно..." Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ДопПараметры.ТекстПодробно;
	Сообщение.ИдентификаторНазначения = ДопПараметры.Форма.УникальныйИдентификатор;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогРедактированияСтандартногоПериода(Период, Обработчик
	, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	
	Диалог.Период = Период;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Диалог.Показать(ОповещениеОЗакрытии);
		
	Иначе
		
		Если Диалог.Редактировать() Тогда
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Диалог.Период, ПараметрыОбработчика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВводаЗначения(Значение = Неопределено, Подсказка = Неопределено, ТипЗначения = Неопределено
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Выполнить("ПоказатьВводЗначения(ОповещениеОЗакрытии, Значение, Подсказка, ТипЗначения)");
		
	Иначе
		
		ЗначениеВведено = ВвестиЗначение(Значение, Подсказка, ТипЗначения);
		
		Если ЗначениеВведено Тогда
			Результат = Значение;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		
		ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Результат, ПараметрыОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВводаСтроки(Строка, Подсказка, Длина = 0, Многострочность = Ложь
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Выполнить("ПоказатьВводСтроки(ОповещениеОЗакрытии, Строка, Подсказка, Длина, Многострочность)");
		
	Иначе
		
		СтрокаВведена = ВвестиСтроку(Строка, Подсказка, Длина, Многострочность);
		
		Если СтрокаВведена Тогда
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Строка, ПараметрыОбработчика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВводаДаты(Дата, Подсказка, Знач ЧастьДаты = Неопределено
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если ЧастьДаты = Неопределено Тогда
		ЧастьДаты = ЧастиДаты.ДатаВремя;
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Выполнить("ПоказатьВводДаты(ОповещениеОЗакрытии, Дата, Подсказка, ЧастьДаты)");
		
	Иначе
		
		ДатаВведена = ВвестиДату(Дата, Подсказка, ЧастьДаты);
		
		Если ДатаВведена Тогда
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Дата, ПараметрыОбработчика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВопроса(ТекстВопроса, Кнопки
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено
	, Заголовок = "", КнопкаПоУмолчанию = Неопределено
	, Таймаут = 0, КнопкаТаймаута = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок = НаименованиеМодуля();
	КонецЕсли;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Выполнить("ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса
		|, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймаута)");
		
	Иначе
		
		Ответ = Вопрос(ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймаута);
		
		ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Ответ, ПараметрыОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораИзСписка(СписокЗначений, Форма, ЭлементФормы, Значение = Неопределено
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	НачальноеЗначение = СписокЗначений.НайтиПоЗначению(Значение);
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Форма.ПоказатьВыборИзСписка(ОповещениеОЗакрытии, СписокЗначений, ЭлементФормы, НачальноеЗначение);
		
	Иначе
		
		ВыбранноеЗначение = Форма.ВыбратьИзСписка(СписокЗначений, ЭлементФормы, НачальноеЗначение);
		
		ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, ВыбранноеЗначение, ПараметрыОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораЗначенияВСписке(СписокЗначений, ЗаголовокДиалога = Неопределено, Значение = Неопределено
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	НачальноеЗначение = СписокЗначений.НайтиПоЗначению(Значение);
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		СписокЗначений.ПоказатьВыборЭлемента(ОповещениеОЗакрытии, ЗаголовокДиалога, НачальноеЗначение);
		
	Иначе
		
		ВыбранноеЗначение = СписокЗначений.ВыбратьЭлемент(ЗаголовокДиалога, НачальноеЗначение);
		
		ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, ВыбранноеЗначение, ПараметрыОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла(ЗаголовокДиалога = Неопределено
	, МножественныйВыбор = Ложь, Фильтр = "", ПредварительныйПросмотр = Ложь
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Фильтр = Фильтр;
	Диалог.Заголовок = ЗаголовокДиалога;
	Диалог.МножественныйВыбор = МножественныйВыбор;
	Диалог.ПредварительныйПросмотр = ПредварительныйПросмотр;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Диалог.Показать(ОповещениеОЗакрытии);
		
	Иначе
		
		ФайлыВыбраны = Диалог.Выбрать();
		
		Если ФайлыВыбраны Тогда
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Диалог.ВыбранныеФайлы, ПараметрыОбработчика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораКаталога(ЗаголовокДиалога = Неопределено, Каталог = Неопределено
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Диалог.Каталог = Каталог;
	Диалог.Заголовок = ЗаголовокДиалога;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Диалог.Показать(ОповещениеОЗакрытии);
		
	Иначе
		
		КаталогВыбран = Диалог.Выбрать();
		
		Если КаталогВыбран Тогда
			
			Результат = Новый Массив;
			Результат.Добавить(Диалог.Каталог);
			
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Результат, ПараметрыОбработчика);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогСохраненияФайла(ЗаголовокДиалога = "", Каталог = "", ИмяФайла = "", Расширение = "", Фильтр = ""
	, Обработчик, МодульОбработчика, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЗаголовокДиалога = НаименованиеМодуля();
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Диалог.Фильтр = Фильтр;
	Диалог.Каталог = Каталог;
	Диалог.Расширение = Расширение;
	Диалог.ПолноеИмяФайла = ИмяФайла;
	Диалог.Заголовок = ЗаголовокДиалога;
	
	Если ДоступныАсинхронныеФормы() Тогда
		
		ОповещениеОЗакрытии = НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика);
		
		Диалог.Показать(ОповещениеОЗакрытии);
		
	Иначе
		
		ФайлВыбран = Диалог.Выбрать();
		
		Если ФайлВыбран Тогда
			ВызватьОбработчикОповещения(Обработчик, МодульОбработчика, Диалог.ВыбранныеФайлы, ПараметрыОбработчика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОбработчикОповещения(Обработчик, Модуль, Параметр1, Параметр2 = Неопределено)
	
	Если Параметр2 = Неопределено Тогда
		Выполнить("Модуль." + Обработчик + "(Параметр1)");
	Иначе
		Выполнить("Модуль." + Обработчик + "(Параметр1, Параметр2)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НовоеОписаниеОповещения(Обработчик, МодульОбработчика, ПараметрыОбработчика)
	
	ПараметрыОповещения = НовыйМассив(Обработчик, МодульОбработчика, ПараметрыОбработчика);
	
	Результат = Новый("ОписаниеОповещения", ПараметрыОповещения);
	
	Возврат Результат;
	
КонецФункции

// Перечисления

&НаКлиенте
Функция Перечисление_ВариантыХраненияПлагинов() Экспорт
	
	КлючКэш = "ВариантыХраненияПлагинов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Перечисление_ВариантыХраненияПлагиновНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_ВариантыХраненияПлагиновНаСервере()
	
	Возврат МодульОбъекта().Перечисление_ВариантыХраненияПлагинов();
	
КонецФункции

&НаКлиенте
Функция Новый_ПараметрыСлужебногоСобытия() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат");
	Результат.Вставить("ТекстОшибки");
	Результат.Вставить("Параметры", Новый Структура);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_НастройкиБиблиотеки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВариантХранения");
	Результат.Вставить("ПутьКПлагинам");
	
	Возврат Результат;
	
КонецФункции


// Служебные

&НаКлиенте
Функция ПроверитьИнтернетПодключение(НастройкиПрокси) Экспорт
	
	Результат = ПроверитьИнтернетПодключениеНаСервере(НастройкиПрокси);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьИнтернетПодключениеНаСервере(НастройкиПрокси)
	
	Возврат МодульОбъекта().ПроверитьИнтернетПодключение(НастройкиПрокси);
	
КонецФункции

&НаКлиенте
Функция НаименованиеМодуля()
	
	КлючКэш = "НаименованиеМодуля";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = НаименованиеМодуляНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НаименованиеМодуляНаСервере()
	
	Возврат МодульОбъекта().НаименованиеМодуля();
	
КонецФункции

&НаКлиенте
Функция ВерсияПлатформы()
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Возврат СисИнфо.ВерсияПриложения;
	
КонецФункции

&НаКлиенте
Функция ВерсияРежимаСовместимости()
	
	КлючКэш = "ВерсияРежимаСовместимости";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ВерсияРежимаСовместимостиНаСервере();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВерсияРежимаСовместимостиНаСервере()
	
	Возврат МодульОбъекта().ВерсияРежимаСовместимости();
	
КонецФункции

&НаКлиенте
Функция ФайловыйРежимИБ() Экспорт
	
	КлючКэш = "ФайловыйРежимИБ";
	
	Результат = Кэш_Прочитать(КлючКэш);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтрокаСоединенияИБ = СтрокаСоединенияИнформационнойБазы();
	
	Если Найти(Врег(СтрокаСоединенияИБ), "FILE=") > 0 Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты)
	
	Возврат МодульОбъекта().ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	
	Возврат МодульОбъекта().ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаКлиенте
Функция КрасныйЦвет() Экспорт
	
	Возврат Новый Цвет(255, 0, 0);
	
КонецФункции

&НаКлиенте
Функция ЗеленыйЦвет() Экспорт
	
	Возврат Новый Цвет(0, 128, 0);
	
КонецФункции

// Формирует канонический уникальный идентификатор из произвольной строки
//
// Параметры:
//  Строка - Строка - уникальный идентификатор разбитый произвольным образом на блоки
// 
// Возвращаемое значение:
//  Строка - уникальный идентификатор по формату XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX
//
&НаКлиенте
Функция КаноническийИдентификаторИзСтроки(Строка) Экспорт
	
	Результат = "00000000-0000-0000-0000-000000000000";
	
	Если Не ЗначениеЗаполнено(Строка)  Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗначимаяЧастьСтроки = СтрЗаменить(Строка, "-", "");
	
	Блок1 = Сред(ЗначимаяЧастьСтроки, 1, 8);
	Блок2 = Сред(ЗначимаяЧастьСтроки, 9, 4);
	Блок3 = Сред(ЗначимаяЧастьСтроки, 13, 4);
	Блок4 = Сред(ЗначимаяЧастьСтроки, 17, 4);
	Блок5 = Сред(ЗначимаяЧастьСтроки, 21, 12);
	
	Результат = ПараметрыВСтроку("%1-%2-%3-%4-%5", Блок1, Блок2, Блок3, Блок4, Блок5);
	
	ЗначимаяЧастьРезультата = СтрЗаменить(Результат, "-", "");
	
	Если СтрДлина(Результат) < 36 Или ЗначимаяЧастьРезультата <> ЗначимаяЧастьСтроки Тогда
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось сформировать канонический идентификатор из строки: %1'"), Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СписокОбработокВСоставеКонфигурации() Экспорт
	
	Возврат СписокОбработокВСоставеКонфигурацииНаСервере();
	
КонецФункции

&НаСервере
Функция СписокОбработокВСоставеКонфигурацииНаСервере()
	
	Результат = Новый СписокЗначений;
	
	Для каждого Элемент Из Метаданные.Обработки Цикл
		Результат.Добавить(Элемент.Имя);
	КонецЦикла;
	
	Результат.СортироватьПоЗначению();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДоступныАсинхронныеФормы()
	
	Результат = СравнитьВерсии(ВерсияПлатформы(), "8.3.3") >= 0;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоУправляемаяФормаВыбора(ПутьКФорме)
	
	КлючКэш = "ЭтоОбычнаяФормаВыбораРезультаты";
	
	КэшРезультатов = Кэш_Прочитать(КлючКэш);
	
	Если КэшРезультатов <> Неопределено Тогда
		
		Результат = КэшРезультатов[ПутьКФорме];
		
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
	Иначе
		
		КэшРезультатов = Новый Соответствие;
		
	КонецЕсли;
	
	Результат = ЭтоУправляемаяФормаВыбораНаСервере(ПутьКФорме);
	
	КэшРезультатов.Вставить(ПутьКФорме, Результат);
	
	Кэш_Поместить(КлючКэш, КэшРезультатов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоУправляемаяФормаВыбораНаСервере(ПутьКФорме)
	
	Форма = Метаданные.НайтиПоПолномуИмени(ПутьКФорме);
	
	Если Форма = Неопределено Тогда
		Поз = Найти(ПутьКФорме, ".Форма");
		ИмяОбъекта = Лев(ПутьКФорме, Поз - 1);
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
		Форма = МетаданныеОбъекта.ОсновнаяФормаДляВыбора;
	КонецЕсли;
	
	Результат = (Форма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая);
	
	Возврат Результат;
	
КонецФункции


#Область ОбщегоНазначения

// Возвращает массив переданных параметров в порядке их расположения
// 
// Возвращаемое значение:
//  Массив
//
&НаКлиенте
Функция НовыйМассив(Знач1
	, Знач2 = Null, Знач3 = Null, Знач4 = Null
	, Знач5 = Null, Знач6 = Null, Знач7 = Null) Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Знач1);
	
	Если Знач2 <> Null Тогда
		Результат.Добавить(Знач2);
	КонецЕсли;
	Если Знач3 <> Null Тогда
		Результат.Добавить(Знач3);
	КонецЕсли;
	Если Знач4 <> Null Тогда
		Результат.Добавить(Знач4);
	КонецЕсли;
	Если Знач5 <> Null Тогда
		Результат.Добавить(Знач5);
	КонецЕсли;
	Если Знач6 <> Null Тогда
		Результат.Добавить(Знач6);
	КонецЕсли;
	Если Знач7 <> Null Тогда
		Результат.Добавить(Знач7);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйСоответствие(Ключ1, Знач1
	, Ключ2 = NULL, Знач2 = NULL
	, Ключ3 = NULL, Знач3 = NULL) Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Ключ1, Знач1);
	
	Если Ключ2 <> NULL И Знач2 <> NULL Тогда
		Результат.Вставить(Ключ2, Знач2);
	КонецЕсли;
	
	Если Ключ3 <> NULL И Знач3 <> NULL Тогда
		Результат.Вставить(Ключ3, Знач3);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
&НаКлиенте
Функция СравнитьВерсии(СтрокаВерсии1, СтрокаВерсии2)
	
	КлючКэш = "СравненияВерсий";
	
	КэшРезультов = Кэш_Прочитать(КлючКэш);
	Если КэшРезультов = Неопределено Тогда
		КэшРезультов = Новый Соответствие;
		Кэш_Поместить(КлючКэш, КэшРезультов);
	КонецЕсли;
	
	КлючКэш = СтрокаВерсии1 + "_" + СтрокаВерсии2;
	
	Результат = КэшРезультов.Получить(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Для составных номеров версий берем только первую часть.
	Строка1 = Сред(СтрокаВерсии1, 1, Найти(СтрокаВерсии1, "/") - 1);
	Строка2 = Сред(СтрокаВерсии2, 1, Найти(СтрокаВерсии2, "/") - 1);
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Результат = 0;
	
	Пока ЗначениеЗаполнено(Строка1)
		Или ЗначениеЗаполнено(Строка2) Цикл
		
		Поз = Найти(Строка1, ".");
		Если Поз > 0 Тогда
			ТекСтрока1 = Лев(Строка1, Поз - 1);
			Строка1 = Сред(Строка1, Поз + 1);
		Иначе
			ТекСтрока1 = Строка1;
			Строка1 = "";
		КонецЕсли;
		
		Поз = Найти(Строка2, ".");
		Если Поз > 0 Тогда
			ТекСтрока2 = Лев(Строка2, Поз - 1);
			Строка2 = Сред(Строка2, Поз + 1);
		Иначе
			ТекСтрока2 = Строка2;
			Строка2 = "";
		КонецЕсли;
		
		НомерВерсии1 = ОписаниеЧисла.ПривестиЗначение(ТекСтрока1);
		НомерВерсии2 = ОписаниеЧисла.ПривестиЗначение(ТекСтрока2);
		
		Результат = НомерВерсии1 - НомерВерсии2;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	КэшРезультов.Вставить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон с маркерами подстановки: "%1..%N";
//  Параметр<n>  - Строка - параметры, которые нужно подставить;
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
&НаКлиенте
Функция ПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено) Экспорт
	
	ЕстьПараметрыСПроцентом =
	Найти(Параметр1, "%") > 0
	Или Найти(Параметр2, "%") > 0
	Или Найти(Параметр3, "%") > 0
	Или Найти(Параметр4, "%") > 0
	Или Найти(Параметр5, "%") > 0;
	
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПараметрыСПроцентомВСтроку(ШаблонСтроки
		, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	КонецЕсли;
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Вставляет параметры в строку, с учетом того что в параметрах
// могут использоваться подстановочные слова %1, %2, %3, %4, %5
//
&НаКлиенте
Функция ПараметрыСПроцентомВСтроку(Знач ШаблонСтроки
	, Параметр1 = Неопределено
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	Результат = "";
	
	Пока Истина Цикл
		
		Поз = Найти(ШаблонСтроки, "%");
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Лев(ШаблонСтроки, Поз - 1);
		
		НомерПараметра = Сред(ШаблонСтроки, Поз + 1, 1);
		
		Если НомерПараметра = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли НомерПараметра = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли НомерПараметра = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли НомерПараметра = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли НомерПараметра = "5" Тогда
			ЗначениеПараметра = Параметр5;
		Иначе
			ЗначениеПараметра = Неопределено;
		КонецЕсли;
		
		Если ЗначениеПараметра = Неопределено Тогда
			Результат = Результат + "%";
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 1);
		Иначе
			Результат = Результат + ЗначениеПараметра;
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 2);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Результат + ШаблонСтроки;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура			 - Структура	 - структура источник;
//  Ключ				 - Строка		 - имя свойства структуры;
//  ЗначениеПоУмолчанию	 - Произвольный	 - (необязательный) возвращается в случае,
//                                         если в структуре нет указанного свойства
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//					если в структуре нет такого свойства
//
&НаКлиенте
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой
// или фиксированной структурой
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является структрой или фиксированной структурой
//
&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Ищет подходящие строки в массиве структур
//
// Параметры:
//  МассивСтруктур  - Массив	 - содержит структуры с одинаковым набором свойств;
//  ПараметрыОтбора - Структура	 - условия поиска, где:
//   * Ключ		 - имя свойства в структурах массива;
//   * Значение	 - подходящее значение;
//
// Возвращаемое значение:
//  Массив - содержит подходящие структуры
//
&НаКлиенте
Функция МассивСтруктур_НайтиСтроки(МассивСтруктур, ПараметрыОтбора) Экспорт
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(МассивСтруктур) Тогда
		
		Для Каждого Структура Из МассивСтруктур Цикл
			
			СтруктураСоответствуетОтбору = Истина;
			
			Для Каждого ЭлементОтбора Из ПараметрыОтбора Цикл
				
				Если Структура[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
					СтруктураСоответствуетОтбору = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтруктураСоответствуетОтбору Тогда
				Результат.Добавить(Структура);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Объединяет части пути через разделитель
//
&НаКлиенте
Функция ОбъединитьПути(П1, П2, П3 = Неопределено, П4 = Неопределено) Экспорт
	
	Результат = П1;
	
	РазделительПути = РазделительПути();
	
	ЧастиПути = Новый Массив;
	ЧастиПути.Добавить(П2);
	ЧастиПути.Добавить(П3);
	ЧастиПути.Добавить(П4);
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> РазделительПути Тогда
			Результат = Результат + РазделительПути;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает разделитель пути, используемого в операционной системе
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция РазделительПути()
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Если Найти(СисИнфо.ТипПлатформы, "Linux") > 0 Тогда
		Результат = "/";
	Иначе
		Результат = "\";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти