
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_РежимУправляемыхФорм;
Перем НеИспользуется_ТиповойМодуль;

Перем Ядро;
Перем ОсновнойМодуль;
Перем ГенерацияXML;
Перем ПечатныеФормы;
Перем РаботаСМаркировкой;

// Структура - содержит поля:
//   * Идентификатор - Строка - идентификатор категории пакета
//   * Представление - Строка - пользовательское представление категории пакета
Перем _ТекущаяКатегорияПакетов;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормы = Модуль_ПечатныеФормы;
	РаботаСМаркировкой = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормы = Неопределено;
	РаботаСМаркировкой = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ


//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html
    
	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);
		
		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
	
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
		
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "УстановитьУсловноеОформление" Тогда
		
		Возврат УстановитьУсловноеОформление(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	// BSLLS:LineLength-off
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd970");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd970",	Неопределено,	"ID_СчетФактура");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd970",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd970",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd970",	"ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd970",	"СЧФДОП",		"ID_УПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"СЧФ",			"ID_УПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"ДОП",			"ID_УПД_ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",							"Счет (неформализованный)", "ProformaInvoice",						"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",			"Счет (Диадок)", 			"ProformaInvoice",						"xmlproformainvoice");
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованныйФНС", 		"Счет (ФНС)",				"XmlProformaInvoice",					"proformainvoice29");
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетОфертаФормализованныйФНС", "Счет-оферта (ФНС)",		"XmlInvoiceOffer",						"invoiceoffer29");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct",					"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверкиФормализованный", "Акт сверки (формализованный)",	"ReconciliationAct",					"reconciliationact405");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ВНУТР", "УПД (перемещение)", "UniversalTransferDocumentInternal", "utd970", "ДОП");
	// BSLLS:LineLength-on
	
	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	НужнаВТДокументыБезНДС = Ложь;
	Запросы = Новый Массив;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ДобавитьЗапросПоВидуПакетуПакета(Запросы, ОписаниеВидаПакета);
		
		Если ЭтоВидПакетаБезСчетаФактуры(ОписаниеВидаПакета.ID) Тогда
			НужнаВТДокументыБезНДС = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрОбъединениеЗапросов = ТекстЗапроса_ОбъединитьВсе();
	
	Результат = СтрСоединить(Запросы, СтрОбъединениеЗапросов);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса_ВременныеТаблицы);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию()
	
	Результат = Ядро.Настройки_ОснованияВидовДокументов_ИспользуютсяНастройкиПоУмолчанию();
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	// BSLLS:LineLength-off
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;
	
	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_ДИС");
		
	// Исправления первичных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_ИУПД_ДОП");
		КонецЦикла;	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Корректировочные документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_КСЧФ");
		
		ПодготовитьИДобавитьДокументВПакет_УКДДИС(Пакет, Документ1С);
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_КСФ");
		
	// Исправления корректировочных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД_КСЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_ИУКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИКСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИКСФ");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
	// Исправления СФ на аванс
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Прочие документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверкиФормализованный" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверкиФормализованный");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СчетФормализованный" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФормализованный");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СчетФормализованныйФНС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФормализованныйФНС");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СчетОфертаФормализованныйФНС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетОфертаФормализованныйФНС");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_ВНУТР" Тогда
		
		Пакет.Направление = "Внутреннее";
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ВНУТР");
		
	КонецЕсли;
	
	// BSLLS:LineLength-on
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html

	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый		 = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры		 = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника			 = Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ID = "ID_УПД_ВНУТР" Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД"	, УказыватьОтсутствиеОснованияУПД);
		ДополнительныеПараметры.Вставить("ПараметрыСогласования"			, Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"					, ДанныеСотрудника);
		ДополнительныеПараметры.Вставить("ФИОПодписанта"					, " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД"						, ФункцияУПД);
		ДополнительныеПараметры.Вставить("FormatVersion"					, FormatVersion);
		ДополнительныеПараметры.Вставить("ВнутреннийДокументооборот"		, Истина);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(
				НеИспользуется_ТиповойМодуль, 
				НеИспользуется_РежимУправляемыхФорм, 
				Документ1С, 
				ТипКонтента_XDTO, 
				ДополнительныеПараметры);	
		
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
	
	ИначеЕсли ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый)
		Или ОсновнойМодуль.ТипСоответствуетКонтентуУКД(ВидДокументаРазвернутый) Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		СчетФактура = СвойствоСтруктурыЛок(Параметры.ДополнительныеПараметры, "СчетФактура");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД"	, УказыватьОтсутствиеОснованияУПД);
		ДополнительныеПараметры.Вставить("ПараметрыСогласования"			, Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"					, ДанныеСотрудника); // Графа 10 (РабОргПрод)
		ДополнительныеПараметры.Вставить("ФИОПодписанта"					, " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД"						, ФункцияУПД);
		ДополнительныеПараметры.Вставить("FormatVersion"					, FormatVersion);
		ДополнительныеПараметры.Вставить("СчетФактура"						, СчетФактура);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);	
		
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_СчетФормализованный"
		Или ID = "ID_СчетФормализованныйФНС"
		Или ID = "ID_СчетОфертаФормализованныйФНС"
		Или ID = "ID_АктСверкиФормализованный" Тогда
		
		ДополнительныеПараметры = Неопределено;
		
		Content = Ядро.ТиповойМодуль_ПолучитьКонтент(
			Документ1С,
			ТипКонтента_XDTO,
			ДополнительныеПараметры
		);
		
		Ядро.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" ИЛИ ID = "ID_Счет" Тогда
		
		Если ID = "ID_АктСверки" Тогда
			ИмяПечатнойФормы = "АктСверки";
		Иначе 
			ИмяПечатнойФормы = "СчетНаОплату";
		КонецЕсли;
		
		ДополнительныеПараметры = Неопределено;
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ИмяПечатнойФормы, ДополнительныеПараметры);
		
		Результат.Метаданные.DocumentNumber = СокрЛП(ДанныеПечатнойФормы.Номер);
		Результат.Метаданные.DocumentDate = ДанныеПечатнойФормы.Дата;
		Результат.Метаданные.FileName = ДанныеПечатнойФормы.ИмяФайла;
		
		Если TypeNamedId = "ProformaInvoice" Тогда
			Результат.Метаданные.TotalSum = ДанныеПечатнойФормы.Сумма;
			Результат.Метаданные.TotalVat = ДанныеПечатнойФормы.СуммаНДС;
			Результат.Метаданные.CurrencyCode = ДанныеПечатнойФормы.КодВалюты;
		КонецЕсли;
		
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html

	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЕстьСуммаДокумента = ДокументУчета.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено;
	
	Если ЕстьСуммаДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаДокумента";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОсновнойМодуль.Общее_ЗначенияРеквизитовОбъекта(ДокументУчета, ИменаРеквизитов);
	
	Реквизиты.Номер	= СокрЛП(ЗначенияРеквизитов.Номер);
	Реквизиты.Дата = ЗначенияРеквизитов.Дата;
	
	Если ЕстьСуммаДокумента Тогда
		Реквизиты.Сумма	= ЗначенияРеквизитов.СуммаДокумента;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html
	
	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента = Документ.Тип;
	ФункцияДокумента = Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(
			Документ.Получатель.ОрганизацияЭДО, 
			Документ.Получатель.BoxId);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(
			Документ.Отправитель.ОрганизацияЭДО, 
			Документ.Отправитель.BoxId);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация", СопоставленныеОрганизации1С);
	ПараметрыОтбора.Вставить("Контрагент",	СопоставленныеКонтрагенты1С);
	ПараметрыОтбора.Вставить("ДатаДокумента",	Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента",	Документ.Реквизиты.Номер);
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "КорректировкаПоступления");
		
	ИначеЕсли ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента) Тогда
		
		ПараметрыОтбора.Вставить("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыПолученного.Корректировочный);
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетНаОплату(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетНаОплатуПоставщика");
		
	ИначеЕсли ОсновнойМодуль.ЭтоАктОРасхождениях(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "АктОРасхожденияхПолученный");
		
	ИначеЕсли ЭтоФормализованныйАктСверки405(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		НачалоПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.BeginDate);
		ОкончаниеПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.EndDate);
		
		Результат = НайтиАктыСверкиВзаиморасчетов(
			Организация,
			Контрагент,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктСверки405(ТипЭД)
	
	Результат = НРег(ТипЭД.ТипДокумента) = НРег("ReconciliationAct")
				И НРег(ТипЭД.ТипКонтента) = НРег("reconciliationact405");
	
	Возврат Результат;
	
КонецФункции

Функция НайтиАктыСверкиВзаиморасчетов(Организация, Контрагент, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериодаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктСверкиВзаиморасчетов.Ссылка
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|ГДЕ
	|	НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	|	И АктСверкиВзаиморасчетов.Организация = &Организация
	|	И АктСверкиВзаиморасчетов.Контрагент = &Контрагент
	|	И АктСверкиВзаиморасчетов.ДатаНачала = &ДатаНачала
	|	И АктСверкиВзаиморасчетов.ДатаОкончания = &ДатаОкончания";
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	ПроверитьЗаполнитьИдентификаторОперации(Параметры);
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Документ = Параметры.Документ;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Документ.Тип.ФункцияДокумента) Тогда
		Результат.ОписаниеОшибки = "Не задана операция для создания учетного документа!";
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторОперации = Параметры.ИдентификаторОперации;
	
	РезультатПроверки = ПроверкаДокументаОснования(Документ, ИдентификаторОперации);
	
	Если ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки) Тогда
		
		Результат.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Параметры.ДополнительныеПараметры.Вставить("ДокументОснование", РезультатПроверки.ОсновнойОбъект);
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Если ИспользоватьДатуЭД
		И НЕ ЭтоФормализованныйАктСверки405(Документ.Тип) Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаНоменклатурыДляСопоставления = ПараметрыПМ.ТаблицаСопоставления;
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html

	Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	
	ДокументДД	= Параметры.ДокументДД;
	ПакетДД		= Параметры.ПакетДД;
	
	Ошибки		= Новый Массив;
	Документ1С	= Неопределено;
	
	СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	
	ТипДокумента 	= НРег(СтруктураДанных.ТипДокумента);
	ТипКонтента 	= НРег(СтруктураДанных.ТипКонтента);
	ФункцияДокумента = НРег(СтруктураДанных.ФункцияДокумента);	
	
	Контрагент	= СтруктураДанных.Контрагент;
	Организация	= СтруктураДанных.Организация;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда			
		Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
		Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	КонецЕсли;	
	
	// Выполним сопоставление документа
	МассивДокументов1С = ОсновнойМодуль.НайтиСопоставлениеДокумента(Параметры.Документ);
	
	Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
		Документ1С = МассивДокументов1С[0];
	КонецЕсли;
	
    // НАКЛАДНЫЕ
	Если ТипДокумента = "xmltorg12" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда		
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
		Иначе			
			ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
		КонецЕсли;		
		
	// СЧЕТА-ФАКТУРЫ
	ИначеЕсли ТипДокумента = "invoice" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда		
						
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
		КонецЕсли;
		
		ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820" ИЛИ ТипКонтента = ТипКонтентаUtd970());
		
		Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
			Ошибки.Добавить("Счет-фактура в старом формате.");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("ДокументДляСопоставления", Документ1С);
	Результат.Вставить("Ошибки", Ошибки);	
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html

	Пакет			= Параметры.Пакет;	
	ДокументыПакета	= Параметры.ДокументыПакета;
	
	ДокументыПакета.Колонки.Добавить("ДанныеДокумента");
	
	СуммаНакладной 					= Неопределено;
	СуммаСчетаФактуры 				= Неопределено;
	ЕстьНесопоставленныеДокументы 	= Ложь;	
	ЕстьКритичнаяОшибкаПакета 		= Ложь;
	
	Ошибки = Новый Массив;
	
	// 1. Анализ всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ТекДокумент.Ссылка, Пакет);
		ТекДокумент.ДанныеДокумента = ДанныеДокумента;
		
		ДокументДД 		= ТекДокумент.Ссылка;		
		ТипДокумента 	= НРег(ДанныеДокумента.ТипДокумента);
		ФункцияДокумента = НРег(ДанныеДокумента.ФункцияДокумента);
		
		//ошибки, выявленные при выполнении события ПровестиАнализДокумента, распространяем на весь пакет
		Если ЗначениеЗаполнено(ДанныеДокумента.ТекстОшибки) Тогда
			Ошибки.Добавить(ДанныеДокумента.ТекстОшибки);
		КонецЕсли;
		
		Если ТипДокумента = "xmltorg12" 
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
		    СуммаНакладной = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если ТипДокумента = "invoice"
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
			СуммаСчетаФактуры = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
						
		Если (ТипДокумента = "xmltorg12" ИЛИ ТипДокумента = "invoice" ИЛИ ТипДокумента = "universaltransferdocument")
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
			ЕстьНесопоставленныеДокументы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// 2. Интерпретация ошибок
	
	Если СуммаНакладной = Неопределено Тогда
		Ошибки.Добавить("Нет накладной.");
	КонецЕсли;
	
	Если СуммаСчетаФактуры = Неопределено Тогда
		Ошибки.Добавить("Нет счета-фактуры.");
	КонецЕсли;
	
	Если СуммаНакладной <> Неопределено И СуммаСчетаФактуры <> Неопределено И СуммаНакладной <> СуммаСчетаФактуры Тогда
		Ошибки.Добавить("Не совпадают суммы счета-фактуры и первичного документа.");
		//ЕстьКритичнаяОшибкаПакета = Истина; //иногда в СФ могут не включать позиции без НДС, тогда несовпадение сумм приемлемо
	КонецЕсли;
		
	ТекстВсехОшибокПакета = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
	
	ЕстьКритичнаяОшибкаПакета = (ЕстьКритичнаяОшибкаПакета 
								ИЛИ Найти(ТекстВсехОшибокПакета, "ДУБЛИКАТ") <> 0
								ИЛИ Найти(ТекстВсехОшибокПакета, "Счет-фактура в старом формате") <> 0);
	
	//ОшибокНет = (СокрЛП(ТекстВсехОшибокПакета) = ""); //самый жесткий вариант выполнения анализа пакета
	ОшибокНет = НЕ ЕстьКритичнаяОшибкаПакета;           //менее жесткий вариант выполнения анализа пакета
	
	
	// 3. Формирование контента ответа всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ТекДокумент.ДанныеДокумента;
		
		ДокументДД	= ТекДокумент.Ссылка;		
		Документ1С	= ДанныеДокумента.ДокументВ1С;
		ТекстОшибки	= ДанныеДокумента.ТекстОшибки;
		
		НеИзменятьДействиеВДД = ЗначениеЗаполнено(ДанныеДокумента.ТребуемоеДействиеВДД)
								И ДанныеДокумента.ТребуемоеДействиеВДД <> "Подписать";
		
		Если НеИзменятьДействиеВДД ИЛИ Не ЗначениеЗаполнено(Документ1С) Тогда
			Продолжить;
		КонецЕсли;
						
		РезультатАнализа = ОсновнойМодуль.ЭДО_НовыйРезультатАнализаВходящегоДокумента();
		
		РезультатАнализа.Ошибки = ТекстОшибки; // сохраняем ошибки, относящиеся только к текущему документу
		//РезультатАнализа.Ошибки = ТекстВсехОшибокПакета; // сохраняем ошибки всего пакета для каждого документа из пакета
		
		СписокДействийТекДокумента = ОсновнойМодуль.ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументДД, ОшибокНет);		
		РезультатАнализа.ДействиеВДД = ?(СписокДействийТекДокумента.Количество() = 0, "", СписокДействийТекДокумента[0].Значение);
				
		Если ЗначениеЗаполнено(РезультатАнализа.ДействиеВДД) Тогда						
			РезультатАнализа.Вставить("КонтентОтвета", ПолучитьКонтентОтвета(ДокументДД, Документ1С, РезультатАнализа.ДействиеВДД, ТекстВсехОшибокПакета));			
		КонецЕсли;
		
		РезультатАнализа.Вставить("ДокументДляСопоставления", Документ1С);
		ОсновнойМодуль.СохранитьРезультатАнализа(ДокументДД, РезультатАнализа);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html

	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
		ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
		ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
		
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратТоваровОтПокупателя",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеДопРасходов",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионераОПродажах",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеНМА",				Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВыкупПредметовЛизинга",		Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаПоступление"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента"));
			
			ОтборСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный"));
			
			ОтборКоррСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетНаОплатуПоставщика", Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			Элемент
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции



///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html

	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И РеализацияТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслуг.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНачала
	|	И ПоступлениеТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктОбОказанииПроизводственныхУслуг.Ссылка)
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслуг.Проведен = ИСТИНА
	|	И АктОбОказанииПроизводственныхУслуг.Организация = &Организация
	|	И АктОбОказанииПроизводственныхУслуг.Дата >= &ДатаНачала
	|	И АктОбОказанииПроизводственныхУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОбОказанииПроизводственныхУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьУсловноеОформление(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Ustanovit%27_Uslovnoye_Oformleniye.html
	
	Форма = Параметры.Форма;
	
	//входящие документ на подпись
	//ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Направление");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение 	= "Входящее";
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Статус");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Содержит;
	//ОтборЭлемента.ПравоеЗначение 	= "Требуется подпись";
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	Возврат Истина;

КонецФункции

// Получает код валюты в соответствии с ОКВ
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты - валюта, код которой требуется определить
// 
// Возвращаемое значение:
//  Строка - код валюты по ОКВ
//
Функция КодВалютыПоКлассификатору(Валюта)
	
	РеквизитыВалюты = Новый Структура;
	РеквизитыВалюты.Вставить("Код");
	РеквизитыВалюты.Вставить("ЗагружаетсяИзИнтернета");
	РеквизитыВалюты.Вставить("ОсновнаяВалютаКод", "ОсновнаяВалюта.Код");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛок(Валюта, РеквизитыВалюты);
	
	Результат = СокрЛП(ЗначенияРеквизитов.Код);
	Если Не ЗначенияРеквизитов.ЗагружаетсяИзИнтернета
		И ЗначениеЗаполнено(ЗначенияРеквизитов.ОсновнаяВалютаКод) Тогда
		Результат = СокрЛП(ЗначенияРеквизитов.ОсновнаяВалютаКод);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ


//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
	// BSLLS:LineLength-off
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_Основная(), "Первичные документы");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД", "УПД", "ID_УПД, ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ОсновнойПакет", "СФ + ТОРГ12/Акт", "ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_раздельно", "УПД СЧФ + УПД ДОП", "ID_УПД_СЧФ, ID_УПД_ДОП");
	
	Пакеты_НачатьКатегорию("КорректировочныйПакет", "Корректировочные документы");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД", "УКД", "ID_УКД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД_раздельно", "УКД КСЧФ + УКД ДИС", "ID_УКД_КСЧФ, ID_УКД_ДИС");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_КСФ", "КСФ", "ID_КСФ");
	
	Пакеты_НачатьКатегорию("СчетФактураНаАванс", "Счет-фактура на аванс");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_СФ_НаАванс", "СФ (на аванс)", "ID_СчетФактура");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_НаАванс", "УПД СЧФ (на аванс)", "ID_УПД_СЧФ");
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_СчетаНаОплату(), "Счет на оплату");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_Счет", "Счет (неформализованный)", "ID_Счет");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_СчетФормализованный", "Счет (Диадок)", "ID_СчетФормализованный");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_СчетФормализованныйФНС", "Счет (ФНС)", "ID_СчетФормализованныйФНС");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_СчетОфертаФормализованныйФНС", "Счет-оферта (ФНС)", "ID_СчетОфертаФормализованныйФНС");
	
	Пакеты_НачатьКатегорию("АктCверки", "Акт сверки");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_АктСверки", "Акт сверки", "ID_АктСверки");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_АктСверкиФормализованный", "Акт сверки (формализованный)", "ID_АктСверкиФормализованный");
	
	Пакеты_НачатьКатегорию(КатегорииПакетов_БезКатегории(), "");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД", "УПД (исправление)", "ID_ИУПД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_раздельно", "УПД СЧФ + УПД ДОП (исправление)", "ID_ИУПД_СЧФ, ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИСФ", "СФ (исправление)", "ID_ИСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУКД", "УКД (исправление)", "ID_ИУКД");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУКД_раздельно", "УКД КСЧФ + УКД ДИС (исправление)", "ID_ИУКД_КСЧФ, ID_ИУКД_ДИС");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИКСФ", "КСФ (исправление)", "ID_ИКСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_НаАванс", "УПД (исправление на аванс)", "ID_ИУПД_СЧФ");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИСФ_НаАванс", "СФ (исправление на аванс)", "ID_ИСФ");
	
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ТОРГ12_Акт_БезНДС", "ТОРГ12/Акт (без СФ)", "ID_АктФормализованный, ID_ТОРГ12");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_БезНДС", "УПД ДОП (без СФ)", "ID_УПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_ИУПД_БезНДС", "УПД ДОП (исправление без СФ)", "ID_ИУПД_ДОП");
	Пакеты_ДобавитьВидПакета(ТЗ, "ID_УКД_БезНДС", "УКД ДИС (без СФ)", "ID_УКД_ДИС");
	
	Пакеты_НачатьКатегорию("ВнутренниеПеремещения", "Внутренние перемещения");
	Пакет = Пакеты_ДобавитьВидПакета(ТЗ, "ID_УПД_ВНУТР", "УПД (перемещение)", "ID_УПД_ВНУТР");
	Пакет.ВнутреннийДО = Истина;
	
	// BSLLS:LineLength-on
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Если ВидПакетаID <> "ID_УПД_ВНУТР" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ПеремещениеТоваров) Тогда
		ИмяВТ = ДобавитьТаблицу_ПеремещениеТоваров(Запрос);
		Результат.Добавить(ИмяВТ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	ТипСсылки = ТипЗнч(Документ1С);
	
	ЭтоСчетФактураВыданный = (ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Если ЭтоСчетФактураВыданный Тогда
		
		ДокОснованиеСФ = ДокументыОснованияСчетаФактуры(Документ1С);
		
		Если НЕ ЗначениеЗаполнено(ДокОснованиеСФ) Тогда
			Возврат;
		КонецЕсли;
		
		ИсточникДанных = ДокОснованиеСФ[0];
		
	Иначе
		
		ИсточникДанных = Документ1С;
		
	КонецЕсли;
	
	МетаданныеИсточникаДанных = ИсточникДанных.Метаданные();
	
	ЕстьРеквизитПодразделение = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "ПодразделениеОрганизации");
	ЕстьРеквизитОрганизация = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Организация");
	ЕстьРеквизитКонтрагент = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "Контрагент");
	ЕстьРеквизитДоговорКонтрагента = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "ДоговорКонтрагента");
	ЕстьРеквизитПодразделениеОтправитель = Ядро.Общее_ЕстьРеквизитМетаданных(
			МетаданныеИсточникаДанных, "ПодразделениеОтправитель");
	ЕстьРеквизитПодразделениеПолучатель = Ядро.Общее_ЕстьРеквизитМетаданных(
			МетаданныеИсточникаДанных, "ПодразделениеПолучатель");
	ЕстьРеквизитСкладОтправитель = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "СкладОтправитель");
	ЕстьРеквизитСкладПолучатель = Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеИсточникаДанных, "СкладПолучатель");
	
	ИменаРеквизитов = Новый Массив;

	Если ЕстьРеквизитПодразделение Тогда
		ИменаРеквизитов.Добавить("ПодразделениеОрганизации");
	КонецЕсли;
	
	Если ЕстьРеквизитПодразделениеОтправитель Тогда
		ИменаРеквизитов.Добавить("ПодразделениеОтправитель");
	КонецЕсли;
	
	Если ЕстьРеквизитПодразделениеПолучатель Тогда
		ИменаРеквизитов.Добавить("ПодразделениеПолучатель");
	КонецЕсли;
	
	Если ЕстьРеквизитСкладОтправитель Тогда
		ИменаРеквизитов.Добавить("СкладОтправитель");
	КонецЕсли;
	
	Если ЕстьРеквизитСкладПолучатель Тогда
		ИменаРеквизитов.Добавить("СкладПолучатель");
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
	
	Если ЕстьРеквизитДоговорКонтрагента Тогда
		ИменаРеквизитов.Добавить("ДоговорКонтрагента");
	КонецЕсли;
	
	Разделитель = ",";
	ТребуемыеРеквизиты = Ядро.СоединитьСтроку(ИменаРеквизитов, Разделитель);
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		Реквизиты = Ядро.Общее_ЗначенияРеквизитовОбъекта(ИсточникДанных, ТребуемыеРеквизиты);
	КонецЕсли;
	
	// В коллекции ПоляОтправителя и ПоляПолучателя индекс элементов соответствует приоритету этих элементов.
	// Чем меньше индекс, тем выше приоритет.
	
	Если ЕстьРеквизитПодразделениеОтправитель И ЗначениеЗаполнено(Реквизиты.ПодразделениеОтправитель) Тогда
		ПоляОтправителя.Добавить(Реквизиты.ПодразделениеОтправитель);
	КонецЕсли;
	
	Если ЕстьРеквизитСкладОтправитель И ЗначениеЗаполнено(Реквизиты.СкладОтправитель) Тогда
		ПоляОтправителя.Добавить(Реквизиты.СкладОтправитель);
	КонецЕсли;
	
	Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(Реквизиты.ПодразделениеОрганизации) Тогда
		ПоляОтправителя.Добавить(Реквизиты.ПодразделениеОрганизации);
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Организация);
	КонецЕсли;
	
	Если ЕстьРеквизитПодразделениеПолучатель И ЗначениеЗаполнено(Реквизиты.ПодразделениеПолучатель) Тогда
		ПоляПолучателя.Добавить(Реквизиты.ПодразделениеПолучатель);
	КонецЕсли;
	
	Если ЕстьРеквизитСкладПолучатель И ЗначениеЗаполнено(Реквизиты.СкладПолучатель) Тогда
		ПоляПолучателя.Добавить(Реквизиты.СкладПолучатель);
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ПоляПолучателя.Добавить(Реквизиты.Контрагент);
	КонецЕсли;
	
	Если ЕстьРеквизитДоговорКонтрагента И ЗначениеЗаполнено(Реквизиты.ДоговорКонтрагента) Тогда
		ПоляПолучателя.Добавить(Реквизиты.ДоговорКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка.СчетФактураВыданный - Счет-фактура, основание которого требуется получить.
// 
// Возвращаемое значение:
//  ДокументСсылка - документ, на основании которого выписан счет-фактура.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Ядро.Общее_ВыборкаДанныхОбъекта(СчетФактура, "ДокументыОснования", "ДокументОснование");
			
	Пока Выборка.Следующий() Цикл 
		
		ДокументОснование = Выборка.ДокументОснование;
		
		Если Результат.Найти(ДокументОснование) = Неопределено Тогда
			Результат.Добавить(ДокументОснование);
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат Результат;
	
КонецФункции

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ПечатьСчетаНаОплату");
							
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= "СчетЗаказ";
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Результат = ПредставлениеНомера(Документ.Номер);
	
	Возврат Результат;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
	
	СписокОснований.Добавить("СчетНаОплату", "Счет на оплату");
	СписокОснований.Добавить("ДокументПродажи", "Документ продажи");
			
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	СравниваемыеТипы = Новый Массив;
	
	СравниваемыеТипы.Добавить(Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
	
	Если Метаданные.Документы.Найти("АР_СчетНаАренду") <> Неопределено Тогда
		СравниваемыеТипы.Добавить(Тип("ДокументСсылка.АР_СчетНаАренду"));
	КонецЕсли;
	
	Результат = СравниваемыеТипы.Найти(ТипЗнч(Документ1С)) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  ДокументыПоТипам - Соответствие - Соотвествие типов документов где ключ это Тип документа а значение это массив документов
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Организация");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(КоллекцияДокументов, Реквизиты, Истина);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыДокументаУчетаДляПакетаНаОтправку(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Документ", Неопределено);
	Результат.Вставить("Контрагент", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("НомерДокумента", "");
	Результат.Вставить("ДатаДокумента", '00010101');
	Результат.Вставить("СуммаДокумента", "");
	Результат.Вставить("ДокументБезНДС", Ложь);
	Результат.Вставить("ТипДокументаПоддерживается", Истина);
	Результат.Вставить("КатегорияПакета", "ОсновнойПакет");
	
	Если ЭтоПодходящийСчетФактураДляПакетаНаОтправку(СсылкаНаОбъект) Тогда
		
		ВыборкаРеквизитов = ВыборкаРеквизитовСчетФактурыДляПакетаНаОтправку(СсылкаНаОбъект);
		
		Если ЭтоСчетФактураВыданныйНаАванс(СсылкаНаОбъект) Тогда
			Результат.КатегорияПакета = "СчетФактураНаАванс";
		КонецЕсли;
		
	ИначеЕсли ЭтоРеализацияТоваровУслуг(СсылкаНаОбъект) Тогда
		
		Если ЭтоРеализацияДляКоторойСчетФактураНеТребуется(СсылкаНаОбъект) Тогда
			Результат.ДокументБезНДС = Истина;
		Иначе
			Результат.ДокументБезНДС = РеализацияТоваровУслугБезНДС(СсылкаНаОбъект);
		КонецЕсли;
		
		Если Результат.ДокументБезНДС Тогда
			ВыборкаРеквизитов = ВыборкаРеквизитовРеализацииДляПакетаНаОтправку(СсылкаНаОбъект);
		Иначе
			ВыборкаРеквизитов = ВыборкаРеквизитовСчетФактурыПоДокументуОснованияДляПакетаНаОтправку(СсылкаНаОбъект);
		КонецЕсли;
		
	Иначе
		
		Результат.ТипДокументаПоддерживается = Ложь;
		
	КонецЕсли;
	
	Если Результат.ТипДокументаПоддерживается
		И ВыборкаРеквизитов.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаРеквизитов);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыборкаРеквизитовСчетФактурыДляПакетаНаОтправку(СсылкаНаОбъект)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокСчетФактура.Ссылка КАК Документ,
	|	ДокСчетФактура.Контрагент КАК Контрагент,
	|	ДокСчетФактура.Организация КАК Организация,
	|	ДокСчетФактура.Номер КАК НомерДокумента,
	|	ДокСчетФактура.Дата КАК ДатаДокумента,
	|	ДокСчетФактура.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДокСчетФактура
	|ГДЕ
	|	ДокСчетФактура.Ссылка = &СсылкаНаОбъект
	|	И НЕ ДокСчетФактура.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

Функция ВыборкаРеквизитовРеализацииДляПакетаНаОтправку(СсылкаНаОбъект)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Номер КАК НомерДокумента,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &СсылкаНаОбъект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

Функция ВыборкаРеквизитовСчетФактурыПоДокументуОснованияДляПакетаНаОтправку(СсылкаНаОбъект)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Документ,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Контрагент КАК Контрагент,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Организация КАК Организация,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер КАК НомерДокумента,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата КАК ДатаДокумента,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
	|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПодходящийСчетФактураДляПакетаНаОтправку(СсылкаНаОбъект)
	
	Результат = Ложь;
	
	Если ЭтоСчетФактураВыданныйНаАванс(СсылкаНаОбъект) Тогда
		Результат = НЕ ЭтоИсправительныйИлиКорректировочныйСчетФактура(СсылкаНаОбъект);
	ИначеЕсли ЭтоСчетФактураВыданный(СсылкаНаОбъект) Тогда
		Результат = НЕ ЭтоИсправительныйИлиКорректировочныйСчетФактура(СсылкаНаОбъект)
			И МодульПоддерживаетОбработкуДокументаОснованияСчетФактуры(СсылкаНаОбъект);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправительныйИлиКорректировочныйСчетФактура(СсылкаНаОбъект)
	
	Результат = Ложь;
	
	РеквизитыСФ = ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, "ВидСчетаФактуры, Исправление");
	ВидСФКорректировочный = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.Корректировочный");
	
	Если РеквизитыСФ.ВидСчетаФактуры = ВидСФКорректировочный
		Или РеквизитыСФ.Исправление = Истина Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МодульПоддерживаетОбработкуДокументаОснованияСчетФактуры(СсылкаНаОбъект)
	
	Результат = Истина;
	
	ВидыПредопределенныхДокументов = ВидыПредопределенныхДокументовДляПоискаВМодуле();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК Т
	|ГДЕ
	|	Т.Ссылка = &СсылкаНаОбъект";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОснование = Выборка.ДокументОснование;
		
		Если ВидыПредопределенныхДокументов.Найти(ДокументОснование.Метаданные()) = Неопределено Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Определяет необходимость наличия счета-фактуры выданного у документа реализации товаров и услуг
//
// Параметры:
//  Документ1С	 - ДокументСсылка	 - реализация товаров и услуг, у которой необходимо проверить необходимость наличия СФ  
// 
// Возвращаемое значение:
//  Результат	- Булево - Истина, если требуется наличие счета-фактуры 
//
Функция ТребуетсяСчетФактура(Документ1С) Экспорт

	Результат = Ложь;
	
	Если ТипЗнч(Документ1С) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ЭтоРеализацияДляКоторойСчетФактураНеТребуется = ЭтоРеализацияДляКоторойСчетФактураНеТребуется(Документ1С);
		УДокументаЕстьСчетФактураВыданный = УДокументаЕстьСчетФактураВыданный(Документ1С);
		ДокументБезНДС = РеализацияТоваровУслугБезНДС(Документ1С);
		Если Не ЭтоРеализацияДляКоторойСчетФактураНеТребуется
			И (Не ДокументБезНДС И Не УДокументаЕстьСчетФактураВыданный) Тогда
			
			Результат = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УДокументаЕстьСчетФактураВыданный(Документ1С)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Документ
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
	|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", Документ1С);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Не РезультатЗапроса.Пустой();
	
	Возврат Результат;		
	
КонецФункции

// Находит связи с учетным документом, на основании которого формируется электронный счет на оплату.
// Алгоритм поиска связанных документов такой же, как в СчетаНаОплату_СвязанныеДокументы,
// но запрос строится универсально (по критерию отбора).
//
// Параметры:
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - учетный документ (счет, заказ, документ продажи),
//                               на основании которого формируется электронный счет на оплату.
// 
// Возвращаемое значение:
//  Массив из ЛюбаяСсылка.
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(ОснованиеЭлектронногоСчета) Экспорт
	
	Результат = Новый Массив;
	
	ИсключаемыеТипы = СчетаНаОплату_ИсключаемыеТипыСвязей();
	Результат = СвязиДокументов_НайтиПоКритериюОтбора(ОснованиеЭлектронногоСчета, ИсключаемыеТипы);
	
	Если ЭтоСчетНаОплатуПокупателю(ОснованиеЭлектронногоСчета)
		Или ЭтоСчетНаАренду(ОснованиеЭлектронногоСчета) Тогда
		
		Для Каждого СвязанныйДокумент Из Результат Цикл
			
			ВторичныеСвязи = СвязиДокументов_НайтиПоКритериюОтбора(СвязанныйДокумент, ИсключаемыеТипы);
			Общее_ДополнитьМассив(Результат, ВторичныеСвязи);
			
		КонецЦикла;
		
	Иначе
		
		Если ЭтоРеализацияТоваровУслуг(ОснованиеЭлектронногоСчета) Тогда
			СчетНаОплату = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеЭлектронногоСчета, "СчетНаОплатуПокупателю");
		ИначеЕсли ЭтоНачислениеАренднойПлаты(ОснованиеЭлектронногоСчета) Тогда
			СчетНаОплату = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеЭлектронногоСчета, "ДокументОснование");
		Иначе
			СчетНаОплату = Неопределено;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СчетНаОплату) Тогда
			Результат.Добавить(СчетНаОплату);
		КонецЕсли;
		
		Результат.Добавить(ОснованиеЭлектронногоСчета);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Находит связи с учетным документом, на основании которого формируется электронный счет на оплату.
// Если в аргументе передается счет на оплату, то в результат функции добавляются связи
// второго порядка. Например, документ реализации - это связь первого порядка.
// А счет-фактура на реализацию - это связь второго порядка.
//
// Параметры:
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - учетный документ (счет, заказ, документ продажи),
//                               на основании которого формируется электронный счет на оплату.
// 
// Возвращаемое значение:
//  Массив из ЛюбаяСсылка.
//
Функция СчетаНаОплату_СвязанныеДокументы(ОснованиеЭлектронногоСчета) Экспорт
	
	Если ЭтоСчетНаОплатуПокупателю(ОснованиеЭлектронногоСчета)
		Или ЭтоСчетНаАренду(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоСчетуНаОплату(ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоДокументПродажи(ОснованиеЭлектронногоСчета) Тогда
		
		Результат = СчетаНаОплату_СвязиПоДокументуПродажи(ОснованиеЭлектронногоСчета);
		Результат.Добавить(ОснованиеЭлектронногоСчета);
		
	Иначе
		
		Результат = Новый Массив;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоСчетуНаОплату(СчетНаОплату)
	
	Результат = Новый Массив;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплатуПокупателю.ДокументОснование КАК Документ
		|ПОМЕСТИТЬ ВТ_СвязанныеПервичныеДокументы
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.Ссылка = &СчетНаОплатуПокупателю
		|	И НЕ СчетНаОплатуПокупателю.ДокументОснование = Неопределено
		|    
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Документ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслугТовары.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслугАгентскиеУслуги.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|" + "&ЗапросТаблицАрендаНедвижимости" + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Документ
		|ИЗ
		|	ВТ_СвязанныеПервичныеДокументы КАК ВТ_ДокументыОснованияСчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО ВТ_ДокументыОснованияСчетов.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СвязанныеПервичныеДокументы.Документ
		|ИЗ
		|	ВТ_СвязанныеПервичныеДокументы КАК СвязанныеПервичныеДокументы";
	
	Если Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено Тогда
		
		ТекстЗапросаАрендаНедвижимости = "
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	НачАренднойПлатыСостав.Ссылка
			|ИЗ
			|	Документ.АР_НачислениеАренднойПлаты.Состав КАК НачАренднойПлатыСостав
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР_НачислениеАренднойПлаты КАК НачАренднойПлаты
			|		ПО НачАренднойПлатыСостав.Ссылка = НачАренднойПлаты.Ссылка
			|ГДЕ
			|	НачАренднойПлатыСостав.СчетНаАренду = &СчетНаОплатуПокупателю
			|	И НЕ НачАренднойПлаты.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	НачАренднойПлаты.Ссылка
			|ИЗ
			|	Документ.АР_НачислениеАренднойПлаты КАК НачАренднойПлаты
			|ГДЕ
			|	НачАренднойПлаты.ДокументОснование = &СчетНаОплатуПокупателю
			|	И НЕ НачАренднойПлаты.ПометкаУдаления"
			
		Иначе
			
			ТекстЗапросаАрендаНедвижимости = "";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗапросТаблицАрендаНедвижимости", ТекстЗапросаАрендаНедвижимости);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетНаОплатуПокупателю", СчетНаОплату);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СвязиПоДокументуПродажи(ДокументПродажи)
	
	Результат = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОснованияСФ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ОснованияСФ
	|ГДЕ
	|	ОснованияСФ.ДокументОснование = &ДокументПродажи
	|	И НЕ ОснованияСФ.Ссылка.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Результат = ТаблицаРезультата.ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Процедура Общее_ДополнитьМассив(МассивПриемник, МассивИсточник)
	
	ТолькоУникальныеЗначения = Истина;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		МассивПриемник,
		МассивИсточник,
		ТолькоУникальныеЗначения
	);
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - ссылки на связанные объекты
//
Функция СвязиДокументов_НайтиПоКритериюОтбора(Знач СсылкаНаОбъект, Знач ИсключаемыеТипы = Неопределено)
	
	Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	УсловиеИсключитьТипы = "ИСТИНА";
	
	Если ЗначениеЗаполнено(ИсключаемыеТипы) Тогда
		УсловиеИсключитьТипы = "НЕ ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) В(&ИсключаемыеТипы)";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
	|ГДЕ
	|	&УсловиеИсключитьТипы";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&УсловиеИсключитьТипы",
		УсловиеИсключитьТипы
	);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИсключаемыеТипы", ИсключаемыеТипы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ИсключаемыеТипыСвязей()
	
	Результат = Новый Массив;
	Результат.Добавить(Тип("ДокументСсылка.АктСверкиВзаиморасчетов"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетНаОплатуПокупателю(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетНаАренду(Документ)
	
	Результат = Ложь;
	
	Если Метаданные.Документы.Найти("АР_СчетНаАренду") <> Неопределено Тогда
		Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.АР_СчетНаАренду"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияТоваровУслуг(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	Возврат Результат;
	
КонецФункции 

Функция ЭтоОтгрузкаБезПереходаПраваСобственности(Документ)
	
	Результат = Ложь;
	
	Если НЕ ЭтоРеализацияТоваровУслуг(Документ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности");
	ВидОперацииДокумента = ЗначениеРеквизитаОбъектаЛок(Документ, "ВидОперации");
	
	Результат = (ВидОперацииДокумента = ВидОперации);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоАктСверкиВзаиморасчетов(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.АктСверкиВзаиморасчетов"));
	Возврат Результат;
	
КонецФункции 

Функция ЭтоДокументПродажи(Документ)
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияУслугПоПереработке"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПередачаОС"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	
	Если Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено Тогда
		МассивТипов.Добавить(Тип("ДокументСсылка.АР_НачислениеАренднойПлаты"));
	КонецЕсли;
	
	Результат = МассивТипов.Найти(ТипЗнч(Документ)) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции


Функция ЭтоНачислениеАренднойПлаты(Документ)
	
	Результат = Ложь;
	
	Если Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено Тогда
		Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.АР_НачислениеАренднойПлаты"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что документ является корректировочным документом.
// Корректировочный документ - это КРТУ с видом "Корректировка по согласованию сторон"
// или исправительный КРТУ на основании корректировочного документа.
//
// Параметры:
//  КРТУ - ДокументСсылка.КорректировкаРеализации - ссылка на проверяемый документ
// 
// Возвращаемое значение:
//  Булево - Истина, если это КРТУ на корректировку или исправление корректировки.
//
Функция ЭтоКорректировкаРеализации(КРТУ)
	
	Результат = Ложь;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Т.ВидОперации = &ВидОперацииКорректировка
	|				ИЛИ Т.ИсправляемыйДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", КРТУ);
	Запрос.УстановитьПараметр("ВидОперацииКорректировка", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЭтоКорректировка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправлениеРеализации(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации")
		И Не ЭтоКорректировкаРеализации(ДокументСсылка) Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
	
	Если НЕ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КоллекцияОснований = ДокументыОснованияСчетаФактуры(ДокументУчета);
	
КонецПроцедуры

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	ДокументыКонфигурации = Метаданные.Документы;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументыКонфигурации.АктСверкиВзаиморасчетов);
	Результат.Добавить(ДокументыКонфигурации.ПередачаОС);
	Результат.Добавить(ДокументыКонфигурации.СчетФактураВыданный);
	Результат.Добавить(ДокументыКонфигурации.КорректировкаРеализации);
	Результат.Добавить(ДокументыКонфигурации.АктОбОказанииПроизводственныхУслуг);
	Результат.Добавить(ДокументыКонфигурации.ОказаниеУслуг);
	Результат.Добавить(ДокументыКонфигурации.ВозвратТоваровОтПокупателя);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомиссионераОПродажах);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомитентуОПродажах);
	Результат.Добавить(ДокументыКонфигурации.РеализацияУслугПоПереработке);
	Результат.Добавить(ДокументыКонфигурации.РеализацияТоваровУслуг);
	Результат.Добавить(ДокументыКонфигурации.ВозвратТоваровПоставщику);
	Результат.Добавить(ДокументыКонфигурации.РеализацияОтгруженныхТоваров);
	Результат.Добавить(ДокументыКонфигурации.СчетНаОплатуПокупателю);
	
	Если ЭтоАрендаИУправлениеНедвижимостью() Тогда
		Результат.Добавить(ДокументыКонфигурации.АР_СчетНаАренду);
		Результат.Добавить(ДокументыКонфигурации.АР_НачислениеАренднойПлаты);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Представление ставки НДС
// 
// Возвращаемое значение:
//  ПеречислениеСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = ПредставлениеСтавкиБезНДС();
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - ПеречислениеСсылка - Прикладное значение ставки НДС
//  НДСИсчисляетсяНалоговымАгентом - Булево - Истина, если НДС исчисляется налоговым агентом
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки, НДСИсчисляетсяНалоговымАгентом = Ложь) Экспорт
	
	Если НДСИсчисляетсяНалоговымАгентом Тогда
		
		Результат = СтавкаНДСИсчисляетсяНалоговымАгентом();
		
	Иначе
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "##";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("0", Перечисления.СтавкиНДС.НДС0);
	Результат.Вставить("10", Перечисления.СтавкиНДС.НДС10);
	Результат.Вставить("18", Перечисления.СтавкиНДС.НДС18);
	Результат.Вставить("20", Перечисления.СтавкиНДС.НДС20);
	Результат.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
	Результат.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
	Результат.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
	Результат.Вставить(ПредставлениеСтавкиБезНДС(), Перечисления.СтавкиНДС.БезНДС);
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентом(), СтавкаНДСИсчисляетсяНалоговымАгентомПредставление());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить("5", Перечисления.СтавкиНДС.НДС5);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить("7", Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить("22", Перечисления.СтавкиНДС.НДС22);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
	КонецЕсли;
	
	Результат.Вставить(Перечисления.СтавкиНДС.НДС0, "0");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10, "10");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18, "18");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20, "20");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
	Результат.Вставить(Перечисления.СтавкиНДС.БезНДС, ПредставлениеСтавкиБезНДС());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетЗначениеПеречисленияСтавкиНДС(ИмяЗначенияСтавкаНДС)
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	Результат = (ЗначенияПеречисления.Найти(ИмяЗначенияСтавкаНДС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ВнутренниеПеремещения_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы, ДокументОтгрузки)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	ЗаполнитьЗначенияСвойств(Результат, СтрокаТаблицы);
	
	Результат.Упаковка = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Упаковка");
	Результат.ЕдиницаИзмерения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "ЕдиницаИзмерения");
	Результат.Номенклатура = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Номенклатура");
	Результат.Характеристика = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Характеристика");
	Результат.Серия = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Серия");
	Результат.СтранаПроисхождения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "СтранаПроисхождения");
	Результат.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавкиБезНДС());
	
	Если Не ЗначениеЗаполнено(Результат.ПрослеживаемыйТовар) Тогда
		Результат.ПрослеживаемыйТовар = Ложь;
	КонецЕсли;
	
	Результат.ДокументОтгрузки = ДокументОтгрузки;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяТабЧастьДокументыОбОтгрузкеДляСФ()
	
	ВерсияОпределена = Истина;
	
	Попытка
		ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Исключение
		ВерсияОпределена = Ложь;
	КонецПопытки;
	
	Результат = Ложь;
	
	Если ВерсияОпределена Тогда
		Результат = (СравнитьВерсии_(ВерсияБП, "3.0.100.16") >= 0);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьCustomDeclaration(Item, НомерГТД, КодСтраныПроисхождения)
	
	Если Не ЗначениеЗаполнено(НомерГТД)
		Или Не ЗначениеЗаполнено(КодСтраныПроисхождения) Тогда
		Возврат;
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = КодСтраныПроисхождения;
	CustomDeclaration.DeclarationNumber = СокрЛП(НомерГТД);
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

// Получает реквизиты юридического или физического лица для формата 970@
//
// Параметры:
//  ЮрФизЛицо - СправочникСсылка.Организации, СправочникСсылка.Контрагенты, СправочникСсылка.ПодразделенияОрганизаций - юридическое или физическое лицо
//  ДатаСведений - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет - СправочникСсылка.БанковскиеСчета - (необязательный) банковский счет юридического или физического лица.
//                                                      Если не передан, будут включены реквизиты основного банковского счета.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - содержит поля:
//    * ТипЮрФизЛица - Строка - тип юридического или физического лица (см. ГенерацияXML_Перечисление_ВидыЮрФизЛиц)
//    * НаименованиеПолное - Строка - наименование для печатных форм (для ОП - наименование головного юр. лица)
//    * НаименованиеПодразделения - Строка - наименование обособленного подразделения (если не ОП, совпадает с наименованием юр./физ. лица)
//    * НалоговыйНомерВСтранеРегистрации - Строка - налоговый номер в стране регистрации
//    * ИНН - Строка - ИНН юридического или физического лица
//    * КПП - Строка - КПП юридического лица
//    * КодПоОКПО - Строка - Код по ОКПО
//    * ОГРН - Строка - ОГРН, ОГРНИП или рег. номер для иностранных контрагентов
//    * ДатаРегистрации - Дата - дата государственной регистрации
//    * Свидетельство - Строка - реквизиты свидетельства о государственной регистрации ИП
//    * СтранаРегистрацииКод - Строка - код страны регистрации
//    * СтранаРегистрацииНаименование - Строка - наименование страны регистрации
//    * БИК - Строка - банковский идентификационный код
//    * Банк - Строка - наименование банка
//    * КоррСчет - Строка - корреспондентский счет банка
//    * НомерСчета - Строка - номер банковского счета юридического или физического лица
//    * Телефоны - Строка - номера телефонов юридического или физического лица
//    * Email - Строка - адрес электронной почты юридического или физического лица
//    * ЮридическийАдрес - Строка - юридический адрес
//    * ЮридическийАдресJSON - Строка - JSON со значениями полей юридического адреса
//    * ФактическийАдрес - Строка - фактический адрес
//    * ФактическийАдресJSON - Строка - JSON со значениями полей фактического адреса
//
Функция УПД970_ДанныеЮрФизЛица(ЮрФизЛицо, ДатаСведений, Знач БанковскийСчет = Неопределено)
	
	МодульОбменСКонтрагентамиБП = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиБП");
	Данные = МодульОбменСКонтрагентамиБП.ПолучитьДанныеЮрФизЛица(ЮрФизЛицо, ДатаСведений, БанковскийСчет);
	
	Если Не Данные.Свойство("ЭтоИндивидуальныйПредприниматель") Тогда
		// Совместимость с БП 3.0.142 и ниже
		Данные.Вставить("ЭтоИндивидуальныйПредприниматель", Ложь);
		Если Данные.ТипЮрФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Данные.ЭтоИндивидуальныйПредприниматель = ЭтоИндивидуальныйПредприниматель(ЮрФизЛицо);
		КонецЕсли;
	КонецЕсли;
	
	Модель = Новый Структура;
	Модель.Вставить("ТипЮрФизЛица", "");
	Модель.Вставить("НаименованиеПолное", "");
	Модель.Вставить("НаименованиеПодразделения", "");
	Модель.Вставить("ИНН", "");
	Модель.Вставить("КПП", "");
	Модель.Вставить("КодПоОКПО", "");
	Модель.Вставить("ОГРН", "");
	Модель.Вставить("ДатаРегистрации", Дата(1, 1, 1));
	Модель.Вставить("Свидетельство", "");
	Модель.Вставить("СтранаРегистрацииКод", "");
	Модель.Вставить("СтранаРегистрацииНаименование", "");
	Модель.Вставить("НалоговыйНомерВСтранеРегистрации", "");
	Модель.Вставить("ИныеСведения", "");
	
	Модель.Вставить("НомерСчета", "");
	Модель.Вставить("БИК", "");
	Модель.Вставить("Банк", "");
	Модель.Вставить("КоррСчет", "");
	
	Модель.Вставить("Телефоны", "");
	Модель.Вставить("Email", "");
	
	Модель.Вставить("ЮридическийАдрес", "");
	Модель.Вставить("ЮридическийАдресJSON", "");
	Модель.Вставить("ФактическийАдрес", "");
	Модель.Вставить("ФактическийАдресJSON", "");
	
	ЭтоРоссийскоеЮрФизЛицо = (Данные.СтранаРегистрации = Справочники.СтраныМира.Россия);
	ЭтоЮридическоеЛицо = (Данные.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	ВидыЮрФизЛицПрото = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	Если ЭтоРоссийскоеЮрФизЛицо Тогда
		
		Если ЭтоЮридическоеЛицо Тогда
			ТипЮрФизЛица = ВидыЮрФизЛицПрото.ЮридическоеЛицо;
		ИначеЕсли Данные.ЭтоИндивидуальныйПредприниматель Тогда
			ТипЮрФизЛица = ВидыЮрФизЛицПрото.ИндивидуальныйПредприниматель;
		Иначе
			ТипЮрФизЛица = ВидыЮрФизЛицПрото.ФизическоеЛицо;
		КонецЕсли;
		
	Иначе
		
		Если ЭтоЮридическоеЛицо Тогда
			ТипЮрФизЛица = ВидыЮрФизЛицПрото.ИностраннаяОрганизация;
		Иначе
			ТипЮрФизЛица = ВидыЮрФизЛицПрото.ИностранныйГражданин;
		КонецЕсли;
		
		Модель.ИныеСведения = СокрЛП(Данные.ОГРН);
		
	КонецЕсли;
	
	Если Данные.ЭтоИндивидуальныйПредприниматель
		И ЗначениеЗаполнено(Данные.ИндивидуальныйПредприниматель) Тогда
		НаименованиеПолное = Данные.ФИОФизЛица;
	Иначе
		НаименованиеПолное = Данные.НаименованиеДляПечатныхФорм;
	КонецЕсли;
	
	Модель.ТипЮрФизЛица = ТипЮрФизЛица;
	Модель.НаименованиеПолное = СокрЛП(НаименованиеПолное);
	Модель.НаименованиеПодразделения = СокрЛП(Данные.ПолноеНаименование);
	Модель.ИНН = СокрЛП(Данные.ИНН);
	Модель.КПП = СокрЛП(Данные.КПП);
	Модель.ОГРН = СокрЛП(Данные.ОГРН);
	Модель.КодПоОКПО = СокрЛП(Данные.КодПоОКПО);
	Модель.ДатаРегистрации = Данные.ДатаРегистрации;
	Модель.Свидетельство = СокрЛП(Данные.Свидетельство);
	
	Модель.НалоговыйНомерВСтранеРегистрации = СокрЛП(Данные.НалоговыйНомерВСтранеРегистрации);
	Если ЗначениеЗаполнено(Данные.СтранаРегистрации) Тогда
		РеквизитыСтраны = ЗначенияРеквизитовОбъектаЛок(Данные.СтранаРегистрации, "Код, Наименование");
		Модель.СтранаРегистрацииКод = РеквизитыСтраны.Код;
		Модель.СтранаРегистрацииНаименование = РеквизитыСтраны.Наименование;
	КонецЕсли;
	
	Модель.БИК = СокрЛП(Данные.БИК);
	Модель.Банк = СокрЛП(Данные.Банк);
	Модель.КоррСчет = СокрЛП(Данные.КоррСчет);
	Модель.НомерСчета = СокрЛП(Данные.НомерСчета);
	
	Модель.Телефоны = СокрЛП(Данные.Телефоны);
	Модель.Email = СокрЛП(Данные.Email);
	
	Модель.ЮридическийАдрес = СокрЛП(Данные.ЮридическийАдрес);
	Модель.ЮридическийАдресJSON = Данные.ЗначениеJSONЮридическийАдрес;
	Модель.ФактическийАдрес = СокрЛП(Данные.ФактическийАдрес);
	Модель.ФактическийАдресJSON = Данные.ЗначениеJSONФактическийАдрес;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция ГенерацияXML_Перечисление_ВидыЮрФизЛиц()
	
	Результат = ГенерацияXML.Перечисление_ВидыЮрФизЛиц();
	Возврат Результат;
	
КонецФункции

Функция ГенерацияXML_ФункцииУПД()
	Результат = ГенерацияXML.Перечисление_ФункцииУПД();
	Возврат Результат;	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом()
	
	Возврат "ИсчНалАг";
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентомПредставление()
	
	Возврат "НДС исчисляется налоговым агентом";
	
КонецФункции

Функция ВестиУчетПоДоговорам()
	
	Значение = ПолучитьФункциональнуюОпцию("ВестиУчетПоДоговорам");
	
	Результат = (Значение = Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	Возврат "без НДС";
КонецФункции

Функция ПолучитьВидДоговораПоДокументу(Знач ДокСсылка)
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ДокСсылка) Тогда
		Возврат Результат;
	КонецЕсли;
		
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ДокСсылка = ДокументОснованиеСчетаФактурыВыданный(ДокСсылка);
	КонецЕсли; 
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", ДокСсылка.Метаданные()) Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "ДоговорКонтрагента.ВидДоговора");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораНаКомиссионнуюТорговлю(ВидДоговора)
	
	Результат = Ложь;

	Если ВидДоговора <> Неопределено Тогда
				
		Результат = (ЭтоВидДоговораСКомитентом(ВидДоговора) Или ЭтоВидДоговораСКомиссионером(ВидДоговора));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораСКомитентом(ВидДоговора)
	
	Результат = Ложь;

	Если ВидДоговора <> Неопределено Тогда
				
		Результат = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
			Или ЭтоВидДоговораСКомитентомНаЗакупку(ВидДоговора));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораСКомиссионером(ВидДоговора)
	
	Результат = Ложь;

	Если ВидДоговора <> Неопределено Тогда
				
		Результат = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
			Или ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументОснованиеСчетаФактурыВыданный(СчетФактура)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка = &СчетФактура");
	Запрос.Параметры.Вставить("СчетФактура", СчетФактура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.ДокументОснование
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураВыданныйНаАванс(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ЭтоСчетФактураВыданный(ДокументСсылка) Тогда
		
		ВидСчетаФактуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВидСчетаФактуры");
		
		Результат = ЭтоВидСчетаФактурыНаАванс(ВидСчетаФактуры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураВыданный(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидСчетаФактурыНаАванс(ВидСчетаФактуры)
	
	Результат = (ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку);
		
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураСоставленныйАгентом(СсылкаНаОбъект)
	
	Если Не ЭтоСчетФактураВыданный(СсылкаНаОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("ДокументОснование");
	ТребуемыеРеквизиты.Вставить("ВидДоговора", "ДоговорКонтрагента.ВидДоговора");
	// Реквизит заполняется в СФ по отчетам комитенту при выключенном флаге СчетаФактурыОтИмениОрганизации
	ТребуемыеРеквизиты.Вставить("СоставленОтИмени", "Продавец");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, ТребуемыеРеквизиты);
	
	Результат = Ложь;
	
	Если ТипЗнч(ЗначенияРеквизитов.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		ЭтоДоговорНаЗакупку = (ЗначенияРеквизитов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
		СоставленОтИмениПродавца = ЗначениеЗаполнено(ЗначенияРеквизитов.СоставленОтИмени);
		Результат = (ЭтоДоговорНаЗакупку И СоставленОтИмениПродавца);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураОтНесколькихПродавцов(СчетФактура)
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("СводныйКомиссионный");
	ТребуемыеРеквизиты.Вставить("ОтИмениОрганизации", "ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛок(СчетФактура, ТребуемыеРеквизиты);
	
	Результат = Ложь;
	Если ЗначенияРеквизитов.СводныйКомиссионный Тогда
		Результат = Не ЗначенияРеквизитов.ОтИмениОрганизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОтчетКомитентуОЗакупках(Документ)

	Результат = Ложь;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		ВидОперацииДокумента = ЗначениеРеквизитаОбъектаЛок(Документ, "ВидОперации");
		ВидОперацииЗакупка = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках");
		
		Результат = (ВидОперацииДокумента = ВидОперацииЗакупка);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураПеревыставленный(СчетФактура)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Поставщики.Ссылка КАК Ссылка,
	|	Поставщики.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ ВТ_КлючиСтрок
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ОснованияСФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Поставщики КАК Поставщики
	|		ПО ОснованияСФ.ДокументОснование = Поставщики.Ссылка
	|ГДЕ
	|	ОснованияСФ.Ссылка = &Ссылка
	|	И Поставщики.СчетФактура = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ТоварыУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСтрок КАК ВТ_КлючиСтрок
	|		ПО ТоварыУслуги.Ссылка = ВТ_КлючиСтрок.Ссылка
	|			И ТоварыУслуги.КлючСтроки = ВТ_КлючиСтрок.КлючСтроки
	|ГДЕ
	|	НЕ ЕСТЬNULL(ТоварыУслуги.Номенклатура.Услуга, ИСТИНА)");
	
	Запрос.УстановитьПараметр("Ссылка", СчетФактура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПоставщикиИзОтчетаКомитенту(СчетФактура)
	
	ОтчетКомитенту = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "ДокументОснование");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧПоставщики.Поставщик КАК Поставщик
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|ГДЕ
	|	ТЧПоставщики.Ссылка = &ОтчетКомитенту
	|	И ТЧПоставщики.СчетФактура = &СчетФактура";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ОтчетКомитенту", ОтчетКомитенту);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Поставщик) Тогда
			Результат.Добавить(Выборка.Поставщик);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ГрузоотправителиИзОтчетаКомитенту(СчетФактура)
	
	ОтчетКомитенту = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "ДокументОснование");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ТЧПоставщики.Партия КАК Документ.ПоступлениеТоваровУслуг).Грузоотправитель КАК Грузоотправитель
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|ГДЕ
	|	ТЧПоставщики.Ссылка = &ОтчетКомитенту
	|	И ТЧПоставщики.СчетФактура = &СчетФактура";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ОтчетКомитенту", ОтчетКомитенту);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Грузоотправитель) Тогда
			Результат.Добавить(Выборка.Грузоотправитель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ГрузополучателиИзОтчетаКомитенту(СчетФактура)
	
	ОтчетКомитенту = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "ДокументОснование");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ТЧПоставщики.Партия КАК Документ.ПоступлениеТоваровУслуг).Грузополучатель КАК Грузополучатель
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|ГДЕ
	|	ТЧПоставщики.Ссылка = &ОтчетКомитенту
	|	И ТЧПоставщики.СчетФактура = &СчетФактура";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ОтчетКомитенту", ОтчетКомитенту);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
			Результат.Добавить(Выборка.Грузополучатель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПокупателиИзОтчетаКомиссионера(СчетФактура)
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Покупатель
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
		|ГДЕ
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура
		|	И ОтчетКомиссионераОПродажахПокупатели.Ссылка.ВыписыватьСчетаФактурыСводно";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Покупатель) Тогда
			Результат.Добавить(Выборка.Покупатель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ГрузополучателиИзОтчетаКомиссионера(СчетФактура)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ТЧПокупатели.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТЧПокупатели.Ссылка.Грузополучатель
	|		ИНАЧЕ ТЧПокупатели.Покупатель
	|	КОНЕЦ КАК Грузополучатель
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ТЧПокупатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Товары КАК ТЧТовары
	|		ПО ТЧПокупатели.Ссылка = ТЧТовары.Ссылка
	|			И ТЧПокупатели.КлючСтроки = ТЧТовары.КлючСтроки
	|ГДЕ
	|	НЕ ТЧПокупатели.Ссылка.ПометкаУдаления
	|	И ТЧПокупатели.СчетФактура = &СчетФактура
	|	И ТЧПокупатели.Ссылка.ВыписыватьСчетаФактурыСводно";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
			Результат.Добавить(Выборка.Грузополучатель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПередачаТоваровМеждуСотрудниками(ДокументСсылка)
	
	ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВидОперации");
	
	Результат = (ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ПередачаМеждуСотрудниками);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИндивидуальныйПредприниматель(ЮрФизЛицо)
	
	ТипПараметра = ТипЗнч(ЮрФизЛицо);
	
	Результат = Ложь;
	
	Если ТипПараметра = Тип("СправочникСсылка.Организации") Тогда
		
		СтатусФЛ = ЗначениеРеквизитаОбъектаЛок(ЮрФизЛицо, "СтатусФизическогоЛица");
		Результат = (СтатусФЛ = Перечисления.СтатусыФизическихЛиц.ИндивидуальныйПредприниматель);
		
	ИначеЕсли ТипПараметра = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ОбъектМД = Метаданные.Справочники.Контрагенты;
		
		Если ЕстьРеквизитОбъектаЛок("ИндивидуальныйПредприниматель", ОбъектМД) Тогда
			
			Результат = ЗначениеРеквизитаОбъектаЛок(ЮрФизЛицо, "ИндивидуальныйПредприниматель");
			
		ИначеЕсли ЕстьРеквизитОбъектаЛок("Самозанятый", ОбъектМД) Тогда
			
			РеквизитыФЛ = ЗначенияРеквизитовОбъектаЛок(ЮрФизЛицо, "Самозанятый, ИНН");
			Результат = ЗначениеЗаполнено(РеквизитыФЛ.ИНН) И Не РеквизитыФЛ.Самозанятый;
			
		Иначе
			
			Ошибка = СтрШаблон("ЭтоИндивидуальныйПредприниматель: Не удалось определить признак ИП (контрагент = %1)", ЮрФизЛицо);
			ВызватьИсключение Ошибка;
			
		КонецЕсли;
		
	Иначе
		
		Ошибка = СтрШаблон("ЭтоИндивидуальныйПредприниматель: Неожиданный тип параметра ""ЮрФизЛицо"" (тип = %1)", ТипПараметра);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ


//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция КорректировкаРеализацииБезНДС(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ДокументСсылка", ДокументСсылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|	
	|ГДЕ
	|	КорректировкаРеализацииТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И КорректировкаРеализацииТовары.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииУслуги.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|	
	|ГДЕ
	|	КорректировкаРеализацииУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И КорректировкаРеализацииУслуги.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииАгентскиеУслуги.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	|	
	|ГДЕ
	|	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И КорректировкаРеализацииАгентскиеУслуги.Ссылка = &ДокументСсылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Результат = РезультатЗапроса.Количество() = 0;
	
	Возврат Результат;
	
КонецФункции

Функция СчетНаОплатуПокупателюБезНДС(Счет)
	
	ПолноеИмяТабличнойЧасти = "Документ.СчетНаОплатуПокупателю.Товары";
	Если ЭтоСчетНаАренду(Счет) Тогда
		ПолноеИмяТабличнойЧасти = "Документ.АР_СчетНаАренду.Состав";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС(ПолноеИмяТабличнойЧасти);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("ДокументСсылка", Счет);
	
	Результат = Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция РеализацияТоваровУслугБезНДС(РТУ)
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(
		ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС("Документ.РеализацияТоваровУслуг.Товары")
	);
	ЧастиЗапроса.Добавить(
		ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС("Документ.РеализацияТоваровУслуг.Услуги")
	);
	ЧастиЗапроса.Добавить(
		ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС("Документ.РеализацияТоваровУслуг.АгентскиеУслуги")
	);
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, ТекстЗапроса_ОбъединитьВсе());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("ДокументСсылка", РТУ);
	
	Результат = Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция РеализацияУслугПоПереработкеБезНДС(ДокументПродажи)
	
	ПолноеИмяТабличнойЧасти = "Документ.РеализацияУслугПоПереработке.Услуги";
	ТекстЗапроса = ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС(ПолноеИмяТабличнойЧасти);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("ДокументСсылка", ДокументПродажи);
	
	Результат = Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция НачислениеАренднойПлатыБезНДС(ДокументПродажи)
	
	ПолноеИмяТабличнойЧасти = "Документ.АР_НачислениеАренднойПлаты.Состав";
	ТекстЗапроса = ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС(ПолноеИмяТабличнойЧасти);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("ДокументСсылка", ДокументПродажи);
	
	Результат = Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция АктОбОказанииПроизводственныхУслугБезНДС(ДокументПродажи)
	
	ПолноеИмяТабличнойЧасти = "Документ.АктОбОказанииПроизводственныхУслуг.Услуги";
	ТекстЗапроса = ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС(ПолноеИмяТабличнойЧасти);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("ДокументСсылка", ДокументПродажи);
	
	Результат = Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция ПередачаОсновныхСредствБезНДС(ДокументПродажи)
	
	ПолноеИмяТабличнойЧасти = "Документ.ПередачаОС.ОС";
	ТекстЗапроса = ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС(ПолноеИмяТабличнойЧасти);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("ДокументСсылка", ДокументПродажи);
	
	Результат = Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаЕстьСтрокиТабличнойЧастиСНДС(ПолноеИмяТЧ)
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТабличнаяЧасть.Ссылка КАК Ссылка
	|ИЗ
	|	&ПолноеИмяТабличнойЧасти КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ТабличнаяЧасть.Ссылка = &ДокументСсылка";
	
	Результат = СтрЗаменить(
		ШаблонТекстаЗапроса,
		"&ПолноеИмяТабличнойЧасти",
		ПолноеИмяТЧ
	);
	
	Возврат Результат;
	
КонецФункции

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма            - Число - сумма от которой надо рассчитывать налоги;
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму ("внутри" или "сверху");
//  СтавкаНДС        - Перечисление.СтавкиНДС - процентная ставка НДС.
//
// Возвращаемое значение:
//  Число - полученная сумма НДС.
//
Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС)
	
	Результат = 0;
	СтавкаНДСЧислом = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС);
	Результат = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДСЧислом);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаБезСчетаФактуры(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ТОРГ12_Акт_БезНДС");
	ВидыПакетов.Добавить("ID_УПД_БезНДС");
	ВидыПакетов.Добавить("ID_ИУПД_БезНДС");
	ВидыПакетов.Добавить("ID_УКД_БезНДС");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправительныйВидПакета(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ИУПД");
	ВидыПакетов.Добавить("ID_ИУПД_раздельно");
	ВидыПакетов.Добавить("ID_ИСФ");
	ВидыПакетов.Добавить("ID_ИУКД");
	ВидыПакетов.Добавить("ID_ИУКД_раздельно");
	ВидыПакетов.Добавить("ID_ИКСФ");
	ВидыПакетов.Добавить("ID_ИУПД_НаАванс");
	ВидыПакетов.Добавить("ID_ИСФ_НаАванс");
	ВидыПакетов.Добавить("ID_ИУПД_БезНДС");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяНоменклатураКонтрагентовБЭД()
	
	Результат = Истина;
	
	Если Метаданные.РегистрыСведений.Найти("НоменклатураКонтрагентовБЭД") = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	Если ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		
		МетаданныеНоменклатурыКонтрагентов = Метаданные.РегистрыСведений.НоменклатураКонтрагентовБЭД;
		
		ВладелецТип = Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип;
		
		НоменклатураТип = Новый_ТипНоменклатурыБЭДДляСопоставления(Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип);
		
		УпаковкаТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Упаковка.Тип; 
		НаименованиеТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Артикул.Тип;
		КодТип = АртикулТип; // поля "Код" в регистре нет
		
	Иначе
		
		МетаданныеНоменклатурыПоставщиков = Метаданные.Справочники.НоменклатураПоставщиков;
		
		ВладелецТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Владелец.Тип;
		
		НоменклатураТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Номенклатура.Тип;
		
		УпаковкаТип = Неопределено;
		НаименованиеТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Артикул.Тип;
		КодТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Идентификатор.Тип;
		
	КонецЕсли;
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	Если НЕ УпаковкаТип = Неопределено Тогда
		Результат.Колонки.Добавить("Упаковка"           , УпаковкаТип);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ТипНоменклатурыБЭДДляСопоставления(ОписаниеТипаНоменклатураБЭД)
	
	Результат = ОписаниеТипаНоменклатураБЭД;
	
	ИмяОбъектаМетаданных = "Справочник.Номенклатура";
	Если Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданных) <> Неопределено Тогда
		
		ИмяТипа			 = "СправочникСсылка.Номенклатура";
		ТипНоменклатура	 = Тип(ИмяТипа);
		
		Если ОписаниеТипаНоменклатураБЭД.СодержитТип(ТипНоменклатура) Тогда
			Результат = Новый ОписаниеТипов(ИмяТипа);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, НоменклатураКонтрагента)
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент				= Контрагент;
	НоваяСтрока.Наименование			= НоменклатураКонтрагента.Наименование;
	НоваяСтрока.Код						= НоменклатураКонтрагента.Код;
	НоваяСтрока.Артикул					= НоменклатураКонтрагента.Артикул;
	НоваяСтрока.НоменклатураКонтрагента = НоменклатураКонтрагента;
	
КонецПроцедуры

Функция ПолучитьРеквизитыПодписантаПоОрганизации1С(Организация, Дата, ВызыватьИсключение = Истина)
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Должность", "", "", "", "");
	
	ОтвЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, Дата);
	
	Если ТипЗнч(ОтвЛица.РуководительФИО) = Тип("Структура") Тогда
		
		// Свежие БП
	
		ЗаполнитьЗначенияСвойств(Результат, ОтвЛица.РуководительФИО);
	
	Иначе
		
		// Старые БП
		ФИО = ОсновнойМодуль.ЭДО_Служебные_РазложитьСтрокуВМассивСлов(ОтвЛица.РуководительФИО, " ");
		
		Если ФИО.Количество() >= 3 Тогда
			
			Результат.Фамилия 	= ФИО[0];
			Результат.Имя 		= ФИО[1];
			Результат.Отчество 	= ФИО[2];
			
		ИначеЕсли ВызыватьИсключение Тогда
			
			ВызватьИсключение "Отсутствует ФИО руководителя организации " + Организация;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Должность = ОтвЛица.РуководительДолжностьПредставление;
		
	Возврат Результат;
	
КонецФункции

// Возвращает строку с ФИО подписанта по реквизитам организации
//
// Параметры:
//  РеквизитыПодписанта - Структура - см. ПолучитьРеквизитыПодписантаПоОрганизации1С()
//  ЗначениеПоУмолчанию - Строка - Значение ФИО по умолчанию
// 
// Возвращаемое значение:
//  Строка - ФИО подписанта из структуры РеквизитыОрганизации
//
Функция ФИОПодписантаПоРеквизитамПодписантаОрганизации(РеквизитыПодписанта, ЗначениеПоУмолчанию)
	
	ЧастиФИО = Новый Массив;
	Если РеквизитыПодписанта.Фамилия <> "" Тогда
		ЧастиФИО.Добавить(РеквизитыПодписанта.Фамилия);
	КонецЕсли;
	Если РеквизитыПодписанта.Имя <> "" Тогда
		ЧастиФИО.Добавить(РеквизитыПодписанта.Имя);
	КонецЕсли;
	Если РеквизитыПодписанта.Отчество <> "" Тогда
		ЧастиФИО.Добавить(РеквизитыПодписанта.Отчество);
	КонецЕсли;
	
	Результат = СтрСоединить(ЧастиФИО, " ");
	
	Если Результат = "" Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеТоваровУслуг" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Организация В (&Организация)
		|	И ПоступлениеТоваровУслуг.Контрагент В (&Контрагент)
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерДокумента";
	
	ИначеЕсли ВидДокумента1С = "ПоступлениеДопРасходов" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеДопРасходов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	НЕ ПоступлениеДопРасходов.ПометкаУдаления
		|	И ПоступлениеДопРасходов.Организация В (&Организация)
		|	И ПоступлениеДопРасходов.Контрагент В (&Контрагент)
		|	И ПоступлениеДопРасходов.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеДопРасходов.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "КорректировкаПоступления" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаПоступления.Ссылка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|ГДЕ
		|	НЕ КорректировкаПоступления.ПометкаУдаления
		|	И КорректировкаПоступления.Организация В (&Организация)
		|	И КорректировкаПоступления.Контрагент В (&Контрагент)
		|	И КорректировкаПоступления.ДатаВходящегоДокумента = &ДатаДокумента
		|	И КорректировкаПоступления.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация В (&Организация)
		|	И СчетФактураПолученный.Контрагент В (&Контрагент)
		|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетФактураПолученный.НомерВходящегоДокумента = &НомерДокумента";
		
		Если ПараметрыОтбора.Свойство("ВидСчетаФактуры") Тогда
			ДополнительноеУсловие = " И СчетФактураПолученный.ВидСчетаФактуры = &ВидСчетаФактуры";
			Запрос.Текст = Запрос.Текст + ДополнительноеУсловие;
		КонецЕсли;
		
	ИначеЕсли ВидДокумента1С = "СчетНаОплатуПоставщика" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплатуПоставщика.Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	НЕ СчетНаОплатуПоставщика.ПометкаУдаления
		|	И СчетНаОплатуПоставщика.Организация В (&Организация)
		|	И СчетНаОплатуПоставщика.Контрагент В (&Контрагент)
		|	И СчетНаОплатуПоставщика.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетНаОплатуПоставщика.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "АктОРасхожденияхПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктОРасхожденияхПолученный.Ссылка
		|ИЗ
		|	Документ.АктОРасхожденияхПолученный КАК АктОРасхожденияхПолученный
		|ГДЕ
		|	НЕ АктОРасхожденияхПолученный.ПометкаУдаления
		|	И АктОРасхожденияхПолученный.Организация В (&Организация)
		|	И АктОРасхожденияхПолученный.Контрагент В (&Контрагент)
		|	И АктОРасхожденияхПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И АктОРасхожденияхПолученный.НомерВходящегоДокумента = &НомерДокумента";
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_ПоступлениеТоваровУслуг();
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_КорректировкаПоступления();
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_СчетФактураПолученный();
		
	ИначеЕсли ОсновнойМодуль.ЭтоАктОРасхождениях(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_АктОРасхожденияхПолученный();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторОперации_ПоступлениеТоваровУслуг()
	Возврат "ПоступлениеТоваровУслуг";
КонецФункции

Функция ИдентификаторОперации_КорректировкаПоступления()
	Возврат "КорректировкаПоступления";
КонецФункции

Функция ИдентификаторОперации_СчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

Функция ИдентификаторОперации_АктОРасхожденияхПолученный()
	Возврат "АктОРасхожденияхПолученный";
КонецФункции

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия)
	
	Если ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭД = ПараметрыСобытия.Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
КонецПроцедуры

Функция ПроверкаДокументаОснования(Документ, ВыбранныйВид)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Если ВыбранныйВид = "КорректировкаПоступления" Тогда
		
		ТипДокумента		= Документ.Тип.ТипДокумента;
		ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
		Контент				= Документ.Документооборот.ХранилищеКонтента;
		ДвоичныеДанные		= Контент.Данные;
		ДеревоКонтента		= ОсновнойМодуль.XML_В_XDTO(ДвоичныеДанные);
		
		НомерДатаСФ = Неопределено;		
		
		Если ТипДокумента = "UniversalCorrectionDocument" Тогда
			
			НомерДатаСФ = ДеревоКонтента.Документ.СвКСчФ.СчФ;
		
			Если ТипЗнч(НомерДатаСФ) = Тип("СписокXDTO") Тогда
				
				НомерДатаСФ = Неопределено;
				
				Результат.ОписаниеОшибки = "Создание корректировки по нескольким документам-оснований недоступно. Вы можете вручную создать документ в 1С и сопоставить его с текущим документом";
				
			КонецЕсли;
			
		ИначеЕсли ТипДокумента = "UniversalTransferDocumentRevision" Тогда
			
			НомерДатаСФ = ДеревоКонтента.Документ.СвСчФакт;
			
		КонецЕсли;	
		
		Если НомерДатаСФ <> Неопределено Тогда
			
			Если Документ.Тип.ТипКонтента = ТипКонтентаUtd970() Тогда
				НомерОснования = НомерДатаСФ.НомерДок;
				ДатаОснования = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаСФ.ДатаДок);
			Иначе
				НомерОснования = НомерДатаСФ.НомерСчФ;
				ДатаОснования = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаСФ.ДатаСчФ);
            КонецЕсли;

			ДокументОснование = Неопределено;
			
			Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(
					Документ.Получатель.ОрганизацияЭДО, 
					Документ.Получатель.BoxId);
			СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
			
			Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(
					Документ.Отправитель.ОрганизацияЭДО, 
					Документ.Отправитель.BoxId);
			СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Организация", СопоставленныеОрганизации1С);
			ПараметрыОтбора.Вставить("Контрагент",	СопоставленныеКонтрагенты1С);
			ПараметрыОтбора.Вставить("ДатаДокумента",	ДатаОснования);
			ПараметрыОтбора.Вставить("НомерДокумента",	НомерОснования);
			
			Если ФункцияДокумента = "InvoiceAndBasic" Тогда
				
				ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
				
				Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 
					И ДокументыОснования1С[0].ДокументыОснования.Количество() = 1 Тогда
					ДокументОснование = ДокументыОснования1С[0].ДокументыОснования[0].ДокументОснование;
				КонецЕсли;
				
			ИначеЕсли ФункцияДокумента = "Basic" Тогда
				
				ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
				
				Если ДокументыОснования1С = Неопределено Тогда
					ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
				КонецЕсли;
				
				Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
					ДокументОснование = ДокументыОснования1С[0];
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДокументОснование = Неопределено Тогда
				
				СоздаватьСчетаФактуры = ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СоздаватьСчетаФактуры;
								
				Результат.ОписаниеОшибки = "Для корректировки не найден документ-основание №" + НомерОснования + " от " + Формат(ДатаОснования, "ДФ=dd.MM.yyyy");
												
				Если СоздаватьСчетаФактуры = Истина Тогда
					Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ". Создайте счет-фактуру для документа-основания и повторите создание документа";
				Иначе
					Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ". Сопоставьте документ вручную из карточки документа.";
				КонецЕсли;
				
			КонецЕсли;
			
			Результат.ОсновнойОбъект = ДокументОснование;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции			

Функция ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных)
	
	МетаданныеОснованийСФ = Метаданные.Документы.СчетФактураПолученный.ВводитсяНаОсновании;
	Результат = МетаданныеОснованийСФ.Содержит(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	Результат = Ложь;
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Если ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных) Тогда
		
		Результат = (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.СчетФактураПолученный"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		ИЛИ НЕ ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(Документ.Тип) Тогда
		
		ЭлектронныйСФ = ЭлектронныйКорректировочныйСчетФактураПакета(Документ);
		ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
		
	Иначе
		
		ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
		ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйСФ)
		ИЛИ ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
		ДокументОбъект.ПокупателемВыставляетсяСчетФактураНаВозврат = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	ОснованиеСФ = ДокументОбъект.Ссылка;
	
	ДатаДокумента = ТекущаяДатаСеанса();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	СтруктураДляСФ = Новый Структура;
	СтруктураДляСФ.Вставить("ДокументОснование", ОснованиеСФ);
	СтруктураДляСФ.Вставить("Основание", ОснованиеСФ);
	СтруктураДляСФ.Вставить("ВидСчетаФактуры", ВидСчетаФактуры);
	
	ДокументСФ.Заполнить(СтруктураДляСФ);
	
	ЭтоИсправлениеСФ = Ядро.Документы_ЭтоИсправительныйСчетФактура(ЭлектронныйСФ.Тип);
	
	Если НЕ ЭтоИсправлениеСФ Тогда
		
		ДокументСФ.ДатаВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Дата;
		ДокументСФ.НомерВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Номер;
		
	КонецЕсли;
	
	ДокументСФ.КодСпособаПолучения = 2;
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.УстановитьНовыйНомер();
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.Записать();
	
	Если НЕ ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлектронныйКорректировочныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		
		Для Каждого СтрокаОснование Из ДокументУчета.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(СтрокаОснование.ДокументОснование, ДобавляемыйКомментарий);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Общее_СтрокаВДату(Значение)
	
	Результат = СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция ЗапрещеноЧтениеТаблицыДанныхДокумента(ОбъектМетаданных)
	
	Результат = НЕ РазрешеноЧтениеТаблицы(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция РазрешеноЧтениеТаблицы(ОбъектМетаданных)
	
	Результат = ПравоДоступа("Чтение", ОбъектМетаданных);
	Возврат Результат;
	
КонецФункции

Функция АктСверки_ДанныеЮрФизЛица(Участник, ДатаСведений)
	
	МодульОбменСКонтрагентамиБП = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиБП");
	
	ДанныеУчастникаЭДО = МодульОбменСКонтрагентамиБП.ПолучитьДанныеЮрФизЛица(Участник, ДатаСведений);
	
	Результат = АктСверки_Контракт_ДанныеЮрФизЛица();
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеУчастникаЭДО);
	
	Если НЕ ЗначениеЗаполнено(Результат.ЭтоИндивидуальныйПредприниматель) Тогда
		
		Результат.ЭтоИндивидуальныйПредприниматель = Результат.ТипЮрФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры(Номенклатура, Содержание = Неопределено)
	
	Результат = Содержание;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		НаименованиеНоменклатуры = СокрЛП(Номенклатура);
		Результат = НаименованиеНоменклатуры;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодВалюты(ВалютаСсылка)
	
	ВыбратьРазрешенные = Истина;
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ВалютаСсылка,
		"Код",
		ВыбратьРазрешенные
	);
	
	Если Результат = Неопределено Тогда
		Результат = "643";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаРегламентированногоУчета()
	
	Результат = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ДанныеДляЗаполненияТабличнойЧастиОтветногоТитула(ДокСсылка, ДанныеШапки)
	
	ПараметрСчетаИсключения = АктСверки405_СчетаИсключения();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.Текст = ТекстЗапроса_ДанныеТабличныхЧастейАктаСверкиВзаиморасчетов();
	
	ПараметрГруппаДоговоров = Неопределено;
	
	Если ДанныеШапки.ДоговорКонтрагента.ЭтоГруппа Тогда
		ПараметрГруппаДоговоров = ДанныеШапки.ДоговорКонтрагента;
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ПараметрАналитикаРасчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ПараметрАктСверкиВВалюте = ДанныеШапки.ВалютаДокумента <> ВалютаРегламентированногоУчета;
	ПараметрСчетаИсключения = АктСверки405_СчетаИсключения();
	
	Запрос.УстановитьПараметр("ГруппаДоговоров", ПараметрГруппаДоговоров);
	Запрос.УстановитьПараметр("Организация", ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ДанныеШапки.ДатаНачала);
	Запрос.УстановитьПараметр("Контрагент", ДанныеШапки.Контрагент);
	Запрос.УстановитьПараметр("АналитикаРасчетов", ПараметрАналитикаРасчетов);
	Запрос.УстановитьПараметр("АктСверкиВВалюте", ПараметрАктСверкиВВалюте);
	Запрос.УстановитьПараметр("СчетаИсключения", ПараметрСчетаИсключения);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции

Процедура АктСверки405_ПроверитьВозможностьОтправки(Результат, ДокСсылка)
	
	ЭтоЭлектронныйАктСверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "ЭтоЭлектронныйДокумент");
	
	Если НЕ ЭтоЭлектронныйАктСверки Тогда
		
		ШаблонОшибки = НСтр("ru='Установите переключатель ""В электронном виде"" в документе <%1>'");
		
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ДокСсылка);
		
		ГенерацияXML.ДобавитьОшибкуВалидации(
			Результат.ОшибкиВДанных,
			ТекстОшибки,
			ДокСсылка
		);
		
	КонецЕсли;
	
КонецПроцедуры

Функция АктСверки405_ПроверитьВозможностьФормированияОтветногоТитула(Результат, ДокСсылка)
	
	ЭтоДокументАктСверки = ЭтоАктСверкиВзаиморасчетов(ДокСсылка);
	
	Если НЕ ЭтоДокументАктСверки Тогда
		
		ТекстОшибки = НСтр(
			"ru='Не удалось обновить результат сверки. Итоги сверки заполняются только если в документе 1С заполнен признак ""Есть расхождения"".
			|Этот признак можно установить в типе ""Акт сверки расчетов"", только если установлен переключатель ""В электронном виде""'"
		);
		
		ГенерацияXML.ДобавитьОшибкуВалидации(
			Результат.ОшибкиВДанных,
			ТекстОшибки
		);
		
	КонецЕсли;
	
	Возврат ЭтоДокументАктСверки;
	
КонецФункции

Процедура АктСверки405_ПроверитьОборотыЗаПериодСверки(Результат, ВыборкаПоДоговорам, ДокСсылка)
	
	Если ВыборкаПоДоговорам.Количество() = 0 Тогда
		
		ТекстОшибки = НСтр("ru='В <связанном документе 1С> нет оборотов за период сверки. Заполните обороты или сформируйте акт за другой период, где есть обороты'");
		
		ГенерацияXML.ДобавитьОшибкуВалидации(
			Результат.ОшибкиВДанных,
			ТекстОшибки,
			ДокСсылка
		);
		
	КонецЕсли;
	
КонецПроцедуры

Функция АктСверки405_НачальноеСальдоПоДоговорам(ДокСсылка)
	
	ПараметрыАктаСверки = АктСверки405_ПараметрыСверки(ДокСсылка);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапроса_АктСверки405ОстаткиПоДоговорам();
	
	Запрос.УстановитьПараметр("Организация", ПараметрыАктаСверки.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыАктаСверки.НачалоПериода);
	Запрос.УстановитьПараметр("СчетаРасчетов", ПараметрыАктаСверки.СчетаРасчетов);
	Запрос.УстановитьПараметр("Договоры", ПараметрыАктаСверки.Договоры);
	Запрос.УстановитьПараметр("АналитикаРасчетов", ПараметрыАктаСверки.АналитикаРасчетов);
	Запрос.УстановитьПараметр("АктСверкиВВалюте", ПараметрыАктаСверки.АктСверкиВВалюте);
	Запрос.УстановитьПараметр("СчетаИсключения", ПараметрыАктаСверки.СчетаИсключения);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ПараметрыСверки(ДокСсылка)
	
	ФильтрСписокСчетов = АктСверки405_СчетаРасчетов(ДокСсылка);
	
	ДоговорыПоДаннымОрганизации = АктСверки405_Договоры(ДокСсылка, "ПоДаннымОрганизации");
	ДоговорыПоДаннымКонтрагента = АктСверки405_Договоры(ДокСсылка, "ПоДаннымКонтрагента");
	
	ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета();
	
	ТолькоУникальныеДоговоры = Истина;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ДоговорыПоДаннымОрганизации,
		ДоговорыПоДаннымКонтрагента,
		ТолькоУникальныеДоговоры
	);
	
	ПараметрАналитикаРасчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ПараметрАктСверкиВВалюте = ДокСсылка.ВалютаДокумента <> ВалютаРегламентированногоУчета;
	ПараметрСчетаИсключения = АктСверки405_СчетаИсключения();
	
	РеквизитыДокумента = ЗначенияРеквизитовОбъектаЛок(
		ДокСсылка,
		"Организация, ДатаНачала"
	);
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", РеквизитыДокумента.Организация);
	Результат.Вставить("НачалоПериода", РеквизитыДокумента.ДатаНачала);
	Результат.Вставить("СчетаРасчетов", ФильтрСписокСчетов);
	Результат.Вставить("Договоры", ДоговорыПоДаннымОрганизации);
	Результат.Вставить("АналитикаРасчетов", ПараметрАналитикаРасчетов);
	Результат.Вставить("АктСверкиВВалюте", ПараметрАктСверкиВВалюте);
	Результат.Вставить("СчетаИсключения", ПараметрСчетаИсключения);
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_СчетаРасчетов(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабличнаяЧастьСписокСчетов.Счет КАК Счет
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.СписокСчетов КАК ТабличнаяЧастьСписокСчетов
	|ГДЕ
	|	ТабличнаяЧастьСписокСчетов.Ссылка = &Ссылка
	|	И ТабличнаяЧастьСписокСчетов.УчаствуетВРасчетах = ИСТИНА
	|	И НЕ ТабличнаяЧастьСписокСчетов.Счет ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	ВыгрузкаСпискаСчетов = Запрос.Выполнить().Выгрузить();
	
	Результат = ВыгрузкаСпискаСчетов.ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_Договоры(ДокСсылка, ИмяТаблицы)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Договор КАК Договор
	|ИЗ
	|	&ПолноеИмяТаблицы КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	ПолноеИмяТаблицы = СтрЗаменить("Документ.АктСверкиВзаиморасчетов.%ИмяТаблицы%", "%ИмяТаблицы%", ИмяТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	ВыгрузкаДоговоров = Запрос.Выполнить().Выгрузить();
	
	Результат = ВыгрузкаДоговоров.ВыгрузитьКолонку("Договор");
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_СчетаИсключения()
	
	СчетаИсключения = ПланыСчетов.Хозрасчетный.СчетаНДСПоАренднымОбязательствам();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		СчетаИсключения,
		ПланыСчетов.Хозрасчетный.СчетаПроцентовПоОбязательствам()
	);
	
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.КорректировкаРасчетовПрошлогоПериода);
	
	Возврат СчетаИсключения;
	
КонецФункции

Функция АктСверки405_ШапкаИнформацииОтправителя(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_АктСверки405Шапка();
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизитыДокумента = РезультатЗапроса.Выгрузить();
	
	Результат = ТаблицаРеквизитыДокумента[0];
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ТабличнаяЧастьИнформацииОтправителя(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_АктСверки405ДетальныеДанные();
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ИтогиИнформацииОтправителя(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_АктСверки405Итоги();
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Метод является констркутором служебной коллекции "КоллекцияПечатныхФорм"
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция НовыйКоллекцияПечатныхФормДляПечатиДокумента()
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции 

Процедура СчетаНаОплату_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм)
	
	НовыйЭлементТаблицы = КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= "СчетЗаказ";
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры

Процедура АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм)
	
	НовыйЭлементТаблицы = КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета = "АктСверки";
	НовыйЭлементТаблицы.ИмяВРЕГ = ВРег(НовыйЭлементТаблицы.ИмяМакета);
	НовыйЭлементТаблицы.Экземпляров = 1;

КонецПроцедуры

Функция СчетаНаОплату_ПечатнаяФорма1С(ДокСсылка) Экспорт
	
	ДокументПечати = Новый Массив;
	ДокументПечати.Добавить(ДокСсылка);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	КоллекцияПечатныхФорм = НовыйКоллекцияПечатныхФормДляПечатиДокумента();
	
	СчетаНаОплату_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм);
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Новый Структура;
	
	МенеджерПечати = Обработки.ПечатьСчетаНаОплату;
	
	МенеджерПечати.Печать(
		ДокументПечати,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода
	);
	
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			
			ТабличныйДокумент = Стр.ТабличныйДокумент;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет модель данных электронного счета на оплату.
//
// Параметры:
//	Шапка - Контракт шапки неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - Контракт табличной части неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату() 
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанные(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета) Экспорт
	
	Если ЭтоСчетНаОплатуПокупателю(ОснованиеЭлектронногоСчета)
		Или ЭтоСчетНаАренду(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоСчетуНаОплату(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоДокументПродажи(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоДокументуПродажи(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет модель данных электронного счета на оплату на основании счета.
//
// Параметры:
//	Шапка - Контракт шапки неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - Контракт табличной части неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату()
//  Счет - ДокументСсылка.СчетНаОплатуПокупателю, ДокументСсылка.АР_СчетНаАренду - основание электронного счета
// 
Процедура СчетаНаОплату_ЗаполнитьДанныеПоСчетуНаОплату(Шапка, ТабличнаяЧасть, Счет)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Счет);
	
	МенеджерОбъекта = Документы.СчетНаОплатуПокупателю;
	Если ЭтоСчетНаАренду(Счет) Тогда
		МенеджерОбъекта = Документы.АР_СчетНаАренду;
	КонецЕсли;
	
	СтруктураДанныхДляПечати = МенеджерОбъекта.ПолучитьТаблицуСведенийСчетаНаОплату(МассивОбъектов);
	
	ДанныеШапки = СтруктураДанныхДляПечати[0];
	
	НомерДокумента = ДанныеШапки.НомерДокумента;
	ДатаДокумента = ДанныеШапки.ДатаДокумента;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Покупатель, ДатаДокумента);
	СведенияОПолучателе = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Получатель, ДатаДокумента);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не СчетНаОплатуПокупателюБезНДС(Счет);
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОПолучателе);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОПолучателе.ИНН;
	Шапка.ПродавецКПП = СведенияОПолучателе.КПП;
	
	Шапка.ПродавецБанкБИК = ДанныеШапки.БикБанкаПолучателя;
	Шапка.ПродавецБанкПредставление = ДанныеШапки.НаименованиеБанкаПолучателя;
	Шапка.ПродавецБанковскийСчет = ДанныеШапки.БанковскийСчетПродавца;
	Шапка.ПродавецБанковскийСчетНомер = ДанныеШапки.НомерСчетаПолучателя;
	Шапка.ПродавецБанковскийСчетКорСчет = ДанныеШапки.СчетБанкаПолучателя;
	
	Шапка.Покупатель = ДанныеШапки.Покупатель;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = ДанныеШапки.РуководительФИО;
	
	ДанныеТабличнойЧасти = СтруктураДанныхДляПечати[0].ТаблицаДокумента;
	
	// Если сумма скидки по документу в целом, то сумма пересчитывается при распределении скидки
	ПересчитатьСуммуСУчетомСкидки = (ДанныеШапки.СуммаСкидки = 0);
	
	РаспределитьСкидкуПоСтрокамТабличнойЧасти(
		ДанныеТабличнойЧасти,
		ДанныеШапки.СуммаСкидки,
		ДанныеШапки.СуммаВключаетНДС
	);
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатуры(
			Запись.НоменклатураНаименование,
			Запись.Содержание
		);
		
		НоваяСтрока.НоменклатураАртикул = Запись.НоменклатураАртикул;
		
		Если ПересчитатьСуммуСУчетомСкидки Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Сумма - НоваяСтрока.СуммаСкидки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьСкидкуПоСтрокамТабличнойЧасти(ТабличнаяЧасть, СуммаСкидки, СуммаВключаетНДС)
	
	Если СуммаСкидки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоПоДокументу = 0;
	ВсегоПоСтрокам = Новый Массив;
	
	Для Индекс = 0 По ТабличнаяЧасть.Количество() - 1 Цикл
		
		СтрокаТабличнойЧасти = ТабличнаяЧасть[Индекс];
		
		ВсегоПоСтроке = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		Если ВсегоПоСтроке > 0 Тогда
			ВсегоПоДокументу = ВсегоПоДокументу + ВсегоПоСтроке;
			ВсегоПоСтрокам.Добавить(ВсегоПоСтроке);
		Иначе
			ВсегоПоСтрокам.Добавить(0);
		КонецЕсли;
		
	КонецЦикла;
	
	ВсегоСоСкидкой = ВсегоПоДокументу - СуммаСкидки;
	
	Если ВсегоСоСкидкой <= 0 Тогда
		ТабличнаяЧасть.ЗаполнитьЗначения(0, "Цена, Сумма, СуммаНДС");
		Возврат;
	КонецЕсли;
	
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("ОбщегоНазначенияКлиентСервер");
	ВсегоПоСтрокамСоСкидкой =
		ИнтерфейсБСП.РаспределитьСуммуПропорциональноКоэффициентам(ВсегоСоСкидкой, ВсегоПоСтрокам, 2);
	МассивСкидок = ИнтерфейсБСП.РаспределитьСуммуПропорциональноКоэффициентам(СуммаСкидки, ВсегоПоСтрокам, 2);
	
	Для Индекс = 0 По ТабличнаяЧасть.Количество()-1 Цикл
		
		СтрокаТабличнойЧасти = ТабличнаяЧасть[Индекс];
		
		СуммаВсего = ВсегоПоСтрокамСоСкидкой[Индекс];
		
		Если СуммаВсего = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаТабличнойЧасти.СуммаНДС = РассчитатьСуммуНДС(
			СуммаВсего,
			Истина,
			СтрокаТабличнойЧасти.СтавкаНДС
		);
		
		СтрокаТабличнойЧасти.Сумма = СуммаВсего - ?(СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		СтрокаТабличнойЧасти.СуммаСкидки = МассивСкидок[Индекс];
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет модель данных электронного счета на оплату на основании документа продажи.
//
// Параметры:
//	Шапка - Контракт шапки неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - Контракт табличной части неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату()
//  ДокументПродажи - ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.РеализацияУслугПоПереработке
//                    ДокументСсылка.КорректировкаРеализации, ДокументСсылка.АктОбОказанииПроизводственныхУслуг
//                    ДокументСсылка.ПередачаОС, ДокументСсылка.ОтчетКомитентуОПродажах
//                    ДокументСсылка.АР_НачислениеАренднойПлаты - основание электронного счета
// 
Процедура СчетаНаОплату_ЗаполнитьДанныеПоДокументуПродажи(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_РеализацияТоваровУслуг(Шапка, ТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_РеализацияУслугПоПереработке(Шапка, ТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_КорректировкаРеализации(Шапка, ТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_АктОбОказанииПроизводственныхУслуг(Шапка, ТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ПередачаОС") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_ПередачаОС(Шапка, ТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_ОтчетКомитентуОПродажах(Шапка, ТабличнаяЧасть, ДокументПродажи);
		
	ИначеЕсли ЭтоНачислениеАренднойПлаты(ДокументПродажи) Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_НачислениеАренднойПлаты(Шапка, ТабличнаяЧасть, ДокументПродажи);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа: %1'");
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ДокументПродажи));
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_РеализацияТоваровУслуг(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	"""" КАК СодержаниеУслуги,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	&ПолеСодержаниеУслуги,
	|	&ПолеНоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	&ПолеСодержаниеУслуги,
	|	&ПолеНоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСодержаниеУслуги(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не РеализацияТоваровУслугБезНДС(ДокументПродажи);
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = БП30_РуководительФамилияИО(ДанныеШапки.Организация, ДатаДокумента);
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		Шапка.ПродавецБанк = РеквизитыСчета.Банк;
		Шапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Шапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Шапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатуры(
			Запись.НоменклатураНаименование,
			Запись.СодержаниеУслуги
		);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_РеализацияУслугПоПереработке(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	&ПолеСодержаниеУслуги КАК СодержаниеУслуги,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСодержаниеУслуги(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
		
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не РеализацияУслугПоПереработкеБезНДС(ДокументПродажи);
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = БП30_РуководительФамилияИО(ДанныеШапки.Организация, ДатаДокумента);
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		Шапка.ПродавецБанк = РеквизитыСчета.Банк;
		Шапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Шапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Шапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
		
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатуры(
			Запись.НоменклатураНаименование,
			Запись.СодержаниеУслуги
		);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_КорректировкаРеализации(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК СистемныйНомер,
	|	ДанныеДокумента.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	ДанныеДокумента.НомерИсправления КАК НомерИсправления,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	"""" КАК СодержаниеУслуги,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|	И ДанныеДокумента.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	&ПолеСодержаниеУслуги,
	|	&ПолеНоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|	И ДанныеДокумента.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	&ПолеСодержаниеУслуги,
	|	&ПолеНоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.АгентскиеУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|	И ДанныеДокумента.Сумма > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСодержаниеУслуги(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = СтрШаблон(
		"%1 (испр. %2)",
		ПредставлениеНомера(ДанныеШапки.НомерИсходногоДокумента),
		XMLСтрока(ДанныеШапки.НомерИсправления)
	);
	
	Если ЭтоКорректировкаРеализации(ДокументПродажи) Тогда
		НомерДокумента = ПредставлениеНомера(ДанныеШапки.СистемныйНомер);
	КонецЕсли;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не КорректировкаРеализацииБезНДС(ДокументПродажи);
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = БП30_РуководительФамилияИО(ДанныеШапки.Организация, ДатаДокумента);
	
	Если ЗначениеЗаполнено(ДанныеШапки.БанковскийСчетОрганизации) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(ДанныеШапки.БанковскийСчетОрганизации);
		
		Шапка.ПродавецБанк = РеквизитыСчета.Банк;
		Шапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Шапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Шапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатуры(
			Запись.НоменклатураНаименование,
			Запись.СодержаниеУслуги
		);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_АктОбОказанииПроизводственныхУслуг(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	"""" КАК СодержаниеУслуги,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСодержаниеУслуги(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не АктОбОказанииПроизводственныхУслугБезНДС(ДокументПродажи);
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = БП30_РуководительФамилияИО(ДанныеШапки.Организация, ДатаДокумента);
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		Шапка.ПродавецБанк = РеквизитыСчета.Банк;
		Шапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Шапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Шапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
		
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатуры(
			Запись.НоменклатураНаименование,
			Запись.СодержаниеУслуги
		);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_ПередачаОС(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПередачаОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ОсновноеСредство КАК Номенклатура,
	|	ДанныеДокумента.ОсновноеСредство.НаименованиеПолное КАК НоменклатураНаименование,
	|	ДанныеДокумента.ОсновноеСредство.Код КАК НоменклатураКод,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	ДатаДокумента = ДанныеШапки.Дата;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не ПередачаОсновныхСредствБезНДС(ДокументПродажи);
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = БП30_РуководительФамилияИО(ДанныеШапки.Организация, ДатаДокумента);
	
	Если ЗначениеЗаполнено(ДанныеШапки.БанковскийСчетОрганизации) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(ДанныеШапки.БанковскийСчетОрганизации);
		
		Шапка.ПродавецБанк = РеквизитыСчета.Банк;
		Шапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Шапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Шапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
		
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = Запись.НоменклатураНаименование;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_ОтчетКомитентуОПродажах(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.УслугаПоВознаграждению КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.УслугаПоВознаграждению = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ""Комиссионное вознаграждение""
	|		КОГДА ПОДСТРОКА(ДанныеДокумента.УслугаПоВознаграждению.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ДанныеДокумента.УслугаПоВознаграждению.Наименование
	|		ИНАЧЕ ДанныеДокумента.УслугаПоВознаграждению.НаименованиеПолное
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ДанныеДокумента.УслугаПоВознаграждению.Артикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.УслугаПоВознаграждению.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.СуммаВознаграждения КАК Цена,
	|	1 КАК Количество,
	|	ДанныеДокумента.СуммаВознаграждения КАК Сумма,
	|	ДанныеДокумента.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СтавкаНДСВознаграждения = &СтавкаБезНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДокументБезНДС
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	Запрос.УстановитьПараметр("СтавкаБезНДС", Перечисления.СтавкиНДС.БезНДС);
	
	ДанныеШапки = Запрос.Выполнить().Выгрузить()[0];
	
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	ДатаДокумента = ДанныеШапки.Дата;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не ДанныеШапки.ДокументБезНДС;
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = БП30_РуководительФамилияИО(ДанныеШапки.Организация, ДатаДокумента);
	
	Если ЗначениеЗаполнено(ДанныеШапки.БанковскийСчетОрганизации) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(ДанныеШапки.БанковскийСчетОрганизации);
		
		Шапка.ПродавецБанк = РеквизитыСчета.Банк;
		Шапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Шапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Шапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
		
	НоваяСтрока = ТабличнаяЧасть.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеШапки);
	
	НоваяСтрока.НоменклатураПредставление = ДанныеШапки.НоменклатураНаименование;
	НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(
		ДанныеШапки.Сумма,
		ДанныеШапки.СуммаВключаетНДС,
		ДанныеШапки.СтавкаНДС
	);
		
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи_НачислениеАренднойПлаты(Шапка, ТабличнаяЧасть, ДокументПродажи)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	&ПолеСодержаниеУслуги КАК СодержаниеУслуги,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты.Состав КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСодержаниеУслуги(
		ТекстЗапроса,
		ПсевдонимТаблицы
	);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументПродажи);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Номер);
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не НачислениеАренднойПлатыБезНДС(ДокументПродажи);
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = КодВалютыПоКлассификатору(ДанныеШапки.Валюта);
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Шапка.РуководительФИО = БП30_РуководительФамилияИО(ДанныеШапки.Организация, ДатаДокумента);
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		Шапка.ПродавецБанк = РеквизитыСчета.Банк;
		Шапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		Шапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		Шапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
		НоваяСтрока.НоменклатураПредставление = ПредставлениеНоменклатуры(
			Запись.НоменклатураНаименование,
			Запись.СодержаниеУслуги
		);
		
	КонецЦикла;
	
КонецПроцедуры

// Получает реквизиты участника сделки с учетом истории изменения и настроек
//
// Параметры:
//  Участник - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - участник сделки
//  ДатаСведений - Дата - дата, на которую нужно получить реквизиты
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - значения реквизитов:
//    * ПолноеНаименование - Строка - Общество с ограниченной ответственностью "Ромашка"
//    * СокращенноеНаименование - Строка - ООО "Ромашка"
//    * НаименованиеДляПечатныхФорм - Строка - Полное или сокращенное наименование (определяется настройкой организации)
//    * ИНН - Строка - ИНН участника
//    * КПП - Строка - КПП участника
//    * Телефоны - Строка - Телефоны участника
//    * ЮридическийАдрес - Строка - Юридический адрес участника
//
Функция СчетаНаОплату_ДанныеЮрФизЛица(Участник, ДатаСведений)
	
	Модель = Новый Структура;
	Модель.Вставить("ПолноеНаименование", "");
	Модель.Вставить("СокращенноеНаименование", "");
	Модель.Вставить("НаименованиеДляПечатныхФорм", "");
	Модель.Вставить("ИНН", "");
	Модель.Вставить("КПП", "");
	Модель.Вставить("Телефоны", "");
	Модель.Вставить("ЮридическийАдрес", "");
	
	МодульОбменСКонтрагентамиБП = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиБП");
	
	Данные = МодульОбменСКонтрагентамиБП.ПолучитьДанныеЮрФизЛица(Участник, ДатаСведений);
	
	Модель.ПолноеНаименование = Данные.ПолноеНаименование;
	Модель.СокращенноеНаименование = Данные.СокращенноеНаименование;
	Модель.НаименованиеДляПечатныхФорм = Данные.НаименованиеДляПечатныхФорм;
	Модель.ИНН = Данные.ИНН;
	Модель.КПП = Данные.КПП;
	Модель.Телефоны = Данные.Телефоны;
	Модель.ЮридическийАдрес = Данные.ЮридическийАдрес;
	
	Если ТипЗнч(Участник) = Тип("СправочникСсылка.Контрагенты") Тогда
		// функция Справочники.Контрагенты.НаименованияНаДату возвращает
		// наименование элемента, а не официальное наименование
		Модель.СокращенноеНаименование = Модель.НаименованиеДляПечатныхФорм;
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ПредставлениеЮрФизЛица(РеквизитыЮрФизЛица)
	
	Результат = РеквизитыЮрФизЛица.НаименованиеДляПечатныхФорм;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = РеквизитыЮрФизЛица.СокращенноеНаименование;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует строку с наименованием и реквизитами юридического или физического лица
//
// Параметры:
//   Реквизиты - Структура - см. СчетаНаОплату_ДанныеЮрФизЛица
//
// Возвращаемое значение:
//   Строка - строковое представление реквизитов
//
Функция СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(Реквизиты)
	
	ШаблонПредставления = "СокращенноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны";
	Результат = ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления)
	
	Перем Префикс, СтрокаДополнения;
	
	СоответствиеПараметров = Новый Структура;
	СоответствиеПараметров.Вставить("ПолноеНаименование", " ");
	СоответствиеПараметров.Вставить("СокращенноеНаименование", " ");
	СоответствиеПараметров.Вставить("НаименованиеДляПечатныхФорм", " ");
	СоответствиеПараметров.Вставить("ИНН", " ИНН ");
	СоответствиеПараметров.Вставить("КПП", " КПП ");
	СоответствиеПараметров.Вставить("Свидетельство", " ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи", " от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес", " ");
	СоответствиеПараметров.Вставить("ФактическийАдрес", " ");
	СоответствиеПараметров.Вставить("Телефоны", " тел.: ");
	СоответствиеПараметров.Вставить("Факс", " факс: ");
	СоответствиеПараметров.Вставить("НомерСчета", " р/с ");
	СоответствиеПараметров.Вставить("Банк", " в банке ");
	СоответствиеПараметров.Вставить("БИК", " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет", " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО", " Код по ОКПО ");
	
	ПропускатьПустыеСтроки = Истина;
	Разделитель = ",";
	СписокПараметров = СтрРазделить(
		ШаблонПредставления,
		Разделитель,
		ПропускатьПустыеСтроки
	);
	
	Результат = Новый Массив;
	
	Для Каждого ИмяПараметра Из СписокПараметров Цикл
		
		Если Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения) Тогда
			
			Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения);
			Если ПустаяСтрока(СтрокаДополнения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СоответствиеПараметров.Свойство(ИмяПараметра, Префикс) Тогда
				Результат.Добавить(Префикс + СтрокаДополнения);
			Иначе
				Результат.Добавить(СтрокаДополнения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаРезультата = СтрСоединить(Результат, ",");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "  ", " ");
	
	Возврат СокрЛП(СтрокаРезультата);
	
КонецФункции

Функция СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента)
	
	Результат = СтрШаблон(
		"Счет на оплату № %1 от %2",
		НомерДокумента,
		Формат(ДатаДокумента, "ДФ=dd.MM.yyyy")
	);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	ЗначениеКонстанты = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	Если ЗначениеКонстанты = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		Выражение = "ЕСТЬNULL(ПсевдонимТаблицы.Номенклатура.Артикул, """")";
	ИначеЕсли ЗначениеКонстанты = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		Выражение = "ЕСТЬNULL(ПсевдонимТаблицы.Номенклатура.Код, """")";
	Иначе
		Выражение = """""";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеНоменклатураАртикул",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = 
	"ВЫБОР
	|		КОГДА НЕ (ПсевдонимТаблицы.Номенклатура.НаименованиеПолное ПОДОБНО """")
	|			ТОГДА ПсевдонимТаблицы.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ПсевдонимТаблицы.Номенклатура.Наименование
	|	КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеНоменклатураНаименование",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаСодержаниеУслуги(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = 
	"ВЫБОР
	|		КОГДА НЕ (ПсевдонимТаблицы.Содержание ПОДОБНО """")
	|			ТОГДА ПсевдонимТаблицы.Содержание
	|		КОГДА НЕ (ПсевдонимТаблицы.Номенклатура.НаименованиеПолное ПОДОБНО """")
	|			ТОГДА ПсевдонимТаблицы.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ПсевдонимТаблицы.Номенклатура.Наименование
	|	КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеСодержаниеУслуги",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаАдресДоставкиЗначение(ТекстЗапроса, МетаданныеДокумента)
	
	ВыражениеТекстаЗапроса = """""";
	
	ЕстьАдресДоставкиВJSON = ЕстьРеквизитОбъектаЛок("АдресДоставкиЗначение", МетаданныеДокумента);
	
	Если ЕстьАдресДоставкиВJSON Тогда
		ВыражениеТекстаЗапроса = "Шапка.АдресДоставкиЗначение";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&АдресДоставкиЗначение", ВыражениеТекстаЗапроса);
	
КонецПроцедуры

Процедура ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы)
	
	ПодстрокаПоиска = "ПсевдонимТаблицы";
	Если Не ЗначениеЗаполнено(ПсевдонимТаблицы) Тогда
		ПодстрокаПоиска = ПодстрокаПоиска + ".";
	КонецЕсли;
	
	Выражение = СтрЗаменить(Выражение, ПодстрокаПоиска, ПсевдонимТаблицы);
	
КонецПроцедуры

Функция БП30_РуководительФамилияИО(Организация, ДатаСреза)
	
	ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(
		Организация,
		ДатаСреза
	);
	
	Результат = ОтветственныеЛица.РуководительФИО.Представление;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитОбъектаЛок(ИмяРеквизита, ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, Реквизиты)
	
	ВыбиратьРазрешенные = Истина;
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СсылкаНаОбъект,
		Реквизиты,
		ВыбиратьРазрешенные
	);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеРеквизитаОбъектаЛок(СсылкаНаОбъект, ИмяРеквизита)
	
	ВыбиратьРазрешенные = Истина;
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СсылкаНаОбъект,
		ИмяРеквизита,
		ВыбиратьРазрешенные
	);
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблон("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

Функция СуществуетЗначениеПеречисленияЛок(ПеречислениеМенеджер, ИмяЗначения)
	
	ОбъектМД = ПеречислениеМенеджер.ПустаяСсылка().Метаданные();
	Результат = (ОбъектМД.ЗначенияПеречисления.Найти(ИмяЗначения) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыБанковскогоСчета(БанковскийСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.Банк.Наименование КАК БанкНаименование,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция АктыСверок_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	Если ТипОбъекта <> Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда
		
		Ошибка = СтрШаблон(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ДокументПечати = Новый Массив;
	ДокументПечати.Добавить(СсылкаНаОбъект);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	КоллекцияПечатныхФорм = НовыйКоллекцияПечатныхФормДляПечатиДокумента();
	
	АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм);
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Новый Структура;
	
	МенеджерПечати = Документы.АктСверкиВзаиморасчетов;
	МенеджерПечати.Печать(
		ДокументПечати,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода
	);
	
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			
			ТабличныйДокумент = Стр.ТабличныйДокумент;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет мету электронных актов и накладных
//
// Параметры:
//  Мета - Структура - модель меты передаточного документа
//  УчетныйДокумент - ЛюбаяСсылка - основание электронного акта или накладной
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартный обработчик заполнения меты
//
Процедура ПередаточныеДокументы_ЗаполнитьМету(Мета, УчетныйДокумент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ТипОснования = ТипЗнч(УчетныйДокумент);
	
	Если ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ПередаточныеДокументы_ЗаполнитьМетуПоРТУ(Мета, УчетныйДокумент);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		ПередаточныеДокументы_ЗаполнитьМетуПоАОПУ(Мета, УчетныйДокумент);
		
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередаточныеДокументы_ЗаполнитьМетуПоРТУ(Мета, УчетныйДокумент)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ВалютаДокумента.Код КАК ВалютаКод,
	|	МАКСИМУМ(Шапка.СуммаДокумента) КАК СуммаДокумента,
	|	СУММА(ЕСТЬNULL(ТЧАгентскиеУслуги.СуммаНДС, 0) + ЕСТЬNULL(ТЧТовары.СуммаНДС, 0) + ЕСТЬNULL(ТЧУслуги.СуммаНДС, 0)) КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ТЧТовары
	|		ПО Шапка.Ссылка = ТЧТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК ТЧУслуги
	|		ПО Шапка.Ссылка = ТЧУслуги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ТЧАгентскиеУслуги
	|		ПО Шапка.Ссылка = ТЧАгентскиеУслуги.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка,
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.ВалютаДокумента.Код";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", УчетныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Мета.Дата = Выборка.Дата;
	Мета.Номер = ПредставлениеНомера(Выборка.Номер);
	Мета.Сумма = Выборка.СуммаДокумента;
	Мета.СуммаНДС = Выборка.СуммаНДС;
	Мета.ДокументБезНДС = РеализацияТоваровУслугБезНДС(УчетныйДокумент);
	Мета.КодВалюты = Выборка.ВалютаКод;
	
КонецПроцедуры

Процедура ПередаточныеДокументы_ЗаполнитьМетуПоАОПУ(Мета, УчетныйДокумент)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ВалютаДокумента.Код КАК ВалютаКод,
	|	МАКСИМУМ(Шапка.СуммаДокумента) КАК СуммаДокумента,
	|	СУММА(ЕСТЬNULL(ТЧУслуги.СуммаНДС, 0)) КАК СуммаНДС
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК ТЧУслуги
	|		ПО Шапка.Ссылка = ТЧУслуги.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка,
	|	Шапка.Номер,
	|	Шапка.Дата,
	|	Шапка.ВалютаДокумента.Код";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", УчетныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Мета.Дата = Выборка.Дата;
	Мета.Номер = ПредставлениеНомера(Выборка.Номер);
	Мета.Сумма = Выборка.СуммаДокумента;
	Мета.СуммаНДС = Выборка.СуммаНДС;
	Мета.ДокументБезНДС = АктОбОказанииПроизводственныхУслугБезНДС(УчетныйДокумент);
	Мета.КодВалюты = Выборка.ВалютаКод;
	
КонецПроцедуры

Функция СведенияОбАдресеЛок(АдресСтрокойJSON)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("БезПредставлений", Ложь);
	ДопПараметры.Вставить("КодыАдреса", Истина);
	ДопПараметры.Вставить("КодыКЛАДР", Ложь);
	ДопПараметры.Вставить("ПолныеНаименованияСокращений", Ложь);
	ДопПараметры.Вставить("НаименованиеВключаетСокращение", Ложь);
	ДопПараметры.Вставить("ПроверитьАдрес", Ложь);
	
	ВерсияБСП = ВерсияБиблиотекиСтандартныхПодсистем();
	Если СравнитьВерсии_(ВерсияБСП, "2.4") >= 0 Тогда
		ИмяМодуля = "РаботаСАдресами";
	Иначе 
		ИмяМодуля = "УправлениеКонтактнойИнформацией";
	КонецЕсли;
	
	МодульРаботыСАдресами = ОбщийМодульПоИмениЛок(ИмяМодуля);
	
	Результат = МодульРаботыСАдресами.СведенияОбАдресе(АдресСтрокойJSON, ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМуниципальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Муниципальный"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоАдминистративноТерриториальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Административно-территориальный"));
	Возврат Результат;
	
КонецФункции

// Проверяет, что в структуре адреса присутствуют поля, которых нет в структуре АдрРФ.
//
// Параметры:
//  СведенияОбАдресе - Структура - см. функцию СведенияОбАдресеЛок;
// 
// Возвращаемое значение:
//  Булево - Истина, если есть хотя бы одно заполненное поле, не соответстующее структуре АдрРФ.
//
Функция ЗаполненыПоляНесоответствующиеСтруктуреАдрРФ(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ПоляНеПоАдресРФ = Новый Массив;
	ПоляНеПоАдресРФ.Добавить("Округ");
	ПоляНеПоАдресРФ.Добавить("Поселение");
	ПоляНеПоАдресРФ.Добавить("ВнутригородскойРайон");
	ПоляНеПоАдресРФ.Добавить("Территория");
	ПоляНеПоАдресРФ.Добавить("ДополнительнаяТерритория");
	ПоляНеПоАдресРФ.Добавить("ЭлементДополнительнойТерритории");
	ПоляНеПоАдресРФ.Добавить("НомерЗемельногоУчастка");
	
	Для Каждого ИмяПоля Из ПоляНеПоАдресРФ Цикл 
		
		ЗначениеПоля = СвойствоСтруктурыЛок(СведенияОбАдресе, ИмяПоля);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТипКорпусаАдрРФ()
	
	Возврат "Корпус";
	
КонецФункции

Функция ТипПомещенияАдрРФ()
	
	Возврат "Квартира";
	
КонецФункции

Функция ТипЗданияАдрРФ()
	
	Возврат "Дом";
	
КонецФункции

// ВАЖНО! Возвращает сохраненное представление адреса из строки JSON, если оно заполнено.
// В противном случае представление составляется по данным полей JSON и полученное таким образом
// представления аналогично тому, что возвращается в поле Представление структуры, полученнной
// в результате вызова метода РаботаСАдресами.СведенияОбАдресе()
//
// Параметры:
//  АдресСтрокойJSON - Строка - строка JSON с данными адреса
// 
// Возвращаемое значение:
//  Строка - представление адреса
//
Функция ПредставлениеАдреса(АдресСтрокойJSON)

	МодульУправленияКИ = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	Результат = МодульУправленияКИ.ПредставлениеКонтактнойИнформации(АдресСтрокойJSON);

	Возврат Результат;
	
КонецФункции

Функция АдресВСвободнойФорме()
	Возврат "ВСвободнойФорме";
КонецФункции

Функция АдресДоставкиДокумента(ДокСсылка)
	
	Результат = Новый Структура;
	Результат.Вставить("АдресДоставкиЗначение", "");
	Результат.Вставить("АдресДоставки", "");
	
	МетаданныеДокумента = ДокСсылка.Метаданные();
	ТекстЗапроса = ТекстЗапросаДанныхАдресаДоставки(МетаданныеДокумента);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.АдресДоставки = Выборка.АдресДоставки;
		Результат.АдресДоставкиЗначение = Выборка.АдресДоставкиЗначение;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаДанныхАдресаДоставки(МетаданныеДокумента)

	Результат = 
	"ВЫБРАТЬ
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	&АдресДоставкиСтрока КАК АдресДоставки
	|ИЗ
	|	&ПолноеИмяДокумента
	|ГДЕ
	|	Ссылка = &ДокСсылка";
	
	ВыражениеПустаяСтрока = """""";

	ВыражениеАдресДоставкиСтрока = ВыражениеПустаяСтрока;
	Если ЕстьРеквизитОбъектаЛок("АдресДоставки", МетаданныеДокумента) Тогда
		ВыражениеАдресДоставкиСтрока = "АдресДоставки";
	КонецЕсли;
		
	ВыражениеАдресДоставкиЗначение = ВыражениеПустаяСтрока;
	Если ЕстьРеквизитОбъектаЛок("АдресДоставкиЗначение", МетаданныеДокумента) Тогда
		ВыражениеАдресДоставкиЗначение = "АдресДоставкиЗначение";
	КонецЕсли;

	Результат = СтрЗаменить(Результат, "&АдресДоставкиСтрока", ВыражениеАдресДоставкиСтрока);
	Результат = СтрЗаменить(Результат, "&АдресДоставкиЗначение", ВыражениеАдресДоставкиЗначение);
	
	Результат = СтрЗаменить(Результат, "&ПолноеИмяДокумента", МетаданныеДокумента.ПолноеИмя());
	
	Возврат Результат;
	
КонецФункции

Функция СтранаЧленТС(Знач КодСтраны)
	
	КодСтраны = СокрЛП(КодСтраны);
	
	КодыСтранТС = Новый Массив;
	КодыСтранТС.Добавить("643"); // Россия
	КодыСтранТС.Добавить("051"); // Армения
	КодыСтранТС.Добавить("112"); // Беларусь
	КодыСтранТС.Добавить("398"); // Казахстан
	КодыСтранТС.Добавить("417"); // Киргизия
	КодыСтранТС.Добавить("981"); // ЕАЭС
	
	Возврат КодыСтранТС.Найти(КодСтраны) <> Неопределено;
	
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

// Возвращает описания всех библиотек конфигурации, включая
// описание самой конфигурации.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка - имя подсистемы, например, "СтандартныеПодсистемы".
//   * Значение - Структура - описание подсистемы:
//     ** Имя - Строка - имя подсистемы.
//     ** Версия - Строка - версия подсистемы.
//     ** ЭтоКонфигурация - Булево - Истина, если данная подсистема является основной конфигурацией.
//     ** ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах интернет-поддержки.
//
Функция ОписанияПодсистемКонфигурации()
	
	// Используем служебный интерфейс БСП, т.к. метод ОписанияПодсистем добавлен в
	// программный интерфейс модуля ОбщегоНазначения только в версии БСП 3.0.2 и выше
	Результат = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
	Возврат Результат;
	
КонецФункции

Функция ВерсияБухгалтерскойПодсистемы()
	
	ИмяПодсистемы = ИмяБухгалтерскойПодсистемы();
	
	ПроверитьИмяПодсистемы(ИмяПодсистемы);
	
	Если ЗначениеЗаполнено(ИмяПодсистемы) Тогда
		ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
		ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
		Результат = ОписаниеПодсистемы.Версия;
	Иначе
		Результат = Метаданные.Версия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяБухгалтерскойПодсистемы()
	
	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ДопустимыеИмена = ИменаПодсистемБП();
	
	Результат = Неопределено;
	
	Для Каждого ИмяПодсистемы Из ДопустимыеИмена Цикл
		
		Если ПодсистемыКонфигурации.Получить(ИмяПодсистемы) <> Неопределено Тогда
			Результат = ИмяПодсистемы;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ИменаПодсистемБП()
	
	Результат = Новый Массив;
	Результат.Добавить("БухгалтерияПредприятия");
	Результат.Добавить("БухгалтерияПредприятияКОРП");
	Результат.Добавить("БухгалтерияПредприятияБазовая");
	Результат.Добавить("БухгалтерияПредприятияБазовая1");
	Результат.Добавить("БухгалтерияМолокозавода");
	Результат.Добавить("АрендаИУправлениеНедвижимостью");
	Результат.Добавить("БухгалтерияСтроительнойОрганизации");
	Результат.Добавить("БухгалтерияСельскохозяйственногоПредприятия");
	Результат.Добавить("БухгалтерияСельскохозяйственногоПредприятияКОРП");
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияБиблиотекиИнтеграцииИСМП()
	
	ИмяПодсистемы = ИдентификаторБиблиотекиИнтеграцииИСМП();
	
	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
	Результат = ОписаниеПодсистемы.Версия;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторБиблиотекиИнтеграцииИСМП()
	Возврат "БиблиотекаИнтеграцииИСМП";
КонецФункции

Функция ВерсияБиблиотекиСтандартныхПодсистем()
	
	ИдПодсистемы = ИдентификаторБиблиотекиСтандартныхПодсистем();
	
	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИдПодсистемы);
	
	Результат = ОписаниеПодсистемы.Версия;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторБиблиотекиСтандартныхПодсистем()
	Возврат "СтандартныеПодсистемы";
КонецФункции

Процедура ПроверитьИмяПодсистемы(ИмяПодсистемы)
	
	Если ЗначениеЗаполнено(ИмяПодсистемы) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки = 
	"Не удалось определить имя бухгалтерской подсистемы.
	|Имя конфигурации: %1
	|Версия конфигурации: %2
	|Наименование конфигурации: %3";
	
	Ошибка = СтрШаблон(
		ШаблонОшибки,
		Метаданные.Имя,
		Метаданные.Версия,
		Метаданные.Синоним
	);
	
	ЖурналРегистрации_ЗаписатьОшибку(Ошибка);
	
КонецПроцедуры

Процедура ЖурналРегистрации_ЗаписатьОшибку(Ошибка)
	
	Операция = "Диадок.ИМ_БП_30";
	
	ЗаписьЖурналаРегистрации(
		Операция,
		УровеньЖурналаРегистрации.Ошибка,
		Неопределено,
		Неопределено,
		Ошибка
	);
	
КонецПроцедуры

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность = "")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция КатегорииПакетов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"ОсновнойПакет");
	Результат.Вставить("КорректировочныйПакет", "КорректировочныйПакет");
	Результат.Вставить("СчетФактураНаАванс", 	"СчетФактураНаАванс");
	Результат.Вставить("СчетНаОплату", 			"СчетНаОплату");
	Результат.Вставить("АктCверки", 			"АктCверки");
	Результат.Вставить("ВнутренниеПеремещения",	"ВнутренниеПеремещения");
	Результат.Вставить("БезКатегории",			"БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКатегории()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"Первичные документы");
	Результат.Вставить("КорректировочныйПакет", "Корректировочные документы");
	Результат.Вставить("СчетФактураНаАванс", 	"Счет-фактура на аванс");
	Результат.Вставить("СчетНаОплату", 			"Счет на оплату");
	Результат.Вставить("АктCверки", 			"Акт сверки");
	Результат.Вставить("ВнутренниеПеремещения",	"Внутренние перемещения");
	Результат.Вставить("БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Процедура Пакеты_НачатьКатегорию(Знач Идентификатор, Знач Представление)
	
	_ТекущаяКатегорияПакетов = Новый Структура;
	_ТекущаяКатегорияПакетов.Вставить("Идентификатор", Идентификатор);
	_ТекущаяКатегорияПакетов.Вставить("Представление", Представление);
	
КонецПроцедуры

Функция Пакеты_ДобавитьВидПакета(ВидыПакетов, Знач Идентификатор, Знач Представление, Знач Состав)
	
	Если Не ЗначениеЗаполнено(_ТекущаяКатегорияПакетов) Тогда
		Пакеты_НачатьКатегорию(КатегорииПакетов_БезКатегории(), "");
	КонецЕсли;
	
	ОписаниеПакета = ВидыПакетов.Добавить();
	ОписаниеПакета.ID = Идентификатор;
	ОписаниеПакета.Наименование = Представление;
	ОписаниеПакета.СоставПакета = Состав;
	ОписаниеПакета.КатегорияПакета = _ТекущаяКатегорияПакетов.Идентификатор;
	ОписаниеПакета.НаименованиеКатегории = _ТекущаяКатегорияПакетов.Представление;
	
	Возврат ОписаниеПакета;
	
КонецФункции

Функция КатегорииПакетов_Основная()
	Возврат "ОсновнойПакет";
КонецФункции

Функция КатегорииПакетов_СчетаНаОплату()
	Возврат "СчетНаОплату";
КонецФункции

Функция КатегорииПакетов_БезКатегории()
	Возврат "БезКатегории";
КонецФункции

Функция МожноСформироватьПередаточныйДокумент(Документ1С)
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОказаниеУслуг"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	Результат = (ИсключаемыеТипы.Найти(ТипДокумента) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, Документ1С)
	
	Перем ДополнительныеПараметры;
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоОтчетКомитентуОЗакупках(Документ1С) Тогда
		
		ЭтоСчетФактураПеревыставленный = ЭтоСчетФактураПеревыставленный(Пакет.ДокументУчета);
		
		Если ЭтоСчетФактураПеревыставленный Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СчетФактура", Пакет.ДокументУчета);
		КонецЕсли;

	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(
		Пакет,
		Документ1С,
		"ID_УПД_ДОП",
		ДополнительныеПараметры
	);
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С)
	
	Перем ДополнительныеПараметры;
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокумента = "ID_ТОРГ12";
	
	Если ТипЗнч(Документ1С) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
		
		ТолькоУслуги = УчетнаяПолитика.НачислятьНДСПоОтгрузке(Документ1С.Организация, Документ1С.Дата);
		
	ИначеЕсли ЭтоОтчетКомитентуОЗакупках(Документ1С) Тогда
		
		ТолькоУслуги = Не ЭтоСчетФактураПеревыставленный(Пакет.ДокументУчета);
		
		Если ЭтоСчетФактураВыданный(Пакет.ДокументУчета) Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СчетФактура", Пакет.ДокументУчета);
		КонецЕсли;
		
	Иначе
		
		ТолькоУслуги = ДокументРеализацииСодержитТолькоУслуги(Документ1С);
		
	КонецЕсли;
		
	Если ТолькоУслуги Тогда
		ВидДокумента = "ID_АктФормализованный";
	КонецЕсли;

	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(
		Пакет,
		Документ1С,
		ВидДокумента,
		ДополнительныеПараметры);
	
КонецПроцедуры

Функция МожноСформироватьПередаточныйДокументКорректировки(Документ1С)
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	Результат = (ИсключаемыеТипы.Найти(ТипДокумента) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьИДобавитьДокументВПакет_УКДДИС(Пакет, Документ1С)
	
	ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
	
	Пока ДокументыОснования.Следующий() Цикл
		Если МожноСформироватьПередаточныйДокументКорректировки(ДокументыОснования.ДокументОснование) Тогда
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_УКД_ДИС");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументРеализацииСодержитТолькоУслуги(Документ1С)
	
	Результат = Истина;
	
	МетаданныеОбъекта = Документ1С.Метаданные();
	
	ЕстьРеквизитВидОперации = ОбщегоНазначения.ЕстьРеквизитОбъекта("ВидОперации", МетаданныеОбъекта);
	
	Если ЕстьРеквизитВидОперации Тогда
		
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ1С, "ВидОперации");
				
		Если ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия Тогда
			
			ЕстьТовары = ТабличнаяЧастьТоварыЗаполнена(Документ1С);
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги Тогда
			
			ЕстьТовары = Ложь;
			
		Иначе
			
			ЕстьТовары = Истина;
			
		КонецЕсли;
			
		ЭтоОтчетКомитенту = ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
		
		Если ЕстьТовары И Не ЭтоОтчетКомитенту Тогда
			Результат = Ложь;
		КонецЕсли; 
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ТабличнаяЧастьТоварыЗаполнена(ДокументСсылка)
	
	Результат = Ложь;
	
	МетаДокумента = ДокументСсылка.Метаданные(); 
	
	ЕстьТЧТовары = МетаДокумента.ТабличныеЧасти.Найти("Товары") <> Неопределено;
	
	Если ЕстьТЧТовары Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	%1.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка";

		ТекстЗапроса = СтрШаблон(ТекстЗапроса, МетаДокумента.ПолноеИмя());
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Результат = НЕ РезультатЗапроса.Пустой();
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Результат)
		
	// Ищем ТОРГ-12 или УПД, относящийся к другому (не к текущему) пакету, и находящийся в статусе "Требуется подпись" или "Подписан".
	// Еще искомый документ должен быть уже проверен и признан "хорошим" (возможно, его еще не подписали, но уже проверили)
	// Если такой есть, то по текущему документу будем отказывать в подписи, т.к. это дубль
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить("XmlTorg12");
	ТипыДокументов.Добавить("UniversalTransferDocument");
	
	Статусы  = Новый Массив;
	Статусы.Добавить("Подписан");
	Статусы.Добавить("Требуется подпись");
	
	Если ОсновнойМодуль.ЭДО_Использовать1СЭДО() Тогда 
		//TODO добавить проверку дублей для 1С-ЭДО
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.АнализПроведен КАК АнализПроведен,
		|	Диадок_Документы.ТекстОшибки КАК ОшибкиПроверкиТекст
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка <> &ТекущийДокументДД
		|	И Диадок_Документы.LetterId <> &LetterId
		|	И Диадок_Документы.Документ = &Документ1С
		|	И (Диадок_Документы.Направление = ""Inbound"" или Диадок_Документы.Направление = ""Входящее"" )  //переходный период перед релизом 1.0.0
		|	И Диадок_Документы.ТипДокумента В(&ТипДокумента)
		|	И Диадок_Документы.АнализПроведен
		|	И Диадок_Документы.Статус В(&Статусы)
		|	И Выразить(Диадок_Документы.ТекстОшибки как строка(1)) = """"     //  ТекстОшибки сейчас неограниченная строка. Выразить работает в сторону уменьшения длины, но не увеличения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диадок_Документы.ДатаЗагрузки";
		
		Запрос.УстановитьПараметр("ТекущийДокументДД",	ДокументДД);
		Запрос.УстановитьПараметр("Документ1С",			Документ1С);
		Запрос.УстановитьПараметр("ТипДокумента",		ТипыДокументов);
		Запрос.УстановитьПараметр("Статусы",			Статусы);		
		Запрос.УстановитьПараметр("LetterId",			ДокументДД.LetterId);
		Запрос.УстановитьПараметр("ДатаЗагрузки",		ДокументДД.ДатаЗагрузки);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 И ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда
			Док = Выборка[0].Ссылка;
			Результат.Добавить("ДУБЛИКАТ: накладная уже была учтена в электронном виде (дата " + формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy")
			+ ", номер " + Док.НомерДокумента + ", загружен из Диадок " + Док.ДатаЗагрузки + ")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтентОтвета(ДокументДД, Документ1С, ДействиеВДД, ТекстВсехОшибок)
	
	Content = ОсновнойМодуль.ЭДО_ПолучитьПустойКонтентОтветаДляДокумента(ДокументДД, ДействиеВДД);
	
	ИмяТипаОбъектаXDTO = НРег(Content.Тип().Имя);
	
	Если ИмяТипаОбъектаXDTO = "torg12buyercontent" Тогда
		
		Content.ShipmentReceiptDate = Документ1С.Дата;
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Receiver, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, получившее груз
		ЗаполнитьПодпись(Content.Accepter, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, принявшее груз

	ИначеЕсли ИмяТипаОбъектаXDTO = "utdbuyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.Creator				= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.CreatorBase			= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd820buyercontent" Тогда
		
		Content.AcceptanceDate	 	= Документ1С.Дата;
		Content.DocumentCreator	 	= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.DocumentCreatorBase	= "";
		Content.OperationCode	 	= "";
		Content.OperationContent 	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition 	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase 		= "Должностные обязанности";
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd970buyercontent" Тогда
		
		Content.AcceptanceDate	 = Документ1С.Дата;
		Content.DocumentCreator	 = "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.OperationContent = "Товары и услуги получены, претензий нет";
		
		Content.ContentOperCode.TotalCode = "1";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта);
		
		Content.Employee.EmployeePosition = ДанныеПодписанта.Должность;
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "acceptancecertificatebuyercontent" Тогда
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Official, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, подписывающее со стороны заказчика
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "correctionrequestcontent"	// запрос на уточнение по СФ
		Или ИмяТипаОбъектаXDTO = "formalizedrejectioncontent"  // отказ по формализованному
		Или ИмяТипаОбъектаXDTO = "rejectioncontent" Тогда		// отказ по неформализованному
				
		Content.Comment = ТекстВсехОшибок;
		
	КонецЕсли;	
	
	Возврат Content;
	
КонецФункции

Процедура ДобавитьТекстЗапроса_СчетаФактуры_НаРеализацию(Запросы, ОписаниеВидаПакета, Исправление)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =  ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Исправление);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ДобавитьТаблицу_ПеремещениеТоваров(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Организация КАК Организация,
	|	ВТ_Отправители.Подразделение1С КАК ПодразделениеОтправитель,
	|	ВТ_Получатели.Подразделение1С КАК ПодразделениеПолучатель,
	|	ТаблицаДокументов.Номер КАК НомерДокумента,
	|	ТаблицаДокументов.Дата КАК ДатаДокумента,
	|	0 КАК СуммаДокумента,
	|	ТаблицаДокументов.Ссылка КАК Документ
	|ПОМЕСТИТЬ Диадок_ПеремещениеТоваров
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиВнутреннегоДокументооборота КАК ВТ_Настройки
	|		ПО ТаблицаДокументов.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакета = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Отправители
	|		ПО ТаблицаДокументов.Организация = ВТ_Отправители.Организация1С
	|			И ТаблицаДокументов.СкладОтправитель = ВТ_Отправители.Подразделение1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Получатели
	|		ПО ТаблицаДокументов.Организация = ВТ_Получатели.Организация1С
	|			И ТаблицаДокументов.СкладПолучатель = ВТ_Получатели.Подразделение1С
	|ГДЕ
	|	ТаблицаДокументов.Проведен
	|	И ТаблицаДокументов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ВТ_Отправители.Подразделение1С ЕСТЬ NULL
	|	И НЕ ВТ_Получатели.Подразделение1С ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Возврат "Диадок_ПеремещениеТоваров";
	
КонецФункции

Процедура ДобавитьТекстЗапроса_СчетаФактурыПоОтчетуКомиссионера_НаРеализацию(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный)
		Или ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.ОтчетКомиссионераОПродажах) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета, "НаРеализацию");
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаФактуры_Корректировочный(Запросы, ОписаниеВидаПакета, Исправление)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Исправление);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаФактурыПоОтчетуКомиссионера_Корректировочный(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный)
		Или ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.ОтчетКомиссионераОПродажах) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета, "Корректировочный");
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаФактуры_НаАванс(Запросы, ОписаниеВидаПакета, Исправление)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Исправление);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаФактурыПоОтчетуКомиссионера_НаАванс(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный)
		Или ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.ОтчетКомиссионераОПродажах) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета, "НаАванс");
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаФактуры_НаАвансКомитента(Запросы, ОписаниеВидаПакета, Исправление)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАвансКомитента", Исправление);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_ПервичныеДокументыБезНДС(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры 

Процедура ДобавитьТекстЗапроса_СчетаНаОплату(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетНаОплатуПокупателю) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_СчетаНаОплату_ОтчетКомитентуОПродажах(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетНаОплатуПокупателю)
		Или ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.ОтчетКомитентуОПродажах) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_СчетаНаОплату_ОтчетКомитентуОПродажах(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапроса_АктыСверок(Запросы, ОписаниеВидаПакета)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.АктСверкиВзаиморасчетов) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьЗапросПоВидуПакетуПакета(Запросы, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	ЭтоИсправление = ЭтоИсправительныйВидПакета(ВидПакетаID);
	
	Если ВидПакетаID = "ID_ОсновнойПакет"
		ИЛИ ВидПакетаID = "ID_УПД"
		ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_НаРеализацию(
			Запросы,
			ОписаниеВидаПакета,
			ЭтоИсправление
		);
		
		ДобавитьТекстЗапроса_СчетаФактурыПоОтчетуКомиссионера_НаРеализацию(Запросы, ОписаниеВидаПакета);
		
	ИначеЕсли ВидПакетаID = "ID_УКД"
		ИЛИ ВидПакетаID = "ID_УКД_раздельно"
		ИЛИ ВидПакетаID = "ID_КСФ" Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_Корректировочный(
			Запросы,
			ОписаниеВидаПакета,
			ЭтоИсправление
		);
		
		ДобавитьТекстЗапроса_СчетаФактурыПоОтчетуКомиссионера_Корректировочный(Запросы, ОписаниеВидаПакета)
		
	ИначеЕсли ВидПакетаID = "ID_УПД_НаАванс"
		ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_НаАванс(
			Запросы,
			ОписаниеВидаПакета,
			ЭтоИсправление
		);
		
		Если ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента") <> Неопределено Тогда
			
			ДобавитьТекстЗапроса_СчетаФактуры_НаАвансКомитента(
				Запросы,
				ОписаниеВидаПакета,
				ЭтоИсправление
			);
			
		КонецЕсли;
		
		ДобавитьТекстЗапроса_СчетаФактурыПоОтчетуКомиссионера_НаАванс(Запросы, ОписаниеВидаПакета);
		
	ИначеЕсли ВидПакетаID = "ID_ИУПД"
		ИЛИ ВидПакетаID = "ID_ИУПД_раздельно"
		ИЛИ ВидПакетаID = "ID_ИСФ" Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_НаРеализацию(
			Запросы,
			ОписаниеВидаПакета,
			ЭтоИсправление
		);
		
	ИначеЕсли ВидПакетаID = "ID_ИУКД"
		ИЛИ ВидПакетаID = "ID_ИУКД_раздельно"
		ИЛИ ВидПакетаID = "ID_ИКСФ" Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_Корректировочный(
			Запросы,
			ОписаниеВидаПакета,
			ЭтоИсправление
		);
		
	ИначеЕсли ВидПакетаID = "ID_ИУПД_НаАванс"
		ИЛИ ВидПакетаID = "ID_ИСФ_НаАванс" Тогда
		
		ДобавитьТекстЗапроса_СчетаФактуры_НаАванс(
			Запросы,
			ОписаниеВидаПакета,
			ЭтоИсправление
		);
		
	ИначеЕсли ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС"
		ИЛИ ВидПакетаID = "ID_УПД_БезНДС"
		ИЛИ ВидПакетаID = "ID_ИУПД_БезНДС"
		ИЛИ ВидПакетаID = "ID_УКД_БезНДС" Тогда
		
		ДобавитьТекстЗапроса_ПервичныеДокументыБезНДС(Запросы, ОписаниеВидаПакета);
		
	ИначеЕсли ВидПакетаID = "ID_Счет"
		ИЛИ ВидПакетаID = "ID_СчетФормализованный"
		ИЛИ ВидПакетаID = "ID_СчетФормализованныйФНС"
		ИЛИ ВидПакетаID = "ID_СчетОфертаФормализованныйФНС" Тогда
		
		ИспользуютсяТолькоОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
		
		Если ИспользуютсяТолькоОснованияПоУмолчанию Тогда
			
			ДобавитьТекстЗапроса_СчетаНаОплату(Запросы, ОписаниеВидаПакета)
			
		Иначе
			
			ТипОснования_СчетНаОплату 		= ТипОснованияСчетаНаОплату_СчетНаОплату();
			ТипОснования_ДокументПродажи	= ТипОснованияСчетаНаОплату_ДокументПродажи();
			
			ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
				Запросы,
				ОписаниеВидаПакета,
				"СчетНаОплатуПокупателю",
				ТипОснования_СчетНаОплату
			);
			ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
				Запросы,
				ОписаниеВидаПакета,
				"РеализацияТоваровУслуг",
				ТипОснования_ДокументПродажи
			);
			ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
				Запросы,
				ОписаниеВидаПакета,
				"РеализацияУслугПоПереработке",
				ТипОснования_ДокументПродажи
			);
			ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
				Запросы, 
				ОписаниеВидаПакета,
				"КорректировкаРеализации",
				ТипОснования_ДокументПродажи
			);
			ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
				Запросы,
				ОписаниеВидаПакета,
				"АктОбОказанииПроизводственныхУслуг",
				ТипОснования_ДокументПродажи
			);
			ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
				Запросы,
				ОписаниеВидаПакета,
				"ПередачаОС",
				ТипОснования_ДокументПродажи
			);
			
			ДобавитьТекстЗапроса_СчетаНаОплату_ОтчетКомитентуОПродажах(Запросы, ОписаниеВидаПакета);
			
			// Аренда
			Если Метаданные.Документы.Найти("АР_СчетНаАренду") <> Неопределено Тогда
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
					Запросы,
					ОписаниеВидаПакета,
					"АР_СчетНаАренду",
					ТипОснования_СчетНаОплату
				);
			КонецЕсли;
			
			Если Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено Тогда
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(
					Запросы,
					ОписаниеВидаПакета,
					"АР_НачислениеАренднойПлаты",
					ТипОснования_ДокументПродажи
				);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидПакетаID = "ID_АктСверки"
		ИЛИ ВидПакетаID = "ID_АктСверкиФормализованный" Тогда
		
		ДобавитьТекстЗапроса_АктыСверок(Запросы, ОписаниеВидаПакета);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК Документ,
		|	СчетФактура.Номер КАК НомерДокумента,
		|	СчетФактура.Дата КАК ДатаДокумента,
		|	СчетФактура.Контрагент КАК Контрагент,
		|	СчетФактура.Организация КАК Организация,
		|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И СчетФактура.Проведен
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И НЕ СчетФактура.Исправление
		|	И &ДополнительныеОтборы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Номер,
		|	СчетФактура.Дата,
		|	СчетФактура.Контрагент,
		|	СчетФактура.Организация,
		|	СчетФактура.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И НЕ СчетФактура.ПометкаУдаления
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И НЕ СчетФактура.Исправление
		|	И &ДополнительныеОтборы";
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат,
				"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
				"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат,
				"НЕ СчетФактура.Исправление",
				"СчетФактура.Исправление");
		
	КонецЕсли;
	
	ТекстЗапросаДополнительныеОтборы = ТекстЗапроса_ДополнительныеОтборыСчетаФактуры();
	
	Результат = СтрЗаменить(Результат, "&ДополнительныеОтборы", ТекстЗапросаДополнительныеОтборы);
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "НаРеализацию", ВидСчетаФактуры);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДополнительныеОтборыСчетаФактуры()
	
	Результат = "НЕ СчетФактура.ДокументОснование Ссылка Документ.ОтчетКомиссионераОПродажах";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета, ВидСчетаФактуры)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетФактурыПоОтчетуКомиссионера.Документ КАК Документ,
		|	СчетФактурыПоОтчетуКомиссионера.НомерДокумента КАК НомерДокумента,
		|	СчетФактурыПоОтчетуКомиссионера.ДатаДокумента КАК ДатаДокумента,
		|	СчетФактурыПоОтчетуКомиссионера.Контрагент КАК Контрагент,
		|	СчетФактурыПоОтчетуКомиссионера.Организация КАК Организация,
		|	СчетФактурыПоОтчетуКомиссионера.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	ВТ_СчетФактурыПоОтчетуКомиссионера КАК СчетФактурыПоОтчетуКомиссионера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактурыПоОтчетуКомиссионера.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактурыПоОтчетуКомиссионера.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактурыПоОтчетуКомиссионера.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И СчетФактурыПоОтчетуКомиссионера.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И ВЫБОР
		|			КОГДА ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СчетФактурыПоОтчетуКомиссионера.Проведен
		|		КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "НаРеализацию", ВидСчетаФактуры);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ВТ_ДокументыБезНДС.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";
	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(Результат,
				"И (ВТ_ДокументыБезНДС.ЭтоИсправление)",
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоИсправление)");
	КонецЕсли;
	
	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		Результат = СтрЗаменить(Результат,
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)",
				"И (ВТ_ДокументыБезНДС.ЭтоКорректировка)");
	КонецЕсли;
	
	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат,
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
		|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
		|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
		|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
		|	СчетНаОплатуПокупателю.Организация КАК Организация,
		|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И СчетНаОплатуПокупателю.Проведен
		|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка,
		|	СчетНаОплатуПокупателю.Номер,
		|	СчетНаОплатуПокупателю.Дата,
		|	СчетНаОплатуПокупателю.Контрагент,
		|	СчетНаОплатуПокупателю.Организация,
		|	СчетНаОплатуПокупателю.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";
	
	ТекстЗапросаСчетНаАренду = ТекстЗапроса_АР_СчетНаАренду();
	Если ЗначениеЗаполнено(ТекстЗапросаСчетНаАренду) Тогда
		
		Результат = Результат
			+ ТекстЗапроса_ОбъединитьВсе()
			+ ТекстЗапросаСчетНаАренду;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Запросы, ОписаниеВидаПакета, ИмяТаблицыМетаданных, ЗначениеОснования)
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяТаблицыМетаданных);
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(МетаданныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка 			КАК Документ,
		|	ТаблицаДокумент.Номер 			КАК НомерДокумента,
		|	ТаблицаДокумент.Дата 			КАК ДатаДокумента,
		|	ТаблицаДокумент.Контрагент 		КАК Контрагент,
		|	ТаблицаДокумент.Организация 	КАК Организация,
		|	ТаблицаДокумент.СуммаДокумента 	КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Проведен
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка,
		|	ТаблицаДокумент.Номер,
		|	ТаблицаДокумент.Дата,
		|	ТаблицаДокумент.Контрагент,
		|	ТаблицаДокумент.Организация,
		|	ТаблицаДокумент.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыМетаданных", "Документ." + ИмяТаблицыМетаданных);
	
	ВидДокументаID = ВидДокументаIDПоВидуПакетаID(ВидПакетаID);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДокументаID", """" + ВидДокументаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеНастройкиФормироватьНаОсновании", """" + ЗначениеОснования + """");
	
	ТекстЗапроса = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета);
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ВидДокументаIDПоВидуПакетаID(ВидПакетаID)
	
	Результат = "";
	
	Если 	ВидПакетаID = "ID_Счет"
		Или ВидПакетаID = "ID_СчетФормализованный"
		Или ВидПакетаID = "ID_СчетФормализованныйФНС"
		Или ВидПакетаID = "ID_СчетОфертаФормализованныйФНС" Тогда
		
		Результат = ВидПакетаID;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату_ОтчетКомитентуОПродажах(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка 			КАК Документ,
		|	ТаблицаДокумент.Номер 			КАК НомерДокумента,
		|	ТаблицаДокумент.Дата 			КАК ДатаДокумента,
		|	ТаблицаДокумент.Контрагент 		КАК Контрагент,
		|	ТаблицаДокумент.Организация 	КАК Организация,
		|	ТаблицаДокумент.СуммаВознаграждения 	КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТКэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = ВТКэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = ВТКэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТКэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК ВТКэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = ВТКэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = ВТКэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ТаблицаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
		|	И ТаблицаДокумент.СпособРасчетаКомиссионногоВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
		|	И ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ ВТКэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ВТКэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И ВТКэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Проведен
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка,
		|	ТаблицаДокумент.Номер,
		|	ТаблицаДокумент.Дата,
		|	ТаблицаДокумент.Контрагент,
		|	ТаблицаДокумент.Организация,
		|	ТаблицаДокумент.СуммаВознаграждения,
		|	&ВидПакетаID
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТКэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = ВТКэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = ВТКэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТКэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК ВТКэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = ВТКэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = ВТКэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ТаблицаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
		|	И ТаблицаДокумент.СпособРасчетаКомиссионногоВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
		|	И ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВТКэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ВТКэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И ВТКэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	ВидДокументаID = ВидДокументаIDПоВидуПакетаID(ВидПакетаID);
	Результат = СтрЗаменить(Результат, "&ВидДокументаID", """" + ВидДокументаID + """");
	Результат = СтрЗаменить(Результат, "&ЗначениеНастройкиФормироватьНаОсновании", """" + "ДокументПродажи" + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АР_СчетНаАренду()
	
	Если Метаданные.Документы.Найти("АР_СчетНаАренду") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	АР_СчетНаАренду.Ссылка КАК Документ,
	|	АР_СчетНаАренду.Номер КАК НомерДокумента,
	|	АР_СчетНаАренду.Дата КАК ДатаДокумента,
	|	АР_СчетНаАренду.Контрагент КАК Контрагент,
	|	АР_СчетНаАренду.Организация КАК Организация,
	|	АР_СчетНаАренду.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.АР_СчетНаАренду КАК АР_СчетНаАренду
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АР_СчетНаАренду.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АР_СчетНаАренду.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АР_СчетНаАренду.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И АР_СчетНаАренду.Проведен
	|	И АР_СчетНаАренду.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АР_СчетНаАренду.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АР_СчетНаАренду.Ссылка,
	|	АР_СчетНаАренду.Номер,
	|	АР_СчетНаАренду.Дата,
	|	АР_СчетНаАренду.Контрагент,
	|	АР_СчетНаАренду.Организация,
	|	АР_СчетНаАренду.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.АР_СчетНаАренду КАК АР_СчетНаАренду
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АР_СчетНаАренду.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АР_СчетНаАренду.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АР_СчетНаАренду.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И АР_СчетНаАренду.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АР_СчетНаАренду.ПометкаУдаления";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
		|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
		|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
		|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
		|	АктСверкиВзаиморасчетов.Организация КАК Организация,
		|	0 КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И АктСверкиВзаиморасчетов.Проведен
		|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
		|	&ЭтоДокументКонтрагента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктСверкиВзаиморасчетов.Ссылка,
		|	АктСверкиВзаиморасчетов.Номер,
		|	АктСверкиВзаиморасчетов.Дата,
		|	АктСверкиВзаиморасчетов.Контрагент,
		|	АктСверкиВзаиморасчетов.Организация,
		|	0,
		|	&ВидПакетаID
		|ИЗ
		|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
		|	&ЭтоДокументКонтрагента";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов3_0_131(Результат);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов3_0_131(ТекстЗапроса)
	
	ЭтоДокументКонтрагента = "";
	Если ИспользуетсяАктСверкиВзаиморасчетов3_0_131() Тогда
		ЭтоДокументКонтрагента = "И НЕ АктСверкиВзаиморасчетов.ЭтоДокументКонтрагента";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоДокументКонтрагента", ЭтоДокументКонтрагента);
	
КонецПроцедуры

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	ОсновнойПакет = КатегорииПакетов_Основная();
	
	ПодстрокаПоиска = "&УсловиеСвязиПоКатегорииПакета";
	
	Если ЗначениеЗаполнено(КатегорияПакета) Тогда
		ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """"
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета ЕСТЬ NULL";
	Иначе
		ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID
			+ " ИЛИ ОтправленныеДокументы.ВидПакета ЕСТЬ NULL";
	КонецЕсли;
	
	Если КатегорияПакета = КатегорииПакетов_СчетаНаОплату() Тогда
		
		ПодстрокаЗамены = ПодстрокаЗамены
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета = """ + ОсновнойПакет + """";
		
		ИспользоватьСХ2 = НЕ ОсновнойМодуль.ИспользоватьПодсистемуДиадока();
		ОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
		
		Если ИспользоватьСХ2 И ОснованияПоУмолчанию Тогда
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Результат = Ядро.СписокНаОтправку_ТекстЗапроса_ВременныеТаблицы();
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВТДокументыБезНДС()
	
	ОсновнойЗапрос = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.ЭтоИсправление,
	|	ВТ_ПодходящиеДокументы.ЭтоКорректировка,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL"; 
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(ОсновнойЗапрос);
	
	Если Не ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.КорректировкаРеализации) Тогда
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ДокументыБезСФ_ДобавитьТекстЗапросаПОКРТУКомиссионера());
	КонецЕсли;
	
	Если Не ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.ОтчетКомитентуОПродажах) Тогда
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ДокументыБезСФ_ДобавитьТекстЗапроса_ОтчетКомитентуОПродажах());
	КонецЕсли;
	
	Если Не ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.ПередачаТоваров) Тогда
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ДокументыБезСФ_ДобавитьТекстЗапроса_ПередачаТоваров());
	КонецЕсли;
	
	Результат = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса)
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.СчетФактураВыданный)
		Или ЗапрещеноЧтениеТаблицыДанныхДокумента(Метаданные.Документы.ОтчетКомиссионераОПродажах) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаВременныхТаблиц = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактура.Ссылка КАК Документ,
		|	СчетФактура.Проведен КАК Проведен,
		|	СчетФактура.Номер КАК НомерДокумента,
		|	СчетФактура.Дата КАК ДатаДокумента,
		|	ОтчетКомиссионера.Контрагент КАК Контрагент,
		|	СчетФактура.Организация КАК Организация,
		|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
		|	СчетФактура.СводныйКомиссионный КАК Сводный,
		|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры
		|ПОМЕСТИТЬ ВТ_СчетФактурыПоОтчетуКомиссионера
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионера
		|		ПО СчетФактура.ДокументОснование = ОтчетКомиссионера.Ссылка
		|ГДЕ
		|	СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетФактура.СводныйКомиссионный
		|	И НЕ СчетФактура.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапросаВременныхТаблиц;
	
КонецПроцедуры

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктОбОказанииПроизводственныхУслуг", "Услуги");
	
	ТекстОтбораДокументов = ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураТребуется("ТабличнаяЧасть.Ссылка");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Товары", ТекстОтбораДокументов);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Услуги");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "АгентскиеУслуги");
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииОтгруженныхТоваров(Запросы);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПоПереработке", "Услуги");
	
	Если Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено Тогда
		ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АР_НачислениеАренднойПлаты", "Состав");
	КонецЕсли;
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ПередачаОС", "ОС");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Услуги", ТекстОтбораДокументов, "Истина");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, , "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Услуги", ТекстОтбораДокументов, , "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "АгентскиеУслуги", ТекстОтбораДокументов, , "Истина");
	
	ДокументыБезСФ_ДобавитьТекстЗапросаПоРТУ(Запросы);
	ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратам(Запросы);
	
	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь", Корректировка = "Ложь")
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ВидДокумента);
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(МетаданныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если МетаданныеДокумента.ТабличныеЧасти.Найти(ТабличнаяЧасть) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК ЭтоИсправление,
	|	&Корректировка КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
	
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	Результат = СтрЗаменить(Результат, "&Корректировка", Корректировка);
	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);
	
КонецПроцедуры

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)";
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоРТУ(Запросы)

	ИмяОбъектаМетаданных = "Документ.РеализацияТоваровУслуг";
	
	ТекстЗапроса = ТекстыЗапросов_ВыборкаДокументовЗаПериод(ИмяОбъектаМетаданных);
	
	ДополнительныеУсловия = ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураНеТребуется("Док");
	
	ТекстЗапроса = ТекстЗапроса + " И " + ДополнительныеУсловия;
	
	ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса);
	
КонецПроцедуры    

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратам(Запросы)
	
	ОбъектМетаданных = Метаданные.Документы.ВозвратТоваровПоставщику;
	
	Если Не РазрешеноЧтениеТаблицы(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстыЗапросов_ВыборкаДокументовЗаПериод(ОбъектМетаданных.ПолноеИмя());
	
	ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса);
	
КонецПроцедуры

Функция ДокументыБезСФ_ДобавитьТекстЗапросаПОКРТУКомиссионера()
	
	Результат = 
	"ВЫБРАТЬ
	|КРТУ.Ссылка КАК Документ,
	|ВЫБОР
	|	КОГДА КРТУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК ЭтоИсправление,
	|ВЫБОР
	|	КОГДА КРТУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|		ТОГДА ЛОЖЬ
	|	ИНАЧЕ ИСТИНА
	|КОНЕЦ КАК ЭтоКорректировка,
	|КРТУ.Проведен КАК Проведен,
	|КРТУ.Номер КАК НомерДокумента,
	|КРТУ.Дата КАК ДатаДокумента,
	|КРТУ.Контрагент КАК Контрагент,
	|КРТУ.Организация КАК Организация,
	|КРТУ.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КРТУ
	|ГДЕ
	|	КРТУ.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|	И КРТУ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ КРТУ.ПометкаУдаления";
	
	Возврат Результат;
	
КонецФункции

Функция ДокументыБезСФ_ДобавитьТекстЗапроса_ОтчетКомитентуОПродажах()
	
	Результат = 
	"ВЫБРАТЬ
	|	ОТОП.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	ОТОП.Проведен КАК Проведен,
	|	ОТОП.Номер КАК НомерДокумента,
	|	ОТОП.Дата КАК ДатаДокумента,
	|	ОТОП.Контрагент КАК Контрагент,
	|	ОТОП.Организация КАК Организация,
	|	ОТОП.СуммаВознаграждения КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОТОП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ТоварыДокумента
	|		ПО ОТОП.Ссылка = ТоварыДокумента.Ссылка
	|ГДЕ
	|	НЕ ОТОП.ПометкаУдаления
	|	И ОТОП.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ОТОП.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТоварыДокумента.СуммаВознаграждения > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОТОП.Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ДокументыБезСФ_ДобавитьТекстЗапроса_ПередачаТоваров()
	
	Результат = 
	"ВЫБРАТЬ
	|	ШапкаПередачаТоваров.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	ШапкаПередачаТоваров.Проведен КАК Проведен,
	|	ШапкаПередачаТоваров.Номер КАК НомерДокумента,
	|	ШапкаПередачаТоваров.Дата КАК ДатаДокумента,
	|	ШапкаПередачаТоваров.Контрагент КАК Контрагент,
	|	ШапкаПередачаТоваров.Организация КАК Организация,
	|	СУММА(ТоварПередачаТоваров.Сумма) КАК СуммаДокумента
	|ИЗ
	|	Документ.ПередачаТоваров.Товары КАК ТоварПередачаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваров КАК ШапкаПередачаТоваров
	|		ПО ТоварПередачаТоваров.Ссылка = ШапкаПередачаТоваров.Ссылка
	|ГДЕ
	|	НЕ ШапкаПередачаТоваров.ПометкаУдаления
	|	И ТоварПередачаТоваров.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ШапкаПередачаТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШапкаПередачаТоваров.Ссылка,
	|	ШапкаПередачаТоваров.Проведен,
	|	ШапкаПередачаТоваров.Номер,
	|	ШапкаПередачаТоваров.Дата,
	|	ШапкаПередачаТоваров.Контрагент,
	|	ШапкаПередачаТоваров.Организация";
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииОтгруженныхТоваров(Запросы)
	
	ОбъектМетаданных = Метаданные.Документы.РеализацияОтгруженныхТоваров;
	
	Если ЗапрещеноЧтениеТаблицыДанныхДокумента(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Реквизиты
	|		ПО ТабличнаяЧасть.Ссылка = Реквизиты.ДокументОтгрузки
	|ГДЕ
	|	НЕ Реквизиты.ПометкаУдаления
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса);
	
КонецПроцедуры

Функция ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураНеТребуется(ПсевдонимТаблицы)
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПродажаКомиссия)"); 
	
	Если ИспользуетсяРеализацияЧерезПередачуТоваров() Тогда 
		ВидыОпераций.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПередачаТоваров)");
	КонецЕсли;
	
	ШаблонУсловия = "%1.ВидОперации В (%2)";
	
	ВидыИсправленийСтрокой = СтрСоединить(ВидыОпераций, ",");
	
	Результат = СтрШаблон(ШаблонУсловия, ПсевдонимТаблицы, ВидыИсправленийСтрокой);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураТребуется(ПсевдонимТаблицы)
	
	ОсновноеУсловие = ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураНеТребуется(ПсевдонимТаблицы);
	
	ШаблонУсловия = " И НЕ (%1)";
	
	Результат = СтрШаблон(ШаблонУсловия, ОсновноеУсловие);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстыЗапросов_ВыборкаДокументовЗаПериод(ИмяОбъектаМетаданных)

	Результат = 
	"ВЫБРАТЬ
	|	Док.Ссылка 	КАК Документ,
	|	0 			КАК ВсегоПозиций,
	|	0 			КАК ПозицийБезНДС,
	|	Ложь 		КАК ЭтоИсправление,
	|	Ложь 		КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Результат = СтрЗаменить(Результат, "&Таблица", ИмяОбъектаМетаданных);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса)
	
	Если Запросы.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	ИначеЕсли TypeNamedId = "InvoiceCorrection" ИЛИ TypeNamedId = "InvoiceCorrectionRevision" Тогда
		Результат = "КСЧФ";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияДляКоторойСчетФактураНеТребуется(Документ1С)
	
	ВидОперацииДокумента = ЗначениеРеквизитаОбъектаЛок(Документ1С, "ВидОперации");
	
	ВидыОпераций = Новый Массив;
	
	Если ИспользуетсяРеализацияЧерезПередачуТоваров() Тогда
		ВидыОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ПередачаТоваров"));
	КонецЕсли;
	
	Если ЭтоОтгрузкаБезПереходаправаСобственности(Документ1С)
		И НЕ ДляОтгрузкиБезПереходаПраваСобственностиНачисляетсяНДС(Документ1С) Тогда
		ВидыОпераций.Добавить(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности")
		);
	КонецЕсли;
	
	Результат = ВидыОпераций.Найти(ВидОперацииДокумента) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  НомерДокумента - Строка - Номер документа учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПредставлениеНомера(НомерДокумента)
	
	УдалитьПрефиксИнформационнойБазы	= Истина;
	УдалитьПользовательскийПрефикс		= Ложь;
	
	МодульПрефиксацияОбъектов = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
	Результат = МодульПрефиксацияОбъектов.НомерНаПечать(НомерДокумента, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
				
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяРеализацияЧерезПередачуТоваров()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (СравнитьВерсии_(ВерсияБП, "3.0.116") > 0);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяАктСверкиВзаиморасчетов3_0_131()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = СравнитьВерсии_(ВерсияБП, "3.0.131") >= 0;
	
	Возврат Результат;
	
КонецФункции

Функция СравнитьВерсии_(Знач Версия1, Знач Версия2)
	Результат = Ядро.СравнитьВерсии(Версия1, Версия2);
	Возврат Результат;
КонецФункции

Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Результат = Ядро.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	Возврат Результат;
КонецФункции

Функция ЗначениеВМассивЛок(Значение)
	
	Результат = Ядро.ЗначениеВМассив(Значение);
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа СчетНаОплату
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_СчетНаОплату()
	
	Возврат "СчетНаОплату";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документов продажи
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ДокументПродажи()
	
	Возврат "ДокументПродажи";
	
КонецФункции

Функция Новый_ЭлементПротоКонтента(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства
	);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

Функция ПривестиКЧислуЛок(Значение)
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(ИсточникДанных, ИмяСвойства)

	МодульОбщегоНазначенияКлиентСервер = ОбщийМодульПоИмениЛок("ОбщегоНазначенияКлиентСервер");
	Результат = МодульОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникДанных, ИмяСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция ДляОтгрузкиБезПереходаПраваСобственностиНачисляетсяНДС(Документ1С)
	
	РеквизитыДокумента = ЗначенияРеквизитовОбъектаЛок(Документ1С, "Организация, Дата");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаНДССрезПоследних.НачислятьНДСПоОтгрузке КАК НачислятьНДСПоОтгрузке
		|ИЗ
		|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(
		|		&Дата,
		|		Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", РеквизитыДокумента.Организация);
	Запрос.УстановитьПараметр("Дата", РеквизитыДокумента.Дата);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Результат = Выборка[0].НачислятьНДСПоОтгрузке;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьНаименованиеПериодическойУслуги(НаименованиеУслуги, ПериодичностьУслуги, ДатаОснования)

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПериодичностьУслуг") Тогда
		НаименованиеУслуги = РаботаСНоменклатуройКлиентСерверБП.СодержаниеУслуги(
			НаименованиеУслуги, ПериодичностьУслуги, ДатаОснования);
	КонецЕсли;
	
КонецПроцедуры

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//****************************************************************************
//{ ПРОТОКОНТЕНТ

#Область УПД970

#Область УПД970_ПрограммныйИнтерфейс

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка				 - ДокументСсылка - ссылка на учетный документ 1С, по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры	 - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаПродавца(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры) Экспорт
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Content = УПД970_КонтентТитулаОтправителя_ВнутренниеПеремещения(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоРеализацииТоваровУслуг(
			ДокСсылка,
			ДополнительныеПараметры);
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоВозвратуТоваровПоставщику(
			ДокСсылка,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоАктуОбОказанииПроизводственныхУслуг(
			ДокСсылка,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоРеализацииУслугПоПереработке(
			ДокСсылка,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПередачаОС") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоПередачеОС(
			ДокСсылка,
			ДополнительныеПараметры);
		
	ИначеЕсли Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено
		И ТипДокумента = Тип("ДокументСсылка.АР_НачислениеАренднойПлаты") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоНачислениюАренднойПлаты(
			ДокСсылка,
			ДополнительныеПараметры);
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			
		Content = УПД970_КонтентТитулаПродавцаПоОтчетуКомитентуОПродажах(
			ДокСсылка,
			ДополнительныеПараметры);
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
		Если ЭтоСчетФактураВыданныйНаАванс(ДокСсылка) Тогда
			
			Content = УПД970_КонтентТитулаПродавцаПоСчетФактураВыданныйНаАванс(
				ДокСсылка,
				ДополнительныеПараметры
			);
			
		Иначе
			
			Content = УПД970_КонтентТитулаПродавцаПоСчетФактураВыданный(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры
			);
			
		КонецЕсли;
			
	ИначеЕсли ЭтоИсправлениеРеализации(ДокСсылка) Тогда
			
		Content = УПД970_КонтентТитулаПродавцаПоКорректировкеРеализации(
			ДокСсылка,
			ДополнительныеПараметры);
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоРеализацииОтгруженныхТоваров(
			ДокСсылка,
			ДополнительныеПараметры);
	
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПередачаТоваров") Тогда
		
		Content = УПД970_КонтентТитулаПродавцаПоПередачеТоваров(
			ДокСсылка,
			ДополнительныеПараметры);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru = 'Неподдерживаемый тип документа %1'");
		ВызватьИсключение СтрШаблон(ШаблонТекстаОшибки, ДокСсылка.Метаданные().Синоним);
		
	КонецЕсли;
	
	Возврат Content;
	
КонецФункции

#КонецОбласти

#Область УПД970_ВнутренниеПеремещения

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка				 - ДокументСсылка - ссылка на учетный документ 1С, по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры	 - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаОтправителя_ВнутренниеПеремещения(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Если ЭтоПередачаТоваровМеждуСотрудниками(ДокСсылка) Тогда
		
		ТекстОшибки = НСтр("ru='Отправка ТОРГ-13 на основании перемещения товаров между сотрудниками не поддержана'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ДанныеДокумента = УПД970_ПолучитьДанныеПоДокументуПеремещениеТоваров(ДокСсылка);
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТаблицаДокумента = ДанныеДокумента.ТаблицаДокумента;
	ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета();
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Content = УПД970_НовыйПротоСтруктураУПД970();
	Content.Function = "ДОП";
	Content.CircumFormatInvoice = "00051";
	Content.DocumentNumber = ДанныеШапки.Номер;
	Content.DocumentDate = ДанныеШапки.Дата;
	Content.DocumentName = НаименованияДокументов.УПД;
	
	РеквизитыДокументов = Новый Структура;
	РеквизитыДокументов.Вставить("НомерДокумента", Content.DocumentNumber);
	РеквизитыДокументов.Вставить("ДатаДокумента", Content.DocumentDate);
	РеквизитыДокументов.Вставить("НаименованиеДокумента", Content.DocumentName);
	
	DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(РеквизитыДокументов);
	Content.DocumentShipments.Добавить(DocumentShipment);
	
	Content.Currency = ВалютаРегламентированногоУчета.Код;
	
	ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДанныеШапки.Дата);
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеШапки.Организация, "Ссылка, КПП");
	
	ВнутренниеПеремещения_ЗаполнитьSeller(Content, ДанныеУчастникаЭДО, РеквизитыОрганизации);
	ВнутренниеПеремещения_ЗаполнитьBuyer(Content, ДанныеУчастникаЭДО, РеквизитыОрганизации);
	
	Грузоотправитель = ДанныеШапки.Организация;
	Если ЗначениеЗаполнено(ДанныеШапки.ПодразделениеОтправитель) Тогда
		Грузоотправитель = ДанныеШапки.ПодразделениеОтправитель;
	КонецЕсли;
	ВнутреннееПеремещение_ЗаполнитьГрузоотправителя(Content, Грузоотправитель, ДанныеШапки.Дата);
	Content.Shippers[0].OrganizationInfo.Department = ДанныеШапки.Поставщик;
	
	Грузополучатель = ДанныеШапки.Организация;
	Если ЗначениеЗаполнено(ДанныеШапки.ПодразделениеПолучатель) Тогда
		Грузополучатель = ДанныеШапки.ПодразделениеПолучатель;
	КонецЕсли;
	ВнутреннееПеремещение_ЗаполнитьГрузополучателя(Content, Грузополучатель, ДанныеШапки.Дата);
	Content.Consignees[0].Department = ДанныеШапки.Покупатель;
	
	ВнутренниеПеремещения_ЗаполнитьTableInvoice(Content, ТаблицаДокумента, ДокСсылка);
	ВнутренниеПеремещения_ЗаполнитьTransferInfo(Content, ДополнительныеПараметры);
	ВнутренниеПеремещения_ЗаполнитьEmployee(Content, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Content);
	УПД970_ЗаполнитьСведенияОМаркировке(Content, ДокСсылка);
	УПД970_ЗаполнитьСоставителяДокумента(Content, ДокСсылка);
	
	Возврат Content;
	
КонецФункции

Функция УПД970_ПолучитьДанныеПоДокументуПеремещениеТоваров(ДокСсылка)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокСсылка);
	
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	
	ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	
	ТекстЗапроса = ТекстЗапроса_ДанныеПоПеремещениюТоваров();
	
	ФормированиеЭД = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", ДополнительнаяКолонкаПечатныхФормДокументов);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатЗапроса[1].Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТаблицаДокумента", ТаблицаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеПоПеремещениюТоваров()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.ПодразделениеОтправитель КАК ПодразделениеОтправитель,
	|	ПеремещениеТоваров.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
	|	ПеремещениеТоваров.СкладОтправитель.Представление КАК Поставщик,
	|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
	|	ПеремещениеТоваров.СкладПолучатель.Представление КАК Покупатель,
	|	ПеремещениеТоваров.ВидОперации КАК ВидОперации,
	|	ПеремещениеТоваров.СотрудникОтправитель КАК СотрудникОтправитель,
	|	ПеремещениеТоваров.СотрудникПолучатель КАК СотрудникПолучатель,
	|	ПеремещениеТоваров.СотрудникОтправитель.Представление КАК СотрудникОтправительПредставление,
	|	ПеремещениеТоваров.СотрудникПолучатель.Представление КАК СотрудникПолучательПредставление
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеТоваров.Дата,
	|	ПеремещениеТоваров.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.НаименованиеПолное КАК ТоварНаименованиеПолное,
	|	Товары.Номенклатура.Наименование КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА Товары.Номенклатура.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА Товары.Номенклатура.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ КАК Артикул,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоМест КАК КоличествоМест,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ВЫБОР
	|		КОГДА Товары.ЦенаВРознице > 0
	|			ТОГДА Товары.ЦенаВРознице
	|		ИНАЧЕ Товары.Цена
	|	КОНЕЦ КАК Цена,
	|	Товары.СтавкаНДСВРознице КАК СтавкаНДС,
	|	Товары.СуммаВРознице КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	1 КАК ID,
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Номенклатура.НаименованиеПолное,
	|	Товары.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА Товары.Номенклатура.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА Товары.Номенклатура.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ,
	|	Товары.Количество,
	|	Товары.Количество,
	|	Товары.Номенклатура.ЕдиницаИзмерения,
	|	Товары.Номенклатура.ЕдиницаИзмерения,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	Товары.НомерСтроки,
	|	2,
	|	Товары.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ID,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Процедура ВнутренниеПеремещения_ЗаполнитьSeller(Content, Знач ДанныеУчастникаЭДО, Знач РеквизитыОрганизации)
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, ДанныеУчастникаЭДО);
	
	Seller.Kpp = РеквизитыОрганизации.КПП;
	
	СведенияОбАдресе = УПД970_СведенияОбАдресе(ДанныеУчастникаЭДО.ЮридическийАдресJSON);
	Seller.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
	
	Seller.СлужебнаяИнформация.Ссылка = РеквизитыОрганизации.Ссылка;
	
	Content.Sellers.Добавить(Seller);
	
КонецПроцедуры

Процедура ВнутренниеПеремещения_ЗаполнитьBuyer(Content, Знач ДанныеУчастникаЭДО, Знач РеквизитыОрганизации)
		
	Buyer = Контракт_ExtendedOrganizationInfo970();
	
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, ДанныеУчастникаЭДО);
	
	Buyer.Kpp = РеквизитыОрганизации.КПП;
	
	СведенияОбАдресе = УПД970_СведенияОбАдресе(ДанныеУчастникаЭДО.ЮридическийАдресJSON);
	Buyer.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
	
	Buyer.СлужебнаяИнформация.Ссылка = РеквизитыОрганизации.Ссылка;
	Content.Buyers.Добавить(Buyer);
		
КонецПроцедуры

Процедура ВнутреннееПеремещение_ЗаполнитьГрузоотправителя(
			Content, 
			Знач Грузоотправитель, 
			Знач ДатаСведений)
			
	Shipper = Контракт_Shipper970();
	Shipper.SameAsSeller = Ложь;
	
	ЭтоОбособленноеПодразделение = (ТипЗнч(Грузоотправитель) <> Тип("СправочникСсылка.Организации"))
		И Грузоотправитель.ОбособленноеПодразделение;
	
	ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Грузоотправитель, ДатаСведений);
	
	ShipperInfo = Контракт_ExtendedOrganizationInfo970();
	Shipper.OrganizationInfo = ShipperInfo;
	
	УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, ДанныеУчастникаЭДО);
	
	Если ЭтоОбособленноеПодразделение Тогда
		
		Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.КПП)
			И Content.Sellers[0].Kpp <> ДанныеУчастникаЭДО.КПП Тогда
			Content.Sellers[0].Kpp = ДанныеУчастникаЭДО.КПП;
		КонецЕсли;
		
		ShipperInfo.Name = ДанныеУчастникаЭДО.НаименованиеПодразделения;
		
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактическийАдресПодразделенияОрганизаций;
		
		ИнтерфейсБП = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформациейБП");
		СтруктураАдреса = ИнтерфейсБП.АдресСтруктурой(
			Грузоотправитель,
			ВидКонтактнойИнформации,
			ДатаСведений);
			
		СведенияОбАдресе = УПД970_СведенияОбАдресе(СтруктураАдреса.ЗначениеJSON);
		ShipperInfo.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
		
	КонецЕсли;
	
	ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель;
	
	Content.Shippers.Добавить(Shipper);
	
КонецПроцедуры

Процедура ВнутреннееПеремещение_ЗаполнитьГрузополучателя(
			Content, 
			Знач Грузополучатель, 
			Знач ДатаСведений)
			
	Consignee = Контракт_ExtendedOrganizationInfo970();
	
	ЭтоОбособленноеПодразделение = (ТипЗнч(Грузополучатель) <> Тип("СправочникСсылка.Организации"))
		И Грузополучатель.ОбособленноеПодразделение;
	
	ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Грузополучатель, ДатаСведений);
	
	УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, ДанныеУчастникаЭДО);
	
	Если ЭтоОбособленноеПодразделение Тогда
		
		Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.КПП)
			И Content.Buyers[0].Kpp <> ДанныеУчастникаЭДО.КПП Тогда
			Content.Buyers[0].Kpp = ДанныеУчастникаЭДО.КПП;
		КонецЕсли;
		
		Consignee.Name = ДанныеУчастникаЭДО.НаименованиеПодразделения;
		
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактическийАдресПодразделенияОрганизаций;
		
		ИнтерфейсБП = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформациейБП");
		СтруктураАдреса = ИнтерфейсБП.АдресСтруктурой(
			Грузополучатель,
			ВидКонтактнойИнформации,
			ДатаСведений);
			
		СведенияОбАдресе = УПД970_СведенияОбАдресе(СтруктураАдреса.ЗначениеJSON);
		Consignee.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
		
	КонецЕсли;
	
	Consignee.СлужебнаяИнформация.Ссылка = Грузополучатель;
	
	Content.Consignees.Добавить(Consignee);
	
КонецПроцедуры

Процедура ВнутренниеПеремещения_ЗаполнитьTableInvoice(Content, Знач ТаблицаДокумента, Знач ДокСсылка)
		
	Table = Content.Table;
	
	ВсеСтрокиБезНДС = Истина;
	СтавкаБезНДС = Перечисления.СтавкиНДС.БезНДС;
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	СписокНоменклатуры = ТаблицаДокумента.ВыгрузитьКолонку("Номенклатура");
	
	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ДокСсылка);
	
	ДанныеОбъекта.Склад	= ДокСсылка.СкладОтправитель;
	СоответствиеСведенийОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(
		СписокНоменклатуры, ДанныеОбъекта, Ложь);
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		
		Item = Контракт_Item970();
		
		РеквизитыТовара = СоответствиеСведенийОНоменклатуре.Получить(СтрокаТаблицы.Номенклатура);
		
		Если ЗначениеЗаполнено(РеквизитыТовара.НаименованиеПолное) Тогда
			НаименованиеТовара = РеквизитыТовара.НаименованиеПолное;
		Иначе
			НаименованиеТовара = РеквизитыТовара.Наименование;
		КонецЕсли;
		
		Item.Product = НаименованиеТовара;
		Item.ItemMark = ТипыНоменклатуры.Имущество;
		Item.ItemVendorCode = СтрокаТаблицы.Артикул;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			Item.Quantity = СтрокаТаблицы.Количество;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			Item.UnitName = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения.Наименование);
			Item.Unit = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения.Код);
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиБезНДС();
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		Item.Price = СтрокаТаблицы.Цена;
		Item.Subtotal = СтрокаТаблицы.Сумма;
		Item.Vat = 0;
		Item.SubtotalWithVatExcluded = Item.Subtotal - Item.Vat;
		
		ВнутренниеПеремещения_ЗаполнитьCustomDeclaration(Item, РеквизитыТовара);
		
		Item.СлужебнаяИнформация = ВнутренниеПеремещения_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы, ДокСсылка);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.TotalNet = ТаблицаДокумента.Итог("Количество");
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	Table.Vat = 0;
	Table.Total = ТаблицаДокумента.Итог("Сумма");
	Table.TotalWithVatExcluded = Table.Total - Table.Vat;
	
КонецПроцедуры

Процедура ВнутренниеПеремещения_ЗаполнитьCustomDeclaration(Item, СтрокаТаблицы)
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД)
		И Не ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхождения) Тогда
		Возврат;
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = СтрокаТаблицы.СтранаПроисхождения.Код;
	CustomDeclaration.DeclarationNumber = СокрЛП(СтрокаТаблицы.НомерГТД);
		
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Процедура ВнутренниеПеремещения_ЗаполнитьTransferInfo(Content, Знач ДополнительныеПараметры)
		
	TransferInfo = Content.TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Content.DocumentDate, Content.DocumentShipments);
	
	УПД970_УстановитьЗначениеБезОснованияОтгрузки(TransferInfo);
		
КонецПроцедуры

Процедура ВнутренниеПеремещения_ЗаполнитьEmployee(Content, Знач ДополнительныеПараметры)
		
	ДанныеСотрудника = СвойствоСтруктурыЛок(
	ДополнительныеПараметры,
	"ДанныеСотрудника");
	
	Если ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		
		Content.TransferInfo.Employee = УПД970_ЗаполненныйEmployee(ДанныеСотрудника);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область УПД970_КонтентПоДокументам

Функция УПД970_КонтентТитулаПродавцаПоРеализацииТоваровУслуг(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеРеализацияТоваровУслуг(Документ);
	ФункцияДокумента = ФункцияДокумента_ДОП();
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	СведенияПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;

	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента;
	Результат.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияУПД(ДанныеШапки.ВидДоговора);
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);
	
	Table = Результат.Table;

	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		Item.ItemMark = УПД970_ЗначениеТипаНоменклатуры(СтрокаТаблицы.ЭтоУслуга);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);

		Если СтрокаТаблицы.ПодакцизныйТовар Тогда
			Item.Excise = СтрокаТаблицы.СуммаАкциза;
		КонецЕсли;

		УПД970_ЗаполнитьCustomDeclaration(Item, СтрокаТаблицы.НомерГТД, СтрокаТаблицы.СтранаПроисхожденияКод);
		УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияПрослеживаемости, НуженПересчетВРубли);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	ЕстьТовары = Не УПД970_СодержитТолькоУслуги(ТабличныеДанные);
	Если ЕстьТовары Тогда
		
		УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
		
		СведенияОАдресеДоставки = УПД970_СведенияОбАдресеДоставки(
			ДанныеШапки.АдресДоставки,
			ДанныеШапки.АдресДоставкиЗначение);
		
		УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки, СведенияОАдресеДоставки);
		
	КонецЕсли;
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(Документ);
	Результат.DocumentName = УПД790_НаименованиеДокументаОтгрузки(Table.Items, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	TransferInfo.TransferTextInfo = ДанныеШапки.СведенияОТранспортировке;
	
	Если ЕстьТовары Тогда
		УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры);
	КонецЕсли;
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Результат);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Результат, Документ);
	
	Возврат Результат;

КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоПередачеТоваров(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеПередачаТоваров(Документ);
	ФункцияДокумента = ФункцияДокумента_ДОП();
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	СведенияПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;

	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента;
	Результат.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияУПД(ДанныеШапки.ВидДоговора);
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);
	
	Table = Результат.Table;

	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		Item.ItemMark = УПД970_ЗначениеТипаНоменклатуры(СтрокаТаблицы.ЭтоУслуга);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);

		Если СтрокаТаблицы.ПодакцизныйТовар Тогда
			Item.Excise = СтрокаТаблицы.СуммаАкциза;
		КонецЕсли;

		УПД970_ЗаполнитьCustomDeclaration(Item, СтрокаТаблицы.НомерГТД, СтрокаТаблицы.СтранаПроисхожденияКод);
		УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияПрослеживаемости, НуженПересчетВРубли);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
	
	СведенияОАдресеДоставки = УПД970_СведенияОбАдресеДоставки(
		ДанныеШапки.АдресДоставки,
		ДанныеШапки.АдресДоставкиЗначение);
	
	УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки, СведенияОАдресеДоставки);
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(Документ);
	Результат.DocumentName = УПД790_НаименованиеДокументаОтгрузки(Table.Items, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	TransferInfo.TransferTextInfo = ДанныеШапки.СведенияОТранспортировке;
	
	УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Результат);
	
	Возврат Результат;

КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоРеализацииОтгруженныхТоваров(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеРеализацииОтгруженныхТоваров(Документ);
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	СведенияПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;	
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента_ДОП();
	Результат.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияУПД(ДанныеШапки.ВидДоговора);
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);
	
	Table = Результат.Table;

	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		Item.ItemMark = УПД970_ЗначениеТипаНоменклатуры(СтрокаТаблицы.ЭтоУслуга);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);

		Если СтрокаТаблицы.ПодакцизныйТовар Тогда
			Item.Excise = СтрокаТаблицы.СуммаАкциза;
		КонецЕсли;

		УПД970_ЗаполнитьCustomDeclaration(Item, СтрокаТаблицы.НомерГТД, СтрокаТаблицы.СтранаПроисхожденияКод);
		УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияПрослеживаемости, НуженПересчетВРубли);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	ЕстьТовары = Не УПД970_СодержитТолькоУслуги(ТабличныеДанные);
	Если ЕстьТовары Тогда
		
		УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
		
		СведенияОАдресеДоставки = УПД970_СведенияОбАдресеДоставки(
			ДанныеШапки.АдресДоставки,
			ДанныеШапки.АдресДоставкиЗначение);
		
		УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки, СведенияОАдресеДоставки);
		
	КонецЕсли;
	
	Результат.DocumentName = НаименованияДокументовОтгрузки().Акт;
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Результат);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Результат, Документ);
	
	Возврат Результат;

КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоАктуОбОказанииПроизводственныхУслуг(
	Документ,
	ДополнительныеПараметры)

	ДанныеДокумента = УПД970_ИсходныеДанныеАктОбОказанииПроизводственныхУслуг(Документ);
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС; 
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента_ДОП();
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);

	Table = Результат.Table;

	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = ТипыНоменклатуры.Услуга;
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	Результат.DocumentName = НаименованияДокументовОтгрузки().Акт;
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	Возврат Результат;

КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоРеализацииУслугПоПереработке(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеРеализацииУслугПоПереработке(Документ);

	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
    	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента_ДОП();
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);

	Table = Результат.Table;

	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = ТипыНоменклатуры.Услуга;
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	Результат.DocumentName = НаименованияДокументовОтгрузки().Акт;
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	Возврат Результат;

КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоПередачеОС(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеПередачиОС(Документ);

	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	СведенияПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
    	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
		
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента_ДОП();
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);

	Table = Результат.Table;

	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = ТипыНоменклатуры.Имущество;
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);
		
		УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияПрослеживаемости, НуженПересчетВРубли);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки);
	
	Результат.DocumentName = НаименованияДокументовОтгрузки().Накладная;
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Результат);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Результат, Документ);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоНачислениюАренднойПлаты(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеНачисленияАренднойПлаты(Документ);
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента_ДОП();
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);

	Table = Результат.Table;

	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = ТипыНоменклатуры.Услуга;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураКод) Тогда
			Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	Результат.DocumentName = НаименованияДокументовОтгрузки().Акт;
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	Возврат Результат;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоВозвратуТоваровПоставщику(
	Документ,
	ДополнительныеПараметры)

	ДанныеДокумента = УПД970_ИсходныеДанныеВозвратаТоваровПоставщику(Документ);

	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	СведенияПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента_ДОП();
	Результат.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияУПД(ДанныеШапки.ВидДоговора);
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);

	Table = Результат.Table;

	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = ТипыНоменклатуры.Имущество;
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);
		
		УПД970_ЗаполнитьCustomDeclaration(Item, СтрокаТаблицы.НомерГТД, СтрокаТаблицы.СтранаПроисхожденияКод);
		УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияПрослеживаемости, НуженПересчетВРубли);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);

		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	ЕстьТовары = Не УПД970_СодержитТолькоУслуги(ТабличныеДанные);
	Если ЕстьТовары Тогда
		УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
		УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки);
	КонецЕсли;
	
	Результат.DocumentName = НаименованияДокументовОтгрузки().Накладная;
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	Если ЕстьТовары Тогда
		УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры);
	КонецЕсли;
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);

	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Результат);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Результат, Документ);
	
	Возврат Результат;

КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоОтчетуКомитентуОПродажах(
	Документ,
	ДополнительныеПараметры)

	СчетФактура = СвойствоСтруктурыЛок(ДополнительныеПараметры, "СчетФактура");
	
	ДанныеДокумента = УПД970_ИсходныеДанныеОтчетаКомитентуОПродажах(СчетФактура, Документ);
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;

	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента_ДОП();
	Результат.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияУПД(ДанныеШапки.ВидДоговора);
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);

	Table = Результат.Table;

	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = УПД970_ЗначениеТипаНоменклатуры(СтрокаТаблицы.ЭтоУслуга);
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;

		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	ЕстьТовары = Не УПД970_СодержитТолькоУслуги(ТабличныеДанные);
	Если ЕстьТовары Тогда
		
		УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
		УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки);
		
	КонецЕсли;
	
	Результат.DocumentName = НаименованияДокументовОтгрузки().Акт;
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);

	TransferInfo = Результат.TransferInfo;
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры);	

	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	Возврат Результат;

КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоСчетФактураВыданныйНаАванс(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеСчетФактурыВыданныйНаАванс(Документ);
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ГенерацияXML_ФункцииУПД().СЧФ;
	Результат.CircumFormatInvoice = "2";
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	НомерДокумента = ДанныеШапки.ПредставлениеНомера;
	Если ЗначениеЗаполнено(ДанныеШапки.ЦифровойИндексОбособленногоПодразделения) Тогда
		НомерДокумента = УПД970_ПредставлениеНомераДокументаСИндексомОП(
			НомерДокумента,
			ДанныеШапки.ЦифровойИндексОбособленногоПодразделения);
	КонецЕсли;
	
	Если ДанныеШапки.Исправление Тогда
		УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Результат, ДанныеШапки);
	Иначе
		Результат.DocumentNumber = НомерДокумента;
		Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	КонецЕсли;
	
	Результат.Currency = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.ВалютаДокумента, "Код");
	
	Table = Результат.Table;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = УПД970_ЗначениеТипаНоменклатуры(СтрокаТаблицы.ЭтоУслуга);
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		
		Item.Quantity = 0;
		Item.Price = 0;
		
		Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
			Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
			Item.Vat = 0;
			Item.Subtotal = 0;
		Иначе
			Item.SubtotalWithVatExcluded = 0;
			Item.Vat = СтрокаТаблицы.СуммаНДС;
			Item.Subtotal = СтрокаТаблицы.Всего;
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС, ДанныеШапки.НДСИсчисляетсяНалоговымАгентом);
		Item.WithoutVat = XMLСтрока(Ложь);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);

	УПД970_ЗаполнитьСведенияОПлатежноРасчетныхДокументах(
		Результат.PaymentDocuments,
		ДанныеДокумента.ПлатежноРасчетныеДокументы
	);
	
	TransferInfo = Результат.TransferInfo;
	TransferInfo.OperationInfo = "Регистрация счет-фактуры на аванс";
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);

	Возврат Результат;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоСчетФактураВыданный(
	Документ,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеСчетФактурыВыданный(Документ);
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	СведенияПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости;
	ДокументыОснования = ДанныеДокумента.ДокументыОснования;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	ВыводитьКодыТНВЭД = УПД970_ВыводитьКодыТНВЭД(ДанныеШапки.Покупатель, ДанныеШапки.Грузополучатель);
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента;
	
	Если ФункцияДокумента = ФункцияДокумента_СЧФ() Тогда
		ОбстФормированияДокумента = УПД970_ОбстоятельстваФормированияСчетаФактуры(
			ДанныеШапки.КодВидаОперации,
			ДанныеШапки.ВидДоговора);
	Иначе
		ОбстФормированияДокумента = УПД970_ОбстоятельстваФормированияУПД(ДанныеШапки.ВидДоговора);
	КонецЕсли;
	
	Результат.CircumFormatInvoice = ОбстФормированияДокумента;
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	НомерДокумента = ДанныеШапки.ПредставлениеНомера;
	Если ЗначениеЗаполнено(ДанныеШапки.ЦифровойИндексОбособленногоПодразделения) Тогда
		НомерДокумента = УПД970_ПредставлениеНомераДокументаСИндексомОП(
			НомерДокумента,
			ДанныеШапки.ЦифровойИндексОбособленногоПодразделения
		);
	КонецЕсли;
	
	Если ДанныеШапки.Исправление Тогда
		УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Результат, ДанныеШапки);
	Иначе
		Результат.DocumentNumber = НомерДокумента;
		Результат.DocumentDate = НачалоДня(ДанныеШапки.Дата);
	КонецЕсли;
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);
	
	Table = Результат.Table;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemMark = УПД970_ЗначениеТипаНоменклатуры(СтрокаТаблицы.ЭтоУслуга);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураКод) Тогда
			Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
				Item,
				СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
				СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС);
		
		Если СтрокаТаблицы.ПодакцизныйТовар Тогда
			Item.Excise = СтрокаТаблицы.СуммаАкциза;
		КонецЕсли;
		
		УПД970_ЗаполнитьCustomDeclaration(Item, СтрокаТаблицы.НомерГТД, СтрокаТаблицы.СтранаПроисхожденияКод);
		УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияПрослеживаемости, НуженПересчетВРубли);
		
		Если ВыводитьКодыТНВЭД И ЗначениеЗаполнено(СтрокаТаблицы.КодТНВЭД) Тогда
			Item.ItemTypeCode = ЗначениеРеквизитаОбъектаЛок(СтрокаТаблицы.КодТНВЭД, "Код");
		КонецЕсли;
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки, ДанныеШапки.КПППоставщика);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	ЕстьТовары = Не УПД970_СодержитТолькоУслуги(ТабличныеДанные);
	Если ЕстьТовары Тогда
		
		УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
		
		СведенияОАдресеДоставки = УПД970_СведенияОбАдресеДоставки(
			ДанныеШапки.АдресДоставки,
			ДанныеШапки.АдресДоставкиЗначение);
		
		УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки, СведенияОАдресеДоставки);
		
	КонецЕсли;
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Результат, Документ, ДокументыОснования, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОПлатежноРасчетныхДокументах(
		Результат.PaymentDocuments,
		ДанныеДокумента.ПлатежноРасчетныеДокументы
	);
	УПД970_ЗаполнитьСведенияОбАвансовыхСФ(
		Результат.AccompanyingDocuments,
		ДанныеДокумента.АвансовыеДокументы
	);
	
	ДатаОтгрузки = УПД970_ДатаОтгрузки(
		ДокументыОснования[0],
		Результат.DocumentDate,
		Результат.DocumentShipments,
		ФункцияДокумента);
	
	TransferInfo = Результат.TransferInfo;
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = ДатаОтгрузки;
	TransferInfo.TransferTextInfo = ДанныеШапки.СведенияОТранспортировке;
	
	Если ЕстьТовары Тогда
		УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры);
	КонецЕсли;
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокумента(Результат, Документ);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Результат);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Результат, Документ);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоКорректировкеРеализации(
	Документ,
	ДополнительныеПараметры)
	
	ДанныеДокумента = УПД970_ИсходныеДанныеКорректировкаРеализации(Документ);
	ФункцияДокумента = ФункцияДокумента_ДОП();
	
	ДанныеШапки = ДанныеДокумента.ДанныеШапки;
	ТабличныеДанные = ДанныеДокумента.ТабличныеДанные;
	СведенияПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости;
	
	Валюта = ДанныеШапки.ВалютаДокумента;
	НуженПересчетВРубли = НуженПересчетВРубли(ДанныеШапки.РасчетыВУсловныхЕдиницах, Валюта);
	ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	
	Результат = УПД970_НовыйПротоСтруктураУПД970();
	
	Результат.Function = ФункцияДокумента;
	Результат.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияУПД(ДанныеШапки.ВидДоговора);
	Результат.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	Результат.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Результат.DocumentDate = ДанныеШапки.Дата;
	Результат.RevisionNumber = ДанныеШапки.НомерИсправления;
	Результат.RevisionDate = ДанныеШапки.ДатаИсправления;
	
	УПД970_ЗаполнитьКодВалюты(Результат, Валюта, НуженПересчетВРубли);
	
	УПД970_ЗаполнитьСведенияОПродавце(Результат, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОПокупателе(Результат, ДанныеШапки);
	
	ЕстьТовары = Не УПД970_СодержитТолькоУслуги(ТабличныеДанные);
	Если ЕстьТовары Тогда
		
		АдресДоставкиЗначение = Неопределено;
		СведенияОАдресеДоставки = УПД970_СведенияОбАдресеДоставки(
			ДанныеШапки.АдресДоставки,
			АдресДоставкиЗначение
		);
		УПД970_ЗаполнитьСведенияОГрузополучателе(Результат, ДанныеШапки, СведенияОАдресеДоставки);
		УПД970_ЗаполнитьСведенияОГрузоотправителе(Результат, ДанныеШапки);
		
	КонецЕсли;
	
	Table = Результат.Table;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СокрЛП(СтрокаТаблицы.НоменклатураНаименование);
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураКод;
		Item.ItemMark = УПД970_ЗначениеТипаНоменклатуры(СтрокаТаблицы.ЭтоУслуга);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			УПД970_ЗаполнитьЕдиницуИзмерения(
			Item,
			СтрокаТаблицы.ЕдиницаИзмеренияНаименование,
			СтрокаТаблицы.ЕдиницаИзмеренияКод
			);
			
		КонецЕсли;
		
		Если СтрокаТаблицы.ПодакцизныйТовар Тогда
			Item.Excise = ПривестиКЧислуЛок(СтрокаТаблицы.Акциз);
		КонецЕсли;
		
		УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
			Item,
			СтрокаТаблицы,
			НуженПересчетВРубли,
			ДанныеШапки.НДСИсчисляетсяНалоговымАгентом,
			ДополнительныеПараметры.ТочностьКоличества,
			ДополнительныеПараметры.ТочностьЦены,
			ЦенаВключаетНДС
		);
		
		УПД970_ЗаполнитьCustomDeclaration(Item, СтрокаТаблицы.НомерГТД, СтрокаТаблицы.СтранаПроисхожденияКод);
		УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияПрослеживаемости, НуженПересчетВРубли);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Table);
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(Документ);
	Результат.DocumentName = УПД790_НаименованиеДокументаОтгрузки(Table.Items, ДокументыОтгрузки, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Результат);
	
	TransferInfo = Результат.TransferInfo;
	TransferInfo.OperationInfo = УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг();
	TransferInfo.TransferDate = УПД970_ОпределитьДатаОтгрузки(Результат.DocumentDate, Результат.DocumentShipments);
	
	Если ЕстьТовары Тогда
		УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры);
	КонецЕсли;
	
	УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(TransferInfo, ДанныеШапки, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Результат);
	УПД970_ЗаполнитьСведенияОМаркировке(Результат, Документ);
	УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область УПД970_ТекстыЗапросов

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацияТоваровУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель.ОбособленноеПодразделение
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент = Реквизиты.Контрагент
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Контрагент
	|		ИНАЧЕ Реквизиты.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.БанковскийСчетОрганизации КАК БанковскийСчетПродавца,
	|	Реквизиты.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	Реквизиты.СведенияОТранспортировкеИГрузе КАК СведенияОТранспортировке,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	УПД970_ЗаполнитьВТекстеЗапросаРТиУВыражениеСАдресомДоставкиЗначение(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныеДанныеРеализацияТоваровУслуг()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИдентификаторСтрокиУслуги КАК ИдентификаторСтроки,
	|	МАКСИМУМ(РеализацияТоваровУслугСведенияПрослеживаемости.СтранаПроисхождения) КАК СтранаПроисхождения,
	|	МАКСИМУМ(СтраныМира.Код) КАК СтранаПроисхожденияКод
	|ПОМЕСТИТЬ ВТ_ДанныеПоСтранеПроисхождения
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК РеализацияТоваровУслугСведенияПрослеживаемости
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|			ПО РеализацияТоваровУслугСведенияПрослеживаемости.СтранаПроисхождения = СтраныМира.Ссылка
	|		ПО &ИдентификаторСтрокиУслуги = РеализацияТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки
	|ГДЕ
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка = &Ссылка
	|	И Таблица.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	&ИдентификаторСтрокиУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ПорядокТЧ,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	&НаименованиеНоменклатуры КАК НоменклатураНаименование,
	|	Таблица.Номенклатура.Услуга КАК ЭтоУслуга,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таблица.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	&НомерГТД КАК НомерГТД,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	Таблица.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	Таблица.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	&ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	&СуммаАкциза КАК СуммаАкциза,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ	
	|	Таблица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Услуги"",
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Номенклатура,
	|	&КодТовараУслуги,
	|	&НаименованиеУслуги,
	|	ИСТИНА,
	|	ЕСТЬNULL(Таблица.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
	|	Таблица.Количество,
	|	Таблица.Цена,
	|	Таблица.Сумма,
	|	Таблица.СтавкаНДС,
	|	Таблица.СуммаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(ВТ_ДанныеПоСтранеПроисхождения.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)),
	|	ЕСТЬNULL(ВТ_ДанныеПоСтранеПроисхождения.СтранаПроисхожденияКод, """"),
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	0,
	|	&ИдентификаторСтрокиУслуги,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСтранеПроисхождения КАК ВТ_ДанныеПоСтранеПроисхождения
	|		ПО &ИдентификаторСтрокиУслуги = ВТ_ДанныеПоСтранеПроисхождения.ИдентификаторСтроки
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И Таблица.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	""АгентскиеУслуги"",
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Номенклатура,
	|	&КодТовараУслуги,
	|	&НаименованиеУслуги,
	|	ИСТИНА,
	|	ЕСТЬNULL(Таблица.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
	|	Таблица.Количество,
	|	Таблица.Цена,
	|	Таблица.Сумма,
	|	Таблица.СтавкаНДС,
	|	Таблица.СуммаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	"""",
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	0,
	|	&ИдентификаторСтрокиАгентскойУслуги,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ПорядокТЧ КАК ПорядокТЧ,
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	ТаблицаДокумента.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	ТаблицаДокумента.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТаблицаДокумента.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	ТаблицаДокумента.СуммаАкциза КАК СуммаАкциза,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемНоменклатуры(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыраженияСПодакцизнымТоваром(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСИдентификаторомСтрокДляУслуг(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСИдентификаторомСтрокДляАгентскихУслуг(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиРеализацияТоваровУслуг()
	
	ИмяДокумента = "РеализацияТоваровУслуг";
	Результат = УПД970_ТекстЗапросаСведенийПрослеживаемостиПоДокументу(ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПередачаТоваров()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель.ОбособленноеПодразделение
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент = Реквизиты.Контрагент
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Контрагент
	|		ИНАЧЕ Реквизиты.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ОрганизацияСсылка.ОсновнойБанковскийСчет КАК БанковскийСчетПродавца,
	|	Реквизиты.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	Реквизиты.СведенияОТранспортировкеИГрузе КАК СведенияОТранспортировке,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ПередачаТоваров КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияСсылка
	|		ПО Реквизиты.Организация = ОрганизацияСсылка.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	УПД970_ЗаполнитьВТекстеЗапросаРТиУВыражениеСАдресомДоставкиЗначение(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныеДанныеПередачаТоваров()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	1 КАК ПорядокТЧ,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	&НаименованиеНоменклатуры КАК НоменклатураНаименование,
	|	Таблица.Номенклатура.Услуга КАК ЭтоУслуга,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таблица.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	&НомерГТД КАК НомерГТД,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	Таблица.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	Таблица.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	Ложь КАК ПодакцизныйТовар,
	|	0 КАК СуммаАкциза,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ПередачаТоваров.Товары КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ПорядокТЧ КАК ПорядокТЧ,
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	ТаблицаДокумента.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	ТаблицаДокумента.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТаблицаДокумента.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	ТаблицаДокумента.СуммаАкциза КАК СуммаАкциза,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемНоменклатуры(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиПередачаТоваров()
	
	ИмяДокумента = "ПередачаТоваров";
	Результат = УПД970_ТекстЗапросаСведенийПрослеживаемостиПоДокументу(ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацииОтгруженныхТоваров()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ДокументОтгрузки КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ВремРеквизитыДокумента
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Реквизиты.Грузоотправитель КАК Грузоотправитель,
	|	Реквизиты.Грузополучатель КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	Реквизиты.СведенияОТранспортировкеИГрузе КАК СведенияОТранспортировке,
	|	Реквизиты.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ ВремРеквизитыДокументаОтгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремРеквизитыДокумента КАК ВремРеквизитыДокумента
	|		ПО Реквизиты.Ссылка = ВремРеквизитыДокумента.ДокументОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Реквизиты.Грузоотправитель КАК Грузоотправитель,
	|	Реквизиты.Грузополучатель КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	"""" КАК СведенияОТранспортировке,
	|	"""" КАК АдресДоставки,
	|	"""" КАК АдресДоставкиЗначение,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ПередачаОС КАК Реквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремРеквизитыДокумента КАК ВремРеквизитыДокумента
	|		ПО Реквизиты.Ссылка = ВремРеквизитыДокумента.ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Поставщик КАК Поставщик,
	|	Реквизиты.Покупатель КАК Покупатель,
	|	Реквизиты.Договор КАК Договор,
	|	Реквизиты.Основание КАК Основание,
	|	Реквизиты.ОснованиеДата КАК ОснованиеДата,
	|	Реквизиты.ОснованиеНомер КАК ОснованиеНомер,
	|	Реквизиты.НДСИсчисляетсяНалоговымАгентом КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВЫБОР
	|		КОГДА РеквизитыДокументаОтгрузки.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеквизитыДокументаОтгрузки.Грузоотправитель
	|		КОГДА РеквизитыДокументаОтгрузки.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА РеквизитыДокументаОтгрузки.ПодразделениеОрганизации
	|		КОГДА РеквизитыДокументаОтгрузки.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА РеквизитыДокументаОтгрузки.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеквизитыДокументаОтгрузки.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеквизитыДокументаОтгрузки.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА РеквизитыДокументаОтгрузки.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Поставщик.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА РеквизитыДокументаОтгрузки.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА РеквизитыДокументаОтгрузки.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА РеквизитыДокументаОтгрузки.Грузополучатель.ОбособленноеПодразделение
	|				И РеквизитыДокументаОтгрузки.Грузополучатель.ГоловнойКонтрагент = Реквизиты.Контрагент
	|				И РеквизитыДокументаОтгрузки.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА РеквизитыДокументаОтгрузки.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	РеквизитыДокументаОтгрузки.ВалютаДокумента КАК ВалютаДокумента,
	|	РеквизитыДокументаОтгрузки.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеквизитыДокументаОтгрузки.СведенияОТранспортировке КАК СведенияОТранспортировке,
	|	РеквизитыДокументаОтгрузки.АдресДоставки КАК АдресДоставки,
	|	РеквизитыДокументаОтгрузки.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	РеквизитыДокументаОтгрузки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	ВремРеквизитыДокумента КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремРеквизитыДокументаОтгрузки КАК РеквизитыДокументаОтгрузки
	|		ПО Реквизиты.ДокументОтгрузки = РеквизитыДокументаОтгрузки.Ссылка";
	
	УПД970_ЗаполнитьВТекстеЗапросаРТиУВыражениеСАдресомДоставкиЗначение(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныеДанныеРеализацииОтгруженныхТоваров()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	1 КАК ПорядокТЧ,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	&НаименованиеНоменклатуры КАК НоменклатураНаименование,
	|	Таблица.Номенклатура.Услуга КАК ЭтоУслуга,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	&НомерГТД КАК НомерГТД,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	Таблица.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	&ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	&СуммаАкциза КАК СуммаАкциза,
	|	Таблица.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	Таблица.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличнаяЧастьДокумента
	|ПОМЕСТИТЬ ТаблицаДокументаПромежуточная
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Таблица
	|		ПО РеализацияОтгруженныхТоваров.ДокументОтгрузки = Таблица.Ссылка
	|ГДЕ
	|	РеализацияОтгруженныхТоваров.Ссылка = &Ссылка
	|	И НЕ &НачислятьНДСПоОтгрузке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Услуги"",
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Номенклатура,
	|	&КодТовараУслуги,
	|	&НаименованиеУслуги,
	|	ИСТИНА,
	|	Таблица.Номенклатура.ЕдиницаИзмерения,
	|	Таблица.Количество,
	|	Таблица.Цена,
	|	Таблица.Сумма,
	|	Таблица.СтавкаНДС,
	|	Таблица.СуммаНДС,
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	"""",
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
	|	&ИдентификаторСтрокиУслуги,
	|	Таблица.Ссылка.ВалютаДокумента,
	|	Таблица.Ссылка.СуммаВключаетНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги)
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Таблица
	|		ПО РеализацияОтгруженныхТоваров.ДокументОтгрузки = Таблица.Ссылка
	|ГДЕ
	|	РеализацияОтгруженныхТоваров.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	""ОС"",
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА Таблица.ОсновноеСредство.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Таблица.ОсновноеСредство.НаименованиеПолное <> """"
	|			ТОГДА Таблица.ОсновноеСредство.НаименованиеПолное
	|		ИНАЧЕ Таблица.ОсновноеСредство.Наименование
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЕСТЬNULL(Таблица.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	Таблица.Количество,
	|	Таблица.Цена,
	|	Таблица.Сумма,
	|	Таблица.СтавкаНДС,
	|	Таблица.СуммаНДС,
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	"""",
	|	Таблица.ПрослеживаемыйТовар,
	|	ЛОЖЬ,
	|	0,
	|	Таблица.КодТНВЭД,
	|	Таблица.ИдентификаторСтроки,
	|	Таблица.Ссылка.ВалютаДокумента,
	|	Таблица.Ссылка.СуммаВключаетНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОС)
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаОС.ОС КАК Таблица
	|		ПО РеализацияОтгруженныхТоваров.ДокументОтгрузки = Таблица.Ссылка
	|ГДЕ
	|	РеализацияОтгруженныхТоваров.Ссылка = &Ссылка
	|	И НЕ &НачислятьНДСПриПередачеНедвижимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументаПромежуточная.ПорядокТЧ КАК ПорядокТЧ,
	|	ТаблицаДокументаПромежуточная.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокументаПромежуточная.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокументаПромежуточная.Номенклатура КАК Номенклатура,
	|	ТаблицаДокументаПромежуточная.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокументаПромежуточная.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокументаПромежуточная.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокументаПромежуточная.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	ТаблицаДокументаПромежуточная.НомерГТД КАК НомерГТД,
	|	ТаблицаДокументаПромежуточная.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаДокументаПромежуточная.Количество КАК Количество,
	|	ТаблицаДокументаПромежуточная.Цена КАК Цена,
	|	ТаблицаДокументаПромежуточная.Сумма КАК Сумма,
	|	ТаблицаДокументаПромежуточная.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокументаПромежуточная.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокументаПромежуточная.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокументаПромежуточная.Ссылка КАК Ссылка,
	|	ТаблицаДокументаПромежуточная.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТаблицаДокументаПромежуточная.НоменклатураКодТНВЭД КАК НоменклатураКодТНВЭД,
	|	ТаблицаДокументаПромежуточная.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ТаблицаДокументаПромежуточная.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТаблицаДокументаПромежуточная.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	ТаблицаДокументаПромежуточная.СуммаАкциза КАК СуммаАкциза
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	ТаблицаДокументаПромежуточная КАК ТаблицаДокументаПромежуточная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО ТаблицаДокументаПромежуточная.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ТаблицаДокументаПромежуточная.ТабличнаяЧастьДокумента)
	|			И (ТаблицаДокументаПромежуточная.ВалютаДокумента <> &ВалютаРеглУчета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторСтроки,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДокументаПромежуточная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ПорядокТЧ КАК ПорядокТЧ,
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	ТаблицаДокумента.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	ТаблицаДокумента.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТаблицаДокумента.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	ТаблицаДокумента.СуммаАкциза КАК СуммаАкциза,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб,
	|	ТаблицаДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемНоменклатуры(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыраженияСПодакцизнымТоваром(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСИдентификаторомСтрокДляУслуг(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиРеализацииОтгруженныхТоваров()
	
	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.РНПТ.Код КАК НомерТовара,
	|	Таблица.КоличествоПрослеживаемости КАК Количество,
	|	ЕСТЬNULL(ТаблицаДокумента.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, ""796"") КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА Таблица.Сумма = 0
	|			ТОГДА Таблица.Количество * ВЫБОР
	|					КОГДА Документ.СуммаВключаетНДС
	|						ТОГДА (ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.Количество
	|					ИНАЧЕ ТаблицаДокумента.Цена
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.Сумма
	|	КОНЕЦ КАК СтоимостьБезНалога
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокумента КАК ТаблицаДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|			ПО ТаблицаДокумента.НоменклатураКодТНВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО (ТаблицаДокумента.ИдентификаторСтроки = Таблица.ИдентификаторСтроки)
	|			И Таблица.Ссылка = ТаблицаДокумента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Документ
	|		ПО Таблица.Ссылка = Документ.Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаРеквизитовАктаОбОказанииПроизводственныхУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхАктаОбОказанииПроизводственныхУслуг()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Номенклатура.ПериодичностьУслуги КАК ПериодичностьУслуги,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	&НаименованиеНоменклатуры КАК НоменклатураНаименование,
	|	ЕСТЬNULL(Таблица.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
 	|	ИСТИНА КАК ЭтоУслуга,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ПериодичностьУслуги КАК ПериодичностьУслуги,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	НЕОПРЕДЕЛЕНО КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемНоменклатуры(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацииУслугПоПереработке()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхРеализацииУслугПоПереработке()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	&НаименованиеУслуги КАК НоменклатураНаименование,
	|	ЕСТЬNULL(Таблица.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	НЕОПРЕДЕЛЕНО КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемУслуги(Результат);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПередачиОС()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель.ОбособленноеПодразделение
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент = Реквизиты.Контрагент
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Контрагент
	|		ИНАЧЕ Реквизиты.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ПередачаОС КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныеДанныеПередачиОС()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	1 КАК ПорядокТЧ,
	|	""ОС"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ОсновноеСредство КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА Таблица.ОсновноеСредство.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НоменклатураКод,
	|	ВЫБОР
	|		КОГДА Таблица.ОсновноеСредство.НаименованиеПолное <> """"
	|			ТОГДА Таблица.ОсновноеСредство.НаименованиеПолное
	|		ИНАЧЕ Таблица.ОсновноеСредство.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ЕСТЬNULL(Таблица.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	Таблица.ОсновноеСредство.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	Таблица.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОС))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ПорядокТЧ КАК ПорядокТЧ,
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	ТаблицаДокумента.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиПередачиОС()

	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.РНПТ.Код КАК НомерТовара,
	|	Таблица.КоличествоПрослеживаемости КАК Количество,
	|	ЕСТЬNULL(Таблица.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТаблицаТоваров.КодТНВЭД.Код, ""796"") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ТаблицаТоваров.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА Таблица.Сумма = 0
	|			ТОГДА Таблица.Количество * ВЫБОР
	|					КОГДА Реквизиты.СуммаВключаетНДС
	|						ТОГДА (ТаблицаТоваров.Сумма - ТаблицаТоваров.СуммаНДС) / ТаблицаТоваров.Количество
	|					ИНАЧЕ ТаблицаТоваров.Цена
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.Сумма
	|	КОНЕЦ КАК СтоимостьБезНалога
	|ИЗ
	|	Документ.ПередачаОС.СведенияПрослеживаемости КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаОС.ОС КАК ТаблицаТоваров
	|		ПО Таблица.Ссылка = ТаблицаТоваров.Ссылка
	|			И Таблица.ИдентификаторСтроки = ТаблицаТоваров.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаОС КАК Реквизиты
	|		ПО Таблица.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаРеквизитовНачисленияАренднойПлаты()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхНачисленияАренднойПлаты()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Таблица.Номенклатура.Код, """")
	|	КОНЕЦ КАК НоменклатураКод,
	|	&НаименованиеУслуги КАК НоменклатураНаименование,
	|	ЕСТЬNULL(Таблица.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты.Состав КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	НЕОПРЕДЕЛЕНО КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемУслуги(Результат);

	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаРеквизитовОтчетаКомитентуОПродажах()
	
	Результат =
	"ВЫБРАТЬ
	|	ТЧПоставщики.Поставщик КАК Поставщик,
	|	ТЧПоставщики.КлючСтроки КАК КлючСтроки,
	|	ТЧПоставщики.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ТЧПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Грузоотправитель,
	|	ЕСТЬNULL(ТЧПоставщики.Партия.Грузополучатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Грузополучатель,
	|	ТЧПоставщики.ДатаСФ КАК ДатаСФ,
	|	ТЧПоставщики.Партия КАК Партия
	|ПОМЕСТИТЬ ВТ_КлючиСтрок
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|ГДЕ
	|	ТЧПоставщики.Ссылка = &Ссылка
	|	И ТЧПоставщики.СчетФактура = &СчетФактура
	|	И ТЧПоставщики.СчетФактура <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПоставщики.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТЧПоставщики.Поставщик) КАК Продавец,
	|	МАКСИМУМ(ТЧПоставщики.Грузоотправитель) КАК Грузоотправитель,
	|	МАКСИМУМ(ТЧПоставщики.Грузополучатель) КАК Грузополучатель,
	|	ТЧПоставщики.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Поставщики
	|ИЗ
	|	ВТ_КлючиСтрок КАК ТЧПоставщики
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧПоставщики.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|					ИНАЧЕ Реквизиты.Организация
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ВТ_Поставщики.Продавец.ОбособленноеПодразделение
	|				И ВТ_Поставщики.Продавец.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ВТ_Поставщики.Продавец.ГоловнойКонтрагент
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Поставщики.Продавец
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|				ИНАЧЕ Реквизиты.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.ПодразделениеОрганизации
	|					ИНАЧЕ Реквизиты.Организация
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Поставщики.Грузоотправитель.ОбособленноеПодразделение
	|							И ВТ_Поставщики.Грузоотправитель.ГоловнойКонтрагент = ВТ_Поставщики.Продавец
	|							И ВТ_Поставщики.Грузоотправитель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|						ТОГДА ВТ_Поставщики.Грузоотправитель
	|					ИНАЧЕ ВТ_Поставщики.Продавец
	|				КОНЕЦ
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ""он же""
	|		КОГДА ВТ_Поставщики.Грузоотправитель = ВТ_Поставщики.Продавец
	|			ТОГДА ""он же""
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Поставщики.Грузоотправитель
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Продавец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ВТ_Поставщики.Продавец.ОбособленноеПодразделение
	|			ТОГДА ВТ_Поставщики.Продавец
	|		КОГДА НЕ ВТ_Поставщики.Грузоотправитель ЕСТЬ NULL
	|			ТОГДА ""он же""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Поставщики.Грузополучатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Поставщики.Грузополучатель
	|		КОГДА НЕ ВТ_Поставщики.Грузополучатель ЕСТЬ NULL
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поставщики КАК ВТ_Поставщики
	|		ПО Реквизиты.Ссылка = ВТ_Поставщики.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхОтчетаКомитентуОПродажах()
	
	ТекстЗапросаТабличныхДанных =
	"ВЫБРАТЬ
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Номенклатура.Код КАК НоменклатураКод,
	|	Таблица.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(Таблица.Содержание КАК СТРОКА(1000)), """") <> """"
	|			ТОГДА Таблица.Содержание
	|		КОГДА ЕСТЬNULL(ВТ_НаименованиеУслуг.Содержание, """") <> """"
	|			ТОГДА ВТ_НаименованиеУслуг.Содержание
	|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(Таблица.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)), """") <> """"
	|			ТОГДА Таблица.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ Таблица.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	Таблица.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	&НомерГТД КАК НомерГТД,
	|	Таблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(Таблица.Номенклатура.Услуга, ИСТИНА) КАК ЭтоУслуга,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТ_КлючиСтрок.Партия КАК Партия,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСтрок КАК ВТ_КлючиСтрок
	|		ПО Таблица.Ссылка = ВТ_КлючиСтрок.Ссылка
	|			И Таблица.КлючСтроки = ВТ_КлючиСтрок.КлючСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|		ПО (ВТ_КлючиСтрок.Ссылка = Реквизиты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаименованиеУслуг КАК ВТ_НаименованиеУслуг
	|		ПО Таблица.КлючСтроки = ВТ_НаименованиеУслуг.КлючСтроки
	|			И Таблица.Номенклатура = ВТ_НаименованиеУслуг.Номенклатура
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	Таблица.НомерСтроки,
	|	Таблица.Ссылка,
	|	Таблица.Номенклатура,
	|	Таблица.НоменклатураКод,
	|	Таблица.НоменклатураАртикул,
	|	ВЫБОР
	|		КОГДА Таблица.НоменклатураНаименование ПОДОБНО """"
	|			ТОГДА ""Комиссионное вознаграждение""
	|		ИНАЧЕ Таблица.НоменклатураНаименование
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка),
	|	0,
	|	0,
	|	Таблица.Сумма,
	|	Таблица.СуммаНДС,
	|	Таблица.СтавкаНДС,
	|	Таблица.ЭтоУслуга,
	|	Таблица.СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
	|	""""
	|ИЗ
	|	ВТВознаграждение КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ПустаяСсылка))
	|			И (Таблица.ВалютаДокумента <> &ВалютаРеглУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА Таблица.НоменклатураАртикул
	|		ИНАЧЕ Таблица.НоменклатураКод
	|	КОНЕЦ КАК НоменклатураКод,
	|	Таблица.НоменклатураНаименование КАК НоменклатураНаименование,
	|	Таблица.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	Таблица.НомерГТД КАК НомерГТД,
	|	Таблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	Таблица.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА Таблица.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ Таблица.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА Таблица.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ Таблица.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА Таблица.Сумма - Таблица.СуммаНДС
	|		ИНАЧЕ Таблица.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА Таблица.Сумма
	|		ИНАЧЕ Таблица.Сумма + Таблица.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.ВсегоРуб КАК ВсегоРуб,
	|	Таблица.НДСРуб КАК НДСРуб,
	|	Таблица.СуммаБезНДСРуб КАК СуммаБезНДСРуб,
	|	Таблица.ЭтоУслуга КАК ЭтоУслуга,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаДокумента КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО (СтраныМира.Ссылка = Таблица.СтранаПроисхождения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (КлассификаторЕдиницИзмерения.Ссылка = Таблица.ЕдиницаИзмерения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(ТекстЗапросаТабличныхДанных);

	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаВременнаяТаблицаНаименованияУслуг());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаВременнаяТаблицаВознаграждения());
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныхДанных);
	
	Результат = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиОтчетаКомитентуОПродажах()
	
	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.РНПТ.Код КАК НомерТовара,
	|	Таблица.КоличествоПрослеживаемости КАК Количество,
	|	ЕСТЬNULL(ТаблицаТоваров.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТаблицаТоваров.ЕдиницаИзмерения.Код, ""796"") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ТаблицаТоваров.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА Таблица.Сумма = 0
	|			ТОГДА Таблица.Количество * ВЫБОР
	|					КОГДА Реквизиты.СуммаВключаетНДС
	|						ТОГДА (ТаблицаТоваров.Сумма - ТаблицаТоваров.СуммаНДС) / ТаблицаТоваров.Количество
	|					ИНАЧЕ ТаблицаТоваров.Цена
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.Сумма
	|	КОНЕЦ КАК СтоимостьБезНалога
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.СведенияПрослеживаемости КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ТаблицаТоваров
	|		ПО Таблица.Ссылка = ТаблицаТоваров.Ссылка
	|			И Таблица.ИдентификаторСтроки = ТаблицаТоваров.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|		ПО Таблица.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель.ОбособленноеПодразделение
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент = Реквизиты.Контрагент
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Контрагент
	|		ИНАЧЕ Реквизиты.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныеДанныеВозвратаТоваровПоставщику()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	1 КАК ПорядокТЧ,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	&НаименованиеНоменклатуры КАК НоменклатураНаименование,
	|	Таблица.Номенклатура.Услуга КАК ЭтоУслуга,
	|	Таблица.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	&НомерГТД КАК НомерГТД,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	Таблица.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ПорядокТЧ КАК ПорядокТЧ,
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	ТаблицаДокумента.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	ТаблицаДокумента.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТЧ,
	|	НомерСтроки";

	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемНоменклатуры(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиВозвратаТоваровПоставщику()

	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.РНПТ.Код КАК НомерТовара,
	|	Таблица.КоличествоПрослеживаемости КАК Количество,
	|	ЕСТЬNULL(ТаблицаТоваров.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТаблицаТоваров.КодТНВЭД.Код, ""796"") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ТаблицаТоваров.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА Таблица.Сумма = 0
	|			ТОГДА Таблица.Количество * ВЫБОР
	|					КОГДА Реквизиты.СуммаВключаетНДС
	|						ТОГДА (ТаблицаТоваров.Сумма - ТаблицаТоваров.СуммаНДС) / ТаблицаТоваров.Количество
	|					ИНАЧЕ ТаблицаТоваров.Цена
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.Сумма
	|	КОНЕЦ КАК СтоимостьБезНалога
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.СведенияПрослеживаемости КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаТоваров
	|		ПО Таблица.Ссылка = ТаблицаТоваров.Ссылка
	|			И Таблица.ИдентификаторСтроки = ТаблицаТоваров.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК Реквизиты
	|		ПО Таблица.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Покупатель.ОбособленноеПодразделение
	|				И ОтчетКомиссионераОПродажахПокупатели.Покупатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ОтчетКомиссионераОПродажахПокупатели.Покупатель.ГоловнойКонтрагент
	|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|	КОНЕЦ КАК Покупатель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель.ОбособленноеПодразделение
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент = ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	ОтчетКомиссионераОПродажахПокупатели.СчетФактура КАК СчетФактура,
	|	ОтчетКомиссионераОПродажахПокупатели.КлючСтроки КАК КлючСтроки,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ ДанныеОПокупателях
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели,
	|	Документ.ОтчетКомиссионераОПродажах КАК Реквизиты
	|ГДЕ
	|	ОтчетКомиссионераОПродажахПокупатели.Ссылка = &Ссылка
	|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура
	|	И Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.ДатаОснования КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Подразделение КАК Подразделение,
	|	Реквизиты.Поставщик КАК Поставщик,
	|	Реквизиты.ОбособленноеПодразделениеПоставщика КАК ОбособленноеПодразделениеПоставщика,
	|	Реквизиты.Грузоотправитель КАК Грузоотправитель,
	|	Реквизиты.Покупатель КАК Покупатель,
	|	Реквизиты.ОбособленноеПодразделениеПокупателя КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.Грузополучатель КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.НДСИсчисляетсяНалоговымАгентом КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.Договор КАК Договор,
	|	Реквизиты.Основание КАК Основание,
	|	Реквизиты.ОснованиеДата КАК ОснованиеДата,
	|	Реквизиты.ОснованиеНомер КАК ОснованиеНомер,
	|	Реквизиты.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ РеквизитыПредварительная
	|ИЗ
	|	ДанныеОПокупателях КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(&СчетФактура) = ТИП(Документ.СчетФактураВыданный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыПредварительная.ДатаОснования КАК ДатаОснования,
	|	РеквизитыПредварительная.Организация КАК Организация,
	|	РеквизитыПредварительная.Подразделение КАК Подразделение,
	|	РеквизитыПредварительная.Поставщик КАК Поставщик,
	|	РеквизитыПредварительная.ОбособленноеПодразделениеПоставщика КАК ОбособленноеПодразделениеПоставщика,
	|	РеквизитыПредварительная.Грузоотправитель КАК Грузоотправитель,
	|	РеквизитыПредварительная.Покупатель КАК Покупатель,
	|	РеквизитыПредварительная.ОбособленноеПодразделениеПокупателя КАК ОбособленноеПодразделениеПокупателя,
	|	РеквизитыПредварительная.Грузополучатель КАК Грузополучатель,
	|	РеквизитыПредварительная.ВалютаДокумента КАК ВалютаДокумента,
	|	РеквизитыПредварительная.НДСИсчисляетсяНалоговымАгентом КАК НДСИсчисляетсяНалоговымАгентом,
	|	РеквизитыПредварительная.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	РеквизитыПредварительная.ВидДоговора КАК ВидДоговора,
	|	РеквизитыПредварительная.Договор КАК Договор,
	|	РеквизитыПредварительная.Основание КАК Основание,
	|	РеквизитыПредварительная.ОснованиеДата КАК ОснованиеДата,
	|	РеквизитыПредварительная.ОснованиеНомер КАК ОснованиеНомер,
	|	РеквизитыПредварительная.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	РеквизитыПредварительная.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	РеквизитыПредварительная КАК РеквизитыПредварительная";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхОтчетаКомиссионераОПродажах()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	1 КАК ПорядокТЧ,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Номенклатура.Код КАК НоменклатураКод,
	|	Таблица.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	Таблица.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	&НомерГТД КАК НомерГТД,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(Таблица.Номенклатура.Услуга, ЛОЖЬ) КАК ЭтоУслуга,
	|	Таблица.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	0 КАК НалоговаяБазаНДС,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОПокупателях КАК ДанныеОПокупателях
	|		ПО Таблица.КлючСтроки = ДанныеОПокупателях.КлючСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(&СчетФактура) = ТИП(Документ.СчетФактураВыданный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Услуги"",
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Номенклатура,
	|	Таблица.Номенклатура.Код,
	|	Таблица.Номенклатура.Артикул,
	|	&НаименованиеУслуги,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	"""",
	|	"""",
	|	Таблица.Номенклатура.ЕдиницаИзмерения,
	|	Таблица.Количество,
	|	Таблица.Цена,
	|	Таблица.Сумма,
	|	Таблица.СуммаНДС,
	|	Таблица.СтавкаНДС,
	|	ИСТИНА,
	|	Таблица.Ссылка.СуммаВключаетНДС,
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
	|	ЛОЖЬ,
	|	0,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0)
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Услуги КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОПокупателях КАК ДанныеОПокупателях
	|		ПО Таблица.КлючСтроки = ДанныеОПокупателях.КлючСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(&СчетФактура) = ТИП(Документ.СчетФактураВыданный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ПорядокТЧ КАК ПорядокТЧ,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА Таблица.НоменклатураАртикул
	|		ИНАЧЕ Таблица.НоменклатураКод
	|	КОНЕЦ КАК НоменклатураКод,
	|	Таблица.НоменклатураНаименование КАК НоменклатураНаименование,
	|	Таблица.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.НомерГТД КАК НомерГТД,
	|	Таблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	Таблица.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА Таблица.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ Таблица.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА Таблица.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ Таблица.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА Таблица.СуммаВключаетНДС
	|			ТОГДА Таблица.Сумма - Таблица.СуммаНДС
	|		ИНАЧЕ Таблица.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА Таблица.СуммаВключаетНДС
	|			ТОГДА Таблица.Сумма
	|		ИНАЧЕ Таблица.Сумма + Таблица.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.ЭтоУслуга КАК ЭтоУслуга,
	|	Таблица.ВсегоРуб КАК ВсегоРуб,
	|	Таблица.НДСРуб КАК НДСРуб,
	|	Таблица.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (КлассификаторЕдиницИзмерения.Ссылка = Таблица.ЕдиницаИзмерения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТЧ,
	|	НомерСтроки";

	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиОтчетаКомиссионераОПродажах()
	
	ИмяДокумента = "ОтчетКомиссионераОПродажах";
	Результат = УПД970_ТекстЗапросаСведенийПрослеживаемостиПоДокументу(ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактурыВыданныйНаАванс()

	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ПредставлениеНомера КАК ПредставлениеНомера,
	|	Реквизиты.Исправление КАК Исправление,
	|	Реквизиты.НомерИсправления КАК НомерИсправления,
	|	Реквизиты.Дата КАК ДатаИсправления,
	|	Реквизиты.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	Реквизиты.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	Реквизиты.КПППродавца КАК КПППоставщика,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.КППКонтрагента КАК КПППокупателя,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхСчетФактурыВыданныйНаАванс()
	
	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	""Авансы"" КАК ИмяТабличнойЧасти,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Таблица.Содержание КАК СТРОКА(1000)) <> """"
	|			ТОГДА Таблица.Содержание
	|		КОГДА Таблица.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ""Предварительная оплата""
	|		КОГДА ВЫРАЗИТЬ(Таблица.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) = """"
	|			ТОГДА Таблица.Номенклатура.Наименование
	|		ИНАЧЕ Таблица.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	НЕОПРЕДЕЛЕНО КАК КодТНВЭД,
	|	ЕСТЬNULL(Таблица.Номенклатура.Услуга, ИСТИНА) КАК ЭтоУслуга,
	|	Таблица.Сумма КАК Всего,
	|	Таблица.Сумма - Таблица.СуммаНДС КАК СуммаБезНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаПлатежныхДокументовСчетФактурыВыданный()

	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ДатаДокумента КАК ДатаДокумента,
	|	Таблица.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаАвансовыхДокументовСчетФактурыВыданный()
	
	Результат =
	"ВЫБРАТЬ
	|	&НомерСчетаФактурыНаАванс КАК НомерСчетаФактурыНаАванс,
	|	&ДатаСчетаФактурыНаАванс КАК ДатаСчетаФактурыНаАванс,
	|	&НомерИсправленияСчетаФактурыНаАванс КАК НомерИсправленияСчетаФактурыНаАванс,
	|	&ДатаИсправленияСчетаФактурыНаАванс КАК ДатаИсправленияСчетаФактурыНаАванс
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И &ДанныеАСЧФ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ЕстьФункционалСведенийОбАвансах = ЕстьФункционалСведенийОбАвансах();
	
	Если ЕстьФункционалСведенийОбАвансах Тогда
		
		ВыражениеНомерСчетаФактурыНаАванс = "Таблица.НомерСчетаФактурыНаАванс";
		ВыражениеДатаСчетаФактурыНаАванс = "Таблица.ДатаСчетаФактурыНаАванс";
		ВыражениеНомерИсправленияСчетаФактурыНаАванс = "Таблица.НомерИсправленияСчетаФактурыНаАванс";
		ВыражениеДатаИсправленияСчетаФактурыНаАванс = "Таблица.ДатаИсправленияСчетаФактурыНаАванс";
		
		ВыражениеДанныеАСЧФ = "(Таблица.НомерСчетаФактурыНаАванс <> """"
			|	ИЛИ Таблица.ДатаСчетаФактурыНаАванс <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	ИЛИ Таблица.НомерИсправленияСчетаФактурыНаАванс <> """"
			|	ИЛИ Таблица.ДатаИсправленияСчетаФактурыНаАванс <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))";
		
	Иначе
		
		НеопределеноДляЗапроса = "НЕОПРЕДЕЛЕНО";
		
		ВыражениеНомерСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		ВыражениеДатаСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		ВыражениеНомерИсправленияСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		ВыражениеДатаИсправленияСчетаФактурыНаАванс = НеопределеноДляЗапроса;
		
		ВыражениеДанныеАСЧФ = "ЛОЖЬ";
		
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&НомерСчетаФактурыНаАванс", ВыражениеНомерСчетаФактурыНаАванс);
	Замены.Добавить("&ДатаСчетаФактурыНаАванс", ВыражениеДатаСчетаФактурыНаАванс);
	Замены.Добавить("&НомерИсправленияСчетаФактурыНаАванс", ВыражениеНомерИсправленияСчетаФактурыНаАванс);
	Замены.Добавить("&ДатаИсправленияСчетаФактурыНаАванс", ВыражениеДатаИсправленияСчетаФактурыНаАванс);
	Замены.Добавить("&ДанныеАСЧФ", ВыражениеДанныеАСЧФ);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактурыВыданный()

	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ПредставлениеНомера КАК ПредставлениеНомера,
	|	Реквизиты.Исправление КАК Исправление,
	|	Реквизиты.НомерИсправления КАК НомерИсправления,
	|	Реквизиты.Дата КАК ДатаИсправления,
	|	Реквизиты.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	Реквизиты.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	Реквизиты.КПППродавца КАК КПППоставщика,
	|	Реквизиты.КППКонтрагента КАК КПППокупателя,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	Реквизиты.КодВидаОперации КАК КодВидаОперации,
	|	Реквизиты.СводныйКомиссионный
	|		И НЕ ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ) КАК СводныйКомиссионный
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДокументовОснованияСчетФактурыВыданный()

	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОказанияУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА ТабКонтрагенты.Контрагент.ОбособленноеПодразделение
	|				И ТабКонтрагенты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ТабКонтрагенты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ТабКонтрагенты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	ТабКонтрагенты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента, 
	|	ЕСТЬNULL(ТабКонтрагенты.ДоговорКонтрагента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор, 
	|	ЕСТЬNULL(ТабКонтрагенты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ТабКонтрагенты.ДоговорКонтрагента.ВидДоговора, НЕОПРЕДЕЛЕНО) КАК ВидДоговора,
	|	ЕСТЬNULL(ТабКонтрагенты.ДоговорКонтрагента.Наименование, """") КАК Основание,
	|	ЕСТЬNULL(ТабКонтрагенты.ДоговорКонтрагента.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ОснованиеДата,
	|	ЕСТЬNULL(ТабКонтрагенты.ДоговорКонтрагента.Номер, """") КАК ОснованиеНомер,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ОказаниеУслуг КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Контрагенты КАК ТабКонтрагенты
	|		ПО Реквизиты.Ссылка = ТабКонтрагенты.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И ТабКонтрагенты.СчетФактура = &СчетФактура
	|	И ТабКонтрагенты.СчетФактура <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхОказанияУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	"""" КАК ИмяТабличнойЧасти,
	|	1 КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Номенклатура.Код КАК НоменклатураКод,
	|	ЕСТЬNULL(Таблица.Номенклатура.КодОКВЭД2.Код, """") КАК НоменклатураАртикул,
	|	ВЫБОР
	|		КОГДА НЕ Таблица.Номенклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ВЫРАЗИТЬ(Таблица.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ Таблица.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	Таблица.Номенклатура.ПериодичностьУслуги КАК ПериодичностьУслуги,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТабКонтрагенты.Количество КАК Количество,
	|	ТабКонтрагенты.Цена КАК Цена,
	|	ТабКонтрагенты.Сумма КАК Сумма,
	|	ТабКонтрагенты.СуммаНДС КАК СуммаНДС,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	Таблица.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТабКонтрагенты.Сумма КАК ВсегоРуб,
	|	ТабКонтрагенты.СуммаНДС КАК НДСРуб,
	|	ТабКонтрагенты.Сумма - ТабКонтрагенты.СуммаНДС КАК СуммаБезНДСРуб,
	|	"""" КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ОказаниеУслуг КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Контрагенты КАК ТабКонтрагенты
	|		ПО Таблица.Ссылка = ТабКонтрагенты.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И ТабКонтрагенты.СчетФактура = &СчетФактура
	|	И ТабКонтрагенты.СчетФактура <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ТаблицаДокумента.НоменклатураАртикул
	|		ИНАЧЕ ТаблицаДокумента.НоменклатураКод
	|	КОНЕЦ КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ПериодичностьУслуги КАК ПериодичностьУслуги,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	НЕОПРЕДЕЛЕНО КАК КодТНВЭД,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Количество = 0
	|						ТОГДА 0
	|					КОГДА ТаблицаДокумента.СуммаНДС = 0
	|						ТОГДА ТаблицаДокумента.Цена
	|					ИНАЧЕ (ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.Количество
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиКорректировкаРеализации()
	
	Результат =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.НомерИсходногоДокумента КАК Номер,
	|	Реквизиты.ДатаИсходногоДокумента КАК Дата,
	|	Реквизиты.НомерИсправления КАК НомерИсправления,
	|	Реквизиты.Дата КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель.ОбособленноеПодразделение
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент = Реквизиты.Контрагент
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.ГосударственныйКонтракт.Код, """") КАК ИдентификаторГосКонтракта,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Контрагент
	|		ИНАЧЕ Реквизиты.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.БанковскийСчетОрганизации КАК БанковскийСчетПродавца,
	|	Реквизиты.АдресДоставки КАК АдресДоставки,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныеДанныеКорректировкаРеализации()
	
	Результат = УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()
	+ ТекстЗапроса_РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИдентификаторСтрокиУслуги КАК ИдентификаторСтроки,
	|	МАКСИМУМ(КорректировкаРеализацииСведенияПрослеживаемости.СтранаПроисхождения) КАК СтранаПроисхождения,
	|	МАКСИМУМ(СтраныМира.Код) КАК СтранаПроисхожденияКод
	|ПОМЕСТИТЬ ВТ_ДанныеПоСтранеПроисхождения
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК КорректировкаРеализацииСведенияПрослеживаемости
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|			ПО КорректировкаРеализацииСведенияПрослеживаемости.СтранаПроисхождения = СтраныМира.Ссылка
	|		ПО &ИдентификаторСтрокиУслуги = КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки
	|ГДЕ
	|	КорректировкаРеализацииСведенияПрослеживаемости.Ссылка = &Ссылка
	|	И Таблица.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	&ИдентификаторСтрокиУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ПорядокТЧ,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	&КодТовараУслуги КАК НоменклатураКод,
	|	&НаименованиеНоменклатуры КАК НоменклатураНаименование,
	|	Таблица.Номенклатура.Услуга КАК ЭтоУслуга,
	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таблица.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	&НомерГТД КАК НомерГТД,
	|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Таблица.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	Таблица.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	Таблица.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	&ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	&СуммаАкциза КАК СуммаАкциза,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Услуги"",
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Номенклатура,
	|	&КодТовараУслуги,
	|	&НаименованиеУслуги,
	|	ИСТИНА,
	|	ЕСТЬNULL(Таблица.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
	|	Таблица.Количество,
	|	Таблица.Цена,
	|	Таблица.Сумма,
	|	Таблица.СтавкаНДС,
	|	Таблица.СуммаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(ВТ_ДанныеПоСтранеПроисхождения.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)),
	|	ЕСТЬNULL(ВТ_ДанныеПоСтранеПроисхождения.СтранаПроисхожденияКод, """"),
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	0,
	|	&ИдентификаторСтрокиУслуги,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0)
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСтранеПроисхождения КАК ВТ_ДанныеПоСтранеПроисхождения
	|		ПО &ИдентификаторСтрокиУслуги = ВТ_ДанныеПоСтранеПроисхождения.ИдентификаторСтроки
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И Таблица.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	""АгентскиеУслуги"",
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Номенклатура,
	|	&КодТовараУслуги,
	|	&НаименованиеУслуги,
	|	ИСТИНА,
	|	ЕСТЬNULL(Таблица.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
	|	Таблица.Количество,
	|	Таблица.Цена,
	|	Таблица.Сумма,
	|	Таблица.СтавкаНДС,
	|	Таблица.СуммаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	"""",
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	0,
	|	&ИдентификаторСтрокиАгентскойУслуги,
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
	|	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0)
	|ИЗ
	|	Документ.КорректировкаРеализации.АгентскиеУслуги КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Таблица.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслуги))
	|			И (Таблица.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ПорядокТЧ КАК ПорядокТЧ,
	|	ТаблицаДокумента.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураКод КАК НоменклатураКод,
	|	ТаблицаДокумента.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ТаблицаДокумента.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименованиеПолное,
	|	ТаблицаДокумента.НоменклатураКодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК Всего,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаДокумента.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	ТаблицаДокумента.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ТаблицаДокумента.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	ТаблицаДокумента.СуммаАкциза КАК СуммаАкциза,
	|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаДокумента.ВсегоРуб КАК ВсегоРуб,
	|	ТаблицаДокумента.НДСРуб КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемНоменклатуры(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемУслуги(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыраженияСПодакцизнымТоваром(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСИдентификаторомСтрокДляУслуг(Результат);
	УПД970_ЗаполнитьВТекстеЗапросаВыражениеСИдентификаторомСтрокДляАгентскихУслуг(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиКорректировкаРеализации()
	
	ИмяДокумента = "КорректировкаРеализации";
	Результат = УПД970_ТекстЗапросаСведенийПрослеживаемостиПоДокументу(ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийПрослеживаемостиПоДокументу(ИмяДокумента)
	
	Результат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.РНПТ.Код КАК НомерТовара,
	|	Таблица.КоличествоПрослеживаемости КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаДокумента.ПрослеживаемыйКомплект, ЛОЖЬ)
	|				ИЛИ Таблица.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ТаблицаДокумента.СтранаПроисхождения.Код, """")
	|		ИНАЧЕ Таблица.СтранаПроисхождения.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, ""796"") КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА Таблица.Сумма = 0
	|			ТОГДА Таблица.Количество * ВЫБОР
	|					КОГДА Документ.СуммаВключаетНДС
	|							И ТаблицаДокумента.Количество <> 0
	|						ТОГДА (ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.Количество
	|					КОГДА Документ.СуммаВключаетНДС
	|							И ТаблицаДокумента.Количество = 0
	|						ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|					ИНАЧЕ ТаблицаДокумента.Цена
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.Сумма
	|	КОНЕЦ КАК СтоимостьБезНалога
	|ИЗ
	|	Документ.%1.СведенияПрослеживаемости КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокумента КАК ТаблицаДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|			ПО ТаблицаДокумента.НоменклатураКодТНВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО (ТаблицаДокумента.ИдентификаторСтроки = Таблица.ИдентификаторСтроки)
	|			И Таблица.Ссылка = ТаблицаДокумента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.%1 КАК Документ
	|		ПО Таблица.Ссылка = Документ.Ссылка";
	
	Результат = СтрШаблон(Результат, ИмяДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаРублевыхСуммДокументовВВалюте()

	Результат =
	"ВЫБРАТЬ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего КАК Всего,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС КАК НДС,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДС
	|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ГДЕ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтрокиДокумента,
	|	ТабличнаяЧастьДокумента";

	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаВременнаяТаблицаВознаграждения()
	
	Результат = 
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	Реквизиты.УслугаПоВознаграждению КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(Реквизиты.УслугаПоВознаграждению.Код, """")) КАК НоменклатураКод,
	|	МАКСИМУМ(ЕСТЬNULL(Реквизиты.УслугаПоВознаграждению.КодОКВЭД2.Код, """")) КАК НоменклатураАртикул,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(1000)), """") ПОДОБНО """"
	|				ТОГДА ЕСТЬNULL(СправочникНоменклатура.Наименование, """")
	|			ИНАЧЕ ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		КОНЕЦ) КАК НоменклатураНаименование,
	|	ЕСТЬNULL(Реквизиты.УслугаПоВознаграждению.ПериодичностьУслуги, НЕОПРЕДЕЛЕНО) КАК ПериодичностьУслуги,
	|	СУММА(ЕСТЬNULL(ТаблицаТовары.СуммаВознаграждения, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(ТаблицаТовары.СуммаНДСВознаграждения, 0)) КАК СуммаНДС,
	|	Реквизиты.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТВознаграждение
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ТаблицаТовары
	|		ПО Реквизиты.Ссылка = ТаблицаТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поставщики КАК ВТ_Поставщики
	|		ПО Реквизиты.Ссылка = ВТ_Поставщики.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Реквизиты.УслугаПоВознаграждению = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И ВТ_Поставщики.Продавец ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.УслугаПоВознаграждению,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.Ссылка,
	|	Реквизиты.СтавкаНДСВознаграждения,
	|	Реквизиты.ВалютаДокумента";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаВременнаяТаблицаНаименованияУслуг()
	
	Результат = 
	"ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахПоставщики.КлючСтроки КАК КлючСтроки,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ПоступлениеТоваровУслугУслуги.Содержание КАК СТРОКА(1000)) КАК Содержание
	|ПОМЕСТИТЬ ВТ_НаименованиеУслугПредварительная
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ОтчетКомитентуОПродажахПоставщики.Партия = ПоступлениеТоваровУслугУслуги.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &Ссылка
	|	И ОтчетКомитентуОПродажахПоставщики.СчетФактура = &СчетФактура
	|	И ОтчетКомитентуОПродажахПоставщики.ДатаСФ < ДАТАВРЕМЯ(2021, 7, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахПоставщики.КлючСтроки,
	|	ПоступлениеТоваровУслугАгентскиеУслуги.Номенклатура,
	|	ВЫРАЗИТЬ(ПоступлениеТоваровУслугАгентскиеУслуги.Содержание КАК СТРОКА(1000))
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
	|		ПО ОтчетКомитентуОПродажахПоставщики.Партия = ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &Ссылка
	|	И ОтчетКомитентуОПродажахПоставщики.СчетФактура = &СчетФактура
	|	И ОтчетКомитентуОПродажахПоставщики.ДатаСФ < ДАТАВРЕМЯ(2021, 7, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НаименованиеУслугПредварительная.КлючСтроки КАК КлючСтроки,
	|	ВТ_НаименованиеУслугПредварительная.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТ_НаименованиеУслугПредварительная.Содержание) КАК Содержание
	|ПОМЕСТИТЬ ВТ_НаименованиеУслуг
	|ИЗ
	|	ВТ_НаименованиеУслугПредварительная КАК ВТ_НаименованиеУслугПредварительная
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НаименованиеУслугПредварительная.Номенклатура,
	|	ВТ_НаименованиеУслугПредварительная.КлючСтроки";
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьВТекстеЗапросаВыражениеСКодомТовараУслуги(ТекстЗапроса)
	
	ВыражениеТекстаЗапроса =
	"	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ЕСТЬNULL(Таблица.Номенклатура.Артикул, """")
	|		ИНАЧЕ ЕСТЬNULL(Таблица.Номенклатура.Код, """")
	|	КОНЕЦ";

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&КодТовараУслуги",
		ВыражениеТекстаЗапроса);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемНоменклатуры(ТекстЗапроса)

	ВыражениеТекстаЗапроса =
	"	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Таблица.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) <> """"
	|			ТОГДА Таблица.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ Таблица.Номенклатура.Наименование
	|	КОНЕЦ";

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&НаименованиеНоменклатуры",
		ВыражениеТекстаЗапроса);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНаименованиемУслуги(ТекстЗапроса)
	
	ВыражениеТекстаЗапроса =
	"	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Таблица.Содержание КАК СТРОКА(1000)) <> """"
	|			ТОГДА Таблица.Содержание
	|		КОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Таблица.Номенклатура.НаименованиеПолное, """") КАК СТРОКА(1000)) <> """"
	|			ТОГДА Таблица.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ЕСТЬNULL(Таблица.Номенклатура.Наименование, """")
	|	КОНЕЦ";

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&НаименованиеУслуги",
		ВыражениеТекстаЗапроса);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВТекстеЗапросаВыражениеСНомеромГТД(ТекстЗапроса)

	ВыражениеТекстаЗапроса =
	"	ВЫБОР
	|		КОГДА ЕСТЬNULL(Таблица.НомерГТД.РегистрационныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(Таблица.НомерГТД.Код, """")
	|		ИНАЧЕ Таблица.НомерГТД.РегистрационныйНомер
	|	КОНЕЦ";

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&НомерГТД",
		ВыражениеТекстаЗапроса);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВТекстеЗапросаВыраженияСПодакцизнымТоваром(ТекстЗапроса)
	
	ЕстьФункционалСАкцизами = (Метаданные.ФункциональныеОпции.Найти("ПроизводствоПодакцизныхТоваров") <> Неопределено);
	Если ЕстьФункционалСАкцизами Тогда
		
		ВыражениеТекстаЗапросаСуммаАкциза = "Таблица.СуммаАкциза";
		
		ВыражениеТекстаЗапросаПодакцизныйТовар =
		"Таблица.ПодакцизныйТовар
		|	ИЛИ Таблица.Номенклатура.КодВидаПодакцизногоТовара <> ЗНАЧЕНИЕ(Справочник.КодыВидовПодакцизныхТоваров.ПустаяСсылка)";
		
	Иначе
		
		ВыражениеТекстаЗапросаСуммаАкциза = "0";
		ВыражениеТекстаЗапросаПодакцизныйТовар = "ЛОЖЬ";
		
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&СуммаАкциза",
		ВыражениеТекстаЗапросаСуммаАкциза);
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПодакцизныйТовар",
		ВыражениеТекстаЗапросаПодакцизныйТовар);

КонецПроцедуры

Процедура УПД970_ЗаполнитьВТекстеЗапросаРТиУВыражениеСАдресомДоставкиЗначение(ТекстЗапроса)
	
	ВыражениеТекстаЗапроса = """""";

	ЕстьАдресДоставкиВJSON = ЕстьРеквизитОбъектаЛок(
		"АдресДоставкиЗначение",
		Метаданные.Документы.РеализацияТоваровУслуг);
		
	Если ЕстьАдресДоставкиВJSON Тогда
		ВыражениеТекстаЗапроса = "Реквизиты.АдресДоставкиЗначение";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&АдресДоставкиЗначение", ВыражениеТекстаЗапроса);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВТекстеЗапросаВыражениеСИдентификаторомСтрокДляУслуг(ТекстЗапроса)

	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	ЕстьФункциональностьПрослеживаемыхТоваровВСоставеРабот = (СравнитьВерсии_(ВерсияБП, "3.0.148") > 0);
	
	ВыражениеТекстаЗапроса = """""";
	Если ЕстьФункциональностьПрослеживаемыхТоваровВСоставеРабот Тогда
		ВыражениеТекстаЗапроса = "Таблица.ИдентификаторСтроки";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтрокиУслуги", ВыражениеТекстаЗапроса);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВТекстеЗапросаВыражениеСИдентификаторомСтрокДляАгентскихУслуг(ТекстЗапроса)

	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	ЕстьИдентификаторСтрокАгентскихУслуг = (СравнитьВерсии_(ВерсияБП, "3.0.148") > 0);
	
	ВыражениеТекстаЗапроса = """""";
	Если ЕстьИдентификаторСтрокАгентскихУслуг Тогда
		ВыражениеТекстаЗапроса = "Таблица.ИдентификаторСтроки";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтрокиАгентскойУслуги", ВыражениеТекстаЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область УПД970_ДанныхДокументовИнформационнойБазы

Функция УПД970_ИсходныеДанныеРеализацияТоваровУслуг(Документ)

	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиРеализацияТоваровУслуг();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныеДанныеРеализацияТоваровУслуг();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиРеализацияТоваровУслуг();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);
	
	ТабличныеДанные = РезультатЗапроса[4].Выгрузить();
	СведенияПрослеживаемости = РезультатЗапроса[5].Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеПередачаТоваров(Документ)

	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиПередачаТоваров();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныеДанныеПередачаТоваров();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиПередачаТоваров();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);
	
	ТабличныеДанные = РезультатЗапроса[3].Выгрузить();
	СведенияПрослеживаемости = РезультатЗапроса[4].Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеРеализацииОтгруженныхТоваров(Документ)
	
	Реквизиты = ЗначенияРеквизитовОбъектаЛок(Документ, "Организация, Дата");
	
	НачислятьНДСПоОтгрузке = УчетнаяПолитика.НачислятьНДСПоОтгрузке(Реквизиты.Организация, Реквизиты.Дата);
	НачислятьНДСПриПередачеНедвижимости = УчетнаяПолитика.НачислятьНДСПриПередачеНедвижимости(
		Реквизиты.Организация,
		Реквизиты.Дата);
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиРеализацииОтгруженныхТоваров();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныеДанныеРеализацииОтгруженныхТоваров();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиРеализацииОтгруженныхТоваров();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("НачислятьНДСПоОтгрузке", НачислятьНДСПоОтгрузке);
	Запрос.УстановитьПараметр("НачислятьНДСПриПередачеНедвижимости", НачислятьНДСПриПередачеНедвижимости);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов());

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДанныеШапки = РезультатЗапроса[2].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);
	
	ТабличныеДанные = РезультатЗапроса[7].Выгрузить();
	СведенияПрослеживаемости = РезультатЗапроса[8].Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеАктОбОказанииПроизводственныхУслуг(Документ)

	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаРеквизитовАктаОбОказанииПроизводственныхУслуг();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхАктаОбОказанииПроизводственныхУслуг();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[3].Выгрузить();
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		ДополнитьНаименованиеПериодическойУслуги(
			СтрокаТаблицы.НоменклатураНаименование,
			СтрокаТаблицы.ПериодичностьУслуги,
			ДанныеШапки.Дата);
	КонецЦикла;
		
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеРеализацииУслугПоПереработке(Документ)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиРеализацииУслугПоПереработке();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхРеализацииУслугПоПереработке();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[3].Выгрузить();

	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	
	Возврат Результат;

КонецФункции

Функция УПД970_ИсходныеДанныеПередачиОС(Документ)

	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиПередачиОС();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныеДанныеПередачиОС();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиПередачиОС();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", ЕдиницаИзмеренияШтуки());
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов());

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[3].Выгрузить();
	СведенияПрослеживаемости = РезультатЗапроса[4].Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;

КонецФункции

Функция УПД970_ИсходныеДанныеНачисленияАренднойПлаты(Документ)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаРеквизитовНачисленияАренднойПлаты();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхНачисленияАренднойПлаты();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[3].Выгрузить();

	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеВозвратаТоваровПоставщику(Документ)

	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныеДанныеВозвратаТоваровПоставщику();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиВозвратаТоваровПоставщику();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[3].Выгрузить();
	СведенияПрослеживаемости = РезультатЗапроса[4].Выгрузить();

	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;

КонецФункции

Функция УПД970_ИсходныеДанныеОтчетаКомитентуОПродажах(СчетФактура, ДокументОснование)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаРеквизитовОтчетаКомитентуОПродажах();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхОтчетаКомитентуОПродажах();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиОтчетаКомитентуОПродажах();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов());
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДанныеШапки = РезультатЗапроса[2].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[8].Выгрузить();

	СведенияПрослеживаемости = РезультатЗапроса[9].Выгрузить();
	
	Если ЗначениеЗаполнено(СчетФактура)
		И ЭтоСчетФактураОтНесколькихПродавцов(СчетФактура) Тогда
		УПД970_ЗаполнитьДанныеПоКонтрагентамСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеШапки, СчетФактура);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеСчетФактурыВыданныйНаАванс(Документ)

	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактурыВыданныйНаАванс();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхСчетФактурыВыданныйНаАванс();
	ТекстЗапросаПлатежныеДокументы = УПД970_ТекстЗапросаПлатежныхДокументовСчетФактурыВыданный();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПлатежныеДокументы);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);
	
	ЦифровойИндексОбособленногоПодразделения = "";
	
	Если ЗначениеЗаполнено(Документ.ДокументОснование) Тогда 
		
		ОснованиеСчетаФактуры = Документ.ДокументОснование;
		ЕстьРеквизитПодразделениеОрганизации = ЕстьРеквизитОбъектаЛок(
			"ПодразделениеОрганизации",
			ОснованиеСчетаФактуры.Метаданные()
		);
		
		Если ЕстьРеквизитПодразделениеОрганизации Тогда
			ЦифровойИндексОбособленногоПодразделения = ЗначениеРеквизитаОбъектаЛок(
				ОснованиеСчетаФактуры,
				"ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения"
			);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЦифровойИндексОбособленногоПодразделения) Тогда
		ДанныеШапки.ЦифровойИндексОбособленногоПодразделения = ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
	
	ТабличныеДанные = РезультатЗапроса[1].Выгрузить();
	ПлатежныеДокументы = РезультатЗапроса[2].Выгрузить();

	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("ПлатежноРасчетныеДокументы", ПлатежныеДокументы);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеОтчетаКомиссионераОПродажах(СчетФактура, ДокументОснование)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхОтчетаКомиссионераОПродажах();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиОтчетаКомиссионераОПродажах();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов());

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДанныеШапки = РезультатЗапроса[2].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[5].Выгрузить();
	СведенияПрослеживаемости = РезультатЗапроса[6].Выгрузить();

	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеОказанияУслуг(СчетФактура, ДокументОснование)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиОказанияУслуг();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныхДанныхОказанияУслуг();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов());

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);

	ТабличныеДанные = РезультатЗапроса[2].Выгрузить();
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		ДополнитьНаименованиеПериодическойУслуги(
			СтрокаТаблицы.НоменклатураНаименование,
			СтрокаТаблицы.ПериодичностьУслуги,
			ДанныеШапки.Дата);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеСчетФактурыВыданный(Документ)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактурыВыданный();
	ТекстЗапросаДокументовОснований = УПД970_ТекстЗапросаДокументовОснованияСчетФактурыВыданный();
	ТекстЗапросаПлатежныеДокументы = УПД970_ТекстЗапросаПлатежныхДокументовСчетФактурыВыданный();
	ТекстЗапросаАвансовыхДокументов = УПД970_ТекстЗапросаАвансовыхДокументовСчетФактурыВыданный();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДокументовОснований);
	ТекстыЗапросов.Добавить(ТекстЗапросаПлатежныеДокументы);
	ТекстыЗапросов.Добавить(ТекстЗапросаАвансовыхДокументов);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);
	
	ДокументыОснования = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	ПлатежныеДокументы = РезультатЗапроса[2].Выгрузить();
	АвансовыеДокументы = РезультатЗапроса[3].Выгрузить();
	
	ТабличныеДанные = УПД970_НоваяТаблицаТоварСчетФактураВыданный();
	СведенияПрослеживаемости = Неопределено;
	
	Для Индекс = 0 По ДокументыОснования.ВГраница() Цикл
		
		ДокументОснования = ДокументыОснования[Индекс];
		
		ИсходныеДанныеОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетФактураВыданный(Документ, ДокументОснования);
		
		Если Индекс = 0 Тогда
			УПД970_КопироватьРеквизитыИсходногоДокументаВДанныеСчетФактуры(ДанныеШапки, ИсходныеДанныеОснования.ДанныеШапки);
		КонецЕсли;
		
		ЗагрузитьВТаблицуЗначенийЛок(ИсходныеДанныеОснования.ТабличныеДанные, ТабличныеДанные);
		
		Если ИсходныеДанныеОснования.Свойство("СведенияПрослеживаемости") Тогда
			
			Если СведенияПрослеживаемости = Неопределено Тогда
				СведенияПрослеживаемости = ИсходныеДанныеОснования.СведенияПрослеживаемости;
			Иначе
				ЗагрузитьВТаблицуЗначенийЛок(ИсходныеДанныеОснования.СведенияПрослеживаемости, СведенияПрослеживаемости);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	Результат.Вставить("ДокументыОснования", ДокументыОснования);
	Результат.Вставить("ПлатежноРасчетныеДокументы", ПлатежныеДокументы);
	Результат.Вставить("АвансовыеДокументы", АвансовыеДокументы);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеКорректировкаРеализации(Документ)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиКорректировкаРеализации();
	ТекстЗапросаТабличныеДанные = УПД970_ТекстЗапросаТабличныеДанныеКорректировкаРеализации();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийПрослеживаемостиКорректировкаРеализации();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеДанные);
	ТекстыЗапросов.Добавить(ТекстЗапросаПрослеживаемость);
	
	РезультатЗапроса = УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов);
	
	ТаблицаДанныеШапки = РезультатЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныеШапки[0]);
	
	ТабличныеДанные = РезультатЗапроса[4].Выгрузить();
	СведенияПрослеживаемости = РезультатЗапроса[5].Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", ДанныеШапки);
	Результат.Вставить("ТабличныеДанные", ТабличныеДанные);
	Результат.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НоваяТаблицаТоварСчетФактураВыданный()
	
	ДлинаСтроки4 = 4;
	ДлинаСтроки20 = 20;
	ДлинаСтроки30 = 30;
	ДлинаСтроки36 = 36;
	ДлинаСтроки100 = 100;
	ДлинаСтроки150 = 150;
	ДлинаСтроки2000 = 2000;
	
	ТипТовара = Новый Массив;
	ТипТовара.Добавить(Тип("СправочникСсылка.ОсновныеСредства"));
	ТипТовара.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений();

	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("ИмяТабличнойЧасти", НовыйТипСтрока(ДлинаСтроки20));
	Результат.Колонки.Добавить("НомерСтроки", ТипЧисло);
	
	Результат.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов(ТипТовара));
	Результат.Колонки.Добавить("НоменклатураКод", НовыйТипСтрока(ДлинаСтроки100));
	Результат.Колонки.Добавить("НоменклатураНаименование", НовыйТипСтрока(ДлинаСтроки2000));
	
	Результат.Колонки.Добавить("ЭтоУслуга", ТипБулево);
	Результат.Колонки.Добавить("ПрослеживаемыйТовар", ТипБулево);
	Результат.Колонки.Добавить("ПодакцизныйТовар", ТипБулево);
	
	Результат.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияКод", НовыйТипСтрока(ДлинаСтроки4));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияНаименование", НовыйТипСтрока(ДлинаСтроки150));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияНаименованиеПолное", НовыйТипСтрока(ДлинаСтроки150));
	
	Результат.Колонки.Добавить("Количество", ТипЧисло);
	Результат.Колонки.Добавить("Цена", ТипЧисло);
	Результат.Колонки.Добавить("СуммаБезНДС", ТипЧисло);
	Результат.Колонки.Добавить("СуммаНДС", ТипЧисло);
	Результат.Колонки.Добавить("Всего", ТипЧисло);
	Результат.Колонки.Добавить("СуммаАкциза", ТипЧисло);
	Результат.Колонки.Добавить("СуммаБезНДСРуб", ТипЧисло);
	Результат.Колонки.Добавить("НДСРуб", ТипЧисло);
	Результат.Колонки.Добавить("ВсегоРуб", ТипЧисло);
	
	Результат.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	
	Результат.Колонки.Добавить("СтранаПроисхождения", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	Результат.Колонки.Добавить("СтранаПроисхожденияКод", НовыйТипСтрока(ДлинаСтроки4));
	Результат.Колонки.Добавить("НомерГТД", НовыйТипСтрока(ДлинаСтроки30));
	Результат.Колонки.Добавить("КодТНВЭД", Новый ОписаниеТипов("СправочникСсылка.КлассификаторТНВЭД"));

	Результат.Колонки.Добавить("ИдентификаторСтроки", НовыйТипСтрока(ДлинаСтроки36));
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетФактураВыданный(СчетФактура, ДокументОснование)

	ТипДокумента = ТипЗнч(ДокументОснование);
	
	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанныеРеализацияТоваровУслуг(ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Результат = УПД970_ИсходныеДанныеКорректировкаРеализации(ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанныеАктОбОказанииПроизводственныхУслуг(ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		Результат = УПД970_ИсходныеДанныеРеализацииУслугПоПереработке(ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПередачаОС") Тогда
		
		Результат = УПД970_ИсходныеДанныеПередачиОС(ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанныеОтчетаКомитентуОПродажах(СчетФактура, ДокументОснование);
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			
		Результат = УПД970_ИсходныеДанныеВозвратаТоваровПоставщику(ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			
		Результат = УПД970_ИсходныеДанныеОтчетаКомиссионераОПродажах(СчетФактура, ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
			
		Результат = УПД970_ИсходныеДанныеОказанияУслуг(СчетФактура, ДокументОснование);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
			
		Результат = УПД970_ИсходныеДанныеРеализацииОтгруженныхТоваров(ДокументОснование);
		
	ИначеЕсли Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено
		И ТипДокумента = Тип("ДокументСсылка.АР_НачислениеАренднойПлаты") Тогда
		
		Результат = УПД970_ИсходныеДанныеНачисленияАренднойПлаты(ДокументОснование);
	
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПередачаТоваров") Тогда
		
		Результат = УПД970_ИсходныеДанныеПередачаТоваров(ДокументОснование);
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не поддерживаются счета-фактуры с документами-основаниями %1'"),
			ДокументОснование.Метаданные().Синоним);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РезультатЗапросаИсходныхДанныхДокумента(Документ, ТекстыЗапросов)
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов());

	Результат = Запрос.ВыполнитьПакет();

	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДанныеПоКонтрагентамСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеШапки, СчетФактура)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеШапки.Ссылка);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
	|				И ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент
	|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
	|				ИЛИ ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ИЛИ ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ОтчетКомитентуОПродажахПоставщики.Поставщик
	|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик
	|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузополучатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Партия.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|ГДЕ
	|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &Ссылка
	|	И ОтчетКомитентуОПродажахПоставщики.СчетФактура = &СчетФактура
	|	И ОтчетКомитентуОПродажахПоставщики.Ссылка.ВыписыватьСчетаФактурыСводно";

	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеШапки.Вставить("Поставщик", Новый Массив);
	ДанныеШапки.Вставить("Грузоотправитель", Новый Массив);
	ДанныеШапки.Вставить("Грузополучатель", Новый Массив);

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Поставщик) Тогда
			ДанныеШапки.Поставщик.Добавить(Выборка.Поставщик);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Грузоотправитель) Тогда
			ДанныеШапки.Грузоотправитель.Добавить(Выборка.Грузоотправитель);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
			ДанныеШапки.Грузополучатель.Добавить(Выборка.Грузополучатель);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область УПД970_ЗаполнениеЭлементовПротоструктуры

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	ЗаполнитьЗначенияСвойств(Результат, СтрокаТаблицы);
	
	Результат.Упаковка = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Упаковка");
	Результат.УпаковкаДоИзменения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "УпаковкаДоИзменения");
	
	Результат.ЕдиницаИзмерения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "ЕдиницаИзмерения");
	Результат.ЕдиницаИзмеренияДоИзменения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "ЕдиницаИзмеренияДоИзменения");
	
	Результат.Номенклатура = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Номенклатура");
	Результат.Характеристика = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Характеристика");
	Результат.Серия = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "Серия");
	Результат.СтранаПроисхождения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "СтранаПроисхождения");
	Результат.СтавкаНДС = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "СтавкаНДС");
	Результат.СтавкаНДСДоИзменения = СсылочноеЗначениеСвойстваИсточникаДанных(СтрокаТаблицы, "СтавкаНДСДоИзменения");
	Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка;
	
	Если Не ЗначениеЗаполнено(Результат.ПрослеживаемыйТовар) Тогда
		Результат.ПрослеживаемыйТовар = Ложь;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаТаблицы, "ИдентификаторСтроки") Тогда
		Результат.ИдентификаторСтроки = СтрокаТаблицы.ИдентификаторСтроки;
	КонецЕсли;
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаТаблицы, "ИмяТабличнойЧасти") Тогда
		Результат.ПутьКИдентификаторуСтроки = СтрокаТаблицы.ИмяТабличнойЧасти;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОПлатежноРасчетныхДокументах(PaymentDocuments, ПлатежныеДокументы)
	
	Если Не ЗначениеЗаполнено(ПлатежныеДокументы) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПлатежныйДокумент Из ПлатежныеДокументы Цикл
		
		PaymentDocument = Контракт_PaymentDocumentInfo();
		
		Если ЗначениеЗаполнено(ПлатежныйДокумент.НомерДокумента) Тогда
			PaymentDocument.Number = ПлатежныйДокумент.НомерДокумента;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПлатежныйДокумент.ДатаДокумента) Тогда
			PaymentDocument.Date = ПлатежныйДокумент.ДатаДокумента;
		КонецЕсли;
		
		PaymentDocuments.Добавить(PaymentDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбАвансовыхСФ(AccompanyingDocuments, АвансовыеДокументы)
	
	Для Каждого АвансовыйДокумент Из АвансовыеДокументы Цикл
		
		AccompanyingDocument = Контракт_AccompanyingDocument970();
		AccompanyingDocument.Name = Конст_ИмяДокументаАСЧФ();
		AccompanyingDocument.Date = АвансовыйДокумент.ДатаСчетаФактурыНаАванс;
		AccompanyingDocument.Number = XMLСтрока(АвансовыйДокумент.НомерСчетаФактурыНаАванс);
		
		ЭтоИсправление = ЗначениеЗаполнено(АвансовыйДокумент.НомерИсправленияСчетаФактурыНаАванс)
			Или ЗначениеЗаполнено(АвансовыйДокумент.ДатаИсправленияСчетаФактурыНаАванс);
		
		Если ЭтоИсправление Тогда
			AccompanyingDocument.AdditionalInfo = СтрШаблон(
				"ИспАСЧФ № %1 от %2",
				XMLСтрока(АвансовыйДокумент.НомерИсправленияСчетаФактурыНаАванс),
				Формат(АвансовыйДокумент.ДатаИсправленияСчетаФактурыНаАванс, "ДФ=dd.MM.yyyy")
			);
		КонецЕсли;
		
		AccompanyingDocuments.Добавить(AccompanyingDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Конст_ИмяДокументаАСЧФ()
	Возврат "АСЧФ";
КонецФункции

Процедура УПД970_ЗаполнитьЧисловыеДанныеИСтавкуНДСпоСтроке(
		Item,
		ИсходнаяСтрока,
		НуженПересчетВРубли,
		НДСИсчисляетсяНалоговымАгентом,
		ТочностьКоличества,
		ТочностьЦены,
		ЦенаВключаетНДС)
	
	Если НуженПересчетВРубли Тогда
		
		СуммаБезНДС = ИсходнаяСтрока.ВсегоРуб - ИсходнаяСтрока.НДСРуб;
		СуммаНДС = ИсходнаяСтрока.НДСРуб;
		СуммаВсего = ИсходнаяСтрока.ВсегоРуб;
		
	Иначе
		
		СуммаБезНДС = ИсходнаяСтрока.СуммаБезНДС;
		СуммаНДС = ИсходнаяСтрока.СуммаНДС;
		СуммаВсего = ИсходнаяСтрока.Всего;
		
	КонецЕсли;
	
	Если НДСИсчисляетсяНалоговымАгентом Тогда
		СуммаНДС = 0;
		СуммаВсего = 0;
	КонецЕсли;
	
	Количество = 0;
	Если ЗначениеЗаполнено(ИсходнаяСтрока.Количество) Тогда
		Количество = Окр(ИсходнаяСтрока.Количество, ТочностьКоличества);
	КонецЕсли;
	
	Цена = 0;
	Если ЗначениеЗаполнено(ИсходнаяСтрока.Количество) Тогда
		Если (ЦенаВключаетНДС
			И ЗначениеЗаполнено(СуммаНДС))
			ИЛИ НуженПересчетВРубли Тогда
			Цена = Окр(СуммаБезНДС / ИсходнаяСтрока.Количество, ТочностьЦены);
		Иначе
			Цена = ИсходнаяСтрока.Цена;
		КонецЕсли;
	КонецЕсли;
	
	Item.Quantity = Количество;
	Item.Price = Цена;
	Item.SubtotalWithVatExcluded = СуммаБезНДС;
	Item.Vat = СуммаНДС;
	Item.Subtotal = СуммаВсего;
	
	Item.TaxRate = ПредставлениеСтавкиНДС(ИсходнаяСтрока.СтавкаНДС, НДСИсчисляетсяНалоговымАгентом);
	Item.WithoutVat = УПД970_ЗначениеПризнакаБезНДС(ИсходнаяСтрока.СтавкаНДС);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьИтоговыеЗначенияПоТаблице(Таблица)
	
	Таблица.TotalNet = 0;
	Таблица.TotalWithVatExcluded = 0;
	Таблица.Vat = 0;
	Таблица.Total = 0;
	
	XmlЗначениеЛожь = XMLСтрока(Ложь);
	
	Таблица.WithoutVat = XMLСтрока(Истина);
	
	Для Каждого Item Из Таблица.Items Цикл
		
		Таблица.TotalNet = Таблица.TotalNet + Item.Quantity;
		Таблица.TotalWithVatExcluded = Таблица.TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
		Таблица.Vat = Таблица.Vat + Item.Vat;
		Таблица.Total = Таблица.Total + Item.Subtotal;
		
		Если Item.WithoutVat = XmlЗначениеЛожь Тогда
			Таблица.WithoutVat = XmlЗначениеЛожь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументеОтгрузки(Контент)
	
	РеквизитыДокументов = Новый Структура;
	РеквизитыДокументов.Вставить("НомерДокумента", Контент.DocumentNumber);
	РеквизитыДокументов.Вставить("ДатаДокумента", Контент.DocumentDate);
	РеквизитыДокументов.Вставить("НаименованиеДокумента", Контент.DocumentName);
	
	DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(РеквизитыДокументов);
	Контент.DocumentShipments.Добавить(DocumentShipment);
	
КонецПроцедуры

Функция УПД970_ЗаполненныйEmployee(ДанныеСотрудника)

	Результат = Контракт_Employee970();
	
	Результат.Surname = ДанныеСотрудника.Фамилия;
	Результат.FirstName = ДанныеСотрудника.Имя;
	Результат.Patronymic = ДанныеСотрудника.Отчество;
	Результат.EmployeePosition = ДанныеСотрудника.Должность;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйDocumentShipments970(СведенияОДокументе)
	
	Результат = Контракт_DocumentShipments970();
	
	Результат.Name = СведенияОДокументе.НаименованиеДокумента;
	Результат.Number = СведенияОДокументе.НомерДокумента;
	Результат.Date = НачалоДня(СведенияОДокументе.ДатаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйTransferBases(СведенияОДокументе)
	
	Результат = Контракт_TransferBases970();
	
	Результат.Name = "Договор";
	Результат.Number = СведенияОДокументе.ОснованиеНомер;
	Результат.Date = СведенияОДокументе.ОснованиеДата;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьCustomDeclarationДляПрослеживаемыхТоваров(Item, КодСтраны)
	
	Если Не ЗначениеЗаполнено(КодСтраны) Тогда
		Возврат;
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = КодСтраны;
	CustomDeclaration.DeclarationNumber = "Прослеж";
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Функция УПД970_ЗаполненныйItemTracingInfo(СтрокаТаблицы, СведенияОПрослеживаемости, НуженПересчетВРубли)
	
	Результат = Контракт_ItemTracingInfo970();
	
	Результат.RegNumberUnit = СокрЛП(СведенияОПрослеживаемости.НомерТовара);
	Результат.Unit = СведенияОПрослеживаемости.ЕдиницаИзмеренияКод;
	Результат.UnitName = СведенияОПрослеживаемости.ЕдиницаИзмеренияНаименование;
	Результат.Quantity = СведенияОПрослеживаемости.Количество;
	
	СтоимостьБезНалога = 0;
	
	КурсПоСтроке = 1;
	Если НуженПересчетВРубли Тогда
		КурсПоСтроке = СтрокаТаблицы.СуммаБезНДСРуб / ?(СтрокаТаблицы.СуммаБезНДС = 0, 1, СтрокаТаблицы.СуммаБезНДС);
	КонецЕсли;
	
	СтруктураСтоимости = Новый Структура;
	СтруктураСтоимости.Вставить("СтоимостьБезНалога");
	СтруктураСтоимости.Вставить("Стоимость");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтоимости, СведенияОПрослеживаемости);
	ЗаполнитьЗначенияСвойств(СтруктураСтоимости, СтрокаТаблицы);
	
	Если ЗначениеЗаполнено(СтруктураСтоимости.СтоимостьБезНалога) Тогда
		СтоимостьБезНалога = Окр(СтруктураСтоимости.СтоимостьБезНалога * КурсПоСтроке, 2);
	ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.Количество) 
		И ЗначениеЗаполнено(СтруктураСтоимости.Стоимость) Тогда
		СтоимостьБезНалога = Окр((СтруктураСтоимости.Стоимость / СтрокаТаблицы.Количество * СведенияОПрослеживаемости.Количество) * КурсПоСтроке, 2);
	КонецЕсли;
	
	Результат.SumWithoutVat = СтоимостьБезНалога;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьExtendedOrganizationInfo(Content, ДанныеУчастникаЭДО)
	
	Content.Type = ДанныеУчастникаЭДО.ТипЮрФизЛица;
	Content.Name = ДанныеУчастникаЭДО.НаименованиеПолное;
	
	Content.Inn = ДанныеУчастникаЭДО.ИНН;
	Content.Kpp = ДанныеУчастникаЭДО.КПП;
	Content.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	Content.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	Content.OrganizationOrPersonInfo = ДанныеУчастникаЭДО.ИныеСведения;
	
	Если ДанныеУчастникаЭДО.ТипЮрФизЛица = ГенерацияXML_Перечисление_ВидыЮрФизЛиц().ИндивидуальныйПредприниматель Тогда
		Content.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
		Content.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРН;
		Content.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаРегистрации;
	КонецЕсли;
	
	Content.Country = ДанныеУчастникаЭДО.СтранаРегистрацииНаименование;
	Content.CountryCode = ДанныеУчастникаЭДО.СтранаРегистрацииКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		Content.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Email) Тогда
		Content.Email.Добавить(ДанныеУчастникаЭДО.Email);
	КонецЕсли;
	
	Content.BankName = ДанныеУчастникаЭДО.Банк;
	Content.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	Content.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	Content.BankId = ДанныеУчастникаЭДО.БИК;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПродавце(Content, ДанныеШапки, КПППоставщика = "")
	
	СведенияОПоставщике = ДанныеШапки.Поставщик;
	Если Не ЗначениеЗаполнено(СведенияОПоставщике) Тогда
		СведенияОПоставщике = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.Ссылка, "Организация");
	КонецЕсли;
	
	Продавцы = ЗначениеВМассивЛок(СведенияОПоставщике);
	
	ИспользоватьДанныеШапки = (Продавцы.Количество() = 1);
	
	БанковскийСчет = Неопределено;
	Если ИспользоватьДанныеШапки И ДанныеШапки.Свойство("БанковскийСчетПродавца") Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетПродавца;
	КонецЕсли;
	
	ПродавецОбособленноеПодразделение = (ИспользоватьДанныеШапки
		И ДанныеШапки.ОбособленноеПодразделениеПоставщика <> ДанныеШапки.Поставщик);
	
	Для Каждого Продавец Из Продавцы Цикл
		
		ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Продавец, ДанныеШапки.Дата, БанковскийСчет);
		
		Seller = Контракт_ExtendedOrganizationInfo970();
		
		УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, ДанныеУчастникаЭДО);
		
		Если ЗначениеЗаполнено(КПППоставщика) Тогда
			КПП = КПППоставщика;
		ИначеЕсли ПродавецОбособленноеПодразделение Тогда
			КПП = КППНаДатуЛок(ДанныеШапки.ОбособленноеПодразделениеПоставщика, ДанныеШапки.Дата);
		ИначеЕсли ПродавецКрупнейшийНалогоплательщик(Продавец) Тогда
			КПП = Справочники.Организации.КППНаДату(Продавец, ДанныеШапки.Дата);
		Иначе
			КПП = ДанныеУчастникаЭДО.КПП;
		КонецЕсли;
		
		Seller.Kpp = КПП;
		
		СведенияОбАдресе = УПД970_СведенияОбАдресе(ДанныеУчастникаЭДО.ЮридическийАдресJSON);
		Seller.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
		
		Seller.СлужебнаяИнформация.Ссылка = Продавец;
		
		Content.Sellers.Добавить(Seller);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПокупателе(Content, ДанныеШапки)
	
	СведенияОПокупателе = ДанныеШапки.Покупатель;
	Если НЕ ЗначениеЗаполнено(СведенияОПокупателе) Тогда
		СведенияОПокупателе = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.Ссылка, "Контрагент");
	КонецЕсли;
	
	Покупатели = ЗначениеВМассивЛок(СведенияОПокупателе);
	
	КПП = Неопределено;
	Если ЭтоСчетФактураВыданный(ДанныеШапки.Ссылка)
		И ЗначениеЗаполнено(ДанныеШапки.КПППокупателя) Тогда
		КПП = ДанныеШапки.КПППокупателя;
	Иначе
		КПП = КППНаДатуЛок(ДанныеШапки.ОбособленноеПодразделениеПокупателя, ДанныеШапки.Дата);
	КонецЕсли;

	Для Каждого Покупатель Из Покупатели Цикл
		
		ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Покупатель, ДанныеШапки.Дата);
		
		Buyer = Контракт_ExtendedOrganizationInfo970();
		
		УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, ДанныеУчастникаЭДО);
		
		Если ЗначениеЗаполнено(КПП) Тогда
			Buyer.Kpp = КПП;
		КонецЕсли;
		
		СведенияОбАдресе = УПД970_СведенияОбАдресе(ДанныеУчастникаЭДО.ЮридическийАдресJSON);
		Buyer.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
		
		Buyer.СлужебнаяИнформация.Ссылка = Покупатель;
		
		Content.Buyers.Добавить(Buyer);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОГрузоотправителе(Content, ДанныеШапки)
	
	Если Не ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
		Возврат;
	КонецЕсли;
	
	Грузоотправители = ЗначениеВМассивЛок(ДанныеШапки.Грузоотправитель);
	
	ДатаСведений = ДанныеШапки.Дата;
	
	Для Каждого Грузоотправитель Из Грузоотправители Цикл
		
		Если Не ЗначениеЗаполнено(Грузоотправитель) Тогда
			Продолжить;
		КонецЕсли;
		
		Shipper = Контракт_Shipper970();
		
		Shipper.SameAsSeller = Ложь;
		
		Если ТипЗнч(Грузоотправитель) = Тип("Строка")
			И НРег(Грузоотправитель) = "он же" Тогда
			
			Shipper.SameAsSeller = Истина;
			
		Иначе
			
			ЭтоОбособленноеПодразделение = (ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.ПодразделенияОрганизаций"));
			
			ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Грузоотправитель, ДатаСведений);
			
			ShipperInfo = Контракт_ExtendedOrganizationInfo970();
			Shipper.OrganizationInfo = ShipperInfo;
			
			УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, ДанныеУчастникаЭДО);
			
			Если ЭтоОбособленноеПодразделение Тогда
				
				ShipperInfo.Name = ДанныеУчастникаЭДО.НаименованиеПодразделения;
				
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактическийАдресПодразделенияОрганизаций;
				
				ИнтерфейсБП = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформациейБП");
				СведенияОбАдресе = ИнтерфейсБП.АдресСтруктурой(
					Грузоотправитель,
					ВидКонтактнойИнформации,
					ДатаСведений
				);
				
				АдресСтрокойJSON = СведенияОбАдресе.ЗначениеJSON;
				
			Иначе
				
				АдресСтрокойJSON = ДанныеУчастникаЭДО.ФактическийАдресJSON;
				
			КонецЕсли;
			
			СведенияОбАдресе = УПД970_СведенияОбАдресе(АдресСтрокойJSON);
			ShipperInfo.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
			
			ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель;
			
		КонецЕсли;
		
		Content.Shippers.Добавить(Shipper);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОГрузополучателе(Content, ДанныеШапки, СведенияОбАдресе = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		Возврат;
	КонецЕсли;
	
	Грузополучатели = ЗначениеВМассивЛок(ДанныеШапки.Грузополучатель);
	
	ДатаСведений = ДанныеШапки.Дата;
	
	Для Каждого Грузополучатель Из Грузополучатели Цикл
		
		Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Грузополучатель, ДатаСведений);
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		
		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, ДанныеУчастникаЭДО);
		
		Consignee.Name = ДанныеУчастникаЭДО.НаименованиеПодразделения;
		
		Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
			СведенияОбАдресе = УПД970_СведенияОбАдресе(ДанныеУчастникаЭДО.ФактическийАдресJSON);
		КонецЕсли;
		
		Consignee.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
		
		Consignee.СлужебнаяИнформация.Ссылка = Грузополучатель;
		
		Content.Consignees.Добавить(Consignee);
		
	КонецЦикла;
	
КонецПроцедуры

Функция УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе)
	
	Перем Результат;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыАдресов = ГенерацияXML.Перечисление_ВидыАдресов();

	Результат = Контракт_AddressInfo970();

	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		AddressSAR = УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе);
		
		Результат.AddressSAR = AddressSAR;
		Результат.Type = ВидыАдресов.АдресГАР;
		
	ИначеЕсли ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		AddressRF = УПД970_ЗаполненныйAddressRF(СведенияОбАдресе);
		
		Результат.AddressRF = AddressRF;
		Результат.Type = ВидыАдресов.АдресРФ;
		
	Иначе
		
		AddressText = УПД970_ЗаполненныйAddressText(СведенияОбАдресе);
		
		Результат.AddressText = AddressText;
		Результат.Type = ВидыАдресов.АдресСтрокой;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressRF(СведенияОбАдресе)
	
	Результат = Контракт_AddressRFInfo();
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = СведенияОбАдресе.Регион;
	Результат.Territory = СоединитьЭлементыАдресногоОбъекта(СведенияОбАдресе.РайонТипКраткий, СведенияОбАдресе.Район);
		
	Если ВРег(СведенияОбАдресе.Город) <> ВРег(СведенияОбАдресе.Регион) Тогда
		Результат.City = СоединитьЭлементыАдресногоОбъекта(
			СведенияОбАдресе.ГородТипКраткий, 
			СведенияОбАдресе.Город);
	КонецЕсли;
	
	Если ВРег(СведенияОбАдресе.Город) <> ВРег(СведенияОбАдресе.НаселенныйПункт) Тогда
		Результат.Locality = СоединитьЭлементыАдресногоОбъекта(
			СведенияОбАдресе.НаселенныйПунктТипКраткий, 
			СведенияОбАдресе.НаселенныйПункт);
	КонецЕсли;
	
	Результат.Street = СоединитьЭлементыАдресногоОбъекта(СведенияОбАдресе.УлицаТипКраткий, СведенияОбАдресе.Улица);
	
	ИмяСвойства = "Номер";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание) Тогда
		Результат.Building = СвойствоСтруктурыЛок(СведенияОбАдресе.Здание, ИмяСвойства);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса) Тогда
		Результат.Block = СвойствоСтруктурыЛок(СведенияОбАдресе.Корпуса[0], ИмяСвойства);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда
		Результат.Apartment = СвойствоСтруктурыЛок(СведенияОбАдресе.Помещения[0], ИмяСвойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressText(СведенияОбАдресе)
	
	Результат = Контракт_AddressTextInfo();

	Результат.AddressText = СведенияОбАдресе.Представление;
	Результат.CountryCode = СведенияОбАдресе.КодСтраны;
	Результат.Country = СведенияОбАдресе.Страна;

	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе)
	
	КодыРегионов = ГенерацияXML.КодыРегионов();
	
	Результат = Контракт_AddressSARInfo();
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома) Тогда
		Результат.ID = СведенияОбАдресе.ИдентификаторДома;
	Иначе
		Результат.ID = СведенияОбАдресе.ИдентификаторАдресногоОбъекта;
	КонецЕсли;
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	
	ПредставлениеРегиона = "";
	Если ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		ПредставлениеРегиона = КодыРегионов.Получить(XMLЗначение(Тип("Число"), СведенияОбАдресе.КодРегиона));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеРегиона) Тогда
		
		ЧастиРегиона = Новый Массив;
		ЧастиРегиона.Добавить(СокрЛП(СведенияОбАдресе.Регион));
		ЧастиРегиона.Добавить(НРег(СведенияОбАдресе.РегионТипПолный));
		
		ПредставлениеРегиона = СтрСоединить(ЧастиРегиона, " ");
		
	КонецЕсли;
	Результат.Region = ПредставлениеРегиона;
	
	MunicipalDistrictCode = СведенияОбАдресе.КодМуниципальногоРайона;
	Если НЕ ЗначениеЗаполнено(MunicipalDistrictCode) Тогда
		MunicipalDistrictCode = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
	КонецЕсли;
	
	Результат.MunicipalDistrict = СведенияОбАдресе.МуниципальныйРайон;
	Результат.MunicipalDistrictCode = MunicipalDistrictCode;
	
	УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОНаселенномПункте(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОТерритории(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОУлице(Результат, СведенияОбАдресе);
	
	Результат.LandPlot = СведенияОбАдресе.НомерЗемельногоУчастка;
	
	УПД970_ЗаполнитьСведенияОЗданиях(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииЗдания(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииКвартиры(Результат, СведенияОбАдресе);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Поселение) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.Поселение;
		AddressSAR.SettlementCode = СведенияОбАдресе.КодПоселения;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.ВнутригородскойРайон) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.ВнутригородскойРайон;
		AddressSAR.SettlementCode = "4";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОНаселенномПункте(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.НаселенныйПункт) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.НаселенныйПункт;
		AddressSAR.LocalityType = СведенияОбАдресе.НаселенныйПунктТипКраткий;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.Город) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.Город;
		AddressSAR.LocalityType = СведенияОбАдресе.ГородТипКраткий;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТерритории(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Территория) Тогда
		AddressSAR.PlanningElement = СведенияОбАдресе.Территория;
		AddressSAR.PlanningElementType = СведенияОбАдресе.ТерриторияТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОУлице(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Улица) Тогда
		AddressSAR.StreetElement = СведенияОбАдресе.Улица;
		AddressSAR.StreetElementType = СведенияОбАдресе.УлицаТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОЗданиях(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание.Номер)
		И ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания) Тогда
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = СведенияОбАдресе.Здание.Номер;
		AddressObject.Type = СведенияОбАдресе.Здание.ТипЗдания;
		
	КонецЕсли;

	Для Каждого Корпус Из СведенияОбАдресе.Корпуса Цикл
		
		Если Не ЗначениеЗаполнено(Корпус.Номер)
			И Не ЗначениеЗаполнено(Корпус.ТипКорпуса) Тогда
			Продолжить;
		КонецЕсли;
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = Корпус.Номер;
		AddressObject.Type = Корпус.ТипКорпуса;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииЗдания(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	
	Для Каждого ТипПомещения Из ТипыПомещенийЗдания Цикл
		
		ПомещениеЗдания = Ядро.МассивСтруктур_Найти(Помещения, ТипПомещения, "ТипПомещения");
		Если ПомещениеЗдания <> Неопределено Тогда
			
			AddressSAR.House = ПомещениеЗдания.Номер;
			AddressSAR.HouseType = ПомещениеЗдания.ТипПомещения;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииКвартиры(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ПомещениеКвартиры = УПД970_ПолучитьПомещениеКвартиры(Помещения);
	
	Если ПомещениеКвартиры = Неопределено Тогда
		ПомещениеКвартиры = УПД970_ПолучитьНеклассифицированноеПомещение(Помещения);
	КонецЕсли;
	
	Если ПомещениеКвартиры <> Неопределено Тогда
		AddressSAR.Apartment = ПомещениеКвартиры.Номер;
		AddressSAR.ApartmentType = ПомещениеКвартиры.ТипПомещения;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьItemTracingInfos(Item, СтрокаТаблицы, СведенияОПрослеживаемости, НуженПересчетВРубли)
	
	Если Не ЗначениеЗаполнено(СведенияОПрослеживаемости) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОПрослеживаемостиПоСтроке = СведенияОПрослеживаемости.НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки));
	
	Если СведенияОПрослеживаемостиПоСтроке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КодыСтранПроисхождения = Новый Массив;
	
	Для Каждого СтрокаДанныхПрослеживаемости Из СведенияОПрослеживаемостиПоСтроке Цикл
		
		ItemTracingInfo = УПД970_ЗаполненныйItemTracingInfo(
			СтрокаТаблицы,
			СтрокаДанныхПрослеживаемости,
			НуженПересчетВРубли);
		
		Item.ItemTracingInfos.Добавить(ItemTracingInfo);
		
		КодСтраны = СтрокаДанныхПрослеживаемости.СтранаПроисхожденияКод;
		Если КодыСтранПроисхождения.Найти(КодСтраны) = Неопределено Тогда
			КодыСтранПроисхождения.Добавить(КодСтраны);
		КонецЕсли;
		
	КонецЦикла;
	
	Item.CustomDeclarations.Очистить();
	
	Для Каждого КодСтраны Из КодыСтранПроисхождения Цикл
		УПД970_ЗаполнитьCustomDeclarationДляПрослеживаемыхТоваров(Item, КодСтраны);
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбОснованииОтгрузки(Контент, ДанныеШапки, ДополнительныеПараметры)
	
	УстановитьЗначениеБезОснованияОтгрузки = Истина;
		
	РеквизитыОснования = УПД970_РеквизитыОснованияОтгрузки(ДанныеШапки);
	Если РеквизитыОснования <> Неопределено Тогда
		
		УказыватьОтсутствиеОснованияУПД = СвойствоСтруктурыЛок(
			ДополнительныеПараметры,
			"УказыватьОтсутствиеОснованияУПД");

		РеквизитыОснованияЗаполнены = (ЗначениеЗаполнено(РеквизитыОснования.ОснованиеДата)
			И ЗначениеЗаполнено(РеквизитыОснования.ОснованиеНомер));
			
		УстановитьЗначениеБезОснованияОтгрузки = Не РеквизитыОснованияЗаполнены И УказыватьОтсутствиеОснованияУПД;
			
	КонецЕсли;
	
	Если УстановитьЗначениеБезОснованияОтгрузки Тогда
		
		УПД970_УстановитьЗначениеБезОснованияОтгрузки(Контент);
		
	Иначе
		
		TransferBases = УПД970_ЗаполненныйTransferBases(РеквизитыОснования);
		
		TransferBases.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияTransferBases970();
		TransferBases.СлужебнаяИнформация.ОснованиеСсылка = РеквизитыОснования.Ссылка;
		
		Контент.TransferBases.Добавить(TransferBases);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьЕдиницуИзмерения(Item, Наименование, Код)

	КодЕИ = СокрЛП(Код);
	ИмяЕИ = СокрЛП(Наименование);
	
	Item.Unit = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕИ);
	Item.UnitName = ИмяЕИ;

КонецПроцедуры

Процедура УПД970_ЗаполнитьКодВалюты(Контент, ВалютаДокумента, НуженПересчетВРубли)
	
	Если НуженПересчетВРубли Тогда
		Валюта = ВалютаРегламентированногоУчета();
	Иначе
		Валюта = ВалютаДокумента;
	КонецЕсли;
	
	Контент.Currency = ЗначениеРеквизитаОбъектаЛок(Валюта, "Код");
	
КонецПроцедуры

Функция УПД970_РеквизитыОснованияОтгрузки(ДанныеШапки)
	
	Перем Результат;
	
	ВестиУчетПоДоговорам = ВестиУчетПоДоговорам();
	
	Если ВестиУчетПоДоговорам Тогда
		
		Договор = СвойствоСтруктурыЛок(ДанныеШапки, "Договор");
		
		Результат = УПД970_НовыйРеквизитыОснованияОтгрузки();
		Если Не ЗначениеЗаполнено(Договор) Тогда
			УПД970_ЗаполнитьСведенияОснованияОтгрузкиПоДокументуОснования(Результат, ДанныеШапки.Ссылка);
		Иначе
			Результат.ОснованиеДата = ДанныеШапки.ОснованиеДата;
			Результат.ОснованиеНомер = ДанныеШапки.ОснованиеНомер;
			Результат.Основание = ДанныеШапки.Основание;
			Результат.Ссылка = Договор;
		КонецЕсли;
		
		БезДоговора = (НРег(Результат.Основание) = НРег("Без договора"));
		
		Если БезДоговора Тогда
			Результат = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйРеквизитыОснованияОтгрузки()
	
	Результат = Новый Структура;
	Результат.Вставить("ОснованиеДата");
	Результат.Вставить("ОснованиеНомер");
	Результат.Вставить("Основание");
	Результат.Вставить("Ссылка");
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_УстановитьЗначениеБезОснованияОтгрузки(Контент)
	Контент.WithoutTransferBase = Истина;
КонецПроцедуры

Процедура УПД970_ЗаполнитьСоставителяДокумента(Контент, СсылкаНаОбъект)
	
	Если ЭтоСчетФактураСоставленныйАгентом(СсылкаНаОбъект) Тогда
		
		Агент = ЗначениеРеквизитаОбъектаЛок(СсылкаНаОбъект, "Организация");
		РеквизитыАгента = УПД970_ДанныеЮрФизЛица(Агент, Контент.DocumentDate);
		
		Контент.DocumentCreator = НаименованиеИННКПП(
			РеквизитыАгента.НаименованиеПолное,
			РеквизитыАгента.ИНН,
			РеквизитыАгента.КПП);
		
		УПД970_ЗаполнитьСведенияОДокументеОснованияСоставителяФайла(Контент, СсылкаНаОбъект);
		
	Иначе
		
		УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Контент);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСоставителяДокументаПоПродавцу(Контент)
	
	ПродавецИнфо = Контент.Sellers[0];
	Контент.DocumentCreator = НаименованиеИННКПП(ПродавецИнфо.Name, ПродавецИнфо.Inn, ПродавецИнфо.Kpp);

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументеОснованияСоставителяФайла(Контент, СсылкаНаОбъект)

	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("Номер", "ДоговорКонтрагента.Номер");
	РеквизитыДоговора.Вставить("Дата", "ДоговорКонтрагента.Дата");
	
	РеквизитыДоговора = ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, РеквизитыДоговора);
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.Номер)
		И ЗначениеЗаполнено(РеквизитыДоговора.Дата) Тогда
		
		НаименованиеДокумент = "Договор";
		
		Контент.DocumentCreatorBase = Контракт_DocumentCreatorBase();
		
		Контент.DocumentCreatorBase.Name = НаименованиеДокумент;
		Контент.DocumentCreatorBase.Number = РеквизитыДоговора.Номер;
		Контент.DocumentCreatorBase.Date = РеквизитыДоговора.Дата;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокСсылка, ДокументыОтгрузки, ФункцияДокумента)
	
	DocumentShipments = Контент.DocumentShipments;
	СтрокиТаблицы = Контент.Table.Items;
	
	НаименованиеДокумента = УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияДокумента_СЧФ() Тогда
		
		ЗаполнитьДокументыОбОтгрузкиИзТабличнойЧасти(DocumentShipments, ДокСсылка);
		
		Если DocumentShipments.Количество() = 0 Тогда
			
			Для Каждого ДокументОснования Из ДокументыОтгрузки Цикл
				
				ДатаНомерДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснования, "Номер, Дата");
				НомерДокумента = ПредставлениеНомера(ДатаНомерДокумента.Номер);
				
				РеквизитыДокументов = Новый Структура;
				РеквизитыДокументов.Вставить("НомерДокумента", НомерДокумента);
				РеквизитыДокументов.Вставить("ДатаДокумента", ДатаНомерДокумента.Дата);
				РеквизитыДокументов.Вставить("НаименованиеДокумента", НаименованиеДокумента);
				
				DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(РеквизитыДокументов);
				DocumentShipments.Добавить(DocumentShipment);
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе

		РеквизитыДокументов = Новый Структура;
		РеквизитыДокументов.Вставить("НомерДокумента", Контент.DocumentNumber);
		РеквизитыДокументов.Вставить("ДатаДокумента", Контент.DocumentDate);
		РеквизитыДокументов.Вставить("НаименованиеДокумента", НаименованиеДокумента);
		
		DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(РеквизитыДокументов);
		DocumentShipments.Добавить(DocumentShipment);
		
		Контент.DocumentName = НаименованиеДокумента;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументыОбОтгрузкиИзТабличнойЧасти(DocumentShipments, ДокСсылка)
	
	Если ТипЗнч(ДокСсылка) <> Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяТабЧастьДокументыОбОтгрузкеДляСФ = ИспользуетсяТабЧастьДокументыОбОтгрузкеДляСФ();
	
	Если ИспользуетсяТабЧастьДокументыОбОтгрузкеДляСФ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактураВыданныйДокументыОбОтгрузке.НаименованиеДокумента КАК НаименованиеДокумента,
		|	СчетФактураВыданныйДокументыОбОтгрузке.НомерДокумента КАК НомерДокумента,
		|	СчетФактураВыданныйДокументыОбОтгрузке.ДатаДокумента КАК ДатаДокумента
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОбОтгрузке КАК СчетФактураВыданныйДокументыОбОтгрузке
		|ГДЕ
		|	СчетФактураВыданныйДокументыОбОтгрузке.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		
		ДанныеДокументовОбОтгрузке = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ДокументОтгрузки Из ДанныеДокументовОбОтгрузке Цикл
			
			РеквизитыДокументов = Новый Структура;
			РеквизитыДокументов.Вставить("НаименованиеДокумента", ДокументОтгрузки.НаименованиеДокумента);
			РеквизитыДокументов.Вставить("НомерДокумента", ДокументОтгрузки.НомерДокумента);
			РеквизитыДокументов.Вставить("ДатаДокумента", ДокументОтгрузки.ДатаДокумента);
			
			DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(РеквизитыДокументов);
			DocumentShipments.Добавить(DocumentShipment);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Функция УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияДокумента_СЧФДОП() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьТовары(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОпределитьДатаОтгрузки(DocumentDate, DocumentShipments)
	
	Результат = DocumentDate;
	
	Для Каждого DocumentShipment Из DocumentShipments Цикл
		Результат = DocumentShipment.Date;
		Прервать;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДатаОтгрузки(
	ДокументОтгрузки,
	DocumentDate,
	DocumentShipments,
	ФункцияДокумента)
	
	Если ФункцияДокумента = ФункцияДокумента_СЧФДОП()
		И ЗначениеЗаполнено(ДокументОтгрузки) Тогда
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛок(ДокументОтгрузки, "ДокументОтгрузки")
			И ЗначениеРеквизитаОбъектаЛок(ДокументОтгрузки, "Дата")
				<> ЗначениеРеквизитаОбъектаЛок(ДокументОтгрузки.ДокументОтгрузки, "Дата") Тогда
			
			Результат = НачалоДня(ЗначениеРеквизитаОбъектаЛок(ДокументОтгрузки.ДокументОтгрузки, "Дата"));
			
		ИначеЕсли ЕстьРеквизитИлиСвойствоОбъектаЛок(ДокументОтгрузки, "ИсходныйДокументРеализации")
			И ЗначениеРеквизитаОбъектаЛок(ДокументОтгрузки, "Дата")
				<> ЗначениеРеквизитаОбъектаЛок(ДокументОтгрузки.ИсходныйДокументРеализации, "Дата") Тогда
			
			Результат = НачалоДня(ЗначениеРеквизитаОбъектаЛок(ДокументОтгрузки.ИсходныйДокументРеализации, "Дата"));
			
		Иначе
			
			Результат = НачалоДня(ЗначениеРеквизитаОбъектаЛок(ДокументОтгрузки, "Дата"));
			
		КонецЕсли;
		
	ИначеЕсли ФункцияДокумента = ФункцияДокумента_ДОП() Тогда
		
		Результат = УПД970_ОпределитьДатаОтгрузки(DocumentDate, DocumentShipments);
		
	Иначе
		
		Результат = Дата(1, 1, 1);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаОбъект)
	
	Попытка
		
		РаботаСМаркировкой.ЗаполнитьСведенияОМаркировке970(Контент);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		
		ПодробнаяОшибка = СтрШаблон(
			"Не удалось заполнить сведения о маркировке по причине:
			|%1",
			ПодробноеПредставлениеОшибки(Ошибка)
		);
		
		ЗаписьЖурналаРегистрации(
			"Диадок.РаботаСМаркировкой",
			УровеньЖурналаРегистрации.Ошибка,
			СсылкаНаОбъект.Метаданные(),
			СсылкаНаОбъект,
			ПодробнаяОшибка
		);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Content)
	
	ЕстьПрослеживаемыеТовары = Ложь;
	
	Для Каждого Item Из Content.Table.Items Цикл
		Если Item.ItemTracingInfos.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТовары = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПризнакиПрослежкиИМаркировки = ГенерацияXML.Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваровУПД970(ЕстьПрослеживаемыеТовары);
	
	ГенерацияXML.Заполнить_ПризнакиПрослеживаемыхИМаркируемыхТоваровДокументаУПД970(Content, ПризнакиПрослежкиИМаркировки);

КонецПроцедуры

Процедура УПД970_ЗаполнитьКоличествоПоСтроке(Item, СтрокаТаблицы, ФункцияДокумента, ТочностьКоличества)
	
	Item.Quantity = 0;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
		
		Item.Quantity = Окр(СтрокаТаблицы.Количество, ТочностьКоличества);
		
	Иначе
		
		ТипыНоменклатурыКонтента = ГенерацияXML.Перечисление_ItemMarks();
		
		ЭтоТипНоменклатурыУслугаИлиРабота = (Item.ItemMark = ТипыНоменклатурыКонтента.Услуга
			Или Item.ItemMark = ТипыНоменклатурыКонтента.Работа);
		
		КоличествоИЦенаОбязательны = УПД970_КоличествоИЦенаОбязательныПоФормату(ФункцияДокумента, Item.Unit);

		Если КоличествоИЦенаОбязательны И ЭтоТипНоменклатурыУслугаИлиРабота Тогда
			Item.Quantity = 1;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ЗаполнитьЦенуПоСтроке(Item, СтрокаТаблицы, ФункцияДокумента, ТочностьЦены)
	
	Item.Price = 0;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Цена) Тогда
		
		Item.Price = Окр(СтрокаТаблицы.Цена, ТочностьЦены);
		
	Иначе
		
		ТипыНоменклатурыКонтента = ГенерацияXML.Перечисление_ItemMarks();
		
		ЭтоТипНоменклатурыУслугаИлиРабота = (Item.ItemMark = ТипыНоменклатурыКонтента.Услуга
			Или Item.ItemMark = ТипыНоменклатурыКонтента.Работа);
		
		КоличествоИЦенаОбязательны = УПД970_КоличествоИЦенаОбязательныПоФормату(ФункцияДокумента, Item.Unit);

		Если КоличествоИЦенаОбязательны
			И ЭтоТипНоменклатурыУслугаИлиРабота
			И ЗначениеЗаполнено(Item.Quantity) Тогда
			
			Item.Price = Окр(СтрокаТаблицы.Стоимость / Item.Quantity, ТочностьЦены);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОСотрудникеОтгрузившемТовар(TransferInfo, ДополнительныеПараметры)
	
	ДанныеСотрудника = СвойствоСтруктурыЛок(ДополнительныеПараметры, "ДанныеСотрудника");
	Если ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		
		TransferInfo.Employee = УПД970_ЗаполненныйEmployee(ДанныеСотрудника);
	
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_КоличествоИЦенаОбязательныПоФормату(ФункцияДокумента, КодЕдиницыИзмерения)
	
	Результат = ФункцияДокумента <> ФункцияДокумента_ДОП()
				И ЗначениеЗаполнено(КодЕдиницыИзмерения);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВТаблицеДокументаЕстьСуммаАкциза(ТаблицаДокумента)
	
	НазваниеКолонкиССуммойАкциза = "Акциз";
	
	Результат = ТаблицаДокумента.Колонки.Найти(НазваниеКолонкиССуммойАкциза) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйТаблицаКонтента()
	
	Результат = Контракт_InvoiceTable970();
	
	Результат.TotalNet = 0;
	Результат.TotalWithVatExcluded = 0;
	Результат.Vat = 0;
	Результат.Total = 0;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВсеСтрокиБезНДС(Таблица)

	СтрокиБезНДС = Таблица.НайтиСтроки(Новый Структура("СтавкаНДС", ПрикладнаяСтавкаБезНДС()));
	Результат = (СтрокиБезНДС.Количество() = Таблица.Количество());
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СодержитТолькоУслуги(Таблица)
	
	Результат = (Таблица.Найти(Ложь, "ЭтоУслуга") = Неопределено);
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйПротоСтруктураУПД970()

	Результат = Контракт_ПротоСтруктураУПД970();
	
	Результат.Table = Контракт_InvoiceTable970();
	Результат.TransferInfo = Контракт_TransferInfo970();
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформация();
	Результат.AdditionalInfoId = Контракт_AdditionalInfoId();
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки)
	
	Контент.RevisionNumber = ДанныеШапки.НомерИсправления;
	Контент.RevisionDate = ДанныеШапки.Дата;
	
	Если ЗначениеЗаполнено(ДанныеШапки.НомерИсходногоДокумента) Тогда
		DocumentNumber = ПредставлениеНомера(ДанныеШапки.НомерИсходногоДокумента);
		
		Если ЗначениеЗаполнено(ДанныеШапки.ЦифровойИндексОбособленногоПодразделения) Тогда
			DocumentNumber = УПД970_ПредставлениеНомераДокументаСИндексомОП(
				DocumentNumber,
				ДанныеШапки.ЦифровойИндексОбособленногоПодразделения
			);
		КонецЕсли;
	Иначе
		DocumentNumber = ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДатаИсходногоДокумента) Тогда
		DocumentDate = ДанныеШапки.ДатаИсходногоДокумента;
	Иначе
		DocumentDate = ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Контент.DocumentNumber = DocumentNumber;
	Контент.DocumentDate = DocumentDate;
	
КонецПроцедуры

#КонецОбласти

#Область УПД970_СлужебныеМетоды

Функция УПД970_СодержаниеОперацииОтгрузкиТоваровУслуг()
	Возврат "Товары переданы, работы сданы, услуги оказаны";
КонецФункции

Функция УПД970_СведенияОбАдресеДоставки(АдресДоставки, АдресДоставкиЗначение)

	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(АдресДоставки) Тогда
		
		Если ЗначениеЗаполнено(АдресДоставкиЗначение) Тогда
			Результат = УПД970_СведенияОбАдресе(АдресДоставкиЗначение);
		КонецЕсли;
		
		ПредставлениеАдресаПоJSON = УПД970_ПредставлениеАдресаИзСтруктуры(Результат);
		
		ПредставленияАдресаРазличаются = (НРег(АдресДоставки) <> НРег(ПредставлениеАдресаПоJSON));
		
		СведенияОбАдресеПоПредставлениюИзДокумента = (Не ЗначениеЗаполнено(Результат)
			Или ПредставленияАдресаРазличаются);
			
		Если СведенияОбАдресеПоПредставлениюИзДокумента Тогда
		
			ИнтерфейсБСП = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
			Адрес = ИнтерфейсБСП.КонтактнаяИнформацияПоПредставлению(
				АдресДоставки,
				ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес")
			);
			
			Результат = УПД970_СведенияОбАдресе(Адрес);
			
			Результат.Представление = АдресДоставки;
			Результат.ТипАдреса = АдресВСвободнойФорме();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеИННКПП(Наименование, ИНН, КПП)
	
	Если ЗначениеЗаполнено(КПП) Тогда
		Результат = СтрШаблон("%1, ИНН/КПП %2/%3", Наименование, ИНН, КПП);
	Иначе
		Результат = СтрШаблон("%1, ИНН %2", Наименование, ИНН);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НуженПересчетВРубли(РасчетыВУсловныхЕдиницах, ВалютаДокумента)
	
	Результат = (РасчетыВУсловныхЕдиницах И ВалютаДокумента <> ВалютаРегламентированногоУчета());
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияСчетаФактуры(КодВидаОперации, ВидДоговора)
	
	ЭтоКомиссионнаяТорговля = ЭтоВидДоговораНаКомиссионнуюТорговлю(ВидДоговора);
	
	Если КодВидаОперации = "01" И ЭтоКомиссионнаяТорговля Тогда
		Результат = "1";
	ИначеЕсли КодВидаОперации = "27" Тогда // Сводный комиссионный
		Результат = "3";
	ИначеЕсли КодВидаОперации = "06" Тогда // Налоговый агент
		Результат = "4";
	ИначеЕсли КодВидаОперации = "34" Тогда // НДСИНА
		Результат = "5";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияУПД(ВидДоговора)
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		Результат = "00005";
	ИначеЕсли ЭтоВидДоговораСКомитентомНаЗакупку(ВидДоговора) Тогда
		Результат = "00007";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗначениеТипаНоменклатуры(ЭтоУслуга)
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Если ЭтоУслуга Тогда
		Результат = ТипыНоменклатуры.Услуга;
	Иначе
		Результат = ТипыНоменклатуры.Имущество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресе(АдресСтрокойJSON)
	
	Перем СведенияОбАдресе;
	
	Если Не ЗначениеЗаполнено(АдресСтрокойJSON) Тогда
		Возврат СведенияОбАдресе;
	КонецЕсли;
	
	СведенияОбАдресе = СведенияОбАдресеЛок(АдресСтрокойJSON);
	
	СохраненноеПредставление = ПредставлениеАдреса(АдресСтрокойJSON);
	СведенияОбАдресе.Вставить("СохраненноеПредставление", СохраненноеПредставление);

	ЭтоАдминистративноТерриториальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressRF(СведенияОбАдресе);
	
	ЭтоМуниципальныйАдрес = Ложь;
	Если Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		ЭтоМуниципальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressSAR(СведенияОбАдресе);
	КонецЕсли;
	
	Если Не ЭтоМуниципальныйАдрес
		И Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		
		СведенияОбАдресе.Представление = СведенияОбАдресе.СохраненноеПредставление;
		СведенияОбАдресе.ТипАдреса = АдресВСвободнойФорме();
		
	КонецЕсли;
	
	Возврат СведенияОбАдресе;

КонецФункции

Функция УПД970_КодМуниципальногоРайона(ТипМуниципальногоРайона)
	
	Результат = "";
	
	Если ВРег(ТипМуниципальногоРайона) = ВРег("м.р-н") Тогда
		
		Результат = "1";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("г.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("ф.т.") Тогда
		
		Результат = "2";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер. г.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.г.") Тогда
		
		Результат = "3";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("мун. окр.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("м.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("мун.окр.") Тогда
		
		Результат = "4";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеАдресаИзСтруктуры(СведенияОбАдресе)
	
	Перем Результат;
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		Результат = СвойствоСтруктурыЛок(СведенияОбАдресе, "МуниципальноеПредставление");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СведенияОбАдресе.Представление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressSAR(СведенияОбАдресе)
	
	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	ЕстьНаименованиеМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.МуниципальныйРайон);
	
	ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.КодМуниципальногоРайона);
	Если Не ЕстьКодМуниципальногоРайона Тогда
		КодМуниципальногоРайона = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
		ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(КодМуниципальногоРайона);
	КонецЕсли;
	
	ЕстьИдентификаторАдресногоОбъекта = ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторАдресногоОбъекта);
	
	ЕстьНесколькоТиповПомещений = УПД970_АдресСодержитНесколькоТиповПомещений(СведенияОбАдресе);
	ЕстьНесколькоТиповАпартаментов = УПД970_АдресСодержитНесколькоТиповАпартаментов(СведенияОбАдресе);
	
	МуниципальноеПредставление = СвойствоСтруктурыЛок(СведенияОбАдресе, "МуниципальноеПредставление");
	ПредставленияАдресаСовпадают = (МуниципальноеПредставление = СведенияОбАдресе.СохраненноеПредставление);
	
	Результат = ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса)
		И ЕстьКодРегиона
		И ЕстьНаименованиеМуниципальногоРайона
		И ЕстьКодМуниципальногоРайона
		И ЕстьИдентификаторАдресногоОбъекта
		И ПредставленияАдресаСовпадают
		И Не ЕстьНесколькоТиповПомещений
		И Не ЕстьНесколькоТиповАпартаментов;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressRF(СведенияОбАдресе)
	
	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	ЭтоКодГородаФедеральногоЗначения = УПД970_ЭтоКодГородаФедеральногоЗначения(СведенияОбАдресе.КодРегиона);
	
	ПомещенияНеЗаполнены = (СведенияОбАдресе.Помещения.Количество() = 0);
	ТипПомещенияСоответствуетАдрРФ = (СведенияОбАдресе.Помещения.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Помещения[0].ТипПомещения) = ВРЕГ(ТипПомещенияАдрРФ()));
		
	ПомещенияСоответствуютАдрРФ = (ПомещенияНеЗаполнены Или ТипПомещенияСоответствуетАдрРФ);
	
	КорпусаНеЗаполнены = (СведенияОбАдресе.Корпуса.Количество() = 0);
	ТипКорпусаСоответствуетАдрРФ = (СведенияОбАдресе.Корпуса.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Корпуса[0].ТипКорпуса) = ВРЕГ(ТипКорпусаАдрРФ()));
		
	КорпусаСоответствуютАдрРФ = (КорпусаНеЗаполнены Или ТипКорпусаСоответствуетАдрРФ);
		
	ТипЗданияСоответствуетАдрРФ = Не ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания)
		Или ВРЕГ(СведенияОбАдресе.Здание.ТипЗдания) = ВРЕГ(ТипЗданияАдрРФ());
		
	АдресНеСоответствуетСтруктуреАдрРФ = ЗаполненыПоляНесоответствующиеСтруктуреАдрРФ(СведенияОбАдресе);
		
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	ПредставленияАдресаСовпадают = (ПредставлениеАдреса = СведенияОбАдресе.СохраненноеПредставление);

	Результат = ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса)
		И ЕстьКодРегиона
		И ПомещенияСоответствуютАдрРФ
		И КорпусаСоответствуютАдрРФ
		И ТипЗданияСоответствуетАдрРФ
		И ПредставленияАдресаСовпадают
		И Не АдресНеСоответствуетСтруктуреАдрРФ
		И Не ЭтоКодГородаФедеральногоЗначения;

	Возврат Результат;
	
КонецФункции

Функция УПД970_ЭтоКодГородаФедеральногоЗначения(КодРегиона)

	КодыРегионов = Новый Массив;
	КодыРегионов.Добавить("77"); // г. Москва
	КодыРегионов.Добавить("78"); // г. Санкт-Петербург
	КодыРегионов.Добавить("92"); // г. Севастополь
	КодыРегионов.Добавить("99"); // иные территории, включая город и космодром Байконур

	Результат = (КодыРегионов.Найти(КодРегиона) <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповПомещений(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();

	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		Если ТипыПомещенийЗдания.Найти(Элемент.ТипПомещения) <> Неопределено Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповАпартаментов(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();

	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		ТипПомещения = Элемент.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		ЭтоНеклассифицированноеПомещениеКвартиры = (Не ЭтоПомещениеЗдания И Не ЭтоПомещениеКвартиры);
		
		Если ЭтоПомещениеКвартиры Или ЭтоНеклассифицированноеПомещениеКвартиры Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТипыПомещенийКвартиры()
	
	Результат = Новый Массив;
	Результат.Добавить("Комната");
	Результат.Добавить("Бокс");
	Результат.Добавить("А/Я");
	Результат.Добавить("В/Ч");
	Результат.Добавить("П/О");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипыПомещенийЗдания()
	
	Результат = Новый Массив;
	Результат.Добавить("Офис");
	Результат.Добавить("Квартира");
	Результат.Добавить("Помещение");
	Результат.Добавить("Этаж");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПолучитьПомещениеКвартиры(СписокПомещений)

	ПомещениеКвартиры = Неопределено;
	
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	Для Каждого ИмяТипаПомещения Из ТипыПомещенийКвартиры Цикл
		
		ПомещениеКвартиры = Ядро.МассивСтруктур_Найти(СписокПомещений, ИмяТипаПомещения, "ТипПомещения");
		
		Если ПомещениеКвартиры <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПомещениеКвартиры;

КонецФункции

Функция УПД970_ПолучитьНеклассифицированноеПомещение(СписокПомещений)
	
	Результат = Неопределено;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();

	Для Каждого Помещение Из СписокПомещений Цикл
		
		ТипПомещения = Помещение.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		Если Не ЭтоПомещениеЗдания
			И Не ЭтоПомещениеКвартиры Тогда
			Результат = Помещение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)

	ЭлементыАдресногоОбъекта = Новый Массив;
	ЭлементыАдресногоОбъекта.Добавить(Элемент1);
	ЭлементыАдресногоОбъекта.Добавить(Элемент2);
	
	Результат = СокрЛП(СтрСоединить(ЭлементыАдресногоОбъекта, " "));
	
	Возврат Результат;
	
КонецФункции

Функция СсылочноеЗначениеСвойстваИсточникаДанных(ИсточникДанных, КаноничноеИмяСвойства)
	
	Результат = Неопределено;
	
	ПроверяемыеСвойства = Новый Массив;
	ПроверяемыеСвойства.Добавить(КаноничноеИмяСвойства);
	ПроверяемыеСвойства.Добавить(КаноничноеИмяСвойства + "Ссылка");
	
	Для Каждого ИмяСвойства Из ПроверяемыеСвойства Цикл 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникДанных, ИмяСвойства)
		И ОбщегоНазначения.ЗначениеСсылочногоТипа(ИсточникДанных[ИмяСвойства]) Тогда 
			
			Результат = ИсточникДанных[ИмяСвойства];
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОснованияОтгрузкиПоДокументуОснования(ОснованиеОтгрузки, Документ)
	
	Если ЭтоСчетФактураВыданный(Документ) Тогда
		ДокументОснование = ЗначениеРеквизитаОбъектаЛок(Документ, "ДокументОснование");
	Иначе
		ДокументОснование = Документ;
	КонецЕсли;
		
	ЕстьРеквизитДоговорКонтрагента = ЕстьРеквизитОбъектаЛок(
		"ДоговорКонтрагента",
		ДокументОснование.Метаданные());
	
	ОснованиеОтгрузки.Основание = "Без договора";
	Если ЕстьРеквизитДоговорКонтрагента Тогда
		
		Реквизиты = Новый Массив;
		Реквизиты.Добавить("ДоговорКонтрагента");
		Реквизиты.Добавить("ДоговорКонтрагента.Номер");
		Реквизиты.Добавить("ДоговорКонтрагента.Дата");
		Реквизиты.Добавить("ДоговорКонтрагента.Наименование");
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				
				Если ЭтоСчетФактураВыданный(ДокументОснование.ДокументРеализации) Тогда
					Основание = ДокументОснование.ДокументРеализации.ДокументОснование;
				Иначе
					Основание = ДокументОснование.ДокументРеализации;
				КонецЕсли;
				
			ДанныеДоговора = ЗначенияРеквизитовОбъектаЛок(Основание, Реквизиты);
			
		Иначе
			
			ДанныеДоговора = ЗначенияРеквизитовОбъектаЛок(ДокументОснование, Реквизиты);
			
		КонецЕсли;
		
		ОснованиеОтгрузки.ОснованиеНомер = ДанныеДоговора.ДоговорКонтрагентаНомер;
		ОснованиеОтгрузки.ОснованиеДата = ДанныеДоговора.ДоговорКонтрагентаДата;
		ОснованиеОтгрузки.Основание = ДанныеДоговора.ДоговорКонтрагентаНаименование;
		ОснованиеОтгрузки.Ссылка = ДанныеДоговора.ДоговорКонтрагента;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_СведенияОбОтгрузочномДокументеЗаполнены(ДанныеДокумента)

	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.НаименованиеДокумента)
		И ЗначениеЗаполнено(ДанныеДокумента.НомерДокумента)
		И ЗначениеЗаполнено(ДанныеДокумента.ДатаДокумента) Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ФункцияДокумента_СЧФДОП()
	Возврат ГенерацияXML_ФункцииУПД().СЧФДОП;
КонецФункции

Функция ФункцияДокумента_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции

Функция ФункцияДокумента_ДОП()
	Возврат ГенерацияXML_ФункцииУПД().ДОП;
КонецФункции

Функция УПД970_ПредставлениеНомераДокументаСИндексомОП(
	НомерДокумента,
	ЦифровойИндексОП)
	
	Результат = НомерДокумента + "/" + XMLСтрока(ЦифровойИндексОП);
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗначениеПризнакаБезНДС(СтавкаНДС)

	ЭтоСтавкаБезНДС = (СтавкаНДС = ПрикладнаяСтавкаБезНДС());
	Результат = XMLСтрока(ЭтоСтавкаБезНДС);
	
	Возврат Результат;
	
КонецФункции

Функция ЕдиницаИзмеренияШтуки()
	
	Перем Результат;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения
	|ГДЕ
	|.Код = ""796""");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйТипСтрока(ДлинаСтроки)
	
	Результат = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(ДлинаСтроки));
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеДоставкиДокумента(Документ)
	
	Перем Результат;
	
	Если ЗначениеЗаполнено(Документ) Тогда
		
		ДанныеАдреса = АдресДоставкиДокумента(Документ);
		
		Результат = УПД970_СведенияОбАдресеДоставки(
			ДанныеАдреса.АдресДоставки,
			ДанныеАдреса.АдресДоставкиЗначение);
		
		КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура УПД970_КопироватьРеквизитыИсходногоДокументаВДанныеСчетФактуры(РеквизитыСФ, РеквизитыОснования)

	КопируемыеРеквизиты = Новый Массив;
	КопируемыеРеквизиты.Добавить("Поставщик");
	КопируемыеРеквизиты.Добавить("Покупатель");
	КопируемыеРеквизиты.Добавить("БанковскийСчетПродавца");
	КопируемыеРеквизиты.Добавить("ОбособленноеПодразделениеПоставщика");
	КопируемыеРеквизиты.Добавить("ОбособленноеПодразделениеПокупателя");
	КопируемыеРеквизиты.Добавить("ЦифровойИндексОбособленногоПодразделения");
	КопируемыеРеквизиты.Добавить("АдресДоставки");
	КопируемыеРеквизиты.Добавить("АдресДоставкиЗначение");
	КопируемыеРеквизиты.Добавить("СведенияОТранспортировке");
	КопируемыеРеквизиты.Добавить("ВидДоговора");
	КопируемыеРеквизиты.Добавить("Договор");
	КопируемыеРеквизиты.Добавить("Основание");
	КопируемыеРеквизиты.Добавить("ОснованиеНомер");
	КопируемыеРеквизиты.Добавить("ОснованиеДата");
	КопируемыеРеквизиты.Добавить("Грузоотправитель");
	КопируемыеРеквизиты.Добавить("Грузополучатель");
	КопируемыеРеквизиты.Добавить("СуммаВключаетНДС");
	
	Для Каждого ИмяРеквизита Из КопируемыеРеквизиты Цикл
		ЗначениеРеквизита = СвойствоСтруктурыЛок(РеквизитыОснования, ИмяРеквизита);
		РеквизитыСФ.Вставить(ИмяРеквизита, ЗначениеРеквизита);
	КонецЦикла;
	
КонецПроцедуры

Функция УПД970_ВыводитьКодыТНВЭД(Покупатель, Грузополучатель)
	
	КодСтраныПокупателя = "0";
	Если ЗначениеЗаполнено(Покупатель) Тогда
		КодСтраныПокупателя = ЗначениеРеквизитаОбъектаЛок(Покупатель.СтранаРегистрации, "Код");
	КонецЕсли;
	
	КодСтраныГрузополучателя = "0";
	Если ЗначениеЗаполнено(Грузополучатель) Тогда
		КодСтраныГрузополучателя = ЗначениеРеквизитаОбъектаЛок(Покупатель.СтранаРегистрации, "Код");
	КонецЕсли;
	
	ПокупательСтранаЕАЭС = СтранаЧленТС(КодСтраныПокупателя);
	ГрузополучательСтранаЕАЭС = СтранаЧленТС(КодСтраныГрузополучателя);
	
	// Обязательно указание значения в случае отражения в счете-фактуре товаров,
	// вывезенных за пределы территории Российской Федерации на территорию государства - члена ЕАЭС
	Результат = ((КодСтраныПокупателя <> "643")
		И (КодСтраныГрузополучателя <> "643")
		И ПокупательСтранаЕАЭС
		И ГрузополучательСтранаЕАЭС);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область УПД970_Контракты

Функция Контракт_ПротоСтруктураУПД970()
	
	ИмяТипа = "Utd970SellerContent";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ExtendedOrganizationInfo970()

	ИмяТипа = "ExtendedOrganizationInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияОрганизации();
	
	Возврат Результат;

КонецФункции

Функция Контракт_Shipper970()

	ИмяТипа = "Shipper970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_PaymentDocumentInfo()

	ИмяТипа = "PaymentDocumentInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AccompanyingDocument970()
	
	ИмяТипа = "AccompanyingDocument970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentShipments970()

	ИмяТипа = "DocumentShipment970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_DocumentCreatorBase()

	ИмяТипа = "DocumentCreatorBase";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressInfo970()

	ИмяТипа = "AddressInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressRFInfo()

	ИмяТипа = "AddressRFInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressSARInfo()

	ИмяТипа = "AddressSARInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressTextInfo()

	ИмяТипа = "AddressTextInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferInfo970()

	ИмяТипа = "TransferInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferBases970()

	ИмяТипа = "TransferBase970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressObjectNumberInfo()

	ИмяТипа = "AddressObjectNumberInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_Employee970()
	
	ИмяТипа = "Employee970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_InvoiceTable970()
	
	ИмяТипа = "InvoiceTable970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_Item970()
	
	ИмяТипа = "Item970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemTracingInfo970()
	
	ИмяТипа = "ItemTracingInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияСтроки()
	
	ИмяТипа = "ItemСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияОрганизации()
	
	ИмяТипа = "OrganizationСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AdditionalInfoId()
	
	ИмяТипа = "AdditionalInfoId";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформация()
	
	ИмяТипа = "СлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Результат.ContentsDocumentProductsType = Контракт_ContentsDocumentProductsType();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияTransferBases970()
	
	ИмяТипа = "ItemTransferBasesСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ContentsDocumentProductsType()
	
	ИмяТипа = "ContentsDocumentProductsType";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_CustomDeclarations()

	ИмяТипа = "CustomDeclaration";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область АктCверки405

#Область АктCверки405_ПрограммныйИнтерфейс

Функция АктСверки405_ИнформацияПолучателя(ДокСсылка, ПараметрыФормирования) Экспорт
	
	Результат = Новый_ReconciliationActRecipientTitle();
	
	Если НЕ АктСверки405_ПроверитьВозможностьФормированияОтветногоТитула(Результат, ДокСсылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.Текст = ТекстЗапроса_ДанныеШапкиАктаСверкиВзаиморасчетов();
	
	ДанныеШапки = Запрос.Выполнить().Выгрузить();
	ДанныеШапки = ДанныеШапки[0];
	
	АктСверки405_ПроверитьВозможностьОтправки(Результат, ДокСсылка);
	
	Если ДанныеШапки.ЕстьРасхождения Тогда
		Результат.SignDisagreement = "WithDisagreements";
	Иначе
		Результат.SignDisagreement = "WithoutDisagreements";
	КонецЕсли;
	
	АктСверки405_ЗаполнитьШапкуОтветногоТитула(Результат);
	
	ЗаполнитьТаблицуОтветногоТитулаАктаСверки = ПараметрыФормирования.ЗаполнитьТаблицуОтветногоТитулаАктаСверки;
	
	Если ЗаполнитьТаблицуОтветногоТитулаАктаСверки Тогда
		
		ВыборкаДанныхАктаСверки = АктСверки405_ДанныеДляЗаполненияТабличнойЧастиОтветногоТитула(
			ДокСсылка,
			ДанныеШапки
		);
		
		АктСверки405_ЗаполнитьТабличнуюЧастьОтветногоТитула(
			Результат,
			ВыборкаДанныхАктаСверки,
			ДокСсылка
		);
		
		АктСверки405_ЗаполнитьИтогиТабличнойЧастиОтветногоТитула(
			Результат,
			ВыборкаДанныхАктаСверки,
			ДанныеШапки
		);
		
	КонецЕсли;
	
	АктСверки405_ЗаполнитьПодписанта(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки405_ИнформацияОтправителя(ДокСсылка) Экспорт
	
	РеквизитыДокумента = АктСверки405_ШапкаИнформацииОтправителя(ДокСсылка);
	
	Результат = Новый_ReconciliationActSenderTitle();
	
	АктСверки405_ПроверитьВозможностьОтправки(Результат, ДокСсылка);
	
	АктСверки405_ЗаполнитьШапкуТитулаОтправителя(
		Результат,
		РеквизитыДокумента
	);
	
	АктСверки405_ЗаполнитьРеквизитыОтправителя(
		Результат,
		РеквизитыДокумента.Организация,
		РеквизитыДокумента.Дата
	);
	
	АктСверки405_ЗаполнитьРеквизитыПолучателя(
		Результат,
		РеквизитыДокумента.Контрагент,
		РеквизитыДокумента.Дата
	);
	
	ВыборкаПоДоговорам = АктСверки405_ТабличнаяЧастьИнформацииОтправителя(ДокСсылка);
	
	АктСверки405_ПроверитьОборотыЗаПериодСверки(Результат, ВыборкаПоДоговорам, ДокСсылка);
	
	АктСверки405_ЗаполнитьТабличнуюЧастьТитулаОтправителя(
		Результат,
		ВыборкаПоДоговорам,
		ДокСсылка
	);
	
	ИтогиПоДокументу = АктСверки405_ИтогиИнформацииОтправителя(ДокСсылка);
	
	ОборотПоДебету = ИтогиПоДокументу.Итог("Дебет");
	ОборотПоКредиту = ИтогиПоДокументу.Итог("Кредит");
	
	ОстатокНаНачало = РеквизитыДокумента.ОстатокНаНачало;
	
	АктСверки405_ЗаполнитьИтогиПоТабличнойЧастиТитулаОтправителя(
		Результат,
		ОстатокНаНачало,
		ОборотПоДебету,
		ОборотПоКредиту
	);
	
	АктСверки405_ЗаполнитьПодписанта(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АктCверки405_ТекстыЗапросов

Функция ТекстЗапроса_АктСверки405Шапка()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумент.Номер КАК Номер,
	|	ТаблицаДокумент.Дата КАК Дата,
	|	ТаблицаДокумент.Организация КАК Организация,
	|	ТаблицаДокумент.Контрагент КАК Контрагент,
	|	ТаблицаДокумент.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумент.ДатаНачала КАК ДатаНачала,
	|	ТаблицаДокумент.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаДокумент.ОстатокНаНачало КАК ОстатокНаНачало,
	|	ЕСТЬNULL(Валюты.Код, ""643"") КАК КодВалюты
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ТаблицаДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ТаблицаДокумент.ВалютаДокумента = Валюты.Ссылка
	|ГДЕ
	|	ТаблицаДокумент.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктСверки405Итоги()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТабличнаяЧастьПоДаннымОрганизации.Дебет) КАК Дебет,
	|	СУММА(ТабличнаяЧастьПоДаннымОрганизации.Кредит) КАК Кредит
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ТабличнаяЧастьПоДаннымОрганизации
	|ГДЕ
	|	ТабличнаяЧастьПоДаннымОрганизации.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктСверки405ДетальныеДанные()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабличнаяЧастьПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧастьПоДаннымОрганизации.Договор КАК Договор,
	|	ТабличнаяЧастьПоДаннымОрганизации.Дата КАК ДатаОперации,
	|	ТабличнаяЧастьПоДаннымОрганизации.Дебет КАК СуммаДебет,
	|	ТабличнаяЧастьПоДаннымОрганизации.Кредит КАК СуммаКредит,
	|	ТабличнаяЧастьПоДаннымОрганизации.НомерДокумента КАК НомерДокумента,
	|	ТабличнаяЧастьПоДаннымОрганизации.ДатаДокумента КАК ДатаДокумента,
	|	ТабличнаяЧастьПоДаннымОрганизации.НаименованиеДокумента КАК НаименованиеДокумента,
	|	ТабличнаяЧастьПоДаннымОрганизации.НаименованиеОперации КАК НаименованиеОперации,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Номер, """") КАК НомерДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка)) КАК ВидДоговора
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ТабличнаяЧастьПоДаннымОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ТабличнаяЧастьПоДаннымОрганизации.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ТабличнаяЧастьПоДаннымОрганизации.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(СуммаДебет),
	|	СУММА(СуммаКредит),
	|	МАКСИМУМ(ДатаДоговора),
	|	МАКСИМУМ(НомерДоговора),
	|	МАКСИМУМ(ВидДоговора)
	|ПО
	|	Договор";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктСверки405ОстаткиПоДоговорам()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СчетаРасчетов
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаРасчетов)
	|	И НЕ Хозрасчетный.Ссылка В (&СчетаИсключения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстатки.Субконто1 КАК Договор,
	|	ВЫБОР
	|		КОГДА &АктСверкиВВалюте
	|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт
	|	КОНЕЦ КАК НачОстатокПоДоговоруДт,
	|	ВЫБОР
	|		КОГДА &АктСверкиВВалюте
	|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|	КОНЕЦ КАК НачОстатокПоДоговоруКт
	|ПОМЕСТИТЬ ОстаткиПоДоговорамАкта
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&НачалоПериода,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СчетаРасчетов.Ссылка
	|				ИЗ
	|					СчетаРасчетов КАК СчетаРасчетов),
	|			&АналитикаРасчетов,
	|			Организация = &Организация
	|				И Субконто1 В (&Договоры)) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоДоговорамАкта.Договор КАК Договор,
	|	СУММА(ОстаткиПоДоговорамАкта.НачОстатокПоДоговоруДт) КАК НачОстатокПоДоговоруДт,
	|	СУММА(ОстаткиПоДоговорамАкта.НачОстатокПоДоговоруКт) КАК НачОстатокПоДоговоруКт
	|ИЗ
	|	ОстаткиПоДоговорамАкта КАК ОстаткиПоДоговорамАкта
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоДоговорамАкта.Договор";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеШапкиАктаСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.ОстатокНаНачало КАК ОстатокНаНачалоПоОрганизации,
	|	АктСверкиВзаиморасчетов.ОстатокНаНачалоПоДаннымКонтрагента КАК ОстатокНаНачалоПоКонтрагенту,
	|	АктСверкиВзаиморасчетов.ЕстьРасхождения КАК ЕстьРасхождения,
	|	АктСверкиВзаиморасчетов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	АктСверкиВзаиморасчетов.ВалютаДокумента КАК ВалютаДокумента,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	АктСверкиВзаиморасчетов.ДатаНачала КАК ДатаНачала,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|ГДЕ
	|	АктСверкиВзаиморасчетов.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеТабличныхЧастейАктаСверкиВзаиморасчетов()
	
	Результат = 
	"ВЫБРАТЬ
	|	ДанныеОрганизации.Договор КАК Договор
	|ПОМЕСТИТЬ ДоговорыАкта
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ДанныеОрганизации
	|ГДЕ
	|	ДанныеОрганизации.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеКонтрагента.Договор
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ДанныеКонтрагента
	|ГДЕ
	|	ДанныеКонтрагента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаДокумента.Счет КАК Счет
	|ПОМЕСТИТЬ СчетаДокумента
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.СписокСчетов КАК СчетаДокумента
	|ГДЕ
	|	СчетаДокумента.Ссылка = &Ссылка
	|	И СчетаДокумента.УчаствуетВРасчетах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СчетаРасчета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ВЫБРАТЬ Счет ИЗ СчетаДокумента)
	|	И НЕ Хозрасчетный.Ссылка В (&СчетаИсключения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СчетаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Договор,
	|	СУММА(ВЫБОР
	|			КОГДА &АктСверкиВВалюте
	|				ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт
	|		КОНЕЦ) КАК НачОстатокПоДоговоруДт,
	|	СУММА(ВЫБОР
	|			КОГДА &АктСверкиВВалюте
	|				ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК НачОстатокПоДоговоруКт
	|ПОМЕСТИТЬ ОстаткиПоДоговорамАкта
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&НачалоПериода,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СчетаРасчета.Ссылка
	|				ИЗ
	|					СчетаРасчета КАК СчетаРасчета),
	|			&АналитикаРасчетов,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ДоговорыАкта.Договор
	|					ИЗ
	|						ДоговорыАкта)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДоговорыАкта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СчетаРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет) КАК Дебет,
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит) КАК Кредит
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымКонтрагента.Дебет) КАК Дебет,
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымКонтрагента.Кредит) КАК Кредит
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК АктСверкиВзаиморасчетовПоДаннымКонтрагента
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор КАК Договор,
	|	ОстаткиПоДоговорамАкта.НачОстатокПоДоговоруДт КАК НачОстатокПоДоговоруДт,
	|	ОстаткиПоДоговорамАкта.НачОстатокПоДоговоруКт КАК НачОстатокПоДоговоруКт,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК ДатаОперации,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет КАК СуммаДебет,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК СуммаКредит,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ КАК Документ,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерДокумента КАК НомерДокумента,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.ДатаДокумента КАК ДатаДокумента,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НаименованиеДокумента КАК НаименованиеДокумента,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НаименованиеОперации КАК НаименованиеОперации,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Номер, """") КАК НомерДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка)) КАК ВидДоговора
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоДоговорамАкта КАК ОстаткиПоДоговорамАкта
	|		ПО АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор = ОстаткиПоДоговорамАкта.Договор
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(НачОстатокПоДоговоруДт),
	|	МАКСИМУМ(НачОстатокПоДоговоруКт),
	|	СУММА(СуммаДебет),
	|	СУММА(СуммаКредит),
	|	МАКСИМУМ(ДатаДоговора),
	|	МАКСИМУМ(НомерДоговора),
	|	МАКСИМУМ(ВидДоговора)
	|ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовСверка.СверяемыйДокумент КАК Документ,
	|	АктСверкиВзаиморасчетовСверка.ДебетПоДаннымОрганизации КАК ДебетОрганизации,
	|	АктСверкиВзаиморасчетовСверка.КредитПоДаннымОрганизации КАК КредитОрганизации,
	|	АктСверкиВзаиморасчетовСверка.ДебетПоДаннымКонтрагента КАК ДебетКонтрагента,
	|	АктСверкиВзаиморасчетовСверка.КредитПоДаннымКонтрагента КАК КредитКонтрагента
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.Сверка КАК АктСверкиВзаиморасчетовСверка
	|ГДЕ
	|	АктСверкиВзаиморасчетовСверка.Ссылка = &Ссылка
	|	И АктСверкиВзаиморасчетовСверка.ЕстьРасхождения
	|	И ВЫРАЗИТЬ(АктСверкиВзаиморасчетовСверка.СверяемыйДокумент КАК СТРОКА(500)) ЕСТЬ NULL
	|";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АктCверки405_ЗаполнениеЭлементовПротоструктуры

Процедура АктСверки405_ЗаполнитьШапкуОтветногоТитула(Content)
	
	ReconciliationAct = Новый_RecipientData_ReconciliationAct();
	
	ReconciliationAct.IdentityInfoSender = Новый_IdentityInfoSender();
	ReconciliationAct.ReconciliationActTable = Новый_RecipientReconciliationActTable();
	ReconciliationAct.Signer = Новый_Signer_ReconciliationAct();
	
	Content.ReconciliationAct = ReconciliationAct;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьИтогиТабличнойЧастиОтветногоТитула(Content, ВыборкаДанныхАктаСверки, РеквизитыДокумента)
	
	ТаблицаИтогиПоОрганизации = ВыборкаДанныхАктаСверки[7].Выгрузить();
	ТаблицаИтогиПоКонтрагенту = ВыборкаДанныхАктаСверки[8].Выгрузить();
	
	ОстатокНаНачалоПоОрганизации = РеквизитыДокумента.ОстатокНаНачалоПоОрганизации;
	ОборотПоДебетуПоОрганизации = ТаблицаИтогиПоОрганизации.Итог("Дебет");
	ОборотПоКредитуПоОрганизации = ТаблицаИтогиПоОрганизации.Итог("Кредит");
	ОстатокНаКонецПоОрганизации = ОстатокНаНачалоПоОрганизации + ОборотПоДебетуПоОрганизации - ОборотПоКредитуПоОрганизации;
	
	ОстатокНаНачалоПоКонтрагенту = РеквизитыДокумента.ОстатокНаНачалоПоКонтрагенту;
	ОборотПоДебетуПоКонтрагенту = ТаблицаИтогиПоКонтрагенту.Итог("Дебет");
	ОборотПоКредитуПоКонтрагенту = ТаблицаИтогиПоКонтрагенту.Итог("Кредит");
	ОстатокНаКонецПоКонтрагенту = ОстатокНаНачалоПоКонтрагенту + ОборотПоДебетуПоКонтрагенту - ОборотПоКредитуПоКонтрагенту;
	
	ОстатокНаКонецРасхождение = ОстатокНаКонецПоОрганизации + ОстатокНаКонецПоКонтрагенту;
	
	ReconciliationActTable = Content.ReconciliationAct.ReconciliationActTable;
	
	ReconciliationActTable.BalanceDebitFrom = ?(ОстатокНаНачалоПоОрганизации > 0, ОстатокНаНачалоПоОрганизации, 0);
	ReconciliationActTable.BalanceAmountFrom = ?(ОстатокНаНачалоПоОрганизации < 0, -ОстатокНаНачалоПоОрганизации, 0);
	ReconciliationActTable.TurnoverDebit = ОборотПоДебетуПоОрганизации;
	ReconciliationActTable.TurnoverAmount = ОборотПоКредитуПоОрганизации;
	ReconciliationActTable.BalanceDebitEnd = ?(ОстатокНаКонецПоОрганизации > 0, ОстатокНаКонецПоОрганизации, 0);
	ReconciliationActTable.BalanceAmountEnd = ?(ОстатокНаКонецПоОрганизации < 0, -ОстатокНаКонецПоОрганизации, 0);
	ReconciliationActTable.TotalConsumptionDebit = ?(ОстатокНаКонецРасхождение > 0, ОстатокНаКонецРасхождение, 0);
	ReconciliationActTable.TotalConsumptionAmount = ?(ОстатокНаКонецРасхождение < 0, -ОстатокНаКонецРасхождение, 0);
	
	Content.ReconciliationAct.ReconciliationActTable = ReconciliationActTable;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьТабличнуюЧастьОтветногоТитула(Content, ВыборкаДанныхАктаСверки, ДокСсылка)
	
	ВыборкаПоДоговорам = ВыборкаДанныхАктаСверки[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаРазличающихсяДокументов = ВыборкаДанныхАктаСверки[10].Выгрузить();
	
	ReconciliationActTable = Новый_RecipientReconciliationActTable();
	
	Пока ВыборкаПоДоговорам.Следующий() Цикл
		
		ContractInfo = Новый_RecipientContractInfo_ReconciliationAct();
		
		НачОстатокПоДоговоруДт = ВыборкаПоДоговорам.НачОстатокПоДоговоруДт;
		НачОстатокПоДоговоруКт = ВыборкаПоДоговорам.НачОстатокПоДоговоруКт;
		
		СуммаОборотДт = ВыборкаПоДоговорам.СуммаДебет;
		СуммаОборотКт = ВыборкаПоДоговорам.СуммаКредит;
		
		КонОстатокПоДоговоруДт = НачОстатокПоДоговоруДт + СуммаОборотДт;
		КонОстатокПоДоговоруКт = НачОстатокПоДоговоруКт + СуммаОборотКт;
		КонОстатокПоДоговору = КонОстатокПоДоговоруДт - КонОстатокПоДоговоруКт;
		
		ContractInfo.ContractAdditionalInfo = Строка(ВыборкаПоДоговорам.ВидДоговора);
		ContractInfo.ContractNumber = ВыборкаПоДоговорам.НомерДоговора;
		ContractInfo.ContractDate = ВыборкаПоДоговорам.ДатаДоговора;
		ContractInfo.BalanceDebitFrom = НачОстатокПоДоговоруДт;
		ContractInfo.BalanceAmountFrom = НачОстатокПоДоговоруКт;
		ContractInfo.TurnoverDebit = СуммаОборотДт;
		ContractInfo.TurnoverAmount = СуммаОборотКт;
		ContractInfo.BalanceDebitEnd = ?(КонОстатокПоДоговору > 0, КонОстатокПоДоговору, 0);
		ContractInfo.BalanceAmountEnd = ?(КонОстатокПоДоговору < 0, -КонОстатокПоДоговору, 0);
		ContractInfo.TotalConsumptionDebit = 0;
		ContractInfo.TotalConsumptionAmount = 0;
		
		ReconciliationActTable.ContractInfo.Добавить(ContractInfo);
		
		ВыборкаПоДокументам = ВыборкаПоДоговорам.Выбрать();
		
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			ДанныеРазличающегосяДокумента = ТаблицаРазличающихсяДокументов.Найти(ВыборкаПоДокументам.Документ, "Документ");
			
			DocumentInfo = Новый_RecipientDocumentInfo_ReconciliationAct();
			OperationInfo = Новый_RecipientOperationInfo_ReconciliationAct();
			
			АктСверки405_ЗаполнитьDocumentInfoОтветногоТитула(DocumentInfo, ВыборкаПоДокументам, ДанныеРазличающегосяДокумента);
			АктСверки405_ЗаполнитьOperationInfoОтветногоТитула(OperationInfo, ВыборкаПоДокументам);
			
			DocumentInfo.OperationInfo.Добавить(OperationInfo);
			ContractInfo.DocumentInfo.Добавить(DocumentInfo);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Content.ReconciliationAct.ReconciliationActTable = ReconciliationActTable;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьDocumentInfoОтветногоТитула(Content, ВыборкаПоДокументам, ДанныеРазличающегосяДокумента)
	
	Если ДанныеРазличающегосяДокумента = Неопределено Тогда
		ИтогоРасх = 0;
	Иначе
		ИтогоРасх = ДанныеРазличающегосяДокумента.ДебетОрганизации - ДанныеРазличающегосяДокумента.КредитКонтрагента;
		
		Если ИтогоРасх = 0 Тогда
			ИтогоРасх = ДанныеРазличающегосяДокумента.КредитОрганизации - ДанныеРазличающегосяДокумента.ДебетКонтрагента;
		КонецЕсли;
	КонецЕсли;
	
	НаименованиеДокумента = ВыборкаПоДокументам.НаименованиеДокумента;
	
	Если НЕ ЗначениеЗаполнено(НаименованиеДокумента) Тогда
		НаименованиеДокумента = ВыборкаПоДокументам.НомерДокумента + " от " + Формат(ВыборкаПоДокументам.ДатаДокумента, "ДФ=дд.ММ.гггг");
	КонецЕсли;
	
	Content.DocumentName = НаименованиеДокумента;
	Content.DocumentNumber = ВыборкаПоДокументам.НомерДокумента;
	Content.DocumentDate = ВыборкаПоДокументам.ДатаДокумента;
	Content.TotalConsumption = ИтогоРасх;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьOperationInfoОтветногоТитула(Content, ВыборкаПоДокументам)
	
	Content.StringNumber = ВыборкаПоДокументам.НомерСтроки;
	Content.OperationDate = ВыборкаПоДокументам.ДатаОперации;
	Content.OperationName = ВыборкаПоДокументам.НаименованиеОперации;
	Content.SumDebit = ВыборкаПоДокументам.СуммаДебет;
	Content.SumAmount = ВыборкаПоДокументам.СуммаКредит;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьШапкуТитулаОтправителя(Content, РеквизитыДокумента)
	
	АктСверки405_ЗаполнитьНомер(Content, РеквизитыДокумента.Номер);
	АктСверки405_ЗаполнитьПериод(Content, РеквизитыДокумента.ДатаНачала, РеквизитыДокумента.ДатаОкончания);
	АктСверки405_ЗаполнитьВалюту(Content, РеквизитыДокумента.КодВалюты);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьНомер(Content, НомерАктаСверки)
	
	Content.ActNumber = ПредставлениеНомера(НомерАктаСверки);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьПериод(Content, ДатаНачала, ДатаОкончания)
	
	Content.ReconcilationDateFrom = ДатаНачала;
	Content.ReconcilationDateTo = ДатаОкончания;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьВалюту(Content, КодВалюты)
	
	AdditionalInfoReconciliationAct = Новый_AdditionalInfoReconciliationAct();
	AdditionalInfoReconciliationAct.Currency = КодВалюты;
	
	SenderData_ReconciliationAct = Новый_SenderData_ReconciliationAct();
	SenderData_ReconciliationAct.AdditionalInfoReconciliationAct = AdditionalInfoReconciliationAct;
	
	Content.ReconciliationAct = SenderData_ReconciliationAct;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьТабличнуюЧастьТитулаОтправителя(Content, ВыборкаПоДоговорам, ДокСсылка)
	
	НачальноеСальдоПоДоговорамАкта = АктСверки405_НачальноеСальдоПоДоговорам(ДокСсылка);
	
	ReconciliationActTable = Новый_SenderReconciliationActTable();
	
	Пока ВыборкаПоДоговорам.Следующий() Цикл
		
		ОтборПоДоговору = Новый Структура("Договор", ВыборкаПоДоговорам.Договор);
		НачальноеСальдоПоДоговору = НачальноеСальдоПоДоговорамАкта.Скопировать(ОтборПоДоговору);
		
		НачОстатокПоДоговоруДт = НачальноеСальдоПоДоговору.Итог("НачОстатокПоДоговоруДт");
		НачОстатокПоДоговоруКт = НачальноеСальдоПоДоговору.Итог("НачОстатокПоДоговоруКт");
		
		СуммаОборотДт = ВыборкаПоДоговорам.СуммаДебет;
		СуммаОборотКт = ВыборкаПоДоговорам.СуммаКредит;
		
		КонОстатокПоДоговоруДт = НачОстатокПоДоговоруДт + СуммаОборотДт;
		КонОстатокПоДоговоруКт = НачОстатокПоДоговоруКт + СуммаОборотКт;
		КонОстатокПоДоговору = КонОстатокПоДоговоруДт - КонОстатокПоДоговоруКт;
		
		ContractInfo = Новый_SenderContractInfo_ReconciliationAct();
		
		ContractInfo.ContractAdditionalInfo = Строка(ВыборкаПоДоговорам.ВидДоговора);
		ContractInfo.ContractNumber = ВыборкаПоДоговорам.НомерДоговора;
		ContractInfo.ContractDate = ВыборкаПоДоговорам.ДатаДоговора;
		ContractInfo.BalanceDebitFrom = НачОстатокПоДоговоруДт;
		ContractInfo.BalanceAmountFrom = НачОстатокПоДоговоруКт;
		ContractInfo.TurnoverDebit = СуммаОборотДт;
		ContractInfo.TurnoverAmount = СуммаОборотКт;
		ContractInfo.BalanceDebitEnd = ?(КонОстатокПоДоговору > 0, КонОстатокПоДоговору, 0);
		ContractInfo.BalanceAmountEnd = ?(КонОстатокПоДоговору < 0, -КонОстатокПоДоговору, 0);
		
		ReconciliationActTable.ContractInfo.Добавить(ContractInfo);
		
		ВыборкаПоДокументам = ВыборкаПоДоговорам.Выбрать();
		
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			DocumentInfo = Новый_SenderDocumentInfo_ReconciliationAct();
			OperationInfo = Новый_SenderOperationInfo_ReconciliationAct();
			
			АктСверки405_ЗаполнитьDocumentInfoТитулаОтправителя(DocumentInfo, ВыборкаПоДокументам);
			АктСверки405_ЗаполнитьOperationInfoТитулаОтправителя(OperationInfo, ВыборкаПоДокументам);
			
			ContractInfo.DocumentInfo.Добавить(DocumentInfo);
			DocumentInfo.OperationInfo.Добавить(OperationInfo);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Content.ReconciliationAct.ReconciliationActTable = ReconciliationActTable;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьDocumentInfoТитулаОтправителя(Content, ВыборкаПоДокументам)
	
	Content.DocumentName = ВыборкаПоДокументам.НаименованиеДокумента;
	Content.DocumentNumber = ВыборкаПоДокументам.НомерДокумента;
	Content.DocumentDate = ВыборкаПоДокументам.ДатаДокумента;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьOperationInfoТитулаОтправителя(Content, ВыборкаПоДокументам)
	
	Content.StringNumber = ВыборкаПоДокументам.НомерСтроки;
	Content.OperationDate = ВыборкаПоДокументам.ДатаОперации;
	Content.OperationName = ВыборкаПоДокументам.НаименованиеОперации;
	Content.SumDebit = ВыборкаПоДокументам.СуммаДебет;
	Content.SumAmount = ВыборкаПоДокументам.СуммаКредит;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьИтогиПоТабличнойЧастиТитулаОтправителя(Content, ОстатокНаНачало, ОборотПоДебету, ОборотПоКредиту)
	
	ОстатокНаКонец = ОстатокНаНачало + ОборотПоДебету - ОборотПоКредиту;
	
	ReconciliationActTable = Content.ReconciliationAct.ReconciliationActTable;
	
	ReconciliationActTable.BalanceDebitFrom = ?(ОстатокНаНачало > 0, ОстатокНаНачало, 0);
	ReconciliationActTable.BalanceAmountFrom = ?(ОстатокНаНачало < 0, -ОстатокНаНачало, 0);
	ReconciliationActTable.TurnoverDebit = ОборотПоДебету;
	ReconciliationActTable.TurnoverAmount = ОборотПоКредиту;
	ReconciliationActTable.BalanceDebitEnd = ?(ОстатокНаКонец > 0, ОстатокНаКонец, 0);
	ReconciliationActTable.BalanceAmountEnd = ?(ОстатокНаКонец < 0, -ОстатокНаКонец, 0);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьРеквизитыОтправителя(Content, Организация, ДатаСведений)
	
	АктСверки405_ЗаполнитьРеквизитыУчастника(
		Content.ReconciliationAct.AdditionalInfoReconciliationAct.Sender,
		Организация,
		ДатаСведений
	);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьРеквизитыПолучателя(Content, Контрагент, ДатаСведений)
	
	АктСверки405_ЗаполнитьРеквизитыУчастника(
		Content.ReconciliationAct.AdditionalInfoReconciliationAct.Recipient,
		Контрагент,
		ДатаСведений
	);
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьРеквизитыУчастника(Content, Участник, ДатаСведений)
	
	СведенияОбУчастнике = АктСверки_ДанныеЮрФизЛица(Участник, ДатаСведений);
	
	Content = Новый_ExtendedOrganizationInfo_ReconciliationAct();
	
	Content.Name = СведенияОбУчастнике.ПолноеНаименование;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.Телефоны) Тогда
		Content.Phone = СведенияОбУчастнике.Телефоны;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.Email) Тогда
		Content.Email = СведенияОбУчастнике.Email;
	КонецЕсли;
	
	Если СведенияОбУчастнике.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда
		
		Content.LegalEntityId = СведенияОбУчастнике.НалоговыйНомерВСтранеРегистрации;
		Content.Type = "ForeignEntity";
		
	ИначеЕсли СведенияОбУчастнике.ТипЮрФизЛица = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		Content.Inn = СведенияОбУчастнике.ИНН;
		Content.Kpp = СведенияОбУчастнике.КПП;
		Content.Ogrn = СведенияОбУчастнике.ОГРН;
		Content.Type = "LegalEntity";
		
	ИначеЕсли СведенияОбУчастнике.ЭтоИндивидуальныйПредприниматель Тогда
		
		Content.Type = "IndividualEntity";
		Content.Inn = СведенияОбУчастнике.ИНН;
		Content.Ogrn = СведенияОбУчастнике.ОГРН;
		
	Иначе
		
		Content.Type = "PhysicalEntity";
		Content.Inn = СведенияОбУчастнике.ИНН;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АктСверки405_ЗаполнитьПодписанта(Content)
	
	Signer = Новый_Signer_ReconciliationAct();
	Signer.Official = Новый_Official();
	Signer.DigitalAttorneyInfo = Новый_DigitalAttorneyInfo_ReconciliationAct();
	Signer.PaperAttorneyInfo = Новый_PaperAttorneyInfo_ReconciliationAct();
	
	Content.ReconciliationAct.Signer = Signer;
	
КонецПроцедуры

#КонецОбласти

#Область АктCверки405_Контракты

// Инициализирует конревой элемент контента ответного титула АС405@
// 
// Возвращаемое значение:
//  Структура - содержит элементы:
//   * ReconciliationAct - Структура - Данные ответного титула акта сверки (см. Новый_RecipientData_ReconciliationAct);
//   * DateCreateFile - Дата - Дата формирования файла обмена информации получателя;
//   * TimeCreateFile - Строка - Время формирования файла обмена информации получателя;
//   * SignDisagreement - Строка - Признак наличия разногласий.
//
Функция Новый_ReconciliationActRecipientTitle()
	
	ИмяКонтента = "ReconciliationActRecipientTitle";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует конревой элемент контента титула отправителя АС405@
// 
// Возвращаемое значение:
//  Структура - содержит элементы:
//   * ReconciliationAct - Структура - Данные акта сверки (см. Новый_SenderData_ReconciliationAct);
//   * DateCreateFile - Дата - Дата формирования файла обмена информации отправителя;
//   * TimeCreateFile - Строка - Время формирования файла обмена информации отправителя;
//   * ReconcilationDateFrom - Дата - Дата начала периода сверки взаимных расчетов;
//   * ReconcilationDateTo - Дата - Дата окончания периода сверки взаимных расчетов;
//   * ActNumber - Строка - Номер акта сверки.
//
Функция Новый_ReconciliationActSenderTitle()
	
	ИмяКонтента = "ReconciliationActSenderTitle";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру ReconciliationAct объекта ReconciliationActRecipientTitle.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * IdentityInfoSender - Структура - Информация об отправителе (см. Новый_IdentityInfoSender());
//   * Signer - Структура - Сведения о подписанте (см. Новый_Signer_ReconciliationAct());
//   * ReconciliationActTable - Структура - Табличная часть акта сверки (см. Новый_RecipientReconciliationActTable());
//
Функция Новый_RecipientData_ReconciliationAct()
	
	ИмяКонтента = "RecipientData_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру ReconciliationAct объекта ReconciliationActSenderTitle.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * AdditionalInfoReconciliationAct - Структура - Информация об отправителе, получателе и валюте документа (см. Новый_AdditionalInfoReconciliationAct());
//   * ReconciliationActTable - Структура - Табличная часть акта сверки (см. Новый_SenderReconciliationActTable());
//   * Signer - Структура - Сведения о подписанте (см. Новый_Signer_ReconciliationAct());
//
Функция Новый_SenderData_ReconciliationAct()
	
	ИмяКонтента = "SenderData_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру AdditionalInfoReconciliationAct объекта SenderData_ReconciliationAct.
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Sender - Структура - Данные отправителя АС405@ (см. Новый_ExtendedOrganizationInfo_ReconciliationAct)
//   * Recipient - Структура - Данные получателя АС405@ (см. Новый_ExtendedOrganizationInfo_ReconciliationAct)
//   * Currency - Строка - Код валюты документа
//
Функция Новый_AdditionalInfoReconciliationAct()
	
	ИмяКонтента = "AdditionalInfoReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру ExtendedOrganizationInfo_ReconciliationAct (данные участников сверки).
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * AdditionalCont - Строка - Дополнительные контактные данные учатника сверки;
//   * AdditionalInfo - Строка - Информация для участника документооборота;
//   * Department - Строка - Структурное подразделение;
//   * Email - Строка - Адрес электронной почты;
//   * FnsParticipantId - Строка - Идентификатор участника ЭДО;
//   * Inn - Строка - ИНН;
//   * Kpp - Строка - КПП;
//   * LegalEntityId - Строка - Идентификатор иностранной организации;
//   * Name - Строка - Наименование организации и ИП (ФИО для ФЛ);
//   * Ogrn - Строка - ОГРН;
//   * OrganizationOrPersonInfo - Строка - Седения, идентифицирующие иностранную организацию;
//   * Phone - Строка - Номер контактного телефона или факс;
//   * Type - Строка - Тип организации.
//
Функция Новый_ExtendedOrganizationInfo_ReconciliationAct()
	
	ИмяКонтента = "ExtendedOrganizationInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру IdentityInfoSender объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * BaseIdFile - Строка - Идентификатор файла обмена информации отправителя;
//   * DateFileInfoSender - Дата - Дата формирования файла обмена информации отправителя;
//   * TimeFileInfoSender - Строка - Время формирования файла обмена информации отправителя;
//   * SignSender - Строка - Подпись отправителя;
//
Функция Новый_IdentityInfoSender()
	
	ИмяКонтента = "IdentityInfoSender";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру Signer объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Official - Структура - ФИО подписанта;
//   * JobTitle - Строка - Должность подписанта;
//   * SignatureType - Строка - (Необязательный) Тип подписи;
//   * IdSystemStorage - Строка - (Необязательный) Место хранения доверенности;
//   * DigitalAttorneyInfo - Структура - Информация об электронной доверенности (см. Новый_DigitalAttorneyInfo_ReconciliationAct());
//   * PaperAttorneyInfo - Структура - Информация о бумажной доверенности (см. Новый_PaperAttorneyInfo_ReconciliationAct());
//
Функция Новый_Signer_ReconciliationAct()
	
	ИмяКонтента = "Signer_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру DigitalAttorneyInfo объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Number - Строка - (Необязательный) Номер доверенности;
//   * Date - Дата - (Необязательный) Дата доверенности;
//   * CancelAdditionalInfo - Строка - (Необязательный) Место хранения доверенности;
//
Функция Новый_DigitalAttorneyInfo_ReconciliationAct()
	
	ИмяКонтента = "DigitalAttorneyInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру PaperAttorneyInfo объекта ReconciliationAct.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Official - Строка - (Необязательный) ФИО лица, подписавшего доверенность;
//   * Date - Дата - (Необязательный) Дата доверенности;
//   * InternalNumber - Строка - (Необязательный) Внутренний номер доверенности;
//   * IssuerAdditionalInfo - Строка - (Необязательный) Место хранения доверенности.
//
Функция Новый_PaperAttorneyInfo_ReconciliationAct()
	
	ИмяКонтента = "PaperAttorneyInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует табличную часть объекта ReconciliationAct ответного титула АС405@.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * BalanceDebitFrom - Число - (Необязательный) Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - (Необязательный) Сальдо на начало Кт;
//   * TurnoverDebit - Число - (Необязательный) Оборот за период Дт;
//   * TurnoverAmount - Число - (Необязательный) Оборот за период Кт;
//   * BalanceDebitEnd - Число - (Необязательный) Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - (Необязательный) Сальдо на конец Кт;
//   * TotalConsumptionDebit - Число - (Необязательный) Итого расхождение Дт;
//   * TotalConsumptionAmount - Число - (Необязательный) Итого расхождение Кт;
//   * ContractInfo - Массив - Информация о договорах, содержит структуры ContractInfo (см. Новый_RecipientContractInfo_ReconciliationAct());
//
Функция Новый_RecipientReconciliationActTable()
	
	ИмяКонтента = "RecipientReconciliationActTable";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует табличную часть объекта ReconciliationAct титула отправителя АС405@.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * BalanceDebitFrom - Число - (Необязательный) Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - (Необязательный) Сальдо на начало Кт;
//   * TurnoverDebit - Число - (Необязательный) Оборот за период Дт;
//   * TurnoverAmount - Число - (Необязательный) Оборот за период Кт;
//   * BalanceDebitEnd - Число - (Необязательный) Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - (Необязательный) Сальдо на конец Кт;
//   * ContractInfo - Массив - Информация о договорах, содержит структуры ContractInfo (см. Новый_SenderContractInfo_ReconciliationAct());
//
Функция Новый_SenderReconciliationActTable()
	
	ИмяКонтента = "SenderReconciliationActTable";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру Official подписанта АС405@
// 
// Возвращаемое значение:
//  Структура содержит ключи:
//   * JobTitle - Строка - Должность
//   * FirstName - Строка - Имя
//   * Surname - Строка - Фамилия
//   * Patronymic - Строка - Отчество
//
Функция Новый_Official()
	
	ИмяКонтента = "Official";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ReconciliationActTable ответного титула АС405@.
// Содержит сведения о договоре.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * ContractAdditionalInfo - Строка - (Необязательный) Описание вида договора;
//   * ContractNumber - Строка - (Необязательный) Номер договора;
//   * ContractDate - Дата - (Необязательный) Дата договора;
//   * BalanceDebitFrom - Число - (Необязательный) Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - (Необязательный) Сальдо на начало Кт;
//   * TurnoverDebit - Число - (Необязательный) Оборот за период Дт;
//   * TurnoverAmount - Число - (Необязательный) Оборот за период Кт;
//   * BalanceDebitEnd - Число - (Необязательный) Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - (Необязательный) Сальдо на конец Кт;
//   * TotalConsumptionDebit - Число - (Необязательный) Итого расхождение Дт;
//   * TotalConsumptionAmount - Число - (Необязательный) Итого расхождение Кт;
//   * DocumentInfo - Массив - Информация о документах, содержит структуры DocumentInfo (см. Новый_RecipientDocumentInfo_ReconciliationAct());
//
Функция Новый_RecipientContractInfo_ReconciliationAct()
	
	ИмяКонтента = "RecipientContractInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ContractInfo ответного титула АС405@.
// Содержит сведения о документе.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * DocumentName - Строка - Наименование документа;
//   * DocumentNumber - Строка - Номер документа;
//   * DocumentDate - Дата - Дата документа;
//   * TotalConsumption - Число - Расхождение суммы по документу;
//   * OperationInfo - Массив - Информация об операциях, содержит структуры OperationInfo (см. Новый_RecipientOperationInfo_ReconciliationAct());
//
Функция Новый_RecipientDocumentInfo_ReconciliationAct()
	
	ИмяКонтента = "RecipientDocumentInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта DocumentInfo ответного титула АС405@.
// Содержит сведения об операции.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * StringNumber - Строка - номер строки операции;
//   * OperationName - Строка - наименование операции;
//   * OperationDate - Дата - Дата операции;
//   * SumDebit - Число - (Необязательный) Сумма операции Дт;
//   * SumAmount - Число - (Необязательный) Сумма операции Кт;
//
Функция Новый_RecipientOperationInfo_ReconciliationAct()
	
	ИмяКонтента = "RecipientOperationInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ReconciliationActTable титула отправителя АС405@.
// Содержит сведения о договоре.
// 
// Возвращаемое значение:
//  Структура:
//   * DocumentInfo - Массив - Информация о документах, содержит структуры DocumentInfo (см. Новый_SenderReconciliationAct_DocumentInfo());
//   * ContractId - Строка - (Необязательный) Идентификатор договора в учетной системе отправителя;
//   * ContractAdditionalInfo - Строка- (Необязательный) Описание вида договора;
//   * ContractNumber - Строка - (Необязательный) Номер договора;
//   * ContractDate - Дата - (Необязательный) Дата договора;
//   * BalanceDebitFrom - Число - Сальдо на начало Дт;
//   * BalanceAmountFrom - Число - Сальдо на начало Кт;
//   * TurnoverDebit - Число - Оборот за период Дт;
//   * TurnoverAmount - Число - Оборот за период Кт;
//   * BalanceDebitEnd - Число - Сальдо на конец Дт;
//   * BalanceAmountEnd - Число - Сальдо на конец Кт;
//
Функция Новый_SenderContractInfo_ReconciliationAct()
	
	ИмяКонтента = "SenderContractInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта ContractInfo титула отправителя АС405@.
// Содержит сведения о документе.
// 
// Возвращаемое значение:
//  Структура:
//   * OperationInfo - Массив - Информация об операциях, содержит структуры OperationInfo (см. Новый_ReconciliationAct_OperationInfo());
//   * DocumentName - Строка - Наименование документа;
//   * DocumentNumber - Строка - Номер документа;
//   * DocumentDate - Дата - Дата документа;
//   * DocumentId - Число - Идентификатор документа в учетной системе отправителя;
//   * AdditionalInfo - Строка - Дополнительная информация о договоре.
//
Функция Новый_SenderDocumentInfo_ReconciliationAct()
	
	ИмяКонтента = "SenderDocumentInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует строку табличной части объекта DocumentInfo титула отправителя АС405@.
// Содержит сведения об операции.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//   * StringNumber - Строка - номер строки операции;
//   * OperationName - Строка - наименование операции;
//   * OperationDate - Дата - Дата операции;
//   * SumDebit - Число - (Необязательный) Сумма операции Дт;
//   * SumAmount - Число - (Необязательный) Сумма операции Кт;
//
Функция Новый_SenderOperationInfo_ReconciliationAct()
	
	ИмяКонтента = "SenderOperationInfo_ReconciliationAct";
	
	Результат = Новый_ЭлементПротоКонтента(
		ИмяКонтента
	);
	
	Возврат Результат;
	
КонецФункции

Функция АктСверки_Контракт_ДанныеЮрФизЛица()
	
	Результат = Новый Структура;

	Результат.Вставить("ТипЮрФизЛица", "");
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации", "");
	Результат.Вставить("СтранаРегистрации", "");
	Результат.Вставить("ПолноеНаименование", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ОГРН", "");
	Результат.Вставить("Телефоны", "");
	Результат.Вставить("Email", "");
	Результат.Вставить("ЭтоИндивидуальныйПредприниматель", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СчетНаОплату29

Функция СчетФНС29(СсылкаНаОбъект) Экспорт
	
	ТипПараметра = ТипЗнч(СсылкаНаОбъект);
	
	Если ТипПараметра = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Контент = Счет29_СчетНаОплату(СсылкаНаОбъект);
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Контент = Счет29_РеализацияТоваровУслуг(СсылкаНаОбъект);
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		Контент = Счет29_РеализацияУслугПоПереработке(СсылкаНаОбъект);
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Контент = Счет29_КорректировкаРеализации(СсылкаНаОбъект);
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		Контент = Счет29_АктОбОказанииПроизводственныхУслуг(СсылкаНаОбъект);
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.ПередачаОС") Тогда
		Контент = Счет29_ПередачаОС(СсылкаНаОбъект);
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		Контент = Счет29_ОтчетКомитенту(СсылкаНаОбъект);
	ИначеЕсли ЭтоСчетНаАренду(СсылкаНаОбъект) Тогда
		Контент = Счет29_СчетНаАренду(СсылкаНаОбъект);
	ИначеЕсли ЭтоНачислениеАренднойПлаты(СсылкаНаОбъект) Тогда
		Контент = Счет29_НачислениеАренды(СсылкаНаОбъект);
	Иначе
		Ошибка = СтрШаблон("Неожиданный тип документа (%1)", ТипЗнч(СсылкаНаОбъект));
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Контент;
	
КонецФункции

#КонецОбласти

#Область Счет29_ЗаполнениеЭлементовПротоструктуры

Функция Счет29_СчетНаОплату(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	Шапка.СтруктурнаяЕдиница КАК БанковскийСчетПолучателя,
	|	Шапка.СуммаСкидки КАК СуммаСкидки,
	|	Шапка.СсылочныйИдентификатор КАК СсылочныйИдентификатор,
	|	ЕСТЬNULL(Шапка.ДополнительныеУсловия.ТекстУсловий, """") КАК ДополнительныеУсловия
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ТЧ.Содержание КАК НоменклатураСодержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТЧ.Номенклатура.Услуга, ИСТИНА)
	|			ТОГДА &ТипНоменклатурыУслуга
	|		ИНАЧЕ &ТипНоменклатурыТовар
	|	КОНЕЦ КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Сумма КАК СуммаИсходная,
	|	ТЧ.СуммаСкидки КАК СуммаСкидки,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	ПсевдонимТабличнойЧасти = "ТЧ";
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", ТипыНоменклатуры.Имущество);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	ТаблицаДокумента.Колонки.Добавить("СуммаБезНДСБезСкидки");
	ТаблицаДокумента.Колонки.Добавить("СуммаНДСБезСкидки");
	ТаблицаДокумента.Колонки.Добавить("СуммаВсегоБезСкидки");
	ТаблицаДокумента.ЗагрузитьКолонку(ТаблицаДокумента.ВыгрузитьКолонку("СуммаБезНДС"), "СуммаБезНДСБезСкидки");
	ТаблицаДокумента.ЗагрузитьКолонку(ТаблицаДокумента.ВыгрузитьКолонку("СуммаНДС"), "СуммаНДСБезСкидки");
	ТаблицаДокумента.ЗагрузитьКолонку(ТаблицаДокумента.ВыгрузитьКолонку("СуммаВсего"), "СуммаВсегоБезСкидки");
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	Если ЗначениеЗаполнено(ДанныеШапки.СсылочныйИдентификатор) Тогда
		Content.ProformaInvoiceAdditionalInfo.UniquePaymentInfo = ДанныеШапки.СсылочныйИдентификатор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДополнительныеУсловия) Тогда
		УсловияОплаты = СокрЛП(ДанныеШапки.ДополнительныеУсловия);
		Content.ProformaInvoiceAdditionalInfo.PaymentTerms.Добавить(УсловияОплаты);
	КонецЕсли;
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	
	Если ДанныеШапки.СуммаСкидки <> 0 Тогда
		
		Счет29_РаспределитьСкидкуПоСтрокамТабличнойЧасти(ТаблицаДокумента, ДанныеШапки.СуммаСкидки);
		
		Content.Table = Счет29_НовыйTableWithDiscount(ТаблицаДокумента, ЭтоНДСИНА);
		
	ИначеЕсли ТаблицаДокумента.Итог("СуммаСкидки") <> 0 Тогда
		
		ТочностьОкругления = 2;
		
		Для Каждого Стр Из ТаблицаДокумента Цикл
			
			Если Стр.СуммаСкидки = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДанныеШапки.СуммаВключаетНДС Тогда
				
				Стр.СуммаВсегоБезСкидки = Стр.СуммаИсходная;
				Стр.СуммаВсего = Стр.СуммаВсегоБезСкидки - Стр.СуммаСкидки;
				
				Стр.СуммаНДСБезСкидки = РассчитатьСуммуНДС(Стр.СуммаВсегоБезСкидки, Истина, Стр.СтавкаНДС);
				Стр.СуммаНДСБезСкидки = Окр(Стр.СуммаНДСБезСкидки, ТочностьОкругления);
				
				Стр.СуммаБезНДС = Стр.СуммаВсего - Стр.СуммаНДС;
				Стр.СуммаБезНДСБезСкидки = Стр.СуммаВсегоБезСкидки - Стр.СуммаНДСБезСкидки;
				
			Иначе
				
				Стр.СуммаБезНДСБезСкидки = Стр.СуммаИсходная;
				Стр.СуммаБезНДС = Стр.СуммаБезНДСБезСкидки - Стр.СуммаСкидки;
				
				Стр.СуммаНДСБезСкидки = РассчитатьСуммуНДС(Стр.СуммаБезНДСБезСкидки, Ложь, Стр.СтавкаНДС);
				Стр.СуммаНДСБезСкидки = Окр(Стр.СуммаНДСБезСкидки, ТочностьОкругления);
				
				Стр.СуммаВсего = Стр.СуммаБезНДС + Стр.СуммаНДС;
				Стр.СуммаВсегоБезСкидки = Стр.СуммаБезНДСБезСкидки + Стр.СуммаНДСБезСкидки;
				
				Стр.СуммаСкидки = Стр.СуммаВсегоБезСкидки - Стр.СуммаВсего;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Content.Table = Счет29_НовыйTableWithDiscount(ТаблицаДокумента, ЭтоНДСИНА);
		
	Иначе
		Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	КонецЕсли;
	
	Возврат Content;
	
КонецФункции

Функция Счет29_РеализацияТоваровУслуг(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	Шапка.ПериодНачалаРабот КАК ДатаНачала,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.Грузоотправитель КАК Грузоотправитель,
	|	Шапка.Грузополучатель КАК Грузополучатель,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.БанковскийСчетОрганизации КАК БанковскийСчетПолучателя,
	|	Шапка.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	"""" КАК НоменклатураСодержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ТипНоменклатурыТовар КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Ссылка КАК Ссылка,
	|	0 КАК ПорядокТЧ,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	ТЧ.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	&ТипНоменклатурыУслуга,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """"),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """"),
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.Ссылка,
	|	1,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	ТЧ.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	&ТипНоменклатурыУслуга,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """"),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """"),
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.Ссылка,
	|	2,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	ПсевдонимТабличнойЧасти = "ТЧ";
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаАдресДоставкиЗначение(ТекстЗапроса, Метаданные.Документы.РеализацияТоваровУслуг);
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", ТипыНоменклатуры.Имущество);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	ЕстьТовары = Не Счет29_СодержитТолькоУслуги(ТаблицаДокумента);
	Если ЕстьТовары Тогда
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
			Content.Shipper = Счет29_НовыйOrganizationInfoСФактическимАдресом(
				ДанныеШапки.Грузоотправитель,
				ДанныеШапки.Дата
			);
		КонецЕсли;
		
		
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
			СведенияОбАдресеДоставки = УПД970_СведенияОбАдресеДоставки(
				ДанныеШапки.АдресДоставки,
				ДанныеШапки.АдресДоставкиЗначение
			);
			Content.Consignee = Счет29_НовыйOrganizationInfoСФактическимАдресом(
				ДанныеШапки.Грузополучатель,
				ДанныеШапки.Дата,
				СведенияОбАдресеДоставки
			);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДатаНачала) Тогда
		Content.ProformaInvoiceAdditionalInfo.StartShipmentDate = ДанныеШапки.ДатаНачала;
	КонецЕсли;
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_РеализацияУслугПоПереработке(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетПолучателя
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ТЧ.Содержание КАК НоменклатураСодержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ТипНоменклатурыУслуга КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Ссылка КАК Ссылка,
	|	0 КАК ПорядокТЧ,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	ПсевдонимТабличнойЧасти = "ТЧ";
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", ТипыНоменклатуры.Услуга);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_КорректировкаРеализации(СсылкаНаОбъект)
	
	Если Не ЭтоИсправлениеРеализации(СсылкаНаОбъект) Тогда
		Ошибка = "Формирование счетов на оплату поддерживается только для 
		|корректировок реализации с видом 'Исправление'";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.Грузоотправитель КАК Грузоотправитель,
	|	Шапка.Грузополучатель КАК Грузополучатель,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	ЕСТЬNULL(КурсыВалютНаДату.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютНаДату.Кратность, 1) КАК Кратность,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.БанковскийСчетОрганизации КАК БанковскийСчетПолучателя,
	|	Шапка.АдресДоставки КАК АдресДоставки,
	|	&АдресДоставкиЗначение КАК АдресДоставкиЗначение
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаДокумента) КАК КурсыВалютНаДату
	|		ПО Шапка.ВалютаДокумента = КурсыВалютНаДату.Валюта
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	"""" КАК НоменклатураСодержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ТипНоменклатурыТовар КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Ссылка КАК Ссылка,
	|	0 КАК ПорядокТЧ,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	ТЧ.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	&ТипНоменклатурыУслуга,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """"),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """"),
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.Ссылка,
	|	1,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	ТЧ.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	&ТипНоменклатурыУслуга,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """"),
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """"),
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.Ссылка,
	|	2,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.КорректировкаРеализации.АгентскиеУслуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	ПсевдонимТабличнойЧасти = "ТЧ";
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаАдресДоставкиЗначение(ТекстЗапроса, Метаданные.Документы.КорректировкаРеализации);
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	РеквизитыДокумента = ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, "Дата, ВалютаДокумента");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДатаДокумента", РеквизитыДокумента.Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", РеквизитыДокумента.ВалютаДокумента);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", ТипыНоменклатуры.Имущество);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	ЕстьТовары = Не Счет29_СодержитТолькоУслуги(ТаблицаДокумента);
	Если ЕстьТовары Тогда
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
			Content.Shipper = Счет29_НовыйOrganizationInfoСФактическимАдресом(
				ДанныеШапки.Грузоотправитель,
				ДанныеШапки.Дата
			);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
			СведенияОбАдресеДоставки = УПД970_СведенияОбАдресеДоставки(
				ДанныеШапки.АдресДоставки,
				ДанныеШапки.АдресДоставкиЗначение
			);
			Content.Consignee = Счет29_НовыйOrganizationInfoСФактическимАдресом(
				ДанныеШапки.Грузополучатель,
				ДанныеШапки.Дата,
				СведенияОбАдресеДоставки
			);
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_АктОбОказанииПроизводственныхУслуг(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетПолучателя
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	"""" КАК НоменклатураСодержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ТипНоменклатурыУслуга КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Ссылка КАК Ссылка,
	|	0 КАК ПорядокТЧ,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	ПсевдонимТабличнойЧасти = "ТЧ";
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", ТипыНоменклатуры.Услуга);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_ПередачаОС(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.Грузоотправитель КАК Грузоотправитель,
	|	Шапка.Грузополучатель КАК Грузополучатель,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетПолучателя
	|ИЗ
	|	Документ.ПередачаОС КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.ОсновноеСредство КАК Номенклатура,
	|	ЕСТЬNULL(ТЧ.ОсновноеСредство.НаименованиеПолное, """") КАК НоменклатураНаименование,
	|	"""" КАК НоменклатураСодержание,
	|	"""" КАК НоменклатураАртикул,
	|	&ТипНоменклатурыТовар КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Ссылка КАК Ссылка,
	|	0 КАК ПорядокТЧ,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", ТипыНоменклатуры.Имущество);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
		Content.Shipper = Счет29_НовыйOrganizationInfoСФактическимАдресом(
			ДанныеШапки.Грузоотправитель,
			ДанныеШапки.Дата
		);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		Content.Consignee = Счет29_НовыйOrganizationInfoСФактическимАдресом(
			ДанныеШапки.Грузополучатель,
			ДанныеШапки.Дата
		);
	КонецЕсли;
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_ОтчетКомитенту(СсылкаНаОбъект)
	
	СуммаВознаграждения = СсылкаНаОбъект.Товары.Итог("СуммаВознаграждения");
	Если СуммаВознаграждения = 0 Тогда
		Ошибка = "Формирование счетов на оплату поддерживается только для
		| ОтчетовКомитенту с указанной суммой вознаграждения.";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Ссылка,
	|	СУММА(ТЧ.СуммаНДСВознаграждения) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|				ТОГДА ТЧ.СуммаВознаграждения - ТЧ.СуммаНДСВознаграждения
	|			ИНАЧЕ ТЧ.СуммаВознаграждения
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|				ТОГДА ТЧ.СуммаВознаграждения
	|			ИНАЧЕ ТЧ.СуммаВознаграждения + ТЧ.СуммаНДСВознаграждения
	|		КОНЕЦ) КАК СуммаВсего
	|ПОМЕСТИТЬ ВТ_Вознаграждение
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетПолучателя,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.УслугаПоВознаграждению КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Шапка.УслугаПоВознаграждению = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА &ПредопределенноеНаименованиеУслуги
	|		КОГДА Шапка.УслугаПоВознаграждению.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА Шапка.УслугаПоВознаграждению.Наименование
	|		ИНАЧЕ Шапка.УслугаПоВознаграждению.НаименованиеПолное
	|	КОНЕЦ КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ЕСТЬNULL(Шапка.УслугаПоВознаграждению.Артикул, """")
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА ЕСТЬNULL(Шапка.УслугаПоВознаграждению.Код, """")
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ КАК НоменклатураАртикул,
	|	ЕСТЬNULL(Шапка.УслугаПоВознаграждению.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(Шапка.УслугаПоВознаграждению.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(Шапка.УслугаПоВознаграждению.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	Шапка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ЕСТЬNULL(ВТ_Вознаграждение.СуммаНДС, 0) КАК СуммаНДС,
	|	ЕСТЬNULL(ВТ_Вознаграждение.СуммаБезНДС, 0) КАК СуммаБезНДС,
	|	ЕСТЬNULL(ВТ_Вознаграждение.СуммаВсего, 0) КАК СуммаВсего
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вознаграждение КАК ВТ_Вознаграждение
	|		ПО Шапка.Ссылка = ВТ_Вознаграждение.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект";
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПредопределенноеНаименованиеУслуги", "Комиссионное вознаграждение");
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Ошибка = СтрШаблон("Не удалось получить данные по документу '%1'", СсылкаНаОбъект);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ДанныеДокумента = РезультатЗапроса.Выбрать();
	ДанныеДокумента.Следующий();
	
	Content = Счет29_НовыйКонтент(ДанныеДокумента);
	
	Item = Новый_ЭлементПротоКонтента("Item29");
	
	Item.Product = ДанныеДокумента.НоменклатураНаименование;
	Item.ItemMark = ТипыНоменклатуры.Услуга;
	Item.ItemVendorCode = ДанныеДокумента.НоменклатураАртикул;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.ЕдиницаИзмерения) Тогда
		
		Item.Quantity = 1;
		Item.UnitName = СокрЛП(ДанныеДокумента.ЕдиницаИзмеренияНаименование);
		Item.Unit = СокрЛП(ДанныеДокумента.ЕдиницаИзмеренияКод);
		
	КонецЕсли;
	
	ЭтоНДСИНА = Ложь;
	Item.TaxRate = ПредставлениеСтавкиНДС(ДанныеДокумента.СтавкаНДС, ЭтоНДСИНА);
	
	ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
	Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
	Item.Vat = ДанныеДокумента.СуммаНДС;
	Item.Subtotal = ДанныеДокумента.СуммаВсего;
	Item.SubtotalWithVatExcluded = ДанныеДокумента.СуммаБезНДС;
	Item.Price = Item.SubtotalWithVatExcluded;
	Item.PriceWithoutDiscount = Item.Price;
	Item.VatWithoutDiscount = Item.Vat; // СумНалБезСки обязательный элемент
	
	Content.Table = Новый_ЭлементПротоКонтента("ProformaInvoiceTable29");
	Content.Table.Items.Добавить(Item);
	
	Content.Table.WithoutVat = Item.WithoutVat;
	Content.Table.Vat = Item.Vat;
	Content.Table.Total = Item.Subtotal;
	Content.Table.TotalWithVatExcluded = Item.SubtotalWithVatExcluded;
	
	Возврат Content;
	
КонецФункции

Функция Счет29_СчетНаАренду(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.СчетОрганизации КАК БанковскийСчетПолучателя,
	|	ЕСТЬNULL(Шапка.ДополнительныеУсловия.ТекстУсловий, """") КАК ДополнительныеУсловия
	|ИЗ
	|	Документ.АР_СчетНаАренду КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ТЧ.Содержание КАК НоменклатураСодержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ТипНоменклатурыУслуга КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АР_СчетНаАренду.Состав КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	ПсевдонимТабличнойЧасти = "ТЧ";
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", ТипыНоменклатуры.Услуга);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДополнительныеУсловия) Тогда
		УсловияОплаты = Лев(СокрЛП(ДанныеШапки.ДополнительныеУсловия), 1000);
		Content.ProformaInvoiceAdditionalInfo.PaymentTerms.Добавить(УсловияОплаты);
	КонецЕсли;
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_НачислениеАренды(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Документ,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Шапка.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Шапка.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Код, """") КАК ВалютаКод,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.Наименование, """") КАК ВалютаНаименование,
	|	ЕСТЬNULL(Шапка.ВалютаДокумента.ЗагружаетсяИзИнтернета, ЛОЖЬ) КАК ЭтоВалютаПоОКВ,
	|	Шапка.КурсВзаиморасчетов КАК Курс,
	|	Шапка.КратностьВзаиморасчетов КАК Кратность,
	|	Шапка.Организация КАК ОрганизацияПолучатель,
	|	Шапка.СчетОрганизации КАК БанковскийСчетПолучателя
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НоменклатураНаименование,
	|	ТЧ.Содержание КАК НоменклатураСодержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ТипНоменклатурыУслуга КАК НоменклатураТип,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Сумма
	|		ИНАЧЕ ТЧ.Сумма + ТЧ.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты.Состав КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	ПсевдонимТабличнойЧасти = "ТЧ";
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТабличнойЧасти);
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", ТипыНоменклатуры.Услуга);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	ТаблицаДокумента = РезультатыЗапроса[1].Выгрузить();
	
	Content = Счет29_НовыйКонтент(ДанныеШапки);
	
	ЭтоНДСИНА = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	Content.Table = Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_НовыйOrganizationInfo(Организация, Дата, БанковскийСчет = Неопределено)
	
	OrgInfo = Новый_ЭлементПротоКонтента("ExtendedOrganizationInfoXmlProformaInvoice29");
	
	ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Организация, Дата, БанковскийСчет);
	
	Счет29_ЗаполнитьExtendedOrganizationInfoXmlProformaInvoice29(OrgInfo, ДанныеУчастникаЭДО);
	
	СведенияОбАдресе = УПД970_СведенияОбАдресе(ДанныеУчастникаЭДО.ЮридическийАдресJSON);
	OrgInfo.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
	
	OrgInfo.СлужебнаяИнформация = Новый_ЭлементПротоКонтента("OrganizationСлужебнаяИнформация");
	OrgInfo.СлужебнаяИнформация.Ссылка = Организация;
	
	Возврат OrgInfo;
	
КонецФункции

Функция Счет29_НовыйOrganizationInfoСФактическимАдресом(Организация, Дата, Знач СведенияОбАдресе = Неопределено)
	
	OrgInfo = Новый_ЭлементПротоКонтента("ExtendedOrganizationInfoXmlProformaInvoice29");
	
	ДанныеУчастникаЭДО = УПД970_ДанныеЮрФизЛица(Организация, Дата);
	
	Счет29_ЗаполнитьExtendedOrganizationInfoXmlProformaInvoice29(OrgInfo, ДанныеУчастникаЭДО);
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		СведенияОбАдресе = УПД970_СведенияОбАдресе(ДанныеУчастникаЭДО.ФактическийАдресJSON);
	КонецЕсли;
	
	OrgInfo.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
	
	OrgInfo.СлужебнаяИнформация = Новый_ЭлементПротоКонтента("OrganizationСлужебнаяИнформация");
	OrgInfo.СлужебнаяИнформация.Ссылка = Организация;
	
	Возврат OrgInfo;
	
КонецФункции

Процедура Счет29_ЗаполнитьExtendedOrganizationInfoXmlProformaInvoice29(OrgInfo, ДанныеУчастникаЭДО)
	
	OrgInfo.Type = ДанныеУчастникаЭДО.ТипЮрФизЛица;
	OrgInfo.Name = ДанныеУчастникаЭДО.НаименованиеПолное;
	
	OrgInfo.Inn = ДанныеУчастникаЭДО.ИНН;
	OrgInfo.Kpp = ДанныеУчастникаЭДО.КПП;
	OrgInfo.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	OrgInfo.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	OrgInfo.OrganizationOrPersonInfo = ДанныеУчастникаЭДО.ИныеСведения;
	
	ВидыЮрФизЛиц = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	Если ДанныеУчастникаЭДО.ТипЮрФизЛица = ВидыЮрФизЛиц.ИндивидуальныйПредприниматель Тогда
		OrgInfo.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
		OrgInfo.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРН;
		OrgInfo.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаРегистрации;
	КонецЕсли;
	
	Если ДанныеУчастникаЭДО.ТипЮрФизЛица = ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		OrgInfo.PhysicalEntityStatusID = "1"; // Иное лицо
	КонецЕсли;
	
	OrgInfo.Country = ДанныеУчастникаЭДО.СтранаРегистрацииНаименование;
	OrgInfo.CountryCode = ДанныеУчастникаЭДО.СтранаРегистрацииКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		OrgInfo.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Email) Тогда
		OrgInfo.Email.Добавить(ДанныеУчастникаЭДО.Email);
	КонецЕсли;
	
	OrgInfo.BankName = ДанныеУчастникаЭДО.Банк;
	OrgInfo.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	OrgInfo.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	OrgInfo.BankId = ДанныеУчастникаЭДО.БИК;
	
КонецПроцедуры

Функция Счет29_НовыйКонтент(ДанныеШапки)
	
	СсылкаНаОбъект = ДанныеШапки.Документ;
	МодульСрокиОплатыДокументов = ОбщийМодульПоИмениЛок("СрокиОплатыДокументов");
	СтруктураСрокОплаты = МодульСрокиОплатыДокументов.СрокОплатыДокументаРасчетов(
		ДанныеШапки.Организация,
		СсылкаНаОбъект,
		ДанныеШапки.Дата,
		ДанныеШапки.ДоговорКонтрагента
	);
	
	Content = Новый_ЭлементПротоКонтента("ProformaInvoice29SellerContent");
	
	Content.DocumentNumber = ПредставлениеНомера(ДанныеШапки.Номер);
	Content.DocumentDate = ДанныеШапки.Дата;
	
	Если ДанныеШапки.ЭтоВалютаПоОКВ Или ДанныеШапки.Валюта = ВалютаРегламентированногоУчета() Тогда
		Content.Currency = ДанныеШапки.ВалютаКод;
		Content.IsConventionalUnit = Ложь;
		Content.ConventionalUnitDefinition = "";
	Иначе
		Content.Currency = "";
		Content.IsConventionalUnit = Истина;
		Content.ConventionalUnitDefinition = ДанныеШапки.ВалютаНаименование;
	КонецЕсли;
	Content.CurrencyRate = Окр(ДанныеШапки.Курс / ДанныеШапки.Кратность, 4);
	
	Content.Seller = Счет29_НовыйOrganizationInfo(ДанныеШапки.Организация, ДанныеШапки.Дата);
	Content.Buyer = Счет29_НовыйOrganizationInfo(ДанныеШапки.Контрагент, ДанныеШапки.Дата);
	Content.Payer = Content.Buyer;
	Content.MoneyRecipient = Счет29_НовыйOrganizationInfo(
		ДанныеШапки.ОрганизацияПолучатель,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетПолучателя
	);
	
	BaseInfo = Счет29_НовыйBaseInfo(ДанныеШапки.ДоговорКонтрагента);
	Если ЗначениеЗаполнено(BaseInfo) Тогда
		Content.ProformaInvoiceBases.Добавить(BaseInfo);
	КонецЕсли;
	
	Content.ProformaInvoiceAdditionalInfo = Новый_ЭлементПротоКонтента("ProformaInvoiceAdditionalInfo");
	Content.ProformaInvoiceAdditionalInfo.DateRestriction = СтруктураСрокОплаты.СрокОплаты;
	Content.ProformaInvoiceAdditionalInfo.PaymentPurpose = СтрШаблон(
		"Оплата по счету %1 от %2",
		Content.DocumentNumber,
		Формат(Content.DocumentDate, "ДФ=dd.MM.yyyy")
	);
	
	Возврат Content;
	
КонецФункции

Функция Счет29_НовыйTable(ТаблицаДокумента, ЭтоНДСИНА)
	
	ТочностьОкругления = 2;
	Table = Новый_ЭлементПротоКонтента("ProformaInvoiceTable29");
	
	ВсеСтрокиБезНДС = Истина;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		
		Item = Новый_ЭлементПротоКонтента("Item29");
		
		Item.Product = СтрокаТаблицы.НоменклатураСодержание;
		Если Не ЗначениеЗаполнено(Item.Product) Тогда
			Item.Product = СтрокаТаблицы.НоменклатураНаименование;
		КонецЕсли;
		
		Item.ItemMark = СтрокаТаблицы.НоменклатураТип;
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураАртикул;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество)
			И ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			
			Item.Quantity = СтрокаТаблицы.Количество;
			Item.UnitName = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияНаименование);
			Item.Unit = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС, ЭтоНДСИНА);
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		ВсеСтрокиБезНДС = ВсеСтрокиБезНДС И ЭтоСтавкаБезНДС;
		
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		
		Если ЗначениеЗаполнено(Item.Quantity) Тогда
			Item.Price = Окр(Item.SubtotalWithVatExcluded / Item.Quantity, ТочностьОкругления);
		Иначе
			Item.Price = Item.SubtotalWithVatExcluded;
		КонецЕсли;
		
		Item.PriceWithoutDiscount = Item.Price; // ЦенаТовБезСки требуется для корректной визуализации
		Item.VatWithoutDiscount = Item.Vat; // СумНалБезСки обязательный элемент
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	Table.Vat = ТаблицаДокумента.Итог("СуммаНДС");
	Table.Total = ТаблицаДокумента.Итог("СуммаВсего");
	Table.TotalWithVatExcluded = ТаблицаДокумента.Итог("СуммаБезНДС");
	
	Возврат Table;
	
КонецФункции

Функция Счет29_НовыйTableWithDiscount(ТаблицаДокумента, ЭтоНДСИНА)
	
	ТочностьОкругления = 2;
	Table = Новый_ЭлементПротоКонтента("ProformaInvoiceTable29");
	
	ВсеСтрокиБезНДС = Истина;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		
		Item = Новый_ЭлементПротоКонтента("Item29");
		
		Item.Product = СтрокаТаблицы.НоменклатураСодержание;
		Если Не ЗначениеЗаполнено(Item.Product) Тогда
			Item.Product = СтрокаТаблицы.НоменклатураНаименование;
		КонецЕсли;
		
		Item.ItemMark = СтрокаТаблицы.НоменклатураТип;
		Item.ItemVendorCode = СтрокаТаблицы.НоменклатураАртикул;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество)
			И ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			
			Item.Quantity = СтрокаТаблицы.Количество;
			Item.UnitName = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияНаименование);
			Item.Unit = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод);
			
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС, ЭтоНДСИНА);
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		ВсеСтрокиБезНДС = ВсеСтрокиБезНДС И ЭтоСтавкаБезНДС;
		
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		
		Если ЗначениеЗаполнено(Item.Quantity) Тогда
			Item.Price = Окр(Item.SubtotalWithVatExcluded / Item.Quantity, ТочностьОкругления);
		Иначе
			Item.Price = Item.SubtotalWithVatExcluded;
		КонецЕсли;
		
		Item.VatWithoutDiscount = СтрокаТаблицы.СуммаНДСБезСкидки;
		Item.SubtotalWithoutDiscount = СтрокаТаблицы.СуммаВсегоБезСкидки;
		Item.SubtotalWithoutVatAndDiscount = СтрокаТаблицы.СуммаБезНДСБезСкидки;
		
		Если ЗначениеЗаполнено(Item.Quantity) Тогда
			Item.PriceWithoutDiscount = Окр(Item.SubtotalWithoutVatAndDiscount / Item.Quantity, ТочностьОкругления);
		Иначе
			Item.PriceWithoutDiscount = Item.SubtotalWithoutVatAndDiscount;
		КонецЕсли;
		
		Item.DiscountSum = СтрокаТаблицы.СуммаСкидки;
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	Table.Vat = ТаблицаДокумента.Итог("СуммаНДС");
	Table.Total = ТаблицаДокумента.Итог("СуммаВсего");
	Table.TotalWithVatExcluded = ТаблицаДокумента.Итог("СуммаБезНДС");
	Table.TotalDiscountSum = ТаблицаДокумента.Итог("СуммаСкидки");
	
	Возврат Table;
	
КонецФункции

Функция Счет29_НовыйBaseInfo(Договор)
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДоговора = ЗначенияРеквизитовОбъектаЛок(Договор, "Дата, Номер, Наименование");
	
	Если СокрЛП(Нрег(РеквизитыДоговора.Наименование)) = Нрег("Без договора") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	DocumentRequisitesType = Новый_ЭлементПротоКонтента("DocumentRequisitesType");
	
	DocumentRequisitesType.DocumentName = "Договор";
	DocumentRequisitesType.DocumentDate = РеквизитыДоговора.Дата;
	
	Если ПустаяСтрока(РеквизитыДоговора.Номер) Тогда
		DocumentRequisitesType.DocumentNumber = "Без номера";
	Иначе
		DocumentRequisitesType.DocumentNumber = РеквизитыДоговора.Номер;
	КонецЕсли;
	
	ProformaInvoice29Base = Новый_ЭлементПротоКонтента("ProformaInvoice29Base");
	
	ProformaInvoice29Base.ProformaInvoiceBaseDocument = DocumentRequisitesType;
	
	Возврат ProformaInvoice29Base;
	
КонецФункции

Процедура Счет29_РаспределитьСкидкуПоСтрокамТабличнойЧасти(ТабличнаяЧасть, СуммаСкидки)
	
	Если СуммаСкидки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоПоДокументу = ТабличнаяЧасть.Итог("СуммаВсего");
	ВсегоПоСтрокам = ТабличнаяЧасть.ВыгрузитьКолонку("СуммаВсего");
	
	ВсегоСоСкидкой = ВсегоПоДокументу - СуммаСкидки;
	
	Если ВсегоСоСкидкой <= 0 Тогда
		Ошибка = "Сумма скидки превышает сумму по документу";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("ОбщегоНазначенияКлиентСервер");
	ТочностьОкругления = 2;
	
	СуммыВсегоСоСкидкой =
		ИнтерфейсБСП.РаспределитьСуммуПропорциональноКоэффициентам(ВсегоСоСкидкой, ВсегоПоСтрокам, ТочностьОкругления);
	СуммыСкидок = ИнтерфейсБСП.РаспределитьСуммуПропорциональноКоэффициентам(СуммаСкидки, ВсегоПоСтрокам, 2);
	
	Для Индекс = 0 По ТабличнаяЧасть.Количество() - 1 Цикл
		
		Стр = ТабличнаяЧасть[Индекс];
		
		Стр.СуммаВсего = СуммыВсегоСоСкидкой[Индекс];
		Стр.СуммаНДС = РассчитатьСуммуНДС(Стр.СуммаВсего, Истина, Стр.СтавкаНДС);
		Стр.СуммаНДС = Окр(Стр.СуммаНДС, ТочностьОкругления);
		Стр.СуммаБезНДС = Стр.СуммаВсего - Стр.СуммаНДС;
		Стр.СуммаСкидки = СуммыСкидок[Индекс];
		
	КонецЦикла;
	
КонецПроцедуры

Функция Счет29_СодержитТолькоУслуги(ТаблицаДокумента)
	
	ТипНоменклатурыИмущество = ГенерацияXML.Перечисление_ItemMarks().Имущество;
	Результат = (ТаблицаДокумента.Найти(ТипНоменклатурыИмущество, "НоменклатураТип") = Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


//} ПРОТОКОНТЕНТ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоАрендаИУправлениеНедвижимостью()
	
	ИмяПодсистемы = "АрендаИУправлениеНедвижимостью";
	
	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	
	Результат = (ПодсистемыКонфигурации.Получить(ИмяПодсистемы) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция ПрикладнаяСтавкаБезНДС()
	Возврат Перечисления.СтавкиНДС.БезНДС;
КонецФункции

Функция ЭтоВидДоговораСКомитентомНаЗакупку(ВидДоговора)

	Результат = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправительныйСчетФактураВыданный(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ЭтоСчетФактураВыданный(ДокументСсылка) Тогда
		Результат = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "Исправление");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КППНаДатуЛок(Ссылка, ДатаСведений)

	МодульУчетНДСБП = ОбщийМодульПоИмениЛок("УчетНДСБП");
	Результат = МодульУчетНДСБП.КППНаДату(Ссылка, ДатаСведений);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеОрганизацииНаОбщемБалансе(Ссылка)
	
	Результат = (ЗначениеЗаполнено(Ссылка)
		И ЭтоПодразделениеОрганизации(Ссылка)
		И ЗначениеРеквизитаОбъектаЛок(Ссылка, "ОбособленноеПодразделение"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПодразделениеОрганизации(Ссылка)
	Возврат (ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизаций"));
КонецФункции

Функция ДополнительнаяКолонкаПечатныхФормДокументов()
	
	Результат = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьВТаблицуЗначенийЛок(ТаблицаИсточник, ТаблицаПриемник)

	МодульОбщегоНазначенияБПВызовСервера = Вычислить("ОбщегоНазначенияБПВызовСервера");
	МодульОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаИсточник, ТаблицаПриемник);
	
КонецПроцедуры

Функция ПродавецКрупнейшийНалогоплательщик(Продавец)
	
	Результат = Ложь;
	
	Если ТипЗнч(Продавец) <> Тип("СправочникСсылка.Организации") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ИспользуетсяФункционалКрупнейшийНалогоплательщик() Тогда
		Результат = ЗначениеРеквизитаОбъектаЛок(Продавец, "КрупнейшийНалогоплательщик");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяФункционалКрупнейшийНалогоплательщик()
	
	Результат = Ложь;
	
	ВерсияПодсистемыБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии_(ВерсияПодсистемыБП, "3.0.138") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьФункционалСведенийОбАвансах()
	
	Результат = Ложь;
	
	ВерсияПодсистемыБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии_(ВерсияПодсистемыБП, "3.0.189") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

НеИспользуется_РежимУправляемыхФорм = Истина; // Определяет версию типового модуля: ОФ / УФ
