
#Область ПЕРЕМЕННЫЕ_ПЛАТФОРМЫ
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Манифест 				Экспорт;
Перем ОбработкаОбъект 		Экспорт;
Перем ПараметрыКлиентСервер Экспорт;

Перем НомерИтерацииВызоваМодуля;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
#КонецОбласти

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ПЛАТФОРМЫ

Функция МетодСервера(ИмяМодуля = "", ИмяМетода, 
		Параметр0 = NULL, Параметр1 = NULL, Параметр2 = NULL, Параметр3 = NULL, Параметр4 = NULL, 
		Параметр5 = NULL, Параметр6 = NULL, Параметр7 = NULL, Параметр8 = NULL, Параметр9 = NULL)
	
	Возврат ОбработкаОбъект.МетодСервера(ИмяМодуля, ИмяМетода, 
	Параметр0, Параметр1, Параметр2, Параметр3, Параметр4, 
	Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля= 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ОбработкаОбъект.ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект= 	   Неопределено;
		ПараметрыКлиентСервер= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриглашениеОтладки() Экспорт
	
	//// Удалите комментарий напротив оператора "ВызватьИсключение", чтобы получить приглашение для начала отладки модуля.
	//ВызватьИсключение "Нажмите кнопку ""Подробно"", а затем ""Конфигуратор"", чтобы начать отладку модуля!"; 
	
КонецПроцедуры

#КонецОбласти

#Область МАНИФЕСТ
// Все функции и процедуры тела модуля должны быть экспортными и добавлены в соответствующую структуру!

Функция ФункцииМодуля() Экспорт
	
	Результат = Новый Структура;
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьВидКИ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДанныеТЧ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииАктаСверки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуАктаВыполненныхРабот");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПодготовитьВТДляСпискаОтправкиДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьМассивСсылокРТУПоСчетуНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДокОснованиеКорректировкиРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСчетНаОплатуНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьЗаказПокупателяНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСФОснованиеПоИСФ_КСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДанныеНоменклатуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДанныеСчетовУчетаМЗ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСчетПоКоду", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВалютаРегламентированногоУчета", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплатуСредствамиДиадок");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаФактуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаНаОплату");
		
	// Признаки
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоСчетНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоЗаказПокупателя");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКорректировкаРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоИсправление");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоНакладная");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СчетФактуранаАванс");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВозвратТоваровОтКлиента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВыбытиеИзОборотаМаркируемойПродукции");
	
	// Машиночитаемые доверенности
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ИмяСправочникаВИнформационнойБазе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ДанныеДоверенности");

	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьОбстоятельствоФормированияСчетФактуры");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента
//
// Параметры:
//  ТребуемыеРеквизиты	 - Структура	 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - ссылка на объект, описание которого надо получить.
//
Процедура ПриПолученииОписанияПрикладногоДокумента(ТребуемыеРеквизиты, СсылкаНаОбъект) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидДокументаИнформационнойБазы
//
// Параметры:
//  ВидДокумента	 - Строка - (возвращаемый параметр) вид документа с точки зрения ЭДО (см. ВидыЭлектронныхДокументов);
//  СсылкаНаОбъект	 - ЛюбаяСсылка - объект информационной базы, вид которого необходимо определить;
//  ЭтоКорректировка - Булево - Истина, если объект отражает операцию корректировки;
//
Процедура ОпределитьВидДокумента(ВидДокумента, СсылкаНаОбъект, ЭтоКорректировка) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	МетаданныеДокументов = Метаданные.Документы;
	
	СоответствиеМетаданных = Новый Соответствие;
	СоответствиеМетаданных.Вставить(МетаданныеДокументов.АктСверкиВзаиморасчетов, ВидыЭД.АктСверки);
	СоответствиеМетаданных.Вставить(МетаданныеДокументов.СчетНаОплату, ВидыЭД.СчетНаОплату);
	СоответствиеМетаданных.Вставить(МетаданныеДокументов.АктОбОказанииУслуг, ВидыЭД.АктОбОказанииУслуг);
	СоответствиеМетаданных.Вставить(МетаданныеДокументов.НакладнаяНаРеализациюТорг12, ВидыЭД.АктОбОказанииУслуг);
	
	ВидДокумента = СоответствиеМетаданных.Получить(МетаданныеОбъекта);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт
	
	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;

	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Номер");
	РеквизитыДокумента.Вставить("Дата");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыДокумента);
	
	Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	Результат.ДатаДокумента	 = ЗначенияРеквизитов.Дата;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку820
//
// Параметры:
//  ДокументыОбОтгрузке	- Массив - (возвращаемый параметр) Массив элементов "Новый_DocumentShipment";
//  СсылкаНаОбъект		- ДокументСсылка.СчетФактураВыданный - СФ для которой определяем реквизиты документов отгрузки.
//
Процедура ПриПолученииДанныхДокументовОбОтгрузке(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереКорректировочногоДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт

	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;

	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Номер");
	РеквизитыДокумента.Вставить("Дата");
	РеквизитыДокумента.Вставить("НомерПервичногоДокумента");
	РеквизитыДокумента.Вставить("ДатаПервичногоДокумента");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыДокумента);
	
	Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	Результат.ДатаДокумента	 = ЗначенияРеквизитов.Дата;
	
	ОписаниеРеквизитов = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ДатаНомерДокументаОснования");
	ОписаниеРеквизитов.НомерИсходногоДокумента = ЗначенияРеквизитов.НомерИсходногоДокумента;
	ОписаниеРеквизитов.ДатаИсходногоДокумента  = ЗначенияРеквизитов.ДатаИсходногоДокумента;
	
	Результат.ДатаНомерДокументовОснований.Добавить(ОписаниеРеквизитов);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки.
//
// Параметры:
//  Реквизиты			 - Структура		 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  МетаданныеИсточника	 - ОбъектМетаданных	 - Метаданные документа-источника
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника) Экспорт
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузополучатель") Тогда 
		
		Реквизиты.Вставить("Грузополучатель", 
		"ВЫБОР
		|	КОГДА Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		ТОГДА Контрагент
		|	ИНАЧЕ Грузополучатель
		|КОНЕЦ");
		
	КонецЕсли;
	
	Если НЕ ЕстьРеквизитМетаданных(МетаданныеИсточника, "ЦенаВключаетНДС")
		И ЕстьРеквизитМетаданных(МетаданныеИсточника, "СуммаВключаетНДС") Тогда
		
		Реквизиты.Вставить("ЦенаВключаетНДС", "СуммаВключаетНДС");
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки
// после формирования структуры шапки документа.
//
// Параметры:
//  ЗначенияРеквизитов - Структура - Структура со значениями реквизита документа
//
Процедура ПослеПолученияДанныхШапкиДокумента(ДанныеШапки) Экспорт
	
	СсылкаНаОбъект = ДанныеШапки.ОписаниеДокумента.Ссылка;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
		ДополнитьШапкуСчетаФактурыПоДокументуОснованию(ДанныеШапки);
	Иначе
		ДанныеШапки.Вставить("БанковскийСчетОрганизации", ПолучитьБанковскийСчет(СсылкаНаОбъект));
		ДанныеШапки.Вставить("БанковскийСчетКонтрагента", ПолучитьБанковскийСчетКонтрагента(СсылкаНаОбъект));
	КонецЕсли;
	
	Если СчетФактураНаАванс(СсылкаНаОбъект) Тогда
		ДанныеШапки.ЦенаВключаетНДС = Истина;
		ДанныеШапки.Вставить("СФНаАванс", Истина);
	КонецЕсли;
	
	ДанныеШапки.Вставить("ГрузоотправительКПП", КППГрузоотправителя(ДанныеШапки.Организация, ДанныеШапки.Грузоотправитель));
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  МетаданныеОбъекта	 - ОбъектМетаданных - объект метаданных.
//  ТабличныеЧасти		 - Массив - массив, в который необходимо добавить имена табличных частей, из которых нужно получить данные.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииИменТабличныхЧастей(МетаданныеОбъекта, ТабличныеЧасти, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка				 - Структура - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//  ИмяТабличнойЧасти	 - Строка	 - имя табличной части объекта.
//  РеквизитыТЧ			 - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                     псевдоним поля, а в качестве значения (опционально) фактическое имя поля в таблице.
//                                     Если значение не определено, то имя поля берется из ключа.
//  ПараметрыЗапроса	 - Структура - дополнительные параметры, будут переданы в исполняемый запрос.
//
Процедура ПриПодготовкеЗапросаПоТоварнойЧастиДокумента(Шапка, ИмяТабличнойЧасти, РеквизитыТЧ, ПараметрыЗапроса) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка			 - Структура		 - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей.
//
Процедура ПослеПолученияТоварнойЧастиДокумента(Шапка, ТабличнаяЧасть) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РасчетноеПредставлениеНомера()
//
// Параметры:
//  НомерОбъекта		 - Строка - номер или код объекта, который преобразуется для вывода на печать.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	НомерОбъекта = ПредставлениеНомера(НомерОбъекта);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяКолонкиКодТовара()
//
// Параметры:
//  ИмяКолонки			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов(ИмяКолонки, СтандартнаяОбработка = Истина) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВалютаРегламентированногоУчета()
//
Процедура ПриОпределенииВалютыРегламентированногоУчета(ВалютаРеглУчета, СтандартнаяОбработка = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыЮрФизЛица.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  ЮрФизЛицо			 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период				 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет		 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                         Если не передан, будут включены реквизиты основного банковского счета.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Буфер				 = ПолучитьСведенияОЮрФизЛице(ЮрФизЛицо, БанковскийСчет);
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Буфер);
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	

	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыДоговора.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  Шапка				 - Структура - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки).
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЭтапыГрафикаОплатПоДокументу.
//
// Параметры:
//  ЭтапыОплаты			 - ТаблицаЗначений	 - возвращаемые сведения;
//  Шапка				 - Структура		 - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки);
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииЭтаповГрафикаОплат(ЭтапыОплаты, Шапка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПредставлениеНоменклатуры.
//
// Параметры:
//  Представление			 - Строка - параметр, в который возвращается полученное представление номенклатуры;
//  Номенклатура			 - Строка, СправочникСсылка.Номенклатура				 - ссылка на номенклатуру;
//  Характеристика			 - Строка, СправочникСсылка.ХарактеристикиНоменклатуры	 - характеристика номенклатуры;
//  ДополнительныеПараметры	 - Неопределено, Структура								 - см. функцию Модуль_ИнтеграцияУниверсальный.ДополнительныеПараметрыПредставленияНоменклатуры;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииПредставленияНоменклатуры(Представление, Номенклатура, Характеристика, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Номенклатура) = Тип("Строка") Тогда 
		НоменклатураНаименование = Номенклатура;
	Иначе 
		РеквизитыНоменклатуры	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "НаименованиеПолное, Наименование");
		НоменклатураНаименование = ?(ЗначениеЗаполнено(РеквизитыНоменклатуры.НаименованиеПолное), РеквизитыНоменклатуры.НаименованиеПолное, РеквизитыНоменклатуры.Наименование);
	КонецЕсли;
	
	Представление = СокрЛП(НоменклатураНаименование);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыУчетаНоменклатуры.
//
// Параметры:
//  ПараметрыНоменклатуры	 - Структура - Коллекция параметров учета номенклатуры в текущей ИБ;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииПараметровУчетаНоменклатуры(ПараметрыНоменклатуры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ХранилищеКонтактнойИнформацииОбъекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации") Тогда
		ХранилищеКИ = СсылкаНаОбъект;
	Иначе
		ХранилищеКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ЮридическоеФизическоеЛицо");
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов;
//
Процедура ПриПолученииВидовИсходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураВыданный
		, ВидыЭД.СчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетНаОплату
		, ВидыЭД.СчетНаОплату
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.НакладнаяНаРеализациюТорг12
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.АктОбОказанииУслуг
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов;
//
Процедура ПриПолученииВидовВходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетНаОплатуОтПоставщика
		, ВидыЭД.СчетНаОплату
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеМЗ
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеОС
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеУслугРабот
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеУслугРабот
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);
	
КонецПроцедуры

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.СчетНаОплату");
							
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= "Счет";
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры //ПередФормированиемПечатнойФормыСчетаНаОплату()

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	    "ВЫБРАТЬ
		| СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
		| МАКСИМУМ(ВложенныйЗапрос.ЕстьСтавкиСНДС) КАК ЕстьСтавкиСНДС
		|ИЗ(
		|ВЫБРАТЬ
		|	СУММА(ТабличнаяЧастьДокумента.СуммаНДС) КАК СуммаНДС,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТабличнаяЧастьДокумента.СтавкаНДС <> &Ставка_БезНДС
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьСтавкиСНДС
		|ИЗ
		|	Документ.СчетНаОплату.Услуги КАК ТабличнаяЧастьДокумента
		|ГДЕ
		|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ТабличнаяЧастьДокумента.СуммаНДС),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТабличнаяЧастьДокумента.СтавкаНДС <> &Ставка_БезНДС
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ)
		|ИЗ
		|	Документ.СчетНаОплату.Материалы КАК ТабличнаяЧастьДокумента
		|ГДЕ
		|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ТабличнаяЧастьДокумента.СуммаНДС),
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТабличнаяЧастьДокумента.СтавкаНДС <> &Ставка_БезНДС
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ)
		|ИЗ
		|	Документ.СчетНаОплату.ОсновныеСредства КАК ТабличнаяЧастьДокумента
		|ГДЕ
		|	ТабличнаяЧастьДокумента.Ссылка = &Ссылка) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Ссылка", СчетНаОплату);
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Мета.СуммаНДС 		= Выборка.СуммаНДС;
		Мета.ДокументБезНДС = НЕ Выборка.ЕстьСтавкиСНДС;
					
	КонецЕсли;
	
	Мета.Сумма = СчетНаОплату.СуммаДокумента;
			
КонецПроцедуры // ПриЗаполненииМетыНеформализованногоСчетаНаОплату()

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПриПолученииВладельцаОбщихНастроекМодуля.
//
// Параметры:
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект, выступающий в качестве константы для хранения дополнительных свойств;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииВладельцаОбщихНастроекМодуля(СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	// остается значение по умолчанию
	
КонецПроцедуры


#Область СопоставлениеНоменклатуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СвойстваНоменклатурыИнформационнойБазы.
// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  НаборНоменклатуры - Массив из ОпределяемыйТип.НоменклатураБЭД - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. Модуль_ИнтеграцияУниверсальный.НовыеСвойстваНоменклатурыИБ.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(Знач НаборНоменклатуры, СвойстваНоменклатурИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЛОЖЬ КАК ИспользоватьХарактеристики,
	|	ЛОЖЬ КАК ИспользоватьУпаковки,
	|	ЛОЖЬ КАК ОбязательноеЗаполнениеХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&НаборНоменклатуры)";
	
	Запрос.УстановитьПараметр("НаборНоменклатуры", НаборНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваНоменклатуры = НовыеСвойстваНоменклатурыИБ();
		ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, Выборка);
		
		СвойстваНоменклатурИБ.Вставить(Выборка.Номенклатура, СвойстваНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняется при подборе недостающих данных о номенклатуре информационной базы по уже имеющимся,
// а также номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//
Процедура ПриПодбореНоменклатурыИнформационнойБазы(Знач НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	// Возможность заполнения данных об упаковках и характеристиках отсутствует
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Наименование = НоменклатураКонтрагента.Наименование;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК НоменклатураСсылка
		|ИЗ
		|	Справочник.Номенклатура КАК Т
		|ГДЕ
		|	Т.Наименование = &Наименование
		|	И НЕ Т.ЭтоГруппа
		|	И НЕ Т.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоменклатураИБ = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяНоменклатураИнформационнойБазы", ВыборкаДетальныеЗаписи.НоменклатураСсылка);
		Результат.Добавить(НоменклатураИБ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ЗаполнитьСоответствиеПолейВходящегоДокумента(ОбъектМетаданных, ИменаПолей) Экспорт
	
	ВидДокумента = ОбъектМетаданных.Имя;
	
	Если ВРег(ВидДокумента) = ВРег("СчетФактураПолученный") Тогда
		
		ИменаПолей.Номер = "НомерПервичногоДокумента";
		ИменаПолей.Дата	 = "ДатаПервичногоДокумента";
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет таблицу правил обработки входящих электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - правила обработки документов (см. ПравилаОбработкиВходящихДокументов);
//
// Пример:
//	Если ПолучитьФункциональнуюОпцию("ВедетсяПроизводственнаяДеятельность") Тогда
//		
//		ДобавитьПравилоОбработкиДокументов(ПравилоОбработки
//			, "ПоступлениеВПереработку" // Описание правила задается в процедуре ПриПолученииПравилаОбработкиЭлектронногоДокумента
//			, "ТоварнаяНакладная" 		// Используется для накладных
//			, Ложь); 					// Для исправлений не используется, только для первичных документов
//		
//	КонецЕсли;
//
Процедура ЗаполнитьПравилаОбработкиВходящихДокументов(ПравилаОбработки) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхДокументов = Ложь;
	ДляИсправительныхДокументов = Истина;
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Поступление материальных запасов
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеМЗ
		, ВидыЭД.ТоварнаяНакладная
		, ДляПервичныхИИсправительныхДокументов);
	
	// Поступление услуг, работ
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеУслугРабот
		, ВидыЭД.АктОбОказанииУслуг
		, ДляПервичныхИИсправительныхДокументов);
	
	// Поступление ОС, НМА, НПА
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеОС
		, ВидыЭД.ТоварнаяНакладная
		, ДляПервичныхИИсправительныхДокументов);
	
	// Счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, ДляПервичныхИИсправительныхДокументов);
	
	// Счет-фактура (корректировочный)
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировочныйСчетФактураПолученный
		, ВидыЭД.КорректировочныйСчетФактура
		, ДляПервичныхИИсправительныхДокументов);
		
	Если ИспользуетсяЭлектронныйАктСверкиВзаиморасчетов() Тогда
		
		// Акт сверки взаиморасчетов
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.АктСверкиВзаиморасчетов
			, ВидыЭД.АктСверки
			, ДляПервичныхИИсправительныхДокументов);
			
	КонецЕсли;
		
КонецПроцедуры

// Обработчик получения правила отражения электронного документа в учетной системе.
// Вызывается из Модуль_ИнтеграцияУниверсальный.ПравилоОбработкиЭлектронныхДокументов.
//
// Параметры:
//  ПравилоОбработки	 - Структура - описание способа обработки электронного документа (см. ПравилоОбработкиЭлектронныхДокументов);
//  СтандартнаяОбработка - Булево - Истина, если специальная обработка не требуется,
//                                  а идентификатор совпадает с именем метаданных документа;
//
// Пример:
//
//	Если ПравилоОбработки.Идентификатор = "ПоступлениеВПереработку" Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		ДополнительныеПараметры = Новый Структура;
//		ДополнительныеПараметры.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
//		
//		ПравилоОбработки.Представление = "Поступление материалов в переработку";
//		ПравилоОбработки.ОбъектМетаданных = Метаданные.Документы.ПоступлениеТоваровУслуг.ПолноеИмя();
//		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
//		
//	КонецЕсли;
//
Процедура ПриПолученииПравилаОбработкиЭлектронногоДокумента(ПравилоОбработки, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.НовыйДокументИнформационнойБазы.
//
// Параметры:
//  ДокументОбъект		 - ДокументОбъект	 - новый, еще не записанный, документ-объект;
//  ДанныеЭД			 - Структура		 - содержит данные электронного документа
//                                             (см. Модуль_ИнтеграцияУниверсальный.ДанныеЭлектронногоДокумента);
//  ПараметрыЗаполнения	 - Структура		 - содержит дополнительные параметры заполнения;
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриСозданииДокументаИнформационнойБазы(ДокументОбъект, ДанныеЭД, ПараметрыЗаполнения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если МетаданныеДокумента = Метаданные.Документы.ПоступлениеМЗ Тогда
		
		СтруктураЗаполнения = СтруктураЭлектронногоДокументаПоставщика(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеМЗ(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ПоступлениеУслугРабот Тогда
		
		СтруктураЗаполнения = СтруктураЭлектронногоДокументаПоставщика(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеУслугРабот(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ПоступлениеОС Тогда
		
		СтруктураЗаполнения = СтруктураЭлектронногоДокументаПоставщика(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеОС(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.СчетФактураПолученный Тогда
		
		СтандартнаяОбработка = Ложь;
		СтруктураЗаполнения = СтруктураЗаполненияСчетаФактурыПолученного(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьСчетФактуруПолученный(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.АктСверкиВзаиморасчетов Тогда
		
		СтандартнаяОбработка = Ложь;
		СтруктураЗаполнения = СтруктураЗаполненияАктаСверкиВзаиморасчетов(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьАктСверкиВзаиморасчетов(ДокументОбъект, СтруктураЗаполнения);
		
	Иначе
		
		// Специальная обработка заполнения не реализована
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяСправочникаВладельцаНоменклатуры.
//
// Параметры:
//  ИмяСправочника		 - Строка - имя справочника, которому подчинен справочник "НоменклатураПоставщиков";
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииИмениСправочникаВладельцаНоменклатуры(ИмяСправочника, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.МетаданныеПрикладногоСправочника.
//
// Параметры:
//  СоответствиеСправочников	- Соответствие	 - ключом является имя справочника в терминах сервиса, а значением - метаданные прикладного справочника;
//  СтандартнаяОбработка 		- Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСоответствияСправочников(СоответствиеСправочников, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СоответствиеСправочников.Вставить("Валюты"			, Метаданные.Справочники.Валюты);
	СоответствиеСправочников.Вставить("СтраныМира"		, Метаданные.Справочники.СтраныМира);
	
	СоответствиеСправочников.Вставить("Организации"				, Метаданные.Справочники.Организации);
	СоответствиеСправочников.Вставить("Контрагенты"				, Метаданные.Справочники.Контрагенты);
	СоответствиеСправочников.Вставить("Партнеры"				, Неопределено);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СсылкаОбъектаПоПолямПоиска.
//
// Параметры:
//  СсылкаНаОбъект		 - Произвольный - ссылка на искомый объект;
//  ПоляПоиска			 - Структура - содержит параметры поиска;
//  ОбъектМетаданных	 - ОбъектМетаданных - метаданные искомого объекта;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//
//  НаименованиеПолное = Неопределено;
//  Если ПоляПоиска.Свойство("НаименованиеПолное", НаименованиеПолное) 
//      И Не ЕстьРеквизитМетаданных(ОбъектМетаданных, "НаименованиеПолное") 
//      И ЕстьРеквизитМетаданных(ОбъектМетаданных, "ПолноеНаименование") Тогда
//          
//          ПоляПоиска.Удалить("НаименованиеПолное");
//          ПоляПоиска.Вставить("ПолноеНаименование", НаименованиеПолное);
//          
//  КонецЕсли;
//
Процедура ПриПолученииСсылкиПоПолямПоиска(СсылкаНаОбъект, ПоляПоиска, ОбъектМетаданных, СтандартнаяОбработка) Экспорт
	
	НаименованиеПолное = Неопределено;
	Если ПоляПоиска.Свойство("НаименованиеПолное", НаименованиеПолное) 
		И Не ЕстьРеквизитМетаданных(ОбъектМетаданных, "НаименованиеПолное") 
		И ЕстьРеквизитМетаданных(ОбъектМетаданных, "НаименованиеСокращенное") Тогда
		
		ПоляПоиска.Удалить("НаименованиеПолное");
		ПоляПоиска.Вставить("НаименованиеСокращенное", НаименованиеПолное);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СчетаФактурыПоОснованию.
//
// Параметры:
//  НайденныеДокументы	 - Массив	 - Ссылки на найденные счета-фактуры;
//  ПараметрыРегистрации - Структура - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСчетовФактурПоОснованию(НайденныеДокументы, ПараметрыРегистрации, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СчетФактура = УчетНДС.НайтиПодчиненныйСчетФактуру(ПараметрыРегистрации.Ссылка, "СчетФактураПолученный");
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда 
		НайденныеДокументы.Добавить(СчетФактура);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактурыПоОснованию.
//
// Параметры:
//  ПараметрыРегистрации - Структура	 - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  ДокументОснование	 - ЛюбаяСсылка	 - документ, на основании которого необходимо получить параметры;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПодготовкеПараметровРегистрацииСчетаФактуры(ПараметрыРегистрации, ДокументОснование, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СборПротоконтента

Процедура ЗаполнитьКонтентXmlUTD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ФункцияУПД = ПараметрыФормирования.ФункцияДокумента;
	
	ДанныеДляПечати = ПолучитьДанныеДляФормированияУПД(ДокСсылка, ФункцияУПД);
	ДанныеШапки     = ДанныеДляПечати.ДанныеШапки;
	ТаблицаТоваров  = ДанныеДляПечати.ТаблицаТоваров;
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеШапки.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number = ДатаНомер.НомерДокумента;
	Content.Date = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber = ДатаНомер.НомерИсправления;
		Content.RevisionDate = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("СчетФактураСсылка") Тогда
		content.СчетФактураСсылка = ДанныеШапки.СчетФактураСсылка;
	КонецЕсли;
	
	БанковскийСчетПокупателя = СвойствоСтруктуры(ДанныеШапки, "БанковскийСчетКонтрагента");
	Заполнить_ExtendedOrganizationInfo(Content.Buyer, ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента, Истина, БанковскийСчетПокупателя);
	Если ПараметрыФормирования.Свойство("Получатель_FnsParticipantId") Тогда
		Content.Buyer.FnsParticipantId = ПараметрыФормирования.Получатель_FnsParticipantId;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ДанныеШапки.КонтрагентКПП;
	КонецЕсли;
	
	КППГрузоотправителя = "";
	
	Если ДанныеШапки.ЕстьТовары Тогда
	
		КППГрузоотправителя = ДанныеШапки.ГрузоотправительКПП;
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда 
			Заполнить_ExtendedOrganizationInfo(Content.Shipper.OrganizationInfo, ДанныеШапки.Грузоотправитель, ДатаНомер.ДатаДокумента, Ложь); 
			Content.Shipper.SameAsSeller = Ложь;
		Иначе 
			Content.Shipper.SameAsSeller = Истина;
		КонецЕсли;
		
		Грузополучатель = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
		Заполнить_ExtendedOrganizationInfo(Content.Consignee, Грузополучатель, ДатаНомер.ДатаДокумента, Ложь, , , ДанныеШапки.АдресДоставки);
		
	КонецЕсли;
	
	Заполнить_ExtendedOrganizationInfo(Content.Seller, ДанныеШапки.Организация, ДатаНомер.ДатаДокумента, Истина, ДанныеШапки.БанковскийСчетОрганизации, КППГрузоотправителя);
	
	Если ПараметрыФормирования.Свойство("Отправитель_FnsParticipantId") Тогда
		Content.Seller.FnsParticipantId = ПараметрыФормирования.Отправитель_FnsParticipantId;
	КонецЕсли;
					
	Content.Creator = Content.seller.name + ", ИНН/КПП " + МетодСервера(, "ПредставлениеИННКПП", Content.seller);
	Content.Function = ДанныеШапки.Функция;
	
	Если ДанныеШапки.Свойство("ДатаНомерДокументовОплаты") Тогда
		СтруктураPaymentDocuments= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_PaymentDocument");
		Для Каждого ПРД Из ДанныеШапки.ДатаНомерДокументовОплаты Цикл
			ЗаполненнаяСтруктураPaymentDocuments = СкопироватьСтруктуру(СтруктураPaymentDocuments);
			ЗаполненнаяСтруктураPaymentDocuments.Number = ПРД.НомерПлатежноРасчетногоДокумента;
			ЗаполненнаяСтруктураPaymentDocuments.Date = ПРД.ДатаПлатежноРасчетногоДокумента;
			content.PaymentDocuments.Добавить(ЗаполненнаяСтруктураPaymentDocuments);
		КонецЦикла;	
	КонецЕсли;
	
	Content.currency = ?(ЗначениеЗаполнено(ДанныеШапки.ВалютаДокумента), Строка(ДанныеШапки.ВалютаДокументаКод), "");
	Content.ВалютаСсылка = ДанныеШапки.ВалютаДокумента;
	
	ДанныеШапки.Свойство("ИдентификаторГосконтракта", Content.GovernmentContractInfo);
	
	МетодСервера(,"ЗаполнитьStructedAdditionalInfos", Content.AdditionalInfoId.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	СтруктураItems = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ExtendedInvoiceItem");
	СтруктураГТД = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CustomDeclaration");
	
	TotalNet = 0;
	Total 	 = 0;
	Vat 	 = 0;
	TotalWithVatExcluded = 0;
	
	СФНаАванс = ДанныеШапки.Свойство("СФНаАванс") И ДанныеШапки.СФНаАванс;
	ЕстьСтрокаСНДС = Ложь;
	
	Для каждого СтрокаТаблицы из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItems);
		
		Item.Product 	 = СтрокаТаблицы.НоменклатураПредставление;
		Item.VendorCode = СтрокаТаблицы.КодНоменклатуры;
		Item.ItemMark   = СтрокаТаблицы.ПризнакТоварРаботаУслуга;
		
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		
		Item.Subtotal 	 = СтрокаТаблицы.СуммаСНДС;
		Если Не СФНаАванс Тогда
			Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		КонецЕсли;
		
		Если Не МенеджерИнтеграции_ЭтоСтавкаБезНДС(СтрокаТаблицы.СтавкаНДС) Тогда
			Item.Vat = СтрокаТаблицы.СуммаНДС;
			ЕстьСтрокаСНДС = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			Item.Quantity 	 = ?(СФНаАванс И СтрокаТаблицы.Количество = 0, Неопределено, СтрокаТаблицы.Количество);	//для отображения прочерка в вэбе
			Item.Price 	 = Окр(СтрокаТаблицы.Цена, Точность);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
				
				Item.UnitCode = МетодСервера(, "XML_КодЕдиницыИзмерения", СокрЛП(СтрокаТаблицы.КодЕдиницыИзмерения));
				Item.UnitName = Строка(СтрокаТаблицы.ЕдиницаИзмерения);
				Item.ЕдиницаИзмеренияССылка = СтрокаТаблицы.ЕдиницаИзмерения;
				
			КонецЕсли;
			
		КонецЕсли;
		
		TotalNet = TotalNet + ?(ЗначениеЗаполнено(СтрокаТаблицы.Количество), СтрокаТаблицы.Количество, 0);
		Total 	 = Total 	+ Item.Subtotal;
		Vat 	 = Vat 		+ СтрокаТаблицы.СуммаНДС;
		Если Не СФНаАванс Тогда
			TotalWithVatExcluded = TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхождения) Или ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД) И Не ПустаяСтрока(СтрокаТаблицы.НомерГТД.Код) Тогда
			ЗаполненнаяСтруктураГТД = СкопироватьСтруктуру(СтруктураГТД);
			ЗаполненнаяСтруктураГТД.CountryCode       = СтрокаТаблицы.СтранаПроисхождения.Код;
			ЗаполненнаяСтруктураГТД.DeclarationNumber = ?(ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ?(ТипЗнч(СтрокаТаблицы.НомерГТД) = Тип("Строка"), СокрЛП(СтрокаТаблицы.НомерГТД), СокрЛП(СтрокаТаблицы.НомерГТД.Код)), "");
			Если Не (Не ЗначениеЗаполнено(строкаТаблицы.НомерГТД) И МетодСервера(, "СтранаЧленТС", строкаТаблицы.СтранаПроисхождения.Код)) Тогда
				ЗаполненнаяСтруктураГТД.СтранаПроисхожденияСсылка = СтрокаТаблицы.СтранаПроисхождения;
			Иначе
				ЗаполненнаяСтруктураГТД.СтранаПроисхожденияСсылка = Справочники.СтраныМира.ПустаяСсылка();
			КонецЕсли;
			Item.CustomDeclarations.Добавить(ЗаполненнаяСтруктураГТД);
		КонецЕсли;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.InvoiceTable.items.добавить(Item);
		
	КонецЦикла;
	content.InvoiceTable.TotalNet = TotalNet;
	content.InvoiceTable.Total 	  = Total;
	content.InvoiceTable.Vat 	  = ?(ЕстьСтрокаСНДС, Vat, Неопределено);
	Если Не СФНаАванс Тогда
		content.InvoiceTable.TotalWithVatExcluded = TotalWithVatExcluded;
	КонецЕсли;
	
	content.TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	//TransferDate заполняем только если дата отгрузки не совпадает с датой счета-фактуры.
	Если ДанныеШапки.Свойство("ДатаОтгрузки") И НачалоДня(ДанныеШапки.ДатаОтгрузки) <> НачалоДня(ДатаНомер.ДатаДокумента) Тогда
		content.TransferInfo.TransferDate = ДанныеШапки.ДатаОтгрузки;
	КонецЕсли;
	
	ЗаполнитьСведенияОПередаче(Content, ДокСсылка, ФункцияУПД, ПараметрыФормирования);
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗаполнитьСведенияОЛицеПередавшемТовар"
		, Content
		, ДанныеШапки
		, ПараметрыФормирования);

	Если ДанныеШапки.Функция = "InvoiceAndBasic" Тогда
		content.Name = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ИначеЕсли ДанныеШапки.Функция = "Basic" Тогда
		content.Name = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	КонецЕсли;
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	ДобавитьДокументыОснованияВСлужебнуюИнформацию(Content);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlUCD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	// Для БГУ не реализовано
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlTorg12(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров	 = ПолучитьДанныеТЧ(ДокСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	Content.Number = ДатаНомер.НомерДокумента;
	Content.Date = ДатаНомер.ДатаДокумента;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеШапки.Организация, ДатаНомер.ДатаДокумента, ДанныеШапки.БанковскийСчетОрганизации, Истина);
	
	Грузоотправитель = ?(Не ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель), ДанныеШапки.Организация, ДанныеШапки.Грузоотправитель);
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Shipper, Грузоотправитель, ДатаНомер.ДатаДокумента, , Ложь);
	
	Content.ShipperDepartment = ПолучитьПодразделениеИзДокумента(ДокСсылка);
	
	Грузополучатель = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Consignee, Грузополучатель, ДатаНомер.ДатаДокумента, , Ложь, , , ДанныеШапки.АдресДоставки);
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента, , Истина);
	
	НомерЗаказа = ПараметрыФормирования.НомерЗаказа;
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда 
		Content.GroundName =	"Заказ";
		Content.GroundNumber =	СокрЛП(НомерЗаказа);
	Иначе	
		СтруктураДоговора =		СтруктурированноеПредставлениеОснования(ДокСсылка);
		Content.GroundName =		СтруктураДоговора.GroundName;
		Content.GroundDate =		СтруктураДоговора.GroundDate;
		Content.GroundNumber =	СтруктураДоговора.GroundNumber;
	КонецЕсли;
	
	ДопСведения = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ИдКонтрагента = МетодСервера(,"Контрагент_2_CounteragentBoxID", ДанныеШапки.Контрагент);
	Если МетодСервера(,"НужноФормироватьДопИнфоПоШаблону", ИдКонтрагента) = Истина Тогда
		content.AdditionalInfo = МетодСервера(,"СформироватьСтрокуДопИнфоПоШаблону", ДопСведения);
	Иначе
		content.AdditionalInfo = ДопСведения;
	КонецЕсли;
	
	TotalParcelsQuantity 	= 0;
	TotalGrossQuantity 		= 0;
	TotalMassQuantity		= 0;
	TotalWithVatExcluded 	= 0;
	Total 					= 0;
	Vat 					= 0;
	
	СтруктураItems=	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_Torg12Item");
	ЕстьСтрокиСНДС = Ложь;
	
	Для каждого СтрокаТаблицы из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItems);
		
		Item.Product =		СтрокаТаблицы.НоменклатураПредставление;
		Item.ProductCode =	СтрокаТаблицы.КодНоменклатуры;
		Item.UnitCode = 		МетодСервера(, "Item_UnitCode", СтрокаТаблицы.ЕдиницаИзмерения, СокрЛП(СтрокаТаблицы.КодЕдиницыИзмерения));
		Item.UnitName =		Строка(СтрокаТаблицы.ЕдиницаИзмерения);
		Item.Quantity =		СтрокаТаблицы.Количество;
		Item.TaxRate =		ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		
		Если Не МенеджерИнтеграции_ЭтоСтавкаБезНДС(Item.TaxRate) Тогда
			ЕстьСтрокиСНДС = Истина;	
		КонецЕсли;
		
		Item.Vat=			СтрокаТаблицы.СуммаНДС;
		Item.Total = СтрокаТаблицы.СуммаСНДС;
		Item.TotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		Item.Price = Окр(СтрокаТаблицы.Цена, 2);
		
		Item.СсылкаНаЕИ= 	СтрокаТаблицы.ЕдиницаИзмерения;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.КоличествоМест) Тогда
			Item.ParcelsQuantity =	СтрокаТаблицы.КоличествоМест;
			Item.ParcelCapacity =	СтрокаТаблицы.КоличествоВОдномМесте;
			Item.ParcelType =		?(ЗначениеЗаполнено(СтрокаТаблицы.ВидУпаковки), СтрокаТаблицы.ВидУпаковки.Наименование, "");
			Item.GrossQuantity =		СтрокаТаблицы.Масса;
			TotalGrossQuantity = 	TotalGrossQuantity + ?(ЗначениеЗаполнено(Item.GrossQuantity), Item.GrossQuantity, 0);
			TotalParcelsQuantity =	TotalParcelsQuantity + Item.ParcelsQuantity;
		КонецЕсли;	
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.items.Добавить(Item);
		
		TotalMassQuantity = 		TotalMassQuantity + Item.Quantity;
		TotalWithVatExcluded =	TotalWithVatExcluded + Item.TotalWithVatExcluded;
		Total = 					Total + Item.Total;
		Vat = 					Vat + Item.Vat;
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Item.TaxRate) Тогда
			Item.Vat = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Content.Totals.ParcelsQuantity 		= TotalParcelsQuantity;
	Content.Totals.GrossQuantity 		= TotalGrossQuantity;
	Content.Totals.Quantity 			= TotalMassQuantity;
	Content.Totals.TotalWithVatExcluded = TotalWithVatExcluded;
	Content.Totals.Total 				= Total;
	Content.Totals.Vat 					= ?(ЕстьСтрокиСНДС, Vat, Неопределено);
	
	Content.SupplyDate 					= Content.Date; 
	
	Content.commons.TotalSumInWords = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДанныеШапки.СуммаДокумента, ДанныеШапки.ВалютаДокумента);
	Если ЗначениеЗаполнено(TotalParcelsQuantity) Тогда
		Content.commons.TotalParcelsQuantityInWords
			= СтрЗаменить(ЧислоПрописью(TotalParcelsQuantity, "ДП = Ложь"), "  00", "");
	КонецЕсли;	
	
	ФИОСогласователя = "";
	
	ДолжностьСогласователя = "";
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОСогласователя 		= ПараметрыОтправкиНаСогласование.ФИОПодписанта;
			ДолжностьСогласователя 	= ПараметрыОтправкиНаСогласование.ДолжностьПодписанта;
		Иначе
			Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПолучателя) Тогда 
				ФИОСогласователя 	= ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			КонецЕсли;
			ДолжностьСогласователя 	= ПараметрыОтправкиНаСогласование.ДолжностьПолучателя;
		КонецЕсли;
	КонецЕсли;	
					
	Если ФИОСогласователя = ""  Тогда
		ПараметрыПодписания = МетодСервера(,"ПолучитьПараметрыПодписанияТ12вДиадок", ДанныеШапки.Организация);
		
		Если ПараметрыПодписания.СпособПодписания = "4" Тогда
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyPerformedBy,	МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyAllowedBy, 	МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
			
			ПараметрыПодписания.ДолжностьПодписанта = "Главный (старший) бухгалтер";
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.ChiefAccountant,	МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
		ИначеЕсли параметрыПодписания.СпособПодписания = "2" Тогда 
			ПараметрыПодписания.ДолжностьПодписанта = "Главный (старший) бухгалтер";
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.ChiefAccountant,  МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
		ИначеЕсли параметрыПодписания.СпособПодписания = "3" Тогда
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyPerformedBy,  МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
		Иначе	
			МетодСервера(,"ЗаполнитьПодписантаДляXmlTorg12", Content.SupplyAllowedBy,  МетодСервера(,"ПредставлениеВизирующегоСтруктурой", ПараметрыПодписания));
		КонецЕсли;
		
	Иначе 
		МетодСервера(,"ЗаполнитьФИОПодписанта", Content.SupplyAllowedBy, ФИОСогласователя);
		Content.SupplyAllowedBy.JobTitle = СокрЛП(?(НЕ ПустаяСтрока(ДолжностьСогласователя), ДолжностьСогласователя, "_"));
	КонецЕсли;
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlAcceptanceCertificate(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров	 = ПолучитьДанныеТЧ(ДокСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	Content.Number = ДатаНомер.НомерДокумента;
	Content.Date = ДатаНомер.ДатаДокумента;
	
	//поставщик: организация-продавец
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеШапки.Организация, ДатаНомер.ДатаДокумента, ДанныеШапки.БанковскийСчетОрганизации, Истина);
	
	ПредставлениеИсполнителя = СформироватьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Организация, ДатаНомер.ДатаДокумента);
	ПредставлениеЗаказчика   = СформироватьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента);
	
	СтруктураДоговора = СтруктурированноеПредставлениеОснования(ДокСсылка);
	
	НомерДоговора = ?(СтруктураДоговора.GroundNumber = "", "", " по договору № " + СтруктураДоговора.GroundNumber);
	ДатаДоговора = ?(СтруктураДоговора.GroundDate = Дата(1, 1, 1), "", " от " + Формат(СтруктураДоговора.GroundDate, "ДФ=dd.MM.yyyy"));
	ДатаДоговора = ?((СтруктураДоговора.GroundNumber = "" и СтруктураДоговора.GroundDate <> Дата(1, 1, 1)), " по договору " + ДатаДоговора, ДатаДоговора);
	
	текстАкта = "Мы, нижеподписавшиеся, представитель " + ПредставлениеИсполнителя + " (далее «Исполнитель»), с одной стороны, и представитель " + ПредставлениеЗаказчика + " (далее «Заказчик»), с другой стороны," +
	" составили настоящий акт о том, что «Исполнитель» выполнил, а  «Заказчик» принял следующие работы (услуги)" + НомерДоговора + ДатаДоговора + ":";
	
	content.Title  = текстАкта;
	
	ДопСведения = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ИдКонтрагента = МетодСервера(, "Контрагент_2_CounteragentBoxID", ДанныеШапки.Контрагент);
	Если МетодСервера(,"НужноФормироватьДопИнфоПоШаблону", ИдКонтрагента) = Истина Тогда
		content.AdditionalInfo = МетодСервера(, "СформироватьСтрокуДопИнфоПоШаблону", ДопСведения);
	Иначе
		content.AdditionalInfo = ДопСведения;
	КонецЕсли;
	
	content.SignatureDate=	content.Date;
	
	СтруктураItems= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AcceptanceCertificateItem");
	
	Для каждого СтрокаТаблицы из ТаблицаТоваров Цикл 
		
		Item= СкопироватьСтруктуру(СтруктураItems);
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) = Ложь
			ИЛИ ЗначениеЗаполнено(СтрокаТаблицы.КодЕдиницыИзмерения) = Ложь Тогда
			Item.Description= СтрокаТаблицы.НоменклатураПредставление;
		Иначе
			Item.Name= СтрокаТаблицы.НоменклатураПредставление;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			Item.UnitCode= МетодСервера(, "Item_UnitCode", СтрокаТаблицы.ЕдиницаИзмерения, СокрЛП(СтрокаТаблицы.КодЕдиницыИзмерения));
			Если Item.UnitCode = "" И ЗначениеЗаполнено(Item.Name) Тогда
				Item.Description= 	Item.Name;
				Item.Name= 			Неопределено;
			КонецЕсли;
		Иначе
			Item.UnitCode= "";
		КонецЕсли;
							
		Item.UnitName = Строка(СтрокаТаблицы.ЕдиницаИзмерения);
		Если ЗначениеЗаполнено(Item.Name) Тогда
			Item.Quantity = СтрокаТаблицы.Количество;
		КонецЕсли;
		Item.Vat=			СтрокаТаблицы.СуммаНДС;
		Item.Total = СтрокаТаблицы.СуммаСНДС;
		Item.TotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		Item.Price = Окр(СтрокаТаблицы.Цена, 2);
		Item.СсылкаНаЕИ= 	СтрокаТаблицы.ЕдиницаИзмерения;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.items.Добавить(Item);
		
	КонецЦикла;
	
	ПараметрыПодписания = МетодСервера(,"ПолучитьПараметрыПодписанияТ12вДиадок", ДанныеШапки.Организация);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ПараметрыПодписания.ФИОПодписанта 		= ПараметрыОтправкиНаСогласование.ФИОПодписанта;
			ПараметрыПодписания.ДолжностьПодписанта = ПараметрыОтправкиНаСогласование.ДолжностьПодписанта;
		Иначе
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			ПараметрыПодписания.ФИОПодписанта 		= ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			ПараметрыПодписания.ДолжностьПодписанта = ПараметрыОтправкиНаСогласование.ДолжностьПолучателя;
		КонецЕсли;
	КонецЕсли;
	
	МетодСервера(, "ЗаполнитьПодписантаДляXmlTorg12", content.Official, МетодСервера(, "ПредставлениеВизирующегоСтруктурой", параметрыПодписания));
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoice(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ДанныеДляПечати = СформироватьДанныеДляПечати(ДокСсылка, Ложь);
	
	ДатаНомер = ДанныеДляПечати.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеДляПечати.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number = ДатаНомер.НомерДокумента;
	Content.Date = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.InvoiceRevisionNumber = ДатаНомер.НомерИсправления;
		Content.InvoiceRevisionDate = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	СтруктураPaymentDocuments =	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_PaymentDocument");
	
	Для Каждого ПРД Из ДанныеДляПечати.ДатаНомерДокументовОплаты Цикл
		
		PaymentDocumentContent = СкопироватьСтруктуру(СтруктураPaymentDocuments);
		
		PaymentDocumentContent.Number = ПРД.НомерПлатежноРасчетногоДокумента;
		PaymentDocumentContent.date   = ПРД.ДатаПлатежноРасчетногоДокумента;
		
		Content.PaymentDocuments.Добавить(PaymentDocumentContent);
		
	КонецЦикла;
	
	Content.currency = ?(ЗначениеЗаполнено(ДанныеДляПечати.ВалютаДокумента), Строка(ДанныеДляПечати.ВалютаДокументаКод), "");
	Content.ВалютаСсылка = ДанныеДляПечати.ВалютаДокумента;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент, ДатаНомер.ДатаДокумента, , Истина, Истина);
	
	Если ЗначениеЗаполнено(ДанныеДляПечати.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ДанныеДляПечати.КонтрагентКПП;
	КонецЕсли;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеДляПечати.Организация, ДатаНомер.ДатаДокумента, , Истина, Истина, ДанныеДляПечати.ГрузоотправительКПП);
	
	Если ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель) Тогда  
		ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(Content.Shipper, ДанныеДляПечати.Грузоотправитель, ДатаНомер.ДатаДокумента);
		Content.Shipper.SameAsSellerOrBuyer = Ложь;
	Иначе 
		Content.Shipper.SameAsSellerOrBuyer = Истина;
	КонецЕсли;
	
	Грузополучатель = ?(ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель), ДанныеДляПечати.Грузополучатель, ДанныеДляПечати.Контрагент);
	ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(Content.Consignee, Грузополучатель, ДатаНомер.ДатаДокумента, ДанныеДляПечати.АдресДоставки);
	Content.Consignee.SameAsSellerOrBuyer = Ложь;
	
	МетодСервера(,"ЗаполнитьStructedAdditionalInfos", Content.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);

	СтруктураItemInvoice=	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItem");

	Vat= 0;
	TotalWithVatExcluded= 0;
	Total= 0;
	Для каждого Стр из ДанныеДляПечати.ТабличнаяЧасть Цикл
		
		Item= СкопироватьСтруктуру(СтруктураItemInvoice);
		
		Item.Product=	Стр.НоменклатураПредставление;
		
		Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Item.UnitCode= МетодСервера(, "Item_UnitCode", Стр.ЕдиницаИзмерения, СокрЛП(Стр.КодЕдиницыИзмерения));
		Иначе
			Item.UnitCode= "";
		КонецЕсли;
							
		Item.ЕдиницаИзмеренияСсылка= Стр.ЕдиницаИзмерения;
		Item.Quantity= 	?(ЗначениеЗаполнено(Стр.ЕдиницаИзмерения), Стр.Количество, 0);
		Если Не СчетФактуранаАванс(ДокСсылка) Тогда
			Item.TotalWithVatExcluded= Стр.СуммаБезНДС;
			Item.price= Строка(Окр(Стр.Цена, Точность));
		КонецЕсли;
		
		Если Не МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДС) Тогда
			Item.Vat = Стр.СуммаНДС;
		КонецЕсли;
		
		Item.Total = Стр.СуммаСНДС;
		Item.TaxRate = ПредставлениеСтавкиНДС(Стр.СтавкаНДС);
		Item.CountriesOfOrigin= 		?(ЗначениеЗаполнено(Стр.СтранаПроисхождения), Стр.СтранаПроисхождения.Код, "");
		Item.СтранаПроисхожденияСсылка= ?(ЗначениеЗаполнено(Стр.СтранаПроисхождения), Стр.СтранаПроисхождения, Справочники.СтраныМира.ПустаяСсылка());
		Item.CustomsDeclarationNumbers= ?(ЗначениеЗаполнено(Стр.НомерГТД), ?(ТипЗнч(Стр.НомерГТД) = Тип("Строка"), СокрЛП(Стр.НомерГТД), СокрЛП(Стр.НомерГТД.Код)), "");
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, Стр);
		
		Content.items.Добавить(Item);
		
		Vat=					Vat 					+ Стр.СуммаНДС;
		TotalWithVatExcluded= 	TotalWithVatExcluded	+ Item.TotalWithVatExcluded;
		Total= 					Total 					+ Item.Total;
	КонецЦикла;	
	
	Content.Totals.Vat 					= Vat;
	Content.Totals.TotalWithVatExcluded = TotalWithVatExcluded;
	Content.Totals.Total 				= Total;
	
	стПодписант = МетодСервера(, "СформироватьПараметрыПодписанта", ПараметрыФормирования.ФИОПодписанта);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПодписанта;
		Иначе	
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПолучателя;
		КонецЕсли;
		
		ПодписантФамилия=				ВыделитьСлово(ФИОПолучателя);
		ПодписантИмя= 					ВыделитьСлово(ФИОПолучателя);
		ПодписантОтчество= 				ВыделитьСлово(ФИОПолучателя);
		
		стПодписант.ПодписантФамилия=	?(НЕ ПустаяСтрока(ПодписантФамилия), ПодписантФамилия, " ");
		стПодписант.ПодписантИмя= 		?(НЕ ПустаяСтрока(ПодписантИмя), ПодписантИмя, " ");
		стПодписант.ПодписантОтчество= 	?(НЕ ПустаяСтрока(ПодписантОтчество), ПодписантОтчество, "");
		
	КонецЕсли;
					
	Content.Signer.Surname 		= стПодписант.ПодписантФамилия;
	Content.Signer.FirstName 	= стПодписант.ПодписантИмя;
	Content.Signer.Patronymic 	= стПодписант.ПодписантОтчество;
	Content.Signer.Inn 			= Content.seller.inn;
	Content.Signer.IsSoleProprietor	= Content.seller.IsSoleProprietor;
	Content.Signer.SoleProprietorRegistrationCertificate = ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляПечати.Организация);
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеДляПечати);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoiceCorrection(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ДанныеДляПечати 	= СформироватьДанныеДляПечати(ДокСсылка, Истина);
	
	ДатаНомер = ДанныеДляПечати.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеДляПечати.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.InvoiceCorrectionNumber = ДатаНомер.НомерДокумента;
	Content.InvoiceCorrectionDate = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber = ДатаНомер.НомерИсправления;
		Content.RevisionDate = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	ДанныеОснований = ДатаНомер.ДатаНомерДокументовОснований;
	
	Если ЗначениеЗаполнено(ДанныеОснований) Тогда
		
		ДанныеОснования = ДанныеОснований[0];
		
		OriginalInvoices = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_OriginalInvoice");
		OriginalInvoices.Number	 = ДанныеОснования.НомерИсходногоДокумента;
		OriginalInvoices.Date	 = ДанныеОснования.ДатаИсходногоДокумента;
		
		Если ДанныеОснования.УчитыватьИсправлениеИсходногоДокумента Тогда
			OriginalInvoices.InvoiceRevisionNumber	 = ДанныеОснования.НомерИсправленияИсходногоДокумента;
			OriginalInvoices.InvoiceRevisionDate	 = ДанныеОснования.ДатаИсправленияИсходногоДокумента;
		КонецЕсли;
		
		Content.OriginalInvoices.Добавить(OriginalInvoices);
	
	КонецЕсли;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент, ДатаНомер.ДатаДокумента, , Истина, Истина);
	
	Если ЗначениеЗаполнено(ДанныеДляПечати.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ДанныеДляПечати.КонтрагентКПП;
	КонецЕсли;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller,  ДанныеДляПечати.Организация, ДатаНомер.ДатаДокумента, , Истина, Истина, ДанныеДляПечати.ГрузоотправительКПП);
	
	content.currency = ?(ЗначениеЗаполнено(ДанныеДляПечати.ВалютаДокумента), Строка(ДанныеДляПечати.ВалютаДокументаКод), "");
	content.ВалютаСсылка = ДанныеДляПечати.ВалютаДокумента;
	
	МетодСервера(, "ЗаполнитьStructedAdditionalInfos", Content.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);

	СтруктураItemInvoiceCorrection= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceCorrectionItem");

	Для Каждого СтрокаДанных Из ДанныеДляпечати.ТабличнаяЧасть Цикл 
		
		Item= СкопироватьСтруктуру(СтруктураItemInvoiceCorrection);
		Item.AmountsDec= 		МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.AmountsInc= 		МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.OriginalValues= 	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		Item.CorrectedValues= 	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		
		Item.Product	= СтрокаДанных.НоменклатураПредставление;
		Item.VendorCode = СтрокаДанных.КодНоменклатуры;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения) Тогда
			Item.OriginalValues.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаДанных.ЕдиницаИзмеренияДоИзменения, СокрЛП(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Код));
		Иначе
			Item.OriginalValues.UnitCode = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
			Item.CorrectedValues.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаДанных.ЕдиницаИзмерения, СокрЛП(СтрокаДанных.ЕдиницаИзмерения.Код));
		Иначе
			Item.CorrectedValues.UnitCode = "";	
		КонецЕсли;
							
		Item.OriginalValues.ЕдиницаИзмеренияСсылка = 	СтрокаДанных.ЕдиницаИзмеренияДоИзменения;
		Item.CorrectedValues.ЕдиницаИзмеренияСсылка = 	СтрокаДанных.ЕдиницаИзмерения;
		
		Item.OriginalValues.Quantity = 	СтрокаДанных.КоличествоДоИзменения;
		Item.CorrectedValues.Quantity = 	СтрокаДанных.Количество;
		
		Item.OriginalValues.TotalWithVatExcluded =	СтрокаДанных.СуммаДоИзменения - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДСДоИзменения, 0);
		Item.CorrectedValues.TotalWithVatExcluded =	СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДС, 0);
		
		Item.OriginalValues.Price =		Строка(?(Item.OriginalValues.Quantity = 0, 0, Окр(Item.OriginalValues.TotalWithVatExcluded / Item.OriginalValues.Quantity, Точность)));
		Item.CorrectedValues.Price =  	Строка(?(Item.CorrectedValues.Quantity = 0, 0, Окр(Item.CorrectedValues.TotalWithVatExcluded / Item.CorrectedValues.Quantity, Точность)));
		
		СтавкаНДСДоИзменения = СтрокаДанных.СтавкаНДСДоИзменения;
		Если Не ЗначениеЗаполнено(СтавкаНДСДоИзменения) Тогда
			СтавкаНДСДоИзменения = СтрокаДанных.СтавкаНДС;
		КонецЕсли;
		
		Item.OriginalValues.TaxRate = ПредставлениеСтавкиНДС(СтавкаНДСДоИзменения);
		Item.CorrectedValues.TaxRate = ПредставлениеСтавкиНДС(СтрокаДанных.СтавкаНДС);
		
		
		Item.OriginalValues.Vat = 	СтрокаДанных.СуммаНДСДоИзменения;
		Item.CorrectedValues.Vat =	СтрокаДанных.СуммаНДС;
		
		Item.OriginalValues.Total =	СтрокаДанных.СуммаДоИзменения + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДСДоИзменения);
		Item.CorrectedValues.Total = СтрокаДанных.Сумма + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		
		Content.items.Добавить(Item);
		
	КонецЦикла;	  

	стПодписант = МетодСервера(, "СформироватьПараметрыПодписанта", ПараметрыФормирования.ФИОПодписанта);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПодписанта;
		Иначе
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПолучателя;
		КонецЕсли;
		
		ПодписантФамилия =				ВыделитьСлово(ФИОПолучателя);
		ПодписантИмя = 					ВыделитьСлово(ФИОПолучателя);
		ПодписантОтчество = 				ВыделитьСлово(ФИОПолучателя);
		стПодписант.ПодписантФамилия =	?(НЕ ПустаяСтрока(ПодписантФамилия), ПодписантФамилия, " ");
		стПодписант.ПодписантИмя = 		?(НЕ ПустаяСтрока(ПодписантИмя), ПодписантИмя, " ");
		стПодписант.ПодписантОтчество = 	?(НЕ ПустаяСтрока(ПодписантОтчество), ПодписантОтчество, "");
		
	КонецЕсли;	
					
	Content.Signer.Surname 		= стПодписант.ПодписантФамилия;
	Content.Signer.FirstName 	= стПодписант.ПодписантИмя;
	Content.Signer.Patronymic 	= стПодписант.ПодписантОтчество;
	Content.Signer.Inn 			= Content.seller.inn;
	Content.Signer.IsSoleProprietor	= Content.seller.IsSoleProprietor;
	Content.Signer.SoleProprietorRegistrationCertificate = ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляПечати.Организация);	
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеДляПечати);
	
КонецПроцедуры

#КонецОбласти

#Область МашиночитаемыеДоверенности
 
Функция МЧД_ИмяСправочникаВИнформационнойБазе(СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенности(Ссылка, СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтавкиНДС

Функция МенеджерИнтеграции_СтавкаБезНДС()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СтавкаБезНДС");
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ЭтоСтавкаБезНДС(Ставка)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЭтоСтавкаБезНДС", Ставка);
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ЭтоСтавкаНДСИНА(Знач ПредставлениеСтавки)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЭтоСтавкаНДСИНА", ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСПоПредставлению(ПредставлениеСтавки)
	
	Если МенеджерИнтеграции_ЭтоСтавкаНДСИНА(ПредставлениеСтавки) Тогда
		Результат = МенеджерИнтеграции_СтавкаБезНДС();
	Иначе 
		Результат = ЗначениеСтавкиНДС(ПредставлениеСтавки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеСтавкиНДС(ПредставлениеСтавки)
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = ПредставлениеСтавкиБезНДС();
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиНДС(ЗначениеСтавки)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			
			// Представление ставки НДС получить не удалось,
			// поэтому возвращаем признак ошибки через зарезервированную строку "##".
			// Такую строку умеет обрабатывать валидация контента.
			Результат = "##";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("0", Перечисления.СтавкиНДС.НДС0);
	Результат.Вставить("10", Перечисления.СтавкиНДС.НДС10);
	Результат.Вставить("18", Перечисления.СтавкиНДС.НДС18);
	Результат.Вставить("20", Перечисления.СтавкиНДС.НДС20);
	Результат.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
	Результат.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
	Результат.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
	Результат.Вставить(ПредставлениеСтавкиБезНДС(), Перечисления.СтавкиНДС.БезНДС);
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентом(), СтавкаНДСИсчисляетсяНалоговымАгентомПредставление());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить("5", Перечисления.СтавкиНДС.НДС5);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить("7", Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить("22", Перечисления.СтавкиНДС.НДС22);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
	КонецЕсли;
	
	Результат.Вставить(Перечисления.СтавкиНДС.НДС0, "0");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10, "10");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18, "18");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20, "20");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
	Результат.Вставить(Перечисления.СтавкиНДС.БезНДС, ПредставлениеСтавкиБезНДС());
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентомПредставление(), СтавкаНДСИсчисляетсяНалоговымАгентом());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетЗначениеПеречисленияСтавкиНДС(ИмяЗначенияСтавкаНДС)
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	Результат = (ЗначенияПеречисления.Найти(ИмяЗначенияСтавкаНДС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом()
	
	Возврат "ИсчНалАг";
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентомПредставление()
	
	Возврат "НДС исчисляется налоговым агентом";
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	
	Возврат "без НДС";
	
КонецФункции

#КонецОбласти

Функция ПредставлениеНомера(НомерОбъекта)
	
	Результат = НомерОбъекта;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактура(СсылкаНаОбъект)
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	Результат = (ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьДокументыОснованияВСлужебнуюИнформацию(Контент)
	
	СсылкаНаОбъект = Контент.СлужебнаяИнформация.Ссылка;
	
	Если Не ЭтоСчетФактура(СсылкаНаОбъект)
		Или СчетФактураНаАванс(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОснования = ВсеДокументыОснования(СсылкаНаОбъект);
	Контент.СлужебнаяИнформация.Вставить("ДокументыОснования", ДокументыОснования);
	
КонецПроцедуры

Функция ВсеДокументыОснования(СсылкаНаОбъект)
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ИмяДокумента = МетаданныеОбъекта.Имя;
	
	ИмяМетаданныхТаблицыОснований = СтрЗаменить("Документ.%ИмяДокумента%.ТабличнаяЧасть.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
	
	Результат = Новый Массив;
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", ИмяМетаданныхТаблицыОснований) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	&ПолноеИмяТаблицы КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
		
		ПолноеИмяТаблицы = СтрЗаменить("Документ.%ИмяДокумента%.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ДокументОснование") Тогда
		
		Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОснование");
		Результат.Добавить(Основание);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет реквизиты шапки счета-фактуры значениями реквизитов документа-основания.
// Для печати счета-фактуры многие реквизиты берутся из его документа-основания.
//
// Параметры:
//  ДанныеСчетаФактуры - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуСчетаФактурыПоДокументуОснованию(ДанныеСчетаФактуры)
	
	СсылкаНаОбъект = ДанныеСчетаФактуры.ОписаниеДокумента.Ссылка;
	
	Если Не ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеДокументаОснования = ДанныеШапки(СсылкаНаОбъект.ДокументОснование);
	
	КопируемыеРеквизиты = Новый Массив;
	КопируемыеРеквизиты.Добавить("Контрагент");
	КопируемыеРеквизиты.Добавить("Организация");
	КопируемыеРеквизиты.Добавить("Грузополучатель");
	КопируемыеРеквизиты.Добавить("Грузоотправитель");
	КопируемыеРеквизиты.Добавить("ВалютаДокумента");
	КопируемыеРеквизиты.Добавить("ВалютаДокументаКод");
	КопируемыеРеквизиты.Добавить("АдресДоставки");
	КопируемыеРеквизиты.Добавить("БанковскийСчетОрганизации");
	КопируемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
	
	Для Каждого ИмяРеквизита Из КопируемыеРеквизиты Цикл 
		
		РеквизитОснования = ДанныеДокументаОснования[ИмяРеквизита];
		Если ЗначениеЗаполнено(РеквизитОснования) Тогда
			ДанныеСчетаФактуры.Вставить(ИмяРеквизита, РеквизитОснования);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаНаименованиеКонтрагента(ИмяПоляКонтрагент)
	
	ТекстЗапроса =	"ВЫБОР
					|	КОГДА %1.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
					|		ТОГДА %1.ЮридическоеФизическоеЛицо.НаименованиеПолное
					|	ИНАЧЕ %1.ЮридическоеФизическоеЛицо.Наименование
					|КОНЕЦ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%1", ИмяПоляКонтрагент);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьСведенияОЮрФизЛице(ЮрФизЛицо, БанковскийСчет = Неопределено)
	
	СтруктураСведений = Новый Структура(
	"Представление, ПолноеНаименование, СокращенноеНаименование, НаименованиеДляПечатныхФорм, ФИОПБОЮЛ,
	|КодПоОКПО, ИНН, КПП, Телефоны, ЮридическийАдрес, Банк, БИК, КоррСчет, НомерСчета, АдресБанка, Факс");
	
	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат СтруктураСведений;
	КонецЕсли;
	
	ЗапросПоОсновнымСведениям =	Новый Запрос;
	ЗапросПоОсновнымСведениям.Текст =
	//{
	"ВЫБРАТЬ
	|	Организации.Представление КАК Наименование,
	|	Организации.НаименованиеПолное КАК ПолноеНаименование,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	Организации.КодОКПО КАК КодПоОКПО,
	|	Организации.НаименованиеСокращенное КАК СокращенноеНаименование,
	|	ВЫБОР
	|		КОГДА Организации.ИспользоватьВПлатежныхДокументахСокращенноеНаименование
	|			ТОГДА Организации.НаименованиеСокращенное
	|		ИНАЧЕ Организации.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеДляПечатныхФорм,
	|	Организации.НаименованиеПолное КАК ИндивидуальныйПредприниматель,
	|	Организации.СвидетельствоСерияНомер КАК СвидетельствоСерияНомер,
	|	Организации.СвидетельствоДатаВыдачи КАК СвидетельствоДатаВыдачи,
	|	Организации.Ссылка КАК ИсточникКонтактнойИнформации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации) КАК ВидыКонтактнойИнформацииЮрАдрес,
	|	ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации) КАК ВидыКонтактнойИнформацииФактАдрес,
	|	ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации) КАК ВидыКонтактнойИнформацииТелефон,
	|	ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации) КАК ВидыКонтактнойИнформацииФакс
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &ЮрФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Представление,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ,
	|	Контрагенты.ЮридическоеФизическоеЛицо.ИНН,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.КПП
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Контрагенты.НаименованиеСокращенное,
	|	Контрагенты.НаименованиеСокращенное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	Контрагенты.ЮридическоеФизическоеЛицо.Ссылка,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица)
	|	КОНЕЦ,
	|	""""
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &ЮрФизЛицо";
	//}
	
	ЗапросПоОсновнымСведениям.УстановитьПараметр("ЮрФизЛицо",			ЮрФизЛицо);
	
	РезультатЗапросаПоОсновнымСвдениям =	ЗапросПоОсновнымСведениям.Выполнить();
	
	Если НЕ РезультатЗапросаПоОсновнымСвдениям.Пустой() Тогда
		
		Выборка =	РезультатЗапросаПоОсновнымСвдениям.Выбрать();
		Выборка.Следующий();
		
		Если НЕ ЗначениеЗаполнено(Выборка.ПолноеНаименование) Тогда
			СтруктураСведений.Вставить("ПолноеНаименование", 		СокрЛП(Выборка.Наименование));
		Иначе
			СтруктураСведений.Вставить("ПолноеНаименование",		СокрЛП(Выборка.ПолноеНаименование));
		КонецЕсли;
		
		СтруктураСведений.Вставить("СокращенноеНаименование", 		СокрЛП(Выборка.СокращенноеНаименование));
		СтруктураСведений.Вставить("НаименованиеДляПечатныхФорм", 	СокрЛП(Выборка.НаименованиеДляПечатныхФорм));
		СтруктураСведений.Вставить("Представление",	 				СокрЛП(Выборка.Наименование));
		СтруктураСведений.Вставить("ФИОПБОЮЛ", 						"");
		СтруктураСведений.Вставить("ИНН", 							Выборка.ИНН);
		СтруктураСведений.Вставить("КодПоОКПО", 					Выборка.КодПоОКПО);
		СтруктураСведений.Вставить("КПП", 							Выборка.КПП);
		
		Если НЕ ПустаяСтрока(Выборка.СвидетельствоСерияНомер) Тогда
			СтруктураСведений.Вставить("Свидетельство",	"свидетельство " + СокрЛП(Выборка.СвидетельствоСерияНомер) 
			+ " от " + Формат(Выборка.СвидетельствоДатаВыдачи, "ДЛФ=D"));
		Иначе
			СтруктураСведений.Вставить("Свидетельство",	"");
		КонецЕсли;
		
		Попытка
			ЮридическийАдрес =	УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Выборка.ИсточникКонтактнойИнформации, Выборка.ВидыКонтактнойИнформацииЮрАдрес);
		Исключение
			ЮридическийАдрес =	УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.ИсточникКонтактнойИнформации, Выборка.ВидыКонтактнойИнформацииЮрАдрес);
		КонецПопытки;
		СтруктураСведений.Вставить("ЮридическийАдрес", ЮридическийАдрес);
		
		Попытка
			ФактическийАдрес =	УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Выборка.ИсточникКонтактнойИнформации, Выборка.ВидыКонтактнойИнформацииФактАдрес);
		Исключение
			ФактическийАдрес =	УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.ИсточникКонтактнойИнформации, Выборка.ВидыКонтактнойИнформацииФактАдрес);
		КонецПопытки;
		СтруктураСведений.Вставить("ФактическийАдрес", ФактическийАдрес);
		
		Попытка
			Телефоны =			УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Выборка.ИсточникКонтактнойИнформации, Выборка.ВидыКонтактнойИнформацииТелефон);
		Исключение
			Телефоны =			УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.ИсточникКонтактнойИнформации, Выборка.ВидыКонтактнойИнформацииТелефон);
		КонецПопытки;
		СтруктураСведений.Вставить("Телефоны", Телефоны);
		
		СтруктураСведений.Вставить("Факс", "");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет =	ПолучитьБанковскийСчетПоУмолчанию(ЮрФизЛицо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		РеквизитыСчета = Новый Структура("Банк, БИК, КоррСчет, НомерСчета", "Банк", "БИК", "КоррСчет", "СчетНомер");
		Если ТипЗнч(БанковскийСчет) = Тип("СправочникСсылка.БанковскиеИКазначейскиеСчета") Тогда
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(БанковскийСчет, БанковскийСчет, РеквизитыСчета, Истина);
	    Иначе
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(БанковскийСчет.Владелец, БанковскийСчет, РеквизитыСчета, Истина);
		КонецЕсли;
	Иначе
		РеквизитыСчета = Новый Структура("Банк, БИК, КоррСчет, НомерСчета");
	КонецЕсли;
	
	СтруктураСведений.Вставить("БИК",			РеквизитыСчета.БИК);
	СтруктураСведений.Вставить("Банк",			РеквизитыСчета.Банк);
	СтруктураСведений.Вставить("КоррСчет",		РеквизитыСчета.КоррСчет);
	СтруктураСведений.Вставить("НомерСчета",	РеквизитыСчета.НомерСчета);
	
	Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ЮрФизЛицо, "СтранаРегистрации") Тогда
		СтруктураСведений.Вставить("СтранаРегистрации", ЮрФизЛицо.СтранаРегистрации);
	КонецЕсли;
	
	Возврат СтруктураСведений;
	
КонецФункции

// Параметры:
//  Организация		 - СправочникСсылка.Организации - организация, для которой необходимо получить 
//													  настройку модуля "ПодставлятьКППГрузоотправителя"
//  Грузоотправитель - СправочникСсылка.Организации или СправочникСсылка.Контрагенты
//
Функция КППГрузоотправителя(Организация, Грузоотправитель)
	
	Результат = "";
	
	ПодставлятьКППГрузоотправителя = МетодСервера(,	"ПолучитьЗначениеСвойства", Организация, 
	МетодСервера(, "ИдентификаторСвойстваПодставлятьКППГрузоотправителя"));
	
	Если ПодставлятьКППГрузоотправителя = Истина И ЗначениеЗаполнено(Грузоотправитель)
		И ТипЗнч(Грузоотправитель.ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
		КППГрузоотправителя = ?(ЗначениеЗаполнено(Грузоотправитель.ЮридическоеФизическоеЛицо.КПП), Грузоотправитель.ЮридическоеФизическоеЛицо.КПП, "");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазделительПакетаЗапросов()
	
	Возврат
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

Функция ТекстЗапросаТабличнаяЧастьСФ()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	&НоменклатураСсылка КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	&НоменклатураПредставление КАК НоменклатураПредставление,
	|	&НоменклатураКод КАК КодНоменклатуры,
	|	ТЧ.СодержаниеУслуги КАК СодержаниеУслуги,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Всего - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТЧ.Всего КАК СуммаСНДС,
	|	&ТЧСТавкаНДС КАК СтавкаНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	ТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧ.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	&ЭтоУслуга КАК ЭтоУслуга,
	|	&ТипНоменклатуры КАК ПризнакТоварРаботаУслуга
	|ИЗ
	|	Документ.СчетФактураВыданный.СоставНФА КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	НоменклатураПредставление =
	"ВЫБОР
	|	КОГДА ТЧ.НФА ССЫЛКА Справочник.Номенклатура
	|		ТОГДА ВЫРАЗИТЬ(ТЧ.НФА КАК Справочник.Номенклатура).НаименованиеПолное
	|	КОГДА ТЧ.НФА ССЫЛКА Справочник.ОсновныеСредства
	|		ТОГДА ВЫРАЗИТЬ(ТЧ.НФА КАК Справочник.ОсновныеСредства).НаименованиеПолное
	|	ИНАЧЕ ТЧ.НФА
	|КОНЕЦ";
	
	НоменклатураКод =
	"ВЫБОР
	|	КОГДА ТЧ.НФА ССЫЛКА Справочник.Номенклатура
	|		ТОГДА ВЫРАЗИТЬ(ТЧ.НФА КАК Справочник.Номенклатура).Код
	|	ИНАЧЕ НЕОПРЕДЕЛЕНО
	|КОНЕЦ";
	
	НоменклатураСсылка =
	"ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ТЧ.НФА) = ТИП(СТРОКА)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ ТЧ.НФА
	|КОНЕЦ";
	
	ЭтоУслуга =
	"ВЫБОР
	|	КОГДА ТЧ.Ссылка.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	|			ИЛИ ТЧ.Ссылка.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ТипНоменклатуры =
	"ВЫБОР
	|	КОГДА ТЧ.Ссылка.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	|			ИЛИ ТЧ.Ссылка.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|		ТОГДА ""Service""
	|	ИНАЧЕ ""Property""
	|КОНЕЦ";
	
	ТЧСТавкаНДС =
	"ВЫБОР
	|	КОГДА ТЧ.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	ИНАЧЕ ТЧ.СтавкаНДС
	|КОНЕЦ";
	
	СписокЗамен = Новый Соответствие;
	СписокЗамен.Вставить("&НоменклатураСсылка", НоменклатураПредставление);
	СписокЗамен.Вставить("&НоменклатураПредставление", НоменклатураПредставление);
	СписокЗамен.Вставить("&НоменклатураКод", НоменклатураКод);
	СписокЗамен.Вставить("&ЭтоУслуга", ЭтоУслуга);
	СписокЗамен.Вставить("&ТипНоменклатуры", ТипНоменклатуры);
	СписокЗамен.Вставить("&ТЧСТавкаНДС", ТЧСТавкаНДС);
	
	Для Каждого Замена Из СписокЗамен Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Замена.Ключ, Замена.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТабличнаяЧастьТорг12()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	ТЧ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ТЧ.Номенклатура.Код КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СодержаниеУслуги,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Всего - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТЧ.Всего КАК СуммаСНДС,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	""Property"" КАК ПризнакТоварРаботаУслуга
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12.Номенклатура КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТабличнаяЧастьАкт()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	ТЧ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ТЧ.Номенклатура.Код КАК КодНоменклатуры,
	|	ТЧ.СодержаниеУслуги КАК СодержаниеУслуги,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Всего - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТЧ.Всего КАК СуммаСНДС,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга
	|ИЗ
	|	Документ.АктОбОказанииУслуг.УслугиОказанные КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТабличнаяЧастьСчет()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	ТЧ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ТЧ.Номенклатура.Код КАК КодНоменклатуры,
	|	"""" КАК СодержаниеУслуги,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Всего - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ТЧ.Всего КАК СуммаСНДС,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	""Property"" КАК ПризнакТоварРаботаУслуга,
	|	0 КАК ПорядокТЧ
	|ИЗ
	|	Документ.СчетНаОплату.Материалы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.НомерСтроки,
	|	ТЧ.Номенклатура,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТЧ.Номенклатура.НаименованиеПолное,
	|	ТЧ.Номенклатура.Код,
	|	ТЧ.Содержание,
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ВЫБОР
	|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТЧ.Всего - ТЧ.СуммаНДС
	|		ИНАЧЕ ТЧ.Сумма
	|	КОНЕЦ,
	|	ТЧ.Всего,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.СуммаНДС,
	|	ТЧ.Ссылка.СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	ИСТИНА,
	|	""Service"",
	|	1
	|ИЗ
	|	Документ.СчетНаОплату.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#Область ЗагрузкаДанных

// Список возможных идентификаторов способов обработки входящих документов.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ИдентификаторыПравилОбработкиДокументов()
	
	ЗначенияПеречисления = Новый Массив;
	ЗначенияПеречисления.Добавить("ПоступлениеМЗ");
	ЗначенияПеречисления.Добавить("ПоступлениеУслугРабот");
	ЗначенияПеречисления.Добавить("ПоступлениеОС");
	ЗначенияПеречисления.Добавить("СчетФактураПолученный");
	ЗначенияПеречисления.Добавить("КорректировочныйСчетФактураПолученный");
	ЗначенияПеречисления.Добавить("АктСверкиВзаиморасчетов");
	
	Результат = Новый Структура;
	Для Каждого Элемент Из ЗначенияПеречисления Цикл
		Результат.Вставить(Элемент, Элемент);
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возвращает структуру, реквизиты которой соответствуют
// документу "ЭлектронныйДокументПоставщика"
//
// Параметры:
//  ДанныеЭД - Структура - содержит данные электронного документа;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//     * Шапка - Структура - соответствует шапке документа "ЭлектронныйДокументПоставщика";
//     * СписокНоменклатуры - ТаблицаЗначений - соответствует табличной части "СписокНоменклатуры" документа "ЭлектронныйДокументПоставщика";
//
Функция СтруктураЭлектронногоДокументаПоставщика(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияЭлектронногоДокументаПоставщика();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	ШапкаЭД	 = ДанныеЭД.Шапка;
	ИтогиТЧ	 = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Участники сделки
	Шапка.Вставить("Организация"		, СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"			, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("Грузоотправитель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузоотправитель));
	Шапка.Вставить("Грузополучатель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузополучатель));
	
	// Валюта, сумма
	Шапка.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("СуммаДокумента"	, ИтогиТЧ.СуммаСНДС);
	Шапка.Вставить("СуммаВключаетНДС", ПараметрыЗаполнения.ЦенаВключаетНДС);
	
	// Договор
	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("Организация", Шапка.Организация);
	РеквизитыДоговора.Вставить("Владелец", Шапка.Контрагент);
	РеквизитыДоговора.Вставить("ДатаДоговора", Неопределено);
	РеквизитыДоговора.Вставить("НомерДоговора", Неопределено);
	Шапка.Вставить("Договор", НайтиДоговорКонтрагента(РеквизитыДоговора));
	
	// Данные первичного документа
	Шапка.Вставить("ВидПервичногоДокумента", "Универсальный передаточный документ");
	Шапка.Вставить("ДатаПервичногоДокумента", ШапкаЭД.Дата);
	Шапка.Вставить("НомерПервичногоДокумента", ШапкаЭД.Номер);
	
	СписокНоменклатуры = Документы.ЭлектронныйДокументПоставщика.ПустаяСсылка().СписокНоменклатуры.ВыгрузитьКолонки();
	
	Если СписокНоменклатуры.Колонки.Найти("Содержание") = Неопределено Тогда 
		СписокНоменклатуры.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка"));
	КонецЕсли;	
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл
		
		ЭтоВозвратнаяТара = Ложь;
		
		НоменклатураИБ = Стр.Номенклатура;
		НоменклатураКонтрагента = Стр.НоменклатураКонтрагента;
		
		// TODO: Корректно заполнить (3 - услуги, 4 - ПО, 1ВТ - возвратная тара)
		ПризнакНоменклатуры = "1";
		
		НоваяСтрока = СписокНоменклатуры.Добавить();
		
		НоваяСтрока.Номенклатура			= НоменклатураИБ.Номенклатура;
		НоваяСтрока.Содержание				= НоменклатураКонтрагента.Наименование;
		НоваяСтрока.ПризнакНоменклатуры		= ПризнакНоменклатуры;
		НоваяСтрока.ИдентификаторПоставщика	= НоменклатураКонтрагента.Идентификатор;
		
		НоваяСтрока.ЕдиницаИзмерения	 = НоменклатураИБ.Упаковка;
		НоваяСтрока.ЕдиницаИзмеренияКод	 = НоменклатураКонтрагента.ЕдиницаИзмеренияКод;
		
		ПредставлениеСтавки = НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = СтавкаНДСПоПредставлению(ПредставлениеСтавки);
		
		НоваяСтрока.Количество	 = Стр.Количество;
		НоваяСтрока.Цена		 = Стр.Цена;
		НоваяСтрока.Сумма		 = Стр.СуммаБезНДС;
		НоваяСтрока.СуммаНДС	 = Стр.СуммаНДС;
		НоваяСтрока.Всего		 = Стр.СуммаСНДС;
		
		Если ПараметрыЗаполнения.ЦенаВключаетНДС Тогда
			
			Если НоваяСтрока.Количество = 0 Тогда
				НоваяСтрока.Цена = 0;
			Иначе
				НоваяСтрока.Цена = НоваяСтрока.Всего / НоваяСтрока.Количество;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", Шапка);
	Результат.Вставить("СписокНоменклатуры", СписокНоменклатуры);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для заполнения счета-фактуры полученного.
//
// Параметры:
//  ДанныеЭД - Структура - содержит данные электронного документа;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//     * Шапка - Структура - значения для заполнения шапки СФ;
//     * СоставНФА - ТаблицаЗначений - соответствует табличной части "СоставНФА" документа "СчетФактураПолученный";
//
Функция СтруктураЗаполненияСчетаФактурыПолученного(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияСчетаФактуры();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	ШапкаЭД	 = ДанныеЭД.Шапка;
	ИтогиТЧ	 = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Даты, номера
	Шапка.Вставить("КодСпособаВыставления", 2);
	Шапка.Вставить("НомерПервичногоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаПервичногоДокумента", ШапкаЭД.Дата);
	Шапка.Вставить("ВидПервичногоДокумента", НСтр("ru = 'Счет-фактура'"));
	Шапка.Вставить("ДатаПолучения", ТекущаяДатаСеанса());
	
	// Участники сделки
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	
	// Валюта, сумма
	ВалютаРегл = ВалютаРегламентированногоУчета();
	Валюта = ШапкаЭД.Валюта.Ссылка;
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ВалютаРегл;
	КонецЕсли;
	
	Шапка.Вставить("ВалютаДокумента", Валюта);
	Шапка.Вставить("СуммаДокумента"	, ИтогиТЧ.СуммаСНДС);
	Шапка.Вставить("СуммаНДС"		, ИтогиТЧ.СуммаНДС);
	
	Если Валюта <> ВалютаРегл Тогда
		Шапка.Вставить("ВИностраннойВалюте", Истина);
	КонецЕсли;
	
	// Договор
	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("Организация", Шапка.Организация);
	РеквизитыДоговора.Вставить("Владелец", Шапка.Контрагент);
	РеквизитыДоговора.Вставить("ДатаДоговора", Неопределено);
	РеквизитыДоговора.Вставить("НомерДоговора", Неопределено);
	Шапка.Вставить("Договор", НайтиДоговорКонтрагента(РеквизитыДоговора));
	
	// Вид операции
	ЭтоАванс = ДанныеЭД.ЭтоАванс;
	
	Если ЭтоАванс Тогда 
		
		ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.АвансВыданный;
		КодВидаОперации = "02";
		ВидЦенности = Перечисления.ВидыЦенностейНДС.Аванс;
		
	Иначе
		
		ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.Покупка;
		КодВидаОперации = "01";
		ВидЦенности = Перечисления.ВидыЦенностейНДС.Материалы; // TODO: или Услуги? 
		
	КонецЕсли;
	
	Шапка.Вставить("ПричинаНалогообложения", ПричинаНалогообложения);
	Шапка.Вставить("КодВидаОперации", КодВидаОперации);
	Шапка.Вставить("ВидЦенности", ВидЦенности);
	
	// Документы-основания
	ДокументыОснованияСчетаФактуры = ПараметрыЗаполнения.ДокументОснование;
	Если Не ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
		ИдентификаторЭД = ДанныеЭД.ЭлектронныйДокумент.Идентификатор;
		ДокументыОснованияСчетаФактуры = СопоставленныеУчетныеДокументы(ИдентификаторЭД);
	КонецЕсли;
	
	ЭДПоставщика = Документы.ЭлектронныйДокументПоставщика.ПустаяСсылка();
	
	ТаблицаОснований = Новый ТаблицаЗначений;
	ТаблицаОснований = Документы.СчетФактураПолученный.ПустаяСсылка().ДокументыОснования.ВыгрузитьКолонки();
	
	Если ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
		
		Для Каждого ДокументОснования Из ДокументыОснованияСчетаФактуры Цикл
			
			Если ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
				ЭДПоставщика = ДокументОснования;
			Иначе	
				СтрокаТаблицы = ТаблицаОснований.Добавить();
				СтрокаТаблицы.ДокументОснование = ДокументОснования;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаОснований.Свернуть("ДокументОснование");
	Шапка.Вставить("ДокументыОснования", ТаблицаОснований);
	Шапка.Вставить("ЭДПоставщика", ЭДПоставщика);
	
	// Табличная часть
	ТаблицаТоваров = Документы.СчетФактураПолученный.ПустаяСсылка().СоставНФА.ВыгрузитьКолонки();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл
		
		НоменклатураИБ = Стр.Номенклатура;
		НоменклатураКонтрагента	 = Стр.НоменклатураКонтрагента;
		
		НоваяСтрока = ТаблицаТоваров.Добавить();
		
		НоваяСтрока.НФА = НоменклатураИБ.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = НоменклатураИБ.Упаковка;
		НоваяСтрока.ИдентификаторПоставщика = НоменклатураКонтрагента.Идентификатор;
		
		ПредставлениеСтавки = НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = СтавкаНДСПоПредставлению(ПредставлениеСтавки);
		
		НоваяСтрока.Количество	 = Стр.Количество;
		НоваяСтрока.Сумма		 = Стр.СуммаБезНДС;
		НоваяСтрока.СуммаНДС	 = Стр.СуммаНДС;
		НоваяСтрока.Всего		 = Стр.СуммаСНДС;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", Шапка);
	Результат.Вставить("СоставНФА", ТаблицаТоваров);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяЭлектронныйАктСверкиВзаиморасчетов()
	
	МинимальнаяВерсия = "2.0.90.00";
	ВерсияБГУ = ВерсияПодсистемыБГУ();
	Результат = ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияБГУ, МинимальнаяВерсия) >= 0;
	
	Возврат Результат;
	
КонецФункции

Функция ДоговорПоСтрокеАктаСверки(ДанныеДокумента, РеквизитыДоговора)
	
	ВидДоговора = РеквизитыДоговора.Описание;
	ДоговорПоУмолчанию = Справочники.Договоры.ПустаяСсылка();
	СписокВидовДоговоров = Новый СписокЗначений;
	
	Если РеквизитыДоговора.Описание = "С покупателем" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	ИначеЕсли РеквизитыДоговора.Описание = "С поставщиком" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Иначе
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Договоры.Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Организация = &Организация
	|	И Договоры.Контрагент = &Контрагент
	|	И Договоры.ВидДоговора В(&ВидДоговора)");
	
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("Контрагент", ДанныеДокумента.Контрагент);
	Запрос.УстановитьПараметр("ВидДоговора", СписокВидовДоговоров);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат ДоговорПоУмолчанию;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

Функция СтруктураЗаполненияАктаСверкиВзаиморасчетов(ДанныеЭД, ДополнительныеПараметры)
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	
	Шапка = Новый Структура;
	Шапка.Вставить("ЭтоЭлектронныйДокумент",  Истина);
	Шапка.Вставить("ЭтоДокументКонтрагента",  Истина);
	Шапка.Вставить("РазбитьПоДоговорам",      Истина);
	Шапка.Вставить("ДатаНачала",              ШапкаЭД.ДатаНачала);
	Шапка.Вставить("ДатаОкончания",           ШапкаЭД.ДатаОкончания);
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента",  ШапкаЭД.Дата);
	
	// Стороны сверки
	Организация = СсылкаНаУчастникаСделки(ШапкаЭД.Получатель);
	Контрагент = СсылкаНаУчастникаСделки(ШапкаЭД.Отправитель);
	Шапка.Вставить("Организация", Организация);
	Шапка.Вставить("Контрагент", Контрагент);
	
	// Валюта
	Шапка.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("ОстатокНаНачалоПоДаннымКонтрагента",
		ДанныеЭД.ТоварнаяЧасть.СальдоНачДебет - ДанныеЭД.ТоварнаяЧасть.СальдоНачКредит);
	
	ТаблицаПоДаннымКонтрагента = Новый ТаблицаЗначений;
	Для Каждого Реквизит Из Метаданные.Документы.АктСверкиВзаиморасчетов.ТабличныеЧасти.ПоДаннымКонтрагента.Реквизиты Цикл
		ТаблицаПоДаннымКонтрагента.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	// Табличная часть ПоДаннымКонтрагента
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ТаблицаПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.Договор = ДоговорПоСтрокеАктаСверки(Шапка, СтрокаДоговора);
				СтрокаПоДаннымКонтрагента.Дата = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.Представление = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.Дебет = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.Кредит = СтрокаОперации.СуммаКредит;
				СтрокаПоДаннымКонтрагента.НомерДокумента = СтрокаДокумента.Номер;
				СтрокаПоДаннымКонтрагента.ДатаДокумента = СтрокаДокумента.Дата;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура();
	ДанныеДляЗаполнения.Вставить("Шапка", Шапка);
	ДанныеДляЗаполнения.Вставить("ПоДаннымКонтрагента", ТаблицаПоДаннымКонтрагента);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

// Обработка заполнения поступления МЗ по данным электронного документа поставщика.
// См. Документы.ПоступлениеМЗ.МодульОбъекта.ЗаполнитьПоЭлектронномуДокументуПоставщика()
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъек.ПоступлениеМЗ - заполняемый объект;
//  ЭлектронныйДокументПоставщика - Структура - см. СтруктураЭлектронногоДокументаПоставщика;
//
Процедура ЗаполнитьПоступлениеМЗ(ДокументОбъект, ЭлектронныйДокументПоставщика)
	
	ДанныеЗаполнения = ЭлектронныйДокументПоставщика.Шапка;
	
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	ДокументОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
	ДокументОбъект.Договор = ДанныеЗаполнения.Договор;
	ДокументОбъект.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	ДокументОбъект.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	ДокументОбъект.ВидПервичногоДокумента = ДанныеЗаполнения.ВидПервичногоДокумента;
	ДокументОбъект.ДатаПервичногоДокумента = ДанныеЗаполнения.ДатаПервичногоДокумента;
	ДокументОбъект.НомерПервичногоДокумента = ДанныеЗаполнения.НомерПервичногоДокумента;
	
	ДокументОбъект.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.Автоматически;
	ДокументОбъект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ПоступлениеОтПоставщика;
	ДокументОбъект.СчетУчета = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("105.00");
	ДокументОбъект.ПринятьНДСКВычету = Истина;
	
	ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеМЗ;
	СписокНоменклатуры = СписокДоступнойНоменклатурыЭДПоставщика(ЭлектронныйДокументПоставщика.СписокНоменклатуры, ТипДокументаУчета);
	
	ПараметрыОбработкиСтроки = ПараметрыУстановкиСчетаУчетаВСтроке(ДокументОбъект);
	
	Для Каждого СтрокаТЧ Из СписокНоменклатуры Цикл
		
		Если СтрокаТЧ.КодВидаНоменклатуры = 5 Тогда
			
			НоваяСтрока = ДокументОбъект.ВозвратнаяТара.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.ЦенаОприходования = СтрокаТЧ.Цена;
			
		Иначе//Если СтрокаТЧ.КодВидаНоменклатуры = 1 Тогда
			
			НоваяСтрока = ДокументОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.КоличествоМест = 1;
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаИзмерения");
			
		КонецЕсли;
		
		ПараметрыОбработкиСтроки.Номенклатура = НоваяСтрока.Номенклатура;
		УстановитьДанныеСчетаУчетаВСтроке(НоваяСтрока, ПараметрыОбработкиСтроки);
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.Материалы.Итог("Всего");
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.УстановитьНовыйНомер();
	
КонецПроцедуры

// Обработка заполнения поступления услуг/работ по данным электронного документа поставщика.
// См. Документы.ПоступлениеУслугРабот.МодульОбъекта.ЗаполнитьПоЭлектронномуДокументуПоставщика()
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъек.ПоступлениеУслугРабот - заполняемый объект;
//  ЭлектронныйДокументПоставщика - Структура - см. СтруктураЭлектронногоДокументаПоставщика;
//
Процедура ЗаполнитьПоступлениеУслугРабот(ДокументОбъект, ЭлектронныйДокументПоставщика)
	
	ДанныеЗаполнения = ЭлектронныйДокументПоставщика.Шапка;
	
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	ДокументОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
	ДокументОбъект.Договор = ДанныеЗаполнения.Договор;
	ДокументОбъект.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	ДокументОбъект.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	ДокументОбъект.ВидПервичногоДокумента = ДанныеЗаполнения.ВидПервичногоДокумента;
	ДокументОбъект.ДатаПервичногоДокумента = ДанныеЗаполнения.ДатаПервичногоДокумента;
	ДокументОбъект.НомерПервичногоДокумента = ДанныеЗаполнения.НомерПервичногоДокумента;
	
	ДокументОбъект.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.Автоматически;
	ДокументОбъект.ПринятьНДСКВычету = Истина;
	
	ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеУслугРабот;
	СписокНоменклатуры = СписокДоступнойНоменклатурыЭДПоставщика(ЭлектронныйДокументПоставщика.СписокНоменклатуры, ТипДокументаУчета);
	
	Для Каждого СтрокаТЧ Из СписокНоменклатуры Цикл
		
		НоваяСтрока = ДокументОбъект.УслугиИРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаИзмерения");
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.УслугиИРаботы.Итог("Всего");
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.УстановитьНовыйНомер();
	
КонецПроцедуры

// Обработка заполнения поступления МЗ по данным электронного документа поставщика.
// См. Документы.ПоступлениеМЗ.МодульОбъекта.ЗаполнитьПоЭлектронномуДокументуПоставщика()
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъек.ПоступлениеМЗ - заполняемый объект;
//  ЭлектронныйДокументПоставщика - Структура - см. СтруктураЭлектронногоДокументаПоставщика;
//
Процедура ЗаполнитьПоступлениеОС(ДокументОбъект, ЭлектронныйДокументПоставщика)
	
	ДанныеЗаполнения = ЭлектронныйДокументПоставщика.Шапка;
	
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	ДокументОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
	ДокументОбъект.Договор = ДанныеЗаполнения.Договор;
	ДокументОбъект.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	ДокументОбъект.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	ДокументОбъект.ВидПервичногоДокумента = ДанныеЗаполнения.ВидПервичногоДокумента;
	ДокументОбъект.ДатаПервичногоДокумента = ДанныеЗаполнения.ДатаПервичногоДокумента;
	ДокументОбъект.НомерПервичногоДокумента = ДанныеЗаполнения.НомерПервичногоДокумента;
	
	ДокументОбъект.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.Автоматически;
	ДокументОбъект.ПринятьНДСКВычету = Истина;
	
	ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеОС;
	СписокНоменклатуры = СписокДоступнойНоменклатурыЭДПоставщика(ЭлектронныйДокументПоставщика.СписокНоменклатуры, ТипДокументаУчета);
	
	Для Каждого СтрокаТЧ Из СписокНоменклатуры Цикл
		
		ВидНФА = Перечисления.ВидыНФА.ОС;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура)
			И ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ВидНФА = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "ВидНФА");
		КонецЕсли;
		
		Если ВидНФА = Перечисления.ВидыНФА.НМА Тогда
			СчетУчета = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("106.11");
		ИначеЕсли ВидНФА = Перечисления.ВидыНФА.НПА Тогда
			СчетУчета = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("106.32");
		Иначе
			СчетУчета = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("106.31");
		КонецЕсли;
		
		НоваяСтрока = ДокументОбъект.КапВложения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ВнеоборотныйАктив = СтрокаТЧ.Номенклатура;
		НоваяСтрока.КоличествоМест = 1;
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.СчетУчета = СчетУчета;
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.КапВложения.Итог("Всего");
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.УстановитьНовыйНомер();
	
КонецПроцедуры

// Обработка заполнения поступления услуг/работ по данным электронного документа поставщика.
// См. ЭлектронныеДокументыБГУ.НайтиСоздатьУПДСчетФактуру_2019()
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъек.СчетФактураПолученный - заполняемый объект;
//  ДанныеДокумента	 - Структура - см. СтруктураЗаполненияСчетаФактурыПолученного()
//
Процедура ЗаполнитьСчетФактуруПолученный(ДокументОбъект, ДанныеДокумента)
	
	ДанныеЗаполненияШапки = ДанныеДокумента.Шапка;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполненияШапки);
	ДокументОбъект.ДокументыОснования.Загрузить(ДанныеЗаполненияШапки.ДокументыОснования);
	ДокументОбъект.СоставНФА.Загрузить(ДанныеДокумента.СоставНФА);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.УстановитьНовыйНомер();
	
КонецПроцедуры

Процедура ЗаполнитьАктСверкиВзаиморасчетов(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	МенеджерОбъекта = Документы.АктСверкиВзаиморасчетов;
	
	ДокументОбъект.РазбитьПоДоговорам = Истина;
	ДокументОбъект.ПоДаннымКонтрагента.Загрузить(ДанныеДокумента.ПоДаннымКонтрагента);
	ДокументОбъект.СверкаСогласована = НЕ ДокументОбъект.ЕстьРасхождения;
	
	Документы.АктСверкиВзаиморасчетов.ЗаполнитьСчетамиПоУмолчанию(ДокументОбъект);
	
КонецПроцедуры

Функция ПараметрыЗаполненияСчетаФактуры()
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументОснование", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаполненияЭлектронногоДокументаПоставщика()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДоговорКонтрагента(СвойстваДоговора)
	
	// TODO: Для поиска договора в ДанныеЭД нужно добавить информацию о договоре (основании передачи)
	
	Результат = Справочники.Договоры.ПустаяСсылка();
	
	Возврат Результат;
	
КонецФункции

// См. ЭлектронныеДокументыБГУВызовСервера.СписокДоступнойНоменклатурыЭДПоставщика()
//
// Параметры:
//  СписокНоменклатуры - ТаблицаЗначений - соответствует табличной части "СписокНоменклатуры" документа "ЭлектронныйДокументПоставщика";
// 
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция СписокДоступнойНоменклатурыЭДПоставщика(СписокНоменклатуры, ТипДокументаУчета = Неопределено)
	
	ВидыНоменклатурыМЗ = 1;
	ВидыНоменклатурыОС = 2;
	ВидыНоменклатурыРУ = 3;
	ВидыНоменклатурыИК = 4;
	ВидыНоменклатурыВТ = 5;
	
	ВидыНоменклатуры = Новый Массив;
	//Если ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеМЗ 
	//	ИЛИ ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеМЗВПути Тогда
	//	ВидыНоменклатуры.Добавить(ВидыНоменклатурыМЗ);
	//	ВидыНоменклатуры.Добавить(ВидыНоменклатурыВТ);
	//ИначеЕсли ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеИК Тогда
	//	ВидыНоменклатуры.Добавить(ВидыНоменклатурыМЗ);
	//ИначеЕсли ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеОС 
	//	ИЛИ ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеОСВПути Тогда
	//	ВидыНоменклатуры.Добавить(ВидыНоменклатурыОС);
	//ИначеЕсли ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПринятиеКУчетуОбъектовИК Тогда 
	//	ВидыНоменклатуры.Добавить(ВидыНоменклатурыИК);
	//ИначеЕсли ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеУслугРабот Тогда
	//	ВидыНоменклатуры.Добавить(ВидыНоменклатурыРУ);
	//КонецЕсли;
	
	ТипыНоменклатурыУслуг = Новый Массив;
	ТипыНоменклатурыУслуг.Добавить(Перечисления.ТипыНоменклатуры.Госуслуга);
	ТипыНоменклатурыУслуг.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	ТипыНоменклатурыУслуг.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	ТипыНоменклатурыУслуг.Добавить(Перечисления.ТипыНоменклатуры.УслугиАренды);
	ТипыНоменклатурыУслуг.Добавить(Перечисления.ТипыНоменклатуры.ГруппаУслуг);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЭлектронныйДокументПоставщикаСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЭлектронныйДокументПоставщикаСписокНоменклатуры.Содержание КАК Содержание,
	|	ЭлектронныйДокументПоставщикаСписокНоменклатуры.Количество КАК Количество,
	|	ЭлектронныйДокументПоставщикаСписокНоменклатуры.Сумма КАК Сумма,
	|	ЭлектронныйДокументПоставщикаСписокНоменклатуры.СтавкаНДС КАК СтавкаНДС,
	|	ЭлектронныйДокументПоставщикаСписокНоменклатуры.СуммаНДС КАК СуммаНДС,
	|	ЭлектронныйДокументПоставщикаСписокНоменклатуры.Всего КАК Всего
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	&СписокНоменклатуры КАК ЭлектронныйДокументПоставщикаСписокНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.Номенклатура КАК Номенклатура,
	|	ИтоговыеДанные.Содержание КАК Содержание,
	|	ИтоговыеДанные.Количество КАК Количество,
	|	ИтоговыеДанные.Сумма КАК Сумма,
	|	ИтоговыеДанные.СтавкаНДС КАК СтавкаНДС,
	|	ИтоговыеДанные.СуммаНДС КАК СуммаНДС,
	|	ИтоговыеДанные.Всего КАК Всего,
	|	ВЫБОР
	|		КОГДА ИтоговыеДанные.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ИтоговыеДанные.Сумма / ИтоговыеДанные.Количество
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ИтоговыеДанные.Номенклатура) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ИтоговыеДанные.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Тара)
	|						ТОГДА 5
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ИтоговыеДанные.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры В (&ТипыНоменклатурыУслуг)
	|								ТОГДА 3
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ИтоговыеДанные.Номенклатура) = ТИП(Справочник.ОсновныеСредства)
	|					ТОГДА ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ИтоговыеДанные.Номенклатура КАК Справочник.ОсновныеСредства).ИмуществоКазны = ИСТИНА
	|								ТОГДА 4
	|							ИНАЧЕ 2
	|						КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КодВидаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ИтоговыеДанные.Номенклатура) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ИтоговыеДанные.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Тара)
	|						ТОГДА ""Возвратная тара""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ИтоговыеДанные.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры В (&ТипыНоменклатурыУслуг)
	|								ТОГДА ""Услуги, работы""
	|							ИНАЧЕ ""Материальные запасы""
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ИтоговыеДанные.Номенклатура) = ТИП(Справочник.ОсновныеСредства)
	|					ТОГДА ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ИтоговыеДанные.Номенклатура КАК Справочник.ОсновныеСредства).ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.Казна)
	|								ТОГДА ""ОС (имущество казны)""
	|							ИНАЧЕ ""ОС, НМА, НПА""
	|						КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидНоменклатуры
	|ПОМЕСТИТЬ ДанныеСЦенойИКодомВидаНоменклатуры
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСЦенойИКодомВидаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.Содержание КАК Содержание,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.Количество КАК Количество,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.Сумма КАК Сумма,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.СуммаНДС КАК СуммаНДС,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.Всего КАК Всего,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.Цена КАК Цена,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.КодВидаНоменклатуры КАК КодВидаНоменклатуры,
	|	ДанныеСЦенойИКодомВидаНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	ДанныеСЦенойИКодомВидаНоменклатуры КАК ДанныеСЦенойИКодомВидаНоменклатуры
	|ГДЕ
	|	&УсловиеНаКодВидаНоменклатуры";
	
	Если ЗначениеЗаполнено(ВидыНоменклатуры) Тогда
		ТекстУсловияНаКодВидаНоменклатуры = "ДанныеСЦенойИКодомВидаНоменклатуры.КодВидаНоменклатуры В(&ВидыНоменклатуры)";
	Иначе
		ТекстУсловияНаКодВидаНоменклатуры = "ИСТИНА";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса
		, "&УсловиеНаКодВидаНоменклатуры"
		, ТекстУсловияНаКодВидаНоменклатуры);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", ВидыНоменклатуры);
	Запрос.УстановитьПараметр("ТипыНоменклатурыУслуг", ТипыНоменклатурыУслуг);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Возвращает заполненную структуру для заполнения КЭК и СчетаУчета номенклатуры.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - обрабатываемый документ.
// 
// Возвращаемое значение:
//  Структура - структура параметров.
//
Функция ПараметрыУстановкиСчетаУчетаВСтроке(ДокументОбъект)
	
	Результат = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(ДокументОбъект);
	Результат.ДтКт = "Дт";
	
	Возврат Результат;
	
КонецФункции

// Устанавливает счета учета в строке документа.
//
// Параметры:
//  ТекущаяСтрока	 - СтрокаТабличнойЧасти - строка табличной части документа.
//  Параметры		 - Структура - см. ПараметрыУстановкиСчетаУчетаВСтроке;
//
Процедура УстановитьДанныеСчетаУчетаВСтроке(ТекущаяСтрока, Параметры)
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(ТекущаяСтрока, Параметры);
	
КонецПроцедуры

Функция СсылкаНаУчастникаСделки(СвойстваИлиМассив)
	
	Результат = МетодСервера(
		"Модуль_ИнтеграцияУниверсальный",
		"СсылкаНаУчастникаЭДО",
		СвойстваИлиМассив
	);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОберткиДляВызоваУниверсальныхМетодов

Функция ДанныеШапки(Ссылка)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеШапки", Ссылка);
	
КонецФункции

Функция ДанныеТабличныхЧастей(Шапка) 
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеТабличныхЧастей", Шапка);
	
КонецФункции

Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьРеквизитМетаданных", ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты);
	
КонецФункции

Функция СкопироватьСтруктуру(Знач СтруктураИсходник)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "СкопироватьСтруктуру", СтруктураИсходник);
	
КонецФункции

Процедура ДополнитьТаблицу(ТаблицаПриемник, ТаблицаИсточник)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьТаблицу", ТаблицаПриемник, ТаблицаИсточник);
	
КонецПроцедуры

Функция РеквизитыЮрФизЛица(ЮрФизЛицо, Период = '00010101', Знач БанковскийСчет = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "РеквизитыЮрФизЛица", ЮрФизЛицо, Период, БанковскийСчет);
	
КонецФункции

Функция ПредставлениеЮрФизЛица(Реквизиты, ШаблонПредставления = "", СПрефиксом = Истина)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеЮрФизЛица", Реквизиты, ШаблонПредставления, СПрефиксом);
	
КонецФункции

// Внимание! Данная в следующих версиях функция перестанет быть экспортной.
// Для вызова из других модулей следует использовать Модуль_ИнтеграцияУниверсальный.ВалютаРегламентированногоУчета()
//
// Возвращает ссылку на валюту регламентированного учета.
// 
// Возвращаемое значение:
//  СправочникСсылка.Валюты - валюта регл. учета.
//
Функция ВалютаРегламентированногоУчета() Экспорт
	
	Результат = БухгалтерскиеОперации.ВалютаРегламентированногоУчета();
	
	Возврат Результат;
	
КонецФункции

Функция ИмяКолонкиКодТовара()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ИмяКолонкиКодТовара");
	
КонецФункции

Процедура ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти", Шапка, ТабличнаяЧасть);
	
КонецПроцедуры

Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеНоменклатуры", Номенклатура, Характеристика, ДополнительныеПараметры);
	
КонецФункции

Процедура ДополнитьКонтентДокументаСлужебнойИнформацией(Контент, ДанныеШапки)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентДокументаСлужебнойИнформацией"
				, Контент
				, ДанныеШапки);
	
КонецПроцедуры

Процедура ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Контент, СтрокаТЧ)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией"
				, Контент
				, СтрокаТЧ);
	
КонецПроцедуры

Процедура ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(Контент, СтрокаТЧ)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией"
				, Контент
				, СтрокаТЧ);
	
КонецПроцедуры

Функция ХранилищеКонтактнойИнформацииОбъекта(СсылкаНаОбъект)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ХранилищеКонтактнойИнформацииОбъекта", СсылкаНаОбъект);
	
КонецФункции

Функция АдресЮрФизЛица(ЮрФизЛицо, ВидАдреса, Дата = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "АдресЮрФизЛица", ЮрФизЛицо, ВидАдреса, Дата);
	
КонецФункции

Функция СведенияОбАдресе(Адрес, ДополнительныеПараметры = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "СведенияОбАдресе", Адрес, ДополнительныеПараметры);
	
КонецФункции

Функция ПредставлениеКонтактнойИнформацииОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации, Разделитель = ",", Дата = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеКонтактнойИнформацииОбъекта"
		, СсылкаИлиОбъект
		, ВидКонтактнойИнформации
		, Разделитель
		, Дата
		, ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

Процедура Заполнить_AddressInfo(AddressInfo, СтруктураАдреса)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Заполнить_AddressInfo", AddressInfo, СтруктураАдреса);
	
КонецПроцедуры

Функция ВидыЭлектронныхДокументов()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ВидыЭлектронныхДокументов");
	
КонецФункции

Процедура ДобавитьВидДокументаДляОбмена(ВидыДокументов, ОбъектМетаданных, ВидЭД, Ограничения = Неопределено, ПравилоКонвертацииСвойств = Неопределено)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьВидДокументаДляОбмена"
				, ВидыДокументов
				, ОбъектМетаданных
				, ВидЭД
				, Ограничения
				, ПравилоКонвертацииСвойств);
	
КонецПроцедуры

Функция НовоеПравилоКонвертацииСвойствЭД()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовоеПравилоКонвертацииСвойствЭД");
	
КонецФункции

Функция ЕстьНезаполненныйРеквизитОбъекта(ИмяРеквизита, Объект, МетаданныеОбъекта)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьНезаполненныйРеквизитОбъекта"
					, ИмяРеквизита
					, Объект
					, МетаданныеОбъекта);
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоСтруктуры(СложнаяСтруктура, ПолныйКлюч, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СвойствоСтруктуры"
					, СложнаяСтруктура
					, ПолныйКлюч
					, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных, ОднозначноеСоответствие = Истина)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СсылкаОбъектаПоПолямПоиска"
					, ПоляПоиска
					, ОписаниеОбъектаМетаданных
					, ОднозначноеСоответствие);
	
	Возврат Результат;
	
КонецФункции

Функция СопоставленныеУчетныеДокументы(ИдентификаторЭД)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СопоставленныеУчетныеДокументы", ИдентификаторЭД);
	
	Возврат Результат;
	
КонецФункции

Функция ПустыеЗначенияРеквизита(ИмяРеквизита)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПустыеЗначенияРеквизита", ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

// Добавляет новую запись в таблицу правил обработки электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - см. ПравилаОбработкиВходящихДокументов;
//  ИдентификаторПравила - Строка - идентификатор правила обработки документов;
//  ВидДокумента		 - Строка - вид документа, к которому относится правило (см. ВидыЭлектронныхДокументов);
//  ДляИсправлений		 - Булево, Неопределено - Ложь, если правило действует только для первичной версии документа;
//                                            Истина, если правило действует для только для исправленной версии документа;
//                                            Неопределено, если правило действует только для первичной и исправительной версий документа;
//
Процедура ДобавитьПравилоОбработкиДокументов(ПравилаОбработки, ИдентификаторПравила, ВидДокумента, ДляИсправлений)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьПравилоОбработкиДокументов"
		, ПравилаОбработки
		, ИдентификаторПравила
		, ВидДокумента
		, ДляИсправлений);
	
КонецПроцедуры

Функция НовыеСвойстваНоменклатурыИБ() Экспорт
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваНоменклатурыИБ");
	
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗначенияРеквизитовОбъектаЛокальная", Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПодготовкаСпискаИсходящихДокументов

Функция ПодготовитьВТДляСпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц= Новый Массив;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" ИЛИ ТипыДокументов = "2" ИЛИ ТипыДокументов = "5" Тогда
		ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
		ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" Тогда
		ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "2" Тогда
		ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "3" Тогда
		ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "4" Тогда
		ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Возврат МассивВременныхТаблиц;
	
КонецФункции

Процедура ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_АктОбОказанииУслуг(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка 			КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация 		КАК Организация,
	|	Документ.Контрагент 		КАК Контрагент,
	|	Документ.СуммаДокумента 	КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента	КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") 	КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") 			КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен 	КАК Проведен,
	|	Документ.Дата 		КАК Дата,
	|	Документ.Номер 		КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12 КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО (Документ.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС 	 КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НакладнаяНаРеализациюТорг12.Номенклатура КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	// связь со счетом на оплату на основании счета
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.ДокументОснование КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_РеализацияТоваровУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ВТ_Основная.ДокументОснование НЕ В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ
	|
	// связь со счетом на оплату на основании реализации и со счет фактурой
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	&ВидыЭД_ТоварнаяНакладная КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация,
	|	ВТ_Основная.Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен 	КАК Проведен,
	|	ВТ_Основная.Дата 		КАК Дата,
	|	ВТ_Основная.Номер 		КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РеализацияТоваровУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|			И ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование", ПустыеЗначенияРеквизита("Документ.НакладнаяНаРеализациюТорг12.Реквизит.ДокументОснование"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснование");
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияТоваровУслуг");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_РеализацияТоваровУслуг");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_АктОбОказанииУслуг(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка 			КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация 		КАК Организация,
	|	Документ.Контрагент 		КАК Контрагент,
	|	Документ.СуммаДокумента 	КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента	КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") 	КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") 			КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен 	КАК Проведен,
	|	Документ.Дата 		КАК Дата,
	|	Документ.Номер 		КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АктОбОказанииУслуг КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО (Документ.Ссылка = СтатусОтправляемыхВПФ.Объект)
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО (Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование)
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL 
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ 	 КАК Документ,
	|		УслугиОказанные.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииУслуг.УслугиОказанные КАК УслугиОказанные
	|			ПО ВТ_Основная.Документ = УслугиОказанные.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	// связь со счетом на оплату на основании счета
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.ДокументОснование КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_АктОбОказанииУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ВТ_Основная.ДокументОснование НЕ В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ
	|
	// связь со счетом на оплату на основании реализации и со счет фактурой
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	&ВидыЭД_АктОбОказанииУслуг КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация,
	|	ВТ_Основная.Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен 	КАК Проведен,
	|	ВТ_Основная.Дата 		КАК Дата,
	|	ВТ_Основная.Номер 		КАК Номер,
	|	0 							КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""АктОбОказанииУслуг""		КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_АктОбОказанииУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование", ПустыеЗначенияРеквизита("Документ.АктОбОказанииУслуг.Реквизит.ДокументОснование"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснование");
	
	МассивВременныхТаблиц.Добавить("Накладные_АктОбОказанииУслуг");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_АктОбОказанииУслуг");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка 			КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ЭтоАванс КАК ЭтоАванс,
	|	Документ.ДокументОснование	КАК ДокументОснование,
	|	Документ.Организация 		КАК Организация,
	|	Документ.Контрагент 		КАК Контрагент,
	|	Документ.ВалютаДокумента	КАК Валюта,
	|	Документ.СуммаДокумента 	КАК СуммаДокументаЗначение,
	|	Документ.СуммаНДС			КАК СуммаНДСТовары,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") 	КАК ID_,
	|	Документ.Проведен 			КАК Проведен,
	|	Документ.Дата 				КАК Дата,
	|	Документ.Номер 				КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.ДокументОснование ССЫЛКА Документ.НакладнаяНаРеализациюТорг12 ИЛИ Документ.ДокументОснование ССЫЛКА Документ.АктОбОказанииУслуг)
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|ГДЕ
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВЫБОР
	|		КОГДА ВТ_Основная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.ЭтоАванс КАК ЭтоАванс,
	|	ВТ_Основная.Организация,
	|	ВТ_Основная.Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.ID_,
	|	"""" 											КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен 	КАК Проведен,
	|	ВТ_Основная.Дата 		КАК Дата,
	|	ВТ_Основная.Номер 		КАК Номер,
	|	ВТ_Основная.СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""СчетФактураВыданный"" КАК Тип,
	|	ВТ_Основная.ФормироватьУПД      КАК ФормироватьУПД,
	|	ВТ_Основная.ДокументОснование   КАК ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаОснованияВДиадок.Значение, """") КАК ДокументОснованиеID,
	|	ВТ_Основная.ОснованиеФормированияСчета
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаОснованияВДиадок
	|		ПО (ВТ_Основная.ДокументОснование = ИдентификаторДокументаОснованияВДиадок.Объект)
	|			И (ИдентификаторДокументаОснованияВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоАванс", ТекстЗапроса_СчетФактура_ЭтоАванс());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|	И НЕ СЧФ_Основная.ЭтоКорректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID_ = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// связь со счетом, когда счет как самостоятельный документ
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	НакладнаяНаРеализациюТорг12.ДокументОснование КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_УПД_СЧФДОП
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НакладнаяНаРеализациюТорг12 КАК НакладнаяНаРеализациюТорг12
	|			ПО СЧФ_Основная.ДокументОснование = НакладнаяНаРеализациюТорг12.Ссылка
	|				И НакладнаяНаРеализациюТорг12.ДокументОснование НЕ В (&ПустыеЗначенияДокументОснованиеРТУ)
	|ГДЕ
	|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|
	|	СЧФ_Основная.Документ,
	|	АктОбОказанииУслуг.ДокументОснование
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииУслуг КАК АктОбОказанииУслуг
	|			ПО СЧФ_Основная.ДокументОснование = АктОбОказанииУслуг.Ссылка
	|				И АктОбОказанииУслуг.ДокументОснование НЕ В (&ПустыеЗначенияДокументОснованиеАкт)
	|ГДЕ
	|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|
	|ОБЪЕДИНИТЬ
	|
	// связь со счетом, когда счет на основании накладной и со счетом фактурой
	|ВЫБРАТЬ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.ДокументОснование
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ДокументОснование НЕ В (&ПустыеЗначенияДокументОснованиеСЧФ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	&ВидыЭД_СчетФактура КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация,
	|	СЧФ_Основная.Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID_,
	|	ВЫБОР 
	|		КОГДА СЧФ_Основная.ЭтоАванс
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_СЧФДОП
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УПД_СЧФДОП
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|ГДЕ
	|	НЕ СЧФ_Основная.ЭтоАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование
	|ПОМЕСТИТЬ УПД_СЧФДОП_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснованиеРТУ"	, ПустыеЗначенияРеквизита("Документ.НакладнаяНаРеализациюТорг12.Реквизит.ДокументОснование"));
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснованиеАкт"	, ПустыеЗначенияРеквизита("Документ.АктОбОказанииУслуг.Реквизит.ДокументОснование"));
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснованиеСЧФ"	, ПустыеЗначенияРеквизита("Документ.СчетФактураВыданный.Реквизит.ДокументОснование"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснованиеРТУ");
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснованиеАкт");
	Запрос.Параметры.Удалить("ПустыеЗначенияДокументОснованиеСЧФ");
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "5" Тогда
		МассивВременныхТаблиц.Добавить("УПД_СЧФДОП");
		МассивВременныхТаблиц.Добавить("Связь_УПД_СЧФДОП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация,
	|	СЧФ_Основная.Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта,
	|	СЧФ_Основная.Проведен,
	|	СЧФ_Основная.Дата,
	|	СЧФ_Основная.Номер,
	|	СЧФ_Основная.ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|				И СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ФункцияЭД_КСЧФ
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ СчетФактураВыданный
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО СЧФ_Основная.Документ = УПД_СЧФДОП.Документ
	|ГДЕ
	|	УПД_СЧФДОП.Документ ЕСТЬ NULL";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетФактураВыданный");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_СчетНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка 			КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация 		КАК Организация,
	|	Документ.Контрагент 		КАК Контрагент,
	|	Документ.СуммаДокумента 	КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента	КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") 	КАК ID,
	|	"""" 						КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен 			КАК Проведен,
	|	Документ.Дата 				КАК Дата,
	|	Документ.Номер 				КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетНаОплату КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Материалы.СуммаНДС 	 КАК СуммаНДСТовары,
	|		0					 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату.Материалы КАК Материалы
	|			ПО ВТ_Основная.Документ = Материалы.Ссылка
	|
	|  ОБЪЕДИНИТЬ ВСЕ
	|
	|  ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		0					 КАК СуммаНДСТовары,
	|		Услуги.СуммаНДС 	 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ	КАК Документ,
	|	ВТ_Основная.Документ	КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_СчетНаОплату
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация,
	|	ВТ_Основная.Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен 	КАК Проведен,
	|	ВТ_Основная.Дата 		КАК Дата,
	|	ВТ_Основная.Номер 		КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_СчетНаОплату
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_СчетНаОплату");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_СчетНаОплату");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка 			КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация 		КАК Организация,
	|	Документ.Контрагент 		КАК Контрагент,
	|	Документ.СуммаДокумента 	КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента	КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") 	КАК ID,
	|	"""" 						КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен 			КАК Проведен,
	|	Документ.Дата 				КАК Дата,
	|	Документ.Номер 				КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12 КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_ДокументПродажи
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС 	 КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НакладнаяНаРеализациюТорг12.Номенклатура КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ	КАК Документ,
	|	ВТ_Основная.Документ	КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_НакладнаяНаРеализациюТорг12
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация,
	|	ВТ_Основная.Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен 	КАК Проведен,
	|	ВТ_Основная.Дата 		КАК Дата,
	|	ВТ_Основная.Номер 		КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 							КАК СуммаНДСУслуги,
	|	""СчетНаОплату""	 		КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_НакладнаяНаРеализациюТорг12
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_НакладнаяНаРеализациюТорг12");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_НакладнаяНаРеализациюТорг12"); 
	
КонецПроцедуры

Процедура ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") 	КАК ID,
	|	Документ.Проведен,
	|	Документ.Дата,
	|	Документ.Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|ГДЕ
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	&ВидыЭД_АктСверки КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация,
	|	ВТ_Основная.Контрагент,
	|	0 							КАК СуммаДокументаЗначение,
	|	""""					 	КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	""""						КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен 		КАК Проведен,
	|	ВТ_Основная.Дата 			КАК Дата,
	|	ВТ_Основная.Номер 			КАК Номер,
	|	0 							КАК СуммаНДСТовары,
	|	0 							КАК СуммаНДСУслуги,
	|	""АктСверкиВзаиморасчетов""	КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ АктСверкиВзаиморасчетов
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("АктСверкиВзаиморасчетов");
	
КонецПроцедуры

Функция ТекстЗапросаВременнаяТаблица_ЕстьСЧФ()
	
	Результат =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|ГДЕ
	|	НЕ СЧФ.ПометкаУдаления
	|	И (СЧФ.Проведен
	|			ИЛИ ВТ_Основная.ОтправлятьНепроведенные = ИСТИНА)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоАванс(ПсевдонимТаблицы = "Документ")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ФункцияПервичногоДокумента(ПсевдонимТаблицы = "ВТ_Основная")
	
	Результат = 
	"	ВЫБОР
	|		КОГДА ПсевдонимТаблицы.ЭтоКорректировка
	|				И ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДИС
	|		КОГДА ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДОП
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы)
	
	ПодстрокаПоиска = "ПсевдонимТаблицы";
	Если Не ЗначениеЗаполнено(ПсевдонимТаблицы) Тогда
		ПодстрокаПоиска = ПодстрокаПоиска + ".";
	КонецЕсли;
	
	Выражение = СтрЗаменить(Выражение, ПодстрокаПоиска, ПсевдонимТаблицы);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
//{ ТЕКСТЫ ЗАПРОСОВ

Функция ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного() Экспорт
	
	Возврат 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураВыданный.ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &СсылкаНаОбъект";
	
КонецФункции

//} ТЕКСТЫ ЗАПРОСОВ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает описания всех библиотек конфигурации, включая
// описание самой конфигурации.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка - имя подсистемы, например, "СтандартныеПодсистемы".
//   * Значение - Структура - описание подсистемы:
//     ** Имя - Строка - имя подсистемы.
//     ** Версия - Строка - версия подсистемы.
//     ** ЭтоКонфигурация - Булево - Истина, если данная подсистема является основной конфигурацией.
//     ** ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах интернет-поддержки.
//
Функция ОписанияПодсистемКонфигурации()

	// Используем служебный интерфейс БСП, т.к. метод ОписанияПодсистем добавлен в
	// программный интерфейс модуля ОбщегоНазначения только в версии БСП 3.0.2 и выше
	Результат = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
	
	Возврат Результат;

КонецФункции

Функция ВерсияПодсистемыБГУ()

	ИмяПодсистемы = "БухгалтерияГосударственногоУчреждения";
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда 
		ИмяПодсистемы = ИмяПодсистемы + "Базовая";
	КонецЕсли;

	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);

	Результат = ОписаниеПодсистемы.Версия;

	Возврат Результат;

КонецФункции

Функция ОтрезатьПравуюЗапятую(стр)
	
	Результат = СокрЛП(стр);
	
	Пока СтрЗаканчиваетсяНа(Результат, ",") Цикл
		Результат = Лев(Результат, СтрДлина(Результат) - 1);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьРазделитель(Стр, Префикс = "")
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Стр) Тогда
		Результат = Префикс + СокрЛП(Стр) + ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКСФ(СсылкаНаОбъект) Экспорт
	Возврат Ложь;
КонецФункции

Функция ЭтоИсправление(СсылкаНаОбъект) Экспорт
	Возврат Ложь;
КонецФункции	

Функция ЭтоНакладная(СсылкаНаОбъект) Экспорт
	
	ТипСсылки= ТипЗнч(СсылкаНаОбъект);
	
	Возврат 
	
		ТипСсылки = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12")
	ИЛИ ТипСсылки = Тип("ДокументСсылка.АктОбОказанииУслуг")
	
КонецФункции	

Функция ЭтоСчетНаОплату(СсылкаНаОбъект) Экспорт
	
	Результат = (ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетНаОплату"));
			
	Возврат Результат;
					
КонецФункции

Функция ЭтоЗаказПокупателя(СсылкаНаОбъект) Экспорт
	
	Возврат Ложь;
			  
КонецФункции		  

Функция ЭтоКорректировкаРеализации(СсылкаНаОбъект) Экспорт
	
	Возврат Ложь;	
	
КонецФункции

Функция ЭтоВозвратТоваровОтКлиента(СсылкаНаОбъект) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоВыбытиеИзОборотаМаркируемойПродукции(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ТаблицаЗначений_2_МассивСтруктур(ТаблЗнач)
	Результат = Новый Массив;
	СтрокаКлючей = "";
	Для Каждого Колонка Из ТаблЗнач.Колонки Цикл
		СтрокаКлючей = СтрокаКлючей +?(ПустаяСтрока(СтрокаКлючей), "", ",") + Колонка.Имя;
	КонецЦикла;
	Если ТипЗнч(ТаблЗнач) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого Стр Из ТаблЗнач Цикл
			ЭлементСписка = Новый  Структура(СтрокаКлючей);
			ЗаполнитьЗначенияСвойств(ЭлементСписка, Стр);
			Результат.Добавить(ЭлементСписка);
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СчетФактуранаАванс(СФ) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(СФ) = Тип("ДокументСсылка.СчетФактураВыданный")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СФ, "ВидЦенности") = Перечисления.ВидыЦенностейНДС.Аванс Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция СократитьПредставлениеТелефона(телефонСтрока)
	
	Если (СтрДлина(телефонСтрока) <= 20) Или (Найти(ТелефонСтрока, ";") = 0) Тогда
		//резать нечего
		Возврат ТелефонСтрока
	КонецЕсли;
	
	НовыйТелефон = "";
	СтарыйТелефон = ТелефонСтрока;
	Пока Найти(СтарыйТелефон, ";") > 0 Цикл
		Если (НовыйТелефон = "") Или (СтрДлина(НовыйТелефон) + Найти(СтарыйТелефон, ";") <= 20) Тогда
			//добавим кусок
			НовыйТелефон = ?(НовыйТелефон = "", "", НовыйТелефон + ";") + Лев(СтарыйТелефон, Найти(СтарыйТелефон, ";") - 1);
			СтарыйТелефон = Прав(СтарыйТелефон, СтрДлина(СтарыйТелефон) - Найти(СтарыйТелефон, ";"));
		Иначе 
			СтарыйТелефон = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйТелефон;
	
КонецФункции	

Функция ИнициализацияТаблицыСтрокТовары(ЭтоКСФ)
	
	Товары = Новый ТаблицаЗначений();
	
	Товары.Колонки.Добавить("Номенклатура");
	Товары.Колонки.Добавить("НоменклатураПредставление");
	Товары.Колонки.Добавить("Характеристика");
	Товары.Колонки.Добавить("Серия");
	Товары.Колонки.Добавить("КодНоменклатуры");  //для торг-12
	Товары.Колонки.Добавить("СтранаПроисхождения");
	Товары.Колонки.Добавить("НомерГТД");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("ЕдиницаИзмерения");
	Товары.Колонки.Добавить("КодЕдиницыИзмерения"); // для торг-12
	Товары.Колонки.Добавить("ВидУпаковки");//Для торг-12
	Товары.Колонки.Добавить("КоличествоВОдномМесте");//Для торг-12
	Товары.Колонки.Добавить("КоличествоМест");//Для торг-12
	Товары.Колонки.Добавить("Цена");
	Товары.Колонки.Добавить("СтавкаНДС");
	Товары.Колонки.Добавить("СуммаНДС");
	Товары.Колонки.Добавить("СуммаБезНДС");
	Товары.Колонки.Добавить("СуммаСНДС");
	Товары.Колонки.Добавить("ЭтоУслуга");
	Товары.Колонки.Добавить("Масса"); //Для торг-12
	Товары.Колонки.Добавить("ПризнакТоварРаботаУслуга"); // для УПД
	Товары.Колонки.Добавить("ДокументОтгрузки"); // для УПД 820 строка шапки 5а
	
	Если ЭтоКСФ Тогда 
		Товары.Колонки.Добавить("СтранаПроисхожденияДоИзменения");
		Товары.Колонки.Добавить("НомерГТДДоИзменения");
		Товары.Колонки.Добавить("КоличествоДоИзменения");
		Товары.Колонки.Добавить("ЕдиницаИзмеренияДоИзменения");
		Товары.Колонки.Добавить("ЦенаДоИзменения");
		Товары.Колонки.Добавить("СтавкаНДСДоИзменения");
		Товары.Колонки.Добавить("СуммаНДСДоИзменения");
		Товары.Колонки.Добавить("СуммаДоИзменения");
	КонецЕсли;	
	
	// Для совместимости с интеграционными модулями других конфигураций.
	// Используется в функции МенеджерИнтеграции.ПолучитьДанныеТЧ
	// при сборе контента формализованных счетов
	Товары.Колонки.Добавить("Сумма");
	
	Возврат Товары;
	
КонецФункции

Функция ПолучитьОписаниеОрганизации(СведенияОбОрганизации, СписокСвойств = "НаименованиеДляПечатныхФорм, ИНН, Свидетельство, ЮридическийАдрес, Телефоны, НомерСчета, Банк, БИК, КоррСчет")
	
	СтрокаОписанияОрганизации = "";
	
	СоответствиеПараметров =	Новый Соответствие();
	
	СоответствиеПараметров.Вставить("ПолноеНаименование",			" ");
	СоответствиеПараметров.Вставить("СокращенноеНаименование",		" ");
	СоответствиеПараметров.Вставить("НаименованиеДляПечатныхФорм",	" ");
	СоответствиеПараметров.Вставить("ИНН",							" ИНН ");
	СоответствиеПараметров.Вставить("КПП",							" КПП ");
	СоответствиеПараметров.Вставить("Свидетельство",				" ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",		" от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",				" ");
	СоответствиеПараметров.Вставить("Телефоны",						" тел.: ");
	СоответствиеПараметров.Вставить("Факс",							" факс: ");
	СоответствиеПараметров.Вставить("НомерСчета",					" р/с ");
	СоответствиеПараметров.Вставить("Банк",               			" в банке ");
	СоответствиеПараметров.Вставить("БИК",                			" БИК ");
	СоответствиеПараметров.Вставить("КоррСчет",           			" к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО",          			" Код по ОКПО ");
	
	СписокСвойств =		СписокСвойств + ?(Прав(СписокСвойств, 1) = ",", "", ",");
	ЧислоПараметров =	СтрЧислоВхождений(СписокСвойств, ",");
	Для Счетчик = 1 По ЧислоПараметров Цикл
		
		Запятая = Найти(СписокСвойств, ",");
		Если Запятая > 0 Тогда
			
			ИмяПараметра =	Лев(СписокСвойств, Запятая - 1);
			СписокСвойств =	Сред(СписокСвойств, Запятая + 1, СтрДлина(СписокСвойств));
			
			СтрокаДополнения =	"";
			СведенияОбОрганизации.Свойство(ИмяПараметра, СтрокаДополнения);
			
			Если ПустаяСтрока(СтрокаДополнения) Тогда
				Продолжить;
			КонецЕсли;
			
			Префикс = СоответствиеПараметров[ИмяПараметра];
			Если ЗначениеЗаполнено(СтрокаОписанияОрганизации) Тогда
				СтрокаОписанияОрганизации=	СтрокаОписанияОрганизации + ", ";
			КонецЕсли;
			
			СтрокаОписанияОрганизации=	СтрокаОписанияОрганизации + ?(ЗначениеЗаполнено(Префикс), Префикс, "")+ СтрокаДополнения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаОписанияОрганизации =	СокрЛП(СтрокаОписанияОрганизации);
	Пока Найти(СтрокаОписанияОрганизации, "  ") > 0 Цикл
		СтрокаОписанияОрганизации =	СтрЗаменить(СтрокаОписанияОрганизации, "  ", " ");
	КонецЦикла;
	
	Возврат СтрокаОписанияОрганизации;
	
КонецФункции

//} СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ ПОЛУЧЕНИЕ ДАННЫХ

Функция ПолучитьВидКИ(ЮрФизЛицо, ЮрАдрес) Экспорт
	
	ВладелецКИ = ЮрФизЛицо;
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВладелецКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ЮридическоеФизическоеЛицо");
	КонецЕсли;
	
	ТипВладельцаКИ = ТипЗнч(ВладелецКИ);
	
	Если ТипВладельцаКИ = Тип("СправочникСсылка.Организации") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "ЮрАдресОрганизации", "ФактАдресОрганизации");
		
	ИначеЕсли ТипВладельцаКИ = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "АдресПоПропискеФизическиеЛица", "АдресМестаПроживанияФизическиеЛица");
		
	ИначеЕсли ТипВладельцаКИ = Тип("СправочникСсылка.ЮридическиеЛица") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "ЮридическийАдресКонтрагенты", "ФактическийАдресКонтрагенты");
		
	Иначе 
		
		ВызватьИсключение НСтр("ru = 'Некорректный параметр функции ""ПолучитьВидКИ""'");
		
	КонецЕсли;
	
	Результат = Справочники.ВидыКонтактнойИнформации[ВидАдреса];
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьДанныеТЧ(Документы,
		ЭтоКСФ = Ложь, ВалютаРегламентированногоУчета = Неопределено,
		КолонкаКодаТовара = Неопределено, ФормированиеСФ = Неопределено, СчетФактура = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(КолонкаКодаТовара) Тогда 
		КолонкаКодаТовара = ИмяКолонкиКодТовара();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда 
		ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		ДокументыИтератор = Новый СписокЗначений;
		ДокументыИтератор.Добавить(СчетФактура)
	ИначеЕсли ТипЗнч(Документы) = Тип("СписокЗначений") Тогда
		ДокументыИтератор = Документы;
	Иначе 
		ДокументыИтератор = Новый СписокЗначений;
		ДокументыИтератор.Добавить(Документы)
	КонецЕсли;
	
	Товары = ИнициализацияТаблицыСтрокТовары(ЭтоКСФ);
	
	Для Каждого Документ Из ДокументыИтератор Цикл
		
		СсылкаНаДокумент = Документ.Значение;
		ТипДокумента = ТипЗнч(СсылкаНаДокумент);
		ДокументОснование = СсылкаНаДокумент;
		
		Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			ТекстЗапроса = ТекстЗапросаТабличнаяЧастьСФ();
			ДокументОснование = СсылкаНаДокумент.ДокументОснование;
			
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
			
			ТекстЗапроса = ТекстЗапросаТабличнаяЧастьТорг12();
			
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииУслуг") Тогда
			
			ТекстЗапроса = ТекстЗапросаТабличнаяЧастьАкт();
			
		ИначеЕсли ТипДокумента = тип("ДокументСсылка.СчетНаоплату") Тогда
			
			ТекстЗапроса = ТекстЗапросаТабличнаяЧастьСчет();
			
		Иначе
			
			ТекстОшибки = СтрШаблон("Ошибка сбора контента по документу %1", Строка(СсылкаНаДокумент));
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
		ТоварыПоДокументу = Запрос.Выполнить().Выгрузить();
		
		Для Каждого стр Из ТоварыПоДокументу Цикл
			
			стр2 						= Товары.Добавить();
			стр2.Номенклатура 			= стр.Номенклатура;
			стр2.НоменклатураПредставление = стр.НоменклатураПредставление;
			Если ЗначениеЗаполнено(Стр.СодержаниеУслуги) Тогда
				стр2.НоменклатураПредставление = стр.СодержаниеУслуги;
			КонецЕсли;
			
			стр2.СтранаПроисхождения	= стр.СтранаПроисхождения;
			стр2.НомерГТД 				= стр.НомерГТД;
			стр2.Количество 			= стр.Количество;
			стр2.ЕдиницаИзмерения 		= стр.ЕдиницаИзмерения;
			стр2.СтавкаНДС 			= стр.СтавкаНДС;
			стр2.СуммаНДС 				= стр.СуммаНДС;
			стр2.СуммаБезНДС = стр.СуммаБезНДС;
			стр2.СуммаСНДС = стр.СуммаСНДС;
			стр2.Цена = стр.Цена;
			стр2.Сумма = ?(стр.ЦенаВключаетНДС, стр.СуммаСНДС, стр.СуммаБезНДС);
			Если стр.ЦенаВключаетНДС 
				И ЗначениеЗаполнено(стр2.Количество) Тогда
				стр2.Цена = стр2.СуммаБезНДС / стр2.Количество;
			КонецЕсли;
			стр2.ЭтоУслуга 			= стр.ЭтоУслуга; 
			
			стр2.КодНоменклатуры 		= СокрЛП(стр.КодНоменклатуры);
			стр2.КодЕдиницыИзмерения	= СокрЛП(стр.КодЕдиницыИзмерения);
			стр2.ВидУпаковки	 		= стр.ВидУпаковки;
			стр2.КоличествоВОдномМесте	= стр.КоличествоВОдномМесте;
			стр2.КоличествоМест		= стр.КоличествоМест;
			
			Если ЗначениеЗаполнено(Стр2.СтранаПроисхождения) Тогда
				Если (НЕ ЗначениеЗаполнено(Стр2.НомерГТД) ИЛИ ПустаяСтрока(Стр2.НомерГТД.Код)) И МетодСервера(,"СтранаЧленТС", Стр2.СтранаПроисхождения.Код) Тогда
					Стр2.СтранаПроисхождения= Справочники.СтраныМира.ПустаяСсылка();
				КонецЕсли;
			Иначе
				стр2.НомерГТД = Справочники.НомераГТД.ПустаяСсылка();
			КонецЕсли;
			
			стр2.ПризнакТоварРаботаУслуга = стр.ПризнакТоварРаботаУслуга;
			стр2.ДокументОтгрузки = ДокументОснование;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Товары;
	
КонецФункции

Функция ПолучитьБанковскийСчет(Док)
	
	Результат = Неопределено;
	
	ЕстьРеквизитыЛС = Док.Метаданные().Реквизиты.Найти("РеквизитыЛицевогоСчета") <> Неопределено;
	
	Если ЕстьРеквизитыЛС Тогда
		Результат = Док.РеквизитыЛицевогоСчета;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат)
		И ТипЗнч(Док) = Тип("ДокументСсылка.АктОбОказанииУслуг")
		И ЗначениеЗаполнено(Док.ДокументОснование)
		И ТипЗнч(Док.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		Результат = Док.ДокументОснование.РеквизитыЛицевогоСчета;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьБанковскийСчетКонтрагента(Док)
	
	Результат = Неопределено;
	
	ЕстьРеквизитыЛС = Док.Метаданные().Реквизиты.Найти("РасчетныйСчетКонтрагента") <> Неопределено;
	
	Если ЕстьРеквизитыЛС Тогда
		Результат = Док.РасчетныйСчетКонтрагента;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) И ЭтоНакладная(Док) Тогда 
		Результат = ПолучитьБанковскийСчетКонтрагентаПоДокументуОснования(Док);
	ИначеЕсли Не ЗначениеЗаполнено(Результат) И ЭтоСчетНаОплату(Док) Тогда
		Результат = ПолучитьБанковскийСчетКонтрагентаПоСчетуНаОплату(Док);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьБанковскийСчетКонтрагентаПоДокументуОснования(Док)
	
	Результат = Неопределено;
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "ДокументОснование");
	Если ЭтоСчетНаОплату(ДокументОснование) Тогда
		Результат = ПолучитьБанковскийСчетКонтрагентаПоСчетуНаОплату(ДокументОснование);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьБанковскийСчетКонтрагентаПоСчетуНаОплату(СсылкаНаОбъект)
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "СчетПлательщика");
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьПодразделениеИзДокумента(ДокСсылка)
	Возврат ?(ДокСсылка.Подразделение.ОбособленноеПодразделение, ДокСсылка.Подразделение.Наименование, "");
КонецФункции

Функция ПолучитьБанковскийСчетПоУмолчанию(ЮрФизЛицо)
	
	ЗапросПоБанковскимСчетам=	Новый Запрос;
	ЗапросПоБанковскимСчетам.Текст=	
	//{
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеИКазначейскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеИКазначейскиеСчета.Код КАК НомерСчета
		|ИЗ
		|	Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеИКазначейскиеСчета
		|ГДЕ
		|	БанковскиеИКазначейскиеСчета.Владелец = &Владелец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыЛицевыхСчетов.Ссылка,
		|	РеквизитыЛицевыхСчетов.Владелец.Код
		|ИЗ
		|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
		|ГДЕ
		|	РеквизитыЛицевыхСчетов.Владелец.Владелец = &Владелец";
	//}
	ЗапросПоБанковскимСчетам.УстановитьПараметр("Владелец", ЮрФизЛицо);
	
	РезультатЗапросаПоБанковскимСчетам=	ЗапросПоБанковскимСчетам.Выполнить();
	Если РезультатЗапросаПоБанковскимСчетам.Пустой() Тогда
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			БанковскийСчет= Справочники.БанковскиеИКазначейскиеСчета.ПустаяСсылка();
		Иначе
			БанковскийСчет= Справочники.ЛицевыеСчета.ПустаяСсылка();
		КонецЕсли;
	Иначе	
		Выборка=	РезультатЗапросаПоБанковскимСчетам.Выбрать();
		Выборка.Следующий();
		БанковскийСчет= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат БанковскийСчет;
	
КонецФункции

Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СчетСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
  		|	НакладнаяНаРеализациюТорг12.Ссылка КАК Ссылка
      	|ИЗ
      	|	Документ.НакладнаяНаРеализациюТорг12 КАК НакладнаяНаРеализациюТорг12
     	|ГДЕ
      	|	НакладнаяНаРеализациюТорг12.ДокументОснование = &СчетНаОплатуПокупателю
      	|	И НакладнаяНаРеализациюТорг12.ПометкаУдаления = ЛОЖЬ";
				  
	Запрос.УстановитьПараметр("СчетНаОплатуПокупателю", СчетСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");		
	
КонецФункции

Функция ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(СчетФактура) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Договор КАК Договор
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НакладнаяНаРеализациюТорг12 КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Договор
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииУслуг КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура");
	
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ДокументСсылка) Экспорт
	
	СФСсылка= 	Неопределено;
	Запрос= 	Новый Запрос;
	
	Запрос.Текст= 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ";
			
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СФСсылка= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат СФСсылка;
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализации(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(ДокументСсылка) Экспорт
	
	СчетНаОплату= Неопределено;
	
	Если ЗначениеЗаполнено(ДокументСсылка.ДокументОснование)
		И ТипЗнч(ДокументСсылка.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		СчетНаОплату= ДокументСсылка.ДокументОснование; 
	КонецЕсли;
	
	Возврат СчетНаОплату;			
	
КонецФункции

Функция ПолучитьЗаказПокупателяНаОснованииРТУ(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСФОснованиеПоИСФ_КСФ(ИСФ_КСФ) Экспорт
	
	Возврат Неопределено;

КонецФункции

Функция ПолучитьДанныеДляФормированияУПД(ДокСсылка, ФункцияУПД)
	
	Если ФункцияУПД = "СЧФДОП" ИЛИ ФункцияУПД = "СЧФ" Тогда
		
		ДанныеДляФормированияСчетФактуры = СформироватьДанныеДляПечати(ДокСсылка, Ложь);
		
		ДанныеДляФормированияУПД = Новый Структура("ДанныеШапки", Новый Структура);
		
		Для Каждого КлючИЗначение Из ДанныеДляФормированияСчетФактуры Цикл
			
			Если КлючИЗначение.Ключ = "ТабличнаяЧасть" Тогда
				ДанныеДляФормированияУПД.Вставить("ТаблицаТоваров", КлючИЗначение.Значение);
			Иначе
				ДанныеДляФормированияУПД.ДанныеШапки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ФункцияУПД = "СЧФДОП" Тогда 
			ТаблицаНакладных = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокСсылка);
			Если ЗначениеЗаполнено(ТаблицаНакладных) Тогда
				ДанныеДляФормированияУПД.ДанныеШапки.Вставить("ДатаОтгрузки", ТаблицаНакладных[0].Дата);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ДанныеШапки	 = ДанныеШапки(ДокСсылка);
		ДанныеТЧ	 = ПолучитьДанныеТЧ(ДокСсылка, , Неопределено, Неопределено, Ложь);
		ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ДанныеТЧ);
		
		ДанныеДляФормированияУПД = Новый Структура;
		ДанныеДляФормированияУПД.Вставить("ДанныеШапки", ДанныеШапки);
		ДанныеДляФормированияУПД.Вставить("ТаблицаТоваров", ДанныеТЧ);
	
	КонецЕсли;
	
	Если ФункцияУПД = "СЧФДОП" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "InvoiceAndBasic");
	ИначеЕсли ФункцияУПД = "ДОП" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "Basic");
	ИначеЕсли ФункцияУПД = "СЧФ" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "Invoice");
	КонецЕсли;
	ДанныеДляФормированияУПД.ДанныеШапки.Вставить("ДатаНомерСвидетельстваОРегистрации", ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляФормированияУПД.ДанныеШапки.Организация));
	
	Возврат ДанныеДляФормированияУПД;
	
КонецФункции

Функция ПолучитьДанныеНоменклатуры(Номенклатура, ТекущийСчетУчета) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СчетУчета");
	
	Результат.Вставить("СтавкаНДС"		 , Номенклатура.СтавкаНДС);
	Результат.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
	
	Если ТекущийСчетУчета <> МетодСервера("Модуль_ИнтеграцияБГУ20", "ПолучитьСчетПоКоду", "105.00") Тогда
		Результат.Вставить("СчетУчета", ТекущийСчетУчета);
	Иначе
		Результат.Вставить("СчетУчета", МетодСервера("Модуль_ИнтеграцияБГУ20", "ПолучитьСчетПоКоду", Номенклатура.СчетУчета));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетПоКоду(КодСчета) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(КодСчета) Тогда
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		
		Попытка
			Результат = БухгалтерскийУчетКлиентСервер.СчетПоКоду(КодСчета, ТекущаяДатаСеанса);
		Исключение
			Результат = БухгалтерскийУчетПовтИсп.СчетПоКоду(КодСчета, ТекущаяДатаСеанса);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеСчетовУчетаМЗ(Организация) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("СписокСчетовУчета" , Новый СписокЗначений);
	Результат.Вставить("ВидыСубконтоСчетов", УправлениеМатериальнымиЗапасами.ПолучитьДанныеСчетовУчетаМЗ(Организация, Результат.СписокСчетовУчета));
	
	Возврат Результат;
	
КонецФункции

// См. метод "ПередФормированиемПечатнойФормыСверкиВзаиморасчетов" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- См. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПередФормированиемПечатнойФормыСверкиВзаиморасчетов(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.АктСверкиВзаиморасчетов");
							
	НоваяПФ = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	
	НоваяПФ.ИмяМакета 	= "АктСверки";
	НоваяПФ.ИмяВРЕГ		= ВРЕГ(НоваяПФ.ИмяМакета);
	НоваяПФ.Экземпляров = 1;
	
	ПараметрыОтправки = Новый Структура;
	
	ПараметрыОтправки.Вставить("Получатель"	, "");
	ПараметрыОтправки.Вставить("Тема"		, "");
	ПараметрыОтправки.Вставить("Текст"		, "");
							
	ПараметрыМетодаПечати.ПараметрыВывода.Вставить("ДоступнаПечатьПоКомплектно"	, Ложь);
	ПараметрыМетодаПечати.ПараметрыВывода.Вставить("ПараметрыОтправки"			, ПараметрыОтправки);
	
КонецПроцедуры // ПередФормированиемПечатнойФормыСверкиВзаиморасчетов()

Функция ПараметрыСчетаФактуры(СчетФактура) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПараметрыСчетаНаОплату(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура			 - ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат		 = Неопределено;
	
	Возврат Результат;
	
КонецФункции

//} ПОЛУЧЕНИЕ ДАННЫХ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ РАБОТА С КОНТЕНТОМ

////////////////////////////////////////////////////////////////////////////////
//{ ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьСтруктурированноеОписаниеАдреса(AddressContent, СведенияОбОрганизации, ЮрФизЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса = "")
	
	ВладелецКИ	 = ХранилищеКонтактнойИнформацииОбъекта(ЮрФизЛицо);
	ВидАдреса	 = ПолучитьВидКИ(ВладелецКИ, Юрадрес);
	Адрес		 = АдресЮрФизЛица(ВладелецКИ, ВидАдреса, ДатаДокумента);
	
	Если Не ЗначениеЗаполнено(Адрес.ЗначенияПолей) Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураАдреса = СведенияОбАдресе(Адрес.ЗначенияПолей);
	
	// Обертка для корректного заполнения адреса доставки (грузополучателя) по данным документа:
	// код страны определяем по фактическому адресу грузополучателя, а представление подставляем из документа
	Если ЗначениеЗаполнено(ПредставлениеАдреса) Тогда 
		СтруктураАдреса.СохраненноеПредставление = ПредставлениеАдреса;
	// используем пользовательское представление адреса
	Иначе
	    СтруктураАдреса.СохраненноеПредставление = ?(ЮрАдрес, СведенияОбОрганизации.ЮридическийАдрес, СведенияОбОрганизации.ФактическийАдрес);
	КонецЕсли;
	
	Заполнить_AddressInfo(AddressContent, СтруктураАдреса);
	
КонецПроцедуры

Функция ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(Организация)

	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП", Организация);

КонецФункции

Функция СформироватьПредставлениеКонтрагентаДляАкта(Организация, ДатаОперации)
	
	СведенияОбОрганизации = РеквизитыЮрФизЛица(Организация, ДатаОперации);
	Возврат ОтрезатьПравуюЗапятую(ДобавитьРазделитель(СведенияОбОрганизации.ПолноеНаименование) + ДобавитьРазделитель(СведенияОбОрганизации.ИНН, "ИНН: ") + ДобавитьРазделитель(СведенияОбОрганизации.КПП, "КПП: "));
	
КонецФункции

// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату. 
// Табличный документ формируется средствами Диадок
//
// Параметры:
//  ДокСсылка - ДокументСсылка	- документ, на основании которого формируем печатную форму 
// 
// Возвращаемое значение:
//   Структура
//
Функция РезультатВизуализацииСчетаНаОплатуСредствамиДиадок(ДокСсылка, ПараметрыОтправкиНаСогласование =  Неопределено, ФИОПодписанта = "") Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров	 = ПолучитьДанныеТЧ(ДокСсылка, , Неопределено, , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	Таб = Новый ТабличныйДокумент;
	
	Макет	= ОбработкаОбъект.ПолучитьМакет("СчетНаОплату");
	Шапка1	= Макет.ПолучитьОбласть("ШапкаСчета1");			
	
	СведенияОбОрганизации = РеквизитыЮрФизЛица(ДанныеШапки.Организация, , ДанныеШапки.БанковскийСчетОрганизации);
	Если ЗначениеЗаполнено(СведенияОбОрганизации.Банк) Тогда
		Шапка1.Параметры.БанкПолучателя 	 = СведенияОбОрганизации.Банк;
		Шапка1.Параметры.БИКБанкаПолучателя  = СведенияОбОрганизации.БИК;
		Шапка1.Параметры.СчетБанкаПолучателя = СведенияОбОрганизации.КоррСчет;
		Шапка1.Параметры.СчетПолучателя 	 = СведенияОбОрганизации.НомерСчета;
		Шапка1.Параметры.ИННПолучателя 		 = СведенияОбОрганизации.ИНН;
		Шапка1.Параметры.КПППолучателя 		 = СведенияОбОрганизации.КПП;
		Шапка1.Параметры.Получатель 		 = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
	КонецЕсли;	
	Таб.Вывести(Шапка1);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	
	Шапка2 = Макет.ПолучитьОбласть("ШапкаСчета2");
	Шапка2.Параметры.Заголовок = СтрШаблон("Счет на оплату № %1 от %2",
		ДатаНомер.НомерДокумента,
		Формат(ДатаНомер.ДатаДокумента, "ДФ=dd.MM.yyyy"));
	Таб.Вывести(Шапка2);
	
	ОписаниеОрганизации = ПолучитьОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	Шапка3 = Макет.ПолучитьОбласть("ШапкаСчета3");
	Шапка3.Параметры.Поставщик = ОписаниеОрганизации;
	Таб.Вывести(Шапка3);
	
	СведенияОбКонтрагенте = РеквизитыЮрФизЛица(ДанныеШапки.Контрагент, , ДанныеШапки.БанковскийСчетКонтрагента);
	
	ОписаниеКонтрагента = ПолучитьОписаниеОрганизации(СведенияОбКонтрагенте, "НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	Шапка4 =  Макет.ПолучитьОбласть("ШапкаСчета4");
	Шапка4.Параметры.Покупатель = ОписаниеКонтрагента;
	Таб.Вывести(Шапка4);
	
	ЕстьСтавкаБезНДС	= Ложь;
	
	ОбластьНомерСтроки 	= Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКолонкаКодов = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьДанные 		= Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОбластьСкидка		= Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСумма		= Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
	
	Таб.Вывести(ОбластьНомерСтроки);
	Таб.Присоединить(ОбластьДанные);
	Таб.Присоединить(ОбластьСумма);
	
	ОбластьКолонкаТовар = Макет.Область("Товар");
	// Делаем по аналогии с типовым механизмом
	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки + Макет.Область("Скидка").ШиринаКолонки;
						
	ОбластьНомерСтроки 	= Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьКолонкаКодов = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
	ОбластьДанные 		= Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидка		= Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСумма		= Макет.ПолучитьОбласть("Строка|Сумма");
	
	СуммаВсего 			= 0;
	СуммаВсегоНДС 		= 0;
	НомерПП 			= 0;
				
	Для Каждого Стр Из ТаблицаТоваров Цикл
		
		НомерПП = НомерПП + 1;
		ОбластьНомерСтроки.Параметры.НомерСтроки = НомерПП;
		Таб.Вывести(ОбластьНомерСтроки);
		
		ПараметрыЗаполнения = Новый Структура("Товар, Количество, ЕдиницаИзмерения, Цена", Стр.НоменклатураПредставление, Стр.Количество, Строка(Стр.ЕдиницаИзмерения), Стр.Цена);
		ОбластьДанные.Параметры.Заполнить(ПараметрыЗаполнения);
		Таб.Присоединить(ОбластьДанные);
		
		ОбластьСумма.Параметры.Сумма = Стр.Сумма;
		Таб.Присоединить(ОбластьСумма);
						
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДС) Тогда
			ЕстьСтавкаБезНДС = Истина;
		КонецЕсли;
		
		СуммаВсего		= СуммаВсего 		+ Стр.сумма;
		СуммаВсегоНДС	= СуммаВсегоНДС 	+ Стр.СуммаНДС;
				
	КонецЦикла;
	
	ЦенаВключаетНДС = ДанныеШапки.ЦенаВключаетНДС;
	СуммаВсегоСНДС 	= СуммаВсего + ?(ЦенаВключаетНДС, 0, СуммаВсегоНДС);
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Таб.Вывести(Подвал);
							
	ПодвалИтого = Макет.ПолучитьОбласть("ПодвалИтого");
	ПодвалИтого.Параметры.Всего = СуммаВсего; 
	Таб.Вывести(ПодвалИтого);
			
	ПодвалНДС = Макет.ПолучитьОбласть("ПодвалНДС");
	Если СуммаВсегоНДС <> 0 Тогда
		ПодвалНДС.Параметры.НДС = ?(ЦенаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
		ПодвалНДС.Параметры.ВсегоНДС = Формат(СуммаВсегоНДС, "ЧЦ=15; ЧДЦ=2");
	Иначе
		ПодвалНДС.Параметры.НДС = "Без налога (НДС)";
		ПодвалНДС.Параметры.ВсегоНДС = "-";
	КонецЕсли;
	Таб.Вывести(ПодвалНДС);
	
	ПодвалИтого = Макет.ПолучитьОбласть("ПодвалИтогоКОплате");
	ПодвалИтого.Параметры.ИтогоКОплате = СуммаВсегоСНДС;
	Таб.Вывести(ПодвалИтого);
	
	ПодвалСуммаПрописью = Макет.ПолучитьОбласть("ПодвалСуммаПрописью");
	ПодвалСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТаблицаТоваров.Количество() 
													+ ", на сумму "+ Формат(СуммаВсегоСНДС,"ЧЦ=15; ЧДЦ=2") + " " + СокрП(ДанныеШапки.ВалютаДокумента);
	
    ПодвалСуммаПрописью.Параметры.СуммаПрописью = ЧислоПрописью(СуммаВсегоСНДС, , МетодСервера("ПечатныеФормы", "ПараметрыИсчисленияВалюты", ДанныеШапки.ВалютаДокументаКод));
	Таб.Вывести(ПодвалСуммаПрописью);
	
	ПодвалСчета = Макет.ПолучитьОбласть("ПодвалСчета");
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		ПодвалСчета.Параметры.ФИОРуководителя = ?(ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта), ПараметрыОтправкиНаСогласование.ФИОПодписанта,
												?(ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПолучателя), ПараметрыОтправкиНаСогласование.ФИОПолучателя, "_"));
	Иначе 	
		ПодвалСчета.Параметры.ФИОРуководителя = ФИОПодписанта;
	КонецЕсли;	
	Таб.Вывести(ПодвалСчета);
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыйРезультатВизуализацииСчетаНаОплату");
	
	Результат.Таблица 			= Таб;
	Результат.СписокОшибок 		= "";
	Результат.ИмяФайла			= МетодСервера("Модуль_ИнтеграцияУниверсальный", "ИмяФайлаПечатнойФормы", "Счет №", ДатаНомер.НомерДокумента, ДатаНомер.ДатаДокумента);
	Результат.Дата				= ДатаНомер.ДатаДокумента;
	Результат.Номер				= ДатаНомер.НомерДокумента;
	Результат.Сумма				= СуммаВсегоСНДС;
	Результат.СуммаНДС			= СуммаВсегоНДС;
	Результат.ДокументБезНДС	= ?(ЕстьСтавкаБезНДС И СуммаВсегоНДС = 0, Истина, Ложь);
	
	Возврат Результат;	
	
КонецФункции //РезультатВизуализацииСчетаНаОплатуСредствамиДиадок()

Функция СформироватьМетуСчетаНаОплату(ДокументСсылка) Экспорт
	
	Шапка			 = ДанныеШапки(ДокументСсылка);
	ТабличнаяЧасть	 = ПолучитьДанныеТЧ(ДокументСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	ДатаНомер = Шапка.ДатаНомерДокумента;
	
	СуммаНДС = ТабличнаяЧасть.Итог("СуммаНДС");
	
	МассивСтрокиБезНДС= ТабличнаяЧасть.НайтиСтроки(Новый Структура("СтавкаНДС", МенеджерИнтеграции_СтавкаБезНДС()));
	Если МассивСтрокиБезНДС.Количество() > 0 Тогда
		ЕстьСтавкаБезНДС= Истина;	
	Иначе 
		ЕстьСтавкаБезНДС= Ложь;
	КонецЕсли;
	
	МетаСчетаНаОплату =	Новый Структура;
	МетаСчетаНаОплату.Вставить("Дата", 		ДатаНомер.ДатаДокумента);
	МетаСчетаНаОплату.Вставить("Номер", 	ДатаНомер.НомерДокумента);
	МетаСчетаНаОплату.Вставить("Сумма", 	Шапка.СуммаДокумента);
	МетаСчетаНаОплату.Вставить("СуммаНДС", 	СуммаНДС);
	МетаСчетаНаОплату.Вставить("ДокументБезНДС", ?(ЕстьСтавкаБезНДС И СуммаНДС = 0, Истина, Ложь)); 
	
	Возврат МетаСчетаНаОплату;
	
КонецФункции

Функция СформироватьМетуАктаВыполненныхРабот(ДокументСсылка) Экспорт
	
	Шапка			 = ДанныеШапки(ДокументСсылка);
	ТабличнаяЧасть	 = ПолучитьДанныеТЧ(ДокументСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	ДатаНомер = Шапка.ДатаНомерДокумента;
	
	ТабличнаяЧасть.Колонки.Добавить("СуммаБезНДС");
	
	ИтогСумма=			0;
	ИтогСуммаБезНДС=	0;
	ЕстьСтавкаБезНДС= Ложь;
	
	Для каждого Стр Из ТабличнаяЧасть Цикл
		
		СуммаСНДС=		Стр.СуммаСНДС;
		СуммаБезНДС= 	Стр.СуммаБезНДС;
		
		ИтогСумма=			ИтогСумма 		+ Стр.Сумма;
		ИтогСуммаБезНДС=	ИтогСуммаБезНДС + СуммаБезНДС;
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДС) Тогда
			ЕстьСтавкаБезНДС= Истина;	
		КонецЕсли;
						
	КонецЦикла;
	
	МетаАктаВыполненныхРабот =	Новый Структура;
	МетаАктаВыполненныхРабот.Вставить("Дата", 	ДатаНомер.ДатаДокумента);
	МетаАктаВыполненныхРабот.Вставить("Номер", 	ДатаНомер.НомерДокумента);
	МетаАктаВыполненныхРабот.Вставить("Сумма", 	Шапка.СуммаДокумента);
	МетаАктаВыполненныхРабот.Вставить("СуммаНДС", ИтогСумма - ИтогСуммаБезНДС);
	МетаАктаВыполненныхРабот.Вставить("ДокументБезНДС", ?(ЕстьСтавкаБезНДС И (ИтогСумма - ИтогСуммаБезНДС) = 0, Истина, Ложь));
	
	Возврат МетаАктаВыполненныхРабот;
	
КонецФункции

Функция СтруктурированноеПредставлениеОснования(ДокСсылка)
	
	ДоговорКонтрагента = ДокСсылка.Договор;
	
	Ground = Новый Структура;
	Ground.Вставить("GroundName", "");
	Ground.Вставить("GroundNumber", "");
	Ground.Вставить("GroundDate", "");
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Ground.Вставить("GroundName", 	ДоговорКонтрагента.Наименование);
		Ground.Вставить("GroundNumber", ДоговорКонтрагента.НомерДоговора);
		Ground.Вставить("GroundDate", 	ДоговорКонтрагента.ДатаДоговора);
	КонецЕсли;
	
	Возврат  Ground;
	
КонецФункции

Функция СтруктурированноеПредставлениеОснованияУПД(ДокументСсылка)
	
	Результат = Новый Структура;
	Результат.Вставить("GroundName", 	"");
	Результат.Вставить("GroundNumber", 	"");
	Результат.Вставить("GroundDate", 	Дата(1, 1, 1));
	
	Результат.Вставить("ОснованиеСсылка");
	Результат.Вставить("ПредставлениеВТекстеОшибки"	, "основании");
	
	Договор	= Неопределено;
	
	Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(ДокументСсылка), "Договор") Тогда 
		Договор = ДокументСсылка.Договор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) 
		И ТипЗнч(Договор) = Тип("СправочникСсылка.Договоры") Тогда
		
		Результат.GroundName		= "Договор"; 	
		Результат.GroundNumber		= Договор.НомерДоговора;
		Результат.GroundDate		= Договор.ДатаДоговора; 
		Результат.ОснованиеСсылка	= Договор;
		
	КонецЕсли;
	
	Возврат  Результат;
	
КонецФункции

Процедура ЗаполнитьСведенияОПередаче(Content, ДокументСсылка, ФункцияУПД, ДопПараметры)
	
	КоллекцияДокументНосительОснования	= Новый Массив;
	
	ДобавленныеОснования = Новый Массив;
				
	Если ФункцияУПД = "СЧФДОП" ИЛИ ФункцияУПД = "СЧФ" Тогда
		// в этом случае параметр ДокументСсылка это Счет фактура выданный
		Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактураВыданный.ТабличнаяЧасть.ДокументыОснования") Тогда
			Для Каждого СтрокаТЧ Из ДокументСсылка.ДокументыОснования Цикл
				КоллекцияДокументНосительОснования.Добавить(СтрокаТЧ.ДокументОснование);	
			КонецЦикла;			
		Иначе
			Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(ДокументСсылка), "ДокументОснование") Тогда
				КоллекцияДокументНосительОснования.Добавить(ДокументСсылка.ДокументОснование);
			КонецЕсли;					
		КонецЕсли;
		
	Иначе
		// в этом случае параметр ДокументСсылка это документ реализации
		КоллекцияДокументНосительОснования.Добавить(ДокументСсылка);
	КонецЕсли;
	
	УказыватьОтсутствиеОснованияУПД = СвойствоСтруктуры(ДопПараметры, "УказыватьОтсутствиеОснованияУПД", Ложь);
	
	Для Каждого ДокументМассива Из КоллекцияДокументНосительОснования Цикл
		
		СтруктураОснования = СтруктурированноеПредставлениеОснованияУПД(ДокументМассива);
		
		Если ЗначениеЗаполнено(СтруктураОснования.GroundName) Тогда
			
			Если ДобавленныеОснования.Найти(СтруктураОснования.ОснованиеСсылка) = Неопределено Тогда
				
				ДобавленныеОснования.Добавить(СтруктураОснования.ОснованиеСсылка);
				
				TransferBase = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_TransferBase");
				Content.TransferInfo.TransferBases.Добавить(TransferBase);
				
				Если Не ЗначениеЗаполнено(СтруктураОснования.GroundDate) И УказыватьОтсутствиеОснованияУПД Тогда
					ЗаполнитьTransferBaseКакОтсутствует(TransferBase);
				Иначе
					ЗаполнитьTransferBaseПоДаннымОснования(TransferBase, СтруктураОснования);
				КонецЕсли;
				
				СлужебнаяИнформация = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяСлужебнаяИнформацияОснованияПередачи");
				СлужебнаяИнформация.ОснованиеСсылка				= СтруктураОснования.ОснованиеСсылка;
				СлужебнаяИнформация.ПредставлениеВТекстеОшибки	= СтруктураОснования.ПредставлениеВТекстеОшибки;
				
				ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(TransferBase, СлужебнаяИнформация);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДобавленныеОснования.Количество() = 0 Тогда
		
		TransferBase = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_TransferBase");
		Content.TransferInfo.TransferBases.Добавить(TransferBase);
				
		ЗаполнитьTransferBaseКакОтсутствует(TransferBase);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьTransferBaseПоДаннымОснования(TransferBase, СтруктураОснования)
	
	TransferBase.DocumentName	= СтруктураОснования.GroundName;
	TransferBase.DocumentNumber	= СтруктураОснования.GroundNumber;
	TransferBase.DocumentDate	= СтруктураОснования.GroundDate;
	TransferBase.DocumentInfo	= "";
	
КонецПроцедуры

Процедура ЗаполнитьTransferBaseКакОтсутствует(TransferBase)
	
	TransferBase.DocumentName	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДокументОснованиеОтгрузкиОтсутствует");
	TransferBase.DocumentNumber	= "";
	TransferBase.DocumentDate	= Дата(1, 1, 1);
	TransferBase.DocumentInfo	= "";

КонецПроцедуры

Процедура ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, ПредставлениеАдреса = "")
	
	СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента);
	
	Если стрДлина(СведенияОбОрганизации.ИНН) <> 12 Тогда
		НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ЭтоИП = Ложь;
	Иначе
		Если типЗнч(юрФизЛицо) = тип("СправочникСсылка.Организации") Тогда
			//для нашей организации - данные берем из нормализованного представления физлица
			НаименованиеОрганизации = юрФизЛицо.наименованиеПолное;
		Иначе
			НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		КонецЕсли;
		
		ЭтоИП = Истина;
		
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.IsSoleProprietor = ЭтоИП;
	OrganizationInfo.SameAsSellerOrBuyer = Ложь;
	OrganizationInfo.Ссылка = ЮрФизЛицо;
	
	ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address,
		СведенияОбОрганизации, ЮрФизЛицо, Ложь, ДатаДокумента, ПредставлениеАдреса);
	
КонецПроцедуры

Функция ПолучитьГоловноеЮрлицо(ЮрФизЛицо)
	
	ГоловноеЮрЛицо = "";

	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		ГоловноеЮрЛицо = ЮрФизЛицо.ГоловнаяОрганизация;
	КонецЕсли;
	
	Возврат ГоловноеЮрЛицо;
КонецФункции	

Процедура ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации = Неопределено, ЮрАдрес, АдресДляСФ = Ложь, КППГрузоотправителя = "", ПредставлениеАдреса = "")

	ГоловноеЮрЛицо = "";
	
	Если АдресДляСФ = Истина Тогда
		ГоловноеЮрЛицо = ПолучитьГоловноеЮрлицо(ЮрФизЛицо);
		
		Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
			СведенияОПодразделении 	= РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			СведенияОбОрганизации	= РеквизитыЮрФизЛица(ГоловноеЮрЛицо, ДатаДокумента, БанковскийСчетОрганизации);
			СведенияОбОрганизации.КПП = СведенияОПодразделении.КПП;
		Иначе
			СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
		КонецЕсли;	
	Иначе
		СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
	КонецЕсли;

	если стрДлина(СведенияОбОрганизации.ИНН)<>12 Тогда 
		НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ЭтоИП = Ложь;
	Иначе 
		Если типЗнч(юрФизЛицо) = тип("СправочникСсылка.Организации") Тогда 
			НаименованиеОрганизации  = юрФизЛицо.наименованиеПолное;
		Иначе 
			НаименованиеОрганизации  = СведенияОбОрганизации.ПолноеНаименование 
		КонецЕсли;	  
		ЭтоИП = Истина;
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.Inn  = СведенияОбОрганизации.ИНН;
	Если ЗначениеЗаполнено(КППГрузоотправителя) Тогда
		OrganizationInfo.Kpp  = КППГрузоотправителя;
	Иначе
		OrganizationInfo.Kpp  = СведенияОбОрганизации.КПП;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address, СведенияОбОрганизации, ГоловноеЮрЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса);
	Иначе
		ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса);
	КонецЕсли;
	OrganizationInfo.IsSoleProprietor  =  ЭтоИП;

	Если АдресДляСФ = Ложь Тогда
		OrganizationInfo.Okpo  = СведенияОбОрганизации.КодПоОкпо;
		
		Если Найти(СведенияОбОрганизации.Телефоны, "факс:") > 0 Тогда
			телефон = СокрЛП(Лев(СведенияОбОрганизации.Телефоны, Найти(СведенияОбОрганизации.Телефоны, "факс:") - 1));
			Если прав(телефон, 1) = ","  Тогда
				телефон = Лев(телефон, стрДлина(телефон) - 1);
			КонецЕсли;
			факс = СокрЛП(прав(СведенияОбОрганизации.Телефоны, СтрДлина(СведенияОбОрганизации.Телефоны) - найти(СведенияОбОрганизации.Телефоны, "факс:") - 5));
		Иначе 
			Телефон = СведенияОбОрганизации.Телефоны;
			Факс = "";
		КонецЕсли;	
		OrganizationInfo.Phone = СократитьПредставлениеТелефона(Телефон);
		OrganizationInfo.Fax   = СократитьПредставлениеТелефона(Факс) ;
		OrganizationInfo.BankAccountNumber = ?(ЗначениеЗаполнено(СведенияОбОрганизации.НомерСчета),  СведенияОбОрганизации.НомерСчета, "") ;
		OrganizationInfo.BankName  =   ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк), СведенияОбОрганизации.Банк, "");
		OrganizationInfo.BankId =  ?(ЗначениеЗаполнено(СведенияОбОрганизации.БИК), СокрЛП(СведенияОбОрганизации.БИК), "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		OrganizationInfo.вставить("Ссылка", ГоловноеЮрЛицо);
	Иначе
		OrganizationInfo.вставить("Ссылка", ЮрФизЛицо);
	КонецЕсли;

КонецПроцедуры

Процедура Заполнить_ExtendedOrganizationInfo(ExtendedOrganizationInfo, ЮрФизЛицо, ДатаДокумента, ЭтоПродавецИлиПокупатель= Ложь, БанковскийСчет= Неопределено, КППГрузоотправителя = "", ПредставлениеАдреса = "")
	
	ГоловноеЮрЛицо = ПолучитьГоловноеЮрлицо(ЮрФизЛицо);
	
	Если ЗначениеЗаполнено(ГоловноеЮрЛицо) Тогда
		ИспользуемоеЮрФизЛицо = ГоловноеЮрЛицо;
		СведенияОПодразделении = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчет);
		СведенияОбОрганизации = РеквизитыЮрФизЛица(ИспользуемоеЮрФизЛицо, ДатаДокумента, БанковскийСчет);
		СведенияОбОрганизации.КПП = СведенияОПодразделении.КПП;
	Иначе
		ИспользуемоеЮрФизЛицо = ЮрФизЛицо;
		СведенияОбОрганизации = РеквизитыЮрФизЛица(ИспользуемоеЮрФизЛицо, ДатаДокумента, БанковскийСчет);
	КонецЕсли;	
	
	ЭтоОрганизация = ТипЗнч(ИспользуемоеЮрФизЛицо) = Тип("СправочникСсылка.Организации");
	ЭтоИП = СтрДлина(СведенияОбОрганизации.ИНН) = 12;
	
	Если Не ЭтоОрганизация И НЕ ЭтоПродавецИлиПокупатель Тогда
		// для грузополучателя будем указывать именно его полное наименование.
		СведенияОбОрганизации.ПолноеНаименование = ЮрФизЛицо.ЮридическоеФизическоеЛицо.Наименование;
	КонецЕсли;
	
	ExtendedOrganizationInfo.Name = СведенияОбОрганизации.ПолноеНаименование;
	ExtendedOrganizationInfo.Inn = СведенияОбОрганизации.ИНН;
	Если ЗначениеЗаполнено(КППГрузоотправителя) Тогда
		ExtendedOrganizationInfo.Kpp = КППГрузоотправителя;
	Иначе
		ExtendedOrganizationInfo.Kpp = СведенияОбОрганизации.КПП;
	КонецЕсли;
	ExtendedOrganizationInfo.Okpo = СведенияОбОрганизации.КодПоОкпо;
	ExtendedOrganizationInfo.CorrespondentAccount = СведенияОбОрганизации.КоррСчет;
	
	ExtendedOrganizationInfo.BankAccountNumber = СокрЛП(СведенияОбОрганизации.НомерСчета);
	ExtendedOrganizationInfo.BankId = СокрЛП(СведенияОбОрганизации.БИК);
	// в некоторых случаях Банк возвращается как ссылка на справочник и компонента игнорирует такое значение, теряя данные, поэтому значение Банк преобразовано к строке
	ExtendedOrganizationInfo.BankName = ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк), Строка(СведенияОбОрганизации.Банк), "");
	
	Если найти(СведенияОбОрганизации.Телефоны, "факс:") > 0 Тогда
		телефон = СокрЛП(Лев(СведенияОбОрганизации.Телефоны, Найти(СведенияОбОрганизации.Телефоны, "факс:") - 1));
		Если прав(телефон, 1) = "," Тогда
			телефон = Лев(телефон, стрДлина(телефон) - 1);
		КонецЕсли;
	Иначе
		Телефон = СведенияОбОрганизации.Телефоны;
	КонецЕсли;
	
	ExtendedOrganizationInfo.Phone = СократитьПредставлениеТелефона(Телефон);
	
	Если ЭтоОрганизация Тогда
		ExtendedOrganizationInfo.Okdp = ИспользуемоеЮрФизЛицо.КодОКВЭД;
	КонецЕсли;
	
	Если ЭтоИП Тогда
		ExtendedOrganizationInfo.Type = "IndividualEntity";
		ExtendedOrganizationInfo.IndividualEntityRegistrationCertificate = СведенияОбОрганизации.Свидетельство;
	Иначе
		ExtendedOrganizationInfo.Type = "LegalEntity";
	КонецЕсли;
	
	ExtendedOrganizationInfo.Email = ЮрФизЛицо_АдресЭлектроннойПочты(ИспользуемоеЮрФизЛицо, ДатаДокумента, ЭтоОрганизация);
	
	Если Не ЭтоОрганизация И НЕ ЭтоПродавецИлиПокупатель Тогда
		ЗаполнитьСтруктурированноеОписаниеАдреса(ExtendedOrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, ЭтоПродавецИлиПокупатель, ДатаДокумента, ПредставлениеАдреса);
	Иначе
		ЗаполнитьСтруктурированноеОписаниеАдреса(ExtendedOrganizationInfo.Address, СведенияОбОрганизации, ИспользуемоеЮрФизЛицо, ЭтоПродавецИлиПокупатель, ДатаДокумента, ПредставлениеАдреса);
	КонецЕсли;
	
	ExtendedOrganizationInfo.Вставить("Ссылка", ИспользуемоеЮрФизЛицо);
	
КонецПроцедуры

Функция ЮрФизЛицо_АдресЭлектроннойПочты(ЮрФизЛицо, ДатаДокумента, ЭтоОрганизация)
	
	ВидКИ = ?(ЭтоОрганизация
				, Справочники.ВидыКонтактнойИнформации.EmailОрганизации
				, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
	
	Результат = ПредставлениеКонтактнойИнформацииОбъекта(ЮрФизЛицо, ВидКИ, , ДатаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция сформироватьДанныеДляПечати(СсылкаНаОбъект, ЭтоКСФ)
	
	ВалютаРегламентированногоУчета  = ВалютаРегламентированногоУчета();

	ЭтоСФ = ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный");
	ЭтоСФНаАванс = СчетФактуранаАванс(СсылкаНаОбъект);

	//сформируем список документов-оснований
	СпДокументовОснований = Новый СписокЗначений;

	Если ЗначениеЗаполнено(СсылкаНаОбъект.ДокументОснование) Тогда 
		СпДокументовОснований.Добавить(СсылкаНаОбъект.ДокументОснование);
	КонецЕсли;
	
	ДанныеДляПечати		 = ДанныеШапки(СсылкаНаОбъект); // Шапку всегда заполняем по переданному объекту
	ДанныеТабличнойЧасти = ПолучитьДанныеТЧ(СпДокументовОснований, ЭтоКСФ,  ВалютаРегламентированногоУчета, , Истина, ?(ЭтоСФ, СсылкаНаОбъект, Неопределено));
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеДляПечати, ДанныеТабличнойЧасти);
	
	Если ДанныеДляПечати.ВалютаДокумента <> ВалютаРегламентированногоУчета ИЛИ ЭтоСФНаАванс Тогда
		//счета-фактуры в уе и на аванс - выставляются только в рублях
		ДанныеДляПечати.ВалютаДокумента		 = ВалютаРегламентированногоУчета;
		ДанныеДляПечати.ВалютаДокументаКод	 = ВалютаРегламентированногоУчета.Код;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДляПечати.ВалютаДокумента) Тогда
		ДанныеДляПечати.ВалютаДокументаКод = "";
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", ТаблицаЗначений_2_МассивСтруктур(ДанныеТабличнойЧасти));
	
	//формируем список ПРС
	Запрос = Новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРС.ДатаДокумента КАК ДатаПлатежноРасчетногоДокумента,
	|	ПРС.НомерДокумента КАК НомерПлатежноРасчетногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК ПРС
	|ГДЕ
	|	ПРС.Ссылка = &Ссылка
	|	И ПРС.НомерДокумента <> """"
	|	И ПРС.ДатаДокумента <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("Ссылка", ссылкаНаОбъект);
	
	ТаблицаДатаНомерДокументовОплаты=	Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПечати.Вставить("ДатаНомерДокументовОплаты", ТаблицаЗначений_2_МассивСтруктур(ТаблицаДатаНомерДокументовОплаты));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

//} ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

//} РАБОТА С КОНТЕНТОМ
////////////////////////////////////////////////////////////////////////////////
