#Область ОписаниеПеременных

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Функция ОсновнойМодуль() Экспорт
	
	Возврат ВладелецФормы.ОсновнойМодуль();
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Результат = ВладелецФормы.МодульКлиента();
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Плагины_Отображение = "Все";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписокТиповыхПлагинов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Плагины_СтрокаПоискаПриИзменении(Элемент)
	
	УстановитьФильтрСпискаПлагинов();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_ОтображениеПриИзменении(Элемент)
	
	УстановитьФильтрСпискаПлагинов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПлагины_Список

&НаКлиенте
Процедура Плагины_СписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если Элементы.ГруппаПраво.Видимость = Ложь Тогда
			Элементы.ГруппаПраво.Видимость = Истина;
		КонецЕсли;
		
		Элементы.Плагин_Загружен.Видимость = ТекСтрока.Загружен;
		Элементы.Плагин_Загрузить.Видимость = НЕ ТекСтрока.Загружен;
		
		Элементы.Ссылка_ОткрытьПодробноеОписание.Видимость = ЗначениеЗаполнено(ТекСтрока.СсылкаНаСправку);
		
	Иначе
		
		Элементы.ГруппаПраво.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Плагин_Загрузить(Команда)
	
	ТекДанные = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ЗагрузитьПлагинИзСервиса(
		ТекДанные.Идентификатор, 
		ТекДанные.Представление, 
		ТекДанные.Версия
	);
	
	Если Не Результат.Успешно Тогда
		ВызватьИсключение("Не удалось загрузить плагин: "+Результат.ОписаниеОшибки);
	КонецЕсли;
	
	Оповестить("КонтурПлагины_ЗагруженНовыйПлагин");
	ОбновитьСписокТиповыхПлагинов();
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_СортировкаПопулярность(Команда)
	
	Плагины_Список.Сортировать("Популярность Убыв");
	Элементы.ГруппаПодменюСортировка.Заголовок = "По популярности";
	Элементы.ГруппаПодменюСортировка.Картинка = Элементы.Картинка_СортировкаУбыв.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_СортировкаДатаВыпуска(Команда)
	
	Плагины_Список.Сортировать("ДатаОбновления Убыв");
	Элементы.ГруппаПодменюСортировка.Заголовок = "По дате обновления";
	Элементы.ГруппаПодменюСортировка.Картинка = Элементы.Картинка_СортировкаУбыв.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура Плагины_СортировкаНаименование(Команда)
	
	Плагины_Список.Сортировать("Представление");
	Элементы.ГруппаПодменюСортировка.Заголовок = "По наименованию";
	Элементы.ГруппаПодменюСортировка.Картинка = Элементы.Картинка_СортировкаВозр.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодробноеОписание(Команда)
	
	ТекущиеДанные = Элементы.Плагины_Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаСправку) Тогда
		ЗапуститьПриложение(ТекущиеДанные.СсылкаНаСправку);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта = Неопределено Тогда
		КэшМодуляОбъекта = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокТиповыхПлагинов()
	
	Плагины_Список.Очистить();
	
	ЗагруженныеПлагины = Новый Соответствие();
	
	ПараметрыЗагруженных = Новый Структура();
	
	ОсновнойМодуль_ОбработатьСлужебнуюКоманду(
		КомандаПолучитьСписокЗагруженных(),
		ПараметрыЗагруженных
	);
	
	Для Каждого Плагин ИЗ ПараметрыЗагруженных.Результат Цикл
		ЗагруженныеПлагины.Вставить(Плагин.Идентификатор, Истина);
	КонецЦикла;
	
	МодульПлагиныКлиент = МодульКлиента();
	ПараметрыСобытия = МодульПлагиныКлиент.Новый_ПараметрыСлужебногоСобытия();
	
	ОсновнойМодуль_ОбработатьСлужебнуюКоманду(
		КомандаПолучитьСписокТиповых(),
		ПараметрыСобытия
	);
	
	МассивПлагинов = ПараметрыСобытия.Результат;
	
	Для Каждого Плагин ИЗ МассивПлагинов Цикл
		
		НоваяСтрока = Плагины_Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Плагин);
		
		Если ЗагруженныеПлагины.Получить(Плагин.Идентификатор) = Истина Тогда
			НоваяСтрока.Загружен = Истина;
		Иначе
			НоваяСтрока.КартинкаЗагружен = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Плагины_Список.Сортировать("Представление");
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьПлагинИзСервиса(Идентификатор, Представление, Версия)
	
	МодульКлиента = МодульКлиента();
	Результат = МодульКлиента.ЗагрузитьПлагин(
		Идентификатор,
		Представление,
		Версия,
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьФильтрСпискаПлагинов()
	
	СтруктураОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Плагины_СтрокаПоиска) Тогда
		СтруктураОтбора.Вставить("Представление", Плагины_СтрокаПоиска);
	КонецЕсли;
	
	Если Плагины_Отображение = "Рекомендованные" Тогда
		СтруктураОтбора.Вставить("Рекомендован", Истина);
	КонецЕсли;
	
	Элементы.Плагины_Список.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ОсновнойМодуль_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды)
	
	ВызывающийМодуль = ОсновнойМодуль();
	ВызывающийМодуль.КонтурПлагины_ОбработатьСлужебнуюКоманду(
		ИмяКоманды,
		ПараметрыКоманды
	);
	
КонецПроцедуры

#Область ПрограммноеПеречисление_СлужебныеКоманды

&НаКлиентеНаСервереБезКонтекста
Функция КомандаПолучитьСписокТиповых()
	Возврат "Плагины_ПолучитьСписокТиповых";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КомандаПолучитьСписокЗагруженных()
	Возврат "Плагины_ПолучитьСписокЗагруженных";
КонецФункции

#КонецОбласти

#КонецОбласти
