
//**********************************************
//{		Служебные

&НаКлиенте
Функция КонтурВнешниеСервисы()
	
	// BSLLS:GetFormMethod-off
	Возврат ПолучитьФорму("ВнешняяОбработка.КонтурВнешниеСервисы.Форма.КлиентскиеВызовы");
	// BSLLS:GetFormMethod-on
	
КонецФункции

&НаКлиенте
Функция НовыйОписаниеОповещения(ИмяПроцедуры = Неопределено, Модуль = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Если СравнитьВерсии(ОписаниеПриложения().ВерсияПриложения, "8.3") < 0 Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ИмяПроцедуры",				 ИмяПроцедуры);
		Результат.Вставить("Модуль",					 Модуль);
		Результат.Вставить("ДополнительныеПараметры",	 ДополнительныеПараметры);
		
	Иначе
		
		ПараметрыКонструктора = Новый Массив;
		ПараметрыКонструктора.Добавить(ИмяПроцедуры);
		ПараметрыКонструктора.Добавить(Модуль);
		ПараметрыКонструктора.Добавить(ДополнительныеПараметры);
		
		Результат = Новый("ОписаниеОповещения", ПараметрыКонструктора);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СинонимКонфигурации()
	
	Возврат Метаданные.Синоним;
	
КонецФункции

&НаКлиенте
Функция ОписаниеПриложения()
	
	Результат = Новый Структура;
	Результат.Вставить("СинонимКонфигурации", СинонимКонфигурации());
	
	Результат.Вставить("ВерсияОС");
	Результат.Вставить("ВерсияПриложения");
	Результат.Вставить("ИдентификаторКлиента");
	Результат.Вставить("ИнформацияПрограммыПросмотра");
	Результат.Вставить("ОперативнаяПамять");
	Результат.Вставить("Процессор");
	Результат.Вставить("ТипПлатформы");
	
	ЗаполнитьЗначенияСвойств(Результат, Новый СистемнаяИнформация);
	Результат.ТипПлатформы		   = Строка(Результат.ТипПлатформы);
	Результат.ИдентификаторКлиента = Строка(Результат.ИдентификаторКлиента);
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Версии типа "1.0.1b" сравнивать нельзя.
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
&НаКлиенте
Функция СравнитьВерсии(Знач ПерваяВерсия, Знач ВтораяВерсия, Разделитель = ".")
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(ПерваяВерсия) ИЛИ НЕ ПустаяСтрока(ВтораяВерсия) Цикл
		
		Поз = Найти(ПерваяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(ПерваяВерсия, Поз - 1));
			ПерваяВерсия = Сред(ПерваяВерсия, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(ПерваяВерсия), 0, Число(ПерваяВерсия));
			ПерваяВерсия = "";
		КонецЕсли;
		
		Поз = Найти(ВтораяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(ВтораяВерсия, Поз - 1));
			ВтораяВерсия = Сред(ВтораяВерсия, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(ВтораяВерсия), 0, Число(ВтораяВерсия));
			ВтораяВерсия = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//}		Служебные


//**********************************************
//{		Общие

&НаКлиенте
Процедура ЗаполнитьТаблицуСертификатов(СписокСертификатов)
	
	ТаблицаСертификатов.Очистить();
	
	Для Каждого Сертификат Из СписокСертификатов Цикл
		СтрокаТаблицыСертификатов = ТаблицаСертификатов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыСертификатов, Сертификат);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСертификата(Сертификат)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
	ПараметрыФормы.Вставить("Сертификат",						Сертификат);
	
	ОткрытьФорму("ВнешняяОбработка.КонтурВнешниеСервисы.Форма.ФормаСертификатаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьФайл(Режим, Заголовок, ПолноеИмяФайла)
	
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Заголовок = Заголовок;
	Диалог.ПолноеИмяФайла = ПолноеИмяФайла;
	Диалог.ПредварительныйПросмотр = Истина;
	
	Результат = "";
	Если Диалог.Выбрать() Тогда
		Результат = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		Общие


//**********************************************
//{		Обработчики событий

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяФайла = ВыбратьФайл(РежимДиалогаВыбораФайла.Открытие, "Выберите файл для подписи", ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаПодписиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяФайлаПодписи = ВыбратьФайл(РежимДиалогаВыбораФайла.Открытие, "Выберите файл подписи", ИмяФайлаПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяЗашифрованногоФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяЗашифрованногоФайла = ВыбратьФайл(РежимДиалогаВыбораФайла.Открытие, "Выберите зашифрованный файл", ИмяЗашифрованногоФайла);
	
КонецПроцедуры

//}		Обработчики событий


//**********************************************
//{		Получение списка сертификатов

&НаКлиенте
Процедура ПолучитьСписокЛокальныхСертификатов(Команда)
	
	СписокСертификатов = КонтурВнешниеСервисы().ПолучитьСписокЛокальныхСертификатов();
	ЗаполнитьТаблицуСертификатов(СписокСертификатов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокЛокальныхСертификатовАсинхронно(Команда)
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПолучитьСписокЛокальныхСертификатовАсинхронно_Завершение", ЭтаФорма);
	КонтурВнешниеСервисы().ПолучитьСписокЛокальныхСертификатов_Асинхронно(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокЛокальныхСертификатовАсинхронно_Завершение(СписокСертификатов, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьТаблицуСертификатов(СписокСертификатов);
	
КонецПроцедуры

//}		Получение списка сертификатов


//**********************************************
//{		Получение данных сертификата

&НаКлиенте
Процедура ПолучитьСертификат(Команда)
	
	Если Элементы.ТаблицаСертификатов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	Сертификат = КонтурВнешниеСервисы().ПолучитьСертификат(ДанныеСтроки.ОтпечатокСертификата);
	
	ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатАсинхронно(Команда)
	
	Если Элементы.ТаблицаСертификатов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПолучитьСертификатАсинхронно_Завершение", ЭтаФорма);
	
	КонтурВнешниеСервисы().ПолучитьСертификат_Асинхронно(ОписаниеОповещения, ДанныеСтроки.ОтпечатокСертификата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатАсинхронно_Завершение(Сертификат, ДополнительныеПараметры) Экспорт 
	
	ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

//}		Получение данных сертификата


//**********************************************
//{		Подпись

&НаКлиенте
Процедура ПодписатьДанные(Команда)
	
	Если Элементы.ТаблицаСертификатов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	ДвоичныеДанныеПодписи = КонтурВнешниеСервисы().ПодписатьДанные(Новый ДвоичныеДанные(ИмяФайла), ДанныеСтроки.ОтпечатокСертификата, ПарольКонтейнера);
	
	ИмяФайлаПодписи = ПолучитьИмяВременногоФайла("sgn");
	ДвоичныеДанныеПодписи.Записать(ИмяФайлаПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДанныеАсинхронно(Команда)
	
	Если Элементы.ТаблицаСертификатов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПодписатьДанныеАсинхронно_Завершение", ЭтаФорма);
	
	КонтурВнешниеСервисы().ПодписатьДанные_Асинхронно(ОписаниеОповещения, Новый ДвоичныеДанные(ИмяФайла), ДанныеСтроки.ОтпечатокСертификата, ПарольКонтейнера);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДанныеАсинхронно_Завершение(ДвоичныеДанныеПодписи, ДополнительныеПараметры) Экспорт 
	
	ИмяФайлаПодписи = ПолучитьИмяВременногоФайла("sgn");
	ДвоичныеДанныеПодписи.Записать(ИмяФайлаПодписи);
	
КонецПроцедуры

//{		Подпись


//**********************************************
//{		Шифрование

&НаКлиенте
Процедура ЗашифроватьДанные(Команда)
	
	Если Элементы.ТаблицаСертификатов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	Сертификат = КонтурВнешниеСервисы().ПолучитьСертификат(ДанныеСтроки.ОтпечатокСертификата);
	
	МассивСертификатов = Новый Массив;
	МассивСертификатов.Добавить(Сертификат.ДвоичныеДанные);
	
	ЗашифрованныеДвоичныеДанные = КонтурВнешниеСервисы().ЗашифроватьДанные(Новый ДвоичныеДанные(ИмяФайла), МассивСертификатов);
	ИмяЗашифрованногоФайла = ПолучитьИмяВременногоФайла("enc");
	ЗашифрованныеДвоичныеДанные.Записать(ИмяЗашифрованногоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗашифроватьДанныеАсинхронно(Команда)
	
	Если Элементы.ТаблицаСертификатов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ЗашифроватьДанныеАсинхронно_ПолучениеСертификата_Завершение", ЭтаФорма);
	
	КонтурВнешниеСервисы().ПолучитьСертификат_Асинхронно(ОписаниеОповещения, ДанныеСтроки.ОтпечатокСертификата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗашифроватьДанныеАсинхронно_ПолучениеСертификата_Завершение(Сертификат, ДополнительныеПараметры) Экспорт 
	
	МассивСертификатов = Новый Массив;
	МассивСертификатов.Добавить(Сертификат.ДвоичныеДанные);
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ЗашифроватьДанныеАсинхронно_Завершение", ЭтаФорма);
	
	КонтурВнешниеСервисы().ЗашифроватьДанные_Асинхронно(ОписаниеОповещения, Новый ДвоичныеДанные(ИмяФайла), МассивСертификатов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗашифроватьДанныеАсинхронно_Завершение(ЗашифрованныеДвоичныеДанные, ДополнительныеПараметры) Экспорт 
	
	ИмяЗашифрованногоФайла = ПолучитьИмяВременногоФайла("enc");
	ЗашифрованныеДвоичныеДанные.Записать(ИмяЗашифрованногоФайла);
	
КонецПроцедуры



//}		Шифрование


//**********************************************
//{		Расшифровка

&НаКлиенте
Процедура РасшифроватьДанные(Команда)
	
	РасшифрованныеДвоичныеДанные = КонтурВнешниеСервисы().РасшифроватьДанные(Новый ДвоичныеДанные(ИмяЗашифрованногоФайла), ПарольКонтейнера);
	ИмяРасшифрованногоФайла = ПолучитьИмяВременногоФайла();
	РасшифрованныеДвоичныеДанные.Записать(ИмяРасшифрованногоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьДанныеАсинхронно(Команда)
	
	ОписаниеОповещения = НовыйОписаниеОповещения("РасшифроватьДанныеАсинхронно_Завершение", ЭтаФорма);
	
	КонтурВнешниеСервисы().РасшифроватьДанные_Асинхронно(ОписаниеОповещения, Новый ДвоичныеДанные(ИмяЗашифрованногоФайла), ПарольКонтейнера);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьДанныеАсинхронно_Завершение(РасшифрованныеДвоичныеДанные, ДополнительныеПараметры) Экспорт 
	
	ИмяРасшифрованногоФайла = ПолучитьИмяВременногоФайла();
	РасшифрованныеДвоичныеДанные.Записать(ИмяРасшифрованногоФайла);
	
КонецПроцедуры

//}		Расшифровка


//**********************************************
//{		Проверка подписи

&НаКлиенте
Процедура ПроверитьПодпись(Команда)
	
	Сертификат = КонтурВнешниеСервисы().ПроверитьПодпись(Новый ДвоичныеДанные(ИмяФайла), Новый ДвоичныеДанные(ИмяФайлаПодписи));
	ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписьАсинхронно(Команда)
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПроверитьПодписьАсинхронно_Завершение", ЭтаФорма);
	КонтурВнешниеСервисы().ПроверитьПодпись_Асинхронно(ОписаниеОповещения, Новый ДвоичныеДанные(ИмяФайла), Новый ДвоичныеДанные(ИмяФайлаПодписи));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписьАсинхронно_Завершение(Сертификат, ДополнительныеПараметры) Экспорт 
	
	ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

//}		Проверка подписи


//**********************************************
//{		Получение сертификата из подписи

&НаКлиенте
Процедура ПолучитьСертификатИзПодписи(Команда)
	
	Сертификат = КонтурВнешниеСервисы().ПолучитьСертификатИзПодписи(Новый ДвоичныеДанные(ИмяФайлаПодписи));
	ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатИзПодписиАсинхронно(Команда)
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПолучитьСертификатИзПодписиАсинхронно_Завершение", ЭтаФорма);
	КонтурВнешниеСервисы().ПолучитьСертификатИзПодписи_Асинхронно(ОписаниеОповещения, Новый ДвоичныеДанные(ИмяФайлаПодписи));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатИзПодписиАсинхронно_Завершение(Сертификат, ДополнительныеПараметры) Экспорт 
	
	ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

//}		Получение сертификата из подписи