                                                                                      
//{		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Истина);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Возврат  "1.0.2";
	
КонецФункции

//}		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Открытие формы со списком онлайн счетов на оплату
//
// Параметры:
//  ФормаВладелец	 - Форма - Форма Основная форма обработки для ОФ
//
Процедура ОткрытьФормуСчетовНаОплату(ФормаВладелец) Экспорт
	
	ФормаОбработки = ПолучитьФормуСчетовНаОплату(ФормаВладелец);
	
	ФормаОбработки.Открыть();	
	
КонецПроцедуры

// Открытие формы со списком онлайн счетов на оплату
//
// Параметры:
//  ФормаВладелец	 - Форма - Форма Основная форма обработки для ОФ
//
Функция ПолучитьФормуСчетовНаОплату(ФормаВладелец) Экспорт
	
	ФормаОбработки = ПолучитьФорму("ФормаСчетовНаОплату", ФормаВладелец);
	
	Возврат ФормаОбработки;	
	
КонецФункции

