
#Область ПЕРЕМЕННЫЕ_ПЛАТФОРМЫ
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Манифест 				Экспорт;
Перем ОбработкаОбъект 		Экспорт;
Перем ПараметрыКлиентСервер Экспорт;

Перем НомерИтерацииВызоваМодуля;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
#КонецОбласти

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ПЛАТФОРМЫ

Функция МетодСервера(ИмяМодуля = "", ИмяМетода, 
		Параметр0 = NULL, Параметр1 = NULL, Параметр2 = NULL, Параметр3 = NULL, Параметр4 = NULL, 
		Параметр5 = NULL, Параметр6 = NULL, Параметр7 = NULL, Параметр8 = NULL, Параметр9 = NULL)
	
	Возврат ОбработкаОбъект.МетодСервера(ИмяМодуля, ИмяМетода, 
	Параметр0, Параметр1, Параметр2, Параметр3, Параметр4, 
	Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля= 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ОбработкаОбъект.ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля= НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект= 	   Неопределено;
		ПараметрыКлиентСервер= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриглашениеОтладки() Экспорт
	
	//// Удалите комментарий напротив оператора "ВызватьИсключение", чтобы получить приглашение для начала отладки модуля.
	//ВызватьИсключение "Нажмите кнопку ""Подробно"", а затем ""Конфигуратор"", чтобы начать отладку модуля!"; 
	
КонецПроцедуры

#КонецОбласти

#Область МАНИФЕСТ

// Все функции и процедуры тела модуля должны быть экспортными и добавлены в соответствующую структуру!

Функция ФункцииМодуля() Экспорт
	
	Результат = Новый Структура;
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьВидКИ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДанныеТЧ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииАктаСверки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуАктаСверки");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СформироватьМетуАктаВыполненныхРабот");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПодготовитьВТДляСпискаОтправкиДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаФактуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаНаОплату");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьМассивСсылокРТУПоСчетуНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьДокОснованиеКорректировкиРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСчетНаОплатуНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьЗаказПокупателяНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСФОснованиеПоИСФ_КСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ВалютаРегламентированногоУчета", , "НаВремяСеанса");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплатуСредствамиДиадок");
		
	// Признаки
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВалютныйДокумент");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоСчетНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоЗаказПокупателя");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКорректировкаРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКСФ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоИсправление");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоНакладная");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "СчетФактуранаАванс");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВозвратТоваровОтКлиента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВыбытиеИзОборотаМаркируемойПродукции");

	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьОбстоятельствоФормированияСчетФактуры");
	
	// Машиночитаемые доверенности
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ИмяСправочникаВИнформационнойБазе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ДанныеДоверенности");

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента
//
// Параметры:
//  ТребуемыеРеквизиты	 - Структура	 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - ссылка на объект, описание которого надо получить.
//
Процедура ПриПолученииОписанияПрикладногоДокумента(ТребуемыеРеквизиты, СсылкаНаОбъект) Экспорт
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ПсевдонимОсновнойТаблицы = "";
	
	Если МетаданныеОбъекта = Метаданные.Документы.КорректировкаРеализации Тогда
		
		ТребуемыеРеквизиты.ЭтоКорректировка = ТекстЗапроса_КРТУ_ЭтоКорректировка(ПсевдонимОсновнойТаблицы);
		ТребуемыеРеквизиты.ЭтоИсправление = ТекстЗапроса_КРТУ_ЭтоИсправление(ПсевдонимОсновнойТаблицы);
		
	ИначеЕсли МетаданныеОбъекта = Метаданные.Документы.СчетФактураВыданный Тогда
		
		ТребуемыеРеквизиты.ЭтоКорректировка = ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимОсновнойТаблицы);
		ТребуемыеРеквизиты.ЭтоИсправление = ТекстЗапроса_СчетФактура_ЭтоИсправление(ПсевдонимОсновнойТаблицы);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидДокументаИнформационнойБазы
//
// Параметры:
//  ВидДокумента	 - Строка - (возвращаемый параметр) вид документа с точки зрения ЭДО (см. ВидыЭлектронныхДокументов);
//  СсылкаНаОбъект	 - ЛюбаяСсылка - объект информационной базы, вид которого необходимо определить;
//  ЭтоКорректировка - Булево - Истина, если объект отражает операцию корректировки;
//
Процедура ОпределитьВидДокумента(ВидДокумента, СсылкаНаОбъект, ЭтоКорректировка) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	МетаданныеДокументов = Метаданные.Документы;
	
	Если МетаданныеОбъекта = МетаданныеДокументов.СчетФактураВыданный И Не ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.СчетФактура;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.СчетФактураВыданный И ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.КорректировочныйСчетФактура;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.РеализацияТоваровУслуг 
		Или (МетаданныеОбъекта = МетаданныеДокументов.КорректировкаРеализации И Не ЭтоКорректировка) Тогда
		
		ТолькоУслуги = ДокументРеализацииСодержитТолькоУслуги(СсылкаНаОбъект);
		
		Если ТолькоУслуги Тогда
			ВидДокумента = ВидыЭД.АктОбОказанииУслуг;
		Иначе
			ВидДокумента = ВидыЭД.ТоварнаяНакладная;
		КонецЕсли;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.КорректировкаРеализации И ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.СоглашениеОбИзмененииСтоимости;
		
	Иначе
		
		СоответствиеМетаданных = Новый Соответствие;
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.АктСверкиВзаиморасчетов, ВидыЭД.АктСверки);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.СчетНаОплатуПокупателю, ВидыЭД.СчетНаОплату);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.АктОбОказанииПроизводственныхУслуг, ВидыЭД.АктОбОказанииУслуг);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.РеализацияУслугПоПереработке, ВидыЭД.АктОбОказанииУслуг);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.РеализацияОтгруженныхТоваров, ВидыЭД.ТоварнаяНакладная);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.ВозвратТоваровПоставщику, ВидыЭД.ТоварнаяНакладная);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.ОтчетКомитентуОПродажах, ВидыЭД.АктОбОказанииУслуг);
		
		ВидДокумента = СоответствиеМетаданных.Получить(МетаданныеОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт
	
	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;

	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Номер");
	РеквизитыДокумента.Вставить("Дата");
	
	Если ЭтоИсправление Тогда
		
		// Переопределим номер документа
		РеквизитыДокумента.Номер = "НомерИсходногоДокумента";
		РеквизитыДокумента.Дата	 = "ДатаИсходногоДокумента";
		
		// И добавим получение номера и даты исправления
		РеквизитыДокумента.Вставить("НомерИсправления");
		РеквизитыДокумента.Вставить("ДатаИсправления", "Дата");
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный")
		И ИспользуетсяПроизвольныйНомерСчетаФактурыВыданного() Тогда
		РеквизитыДокумента.Вставить("ИспользоватьПроизвольныйНомер", "ОтредактированНомерСчетаФактуры");
		РеквизитыДокумента.Вставить("ПроизвольныйНомер", "НомерВходящегоДокумента");
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыДокумента);
	
	Если ЗначенияРеквизитов.Свойство("ИспользоватьПроизвольныйНомер")
		И ЗначенияРеквизитов.ИспользоватьПроизвольныйНомер Тогда
		Результат.НомерДокумента = ЗначенияРеквизитов.ПроизвольныйНомер;
	Иначе
		Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	КонецЕсли;
	
	Результат.ДатаДокумента	 = ЗначенияРеквизитов.Дата;
	
	Если ЭтоИсправление Тогда
		Результат.НомерИсправления	 = Формат(ЗначенияРеквизитов.НомерИсправления, "ЧГ=0");
		Результат.ДатаИсправления	 = ЗначенияРеквизитов.ДатаИсправления;
	КонецЕсли;
	
    ДополнитьНомерЦифровымИндексомОП(Результат, ЦифровойИндексОП, СсылкаНаОбъект);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку820
//
// Параметры:
//  ДокументыОбОтгрузке	- Массив - (возвращаемый параметр) Массив элементов "Новый_DocumentShipment";
//  СсылкаНаОбъект		- ДокументСсылка.СчетФактураВыданный - СФ для которой определяем реквизиты документов отгрузки.
//
Процедура ПриПолученииДанныхДокументовОбОтгрузке(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(СсылкаНаОбъект) <> Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СсылкаНаОбъект, "ДокументыОбОтгрузке") Тогда
		
		// ТЧ "ДокументыОбОтгрузке" появилась в версии "3.0.100.16"
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	СчетФактураВыданныйДокументыОбОтгрузке.НаименованиеДокумента КАК НаименованиеДокумента,
		                      |	СчетФактураВыданныйДокументыОбОтгрузке.НомерДокумента КАК НомерДокумента,
		                      |	СчетФактураВыданныйДокументыОбОтгрузке.ДатаДокумента КАК ДатаДокумента
		                      |ИЗ
		                      |	Документ.СчетФактураВыданный.ДокументыОбОтгрузке КАК СчетФактураВыданныйДокументыОбОтгрузке
		                      |ГДЕ
		                      |	СчетФактураВыданныйДокументыОбОтгрузке.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		
		ДанныеДокументовОбОтгрузке = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ДокументОтгрузки Из ДанныеДокументовОбОтгрузке Цикл
			
			ДокументыОтгрузкиСтруктура = Новый Структура;
			ДокументыОтгрузкиСтруктура.Вставить("Name"		, ДокументОтгрузки.НаименованиеДокумента);
			ДокументыОтгрузкиСтруктура.Вставить("Number"	, ДокументОтгрузки.НомерДокумента);
			ДокументыОтгрузкиСтруктура.Вставить("Date"		, ДокументОтгрузки.ДатаДокумента);
			
			Результат.Добавить(ДокументыОтгрузкиСтруктура);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереКорректировочногоДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт

	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;

	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ЗначенияРеквизитов = РеквизитыКорректировочногоСчетаФактуры(СсылкаНаОбъект, ЭтоИсправление);
		УчитыватьИсправлениеИсходногоДокумента = ЗначенияРеквизитов.УчитыватьИсправлениеИсходногоДокумента;
	Иначе
		ЗначенияРеквизитов = РеквизитыКорректировкиРеализации(СсылкаНаОбъект, ЭтоИсправление);
		УчитыватьИсправлениеИсходногоДокумента = ЗначениеЗаполнено(ЗначенияРеквизитов.ДатаИсправленияИсходногоДокумента) И ЗначениеЗаполнено(ЗначенияРеквизитов.НомерИсправленияИсходногоДокумента);
	КонецЕсли;
	
	Если ЗначенияРеквизитов.Свойство("ИспользоватьПроизвольныйНомер")
		И ЗначенияРеквизитов.ИспользоватьПроизвольныйНомер Тогда
		Результат.НомерДокумента = ЗначенияРеквизитов.ПроизвольныйНомер;
	Иначе
		Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	КонецЕсли;
	
	Результат.ДатаДокумента	 = ЗначенияРеквизитов.Дата;
	
	Если ЭтоИсправление Тогда
		Результат.НомерИсправления	 = Формат(ЗначенияРеквизитов.НомерИсправления, "ЧГ=0");
		Результат.ДатаИсправления	 = ЗначенияРеквизитов.ДатаИсправления;
	КонецЕсли;
	
	ОписаниеРеквизитов = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ДатаНомерДокументаОснования");
	ОписаниеРеквизитов.НомерИсходногоДокумента = Формат(ЗначенияРеквизитов.НомерИсходногоДокумента, "ЧГ=0");
	ОписаниеРеквизитов.ДатаИсходногоДокумента  = ЗначенияРеквизитов.ДатаИсходногоДокумента;
	ОписаниеРеквизитов.УчитыватьИсправлениеИсходногоДокумента = УчитыватьИсправлениеИсходногоДокумента;
	
	Если УчитыватьИсправлениеИсходногоДокумента Тогда
		ОписаниеРеквизитов.НомерИсправленияИсходногоДокумента	 = Формат(ЗначенияРеквизитов.НомерИсправленияИсходногоДокумента, "ЧГ=0");
		ОписаниеРеквизитов.ДатаИсправленияИсходногоДокумента		 = ЗначенияРеквизитов.ДатаИсправленияИсходногоДокумента;
	КонецЕсли;
	
	Результат.ДатаНомерДокументовОснований.Добавить(ОписаниеРеквизитов);
	
	ДополнитьНомерЦифровымИндексомОП(Результат, ЦифровойИндексОП, СсылкаНаОбъект);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//
// Параметры:
//  Реквизиты			 - Структура		 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  МетаданныеИсточника	 - ОбъектМетаданных	 - Метаданные документа-источника
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника) Экспорт
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузополучатель") Тогда 
		
		Реквизиты.Вставить("Грузополучатель", 
		"ВЫБОР
		|	КОГДА Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		ТОГДА Контрагент
		|	ИНАЧЕ Грузополучатель
		|КОНЕЦ");
		
	КонецЕсли;
	
	Реквизиты.Вставить("СуммаСкидки", "0");
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "СуммаСкидки") Тогда 
		Реквизиты.СуммаСкидки = "СуммаСкидки";
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "ДополнительныеУсловия") Тогда 
		Реквизиты.ДополнительныеУсловия = "ЕСТЬNULL(ДополнительныеУсловия.ТекстУсловий, """")";
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "СведенияОТранспортировкеИГрузе") Тогда 
		Реквизиты.Вставить("СведенияОТранспортировкеИГрузе", "СведенияОТранспортировкеИГрузе");
	КонецЕсли;
	
	Реквизиты.Вставить("ДоговорКонтрагента");
	Реквизиты.Вставить("ПодразделениеОрганизации");
	
	Реквизиты.Вставить("СчетаФактурыОтИмениОрганизации", "ЛОЖЬ"); // Агент (Организация) закупает товары для Принципала (Контрагент) и перевыставляет ему СФ от своего имени
	Реквизиты.Вставить("Агент");
	Реквизиты.Вставить("ДоговорАгента");
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "ДоговорКонтрагента") Тогда 
		
		Реквизиты.РасчетыВУсловныхЕдиницах = "ЕСТЬNULL(ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ)";
		
		Если ЕстьРеквизитМетаданных(Метаданные.Справочники.ДоговорыКонтрагентов, "СчетаФактурыОтИмениОрганизации") Тогда
			Реквизиты.СчетаФактурыОтИмениОрганизации = "ЕСТЬNULL(ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)";
		Иначе
			Реквизиты.СчетаФактурыОтИмениОрганизации = "ЛОЖЬ";
		КонецЕсли;
		
	Иначе
		Реквизиты.РасчетыВУсловныхЕдиницах = "ЛОЖЬ";
	КонецЕсли;
	
	Если Не ЕстьРеквизитМетаданных(МетаданныеИсточника, "БанковскийСчетОрганизации") 
		И ЕстьРеквизитМетаданных(МетаданныеИсточника, "СтруктурнаяЕдиница") Тогда 
		Реквизиты.БанковскийСчетОрганизации = "СтруктурнаяЕдиница";
	КонецЕсли;
	
	Если Не ЕстьРеквизитМетаданных(МетаданныеИсточника, "БанковскийСчетКонтрагента")
		И ЕстьРеквизитМетаданных(МетаданныеИсточника, "Контрагент") Тогда
		Реквизиты.БанковскийСчетКонтрагента = "Контрагент.ОсновнойБанковскийСчет";
	КонецЕсли;
	
	Если Не ЕстьРеквизитМетаданных(МетаданныеИсточника, "ИдентификаторГосКонтракта")
		И ЕстьРеквизитМетаданных(МетаданныеИсточника, "ДоговорКонтрагента") Тогда 
		Реквизиты.ИдентификаторГосКонтракта = "ЕСТЬNULL(ДоговорКонтрагента.ГосударственныйКонтракт.Код, НЕОПРЕДЕЛЕНО)";
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "СуммаВключаетНДС") Тогда 
		Реквизиты.ЦенаВключаетНДС = "СуммаВключаетНДС";
	Иначе
		Реквизиты.ЦенаВключаетНДС = "ЛОЖЬ";
	КонецЕсли;
	
	Реквизиты.КурсДокумента = "КурсВзаиморасчетов";
	Реквизиты.КратностьДокумента = "КратностьВзаиморасчетов";
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеШапки
// после формирования структуры шапки документа.
//
// Параметры:
//  ЗначенияРеквизитов - Структура - Структура со значениями реквизита документа
//
Процедура ПослеПолученияДанныхШапкиДокумента(ДанныеШапки) Экспорт
	
	СсылкаНаОбъект = ДанныеШапки.ОписаниеДокумента.Ссылка;
	ЭтоСФ	= ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный");
	ЭтоРОТ	= ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров");
	ЭтоСчет	= ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетНаОплатуПокупателю");
	ЭтоРТУ	= ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг");
	
	Если ЭтоСФ Тогда 
		ДополнитьШапкуСчетаФактурыПоДокументуОснованию(ДанныеШапки);
	КонецЕсли;
	
	Если ЭтоРОТ Тогда 
		ДополнитьШапкуРеализацииОтгруженныхТоваров(ДанныеШапки);
	КонецЕсли;
	
	Если ЭтоСчет Тогда 
		ДополнитьШапкуСчетаНаОплатуПокупателю(ДанныеШапки);
	КонецЕсли;
	
	Если ЭтоРТУ Тогда // счет на оплату на основании реализации
		ДополнитьШапкуРеализацияТоваровУслуг(ДанныеШапки);
	КонецЕсли;
	
	Если ЭтоУправлениеАрендой() Тогда
		
		ЭтоСчетНаАренду	= ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.АР_СчетНаАренду");
		Если ЭтоСчетНаАренду Тогда
			ДополнитьШапкуСчетаНаАренду(ДанныеШапки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеШапки.БанковскийСчетОрганизации) Тогда 
		ДанныеШапки.БанковскийСчетОрганизации = ПолучитьБанковскийСчет(СсылкаНаОбъект);
	КонецЕсли;
	
	Если СчетФактураНаАванс(СсылкаНаОбъект) Тогда
		ДанныеШапки.ЦенаВключаетНДС = Истина;
		ДанныеШапки.Вставить("СФНаАванс", Истина);
	КонецЕсли;
	
	ДанныеШапки.НДСИсчисляетсяНалоговымАгентом = НДСПоДокументуИсчисляетсяНалоговымАгентом(СсылкаНаОбъект);
	
	Если Не ЗначениеЗаполнено(ДанныеШапки.СрокОплаты) Тогда 
		ДанныеШапки.СрокОплаты = СрокиОплатыДокументов.УстановленныйСрокОплаты(СсылкаНаОбъект, ДанныеШапки.Организация);
	КонецЕсли;
	
	Если ЭтоОбособленноеПодразделение(ДанныеШапки.ПодразделениеОрганизации) Тогда 
		ДанныеШапки.ОбособленноеПодразделение = ДанныеШапки.ПодразделениеОрганизации;
	ИначеЕсли ЭтоОбособленноеПодразделение(ДанныеШапки.Организация) Тогда 
		ДанныеШапки.ОбособленноеПодразделение = ДанныеШапки.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ОбособленноеПодразделение) Тогда 
		
		ДанныеШапки.ЦифровойИндексОбособленногоПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.ОбособленноеПодразделение, "ЦифровойИндексОбособленногоПодразделения");
		
		Если Не ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда 
			// При отгрузке от ОП грузоотправитель должен быть указан всегда (нельзя писать "он же")
			ДанныеШапки.Грузоотправитель = ДанныеШапки.Организация;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеШапки.Вставить("ГрузоотправительКПП", КППГрузоотправителя(ДанныеШапки.Организация, ДанныеШапки.Грузоотправитель));
	
	Если Не ЗначениеЗаполнено(ДанныеШапки.ОрганизацияПолучатель) Тогда
		// Реквизит ОрганизацияПолучатель есть только в БП КОРП,
		// поэтому для остальный версий заполняем его данными организации.
		ДанныеШапки.ОрганизацияПолучатель = ДанныеШапки.Организация;
	КонецЕсли;
	
	ПослеПолученияДанныхШапкиКомиссионногоДокумента(ДанныеШапки);
	
КонецПроцедуры

Процедура ПослеПолученияДанныхШапкиКомиссионногоДокумента(ДанныеШапки)
	
	СсылкаНаОбъект = ДанныеШапки.ОписаниеДокумента.Ссылка;
	ИсходныйДокумент = Неопределено;
	
	Если ЭтоСчетФактура(СсылкаНаОбъект) Тогда
		
		Если ЭтоКСФ(СсылкаНаОбъект) Тогда
			
			ДокументыОснования = СсылкаНаОбъект.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
			Если ДокументыОснования.Количество() > 0 Тогда
				КорректирующийДокумент = ДокументыОснования[0];
				ИсходныйДокумент = ИсходныйКорректируемыйДокумент(КорректирующийДокумент);
			КонецЕсли;
			
		Иначе
			ИсходныйДокумент = СсылкаНаОбъект;
		КонецЕсли;
		
	Иначе
		ИсходныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ЭтоСчетФактура(ИсходныйДокумент) Тогда
		
		ДокументыОснования = ИсходныйДокумент.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
		
		Если ОснованиеОтчетКомитентаОПродажах_ОтчетОЗакупках(ДокументыОснования, ИсходныйДокумент) Тогда
			
			ПослеПолученияДанныхШапкиДокументаДополнительно(ДанныеШапки, ИсходныйДокумент);
			
		ИначеЕсли ОснованиеОтчетКомиссионераОПродажах(ДокументыОснования, ИсходныйДокумент) Тогда
			
			ДокументОснование = ДокументыОснования[0];
			ПослеПолученияДанныхШапкиОтчетаКомиссионераОПродажахДополнительно(
				ДанныеШапки,
				ДокументОснование,
				ИсходныйДокумент
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеПолученияДанныхШапкиДокументаДополнительно(Знач ДанныеШапки, СсылкаНаОбъект)
	
	Перем Выборка, ЗапросШапка;
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	
	"ВЫБРАТЬ
	|	ТЧПоставщики.Поставщик КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.Партия.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТЧПоставщики.Поставщик
	|		ИНАЧЕ ТЧПоставщики.Партия.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.Партия.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТЧПоставщики.Ссылка.Организация
	|		ИНАЧЕ ТЧПоставщики.Партия.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ТЧПоставщики.Ссылка.Организация КАК Агент,
	|	ТЧПоставщики.Ссылка.ДоговорКонтрагента КАК ДоговорАгента
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|ГДЕ
	|	ТЧПоставщики.СчетФактура = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	Выборка = ЗапросШапка.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Не ДанныеШапки.СчетаФактурыОтИмениОрганизации Тогда 
			ДанныеШапки.Организация = Выборка.Поставщик;
			Если ЭтоОбособленноеПодразделение(ДанныеШапки.Организация) Тогда 
				ДанныеШапки.ОбособленноеПодразделение = ДанныеШапки.Организация;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеШапки.СчетаФактурыОтИмениОрганизации 
			Или Выборка.Поставщик = Выборка.Грузополучатель Тогда 
			ДанныеШапки.Грузоотправитель = Неопределено; // должно быть "он же"
		Иначе
			ДанныеШапки.Грузоотправитель = Выборка.Грузоотправитель;
		КонецЕсли;
		
		ДанныеШапки.Грузополучатель	 = Выборка.Грузополучатель;
		ДанныеШапки.Агент			 = Выборка.Агент;
		ДанныеШапки.ДоговорАгента	 = Выборка.ДоговорАгента;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПослеПолученияДанныхШапкиОтчетаКомиссионераОПродажахДополнительно(Знач ДанныеШапки, СсылкаНаОснованиеСчетаФактуры, СсылкаНаСчетФактуру)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|	КОНЕЦ КАК Грузополучатель
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели,
	|	Документ.ОтчетКомиссионераОПродажах КАК Реквизиты
	|ГДЕ
	|	ОтчетКомиссионераОПродажахПокупатели.Ссылка = &ДокументОснование
	|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура
	|	И Реквизиты.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаОснованиеСчетаФактуры);
	Запрос.УстановитьПараметр("СчетФактура", СсылкаНаСчетФактуру);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДанныеШапки.Грузополучатель = Выборка.Грузополучатель;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  МетаданныеОбъекта	 - ОбъектМетаданных - объект метаданных.
//  ТабличныеЧасти		 - Массив - массив, в который необходимо добавить имена табличных частей, из которых нужно получить данные.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииИменТабличныхЧастей(МетаданныеОбъекта, ТабличныеЧасти, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка				 - Структура - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//  ИмяТабличнойЧасти	 - Строка	 - имя табличной части объекта.
//  РеквизитыТЧ			 - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                     псевдоним поля, а в качестве значения (опционально) фактическое имя поля в таблице.
//                                     Если значение не определено, то имя поля берется из ключа.
//  ПараметрыЗапроса	 - Структура - дополнительные параметры, будут переданы в исполняемый запрос.
//
Процедура ПриПодготовкеЗапросаПоТоварнойЧастиДокумента(Шапка, ИмяТабличнойЧасти, РеквизитыТЧ, ПараметрыЗапроса) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка			 - Структура		 - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей.
//
Процедура ПослеПолученияТоварнойЧастиДокумента(Шапка, ТабличнаяЧасть) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РасчетноеПредставлениеНомера()
//
// Параметры:
//  НомерОбъекта		 - Строка - номер или код объекта, который преобразуется для вывода на печать.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	НомерОбъекта = ПредставлениеНомера(НомерОбъекта);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяКолонкиКодТовара()
//
// Параметры:
//  ИмяКолонки			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов(ИмяКолонки, СтандартнаяОбработка = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ИмяКолонки = ИмяКолонкиКодТовара();
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВалютаРегламентированногоУчета()
//
Процедура ПриОпределенииВалютыРегламентированногоУчета(ВалютаРеглУчета, СтандартнаяОбработка = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ВалютаРеглУчета		 = ВалютаРегламентированногоУчета();
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыЮрФизЛица.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  ЮрФизЛицо			 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период				 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет		 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                         Если не передан, будут включены реквизиты основного банковского счета.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.ПодразделенияОрганизаций") 
		И ЭтоОбособленноеПодразделение(ЮрФизЛицо) Тогда // ОП, не выделенное на отдельный баланс
		
		Данные = _РеквизитыОбособленногоПодразделения(ЮрФизЛицо);
		
	ИначеЕсли ТипЗнч(ЮрфизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		
		
		Данные = _РеквизитыОрганизации(ЮрФизЛицо, Период, БанковскийСчет);
		
		
	Иначе  // Это Контрагент 
		
		Данные = _РеквизитыКонтрагента(ЮрФизЛицо, Период, БанковскийСчет);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Данные);
	
	Реквизиты.НаименованиеДляПечатныхФорм = Данные.НаименованиеПолное;
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	

	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыДоговора.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  Шапка				 - Структура - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки).
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Представление"	, "ДоговорКонтрагента.Наименование");
	ТребуемыеРеквизиты.Вставить("Номер"			, "ДоговорКонтрагента.Номер");
	ТребуемыеРеквизиты.Вставить("Дата"			, "ДоговорКонтрагента.Дата");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шапка.ОписаниеДокумента.Ссылка, ТребуемыеРеквизиты);
	
	ЗаполнитьЗначенияСвойств(Реквизиты, ЗначенияРеквизитов);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЭтапыГрафикаОплатПоДокументу.
//
// Параметры:
//  ЭтапыОплаты			 - ТаблицаЗначений	 - возвращаемые сведения;
//  Шапка				 - Структура		 - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки);
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииЭтаповГрафикаОплат(ЭтапыОплаты, Шапка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПредставлениеНоменклатуры.
//
// Параметры:
//  Представление			 - Строка - параметр, в который возвращается полученное представление номенклатуры;
//  Номенклатура			 - Строка, СправочникСсылка.Номенклатура				 - ссылка на номенклатуру;
//  Характеристика			 - Строка, СправочникСсылка.ХарактеристикиНоменклатуры	 - характеристика номенклатуры;
//  ДополнительныеПараметры	 - Неопределено, Структура								 - см. функцию Модуль_ИнтеграцияУниверсальный.ДополнительныеПараметрыПредставленияНоменклатуры;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииПредставленияНоменклатуры(Представление, Номенклатура, Характеристика, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Номенклатура) = Тип("Строка") Тогда 
		
		Представление = СокрЛП(Номенклатура);
		Возврат;
		
	КонецЕсли;
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Наименование");
	ТребуемыеРеквизиты.Вставить("НаименованиеПолное");
	
	Если Не ЕстьРеквизитМетаданных(Номенклатура.Метаданные(), "НаименованиеПолное") Тогда
		ТребуемыеРеквизиты.НаименованиеПолное = "Наименование";
	КонецЕсли;
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, ТребуемыеРеквизиты);
	
	Представление = РеквизитыНоменклатуры.НаименованиеПолное;
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = РеквизитыНоменклатуры.Наименование;
	КонецЕсли;
		
	Представление = СокрЛП(Представление);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыУчетаНоменклатуры.
//
// Параметры:
//  ПараметрыНоменклатуры	 - Структура - Коллекция параметров учета номенклатуры в текущей ИБ;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииПараметровУчетаНоменклатуры(ПараметрыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыНоменклатуры.ИспользоватьХарактеристики = Ложь;
	ПараметрыНоменклатуры.ИспользоватьСерии = Ложь;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ХранилищеКонтактнойИнформацииОбъекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ХранилищеКИ = СсылкаНаОбъект;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации") 
		И МетодСервера(,"СравнитьВерсии", ПараметрыКлиентСервер.ВерсияКонфигурации, "3.0.43.148") < 0 Тогда 
		// До указанной версии контактная информация индивидуального предпринимателя
		// хранилась в карточке физического лица
	
		СписокРеквизитов = Новый Структура;
		СписокРеквизитов.Вставить("ЮридическоеФизическоеЛицо");
		СписокРеквизитов.Вставить("ИндивидуальныйПредприниматель");
		
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, СписокРеквизитов);
		
		Если РеквизитыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ХранилищеКИ = РеквизитыОрганизации.ИндивидуальныйПредприниматель;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов;
//
Процедура ПриПолученииВидовИсходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ПсевдонимТаблицы = "ОсновнаяТаблица";
	ОтборКорректировочныхСчетовФактур = ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимТаблицы);
	ОтборКорректировокРеализаций = ТекстЗапроса_КРТУ_ЭтоКорректировка(ПсевдонимТаблицы);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.СчетФактураВыданный, 
		ВидыЭД.СчетФактура,
		"НЕ " + ОтборКорректировочныхСчетовФактур);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.СчетФактураВыданный,
		ВидыЭД.КорректировочныйСчетФактура,
		ОтборКорректировочныхСчетовФактур);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.СчетНаОплатуПокупателю,
		ВидыЭД.СчетНаОплату,
		Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.РеализацияТоваровУслуг,
		ВидыЭД.СчетНаОплату,
		Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.РеализацияТоваровУслуг,
		ВидыЭД.ТоварнаяНакладная,
		"ОсновнаяТаблица.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.Услуги)");
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.РеализацияТоваровУслуг,
		ВидыЭД.АктОбОказанииУслуг,
		"ОсновнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.Услуги)");
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.АктОбОказанииПроизводственныхУслуг,
		ВидыЭД.АктОбОказанииУслуг,
		Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.ОтчетКомитентуОПродажах,
		ВидыЭД.АктОбОказанииУслуг,
		Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.КорректировкаРеализации,
		ВидыЭД.ТоварнаяНакладная,
		"ВЫРАЗИТЬ(ОсновнаяТаблица.ИсправляемыйДокументРеализации КАК Документ.РеализацияТоваровУслуг).ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.Услуги)
		|	И НЕ " + ОтборКорректировокРеализаций);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.КорректировкаРеализации, 
		ВидыЭД.АктОбОказанииУслуг,
		"НЕ " + ОтборКорректировокРеализаций);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов,
		Метаданные.Документы.КорректировкаРеализации,
		ВидыЭД.СоглашениеОбИзмененииСтоимости,
		ОтборКорректировокРеализаций);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов;
//
Процедура ПриПолученииВидовВходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетНаОплатуПоставщика
		, ВидыЭД.СчетНаОплату
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеТоваровУслуг
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеНМА
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеТоваровУслуг
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеДопРасходов
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.КорректировочныйСчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.КорректировкаПоступления
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, Неопределено);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПриПолученииВладельцаОбщихНастроекМодуля.
//
// Параметры:
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект, выступающий в качестве константы для хранения дополнительных свойств;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииВладельцаОбщихНастроекМодуля(СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	// остается значение по умолчанию
	
КонецПроцедуры


#Область СопоставлениеНоменклатуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СвойстваНоменклатурыИнформационнойБазы.
// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  НаборНоменклатуры - Массив из ОпределяемыйТип.НоменклатураБЭД - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. Модуль_ИнтеграцияУниверсальный.НовыеСвойстваНоменклатурыИБ.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(Знач НаборНоменклатуры, СвойстваНоменклатурИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЛОЖЬ КАК ИспользоватьХарактеристики,
	|	ЛОЖЬ КАК ИспользоватьУпаковки,
	|	ЛОЖЬ КАК ОбязательноеЗаполнениеХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&НаборНоменклатуры)";
	
	Запрос.УстановитьПараметр("НаборНоменклатуры", НаборНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваНоменклатуры = НовыеСвойстваНоменклатурыИБ();
		ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, Выборка);
		
		СвойстваНоменклатурИБ.Вставить(Выборка.Номенклатура, СвойстваНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняется при подборе недостающих данных о номенклатуре информационной базы по уже имеющимся,
// а также номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//
Процедура ПриПодбореНоменклатурыИнформационнойБазы(Знач НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураИБ.Номенклатура, "ЕдиницаИзмерения");
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		НоменклатураИБ.Упаковка = ЕдиницаИзмерения;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураИБ.Упаковка) Тогда
		Если ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмеренияКод) Тогда
			НоменклатураИБ.Упаковка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(
				НоменклатураКонтрагента.ЕдиницаИзмеренияКод);
		ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
			НоменклатураИБ.Упаковка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(
				НоменклатураКонтрагента.ЕдиницаИзмерения, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ЗаполнитьСоответствиеПолейВходящегоДокумента(ОбъектМетаданных, ИменаПолей) Экспорт
	
	
	
КонецПроцедуры

// Заполняет таблицу правил обработки входящих электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - правила обработки документов (см. ПравилаОбработкиВходящихДокументов);
//
// Пример:
//	Если ПолучитьФункциональнуюОпцию("ВедетсяПроизводственнаяДеятельность") Тогда
//		
//		ДобавитьПравилоОбработкиДокументов(ПравилоОбработки
//			, "ПоступлениеВПереработку" // Описание правила задается в процедуре ПриПолученииПравилаОбработкиЭлектронногоДокумента
//			, "ТоварнаяНакладная" 		// Используется для накладных
//			, Ложь); 					// Для исправлений не используется, только для первичных документов
//		
//	КонецЕсли;
//
Процедура ЗаполнитьПравилаОбработкиВходящихДокументов(ПравилаОбработки) Экспорт
	
	ЗаполнитьПравилаОбработкиАктов(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиНакладных(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиДокументовОРасхождении(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиАктовСверки(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиСчетовНаОплату(ПравилаОбработки);
	
КонецПроцедуры

// Обработчик получения правила отражения электронного документа в учетной системе.
// Вызывается из Модуль_ИнтеграцияУниверсальный.ПравилоОбработкиЭлектронныхДокументов.
//
// Параметры:
//  ПравилоОбработки	 - Структура - описание способа обработки электронного документа (см. ПравилоОбработкиЭлектронныхДокументов);
//  СтандартнаяОбработка - Булево - Истина, если специальная обработка не требуется,
//                                  а идентификатор совпадает с именем метаданных документа;
//
// Пример:
//
//	Если ПравилоОбработки.Идентификатор = "ПоступлениеВПереработку" Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		ДополнительныеПараметры = Новый Структура;
//		ДополнительныеПараметры.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
//		
//		ПравилоОбработки.Представление = "Поступление материалов в переработку";
//		ПравилоОбработки.ОбъектМетаданных = Метаданные.Документы.ПоступлениеТоваровУслуг.ПолноеИмя();
//		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
//		
//	КонецЕсли;
//
Процедура ПриПолученииПравилаОбработкиЭлектронногоДокумента(ПравилоОбработки, СтандартнаяОбработка) Экспорт
	
	ИдентификаторПравила = ПравилоОбработки.Идентификатор;
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ВидыОпераций = Перечисления.ВидыОперацийПоступлениеТоваровУслуг;
	ПоступлениеТоваровУслуг = Метаданные.Документы.ПоступлениеТоваровУслуг.ПолноеИмя();
	
	СтандартнаяОбработка = Ложь;
	
	Если ИдентификаторПравила = ИдентификаторыПравил.ПоступлениеТоваровУслуг_Оборудование Тогда
		
		ПредставлениеОперации = "Поступление оборудования";
		ОбъектМетаданных = ПоступлениеТоваровУслуг;
		ВидОперации = ВидыОпераций.Оборудование;
		
	ИначеЕсли ИдентификаторПравила = ИдентификаторыПравил.ПоступлениеТоваровУслуг_УслугиЛизинга Тогда
		
		ПредставлениеОперации = "Поступление услуг лизинга";
		ОбъектМетаданных = ПоступлениеТоваровУслуг;
		ВидОперации = ВидыОпераций.УслугиЛизинга;
		
	ИначеЕсли ИдентификаторПравила = ИдентификаторыПравил.ПоступлениеТоваровУслуг_УслугиФакторинга Тогда
		
		ПредставлениеОперации = "Поступление услуг факторинга";
		ОбъектМетаданных = ПоступлениеТоваровУслуг;
		ВидОперации = ВидыОпераций.УслугиФакторинга;
		
	ИначеЕсли ИдентификаторПравила = ИдентификаторыПравил.ПоступлениеТоваровУслуг_ОсновныеСредства Тогда
		
		ПредставлениеОперации = "Поступление основных средств";
		ОбъектМетаданных = ПоступлениеТоваровУслуг;
		ВидОперации = ВидыОпераций.ОсновныеСредства;
		
	ИначеЕсли ИдентификаторПравила = ИдентификаторыПравил.ПоступлениеТоваровУслуг_ОбъектыСтроительства Тогда
		
		ПредставлениеОперации = "Поступление объектов строительства";
		ОбъектМетаданных = ПоступлениеТоваровУслуг;
		ВидОперации = ВидыОпераций.ОбъектыСтроительства;
		
	ИначеЕсли ИдентификаторПравила = ИдентификаторыПравил.ОперацияСБилетом_Покупка Тогда
		
		ПредставлениеОперации = "Покупка билета";
		ОбъектМетаданных = Метаданные.Документы.ОперацияСБилетом.ПолноеИмя();
		ВидОперации = Перечисления.ВидыОперацийСБилетами.Покупка;
		
	ИначеЕсли ИдентификаторПравила = ИдентификаторыПравил.ПоступлениеВЛизинг Тогда
		
		ПредставлениеОперации = "Поступление в лизинг";
		ОбъектМетаданных = Метаданные.Документы[ИмяДокументаПоступлениеВАрендуЛизинг()].ПолноеИмя();
		ВидОперации = Неопределено;
		
	ИначеЕсли ИдентификаторПравила = ИдентификаторыПравил.СчетНаОплату Тогда
		
		ПредставлениеОперации = "Счет на оплату";
		ОбъектМетаданных = Метаданные.Документы.СчетНаОплатуПоставщика;
		ВидОперации = Неопределено;
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
	Если Не СтандартнаяОбработка Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидОперации", ВидОперации);
		
		ПравилоОбработки.Представление = ПредставлениеОперации;
		ПравилоОбработки.ОбъектМетаданных = ОбъектМетаданных;
		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.НовыйДокументИнформационнойБазы.
//
// Параметры:
//  ДокументОбъект		 - ДокументОбъект	 - новый, еще не записанный, документ-объект;
//  ДанныеЭД			 - Структура		 - содержит данные электронного документа
//                                             (см. Модуль_ИнтеграцияУниверсальный.ДанныеЭлектронногоДокумента);
//  ПараметрыЗаполнения	 - Структура		 - содержит дополнительные параметры заполнения;
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриСозданииДокументаИнформационнойБазы(ДокументОбъект, ДанныеЭД, ПараметрыЗаполнения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если МетаданныеДокумента = Метаданные.Документы.ПоступлениеТоваровУслуг Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияТоваровУслуг(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеТоваровУслуг(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ПоступлениеДопРасходов Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияДопРасходов(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеДопРасходов(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.КорректировкаПоступления Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияКорректировкиПоступления(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьКорректировкуПоступления(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.СчетФактураПолученный Тогда
		
		ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
		
		Если ФорматЭД.ЭтоКорректировка Тогда
			СтруктураЗаполнения = СтруктураЗаполненияКорректировочногоСчетаФактуры(ДанныеЭД, ПараметрыЗаполнения);
		Иначе
			СтруктураЗаполнения = СтруктураЗаполненияСчетаФактуры(ДанныеЭД, ПараметрыЗаполнения);
		КонецЕсли;
		
		ЗаполнитьСчетФактуруПолученный(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ВозвратТоваровОтПокупателя Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияВозвратаТоваровОтПокупателя(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьВозвратТоваровОтПокупателя(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ПоступлениеНМА Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияНМА(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеНМА(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы[ИмяДокументаПоступлениеВАрендуЛизинг()] Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияВЛизинг(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеВЛизинг(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ПоступлениеДенежныхДокументов Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияДенежныхДокументов(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеДенежныхДокументов(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ОперацияСБилетом Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияОперацииСБилетом(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьОперациюСБилетом(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.АктОРасхожденияхПолученный Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияАктаОРасхожденияхПолученного(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьАктОРасхожденияхПолученный(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.АктСверкиВзаиморасчетов Тогда
		
		Если ИспользуетсяАктСверкиВзаиморасчетов3_0_131() Тогда
			
			СтруктураЗаполнения = СтруктураЗаполненияАктаСверкиВзаиморасчетов3_0_131(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьАктСверкиВзаиморасчетов3_0_131(ДокументОбъект, СтруктураЗаполнения);
			
		Иначе
			
			СтруктураЗаполнения = СтруктураЗаполненияАктаСверкиВзаиморасчетов(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьАктСверкиВзаиморасчетов(ДокументОбъект, СтруктураЗаполнения);
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.СчетНаОплатуПоставщика Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияСчетаНаОплатуПоставщика(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьСчетНаОплатуПоставщика(ДокументОбъект, СтруктураЗаполнения);
		
	Иначе
		
		// Специальная обработка заполнения не реализована
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяСправочникаВладельцаНоменклатуры.
//
// Параметры:
//  ИмяСправочника		 - Строка - имя справочника, которому подчинен справочник "НоменклатураПоставщиков";
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииИмениСправочникаВладельцаНоменклатуры(ИмяСправочника, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.МетаданныеПрикладногоСправочника.
//
// Параметры:
//  СоответствиеСправочников - Соответствие - ключом является имя справочника в терминах сервиса, а значением - метаданные прикладного справочника;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСоответствияСправочников(СоответствиеСправочников, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СсылкаОбъектаПоПолямПоиска.
//
// Параметры:
//  СсылкаНаОбъект		 - Произвольный - ссылка на искомый объект;
//  ПоляПоиска			 - Структура - содержит параметры поиска;
//  ОбъектМетаданных	 - ОбъектМетаданных - метаданные искомого объекта;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//
//  НаименованиеПолное = Неопределено;
//  Если ПоляПоиска.Свойство("НаименованиеПолное", НаименованиеПолное) 
//      И Не ЕстьРеквизитМетаданных(ОбъектМетаданных, "НаименованиеПолное") 
//      И ЕстьРеквизитМетаданных(ОбъектМетаданных, "ПолноеНаименование") Тогда
//          
//          ПоляПоиска.Удалить("НаименованиеПолное");
//          ПоляПоиска.Вставить("ПолноеНаименование", НаименованиеПолное);
//          
//  КонецЕсли;
//
Процедура ПриПолученииСсылкиПоПолямПоиска(СсылкаНаОбъект, ПоляПоиска, ОбъектМетаданных, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СчетаФактурыПоОснованию.
//
// Параметры:
//  НайденныеДокументы	 - Массив	 - Ссылки на найденные счета-фактуры;
//  ПараметрыРегистрации - Структура - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСчетовФактурПоОснованию(НайденныеДокументы, ПараметрыРегистрации, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруПолученный(ПараметрыРегистрации.Ссылка);
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда 
		НайденныеДокументы.Добавить(СчетФактура);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактурыПоОснованию.
//
// Параметры:
//  ПараметрыРегистрации - Структура	 - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  ДокументОснование	 - ЛюбаяСсылка	 - документ, на основании которого необходимо получить параметры;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПодготовкеПараметровРегистрацииСчетаФактуры(ПараметрыРегистрации, ДокументОснование, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СборПротоконтента

Процедура ЗаполнитьКонтентXmlUTD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ДанныеДляПечати = ПолучитьДанныеДляФормированияУПД(ДокСсылка, ПараметрыФормирования);
	ДанныеШапки     = ДанныеДляПечати.ДанныеШапки;
	ТаблицаТоваров  = ДанныеДляПечати.ТаблицаТоваров;
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеШапки.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("СчетФактураСсылка") Тогда
		Content.СчетФактураСсылка = ДанныеШапки.СчетФактураСсылка;
	КонецЕсли;
	
	Покупатель = ПолучитьГоловноеЮрлицо(ДанныеШапки.Контрагент);
	
	Если ЗначениеЗаполнено(ДатаНомер.ДатаИсправления) Тогда
		
		ДатаРеквизитов = ДатаНомер.ДатаИсправления;
		
	Иначе
		
		ДатаРеквизитов = ДатаНомер.ДатаДокумента;
		
	КонецЕсли;
	
	Заполнить_ExtendedOrganizationInfo(Content.Buyer, Покупатель, ДатаРеквизитов, Истина, ДанныеШапки.БанковскийСчетКонтрагента);

	Если  Content.Свойство("ОшибкиВДанных")
		И ЗначениеЗаполнено(Content.СчетФактураСсылка) 
		И ЭтоСводныйКомиссионныйСФ(Content.СчетФактураСсылка) Тогда
		
		Если НЕ Найти(ПараметрыКлиентСервер.СинонимКонфигурации, "Бухгалтерия предприятия КОРП") = 0
			И МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", Content.СчетФактураСсылка, "ДоговорКонтрагента")
			И МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", Content.СчетФактураСсылка.ДоговорКонтрагента, "СчетаФактурыОтИмениОрганизации")
			И НЕ Content.СчетФактураСсылка.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации
		Тогда
		
			МетодСервера(, "ДобавитьОшибкуВалидации",
				Content.ОшибкиВДанных,
				"Отправка сводной комиссионной счет-фактуры возможно только при наличии признака ""Счета-фактуры перевыставляются от имени организации в <договоре>""", 
				Content.СчетФактураСсылка.ДоговорКонтрагента);
			
		ИначеЕсли Найти(ПараметрыКлиентСервер.СинонимКонфигурации, "Бухгалтерия предприятия КОРП") = 0 Тогда
			
			МетодСервера(, "ДобавитьОшибкуВалидации",
				Content.ОшибкиВДанных,
				"Интеграционный модуль электронного документооборота не поддерживает обмен сводными счетами-фактурами.");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыФормирования.Свойство("Получатель_FnsParticipantId") Тогда
		Content.Buyer.FnsParticipantId = ПараметрыФормирования.Получатель_FnsParticipantId;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.КонтрагентКПП) Тогда
		Content.Buyer.kpp =  ДанныеШапки.КонтрагентКПП;
	КонецЕсли;
	
	КППГрузоотправителя = "";
	
	Если ДанныеШапки.ЕстьТовары Тогда
		
		КППГрузоотправителя = ДанныеШапки.ГрузоотправительКПП;
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
			Заполнить_ExtendedOrganizationInfo(Content.Shipper.OrganizationInfo, ДанныеШапки.Грузоотправитель, ДатаРеквизитов, Ложь, , , ДанныеШапки.ОбособленноеПодразделение);
			Content.Shipper.SameAsSeller = Ложь;
		Иначе
			Content.Shipper.SameAsSeller = Истина;
		КонецЕсли;
		
		Грузополучатель = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
		Заполнить_ExtendedOrganizationInfo(Content.Consignee, Грузополучатель, ДатаРеквизитов, Ложь, , , , ДанныеШапки.АдресДоставки);
		
	КонецЕсли;
	
	Продавец = ПолучитьГоловноеЮрлицо(ДанныеШапки.Организация);
	ДоговорКонтрагента = ДанныеШапки.ДоговорКонтрагента;
	
	Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку И ДанныеШапки.Организация = ДанныеШапки.Контрагент Тогда
		
		Заполнить_ExtendedOrganizationInfo(Content.Seller, Продавец, ДатаРеквизитов, Истина, ДанныеШапки.БанковскийСчетОрганизации, Неопределено);
		
	Иначе
		
		Заполнить_ExtendedOrganizationInfo(Content.Seller, Продавец, ДатаРеквизитов, Истина, ДанныеШапки.БанковскийСчетОрганизации, Неопределено, ДанныеШапки.ОбособленноеПодразделение);
		
	КонецЕсли;
	
	Если ПараметрыФормирования.Свойство("Отправитель_FnsParticipantId") Тогда
		Content.Seller.FnsParticipantId = ПараметрыФормирования.Отправитель_FnsParticipantId; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДоговорАгента) Тогда
		Content.Creator  	= ДанныеШапки.Агент.НаименованиеПолное + ", " + МетодСервера(, "СформироватьПредставлениеИННКПП", ДанныеШапки.Агент.ИНН, ДанныеШапки.Агент.КПП);
		Content.CreatorBase = ДанныеШапки.ДоговорАгента.Наименование;
	Иначе
		Content.Creator  = Content.seller.name + ", ИНН/КПП: " + МетодСервера(, "ПредставлениеИННКПП", Content.seller);
	КонецЕсли;
	
	Content.Function = ДанныеШапки.Функция;
	
	Если ДанныеШапки.Свойство("ДатаНомерДокументовОплаты") Тогда
		
		СтруктураPaymentDocuments= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_PaymentDocument");
		
		Для Каждого ПРД из ДанныеШапки.ДатаНомерДокументовОплаты Цикл
			ЗаполненнаяСтруктураPaymentDocuments = СкопироватьСтруктуру(СтруктураPaymentDocuments);
			ЗаполненнаяСтруктураPaymentDocuments.Number = ПРД.НомерПлатежноРасчетногоДокумента;
			ЗаполненнаяСтруктураPaymentDocuments.Date   = ПРД.ДатаПлатежноРасчетногоДокумента;
			Content.PaymentDocuments.Добавить(ЗаполненнаяСтруктураPaymentDocuments);
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеШапки.Свойство("ИдентификаторГосконтракта", Content.GovernmentContractInfo);
	
	ЗаполнитьStructedAdditionalInfos(Content.AdditionalInfoId.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	Курс      = 1;				
	Кратность = 1;
	НуженПересчетВРубли = (ДанныеШапки.РасчетыВУсловныхЕдиницах И ДанныеШапки.ВалютаДокумента <> ВалютаРеглУчета);
	НужноПересчитатьСуммыВСтроке = Ложь;
	
	Content.ВалютаСсылка = ?(ДанныеШапки.РасчетыВУсловныхЕдиницах, ВалютаРеглУчета, ДанныеШапки.ВалютаДокумента);
	Content.Currency = ?(ЗначениеЗаполнено(Content.ВалютаСсылка), Строка(Content.ВалютаСсылка.Код), "");
	
	Если НуженПересчетВРубли И ОписаниеДокумента.Проведен Тогда
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеШапки.ВалютаДокумента, ДатаНомер.ДатаДокумента);
		Курс      = КурсИКратность.Курс;
		Кратность = ?(КурсИКратность.Кратность = 0, 1, КурсИКратность.Кратность);
		НужноПересчитатьСуммыВСтроке = Истина;
	КонецЕсли;
	
	СФНаАванс = СчетФактуранаАванс(ДокСсылка);
	
	TotalNet = 0;
	Total 	 = 0;
	Vat 	 = 0;
	TotalWithVatExcluded = 0;
	
	ВсеСтроки_СтавкаНДС_БезНДС	 = Истина;
	ВсеСтроки_СтавкаНДС_ИсчНалАг = Истина;
	
	СтавкаНДС_БезНДС   = МетодСервера(, "СтавкаНДС_БезНДС");
	СтавкаНДС_ИсчНалАг = МетодСервера(, "СтавкаНДС_ИсчНалАг");
	
	Для Каждого СтрокаДанных Из ТаблицаТоваров Цикл 
		
		Если НужноПересчитатьСуммыВСтроке Тогда
			
			Если СтрокаДанных.СуществуютЗаписиРублевыхСумм Тогда
				СуммаБезНДС 		  = СтрокаДанных.ВсегоВРублях - СтрокаДанных.НДСВРублях;
				СтрокаДанных.СуммаНДС = СтрокаДанных.НДСВРублях;
			Иначе
				СуммаБезНДС           = (?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.Сумма - СтрокаДанных.СуммаНДС, СтрокаДанных.Сумма)) * Курс / Кратность;
				СтрокаДанных.СуммаНДС = СтрокаДанных.СуммаНДС * Курс / Кратность;
			КонецЕсли;
			
			СтрокаДанных.Цена  = ?(СтрокаДанных.Количество = 0, СуммаБезНДС, Окр(СуммаБезНДС / СтрокаДанных.Количество, Точность));
			СтрокаДанных.Сумма = СуммаБезНДС + ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДС, 0);
			
		КонецЕсли;
		
		Item = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ExtendedInvoiceItem");
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		Content.InvoiceTable.items.Добавить(Item);
		
		Item.Product 	= СтрокаДанных.НоменклатураПредставление;
		Item.VendorCode = СтрокаДанных.КодНоменклатуры;
		Item.ItemMark   = СтрокаДанных.ПризнакТоварРаботаУслуга;
		Item.TaxRate 	= ПредставлениеСтавкиНДС(СтрокаДанных.СтавкаНДС);
		
		НДС_БезНДС	 = (НРег(Item.TaxRate) = НРег(СтавкаНДС_БезНДС));
		НДС_ИсчНалАг = (Item.TaxRate = СтавкаНДС_ИсчНалАг);
		
		Если НЕ НДС_БезНДС Тогда
			ВсеСтроки_СтавкаНДС_БезНДС = Ложь;
		КонецЕсли;
		Если НЕ НДС_ИсчНалАг Тогда
			ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
		КонецЕсли;
		
		// Сумма без НДС
		Если НДС_ИсчНалАг Тогда
			Item.SubtotalWithVatExcluded = СтрокаДанных.Сумма;
		ИначеЕсли НЕ СФНаАванс Тогда 	
			Item.SubtotalWithVatExcluded = СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДС, 0);
		КонецЕсли;
		
		// Сумма НДС
		Если НДС_ИсчНалАг Тогда
			Item.Vat = 0;
		ИначеЕсли НЕ НДС_БезНДС Тогда 	
			Item.Vat = СтрокаДанных.СуммаНДС;
		КонецЕсли;
		
		// Сумма всего
		Если НДС_ИсчНалАг Тогда
			Item.Subtotal = 0;
		Иначе 	
			Item.Subtotal = СтрокаДанных.Сумма + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.Количество) Тогда
			
			Item.Quantity = ?(СФНаАванс И СтрокаДанных.Количество = 0, Неопределено, СтрокаДанных.Количество); //для отображения прочерка в вэбе
			
			Если ДанныеШапки.ЦенаВключаетНДС И ЗначениеЗаполнено(СтрокаДанных.СуммаНДС) Тогда 
				// Расчет цены без НДС
				Item.Price = ?(ЗначениеЗаполнено(Item.Quantity), Окр(Item.SubtotalWithVatExcluded / Item.Quantity, Точность), Неопределено);
			Иначе
				// Без пересчета, т.к. цена уже без НДС
				Item.Price = СтрокаДанных.Цена;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
				
				Item.UnitName = СокрЛП(СтрокаДанных.ЕдиницаИзмерения);
				Item.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.КодЕдиницыИзмерения));
				Item.ЕдиницаИзмеренияССылка = СтрокаДанных.ЕдиницаИзмерения;
				
			КонецЕсли;
			
		КонецЕсли;
		
		TotalNet = TotalNet + МетодСервера(, "ПривестиКЧислу", Item.Quantity);
		Total 	 = Total 	+ МетодСервера(, "ПривестиКЧислу", Item.Subtotal);
		Vat 	 = Vat 		+ МетодСервера(, "ПривестиКЧислу", Item.Vat);
		
		Если НЕ СФНаАванс ИЛИ НДС_ИсчНалАг Тогда
			TotalWithVatExcluded = TotalWithVatExcluded + МетодСервера(, "ПривестиКЧислу", Item.SubtotalWithVatExcluded);
		КонецЕсли;
		
		Заполнить_Item_CustomDeclarations(
			Item,
			СтрокаДанных.СтранаПроисхождения,
			СтрокаДанных.НомерГТД
		);
		
	КонецЦикла;
	
	Content.InvoiceTable.TotalNet = TotalNet;
	Content.InvoiceTable.Total 	  = Total;
	Content.InvoiceTable.Vat 	  = ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, Vat));
	
	Если Не СФНаАванс ИЛИ ВсеСтроки_СтавкаНДС_ИсчНалАг Тогда
		Content.InvoiceTable.TotalWithVatExcluded = TotalWithVatExcluded;
	КонецЕсли;
	
	Content.TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	//TransferDate заполняем только, если дата отгрузки не совпадает с датой счета-фактуры.
	Если ДанныеШапки.Свойство("ДатаОтгрузки") И НачалоДня(ДанныеШапки.ДатаОтгрузки) <> НачалоДня(ДатаНомер.ДатаДокумента) Тогда 
		Content.TransferInfo.TransferDate = ДанныеШапки.ДатаОтгрузки;
	КонецЕсли;
	
	ДанныеШапки.Свойство("СведенияОТранспортировкеИГрузе", Content.TransferInfo.TransferTextInfo);
	
	ЗаполнитьСведенияОПередаче(Content, ДокСсылка, ПараметрыФормирования.ФункцияДокумента, ПараметрыФормирования);
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗаполнитьСведенияОЛицеПередавшемТовар"
		, Content
		, ДанныеШапки
		, ПараметрыФормирования);
	
	Если ДанныеШапки.Функция = "InvoiceAndBasic" Тогда
		Content.Name = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ИначеЕсли ДанныеШапки.Функция = "Basic" Тогда
		Content.Name = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	КонецЕсли;
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	ДобавитьДокументыОснованияВСлужебнуюИнформацию(Content);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlUCD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДанныеДляПечати = ДанныеДляФормированияУКД(ДокСсылка, Новый Структура("ФункцияУПД", ПараметрыФормирования.ФункцияДокумента));
	
	ШапкаУКД 		= ДанныеДляПечати.Шапка;
	ТаблицаТоваров  = ДанныеДляПечати.ТабличнаяЧасть;
	
	Content.Function = ШапкаУКД.Функция;
	
	Если ШапкаУКД.Функция = "InvoiceAndBasic" Тогда
		Content.Name = "Корректировочный счет-фактура и документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	ИначеЕсли ШапкаУКД.Функция = "Basic" Тогда
		Content.Name = "Документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	КонецЕсли;
	
	ДатаНомер = ШапкаУКД.ДатаНомерДокумента;
	ОписаниеДокумента = ШапкаУКД.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	Для каждого ДатаНомерДокументаОснования Из ДатаНомер.ДатаНомерДокументовОснований Цикл
		ЗаполнитьInvoiceForCorrectionInfo(Content.Invoices, ДатаНомерДокументаОснования);
	КонецЦикла;
	
	Продавец = ПолучитьГоловноеЮрлицо(ШапкаУКД.Организация);
	
	Если ЗначениеЗаполнено(ДатаНомер.ДатаИсправления) Тогда
		
		ДатаРеквизитов = ДатаНомер.ДатаИсправления;
		
	Иначе
		
		ДатаРеквизитов = ДатаНомер.ДатаДокумента;
		
	КонецЕсли;
	
	Заполнить_ExtendedOrganizationInfo(Content.Seller, Продавец, ДатаРеквизитов, Истина, ШапкаУКД.БанковскийСчетОрганизации, Неопределено, ШапкаУКД.ОбособленноеПодразделение);
	Если ПараметрыФормирования.Свойство("Отправитель_FnsParticipantId") Тогда
		Content.Seller.FnsParticipantId = ПараметрыФормирования.Отправитель_FnsParticipantId;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШапкаУКД.ДоговорАгента) Тогда
										
		Content.Creator  	= ШапкаУКД.Агент.НаименованиеПолное + ", " + МетодСервера(, "СформироватьПредставлениеИННКПП", ШапкаУКД.Агент.ИНН, ШапкаУКД.Агент.КПП);
		Content.CreatorBase = ШапкаУКД.ДоговорАгента.Наименование;
		
	Иначе
		Content.Creator = Content.Seller.Name + ", ИНН/КПП: " + МетодСервера(, "ПредставлениеИННКПП", Content.Seller);
	КонецЕсли;
	
	Покупатель = ПолучитьГоловноеЮрлицо(ШапкаУКД.Контрагент);
	Заполнить_ExtendedOrganizationInfo(Content.Buyer, Покупатель, ДатаРеквизитов, Истина);
	Если ПараметрыФормирования.Свойство("Получатель_FnsParticipantId") Тогда
		Content.Buyer.FnsParticipantId = ПараметрыФормирования.Получатель_FnsParticipantId;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШапкаУКД.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ШапкаУКД.КонтрагентКПП;
	КонецЕсли;
	
	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	
	Content.ВалютаСсылка 	= ?(ШапкаУКД.РасчетыВУсловныхЕдиницах, ВалютаРеглУчета, ШапкаУКД.ВалютаДокумента);
	Content.Currency 		= ?(ЗначениеЗаполнено(Content.ВалютаСсылка), Строка(Content.ВалютаСсылка.Код), "");
	
	ШапкаУКД.Свойство("ИдентификаторГосконтракта", Content.GovernmentContractInfo);
	
	ЗаполнитьStructedAdditionalInfos(Content.AdditionalInfoId.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	ЗаполнитьInvoiceCorrectionTable(Content.InvoiceCorrectionTable, ТаблицаТоваров);
	
	ЗаполнитьEventContent(Content.EventContent, ШапкаУКД);
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ШапкаУКД);
	
	Content.СлужебнаяИнформация.Вставить("ПередаточныеДокументы", ШапкаУКД.ПередаточныеДокументы);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlTorg12(Content, Знач ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДокСсылка = ДокументОтгрузки(ДокСсылка);
	
	ДанныеШапки = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров = ПолучитьДанныеТЧ(ДокСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	ОписаниеДокумента = ДанныеШапки.ОписаниеДокумента;
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	
	Content.Number = ДатаНомер.НомерДокумента;
	Content.Date = ДатаНомер.ДатаДокумента;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(
		Content.Seller,
		ДанныеШапки.Организация,
		ДатаНомер.ДатаДокумента,
		ДанныеШапки.БанковскийСчетОрганизации,
		Истина
	);
	
	ГрузоотправительСсылка = ?(Не ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель), ДанныеШапки.Организация, ДанныеШапки.Грузоотправитель);
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Shipper, ГрузоотправительСсылка, ДатаНомер.ДатаДокумента, , Ложь);
	
	Content.ShipperDepartment = ПолучитьПодразделениеИзДокумента(ДокСсылка);
	
	ГрузополучательСсылка = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Consignee, ГрузополучательСсылка, ДатаНомер.ДатаДокумента, , Ложь, , , ДанныеШапки.АдресДоставки);
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента, , Истина);
	
	НомерЗаказа = ПараметрыФормирования.НомерЗаказа;
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда
		Content.GroundName = "Заказ";
		Content.GroundNumber = СокрЛП(НомерЗаказа);
	Иначе
		СтруктураДоговора = СтруктурированноеПредставлениеОснования(ДокСсылка);
		Content.GroundName = СтруктураДоговора.GroundName;
		Content.GroundDate = СтруктураДоговора.GroundDate;
		Content.GroundNumber = СтруктураДоговора.GroundNumber;
	КонецЕсли;
	
	ДопСведения = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ИдКонтрагента = ОбработкаОбъект.Контрагент_2_CounteragentBoxID(ДанныеШапки.Контрагент);
	Если ОбработкаОбъект.НужноФормироватьДопИнфоПоШаблону(ИдКонтрагента) = Истина Тогда
		content.AdditionalInfo = ОбработкаОбъект.СформироватьСтрокуДопИнфоПоШаблону(ДопСведения);
	Иначе
		content.AdditionalInfo = ДопСведения;
	КонецЕсли;
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		МетодСервера(, "ЗаполнитьВТаблице_СтавкаНДС_ИсчНалАг", ТаблицаТоваров);
	КонецЕсли;
	
	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	ВалютаВзаиморасчетов = ДанныеШапки.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	НуженПересчетВРубли = НЕ (ДанныеШапки.ВалютаДокумента = ВалютаРеглУчета);
	
	Если НЕ ВалютаВзаиморасчетов = ВалютаРеглУчета И НуженПересчетВРубли И ОписаниеДокумента.Проведен Тогда
		
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеШапки.ВалютаДокумента, ДатаНомер.ДатаДокумента);
		
		Курс = КурсИКратность.Курс;
		Кратность = КурсИКратность.Кратность;
		
		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
			
			Если СтрокаТаблицы.СуществуютЗаписиРублевыхСумм Тогда
				СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.НДСВРублях;
				СуммаБезНДС = СтрокаТаблицы.ВсегоВРублях - СтрокаТаблицы.НДСВРублях;
			Иначе
				Кратность= ?(Кратность = 0, 1, Кратность);
				СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.СуммаНДС * Курс / Кратность;
				СуммаБезНДС = (СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.СуммаНДС) * Курс / Кратность - СтрокаТаблицы.СуммаНДС;
			КонецЕсли;
			
			СтрокаТаблицы.Сумма = СуммаБезНДС + СтрокаТаблицы.СуммаНДС;
			
			Если СтрокаТаблицы.СуммаВключаетНДС И СтрокаТаблицы.СуммаНДС <> 0 Тогда
				СтрокаТаблицы.Цена = ?(СтрокаТаблицы.Количество = 0, СуммаБезНДС, СуммаБезНДС / СтрокаТаблицы.Количество);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	TotalParcelsQuantity 	= 0;
	TotalGrossQuantity 		= 0;
	TotalMassQuantity		= 0;
	TotalWithVatExcluded 	= 0;
	Total 					= 0;
	Vat 					= 0;
	
	СтруктураItems = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_Torg12Item");
	ЕстьСтрокиСНДС = Ложь;
	
	Для каждого СтрокаТаблицы из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItems);
		
		Item.Product = СтрокаТаблицы.НоменклатураПредставление;
		Item.ProductCode = СтрокаТаблицы.КодНоменклатуры;
		Item.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаТаблицы.ЕдиницаИзмерения, СокрЛП(СтрокаТаблицы.КодЕдиницыИзмерения));
		Item.UnitName = Строка(СтрокаТаблицы.ЕдиницаИзмерения);
		Item.Quantity = СтрокаТаблицы.Количество;
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		
		Если Не МенеджерИнтеграции_ЭтоСтавкаБезНДС(Item.TaxRate) Тогда
			ЕстьСтрокиСНДС = Истина;
		КонецЕсли;
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Total = СтрокаТаблицы.Сумма + ?(СтрокаТаблицы.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
		Item.TotalWithVatExcluded = Item.Total - Item.Vat;
		Item.Price = Окр(Item.TotalWithVatExcluded / ?(Item.Quantity = 0, 1, Item.Quantity), 2);
		
		Item.СсылкаНаЕИ= СтрокаТаблицы.ЕдиницаИзмерения;
		
		Если НуженПересчетВРубли И ОписаниеДокумента.Проведен Тогда
			Если СтрокаТаблицы.СуществуютЗаписиРублевыхСумм Тогда
				Item.Vat= СтрокаТаблицы.НДСВРублях;
				Item.TotalWithVatExcluded = СтрокаТаблицы.ВсегоВРублях - СтрокаТаблицы.НДСВРублях;
			Иначе
				Кратность = ?(Кратность = 0, 1, Кратность);
				
				Item.Vat = СтрокаТаблицы.СуммаНДС * Курс / Кратность;
				Item.TotalWithVatExcluded = (СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.СуммаНДС) * Курс / Кратность - СтрокаТаблицы.СуммаНДС;
			КонецЕсли;
			
			Item.Total= Item.TotalWithVatExcluded + Item.Vat;
			
		КонецЕсли;
		
		Если (НуженПересчетВРубли ИЛИ (СтрокаТаблицы.СуммаВключаетНДС И СтрокаТаблицы.СуммаНДС <> 0)) И ОписаниеДокумента.Проведен Тогда
			
			Item.Price = ?(Item.Quantity = 0, Item.TotalWithVatExcluded, Окр(Item.TotalWithVatExcluded/Item.Quantity, 2));
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(строкаТаблицы.КоличествоМест) Тогда
			Item.ParcelsQuantity = СтрокаТаблицы.КоличествоМест;
			Item.ParcelCapacity = СтрокаТаблицы.КоличествоВОдномМесте;
			Item.ParcelType = ?(ЗначениеЗаполнено(строкаТаблицы.ВидУпаковки), строкаТаблицы.ВидУпаковки.Наименование, "");
			Item.GrossQuantity = СтрокаТаблицы.Масса;
			TotalGrossQuantity = TotalGrossQuantity + ?(ЗначениеЗаполнено(Item.GrossQuantity), Item.GrossQuantity, 0);
			TotalParcelsQuantity = TotalParcelsQuantity + Item.ParcelsQuantity;
		КонецЕсли;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.items.Добавить(Item);
		
		TotalMassQuantity = TotalMassQuantity + Item.Quantity;
		TotalWithVatExcluded = TotalWithVatExcluded + Item.TotalWithVatExcluded;
		Total = Total + Item.Total;
		Vat = Vat + Item.Vat;
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Item.TaxRate) Тогда
			Item.Vat = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Content.Totals.ParcelsQuantity 		= TotalParcelsQuantity;
	Content.Totals.GrossQuantity 		= TotalGrossQuantity;
	Content.Totals.Quantity 			= TotalMassQuantity;
	Content.Totals.TotalWithVatExcluded = TotalWithVatExcluded;
	Content.Totals.Total 				= Total;
	Content.Totals.Vat 					= ?(ЕстьСтрокиСНДС, Vat, Неопределено);
	
	Content.SupplyDate 					= Content.Date;
	
	Если НуженПересчетВРубли И ОписаниеДокумента.Проведен Тогда
		Content.commons.TotalSumInWords = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Content.Totals.Total, ВалютаРеглУчета);
	Иначе
		Content.commons.TotalSumInWords = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДанныеШапки.СуммаДокумента, ДанныеШапки.ВалютаДокумента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(TotalParcelsQuantity) Тогда
		Content.commons.TotalParcelsQuantityInWords
			= Стрзаменить(ЧислоПрописью(TotalParcelsQuantity, "ДП = Ложь"), "  00", "");
	КонецЕсли;
	
	ФИОСогласователя = "";
	
	ДолжностьСогласователя = "";
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОСогласователя 		= ПараметрыОтправкиНаСогласование.ФИОПодписанта;
			ДолжностьСогласователя 	= ПараметрыОтправкиНаСогласование.ДолжностьПодписанта;
		Иначе
			Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПолучателя) Тогда
				ФИОСогласователя 	= ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			КонецЕсли;
			ДолжностьСогласователя 	= ПараметрыОтправкиНаСогласование.ДолжностьПолучателя;
		КонецЕсли;
	КонецЕсли;
	
	Если ФИОСогласователя = "" Тогда
		
		ПараметрыПодписания = МетодСервера(,"ПолучитьПараметрыПодписанияТ12вДиадок", ДанныеШапки.Организация);
		
		Если ПараметрыПодписания.СпособПодписания = "4" Тогда
			ОбработкаОбъект.ЗаполнитьПодписантаДляXmlTorg12(Content.SupplyPerformedBy, ОбработкаОбъект.ПредставлениеВизирующегоСтруктурой(ПараметрыПодписания));
			ОбработкаОбъект.ЗаполнитьПодписантаДляXmlTorg12(Content.SupplyAllowedBy, ОбработкаОбъект.ПредставлениеВизирующегоСтруктурой(ПараметрыПодписания));
			
			ПараметрыПодписания.ДолжностьПодписанта = "Главный (старший) бухгалтер";
			ОбработкаОбъект.ЗаполнитьПодписантаДляXmlTorg12(Content.ChiefAccountant, ОбработкаОбъект.ПредставлениеВизирующегоСтруктурой(ПараметрыПодписания));
			
		ИначеЕсли параметрыПодписания.СпособПодписания = "2" Тогда
			ПараметрыПодписания.ДолжностьПодписанта = "Главный (старший) бухгалтер";
			ОбработкаОбъект.ЗаполнитьПодписантаДляXmlTorg12(Content.ChiefAccountant, ОбработкаОбъект.ПредставлениеВизирующегоСтруктурой(ПараметрыПодписания));
		ИначеЕсли параметрыПодписания.СпособПодписания = "3" Тогда
			ОбработкаОбъект.ЗаполнитьПодписантаДляXmlTorg12(Content.SupplyPerformedBy, ОбработкаОбъект.ПредставлениеВизирующегоСтруктурой(ПараметрыПодписания));
		Иначе	
			ОбработкаОбъект.ЗаполнитьПодписантаДляXmlTorg12(Content.SupplyAllowedBy, ОбработкаОбъект.ПредставлениеВизирующегоСтруктурой(ПараметрыПодписания));
		КонецЕсли;
		
	Иначе 
		ОбработкаОбъект.ЗаполнитьФИОПодписанта(Content.SupplyAllowedBy, ФИОСогласователя);
		Content.SupplyAllowedBy.JobTitle = СокрЛП(?(НЕ ПустаяСтрока(ДолжностьСогласователя), ДолжностьСогласователя, "_"));
	КонецЕсли;
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlAcceptanceCertificate(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокСсылка);
	ТаблицаТоваров	 = ПолучитьДанныеТЧ(ДокСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТаблицаТоваров);
	
	ОписаниеДокумента = ДанныеШапки.ОписаниеДокумента;
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	//поставщик: организация-продавец
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеШапки.Организация,  ДатаНомер.ДатаДокумента, ДанныеШапки.БанковскийСчетОрганизации, Истина);
	
	ПредставлениеИсполнителя = СформироватьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Организация, ДатаНомер.ДатаДокумента);
	ПредставлениеЗаказчика   = СформироватьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Контрагент, ДатаНомер.ДатаДокумента);
	
	СтруктураДоговора = СтруктурированноеПредставлениеОснования(ДокСсылка);
	
	НомерДоговора 	= ?(СтруктураДоговора.GroundNumber = "", "", " по договору № " + СтруктураДоговора.GroundNumber);
	ДатаДоговора 	= ?(СтруктураДоговора.GroundDate = Дата(1, 1, 1), "", " от " + Формат(СтруктураДоговора.GroundDate, "ДФ=dd.MM.yyyy"));
	ДатаДоговора 	= ?((СтруктураДоговора.GroundNumber = "" И СтруктураДоговора.GroundDate <> Дата(1, 1, 1)), " по договору " + ДатаДоговора, ДатаДоговора); 
	
	ТекстАкта = "Мы, нижеподписавшиеся, представитель " + ПредставлениеИсполнителя + " (далее «Исполнитель»), с одной стороны, и представитель " + ПредставлениеЗаказчика + " (далее «Заказчик»), с другой стороны," +
				" составили настоящий акт о том, что «Исполнитель» выполнил, а  «Заказчик» принял следующие работы (услуги)" + НомерДоговора + ДатаДоговора + ":";
	
	Content.Title = ТекстАкта;
	
	ДопСведения = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ИдКонтрагента = ОбработкаОбъект.Контрагент_2_CounteragentBoxID(ДанныеШапки.Контрагент);
	Если ОбработкаОбъект.НужноФормироватьДопИнфоПоШаблону(ИдКонтрагента) = Истина Тогда
		Content.AdditionalInfo = ОбработкаОбъект.СформироватьСтрокуДопИнфоПоШаблону(ДопСведения);
	Иначе
		Content.AdditionalInfo = ДопСведения;
	КонецЕсли;
	
	Content.SignatureDate =	Content.Date;
	
	СтруктураItems = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AcceptanceCertificateItem");
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		МетодСервера(, "ЗаполнитьВТаблице_СтавкаНДС_ИсчНалАг", ТаблицаТоваров);
	КонецЕсли;
	
	ВалютаРеглУчета 		= ВалютаРегламентированногоУчета();
	ВалютаВзаиморасчетов	= ДанныеШапки.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	НуженПересчетВРубли 	= ДанныеШапки.РасчетыВУсловныхЕдиницах И НЕ (ДанныеШапки.ВалютаДокумента = ВалютаРеглУчета);
					
	Если НЕ ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
		Если НуженПересчетВРубли И ОписаниеДокумента.Проведен Тогда
			
			КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеШапки.ВалютаДокумента, ДатаНомер.ДатаДокумента);
									
			Курс      = КурсИКратность.Курс;
			Кратность = КурсИКратность.Кратность;

			Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
											
				Если СтрокаТаблицы.СуществуютЗаписиРублевыхСумм Тогда
					СтрокаТаблицы.СуммаНДС 	= СтрокаТаблицы.НДСВРублях;
					СуммаБезНДС				= СтрокаТаблицы.ВсегоВРублях - СтрокаТаблицы.НДСВРублях;
				Иначе
					Кратность = ?(Кратность = 0, 1, Кратность);
					СтрокаТаблицы.СуммаНДС	= СтрокаТаблицы.СуммаНДС * Курс / Кратность;
					СуммаБезНДС				= (СуммаБезНДС + СтрокаТаблицы.СуммаНДС) * Курс / Кратность - СтрокаТаблицы.СуммаНДС;
				КонецЕсли;
												
				СтрокаТаблицы.Сумма = СуммаБезНДС + СтрокаТаблицы.СуммаНДС;
				
				Если НуженПересчетВРубли ИЛИ (СтрокаТаблицы.СуммаВключаетНДС И СтрокаТаблицы.СуммаНДС <> 0) Тогда
					
					СтрокаТаблицы.Цена = ?( СтрокаТаблицы.Количество = 0,
											СуммаБезНДС,
											СуммаБезНДС / СтрокаТаблицы.Количество);
						
				КонецЕсли;
					
			КонецЦикла;
			
		КонецЕсли;						
	КонецЕсли;
					
	Для каждого СтрокаТаблицы из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItems);
		Если 	НЕ ЗначениеЗаполнено(СтрокаТаблицы.Количество) 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.КодЕдиницыИзмерения) Тогда 
			
			Item.Description = СтрокаТаблицы.НоменклатураПредставление;
		Иначе 
			Item.Name = СтрокаТаблицы.НоменклатураПредставление;
		КонецЕсли;	 
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			Item.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаТаблицы.ЕдиницаИзмерения, СокрЛП(СтрокаТаблицы.КодЕдиницыИзмерения));
			Если Item.UnitCode = "" И ЗначениеЗаполнено(Item.Name) Тогда
				Item.Description	= Item.Name;
				Item.Name			= Неопределено;
			КонецЕсли;
		Иначе
			Item.UnitCode = "";
		КонецЕсли;
							
		Item.UnitName 	= Строка(СтрокаТаблицы.ЕдиницаИзмерения);
		Item.Quantity	= СтрокаТаблицы.Количество;
							
		Item.Vat		= СтрокаТаблицы.СуммаНДС;
		Item.Total		= СтрокаТаблицы.Сумма + ?(СтрокаТаблицы.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
		Item.TotalWithVatExcluded = Item.Total - Item.Vat;
		Item.Price		= ?(НЕ ЗначениеЗаполнено(item.Quantity), Неопределено, Окр(item.TotalWithVatExcluded / item.Quantity, 2));
		Item.СсылкаНаЕИ	= СтрокаТаблицы.ЕдиницаИзмерения;
		
		Если НуженПересчетВРубли И ОписаниеДокумента.Проведен Тогда
			Если СтрокаТаблицы.СуществуютЗаписиРублевыхСумм Тогда
				Item.Vat					= СтрокаТаблицы.НДСВРублях;
				Item.TotalWithVatExcluded	= СтрокаТаблицы.ВсегоВРублях - СтрокаТаблицы.НДСВРублях;
			Иначе
				Кратность = ?(Кратность = 0, 1, Кратность);
										
				Item.Vat					= СтрокаТаблицы.СуммаНДС * Курс / Кратность;
				Item.TotalWithVatExcluded	= (СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.СуммаНДС) * Курс / Кратность - СтрокаТаблицы.СуммаНДС;
			КонецЕсли;
			
			Item.Total = Item.TotalWithVatExcluded + Item.Vat;
									
		КонецЕсли;
		
		Если (НуженПересчетВРубли ИЛИ (СтрокаТаблицы.СуммаВключаетНДС И СтрокаТаблицы.СуммаНДС <> 0)) И ОписаниеДокумента.Проведен И Item.Quantity <> Неопределено Тогда
			
			Item.Price = ?(Item.Quantity = 0, Item.TotalWithVatExcluded, Окр(Item.TotalWithVatExcluded/Item.Quantity, 2));
									
		КонецЕсли;
		
		Item.Vat = ?(СтрокаТаблицы.СтавкаНДС = МенеджерИнтеграции_СтавкаБезНДС(), Неопределено, Item.Vat);
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТаблицы);
		
		Content.items.Добавить(Item);
		
	КонецЦикла;
	
	ПараметрыПодписания = МетодСервера(,"ПолучитьПараметрыПодписанияТ12вДиадок", ДанныеШапки.Организация);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ПараметрыПодписания.ФИОПодписанта 		= ПараметрыОтправкиНаСогласование.ФИОПодписанта;
			ПараметрыПодписания.ДолжностьПодписанта = ПараметрыОтправкиНаСогласование.ДолжностьПодписанта;
		Иначе
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			ПараметрыПодписания.ФИОПодписанта 		= ПараметрыОтправкиНаСогласование.ФИОПолучателя;
			ПараметрыПодписания.ДолжностьПодписанта = ПараметрыОтправкиНаСогласование.ДолжностьПолучателя;
		КонецЕсли;
	КонецЕсли;
					
	ОбработкаОбъект.ЗаполнитьПодписантаДляXmlTorg12(content.Official, ОбработкаОбъект.ПредставлениеВизирующегоСтруктурой(ПараметрыПодписания));
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеШапки);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoice(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ДанныеДляПечати = СформироватьДанныеДляПечати(ДокСсылка, Ложь);
	
	ДатаНомер = ДанныеДляПечати.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеДляПечати.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.InvoiceRevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.InvoiceRevisionDate		 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	СтруктураPaymentDocuments= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_PaymentDocument");
	
	Для Каждого ПРД Из ДанныеДляПечати.ДатаНомерДокументовОплаты Цикл
		
		PaymentDocumentContent=	СкопироватьСтруктуру(СтруктураPaymentDocuments);
		
		PaymentDocumentContent.Number = ПРД.НомерПлатежноРасчетногоДокумента;
		PaymentDocumentContent.date   = ПРД.ДатаПлатежноРасчетногоДокумента;
		
		Content.PaymentDocuments.Добавить(PaymentDocumentContent);
		
	КонецЦикла;	
	
	Content.currency = ?(ЗначениеЗаполнено(ДанныеДляПечати.ВалютаДокумента), Строка(ДанныеДляПечати.ВалютаДокументаКод), "");
	Content.ВалютаСсылка =   ДанныеДляПечати.ВалютаДокумента;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент, ДатаНомер.ДатаДокумента, , Истина, Истина);
	Если ЗначениеЗаполнено(ДанныеДляПечати.КонтрагентКПП) Тогда
		Content.Buyer.kpp =  ДанныеДляПечати.КонтрагентКПП;
	КонецЕсли;

	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеДляПечати.Организация, ДатаНомер.ДатаДокумента, , Истина, Истина, ДанныеДляПечати.ГрузоотправительКПП);
	
	Если ДанныеДляПечати.ЕстьТовары Тогда 
		
		Если ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель) Тогда  
			ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(Content.Shipper, ДанныеДляПечати.Грузоотправитель, ДатаНомер.ДатаДокумента); 
			Content.Shipper.SameAsSellerOrBuyer = Ложь;
		Иначе 
			Content.Shipper.SameAsSellerOrBuyer = Истина;
		КонецЕсли;
		
		Грузополучатель = ?(ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель), ДанныеДляПечати.Грузополучатель, ДанныеДляПечати.Контрагент);
		ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(Content.Consignee, ДанныеДляПечати.Грузополучатель, ДатаНомер.ДатаДокумента, ДанныеДляПечати.АдресДоставки);
		
	КонецЕсли;
	
	ЗаполнитьStructedAdditionalInfos(Content.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	СтруктураItemInvoice=	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItem");
	
	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	
	НуженПересчетВРубли = (ДанныеДляПечати.РасчетыВУсловныхЕдиницах И ДанныеДляПечати.ВалютаДокумента <> ВалютаРеглУчета);
	
	Если НуженПересчетВРубли = Истина И ДанныеДляПечати.Проведен Тогда
		
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеДляПечати.ВалютаДокумента, ДатаНомер.ДатаДокумента);
		
		Курс      = КурсИКратность.Курс;
		Кратность = КурсИКратность.Кратность;
		
		Для каждого СтрМассива из ДанныеДляПечати.ТабличнаяЧасть Цикл
        	
			Если СтрМассива.СуществуютЗаписиРублевыхСумм Тогда
				СтрМассива.СуммаНДС	= СтрМассива.НДСВРублях;
				СуммаБезНДС 		= СтрМассива.ВсегоВРублях - СтрМассива.НДСВРублях;
			Иначе
				Кратность = ?(Кратность = 0, 1, Кратность);
				СтрМассива.СуммаНДС = СтрМассива.СуммаНДС * Курс / Кратность;
				СуммаБезНДС 		= (СуммаБезНДС + СтрМассива.СуммаНДС) * Курс / Кратность - СтрМассива.СуммаНДС;
			КонецЕсли;
										
			СтрМассива.Сумма = СуммаБезНДС + СтрМассива.СуммаНДС;
			
			Если НуженПересчетВРубли ИЛИ (СтрМассива.СуммаВключаетНДС И СтрМассива.СуммаНДС <> 0) Тогда
				
				СтрМассива.Цена = ?(СтрМассива.Количество = 0,
					СуммаБезНДС,
					СуммаБезНДС / СтрМассива.Количество);
					
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Vat= 0;
	TotalWithVatExcluded= 0;
	Total= 0;
	Для каждого Стр из ДанныеДляПечати.ТабличнаяЧасть Цикл
		
		Item= СкопироватьСтруктуру(СтруктураItemInvoice);
		
		Item.Product= 	Стр.НоменклатураПредставление;
		
		Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Item.UnitCode= МетодСервера(, "Item_UnitCode", Стр.ЕдиницаИзмерения, СокрЛП(Стр.КодЕдиницыИзмерения));
		Иначе
			Item.UnitCode= "";
		КонецЕсли;
							
		Item.ЕдиницаИзмеренияСсылка= Стр.ЕдиницаИзмерения;
		
		Если СчетФактуранаАванс(ДокСсылка) = Ложь Тогда 
			Item.TotalWithVatExcluded= Стр.Сумма - ?(Стр.СуммаВключаетНДС, Стр.СуммаНДС, 0);
		КонецЕсли;	
		
		Если СчетФактуранаАванс(ДокСсылка) = Ложь И ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) И ЗначениеЗаполнено(Стр.КодЕдиницыИзмерения) Тогда 
			Item.Quantity= Стр.Количество;
			Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДС) Тогда
				Item.price= Строка(Стр.Цена);
			Иначе	
				Item.price= Строка(?(Item.Quantity = 0, Неопределено, Окр(Item.TotalWithVatExcluded / Item.Quantity, Точность)));
			КонецЕсли;
		Иначе 
			//Item.Quantity = 0;
			//Item.price =  0;
		КонецЕсли;
							
		Item.Vat= 		Стр.СуммаНДС;
		Item.Total= 	Стр.Сумма + ?(Стр.СуммаВключаетНДС, 0, Стр.СуммаНДС);
		Item.TaxRate = ПредставлениеСтавкиНДС(Стр.СтавкаНДС);
		Item.CountriesOfOrigin= 		?(ЗначениеЗаполнено(Стр.СтранаПроисхождения), Стр.СтранаПроисхождения.Код, "");
		Item.СтранаПроисхожденияСсылка= ?(ЗначениеЗаполнено(Стр.СтранаПроисхождения), Стр.СтранаПроисхождения, Справочники.СтраныМира.ПустаяСсылка());
		Item.CustomsDeclarationNumbers= ?(ЗначениеЗаполнено(Стр.НомерГТД), ?(ТипЗнч(Стр.НомерГТД) = Тип("Строка"), СокрЛП(Стр.НомерГТД), СокрЛП(Стр.НомерГТД.Код)), "");
							
		Если НуженПересчетВРубли И ДанныеДляПечати.Проведен Тогда
			Если Стр.СуществуютЗаписиРублевыхСумм Тогда
				Item.Vat= Стр.НДСВРублях;
				Item.TotalWithVatExcluded= Стр.ВсегоВРублях - Стр.НДСВРублях;
			Иначе
				Кратность= ?(Кратность = 0, 1, Кратность);
				
				Item.Vat= Стр.СуммаНДС * Курс / Кратность;
				Item.TotalWithVatExcluded= (Стр.СуммаБезНДС + Стр.СуммаНДС) * Курс / Кратность - Стр.СуммаНДС;
			КонецЕсли;
			
			Item.Total= Item.TotalWithVatExcluded + Item.Vat;
									
		КонецЕсли;
		
		Если (НуженПересчетВРубли ИЛИ (Стр.СуммаВключаетНДС И Стр.СуммаНДС <> 0)) И ДанныеДляПечати.ОписаниеДокумента.Проведен Тогда
			
			Если НЕ Item.Price = Неопределено Тогда 
				Item.Price= Строка(?(Item.Quantity = 0, Item.TotalWithVatExcluded, Окр(Item.TotalWithVatExcluded/Item.Quantity, Точность)));
			КонецЕсли;
			
		КонецЕсли;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, Стр);
		
		Content.items.Добавить(Item);
		
		Vat= 					Vat 					+ Item.Vat;
		TotalWithVatExcluded= 	TotalWithVatExcluded	+ ?(Item.TotalWithVatExcluded = Неопределено, 0, Item.TotalWithVatExcluded);
		Total=					Total					+ Item.Total;
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Item.TaxRate) Тогда
			Item.Vat = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Content.Totals.Vat 					= Vat;
	Content.Totals.TotalWithVatExcluded = TotalWithVatExcluded;
	Content.Totals.Total 				= Total;

	стПодписант = МетодСервера(, "СформироватьПараметрыПодписанта", ПараметрыФормирования.ФИОПодписанта);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПодписанта;
		Иначе	
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПолучателя;
		КонецЕсли;
		
		ПодписантФамилия=				ВыделитьСлово(ФИОПолучателя);
		ПодписантИмя= 					ВыделитьСлово(ФИОПолучателя);
		ПодписантОтчество= 				ВыделитьСлово(ФИОПолучателя);
		
		стПодписант.ПодписантФамилия=	?(НЕ ПустаяСтрока(ПодписантФамилия), ПодписантФамилия, " ");
		стПодписант.ПодписантИмя= 		?(НЕ ПустаяСтрока(ПодписантИмя), ПодписантИмя, " ");
		стПодписант.ПодписантОтчество= 	?(НЕ ПустаяСтрока(ПодписантОтчество), ПодписантОтчество, "");
		
	КонецЕсли;
					
	Content.Signer.Surname 		= стПодписант.ПодписантФамилия;
	Content.Signer.FirstName 	= стПодписант.ПодписантИмя;
	Content.Signer.Patronymic 	= стПодписант.ПодписантОтчество;
	Content.Signer.Inn 			= Content.seller.inn;
	Content.Signer.IsSoleProprietor	= Content.seller.IsSoleProprietor;
	Content.Signer.SoleProprietorRegistrationCertificate = ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляПечати.Организация);	
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеДляПечати);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoiceCorrection(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ДанныеДляПечати	 = СформироватьДанныеДляПечати(ДокСсылка, Истина);
	
	ДатаНомер = ДанныеДляПечати.ДатаНомерДокумента;
	ОписаниеДокумента = ДанныеДляПечати.ОписаниеДокумента;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Content.InvoiceCorrectionNumber	 = ДатаНомер.НомерДокумента;
	Content.InvoiceCorrectionDate	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	ДанныеОснований = ДатаНомер.ДатаНомерДокументовОснований;
	
	Если ЗначениеЗаполнено(ДанныеОснований) Тогда
		
		ДанныеОснования = ДанныеОснований[0];
		
		OriginalInvoices = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_OriginalInvoice");
		OriginalInvoices.Number	 = ДанныеОснования.НомерИсходногоДокумента;
		OriginalInvoices.Date	 = ДанныеОснования.ДатаИсходногоДокумента;
		
		Если ДанныеОснования.УчитыватьИсправлениеИсходногоДокумента Тогда
			OriginalInvoices.InvoiceRevisionNumber	 = ДанныеОснования.НомерИсправленияИсходногоДокумента;
			OriginalInvoices.InvoiceRevisionDate	 = ДанныеОснования.ДатаИсправленияИсходногоДокумента;
		КонецЕсли;
		Content.OriginalInvoices.Добавить(OriginalInvoices);
	
	КонецЕсли;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент,  ДатаНомер.ДатаДокумента, , Истина, Истина);
	
	Если ЗначениеЗаполнено(ДанныеДляПечати.КонтрагентКПП) Тогда
		Content.Buyer.kpp = ДанныеДляПечати.КонтрагентКПП
	КонецЕсли;
	
	ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(Content.Seller, ДанныеДляПечати.Организация, ДатаНомер.ДатаДокумента, , Истина, Истина, ДанныеДляПечати.ГрузоотправительКПП);
	
	content.currency = ?(ЗначениеЗаполнено(ДанныеДляПечати.ВалютаДокумента), Строка(ДанныеДляПечати.ВалютаДокументаКод), "");
	content.ВалютаСсылка =   ДанныеДляПечати.ВалютаДокумента;
	
	ЗаполнитьStructedAdditionalInfos(Content.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);

	СтруктураItemInvoiceCorrection= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceCorrectionItem");

	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	
	Для каждого СтрокаДанных из ДанныеДляпечати.ТабличнаяЧасть Цикл 
						
		Item= СкопироватьСтруктуру(СтруктураItemInvoiceCorrection);
		Item.AmountsDec = 		МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.AmountsInc = 		МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.OriginalValues = 	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		Item.CorrectedValues =	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		
		Item.Product =	СтрокаДанных.НоменклатураПредставление;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения) Тогда
			Item.OriginalValues.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаДанных.ЕдиницаИзмеренияДоИзменения, СокрЛП(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Код));
			Item.OriginalValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмеренияДоИзменения;
		Иначе
			Item.OriginalValues.UnitCode = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
			Item.CorrectedValues.UnitCode = МетодСервера(, "Item_UnitCode", СтрокаДанных.ЕдиницаИзмерения, СокрЛП(СтрокаДанных.ЕдиницаИзмерения.Код));
			Item.CorrectedValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмерения;
		Иначе
			Item.CorrectedValues.UnitCode = "";	
		КонецЕсли;
							
		Item.OriginalValues.TotalWithVatExcluded=	СтрокаДанных.СуммаДоИзменения - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДСДоИзменения, 0);
		Item.CorrectedValues.TotalWithVatExcluded= 	СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДС, 0);
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения) И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Код) Тогда
			Item.OriginalValues.Quantity =	СтрокаДанных.КоличествоДоИзменения;
			Item.CorrectedValues.Quantity = 	СтрокаДанных.Количество;
			
			Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(СтрокаДанных.СтавкаНДСДоИзменения) Тогда
				Item.OriginalValues.Price = СтрокаДанных.ЦенаДоИзменения;
			Иначе	
				Item.OriginalValues.Price = Строка(?(Item.OriginalValues.Quantity = 0, 0, Окр(Item.OriginalValues.TotalWithVatExcluded / Item.OriginalValues.Quantity, Точность)));
			КонецЕсли;
			Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(СтрокаДанных.СтавкаНДС) Тогда
				Item.CorrectedValues.Price = СтрокаДанных.Цена;
			Иначе	
				Item.CorrectedValues.Price = Строка(?(Item.CorrectedValues.Quantity = 0, 0, Окр(Item.CorrectedValues.TotalWithVatExcluded / Item.CorrectedValues.Quantity, Точность)));
			КонецЕсли;
			
		Иначе 
			Item.OriginalValues.Quantity =  0;
			Item.CorrectedValues.Quantity = 0;
		
			Item.OriginalValues.Price =	 0;
			Item.CorrectedValues.Price =  0;
		КонецЕсли;	
		
		СтавкаДоИзменения = СтрокаДанных.СтавкаНДСДоИзменения;
		Если Не ЗначениеЗаполнено(СтавкаДоИзменения) Тогда
			СтавкаДоИзменения = СтрокаДанных.СтавкаНДС;
		КонецЕсли;
		
		Item.OriginalValues.TaxRate = ПредставлениеСтавкиНДС(СтавкаДоИзменения);
		Item.CorrectedValues.TaxRate = ПредставлениеСтавкиНДС(СтрокаДанных.СтавкаНДС);
		
		
		Item.OriginalValues.Vat =	СтрокаДанных.СуммаНДСДоИзменения;
		Item.CorrectedValues.Vat =	СтрокаДанных.СуммаНДС;
		
		Item.OriginalValues.Total =	СтрокаДанных.СуммаДоИзменения + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДСДоИзменения);
		Item.CorrectedValues.Total = СтрокаДанных.Сумма + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		
		Content.items.Добавить(Item);
		
	КонецЦикла;

	стПодписант = МетодСервера(, "СформироватьПараметрыПодписанта", ПараметрыФормирования.ФИОПодписанта);
	
	ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	Если НЕ ПараметрыОтправкиНаСогласование = Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПараметрыОтправкиНаСогласование.ФИОПодписанта) Тогда
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПодписанта;
		Иначе
			ФИОПолучателя =	ПараметрыОтправкиНаСогласование.ФИОПолучателя;
		КонецЕсли;
		
		ПодписантФамилия =				ВыделитьСлово(ФИОПолучателя);
		ПодписантИмя = 					ВыделитьСлово(ФИОПолучателя);
		ПодписантОтчество = 				ВыделитьСлово(ФИОПолучателя);
		стПодписант.ПодписантФамилия =	?(НЕ ПустаяСтрока(ПодписантФамилия), ПодписантФамилия, " ");
		стПодписант.ПодписантИмя = 		?(НЕ ПустаяСтрока(ПодписантИмя), ПодписантИмя, " ");
		стПодписант.ПодписантОтчество = 	?(НЕ ПустаяСтрока(ПодписантОтчество), ПодписантОтчество, "");
		
	КонецЕсли;	
					
	Content.Signer.Surname 		= стПодписант.ПодписантФамилия;
	Content.Signer.FirstName 	= стПодписант.ПодписантИмя;
	Content.Signer.Patronymic 	= стПодписант.ПодписантОтчество;
	Content.Signer.Inn 			= Content.seller.inn;
	Content.Signer.IsSoleProprietor	= Content.seller.IsSoleProprietor;
	Content.Signer.SoleProprietorRegistrationCertificate = ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляПечати.Организация);	
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(Content, ДанныеДляПечати);
	
КонецПроцедуры

#КонецОбласти

#Область МашиночитаемыеДоверенности
 
Функция МЧД_ИмяСправочникаВИнформационнойБазе(СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенности(Ссылка, СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтавкиНДС

Функция МенеджерИнтеграции_ОбщаяСтавкаНДС(Период = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОбщаяСтавкаНДС", Период);
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_СтавкаБезНДС()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СтавкаБезНДС");
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ЭтоСтавкаБезНДС(Ставка)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЭтоСтавкаБезНДС", Ставка);
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ЭтоСтавкаНДСИНА(Знач ПредставлениеСтавки)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЭтоСтавкаНДСИНА", ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция ЗначениеСтавкиНДС(ПредставлениеСтавки)
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = ПредставлениеСтавкиБезНДС();
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиНДС(ЗначениеСтавки)
	
	НДСИсчисляетсяНалоговымАгентом = (ТипЗнч(ЗначениеСтавки) = Тип("Строка"))
		И МенеджерИнтеграции_ЭтоСтавкаНДСИНА(ЗначениеСтавки);
	
	Если Не ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = "##";
		
	ИначеЕсли НДСИсчисляетсяНалоговымАгентом Тогда
		
		Результат = СтавкаНДСИсчисляетсяНалоговымАгентом();
		
	Иначе
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СокрЛП(ЗначениеСтавки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("0", Перечисления.СтавкиНДС.НДС0);
	Результат.Вставить("10", Перечисления.СтавкиНДС.НДС10);
	Результат.Вставить("18", Перечисления.СтавкиНДС.НДС18);
	Результат.Вставить("20", Перечисления.СтавкиНДС.НДС20);
	Результат.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
	Результат.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
	Результат.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
	Результат.Вставить(ПредставлениеСтавкиБезНДС(), Перечисления.СтавкиНДС.БезНДС);
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентом(), СтавкаНДСИсчисляетсяНалоговымАгентомПредставление());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить("5", Перечисления.СтавкиНДС.НДС5);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить("7", Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить("22", Перечисления.СтавкиНДС.НДС22);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
	КонецЕсли;
	
	Результат.Вставить(Перечисления.СтавкиНДС.НДС0, "0");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10, "10");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18, "18");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20, "20");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
	Результат.Вставить(Перечисления.СтавкиНДС.БезНДС, ПредставлениеСтавкиБезНДС());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетЗначениеПеречисленияСтавкиНДС(ИмяЗначенияСтавкаНДС)
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	Результат = (ЗначенияПеречисления.Найти(ИмяЗначенияСтавкаНДС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом()
	
	Возврат "ИсчНалАг";
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентомПредставление()
	
	Возврат "НДС исчисляется налоговым агентом";
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	
	Возврат "без НДС";
	
КонецФункции

#КонецОбласти

Функция ПредставлениеНомера(НомерОбъекта)
	
	Результат = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерОбъекта, Истина, Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНомераОбъекта(СсылкаНаОбъект)
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	
	РеквизитыОбъекта = Новый Структура;
	РеквизитыОбъекта.Вставить("Номер");
	
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ПредставлениеНомера") Тогда
		РеквизитыОбъекта.Вставить("ПредставлениеНомера");
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыОбъекта);
	
	Если ЗначенияРеквизитов.Свойство("ПредставлениеНомера") Тогда
		Результат = ЗначенияРеквизитов.ПредставлениеНомера;
	Иначе
		НомерОбъекта = ЗначенияРеквизитов.Номер;
		Результат = ПредставлениеНомера(НомерОбъекта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактура(СсылкаНаОбъект)
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	Результат = (ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьДокументыОснованияВСлужебнуюИнформацию(Контент)
	
	СсылкаНаОбъект = Контент.СлужебнаяИнформация.Ссылка;
	
	Если Не ЭтоСчетФактура(СсылкаНаОбъект)
		Или СчетФактураНаАванс(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОснования = ВсеДокументыОснования(СсылкаНаОбъект);
	Контент.СлужебнаяИнформация.Вставить("ДокументыОснования", ДокументыОснования);
	
КонецПроцедуры

Функция ВсеДокументыОснования(СсылкаНаОбъект)
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ИмяДокумента = МетаданныеОбъекта.Имя;
	
	ИмяМетаданныхТаблицыОснований = СтрЗаменить("Документ.%ИмяДокумента%.ТабличнаяЧасть.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
	
	Результат = Новый Массив;
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", ИмяМетаданныхТаблицыОснований) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	&ПолноеИмяТаблицы КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
		
		ПолноеИмяТаблицы = СтрЗаменить("Документ.%ИмяДокумента%.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ДокументОснование") Тогда
		
		Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОснование");
		Результат.Добавить(Основание);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает документ-основание счета-фактуры.
// Если оснований несколько, берется только первое.
//
// Параметры:
//  СчетФактура - ДокументСсылка.СчетФактураВыданный - Счет-фактура, основание которого требуется получить.
// 
// Возвращаемое значение:
//  ДокументСсылка - документ, на основании которого выписан счет-фактура.
//
Функция ДокументОснованиеСчетаФактуры(СчетФактура)
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ИмяДокумента = СчетФактура.Метаданные().ПолноеИмя();
	
	Если МетодСервера(, "СуществуетОбъектМетаданных", ИмяДокумента + ".ТабличнаяЧасть.ДокументыОснования") Тогда
	
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	&ПолноеИмяТаблицы КАК Т
		|ГДЕ
		|	Т.Ссылка = &СчетФактура";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ИмяДокумента + ".ДокументыОснования");
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Результат = Выборка.ДокументОснование;
		КонецЕсли;
		
	Иначе
		
		Результат = МетодСервера(, "ЗначениеРеквизитаОбъекта", СчетФактура, "ДокументОснование");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет реквизиты реализации отгруженных товаров значениями реквизитов документа отгрузки.
//
// Параметры:
//  ДанныеДокумента - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуРеализацииОтгруженныхТоваров(ДанныеДокумента)
	
	СсылкаНаОбъект = ДанныеДокумента.ОписаниеДокумента.Ссылка;
	
	Если Не ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументОтгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОтгрузки");
	ДанныеДокументаОтгрузки = ДанныеШапки(ДокументОтгрузки);
	
	КопируемыеРеквизиты = Новый Массив;
	КопируемыеРеквизиты.Добавить("Грузополучатель");
	КопируемыеРеквизиты.Добавить("Грузоотправитель");
	КопируемыеРеквизиты.Добавить("ВалютаДокумента");
	КопируемыеРеквизиты.Добавить("ВалютаДокументаКод");
	КопируемыеРеквизиты.Добавить("БанковскийСчетОрганизации");
	КопируемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
	КопируемыеРеквизиты.Добавить("ЦенаВключаетНДС");
	КопируемыеРеквизиты.Добавить("СведенияОТранспортировкеИГрузе");
	КопируемыеРеквизиты.Добавить("АдресДоставки");
	КопируемыеРеквизиты.Добавить("ОбособленноеПодразделение");
	КопируемыеРеквизиты.Добавить("ЦифровойИндексОбособленногоПодразделения");
	
	Для Каждого ИмяРеквизита Из КопируемыеРеквизиты Цикл 
		
		Если ЗначениеЗаполнено(ДанныеДокументаОтгрузки[ИмяРеквизита]) Тогда 
			ДанныеДокумента.Вставить(ИмяРеквизита, ДанныеДокументаОтгрузки[ИмяРеквизита]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет сумму НДС с учетом скидки весь документ
//
// Параметры:
//  ДанныеДокумента - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуСчетаНаОплатуПокупателю(ДанныеДокумента)
	
	СсылкаНаОбъект = ДанныеДокумента.ОписаниеДокумента.Ссылка;
	
	Если Не ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Возврат;
	КонецЕсли;
	
	СуммаНДСДокумента = СуммаНДССчетаНаОплату(СсылкаНаОбъект);
	
	ДанныеДокумента.Вставить("СуммаНДСДокумента", СуммаНДСДокумента);
	
КонецПроцедуры
                               
// Заполняет сумму НДС с учетом скидки весь документ
//
// Параметры:
//  ДанныеДокумента - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуСчетаНаАренду(ДанныеДокумента)
	
	СсылкаНаОбъект = ДанныеДокумента.ОписаниеДокумента.Ссылка;
	
	Если Не ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.АР_СчетНаАренду") Тогда
		Возврат;
	КонецЕсли;
	
	СуммаНДСДокумента = СсылкаНаОбъект.Состав.Итог("СуммаНДС");
	
	ДанныеДокумента.Вставить("СуммаНДСДокумента", СуммаНДСДокумента);
	
КонецПроцедуры

  // Заполняет сумму НДС по документу Реализация товаров услуг
//
// Параметры:
//  ДанныеДокумента - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуРеализацияТоваровУслуг(ДанныеДокумента)
	
	СсылкаНаОбъект = ДанныеДокумента.ОписаниеДокумента.Ссылка;
	
	Если Не ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	СуммаНДСДокумента = СуммаНДСРеализацииТоваровУслуг(СсылкаНаОбъект);
	
	ДанныеДокумента.Вставить("СуммаНДСДокумента", СуммаНДСДокумента);
	
КонецПроцедуры

// Заполняет реквизиты шапки счета-фактуры значениями реквизитов документа-основания.
// Для печати счета-фактуры многие реквизиты берутся из его документа-основания.
//
// Параметры:
//  ДанныеСчетаФактуры - Структура - см. функцию ДанныеШапки.
//
Процедура ДополнитьШапкуСчетаФактурыПоДокументуОснованию(ДанныеСчетаФактуры)
	
	СсылкаНаОбъект = ДанныеСчетаФактуры.ОписаниеДокумента.Ссылка;
	Если Не ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументОснование = ДокументОснованиеСчетаФактуры(СсылкаНаОбъект);
	
	ДанныеДокументаОснования = ДанныеШапки(ДокументОснование);
	
	КопируемыеРеквизиты = Новый Массив;
	КопируемыеРеквизиты.Добавить("Грузоотправитель");
	КопируемыеРеквизиты.Добавить("ВалютаДокумента");
	КопируемыеРеквизиты.Добавить("ВалютаДокументаКод");
	КопируемыеРеквизиты.Добавить("БанковскийСчетОрганизации");
	КопируемыеРеквизиты.Добавить("ЦенаВключаетНДС");
	КопируемыеРеквизиты.Добавить("СведенияОТранспортировкеИГрузе");
	КопируемыеРеквизиты.Добавить("АдресДоставки");
	КопируемыеРеквизиты.Добавить("ПодразделениеОрганизации");
	КопируемыеРеквизиты.Добавить("ОбособленноеПодразделение");
	КопируемыеРеквизиты.Добавить("ЦифровойИндексОбособленногоПодразделения");
	
	Если Не ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		КопируемыеРеквизиты.Добавить("Грузополучатель");
		КопируемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
	КонецЕсли;
	
	Для Каждого ИмяРеквизита Из КопируемыеРеквизиты Цикл 
		
		Если ЗначениеЗаполнено(ДанныеДокументаОснования[ИмяРеквизита]) Тогда 
			ДанныеСчетаФактуры.Вставить(ИмяРеквизита, ДанныеДокументаОснования[ИмяРеквизита]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументРеализацииСодержитТолькоУслуги(СсылкаНаОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги), ЛОЖЬ) КАК ЕстьУслуги,
	|	ЕСТЬNULL(МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары), ЛОЖЬ) КАК ЕстьТовары
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ИСТИНА КАК ЕстьТовары,
	|		ЛОЖЬ КАК ЕстьУслуги
	|	ИЗ
	|		&Товары КАК ТЧ
	|	ГДЕ
	|		ТЧ.Ссылка = &СсылкаНаОбъект
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ЛОЖЬ,
	|		ИСТИНА
	|	ИЗ
	|		&Услуги КАК ТЧ
	|	ГДЕ
	|		ТЧ.Ссылка = &СсылкаНаОбъект
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ЛОЖЬ,
	|		ИСТИНА
	|	ИЗ
	|		&АгентскиеУслуги КАК ТЧ
	|	ГДЕ
	|		ТЧ.Ссылка = &СсылкаНаОбъект) КАК ВложенныйЗапрос";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	ИменаТЧ = Новый Массив;
	ИменаТЧ.Добавить("Товары");
	ИменаТЧ.Добавить("Услуги");
	ИменаТЧ.Добавить("АгентскиеУслуги");
	
	ПолноеИмяДокумента = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		ПодстрокаПоиска = "&" + ИмяТЧ;
		ПодстрокаЗамены = ПолноеИмяДокумента + "." + ИмяТЧ;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЕстьУслуги И Не Выборка.ЕстьТовары;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделение(ЮрФизЛицо)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ЮрФизЛицо) Тогда 
		
		МетаданныеОбъекта = ЮрФизЛицо.Метаданные();
		
		Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "ОбособленноеПодразделение", Ложь) Тогда 
			Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ОбособленноеПодразделение");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеНаОтдельномБалансе(ЮрФизЛицо)
	
    Результат = Ложь;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		Результат = ЭтоОбособленноеПодразделение(ЮрФизЛицо);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыПродавца(Организация, Период, БанковскийСчет, ОбособленноеПодразделение)
	
	РеквизитыОрганизации = РеквизитыЮрФизЛица(Организация, Период, БанковскийСчет);
	
	Если ЗначениеЗаполнено(ОбособленноеПодразделение) 
		И РеквизитыОрганизации.ТипЮрФизЛица <> ТипыЮрФизЛиц().ИндивидуальныйПредприниматель Тогда
		
		РеквизитыПодразделения = РеквизитыЮрФизЛица(ОбособленноеПодразделение, Период);
		
		РеквизитыОрганизации.КПП = РеквизитыПодразделения.КПП;
		
		Если ЭтоОбособленноеПодразделениеНаОтдельномБалансе(ОбособленноеПодразделение) Тогда
			ЗаполнитьЗначенияСвойств(РеквизитыОрганизации, РеквизитыПодразделения,
				"Банк, БИК, АдресБанка, НомерСчета, КоррСчет");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РеквизитыОрганизации;
	
КонецФункции

Функция РеквизитыГрузоотправителя(Организация, Период, БанковскийСчет, ОбособленноеПодразделение)
	
	РеквизитыОрганизации = РеквизитыЮрФизЛица(Организация, Период, БанковскийСчет);
	
	Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда 
		
		РеквизитыПодразделения = РеквизитыЮрФизЛица(ОбособленноеПодразделение, Период);
		
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("Представление");
		КопируемыеРеквизиты.Добавить("СокращенноеНаименование");
		КопируемыеРеквизиты.Добавить("ПолноеНаименование");
		КопируемыеРеквизиты.Добавить("НаименованиеДляПечатныхФорм");
		КопируемыеРеквизиты.Добавить("КПП");
		КопируемыеРеквизиты.Добавить("КодПоОКПО");
		КопируемыеРеквизиты.Добавить("ФактическийАдрес");
		КопируемыеРеквизиты.Добавить("ЗначенияПолейФактическийАдрес");
		
		Для Каждого ИмяСвойства Из КопируемыеРеквизиты Цикл 
			РеквизитыОрганизации[ИмяСвойства] = РеквизитыПодразделения[ИмяСвойства]
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РеквизитыОрганизации;
	
КонецФункции

Функция _Контракт_РеквизитыЮрФизЛица()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипЮрФизЛица", "");
	//Результат.Вставить("Наименование", "");
	Результат.Вставить("НаименованиеПолное", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("КодПоОКПО", "");
	Результат.Вставить("Свидетельство", "");
	Результат.Вставить("ОГРН", "");
	Результат.Вставить("ДатаРегистрации", "");
	
	Результат.Вставить("СтранаРегистрации", Справочники.СтраныМира.Россия);
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации", "");
	
	Результат.Вставить("НомерСчета", "");
	Результат.Вставить("БИК", "");
	Результат.Вставить("Банк", "");
	Результат.Вставить("КоррСчет", "");
	
	Результат.Вставить("Телефоны", "");
	Результат.Вставить("Email", "");
	
	Результат.Вставить("ЮридическийАдрес", "");
	Результат.Вставить("ЗначенияПолейЮридическийАдрес", "");
	Результат.Вставить("ФактическийАдрес", "");
	Результат.Вставить("ЗначенияПолейФактическийАдрес", "");
	
	Возврат Результат;
	
КонецФункции

Функция _РеквизитыОбособленногоПодразделения(ПодразделениеОрганизации)
	
	ТребуемыеРеквизиты = Новый Структура;
	//ТребуемыеРеквизиты.Вставить("Представление" , "Наименование");
	ТребуемыеРеквизиты.Вставить("НаименованиеПолное" , "НаименованиеПолное");
	ТребуемыеРеквизиты.Вставить("ИНН", "ГоловнаяОрганизация.ИНН");
	ТребуемыеРеквизиты.Вставить("КПП");
	ТребуемыеРеквизиты.Вставить("КодПоОКПО");
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодразделениеОрганизации, ТребуемыеРеквизиты);
	АдресПодразделения = АдресЮрФизЛица(ПодразделениеОрганизации, Справочники.ВидыКонтактнойИнформации.ФактическийАдресПодразделенияОрганизаций);
	
	Модель = _Контракт_РеквизитыЮрФизЛица();
	Модель.ТипЮрФизЛица = "ЮридическоеЛицо"; // ТипыЮрФизЛиц().ЮридическоеЛицо
	Модель.НаименованиеПолное = Данные.НаименованиеПолное;
	Модель.ИНН = Данные.ИНН;
	Модель.КПП = Данные.КПП;
	Модель.КодПоОКПО = Данные.КодПоОКПО;
	Модель.ФактическийАдрес = АдресПодразделения.Представление;
	Модель.ЗначенияПолейФактическийАдрес = АдресПодразделения.ЗначенияПолей;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция _РеквизитыОрганизации(Организация, Период, БанковскийСчет)
	
	Если ИспользуетсяФункционалКрупнейшийНалогоплатильщик() Тогда
		
		ЭтоКрупнейшийНалогоплательщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "КрупнейшийНалогоплательщик");
		Данные = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Период, БанковскийСчет, , , ЭтоКрупнейшийНалогоплательщик);
		
	Иначе
		
		Данные = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Период, БанковскийСчет);
		
	КонецЕсли;
	
	ТипОрганизации = "ЮридическоеЛицо"; // ТипыЮрФизЛиц().ЮридическоеЛицо
	СвидетельствоОРегистрацииИП = "";
	ОГРН = "";
	ДатаРегистрации = "";
	
	Если Данные.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		ТипОрганизации = "ФизическоеЛицо"; // ТипыЮрФизЛиц().ФизическоеЛицо
		
		ЭтоСамозанятый = (
			ЕстьРеквизитИлиСвойствоОбъектаЛок(Организация, "СтатусФизическогоЛица")
			И Организация.СтатусФизическогоЛица = Перечисления.СтатусыФизическихЛиц.Самозанятый
		);
		
		Если НЕ ЭтоСамозанятый Тогда
			
			ТипОрганизации = "ИндивидуальныйПредприниматель"; // ТипыЮрФизЛиц().ИндивидуальныйПредприниматель
			
			СвидетельствоОРегистрацииИП = СокрЛП(Данные.Свидетельство);
			Если Не ЗначениеЗаполнено(СвидетельствоОРегистрацииИП) Тогда
				СвидетельствоОРегистрацииИП = Данные.СвидетельствоСерияНомер + " от " + Формат(Данные.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			ОГРН = Данные.ОГРН;
			ДатаРегистрации = Формат(Данные.ДатаРегистрации, "ДФ=dd.MM.yyyy");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Модель = _Контракт_РеквизитыЮрФизЛица();
	Модель.ТипЮрФизЛица = ТипОрганизации;
	Модель.НаименованиеПолное = СокрЛП(Данные.НаименованиеДляПечатныхФорм);
	Модель.ИНН = Данные.ИНН;
	Модель.КПП = Данные.КПП;
	Модель.КодПоОКПО = Данные.КодПоОКПО;
	Модель.Свидетельство = СвидетельствоОРегистрацииИП;
	Модель.ОГРН = ОГРН;
	Модель.ДатаРегистрации = ДатаРегистрации;
	
	Модель.НомерСчета = Данные.НомерСчета;
	Модель.БИК = Данные.БИК;
	Модель.Банк = СокрЛП(Данные.Банк);
	Модель.КоррСчет = Данные.КоррСчет;
	
	Модель.Телефоны = Данные.Телефоны;
	Модель.Email = Данные.Email;
	
	Модель.ЮридическийАдрес = Данные.ЮридическийАдрес;
	Модель.ЗначенияПолейЮридическийАдрес = Данные.ЗначенияПолейЮридическийАдрес;
	Модель.ФактическийАдрес = Данные.ФактическийАдрес;
	Модель.ЗначенияПолейФактическийАдрес = Данные.ЗначенияПолейФактическийАдрес;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция _РеквизитыКонтрагента(Контрагент, Период, БанковскийСчет)
	
	Данные = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Контрагент, Период, БанковскийСчет);
	
	Модель = _Контракт_РеквизитыЮрФизЛица();
	
	Модель.НаименованиеПолное = СокрЛП(Данные.НаименованиеДляПечатныхФорм);
	
	Модель.НомерСчета = Данные.НомерСчета;
	Модель.БИК = Данные.БИК;
	Модель.Банк = СокрЛП(Данные.Банк);
	Модель.КоррСчет = Данные.КоррСчет;
	
	Модель.Телефоны = Данные.Телефоны;
	Модель.Email = Данные.Email;
	
	Модель.ЮридическийАдрес = Данные.ЮридическийАдрес;
	Модель.ЗначенияПолейЮридическийАдрес = Данные.ЗначенияПолейЮридическийАдрес;
	Модель.ФактическийАдрес = Данные.ФактическийАдрес;
	Модель.ЗначенияПолейФактическийАдрес = Данные.ЗначенияПолейФактическийАдрес;
	
	Модель.СтранаРегистрации = Справочники.СтраныМира.Россия;
	Если ЗначениеЗаполнено(Данные.СтранаРегистрации) Тогда
		Модель.СтранаРегистрации = Данные.СтранаРегистрации;
	КонецЕсли;
	
	Если Модель.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		
		Модель.ИНН = СокрЛП(Данные.ИНН);
		
		Если Данные.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
			
			Модель.ТипЮрФизЛица = "ЮридическоеЛицо"; // ТипыЮрФизЛиц().ЮридическоеЛицо
			Модель.КПП = СокрЛП(Данные.КПП);
			Модель.КодПоОКПО = СокрЛП(Данные.КодПоОКПО);
			
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ИндивидуальныйПредприниматель") Тогда
			
			Модель.ТипЮрФизЛица = "ИндивидуальныйПредприниматель"; // ТипыЮрФизЛиц().ИндивидуальныйПредприниматель
			Модель.Свидетельство = СокрЛП(Данные.Свидетельство);
			
			Если Не ЗначениеЗаполнено(Модель.Свидетельство) Тогда
				Модель.Свидетельство = Данные.СвидетельствоСерияНомер + " от " + Формат(Данные.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
		Иначе
			Модель.ТипЮрФизЛица = "ФизическоеЛицо"; // ТипыЮрФизЛиц().ФизическоеЛицо
		КонецЕсли;
		
	Иначе
		Модель.ТипЮрФизЛица = "ИностраннаяКомпания"; // ТипыЮрФизЛиц().ИностраннаяКомпания
		Модель.НалоговыйНомерВСтранеРегистрации = СокрЛП(Данные.НалоговыйНомерВСтранеРегистрации);
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьИнформациюОбОрганизации(СведенияОбОрганизации, РеквизитыОрганизации)
	
	#Область ОбщиеСвойства
	СведенияОбОрганизации.Name	 = РеквизитыОрганизации.НаименованиеДляПечатныхФорм;
	СведенияОбОрганизации.Inn	 = РеквизитыОрганизации.ИНН;
	СведенияОбОрганизации.Kpp	 = РеквизитыОрганизации.КПП;
	СведенияОбОрганизации.Okpo	 = РеквизитыОрганизации.КодПоОкпо;
	СведенияОбОрганизации.Phone	 = ПолучитьТелефон(РеквизитыОрганизации.Телефоны);
	
	СведенияОбОрганизации.BankAccountNumber		 = СокрЛП(РеквизитыОрганизации.НомерСчета);
	СведенияОбОрганизации.BankId				 = СокрЛП(РеквизитыОрганизации.БИК);
	СведенияОбОрганизации.BankName				 = ?(ЗначениеЗаполнено(РеквизитыОрганизации.Банк), Строка(РеквизитыОрганизации.Банк), ""); // в некоторых случаях Банк возвращается как ссылка на справочник и компонента игнорирует такое значение, теряя данные, поэтому значение Банк преобразовано к строке 
	#КонецОбласти
	
	ТипОрганизации = ЮрФизЛицо_ТипОрганизацииДляКонтента(РеквизитыОрганизации);
	
	#Область Свойства_ExtendedOrganizationInfo
	Если СведенияОбОрганизации.Свойство("CorrespondentAccount") Тогда 
		СведенияОбОрганизации.CorrespondentAccount = РеквизитыОрганизации.КоррСчет;
	КонецЕсли;
	
	Если СведенияОбОрганизации.Свойство("Email") Тогда
		СведенияОбОрганизации.Email = РеквизитыОрганизации.Email;
	КонецЕсли;
	
	Если СведенияОбОрганизации.Свойство("Type") Тогда 
		СведенияОбОрганизации.Type = ТипОрганизации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОрганизации.Свидетельство)
		И СведенияОбОрганизации.Свойство("IndividualEntityRegistrationCertificate") Тогда
		СведенияОбОрганизации.IndividualEntityRegistrationCertificate = РеквизитыОрганизации.Свидетельство;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОрганизации.НалоговыйНомерВСтранеРегистрации)
		И СведенияОбОрганизации.Свойство("LegalEntityId") Тогда
		СведенияОбОрганизации.LegalEntityId = РеквизитыОрганизации.НалоговыйНомерВСтранеРегистрации;
	КонецЕсли;
	#КонецОбласти
	
	#Область Свойства_OrganizationInfo
	Если СведенияОбОрганизации.Свойство("IsSoleProprietor") Тогда 
		СведенияОбОрганизации.IsSoleProprietor = (ТипОрганизации = "IndividualEntity");
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

// Получает документ отгрузки.
// Если переданное значение имеет тип "ДокументСсылка.РеализацияОтгруженныхТоваров",
// то возвращается значение реквизита "ДокументОтгрузки" переданного значения,
// в противном случае возвращается само переданное значение.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.РеализацияОтгруженныхТоваров, ДокументСсылка.* - Документ, значение которого требуется обработать.
// 
// Возвращаемое значение:
//  ДокументСсылка - документ отгрузки.
//
Функция ДокументОтгрузки(ДокументСсылка)
	
	Результат = Неопределено;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
		Результат = ДокументСсылка.ДокументОтгрузки;
	Иначе
		Результат = ДокументСсылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыКорректировкиРеализации(СсылкаНаОбъект, ЭтоИсправление)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Номер");
	Реквизиты.Вставить("Дата");
	Реквизиты.Вставить("НомерИсходногоДокумента");
	Реквизиты.Вставить("ДатаИсходногоДокумента");
	Реквизиты.Вставить("НомерИсправленияИсходногоДокумента");
	Реквизиты.Вставить("ДатаИсправленияИсходногоДокумента");
	
	Если ЭтоИсправление Тогда
		
		// Переопределим номер документа
		Реквизиты.Номер	 = "НомерИсправляемогоКорректировочногоДокумента";
		Реквизиты.Дата	 = "ДатаИсправляемогоКорректировочногоДокумента";
		
		// И добавим получение номера и даты исправления
		Реквизиты.Вставить("НомерИсправления");
		Реквизиты.Вставить("ДатаИсправления", "Дата");
		
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыКорректировочногоСчетаФактуры(СсылкаНаОбъект, ЭтоИсправление)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ПолеНомерДокумента КАК Номер,
	|	&ПолеПроизвольныйНомер КАК ПроизвольныйНомер,
	|	&ПолеИспользоватьПроизвольныйНомер КАК ИспользоватьПроизвольныйНомер,
	|	&ПолеДатаДокумента КАК Дата,
	|	&ПолеНомерИсправления КАК НомерИсправления,
	|	&ПолеДатаИсправления КАК ДатаИсправления,
	|	Таблица.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
	|	Таблица.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	Таблица.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	Таблица.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
	|	Таблица.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
	|	Таблица.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ПолеНомерДокумента = "Таблица.Ссылка.Номер";
	ПолеДатаДокумента = "Таблица.Ссылка.Дата";
	ПолеНомерИсправления = "НЕОПРЕДЕЛЕНО";
	ПолеДатаИсправления	 = "НЕОПРЕДЕЛЕНО";
	ПолеПроизвольныйНомер = """""";
	ПолеИспользоватьПроизвольныйНомер = "ЛОЖЬ";
	
	Если ЭтоИсправление Тогда
		
		ПолеНомерДокумента	 = "Таблица.Ссылка.НомерИсправляемогоКорректировочногоДокумента";
		ПолеДатаДокумента	 = "Таблица.Ссылка.ДатаИсправляемогоКорректировочногоДокумента";
		ПолеНомерИсправления = "Таблица.Ссылка.НомерИсправления";
		ПолеДатаИсправления	 = "Таблица.Ссылка.Дата";
		
	КонецЕсли;
	
	Если ИспользуетсяПроизвольныйНомерСчетаФактурыВыданного() Тогда
		
		ПолеПроизвольныйНомер = "Таблица.Ссылка.НомерВходящегоДокумента";
		ПолеИспользоватьПроизвольныйНомер = "Таблица.Ссылка.ОтредактированНомерСчетаФактуры";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерДокумента"	, ПолеНомерДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДатаДокумента" 	, ПолеДатаДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерИсправления", ПолеНомерИсправления);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДатаИсправления"	, ПолеДатаИсправления);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПроизвольныйНомер", ПолеПроизвольныйНомер);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеИспользоватьПроизвольныйНомер", ПолеИспользоватьПроизвольныйНомер);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазделительПакетаЗапросов()
	
	Возврат
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

Функция РазделительОбъединенияЗапросов()
	
	Результат = "
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Возврат Результат;
	
КонецФункции

#Область ПараметрыИНастройкиИнформационнойБазы

Функция МенеджерИнтеграции_ОписанияПодсистемКонфигурации()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОписанияПодсистемКонфигурации");
	Возврат Результат;
	
КонецФункции

Функция ДоступнаФункциональностьВерсииКОРП()
	
	ИмяПодсистемы = "БухгалтерияПредприятияКОРП";
	
	ПодсистемыКонфигурации = МенеджерИнтеграции_ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
	
	Результат = (ОписаниеПодсистемы <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияБухгалтерскойПодсистемы()
	
	Конфигурация = СведенияОКонфигурации();
	Возврат Конфигурация.ВерсияБазовойПодсистемы;
	
КонецФункции

Функция ИспользуетсяАктСверкиВзаиморасчетов3_0_131()
	
	Результат = Ложь;
	
	ВерсияПодсистемыБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии(ВерсияПодсистемыБП, "3.0.131") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяФункционалКрупнейшийНалогоплатильщик()
	
	Результат = Ложь;
	
	ВерсияПодсистемыБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии(ВерсияПодсистемыБП, "3.0.138") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ЭтоУправлениеАрендой()
	
	ИмяПодсистемы = "Аренда";
	
	ПодсистемыКонфигурации = МенеджерИнтеграции_ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
	
	Результат = (ОписаниеПодсистемы <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяОбратноеНачислениеНДС()
	
	Результат = Ложь;
	
	ВерсияПодсистемыБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии(ВерсияПодсистемыБП, "3.0.64") >= 0 Тогда
		
		// начиная с версии 3.0.64 можно использовать проверку по функциональным опциям
		Результат = БухгалтерскийУчетПереопределяемый.ИспользуетсяОбратноеНачислениеНДС();
		
	ИначеЕсли СравнитьВерсии(ВерсияПодсистемыБП, "3.0.60") >= 0 
		И ДоступнаФункциональностьВерсииКОРП() Тогда 
		// обратное налогообложение было реализовано в релизе 3.0.60 версии КОРП
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяКорректировкаСчетаФактурыНаАванс()
	
	Результат = Ложь;
	
	ВерсияПодсистемыБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии(ВерсияПодсистемыБП, "3.0.67") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВедетсяУчетЛизинговогоИмущества()
	
	Результат = ПолучитьФункциональнуюОпцию("ВедетсяУчетЛизинговогоИмущества");
	
	Возврат Результат;
	
КонецФункции

Функция ВедетсяУчетНМА()
	
	Результат = ПолучитьФункциональнуюОпцию("ВедетсяУчетНМА");
	
	Возврат Результат;
	
КонецФункции

Функция ВедетсяУчетОсновныхСредств()
	
	Результат = ПолучитьФункциональнуюОпцию("ВедетсяУчетОсновныхСредств");
	
	Возврат Результат;
	
КонецФункции

Функция ВедетсяУчетДенежныхДокументов()
	
	Результат = ПолучитьФункциональнуюОпцию("ВедетсяУчетДенежныхДокументов");
	
	Возврат Результат;
	
КонецФункции

Функция ИспользоватьФакторинг()
	
	Результат = ПолучитьФункциональнуюОпцию("ИспользоватьФакторинг");
	
	Возврат Результат;
	
КонецФункции

Функция ИспользоватьОперацииСБилетами()
	
	Результат = Ложь;
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии(ВерсияБП, "3.0.81") >= 0 Тогда
		Результат = ПолучитьФункциональнуюОпцию("ИспользоватьДокументыПоступления");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяНоменклатураКонтрагентовБЭД()
	
	Результат = Ложь;
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	
	Если СравнитьВерсии(ВерсияБП, "3.0.69") >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьШтрихкодыУпаковок(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ЕстьДокументПоступлениеВАренду()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (СравнитьВерсии(ВерсияБП, "3.0.93") >= 0);
	
	Возврат Результат;
	
КонецФункции

Функция ИмяДокументаПоступлениеВАрендуЛизинг()
	
	Результат = "ПоступлениеВЛизинг";
	Если ЕстьДокументПоступлениеВАренду() Тогда
		Результат = "ПоступлениеВАренду";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьМетаданныеСведенияПрослеживаемости(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("СведенияПрослеживаемости") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция СпособыОценкиБУ_РавнаСуммеДоговора()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	
	ИмяПеречисления = "СпособыОценкиАрендыБУ";
	Если СравнитьВерсии(ВерсияБП, "3.0.99") >= 0 Тогда
		ИмяПеречисления = "СпособыОценкиБУ";
	КонецЕсли;
	
	ЗначенияПеречисления = Перечисления[ИмяПеречисления];
	Результат = ЗначенияПеречисления.РавнаСуммеДоговора;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьКорректируемыеНомераСтрокВСчетФактураВыданный()

	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (СравнитьВерсии(ВерсияБП, "3.0.107") >= 0);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяПередачаПрослеживаемыхМатериаловВСоставеРабот()

	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (СравнитьВерсии(ВерсияБП, "3.0.142") >= 0);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяУстановкаСтатусаСверки()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (СравнитьВерсии(ВерсияБП, "3.0.144") >= 0);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяПроизвольныйНомерСчетаФактурыВыданного()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (СравнитьВерсии(ВерсияБП, "3.0.146") >= 0);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

#Область ПравилаОбработкиДокументов

// Список возможных идентификаторов правил обработки входящих документов.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ИдентификаторыПравилОбработкиДокументов()
	
	ЗначенияПеречисления = Новый Массив;
	ЗначенияПеречисления.Добавить("ПоступлениеТоваровУслуг");
	ЗначенияПеречисления.Добавить("ПоступлениеТоваровУслуг_Оборудование");
	ЗначенияПеречисления.Добавить("ПоступлениеТоваровУслуг_ОсновныеСредства");
	ЗначенияПеречисления.Добавить("ПоступлениеТоваровУслуг_ОбъектыСтроительства");
	ЗначенияПеречисления.Добавить("ПоступлениеТоваровУслуг_УслугиЛизинга");
	ЗначенияПеречисления.Добавить("ПоступлениеТоваровУслуг_УслугиФакторинга");
	ЗначенияПеречисления.Добавить("ПоступлениеДенежныхДокументов");
	ЗначенияПеречисления.Добавить("ПоступлениеДопРасходов");
	ЗначенияПеречисления.Добавить("ПоступлениеВЛизинг");
	ЗначенияПеречисления.Добавить("ПоступлениеНМА");
	ЗначенияПеречисления.Добавить("ОперацияСБилетом_Покупка");
	ЗначенияПеречисления.Добавить("ВозвратТоваровОтПокупателя");
	ЗначенияПеречисления.Добавить("КорректировкаПоступления");
	ЗначенияПеречисления.Добавить("СчетФактураПолученный");
	ЗначенияПеречисления.Добавить("АктОРасхожденияхПолученный");
	ЗначенияПеречисления.Добавить("АктСверкиВзаиморасчетов");
	ЗначенияПеречисления.Добавить("СчетНаОплату");
	
	Результат = Новый Структура;
	
	Для Каждого Элемент Из ЗначенияПеречисления Цикл
		
		Результат.Вставить(Элемент, Элемент);
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Дополняет таблицу правил обработки товарных накладных.
//
Процедура ЗаполнитьПравилаОбработкиНакладных(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхДокументов = Ложь;
	ДляИсправительныхДокументов = Истина;
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	ВидДокумента = ВидыЭД.ТоварнаяНакладная;
	
	// Товары, услуги, комиссия
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеТоваровУслуг
		, ВидДокумента
		, ДляПервичныхИИсправительныхДокументов);
	
	Если ВедетсяУчетОсновныхСредств() Тогда
		
		// Оборудование
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеТоваровУслуг_Оборудование
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
		
		// Основные средства
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеТоваровУслуг_ОсновныеСредства
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
		
		// Объекты строительства
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеТоваровУслуг_ОбъектыСтроительства
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
		
	КонецЕсли;
	
	// Предметы лизинга
	Если ВедетсяУчетЛизинговогоИмущества() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеВЛизинг
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
		
	КонецЕсли;
	
	// Нематериальные активы
	Если ВедетсяУчетНМА() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеНМА
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
		
	КонецЕсли;
	
	// Денежные документы
	Если ВедетсяУчетДенежныхДокументов() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеДенежныхДокументов
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
	
	КонецЕсли;
	
	// Операции с билетами
	Если ИспользоватьОперацииСБилетами() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ОперацияСБилетом_Покупка
			, ВидДокумента
			, ДляПервичныхДокументов);
		
	КонецЕсли;
	
	// Возврат товаров от покупателя
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ВозвратТоваровОтПокупателя
		, ВидДокумента
		, ДляПервичныхДокументов);
	
	// Исправление накладной
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступления
		, ВидДокумента
		, ДляИсправительныхДокументов);
	
	// Корректировка накладной, акта
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступления
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, ДляПервичныхИИсправительныхДокументов);
	
КонецПроцедуры

// Дополняет таблицу правил обработки актов об оказании услуг.
//
Процедура ЗаполнитьПравилаОбработкиАктов(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхДокументов = Ложь;
	ДляИсправительныхДокументов = Истина;
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	ВидДокумента = ВидыЭД.АктОбОказанииУслуг;
	
	// Товары, услуги, комиссия
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеТоваровУслуг
		, ВидДокумента
		, ДляПервичныхИИсправительныхДокументов);
	
	// Доп. расходы
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеДопРасходов
		, ВидДокумента
		, ДляПервичныхИИсправительныхДокументов);
	
	// Услуги лизинга
	Если ВедетсяУчетЛизинговогоИмущества() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеТоваровУслуг_УслугиЛизинга
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
		
	КонецЕсли;
	
	// Услуги факторинга
	Если ИспользоватьФакторинг() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеТоваровУслуг_УслугиФакторинга
			, ВидДокумента
			, ДляПервичныхДокументов);
		
	КонецЕсли;
	
	// Денежные документы
	Если ВедетсяУчетДенежныхДокументов() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ПоступлениеДенежныхДокументов
			, ВидДокумента
			, ДляПервичныхИИсправительныхДокументов);
	
	КонецЕсли;
	
	// Операции с билетами
	Если ИспользоватьОперацииСБилетами() Тогда
		
		ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
			, ИдентификаторыПравил.ОперацияСБилетом_Покупка
			, ВидДокумента
			, ДляПервичныхДокументов);
		
	КонецЕсли;
	
	// Исправление акта
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступления
		, ВидДокумента
		, ДляИсправительныхДокументов);
	
КонецПроцедуры

// Дополняет таблицу правил обработки счетов-фактур и корректировочных счетов-фактур.
//
Процедура ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, ДляПервичныхИИсправительныхДокументов);
	
	// Корректировочный счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.КорректировочныйСчетФактура
		, ДляПервичныхИИсправительныхДокументов);
	
КонецПроцедуры

// Дополняет таблицу правил обработки актов о расхождениях.
//
Процедура ЗаполнитьПравилаОбработкиДокументовОРасхождении(ПравилаОбработки)

	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Акт о расхождениях
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.АктОРасхожденияхПолученный
		, ВидыЭД.ДокументОРасхождениях
		, ДляПервичныхИИсправительныхДокументов);

КонецПроцедуры

// Дополняет таблицу правил обработки актов сверки.
//
Процедура ЗаполнитьПравилаОбработкиАктовСверки(ПравилаОбработки)

	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Акт сверки
	ДобавитьПравилоОбработкиДокументов(
		ПравилаОбработки,
		ИдентификаторыПравил.АктСверкиВзаиморасчетов,
		ВидыЭД.АктСверки,
		ДляПервичныхИИсправительныхДокументов
	);
	
КонецПроцедуры

// Дополняет таблицу правил обработки счетов на оплату.
//
Процедура ЗаполнитьПравилаОбработкиСчетовНаОплату(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// СчетНаОплату
	ДобавитьПравилоОбработкиДокументов(
		ПравилаОбработки,
		ИдентификаторыПравил.СчетНаОплату,
		ВидыЭД.СчетНаОплату,
		ДляПервичныхИИсправительныхДокументов
	);
	
КонецПроцедуры

#КонецОбласти

#Область ПоступлениеТоваровУслуг

Функция ВидОперацииПоступленияТоваровУслугПоУмолчанию()
	
	МетаданныеРеквизита = Метаданные.Документы.ПоступлениеТоваровУслуг.Реквизиты.ВидОперации;
	
	Результат = МетаданныеРеквизита.ЗначениеЗаполнения;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления товаров и услуг.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийПоступлениеТоваровУслуг - вид операции поступления.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияПоступленияТоваровУслуг()
	
	Результат = Новый Структура;
	Результат.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	Результат.Вставить("ПередачаТовараКомитентом", Ложь);
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("Корректировка", Ложь);
	Результат.Вставить("ВидОперации", ВидОперацииПоступленияТоваровУслугПоУмолчанию());
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьВидОперацииПоступлениеТоваровУслуг(ДокументОбъект, ДанныеДокумента, ПередачаТовараКомитентом)
	
	Если ПередачаТовараКомитентом Или ДанныеДокумента.ВозвратнаяТара.Количество() > 0 Тогда
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
	Иначе
		Если ДанныеДокумента.Товары.Количество() = 0 Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги;
		ИначеЕсли ДанныеДокумента.Услуги.Количество() = 0 Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары;
		Иначе
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураЗаполненияПоступленияТоваровУслуг(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияПоступленияТоваровУслуг();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ПустаяСсылкаНаДокумент = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	ВидОперации = ПараметрыЗаполнения.ВидОперации;
	
	Товары				 = ПустаяСсылкаНаДокумент.Товары.ВыгрузитьКолонки();
	Услуги				 = ПустаяСсылкаНаДокумент.Услуги.ВыгрузитьКолонки();
	Оборудование		 = ПустаяСсылкаНаДокумент.Оборудование.ВыгрузитьКолонки();
	ВозвратнаяТара		 = ПустаяСсылкаНаДокумент.ВозвратнаяТара.ВыгрузитьКолонки();
	ОсновныеСредства	 = ПустаяСсылкаНаДокумент.ОсновныеСредства.ВыгрузитьКолонки();
	ОбъектыСтроительства = ПустаяСсылкаНаДокумент.ОбъектыСтроительства.ВыгрузитьКолонки();
	СведенияПрослеживаемости = НоваяТаблицаСведенияПрослеживаемостиДокументаИБ(ПустаяСсылкаНаДокумент);
	
	// Маркировка
	ШтрихкодыУпаковок = НоваяТаблицаШтрихкодыУпаковок();
	
	ШапкаЭД = ДанныеЭД.Шапка;
	
	Шапка = Новый Структура;
	
	Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента", ПараметрыЗаполнения.УчитыватьИсправлениеИсходногоДокумента);
	Шапка.Вставить("ПередачаТовараКомитентом", ПараметрыЗаполнения.ПередачаТовараКомитентом);
	Шапка.Вставить("СуммаВключаетНДС", ПараметрыЗаполнения.ЦенаВключаетНДС);
	Шапка.Вставить("Корректировка", ПараметрыЗаполнения.Корректировка);
	Шапка.Вставить("ВидОперации", ВидОперации);
	
	Шапка.Вставить("Организация"		, СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"			, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("Грузоотправитель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузоотправитель));
	Шапка.Вставить("Грузополучатель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузополучатель));
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов", ШапкаЭД.Кратность);
	
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	Шапка.Вставить("НомерИсходногоДокумента", СвойствоСтруктуры(ШапкаЭД, "НомерИсходногоДокумента"));
	Шапка.Вставить("ДатаИсходногоДокумента"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсходногоДокумента"));
	
	Если ЗначениеЗаполнено(СвойствоСтруктуры(ШапкаЭД, "НомерИсправления")) Тогда
		Шапка.Вставить("Исправление"		, Истина);
		Шапка.Вставить("НомерИсправления"	, СвойствоСтруктуры(ШапкаЭД, "НомерИсправления"));
		Шапка.Вставить("ДатаИсправления"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсправления"));
	Иначе
		Шапка.Вставить("Исправление", Ложь);
	КонецЕсли;
	
	НДСИсчисляетсяНалоговымАгентом = Ложь;
	ИспользуетсяОбратноеНачислениеНДС = ИспользуетсяОбратноеНачислениеНДС();
	
	ВидыОперацийПТУ = Перечисления.ВидыОперацийПоступлениеТоваровУслуг;
	
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоменклатураИБ = Стр.Номенклатура;
		НоменклатураКонтрагента = Стр.НоменклатураКонтрагента;
		
		ЭтоУслуга = ЭтоНоменклатураУслуга(НоменклатураИБ.Номенклатура);
					
		Если ЭтоУслуга Тогда
			НоваяСтрока = Услуги.Добавить();
		ИначеЕсли ВидОперации = ВидыОперацийПТУ.ОбъектыСтроительства Тогда
			НоваяСтрока = ОбъектыСтроительства.Добавить();
		ИначеЕсли ВидОперации = ВидыОперацийПТУ.ОсновныеСредства Тогда
			НоваяСтрока = ОсновныеСредства.Добавить();
		ИначеЕсли ВидОперации = ВидыОперацийПТУ.Оборудование Тогда
			НоваяСтрока = Оборудование.Добавить();
		ИначеЕсли Не ЗначениеЗаполнено(НоменклатураИБ.Номенклатура) Тогда
			НоваяСтрока = Услуги.Добавить();
		Иначе
			НоваяСтрока = Товары.Добавить();
		КонецЕсли;
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "Номенклатура") Тогда
			НоваяСтрока.Номенклатура = НоменклатураИБ.Номенклатура;
		КонецЕсли;
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "Содержание") Тогда
			НоваяСтрока.Содержание = НоменклатураКонтрагента.Наименование;
		КонецЕсли;
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "ЕдиницаИзмерения") Тогда
			
			НоваяСтрока.ЕдиницаИзмерения = НоменклатураИБ.Упаковка;
			
			Если ЗначениеЗаполнено(НоменклатураИБ.Номенклатура)
				И Не ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
				РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураИБ.Номенклатура, "ЕдиницаИзмерения");
				НоваяСтрока.ЕдиницаИзмерения = РеквизитыНоменклатуры.ЕдиницаИзмерения;
			КонецЕсли;
			
			НоваяСтрока.Коэффициент = 0;
			Если ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
				НоваяСтрока.Коэффициент = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьЦенуСуммуПоСтроке(НоваяСтрока, Стр, ПараметрыЗаполнения.ЦенаВключаетНДС);
		
		ПредставлениеСтавки = НоменклатураКонтрагента.СтавкаНДС;
		Если МенеджерИнтеграции_ЭтоСтавкаНДСИНА(ПредставлениеСтавки) Тогда
			
			НДСИсчисляетсяНалоговымАгентом = Истина;
			
			Если ИспользуетсяОбратноеНачислениеНДС Тогда
				
				НоваяСтрока.СтавкаНДС	 = МенеджерИнтеграции_ОбщаяСтавкаНДС(ШапкаЭД.Дата);
				НоваяСтрока.СуммаНДС	 = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
					Стр.СуммаБезНДС,
					Ложь,
					УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
			Иначе 
				
				НоваяСтрока.СтавкаНДС	 = Неопределено;
				НоваяСтрока.СуммаНДС	 = Стр.СуммаНДС;
				
			КонецЕсли;
			
		Иначе 
			
			НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
			НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
			
		КонецЕсли;
		
		ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, Стр.СведенияОМаркировке, НоменклатураКонтрагента.GTIN);
		
		ЕстьСведенияПрослеживаемости_ЭД		= ВТабличнойЧастиЭДЕстьСведенияПрослеживаемости(Стр);
		ЕстьРеквизит_ПрослеживаемыйТовар_1С	= ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "ПрослеживаемыйТовар");
		
		ЗаполнитьКакПрослеживаемыйТовар = ИспользуетсяУчетПрослеживаемыхТоваров
											И ЕстьСведенияПрослеживаемости_ЭД
											И ЕстьРеквизит_ПрослеживаемыйТовар_1С;
		
		Если ЗаполнитьКакПрослеживаемыйТовар Тогда 
					
			ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УПД(СведенияПрослеживаемости, Стр.СведенияОПрослеживаемости, НоваяСтрока);
			ЗаполнятьСтрануПроисхождения = ЗначениеЗаполнено(Стр.ДанныеГТД)
											И Стр.ДанныеГТД.Количество() = 1 
											И ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "СтранаПроисхождения");
		Иначе
			Если ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "НомерГТД") Тогда
				НоваяСтрока.НомерГТД = НомерГТДИзСведенийТаможеннойДекларации(Стр.ДанныеГТД);
			КонецЕсли;
			ЗаполнятьСтрануПроисхождения = ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "СтранаПроисхождения");
		КонецЕсли;
		
		Если ЗаполнятьСтрануПроисхождения Тогда
			НоваяСтрока.СтранаПроисхождения = СтранаПроисхожденияИзСведенийТаможеннойДекларации(Стр.ДанныеГТД);
		КонецЕсли;
								
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	ДанныеОбъекта.Вставить("Товары"	, Товары);
	ДанныеОбъекта.Вставить("Услуги"	, Услуги);
	ДанныеОбъекта.Вставить("Оборудование", Оборудование);
	ДанныеОбъекта.Вставить("ВозвратнаяТара", ВозвратнаяТара);
	ДанныеОбъекта.Вставить("ОсновныеСредства", ОсновныеСредства);
	ДанныеОбъекта.Вставить("ОбъектыСтроительства", ОбъектыСтроительства);
	ДанныеОбъекта.Вставить("НДСИсчисляетсяНалоговымАгентом", НДСИсчисляетсяНалоговымАгентом);
	ДанныеОбъекта.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	ДанныеОбъекта.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьПоступлениеТоваровУслуг(ДокументОбъект, ДанныеДокумента)
	
	ДанныеШапки = ДанныеДокумента.Шапка;
	
	ПередачаТовараКомитентом = ДанныеШапки.ПередачаТовараКомитентом;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеШапки);
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ДокументОбъект.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	Если ПередачаТовараКомитентом Тогда
		
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		
	ИначеЕсли ДанныеДокумента.Свойство("НДСИсчисляетсяНалоговымАгентом")
		И ДанныеДокумента.НДСИсчисляетсяНалоговымАгентом Тогда
		
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		СтруктураПараметров.Вставить("УчетАгентскогоНДС", Новый Структура("ЗначениеОтбора", Истина));
		СтруктураПараметров.Вставить("ВидАгентскогоДоговора",
			Новый Структура("ЗначениеОтбора", Перечисления.ВидыАгентскихДоговоров.РеализацияТоваров));
		
	Иначе
		
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СФакторинговойКомпанией);
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
		
	КонецЕсли;
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеШапки);
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВидОперации) Тогда
		ЗаполнитьВидОперацииПоступлениеТоваровУслуг(ДокументОбъект, ДанныеДокумента, ПередачаТовараКомитентом);
	КонецЕсли;
			
	ТипСклада   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Склад, "ТипСклада");
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.ДоговорКонтрагента, "ВидДоговора");
	УчетВПродажныхЦенах = УчетнаяПолитика.СпособОценкиТоваровВРознице(ДокументОбъект.Организация, ДокументОбъект.Дата) = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости;
	РассчитыватьСуммаВРознице = ТипСклада <> Перечисления.ТипыСкладов.ОптовыйСклад
								И УчетВПродажныхЦенах
								И (ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия
									ИЛИ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары)
								И ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;

	НТТ = ТипСклада = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка;
	СвойстваСчета4112 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(
		ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
	РазделениеПоСтавкамВРознице = СвойстваСчета4112.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС
		ИЛИ СвойстваСчета4112.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС
		ИЛИ СвойстваСчета4112.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС;
	
	ЗаполнятьСтавкуНДСВРознице = НТТ И УчетВПродажныхЦенах И РазделениеПоСтавкамВРознице;
	
	ПлательщикНДС	 = УчетнаяПолитика.ПлательщикНДС(ДокументОбъект.Организация, ДокументОбъект.Дата);
	ЭтоКомиссия		 = ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;
	ОтражениеВУСН	 = ПоступлениеТоваровУслугФормыКлиентСервер.ОтражениеВУСН(ДокументОбъект.ВидОперации, ЭтоКомиссия);
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаНакладной Из ДанныеДокумента.Товары Цикл
		
		СтрокаТЧ = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаНакладной);
		
		Если РассчитыватьСуммаВРознице Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьЦенуВРозницеТабЧасти(СтрокаТЧ, ДокументОбъект, ДокументОбъект.Метаданные());
			ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВРозницеТабЧасти(СтрокаТЧ);
		КонецЕсли;
		
		Если ЗаполнятьСтавкуНДСВРознице Тогда
			СтрокаТЧ.СтавкаНДСВРознице = ?(ПлательщикНДС, СтрокаТЧ.СтавкаНДС, МенеджерИнтеграции_СтавкаБезНДС());
		КонецЕсли;
		
		СтрокаТЧ.ОтражениеВУСН = ОтражениеВУСН;
		
		Если ДокументОбъект.НДСНеВыделять И ЗначениеЗаполнено(СтрокаТЧ.СуммаНДС) Тогда
			ДокументОбъект.НДСНеВыделять = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.Услуги.Очистить();
	Для Каждого СтрокаНакладной Из ДанныеДокумента.Услуги Цикл
		
		СтрокаТЧ = ДокументОбъект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаНакладной);
		
		СтрокаТЧ.ОтражениеВУСН = ОтражениеВУСН;
		
		Если ДокументОбъект.НДСНеВыделять И ЗначениеЗаполнено(СтрокаТЧ.СуммаНДС) Тогда
			ДокументОбъект.НДСНеВыделять = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.ВозвратнаяТара.Очистить();
	Для Каждого СтрокаНакладной Из ДанныеДокумента.ВозвратнаяТара Цикл
		
		СтрокаТЧ = ДокументОбъект.ВозвратнаяТара.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаНакладной);
		
	КонецЦикла;
	
	ДокументОбъект.Оборудование.Очистить();
	Для Каждого СтрокаНакладной Из ДанныеДокумента.Оборудование Цикл
		
		СтрокаТЧ = ДокументОбъект.Оборудование.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаНакладной);
		
	КонецЦикла;
	
	ДокументОбъект.ОсновныеСредства.Очистить();
	Для Каждого СтрокаНакладной Из ДанныеДокумента.ОсновныеСредства Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаНакладной.ОсновноеСредство) Тогда
			// В типовом обработчике документа "ПередЗаписью" выполняется обновление
			// амортизационной группы ОС, что приводит к ошибке "Элемент не выбран", 
			// если основное средство не заполнено.
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.ОсновныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаНакладной);
		
	КонецЦикла;
	
	ДокументОбъект.ОбъектыСтроительства.Очистить();
	Для Каждого СтрокаНакладной Из ДанныеДокумента.ОбъектыСтроительства Цикл
		
		СтрокаТЧ = ДокументОбъект.ОбъектыСтроительства.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаНакладной);
		
	КонецЦикла;
	
	Если ДанныеДокумента.Свойство("ШтрихкодыУпаковок")
		И ЕстьШтрихкодыУпаковок(ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДокумента.ШтрихкодыУпаковок);
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("СведенияПрослеживаемости")
		И ДанныеДокумента.СведенияПрослеживаемости <> Неопределено 
		И ЕстьМетаданныеСведенияПрослеживаемости(ДокументОбъект.Метаданные()) Тогда
		
		ДокументОбъект.СведенияПрослеживаемости.Очистить();
		ДокументОбъект.СведенияПрослеживаемости.Загрузить(ДанныеДокумента.СведенияПрослеживаемости);
		
	КонецЕсли;
	
	ЗаполнитьСчетаУчетаПередЗаписьюДокумента(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратТоваровОтПокупателя

Функция ВидОперацииВозвратаТоваровОтПокупателя()
	
	МетаданныеРеквизита = Метаданные.Документы.ВозвратТоваровОтПокупателя.Реквизиты.ВидОперации;
	
	Результат = МетаданныеРеквизита.ЗначениеЗаполнения;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Товары;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения возврата товаров от покупателя.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийВозвратТоваровОтПокупателя - вид операции возврата.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияВозвратаТоваровОтПокупателя()
	
	Результат = Новый Структура;
	Результат.Вставить("ВидОперации", ВидОперацииВозвратаТоваровОтПокупателя());
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ПокупателемВыставляетсяСчетФактураНаВозврат", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияВозвратаТоваровОтПокупателя(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияВозвратаТоваровОтПокупателя();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ПустаяСсылкаНаДокумент = Документы.ВозвратТоваровОтПокупателя.ПустаяСсылка();
	
	Товары = ПустаяСсылкаНаДокумент.Товары.ВыгрузитьКолонки();
	СведенияПрослеживаемости = НоваяТаблицаСведенияПрослеживаемостиДокументаИБ(ПустаяСсылкаНаДокумент);
	
	ШапкаЭД = ДанныеЭД.Шапка;
	
	Шапка = Новый Структура;
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	
	Шапка.Вставить("ВалютаДокумента"		, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов", ШапкаЭД.Кратность);
	
	Шапка.Вставить("СуммаВключаетНДС"	, ПараметрыЗаполнения.ЦенаВключаетНДС);
	Шапка.Вставить("ВидОперации"		, ПараметрыЗаполнения.ВидОперации);
	
	Шапка.Вставить("ПокупателемВыставляетсяСчетФактураНаВозврат", ПараметрыЗаполнения.ПокупателемВыставляетсяСчетФактураНаВозврат);
	
	ЗаполнятьСведенияПрослеживаемости = ИспользуетсяУчетПрослеживаемыхТоваров();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоменклатураИБ = Стр.Номенклатура;
		
		ЭтоУслуга = ЭтоНоменклатураУслуга(НоменклатураИБ.Номенклатура);
		
		Если ЭтоУслуга Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура		 = НоменклатураИБ.Номенклатура;
				
		ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
		НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
		
		ЗаполнитьЦенуСуммуПоСтроке(НоваяСтрока, Стр, ПараметрыЗаполнения.ЦенаВключаетНДС);
		
		ЕстьСведенияПрослеживаемости = ВТабличнойЧастиЭДЕстьСведенияПрослеживаемости(Стр);
		
		Если ЗаполнятьСведенияПрослеживаемости И ЕстьСведенияПрослеживаемости Тогда
			ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УПД(СведенияПрослеживаемости, Стр.СведенияОПрослеживаемости, НоваяСтрока);
			ЗаполнятьСтрануПроисхождения = ЗначениеЗаполнено(Стр.ДанныеГТД)
											И Стр.ДанныеГТД.Количество() = 1 
											И ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "СтранаПроисхождения");
		Иначе
			НоваяСтрока.НомерГТД = НомерГТДИзСведенийТаможеннойДекларации(Стр.ДанныеГТД);
			ЗаполнятьСтрануПроисхождения = ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "СтранаПроисхождения");
		КонецЕсли;
						
		Если ЗаполнятьСтрануПроисхождения Тогда
			НоваяСтрока.СтранаПроисхождения = СтранаПроисхожденияИзСведенийТаможеннойДекларации(Стр.ДанныеГТД);
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	ДанныеОбъекта.Вставить("Товары"	, Товары);
	ДанныеОбъекта.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьВозвратТоваровОтПокупателя(ДокументОбъект, ДанныеДокумента)
	
	ДанныеШапки = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеШапки);
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ДокументОбъект.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеШапки);
	
	ОтражениеВУСН = Неопределено;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаНакладной Из ДанныеДокумента.Товары Цикл
		
		СтрокаТЧ = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаНакладной);
		
		СтрокаТЧ.ОтражениеВУСН = ОтражениеВУСН;
		
	КонецЦикла;
	
	Если ДанныеДокумента.Свойство("ШтрихкодыУпаковок") Тогда 
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДокумента.ШтрихкодыУпаковок);
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("СведенияПрослеживаемости")
		И ДанныеДокумента.СведенияПрослеживаемости <> Неопределено 
		И ЕстьМетаданныеСведенияПрослеживаемости(ДокументОбъект.Метаданные()) Тогда
		
		ДокументОбъект.СведенияПрослеживаемости.Очистить();
		ДокументОбъект.СведенияПрослеживаемости.Загрузить(ДанныеДокумента.СведенияПрослеживаемости);
		
	КонецЕсли;
	
	ЗаполнитьСчетаУчетаПередЗаписьюДокумента(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ПоступлениеДопРасходов

Функция СтруктураЗаполненияПоступленияДопРасходов(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ОбщиеПараметрыЗаполненияДокументовУчета();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	СтавкаНДС = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеЭД.ТоварнаяЧасть) Тогда
		
		СтрокаТЧ = ДанныеЭД.ТоварнаяЧасть[0];
		
		ПредставлениеСтавки = СтрокаТЧ.НоменклатураКонтрагента.СтавкаНДС;
		СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
	КонецЕсли;
	
	ИтогиТЧ = ДанныеЭД.Итоги;
	СуммаДокумента = ИтогиТЧ.СуммаБезНДС;
	ЦенаВключаетНДС = ПараметрыЗаполнения.ЦенаВключаетНДС;
	
	Если ЦенаВключаетНДС Тогда
		СуммаДокумента = ИтогиТЧ.СуммаСНДС;
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	
	Шапка = Новый Структура;
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов", ШапкаЭД.Кратность);
	Шапка.Вставить("СуммаВключаетНДС"	, ЦенаВключаетНДС);
	Шапка.Вставить("Сумма"		, СуммаДокумента);
	Шапка.Вставить("СуммаНДС"	, ИтогиТЧ.СуммаНДС);
	Шапка.Вставить("СтавкаНДС"	, СтавкаНДС);
	
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьПоступлениеДопРасходов(ДокументОбъект, ДанныеДокумента)
	
	ДанныеШапки = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеШапки);
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ДокументОбъект.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СФакторинговойКомпанией);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеШапки);
	
	ЗаполнитьСчетаУчетаПередЗаписьюДокумента(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ПоступлениеНМА

Функция СтруктураЗаполненияПоступленияНМА(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ОбщиеПараметрыЗаполненияДокументовУчета();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	НематериальныеАктивы = Документы.ПоступлениеНМА.ПустаяСсылка().НематериальныеАктивы.ВыгрузитьКолонки();
	
	ШапкаЭД = ДанныеЭД.Шапка;
	
	Шапка = Новый Структура;
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов", ШапкаЭД.Кратность);
	Шапка.Вставить("СуммаВключаетНДС"	, ПараметрыЗаполнения.ЦенаВключаетНДС);
	
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоваяСтрока = НематериальныеАктивы.Добавить();
		
		ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
		НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
		
		НоваяСтрока.Сумма = Стр.СуммаБезНДС;
		Если ПараметрыЗаполнения.ЦенаВключаетНДС Тогда
			НоваяСтрока.Сумма = Стр.СуммаСНДС;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("НематериальныеАктивы", НематериальныеАктивы);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьПоступлениеНМА(ДокументОбъект, ДанныеДокумента)
	
	ДанныеШапки = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеШапки);
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ДокументОбъект.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеШапки);
	
	ОтражениеВУСН = Неопределено;
	
	ДокументОбъект.НематериальныеАктивы.Очистить();
	Для Каждого СтрокаТЧ Из ДанныеДокумента.НематериальныеАктивы Цикл
		
		НоваяСтрока = ДокументОбъект.НематериальныеАктивы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
		НоваяСтрока.ОтражениеВУСН = ОтражениеВУСН;
		
	КонецЦикла;
	
	Документы.ПоступлениеНМА.ЗаполнитьСчетаУчетаРасчетов(ДокументОбъект);
	
	ДокументОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	ДокументОбъект.ЗачетАвансов.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ПоступлениеВЛизинг

Функция СтруктураЗаполненияПоступленияВЛизинг(ДанныеЭД, ДополнительныеПараметры)
	
	Если ЕстьДокументПоступлениеВАренду() Тогда
		
		ДанныеОбъекта = ЗаполнитьСтруктуруПоступленияВАренду(ДанныеЭД, ДополнительныеПараметры);
		
	Иначе
		
		ДанныеОбъекта = ЗаполнитьСтруктуруПоступленияВЛизинг(ДанныеЭД, ДополнительныеПараметры);
		
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ЗаполнитьСтруктуруПоступленияВЛизинг(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ОбщиеПараметрыЗаполненияДокументовУчета();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;

	Шапка = Новый Структура;
	Шапка.Вставить("Организация",				СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент",				СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("ВалютаДокумента",			ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов",		ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов",	ШапкаЭД.Кратность);
	Шапка.Вставить("СуммаВключаетНДС",			ПараметрыЗаполнения.ЦенаВключаетНДС);
	Шапка.Вставить("НомерВходящегоДокумента",	ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента",	ШапкаЭД.Дата);
	
	МенеджерОбъекта = Документы["ПоступлениеВЛизинг"];
	ПредметыЛизинга = МенеджерОбъекта.ПустаяСсылка().ПредметыЛизинга.ВыгрузитьКолонки();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоваяСтрока = ПредметыЛизинга.Добавить();
		
		НоменклатураИБ = Стр.Номенклатура;
		
		НоваяСтрока.Номенклатура = НоменклатураИБ.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = НоменклатураИБ.Упаковка;
		
		ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
		НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
		НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
		
		ЗаполнитьЦенуСуммуПоСтроке(НоваяСтрока, Стр, ПараметрыЗаполнения.ЦенаВключаетНДС);
		
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура)
			И Не ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураИБ.Номенклатура, "ЕдиницаИзмерения");
			НоваяСтрока.ЕдиницаИзмерения = РеквизитыНоменклатуры.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	
	ДанныеОбъекта.Вставить("Шапка",				Шапка);
	ДанныеОбъекта.Вставить("ПредметыЛизинга",	ПредметыЛизинга);
	
	Возврат ДанныеОбъекта;	
	
КонецФункции

Функция ЗаполнитьСтруктуруПоступленияВАренду(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ОбщиеПараметрыЗаполненияДокументовУчета();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;

	ШапкаЭД = ДанныеЭД.Шапка;

	Шапка = Новый Структура;
	Шапка.Вставить("Организация",				СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент",				СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("ВалютаДокумента",			ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов",		ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов",	ШапкаЭД.Кратность);
	Шапка.Вставить("СуммаВключаетНДС",			ПараметрыЗаполнения.ЦенаВключаетНДС);
	Шапка.Вставить("НомерВходящегоДокумента",	ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента",	ШапкаЭД.Дата);
	
	ПрименяетсяФСБУ25 = УчетнаяПолитика.ПрименяетсяФСБУ25(Шапка.Организация, Шапка.ДатаВходящегоДокумента);

	Шапка.Вставить("НалоговыйУчетИмуществаВедетЛизингополучатель",	Не ПрименяетсяФСБУ25);

	Шапка.Вставить("ПринятьКУчету",			Истина);
	Шапка.Вставить("ВидОперации",			Перечисления.ВидыОперацийПоступлениеВАренду.ПоступлениеВЛизинг);
	Шапка.Вставить("СпособОценкиАрендыБУ",	СпособыОценкиБУ_РавнаСуммеДоговора());
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьПоступлениеВЛизинг(ДокументОбъект, ДанныеДокумента)
	
	ДанныеШапки = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеШапки);
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ДокументОбъект.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеШапки);
	
	ОтражениеВУСН = Неопределено;
	
	Если ДанныеДокумента.Свойство("ПредметыЛизинга") Тогда
		
		ДокументОбъект.ПредметыЛизинга.Очистить();
		
		Для Каждого СтрокаТЧ Из ДанныеДокумента.ПредметыЛизинга Цикл
			
			НоваяСтрока = ДокументОбъект.ПредметыЛизинга.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьСчетаУчетаПоступленияВЛизинг(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаПоступленияВЛизинг(ДокументОбъект)
	
	ВалютаРегл = ВалютаРегламентированногоУчета();
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументОбъект.ДоговорКонтрагента, "ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");
		
	ДоговорУказан = ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента);
		
	РасчетыВУЕ = ДоговорУказан И РеквизитыДоговора.РасчетыВУсловныхЕдиницах;
	
	Если РасчетыВУЕ Тогда
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.АрендныеОбязательстваУЕ;
	ИначеЕсли ДокументОбъект.ВалютаДокумента <> ВалютаРегл Тогда
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.АрендныеОбязательстваВал;
	Иначе
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.АрендныеОбязательства;
	КонецЕсли;
	
	ДанныеОбъекта = Новый Структура("Организация, Склад");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ДокументОбъект);
	ДанныеОбъекта.Вставить("РасчетыВУЕ", РасчетыВУЕ);
	
	Для Каждого СтрокаТаблицы Из ДокументОбъект.ПредметыЛизинга Цикл
		МенеджерОбъекта = Документы[ИмяДокументаПоступлениеВАрендуЛизинг()];
		МенеджерОбъекта.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, СтрокаТаблицы, "ПредметыЛизинга");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПоступлениеДенежныхДокументов

Функция ВидОперацииПоступленияДенежныхДокументовПоУмолчанию()
	
	МетаданныеРеквизита = Метаданные.Документы.ПоступлениеДенежныхДокументов.Реквизиты.ВидОперации;
	
	Результат = МетаданныеРеквизита.ЗначениеЗаполнения;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.ВидыОперацийПоступлениеДенежныхДокументов.ПоступлениеОтПоставщика;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления денежных документов.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//   * ВидОперации - ПеречислениеСсылка.ВидыОперацийПоступлениеДенежныхДокументов - вид операции поступления денежных документов.
//
Функция ПараметрыЗаполненияПоступленияДенежныхДокументов()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ВидОперации", ВидОперацииПоступленияДенежныхДокументовПоУмолчанию());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияПоступленияДенежныхДокументов(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияПоступленияДенежныхДокументов();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ДенежныеДокументы = Документы.ПоступлениеДенежныхДокументов.ПустаяСсылка().ДенежныеДокументы.ВыгрузитьКолонки();
	
	ШапкаЭД = ДанныеЭД.Шапка;
	
	Шапка = Новый Структура;
	
	Шапка.Вставить("ВидОперации", ПараметрыЗаполнения.ВидОперации);
	
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов", ШапкаЭД.Кратность);
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоваяСтрока = ДенежныеДокументы.Добавить();
		
		НоваяСтрока.Количество	 = Стр.Количество;
		НоваяСтрока.Сумма		 = Стр.СуммаСНДС;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("ДенежныеДокументы", ДенежныеДокументы);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьПоступлениеДенежныхДокументов(ДокументОбъект, ДанныеДокумента)
	
	ДанныеШапки = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеШапки);
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ДокументОбъект.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеШапки);
	
	ОтражениеВУСН = Неопределено;
	
	ДокументОбъект.ДенежныеДокументы.Очистить();
	
	Для Каждого СтрокаТЧ Из ДанныеДокумента.ДенежныеДокументы Цикл
		
		НоваяСтрока = ДокументОбъект.ДенежныеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
	КонецЦикла;
	
	ЗаполнитьСчетаУчетаПоступленияДенежныхДокументов(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаПоступленияДенежныхДокументов(ДокументОбъект)
	
	ВалютаРегл = ВалютаРегламентированногоУчета();
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументОбъект.ДоговорКонтрагента, "ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");
	
	ДоговорУказан = ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента);
	
	РасчетыВУЕ = ДоговорУказан И РеквизитыДоговора.РасчетыВУсловныхЕдиницах;
	
	Если РасчетыВУЕ Тогда
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ;
		ДокументОбъект.СчетУчетаДенежныхДокументов = ПланыСчетов.Хозрасчетный.ДенежныеДокументыВал;
	ИначеЕсли ДокументОбъект.ВалютаДокумента <> ВалютаРегл Тогда
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал;
		ДокументОбъект.СчетУчетаДенежныхДокументов = ПланыСчетов.Хозрасчетный.ДенежныеДокументыВал;
	Иначе
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками;
		ДокументОбъект.СчетУчетаДенежныхДокументов = ПланыСчетов.Хозрасчетный.ДенежныеДокументы;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОперацияСБилетом

Функция ВидОперацииСБилетомПоУмолчанию()
	
	МетаданныеРеквизита = Метаданные.Документы.ОперацияСБилетом.Реквизиты.ВидОперации;
	
	Результат = МетаданныеРеквизита.ЗначениеЗаполнения;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.ВидыОперацийСБилетами.Покупка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения операции с билетом.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийСБилетами - вид операции с билетом.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияОперацииСБилетом()
	
	Результат = ОбщиеПараметрыЗаполненияДокументовУчета();
	Результат.Вставить("ВидОперации", ВидОперацииСБилетомПоУмолчанию());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияОперацииСБилетом(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияОперацииСБилетом();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	СтавкаНДС = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеЭД.ТоварнаяЧасть) Тогда
		
		СтрокаТЧ = ДанныеЭД.ТоварнаяЧасть[0];
		
		ПредставлениеСтавки = СтрокаТЧ.НоменклатураКонтрагента.СтавкаНДС;
		СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
		
	КонецЕсли;
	
	ИтогиТЧ = ДанныеЭД.Итоги;
	ШапкаЭД = ДанныеЭД.Шапка;
	
	Шапка = Новый Структура;
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("Сумма"		, ИтогиТЧ.СуммаСНДС);
	Шапка.Вставить("СуммаНДС"	, ИтогиТЧ.СуммаНДС);
	Шапка.Вставить("СтавкаНДС"	, СтавкаНДС);
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьОперациюСБилетом(ДокументОбъект, ДанныеДокумента)
	
	ДанныеШапки = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеШапки);
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ВалютаРегламентированногоУчета());
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеШапки);
	
	ЗаполнитьСчетаУчетаПередЗаписьюДокумента(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область АктОрасхожденияхПолученный

Функция НайтиОснованиеДокументаОРасхождениях(Организация, ДатаДокумента, НомерДокумента)

	Результат = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеПервичныхДокументов.Документ КАК СФ,
	|	ДанныеПервичныхДокументов.Документ.ДокументОснование КАК Документ
	|ИЗ
	|	РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|ГДЕ
	|	ДанныеПервичныхДокументов.Организация = &Организация
	|	И ДанныеПервичныхДокументов.Номер В(&НомерДокумента)
	|	И НАЧАЛОПЕРИОДА(ДанныеПервичныхДокументов.Дата, ДЕНЬ) = &ДатаДокумента
	|	И ТИПЗНАЧЕНИЯ(ДанныеПервичныхДокументов.Документ) = ТИП(Документ.СчетФактураВыданный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеПервичныхДокументов.Документ,
	|	ТЧСФ.ДокументОснование
	|ИЗ
	|	РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК ТЧСФ
	|		ПО (ТЧСФ.Ссылка = ДанныеПервичныхДокументов.Документ)
	|ГДЕ
	|	ДанныеПервичныхДокументов.Организация = &Организация
	|	И ДанныеПервичныхДокументов.Номер В(&НомерДокумента)
	|	И НАЧАЛОПЕРИОДА(ДанныеПервичныхДокументов.Дата, ДЕНЬ) = &ДатаДокумента
	|	И ТИПЗНАЧЕНИЯ(ДанныеПервичныхДокументов.Документ) = ТИП(Документ.СчетФактураПолученный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НЕОПРЕДЕЛЕНО,
	|	ДанныеПервичныхДокументов.Документ
	|ИЗ
	|	РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|ГДЕ
	|	ДанныеПервичныхДокументов.Организация = &Организация
	|	И ДанныеПервичныхДокументов.Номер В(&НомерДокумента)
	|	И НАЧАЛОПЕРИОДА(ДанныеПервичныхДокументов.Дата, ДЕНЬ) = &ДатаДокумента
	|	И ТИПЗНАЧЕНИЯ(ДанныеПервичныхДокументов.Документ) В (ТИП(Документ.РеализацияТоваровУслуг), ТИП(Документ.ВозвратТоваровПоставщику))";
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаДокумента",	ДатаДокумента);
	Запрос.УстановитьПараметр("НомерДокумента",	НомерДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Документ;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПараметрыЗаполненияАктаОРасхожденияхПолученного()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияАктаОРасхожденияхПолученного(ДанныеЭД, ДополнительныеПараметры)

	ПараметрыЗаполнения = ПараметрыЗаполненияАктаОРасхожденияхПолученного();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	
	Товары = Документы.АктОРасхожденияхПолученный.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	Услуги = Документы.АктОРасхожденияхПолученный.ПустаяСсылка().Услуги.ВыгрузитьКолонки();
	
	// Маркировка
	ШтрихкодыУпаковок = НоваяТаблицаШтрихкодыУпаковок();
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ИтогиТЧ = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Участники сделки
	Шапка.Вставить("Организация"		, СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"			, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("Грузоотправитель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузоотправитель));
	Шапка.Вставить("Грузополучатель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузополучатель));
	
	// Валюта, суммы
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("СуммаВключаетНДС"	, ПараметрыЗаполнения.ЦенаВключаетНДС);
	
	// Даты, номера
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	// Основание документа о расхождениях
	Организация		= Шапка.Организация;
	ДатаДокумента	= НачалоДня(ДанныеЭД.Шапка.Основание.Дата);
	НомерДокумента	= ДанныеЭД.Шапка.Основание.Номер;
	
	ДокументОснование = НайтиОснованиеДокументаОРасхождениях(Организация, ДатаДокумента, НомерДокумента);
		
	ДополнитьПараметрыЗаполненияАктаОРасхожденияхПоДокументуОснованию(ДокументОснование, Шапка);
	
	// Табличная часть
	ИспользуетсяОбратноеНачислениеНДС = ИспользуетсяОбратноеНачислениеНДС();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоменклатураИБ = Стр.Номенклатура;
		НоменклатураКонтрагента = Стр.НоменклатураКонтрагента;
		
		ЭтоУслуга = ЭтоНоменклатураУслуга(НоменклатураИБ.Номенклатура);
		
		Если ЭтоУслуга Тогда 
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.СодержаниеДоИзменения = НоменклатураКонтрагента.Наименование;
			НоваяСтрока.Содержание            = НоменклатураКонтрагента.Наименование;
		Иначе 
			НоваяСтрока = Товары.Добавить();
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = НоменклатураИБ.Номенклатура;
		
		ПредставлениеСтавки = НоменклатураКонтрагента.СтавкаНДС;
		Если МенеджерИнтеграции_ЭтоСтавкаНДСИНА(ПредставлениеСтавки) Тогда
			
			Если ИспользуетсяОбратноеНачислениеНДС Тогда
				
				НоваяСтрока.СтавкаНДС = МенеджерИнтеграции_ОбщаяСтавкаНДС(ШапкаЭД.Дата);
				
				НоваяСтрока.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
					Стр.СуммаБезНДС,
					Ложь,
					УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				    
				НоваяСтрока.СуммаНДСПоДокументу = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
					Стр.СуммаБезНДС_До,
					Ложь,
					УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
			Иначе
				
				НоваяСтрока.СтавкаНДС = Неопределено;
				НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
				НоваяСтрока.СуммаНДСПоДокументу = Стр.СуммаНДС_До;
				
			КонецЕсли;
			
		Иначе 
			
			НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
			НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
			НоваяСтрока.СуммаНДСПоДокументу = Стр.СуммаНДС_До;
			
		КонецЕсли;
		
		НоваяСтрока.Количество = Стр.Количество;
		НоваяСтрока.Цена = Стр.Цена;
		НоваяСтрока.Сумма = Стр.СуммаСНДС;
		
		НоваяСтрока.КоличествоПоДокументу = Стр.Количество_До;
		НоваяСтрока.ЦенаПоДокументу = Стр.Цена_До;
		НоваяСтрока.СуммаПоДокументу = Стр.СуммаСНДС_До;
		
		Если Шапка.СуммаВключаетНДС Тогда
			
			// Включаем НДС в сумму
			НоваяСтрока.СуммаПоДокументу = НоваяСтрока.СуммаПоДокументу + НоваяСтрока.СуммаНДСПоДокументу;
			
			// Пересчитаем цену
			РасчетноеКоличество = ?(НоваяСтрока.КоличествоПоДокументу = 0, 1, НоваяСтрока.КоличествоПоДокументу);
			НоваяСтрока.ЦенаПоДокументу = НоваяСтрока.СуммаПоДокументу / РасчетноеКоличество;
			
		КонецЕсли;
		
		ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, Стр.СведенияОМаркировке);
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	ДанныеОбъекта.Вставить("Товары"	, Товары);
	ДанныеОбъекта.Вставить("Услуги"	, Услуги);
	ДанныеОбъекта.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	Возврат ДанныеОбъекта;

КонецФункции

Процедура ЗаполнитьАктОРасхожденияхПолученный(ДокументОбъект, ДанныеДокумента)

	ДанныеЗаполнения = ДанныеДокумента.Шапка;
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеЗаполнения);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументРеализации = ДокументОбъект.ДокументРеализации;
	Если Не ЗначениеЗаполнено(ДокументРеализации) И ДанныеЗаполнения.Свойство("Основание") Тогда
		ДокументРеализации = ДанныеЗаполнения.Основание;
	КонецЕсли;
	
	// Заполним корректировку поступления данными основания
	Если ЗначениеЗаполнено(ДокументРеализации) Тогда
		ДокументОбъект.Заполнить(ДокументРеализации);
	КонецЕсли;
	
	// Заполним табличные части данными корректировки
	ИменаТЧСтрокой = "Товары, Услуги";
	
	ИменаТЧ = Новый Массив;
	ИменаТЧ.Добавить("Товары");
	ИменаТЧ.Добавить("Услуги");
	
	РеквизитыТабличнойЧастиДляПерезаполнения = Новый Структура(ИменаТЧСтрокой);
	РеквизитыТабличнойЧастиДляПерезаполнения.Товары = "Количество, Цена, Сумма, СуммаНДС, НомерГТД, СтранаПроисхождения";
	РеквизитыТабличнойЧастиДляПерезаполнения.Услуги = "Количество, Цена, Сумма, СуммаНДС, Содержание";
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		
		ИмяТЧ = СокрЛП(ИмяТЧ);
		
		СтруктураПоиска = Новый Структура("Номенклатура, СтавкаНДС");
		
		Для Каждого СтрокаДокумента Из ДокументОбъект[ИмяТЧ] Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
			РезультатПоискаДанныхЗаполнения = ДанныеДокумента[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
			
			Если РезультатПоискаДанныхЗаполнения.Количество() > 0 Тогда
				
				СтрокаДанныхЗаполнения = РезультатПоискаДанныхЗаполнения[0];
				ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаДанныхЗаполнения, РеквизитыТабличнойЧастиДляПерезаполнения[ИмяТЧ]);
				
				// Удалим обработанную строку из данных заполнения
				ДанныеДокумента[ИмяТЧ].Удалить(СтрокаДанныхЗаполнения);
				
			КонецЕсли;
			
			СтрокаДокумента.ЕстьВДокументеРеализации = Истина;
			
		КонецЦикла;
		
		// Добавим новые строки в документ
		Если ДанныеДокумента[ИмяТЧ].Количество() > 0 Тогда
			
			Для Каждого СтрокаДанныхЗаполнения Из ДанныеДокумента[ИмяТЧ] Цикл
				
				НоваяСтрока = ДокументОбъект[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхЗаполнения);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеДокумента.Свойство("ШтрихкодыУпаковок")
		И ЕстьШтрихкодыУпаковок(ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДокумента.ШтрихкодыУпаковок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПараметрыЗаполненияАктаОРасхожденияхПоДокументуОснованию(ДокументОснование, Шапка)

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Шапка.Вставить("Основание", ДокументОснование);
	Шапка.СуммаВключаетНДС = РазрешенноеЗначениеРеквизитаОбъекта(ДокументОснование, "СуммаВключаетНДС");

КонецПроцедуры

#КонецОбласти

#Область АктСверкиВзаиморасчетов3_0_131

Функция СтруктураЗаполненияАктаСверкиВзаиморасчетов3_0_131(ДанныеЭД, ДополнительныеПараметры)
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Стороны сверки
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Получатель));
	Шапка.Вставить("Контрагент", СсылкаНаУчастникаСделки(ШапкаЭД.Отправитель));
	
	// Валюта
	Шапка.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	
	// Даты, номера, суммы
	ОстатокНаНачалоПоДаннымКонтрагента = ИтогиЭД.СальдоНачДеб - ИтогиЭД.СальдоНачКр;
	
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента", ШапкаЭД.Дата);
	Шапка.Вставить("ЭтоЭлектронныйДокумент", Истина);
	Шапка.Вставить("ЭтоДокументКонтрагента", Истина);
	Шапка.Вставить("РазбитьПоДоговорам", Истина);
	Шапка.Вставить("ДатаНачала", ШапкаЭД.ДатаНачала);
	Шапка.Вставить("ДатаОкончания", ШапкаЭД.ДатаОкончания);
	Шапка.Вставить("ОстатокНаНачалоПоДаннымКонтрагента", ОстатокНаНачалоПоДаннымКонтрагента);
	
	ТаблицаПоДаннымКонтрагента = Документы.АктСверкиВзаиморасчетов.ПустаяСсылка().ПоДаннымКонтрагента.ВыгрузитьКолонки();
	
	// Табличная часть ПоДаннымКонтрагента
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ТаблицаПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.Договор = ДоговорПоСтрокеАктаСверки(Шапка, СтрокаДоговора);
				СтрокаПоДаннымКонтрагента.Дата = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.НаименованиеОперации = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.НаименованиеДокумента = СтрокаДокумента.Наименование;
				СтрокаПоДаннымКонтрагента.Дебет = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.Кредит = СтрокаОперации.СуммаКредит;
				СтрокаПоДаннымКонтрагента.НомерДокумента = СтрокаДокумента.Номер;
				СтрокаПоДаннымКонтрагента.ДатаДокумента = СтрокаДокумента.Дата;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("ПоДаннымКонтрагента", ТаблицаПоДаннымКонтрагента);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьАктСверкиВзаиморасчетов3_0_131(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	Документы.АктСверкиВзаиморасчетов.ЗаполнитьАктСверкиПоДаннымИБ(ДокументОбъект);
	ДокументОбъект.ПоДаннымКонтрагента.Загрузить(ДанныеДокумента.ПоДаннымКонтрагента);
	Документы.АктСверкиВзаиморасчетов.СопоставитьДанныеОрганизацииИКонтрагента(ДокументОбъект);
	
	Если ИспользуетсяУстановкаСтатусаСверки() Тогда
		
		УстановитьСтатусАктаСверкиВзаиморасчетов(ДокументОбъект);
		
	Иначе
		
		ДокументОбъект.СверкаСогласована = НЕ ДокументОбъект.ЕстьРасхождения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСтатусАктаСверкиВзаиморасчетов(ДокументОбъект)
	
	СверкаСогласована = Не ДокументОбъект.ЕстьРасхождения;
	
	ЗначениеСтатусАктаСверки = Перечисления.СтатусыДокументовРеализации.Подписан;
	
	Если НЕ СверкаСогласована Тогда
		ЗначениеСтатусАктаСверки = Перечисления.СтатусыДокументовРеализации.НеПодписан;
	КонецЕсли;
	
	СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
	СтатусыДокумента.Статус = ЗначениеСтатусАктаСверки;
	
	РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(ДокументОбъект.Ссылка, СтатусыДокумента);
	
КонецПроцедуры

Функция ДоговорПоСтрокеАктаСверки(ДанныеДокумента, РеквизитыДоговора)
	
	ОтборПоВалюте = Новый Структура("ЗначениеОтбора", ДанныеДокумента.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	
	Если РеквизитыДоговора.Описание = "С покупателем" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	ИначеЕсли РеквизитыДоговора.Описание = "С поставщиком" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Иначе
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	КонецЕсли;
		
	ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДоговорКонтрагента,
		ДанныеДокумента.Контрагент, ДанныеДокумента.Организация, СписокВидовДоговоров, СтруктураПараметров);
		
	Возврат ДоговорКонтрагента;
	
КонецФункции

#КонецОбласти

#Область АктСверкиВзаиморасчетов

Функция СтруктураЗаполненияАктаСверкиВзаиморасчетов(ДанныеЭД, ДополнительныеПараметры)
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Стороны сверки
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Получатель));
	Шапка.Вставить("Контрагент", СсылкаНаУчастникаСделки(ШапкаЭД.Отправитель));
	
	// Валюта
	Шапка.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	
	// Даты сверки, суммы
	ОстатокНаНачало = ИтогиЭД.СальдоНачДеб - ИтогиЭД.СальдоНачКр;
	
	Шапка.Вставить("ДатаНачала", ШапкаЭД.ДатаНачала);
	Шапка.Вставить("ДатаОкончания", ШапкаЭД.ДатаОкончания);
	Шапка.Вставить("ОстатокНаНачало", ОстатокНаНачало);
	
	ТаблицаПоДаннымКонтрагента = Документы.АктСверкиВзаиморасчетов.ПустаяСсылка().ПоДаннымКонтрагента.ВыгрузитьКолонки();
	
	// Табличная часть ПоДаннымКонтрагента
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ТаблицаПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.Договор = ДоговорПоСтрокеАктаСверки(Шапка, СтрокаДоговора);
				СтрокаПоДаннымКонтрагента.Дата = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.Представление = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.Дебет = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.Кредит = СтрокаОперации.СуммаКредит;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("ПоДаннымКонтрагента", ТаблицаПоДаннымКонтрагента);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьАктСверкиВзаиморасчетов(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
		ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент,
		ДокументОбъект.Организация
	);
	
	МенеджерОбъекта = Документы.АктСверкиВзаиморасчетов;
	
	ДокументОбъект.ПредставительОрганизации = МенеджерОбъекта.ПредставительОрганизации(ДокументОбъект.Организация, ДокументОбъект.Дата);
	ДокументОбъект.ПредставительКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Контрагент, "ОсновноеКонтактноеЛицо");
	
	ДокументОбъект.РазбитьПоДоговорам = Истина;
	
	ДокументОбъект.ПоДаннымКонтрагента.Загрузить(ДанныеДокумента.ПоДаннымКонтрагента);
	
	ЗаполнитьСчетамиПоУмолчаниюНаСервере(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьСчетамиПоУмолчаниюНаСервере(ДокументОбъект)

	ТаблицаСчетов = УчетВзаиморасчетов.ПолучитьТаблицуСчетовУчетаВзаиморасчетов(Истина, Ложь);
	ТаблицаСчетов.Колонки.СчетРасчетов.Имя = "Счет";
	ТаблицаСчетов.Колонки.Добавить("УчаствуетВРасчетах");
	ТаблицаСчетов.ЗаполнитьЗначения(Истина, "УчаствуетВРасчетах");
	
	ДокументОбъект.СписокСчетов.Загрузить(ТаблицаСчетов);
	
КонецПроцедуры

#КонецОбласти

#Область СчетНаОплатуПоставщика

Функция СтруктураЗаполненияСчетаНаОплатуПоставщика(ДанныеЭД, ДополнительныеПараметры)
	
	ПустаяСсылкаНаДокумент = Документы.СчетНаОплатуПоставщика.ПустаяСсылка();
	
	ШапкаЭД = ДанныеЭД.Шапка;
	
	Контрагент = СсылкаНаУчастникаСделки(ШапкаЭД.Продавец);
	НомерБанковскогоСчета = ШапкаЭД.Продавец.НомерСчета;
	БанковскийСчетКонтрагента = БанковскийСчетКонтрагента(Контрагент, НомерБанковскогоСчета);
	
	Шапка = Новый Структура;
	
	Шапка.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент", Контрагент);
	
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсВзаиморасчетов"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьВзаиморасчетов", 1);
	Шапка.Вставить("СуммаВключаетНДС", ДополнительныеПараметры.ЦенаВключаетНДС);
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	Шапка.Вставить("БанковскийСчетКонтрагента", БанковскийСчетКонтрагента);
	Шапка.Вставить("СуммаДокумента", ДанныеЭД.Итоги.СуммаСНДС);
	
	Товары = ПустаяСсылкаНаДокумент.Товары.ВыгрузитьКолонки();
	
	Для Каждого СтрокаТовара Из ДанныеЭД.ТоварнаяЧасть Цикл
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТовара.Номенклатура.Номенклатура;
		НоваяСтрока.Содержание = СтрокаТовара.НоменклатураКонтрагента.Наименование;
		НоваяСтрока.Количество = СтрокаТовара.Количество;
		
		ЗаполнитьЦенуСуммуПоСтроке(НоваяСтрока, СтрокаТовара, ДополнительныеПараметры.ЦенаВключаетНДС);
		
		НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(СтрокаТовара.НоменклатураКонтрагента.СтавкаНДС);
		НоваяСтрока.СуммаНДС = СтрокаТовара.СуммаНДС;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка", Шапка);
	ДанныеОбъекта.Вставить("Товары", Товары);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция БанковскийСчетКонтрагента(Контрагент, НомерБанковскогоСчета)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК БанковскийСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Контрагент
	|	И БанковскиеСчета.НомерСчета = &НомерБанковскогоСчета";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НомерБанковскогоСчета", НомерБанковскогоСчета);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
		Результат = РезультатЗапроса[0].БанковскийСчет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСчетНаОплатуПоставщика(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	
	ОтборПоВалюте       = Новый Структура("ЗначениеОтбора", ДокументОбъект.ВалютаДокумента);
	СтруктураПараметров = Новый Структура("ВалютаВзаиморасчетов", ОтборПоВалюте);
	
	СписокВидовДоговоров = Новый СписокЗначений;
	
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СФакторинговойКомпанией);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров, СтруктураПараметров);	
		
	ДокументОбъект.Товары.Загрузить(ДанныеДокумента.Товары);
		
КонецПроцедуры

#КонецОбласти

#Область СчетФактура

// Конструктор дополнительных параметров заполнения счета-фактуры.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ДокументОснование - Неопределено, ДокументСсылка, Массив - документ-основание (список оснований) счета-фактуры.
//
Функция ПараметрыЗаполненияСчетаФактуры()
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументОснование", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияСчетаФактуры(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияСчетаФактуры();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ИтогиТЧ = ДанныеЭД.Итоги;
	
	ДанныеОбъекта = Новый Структура;
	
	// Даты, номера
	ДанныеОбъекта.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	ДанныеОбъекта.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	ДанныеОбъекта.Вставить("НомерИсходногоДокумента", "");
	ДанныеОбъекта.Вставить("ДатаИсходногоДокумента"	, '00010101');
	
	НомерИсправления = СвойствоСтруктуры(ШапкаЭД, "НомерИсправления");
	ДатаИсправления  = СвойствоСтруктуры(ШапкаЭД, "ДатаИсправления");
	
	Если ЗначениеЗаполнено(НомерИсправления) Тогда
		ДанныеОбъекта.Вставить("Исправление", Истина);
		ДанныеОбъекта.Вставить("НомерИсправления", НомерИсправления);
		ДанныеОбъекта.Вставить("ДатаИсправления",  ДатаИсправления);
	КонецЕсли;
	
	// Участники сделки
	ДанныеОбъекта.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	ДанныеОбъекта.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	ДанныеОбъекта.Вставить("Комиссионер", Справочники.Контрагенты.ПустаяСсылка()); // TODO: Добавить в структуру ЭД сведения о комиссионере
	
	// Вид операции
	ЭтоАванс = ДанныеЭД.ЭтоАванс; // TODO: Заменить на вызов ЭтоЭлектронныйСчетФактураНаАванс()
	
	Если ЭтоАванс Тогда 
		
		ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс;
		КодВидаОперации = "02";
		
	Иначе
		
		ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление;
		КодВидаОперации = ?(ЗначениеЗаполнено(ДанныеОбъекта.Комиссионер), "04", "01");
		
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("ВидСчетаФактуры", ВидСчетаФактуры);
	ДанныеОбъекта.Вставить("КодВидаОперации", КодВидаОперации);
	
	// Основания счета-фактуры
	ОснованиеСчетаФактуры = ПараметрыЗаполнения.ДокументОснование;
	Если Не ЗначениеЗаполнено(ОснованиеСчетаФактуры) Тогда
		ИдентификаторЭД = ДанныеЭД.ЭлектронныйДокумент.Идентификатор;
		ОснованиеСчетаФактуры = СопоставленныеУчетныеДокументы(ИдентификаторЭД);
	КонецЕсли;
	ДанныеОбъекта.Вставить("ДокументыОснования", ОснованиеСчетаФактуры);
	
	// Валюта, суммы
	ДанныеОбъекта.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	ДанныеОбъекта.Вставить("СуммаДокумента"		, ИтогиТЧ.СуммаСНДС);
	ДанныеОбъекта.Вставить("СуммаНДСДокумента"	, ИтогиТЧ.СуммаНДС);
	ДанныеОбъекта.Вставить("СуммаУменьшение"	, 0);
	ДанныеОбъекта.Вставить("СуммаНДСУменьшение"	, 0);
	ДанныеОбъекта.Вставить("СуммаУвеличение"	, 0);
	ДанныеОбъекта.Вставить("СуммаНДСУвеличение"	, 0);
	
	// Авансы
	Если ДанныеОбъекта.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс Тогда
		
		Авансы = Новый ТаблицаЗначений;
		Авансы.Колонки.Добавить("Сумма");
		Авансы.Колонки.Добавить("СуммаНДС");
		Авансы.Колонки.Добавить("СтавкаНДС");
		
		Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
			
			ПредставлениеСтавки = Стр.НоменклатураКонтрагента.СтавкаНДС;
			
			НоваяСтрока = Авансы.Добавить();
			НоваяСтрока.Сумма = Стр.СуммаСНДС;
			НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
			НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
			
		КонецЦикла;
		
		Если Авансы.Количество() > 0 Тогда
			ДанныеОбъекта.Вставить("Авансы", Авансы);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция СтруктураЗаполненияКорректировочногоСчетаФактуры(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияСчетаФактуры();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ИтогиТЧ = ДанныеЭД.Итоги;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	ДанныеОбъекта.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	
	ДанныеОбъекта.Вставить("НомерИсходногоДокумента", СвойствоСтруктуры(ШапкаЭД, "НомерИсходногоДокумента"));
	ДанныеОбъекта.Вставить("ДатаИсходногоДокумента"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсходногоДокумента"));
	
	НомерИсправления = СвойствоСтруктуры(ШапкаЭД, "НомерИсправления");
	ДатаИсправления  = СвойствоСтруктуры(ШапкаЭД, "ДатаИсправления");
	
	Если ЗначениеЗаполнено(НомерИсправления) Тогда
		ДанныеОбъекта.Вставить("Исправление", Истина);
		ДанныеОбъекта.Вставить("НомерИсправления", НомерИсправления);
		ДанныеОбъекта.Вставить("ДатаИсправления",  ДатаИсправления);
	КонецЕсли;
	
	НомерИсправленияИсходногоДокумента = СвойствоСтруктуры(ШапкаЭД, "НомерИсправленияИсходногоДокумента");
	ДатаИсправленияИсходногоДокумента  = СвойствоСтруктуры(ШапкаЭД, "ДатаИсправленияИсходногоДокумента");
	
	Если ЗначениеЗаполнено(НомерИсправленияИсходногоДокумента) Тогда
		ДанныеОбъекта.Вставить("УчитыватьИсправлениеИсходногоДокумента", Истина);
		ДанныеОбъекта.Вставить("НомерИсправленияИсходногоДокумента", НомерИсправленияИсходногоДокумента);
		ДанныеОбъекта.Вставить("ДатаИсправленияИсходногоДокумента",  ДатаИсправленияИсходногоДокумента);
	Иначе
		ДанныеОбъекта.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("Организация", СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	ДанныеОбъекта.Вставить("Контрагент"	, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	ДанныеОбъекта.Вставить("Комиссионер", Справочники.Контрагенты.ПустаяСсылка());
	
	ДанныеОбъекта.Вставить("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыПолученного.Корректировочный);
	ДанныеОбъекта.Вставить("КодВидаОперации", "01");
	ДанныеОбъекта.Вставить("КодВидаОперацииНаУменьшение", "18");
	
	//Заполняем документы-основания
	ОснованиеСчетаФактуры = ПараметрыЗаполнения.ДокументОснование;
	Если Не ЗначениеЗаполнено(ОснованиеСчетаФактуры) Тогда
		ИдентификаторЭД = ДанныеЭД.ЭлектронныйДокумент.Идентификатор;
		ОснованиеСчетаФактуры = СопоставленныеУчетныеДокументы(ИдентификаторЭД);
	КонецЕсли;
	ДанныеОбъекта.Вставить("ДокументыОснования", ОснованиеСчетаФактуры);
	
	ДанныеОбъекта.Вставить("ВалютаДокумента", ШапкаЭД.Валюта.Ссылка);
	
	ДанныеОбъекта.Вставить("СуммаДокумента"		, 0);
	ДанныеОбъекта.Вставить("СуммаНДСДокумента"	, 0);
	
	ДанныеОбъекта.Вставить("СуммаУменьшение"	, ИтогиТЧ.СуммаСНДСУменьшение);
	ДанныеОбъекта.Вставить("СуммаНДСУменьшение"	, ИтогиТЧ.СуммаНДСУменьшение);
	ДанныеОбъекта.Вставить("СуммаУвеличение"	, ИтогиТЧ.СуммаСНДСУвеличение);
	ДанныеОбъекта.Вставить("СуммаНДСУвеличение"	, ИтогиТЧ.СуммаНДСУвеличение);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьСчетФактуруПолученный(ДокументОбъект, ДанныеДокумента)
	
	// вручную переопределим, если требуется
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеДокумента);
	
	// Заполнить реквизиты значениями по умолчанию.
	ЗаполнениеДокументов.Заполнить(ДокументОбъект);
	ДокументОбъект.ВидСчетаФактуры = ДанныеДокумента.ВидСчетаФактуры;
	ДокументОбъект.КодВидаОперации = ДанныеДокумента.КодВидаОперации;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.ДокументыОснования) Тогда
		
		Если ТипЗнч(ДанныеДокумента.ДокументыОснования) = Тип("Массив") Тогда
			КоллекцияОснований = ДанныеДокумента.ДокументыОснования;
		Иначе
			КоллекцияОснований = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеДокумента.ДокументыОснования);
		КонецЕсли;
		
		ДокументОбъект.ДокументыОснования.Очистить();
		
		Для Каждого ДокументОснование Из КоллекцияОснований Цикл
			
			Если ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный 
				И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ДокументОбъект.ДокументыОснования.Добавить().ДокументОснование = ДокументОснование;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДокументОбъект.ДокументОснование = ?(ДокументОбъект.ДокументыОснования.Количество()>0, ДокументОбъект.ДокументыОснования[0].ДокументОснование, Неопределено);
	Если ТипЗнч(ДокументОбъект.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		ДокументОбъект.ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.ДокументОснование, "ДоговорКонтрагента");
		
	КонецЕсли;
	
	ДокументОбъект.КодСпособаПолучения = 2;
	ДокументОбъект.НомерВходящегоДокумента = ДанныеДокумента.НомерВходящегоДокумента;
	ДокументОбъект.ДатаВходящегоДокумента  = ДанныеДокумента.ДатаВходящегоДокумента;
	ДокументОбъект.НомерИсходногоДокумента = ДанныеДокумента.НомерИсходногоДокумента;
	ДокументОбъект.ДатаИсходногоДокумента  = ДанныеДокумента.ДатаИсходногоДокумента;
	Если ДанныеДокумента.Свойство("Исправление") Тогда
		ДокументОбъект.Исправление       = ДанныеДокумента.Исправление;
		ДокументОбъект.НомерИсправления  = ДанныеДокумента.НомерИсправления;
		ДокументОбъект.ДатаИсправления   = ДанныеДокумента.ДатаИсправления;
	КонецЕсли;
	
	Если ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный 
		И ДокументОбъект.ДокументыОснования.Количество()>0 Тогда
		
		СтрокаОснование = ДокументОбъект.ДокументыОснования[0];
		СтрокаОснование.НомерИсходногоДокумента	 = ДанныеДокумента.НомерИсходногоДокумента;
		СтрокаОснование.ДатаИсходногоДокумента	 = ДанныеДокумента.ДатаИсходногоДокумента;
		СтрокаОснование.СуммаУвеличение		 = ДанныеДокумента.СуммаУвеличение;
		СтрокаОснование.СуммаУменьшение		 = ДанныеДокумента.СуммаУменьшение;
		СтрокаОснование.СуммаНДСУвеличение	 = ДанныеДокумента.СуммаНДСУвеличение;
		СтрокаОснование.СуммаНДСУменьшение	 = ДанныеДокумента.СуммаНДСУменьшение;
		
		СтрокаОснование.УчитыватьИсправлениеИсходногоДокумента = ДанныеДокумента.Свойство("УчитыватьИсправлениеИсходногоДокумента") И ДанныеДокумента.УчитыватьИсправлениеИсходногоДокумента;
		
		Если СтрокаОснование.УчитыватьИсправлениеИсходногоДокумента  Тогда
			СтрокаОснование.НомерИсправленияИсходногоДокумента = ДанныеДокумента.НомерИсправленияИсходногоДокумента;
			СтрокаОснование.ДатаИсправленияИсходногоДокумента  = ДанныеДокумента.ДатаИсправленияИсходногоДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	// Отражение вычета НДС по умолчанию
	СтруктураПараметров	= Новый Структура("Дата, Организация, ВидСчетаФактуры, ДокументОснование, Исправление");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ДокументОбъект);
	ДокументОбъект.НДСПредъявленКВычету = Документы.СчетФактураПолученный.ПолучитьПорядокОтраженияВычетаПоУмолчанию(СтруктураПараметров);
	
	ДокументОбъект.СуммаУвеличение		 = ДанныеДокумента.СуммаУвеличение;
	ДокументОбъект.СуммаУменьшение		 = ДанныеДокумента.СуммаУменьшение;
	ДокументОбъект.СуммаНДСУвеличение	 = ДанныеДокумента.СуммаНДСУвеличение;
	ДокументОбъект.СуммаНДСУменьшение	 = ДанныеДокумента.СуммаНДСУменьшение;
	
	Если ДанныеДокумента.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
		ДокументОбъект.СуммаДокумента     = ?(ДанныеДокумента.СуммаУвеличение = Неопределено, 0, ДанныеДокумента.СуммаУвеличение)
											- ?(ДанныеДокумента.СуммаУменьшение = Неопределено, 0, ДанныеДокумента.СуммаУменьшение);
		ДокументОбъект.СуммаНДСДокумента     = ?(ДанныеДокумента.СуммаНДСУвеличение = Неопределено, 0, ДанныеДокумента.СуммаНДСУвеличение)
											- ?(ДанныеДокумента.СуммаНДСУменьшение = Неопределено, 0, ДанныеДокумента.СуммаНДСУменьшение);
	Иначе
		ДокументОбъект.СуммаДокумента     = ДанныеДокумента.СуммаДокумента;
		ДокументОбъект.СуммаНДСДокумента  = ДанныеДокумента.СуммаНДСДокумента;
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("Авансы") Тогда
		
		ДокументОбъект.Авансы.Загрузить(ДанныеДокумента.Авансы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КорректировкаПоступления

Функция ПараметрыЗаполненияКорректировкиПоступления()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ДокументОснование", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияКорректировкиПоступления(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияКорректировкиПоступления();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
	
	ПустаяСсылкаНаДокумент = Документы.КорректировкаПоступления.ПустаяСсылка();
	
	Товары = ПустаяСсылкаНаДокумент.Товары.ВыгрузитьКолонки();
	Услуги = ПустаяСсылкаНаДокумент.Услуги.ВыгрузитьКолонки();
	// Маркировка
	ШтрихкодыУпаковок = НоваяТаблицаШтрихкодыУпаковок();
	СведенияПрослеживаемости = НоваяТаблицаСведенияПрослеживаемостиДокументаИБ(ПустаяСсылкаНаДокумент, Истина);
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ИтогиТЧ = ДанныеЭД.Итоги;
	
	Шапка = Новый Структура;
	
	// Участники сделки
	Шапка.Вставить("Организация"		, СсылкаНаУчастникаСделки(ШапкаЭД.Покупатель));
	Шапка.Вставить("Контрагент"			, СсылкаНаУчастникаСделки(ШапкаЭД.Продавец));
	Шапка.Вставить("Грузоотправитель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузоотправитель));
	Шапка.Вставить("Грузополучатель"	, СсылкаНаУчастникаСделки(ШапкаЭД.Грузополучатель));
	
	// Валюта, суммы
	Шапка.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	Шапка.Вставить("КурсДокумента"		, ШапкаЭД.Курс);
	Шапка.Вставить("КратностьДокумента"	, ШапкаЭД.Кратность);
	Шапка.Вставить("СуммаВключаетНДС"	, ПараметрыЗаполнения.ЦенаВключаетНДС);
	
	// Даты, номера
	Шапка.Вставить("НомерВходящегоДокумента", ШапкаЭД.Номер);
	Шапка.Вставить("ДатаВходящегоДокумента"	, ШапкаЭД.Дата);
	Шапка.Вставить("НомерИсходногоДокумента", СвойствоСтруктуры(ШапкаЭД, "НомерИсходногоДокумента"));
	Шапка.Вставить("ДатаИсходногоДокумента"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсходногоДокумента"));
	
	Если ЗначениеЗаполнено(СвойствоСтруктуры(ШапкаЭД, "НомерИсправления")) Тогда 
		Шапка.Вставить("ВидОперацииЭД"		, Перечисления.ВидыОперацийЭД.Исправление);
		Шапка.Вставить("Исправление"		, Истина);
		Шапка.Вставить("НомерИсправления"	, СвойствоСтруктуры(ШапкаЭД, "НомерИсправления"));
		Шапка.Вставить("ДатаИсправления"	, СвойствоСтруктуры(ШапкаЭД, "ДатаИсправления"));
	Иначе 
		Шапка.Вставить("ВидОперацииЭД"	, Перечисления.ВидыОперацийЭД.Корректировка);
		Шапка.Вставить("Исправление"	, Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойствоСтруктуры(ШапкаЭД, "НомерИсправленияИсходногоДокумента")) Тогда
		Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента"	, Истина);
		Шапка.Вставить("НомерИсправленияИсходногоДокумента"		, СвойствоСтруктуры(ШапкаЭД, "НомерИсправленияИсходногоДокумента"));
		Шапка.Вставить("ДатаИсправленияИсходногоДокумента"		, СвойствоСтруктуры(ШапкаЭД, "ДатаИсправленияИсходногоДокумента"));
	Иначе
		Шапка.Вставить("УчитыватьИсправлениеИсходногоДокумента"	, Ложь);
	КонецЕсли;
	
	ДокументОснование = ПараметрыЗаполнения.ДокументОснование;
	
	Если Не ЗначениеЗаполнено(ДокументОснование)
		И ФорматЭД.ЭтоКорректировка Тогда
		
		// Основание корректировочного документа
		СвойстваОснования = СвойствоСтруктуры(ШапкаЭД, "КорректируемыйДокумент");
		ДокументОснование = СвойствоСтруктуры(СвойстваОснования, "ПервичныйДокумент");
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ДокументОснование = ДокументОснованиеСчетаФактуры(ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	Шапка.Вставить("Основание", ДокументОснование);
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "СуммаВключаетНДС");
		Шапка.СуммаВключаетНДС = РеквизитыОснования.СуммаВключаетНДС;
	КонецЕсли;
	
	// Табличная часть
	ИспользуетсяОбратноеНачислениеНДС = ИспользуетсяОбратноеНачислениеНДС();
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров();
	
	Для Каждого Стр Из ДанныеЭД.ТоварнаяЧасть Цикл 
		
		НоменклатураИБ = Стр.Номенклатура;
		НоменклатураКонтрагента = Стр.НоменклатураКонтрагента;
		
		ЭтоУслуга = ЭтоНоменклатураУслуга(НоменклатураИБ.Номенклатура);
		
		Если ЭтоУслуга Тогда 
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.СодержаниеДоИзменения = НоменклатураКонтрагента.Наименование;
			НоваяСтрока.Содержание            = НоменклатураКонтрагента.Наименование;
		Иначе 
			НоваяСтрока = Товары.Добавить();
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = НоменклатураИБ.Номенклатура;
		
		ПредставлениеСтавки = НоменклатураКонтрагента.СтавкаНДС;
		Если МенеджерИнтеграции_ЭтоСтавкаНДСИНА(ПредставлениеСтавки) Тогда
			
			Если ИспользуетсяОбратноеНачислениеНДС Тогда
				
				НоваяСтрока.СтавкаНДС = МенеджерИнтеграции_ОбщаяСтавкаНДС(ШапкаЭД.Дата);
				
				НоваяСтрока.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
					Стр.СуммаБезНДС,
					Ложь,
					УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
				Если ФорматЭД.ЭтоКорректировка Тогда
					
					НоваяСтрока.СуммаНДСДоКорректировки = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
						Стр.СуммаБезНДС_До,
						Ложь,
						УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока.СтавкаНДС = Неопределено;
				НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
				
				Если ФорматЭД.ЭтоКорректировка Тогда
					НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДС_До;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе 
			
			НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
			НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
			
			Если ФорматЭД.ЭтоКорректировка Тогда
				НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДС_До;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока.Количество = Стр.Количество;
		НоваяСтрока.Цена = Стр.Цена;
		НоваяСтрока.Сумма = Стр.СуммаБезНДС;
		
		Если ФорматЭД.ЭтоКорректировка Тогда
			НоваяСтрока.КоличествоДоКорректировки = Стр.Количество_До;
			НоваяСтрока.ЦенаДоКорректировки = Стр.Цена_До;
			НоваяСтрока.СуммаДоКорректировки = Стр.СуммаБезНДС_До;
		КонецЕсли;
		
		Если Шапка.СуммаВключаетНДС Тогда
			
			// Включаем НДС в сумму
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			
			// Пересчитаем цену
			РасчетноеКоличество = ?(НоваяСтрока.Количество = 0, 1, НоваяСтрока.Количество);
			НоваяСтрока.Цена = НоваяСтрока.Сумма / РасчетноеКоличество;
			
		КонецЕсли;
		
		ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, Стр.СведенияОМаркировке, НоменклатураКонтрагента.GTIN);
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "СтранаПроисхождения") Тогда
			НоваяСтрока.СтранаПроисхождения = СтранаПроисхожденияИзСведенийТаможеннойДекларации(Стр.ДанныеГТД);
		КонецЕсли;
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "НомерГТД") Тогда
			НоваяСтрока.НомерГТД = НомерГТДИзСведенийТаможеннойДекларации(Стр.ДанныеГТД);
		КонецЕсли;
		
		Если ИспользуетсяУчетПрослеживаемыхТоваров И НЕ ЭтоУслуга Тогда
			
			Если ФорматЭД.ЭтоКорректировка Тогда
				ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УКД(СведенияПрослеживаемости, Стр.СведенияОПрослеживаемости, НоваяСтрока);
			Иначе
				ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УПД(СведенияПрослеживаемости, Стр.СведенияОПрослеживаемости, НоваяСтрока);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка"	, Шапка);
	ДанныеОбъекта.Вставить("Товары"	, Товары);
	ДанныеОбъекта.Вставить("Услуги"	, Услуги);
	ДанныеОбъекта.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	ДанныеОбъекта.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьКорректировкуПоступления(ДокументОбъект, ДанныеДокумента)
	
	ДанныеЗаполнения = ДанныеДокумента.Шапка;
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, ДанныеЗаполнения);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ЭтоИсправление = (ДанныеЗаполнения.ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Исправление);
	ЕстьДанныеПрослеживаемости = ДанныеДокумента.СведенияПрослеживаемости <> Неопределено;
	
	Если ЭтоИсправление Тогда
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
	Иначе
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	КонецЕсли;
	
	//ДокументОбъект.ЗаполнитьСвойстваШапки();
	
	Если ЭтоИсправление Тогда
		ДокументОбъект.НомерИсправления = ДанныеЗаполнения.НомерИсправления;
		ДокументОбъект.ДатаИсправления = ДанныеЗаполнения.ДатаИсправления;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("НомерИсходногоДокумента")
		И ЗначениеЗаполнено(ДанныеЗаполнения.НомерИсходногоДокумента) Тогда
		ДокументОбъект.НомерИсходногоДокумента = ДанныеЗаполнения.НомерИсходногоДокумента;
		ДокументОбъект.ДатаИсходногоДокумента  = ДанныеЗаполнения.ДатаИсходногоДокумента;
		Если ДанныеЗаполнения.УчитыватьИсправлениеИсходногоДокумента Тогда
			ДокументОбъект.НомерИсправленияИсходногоДокумента = ДанныеЗаполнения.НомерИсправленияИсходногоДокумента;
			ДокументОбъект.ДатаИсправленияИсходногоДокумента  = ДанныеЗаполнения.ДатаИсправленияИсходногоДокумента;
		КонецЕсли;
	КонецЕсли;
	
	ДокументПоступления = ДокументОбъект.ДокументПоступления;
	Если Не ЗначениеЗаполнено(ДокументПоступления) И ДанныеЗаполнения.Свойство("Основание") Тогда
		ДокументПоступления = ДанныеЗаполнения.Основание;
	КонецЕсли;
	
	// Заполним корректировку поступления данными основания
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда
		ДокументОбъект.Заполнить(ДокументПоступления);
	КонецЕсли;
	
	// Заполним табличные части данными корректировки
	ИменаТЧСтрокой = "Товары, Услуги";
	ИменаТЧ = Новый Массив;
	ИменаТЧ.Добавить("Товары");
	ИменаТЧ.Добавить("Услуги");
	
	РеквизитыТабличнойЧастиДляПерезаполнения = Новый Структура(ИменаТЧСтрокой);
	РеквизитыТабличнойЧастиДляПерезаполнения.Товары = "Количество, Цена, Сумма, СуммаНДС, НомерГТД, СтранаПроисхождения";
	РеквизитыТабличнойЧастиДляПерезаполнения.Услуги = "Количество, Цена, Сумма, СуммаНДС, Содержание";
	
	РеквизитыТабличнойЧастиДляЗаполненияНовойСтроки = Новый Структура(ИменаТЧСтрокой);
	
	Если ЭтоИсправление Тогда 
		РеквизитыТабличнойЧастиДляЗаполненияНовойСтроки.Товары = "";
		РеквизитыТабличнойЧастиДляЗаполненияНовойСтроки.Услуги = "";
	Иначе 
		РеквизитыТабличнойЧастиДляЗаполненияНовойСтроки.Товары = "КоличествоДоИзменения, ЦенаДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения, НомерГТДДоИзменения, СтранаПроисхожденияДоИзменения";
		РеквизитыТабличнойЧастиДляЗаполненияНовойСтроки.Услуги = "КоличествоДоИзменения, ЦенаДоИзменения, СуммаДоИзменения, СуммаНДСДоИзменения, СодержаниеДоИзменения";
	КонецЕсли;
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		
		ИмяТЧ = СокрЛП(ИмяТЧ);
		
		СтруктураПоиска = Новый Структура("Номенклатура, СтавкаНДС");
		
		Для Каждого СтрокаДокумента Из ДокументОбъект[ИмяТЧ] Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
			РезультатПоискаДанныхЗаполнения = ДанныеДокумента[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
			
			Если РезультатПоискаДанныхЗаполнения.Количество() > 0 Тогда
				
				СтрокаДанныхЗаполнения = РезультатПоискаДанныхЗаполнения[0];
				ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаДанныхЗаполнения, РеквизитыТабличнойЧастиДляПерезаполнения[ИмяТЧ]);
				
				Если ИмяТЧ = "Товары" И ЕстьДанныеПрослеживаемости Тогда
					
					ОбновитьИдентификаторыСтрокПрослеживаемости(ДанныеДокумента, СтрокаДанныхЗаполнения.ИдентификаторСтроки, СтрокаДокумента.ИдентификаторСтроки);
					
					// В регламенте УКД нет данных о стране происхождения, поэтому заполним данными документа поступления.
					Если НЕ ЗначениеЗаполнено(СтрокаДокумента.СтранаПроисхождения) Тогда
						СтрокаДокумента.СтранаПроисхождения = СтрокаДокумента.СтранаПроисхожденияДоИзменения;
					КонецЕсли;
					
				КонецЕсли;
				
				// Удалим обработанную строку из данных заполнения
				ДанныеДокумента[ИмяТЧ].Удалить(СтрокаДанныхЗаполнения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Добавим новые строки в документ
		Если ДанныеДокумента[ИмяТЧ].Количество() > 0 Тогда
			
			Для Каждого СтрокаДанныхЗаполнения Из ДанныеДокумента[ИмяТЧ] Цикл
				
				НоваяСтрока = ДокументОбъект[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхЗаполнения, , РеквизитыТабличнойЧастиДляЗаполненияНовойСтроки[ИмяТЧ]);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеДокумента.Свойство("ШтрихкодыУпаковок")
		И ЕстьШтрихкодыУпаковок(ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДокумента.ШтрихкодыУпаковок);
	КонецЕсли;
	
	Если ЕстьДанныеПрослеживаемости Тогда
		
		ЗаполнитьСведенияОПрослеживаемостиВходящегоКорректировочногоДокумента(
					ДокументОбъект.СведенияПрослеживаемости, 
					ДанныеДокумента.СведенияПрослеживаемости, 
					ДокументОбъект.Товары);
					
	КонецЕсли;
	
	ЗаполнитьСчетаУчетаПередЗаписьюДокумента(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

// Конструктор дополнительных параметров заполнения документа учета.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ОбщиеПараметрыЗаполненияДокументовУчета()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ПерезаполнениеЗначенийРеквизитовШапки(ТекущийОбъект, ДанныеЗаполнения)
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ОбъектМетаданных = ТекущийОбъект.Метаданные();
	
	Для Каждого Строка Из ДанныеЗаполнения Цикл
		
		Если ЗначениеЗаполнено(Строка.Ключ) И ЕстьРеквизитМетаданных(ОбъектМетаданных, Строка.Ключ) Тогда
			Если ТекущийОбъект[Строка.Ключ] <> Строка.Значение Тогда
				ТекущийОбъект[Строка.Ключ] = Строка.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСчетаУчетаПередЗаписьюДокумента(ДокументОбъект)
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью", Истина);
	СчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ДокументОбъект, РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

Процедура ЗаполнитьЦенуСуммуПоСтроке(СтрокаТЧ, СтрокаЭД, ЦенаВключаетНДС)
	
	Если ЦенаВключаетНДС Тогда
		СтрокаТЧ.Сумма = СтрокаЭД.СуммаСНДС;
	Иначе
		СтрокаТЧ.Сумма = СтрокаЭД.СуммаБезНДС;
	КонецЕсли;
	
	ЕстьЦенаКоличество = ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаТЧ, "Количество");
	
	// В некоторых табличных частях ПТУ количество и цена отсутствуют
	Если Не ЕстьЦенаКоличество Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.Цена = СтрокаЭД.Цена;
	СтрокаТЧ.Количество = СтрокаЭД.Количество;
	
	Если Не ЦенаВключаетНДС Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТЧ.Количество = 0 Тогда
		СтрокаТЧ.Цена = 0;
	Иначе
		СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
	КонецЕсли;
	
КонецПроцедуры

// Находит ссылку на элемент справочника номеров ГТД по номеру таможенной декларации.
// Если подходящий элемент не найден, будет создан новый. Для заполнения его реквизитов
// будут использованы данные из номера таможенной декларации.
//
// Параметры:
//  НомерТаможеннойДекларации - Строка - номер таможенной декларации.
// 
// Возвращаемое значение:
//  СправочникСсылка.НомераГТД - если номер таможенной декларации не пустой;
//  Неопределено - если не указан номер таможенной декларации.
//
Функция НайтиСоздатьНомерГТД(НомерТаможеннойДекларации)
	
	Если Не ЗначениеЗаполнено(НомерТаможеннойДекларации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Ссылка = Справочники.НомераГТД.НайтиПоКоду(НомерТаможеннойДекларации);
	
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		
		Результат = Ссылка;
		
	Иначе
		
		Объект = Справочники.НомераГТД.СоздатьЭлемент();
		Объект.Код = НомерТаможеннойДекларации;
		Объект.Комментарий = НСтр("ru = 'Загружен из Диадок'");
		
		Объект.Записать();
		
		Результат = Объект.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на элемент справочника номеров ГТД, код которого
// соответствует первому номеру таможенной декларации из коллекции
// таможенных деклараций.
//
// Параметры:
//  ДанныеГТД - Массив - содержит структуры с ключами:
//    * СтранаПроисхождения - Структура - см. НовыйКлючевыеСвойстваСтранаМира;
//    * НомерГТД - Структура - см. НовыйКлючевыеСвойстваНомерГТД;
// 
// Возвращаемое значение:
//  СправочникСсылка.НомераГТД - если заполнены сведения грузовой таможенной декларации.
//  Неопределено - если не заполнены данные ГТД.
//
Функция НомерГТДИзСведенийТаможеннойДекларации(ДанныеГТД)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеГТД) Тогда
		
		Результат = ДанныеГТД[0].НомерГТД.Ссылка;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = НайтиСоздатьНомерГТД(ДанныеГТД[0].НомерГТД.РегистрационныйНомер);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомерГТДИзСведенийПрослеживаемости(РегистрационныйНомер)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		Результат = НайтиСоздатьНомерГТД(РегистрационныйНомер);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на страну мира, код которой соответствует коду из
// первого элемента коллекции сведений грузовой таможенной декларации.
//
// Параметры:
//  ДанныеГТД - Массив - содержит структуры с ключами:
//    * СтранаПроисхождения - Структура - см. НовыйКлючевыеСвойстваСтранаМира;
//    * НомерГТД - Структура - см. НовыйКлючевыеСвойстваНомерГТД;
//
// Возвращаемое значение:
//  СправочникСсылка.СтраныМира - если заполнены сведения грузовой таможенной декларации.
//  Неопределено - если не заполнены данные ГТД.
//
Функция СтранаПроисхожденияИзСведенийТаможеннойДекларации(ДанныеГТД)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеГТД) Тогда
		
		Результат = ДанныеГТД[0].СтранаПроисхождения.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОсновнойДоговорКонтрагента(Объект, Организация, Контрагент, Валюта = Неопределено)
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		// Не заполнены ключевые свойства
		// В этом случае ничего не делаем.
		Возврат Результат;
	КонецЕсли;
	
	ГоловнаяОрганизация = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация);
	
	// Найдем договор по умолчанию для данного вида договора
	ДополнительныеПараметры = Новый Структура();
	Если ЗначениеЗаполнено(Валюта) Тогда
		ДополнительныеПараметры.Вставить("ВалютаВзаиморасчетов", Новый Структура("ЗначениеОтбора", Валюта));
	КонецЕсли;
	
	ВидДоговора = РаботаСДоговорамиКонтрагентовБП.ВидДоговораПоОбъекту(Объект);
	ВидыДоговоров = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидДоговора);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Результат, Контрагент, ГоловнаяОрганизация, ВидыДоговоров, ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

Функция ОснованияКорректировкиПоступления(ИзвестныеЗначения)
	
	Результат = Новый Массив;
	
	ЗначенияПолейПоиска = Новый Структура;
	ЗначенияПолейПоиска.Вставить("Организация"	, ИзвестныеЗначения.Организация);
	ЗначенияПолейПоиска.Вставить("Контрагент"	, ИзвестныеЗначения.Контрагент);
	ЗначенияПолейПоиска.Вставить("НомерВходящегоДокумента"	, ИзвестныеЗначения.Номер);
	ЗначенияПолейПоиска.Вставить("ДатаВходящегоДокумента"	, ИзвестныеЗначения.Дата);
	
	ТипыОснованийКорректировки = Метаданные.Документы.КорректировкаПоступления.Реквизиты.ДокументПоступления.Тип.Типы();
	
	Для Каждого ТипОснования Из ТипыОснованийКорректировки Цикл 
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипОснования);
		
		ЕстьРеквизитыПоиска = Истина;
		Для Каждого Поле Из ЗначенияПолейПоиска Цикл 
			
			Если Не ЕстьРеквизитМетаданных(ОбъектМетаданных, Поле.Ключ) Тогда 
				ЕстьРеквизитыПоиска = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьРеквизитыПоиска Тогда 
			Продолжить;
		КонецЕсли;
		
		НайденныйДокумент = СсылкаОбъектаПоПолямПоиска(ЗначенияПолейПоиска, ОбъектМетаданных);
		
		Если ЗначениеЗаполнено(НайденныйДокумент) Тогда 
			Результат.Добавить(НайденныйДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНоменклатураУслуга(Номенклатура)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Услуга");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита)
	
	Результат = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаНаУчастникаСделки(СвойстваИлиМассив)
	
	Результат = МетодСервера(
		"Модуль_ИнтеграцияУниверсальный",
		"СсылкаНаУчастникаЭДО",
		СвойстваИлиМассив
	);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяУчетПрослеживаемыхТоваров()
	
	Результат = Ложь;
	
	ЕстьПрослеживаемостьВКонфигурации = МетодСервера(, "СуществуетОбъектМетаданных", "ФункциональнаяОпция.ВестиУчетПрослеживаемыхТоваров");
	Если ЕстьПрослеживаемостьВКонфигурации Тогда
		
		Результат = ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВТабличнойЧастиЭДЕстьСведенияПрослеживаемости(СтрокаТЧ)
	
	Результат = СтрокаТЧ.СведенияОПрослеживаемости <> Неопределено
				И СтрокаТЧ.СведенияОПрослеживаемости.Количество() > 0;
				
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область Прослеживаемость_Создание

Функция НоваяТаблицаСведенияПрослеживаемостиДокументаИБ(ПустаяСсылкаНаДокумент, ДляУКД = Ложь)
	
	Результат = Неопределено;
		
	Если ЕстьМетаданныеСведенияПрослеживаемости(ПустаяСсылкаНаДокумент.Метаданные()) Тогда
		Результат = ПустаяСсылкаНаДокумент.СведенияПрослеживаемости.ВыгрузитьКолонки();
		
		Если ДляУКД Тогда
			ОписаниеЧисло	 = Новый ОписаниеТипов("Число");
			Результат.Колонки.Добавить("КоличествоУвеличение", ОписаниеЧисло);
			Результат.Колонки.Добавить("КоличествоУменьшение", ОписаниеЧисло);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет СведенияОПрослеживаемости документа по данным строки товара электронного документа
// Аналог ОбменСконтрагентамиБП.ЗаполнитьСведенияОПрослеживаемостиВДокументеИБ_УКД()
//
// Параметры
//  Приемник				- ТабличнаяЧасть		- таблица СведенияОПрослеживаемости документа 1С
//  Источник				- ТаблицаЗначений		- см ПрочитатьСвойства_СведенияОПрослеживаемостиКорректировочногоДокумента()
//  Товары 					- ТаблицаЗначений	 	- таблица товаров документа
//
Процедура ЗаполнитьСведенияОПрослеживаемостиВходящегоКорректировочногоДокумента(Приемник, Источник, Товары)

	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Приемник.ВыгрузитьКолонки();

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СведПрослежИБ", Приемник.Выгрузить());
	Запрос.УстановитьПараметр("СведПрослежЭД", Источник);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ КАК РНПТ,
		|	СведПрослежИБ.Количество КАК Количество,
		|	СведПрослежИБ.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ КАК ЭтоСтрокаСИсходнымиРНПТ
		|ПОМЕСТИТЬ СведПрослежИБ
		|ИЗ
		|	&СведПрослежИБ КАК СведПрослежИБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежЭД.КоличествоУвеличение КАК КоличествоУвеличение,
		|	СведПрослежЭД.КоличествоУменьшение КАК КоличествоУменьшение,
		|	СведПрослежЭД.РНПТ КАК РНПТ,
		|	СведПрослежЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СведПрослежЭД.ЭтоСтрокаСИсходнымиРНПТ КАК ЭтоСтрокаСИсходнымиРНПТ
		|ПОМЕСТИТЬ СведПрослежЭД
		|ИЗ
		|	&СведПрослежЭД КАК СведПрослежЭД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ КАК РНПТ,
		|	СведПрослежИБ.КоличествоПрослеживаемости - СведПрослежЭД.КоличествоУменьшение + СведПрослежЭД.КоличествоУвеличение КАК КоличествоПрослеживаемости,
		|	СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ КАК ЭтоСтрокаСИсходнымиРНПТ
		|ПОМЕСТИТЬ СкорректированныеСтрокиПоДаннымЭД
		|ИЗ
		|	СведПрослежИБ КАК СведПрослежИБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СведПрослежЭД КАК СведПрослежЭД
		|		ПО СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки
		|			И СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ
		|ГДЕ
		|	СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ,
		|	СведПрослежИБ.КоличествоПрослеживаемости,
		|	СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ
		|ИЗ
		|	СведПрослежИБ КАК СведПрослежИБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведПрослежЭД КАК СведПрослежЭД
		|		ПО СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки
		|			И СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ
		|ГДЕ
		|	СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ = ЛОЖЬ
		|	И СведПрослежЭД.ИдентификаторСтроки ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежЭД.РНПТ КАК РНПТ,
		|	СведПрослежЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СведПрослежЭД.ЭтоСтрокаСИсходнымиРНПТ КАК ЭтоСтрокаСИсходнымиРНПТ
		|ПОМЕСТИТЬ НовыеСтрокиПоДаннымЭД
		|ИЗ
		|	СведПрослежЭД КАК СведПрослежЭД
		|		ЛЕВОЕ СОЕДИНЕНИЕ СведПрослежИБ КАК СведПрослежИБ
		|		ПО (СведПрослежИБ.ИдентификаторСтроки = СведПрослежЭД.ИдентификаторСтроки)
		|			И (СведПрослежИБ.РНПТ = СведПрослежЭД.РНПТ)
		|			И (СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ = ЛОЖЬ)
		|ГДЕ
		|	СведПрослежИБ.РНПТ ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведПрослежИБ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведПрослежИБ.РНПТ КАК РНПТ,
		|	СведПрослежИБ.Количество КАК Количество,
		|	СведПрослежИБ.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ КАК ЭтоСтрокаСИсходнымиРНПТ
		|ИЗ
		|	СведПрослежИБ КАК СведПрослежИБ
		|ГДЕ
		|	СведПрослежИБ.ЭтоСтрокаСИсходнымиРНПТ = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СкорректированныеСтрокиПоДаннымЭД.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СкорректированныеСтрокиПоДаннымЭД.РНПТ КАК РНПТ,
		|	0 КАК Количество,
		|	СкорректированныеСтрокиПоДаннымЭД.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СкорректированныеСтрокиПоДаннымЭД.ЭтоСтрокаСИсходнымиРНПТ КАК ЭтоСтрокаСИсходнымиРНПТ
		|ИЗ
		|	СкорректированныеСтрокиПоДаннымЭД КАК СкорректированныеСтрокиПоДаннымЭД
		|ГДЕ
		|	СкорректированныеСтрокиПоДаннымЭД.КоличествоПрослеживаемости <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НовыеСтрокиПоДаннымЭД.ИдентификаторСтроки,
		|	НовыеСтрокиПоДаннымЭД.РНПТ,
		|	0,
		|	НовыеСтрокиПоДаннымЭД.КоличествоПрослеживаемости,
		|	НовыеСтрокиПоДаннымЭД.ЭтоСтрокаСИсходнымиРНПТ
		|ИЗ
		|	НовыеСтрокиПоДаннымЭД КАК НовыеСтрокиПоДаннымЭД
		|ИТОГИ ПО
		|	ИдентификаторСтроки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаИдентификаторСтроки = РезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификаторСтроки.Следующий() Цикл
		
		СведенияПрослеживаемости = Результат.СкопироватьКолонки();
		
		Выборка = ВыборкаИдентификаторСтроки.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СведенияПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
		СтрокиТоваров = Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаИдентификаторСтроки.ИдентификаторСтроки));
		Для каждого СтрокаТовара Из СтрокиТоваров Цикл
			СтрокаТовара.ПрослеживаемыйТовар = Истина;
		КонецЦикла;
		
		ПроизвестиРассчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, СтрокиТоваров[0].Количество);
		ДополнитьТаблицу(Результат, СведенияПрослеживаемости);
		
		
	КонецЦикла;
	
	СведенияПрослеживаемостиИБСИсходнымиРНПТ = РезультатЗапроса[4].Выгрузить();
	ДополнитьТаблицу(Результат, СведенияПрослеживаемостиИБСИсходнымиРНПТ);
	
	Приемник.Загрузить(Результат);
	
КонецПроцедуры

// Дополняет таблицу прослеживаемости данными ЭД для переданной строки товара
//
// Параметры
//  Приемник					- ТаблицаЗначений			- см НоваяТаблицаСведенияПрослеживаемости()
//  ДанныеЭД					- Массив	 				- массив структур, СведенияОПрослеживаемости электронного документа
//  СтрокаТовары				- СтрокаТаблицыЗначений		- старый ИдентификаторСтроки
//
Процедура ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УКД(Приемник, ДанныеЭД, СтрокаТовары)
	
	СтрокаТовары.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	
	СведенияПрослеживаемости = Приемник.СкопироватьКолонки();
	Для Каждого СтрокаДанных Из ДанныеЭД Цикл
		СтрокаПрослеживаемости = СведенияПрослеживаемости.Добавить();
		СтрокаПрослеживаемости.РНПТ							= НомерГТДИзСведенийПрослеживаемости(СтрокаДанных.НомерГТДРегистрационныйНомер);
		СтрокаПрослеживаемости.КоличествоПрослеживаемости	= СтрокаДанных.КоличествоПослеИзменения;
		СтрокаПрослеживаемости.КоличествоУвеличение			= СтрокаДанных.КоличествоУвеличение;
		СтрокаПрослеживаемости.КоличествоУменьшение			= СтрокаДанных.КоличествоУменьшение;
		СтрокаПрослеживаемости.ИдентификаторСтроки			= СтрокаТовары.ИдентификаторСтроки;
	КонецЦикла;
	
	ДополнитьТаблицу(Приемник, СведенияПрослеживаемости);
	
КонецПроцедуры

// Дополняет таблицу прослеживаемости данными ЭД для переданной строки товара
//
// Параметры
//  Приемник					- ТаблицаЗначений			- см НоваяТаблицаСведенияПрослеживаемости()
//  ДанныеЭД 					- Массив	 				- массив структур, СведенияОПрослеживаемости электронного документа
//  СтрокаТовары				- СтрокаТаблицыЗначений		- старый ИдентификаторСтроки
//
Процедура ПодготовитьСведенияОПрослеживаемостиДляДокументаИБ_УПД(Приемник, ДанныеЭД, СтрокаТовары)
	
	Если Приемник = Неопределено
		Или ДанныеЭД.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.ИдентификаторСтроки) Тогда
		ИдентификаторСтроки = СтрокаТовары.ИдентификаторСтроки;
	Иначе
		ИдентификаторСтроки = Новый УникальныйИдентификатор;
		СтрокаТовары.ИдентификаторСтроки = ИдентификаторСтроки;
	КонецЕсли;
	
	СтрокаТовары.ПрослеживаемыйТовар = Истина;
	
	СведенияПрослеживаемости = Приемник.СкопироватьКолонки();
	
	Для Каждого ЭлементИсточника Из ДанныеЭД Цикл
				
		НоваяПрослеживаемость = СведенияПрослеживаемости.Добавить();
		
		НоваяПрослеживаемость.ИдентификаторСтроки 			= ИдентификаторСтроки;
		НоваяПрослеживаемость.РНПТ 							= НомерГТДИзСведенийПрослеживаемости(ЭлементИсточника.НомерГТДРегистрационныйНомер);
		НоваяПрослеживаемость.КоличествоПрослеживаемости 	= ЭлементИсточника.КоличествоПоРНПТ;
		НоваяПрослеживаемость.Сумма						 	= ЭлементИсточника.СтоимостьБезНДСПрослеживаемости;
		                                                                       
	КонецЦикла;
	
	ПроизвестиРассчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, СтрокаТовары.Количество);
	
	ДополнитьТаблицу(Приемник, СведенияПрослеживаемости);
	
КонецПроцедуры

Процедура ПроизвестиРассчетУчетногоКоличестваПрослеживаемогоТовара(СведенияПрослеживаемости, КоличествоТовара)
	
	// Обрабатываем по аналогии с типовой БП.
	// Возможные варианты:
	
	// 1. Учетное количество было заполнено из данных электронного документа. Рассчитывать не нужно.
	// Данный сценарий на текущий момент не поддерживается.
	Если СведенияПрослеживаемости.Итог("Количество") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоКоличествоПрослеживаемости = СведенияПрослеживаемости.Итог("КоличествоПрослеживаемости");
	
	// 2. Если общее количество прослеживаемости совпадает с количеством товара, то предполагаем, что единица измерения прослеживаемости совпадает
	// с учетной единицей измерения. В этом случае количество учетное приравниваем количеству прослеживаемости.
	Если ВсегоКоличествоПрослеживаемости = КоличествоТовара Тогда
		Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
			ЭлементКоллекции.Количество = ЭлементКоллекции.КоличествоПрослеживаемости;
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	// 3. Требуется произвести пропорциональное распределение
	СведенияПрослеживаемости.Колонки.Добавить("Порядок");
	
	Порядок = 0;
	Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
		Порядок = Порядок + 1;
		ЭлементКоллекции.Порядок = Порядок;
	КонецЦикла;
	
	СведенияПрослеживаемости.Сортировать("КоличествоПрослеживаемости");
	Распределено = 0;
	Для Каждого ЭлементКоллекции Из СведенияПрослеживаемости Цикл
		Если СведенияПрослеживаемости.Индекс(ЭлементКоллекции) + 1 = СведенияПрослеживаемости.Количество() Тогда
			ЭлементКоллекции.Количество = КоличествоТовара - Распределено;
		Иначе 
			ЭлементКоллекции.Количество = ?(ВсегоКоличествоПрослеживаемости = 0, 0,
				ЭлементКоллекции.КоличествоПрослеживаемости * КоличествоТовара / ВсегоКоличествоПрослеживаемости);
			Распределено = Распределено + ЭлементКоллекции.Количество;
		КонецЕсли;
	КонецЦикла;
	
	СведенияПрослеживаемости.Сортировать("Порядок");
		
КонецПроцедуры

// Обновляет ИдентификаторСтроки в ДанныеДокумента и ДанныеДокумента.СведенияПрослеживаемости
// Для корректной связи при перезаполнение ИдентификаторСтроки по дпнным исходной строки корректировки
//
// Параметры
//  ДанныеДокумента			- Структура		- строка ДанныеЗаполнения.Товары
//  СтарыйИДСтроки			- Строка		- старый ИдентификаторСтроки
//  НовыйИДСтроки 			- Строка	 	- новый ИдентификаторСтроки
//
Процедура ОбновитьИдентификаторыСтрокПрослеживаемости(ДанныеДокумента, СтарыйИДСтроки, НовыйИДСтроки)
	
	Если СтарыйИДСтроки <> НовыйИДСтроки Тогда
	
		Если ДанныеДокумента.Свойство("СведенияПрослеживаемости")
			И ДанныеДокумента.СведенияПрослеживаемости <> Неопределено Тогда
			
			Отбор = Новый Структура("ИдентификаторСтроки", СтарыйИДСтроки);
			
			СтрокиСоСтарымИД = ДанныеДокумента.СведенияПрослеживаемости.НайтиСтроки(Отбор);
			Для каждого СтрокаСоСтарымИД Из СтрокиСоСтарымИД Цикл
				СтрокаСоСтарымИД.ИдентификаторСтроки = НовыйИДСтроки;
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 
#Область Прослеживаемость_Отправка

Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(ТаблицаТоваров, СсылкаНаОбъект)
	
	Если НЕ ИспользуетсяУчетПрослеживаемыхТоваров()
		ИЛИ НЕ МожноЗаполнитьПрослеживаемость(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТоваров.Колонки.Добавить("ДанныеПрослеживаемости");
	ТаблицаТоваров.Колонки.Добавить("ПрослеживаемыйТовар");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТТаблицаПрослеживаемостиОснования
	|ИЗ
	|	&ИмяМетаданныхТаблицыПрослеживаемости КАК СведенияПрослеживаемости
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка
	|	И СведенияПрослеживаемости.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|	И &ДопУсловиеТаблицыПрослеживаемости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Ссылка, &ПустойНомерГТД) = &ПустойНомерГТД
	|			ТОГДА """"
	|		ИНАЧЕ НомераГТД.Код
	|	КОНЕЦ КАК НомерГТДРегистрационныйНомер,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПоРНПТ,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	&ИмяМетаданныхНоменклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТСведенияПрослеживаемостиБезИЕ
	|ИЗ
	|	&ИмяМетаданныхТаблицыТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаПрослеживаемостиОснования КАК СведенияПрослеживаемости
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|			ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
	|		ПО ТаблицаТоваров.Ссылка = СведенияПрослеживаемости.Ссылка
	|			И ТаблицаТоваров.ИдентификаторСтроки = СведенияПрослеживаемости.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.ИдентификаторСтроки В(&ИдентификаторыСтрок)
	|	И ТаблицаТоваров.ИдентификаторСтроки <> """"
	|	И ТаблицаТоваров.ПрослеживаемыйТовар = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерГТДРегистрационныйНомер КАК НомерГТДРегистрационныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, &ПустаяЕИ) = &ПустаяЕИ
	|			ТОГДА ""шт""
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияПрослеживаемости,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, &ПустаяЕИ) = &ПустаяЕИ
	|			ТОГДА ""796""
	|		ИНАЧЕ КлассификаторЕдиницИзмерения.Код
	|	КОНЕЦ КАК КодЕдиницыИзмеренияПрослеживаемости,
	|	ТаблицаТоваров.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТСведенияПрослеживаемости
	|ИЗ
	|	ВТСведенияПрослеживаемостиБезИЕ КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|				ПО КлассификаторТНВЭД.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|			ПО СправочникНоменклатура.КодТНВЭД = КлассификаторТНВЭД.Ссылка
	|		ПО ТаблицаТоваров.Номенклатура = СправочникНоменклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСведенияПрослеживаемости.НомерГТДРегистрационныйНомер КАК НомерГТДРегистрационныйНомер,
	|	ВТСведенияПрослеживаемости.ЕдиницаИзмеренияПрослеживаемости КАК ЕдиницаИзмеренияПрослеживаемости,
	|	ВТСведенияПрослеживаемости.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ВТСведенияПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости КАК КодЕдиницыИзмеренияПрослеживаемости,
	|	ВТСведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТСведенияПрослеживаемости КАК ВТСведенияПрослеживаемости";
	
	ИмяДокумента = СсылкаНаОбъект.Метаданные().Имя;
	
	Если ЭтоПередачаОС(СсылкаНаОбъект) Тогда
		ИмяМетаданныхТаблицыТоваров	= "Документ.ПередачаОС.ОС";
		ИмяМетаданныхНоменклатура	= "ТаблицаТоваров.ОсновноеСредство";
		ИмяТабличнойЧасти			= "ОС";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Номенклатура"	, "Справочник.ОсновныеСредства"); //для условия связи в 3 таблице
	Иначе
		ИмяМетаданныхТаблицыТоваров	= СтрЗаменить("Документ.%ИмяДокумента%.Товары", "%ИмяДокумента%", ИмяДокумента);
		ИмяМетаданныхНоменклатура	= "ТаблицаТоваров.Номенклатура";
		ИмяТабличнойЧасти			= "Товары";
	КонецЕсли;
	
	ИмяМетаданныхТаблицыПрослеживаемости = СтрЗаменить("Документ.%ИмяДокумента%.СведенияПрослеживаемости", "%ИмяДокумента%", ИмяДокумента);
	
	ДопУсловиеТаблицыПрослеживаемости = "Истина";
	Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ." + ИмяДокумента + ".ТабличнаяЧасть.СведенияПрослеживаемости.Реквизит.ЭтоСтрокаСИсходнымиРНПТ") Тогда
		ДопУсловиеТаблицыПрослеживаемости = ДопУсловиеТаблицыПрослеживаемости + " И СведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ = Ложь"; 	
	КонецЕсли;	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловиеТаблицыПрослеживаемости"		, ДопУсловиеТаблицыПрослеживаемости);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхТаблицыТоваров"				, ИмяМетаданныхТаблицыТоваров);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхТаблицыПрослеживаемости"	, ИмяМетаданныхТаблицыПрослеживаемости);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяМетаданныхНоменклатура"				, ИмяМетаданныхНоменклатура);
	
	СтрокиТоваров		 = ТаблицаТоваров.НайтиСтроки(Новый Структура("ИмяТабличнойЧасти, ЭтоУслуга", ИмяТабличнойЧасти, Ложь)); 
	ИдентификаторыСтрок	 = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиТоваров, "ИдентификаторСтроки");
	
	Запрос.УстановитьПараметр("ПустаяЕИ"			 , Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойНомерГТД"		 , Справочники.НомераГТД.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка"				 , СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИдентификаторыСтрок"	 , ИдентификаторыСтрок);
	
	СведенияПрослеживаемости = Запрос.Выполнить().Выгрузить();
	СведенияПрослеживаемости.Индексы.Добавить("ИдентификаторСтроки");
	
	Для Каждого СтрокаТЧ Из СтрокиТоваров Цикл
		
		СтрокиПрослеживаемости = СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки));
		
		Если СтрокиПрослеживаемости.Количество() > 0 Тогда
			
			СтрокаТЧ.ДанныеПрослеживаемости	 = Новый Массив;
			СтрокаТЧ.ПрослеживаемыйТовар	 = Истина;
			
			Для каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
				
				ЭлементПрослеживаемости = НовыеСвойстваЭлементаПрослеживаемости();
				ЗаполнитьЗначенияСвойств(ЭлементПрослеживаемости, СтрокаПрослеживаемости);
				СтрокаТЧ.ДанныеПрослеживаемости.Добавить(ЭлементПрослеживаемости);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизит ДанныеПрослеживаемости и ПрослеживаемыйТовар в СтрокаТовары
//
// Параметры
//  СтрокаТовары	- СтрокаТаблицыЗначенй	 	- см. ИнициализацияТаблицыСтрокТовары()
//  Источник		- СтрокаТаблицыЗначенй	
//  СведенияОПрослеживаемости	- ТаблицаЗначений	
//
Процедура ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(СтрокаТовары, Источник, СведенияОПрослеживаемости)
	
	Если СведенияОПрослеживаемости.Колонки.Найти("ИдентификаторСтроки") = Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Товар"							, Источник.Номенклатура);
		Отбор.Вставить("СтранаПроисхождения"			, Источник.СтранаПроисхождения);
		Отбор.Вставить("НаименованиеЕдиницыИзмерения"	, Источник.ЕдиницаИзмерения);
		Отбор.Вставить("ЦенаДоИзменения"				, Источник.ЦенаДоИзменения);
		Отбор.Вставить("ЦенаПослеИзменения"				, Источник.ЦенаПослеИзменения);
		Отбор.Вставить("СтавкаНДСПослеИзменения"		, Источник.СтавкаНДСПослеИзменения);
		
	Иначе
		
		Отбор = Новый Структура("ИдентификаторСтроки", Источник.ИдентификаторСтроки);
		
	КонецЕсли;
	
	СтрокиПрослеживаемости = СведенияОПрослеживаемости.НайтиСтроки(Отбор);
	
	Если СтрокиПрослеживаемости.Количество() Тогда
		
		СтрокаТовары.ДанныеПрослеживаемости	 = Новый Массив;
		СтрокаТовары.ПрослеживаемыйТовар	 = Истина;
		
		Для каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
			
			ЭлементПрослеживаемости = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваЭлементаПрослеживаемостиПоКорректировке");
			
			ЭлементПрослеживаемости.НомерГТДРегистрационныйНомер		 = СтрокаПрослеживаемости.НомерТовара;
			ЭлементПрослеживаемости.КодЕдиницыИзмеренияПрослеживаемости	 = СтрокаПрослеживаемости.ЕдиницаИзмеренияПрослеживаемостиКод;
			ЭлементПрослеживаемости.КоличествоДоИзменения				 = СтрокаПрослеживаемости.КоличествоТовараДоИзменения;
			ЭлементПрослеживаемости.КоличествоПослеИзменения			 = СтрокаПрослеживаемости.КоличествоТовараПослеИзменения;
			
			ЭтоУменьшение = ЭлементПрослеживаемости.КоличествоДоИзменения > ЭлементПрослеживаемости.КоличествоПослеИзменения; 
			Если ЭтоУменьшение Тогда
				КоличествоУменьшение = ЭлементПрослеживаемости.КоличествоДоИзменения - ЭлементПрослеживаемости.КоличествоПослеИзменения;
				ЭлементПрослеживаемости.КоличествоУменьшение = КоличествоУменьшение;
			КонецЕсли; 
			
			ЭтоУвеличение = ЭлементПрослеживаемости.КоличествоПослеИзменения > ЭлементПрослеживаемости.КоличествоДоИзменения;
			Если ЭтоУвеличение Тогда
				КоличествоУвеличение = ЭлементПрослеживаемости.КоличествоПослеИзменения - ЭлементПрослеживаемости.КоличествоДоИзменения;
				ЭлементПрослеживаемости.КоличествоУвеличение = КоличествоУвеличение;
			КонецЕсли;
			
			СтрокаТовары.ДанныеПрослеживаемости.Добавить(ЭлементПрослеживаемости);
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Функция МожноЗаполнитьПрослеживаемость(СсылкаНаОбъект)
	
	ПоддерживаемыеТипы = Новый Массив;
	ПоддерживаемыеТипы.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ПоддерживаемыеТипы.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ПоддерживаемыеТипы.Добавить(Тип("ДокументСсылка.ПередачаОС"));
	ПоддерживаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	ПоддерживаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	
	Результат = ПоддерживаемыеТипы.Найти(ТипЗнч(СсылкаНаОбъект)) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Процедура ДополнитьНомерЦифровымИндексомОП(ДатаНомер, ЦифровойИндексОП, СсылкаНаОбъект)
		
	Если ЭтоСчетФактура(СсылкаНаОбъект) Тогда
		МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьНомерЦифровымИндексомОП", ДатаНомер, ЦифровойИндексОП);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОберткиДляВызоваУниверсальныхМетодов

Функция ДанныеШапки(Ссылка)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеШапки", Ссылка);
	
КонецФункции

Функция ДанныеТабличныхЧастей(Шапка) 
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеТабличныхЧастей", Шапка);
	
КонецФункции

Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьРеквизитМетаданных", ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты);
	
КонецФункции

Функция СкопироватьСтруктуру(Знач СтруктураИсходник)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "СкопироватьСтруктуру", СтруктураИсходник);
	
КонецФункции

Процедура ДополнитьТаблицу(ТаблицаПриемник, ТаблицаИсточник)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьТаблицу", ТаблицаПриемник, ТаблицаИсточник);
	
КонецПроцедуры

Функция РеквизитыЮрФизЛица(ЮрФизЛицо, Период = '00010101', Знач БанковскийСчет = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "РеквизитыЮрФизЛица", ЮрФизЛицо, Период, БанковскийСчет);
	
КонецФункции

Функция ПредставлениеЮрФизЛица(Реквизиты, ШаблонПредставления = "", СПрефиксом = Истина)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеЮрФизЛица", Реквизиты, ШаблонПредставления, СПрефиксом);
	
КонецФункции

Функция ИмяКолонкиКодТовара()
	
	ЗначениеКонстанты = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	Если ЗначениеКонстанты = ПредопределенноеЗначение("Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул") Тогда
		Результат = "Артикул";
	Иначе
		Результат = "Код";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти", Шапка, ТабличнаяЧасть);
	
КонецПроцедуры

Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеНоменклатуры", Номенклатура, Характеристика, ДополнительныеПараметры);
	
КонецФункции

Процедура ДополнитьКонтентДокументаСлужебнойИнформацией(Контент, ДанныеШапки)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентДокументаСлужебнойИнформацией"
				, Контент
				, ДанныеШапки);
	
КонецПроцедуры

Процедура ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Контент, СтрокаТЧ)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией"
				, Контент
				, СтрокаТЧ);
	
КонецПроцедуры

Процедура ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(Контент, СтрокаТЧ)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией"
				, Контент
				, СтрокаТЧ);
	
КонецПроцедуры

Функция ХранилищеКонтактнойИнформацииОбъекта(СсылкаНаОбъект)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ХранилищеКонтактнойИнформацииОбъекта", СсылкаНаОбъект);
	
КонецФункции

Функция АдресЮрФизЛица(ЮрФизЛицо, ВидАдреса, Дата = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "АдресЮрФизЛица", ЮрФизЛицо, ВидАдреса, Дата);
	
КонецФункции

Функция СведенияОбАдресе(Адрес, ДополнительныеПараметры = Неопределено)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "СведенияОбАдресе", Адрес, ДополнительныеПараметры);
	
КонецФункции

Функция ПредставлениеКонтактнойИнформацииОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации, Разделитель = ",", Дата = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПредставлениеКонтактнойИнформацииОбъекта"
		, СсылкаИлиОбъект
		, ВидКонтактнойИнформации
		, Разделитель
		, Дата
		, ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

Процедура Заполнить_AddressInfo(AddressInfo, СтруктураАдреса)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "Заполнить_AddressInfo", AddressInfo, СтруктураАдреса);
	
КонецПроцедуры

Функция ВидыЭлектронныхДокументов()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ВидыЭлектронныхДокументов");
	
КонецФункции

Процедура ДобавитьВидДокументаДляОбмена(ВидыДокументов, ОбъектМетаданных, ВидЭД, Ограничения = Неопределено, ПравилоКонвертацииСвойств = Неопределено)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьВидДокументаДляОбмена"
				, ВидыДокументов
				, ОбъектМетаданных
				, ВидЭД
				, Ограничения
				, ПравилоКонвертацииСвойств);
	
КонецПроцедуры

Функция НовоеПравилоКонвертацииСвойствЭД()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовоеПравилоКонвертацииСвойствЭД");
	
КонецФункции

Функция ЕстьНезаполненныйРеквизитОбъекта(ИмяРеквизита, Объект, МетаданныеОбъекта)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьНезаполненныйРеквизитОбъекта"
					, ИмяРеквизита
					, Объект
					, МетаданныеОбъекта);
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоСтруктуры(СложнаяСтруктура, ПолныйКлюч, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СвойствоСтруктуры"
					, СложнаяСтруктура
					, ПолныйКлюч
					, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаОбъектаПоПолямПоиска(ПоляПоиска, ОписаниеОбъектаМетаданных, ОднозначноеСоответствие = Истина)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СсылкаОбъектаПоПолямПоиска"
					, ПоляПоиска
					, ОписаниеОбъектаМетаданных
					, ОднозначноеСоответствие);
	
	Возврат Результат;
	
КонецФункции

Функция СопоставленныеУчетныеДокументы(ИдентификаторЭД)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СопоставленныеУчетныеДокументы", ИдентификаторЭД);
	
	Возврат Результат;
	
КонецФункции

Функция СведенияОКонфигурации()
	
	Возврат МетодСервера(, "СведенияОКонфигурации");
	
КонецФункции

Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Возврат МетодСервера(, "СравнитьВерсии", СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции

Функция ПустыеЗначенияРеквизита(ИмяРеквизита)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПустыеЗначенияРеквизита", ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ТипыЮрФизЛиц()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ТипыЮрФизЛиц");
	
КонецФункции

Функция ИмяФайлаПечатнойФормы(ИмяДокумента, НомерДокумента, ДатаДокумента)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ИмяФайлаПечатнойФормы"
	, ИмяДокумента, НомерДокумента, ДатаДокумента);
	
	Возврат Результат;
	
КонецФункции

// Добавляет новую запись в таблицу правил обработки электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - см. ПравилаОбработкиВходящихДокументов;
//  ИдентификаторПравила - Строка - идентификатор правила обработки документов;
//  ВидДокумента		 - Строка - вид документа, к которому относится правило (см. ВидыЭлектронныхДокументов);
//  ДляИсправлений		 - Булево, Неопределено - Ложь, если правило действует только для первичной версии документа;
//                                            Истина, если правило действует для только для исправленной версии документа;
//                                            Неопределено, если правило действует только для первичной и исправительной версий документа;
//
Процедура ДобавитьПравилоОбработкиДокументов(ПравилаОбработки, ИдентификаторПравила, ВидДокумента, ДляИсправлений)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьПравилоОбработкиДокументов"
		, ПравилаОбработки
		, ИдентификаторПравила
		, ВидДокумента
		, ДляИсправлений);
	
КонецПроцедуры

Функция НоваяТаблицаШтрихкодыУпаковок()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяТаблицаШтрихкодыУпаковок");
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, СведенияОМаркировке, GTIN = "")
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьТаблицуШтрихкодов"
		, ШтрихкодыУпаковок
		, СведенияОМаркировке
		, GTIN);
	
КонецПроцедуры

Функция НовыеСвойстваНоменклатурыИБ() Экспорт
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваНоменклатурыИБ");
	
	Возврат Результат;
	
КонецФункции

Функция XML_КодЕдиницыИзмерения(КодЕдиницыИзмерения)
	
	Результат = МетодСервера(, "XML_КодЕдиницыИзмерения", КодЕдиницыИзмерения);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(КодОКЕИ)
	
	Результат = МетодСервера(, "НаименованиеЕдиницыИзмеренияПоКодуОКЕИ", КодОКЕИ);
	
	Возврат Результат;
	
КонецФункции

Функция НовыеСвойстваЭлементаПрослеживаемости()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваЭлементаПрослеживаемости");
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита - Строка - имя получаемого реквизита.
//                          Допускается указание имени реквизита через точку, но при этом параметр КодЯзыка для
//                          такого реквизита учитываться не будет.
//
// Возвращаемое значение:
//  Произвольный - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//                 Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), то возвращается Неопределено.
//
Функция РазрешенноеЗначениеРеквизитаОбъекта(Ссылка, Реквизиты)

	ВыбратьРазрешенныеЗначения	= Истина;
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенныеЗначения);
	
	Возврат Результат;

КонецФункции

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗначенияРеквизитовОбъектаЛокальная", Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросовПоДаннымТабличныхЧастей

Функция ТекстЗапросаТЧ_РеализацияТоваровУслуг()
	
	Результат = 
	"ВЫБРАТЬ
	|	подзапрос.Ссылка КАК Ссылка,
	|	подзапрос.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	подзапрос.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	подзапрос.Номенклатура КАК Номенклатура,
	|	подзапрос.НоменклатураПредставление КАК НоменклатураПредставление,
	|	подзапрос.КодНоменклатуры КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	подзапрос.Количество КАК Количество,
	|	подзапрос.Цена КАК Цена,
	|	подзапрос.Сумма КАК Сумма,
	|	подзапрос.СтавкаНДС КАК СтавкаНДС,
	|	подзапрос.СуммаНДС КАК СуммаНДС,
	|	подзапрос.НомерГТД КАК НомерГТД,
	|	подзапрос.СтранаПроисхождения КАК СтранаПроисхождения,
	|	подзапрос.НомерГТДПредставление КАК НомерГТДПредставление,
	|	подзапрос.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	подзапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	подзапрос.КодЕдиницыИзмерения КАК КодЕдиницыИзмерения,
	|	подзапрос.ВидУпаковки КАК ВидУпаковки,
	|	подзапрос.КоличествоВОдномМесте КАК КоличествоВОдномМесте,
	|	подзапрос.КоличествоМест КАК КоличествоМест,
	|	подзапрос.ЭтоУслуга КАК ЭтоУслуга,
	|	подзапрос.ПризнакТоварРаботаУслуга КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Ссылка,
	|		ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличнаяЧастьДокумента,
	|		""Товары"" КАК ИмяТабличнойЧасти,
	|		1 КАК порядок,
	|		Т.НомерСтроки КАК НомерСтроки,
	|		&ИдентификаторСтрокиИзТЧ КАК ИдентификаторСтроки,
	|		Т.Номенклатура КАК Номенклатура,
	|		Т.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|		&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|		Т.Количество КАК Количество,
	|		Т.Цена КАК Цена,
	|		Т.Сумма КАК Сумма,
	|		Т.СтавкаНДС КАК СтавкаНДС,
	|		Т.СуммаНДС КАК СуммаНДС,
	|		Т.НомерГТД КАК НомерГТД,
	|		Т.СтранаПроисхождения КАК СтранаПроисхождения,
	|		&НомерГТДПредставление Как НомерГТДПредставление,
	|		Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Т.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|		Т.Номенклатура.ЕдиницаИзмерения КАК ВидУпаковки,
	|		Т.Коэффициент КАК КоличествоВОдномМесте,
	|		Т.КоличествоМест КАК КоличествоМест,
	|		ЛОЖЬ КАК ЭтоУслуга,
	|		""Property"" КАК ПризнакТоварРаботаУслуга
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК Т
	|	ГДЕ
	|		Т.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги),
	|		""Услуги"",
	|		2,
	|		Т.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО,
	|		Т.Номенклатура,
	|		Т.Содержание,
	|		&КодНоменклатурыИзТЧ,
	|		Т.Количество,
	|		Т.Цена,
	|		Т.Сумма,
	|		Т.СтавкаНДС,
	|		Т.СуммаНДС,
	|		"""",
	|		"""",
	|		"""",
	|		Т.Ссылка.СуммаВключаетНДС,
	|		Т.Номенклатура.ЕдиницаИзмерения,
	|		Т.Номенклатура.ЕдиницаИзмерения.Код,
	|		"""",
	|		0,
	|		0,
	|		ИСТИНА,
	|		""Service""
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Услуги КАК Т
	|	ГДЕ
	|		Т.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслуги),
	|		""АгентскиеУслуги"",
	|		3,
	|		Т.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО,
	|		Т.Номенклатура,
	|		Т.Содержание,
	|		&КодНоменклатурыИзТЧ,
	|		Т.Количество,
	|		Т.Цена,
	|		Т.Сумма,
	|		Т.СтавкаНДС,
	|		Т.СуммаНДС,
	|		"""",
	|		"""",
	|		"""",
	|		Т.Ссылка.СуммаВключаетНДС,
	|		Т.Номенклатура.ЕдиницаИзмерения,
	|		Т.Номенклатура.ЕдиницаИзмерения.Код,
	|		"""",
	|		0,
	|		0,
	|		ИСТИНА,
	|		""Service""
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК Т
	|	ГДЕ
	|		Т.Ссылка = &Ссылка) КАК подзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО подзапрос.Ссылка = РублевыеСуммы.Регистратор
	|			И подзапрос.ТабличнаяЧастьДокумента = РублевыеСуммы.ТабличнаяЧастьДокумента
	|			И подзапрос.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_КорректировкаРеализации()
	
	Результат = 
	"ВЫБРАТЬ
	|	подзапрос.Ссылка КАК Ссылка,
	|	подзапрос.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	подзапрос.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	подзапрос.порядок КАК порядок,
	|	подзапрос.НомерСтроки КАК НомерСтроки,
	|	подзапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	подзапрос.Номенклатура КАК Номенклатура,
	|	подзапрос.НоменклатураПредставление КАК НоменклатураПредставление,
	|	подзапрос.КодНоменклатуры КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	подзапрос.Количество КАК Количество,
	|	подзапрос.Цена КАК Цена,
	|	подзапрос.Сумма КАК Сумма,
	|	подзапрос.СтавкаНДС КАК СтавкаНДС,
	|	подзапрос.СуммаНДС КАК СуммаНДС,
	|	подзапрос.НомерГТД КАК НомерГТД,
	|	подзапрос.СтранаПроисхождения КАК СтранаПроисхождения,
	|	подзапрос.НомерГТДПредставление КАК НомерГТДПредставление,
	|	подзапрос.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	подзапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	подзапрос.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	подзапрос.ЭтоУслуга КАК ЭтоУслуга,
	|	подзапрос.ПризнакТоварРаботаУслуга КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Ссылка,
	|		ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличнаяЧастьДокумента,
	|		""Товары"" КАК ИмяТабличнойЧасти,
	|		1 КАК порядок,
	|		Т.НомерСтроки КАК НомерСтроки,
	|		&ИдентификаторСтрокиИзТЧ КАК ИдентификаторСтроки,
	|		Т.Номенклатура КАК Номенклатура,
	|		Т.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|		&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|		Т.Количество КАК Количество,
	|		Т.Цена КАК Цена,
	|		Т.Сумма КАК Сумма,
	|		Т.СтавкаНДС КАК СтавкаНДС,
	|		Т.СуммаНДС КАК СуммаНДС,
	|		Т.НомерГТД КАК НомерГТД,
	|		Т.СтранаПроисхождения КАК СтранаПроисхождения,
	|		&НомерГТДПредставление КАК НомерГТДПредставление,
	|		Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		""Property"" КАК ПризнакТоварРаботаУслуга,
	|		ЛОЖЬ КАК ЭтоУслуга
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК Т
	|	ГДЕ
	|		Т.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги),
	|		""Услуги"",
	|		2,
	|		Т.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО,
	|		Т.Номенклатура,
	|		Т.Содержание,
	|		&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|		Т.Количество,
	|		Т.Цена,
	|		Т.Сумма,
	|		Т.СтавкаНДС,
	|		Т.СуммаНДС,
	|		"""",
	|		"""",
	|		"""",
	|		Т.Ссылка.СуммаВключаетНДС,
	|		Т.Номенклатура.ЕдиницаИзмерения,
	|		""Service"",
	|		ИСТИНА
	|	ИЗ
	|		Документ.КорректировкаРеализации.Услуги КАК Т
	|	ГДЕ
	|		Т.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслуги),
	|		""АгентскиеУслуги"",
	|		3,
	|		Т.НомерСтроки,
	|		НЕОПРЕДЕЛЕНО,
	|		Т.Номенклатура,
	|		Т.Содержание,
	|		&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|		Т.Количество,
	|		Т.Цена,
	|		Т.Сумма,
	|		Т.СтавкаНДС,
	|		Т.СуммаНДС,
	|		"""",
	|		"""",
	|		"""",
	|		Т.Ссылка.СуммаВключаетНДС,
	|		Т.Номенклатура.ЕдиницаИзмерения,
	|		""Service"",
	|		ИСТИНА
	|	ИЗ
	|		Документ.КорректировкаРеализации.АгентскиеУслуги КАК Т
	|	ГДЕ
	|		Т.Ссылка = &Ссылка) КАК подзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО подзапрос.Ссылка = РублевыеСуммы.Регистратор
	|			И подзапрос.ТабличнаяЧастьДокумента = РублевыеСуммы.ТабличнаяЧастьДокумента
	|			И подзапрос.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_АктОбОказанииПроизводственныхУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги) КАК ТабличнаяЧастьДокумента,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО Т.Ссылка = РублевыеСуммы.Регистратор
	|			И (ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги) = РублевыеСуммы.ТабличнаяЧастьДокумента)
	|			И Т.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ОказаниеУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК ИмяТабличнойЧасти,
	|	1 КАК НомерСтроки,
	|	Т.Ссылка.Номенклатура КАК Номенклатура,
	|	Т.Ссылка.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзШапки КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.Ссылка.СтавкаНДС КАК СтавкаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.Ссылка.СуммаВключаетНДС КАК суммаВключаетНДС,
	|	Т.Ссылка.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.Ссылка.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	0 КАК ВсегоВРублях,
	|	0 КАК НДСВРублях,
	|	ЛОЖЬ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.ОказаниеУслуг.Контрагенты КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|	И Т.СчетФактура = &СчетФактура";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ОтчетКомитентуОПродажах(ОтчетКомитенту, СчетФактура)
	
	ТребуемыеРеквизитыОтчета = Новый Структура;
	ТребуемыеРеквизитыОтчета.Вставить("СчетаФактурыОтИмениОрганизации", "ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации");
	ТребуемыеРеквизитыОтчета.Вставить("ВидОперации");
	
	РеквизитыОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтчетКомитенту, ТребуемыеРеквизитыОтчета);
	
	ТребуемыеРеквизитыСФ = Новый Структура;
	ТребуемыеРеквизитыСФ.Вставить("Контрагент");
	ТребуемыеРеквизитыСФ.Вставить("Продавец");
	ТребуемыеРеквизитыСФ.Вставить("КодВидаОперации");
	
	РеквизитыСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, ТребуемыеРеквизитыСФ);
	
	ЭтоСводныйКомиссионныйСФ = (РеквизитыСФ.КодВидаОперации = "27"); // п 3.1 статьи 169 НК
	СФОтИмениОрганизации = РеквизитыСФ.Контрагент = СчетФактура.Продавец И РеквизитыОтчета.СчетаФактурыОтИмениОрганизации;
	
	Если РеквизитыОтчета.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках 
		И ЗначениеЗаполнено(РеквизитыСФ.Продавец)
		И (РеквизитыСФ.Контрагент <> РеквизитыСФ.Продавец
			ИЛИ СФОтИмениОрганизации
			ИЛИ ЭтоСводныйКомиссионныйСФ) Тогда
			
		Результат = ТекстЗапросаТЧ_ОтчетКомитентуОПродажах_Товары();
		 
	Иначе
		
		Результат = ТекстЗапросаТЧ_ОтчетКомитентуОПродажах_Вознаграждение();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ОтчетКомитентуОПродажах_Товары()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Количество КАК Количество,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТД,
	|	"""" КАК НомерГТДПредставление,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.Номенклатура.Услуга КАК ЭтоУслуга,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	Т.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Т.Содержание <> """"
	|			ТОГДА Т.Содержание
	|		КОГДА ПОДСТРОКА(Т.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА Т.Номенклатура.Наименование
	|		ИНАЧЕ Т.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	0 КАК ВсегоВРублях,
	|	0 КАК НДСВРублях,
	|	ЛОЖЬ КАК СуществуютЗаписиРублевыхСумм,
	|	ВЫБОР
	|		КОГДА Т.Номенклатура.Услуга
	|			ТОГДА ""Service""
	|		ИНАЧЕ ""Property""
	|	КОНЕЦ КАК ПризнакТоварРаботаУслуга
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Поставщики КАК ТЧПоставщики
	|		ПО Т.КлючСтроки = ТЧПоставщики.КлючСтроки
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|	И ТЧПоставщики.СчетФактура = &СчетФактура";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ОтчетКомитентуОПродажах_Вознаграждение()
	
	Результат =
	"ВЫБРАТЬ
	|	подзапрос.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА подзапрос.Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА ""Комиссионное вознаграждение""
	|		КОГДА ПОДСТРОКА(подзапрос.Номенклатура.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА подзапрос.Номенклатура.Наименование
	|		ИНАЧЕ подзапрос.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	ВЫБОР
	|		КОГДА подзапрос.Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ подзапрос.Номенклатура.Код
	|	КОНЕЦ КАК КодНоменклатуры,
	|	подзапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	"""" КАК КодЕдиницыИзмерения,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	подзапрос.Количество КАК Количество,
	|	подзапрос.Цена КАК Цена,
	|	подзапрос.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	подзапрос.Сумма КАК Сумма,
	|	подзапрос.СуммаНДС КАК СуммаНДС,
	|	подзапрос.НомерГТД КАК НомерГТД,
	|	подзапрос.СтранаПроисхождения КАК СтранаПроисхождения,
	|	подзапрос.НомерГТДПредставление КАК НомерГТДПредставление,
	|	подзапрос.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга,
	|	0 КАК ВсегоВРублях,
	|	0 КАК НДСВРублях,
	|	ЛОЖЬ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(Т.СуммаВознаграждения) КАК Сумма,
	|		СУММА(Т.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		Т.Ссылка.УслугаПоВознаграждению КАК Номенклатура,
	|		Т.Ссылка КАК Ссылка,
	|		0 КАК Количество,
	|		"""" КАК Цена,
	|		"""" КАК НомерГТД,
	|		"""" КАК СтранаПроисхождения,
	|		"""" КАК НомерГТДПредставление,
	|		Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|		"""" КАК ЕдиницаИзмерения
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК Т
	|	ГДЕ
	|		Т.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Т.Ссылка,
	|		Т.Ссылка.УслугаПоВознаграждению,
	|		Т.Ссылка.СуммаВключаетНДС) КАК подзапрос";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ОтчетКомиссионераОПродажах()
	
	Результат =
	"ВЫБРАТЬ
	|	ТЧПокупатели.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ ВТ_КлючПокупателя
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ТЧПокупатели
	|ГДЕ
	|	ТЧПокупатели.Ссылка = &Ссылка
	|	И ТЧПокупатели.СчетФактура = &СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличнаяЧастьДокумента,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.НомерГТД КАК НомерГТД,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.СтранаПроисхождения КАК СтранаПроисхождения,
	|	&НомерГТДПредставление КАК НомерГТДПредставление,
	|	Т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	Т.ЕдиницаИзмерения КАК ВидУпаковки,
	|	Т.Коэффициент КАК КоличествоВОдномМесте,
	|	Т.КоличествоМест КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	""Property"" КАК ПризнакТоварРаботаУслуга,
	|	0 КАК ВсегоВРублях,
	|	0 КАК НДСВРублях,
	|	Т.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЛОЖЬ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючПокупателя КАК КлючиСвязи
	|		ПО Т.КлючСтроки = КлючиСвязи.КлючСтроки
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги),
	|	""Услуги"",
	|	2,
	|	Т.НомерСтроки,
	|	Т.Номенклатура,
	|	Т.Содержание,
	|	&КодНоменклатурыИзТЧ,
	|	Т.Количество,
	|	Т.Цена,
	|	Т.Сумма,
	|	Т.СтавкаНДС,
	|	Т.СуммаНДС,
	|	"""",
	|	Т.Ссылка.СуммаВключаетНДС,
	|	"""",
	|	"""",
	|	Т.Номенклатура.ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.Код,
	|	"""",
	|	0,
	|	0,
	|	ИСТИНА,
	|	""Service"",
	|	0,
	|	0,
	|	"""",
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Услуги КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючПокупателя КАК КлючиСвязи
	|		ПО Т.КлючСтроки = КлючиСвязи.КлючСтроки
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ВозвратТоваровПоставщику()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличнаяЧастьДокумента,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.НомерГТД КАК НомерГТД,
	|	Т.СтранаПроисхождения КАК СтранаПроисхождения,
	|	&НомерГТДПредставление КАК НомерГТДПредставление,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	Т.ЕдиницаИзмерения КАК ВидУпаковки,
	|	Т.Коэффициент КАК КоличествоВОдномМесте,
	|	Т.КоличествоМест КАК КоличествоМест,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм,
	|	""Property"" КАК ПризнакТоварРаботаУслуга
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО Т.Ссылка = РублевыеСуммы.Регистратор
	|			И Т.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|			И (РублевыеСуммы.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_РеализацияУслугПоПереработке()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги) КАК ТабличнаяЧастьДокумента,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Содержание КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО Т.Ссылка = РублевыеСуммы.Регистратор
	|			И Т.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|			И (РублевыеСуммы.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_СчетФактураВыданный_Авансы()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК ТабличнаяЧастьДокумента,
	|	""Авансы"" КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(Т.Содержание, 1, 10) <> """"
	|			ТОГДА Т.Содержание
	|		КОГДА Т.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ПОДСТРОКА(Т.Номенклатура.НаименованиеПолное, 1, 10) <> """"
	|			ТОГДА Т.Номенклатура.НаименованиеПолное
	|		КОГДА Т.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Т.Номенклатура.Наименование
	|		ИНАЧЕ ""Предварительная оплата""
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Количество,
	|	НЕОПРЕДЕЛЕНО КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	"""" КАК ЕдиницаИзмерения,
	|	"""" КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга,
	|	0 КАК ВсегоВРублях,
	|	0 КАК НДСВРублях,
	|	ЛОЖЬ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_СчетНаОплатуПокупателю()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличнаяЧастьДокумента,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Содержание КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.СуммаСкидки КАК СуммаСкидки,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	Т.Номенклатура.Услуга КАК ЭтоУслуга,
	|	ВЫБОР
	|		КОГДА Т.Номенклатура.Услуга
	|			ТОГДА ""Service""
	|		ИНАЧЕ ""Property""
	|	КОНЕЦ КАК ПризнакТоварРаботаУслуга,
	|	0 КАК ВсегоВРублях,
	|	0 КАК НДСВРублях,
	|	ЛОЖЬ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ПередачаОС()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	""ОС"" КАК ИмяТабличнойЧасти,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОС) КАК ТабличнаяЧастьДокумента,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.ОсновноеСредство КАК Номенклатура,
	|	Т.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(Т.ОсновноеСредство.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА Т.ОсновноеСредство.Наименование
	|		ИНАЧЕ Т.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	Т.ОсновноеСредство.Код КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	""Other"" КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО Т.Ссылка = РублевыеСуммы.Регистратор
	|			И Т.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|			И (РублевыеСуммы.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОС))
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ПередачаОС_Прослеживаемость()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	""ОС"" КАК ИмяТабличнойЧасти,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОС) КАК ТабличнаяЧастьДокумента,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.ОсновноеСредство КАК Номенклатура,
	|	Т.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(Т.ОсновноеСредство.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА Т.ОсновноеСредство.Наименование
	|		ИНАЧЕ Т.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	Т.ОсновноеСредство.Код КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЕСТЬNULL(ПередачаОССведенияПрослеживаемости.РНПТ, """") КАК НомерГТД,
	|	ЕСТЬNULL(ПередачаОССведенияПрослеживаемости.СтранаПроисхождения, """") КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ПередачаОССведенияПрослеживаемости.РНПТ.Код, """") КАК НомерГТДПредставление,
	|	Т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	""Other"" КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО Т.Ссылка = РублевыеСуммы.Регистратор
	|			И Т.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|			И (РублевыеСуммы.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОС))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаОС.СведенияПрослеживаемости КАК ПередачаОССведенияПрослеживаемости
	|		ПО Т.ИдентификаторСтроки = ПередачаОССведенияПрослеживаемости.ИдентификаторСтроки
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_НачислениеАренднойПлаты()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Состав) КАК ТабличнаяЧастьДокумента,
	|	""Состав"" КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Содержание КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты.Состав КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО Т.Ссылка = РублевыеСуммы.Регистратор
	|			И (ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги) = РублевыеСуммы.ТабличнаяЧастьДокумента)
	|			И Т.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_НачислениеПени()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Состав) КАК ТабличнаяЧастьДокумента,
	|	""Состав"" КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Содержание КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	1 КАК Количество,
	|	Т.Сумма КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	0 КАК КоличествоВОдномМесте,
	|	0 КАК КоличествоМест,
	|	ИСТИНА КАК ЭтоУслуга,
	|	""Service"" КАК ПризнакТоварРаботаУслуга,
	|	ЕСТЬNULL(РублевыеСуммы.Всего, 0) КАК ВсегоВРублях,
	|	ЕСТЬNULL(РублевыеСуммы.НДС, 0) КАК НДСВРублях,
	|	ВЫБОР
	|		КОГДА РублевыеСуммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.АР_НачислениеПени.Состав КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммы
	|		ПО Т.Ссылка = РублевыеСуммы.Регистратор
	|			И (ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Состав) = РублевыеСуммы.ТабличнаяЧастьДокумента)
	|			И Т.НомерСтроки = РублевыеСуммы.НомерСтрокиДокумента
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_СчетНаАренду()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Состав) КАК ТабличнаяЧастьДокумента,
	|	""Состав"" КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Содержание КАК НоменклатураПредставление,
	|	&КодНоменклатурыИзТЧ КАК КодНоменклатуры,
	|	Т.Количество КАК Количество,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	0 КАК СуммаСкидки,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК НомерГТДПредставление,
	|	Т.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Т.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК КоличествоВОдномМесте,
	|	"""" КАК КоличествоМест,
	|	Т.Номенклатура.Услуга КАК ЭтоУслуга,
	|	ВЫБОР
	|		КОГДА Т.Номенклатура.Услуга
	|			ТОГДА ""Service""
	|		ИНАЧЕ ""Property""
	|	КОНЕЦ КАК ПризнакТоварРаботаУслуга,
	|	0 КАК ВсегоВРублях,
	|	0 КАК НДСВРублях,
	|	ЛОЖЬ КАК СуществуютЗаписиРублевыхСумм
	|ИЗ
	|	Документ.АР_СчетНаАренду.Состав КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_НомерГТДПредставление()
	
	Если МетодСервера(,"СравнитьВерсии", ПараметрыКлиентСервер.ВерсияКонфигурации, "3.0.59") >= 0 Тогда
		Результат = "Т.НомерГТД.РегистрационныйНомер";
	Иначе
		Результат = "Т.НомерГТД.Код";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПодготовкаСпискаИсходящихДокументов

Функция ПодготовитьВТДляСпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц = Новый Массив;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" ИЛИ ТипыДокументов = "2" ИЛИ ТипыДокументов = "5" ИЛИ ТипыДокументов = "6" Тогда
		ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
		ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
		ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" Тогда
		ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "2" Тогда
		ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "3" Тогда
		ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "4" Тогда
		ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Возврат МассивВременныхТаблиц;
	
КонецФункции

Процедура ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_ВозвратПоставщику(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_РеализацияОтгруженныхТоваров(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_АктОбОказанииПроизводственныхУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_РеализацияУслугПоПереработке(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_ОтчетКомитенту(Запрос, МассивВременныхТаблиц);
	
	ПодготовитьВТ_Накладные_НачислениеАренднойПлаты(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_НачислениеПени(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ТребуетсяСФ КАК ТребуетсяСФ,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьНДС) КАК ЕстьНДС,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары) КАК ЕстьТовары,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги) КАК ЕстьУслуги,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		ВЫБОР
	|			КОГДА Товары.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ИСТИНА КАК ЕстьТовары,
	|		ЛОЖЬ КАК ЕстьУслуги,
	|		Товары.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		ВЫБОР
	|			КОГДА Услуги.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		0,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		ВЫБОР
	|			КОГДА Услуги.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		0,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.СчетНаОплатуПокупателю КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_РеализацияТоваровУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И НЕ ВТ_Основная.СчетНаОплатуПокупателю В (&ПустыеЗначенияСчет)";
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_ТЧРеализацияТоваровУслуг_СвязьСоСчетом("ВТ_Основная", "Документ");
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РеализацияТоваровУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ НЕ ВТ_Основная.ТребуетсяСФ
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТребуетсяСФ", ТекстЗапроса_РТУ_ТребуетсяСчетФактура());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияСчет", ПустыеЗначенияРеквизита("Документ.РеализацияТоваровУслуг.Реквизит.СчетНаОплатуПокупателю"));
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияСчет");
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияТоваровУслуг");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_РеализацияТоваровУслуг");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	&ЭтоИсправление КАК ЭтоИсправление,
	|	&ЭтоКорректировка КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.ПредставлениеНомера КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС_ДокументыОснования КАК УКД_КСЧФДИС_ДокументыОснования
	|		ПО Документ.Ссылка = УКД_КСЧФДИС_ДокументыОснования.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УКД_КСЧФДИС_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьНДС) КАК ЕстьНДС,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары) КАК ЕстьТовары,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги) КАК ЕстьУслуги,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		ВЫБОР
	|			КОГДА Товары.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ИСТИНА КАК ЕстьТовары,
	|		ЛОЖЬ КАК ЕстьУслуги,
	|		Товары.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		ВЫБОР
	|			КОГДА Услуги.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		0,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		ВЫБОР
	|			КОГДА Услуги.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		0,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.АгентскиеУслуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВТ_Основная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_СоглашениеОбИзмененииСтоимости
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""КорректировкаРеализации"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсправление", ТекстЗапроса_КРТУ_ЭтоИсправление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКорректировка", ТекстЗапроса_КРТУ_ЭтоКорректировка());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_КорректировкаРеализации");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_КорректировкаРеализации");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ВозвратПоставщику(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_ТоварнаяНакладная КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""ВозвратТоваровПоставщику"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_ВозвратПоставщику
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ВозвратПоставщику");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияОтгруженныхТоваров(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ДокументОтгрузки.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ПО ВТ_Основная.ДокументОтгрузки = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		0,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|			ПО ВТ_Основная.ДокументОтгрузки = Услуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_ТоварнаяНакладная КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияОтгруженныхТоваров"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РеализацияОтгруженныхТоваров
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияОтгруженныхТоваров");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_АктОбОказанииПроизводственныхУслуг(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(Услуги.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК Услуги
	|		ПО ВТ_Основная.Документ = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктОбОказанииУслуг КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""АктОбОказанииПроизводственныхУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_АктОбОказанииПроизводственныхУслуг
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_АктОбОказанииПроизводственныхУслуг");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияУслугПоПереработке(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(Услуги.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПоПереработке.Услуги КАК Услуги
	|		ПО ВТ_Основная.Документ = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктОбОказанииУслуг КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	""РеализацияУслугПоПереработке"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РеализацияУслугПоПереработке
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияУслугПоПереработке");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ОтчетКомитенту(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаВознаграждения КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (Документ.СуммаВознаграждения <> 0 ИЛИ Документ.УдержатьВознаграждение)
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(Товары.СуммаНДСВознаграждения) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК Товары
	|		ПО ВТ_Основная.Документ = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктОбОказанииУслуг КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСУслуги,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	""ОтчетКомитентуОПродажах"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_ОтчетКомитенту
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ОтчетКомитенту");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_НачислениеАренднойПлаты(Запрос, МассивВременныхТаблиц)
	
	Если Не ЭтоУправлениеАрендой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ТребуетсяСФ КАК ТребуетсяСФ,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.ДокументОснование КАК СчетНаОплатуПокупателю, // АР_СчетНаАренду
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АР_НачислениеАренднойПлаты КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	НЕ ВложенныйЗапрос.Документ.ДокументБезНДС КАК ЕстьНДС,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	ИСТИНА КАК ЕстьУслуги,
	|	СУММА(0) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР_НачислениеАренднойПлаты.Состав КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.СчетНаОплатуПокупателю КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_НачислениеАренднойПлаты
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И НЕ ВТ_Основная.СчетНаОплатуПокупателю В (&ПустыеЗначенияСчет)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_НачислениеАренднойПлаты
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ НЕ ВТ_Основная.ТребуетсяСФ
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТребуетсяСФ", ТекстЗапроса_РТУ_ТребуетсяСчетФактура());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияСчет", ПустыеЗначенияРеквизита("Документ.АР_НачислениеАренднойПлаты.Реквизит.ДокументОснование"));
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияСчет");
	
	МассивВременныхТаблиц.Добавить("Накладные_НачислениеАренднойПлаты");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_НачислениеАренднойПлаты");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_НачислениеПени(Запрос, МассивВременныхТаблиц)
	
	Если Не ЭтоУправлениеАрендой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ТребуетсяСФ КАК ТребуетсяСФ,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	Документ.ДокументОснование КАК СчетНаОплатуПокупателю, // АР_СчетНаАренду
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АР_НачислениеПени КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	НЕ ВложенныйЗапрос.Документ.ДокументБезНДС КАК ЕстьНДС,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	ИСТИНА КАК ЕстьУслуги,
	|	СУММА(0) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР_НачислениеПени.Состав КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.СчетНаОплатуПокупателю КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_НачислениеПени
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	ВТ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И НЕ ВТ_Основная.СчетНаОплатуПокупателю В (&ПустыеЗначенияСчет)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_НачислениеПени
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ НЕ ВТ_Основная.ТребуетсяСФ
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТребуетсяСФ", ТекстЗапроса_РТУ_ТребуетсяСчетФактура());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияСчет", ПустыеЗначенияРеквизита("Документ.АР_НачислениеПени.Реквизит.ДокументОснование"));
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияСчет");
	
	МассивВременныхТаблиц.Добавить("Накладные_НачислениеПени");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_НачислениеПени");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц)
	
	Поместить_ВТ_Основная =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументов.Ссылка КАК Документ,
	|	&ЭтоИсправление КАК ЭтоИсправление,
	|	&ЭтоКорректировка КАК ЭтоКорректировка,
	|	&ЭтоАванс КАК ЭтоАванс,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажах.Контрагент, ДанныеДокументов.Контрагент) КАК Контрагент,
	|	ДанныеДокументов.ВалютаДокумента КАК Валюта,
	|	ДанныеДокументов.СуммаДокумента КАК СуммаДокументаЗначение,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ДанныеДокументов.Проведен КАК Проведен,
	|	ДанныеДокументов.Дата КАК Дата,
	|	ДанныеДокументов.ПредставлениеНомера КАК Номер,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО ДанныеДокументов.Организация = НастройкиЭДО.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО ДанныеДокументов.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ПО ДанныеДокументов.ДокументОснование = ОтчетКомиссионераОПродажах.Ссылка
	|ГДЕ
	|	ДанныеДокументов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|	И НЕ ДанныеДокументов.ПометкаУдаления
	|	И ЕСТЬNULL(ОтчетКомиссионераОПродажах.Контрагент, ДанныеДокументов.Контрагент) = НастройкиЭДО.Контрагент
	|	И ДанныеДокументов.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|	И ДанныеДокументов.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
	|	И (ДанныеДокументов.Проведен
	|			ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент";
	
	Подзапросы = Новый Массив;
	Подзапросы.Добавить(Поместить_ВТ_Основная);
	Подзапросы.Добавить(ТекстЗапроса_Поместить_ДанныеДокументаИДокументыОснования());
	Подзапросы.Добавить(ТекстЗапроса_Поместить_СуммыДокОснованийЗначение());
	Подзапросы.Добавить(ТекстЗапроса_Поместить_СЧФ_Основная());
	Подзапросы.Добавить("УНИЧТОЖИТЬ ВТ_Основная");
	Подзапросы.Добавить("УНИЧТОЖИТЬ СуммыДокОснованийЗначение");
	Подзапросы.Добавить("УНИЧТОЖИТЬ ДанныеДокументаИДокументыОснования");
	
	ТекстЗапроса = СтрСоединить(Подзапросы, РазделительПакетаЗапросов());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоАванс", ТекстЗапроса_СчетФактура_ЭтоАванс());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсправление", ТекстЗапроса_СчетФактура_ЭтоИсправление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКорректировка", ТекстЗапроса_СчетФактура_ЭтоКорректировка());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|	И НЕ СЧФ_Основная.ЭтоКорректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID_ = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СЧФ_Основная.Документ КАК Документ,
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_УПД_СЧФДОП
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО СЧФ_Основная.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|			И (НЕ РеализацияТоваровУслуг.СчетНаОплатуПокупателю В (&ПустыеЗначенияСчет))
	|ГДЕ
	|	СЧФ_Основная.ОснованиеФормированияСчета = &ОснованиеСчета_Счет";
	
	Запрос.Текст = Запрос.Текст + ТекстЗапроса_ТЧРеализацияТоваровУслуг_СвязьСоСчетом("СЧФ_Основная", "ДокументОснование");
	
	Запрос.Текст = Запрос.Текст + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СЧФ_Основная.Документ,
	|	СЧФ_Основная.ДокументОснование
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	НЕ СЧФ_Основная.ДокументОснование ССЫЛКА Документ.ОказаниеУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетФактура КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоАванс
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_СЧФДОП
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УПД_СЧФДОП
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|ГДЕ
	|	НЕ СЧФ_Основная.ЭтоАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ УПД_СЧФДОП_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	ПустыеЗначенияСчет = ПустыеЗначенияРеквизита("Документ.РеализацияТоваровУслуг.Реквизит.СчетНаОплатуПокупателю");
	Запрос.УстановитьПараметр("ПустыеЗначенияСчет", ПустыеЗначенияСчет);
	
	Запрос.Выполнить();
	
	Запрос.Параметры.Удалить("ПустыеЗначенияСчет");
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "5" Тогда
		МассивВременныхТаблиц.Добавить("УПД_СЧФДОП");
		МассивВременныхТаблиц.Добавить("Связь_УПД_СЧФДОП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|	И СЧФ_Основная.ЭтоКорректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID_ = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	&ВидыЭД_КорректировочныйСчетФактура КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	&ФункцияЭД_КСЧФДИС КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УКД_КСЧФДИС
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ УКД_КСЧФДИС_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Выполнить();
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "6" Тогда
		МассивВременныхТаблиц.Добавить("УКД_КСЧФДИС");
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|				И СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ФункцияЭД_КСЧФ
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ СчетФактураВыданный
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО СЧФ_Основная.Документ = УПД_СЧФДОП.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС КАК УКД_КСЧФДИС
	|		ПО СЧФ_Основная.Документ = УКД_КСЧФДИС.Документ
	|ГДЕ
	|	УПД_СЧФДОП.Документ ЕСТЬ NULL
	|	И УКД_КСЧФДИС.Документ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СЧФ_Основная";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетФактураВыданный");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_СчетНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц);
	
	ПодготовитьВТ_СчетНаОплату_СчетНаАренду(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_СчетНаОплатуПокупателю(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК Товары
	|		ПО ВТ_Основная.Документ = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_СчетНаОплатуПокупателю
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	""СчетНаОплату"" КАК Тип,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_СчетНаОплатуПокупателю
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_СчетНаОплатуПокупателю");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_СчетНаОплатуПокупателю");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_РеализацияТоваровУслуг(Запрос, МассивВременныхТаблиц)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_ДокументПродажи
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		0,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		0,
	|		АгентскиеУслуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК АгентскиеУслуги
	|			ПО ВТ_Основная.Документ = АгентскиеУслуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_РасходнаяНакладная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_РасходнаяНакладная
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_РасходнаяНакладная");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_РасходнаяНакладная");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_КорректировкаРеализации(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	&ЭтоИсправление КАК ЭтоИсправление,
	|	&ЭтоКорректировка КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_ДокументПродажи
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		0,
	|		Услуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Услуги КАК Услуги
	|			ПО ВТ_Основная.Документ = Услуги.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		0,
	|		АгентскиеУслуги.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.АгентскиеУслуги КАК АгентскиеУслуги
	|			ПО ВТ_Основная.Документ = АгентскиеУслуги.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""СчетНаОплату"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_КорректировкаРеализации
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсправление", ТекстЗапроса_КРТУ_ЭтоИсправление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКорректировка", ТекстЗапроса_КРТУ_ЭтоКорректировка());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_КорректировкаРеализации");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_КорректировкаРеализации");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_СчетНаАренду(Запрос, МассивВременныхТаблиц)
	
	Если Не ЭтоУправлениеАрендой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АР_СчетНаАренду КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР_СчетНаАренду.Состав КАК ТЧ
	|		ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_СчетНаАренду
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	""СчетНаОплату"" КАК Тип,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_СчетНаАренду
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_СчетНаАренду");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_СчетНаАренду");
	
КонецПроцедуры

Процедура ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|ГДЕ
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктСверки КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	0 КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""АктСверкиВзаиморасчетов"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ АктСверкиВзаиморасчетов
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("АктСверкиВзаиморасчетов");
	
КонецПроцедуры

Функция ТекстЗапросаВременнаяТаблица_ЕстьСЧФ()
	
	Результат =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СЧФ_ДокументыОснования
	|		ПО ВТ_Основная.Документ = СЧФ_ДокументыОснования.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО (СЧФ_ДокументыОснования.Ссылка = СЧФ.Ссылка)
	|ГДЕ
	|	СЧФ.Ссылка ЕСТЬ НЕ NULL 
	|	И НЕ СЧФ.ПометкаУдаления
	|	И (СЧФ.Проведен
	|			ИЛИ ВТ_Основная.ОтправлятьНепроведенные = ИСТИНА)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ФункцияПервичногоДокумента(ПсевдонимТаблицы = "ВТ_Основная")
	
	Результат = 
	"	ВЫБОР
	|		КОГДА ПсевдонимТаблицы.ЭтоКорректировка
	|				И ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДИС
	|		КОГДА ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДОП
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_РТУ_ТребуетсяСчетФактура(ПсевдонимТаблицы = "Документ")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ДоговорКонтрагента.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КРТУ_ЭтоИсправление(ПсевдонимТаблицы = "Документ")
	
	ВидыИсправлений = Новый Массив;
	ВидыИсправлений.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)");
	ВидыИсправлений.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеСобственнойОшибки)");
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ВидОперации В (&ВидыИсправлений)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидыИсправлений", СтрСоединить(ВидыИсправлений, ","));
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КРТУ_ЭтоКорректировка(ПсевдонимТаблицы = "Документ")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|		ИЛИ ПсевдонимТаблицы.ИсправляемыйДокументРеализации ССЫЛКА Документ.КорректировкаРеализации
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоАванс(ПсевдонимТаблицы = "ДанныеДокументов")
	
	ВидыОперацийАванс = Новый Массив;
	ВидыОперацийАванс.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)");
	ВидыОперацийАванс.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)");
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ВидСчетаФактуры В (&ВидыОперацийАванс)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидыОперацийАванс", СтрСоединить(ВидыОперацийАванс, ","));
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоИсправление(ПсевдонимТаблицы = "ДанныеДокументов")
	
	Результат = "ПсевдонимТаблицы.Исправление";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимТаблицы = "ДанныеДокументов")
	
	ВидыКСФ = Новый Массив;
	ВидыКСФ.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)");
	Если ИспользуетсяКорректировкаСчетаФактурыНаАванс() Тогда
		ВидыКСФ.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)");
	КонецЕсли;
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ВидСчетаФактуры В (&ВидыКСФ)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидыКСФ", СтрСоединить(ВидыКСФ, ","));
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы)
	
	ПодстрокаПоиска = "ПсевдонимТаблицы";
	Если Не ЗначениеЗаполнено(ПсевдонимТаблицы) Тогда
		ПодстрокаПоиска = ПодстрокаПоиска + ".";
	КонецЕсли;
	
	Выражение = СтрЗаменить(Выражение, ПодстрокаПоиска, ПсевдонимТаблицы);
	
КонецПроцедуры

Функция ТекстЗапроса_ТЧРеализацияТоваровУслуг_СвязьСоСчетом(ПсевдонимТаблицы, ПолеСоединения)
	
	Результат = "";
	
	ТабличныеЧастиРеализации = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти;
	
	Если ЕстьРеквизитМетаданных(ТабличныеЧастиРеализации.Товары, "СчетНаОплатуПокупателю") Тогда
		
		Результат = Результат + "
		|
		|ОБЪЕДИНИТЬ
		|	
		|ВЫБРАТЬ
		|	ПсевдонимТаблицы.Документ,
		|	РеализацияТоваровУслугТовары.СчетНаОплатуПокупателю
		|ИЗ
		|	ПсевдонимТаблицы КАК ПсевдонимТаблицы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ПсевдонимТаблицы.ПолеСоединения = РеализацияТоваровУслугТовары.Ссылка
		|			И (НЕ РеализацияТоваровУслугТовары.СчетНаОплатуПокупателю В (&ПустыеЗначенияСчет))
		|ГДЕ
		|	ПсевдонимТаблицы.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
		|";
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(ТабличныеЧастиРеализации.Услуги, "СчетНаОплатуПокупателю") Тогда
		
		Результат = Результат + "
		|
		|ОБЪЕДИНИТЬ
		|	
		|ВЫБРАТЬ
		|	ПсевдонимТаблицы.Документ,
		|	РеализацияТоваровУслугУслуги.СчетНаОплатуПокупателю
		|ИЗ
		|	ПсевдонимТаблицы КАК ПсевдонимТаблицы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ПО ПсевдонимТаблицы.ПолеСоединения = РеализацияТоваровУслугУслуги.Ссылка
		|			И (НЕ РеализацияТоваровУслугУслуги.СчетНаОплатуПокупателю В (&ПустыеЗначенияСчет))
		|ГДЕ
		|	ПсевдонимТаблицы.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
		|";
		
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	Результат = СтрЗаменить(Результат, "ПолеСоединения", ПолеСоединения); 
	
	Возврат Результат;
	
КонецФункции

Функция ИменаТабличныхЧастейОснованийСчетаФактуры()
	
	Результат = Новый Массив;
	Результат.Добавить("Документ.РеализацияТоваровУслуг.Товары");
	Результат.Добавить("Документ.РеализацияТоваровУслуг.Услуги");
	Результат.Добавить("Документ.РеализацияТоваровУслуг.АгентскиеУслуги");
	
	Результат.Добавить("Документ.КорректировкаРеализации.Товары");
	Результат.Добавить("Документ.КорректировкаРеализации.Услуги");
	Результат.Добавить("Документ.КорректировкаРеализации.АгентскиеУслуги");
	
	Результат.Добавить("Документ.ВозвратТоваровПоставщику.Товары");
	Результат.Добавить("Документ.АктОбОказанииПроизводственныхУслуг.Услуги");
	Результат.Добавить("Документ.РеализацияУслугПоПереработке.Услуги");
	Результат.Добавить("Документ.ОтчетКомитентуОПродажах.Товары");
	
	Если ЭтоУправлениеАрендой() Тогда
		Результат.Добавить("Документ.АР_НачислениеАренднойПлаты.Состав");
		Результат.Добавить("Документ.АР_НачислениеПени.Состав");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_Поместить_ДанныеДокументаИДокументыОснования()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СчетаФактуры.Документ КАК Документ,
	|	СчетаФактуры.ЭтоИсправление КАК ЭтоИсправление,
	|	СчетаФактуры.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СчетаФактуры.ЭтоАванс КАК ЭтоАванс,
	|	СчетаФактуры.Организация КАК Организация,
	|	СчетаФактуры.Контрагент КАК Контрагент,
	|	СчетаФактуры.Валюта КАК Валюта,
	|	СчетаФактуры.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СчетаФактуры.ID КАК ID,
	|	СчетаФактуры.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	СчетаФактуры.Проведен КАК Проведен,
	|	СчетаФактуры.Дата КАК Дата,
	|	СчетаФактуры.Номер КАК Номер,
	|	СчетаФактуры.ФормироватьУПД КАК ФормироватьУПД,
	|	ДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ДокументОснованиеID,
	|	СчетаФактуры.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета
	|ПОМЕСТИТЬ ДанныеДокументаИДокументыОснования
	|ИЗ
	|	ВТ_Основная КАК СчетаФактуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ДокументыОснования
	|		ПО СчетаФактуры.Документ = ДокументыОснования.Ссылка
	|			И (ДокументыОснования.ДокументОснование <> НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО (ДокументыОснования.ДокументОснование = ИдентификаторДокументаВДиадок.Объект)
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_Поместить_СуммыДокОснованийЗначение()
	
	ПолныеИменаТабличныхЧастей = ИменаТабличныхЧастейОснованийСчетаФактуры();
	
	ШаблонВложенногоЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеСФ.Документ КАК Документ,
	|	ТабличнаяЧастьОснованияСФ.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	ДанныеДокументаИДокументыОснования КАК ДанныеСФ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТабличнойЧасти КАК ТабличнаяЧастьОснованияСФ
	|		ПО ДанныеСФ.ДокументОснование = ТабличнаяЧастьОснованияСФ.Ссылка";
	
	ВложенныеЗапросы = Новый Массив;
	
	Для Каждого ИмяТЧ Из ПолныеИменаТабличныхЧастей Цикл
		ТекстЗапроса = СтрЗаменить(ШаблонВложенногоЗапроса, "ИмяТабличнойЧасти", ИмяТЧ);
		ВложенныеЗапросы.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ВложенныйЗапрос = СтрСоединить(ВложенныеЗапросы, РазделительОбъединенияЗапросов());
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммыДокОснованийЗначение
	|ИЗ
	|	(ТекстВложенногоЗапроса) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	Результат = СтрЗаменить(Результат, "ТекстВложенногоЗапроса", ВложенныйЗапрос);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_Поместить_СЧФ_Основная()
	
	Результат =
	"ВЫБРАТЬ
	|	СЧФ_Предварительная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА СЧФ_Предварительная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	СЧФ_Предварительная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Предварительная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Предварительная.ЭтоАванс КАК ЭтоАванс,
	|	СЧФ_Предварительная.Организация КАК Организация,
	|	СЧФ_Предварительная.Контрагент КАК Контрагент,
	|	СЧФ_Предварительная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Предварительная.Валюта КАК Валюта,
	|	СЧФ_Предварительная.ID КАК ID_,
	|	СЧФ_Предварительная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	СЧФ_Предварительная.Проведен КАК Проведен,
	|	СЧФ_Предварительная.Дата КАК Дата,
	|	СЧФ_Предварительная.Номер КАК Номер,
	|	ЕСТЬNULL(ИтогиПоНДС.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""СчетФактураВыданный"" КАК Тип,
	|	СЧФ_Предварительная.ФормироватьУПД КАК ФормироватьУПД,
	|	СЧФ_Предварительная.ДокументОснование КАК ДокументОснование,
	|	СЧФ_Предварительная.ДокументОснованиеID КАК ДокументОснованиеID,
	|	СЧФ_Предварительная.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	ДанныеДокументаИДокументыОснования КАК СЧФ_Предварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыДокОснованийЗначение КАК ИтогиПоНДС
	|		ПО СЧФ_Предварительная.Документ = ИтогиПоНДС.Документ";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного() Экспорт
	
	Результат =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОснованияСФ.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ОснованияСФ
	|ГДЕ
	|	ОснованияСФ.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//{ СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОтрезатьПравуюЗапятую(стр)
	
	Результат = СокрЛП(стр);
	
	Пока СтрЗаканчиваетсяНа(Результат, ",") Цикл
		Результат = Лев(Результат, СтрДлина(Результат) - 1);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьРазделитель(Стр, Префикс = "")
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Стр) Тогда
		Результат = Префикс + СокрЛП(Стр) + ", ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКСФ(СсылкаНаОбъект) Экспорт
	
	Возврат Строка(СсылкаНаОбъект.ВидСчетаФактуры) = "Корректировочный"
	
КонецФункции

Функция ЭтоИсправление(СсылкаНаОбъект) Экспорт
	
	Возврат СсылкаНаОбъект.Исправление
	
КонецФункции	

Функция ЭтоНакладная(СсылкаНаОбъект) Экспорт
	
	Возврат ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
	
КонецФункции	

Функция ЭтоПередачаОС(СсылкаНаОбъект) Экспорт
	
	Возврат ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПередачаОС")
	
КонецФункции

Функция ЭтоСчетНаОплату(СсылкаНаОбъект) Экспорт
	
	Возврат (НЕ Метаданные.Документы.Найти("СчетНаОплатуПокупателю") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
			  
КонецФункции

Функция ЭтоЗаказПокупателя(СсылкаНаОбъект) Экспорт
	
	Возврат Ложь;
			  
КонецФункции

Функция ЭтоКорректировкаРеализации(СсылкаНаОбъект) Экспорт
	
	Возврат (НЕ Метаданные.Документы.Найти("КорректировкаРеализации") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации"));	
КонецФункции

Функция СчетФактуранаАванс(СФ) Экспорт
	
	Возврат   ТипЗнч(СФ) = Тип("ДокументСсылка.СчетФактураВыданный") 
			И Метаданные.Перечисления.Найти("ВидСчетаФактурыВыставленного") <> Неопределено 
			И ( СФ.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.НаАванс") 
			ИЛИ СФ.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента")); 
				
КонецФункции	

Функция ЭтоВозвратТоваровОтКлиента(СсылкаНаОбъект) Экспорт
	
	Возврат (НЕ Метаданные.Документы.Найти("ВозвратТоваровОтПокупателя") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	
КонецФункции		

Функция ЭтоВыбытиеИзОборотаМаркируемойПродукции(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ТаблицаЗначений_2_МассивСтруктур(ТаблЗнач)
	
	Результат = Новый Массив;
	СтрокаКлючей = "";
	Для Каждого Колонка из ТаблЗнач.Колонки Цикл
		СтрокаКлючей = СтрокаКлючей + ?(ПустаяСтрока(СтрокаКлючей), "", ",") + Колонка.Имя;
	КонецЦикла;
	
	Если ТипЗнч(ТаблЗнач) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого Стр Из ТаблЗнач Цикл
			ЭлементСписка = Новый Структура(СтрокаКлючей);
			ЗаполнитьЗначенияСвойств(ЭлементСписка, Стр);
			Результат.Добавить(ЭлементСписка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция ПолучитьТелефон(СтрокаТелефонФакс)
	
	НомерСимволаФакс = Найти(СтрокаТелефонФакс, "факс:");
	Если НомерСимволаФакс > 0 Тогда 
		Телефон = СокрЛП(Лев(СтрокаТелефонФакс, НомерСимволаФакс - 1));
		Если Прав(Телефон, 1) = ","  Тогда
			Телефон = Лев(Телефон, стрДлина(Телефон)-1);
		КонецЕсли;
	Иначе 
		Телефон = СтрокаТелефонФакс;
	КонецЕсли;
	
	Возврат СократитьПредставлениеТелефона(Телефон);
	
КонецФункции

Функция СократитьПредставлениеТелефона(телефонСтрока)
	
	Если (стрДлина(телефонСтрока) <= 20) Или (найти(ТелефонСтрока, ";") = 0) Тогда
		//резать нечего
		Возврат ТелефонСтрока;
	КонецЕсли;	
	
	НовыйТелефон = "";
	СтарыйТелефон = ТелефонСтрока;
	Пока Найти(СтарыйТелефон, ";") > 0 Цикл
		Если (НовыйТелефон = "") Или (СтрДлина(НовыйТелефон) + Найти(СтарыйТелефон, ";") <= 20) Тогда
			//добавим кусок
			НовыйТелефон = ?(НовыйТелефон = "", "", НовыйТелефон + ";") + Лев(СтарыйТелефон, Найти(СтарыйТелефон, ";") - 1);
			СтарыйТелефон = Прав(СтарыйТелефон, СтрДлина(СтарыйТелефон) - найти(СтарыйТелефон, ";"));
		Иначе 
			СтарыйТелефон = "";
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат НовыйТелефон;
КонецФункции	

Функция ИсходныйКорректируемыйДокумент(КорректирующийДокумент)
	
	Если ТипЗнч(КорректирующийДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Результат = ИсходныйКорректируемыйДокумент(КорректирующийДокумент.ДокументРеализации);
		
	Иначе
		
		Результат = КорректирующийДокумент;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОснованиеОтчетКомитентаОПродажах_ОтчетОЗакупках(ДокОснования, СчетФактура = Неопределено)
	
	Если СчетФактура = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ДокОснования.Количество()= 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(ДокОснования[0]) <> Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОтчетКомитентуОПродажах = ДокОснования[0];
	
	Если ОтчетКомитентуОПродажах.Метаданные().Реквизиты.Найти("ВидОперации") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОтчетКомитентуОПродажах.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;	
	
КонецФункции

Функция ОснованиеОтчетКомиссионераОПродажах(ДокОснования, СчетФактура = Неопределено)
	
	Если СчетФактура = Неопределено ИЛИ ДокОснования.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
			
	Если ТипЗнч(ДокОснования[0]) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		 
КонецФункции

Функция ИнициализацияТаблицыСтрокТовары(ЭтоКСФ)
	
	ОписаниеЧисло	 = Новый ОписаниеТипов("Число");
	ОписаниеБулево	 = Новый ОписаниеТипов("Булево");
	
	Товары = Новый ТаблицаЗначений();
	
	Товары.Колонки.Добавить("Номенклатура");
	Товары.Колонки.Добавить("НоменклатураПредставление");
	Товары.Колонки.Добавить("Характеристика");
	Товары.Колонки.Добавить("Серия");
	Товары.Колонки.Добавить("КодНоменклатуры");  //для торг-12
	Товары.Колонки.Добавить("СтранаПроисхождения");
	Товары.Колонки.Добавить("НомерГТД");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("ЕдиницаИзмерения");
	Товары.Колонки.Добавить("КодЕдиницыИзмерения"); // для торг-12
	Товары.Колонки.Добавить("ВидУпаковки");//Для торг-12
	Товары.Колонки.Добавить("КоличествоВОдномМесте");//Для торг-12
	Товары.Колонки.Добавить("КоличествоМест");//Для торг-12
	Товары.Колонки.Добавить("Цена");
	Товары.Колонки.Добавить("СтавкаНДС");
	Товары.Колонки.Добавить("СуммаНДС");
	Товары.Колонки.Добавить("СуммаСкидки", ОписаниеЧисло); //Для счет на оплату покупателю
	Товары.Колонки.Добавить("Сумма");
	Товары.Колонки.Добавить("СуммаВключаетНДС");
	Товары.Колонки.Добавить("ЭтоУслуга");
	Товары.Колонки.Добавить("Масса"); //Для торг-12
	Товары.Колонки.Добавить("ВсегоВРублях"); //Для торг-12
	Товары.Колонки.Добавить("НДСВРублях"); //Для торг-12
	Товары.Колонки.Добавить("СуществуютЗаписиРублевыхСумм"); //Для торг-12
	Товары.Колонки.Добавить("ПризнакТоварРаботаУслуга"); // для УПД
	Товары.Колонки.Добавить("ПрослеживаемыйТовар", ОписаниеБулево); // для УПД, для прослеживаемости
	Товары.Колонки.Добавить("ДанныеПрослеживаемости"); // для УПД, для прослеживаемости
	Товары.Колонки.Добавить("ДокументОтгрузки"); // для УПД 820 строка шапки 5а
	Товары.Колонки.Добавить("Акциз");

	Если ЭтоКСФ Тогда 
		Товары.Колонки.Добавить("СтранаПроисхожденияДоИзменения");
		Товары.Колонки.Добавить("НомерГТДДоИзменения");
		Товары.Колонки.Добавить("КоличествоДоИзменения");
		Товары.Колонки.Добавить("ЕдиницаИзмеренияДоИзменения");
		Товары.Колонки.Добавить("ЦенаДоИзменения");
		Товары.Колонки.Добавить("СтавкаНДСДоИзменения");
		Товары.Колонки.Добавить("СуммаНДСДоИзменения");
		Товары.Колонки.Добавить("СуммаДоИзменения");
		Товары.Колонки.Добавить("ВсегоВРубляхДоИзменения"); //Для торг-12
		Товары.Колонки.Добавить("НДСВРубляхДоИзменения"); //Для торг-12
		Товары.Колонки.Добавить("СуществуютЗаписиРублевыхСуммДоИзменения"); //Для торг-12
		Товары.Колонки.Добавить("НомерИсходнойСтроки");
		Товары.Колонки.Добавить("АкцизДоИзменения");
	КонецЕсли;	
	
	Возврат Товары;
	
КонецФункции

Функция ЭтоВалютныйДокумент(ДокументНаПроверку) Экспорт
	
	ВалютаРеглУчета = ВалютаРегламентированногоУчета();
	
	Если ТипЗнч(ДокументНаПроверку) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		ИЛИ ТипЗнч(ДокументНаПроверку) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ВалютаДок = ДокументНаПроверку.ВалютаДокумента;
		
		Если ДокументНаПроверку.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги Тогда
			Если ДокументНаПроверку.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах Тогда
				ДопПроверка = Истина;
			Иначе
				ДопПроверка = Ложь;
			КонецЕсли;
		Иначе
			ДопПроверка = Истина;
		КонецЕсли;
		
		Если НЕ ВалютаДок = ВалютаРеглУчета И ДопПроверка = Истина Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументНаПроверку) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		РасчетыВУЕ 	= ДокументНаПроверку.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах;
		ВалютаДок 	= ДокументНаПроверку.ВалютаДокумента;
		
		Если РасчетыВУЕ И (НЕ ВалютаДок = ВалютаРеглУчета) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоСводныйКомиссионныйСФ(СчетФактураСсылка)
			
	Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", СчетФактураСсылка, "СводныйКомиссионный") Тогда
		Возврат СчетФактураСсылка.СводныйКомиссионный;
	Иначе
		Возврат СчетФактураСсылка.КодВидаОперации = "27";
	КонецЕсли;
	
КонецФункции

Функция ПривестиКЧислуЛок(Значение)
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

//} СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ ПОЛУЧЕНИЕ ДАННЫХ

Процедура ДополнитьТекстыЗапросовПоТабличнойЧастиАренда(ТекстыЗапросов)
	
	Если Не ЭтоУправлениеАрендой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыЗапросов.Вставить(Тип("ДокументСсылка.АР_НачислениеАренднойПлаты"),
		ТекстЗапросаТЧ_НачислениеАренднойПлаты());
	
	ТекстыЗапросов.Вставить(Тип("ДокументСсылка.АР_НачислениеПени"),
		ТекстЗапросаТЧ_НачислениеПени());
	
	ТекстыЗапросов.Вставить(Тип("ДокументСсылка.АР_СчетНаАренду"),
		ТекстЗапросаТЧ_СчетНаАренду());
	
КонецПроцедуры

Функция ТекстЗапросаПоТабличнойЧасти(СсылкаНаОбъект, СчетФактура)
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	
	Если ТипСсылки = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		И ЗначениеЗаполнено(СчетФактура) Тогда
		
		Результат = ТекстЗапросаТЧ_ОтчетКомитентуОПродажах(СсылкаНаОбъект, СчетФактура);
		
	Иначе
		
		ТекстыЗапросов = Новый Соответствие;
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.РеализацияТоваровУслуг"),
			ТекстЗапросаТЧ_РеализацияТоваровУслуг());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.КорректировкаРеализации"),
			ТекстЗапросаТЧ_КорректировкаРеализации());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"),
			ТекстЗапросаТЧ_АктОбОказанииПроизводственныхУслуг());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.ОказаниеУслуг"),
			ТекстЗапросаТЧ_ОказаниеУслуг());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"),
			ТекстЗапросаТЧ_ОтчетКомиссионераОПродажах());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"),
			ТекстЗапросаТЧ_ВозвратТоваровПоставщику());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.РеализацияУслугПоПереработке"),
			ТекстЗапросаТЧ_РеализацияУслугПоПереработке());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.СчетФактураВыданный"),
			ТекстЗапросаТЧ_СчетФактураВыданный_Авансы());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.СчетНаОплатуПокупателю"),
			ТекстЗапросаТЧ_СчетНаОплатуПокупателю());
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.ПередачаОС"),
			?(ИспользуетсяУчетПрослеживаемыхТоваров(), ТекстЗапросаТЧ_ПередачаОС_Прослеживаемость(), ТекстЗапросаТЧ_ПередачаОС()));
		
		ТекстыЗапросов.Вставить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"),
			ТекстЗапросаТЧ_ОтчетКомитентуОПродажах_Вознаграждение());
		
		ДополнитьТекстыЗапросовПоТабличнойЧастиАренда(ТекстыЗапросов);
		
		Результат = ТекстыЗапросов.Получить(ТипСсылки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТабличнаяЧастьДокумента(СсылкаНаОбъект, СчетФактура)
	
	ТекстЗапроса = ТекстЗапросаПоТабличнойЧасти(СсылкаНаОбъект, СчетФактура);
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		
		Ошибка = "Не удалось получить данные табличной части документа (%1)!";
		
		Ошибка = СтрШаблон(Ошибка, СсылкаНаОбъект);
		
		ИмяСобытия = НСтр("ru = 'Диадок'; en = 'Diadoc'");
		
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			СсылкаНаОбъект.Метаданные(),
			СсылкаНаОбъект,
			Ошибка);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	КолонкаКодаТовараИзТЧ			 = "НЕОПРЕДЕЛЕНО";
	КолонкаКодаТовараИзШапки		 = "НЕОПРЕДЕЛЕНО"; // Для случая, когда номенклатура в шапке (ОказаниеУслуг)
	КолонкаИдентификаторСтрокиИзТЧ	 = "НЕОПРЕДЕЛЕНО"; // Для прослеживаемости
	
	ИмяКолонкиКод = ИмяКолонкиКодТовара();
	Если ЗначениеЗаполнено(ИмяКолонкиКод) Тогда 
		КолонкаКодаТовараИзТЧ	 = "Т.Номенклатура." + ИмяКолонкиКод;
		КолонкаКодаТовараИзШапки = "Т.Ссылка.Номенклатура." + ИмяКолонкиКод;
	КонецЕсли;
	
	ТабличныеЧастиРеализации = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти;
	Если ЕстьРеквизитМетаданных(ТабличныеЧастиРеализации.Товары, "ИдентификаторСтроки") Тогда
		КолонкаИдентификаторСтрокиИзТЧ = "Т.ИдентификаторСтроки";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КодНоменклатурыИзТЧ"			 , КолонкаКодаТовараИзТЧ);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КодНоменклатурыИзШапки"		 , КолонкаКодаТовараИзШапки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НомерГТДПредставление"		 , ТекстЗапросаТЧ_НомерГТДПредставление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтрокиИзТЧ"		 , КолонкаИдентификаторСтрокиИзТЧ);
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЭтоИсправление = ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации");
	Если ЭтоИсправление Тогда
		//про формировании ИСФ, торг-12 или акта на основании корректировки
		//удалим строки с пустой суммой
		УдалитьСтрокиТабличнойЧастиБезСуммы(Результат);
	КонецЕсли;
	
	ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоРеализации(Результат, СсылкаНаОбъект);
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьСтрокиТабличнойЧастиБезСуммы(ТоварыПоДокументу)
	
	Индекс = 0;
	Пока Индекс < ТоварыПоДокументу.Количество() Цикл
		ВыборкаТЧ = ТоварыПоДокументу[Индекс];
		Если ВыборкаТЧ.Сумма = 0 Тогда 
			ТоварыПоДокументу.Удалить(Индекс);
		Иначе 
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Формирует текст запроса для получения табличной части корректировочного документа.
// Аналог функции УчетНДС.ТекстЗапросаДанныеДляПечатиКорректировочныхСчетовФактур
//
// Параметры:
//  НомераТаблиц - Структура - содержит:
//    * Ключ - имя таблицы
//    * Значение - индекс результата запроса при выполнении пакета запросов
// 
// Возвращаемое значение:
//  Строка.
//
Функция ТекстЗапросаТаблицаКорректировочногоДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерТабЧасти КАК НомерТабЧасти,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Товар КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ТаблицаДокумента.ТоварАртикул
	|		ИНАЧЕ ТаблицаДокумента.ТоварКод
	|	КОНЕЦ КАК НоменклатураКод,
	|	ТаблицаДокумента.ТоварНаименование КАК НоменклатураПредставление,
	|	ТаблицаДокумента.ТоварКодТНВЭД КАК ТоварКодТНВЭД,
	|	ТаблицаДокумента.ТоварКодТНВЭДДоИзменения КАК ТоварКодТНВЭДДоИзменения,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ТаблицаДокумента.КоличествоДоИзменения КАК КоличествоДоИзменения,
	|	ТаблицаДокумента.КоличествоПослеИзменения КАК КоличествоПослеИзменения,
	|	ТаблицаДокумента.ЦенаДоИзменения КАК ЦенаДоИзменения,
	|	ТаблицаДокумента.ЦенаПослеИзменения КАК ЦенаПослеИзменения,
	|	ТаблицаДокумента.СтоимостьБезНДСДоИзменения КАК СтоимостьБезНДСДоИзменения,
	|	ТаблицаДокумента.СтоимостьБезНДСПослеИзменения КАК СтоимостьБезНДСПослеИзменения,
	|	&СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
	|	&СтавкаНДСПослеИзменения КАК СтавкаНДСПослеИзменения,
	|	ТаблицаДокумента.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
	|	ТаблицаДокумента.СуммаНДСПослеИзменения КАК СуммаНДСПослеИзменения,
	|	ТаблицаДокумента.СтоимостьСНДСДоИзменения КАК СтоимостьСНДСДоИзменения,
	|	ТаблицаДокумента.СтоимостьСНДСПослеИзменения КАК СтоимостьСНДСПослеИзменения,
	|	ТаблицаДокумента.РазницаБезНДСУвеличение КАК РазницаБезНДСУвеличение,
	|	ТаблицаДокумента.РазницаБезНДСУменьшение КАК РазницаБезНДСУменьшение,
	|	ТаблицаДокумента.РазницаНДСУвеличение КАК РазницаНДСУвеличение,
	|	ТаблицаДокумента.РазницаНДСУменьшение КАК РазницаНДСУменьшение,
	|	ТаблицаДокумента.РазницаСНДСУвеличение КАК РазницаСНДСУвеличение,
	|	ТаблицаДокумента.РазницаСНДСУменьшение КАК РазницаСНДСУменьшение,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|				ИЛИ ТаблицаДокумента.НомерГТД = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТаблицаДокумента.НомерГТД
	|	КОНЕЦ КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|				ИЛИ ТаблицаДокумента.СтранаПроисхождения = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТаблицаДокумента.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	&ИдентификаторСтрокиТовары КАК ИдентификаторСтроки,
	|	&СуммаАкцизаДоИзменения КАК АкцизДоИзменения,
	|	&СуммаАкцизаПослеИзменения КАК Акциз
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ТаблицаДокумента.Товар = Номенклатура.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабЧасти,
	|	НомерСтроки";
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	
	Выражение_СтавкаНДСДоИзменения = "ТаблицаДокумента.СтавкаНДС";
	Выражение_СтавкаНДСПослеИзменения = "ТаблицаДокумента.СтавкаНДС";
	Если СравнитьВерсии(ВерсияБП, "3.0.67") >= 0 Тогда
		Выражение_СтавкаНДСДоИзменения = "ТаблицаДокумента.СтавкаНДСДоИзменения";
		Выражение_СтавкаНДСПослеИзменения = "ТаблицаДокумента.СтавкаНДСПослеИзменения";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтавкаНДСДоИзменения", Выражение_СтавкаНДСДоИзменения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтавкаНДСПослеИзменения", Выражение_СтавкаНДСПослеИзменения);
	
	Если МетодСервера(,"СуществуетОбъектМетаданных", "Документ.КорректировкаРеализации.ТабличнаяЧасть.Товары.Реквизит.ИдентификаторСтроки") Тогда
		КолонкаИдентификаторСтрокиТовары = "ТаблицаДокумента.ИдентификаторСтроки";
	Иначе
		КолонкаИдентификаторСтрокиТовары = "НЕОПРЕДЕЛЕНО";
	КонецЕсли; 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтрокиТовары", КолонкаИдентификаторСтрокиТовары);
	
	МетаданныеТчТоварыКорректировкиРеализации = Метаданные.Документы.КорректировкаРеализации.ТабличныеЧасти.Товары;
	
	ЕстьАкцизДоИзменения = ЕстьРеквизитОбъектаЛок("СуммаАкцизаДоИзменения", МетаданныеТчТоварыКорректировкиРеализации);
	ЕстьАкциз = ЕстьРеквизитОбъектаЛок("СуммаАкциза", МетаданныеТчТоварыКорректировкиРеализации);
	ЕстьКодыВидовПодакцизныхТоваров = Метаданные.Справочники.Найти("КодыВидовПодакцизныхТоваров") <> Неопределено;
	
	Если ЕстьАкцизДоИзменения
		И ЕстьКодыВидовПодакцизныхТоваров Тогда
		Выражение_СуммаАкцизаДоИзменения =
			"ВЫБОР
			|	КОГДА ТаблицаДокумента.Товар.КодВидаПодакцизногоТовара <> ЗНАЧЕНИЕ(Справочник.КодыВидовПодакцизныхТоваров.ПустаяСсылка)
			|		ТОГДА ТаблицаДокумента.СуммаАкцизаДоИзменения
			|	ИНАЧЕ НЕОПРЕДЕЛЕНО
			|КОНЕЦ";
	ИначеЕсли ЕстьАкцизДоИзменения Тогда
		Выражение_СуммаАкцизаДоИзменения =
			"ВЫБОР
			|	КОГДА ТаблицаДокумента.СуммаАкцизаДоИзменения <> 0
			|		ТОГДА ТаблицаДокумента.СуммаАкцизаДоИзменения
			|	ИНАЧЕ НЕОПРЕДЕЛЕНО
			|КОНЕЦ";
	Иначе
		Выражение_СуммаАкцизаДоИзменения = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	Если ЕстьАкциз
		И ЕстьКодыВидовПодакцизныхТоваров Тогда
		Выражение_СуммаАкцизаПослеИзменения =
			"ВЫБОР
			|	КОГДА ТаблицаДокумента.Товар.КодВидаПодакцизногоТовара <> ЗНАЧЕНИЕ(Справочник.КодыВидовПодакцизныхТоваров.ПустаяСсылка)
			|		ТОГДА ТаблицаДокумента.СуммаАкцизаПослеИзменения
			|	ИНАЧЕ НЕОПРЕДЕЛЕНО
			|КОНЕЦ";
	ИначеЕсли ЕстьАкциз Тогда
		Выражение_СуммаАкцизаПослеИзменения =
			"ВЫБОР
			|	КОГДА ТаблицаДокумента.СуммаАкцизаПослеИзменения <> 0
			|		ТОГДА ТаблицаДокумента.СуммаАкцизаПослеИзменения
			|	ИНАЧЕ НЕОПРЕДЕЛЕНО
			|КОНЕЦ";
	Иначе
		Выражение_СуммаАкцизаПослеИзменения = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАкцизаДоИзменения", Выражение_СуммаАкцизаДоИзменения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАкцизаПослеИзменения", Выражение_СуммаАкцизаПослеИзменения);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаКорректируемыеНомераСтрок(НомераТаблиц)
	
	НомераТаблиц.Вставить("КорректируемыеНомераСтрок", НомераТаблиц.Количество());
	
	ТекстЗапроса = РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйКорректируемыеНомераСтрок.Ссылка КАК СчетФактура,
	|	СчетФактураВыданныйКорректируемыеНомераСтрок.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйКорректируемыеНомераСтрок.НомерИсходнойСтроки КАК НомерИсходнойСтроки
	|ИЗ
	|	Документ.СчетФактураВыданный.КорректируемыеНомераСтрок КАК СчетФактураВыданныйКорректируемыеНомераСтрок
	|ГДЕ
	|	СчетФактураВыданныйКорректируемыеНомераСтрок.Ссылка = &СчетФактура
	|	И СчетФактураВыданныйКорректируемыеНомераСтрок.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьПараметрыЗапросаПоТабличнойЧастиКорректировочногоДокументаАренда(Запрос, ДокументОснование)
	
	Если Не ЭтоУправлениеАрендой()
		Или ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Возврат;
	КонецЕсли;
	
	ЕдиницаПоУмолчанию = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	СчетФактураСводный = Ложь;
	
	Если ТипЗнч(ДокументОснование.ДокументРеализации) = Тип("ДокументСсылка.АР_НачислениеАренднойПлаты") Тогда
		
		ЭтоПени = Ложь;
		ЭтоАренда = Истина;
		
		НачалоПериода = ДокументОснование.ДокументРеализации.НачалоПериода;
		ОкончаниеПериода = КонецДня(ДокументОснование.ДокументРеализации.ОкончаниеПериода);
		ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
		
	ИначеЕсли ТипЗнч(ДокументОснование.ДокументРеализации) = Тип("ДокументСсылка.АР_НачислениеПени") Тогда
		
		ЭтоПени = Истина;
		ЭтоАренда = Истина;
		ПредставлениеПериода = Формат(ДокументОснование.Дата, "ДФ='дд.ММ.гггг'");
		
	Иначе
		
		ЭтоПени = Ложь;
		ЭтоАренда = Ложь;
		ПредставлениеПериода = "";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭтоПени", ЭтоПени);
	Запрос.УстановитьПараметр("ЭтоАренда", ЭтоАренда);
	Запрос.УстановитьПараметр("СчетФактураСводный", СчетФактураСводный);
	Запрос.УстановитьПараметр("ПредставлениеПериода", ПредставлениеПериода);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", ЕдиницаПоУмолчанию);
	
КонецПроцедуры

Функция ТабличнаяЧастьКорректировочногоДокумента(СсылкаНаОбъект, СчетФактура)
	
	НомераТаблиц = Новый Структура;
	
	ИмяОбъекта = СсылкаНаОбъект.Метаданные().Имя;
	МенеджерОбъекта = Документы[ИмяОбъекта];
	
	ЕстьТЧКорректируемыеНомераСтрок = ЕстьКорректируемыеНомераСтрокВСчетФактураВыданный();
	ЕстьПередачаТоваровВСоставеРабот = ИспользуетсяПередачаПрослеживаемыхМатериаловВСоставеРабот();
	ЭтоКорректировка = ЭтоКорректировкаРеализации(СсылкаНаОбъект);
	
	ЧастиЗапроса = Новый Массив;
	
	Если ЭтоКорректировка
		И ЕстьПередачаТоваровВСоставеРабот Тогда
		
		// Игнорируем флаг в КРТУ, чтобы исключить добавление товаров, передаваемых в составе работ
		ПередачаТоваровВСоставеРабот = Ложь;
		ЧастиЗапроса.Добавить(МенеджерОбъекта.ТекстЗапросаДанныеДляПечатиКорректировочныхСчетовФактур(НомераТаблиц, ПередачаТоваровВСоставеРабот));
		
	Иначе
		
		ЧастиЗапроса.Добавить(МенеджерОбъекта.ТекстЗапросаДанныеДляПечатиКорректировочныхСчетовФактур(НомераТаблиц));
		
	КонецЕсли;
	
	ЧастиЗапроса.Добавить(ТекстЗапросаТаблицаКорректировочногоДокумента(НомераТаблиц));
	Если ЕстьТЧКорректируемыеНомераСтрок Тогда
		ЧастиЗапроса.Добавить(ТекстЗапросаТаблицаКорректируемыеНомераСтрок(НомераТаблиц));
	КонецЕсли;
	
	ПредставлениеПоставщика = "";
	ИННКПППоставщика = "";
	АдресПоставщика = "";
	ДопКолонкаПФ = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	ИспользуетсяУчетПрослеживаемыхТоваров = ИспользуетсяУчетПрослеживаемыхТоваров();

	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПредставлениеПоставщика", ПредставлениеПоставщика);
	Запрос.УстановитьПараметр("ИННКПППоставщика", ИННКПППоставщика);
	Запрос.УстановитьПараметр("АдресПоставщика", АдресПоставщика);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", ДопКолонкаПФ);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	ДобавитьПараметрыЗапросаПоТабличнойЧастиКорректировочногоДокументаАренда(Запрос, СсылкаНаОбъект);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПоТЧ = РезультатыЗапроса[НомераТаблиц.ТаблицаДокумента];
	ВыгрузкаТЧ = РезультатЗапросаПоТЧ.Выгрузить();
	
	СведенияОПрослеживаемости = Неопределено;
	Если ИспользуетсяУчетПрослеживаемыхТоваров 
		И НомераТаблиц.Свойство("СведенияОПрослеживаемости") Тогда
		СведенияОПрослеживаемости = РезультатыЗапроса[НомераТаблиц.СведенияОПрослеживаемости].Выгрузить();
	КонецЕсли;
	
	КорректируемыеНомераСтрок = Неопределено;
	Если ЕстьТЧКорректируемыеНомераСтрок Тогда
		КорректируемыеНомераСтрок = РезультатыЗапроса[НомераТаблиц.КорректируемыеНомераСтрок].Выгрузить();
	КонецЕсли;
	
	Результат = ИнициализацияТаблицыСтрокТовары(Истина);
	
	НомерСтроки = 1;
	
	Для каждого СтрокаТЧ Из ВыгрузкаТЧ Цикл
		
		Если СтрокаТЧ.КоличествоДоИзменения = 0 Тогда
			СтрокаТЧ.ЦенаДоИзменения = 0;
		ИначеЕсли СтрокаТЧ.ЦенаДоИзменения = 0 Тогда
			СтрокаТЧ.ЦенаДоИзменения = Окр(СтрокаТЧ.СтоимостьБезНДСДоИзменения / СтрокаТЧ.КоличествоДоИзменения, 2);
		КонецЕсли;
		
		Если СтрокаТЧ.КоличествоПослеИзменения = 0 Тогда
			СтрокаТЧ.ЦенаПослеИзменения = СтрокаТЧ.ЦенаДоИзменения;
		ИначеЕсли СтрокаТЧ.ЦенаПослеИзменения = 0 Тогда
			СтрокаТЧ.ЦенаПослеИзменения = Окр(СтрокаТЧ.СтоимостьБезНДСПослеИзменения / СтрокаТЧ.КоличествоПослеИзменения, 2);
		КонецЕсли;
		
		СтрокаТовары = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТЧ);
		
		СтрокаТовары.НомерИсходнойСтроки = СтрокаТЧ.НомерСтроки;
		
		СтрокаТовары.КодНоменклатуры	= СтрокаТЧ.НоменклатураКод;
		СтрокаТовары.Количество			= СтрокаТЧ.КоличествоПослеИзменения;
		СтрокаТовары.Цена				= СтрокаТЧ.ЦенаПослеИзменения;
		СтрокаТовары.Сумма				= СтрокаТЧ.СтоимостьБезНДСПослеИзменения;
		СтрокаТовары.СуммаНДС			= СтрокаТЧ.СуммаНДСПослеИзменения;
		СтрокаТовары.СтавкаНДС			= СтрокаТЧ.СтавкаНДСПослеИзменения;
		СтрокаТовары.СуммаДоИзменения	= СтрокаТЧ.СтоимостьБезНДСДоИзменения;
		СтрокаТовары.СуммаВключаетНДС	= Ложь;
		СтрокаТовары.ДокументОтгрузки	= СсылкаНаОбъект;
		
		СтрокаТовары.ЕдиницаИзмеренияДоИзменения = СтрокаТЧ.ЕдиницаИзмерения;
		СтрокаТовары.ЭтоУслуга = ЭтоНоменклатураУслуга(СтрокаТЧ.Номенклатура);
		
		Если СведенияОПрослеживаемости <> Неопределено Тогда
			ЗаполнитьСведенияПрослеживаемостиДляОтправкиПоКорректировке(СтрокаТовары, СтрокаТЧ, СведенияОПрослеживаемости);
		КонецЕсли;
		
		СтрокаТовары.НомерИсходнойСтроки = 0;
		Если КорректируемыеНомераСтрок <> Неопределено Тогда
			СтрокаСНомером = КорректируемыеНомераСтрок.Найти(НомерСтроки, "НомерСтроки");
			Если СтрокаСНомером <> Неопределено Тогда
				СтрокаТовары.НомерИсходнойСтроки = СтрокаСНомером.НомерИсходнойСтроки;
			КонецЕсли;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВидКИ(ЮрФизЛицо, ЮрАдрес, УДАЛИТЬ_ИндивидуальныйПредприниматель = Ложь) Экспорт
	
	ВидАдреса = Неопределено;
	
	ТипЮрФизЛица = ТипЗнч(ЮрФизЛицо);
	
	Если ТипЮрФизЛица = Тип("СправочникСсылка.Организации") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "ЮрАдресОрганизации", "ФактАдресОрганизации");
		
	ИначеЕсли ТипЮрФизЛица = Тип("СправочникСсылка.Контрагенты") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "ЮрАдресКонтрагента", "ФактАдресКонтрагента");
		
	ИначеЕсли ТипЮрФизЛица = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "АдресПоПропискеФизическиеЛица", "АдресМестаПроживанияФизическиеЛица");
		
	ИначеЕсли ТипЮрФизЛица = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 
		
		ВидАдреса = "ФактическийАдресПодразделенияОрганизаций";
		
	Иначе 
		ВызватьИсключение НСтр("ru = 'Некорректный параметр функции ""ПолучитьВидКИ""'");
	КонецЕсли;
	
	Результат = Справочники.ВидыКонтактнойИнформации[ВидАдреса];
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеТЧ(Документы,
	ЭтоКСФ = Ложь,
	НеИспользуется_ВалютаРегламентированногоУчета = Неопределено,
	НеИспользуется_КолонкаКодаТовараИзТЧ = Неопределено,
	НеИспользуется_ФормированиеСФ = Неопределено,
	СчетФактура = Неопределено) Экспорт
	
	//Документы - список документов либо одичночнй документ
	Если СчетФактуранаАванс(СчетФактура) Тогда 
		ДокументыИтератор= Новый списокЗначений;
		ДокументыИтератор.Добавить(СчетФактура);
	ИначеЕсли ТипЗнч(Документы) = Тип("СписокЗначений") Тогда 
		ДокументыИтератор= Документы;
	Иначе 
		ДокументыИтератор= Новый СписокЗначений;
		ДокументыИтератор.Добавить(Документы);
	КонецЕсли;
	
	Товары = ИнициализацияТаблицыСтрокТовары(ЭтоКСФ);
	
	Для Каждого Элемент из ДокументыИтератор Цикл
		
		СсылкаНаОбъект = Элемент.Значение;
		
		Если ЭтоКСФ Тогда
			ТоварыПоДокументу = ТабличнаяЧастьКорректировочногоДокумента(СсылкаНаОбъект, СчетФактура);
		Иначе
			ТоварыПоДокументу = ТабличнаяЧастьДокумента(СсылкаНаОбъект, СчетФактура);
		КонецЕсли;
		
		ЕстьКолонка_НомерГТДПредставление = (ТоварыПоДокументу.Колонки.Найти("НомерГТДПредставление") <> Неопределено);
		
		Для каждого Стр из ТоварыПоДокументу Цикл 
			
			Стр2 = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(Стр2, Стр);
			
			Если Не ЗначениеЗаполнено(Стр2.НоменклатураПредставление) Тогда 
				Стр2.НоменклатураПредставление = ПредставлениеНоменклатуры(Стр2.Номенклатура, Стр2.Характеристика);
			КонецЕсли;
			
			Если ЕстьКолонка_НомерГТДПредставление И ЗначениеЗаполнено(Стр.НомерГТДПредставление) Тогда
				Стр2.НомерГТД = Стр.НомерГТДПредставление;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.СтранаПроисхождения) Тогда
				Если (НЕ ЗначениеЗаполнено(Стр.НомерГТД) ИЛИ ПустаяСтрока(Стр.НомерГТД.Код)) 
					И МетодСервера(,"СтранаЧленТС", Стр.СтранаПроисхождения.Код)
					И НЕ Стр2.ПрослеживаемыйТовар Тогда
					Стр2.СтранаПроисхождения = Справочники.СтраныМира.ПустаяСсылка();
				КонецЕсли;
			//Иначе
			//	Стр2.НомерГТД = Справочники.НомераГТД.ПустаяСсылка();
			КонецЕсли;
			
			Стр2.ДокументОтгрузки = СсылкаНаОбъект;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Товары;
	
КонецФункции

Функция ПолучитьБанковскийСчет(Док)
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ДокТоварный = Док.ДокументРеализации;
		
		Пока ТипЗнч(ДокТоварный) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
			ДокТоварный = ДокТоварный.ДокументРеализации;
		КонецЦикла;
		
	ИначеЕсли Метаданные.Документы.Найти("АР_НачислениеАренднойПлаты") <> Неопределено
		И ТипЗнч(Док) = Тип("ДокументСсылка.АР_НачислениеАренднойПлаты") Тогда
		
		Результат = Док.СчетОрганизации;
		
		Возврат Результат;
		
	Иначе
		
		ДокТоварный = Док;
		
	КонецЕсли;
	
	Возврат ?(ДокТоварный.Метаданные().Реквизиты.найти("БанковскийСчетОрганизации") = Неопределено, Неопределено, ДокТоварный.БанковскийСчетОрганизации);
	
КонецФункции

Функция ПолучитьПодразделениеИзДокумента(ДокСсылка)
	Возврат ?(ДокСсылка.ПодразделениеОрганизации.ОбособленноеПодразделение, ДокСсылка.ПодразделениеОрганизации.НаименованиеПолное, "");
КонецФункции

Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СчетСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
  		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
      	|ИЗ
      	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
     	|ГДЕ
      	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
      	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
				  
	Запрос.УстановитьПараметр("СчетНаОплатуПокупателю", СчетСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");		
	
КонецФункции

Функция ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(СчетФактура) Экспорт
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.ДоговорКонтрагента КАК Договор
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК РОТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Документ
	|			ПО РОТ.ДокументОтгрузки = Документ.Ссылка
	|		ПО Таблица.ДокументОснование = РОТ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПоПереработке КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДоговорКонтрагента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК Документ
	|		ПО Таблица.ДокументОснование = Документ.Ссылка
	|ГДЕ
	|	Таблица.Ссылка = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Если МетодСервера(,"СуществуетОбъектМетаданных", "Документ.СчетФактураВыданный.ТабличнаяЧасть.ДокументыОснования") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.СчетФактураВыданный", "Документ.СчетФактураВыданный.ДокументыОснования");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ДокументСсылка) Экспорт
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Результат = Неопределено;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК Т
	|ГДЕ
	|	Т.ДокументОснование = &ДокументОснование
	|	И НЕ Т.Ссылка.ПометкаУдаления";
	
	Если Метаданные.Документы.СчетФактураВыданный.ТабличныеЧасти.Найти("ДокументыОснования") = Неопределено Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
									"Документ.СчетФактураВыданный.ДокументыОснования КАК Т", 
									"Документ.СчетФактураВыданный КАК Т");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
									"Т.Ссылка.ПометкаУдаления", 
									"Т.ПометкаУдаления");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализации(ДокументСсылка) Экспорт
	
	ДокументОснование= Неопределено;
	
	Если НЕ ДокументСсылка.Метаданные().Реквизиты.Найти("ДокументРеализации") = Неопределено Тогда
		ДокументОснование= ДокументСсылка.ДокументРеализации;
	Иначе
		ДокументОснование= ДокументСсылка.ДокументОснование;
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(ДокументСсылка) Экспорт
	
	Возврат ДокументСсылка.СчетНаОплатуПокупателю;			
	
КонецФункции

Функция ПолучитьЗаказПокупателяНаОснованииРТУ(ДокументСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСФОснованиеПоИСФ_КСФ(ИСФ_КСФ) Экспорт
	
	ДокОснование= ИСФ_КСФ.ДокументыОснования[0].ДокументОснование;
	Если ДокОснование.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
		ДокОснование= ДокОснование.ДокументРеализации;
	Иначе 	
		Пока  ТипЗнч(ДокОснование) = Тип("ДокументСсылка.КорректировкаРеализации") 
			И ДокОснование.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Цикл 
			
			ДокОснование= ДокОснование.ДокументРеализации;
			
		КонецЦикла;
	КонецЕсли;	
	
	Запрос= Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |	СчетФактураВыданныйДокументыОснования.Ссылка
        |ИЗ
        |	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
        |ГДЕ
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
		|	И СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления = ЛОЖЬ";
        			
	Запрос.УстановитьПараметр("Документоснование", ДокОснование);
	Выборка= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Неопределено;

КонецФункции

Функция ПолучитьДанныеДляФормированияУПД(ДокСсылка, ПараметрыФормирования)
	
	ФункцияУПД = ПараметрыФормирования.ФункцияДокумента; 
	
	Если ФункцияУПД = "СЧФДОП" ИЛИ ФункцияУПД = "СЧФ" Тогда
		
		ДанныеДляФормированияСчетФактуры = СформироватьДанныеДляПечати(ДокСсылка, Ложь);
		
		ДанныеДляФормированияУПД = Новый Структура("ДанныеШапки", Новый Структура);
		
		Для Каждого КлючИЗначение Из ДанныеДляФормированияСчетФактуры Цикл
			
			Если КлючИЗначение.Ключ = "ТабличнаяЧасть" Тогда
				ДанныеДляФормированияУПД.Вставить("ТаблицаТоваров", КлючИЗначение.Значение);
			Иначе
				ДанныеДляФормированияУПД.ДанныеШапки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("СчетФактураСсылка", ДокСсылка);
		
		ТаблицаНакладных = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокСсылка);
		Если ЗначениеЗаполнено(ТаблицаНакладных) Тогда
			Если ФункцияУПД = "СЧФДОП" Тогда
				ДокРеализации = ПолучитьИсправляемыйДокументРеализации(ТаблицаНакладных[0].Ссылка);
				ДанныеДляФормированияУПД.ДанныеШапки.Вставить("ДатаОтгрузки", ДокРеализации.Дата);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Шапка			 = ДанныеШапки(ДокСсылка);
		ДокументОтгрузки = ДокументОтгрузки(ДокСсылка);
		ТабличнаяЧасть	 = ПолучитьДанныеТЧ(ДокументОтгрузки, , , , Ложь);
		ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
		//ЗаполнитьДанныеОбособленногоПодразделения(ДокСсылка, Шапка, Ложь);
		
		Если Шапка.НДСИсчисляетсяНалоговымАгентом Тогда
			МетодСервера(, "ЗаполнитьВТаблице_СтавкаНДС_ИсчНалАг", ТабличнаяЧасть);
		КонецЕсли;
		
		ДанныеДляФормированияУПД = Новый Структура;
		ДанныеДляФормированияУПД.Вставить("ДанныеШапки", Шапка);
		ДанныеДляФормированияУПД.Вставить("ТаблицаТоваров", ТабличнаяЧасть);
		
	КонецЕсли;
	
	Если ФункцияУПД = "СЧФДОП" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "InvoiceAndBasic");
	ИначеЕсли ФункцияУПД = "ДОП" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "Basic");
	ИначеЕсли ФункцияУПД = "СЧФ" Тогда
		ДанныеДляФормированияУПД.ДанныеШапки.Вставить("Функция", "Invoice");
	КонецЕсли;
	ДанныеДляФормированияУПД.ДанныеШапки.Вставить("ДатаНомерСвидетельстваОРегистрации", ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДанныеДляФормированияУПД.ДанныеШапки.Организация));
	
	Возврат ДанныеДляФормированияУПД;
	
КонецФункции

Функция ДанныеДляФормированияУКД(ДокСсылка, ДопПараметры)
	
	Если ДопПараметры.ФункцияУПД = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияУПД = "КСЧФ" Тогда
		
		СчетФактура 	 = ДокСсылка;
		ТаблицаНакладных = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокСсылка);
		Накладная		 = ТаблицаНакладных[0].Ссылка;
		
	Иначе
		
		СчетФактура = Неопределено;
		Накладная	= ДокументОтгрузки(ДокСсылка);
		
		ТаблицаНакладных = Новый ТаблицаЗначений;
		ТаблицаНакладных.Колонки.Добавить("Ссылка");
		ТаблицаНакладных.Колонки.Добавить("Дата");
		ТаблицаНакладных.Колонки.Добавить("Договор");
		
		НоваяСтрока = ТаблицаНакладных.Добавить();
		НоваяСтрока.Ссылка  = Накладная;
		НоваяСтрока.Дата  	= Накладная.Дата;
		НоваяСтрока.Договор = Накладная.ДоговорКонтрагента;
		
	КонецЕсли;
	
	СписокДокументыОснования = Новый СписокЗначений;
	СписокДокументыОснования.ЗагрузитьЗначения(ТаблицаНакладных.ВыгрузитьКолонку("Ссылка"));
	
	Шапка			 = ДанныеШапки(ДокСсылка);
	ТабличнаяЧасть	 = ПолучитьДанныеТЧ(СписокДокументыОснования, Истина, , , Ложь, СчетФактура);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	СписокДокументыОснования = Неопределено;
	
	Шапка.Вставить("Функция", ?(ДопПараметры.ФункцияУПД = "КСЧФДИС", "InvoiceAndBasic", ?(ДопПараметры.ФункцияУПД = "КСЧФ", "Invoice", "Basic")));
	
	Если ДопПараметры.ФункцияУПД = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияУПД = "ДИС" Тогда
		ДатаУведомления = ТаблицаНакладных[0].Дата;
		Если ДатаУведомления <> Шапка.ДатаНомерДокумента.ДатаДокумента Тогда
			Шапка.Вставить("ДатаУведомления", ДатаУведомления);
		КонецЕсли;
	КонецЕсли;
	
	Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(Накладная), "СопроводительныеДокументы") Тогда
		Шапка.Вставить("ИныеСведенияОбИзмененииСтоимости", Накладная.СопроводительныеДокументы);
	КонецЕсли;
	
	ДобавленныеПередаточныеДокументы	= Новый Соответствие;
	
	ТипПередаточногоДокумента = "УПД ";
	
	Шапка.Вставить("ОснованияПередачи", Новый Массив);
	Шапка.Вставить("ПередаточныеДокументы", Новый Массив);
	Шапка.Вставить("РеквизитыПередаточныхДокументов", Новый Массив);
	
	ДобавленныеОснования = Новый Соответствие;
	
	Для Каждого СтрокаТЗ Из ТаблицаНакладных Цикл
		
		СтруктураОснования = ЗаполнитьСтруктуруОснования(СтрокаТЗ.Договор, Истина);
	
		Если ЗначениеЗаполнено(СтруктураОснования.GroundDate) И ЗначениеЗаполнено(СтруктураОснования.GroundName) Тогда
			
			Если ДобавленныеОснования[СтруктураОснования.Основание] <> Истина Тогда
				
				ДобавленныеОснования.Вставить(СтруктураОснования.Основание, Истина);
				
				ItemCorrectionBases = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CorrectionBase");
				ItemCorrectionBases.BaseDocumentName   = СтруктураОснования.GroundName;
				ItemCorrectionBases.BaseDocumentNumber = СокрЛП(СтруктураОснования.GroundNumber);
				ItemCorrectionBases.BaseDocumentDate   = СтруктураОснования.GroundDate;
				
				Шапка.ОснованияПередачи.Добавить(ItemCorrectionBases);
				
			КонецЕсли;
			
		КонецЕсли;
	
		ИсправляемыйДокументРеализации = ПолучитьИсправляемыйДокументРеализации(СтрокаТЗ.Ссылка);
		Если ТипЗнч(ИсправляемыйДокументРеализации) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
			
			СФВыданный = ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ИсправляемыйДокументРеализации);
			
			Если СФВыданный <> Неопределено Тогда
				ПередаточныйДокумент = СФВыданный;
			Иначе
				ПередаточныйДокумент = ИсправляемыйДокументРеализации;
			КонецЕсли;
			
		ИначеЕсли ДопПараметры.ФункцияУПД = "КСЧФДИС" Или ДопПараметры.ФункцияУПД = "КСЧФ" Тогда 
			
			ПередаточныйДокумент = ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ИсправляемыйДокументРеализации);
			
		Иначе
			ПередаточныйДокумент = ИсправляемыйДокументРеализации;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПередаточныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		Шапка.ПередаточныеДокументы.Добавить(ПередаточныйДокумент);
		
		Если ДобавленныеПередаточныеДокументы[ПередаточныйДокумент] <> Истина Тогда
			
			ДобавленныеПередаточныеДокументы.Вставить(ПередаточныйДокумент, Истина);
			
			Новый_BaseDocument = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_BaseDocumentName");
			
			Новый_BaseDocument.BaseDocumentName		= ТипПередаточногоДокумента;
			Новый_BaseDocument.BaseDocumentNumber 	= ПредставлениеНомераОбъекта(ПередаточныйДокумент);
			Новый_BaseDocument.BaseDocumentDate 	= Формат(ПередаточныйДокумент.Дата, "ДФ=dd.MM.yyyy");
			
			Шапка.РеквизитыПередаточныхДокументов.Добавить(Новый_BaseDocument);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Шапка.НДСИсчисляетсяНалоговымАгентом Тогда
		МетодСервера(, "ЗаполнитьВТаблице_СтавкаНДС_ИсчНалАг", ТабличнаяЧасть);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", 			Шапка);
	Результат.Вставить("ТабличнаяЧасть", 	ТабличнаяЧасть);
	
	Возврат Результат;
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура			 - ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт

	Результат		 = Неопределено;
	
	КонстантаОсуществляетсяРеализацияТоваровУслугЧерезКомиссионеров = Ложь;
	Если МетодСервера(, "ЕстьМетаданныеКонфигурации_ДД", "Константы.ОсуществляетсяРеализацияТоваровУслугЧерезКомиссионеров") Тогда
		КонстантаОсуществляетсяРеализацияТоваровУслугЧерезКомиссионеров = Константы.ОсуществляетсяРеализацияТоваровУслугЧерезКомиссионеров.Получить();
	КонецЕсли;
	
	КонстантаОсуществляетсяРеализацияТоваровУслугКомитентов = Ложь;
	Если МетодСервера(, "ЕстьМетаданныеКонфигурации_ДД", "Константы.ОсуществляетсяЗакупкаТоваровУслугДляКомитентов") Тогда
		КонстантаОсуществляетсяРеализацияТоваровУслугКомитентов = Константы.ОсуществляетсяЗакупкаТоваровУслугДляКомитентов.Получить();
	КонецЕсли;
	
	ВозможноЗаполнение = КонстантаОсуществляетсяРеализацияТоваровУслугКомитентов ИЛИ КонстантаОсуществляетсяРеализацияТоваровУслугЧерезКомиссионеров;
	
	Если ВозможноЗаполнение Тогда
		
		ДоговорКонтрагента = МетодСервера(, "ЗначениеРеквизитаОбъекта", СчетФактура, "ДоговорКонтрагента");
		
		Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			
			ДокументОснование = ДокументОснованиеСчетаФактуры(СчетФактура);
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				МетодСервера( , "ЕстьРеквизитИлиСвойствоОбъектаЛок", ДокументОснование, "ДоговорКонтрагента", ДоговорКонтрагента);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		
			ВидДоговора = МетодСервера(, "ЗначениеРеквизитаОбъекта", ДоговорКонтрагента, "ВидДоговора");
			
			Если КонстантаОсуществляетсяРеализацияТоваровУслугЧерезКомиссионеров
				И ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером") Тогда
				
				Результат = "4";
				
			ИначеЕсли КонстантаОсуществляетсяРеализацияТоваровУслугКомитентов
				И ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку") Тогда
				
				Результат = "6";
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСтруктуруОснования(ДоговорКонтрагента, ЭтоУПД)
	
	Ground = Новый Структура;
	Ground.Вставить("GroundName", 	"");
	Ground.Вставить("GroundNumber", "");
	Ground.Вставить("GroundDate", 	"");
	Ground.Вставить("Основание", 	"");
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			
		Если ЭтоУПД Тогда
			ПредставлениеДоговора= "Договор";
		Иначе
			ПредставлениеДоговора= ДоговорКонтрагента.Наименование;
		КонецЕсли;
			
		Ground.Вставить("GroundName", 	ПредставлениеДоговора);
		Ground.Вставить("GroundNumber", ДоговорКонтрагента.Номер);
		Ground.Вставить("GroundDate", 	ДоговорКонтрагента.Дата);
		Ground.Вставить("Основание", 	ДоговорКонтрагента);
		
	КонецЕсли;
	
	Возврат Ground;
	
КонецФункции

Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации)
	
	Если Не ЗначениеЗаполнено(ДокРеализации) Тогда 
		
		Результат = Неопределено;
		
	ИначеЕсли ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Результат = ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументРеализации);
		
	ИначеЕсли ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		И ЕстьРеквизитМетаданных(ДокРеализации.Метаданные(), "Сделка") 
		И (ТипЗнч(ДокРеализации.Сделка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			Или ТипЗнч(ДокРеализации.Сделка) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров")) Тогда
		
		Результат = ДокРеализации.Сделка;
					
	ИначеЕсли ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
		
		// Корректировка реализации может быть сформирована на основании счета-фактуры, 
		// если этот счет-фактура был выписан посредником (через отчет комиссионера о продажах)
		Накладные = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокРеализации);
		
		Если Накладные.Количество() > 0 Тогда 
			Результат = Накладные[0].Ссылка;
		КонецЕсли;
		
	Иначе
		
		Результат = ДокРеализации;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка)
	
	Перем ДоговорКонтрагента;
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ЗначениеПолучено =
		(МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ДокументСсылка, "ДоговорКонтрагента", ДоговорКонтрагента)
		И МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ДоговорКонтрагента, "УчетАгентскогоНДСПокупателем", Результат));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаРегламентированногоУчета() Экспорт
	
	Результат = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Возврат Результат;
	
КонецФункции

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ПечатьСчетаНаОплату");
							
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= "СчетЗаказ";
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры //ПередФормированиемПечатнойФормыСчетаНаОплату()

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ДокументСчетТовары.СуммаНДС) КАК СуммаНДС,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДокументСчетТовары.СтавкаНДС <> &Ставка_БезНДС
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьСтавкиСНДС
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.Товары КАК ДокументСчетТовары
		|ГДЕ
		|	ДокументСчетТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СчетНаОплату);
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Мета.СуммаНДС 		= Выборка.СуммаНДС;
		Мета.ДокументБезНДС = НЕ Выборка.ЕстьСтавкиСНДС;
		
	КонецЦикла;
	
	Мета.Сумма = СчетНаОплату.СуммаДокумента;
			
КонецПроцедуры // ПриЗаполненииМетыНеформализованногоСчетаНаОплату()

// См. метод "ПередФормированиемПечатнойФормыСверкиВзаиморасчетов" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПередФормированиемПечатнойФормыСверкиВзаиморасчетов(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.АктСверкиВзаиморасчетов");
							
	НоваяПФ = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	
	НоваяПФ.ИмяМакета 	= "АктСверки";
	НоваяПФ.ИмяВРЕГ		= ВРЕГ(НоваяПФ.ИмяМакета);
	НоваяПФ.Экземпляров	= 1;
							
КонецПроцедуры //ПередФормированиемПечатнойФормыСверкиВзаиморасчетов()

Функция ПараметрыСчетаФактуры(СчетФактура) Экспорт
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Результат = УчетНДСПереопределяемый.ПараметрыСчетаФактуры(СчетФактура);
	
	ВидСчетаФактуры = СчетФактура.ВидСчетаФактуры;
	
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		Или ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		Или ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, СчетФактура);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыСчетаНаОплату(ДокументСсылка) Экспорт
	
	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	СуммаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "СуммаДокумента");
	СуммаНДСДокумента = СуммаНДССчетаНаОплату(ДокументСсылка);
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаДокумента", СуммаДокумента);
	Результат.Вставить("СуммаНДСДокумента", СуммаНДСДокумента);
	
	Возврат Результат;
	
КонецФункции

// Получает сумму НДС счета на оплату с учетом скидки на весь документ
//
// Параметры:
//  СчетНаОплату - ДокументСсылка.СчетНаОплатуПокупателю - документ, по которому нужно получить сумму НДС
// 
// Возвращаемое значение:
//  Число - Сумма НДС
//
Функция СуммаНДССчетаНаОплату(СчетНаОплату)
	
	Результат = 0;
	
	РеквизитыСчета	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетНаОплату, "СуммаСкидки, СуммаВключаетНДС");
	СуммаСкидки		 = РеквизитыСчета.СуммаСкидки;
	СуммаВключаетНДС = РеквизитыСчета.СуммаВключаетНДС;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.Сумма КАК Сумма,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК Т
	|ГДЕ
	|	Т.Ссылка = &СчетНаОплату
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.НомерСтроки");
	
	Запрос.УстановитьПараметр("СчетНаОплату", СчетНаОплату);
	
	ТабличнаяЧасть = Запрос.Выполнить().Выгрузить();
	
	Если СуммаСкидки > 0 Тогда
		
		// Необходимо распределить сумму общей скидки на табличную часть,
		// чтобы получить фактическую сумму НДС
		
		ОбщаяСумма = 0;
		Коэффициенты = Новый Массив;
		
		Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
			
			Если СуммаВключаетНДС Тогда
				СуммаВсего = СтрокаТЧ.Сумма;
			Иначе
				СуммаВсего = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС;
			КонецЕсли;
			
			Коэффициенты.Добавить(СуммаВсего);
			
			ОбщаяСумма = ОбщаяСумма + СуммаВсего;
			
		КонецЦикла;
		
		СуммаСоСкидкой = ОбщаяСумма - СуммаСкидки;
		
		Если СуммаСоСкидкой > 0 Тогда
			
			ТочностьСуммы = 2;
			
			НовыеСуммы = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СуммаСоСкидкой, Коэффициенты, ТочностьСуммы);
			
			Для Индекс = 0 По НовыеСуммы.ВГраница() Цикл
				
				
				СтрокаТЧ		 = ТабличнаяЧасть[Индекс];
				ПроцентСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);
				НоваяСумма		 = НовыеСуммы[Индекс];
				НоваяСуммаНДС	 = УчетНДСКлиентСервер.РассчитатьСуммуНДС(НоваяСумма, Истина, ПроцентСтавкиНДС);
				Результат		 = Результат + Окр(НоваяСуммаНДС, ТочностьСуммы);
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Результат = ТабличнаяЧасть.Итог("СуммаНДС");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуммаНДССчетаНаОплатуСУчетомСкидки(ТабличнаяЧасть, СуммаСкидки, СуммаВключаетНДС)
	
	Результат = 0;
	
	Возврат Результат;
	
КонецФункции

Функция СуммаНДСРеализацииТоваровУслуг(РеализацияТоваровУслугСсылка)
	
	МетаданныеРТУ = РеализацияТоваровУслугСсылка.Метаданные();
			
	ОбъединитьВсе = "
					|
					| ОБЪЕДИНИТЬ ВСЕ
					|	";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
       |	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС
       |ИЗ
       |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
       |ГДЕ
       |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Если МетаданныеРТУ.ТабличныеЧасти.Найти("Услуги") <> Неопределено Тогда
		
		ТекстЗапросаУслуги = 
			"
			|ВЫБРАТЬ
			|	РеализацияТоваровУслугУслуги.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
			|ГДЕ
			|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка";
		
		Запрос.Текст = Запрос.Текст + ОбъединитьВсе + ТекстЗапросаУслуги;
		
		ТекстЗапросаУслуги = "";
		
	КонецЕсли;
	
	Если МетаданныеРТУ.ТабличныеЧасти.Найти("АгентскиеУслуги") <> Неопределено Тогда
		
		ТекстЗапросаАгентскиеУслуги = 
			"
			|ВЫБРАТЬ
			|	РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
			|ГДЕ
			|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка = &Ссылка";
		
		Запрос.Текст = Запрос.Текст + ОбъединитьВсе + ТекстЗапросаАгентскиеУслуги; 
		
		ТекстЗапросаАгентскиеУслуги = "";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", РеализацияТоваровУслугСсылка);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Результат = Выгрузка.Итог("СуммаНДС");
	
	Выгрузка = Неопределено;
	
	Возврат Результат;
	
КонецФункции

//} ПОЛУЧЕНИЕ ДАННЫХ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ РАБОТА С КОНТЕНТОМ

////////////////////////////////////////////////////////////////////////////////
//{ ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьСтруктурированноеОписаниеАдреса(AddressContent, СведенияОбОрганизации, ЮрФизЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса = "")
	
	ЗначенияПолей = ?(ЮрАдрес, СведенияОбОрганизации.ЗначенияПолейЮридическийАдрес, СведенияОбОрганизации.ЗначенияПолейФактическийАдрес);
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей) Тогда 
		
		ВладелецКИ		 = ХранилищеКонтактнойИнформацииОбъекта(ЮрФизЛицо);
		ВидАдреса		 = ПолучитьВидКИ(ВладелецКИ, Юрадрес);
		Адрес			 = АдресЮрФизЛица(ВладелецКИ, ВидАдреса, ДатаДокумента);
		ЗначенияПолей	 = Адрес.ЗначенияПолей;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураАдреса = СведенияОбАдресе(ЗначенияПолей);
	
	// Обертка для корректного заполнения адреса доставки (грузополучателя) по данным документа:
	// код страны определяем по фактическому адресу грузополучателя, а представление подставляем из документа
	Если ЗначениеЗаполнено(ПредставлениеАдреса) Тогда 
		СтруктураАдреса.СохраненноеПредставление = ПредставлениеАдреса;
	// используем пользовательское представление адреса	
	Иначе
		СтруктураАдреса.СохраненноеПредставление = ?(ЮрАдрес, СведенияОбОрганизации.ЮридическийАдрес, СведенияОбОрганизации.ФактическийАдрес);
	КонецЕсли;
	
	Заполнить_AddressInfo(AddressContent, СтруктураАдреса);
	
КонецПроцедуры

Функция ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(Организация)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП", Организация);
	
КонецФункции

Функция СформироватьПредставлениеКонтрагентаДляАкта(Организация, ДатаОперации)
	
	СведенияОбОрганизации = РеквизитыЮрФизЛица(Организация, ДатаОперации);
	Возврат ОтрезатьПравуюЗапятую(ДобавитьРазделитель(СведенияОбОрганизации.ПолноеНаименование) + ДобавитьРазделитель(СведенияОбОрганизации.ИНН, "ИНН: ") + ДобавитьРазделитель(СведенияОбОрганизации.КПП, "КПП: "));
	
КонецФункции

Функция ПолучитьБанковскийСчетПоДокументу(ДокСсылка)
	
	Если (ДокСсылка.Метаданные().Реквизиты.Найти("СтруктурнаяЕдиница") <> Неопределено) И
		 ЗначениеЗаполнено(Докссылка.СтруктурнаяЕдиница) И
		 (ТипЗнч(Докссылка.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета")) Тогда 
		Возврат Докссылка.СтруктурнаяЕдиница;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату. 
// Табличный документ формируется средствами Диадок
//
// Параметры:
//  СчетНаОплату - ДокументСсылка	- документ, на основании которого формируем печатную форму 
// 
// Возвращаемое значение:
//   Структура
//
Функция РезультатВизуализацииСчетаНаОплатуСредствамиДиадок(ДокументСсылка, ПараметрыОтправкиНаСогласование =  Неопределено, ФИОПодписанта = "") Экспорт
	
	ДанныеШапки		 = ДанныеШапки(ДокументСсылка);
	ТабличнаяЧасть	 = ПолучитьДанныеТЧ(ДокументСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеШапки, ТабличнаяЧасть);
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		МетодСервера(, "ЗаполнитьВТаблице_СтавкаНДС_ИсчНалАг", ТабличнаяЧасть);
	КонецЕсли;
	
	ТабДок	 = Новый ТабличныйДокумент;
	Макет	 = ОбработкаОбъект.ПолучитьМакет("СчетНаОплату");
	
	ЗаполнитьШапкуПечатнойФормыСчетаНаОплату(ТабДок, Макет
	, ДанныеШапки, ТабличнаяЧасть);
	
	ЗаполнитьТабличнуюЧастьПечатнойФормыСчетаНаОплату(ТабДок, Макет
	, ДанныеШапки, ТабличнаяЧасть);
	
	ЗаполнитьПодвалПечатнойФормыСчетаНаОплату(ТабДок, Макет
	, ДанныеШапки, ТабличнаяЧасть, ПараметрыОтправкиНаСогласование, ФИОПодписанта);
	
	ДатаДокумента		 = ДатаНомер.ДатаДокумента;
	НомерДокумента		 = ДатаНомер.НомерДокумента;
	СуммаДокумента		 = ДанныеШапки.СуммаДокумента;
	СуммаНДСДокумента	 = ДанныеШапки.СуммаНДСДокумента;
	ЕстьСтавкаБезНДС	 = ЕстьСтавкаБезНДСВТабличнойЧасти(ТабличнаяЧасть);
	
	ИмяФайла = ИмяФайлаПечатнойФормы("Счет", НомерДокумента, ДатаДокумента);
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыйРезультатВизуализацииСчетаНаОплату");
	Результат.Таблица		 = ТабДок;
	Результат.СписокОшибок	 = "";
	Результат.ИмяФайла		 = ИмяФайла;
	Результат.Дата			 = ДатаДокумента;
	Результат.Номер			 = НомерДокумента;
	Результат.Сумма			 = СуммаДокумента;
	Результат.СуммаНДС		 = СуммаНДСДокумента;
	Результат.ДокументБезНДС = (ЕстьСтавкаБезНДС И СуммаНДСДокумента = 0);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьШапкуПечатнойФормыСчетаНаОплату(ТабличныйДокумент, Макет
	, ДанныеШапки
	, ТабличнаяЧасть)
	
	ДатаНомер = ДанныеШапки.ДатаНомерДокумента;
	ДатаДокумента = ДатаНомер.ДатаДокумента;
	НомерДокумента = ДатаНомер.НомерДокумента;
	
	БанковскийСчет		 = ДанныеШапки.БанковскийСчетОрганизации;
	РеквизитыОрганизации = РеквизитыПродавца(ДанныеШапки.Организация, ДатаДокумента, БанковскийСчет, ДанныеШапки.ОбособленноеПодразделение);
	РеквизитыПолучателя	 = РеквизитыЮрФизЛица(ДанныеШапки.ОрганизацияПолучатель, ДатаДокумента, БанковскийСчет);
	РеквизитыКонтрагента = РеквизитыЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	ШаблонПредставления = "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	ПредставлениеОрганизации = ПредставлениеЮрФизЛица(РеквизитыОрганизации, ШаблонПредставления);
	ПредставлениеКонтрагента = ПредставлениеЮрФизЛица(РеквизитыКонтрагента, ШаблонПредставления);
	
	ЕстьСкидкаВТабличнойЧасти = ЕстьСкидкаВТабличнойЧасти(ТабличнаяЧасть);
	
	СтрокаЗаголовка = СтрШаблон(НСтр("ru = 'Счет на оплату № %1 от %2 '")
	, НомерДокумента, Формат(ДатаДокумента, "ДФ=dd.MM.yyyy"));
	
	Область = Макет.ПолучитьОбласть("ШапкаСчета1");
	Если ЗначениеЗаполнено(РеквизитыПолучателя.Банк) Тогда
		Область.Параметры.БанкПолучателя		 = РеквизитыПолучателя.Банк;
		Область.Параметры.БИКБанкаПолучателя	 = РеквизитыПолучателя.БИК;
		Область.Параметры.СчетБанкаПолучателя	 = РеквизитыПолучателя.КоррСчет;
		Область.Параметры.СчетПолучателя		 = РеквизитыПолучателя.НомерСчета;
		Область.Параметры.ИННПолучателя			 = РеквизитыПолучателя.ИНН;
		Область.Параметры.КПППолучателя			 = РеквизитыПолучателя.КПП;
		Область.Параметры.Получатель			 = РеквизитыПолучателя.НаименованиеДляПечатныхФорм;
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ШапкаСчета2");
	Область.Параметры.Заголовок = СтрокаЗаголовка;
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ШапкаСчета3");
	Область.Параметры.Поставщик = ПредставлениеОрганизации;
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ШапкаСчета4");
	Область.Параметры.Покупатель = ПредставлениеКонтрагента;
	ТабличныйДокумент.Вывести(Область);
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки"));
	ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("ШапкаТаблицы|Данные"));
	Если ЕстьСкидкаВТабличнойЧасти Тогда
		ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка"));
	КонецЕсли;
	ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма"));
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПечатнойФормыСчетаНаОплату(ТабличныйДокумент, Макет
	, ДанныеШапки
	, ТабличнаяЧасть)
	
	ЕстьСкидкаВТабличнойЧасти = ЕстьСкидкаВТабличнойЧасти(ТабличнаяЧасть);
	
	// Подгоняем ширину табличной части под ширину заголовка и подвала
	ОбластьКолонкаТовар = Макет.Область("Товар");
	ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
	Если Не ЕстьСкидкаВТабличнойЧасти Тогда
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + Макет.Область("Скидка").ШиринаКолонки;
	КонецЕсли;
	
	ОбластьНомерСтроки	 = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьДанные		 = Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидка		 = Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСумма		 = Макет.ПолучитьОбласть("Строка|Сумма");
	НомерСтроки			 = 0;
	
	Для каждого Стр Из ТабличнаяЧасть Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьНомерСтроки.Параметры.НомерСтроки = НомерСтроки;
		ТабличныйДокумент.Вывести(ОбластьНомерСтроки);
		
		ОбластьДанные.Параметры.Цена			 = Стр.Цена;
		ОбластьДанные.Параметры.Товар			 = Стр.НоменклатураПредставление;
		ОбластьДанные.Параметры.Количество		 = Стр.Количество;
		ОбластьДанные.Параметры.ЕдиницаИзмерения = Строка(Стр.ЕдиницаИзмерения);
		ТабличныйДокумент.Присоединить(ОбластьДанные);
		
		Если ЕстьСкидкаВТабличнойЧасти Тогда
			ОбластьСкидка.Параметры.СуммаСкидки = Формат(Стр.СуммаСкидки, "ЧЦ=15; ЧДЦ=2");
			ТабличныйДокумент.Присоединить(ОбластьСкидка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.СуммаСкидки) Тогда
			СуммаСтроки = Стр.Сумма - Стр.СуммаСкидки;
		Иначе
			СуммаСтроки = Стр.Сумма;
		КонецЕсли;
		
		ОбластьСумма.Параметры.Сумма = СуммаСтроки;
		ТабличныйДокумент.Присоединить(ОбластьСумма);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПодвалПечатнойФормыСчетаНаОплату(ТабличныйДокумент, Макет
	, ДанныеШапки
	, ТабличнаяЧасть
	, ПараметрСогласования
	, ФИОПодписанта)
	
	СуммаСкидки			 = ДанныеШапки.СуммаСкидки;
	СуммаДокумента		 = ДанныеШапки.СуммаДокумента;
	СуммаНДСДокумента	 = ТабличнаяЧасть.Итог("СуммаНДС");
	
	ВалютаДокумента	 = ДанныеШапки.ВалютаДокумента;
	КодВалюты		 = ДанныеШапки.ВалютаДокументаКод;
	
	Если ДанныеШапки.ЦенаВключаетНДС Тогда
		СуммаИтого = СуммаДокумента;
	Иначе
		СуммаИтого = СуммаДокумента - СуммаНДСДокумента;
	КонецЕсли;
	
	ПараметрыИсчисления = МетодСервера("ПечатныеФормы", "ПараметрыИсчисленияВалюты", КодВалюты);
	СуммаИтогоПрописью = ЧислоПрописью(СуммаДокумента, , ПараметрыИсчисления);
	
	СтрокаПодвала = СтрШаблон(НСтр("ru = 'Всего наименований %1, на сумму %2 %3'")
	, ТабличнаяЧасть.Количество(), Формат(СуммаДокумента, "ЧЦ=15; ЧДЦ=2"), СокрП(ВалютаДокумента));
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	Если ЗначениеЗаполнено(СуммаСкидки) Тогда 
		Область = Макет.ПолучитьОбласть("СкидкаПоДокументу");
		Область.Параметры.СуммаСкидки = СуммаСкидки;
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ПодвалИтого");
	Область.Параметры.Всего = СуммаИтого;
	ТабличныйДокумент.Вывести(Область);
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		
		СтрокаСуммыНДС = "-";
		НадписьСуммыНДС = "НДС исчисляется налоговым агентом";
		
	ИначеЕсли ЗначениеЗаполнено(СуммаНДСДокумента) Тогда
		
		СтрокаСуммыНДС = Формат(СуммаНДСДокумента, "ЧЦ=15; ЧДЦ=2");
		
		Если ДанныеШапки.ЦенаВключаетНДС Тогда
			НадписьСуммыНДС = "В том числе НДС:";
		Иначе
			НадписьСуммыНДС = "Сумма НДС:";
		КонецЕсли;
		
	Иначе
		СтрокаСуммыНДС = "-";
		НадписьСуммыНДС = "Без налога (НДС)";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ПодвалНДС");
	Область.Параметры.НДС		 = НадписьСуммыНДС;
	Область.Параметры.ВсегоНДС	 = СтрокаСуммыНДС;
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПодвалИтогоКОплате");
	Область.Параметры.ИтогоКОплате = СуммаДокумента;
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПодвалСуммаПрописью");
	Область.Параметры.ИтоговаяСтрока = СтрокаПодвала;
	Область.Параметры.СуммаПрописью = СуммаИтогоПрописью;
	ТабличныйДокумент.Вывести(Область);
	
	Если Не ЗначениеЗаполнено(ПараметрСогласования) Тогда
		ФИОРуководителя = ФИОПодписанта;
	ИначеЕсли ЗначениеЗаполнено(ПараметрСогласования.ФИОПодписанта) Тогда
		ФИОРуководителя = ПараметрСогласования.ФИОПодписанта;
	ИначеЕсли ЗначениеЗаполнено(ПараметрСогласования.ФИОПолучателя) Тогда
		ФИОРуководителя = ПараметрСогласования.ФИОПолучателя;
	Иначе
		ФИОРуководителя = "_";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ПодвалСчета");
	Область.Параметры.ФИОРуководителя = ФИОРуководителя;
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры

Функция ЕстьСтавкаБезНДСВТабличнойЧасти(ТабличнаяЧасть)
	
	Результат = Ложь;
	
	Для каждого Стр Из ТабличнаяЧасть Цикл
		
		Если МенеджерИнтеграции_ЭтоСтавкаБезНДС(Стр.СтавкаНДС) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьСкидкаВТабличнойЧасти(ТабличнаяЧасть)
	
	Результат = Ложь;
	
	Для каждого Стр Из ТабличнаяЧасть Цикл
		
		Если ЗначениеЗаполнено(Стр.СуммаСкидки) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеДляФормированияАктаСверки(ДокСсылка)
	
	ДанныеДляАктаСверки = Новый Структура();
	
	ДанныеДляАктаСверки.вставить("ДатаНачалаСверки", ДокСсылка.ДатаНачала);
	ДанныеДляАктаСверки.Вставить("ДатаокончанияСверки", ДокСсылка.Датаокончания);
	
	СведенияОбОрганизации    = РеквизитыЮрФизЛица(ДокСсылка.Организация, ДокСсылка.Дата);
	ДанныеДляАктаСверки.Вставить("ПредставлениеОрганизации", ПредставлениеЮрФизЛица(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,"));
	
	СведенияОКонтрагенте     = РеквизитыЮрФизЛица(ДокСсылка.Контрагент, ДокСсылка.Дата);
	ДанныеДляАктаСверки.Вставить("ПредставлениеКонтрагента", ПредставлениеЮрФизЛица(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,"));
	
	ДанныеДляАктаСверки.Вставить("ПредставительОрганизации",  ПолучитьПредставителяОрганизацииДляАктаСверки(ДокСсылка));
	ДанныеДляАктаСверки.Вставить("ПредставительКонтрагента",  ПолучитьПредставителяКонтрагентаДляАктаСверки(ДокСсылка));
	
	ДанныеДляАктаСверки.вставить("ВалютаДокумента", ДокСсылка.ВалютаДокумента);
	ДанныеДляАктаСверки.вставить("МассивДанныхПоДоговорам",  ПолучитьДанныеТЧАктаСверки(ДокСсылка));
	
	ДанныеДляАктаСверки.Вставить("СальдоНачальное",  ДокСсылка.ОстатокНаНачало);
	ДанныеДляАктаСверки.Вставить("СверкаСогласована", ДокСсылка.СверкаСогласована);
	ДанныеДляАктаСверки.Вставить("Расхождение", ДокСсылка.Расхождение);
	
	Возврат ДанныеДляАктаСверки;
	
КонецФункции

Функция ПолучитьПредставителяОрганизацииДляАктаСверки(ДокСсылка)
	ПредставительОрганизации = Новый Структура;
	ДанныеПредставителя = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(ДокСсылка.Организация, ДокСсылка.ПредставительОрганизации, ДокСсылка.Дата);
	
	ПредставительОрганизации.Вставить("ФИО", сокрЛП(строка(ДанныеПредставителя.Фамилия) + " " + ДанныеПредставителя.Имя + " " + ДанныеПредставителя.Отчество));
	ПредставительОрганизации.Вставить("Должность", Строка(ДанныеПредставителя.Должность));
	
	Возврат ПредставительОрганизации;
КонецФункции

Функция ПолучитьПредставителяКонтрагентаДляАктаСверки(ДокСсылка)
	ПредставительКонтрагента = Новый Структура;
	ПредставительКонтрагента.Вставить("ФИО", ДокСсылка.ПредставительКонтрагента.наименование);
	ПредставительКонтрагента.Вставить("Должность", ДокСсылка.ПредставительКонтрагента.Должность);
	
	Возврат ПредставительКонтрагента;
КонецФункции

Функция ПолучитьДанныеТЧАктаСверки(ДокСсылка)
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Документ,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Договор,
	|	Истина КАК ЭтоДанныеОрганизации
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Дата,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Документ,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Представление,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Дебет,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Кредит,
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Договор,
	|	Ложь
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК АктСверкиВзаиморасчетовПоДаннымКонтрагента
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Выборка = запрос.Выполнить().Выбрать();
	МассивДанныхПоДоговорам = Новый Массив;
	
	Пока выборка.Следующий() Цикл 
		СтруктураДанныхПоДоговору = ПолучитьСтруктуруДанныхТекущегоДоговораАктаСверки(МассивДанныхПоДоговорам, ?(Докссылка.РазбитьПоДоговорам, Выборка.Договор, Неопределено) );
		ТаблицаДанных = ?(выборка.ЭтоДанныеОрганизации, СтруктураДанныхПоДоговору.ДанныеОрганизации,  СтруктураДанныхПоДоговору.ДанныеКонтрагента);
		стр = ТаблицаДанных.Добавить();
		Стр.Дата = выборка.Дата;
		Стр.представлениеДокумента = выборка.Представление;
		стр.Дебет = Выборка.Дебет;
		стр.Кредит = выборка.кредит;
	КонецЦикла;	 
	
	Возврат МассивДанныхПоДоговорам;
КонецФункции	

Функция ПолучитьСтруктуруДанныхТекущегоДоговораАктаСверки(МассивДанныхПоДоговорам, ДоговорСсылка)
	Для Каждого элемент Из МассивДанныхПоДоговорам Цикл 
		Если Элемент.ДоговорСсылка = ДоговорСсылка Тогда
			Возврат Элемент
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("ДанныеОрганизации", ИнициализироватьТЧДляСверки());
	СтруктураДанных.Вставить("ДанныеКонтрагента", ИнициализироватьТЧДляСверки());
	СтруктураДанных.Вставить("ДоговорСсылка"    , ДоговорСсылка);
	
	МассивДанныхПоДоговорам.Добавить(СтруктураДанных);
	
	Возврат СтруктураДанных;
КонецФункции

Функция ИнициализироватьТЧДляСверки()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата");
	ТЗ.Колонки.Добавить("ПредставлениеДокумента");
	ТЗ.Колонки.Добавить("Дебет");
	ТЗ.Колонки.Добавить("Кредит");
	
	Возврат ТЗ;
КонецФункции		

Функция ПредставлениеПредставителяДляШапки(ПредставительОрганизации, ПредставлениеОрганизации)
	Возврат ?(ЗначениеЗаполнено(ПредставительОрганизации.Должность), ПредставительОрганизации.Должность, "представитель") +
	" " + ПредставлениеОрганизации + " " + ?(ЗначениеЗаполнено(ПредставительОрганизации.ФИО), ПредставительОрганизации.ФИО, "");
КонецФункции	

Функция ПредставлениеРезультатовСверки(ДатаОкончанияСверки, ПредставлениеОрганизации, ПредставлениеКонтрагента, ОрганизацияИтогСальдо, валютаДокумента)
	
	результат = "на " + формат(ДатаОкончанияСверки, "ДФ=dd.MM.yyyy") + " задолженность ";
	Если ОрганизацияИтогСальдо > 0 Тогда
		результат = результат + "в пользу " + ПредставлениеОрганизации + " " +
		РазвернутоеПредставлениеСуммы(ОрганизацияИтогСальдо, ВалютаДокумента);
	ИначеЕсли ОрганизацияИтогСальдо < 0 Тогда
		результат = результат + "в пользу " + ПредставлениеКонтрагента + " " +
		РазвернутоеПредставлениеСуммы(-ОрганизацияИтогСальдо, ВалютаДокумента);
	Иначе
		результат = результат +"отсутствует";
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции

Функция РазвернутоеПредставлениеСуммы(Сумма, Валюта)
	Возврат  формат(Сумма, "ЧДЦ=2")+" "+Валюта+
	" (" + ЧислоПрописью(Сумма
							,
							,
							МетодСервера("ПечатныеФормы", "ПараметрыИсчисленияВалюты", Валюта.Код))
			+ ")"
КонецФункции

Функция ЕстьСтавкаБезНДС(ТабличнаяЧасть)
	
	НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("СтавкаНДС", МенеджерИнтеграции_СтавкаБезНДС()));
	Результат = ЗначениеЗаполнено(НайденныеСтроки);
	
	Возврат Результат;
	
КонецФункции

Функция МетаДокументаСТабличнойЧастью(ДокументСсылка)
	
	Шапка = ДанныеШапки(ДокументСсылка);
	ТабличнаяЧасть = ПолучитьДанныеТЧ(ДокументСсылка, , , , Ложь);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	ДатаНомер = Шапка.ДатаНомерДокумента;
	
	СуммаНДСДокумента	 = ТабличнаяЧасть.Итог("СуммаНДС");
	ЕстьСтавкаБезНДС	 = ЕстьСтавкаБезНДС(ТабличнаяЧасть);
	
	Мета = Новый Структура;
	Мета.Вставить("Дата", 			ДатаНомер.ДатаДокумента);
	Мета.Вставить("Номер", 			ДатаНомер.НомерДокумента);
	Мета.Вставить("Сумма", 			Шапка.СуммаДокумента);
	Мета.Вставить("СуммаНДС", 		СуммаНДСДокумента);
	Мета.Вставить("ДокументБезНДС", ЕстьСтавкаБезНДС И СуммаНДСДокумента = 0);
	
	Возврат Мета;
	
КонецФункции

Функция СформироватьМетуСчетаНаОплату(ДокументСсылка) Экспорт
	
	Возврат МетаДокументаСТабличнойЧастью(ДокументСсылка);
	
КонецФункции

Функция СформироватьМетуАктаВыполненныхРабот(ДокументСсылка) Экспорт
	
	Возврат МетаДокументаСТабличнойЧастью(ДокументСсылка);
	
КонецФункции

Функция СформироватьМетуАктаСверки(ДокументСсылка) Экспорт
	
	МетаАктаСверки=	Новый Структура;
	МетаАктаСверки.Вставить("Дата", 	ДокументСсылка.Дата);
	МетаАктаСверки.Вставить("Номер", 	ПредставлениеНомераОбъекта(ДокументСсылка));
	
	Возврат МетаАктаСверки;
	
КонецФункции

Функция СтруктурированноеПредставлениеОснования(ДокСсылка)
	
	ДоговорКонтрагента = ДокСсылка.ДоговорКонтрагента;
	
	Ground = Новый Структура;
	Ground.Вставить("GroundName", "");
	Ground.Вставить("GroundNumber", "");
	Ground.Вставить("GroundDate", "");
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Ground.Вставить("GroundName", 	ДоговорКонтрагента.Наименование);
		Ground.Вставить("GroundNumber", ДоговорКонтрагента.Номер);
		Ground.Вставить("GroundDate", 	ДоговорКонтрагента.Дата);
	КонецЕсли;
	
	Возврат  Ground;
	
КонецФункции

Функция СтруктурированноеПредставлениеОснованияУПД(ДокументСсылка, ДокументОснование)
	
	Результат = Новый Структура;
	Результат.Вставить("GroundName", 	"");
	Результат.Вставить("GroundNumber", 	"");
	Результат.Вставить("GroundDate", 	Дата(1, 1, 1));
	
	Результат.Вставить("ОснованиеСсылка");
	Результат.Вставить("ПредставлениеВТекстеОшибки", "основании");
	
	Договор	= Неопределено;
	
	Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(ДокументОснование), "ДоговорКонтрагента") Тогда 
		Договор	= ДокументОснование.ДоговорКонтрагента;
	ИначеЕсли МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(ДокументСсылка), "ДоговорКонтрагента") Тогда 
		Договор	= ДокументСсылка.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		Если НРег(Договор.Наименование) = НРег("Без договора") Тогда
			Возврат Результат;
		Иначе
			Результат.GroundName		= "Договор"; 	
			Результат.GroundNumber		= Договор.Номер;
			Результат.GroundDate		= Договор.Дата;
			Результат.ОснованиеСсылка	= Договор;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат  Результат;
	
КонецФункции

Процедура ЗаполнитьСведенияОПередаче(Content, ДокументСсылка, ФункцияУПД, ДопПараметры)
	
	КоллекцияДокументНосительОснования	= Новый Массив;
	
	ДобавленныеОснования = Новый Массив;
				
	Если ФункцияУПД = "СЧФДОП" ИЛИ ФункцияУПД = "СЧФ" Тогда
		// в этом случае параметр ДокументСсылка это Счет фактура выданный
		Если МетодСервера(, "СуществуетОбъектМетаданных", "Документ.СчетФактураВыданный.ТабличнаяЧасть.ДокументыОснования") Тогда
			Для Каждого СтрокаТЧ Из ДокументСсылка.ДокументыОснования Цикл
				КоллекцияДокументНосительОснования.Добавить(ДокументОтгрузки(СтрокаТЧ.ДокументОснование));	
			КонецЦикла;			
		Иначе
			Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(ДокументСсылка), "ДокументОснование") Тогда
				КоллекцияДокументНосительОснования.Добавить(ДокументОтгрузки(ДокументСсылка.ДокументОснование));
			КонецЕсли;					
		КонецЕсли;
		
	Иначе
		// в этом случае параметр ДокументСсылка это документ реализации
		КоллекцияДокументНосительОснования.Добавить(ДокументОтгрузки(ДокументСсылка));
	КонецЕсли;
	
	УказыватьОтсутствиеОснованияУПД = СвойствоСтруктуры(ДопПараметры, "УказыватьОтсутствиеОснованияУПД", Ложь);
	
	// если в конфигурации нет ФО "ВестиУчетПоДоговорам", то вернется значение Неопределено,
	// если такая ФО есть, то вернется ее значение типа Булево
	ВестиУчетПоДоговорам = МетодСервера(, "ПолучитьФункциональнуюОпциюНаСервере", "ВестиУчетПоДоговорам");
	
	// Добавляем реальные основания только в случаях, когда договор в документе заполняется пользователем:
	// 1 - если ФО "ВестиУчетПоДоговорам" в конфигурации нет,
	// 2 - если ФО "ВестиУчетПоДоговорам" в конфигурации есть и ее значение = Истина.
	// В противном случае основание передачи = "Отсутствует".
	Если ВестиУчетПоДоговорам <> Ложь Тогда
	
		Для Каждого ДокументМассива Из КоллекцияДокументНосительОснования Цикл
			
			СтруктураОснования = СтруктурированноеПредставлениеОснованияУПД(ДокументСсылка, ДокументМассива);
			
			Если ЗначениеЗаполнено(СтруктураОснования.GroundName) Тогда
				
				Если ДобавленныеОснования.Найти(СтруктураОснования.ОснованиеСсылка) = Неопределено Тогда
					
					ДобавленныеОснования.Добавить(СтруктураОснования.ОснованиеСсылка);
					
					TransferBase = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_TransferBase");
					Content.TransferInfo.TransferBases.Добавить(TransferBase);
					
					Если Не ЗначениеЗаполнено(СтруктураОснования.GroundDate) И УказыватьОтсутствиеОснованияУПД Тогда
						ЗаполнитьTransferBaseКакОтсутствует(TransferBase);
					Иначе
						ЗаполнитьTransferBaseПоДаннымОснования(TransferBase, СтруктураОснования);
					КонецЕсли;
					
					СлужебнаяИнформация = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяСлужебнаяИнформацияОснованияПередачи");
					СлужебнаяИнформация.ОснованиеСсылка				= СтруктураОснования.ОснованиеСсылка;
					СлужебнаяИнформация.ПредставлениеВТекстеОшибки	= СтруктураОснования.ПредставлениеВТекстеОшибки;
					
					ДополнитьКонтентСтрокиОснованийПередачиСлужебнойИнформацией(TransferBase, СлужебнаяИнформация);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; // ВестиУчетПоДоговорам
	
	Если ДобавленныеОснования.Количество() = 0 Тогда
				
		TransferBase = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_TransferBase");
		Content.TransferInfo.TransferBases.Добавить(TransferBase);
		
		ЗаполнитьTransferBaseКакОтсутствует(TransferBase);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьTransferBaseПоДаннымОснования(TransferBase, СтруктураОснования)
	
	TransferBase.DocumentName	= СтруктураОснования.GroundName;
	TransferBase.DocumentNumber	= СтруктураОснования.GroundNumber;
	TransferBase.DocumentDate	= СтруктураОснования.GroundDate;
	TransferBase.DocumentInfo	= "";
	
КонецПроцедуры

Процедура ЗаполнитьTransferBaseКакОтсутствует(TransferBase)
	
	TransferBase.DocumentName	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДокументОснованиеОтгрузкиОтсутствует");
	TransferBase.DocumentNumber	= "";
	TransferBase.DocumentDate	= Дата(1, 1, 1);
	TransferBase.DocumentInfo	= "";

КонецПроцедуры

Процедура ЗаполнитьСтруктурированноеОписаниеГрузоотправителяГрузополучателя(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, ПредставлениеАдреса = "")
	
	СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента);
	Если стрДлина(СведенияОбОрганизации.ИНН) <> 12 Тогда
		
		НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		ЭтоИП = Ложь;
		
	Иначе
		
		Если ТипЗнч(юрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			//для нашей организации - данные берем из нормализованного представления физлица
			НаименованиеОрганизации = юрФизЛицо.наименованиеПолное;
		Иначе
			НаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
		КонецЕсли;
		
		ЭтоИП = Истина;
		
	КонецЕсли;
	
	OrganizationInfo.Name = НаименованиеОрганизации;
	OrganizationInfo.IsSoleProprietor = ЭтоИП;
	OrganizationInfo.SameAsSellerOrBuyer = Ложь;
	OrganizationInfo.Ссылка = ЮрФизЛицо;
	
	ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, Ложь, ДатаДокумента, ПредставлениеАдреса);
	
КонецПроцедуры

Функция ПолучитьГоловноеЮрлицо(ЮрФизЛицо)
	
	Результат = ЮрФизЛицо;
	
	Если ЭтоОбособленноеПодразделение(ЮрФизЛицо) Тогда 
		
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
			ИмяРеквизита = "ГоловнойКонтрагент";
		Иначе 
			ИмяРеквизита = "ГоловнаяОрганизация";
		КонецЕсли;
		
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, ИмяРеквизита);
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

Процедура ЗаполнитьСтруктурированоеОписаниеЮрФизЛица(OrganizationInfo, ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации = Неопределено,  ЮрАдрес, АдресДляСФ = Ложь, КППГрузоотправителя = "", ПредставлениеАдреса = "")

	СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчетОрганизации);
	
	ЗаполнитьИнформациюОбОрганизации(OrganizationInfo, СведенияОбОрганизации);
	ЗаполнитьСтруктурированноеОписаниеАдреса(OrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, ЮрАдрес, ДатаДокумента, ПредставлениеАдреса);
	
	OrganizationInfo.вставить("Ссылка", ЮрФизЛицо);

КонецПроцедуры

Процедура Заполнить_ExtendedOrganizationInfo(ExtendedOrganizationInfo, ЮрФизЛицо, ДатаДокумента, ЭтоПродавец, БанковскийСчет = Неопределено, КППГрузоотправителя = "", ОбособленноеПодразделение = Неопределено, ПредставлениеАдреса = "")
	
	Если ЭтоПродавец Тогда
		
		СведенияОбОрганизации = РеквизитыПродавца(ЮрФизЛицо, ДатаДокумента, БанковскийСчет, ОбособленноеПодразделение);
		ИсточникСведений = ?(ЗначениеЗаполнено(ОбособленноеПодразделение), ОбособленноеПодразделение, ЮрФизЛицо);
		
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		
		СведенияОбОрганизации = РеквизитыГрузоотправителя(ЮрФизЛицо, ДатаДокумента, БанковскийСчет, ОбособленноеПодразделение);
		ИсточникСведений = ?(ЗначениеЗаполнено(ОбособленноеПодразделение), ОбособленноеПодразделение, ЮрФизЛицо);
		
	Иначе 
		
		СведенияОбОрганизации = РеквизитыЮрФизЛица(ЮрФизЛицо, ДатаДокумента, БанковскийСчет);
		ИсточникСведений = ЮрФизЛицо;
		
	КонецЕсли;
	
	ExtendedOrganizationInfo.Вставить("Ссылка", ИсточникСведений); // Вероятно, используется в ПМ
	
	Если ЗначениеЗаполнено(КППГрузоотправителя) Тогда
		СведенияОбОрганизации.КПП = КППГрузоотправителя;
	КонецЕсли;
	
	ЗаполнитьИнформациюОбОрганизации(ExtendedOrganizationInfo, СведенияОбОрганизации);
	ЗаполнитьСтруктурированноеОписаниеАдреса(ExtendedOrganizationInfo.Address, СведенияОбОрганизации, ЮрФизЛицо, ЭтоПродавец, ДатаДокумента, ПредставлениеАдреса);
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда 
		ExtendedOrganizationInfo.Okdp = ЮрФизЛицо.КодОКВЭД;
	КонецЕсли;
	
	Если СведенияОбОрганизации.ТипЮрФизЛица = ТипыЮрФизЛиц().ИндивидуальныйПредприниматель
		И ДатаДокумента >= ДатаРедакции425() Тогда
		
		ExtendedOrganizationInfo.IndividualEntityRegistrationCertificate = СтрокаНомерСВ_2026(
			СведенияОбОрганизации.ОГРН,
			СведенияОбОрганизации.ДатаРегистрации
		);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДатаРедакции425()
	
	Возврат '20260101';
	
КонецФункции

Функция СтрокаНомерСВ_2026(ОГРН, ДатаРегистрации)
	
	ШаблонСтрокиНомерСВ = "%1;%2";
	
	Результат = СтрШаблон(
		ШаблонСтрокиНомерСВ,
		ОГРН,
		ДатаСтрокойЛок(ДатаРегистрации)
	);
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСтрокойЛок(ДатаСтрока)
	
	ПустоеЗначение = "";
	
	Если ПустаяСтрока(ДатаСтрока) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Попытка
		Значение = Дата(ДатаСтрока);
	Исключение
		Значение = ДатаСтрока;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
	
КонецФункции

// Заполняет массив структур поля StructedAdditionalInfos
//
// Параметры:
//  StructedAdditionalInfos - Массив - Коллекция дополнительных сведений
//  ДопСведения             - Строка - Дополнительные сведения в формате "ключ1=значение1;ключ2=значение2"
//
Процедура ЗаполнитьStructedAdditionalInfos(StructedAdditionalInfos, ДопСведения)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗаполнитьStructedAdditionalInfos", StructedAdditionalInfos, ДопСведения);
	
КонецПроцедуры

Функция ЮрФизЛицо_КодСтраныРегистрации(ЮрФизЛицо)
	
	Если МетодСервера(, "ЕстьРеквизитИлиСвойствоОбъектаЛок", ЮрФизЛицо, "СтранаРегистрации") Тогда
		Возврат СокрЛП(ЮрФизЛицо.СтранаРегистрации.Код);
	КонецЕсли;
		
КонецФункции

Функция ЮрФизЛицо_ТипОрганизацииДляКонтента(Реквизиты, УДАЛИТЬ_ЭтоИП = Неопределено, УДАЛИТЬ_СтранаРегистрацииКод = Неопределено)
	
	Если ЗначениеЗаполнено(Реквизиты.СтранаРегистрации)
		И Реквизиты.СтранаРегистрации <> Справочники.СтраныМира.Россия
		И Не ЗначениеЗаполнено(Реквизиты.ИНН) Тогда
		Результат = "ForeignEntity";
	ИначеЕсли Реквизиты.ТипЮрФизЛица = ТипыЮрФизЛиц().ФизическоеЛицо Тогда 
		Результат = "PhysicalEntity";
	ИначеЕсли Реквизиты.ТипЮрФизЛица = ТипыЮрФизЛиц().ИндивидуальныйПредприниматель Тогда	
		Результат = "IndividualEntity";
	Иначе 
		Результат = "LegalEntity";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЮрФизЛицо_АдресЭлектроннойПочты(ЮрФизЛицо, ДатаДокумента, ЭтоОрганизация)
	
	ВидКИ = ?(ЭтоОрганизация
				, Справочники.ВидыКонтактнойИнформации.EmailОрганизации
				, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
	
	Результат = ПредставлениеКонтактнойИнформацииОбъекта(ЮрФизЛицо, ВидКИ, , ДатаДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьДанныеДляПечати(СсылкаНаОбъект, ЭтоКСФ)
	
	ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета();
	
	ЭтоСФ = ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный");
				
	//сформируем список документов-оснований
	СпДокументовОснований = Новый СписокЗначений;
	
	Если ЭтоСФ Тогда
		Для Каждого Строка Из СсылкаНаОбъект.ДокументыОснования Цикл 
			Если ЗначениеЗаполнено(Строка.ДокументОснование)
				И (СпДокументовОснований.НайтиПоЗначению(Строка.ДокументОснование) = Неопределено) Тогда 
				СпДокументовОснований.Добавить(ДокументОтгрузки(Строка.ДокументОснование));
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		СпДокументовОснований.Добавить(ДокументОтгрузки(СсылкаНаОбъект));
	КонецЕсли;
	
	ДанныеДляПечати		 = ДанныеШапки(СсылкаНаОбъект); // Шапку всегда заполняем по переданному объекту
	ДанныеТабличнойЧасти = ПолучитьДанныеТЧ(СпДокументовОснований, ЭтоКСФ, , , Истина, ?(ЭтоСФ, СсылкаНаОбъект, Неопределено));
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(ДанныеДляПечати, ДанныеТабличнойЧасти);
	
	Если СпДокументовОснований.Количество() > 0 Тогда
		НаОснованииОтчетаКомитенту = ?(ТипЗнч(СпДокументовОснований[0].Значение ) = Тип("Документссылка.ОтчетКомитентуОПродажах"), Истина, Ложь);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДляПечати.ВалютаДокумента) Тогда
		ДанныеДляПечати.ВалютаДокументаКод = "";
	КонецЕсли; 
	
	Если ДанныеДляПечати.НДСИсчисляетсяНалоговымАгентом Тогда
		МетодСервера(, "ЗаполнитьВТаблице_СтавкаНДС_ИсчНалАг", ДанныеТабличнойЧасти);
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", ТаблицаЗначений_2_МассивСтруктур(ДанныеТабличнойЧасти));
	
	//формируем список ПРС
	Запрос = Новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРС.ДатаДокумента КАК ДатаПлатежноРасчетногоДокумента,
	|	ПРС.НомерДокумента КАК НомерПлатежноРасчетногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК ПРС
	|ГДЕ
	|	ПРС.Ссылка = &Ссылка
	|	И ПРС.НомерДокумента <> """"
	|	И ПРС.ДатаДокумента <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("Ссылка", ссылкаНаОбъект);
	
	ТаблицаДатаНомерДокументовОплаты=	Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПечати.Вставить("ДатаНомерДокументовОплаты", ТаблицаЗначений_2_МассивСтруктур(ТаблицаДатаНомерДокументовОплаты));
	
	Возврат ДанныеДляПечати;
	
КонецФункции 	

// Параметры:
//  Организация 		- СправочникСсылка.Организации - организация, для которой необходимо получить 
//														 настройку модуля "ПодставлятьКППГрузоотправителя"
//  Грузоотправитель 	- СправочникСсылка.Организации или СправочникСсылка.Контрагенты 
//
Функция КППГрузоотправителя(Организация, Грузоотправитель)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Грузоотправитель) Тогда
		
		ПодставлятьКППГрузоотправителя = МетодСервера(,"ПолучитьЗначениеСвойства", Организация, "ДиадокПодставлятьКППГрузоотправителя");
		
		Если ПодставлятьКППГрузоотправителя = Истина Тогда
			Результат = СокрЛП(Грузоотправитель.КПП);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает информацию о стране происхождения товара в виде структуры.
//
// Параметры:
//  СтрокаДанных - СтрокаТаблицыЗначений - Строка табличной части Товары.
//
// Возвращаемое значение:
//   Структура - Сведения о стране происхождения товара для поля StructedAdditionalInfo:
//      * СтранаПроисхождения - СправочникСсылка.СтраныМира - Страна происхождения товара.
//      * НомерГТД            - СправочникСсылка.НомераГТД - Номер грузовой таможенной декларации.
//
Функция КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных)
	
	Результат = Новый Структура;
	Результат.Вставить("СтранаПроисхождения", СтрокаДанных.СтранаПроисхождения);
	
	НомерГТД = СтрокаДанных.НомерГТД;
	Если ЗначениеЗаполнено(НомерГТД)
		И ЕстьРеквизитИлиСвойствоОбъектаЛок(НомерГТД, "РегистрационныйНомер") Тогда
		НомерГТД = НомерГТД.РегистрационныйНомер;	
	КонецЕсли;
	
	Результат.Вставить("НомерГТД", НомерГТД);
	
	Возврат Результат;

КонецФункции

Процедура Заполнить_Item_CustomDeclarations(Item, Знач СтранаПроисхождения, Знач НомерГТД)
	
	Если Не ЗначениеЗаполнено(СтранаПроисхождения)
		И Не ЗначениеЗаполнено(НомерГТД) Тогда
		Возврат;
	КонецЕсли;
	
	CountryCode = "";
	HyphenCountry = Истина;
	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		CountryCode = СокрЛП(СтранаПроисхождения.Код);
		HyphenCountry = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(НомерГТД) = Тип("Строка") Тогда
		DeclarationNumber = СокрЛП(НомерГТД);
	ИначеЕсли ЗначениеЗаполнено(НомерГТД) Тогда
		DeclarationNumber = СокрЛП(НомерГТД.Код);
	Иначе
		DeclarationNumber = "";
	КонецЕсли;
	
	СтранаЧленТС = МетодСервера(, "СтранаЧленТС", CountryCode);
	СтранаПроисхожденияСсылка = Справочники.СтраныМира.ПустаяСсылка();
	Если ЗначениеЗаполнено(DeclarationNumber) И Не СтранаЧленТС Тогда
		СтранаПроисхожденияСсылка = СтранаПроисхождения;
	КонецЕсли;
	
	CustomDeclaration = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CustomDeclaration");
	CustomDeclaration.CountryCode = CountryCode;
	CustomDeclaration.HyphenCountry = HyphenCountry;
	CustomDeclaration.DeclarationNumber = DeclarationNumber;
	CustomDeclaration.СтранаПроисхожденияСсылка = СтранаПроисхожденияСсылка;
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Функция ЕстьРеквизитОбъектаЛок(ИмяРеквизита, ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено);
	Возврат Результат;
	
КонецФункции

//} ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//{ Get content

////////////////////////////////////////////////////////////////////////////////
//{ Get UniversalCorrectionDocument content

Процедура ЗаполнитьInvoiceForCorrectionInfo(Invoices, ДатаНомерДокумента)
	
	Item_InvoiceForCorrectionInfo = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceForCorrectionInfo");
	
	Item_InvoiceForCorrectionInfo.InvoiceNumber	 = ДатаНомерДокумента.НомерИсходногоДокумента;
	Item_InvoiceForCorrectionInfo.InvoiceDate	 = ДатаНомерДокумента.ДатаИсходногоДокумента;
	
	Если ДатаНомерДокумента.УчитыватьИсправлениеИсходногоДокумента Тогда 
		
		Item_InvoiceRevisionInfo = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceRevisionInfo");
		
		Item_InvoiceRevisionInfo.RevisionNumber	 = ДатаНомерДокумента.НомерИсправленияИсходногоДокумента;
		Item_InvoiceRevisionInfo.RevisionDate	 = ДатаНомерДокумента.ДатаИсправленияИсходногоДокумента;
		
		Item_InvoiceForCorrectionInfo.InvoiceRevisions.Добавить(Item_InvoiceRevisionInfo);
		
	КонецЕсли;
	
	Invoices.Добавить(Item_InvoiceForCorrectionInfo);
	
КонецПроцедуры

Процедура ЗаполнитьInvoiceCorrectionTable(InvoiceCorrectionTable, ТаблицаТоваров)
	
	ВсеСтроки_СтавкаНДС_БезНДС	 = Истина;
	ВсеСтроки_СтавкаНДС_ИсчНалАг = Истина;
	
	ЕстьУвеличение = Ложь;
	ЕстьУменьшение = Ложь;
	
	TotalsDec_Total 				= 0;
	TotalsDec_TotalWithVatExcluded 	= 0;
	TotalsDec_Vat 					= 0;
	
	TotalsInc_Total 				= 0;
	TotalsInc_TotalWithVatExcluded 	= 0;
	TotalsInc_Vat 					= 0;
	
	СтруктураItemInvoiceCorrection = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ExtendedInvoiceCorrectionItem");
	
	СтавкаНДС_БезНДС   = МетодСервера(, "СтавкаНДС_БезНДС");
	СтавкаНДС_ИсчНалАг = МетодСервера(, "СтавкаНДС_ИсчНалАг");
	
	Для Каждого СтрокаДанных из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItemInvoiceCorrection);
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		InvoiceCorrectionTable.Items.Добавить(Item);
		
		Item.OriginalNumber = СтрокаДанных.НомерИсходнойСтроки;
		
		Item.AmountsDec			= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.AmountsInc			= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.OriginalValues		= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		Item.CorrectedValues	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		
		Item.Product		= СтрокаДанных.НоменклатураПредставление;
		Item.ItemVendorCode	= СтрокаДанных.КодНоменклатуры;
		
		СтавкаДоИзменения = СтрокаДанных.СтавкаНДСДоИзменения;
		Если Не ЗначениеЗаполнено(СтавкаДоИзменения) Тогда
			СтавкаДоИзменения = СтрокаДанных.СтавкаНДС;
		КонецЕсли;
		
		Item.CorrectedValues.TaxRate = ПредставлениеСтавкиНДС(СтрокаДанных.СтавкаНДС);
		Item.OriginalValues.TaxRate  = ПредставлениеСтавкиНДС(СтавкаДоИзменения);
		
		Если Item.CorrectedValues.TaxRate <> СтавкаНДС_БезНДС Тогда
			ВсеСтроки_СтавкаНДС_БезНДС = Ложь;
		КонецЕсли;
		Если Item.CorrectedValues.TaxRate <> СтавкаНДС_ИсчНалАг Тогда
			ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
		КонецЕсли;
		
		Item.OriginalValues.TotalWithVatExcluded  = СтрокаДанных.СуммаДоИзменения - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДСДоИзменения, 0);
		Item.CorrectedValues.TotalWithVatExcluded = СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДС, 0);
		
		Если ПривестиКЧислуЛок(СтрокаДанных.КоличествоДоИзменения) > 0
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения) Тогда
			
			Item.OriginalValues.Quantity = СтрокаДанных.КоличествоДоИзменения;
			Item.OriginalValues.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Код));
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Наименование) Тогда
				Item.OriginalValues.UnitName = СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Наименование;
			Иначе
				Item.OriginalValues.UnitName = НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(Item.OriginalValues.UnitCode);
			КонецЕсли;
			
			Если Item.OriginalValues.TaxRate = СтавкаНДС_БезНДС Или Не СтрокаДанных.СуммаВключаетНДС Тогда
				// Без пересчета, т.к. цена уже без НДС
				Item.OriginalValues.Price = СтрокаДанных.ЦенаДоИзменения;
			Иначе
				// Расчет цены без НДС
				Item.OriginalValues.Price = ?(ЗначениеЗаполнено(Item.OriginalValues.Quantity), Окр(Item.OriginalValues.TotalWithVatExcluded / Item.OriginalValues.Quantity, 2), 0);
			КонецЕсли;
			
			Item.OriginalValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмеренияДоИзменения;
			
		Иначе
			
		КонецЕсли;
			
		Если ПривестиКЧислуЛок(СтрокаДанных.Количество) > 0
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
			
			Item.CorrectedValues.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.ЕдиницаИзмерения.Код));
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения.Наименование) Тогда
				Item.CorrectedValues.UnitName = СтрокаДанных.ЕдиницаИзмерения.Наименование;
			Иначе
				Item.CorrectedValues.UnitName = НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(Item.CorrectedValues.UnitCode);
			КонецЕсли;
			
			Item.CorrectedValues.Quantity = СтрокаДанных.Количество;
				
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Или Не СтрокаДанных.СуммаВключаетНДС Тогда
				// Без пересчета, т.к. цена уже без НДС
				Item.CorrectedValues.Price = СтрокаДанных.Цена;
			Иначе
				// Расчет цены без НДС
				Item.CorrectedValues.Price = ?(ЗначениеЗаполнено(Item.CorrectedValues.Quantity), Окр(Item.CorrectedValues.TotalWithVatExcluded / Item.CorrectedValues.Quantity, 2), 0);
			КонецЕсли;
			
			Item.CorrectedValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмерения;
			
		ИначеЕсли ПривестиКЧислуЛок(СтрокаДанных.КоличествоДоИзменения) > 0 И ПривестиКЧислуЛок(СтрокаДанных.Количество) = 0 Тогда
			
			Item.CorrectedValues.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.ЕдиницаИзмерения.Код));
			
			Если НЕ ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения)
				И СтрокаДанных.ЭтоУслуга Тогда
				
				Item.CorrectedValues.UnitCode = "";
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения.Наименование) Тогда
				Item.CorrectedValues.UnitName = СтрокаДанных.ЕдиницаИзмерения.Наименование;
			Иначе
				Item.CorrectedValues.UnitName = НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(Item.CorrectedValues.UnitCode);
			КонецЕсли;
			
			Item.CorrectedValues.Quantity = 0;
				
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Или Не СтрокаДанных.СуммаВключаетНДС Тогда
				// Без пересчета, т.к. цена уже без НДС
				Item.CorrectedValues.Price = СтрокаДанных.Цена;
			Иначе
				// Расчет цены без НДС
				Item.CorrectedValues.Price = ?(ЗначениеЗаполнено(Item.CorrectedValues.Quantity), Окр(Item.CorrectedValues.TotalWithVatExcluded / Item.CorrectedValues.Quantity, 2), 0);
			КонецЕсли;
			
			Item.CorrectedValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмерения;
			
		КонецЕсли;
		
		// НДС и сумма с НДС до изменения
		Если Item.OriginalValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.OriginalValues.Vat = 0;
			Item.OriginalValues.Total = 0;
		Иначе
			
			Если Item.OriginalValues.TaxRate = СтавкаНДС_БезНДС Тогда
				Item.OriginalValues.Vat = Неопределено;
			Иначе
				Item.OriginalValues.Vat = СтрокаДанных.СуммаНДСДоИзменения;
			КонецЕсли;
			
			Item.OriginalValues.Total   = СтрокаДанных.СуммаДоИзменения + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДСДоИзменения);
			
		КонецЕсли;
		
		// НДС и сумма с НДС после изменения
		Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.CorrectedValues.Vat = 0;
			Item.CorrectedValues.Total = 0;
		Иначе
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
				Item.CorrectedValues.Vat = Неопределено;
			Иначе
				Item.CorrectedValues.Vat = СтрокаДанных.СуммаНДС;
			КонецЕсли;
			
			Если СтрокаДанных.Цена <> 0 И СтрокаДанных.Сумма = 0 Тогда 
				
				СуммаСтроки = СтрокаДанных.Количество*СтрокаДанных.Цена;
				
			Иначе	
				
				СуммаСтроки = СтрокаДанных.Сумма; 
				
			КонецЕсли;
			
			Item.CorrectedValues.Total = СуммаСтроки + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
			
		КонецЕсли;
		
		ЭтоНДСИНА = (Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг);
		Если ЭтоНДСИНА Тогда
			ЭтоСтрокаНаУвеличение = (Item.CorrectedValues.TotalWithVatExcluded >= Item.OriginalValues.TotalWithVatExcluded);
		Иначе
			ЭтоСтрокаНаУвеличение = (Item.CorrectedValues.Total >= Item.OriginalValues.Total);
		КонецЕсли;
		
		Если ЭтоСтрокаНаУвеличение Тогда
			
			// Увеличение
			ЕстьУвеличение = Истина;
			
			Item.AmountsDec.TotalWithVatExcluded = Неопределено;
			Item.AmountsDec.Vat = Неопределено;
			Item.AmountsDec.Total = Неопределено;
			
			Item.AmountsInc.TotalWithVatExcluded = Item.CorrectedValues.TotalWithVatExcluded - Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsInc.Vat = Неопределено;
				Item.AmountsInc.Total = Неопределено;
			Иначе
				
				Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
					Item.AmountsInc.Vat = 0;
				Иначе
					Item.AmountsInc.Vat = МетодСервера(, "ПривестиКЧислу", Item.CorrectedValues.Vat) - МетодСервера(, "ПривестиКЧислу", Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsInc.Total = Item.CorrectedValues.Total - Item.OriginalValues.Total;
				
			КонецЕсли;
			
		Иначе
			
			// Уменьшение
			ЕстьУменьшение = Истина;
			
			Item.AmountsInc.TotalWithVatExcluded = Неопределено;
			Item.AmountsInc.Vat = Неопределено;
			Item.AmountsInc.Total = Неопределено;
			
			Item.AmountsDec.TotalWithVatExcluded = - Item.CorrectedValues.TotalWithVatExcluded + Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsDec.Vat = Неопределено;
				Item.AmountsDec.Total = Неопределено;
			Иначе
				
				Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
					Item.AmountsDec.Vat = 0;
				Иначе
					Item.AmountsDec.Vat = - МетодСервера(, "ПривестиКЧислу", Item.CorrectedValues.Vat) + МетодСервера(, "ПривестиКЧислу", Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsDec.Total = -Item.CorrectedValues.Total + Item.OriginalValues.Total;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Item.OriginalValues.Excise = СтрокаДанных.АкцизДоИзменения;
		Item.CorrectedValues.Excise = СтрокаДанных.Акциз;
		
		Если Item.OriginalValues.Excise <> Неопределено Или Item.CorrectedValues.Excise <> Неопределено Тогда
			
			ВеличинаИзменения =
				ПривестиКЧислуЛок(Item.CorrectedValues.Excise)
				- ПривестиКЧислуЛок(Item.OriginalValues.Excise);
			
			Если ВеличинаИзменения >= 0 Тогда
				Item.AmountsInc.Excise = ВеличинаИзменения;
				Item.AmountsDec.Excise = Неопределено;
			Иначе
				Item.AmountsInc.Excise = Неопределено;
				Item.AmountsDec.Excise = - ВеличинаИзменения;
			КонецЕсли;
			
		КонецЕсли;
		
		TotalsDec_Total 				= TotalsDec_Total + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.Total);
		TotalsDec_TotalWithVatExcluded 	= TotalsDec_TotalWithVatExcluded + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.TotalWithVatExcluded);
		TotalsDec_Vat 					= TotalsDec_Vat + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.Vat);
		
		TotalsInc_Total 				= TotalsInc_Total + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.Total);
		TotalsInc_TotalWithVatExcluded 	= TotalsInc_TotalWithVatExcluded + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.TotalWithVatExcluded);
		TotalsInc_Vat 					= TotalsInc_Vat + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.Vat);
		
		СведенияОСтранеПроисхожденияТовара	= КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных);
		ДопИнформацияОСтранеПроисхождения	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "СведенияОСтранеПроисхожденияСтрокой", СведенияОСтранеПроисхожденияТовара);
		
		ЗаполнитьStructedAdditionalInfos(Item.StructedAdditionalInfos, ДопИнформацияОСтранеПроисхождения);
		
	КонецЦикла;	  
	
	Если ЕстьУвеличение Тогда
		InvoiceCorrectionTable.TotalsInc.Total 					= TotalsInc_Total; 
		InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded	= TotalsInc_TotalWithVatExcluded; 
		InvoiceCorrectionTable.TotalsInc.Vat 					= ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, TotalsInc_Vat)); 
	КонецЕсли;
	
	Если ЕстьУменьшение Тогда
		InvoiceCorrectionTable.TotalsDec.Total					= TotalsDec_Total; 
		InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded	= TotalsDec_TotalWithVatExcluded; 
		InvoiceCorrectionTable.TotalsDec.Vat 					= ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, TotalsDec_Vat)); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьEventContent(EventContent, ШапкаУКД)
	
	Для Каждого ПередаточныйДокумент Из ШапкаУКД.РеквизитыПередаточныхДокументов Цикл	
		Новый_BaseDocument = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_BaseDocumentName");
		ЗаполнитьЗначенияСвойств(Новый_BaseDocument, ПередаточныйДокумент);
		EventContent.TransferDocDetails736.Добавить(Новый_BaseDocument);	
	КонецЦикла;
	Если ШапкаУКД.Свойство("ИныеСведенияОбИзмененииСтоимости") Тогда
		EventContent.CostChangeInfo = ШапкаУКД.ИныеСведенияОбИзмененииСтоимости;
	КонецЕсли;
	Если ШапкаУКД.Свойство("ДатаУведомления") Тогда
		EventContent.NotificationDate = ШапкаУКД.ДатаУведомления;
	КонецЕсли;
	
	EventContent.OperationContent = "Изменение стоимости товаров и услуг";
	
	CorrectionBases 				= Новый Массив;
	СтруктураItemCorrectionBases 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CorrectionBase");
	
	ОснованияПередачи = ШапкаУКД.ОснованияПередачи;
	Если ОснованияПередачи.Количество() > 0 Тогда
		СкопироватьСтруктуру(СтруктураItemCorrectionBases);
		Для Каждого ОснованиеПередачи Из ОснованияПередачи Цикл
			ItemCorrectionBases = СкопироватьСтруктуру(СтруктураItemCorrectionBases);
			ЗаполнитьЗначенияСвойств(ItemCorrectionBases, ОснованиеПередачи);
			CorrectionBases.Добавить(ItemCorrectionBases);
		КонецЦикла;
	Иначе
		СтруктураItemCorrectionBases.BaseDocumentName = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОснованиеПередачи_БезДокументаОснования");
		CorrectionBases.Добавить(СтруктураItemCorrectionBases);
	КонецЕсли;
	
	EventContent.CorrectionBases = CorrectionBases;
	
КонецПроцедуры

//} Get UniversalCorrectionDocument content
////////////////////////////////////////////////////////////////////////////////

//} Get content
////////////////////////////////////////////////////////////////////////////////

//} РАБОТА С КОНТЕНТОМ
////////////////////////////////////////////////////////////////////////////////

