
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого КлючЗначение Из Параметры.Сертификат Цикл
		
		Если КлючЗначение.Ключ = "Издатель" Тогда
			ЗаполнитьТаблицуФормыПоСтруктуре(Издатель,	Параметры.Сертификат.Издатель);
		ИначеЕсли КлючЗначение.Ключ = "Субъект" Тогда
			ЗаполнитьТаблицуФормыПоСтруктуре(Субъект,	Параметры.Сертификат.Субъект);
		ИначеЕсли Элементы.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
			ЭтаФорма[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуФормыПоСтруктуре(ТаблицаФормы, Структура)
	
	Для Каждого КлючЗначение Из Структура Цикл
		СтрокаТаблицыФормы = ТаблицаФормы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыФормы, КлючЗначение);
	КонецЦикла;
	
КонецПроцедуры
