////////////////////////////////////////////////////////////////////////////////
// Методы общего назначения:
// - Значение реквизитов объектов;
// - Получение общих модулей;
// - Проверка существования подсистем;
// - прочее.
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Модуль содержит процедуры и функции из Библиотеки стандартных подсистем,
// распространяемой под лицензией Attribution 4.0 International (CC BY 4.0)
// https://creativecommons.org/licenses/by/4.0/legalcode производны от нее
// или вдохновлены ею, является ООО 1С-Софт (https://1c.ru/).
// Авторские права 2024 г. принадлежат ООО 1С-Софт. Все права защищены.
//
// Процедуры и функции из Библиотеки стандартных подсистем:
//  - ЗначенияРеквизитовОбъектаЛок
//  - ЗначениеРеквизитаОбъектаЛок
//  - ЗначенияРеквизитовОбъектовЛок
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
&НаКлиенте
Перем СтдКлиентЛок, СтдОбщегоНазначенияСлужебный83Лок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// БСП: ОПОВЕЩЕНИЕ ПОЛЬЗОВАТЕЛЯ

// Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// См. ОбщегоНазначения.СообщитьПользователю
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимого.
//   3. Установка ссылки без установки поля (и/или пути к данным).
//
&НаКлиенте
Процедура СообщитьПользователюЛок(Знач ТекстСообщенияПользователю, Знач КлючДанных = Неопределено,
		Знач Поле = "", Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Сообщение = СтдКлиентЛок.ОбщегоНазначения().СообщениеПользователюЛок(ТекстСообщенияПользователю,
			КлючДанных, Поле, ПутьКДанным, Отказ);
	
	Сообщение.Сообщить();
	
КонецПроцедуры // СообщитьПользователюЛок

// БСП: НЕОБЯЗАТЕЛЬНЫЕ ПОДСИСТЕМЫ

// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//   ОбщийМодуль
//   МодульМенеджераОбъекта
//
// Пример:
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
&НаКлиенте
Функция ОбщийМодульЛок(Имя) Экспорт
	
	Модуль = Вычислить(Имя);
	
	#Если Не ВебКлиент Тогда
	
	// В веб-клиенте не проверяется
	// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтдКлиентЛок.Стр().ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Общий модуль ""%1"" не существует.'"),
			Имя);
	КонецЕсли;
	
	#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции // ОбщийМодульЛок

// БСП: СРЕДА ИСПОЛНЕНИЯ

// Возвращает Истина, если приложение запущено под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Windows
//
&НаКлиенте
Функция ЭтоWindowsКлиентЛок() Экспорт
	
	Возврат СтдКлиентЛок.ОС().ЭтоWindows();
	
КонецФункции // ЭтоWindowsКлиентЛок

// Возвращает Истина, если приложение запущено под управлением ОС Linux.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Linux
//
&НаКлиенте
Функция ЭтоLinuxКлиентЛок() Экспорт
	
	Возврат СтдКлиентЛок.ОС().ЭтоLinux();
	
КонецФункции // ЭтоLinuxКлиентЛок

// Возвращает Истина, если приложение запущено под управлением macOS.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением macOS
//
&НаКлиенте
Функция ЭтоMacOSКлиентЛок() Экспорт
	
	Возврат СтдКлиентЛок.ОС().ЭтоMacOS();
	
КонецФункции // ЭтоMacOSКлиентЛок

// Возвращает объем оперативной памяти, доступной клиентскому  приложению.
//
// См. ОбщегоНазначения.ОперативнаяПамятьДоступнаяКлиентскомуПриложению
//
// Возвращаемое значение:
//  Число - количество гигабайтов оперативной памяти с точностью до десятых долей.
//  Неопределено - нет клиентского приложения, то есть ТекущийРежимЗапуска() = Неопределено.
//
&НаКлиенте
Функция ОперативнаяПамятьДоступнаяКлиентскомуПриложениюЛок() Экспорт
	
	Возврат СтдКлиентЛок.ОС().ОперативнаяПамятьДоступнаяПриложению();
	
КонецФункции // ОперативнаяПамятьДоступнаяКлиентскомуПриложениюЛок

// Возвращает системную информацию клиента, если есть клиентское приложение.
// До первого серверного вызова с клиента вернет Неопределено.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ВерсияОС - Строка
//    * ВерсияПриложения - Строка
//    * ИдентификаторКлиента - УникальныйИдентификатор
//    * ИнформацияПрограммыПросмотра - Строка
//    * ОперативнаяПамять - Число
//    * Процессор - Строка
//    * ТипПлатформы - см. ИмяТипаПлатформы
//  Неопределено - если нет клиентского приложения или информация запрашивается
//   до первого серверного вызова, например, при первом вызове события
//   платформы УстановкаПараметровСеанса в модуле сеанса.
//
&НаКлиенте
Функция СистемнаяИнформацияКлиентаЛок() Экспорт
	
	Результат = Новый Структура(
			"ВерсияОС,
			|ВерсияПриложения,
			|ИдентификаторКлиента,
			|ИнформацияПрограммыПросмотра,
			|ОперативнаяПамять,
			|Процессор,
			|ТипПлатформы");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ЗаполнитьЗначенияСвойств(Результат, СистемнаяИнформация);
	
	Результат.ТипПлатформы = ЗначениеТипаПлатформыСистемнойИнформацииКлиента(СистемнаяИнформация.ТипПлатформы);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // СистемнаяИнформацияКлиентаЛок

// Определяет что клиентское приложение подключено к базе через веб-сервер.
//
// Возвращаемое значение:
//  Булево - Истина, если подключен.
&НаКлиенте
Функция КлиентПодключенЧерезВебСерверЛок() Экспорт
	
	Возврат СтдКлиентЛок.Стр().СтрНайтиЛок(ВРег(СтрокаСоединенияИнформационнойБазы()), "WS=") = 1;
	
КонецФункции // КлиентПодключенЧерезВебСерверЛок

// БСП: ВЕРСИОНИРОВАНИЕ

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсия1  - Строка - номер версии.
//  СтрокаВерсия2  - Строка - номер сравниваемой версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
&НаКлиенте
Функция СравнитьВерсииЛок(Знач СтрокаВерсия1, Знач СтрокаВерсия2) Экспорт
	
	Возврат СтдКлиентЛок.Стр().СравнитьВерсииЛок(СтрокаВерсия1, СтрокаВерсия2);
	
КонецФункции // СравнитьВерсииЛок

// Сравнить две строки версий. Номером сборки считается 4 разряд версии
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
&НаКлиенте
Функция СравнитьВерсииБезНомераСборкиЛок(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Возврат СтдКлиентЛок.Стр().СравнитьВерсииБезНомераСборкиЛок(СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции // СравнитьВерсииБезНомераСборкиЛок

// Получает номер версии конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС - номер сборки, который будет удален.
//
// Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
&НаКлиенте
Функция ВерсияКонфигурацииБезНомераСборкиЛок(Знач Версия) Экспорт
	
	Возврат СтдКлиентЛок.Стр().ВерсияКонфигурацииБезНомераСборкиЛок(Версия);
	
КонецФункции // ВерсияКонфигурацииБезНомераСборкиЛок

// БСП: EMAIL АДРЕСА

// Разбирает строку с адресами электронной почты. При разборе проверяет корректность адресов.
//
// Параметры:
//  СписокАдресов - Строка - адреса электронной почты, разделитель - запятая, либо точка с запятой:
//                           Получатель1 <Адрес1>, Получатель 2 <Адрес2>,...
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Псевдоним      - Строка - представление адресата.
//   * Адрес          - Строка - найденный и соответствующий требованиям почтовый адрес.
//                               Если текст, похожий на адрес найден, но не соответствует требованиям
//                               стандартов, то такой текст записывается в поле "Псевдоним".
//   * ОписаниеОшибки - Строка - текстовое представление ошибки, либо пустая строка, если ошибок нет.
//
&НаКлиенте
Функция АдресаЭлектроннойПочтыИзСтрокиЛок(Знач СписокАдресов) Экспорт
	
	Возврат СтдКлиентЛок.Стр().АдресаЭлектроннойПочтыИзСтрокиЛок(СписокАдресов);
	
КонецФункции // АдресаЭлектроннойПочтыИзСтрокиЛок

// Проверяет email-адрес на соответствие требованиям стандартов RFC 5321, RFC 5322,
// а также RFC 5335, RFC 5336 и RFC 3696.
// Кроме того, функция ограничивает использование спецсимволов.
//
// Параметры:
//  Адрес - Строка - проверяемый email.
//  РазрешитьЛокальныеАдреса - Булево - не выдавать ошибку в случае отсутствия зоны домена в адресе.
//
// Возвращаемое значение:
//  Булево - Истина, если ошибок нет.
//
&НаКлиенте
Функция АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Знач Адрес, РазрешитьЛокальныеАдреса = Ложь) Экспорт
	
	Возврат СтдКлиентЛок.Стр().АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Адрес, РазрешитьЛокальныеАдреса);
	
КонецФункции // АдресЭлектроннойПочтыСоответствуетТребованиямЛок

// Проверяет, что введенная строка с email-адресами введена правильно.
//
// Формат строки:
//  Z = ИмяПользователя|[Имя Пользователя] [<]пользователь@почтовый_сервер[>], Строка = Z[<разделитель*>Z].
//
//  Прим.: разделитель* - имеется ввиду любой разделитель адресов.
//
// Параметры:
//  СтрокаПереданныхАдресов - Строка - правильная строка с почтовыми адресами.
//  ВызыватьИсключение - Булево - передать Ложь, чтобы в случае неуспешного разбора не выдавалось исключение.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Адрес - Строка - e-mail получателя.
//   * Представление - Строка - имя получателя.
//
&НаКлиенте
Функция РазобратьСтрокуСПочтовымиАдресамиЛок(Знач СтрокаПереданныхАдресов, ВызыватьИсключение = Истина) Экспорт
	
	Возврат СтдКлиентЛок.Стр().РазобратьСтрокуСПочтовымиАдресамиЛок(СтрокаПереданныхАдресов, ВызыватьИсключение);
	
КонецФункции // РазобратьСтрокуСПочтовымиАдресамиЛок

// БСП: КОЛЛЕКЦИИ

// Добавляет в таблицу приемник строки из таблицы источника
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой нужно взять строки;
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую нужно добавить строки;
//
&НаКлиенте
Процедура ДополнитьТаблицуЛок(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	СтдКлиентЛок.Коллекции().ДополнитьТаблицуЛок(ТаблицаИсточник, ТаблицаПриемник);
	
КонецПроцедуры // ДополнитьТаблицуЛок

// Дополняет массив значениями из другого массива
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник - Массив - массив, из которого нужно взять значения;
//  ТолькоНовые - Булево - (необязательный) Истина, если в приемник
//					нужно добавить только те значения, которых там еще нет;
//
&НаКлиенте
Процедура ДополнитьМассивЛок(МассивПриемник, МассивИсточник, ТолькоНовые = Ложь) Экспорт
	
	СтдКлиентЛок.Коллекции().ДополнитьМассивЛок(МассивПриемник, МассивИсточник, ТолькоНовые);
	
КонецПроцедуры // ДополнитьМассивЛок

// Дополняет структуру значениями из другой структуры.
//
// Параметры:
//   СтруктураПриемник - Структура - коллекция, в которую будут добавляться новые значения.
//   СтруктураИсточник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь   - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
&НаКлиенте
Процедура ДополнитьСтруктуруЛок(СтруктураПриемник, СтруктураИсточник, Заменять = Неопределено) Экспорт
	
	СтдКлиентЛок.Коллекции().ДополнитьСтруктуруЛок(СтруктураПриемник, СтруктураИсточник, Заменять);
	
КонецПроцедуры // ДополнитьСтруктуруЛок

// Дополняет соответствие значениями из другой соответствия.
//
// Параметры:
//   СоответствиеПриемник - Соответствие - коллекция, в которую будут добавляться новые значения.
//   СоответствиеИсточник - Соответствие - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
&НаКлиенте
Процедура ДополнитьСоответствиеЛок(СоответствиеПриемник, СоответствиеИсточник, Заменять = Неопределено) Экспорт
	
	СтдКлиентЛок.Коллекции().ДополнитьСоответствиеЛок(СоответствиеПриемник, СоответствиеИсточник, Заменять);
	
КонецПроцедуры // ДополнитьСоответствиеЛок

// Удаляет все вхождения переданного значения из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Произвольный - удаляемое значение из массива.
//
&НаКлиенте
Процедура УдалитьВсеВхожденияЗначенияИзМассиваЛок(Массив, Значение) Экспорт
	
	СтдКлиентЛок.Коллекции().УдалитьВсеВхожденияЗначенияИзМассиваЛок(Массив, Значение);
	
КонецПроцедуры // УдалитьВсеВхожденияЗначенияИзМассиваЛок

// Удаляет одно значение из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Массив - удаляемое значение из массива.
//
&НаКлиенте
Процедура УдалитьЗначениеИзМассиваЛок(Массив, Значение) Экспорт
	
	СтдКлиентЛок.Коллекции().УдалитьЗначениеИзМассиваЛок(Массив, Значение);
	
КонецПроцедуры // УдалитьЗначениеИзМассиваЛок

// Возвращает массив уникальных значений (аналогия множества)
//
// Параметры:
//  Массив - Массив, ФиксированныйМассив - массив, который необходимо свернуть;
//
// Возвращаемое значение:
//  Массив, ФиксированныйМассив - свернутый массив
//
&НаКлиенте
Функция СвернутьМассивЛок(Знач Массив) Экспорт
	Возврат СтдКлиентЛок.Коллекции().СвернутьМассивЛок(Массив);
КонецФункции // СвернутьМассивЛок

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив - массив из одного элемента.
//
&НаКлиенте
Функция ЗначениеВМассивеЛок(Знач Значение) Экспорт
	Возврат СтдКлиентЛок.Коллекции().ЗначениеВМассивеЛок(Значение);
КонецФункции // ЗначениеВМассивеЛок

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
//
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в
//                                       структуре нет указанного свойства.
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаКлиенте
Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат СтдКлиентЛок.Коллекции().СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции // СвойствоСтруктурыЛок

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
&НаКлиенте
Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции // ЕстьРеквизитИлиСвойствоОбъектаЛок

// БСП: ПРИВЕДЕНИЕ ЗНАЧЕНИЙ

// Приводит строковое значение к дате.
//
// Параметры:
//  Значение - Строка - строковое значение, которое приводится к дате.
//
// Возвращаемое значение:
//   Дата - приведенное значение.
//
&НаКлиенте
Функция СтрокаВДатуЛок(Знач Значение) Экспорт
	
	Возврат СтдКлиентЛок.Коллекции().СтрокаВДатуЛок(Значение);
	
КонецФункции // СтрокаВДатуЛок

// ПРОЧЕЕ

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияЛок(ВыполняемоеОповещение, Результат = Null) Экспорт
	
	Если ВыполняемоеОповещение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыполняемоеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Если Результат = Null Тогда
			МассивПараметров = Неопределено;
		Иначе
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Результат);
		КонецЕсли;
		ВыполнитьОбработкуОповещенияСлужебный(ВыполняемоеОповещение, МассивПараметров);
	Иначе
		СтдОбщегоНазначенияСлужебный83().ВыполнитьОбработкуОповещенияЛок(ВыполняемоеОповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьОбработкуОповещенияЛок

// Конструктор объекта ОписаниеОповещения
//
// Параметры:
//  ИмяПроцедуры - Строка - имя экспортируемой процедуры модуля
//  Модуль - ФормаКлиентскогоПриложения - для вызова метода модуля указанной формы
//         - КомандаКомандногоИнтерфейса - для вызова метода модуля команды командного интерфейса
//         - ОбщийМодуль - для вызова метода общего неглобального модуля
//  ДополнительныеПараметры - Произвольный - значение любого типа, которое будет передано в вызываемую функцию
//  ИмяПроцедурыОбработкиОшибки - Строка - имя экспортируемой процедуры модуля, которая будет вызвана при ошибке
//  МодульОбработкиОшибки - см. Модуль - аналогичный модуль для обработки ошибки
//
// Возвращаемое значение:
//   ОписаниеОповещения, ФиксированнаяСтруктура - Описание оповещения
//
&НаКлиенте
Функция ОписаниеОповещения(ИмяПроцедуры, Модуль,
		ДополнительныеПараметры = Неопределено,
		ИмяПроцедурыОбработкиОшибки = Неопределено,
		МодульОбработкиОшибки = Неопределено) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ИмяПроцедуры);
	МассивПараметров.Добавить(Модуль);
	МассивПараметров.Добавить(ДополнительныеПараметры);
	
	Если ИмяПроцедурыОбработкиОшибки <> Неопределено
		И МодульОбработкиОшибки <> Неопределено Тогда
		МассивПараметров.Добавить(ИмяПроцедурыОбработкиОшибки);
		МассивПараметров.Добавить(МодульОбработкиОшибки);
	КонецЕсли;
	
	Попытка
		ОписаниеОповещения = Новый(Тип("ОписаниеОповещения"), МассивПараметров);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();

		ОписаниеОповещения = Новый Структура;
		ОписаниеОповещения.Вставить("ИмяПроцедуры", ИмяПроцедуры);
		ОписаниеОповещения.Вставить("Модуль", Модуль);
		ОписаниеОповещения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		ОписаниеОповещения.Вставить("ИмяПроцедурыОбработкиОшибки", ИмяПроцедурыОбработкиОшибки);
		ОписаниеОповещения.Вставить("МодульОбработкиОшибки", МодульОбработкиОшибки);
		ОписаниеОповещения = Новый ФиксированнаяСтруктура(ОписаниеОповещения);
	КонецПопытки;
	
	Возврат ОписаниеОповещения;
	
КонецФункции // ОписаниеОповещения

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция Инит(СтдКлиент) Экспорт
	
	СтдКлиентЛок = СтдКлиент;
	
	Возврат ЭтаФорма;
	
КонецФункции // Инит

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияСлужебный(ВыполняемоеОповещение, МассивПараметров = Неопределено)
	
	Если ВыполняемоеОповещение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокаПараметров = Новый Массив;
	Если ТипЗнч(МассивПараметров) = Тип("Массив")
		ИЛИ ТипЗнч(МассивПараметров) = Тип("ФиксированныйМассив") Тогда
		Для Сч = 0 По МассивПараметров.ВГраница() Цикл
			МассивСтрокаПараметров.Добавить("МассивПараметров[" + Формат(Сч, "ЧН=0; ЧГ=0") + "]");
		КонецЦикла;
	КонецЕсли;
	МассивСтрокаПараметров.Добавить("ВыполняемоеОповещение.ДополнительныеПараметры");
	СтрокаПараметров = СтдКлиентЛок.Стр().СтрСоединитьЛок(МассивСтрокаПараметров, ", ");
	
	Скрипт = "ВыполняемоеОповещение.Модуль.%1(%2)";
	Скрипт = СтрЗаменить(Скрипт, "%1", ВыполняемоеОповещение.ИмяПроцедуры);
	Скрипт = СтрЗаменить(Скрипт, "%2", СтрокаПараметров);
	
	Выполнить(Скрипт);
	
КонецПроцедуры // ВыполнитьОбработкуОповещенияСлужебный

&НаКлиенте
Функция ЗначениеТипаПлатформыСистемнойИнформацииКлиента(Значение)

	Массив = Новый Массив;
	Массив.Добавить("Android_ARM");
	Массив.Добавить("Android_ARM_64");
	Массив.Добавить("Android_x86");
	Массив.Добавить("Android_x86_64");
	Массив.Добавить("iOS_ARM");
	Массив.Добавить("iOS_ARM_64");
	Массив.Добавить("Linux_ARM64");
	Массив.Добавить("Linux_E2K");
	Массив.Добавить("Linux_x86");
	Массив.Добавить("Linux_x86_64");
	Массив.Добавить("MacOS_x86");
	Массив.Добавить("MacOS_x86_64");
	Массив.Добавить("Windows_x86");
	Массив.Добавить("Windows_x86_64");
	Массив.Добавить("WinRT_ARM");
	Массив.Добавить("WinRT_x86");
	Массив.Добавить("WinRT_x86_64");	
	
	Соответствие = Новый Соответствие;
	
	Для Каждого Элемент Из Массив Цикл
		Попытка 	
			Соответствие.Вставить(ТипПлатформы[Элемент], Элемент);
		Исключение
			Продолжить;	
		КонецПопытки;
	КонецЦикла;
	
	Результат = Соответствие.Получить(Значение);
	Если Результат = Неопределено Тогда
		Результат = "Неопределено";	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗначениеТипаПлатформыСистемнойИнформацииКлиента

&НаКлиенте
Функция СообщениеПользователюЛок(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных,
		Знач Поле,
		Знач ПутьКДанным = "",
		Отказ = Ложь,
		ЭтоОбъект = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Отказ = Истина;
	
	Возврат Сообщение;
	
КонецФункции // СообщениеПользователюЛок

&НаКлиенте
Функция СтдОбщегоНазначенияСлужебный83()
	
	Если СтдОбщегоНазначенияСлужебный83Лок = Неопределено Тогда
		СтдОбщегоНазначенияСлужебный83Лок = ПолучитьФорму(
				СтдКлиентЛок.ТипМетаданных
				+ "."
				+ СтдКлиентЛок.ПространствоИмен
				+ "СтдОбщегоНазначения.Форма.Клиент83");
	КонецЕсли;
	
	Возврат СтдОбщегоНазначенияСлужебный83Лок;
	
КонецФункции // СтдОбщегоНазначенияСлужебный83