&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

&НаКлиенте
Перем _МодульПлатформа;

&НаКлиенте
Перем _МодульСМВ;

&НаКлиенте
Перем _ЭтоПрограммноеЗакрытиеФормы; // Булево - Истина, если форма закрывается программно

&НаКлиенте
Перем ОбщийКэш;

&НаКлиенте
Перем КлючТекущейСтроки;


// {	СЕРВИСНЫЕ МЕТОДЫ

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Возврат ЭтаФорма;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяТекущейФормы()
	
	Возврат "Форма";
	
КонецФункции

&НаКлиенте
Функция ИдентификаторОсновнойФормы() Экспорт
	
	Результат = ЭтаФорма.УникальныйИдентификатор;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция МетодСервераБезКонтекста(ВозвращатьРезультат, 
								ИмяМетода, 
								Параметр0 = Неопределено, 
								Параметр1 = Неопределено,
								Параметр2 = Неопределено, 
								Параметр3 = Неопределено, 
								Параметр4 = Неопределено) Экспорт
								
	Возврат Модуль_Платформа().МетодСервераБезКонтекста(ВозвращатьРезультат,
														ИмяМетода,
														Параметр0,
														Параметр1,
														Параметр2,
														Параметр3,
														Параметр4
	);
	
	
КонецФункции

// Фиксирует Данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// BSLLS:TooManyReturns-off
// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:IfElseIfEndsWithElse-off
// BSLLS:IfConditionComplexity-off
// BSLLS:DuplicateStringLiteral-off
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - коллекции, значения которых являются примитивными типами,
//           хранилищем значения или не могут быть изменены. Поддерживаются типы значений:
//           Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//           ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//           ЛюбаяСсылка.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
// 
&НаКлиентеНаСервереБезКонтекста
Функция ФиксированныеДанныеЛок(Данные)
	
	Если ТипЗнч(Данные) = Тип("Массив")
		Или ТипЗнч(Данные) = Тип("ФиксированныйМассив") Тогда
		Массив = Новый Массив;
		
		Для Каждого Значение Из Данные Цикл
			
			Если ТипЗнч(Значение) = Тип("Структура")
				Или ТипЗнч(Значение) = Тип("Соответствие")
				Или ТипЗнч(Значение) = Тип("Массив")
				Или ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
				
				Массив.Добавить(ФиксированныеДанныеЛок(Значение));
				
			Иначе
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		Или ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Коллекция = Новый Структура;
		Иначе
			Коллекция = Новый Соответствие;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из Данные Цикл
			Значение = КлючИЗначение.Значение;
			
			Если ТипЗнч(Значение) = Тип("Структура")
			 ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			 ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Коллекция.Вставить(
					КлючИЗначение.Ключ, ФиксированныеДанныеЛок(Значение));
			Иначе
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Возврат Новый ФиксированнаяСтруктура(Коллекция);
		Иначе
			Возврат Новый ФиксированноеСоответствие(Коллекция);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Данные;
	
	// BSLLS:TooManyReturns-on
	// BSLLS:CognitiveComplexity-on
	// BSLLS:CyclomaticComplexity-on
	// BSLLS:IfElseIfEndsWithElse-on
	// BSLLS:IfConditionComplexity-on
	// BSLLS:DuplicateStringLiteral-on
	
КонецФункции // ФиксированныеДанные

// Возвращает объект обработки ядра
// 
// Возвращаемое значение:
//  ОбработкаОбъект
//
&НаСервере
Функция Модуль_ЯдроНаСервере() Экспорт
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

// Возвращает форму клиентских вызовов обработки ядра
//
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Модуль_ЯдроНаКлиенте() Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Результат = Модуль_Платформа.Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

// Синхронизирует контекст вызываемой формы с контекстом текущей формы.
//
// Параметры:
//  ВызываемаяФорма - ФормаКлиентскогоПриложения - форма корневой обработки или ядра.
//
&НаКлиенте
Процедура УстановитьКонтекстВызываемойФормы(ВызываемаяФорма)
	
	ВызываемаяФорма.Объект.ОбщийКонтекстКлиентСервер = Объект.ОбщийКонтекстКлиентСервер;
	
КонецПроцедуры

// Возвращает форму для вызова сервера без контекста вызывающей формы
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Если _МодульПлатформа <> Неопределено Тогда
		УстановитьКонтекстВызываемойФормы(_МодульПлатформа);
		Возврат _МодульПлатформа;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	// BSLLS:GetFormMethod-off
	_МодульПлатформа = ПолучитьФорму(ПутьКФормам + "Модуль_ПлатформаУправляемая", ПараметрыФормы, ЭтаФорма);
	// BSLLS:GetFormMethod-on
	
	Возврат _МодульПлатформа;
	
КонецФункции

// Возвращает модуль синхронных/модальных вызовов
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция смв() Экспорт
	
	Если _МодульСМВ = Неопределено Тогда
		
		// BSLLS:GetFormMethod-off
		_МодульСМВ = ПолучитьФорму(ПутьКФормам + "Модуль_СинхронныеМодальныеВызовы", , ЭтаФорма);
		// BSLLS:GetFormMethod-on
		
	КонецЕсли;
	
	Возврат _МодульСМВ;
	
КонецФункции

// }	СЕРВИСНЫЕ МЕТОДЫ


// {	КЭШИРОВАНИЕ

// Возвращает значение из общего кэша
//
// Параметры:
//  Ключ - Строка - см. процедуру Кэш_Поместить
//
// Возвращаемое значение: 
//   Произвольный
//
&НаКлиенте
Функция Кэш_Прочитать(Ключ) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ОбщийКэш) Тогда
		Результат = ОбщийКэш.Получить(Ключ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Помещает значение в общий для кэш
//
// Параметры:
//  Ключ     - Строка       - уникальный ключ помещаемого значения;
//  Значение - Произвольный - помещаемое значение;
//
&НаКлиенте
Процедура Кэш_Поместить(Ключ, Значение) Экспорт
	
	Если ОбщийКэш = Неопределено Тогда
		ОбщийКэш = Новый Соответствие;
	КонецЕсли;
	
	ОбщийКэш.Вставить(Ключ, Значение);
	
КонецПроцедуры

// Очищает все вложенные в общий кэш коллекции
// с помощью метода Очистить()
//
&НаКлиенте
Процедура ОчиститьКэшНаКлиенте()
	
	Если Не ЗначениеЗаполнено(ОбщийКэш) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыКоллекций = Новый Соответствие;
	ТипыКоллекций.Вставить(Тип("Массив")		, Истина);
	ТипыКоллекций.Вставить(Тип("Структура")		, Истина);
	ТипыКоллекций.Вставить(Тип("Соответствие")	, Истина);
	ТипыКоллекций.Вставить(Тип("СписокЗначений"), Истина);
	
	Для Каждого КлючИЗначение Из ОбщийКэш Цикл
		
		ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
		
		Если ТипыКоллекций[ТипЗначения] = Истина Тогда
			КлючИЗначение.Значение.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщийКэш.Очистить();
	
КонецПроцедуры

// }	КЭШИРОВАНИЕ


// {	МЕТОДЫ ИНТЕРАКТИВНОЙ РАБОТЫ

&НаКлиенте
Процедура мОткрытьФорму(мИмяФормы,
						СтруктураДополнительныхПараметры = Неопределено,
						ОписаниеОповещенияОЗакрытии = Неопределено,
						Владелец = Неопределено,
						КлючФормы = Неопределено) Экспорт
	
	// Не блокирующее открытие
	ПараметрыФормы = Новый Структура("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	Если СтруктураДополнительныхПараметры <> Неопределено Тогда
		Для Каждого КлючИЗначение Из СтруктураДополнительныхПараметры Цикл
			ПараметрыФормы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ПараметрыФормы.Свойство("Объект") Тогда
		ПараметрыФормы.Вставить("Объект", Объект);
	КонецЕсли;
	
	Если Владелец = Неопределено Тогда
		Владелец = ЭтаФорма;
	КонецЕсли;
	
    смв().смв_ОткрытьФорму(ПутьКФормам + мИмяФормы, ПараметрыФормы, Владелец, КлючФормы, , , ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДиадокМодально(мИмяФормы,
									мВладелецФормы,
									ПараметрыФормы = Неопределено,
									ОписаниеОповещения = Неопределено,
									РежимБлокирования = Неопределено) Экспорт

    // Обертка. Открывает форму текущей обработки в модальном/блокирующем режиме и выполняет ОписаниеОповещения в конце.

    Если РежимБлокирования = Неопределено Тогда
        РежимБлокирования = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
    КонецЕсли;

    // Добавим стандартные параметры: Объект и ЗакрыватьПриЗакрытииВладельца
    Если ПараметрыФормы = Неопределено Тогда
        ПараметрыФормы = Новый Структура;
    КонецЕсли;

    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
    ПараметрыФормы.Вставить("Объект",                       Объект);

    смв().смв_ОткрытьФорму(ПутьКФормам + мИмяФормы, ПараметрыФормы, мВладелецФормы, , , , ОписаниеОповещения, РежимБлокирования);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьФормуОбработки(ИмяФормы,
								парамВладелецФормы = Неопределено,
								ПараметрыФормы = Неопределено,
								КлючУникальности = Неопределено,
								ЗакрыватьПриЗакрытииВладельца = Ложь) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПараметрыФормы.Свойство("Объект") Тогда
		ПараметрыФормы.Вставить("Объект",	Объект);
	КонецЕсли;
	
	Если парамВладелецФормы = Неопределено Тогда
		парамВладелецФормы = ЭтаФорма;
	КонецЕсли;
	
	Если ЗакрыватьПриЗакрытииВладельца Тогда
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ЗакрыватьПриЗакрытииВладельца);
	КонецЕсли;
	
	// BSLLS:GetFormMethod-off
	Результат = ПолучитьФорму(ПутьКФормам + ИмяФормы, ПараметрыФормы, парамВладелецФормы, КлючУникальности);
	// BSLLS:GetFormMethod-on
	
	УстановитьКонтекстВызываемойФормы(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйОписаниеОповещения(ИмяПроцедуры,
								Модуль,
								ДополнительныеПараметры = Неопределено,
								ИмяПроцедурыОбработкиОшибки = "",
								МодульОбработкиОшибки = Неопределено) Экспорт
	
	Возврат смв().смв_НовыйОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПредупреждениеПереопределенная(ОписаниеОповещения = Неопределено,
												Текст = Неопределено,
												Таймаут = 0,
												Заголовок = "") Экспорт
												
	смв().смв_ПоказатьПредупреждение(ОписаниеОповещения, Текст, Таймаут, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПереопределенная(ОписаниеОповещенияОЗавершении,
										ТекстВопроса,
										Кнопки,
										Таймаут = 0,
										КнопкаПоУмолчанию = Неопределено,
										Заголовок = "",
										КнопкаТаймаута = Неопределено) Экспорт 
							 
							 
	смв().смв_ПоказатьВопрос(ОписаниеОповещенияОЗавершении,
							 ТекстВопроса,
							 Кнопки,
							 Таймаут,
							 КнопкаПоУмолчанию,
							 Заголовок,
							 КнопкаТаймаута);
	
КонецПроцедуры						   

&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, РезультатОповещения = Неопределено) Экспорт
	
	смв().смв_ВыполнитьОбработкуОповещения(ОписаниеОповещения, РезультатОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборЭлемента(Список, ОписаниеОповещенияОЗавершении = Неопределено, Заголовок = "", Элемент = Неопределено) Экспорт
	
	смв().смв_ПоказатьВыборЭлемента(ОписаниеОповещенияОЗавершении, Заголовок, Элемент, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначениеПереопределенная(Значение, ОписаниеОповещенияОЗавершении = Неопределено) Экспорт
	
	смв().смв_ПоказатьЗначение(ОписаниеОповещенияОЗавершении, Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораКаталога(ОписаниеОповещенияОЗавершении,
										Заголовок = Неопределено,
										Каталог = Неопределено,
										МножественныйВыбор = Ложь) Экспорт
	
	смв().смв_ПоказатьДиалогВыбораКаталога(ОписаниеОповещенияОЗавершении, Заголовок, Каталог, МножественныйВыбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла(ОписаниеОповещенияОЗавершении, РежимРаботы, ПараметрыВыбора) Экспорт 
	
	смв().смв_ПоказатьДиалогВыбораФайла(ОписаниеОповещенияОЗавершении, РежимРаботы, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводДатыПереопределенная(ОписаниеОповещенияОЗавершении,
											ВыбраннаяДата = "",
											Подсказка = "",
											ЧастьДаты = Неопределено) Экспорт
	
	смв().смв_ПоказатьВводДаты(ОписаниеОповещенияОЗавершении, ВыбраннаяДата, Подсказка, ЧастьДаты);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьДиалогВыбораИзСписка(СписокЗначений, ОписаниеОповещенияОЗавершении, Форма, ЭлементФормы, Значение = Неопределено) Экспорт
	
	смв().смв_ПоказатьДиалогВыбораИзСписка(СписокЗначений, ОписаниеОповещенияОЗавершении, Форма, ЭлементФормы, Значение);
	
КонецПроцедуры

// Получает форму для отображения прогресса выполнения
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения
//
&НаКлиенте
Функция Форма_ПрогрессВыполнения() 
	
	Результат = Кэш_Прочитать("ФормаПрогресса");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПолучитьФормуОбработки("ИндикацияПрогрессаОбработкиДанныхУправляемая", ЭтаФорма);
	Кэш_Поместить("ФормаПрогресса", Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Форма_ПоказатьВыборИзМеню(Форма,
									ОписаниеОповещенияОЗавершении,
									СписокЗначений,
									ЭлементФормы = Неопределено,
									НачальноеЗначение = Неопределено) Экспорт
	
	смв().смв_Форма_ПоказатьВыборИзМеню(Форма, ОписаниеОповещенияОЗавершении, СписокЗначений, ЭлементФормы, НачальноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеПользователю(Текст, Данные = Неопределено, ФормаВывода = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.ИдентификаторНазначения = ?(ФормаВывода = Неопределено, ЭтаФорма, ФормаВывода).УникальныйИдентификатор;
	Сообщение.Текст = Текст;	
	
	Сообщение.Сообщить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтметкуЭлементов(СписокЗначений, ОписаниеОповещенияОЗакрытии, Заголовок) Экспорт 
	
	смв().смв_ПоказатьОтметкуЭлементов(СписокЗначений, ОписаниеОповещенияОЗакрытии, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыВвода() Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.ПараметрыФормыВвода();
	
	Возврат Результат;
	
КонецФункции 


// }	МЕТОДЫ ИНТЕРАКТИВНОЙ РАБОТЫ


// {	ОСНОВНЫЕ СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если ВебКлиент Тогда
	Если НЕ ОбработкаОбъект().ВозможенЗапускВВебКлиенте() Тогда
		Сообщить("Для работы модуля в веб-клиенте требуется версия платформы 8.3.3.721 или выше");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	#КонецЕсли

	// + ШХ
	
	// Добавим кнопку "Отклонить"
	КомандаОтклонить = ЭтотОбъект.Команды.Добавить("шхВыполнитьОтклонитьЭтап");
	КомандаОтклонить.Заголовок = "Отклонить";
	КомандаОтклонить.Действие = "шхВыполнитьОтклонитьЭтап";
	
	ПараметрыЭлемента = новый Структура;
	ПараметрыЭлемента.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
	ПараметрыЭлемента.Вставить("Картинка", БиблиотекаКартинок.ОтклонитьОтчет);
	
	Кнопка = ФормыУХ.СоздатьКнопкуФормы(Элементы, "шхКнопкаВыполнитьОтклонитьЭтап", "Отклонить", "шхВыполнитьОтклонитьЭтап",, Элементы.КоманднаяПанельДействий, Элементы.ГруппаАнализИОбработка, ПараметрыЭлемента);
	шхРежимПодписания = Ложь;
	
	Если Параметры.Свойство("РежимОткрытияERP", ЭтотОбъект.шхРежимОткрытияERP) Тогда
		
		Если Параметры.Свойство("ТекущиеДокументы") Тогда
			Если Не ТипЗнч(Параметры.ТекущиеДокументы) = Тип("Массив") Тогда
				ПереводВМассив = Новый Массив;
				ПереводВМассив.Добавить(Параметры.ТекущиеДокументы);
				шхТекущиеДокументы = Новый ФиксированныйМассив(ПереводВМассив);
			Иначе
				шхТекущиеДокументы = Новый ФиксированныйМассив(Параметры.ТекущиеДокументы);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.шхРежимОткрытияERP = "Подписание" Тогда
			шхРежимПодписания = Истина;
		ИначеЕсли ЭтотОбъект.шхРежимОткрытияERP = "ПросмотрДокумента" Тогда
			
		Иначе
			ЭтотОбъект.шхРежимОткрытияERP = "";
		КонецЕсли;
	КонецЕсли;
	
	Кнопка.Доступность = шхРежимПодписания;
	
	// - ШХ
	
	ПараметрКонтекстСеанса = Неопределено;
	Параметры.Свойство("КонтекстСеанса", ПараметрКонтекстСеанса);
	
	УстановитьКонтекстФормы(ЭтаФорма, ПараметрКонтекстСеанса);
	УстановитьПредставлениеТекущегоПользователяДиадок(ЭтаФорма);
	
	ИнициализироватьОбщийКонтекстКлиентСерверНаСервере();
	
	ЕстьСистемаХранения = СистемаХраненияОпределена();
	ИспользуетсяПодсистемаДиадок = Объект.ОбщийКонтекстКлиентСервер.ИспользуетсяПодсистемаДиадок;
	
	Модуль = ОбработкаОбъект();
	ПутьКФормам = Модуль.Метаданные().ПолноеИмя() + ".Форма.";
	
	ПроверяемыеСвойства = Новый Структура;
	ПроверяемыеСвойства.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПроверяемыеСвойства, Модуль);
	
	ЭтоВнешняяОбработка = (ПроверяемыеСвойства.ИспользуемоеИмяФайла <> Неопределено);
	ОписаниеЯдра = Объект.ОбщийКонтекстКлиентСервер.ПодключенныеОбработки["КонтурДиадокЯдро"];
	ПодключатьМодулиИзМакетов = (ЭтоВнешняяОбработка Или ОписаниеЯдра.ИсточникБиблиотеки = "Макет");
	
	ВерсияОбработки = Модуль.ВерсияОбработки();
	ЭтоПервыйЗапуск = (СохраненныеНастройкиГлавнойФормы() = Неопределено);
	
	Ядро = Модуль_ЯдроНаСервере();
	СохраненнаяВерсияПриЗапуске = Ядро.ЗначениеНастройки_СохраненнаяВерсияМодуля();
	СтруктураДанныхСтрокиСпискаСтрокой = Ядро.КолонкиСпискаДокументовСтрокой();
	
	Параметры.Свойство("ИсточникОткрытия", ИсточникОткрытия);
	
	ЗаполнитьФормуИзСохраненныхНастроек();
	ЗаполнитьНастройкиПериодаПриЗапуске();
	// + ШХ
	Если ЭтотОбъект.шхРежимПодписания Тогда
		// Скорректируем режим формы
		Если ЗначениеЗаполнено(ЭтотОбъект.шхТекущиеДокументы) Тогда
			Если ТипЗнч(ЭтотОбъект.шхТекущиеДокументы[0]) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				РежимОтображенияПриЗапуске = РежимыОтображения().Входящие;
			ИначеЕсли  ТипЗнч(ЭтотОбъект.шхТекущиеДокументы[0]) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				РежимОтображенияПриЗапуске = РежимыОтображения().Исходящие;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// - ШХ	
	УстановитьВидимостьКнопок();
	НастроитьФорму();
	УстановитьЗаголовокФормы();
	УстановитьЗаголовокКнопкиАвторизацииПоУмолчанию();
	ИнициализироватьНастройкуИВидимостьКнопкиЛентыКонтрагентов();
	ИнициализироватьНастройку_НеПоказыватьОнбордингЛентыКонтрагентов();
	
	// + ШХ
 
	// Отключим неиспользуемый функционал
	Элементы.ГруппаСогласование.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьНастройкуИВидимостьКнопкиЛентыКонтрагентов()
	
	Ядро = Модуль_ЯдроНаСервере();
	УведомлятьОНовыхСобытиях = Ядро.ЗначениеНастройки_УведомлятьОНовыхСобытиях();
	Элементы.СобытияЛентыКонтрагентов.Видимость = УведомлятьОНовыхСобытиях;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьНастройку_НеПоказыватьОнбордингЛентыКонтрагентов()
	
	ОбработкаОбъект = ОбработкаОбъект();
	// BSLLS:UnusedLocalVariable-off
	// BSLLS:Typo-off
	ПоказыватьОнбордингЛентыКонтрагентов =
		НЕ ОбработкаОбъект.НастройкиПользователяПрочитать_НеПоказыватьОнбордингЛентыКонтрагентов();
	// BSLLS:Typo-on
	// BSLLS:UnusedLocalVariable-on
КонецПроцедуры

&НаСервере
Функция СохраненныеНастройкиГлавнойФормы()
	
	КлючОбъекта = ЭтаФорма.ИмяФормы + "/ТекущиеДанные";
	Результат = СохраненноеЗначениеВСистемномХранилище(КлючОбъекта);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ЭтоПрограммноеЗакрытиеФормы = Ложь;
	
	ВключитьДекорациюДлительнойОперации();
	
	ПоказатьИндикаторДлительнойОперации();
	ОбновитьНадписьДекорацииДлительнойОперации();
	
	ПодключитьОбработчикОжидания(
		"ПослеОткрытия",
		0.1,
		Истина
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия()
	
	ПроверитьУстановкуОграниченияТипаВОтборах();
	
	ДвоичныеДанныеФайлаОбработки = ДвоичныеДанныеМодуля();
	ДвоичныеДанныеКонфигурационногоФайла = ДвоичныеДанныеКонфигурационногоФайла();
	
	СисИнфо = Модуль_ЯдроНаКлиенте().СистемнаяИнформацияНаКлиенте();
	
	ВыполнитьДействияНаСервереПриОткрытииФормы(ДвоичныеДанныеФайлаОбработки,
		ДвоичныеДанныеКонфигурационногоФайла,
		СисИнфо);
	
	Отказ = Ложь;
	ДополнитьДанныеДляОбновленияМодуля();
	ОбновитьМодульАвтоматически(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗаголовокКнопкиПериода();
	
	ВыполнитьДействияНаСервереПослеОткрытияФормы();
	
	ОбработатьЭкстренныеУведомления();
	
КонецПроцедуры

&НаКлиенте
Функция ДвоичныеДанныеМодуля()
	
	#Если ВебКлиент Тогда
	Возврат Неопределено;
	#КонецЕсли
	
	Если НЕ ЕстьСистемаХранения Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеРасположенияМодуля = Объект.ОбщийКонтекстКлиентСервер.РасположениеМодуля;
	
	Если НЕ ЗначениеЗаполнено(ОписаниеРасположенияМодуля) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Перечисление_МестоположенияМодуля = Модуль_ЯдроНаКлиенте().Перечисление_МестоположенияМодуля();
	
	Если ОписаниеРасположенияМодуля.РасположениеМодуля = Перечисление_МестоположенияМодуля.ЭлементСправочника Тогда
		Результат = ОписаниеРасположенияМодуля.ИмяФайлаМодуля;
	ИначеЕсли ОписаниеРасположенияМодуля.РасположениеМодуля = Перечисление_МестоположенияМодуля.ФайлНаДиске Тогда
		Результат = Модуль_ЯдроНаКлиенте().ДвоичныеДанныеФайла(ОписаниеРасположенияМодуля.ИмяФайлаМодуля);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДвоичныеДанныеКонфигурационногоФайла()
	
	Результат = Неопределено;
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	ПутьКФайлу = Модуль_Ядро.КонфигурационныйФайл_Путь(ПараметрЗапуска);
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		
		Результат = Модуль_Ядро.ДвоичныеДанныеФайла(ПутьКФайлу);
		
		Если Результат = Неопределено Тогда
			Ошибка = Модуль_Ядро.Общее_ПодставитьПараметрыВСтроку("Конфигурационный файл не найден (%1)!", ПутьКФайлу);
			_ОбработатьОшибку("ЧтениеКонфигурационногоФайла", Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыполнитьДействияНаСервереПриОткрытииФормы(Знач ДвоичныеДанныеИлиАдрес,
		ДвоичныеДанныеКонфигурационногоФайла,
		Знач СисИнфо)
	
	Ядро = Модуль_ЯдроНаСервере();

	Если ДвоичныеДанныеКонфигурационногоФайла <> Неопределено Тогда
		Ядро.КонфигурационныйФайл_ЗагрузитьПараметры(ДвоичныеДанныеКонфигурационногоФайла);
	КонецЕсли;
	
	ПодготовитьДанныеДляОбновленияМодуля();
	
	Ядро.ОбновлениеМодуля_ПроверитьУстановитьПризнакМодульДоработан(
		ДвоичныеДанныеИлиАдрес,
		ДанныеДляОбновленияМодуля.ОписаниеРасположенияМодуля.Местоположение);
	
	Ядро.Метрика_ДобавитьСтатистику_СистемнаяИнформация();
	
	Ядро.ОбщийКонтекст_Поместить("СисИнфоНаКлиенте", СисИнфо);
	
	Если ЗначениеЗаполнено(ИсточникОткрытия) Тогда
		СформироватьМетрикуДействияПереходаВМодульИзДокумента1С();
	КонецЕсли;
	
	Возврат ОбщийКонтекстОбработки();
	
КонецФункции

&НаСервере
Процедура ВыполнитьДействияНаСервереПослеОткрытияФормы()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(Метрика_НазваниеФормы(), "Инициализация модуля");
	
	Ядро.ПродуктоваяАналитика_УстановитьОбновитьМодульБезопасно();
	
	Если ЭтоПервыйЗапуск Тогда
		Ядро.МетрикиКонтур_ЗаписатьСобытие_Запуск();
	КонецЕсли;
	
	ЕстьУведомления = ПроверитьНаличиеУведомленийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуИзСохраненныхНастроек()
	
	КлючОбъекта = ОбработкаОбъект().Метаданные().ПолноеИмя() + ".Форма.ФормаУправляемая/ТекущиеДанные";
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	ИспользоватьВнутреннийДокументооборот = Модуль_Ядро.ЗначениеНастройки_ИспользоватьВнутреннийДокументооборот();
	
	СохраненныеНастройки = СохраненноеЗначениеВСистемномХранилище(КлючОбъекта);
	
	Если ЗначениеЗаполнено(СохраненныеНастройки) Тогда
		
		СтруктураНастроек = Новый Структура;
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Соответствие") Тогда
			
			РежимОтображенияПриЗапуске	= СохраненныеНастройки.Получить("РежимОтображенияПриЗапуске");
			НастройкаВыбораПериода		= СохраненныеНастройки.Получить("НастройкаВыбораПериода");
			РазмерСтраницы				= СохраненныеНастройки.Получить("РазмерСтраницы");
			НомерСтраницы				= СохраненныеНастройки.Получить("НомерСтраницы");
			ПоказыватьЗавершенные		= СохраненныеНастройки.Получить("ПоказыватьЗавершенные");
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимОтображенияПриЗапуске) Тогда
		РежимОтображенияПриЗапуске = РежимыОтображения().ДляОтправки;
	КонецЕсли;
	
	Если НЕ ИспользоватьВнутреннийДокументооборот 
		И РежимОтображенияПриЗапуске = РежимыОтображения().Внутренние Тогда
		РежимОтображенияПриЗапуске = РежимыОтображения().ДляОтправки;
		РежимОтображенияДокументов = РежимОтображенияПриЗапуске;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РазмерСтраницы) Тогда
		РазмерСтраницы = 500;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерСтраницы) Тогда
		НомерСтраницы = 1;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СохраненноеЗначениеВСистемномХранилище(КлючОбъекта, КлючНастроек = Неопределено, ИмяПользователя = Неопределено)

	Результат = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастроек, , ИмяПользователя);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкиПериодаПриЗапуске()
	
	НастройкаВыбораПериода = НовыйНастройкаВыбораПериода();
	
	СохраненныеНастройки = ОбработкаОбъект().ПользовательскиеНастройкиПериодаПрочитать();
	
	НастройкаВыбораПериода.РежимОтбораПоПериоду = СохраненныеНастройки.РежимОтбораПоПериоду;
	
	Интервал = Новый СтандартныйПериод(СохраненныеНастройки.ВариантВыбораПериода);
	
	НастройкаВыбораПериода.ДатаНачала = Интервал.ДатаНачала;
	НастройкаВыбораПериода.ДатаОкончания = Интервал.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Функция НовыйНастройкаВыбораПериода()
	
	Результат = Новый Структура;
	Результат.Вставить("РежимОтбораПоПериоду", Неопределено);
	Результат.Вставить("ДатаНачала", Неопределено);
	Результат.Вставить("ДатаОкончания", Неопределено);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьОбщийКонтекстКлиентСерверНаСервере()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	ОбработкаОбъект.ИнициализироватьОбщийКонтекст(УникальныйИдентификатор);
	
	Объект.ОбщийКонтекстКлиентСервер = ОбработкаОбъект.ОбщийКонтекстКлиентСервер;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	МодульЯдро = Модуль_ЯдроНаСервере();
	
	ТипПоляОрганизации = МодульЯдро.Справочники_ТипЗначенияОбъекта("Организации");
	ТипПоляКонтрагенты = МодульЯдро.Справочники_ТипЗначенияОбъекта("Контрагенты");
	
	ИмяСправочника = СтрЗаменить(ТипПоляОрганизации, "СправочникСсылка.", "");
	Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено Тогда
		Элементы.ОтборПоОрганизации.ОграничениеТипа = Новый ОписаниеТипов(ТипПоляОрганизации);
	КонецЕсли;
	
	ИмяСправочника = СтрЗаменить(ТипПоляКонтрагенты, "СправочникСсылка.", "");
	Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено Тогда
		Элементы.ОтборПоКонтрагенту.ОграничениеТипа = Новый ОписаниеТипов(ТипПоляКонтрагенты);
	КонецЕсли;
	
	ОтборПоОрганизации = МодульЯдро.Справочники_ПустаяСсылкаСправочника("Организации");
	ОтборПоКонтрагенту = МодульЯдро.Справочники_ПустаяСсылкаСправочника("Контрагенты");
	
	ИнтерфейсныеПравкиДляПлатформы835();
	УстановитьСвойстваФормыТакси();
	
	ПрочитатьНастройкуИспользоватьСопоставлениеПодразделений();
	
	УстановитьУсловноеОформлениеСпискаДокументов();
	ИнициализироватьНастройкиТематическогоПоздравления();
	
	Попытка
		МодульЯдро.ПодключаемыйМодуль_ОбработатьСобытие("УстановитьУсловноеОформление", Новый Структура("Форма", ЭтаФорма));
	Исключение
		Сообщить("Не удалось применить для формы условное оформление из ПМ!", СтатусСообщения.Важное);
	КонецПопытки;
	
	ЗначенияФО = ЗначенияФункциональныхОпций();
	Элементы.НастройкиПодписание.Видимость = ЗначенияФО.НастройкиГосключ;
	
КонецПроцедуры

&НаСервере
Функция ЗначенияФункциональныхОпций()
	
	Модель = Новый Структура;
	Модель.Вставить("НастройкиГосключ", Ложь);
	
	ЗначенияОпций = Объект.ОбщийКонтекстКлиентСервер.ФункциональныеОпции;
	
	ТипБулево = Тип("Булево");
	
	Значение = ЗначенияОпций.Получить("Sign.GosKeySign");
	Если ЗначениеЗаполнено(Значение) Тогда
		Модель.НастройкиГосключ = XMLЗначение(ТипБулево, Значение);
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьНастройкиТематическогоПоздравления() // ШХ
	// + шх - Отключаем рекламные проспекты
	Возврат;
	
	ЗначенияФО = Объект.ОбщийКонтекстКлиентСервер.ФункциональныеОпции;
	ЛендингНовыйГод = ЗначенияФО.Получить("happy_new_year_link");
	Если Не ЗначениеЗаполнено(ЛендингНовыйГод)
		Или ЛендингНовыйГод = "null" Тогда
		Возврат;
	КонецЕсли;
	
	Модуль = ОбработкаОбъект();
	ВсеКартинки = Модуль.БиблиотекаКартинок();
	
	АдресТематическойКартинки = ПоместитьВоВременноеХранилище(ВсеКартинки.КартинкаПодарочек, УникальныйИдентификатор);
	
	Элементы.ТематическаяКартинка.Подсказка = НСтр("ru='Нажми на подарок'");
	Элементы.ТематическаяКартинка.Видимость = Истина;
	Элементы.ТематическаяКартинка.Доступность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтатусПоддержкиКонфигурации_КонфигурацияПоддерживается()
	
	Возврат "Поддерживается";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусПоддержкиКонфигурации_КонфигурацияНеПоддерживается()
	
	Возврат "НеПоддерживается";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусПоддержкиКонфигурации_КонфигурацияУстарела()
	
	Возврат "Устарела";
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеНаСервере()
	
	УстановитьУсловноеОформлениеДляТарифа();
	УстановитьУсловноеОформлениеДляТиповДокументов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДляТарифа()
	
	УстановитьДоступностьФункцийТарифа();
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДляТиповДокументов()
	
	УдалитьУсловноеОформлениеДляТиповДокументов();
	ДобавитьУсловноеОформлениеДляТиповДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеДляТиповДокументов()

	ОбработанныеТипыДокументовAPI = Новый Массив;
	
	ТипыДокументовAPI = Модуль_ЯдроНаСервере().ПредопределенныеСписки_ТипыДокументовAPI();
			
	Для Каждого ТипДокументаAPI Из ТипыДокументовAPI Цикл
		
		TypeNamedId = ТипДокументаAPI.TypeNamedId;
		
		Если ЗначениеЗаполнено(TypeNamedId)
			И ОбработанныеТипыДокументовAPI.Найти(TypeNamedId) = Неопределено Тогда
			
			ЭлементОформления = УсловноеОформление.Элементы.Добавить();
			
			ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовТипДокумента");
			
			ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
			ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение 	= TypeNamedId;
			
			Если TypeNamedId = "Nonformalized" Тогда
				ТекстДляОформления = "";
			Иначе
				ТекстДляОформления = ТипДокументаAPI.Title;
			КонецЕсли;
			
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", ТекстДляОформления);
			
			ОбработанныеТипыДокументовAPI.Добавить(TypeNamedId);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УдалитьУсловноеОформлениеДляТиповДокументов()
	
	ЭлементыДляУдаления	= Новый Массив;
	ПолеТипаДокумента	= Новый ПолеКомпоновкиДанных("СписокДокументовТипДокумента");
	
	Для Каждого ЭлементОформления Из УсловноеОформление.Элементы Цикл
		
		Для Каждого ПолеЭлементаОформления Из ЭлементОформления.Поля.Элементы Цикл
			
			Если ПолеЭлементаОформления.Поле = ПолеТипаДокумента Тогда
				
				ЭлементыДляУдаления.Добавить(ЭлементОформления);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ЭлементОформления Из ЭлементыДляУдаления Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементОформления);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеОткрытияФормы()
	
	Если НЕ ЕстьСистемаХранения Тогда
		
		ПараметрыФормы = Неопределено;
		
		ОписаниеОповещения = НовыйОписаниеОповещения("ПослеОткрытияФорм", ЭтаФорма);
		ОткрытьФормуДиадокМодально("НастройкаХраненияДанныхУправляемая", ЭтаФорма, ПараметрыФормы, ОписаниеОповещения);
		
		Возврат;
	
	КонецЕсли;
	
	Платформа = Модуль_Платформа();
	Платформа.УстановитьНовуюВерсиюМодуля();
	
	// + ШХ // Отключено оповещение
	
	//МодульБылОбновлен = ДанныеДляОбновленияМодуля.МодульБылОбновлен;
	//Если МодульБылОбновлен Тогда
	//	УведомитьПользователяОбУспешномАвтообновлении();
	//	Возврат;
	//КонецЕсли;
	// - ШХ
	
	ПроверитьСоединениеССерверомДиадок();
	
КонецПроцедуры

&НаКлиенте
Процедура УведомитьПользователяОбУспешномАвтообновлении()
	
	ПараметрыФормы = Неопределено;
	
	мОткрытьФорму("УведомлениеОбУспешномАвтообновленииУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУведомленияПользователяОбУспешномАвтообновлении(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПроверитьСоединениеССерверомДиадок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеССерверомДиадок()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СоединениеУстановлено = Ядро.АПИ_ПроверитьСоединениеDiadocAPI();
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПроверитьСоединениеССерверомДиадокЗавершение", ЭтаФорма);
	
	Если СоединениеУстановлено Тогда
		
		ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, СоединениеУстановлено);
		
	Иначе
		
		ОткрытьФормуДиадокМодально("ОшибкаСоединенияССерверомДиадокУправляемая", ЭтаФорма, , ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеССерверомДиадокЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНадписьДекорацииДлительнойОперации();
	
	ПриНачалеСеанса = НовыйОписаниеОповещения(
		"ПослеЗакрытияФормыАвторизации",
		ЭтаФорма
	);
	
	// нужно заново инициализировать платформу, чтобы применить
	// настройки из конфигурационного файла
	_МодульПлатформа = Неопределено;
	
	Платформа = Модуль_Платформа();
	Платформа.Сеанс_Начать(ПриНачалеСеанса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытияФорм(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ЗакрытьГлавнуюФорму();
	
КонецПроцедуры

&НаСервере
Процедура ИнтерфейсныеПравкиДляПлатформы835()
	
	СистемнаяИнформация	= Новый СистемнаяИнформация;
	ВерсияПлатформы		= СистемнаяИнформация.ВерсияПриложения;
	
	ВерсияПлатформыМассивом = ОбработкаОбъект().РазделитьСтрокуЛок(СистемнаяИнформация.ВерсияПриложения, ".");
	
	ВтораяЦифраВерсии	= Число(ВерсияПлатформыМассивом[1]);
	ТретьяЦифраВерсии	= Число(ВерсияПлатформыМассивом[2]);
	
	Если ((ВтораяЦифраВерсии = 3 И ТретьяЦифраВерсии >= 4) Или ВтораяЦифраВерсии > 3) Тогда
		
		Пользователь	= ПользователиИнформационнойБазы.ТекущийПользователь();
		Настройка		= СохраненноеЗначениеВСистемномХранилище("Общее/НастройкиКлиентскогоПриложения", , Пользователь.Имя); 
		
		Если Не ТипЗнч(Настройка) = Тип("НастройкиКлиентскогоПриложения") Тогда
			Настройка = Новый НастройкиКлиентскогоПриложения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваФормыТакси()
	
	Ядро = Модуль_ЯдроНаСервере();

	СвойствоГоризонтальноеПоложениеВГруппе = Новый Структура("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Право);
	ЗаполнитьЗначенияСвойств(Элементы.ГруппаАвторизацииИНастроек, СвойствоГоризонтальноеПоложениеВГруппе);
	ЗаполнитьЗначенияСвойств(Элементы.ГруппаРазмераСтраницы, СвойствоГоризонтальноеПоложениеВГруппе);
	
	СвойстваКнопкаСпискаВыбора = Новый Структура("КнопкаСпискаВыбора, КнопкаВыпадающегоСписка", Истина, Истина);
	ЗаполнитьЗначенияСвойств(Элементы.РазмерСтраницы, СвойстваКнопкаСпискаВыбора);
	
	СвойствоАвтоМаксимальнаяШирина = Новый Структура("АвтоМаксимальнаяШирина", Ложь);
	ЗаполнитьЗначенияСвойств(Элементы.ДекорацияНавигации, СвойствоАвтоМаксимальнаяШирина);
	ЗаполнитьЗначенияСвойств(Элементы.НадписьОкончанияОплаченногоПериода, СвойствоАвтоМаксимальнаяШирина);
	
	
	ГоризонтальноеПоложениеЦентр = Новый Структура("ГоризонтальноеПоложениеПодчиненных", ГоризонтальноеПоложениеЭлемента.Центр);
	ЗаполнитьЗначенияСвойств(Элементы.ГруппаОкончанияОплаченногоПериода, ГоризонтальноеПоложениеЦентр);
	ЗаполнитьЗначенияСвойств(Элементы.ГруппаОценкаРаботыМодуля, ГоризонтальноеПоложениеЦентр);
	
	Если НЕ Ядро.ПриложениеСтаршеВерсии("8.3.5")Тогда
		СвойствоЦветФонаНадписиСпискаОнлайнСчетов = Новый Структура("ЦветФона", Новый Цвет(255, 237, 166));
		ЗаполнитьЗначенияСвойств(Элементы.ГруппаОценкаРаботыМодуля, СвойствоЦветФонаНадписиСпискаОнлайнСчетов);
		ЗаполнитьЗначенияСвойств(Элементы.ГруппаОкончанияОплаченногоПериода, СвойствоЦветФонаНадписиСпискаОнлайнСчетов);
	КонецЕсли;

	СвойствоПодсказкаВвода = Новый Структура("ПодсказкаВвода");
	
	СвойствоПодсказкаВвода.ПодсказкаВвода = "Организация";
	ЗаполнитьЗначенияСвойств(Элементы.ОтборПоОрганизации, СвойствоПодсказкаВвода);
	
	Если НЕ Ядро.ПриложениеСтаршеВерсии("8.3.3") Тогда
		
		СвойствоОтображениеКнопкиВыбора = Новый Структура("ОтображениеКнопкиВыбора", Вычислить("ОтображениеКнопкиВыбора.ОтображатьВПолеВвода"));
		ЗаполнитьЗначенияСвойств(Элементы.ОтборПоОрганизации, СвойствоОтображениеКнопкиВыбора);
		
	КонецЕсли;
	
	СвойствоПодсказкаВвода.ПодсказкаВвода = "Контрагент";
	ЗаполнитьЗначенияСвойств(Элементы.ОтборПоКонтрагенту, СвойствоПодсказкаВвода);
	
	СвойствоПодсказкаВвода.ПодсказкаВвода = "Статус";
	ЗаполнитьЗначенияСвойств(Элементы.ОтборПоСтатусу, СвойствоПодсказкаВвода);
	
	СвойствоПодсказкаВвода.ПодсказкаВвода = "Вид пакета";
	ЗаполнитьЗначенияСвойств(Элементы.ОтборПоВидуПакета, СвойствоПодсказкаВвода);
	
	СвойствоПодсказкаВвода.ПодсказкаВвода = Неопределено;
	
	ЗаполнитьЗначенияСвойств(СвойствоПодсказкаВвода, Элементы.ОтборПоОрганизации);
	
	Если ЗначениеЗаполнено(СвойствоПодсказкаВвода.ПодсказкаВвода) Тогда
		
		Элементы.ВключитьОтборПоОрганизации.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ВключитьОтборПоКонтрагенту.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ВключитьОтборПоСтатусу.ПоложениеЗаголовка		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ВключитьОтборПоВидуПакета.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		
	КонецЕсли;
	
	Если Не Ядро.ПриложениеСтаршеВерсии("8.3.7") Тогда
		
		РедактируемыеСвойстваЭлемента = Новый Структура;
		РедактируемыеСвойстваЭлемента.Вставить("Объединенная", Ложь);
		
		ЗаполнитьЗначенияСвойств(Элементы.ДекоративныеОбертки, РедактируемыеСвойстваЭлемента);
		
		ГруппаРазделовВертикальноеПоложениеПодчиненных = Новый Структура("ВертикальноеПоложениеПодчиненных", ВертикальноеПоложениеЭлемента.Центр);
		ЗаполнитьЗначенияСвойств(Элементы.ГруппаРазделов, ГруппаРазделовВертикальноеПоложениеПодчиненных);
		
	КонецЕсли;
	
	ГоризонтальноеПоложениеВГруппе = Новый Структура("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Центр);
	ЗаполнитьЗначенияСвойств(Элементы.ГруппаКружок, ГоризонтальноеПоложениеВГруппе);
	ЗаполнитьЗначенияСвойств(Элементы.ГруппаПредупреждение, ГоризонтальноеПоложениеВГруппе);
	
	Если НЕ Ядро.ПриложениеСтаршеВерсии("8.3.5") Тогда
		
		ИмяСвойства = "ПоложениеСостоянияПросмотра";
		ЗначениеСвойства = Вычислить("ПоложениеСостоянияПросмотра.Верх");
		
		СвойствоПоложениеСостоянияПросмотра = Новый Структура(ИмяСвойства, ЗначениеСвойства);
		ЗаполнитьЗначенияСвойств(Элементы.СписокДокументов, СвойствоПоложениеСостоянияПросмотра);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопок()
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	ИспользоватьВнутреннийДокументооборот = Модуль_Ядро.ЗначениеНастройки_ИспользоватьВнутреннийДокументооборот();
	Элементы.ВыбратьРежимВнутренние.Видимость = ИспользоватьВнутреннийДокументооборот;
	Элементы.ВыполнитьОбмен.Видимость = ИспользуетсяПодсистемаДиадок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения = "", СтандартнаяОбработка = Истина)
	
	Если ЗавершениеРаботы = Истина Или _ЭтоПрограммноеЗакрытиеФормы Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ЗакрытьГлавнуюФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботыПрограммы = Ложь)
	
	Если ЗавершениеРаботыПрограммы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Платформа = Модуль_Платформа();
	Платформа.ПриЗавершенииРаботыМодуля(ДлительнаяОперацияПродуктоваяАналитика);
	
	ОчиститьКэшНаКлиенте();
	
	// + ШХ
	// т1к О.Н.Кошелев, 2023-11-09{Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb
	#Если ТонкийКлиент Тогда
	Если Не шхТекущиеДокументы = Неопределено И шхТекущиеДокументы.Количество() > 0 Тогда
		ПараметрыПриложения["т1кФормаДиадок"] = Неопределено;
	КонецЕсли;
	#КонецЕсли
	// }т1к О.Н.Кошелев, 2023-11-09
	// - ШХ
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИсточникОповещения = ИдентификаторОсновнойФормы();
	
	Если Не ЭтаФорма.Открыта()
		ИЛИ ИсточникОповещения <> Источник Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ИмяСобытия = "Диадок_ОбновитьГлавныйСписок" Тогда
		
		НовыйРежимОтображенияДокументов = Неопределено;
		
		УстановитьЗаголовокФормы();
		
		ОбновитьСписок(
			НовыйРежимОтображенияДокументов,
			Параметр
		);
		
	ИначеЕсли ИмяСобытия = "Диадок_УстановитьПакетВСтрокуГлавногоСписка" Тогда
		
		Если Элементы.СписокДокументов.ТекущиеДанные.Ключ = Параметр.КлючСтроки Тогда
			Элементы.СписокДокументов.ТекущиеДанные.Пакет = Параметр.Пакет;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//{Тариф

&НаСервере
Процедура УстановитьДоступностьФункцийТарифа()
	
	ОтключитьВключитьВыполнитьПередатьНаСогласование();
	ОтключитьВключитьВыполнитьПередатьПоМаршруту();
	ОтключитьВключитьВыделениеДокументов();
	ОтключитьВключитьГруппаАнализИОбработка();
	ОтключитьВключитьВыполнитьРасшифроватьДокументы();
	ОтключитьВключитьСписокДокументовФлажок();
	ОтключитьВключитьВыполнитьЗагрузкуНовогоПакета();
	ОтключитьВключитьДекорацииТариф();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыполнитьПередатьНаСогласование()
	
	Элементы.ВыполнитьПередатьНаСогласование.Видимость = НЕ ЕстьОграниченияПоТарифу;
	Элементы.ВыполнитьПередатьНаСогласованиеЗаглушка.Видимость = ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыполнитьПередатьПоМаршруту()
	
	Элементы.ВыполнитьПередатьПоМаршруту.Видимость = НЕ ЕстьОграниченияПоТарифу;
	Элементы.ВыполнитьПередатьПоМаршрутуЗаглушка.Видимость = ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыделениеДокументов()
	
	Элементы.ВыделениеДокументов.Доступность = НЕ ЕстьОграниченияПоТарифу;
	
	НастроитьПодсказкуВыделениеДокументов();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПодсказкуВыделениеДокументов()
	
	КомандаВыделение = Команды.Найти("ВыделениеДокументов");
	
	Если ЕстьОграниченияПоТарифу Тогда
		КомандаВыделение.Подсказка = "Массовая обработка документов доступна только на тарифе ""Универсальный""";
	Иначе
		КомандаВыделение.Подсказка = "Выделение документов на странице";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыполнитьЗагрузкуНовогоПакета()
	
	Элементы.ВыполнитьЗагрузкуНовогоПакета.Видимость = НЕ ЕстьОграниченияПоТарифу;
	Элементы.ВыполнитьЗагрузкуНовогоПакетаЗаглушка.Видимость = ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьГруппаАнализИОбработка()
	
	Элементы.ГруппаАнализИОбработка.Доступность = НЕ ЕстьОграниченияПоТарифу;
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.ГруппаАнализИОбработка.Подсказка = "Анализ и обработка входящих документов доступны только на тарифе ""Универсальный"".";
	Иначе
		Элементы.ГруппаАнализИОбработка.Подсказка = "Анализ и обработка входящих документов";
	КонецЕсли;
	
	ОтключитьВключитьВыполнитьАнализВыбранныхПакетов();
	ОтключитьВключитьВыполнитьОтправитьГотовыеОтветы();
	ОтключитьВключитьВыполнитьВыполнитьТребуемоеДействие();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыполнитьАнализВыбранныхПакетов()
	
	Элементы.ВыполнитьАнализВыбранныхПакетов.Видимость = НЕ ЕстьОграниченияПоТарифу;
	Элементы.ВыполнитьАнализВыбранныхПакетовЗаглушка.Видимость = ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыполнитьОтправитьГотовыеОтветы()
	
	Элементы.ВыполнитьОтправитьГотовыеОтветы.Видимость = НЕ ЕстьОграниченияПоТарифу;
	Элементы.ВыполнитьОтправитьГотовыеОтветыЗаглушка.Видимость = ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыполнитьВыполнитьТребуемоеДействие()
	
	Элементы.ВыполнитьВыполнитьТребуемоеДействие.Видимость = НЕ ЕстьОграниченияПоТарифу;
	Элементы.ВыполнитьВыполнитьТребуемоеДействиеЗаглушка.Видимость = ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьВыполнитьРасшифроватьДокументы()
	
	РежимыОтображения = РежимыОтображения();
	РежимВходящие = (РежимОтображенияДокументов = РежимыОтображения.Входящие);
	
	Элементы.ВыполнитьРасшифроватьДокументы.Видимость = РежимВходящие 
		И ИспользуетсяПодсистемаДиадок И НЕ ЕстьОграниченияПоТарифу;
	Элементы.ВыполнитьРасшифроватьДокументыЗаглушка.Видимость = РежимВходящие 
		И ИспользуетсяПодсистемаДиадок И ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьСписокДокументовФлажок()
	
	Элементы.СписокДокументовФлажок.Доступность = НЕ ЕстьОграниченияПоТарифу;
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.СписокДокументовФлажок.Подсказка = "Функциональность доступна только на тарифе ""Универсальный"".";
	Иначе
		Элементы.СписокДокументовФлажок.Подсказка = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьДекорацииТариф()
	
	Элементы.ГруппаФункциональностьТарифаЗаглушка.Видимость = ЕстьОграниченияПоТарифу;
	Элементы.ДекорацияНавигации.Видимость = НЕ ЕстьОграниченияПоТарифу;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТарифаМиниНажатие(Элемент)
	
	Метрика_ПоказатьПредупреждениеОТарифе();
	
	Модуль_Платформа = Модуль_Платформа();
	
	НаименованиеФормы = Метрика_НазваниеФормы();
	
	Модуль_Платформа.ПоказатьПредупреждениеОТарифе(НаименованиеФормы);
	
КонецПроцедуры

//}Тариф

&НаКлиенте
Процедура ПроверитьНеобходимостьПереходаСПлагинаСчетВПакете()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ТребуетсяВыполнитьПереходСПлагина = Ядро.КонтурПлагины_СчетВПакете_ТребуетсяВыполнитьПереходСПлагина();
	
	Если ТребуетсяВыполнитьПереходСПлагина Тогда
		ПредложитьПользователюПерейтиСПлагинаСчетВПакете();
	Иначе
		ОбработчикПослеАвторизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьПользователюПерейтиСПлагинаСчетВПакете()
	
	ЗаголовокСообщения = НСтр("ru = 'Плагин ""Первичные документы и счет на оплату""'");
	
	ТекстСообщения = НСтр("ru = 'Плагин ""Первичные документы и счет на оплату"" больше не поддерживается. '") +
	НСтр("ru = 'Объединение счета реализовано в самом модуле.
	|Воспользуйтесь кнопкой ""Продолжить"" для перехода с плагина на коробочное решение.
	|
	|Если в плагине использовались отборы по контрагентам, выполните индивидуальную настройку счетов. '") +
	НСтр("ru = 'Подробнее смотрите по кнопке ""Инструкция"".'");
	
	КнопкаПоУмолчанию = КодВозвратаДиалога.ОК;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КнопкаПоУмолчанию, "Продолжить");
	СписокКнопок.Добавить(КодВозвратаДиалога.Пропустить, "Инструкция");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Закрыть");
	
	ОповещениеОЗавершении = НовыйОписаниеОповещения("ПослеЗакрытияПредложенияПерейтиСПлагинаСчетВПакете", ЭтаФорма);
	
	ПоказатьВопросПереопределенная(ОповещениеОЗавершении, ТекстСообщения, СписокКнопок, , КнопкаПоУмолчанию, ЗаголовокСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредложенияПерейтиСПлагинаСчетВПакете(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	КатегорияМетрики = "КонвертацияНастроекПлагинаСчетВПакете";
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		ДействиеМетрики = "Продолжить";
		Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
		
		КонвертацияВыполнена = Ядро.КонтурПлагины_СчетВПакете_ВыполнитьПереходСПлагина();
		
		Если КонвертацияВыполнена Тогда
			Сообщить(НСтр("ru = 'Настройки плагина успешно перенесены.'"));
		КонецЕсли;
		
	Иначе
		
		Если Результат = КодВозвратаДиалога.Пропустить Тогда
			
			ДействиеМетрики = "Инструкция";
			ЗапуститьПриложение("https://support.kontur.ru/diadoc-1s8x/41609-plagin_pervichnye_dokumenty_i_schet_na_oplatu#header_43830_1");
			
		Иначе
			ДействиеМетрики = "Закрыть";
		КонецЕсли;
		
		Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
		Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
		
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Пропустить Тогда
		ПредложитьПользователюПерейтиСПлагинаСчетВПакете();
	Иначе
		ОбработчикПослеАвторизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУстановкуОграниченияТипаВОтборах()
	
	ИменаОтсутствующихСправочников = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Элементы.ОтборПоОрганизации.ОграничениеТипа) Тогда
		ИменаОтсутствующихСправочников.Добавить("Организации");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Элементы.ОтборПоКонтрагенту.ОграничениеТипа) Тогда
		ИменаОтсутствующихСправочников.Добавить("Контрагенты");
	КонецЕсли;
	
	Если ИменаОтсутствующихСправочников.Количество() > 0 Тогда 
		
		// Типовой справочник в конфигурации не был найден - требуется переопределение имени справочника в ПМ.
		
		ШаблонСообщения = НСтр("ru = 'В текущей конфигурации отсутствует справочник ""%1"". Необходимо переопределить имя данного справочника в событии ПМ ""ОпределитьТипЗначенияОбъекта""'");
		
		Для Каждого ИмяСправочника Из ИменаОтсутствующихСправочников Цикл
			
			ТекстСообщения = Модуль_ЯдроНаКлиенте().Общее_ПодставитьПараметрыВСтроку(ШаблонСообщения, ИмяСправочника);
			ВывестиСообщениеПользователю(ТекстСообщения);
									
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

// }	ОСНОВНЫЕ СОБЫТИЯ ФОРМЫ

// {	ОБРАБОТЧИКИ ПОСЛЕ АВТОРИЗАЦИИ

&НаКлиенте
Процедура ПослеВыбораИнтеграционногоМодуля(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗакрытьГлавнуюФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеАвторизации() Экспорт
	
	ОбновитьНадписьДекорацииДлительнойОперации();
	
	Платформа = Модуль_Платформа();
	Платформа.ПроверитьОбновитьТипыДокументов(СохраненнаяВерсияПриЗапуске);
	
	ПодключитьОбработчикОжидания("ОжиданиеОбновленияСписка", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеОбновленияСписка() Экспорт
	
	ОбновитьНадписьДекорацииДлительнойОперации();
	
	НовыйРежимОтображенияДокументов = Неопределено;
	ОтборПоПакету = Неопределено;
	КоличествоДокументов = 0;

	// + ШХ
	// Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb
	Если Не ЭтотОбъект.шхРежимОткрытияERP = "" Тогда
		Если ЗначениеЗаполнено(шхТекущиеДокументы) Тогда
			// Скорректируем отборы
			Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
				ОтборПоКонтрагенту = Неопределено;
				ВключитьОтборПоКонтрагенту = Ложь;
			КонецЕсли;
			ДанныеПоТекущемуДокументу = шхДанныеПоТекущемуДокументу(шхТекущиеДокументы);
			Если Не ДанныеПоТекущемуДокументу = Неопределено Тогда
				Для Каждого ДанныеТекДокумент Из ДанныеПоТекущемуДокументу Цикл
					Если НастройкаВыбораПериода.ДатаНачала > НачалоДня(ДанныеТекДокумент.ДатаДокумента) Тогда 
						НастройкаВыбораПериода.ДатаНачала = НачалоДня(ДанныеТекДокумент.ДатаДокумента);
					КонецЕсли;
					Если НастройкаВыбораПериода.ДатаОкончания < КонецДня(ДанныеТекДокумент.ДатаДокумента) Тогда
						НастройкаВыбораПериода.ДатаОкончания = КонецДня(ДанныеТекДокумент.ДатаДокумента);
					КонецЕсли;
				КонецЦикла;
				НастройкаВыбораПериода.РежимОтбораПоПериоду = "ПоДатеДокумента";
			КонецЕсли;
			
			НовыйРежимОтображенияДокументов = РежимыОтображения().Входящие;
		КонецЕсли;
	КонецЕсли;
	// - ШХ
	
	ОбновитьСписок(
		НовыйРежимОтображенияДокументов,
		ОтборПоПакету,
		КоличествоДокументов
	);
	
	// + ШХ
	// Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb
	Если Не ЭтотОбъект.шхРежимОткрытияERP = "" Тогда
		Если ЗначениеЗаполнено(шхТекущиеДокументы) Тогда
			// Установим флаг в строках, соответствующих выбранным документам
			ПерваяСтрока = Неопределено;
			Для Каждого ОтмеченныйДокумент Из шхТекущиеДокументы Цикл
				НайденныеСтроки = СписокДокументов.НайтиСтроки(Новый Структура("Документ", ОтмеченныйДокумент));
				Для Каждого СтрокаСДокументом Из НайденныеСтроки Цикл
					СтрокаСДокументом.Флажок = Истина;
					Если ПерваяСтрока = Неопределено Тогда
						ПерваяСтрока = СтрокаСДокументом;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Если Не ПерваяСтрока = Неопределено Тогда
				Элементы.СписокДокументов.ТекущаяСтрока = ПерваяСтрока.ПолучитьИдентификатор(); // Только позиционируемся
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	// - ШХ
	
	ДополнительныеПеременные = Новый Соответствие;
	ДополнительныеПеременные.Вставить("КоличествоДокументов", КоличествоДокументов);
	
	ПодключитьОбработчикОжидания("ОжиданиеУстановкиУсловногоОформления", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеУстановкиУсловногоОформления() Экспорт
	
	ОбновитьНадписьДекорацииДлительнойОперации();
	
	УстановитьУсловноеОформлениеНаСервере();
	УстановитьЗаголовокКнопкиПериода();
	УстановитьПредставлениеТекущегоПользователяДиадок(ЭтаФорма);
	
	ПоказатьКнопкуСкачатьОбновление();
	НастроитьВидимостьКнопкиНастроекДоверенности();
	
	ПодключитьОбработчикОжидания("ОжиданиеОплатыСервисаИОшибокМЧД", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеОплатыСервисаИОшибокМЧД()
	
	ОбновитьНадписьДекорацииДлительнойОперации();
	
	НачатьПроверкуОшибокКЭП();
	
	НачатьПроверкуОшибкокМЧДПоУмолчанию();
	
	ОтключитьДекорациюДлительнойОперацииОтложенно();
	
	ПродуктоваяАналитика_ЗапуститьПодготовкуДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктоваяАналитика_ЗапуститьПодготовкуДанных()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ДлительнаяОперацияПродуктоваяАналитика = Ядро.ПродуктоваяАналитика_ПодготовитьДанные(УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СинонимКонфигурации()
	Возврат Метаданные.Синоним;
КонецФункции

&НаКлиенте
Процедура ПоказатьФормуВыбораИнтеграционногоМодуляКонфигурацияНеПоддерживается()

	ОповещениеОЗакрытииФормы = НовыйОписаниеОповещения("ПослеВыбораИнтеграционногоМодуля", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Сценарий", "НеподдерживаемаяКонфигурация");
	
	ОткрытьФормуДиадокМодально(
		"ФормаВыбораИМУправляемая",
		ЭтаФорма,
		ДополнительныеПараметры,
		ОповещениеОЗакрытииФормы,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуВыбораИнтеграционногоМодуляКонфигурацияУстарела()
	
	ОповещениеОЗакрытииФормы = НовыйОписаниеОповещения("ПослеВыбораИнтеграционногоМодуля", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Сценарий", "УстаревшаяКонфигурация");
	
	ОткрытьФормуДиадокМодально(
		"ФормаВыбораИМУправляемая",
		ЭтаФорма,
		ДополнительныеПараметры,
		ОповещениеОЗакрытииФормы,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКнопкуСкачатьОбновление()
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	РежимТестирования = Модуль_Ядро.РежимАвтотест();
	ЭтоСборкаДляПровайдераСервиса = Модуль_Ядро.ЭтоСборкаДляПровайдераСервиса();
	
	ВидимостьКнопки = (ЕстьНоваяВерсияМодуля ИЛИ РежимТестирования) И НЕ ЭтоСборкаДляПровайдераСервиса;
	
	ГруппаТехподдержка = Элементы.ГруппаНастройкиИТехподдержки.ПодчиненныеЭлементы.ГруппаТехподдержка;
	ГруппаТехподдержка.ПодчиненныеЭлементы.ТехподдержкаИнформация.ПодчиненныеЭлементы.КнопкаСкачатьОбновление.Видимость = ВидимостьКнопки;
	
	Если ВидимостьКнопки Тогда
		
		ГруппаТехподдержка.Заголовок = "Обновите модуль";
		
		Если НЕ Модуль_ЯдроНаКлиенте().ПриложениеСтаршеВерсии("8.3.8") Тогда
			ГруппаТехподдержка.ЦветФона = Новый Цвет(250, 227, 143);
		КонецЕсли;
		
		Элементы.ГруппаНастройкиИТехподдержки.Ширина = 21;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТематическаяКартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Метрика_ТематическаяКартинкаНажатие();
	
	ПерейтиПоНавигационнойСсылке(ЛендингНовыйГод);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ТематическаяКартинкаНажатие()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Переменные = Новый Соответствие;
	Категория = Ядро.Метрика_НазваниеКатегории().ПоздравлениеКлиентов;
	Действие = Ядро.Метрика_НазваниеДействий().НажатиеКнопки;
	Метка = Элементы.ТематическаяКартинка.Имя;
	
	Ядро.Метрика_ДобавитьПоведение(Категория, Действие, Метка, Переменные, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОнбордингСобытияЛентыКонтрагентов()
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "СобытияЛентыКонтрагентовОнбординг");
	
	ОписаниеЗакрытияФормы = НовыйОписаниеОповещения(
		"ЗакрытОнбордингЛентыКонтрагентов",
		ЭтаФорма
	);
	
	ОткрытьФормуДиадокМодально(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы,
		ОписаниеЗакрытияФормы
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытОнбордингЛентыКонтрагентов(Результат, ДополнительныеПараметры) Экспорт
	
	 ИнициализироватьНастройку_НеПоказыватьОнбордингЛентыКонтрагентов();
	 
КонецПроцедуры

// }	ОБРАБОТЧИКИ ПОСЛЕ АВТОРИЗАЦИИ


// {	БЫСТРЫЕ ОТБОРЫ

&НаКлиенте
Процедура ВключитьОтборПоОрганизацииПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтборПоКонтрагентуПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики		= "Организация";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);

	ВключитьОтборПоОрганизации = ЗначениеЗаполнено(ОтборПоОрганизации);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ВключенОтбор", ВключитьОтборПоОрганизации);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, , Переменные);

	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКонтрагентуПриИзменении(Элемент)
	
	КонтрагентСопоставлен = КонтрагентСопоставлен();
	
	Если КонтрагентСопоставлен Тогда
		
		ОбновитьОтборПоКонтрагенту();
		
	Иначе
		
		ПредложитьСопоставитьКонтрагента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборПоКонтрагенту()
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики		= "Контрагенты";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ВключитьОтборПоКонтрагенту = ЗначениеЗаполнено(ОтборПоКонтрагенту);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ВключенОтбор", ВключитьОтборПоКонтрагенту);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, , Переменные);
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтборПоСтатусуПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтборПоВидуПакетаПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики		= "Статус";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);

	ВключитьОтборПоСтатусу = ЗначениеЗаполнено(ОтборПоСтатусу);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ВключенОтбор", ВключитьОтборПоСтатусу);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, , Переменные);
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуПакетаПриИзменении(Элемент)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики		= "Вид пакета";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);

	ВключитьОтборПоВидуПакета = ЗначениеЗаполнено(ОтборПоВидуПакета);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ВключенОтбор", ВключитьОтборПоВидуПакета);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, , Переменные);
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЗавершенныеПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

// }	БЫСТРЫЕ ОТБОРЫ


// {	СОПОСТАВЛЕНИЕ КОНТРАГЕНТА

&НаКлиенте
Функция КонтрагентСопоставлен()
	
	Результат = Истина;
	
	Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		
		Результат = КонтрагентСопоставленНаСервере();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтрагентСопоставленНаСервере()
	
	Результат = Модуль_ЯдроНаСервере().Контрагенты_КонтрагентСопоставленСЯщикомДиадок(ОтборПоКонтрагенту);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПредложитьСопоставитьКонтрагента()
	
	КатегорияМетрики = Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики = "ПоказатьФормуКонтрагентНеСопоставлен";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	ОписаниеЗакрытияФормы = НовыйОписаниеОповещения(
		"ОбработатьРезультатПредложенияСопоставленияКонтрагента",
		ЭтаФорма
	);
	
	ОткрытьФормуДиадокМодально(
		"ФормаВыбранныйКонтрагентНеСопоставленУправляемая",
		ЭтаФорма,
		,
		ОписаниеЗакрытияФормы
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПредложенияСопоставленияКонтрагента(РезультатПредложения, ДополнительныеПараметры) Экспорт
	
	Если РезультатПредложения = КодВозвратаДиалога.Да Тогда
		
		ОписаниеЗакрытияФормы = НовыйОписаниеОповещения(
			"ОбработатьРезультатСопоставленияКонтрагента",
			ЭтаФорма
		);
		
		Платформа = Модуль_Платформа();
		Платформа.ПоказатьФормуСопоставленияКонтрагента(
			ОтборПоКонтрагенту,
			ОтборПоОрганизации,
			ОписаниеЗакрытияФормы
		);
	ИначеЕсли РезультатПредложения = КодВозвратаДиалога.Прервать Тогда
		
		ОтборПоКонтрагенту = "";
		
	Иначе
		
		ОбновитьОтборПоКонтрагенту();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатСопоставленияКонтрагента(РезультатСопоставления, ДополнительныеПараметры) Экспорт
	
	Если РезультатСопоставления = КодВозвратаДиалога.Да Тогда
		
		ОбновитьОтборПоКонтрагенту();
		
	Иначе
		
		ОтборПоКонтрагенту = "";
		
		Метрики_ЗаписатьПоведение_ЗакрытьСопоставление();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ЗаписатьПоведение_ЗакрытьСопоставление()
	
	НазваниеФормы = "Упрощенная форма контрагентов";
	КатегорияМетрики = Метрика_НазваниеКатегории().Закрытие;
	ДействиеМетрики = "Закрыть";
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		КатегорияМетрики,
		ДействиеМетрики
	);
	
КонецПроцедуры

// }	СОПОСТАВЛЕНИЕ КОНТРАГЕНТА


// {	НАСТРОЙКИ

&НаКлиенте
Процедура НастройкиИсходящих(Команда)
	
	КатегорияМетрики = Метрика_КатегорияНастройка();
	ДействиеМетрики = "НастройкиИсходящих";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьНастройки("НастройкиИсходящих");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВходящих(Команда)
	
	КатегорияМетрики = Метрика_КатегорияНастройка();
	ДействиеМетрики = "НастройкиВходящих";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьНастройки("НастройкиВходящих");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключаемыйМодуль(Команда)
	
	КатегорияМетрики = Метрика_КатегорияНастройка();
	ДействиеМетрики = "Подключаемый модуль";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьНастройки("ПодключаемыйМодуль");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСервисныеФункции(Команда)
	
	КатегорияМетрики = Метрика_КатегорияНастройка();
	ДействиеМетрики = "Сервисные функции";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьНастройки("СервисныеФункции");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСкачиваниеДокументов(Команда)
	
	КатегорияМетрики = Метрика_КатегорияНастройка();
	ДействиеМетрики = "Скачивание документов";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьНастройки("СкачиваниеДокументов");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодписание(Команда)
	
	ОткрытьНастройки("СпособПодписания");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСоединениеССервером(Команда)
	
	КатегорияМетрики = Метрика_КатегорияНастройка();
	ДействиеМетрики = "Соединение с сервером";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьНастройки("СоединениеССервером");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(РазделНастроек)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РазделНастроек", РазделНастроек);
	
	ОповещениеОЗакрытииНастроек = НовыйОписаниеОповещения("ПослеЗакрытияФормыНастроек", ЭтаФорма, ДопПараметры);
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОткрытьНастройки(РазделНастроек, ОповещениеОЗакрытииНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыНастроек(Параметры, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Параметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ПерезапуститьМодуль Тогда
		ЗакрытьГлавнуюФорму();
		Возврат;
	КонецЕсли;
	
	Если Параметры.НастройкиИзменены Тогда
		
		ОбновитьЗначенияПараметровОбщегоКонтекста();
		ПослеЗакрытияФормыНастроекВызовСервера();
		ИнициализироватьНастройкуИВидимостьКнопкиЛентыКонтрагентов();
		ОбновитьСписок();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияФормыНастроекВызовСервера()
	
	УстановитьЗаголовокФормы();
	ПрочитатьНастройкуИспользоватьСопоставлениеПодразделений();
	ПереключитьВидимостьКолонок(РежимОтображенияДокументов);
	
	УправлениеПМ_ВыгрузитьВСервис();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкуИспользоватьСопоставлениеПодразделений()
	
	Ядро = Модуль_ЯдроНаСервере();
	ИспользоватьСопоставлениеПодразделений = Ядро.ЗначениеНастройки_ИспользоватьСопоставлениеПодразделений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьГлавнуюФорму()
	
	_ЭтоПрограммноеЗакрытиеФормы = Истина;
	Закрыть(КонтекстСеансаКлиентСервер);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСлужебныеСообщения(Команда)
	
	КатегорияМетрики	= Метрика_КатегорияНастройка();
	ДействиеМетрики		= "Служебные сообщения";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОткрытьФормуСпискаОшибокЛок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОрганизаций(Команда)
	
	КатегорияМетрики	= Метрика_КатегорияНастройка();
	ДействиеМетрики		= "Организации";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	мОткрытьФорму("Организации_ФормаСпискаУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКонтрагентов(Команда)
	
	КатегорияМетрики	= Метрика_КатегорияНастройка();
	ДействиеМетрики		= "Контрагенты";
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьСписокКонтрагентовЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКонтрагентовЗавершение()
	
	Организация = ПолучитьОрганизациюДляОткрытияСпискаКонтрагентов();
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстПредупреждения = НСтр("ru = 'Список организаций пуст!'");
		ПоказатьПредупреждениеПереопределенная(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Платформа = Модуль_Платформа();
	Платформа.Контрагенты_ПоказатьСписокКонтрагентов(Организация);
	
	ПоказатьПлашкуОтзываПоРаботеСКонтрагентами();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОрганизациюДляОткрытияСпискаКонтрагентов()
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		ИДОрганизации = Организации_ИдентификаторПоССылке(ОтборПоОрганизации);
		Если ЗначениеЗаполнено(ИДОрганизации) Тогда
			Результат = ИДОрганизации;
			Возврат Результат; 
		КонецЕсли;
	КонецЕсли;
	
	СписокОрганизаций = Организации_СписокОрганизацийДляВыбора();
	Если СписокОрганизаций.Количество() > 0 Тогда
		Результат = СписокОрганизаций[0].Значение;
	КонецЕсли;

	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура ОткрытьПоискНовыхКонтрагентов(Команда)
	
	КатегорияМетрики	= Метрика_КатегорияНастройка();
	ДействиеМетрики		= "Контрагенты";
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьПоискНовыхКонтрагентовЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоискНовыхКонтрагентовЗавершение()
	
	Организация = ПолучитьОрганизациюДляОткрытияСпискаКонтрагентов();
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстПредупреждения = НСтр("ru = 'Список организаций пуст!'");
		ПоказатьПредупреждениеПереопределенная(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Платформа = Модуль_Платформа();
	Платформа.Контрагенты_ПоказатьФормуПоискаИПриглашения(Организация);
	
	ПоказатьПлашкуОтзываПоРаботеСКонтрагентами();
	
КонецПроцедуры

&НаСервере
Функция Организации_СписокОрганизацийДляВыбора(ДобавитьНеоплаченные = Ложь)
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	Результат = Модуль_Ядро.Организации_СписокОрганизацийДляВыбора(ДобавитьНеоплаченные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Организации_ИдентификаторПоССылке(ОрганизацияИБ)
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	Результат = Модуль_Ядро.Организации_ИдентификаторПоССылке(ОрганизацияИБ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСпискаКонтрагентовМодально() Экспорт
	
	ОткрытьСписокКонтрагентовЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПлагинов(Команда)
	
	КатегорияМетрики = Метрика_КатегорияНастройка();
	ДействиеМетрики = Метрика_ДействиеОткрытьСписокПлагинов();
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.КонтурПлагины_ОткрытьФорму(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиОтборов()
	
	Объект.ОбщийКонтекстКлиентСервер.АдресаСКД.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАвторизации()
	
	ПриИзмененииКонтекстаСеанса = НовыйОписаниеОповещения("ПослеЗакрытияФормыАвторизации", ЭтаФорма);
	
	Платформа = Модуль_Платформа();
	Платформа.Сеанс_РедактироватьКонтекст(ПриИзмененииКонтекстаСеанса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыАвторизации(НовыйКонтекст, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(КонтекстСеансаКлиентСервер)
		И Не ЗначениеЗаполнено(НовыйКонтекст) Тогда
		
		ПоказатьКнопкуСкачатьОбновление();
		ПоказатьИндикаторПредупреждения();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НовыйКонтекст) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьКонтекстФормы(ЭтаФорма, НовыйКонтекст);
	
	ВыполнитьДействияНаСервереПослеАвторизации();
	шхАвторизован = Истина; // + ШХ
	
	ОбработчикПродолжения = НовыйОписаниеОповещения("АвторизацияЗавершение", ЭтаФорма);
	
	Если ПоказатьПредупреждениеОПроблемахСПоддержкой() Тогда
		Возврат;
	КонецЕсли;
	
	Если НеобходимоОткрытиеМастераПервогоЗапуска Тогда
		
		Платформа = Модуль_Платформа();
		Платформа.ПоказатьМастерПервогоЗапуска(ОбработчикПродолжения);
		
	Иначе
		
		ВыполнитьОбработкуОповещенияПереопределенная(
			ОбработчикПродолжения,
			НовыйКонтекст
		);
		
	КонецЕсли;
	
	Метрика_ОтображениеБаннераЛогистики();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКонтекстФормы(Форма, Знач КонтекстСеанса)
	
	Если Не ЗначениеЗаполнено(КонтекстСеанса) Тогда
		КонтекстСеанса = Новый Соответствие;
	КонецЕсли;
	
	Форма.КонтекстСеансаКлиентСервер = ФиксированныеДанныеЛок(КонтекстСеанса);
	Форма.ЕстьСертификаты = Ложь;
	Буфер = Новый Соответствие;
	
	Для Каждого ЭлементКоллекции Из Форма.КонтекстСеансаКлиентСервер Цикл
		
		СтрокаКонтекста = ЭлементКоллекции.Значение;
		
		Если НЕ СтрокаКонтекста.ТребуетсяОплатаСервиса Тогда
			Буфер.Вставить(СтрокаКонтекста.Box.BoxIdGuid, СтрокаКонтекста.ОрганизацияНаименование);
		КонецЕсли;
		
		Форма.ЕстьСертификаты = Форма.ЕстьСертификаты Или ЗначениеЗаполнено(СтрокаКонтекста.ОтпечатокСертификата);
		
	КонецЦикла;
	
	Форма.ЯщикиНеТребующиеОплаты = ФиксированныеДанныеЛок(Буфер);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьНеобходимостьПереходаСПлагинаСчетВПакете();
	
	Справка_ПоказатьПриПервомЗапуске();
	
	УправлениеПМ_ВыгрузитьВСервис();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияНаСервереПослеАвторизации()
	
	МодульЯдро = Модуль_ЯдроНаСервере();
	ЕстьОграниченияПоТарифу = МодульЯдро.ЕстьОграниченияПоТарифу();
	ПодключенИМИлиПМ = МодульЯдро.ЕстьИнтеграционныйИлиПодключаемыйМодуль();
	СтрокиКонтекста = МодульЯдро.КонтекстСеанса_СтрокиКонтекста();
	НеобходимоОткрытиеМастераПервогоЗапуска = (СтрокиКонтекста.Количество() > 0);
	
	Если МодульЯдро.КонфигурацияНеПоддерживается() Тогда
		
		СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияНеПоддерживается();
		
	ИначеЕсли МодульЯдро.КонфигурацияУстарела() Тогда
		
		СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияУстарела();
		
	Иначе
		
		СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияПоддерживается();
		
	КонецЕсли;
	
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		
		КонтекстЯщика = СтрокаКонтекста.Значение;
		
		Идентификаторы = МодульЯдро.Новый_ИдентификаторыСправочника( , КонтекстЯщика.BoxId);
		
		Организация1С = МодульЯдро.ХранениеДанных_СопоставленнаяОрганизацияВ1С(Идентификаторы);
		
		Если ЗначениеЗаполнено(Организация1С) Тогда
			
			НеобходимоОткрытиеМастераПервогоЗапуска = Ложь;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МодульЯдро.ОблачныеНастройки_ДополнитьОбщийКонтекст();
	
	МодульЯдро.ОблачныеНастройки_ОбработатьНастройки();
	
	МодульЯдро.МетрикиКонтур_ЗаписатьСобытие_Авторизация();
	
	ОбработатьНаличиеПредложенийДляПокупки();
	УстановитьВидимостьЭлементовДляЛогистики();
	
	ОбработатьНастройкуИспользованияПлагиновПослеАвторизации();
	
	НастроитьИнтерфейсЛентыКонтрагентов();
	
КонецПроцедуры

&НаКлиенте
Функция ПоказатьПредупреждениеОПроблемахСПоддержкой()
	
	СтатусПоддержкиПроблема =
		СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияНеПоддерживается()
		ИЛИ СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияУстарела();
	
	Если ЕстьОграниченияПоТарифу
		И СтатусПоддержкиПроблема Тогда
		
		ПоказатьПредупреждениеКонфигурацияНеДоступнаНаТарифеСтартовом();
		Возврат Истина;
		
	КонецЕсли;
	
	Если НЕ ПодключенИМИлиПМ
		И СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияНеПоддерживается() Тогда
		
		ПоказатьФормуВыбораИнтеграционногоМодуляКонфигурацияНеПоддерживается();
		Возврат Истина;
		
	КонецЕсли;
	
	Если НЕ ПодключенИМИлиПМ
		И СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияУстарела() Тогда
		
		ПоказатьФормуВыбораИнтеграционногоМодуляКонфигурацияУстарела();
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ПоказатьПредупреждениеКонфигурацияНеДоступнаНаТарифеСтартовом()
	
	Если СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияНеПоддерживается() Тогда
		
		ПредставлениеКонфигурации = СинонимКонфигурации();
		
		ТекстСообщения = НСтр(
				"ru = 'Тариф ""Стартовый"" не предусматривает работу на конфигурации
				|" + ПредставлениеКонфигурации + "
				|Для продолжения работы перейдите на тариф ""Универсальный"".'");
		
	КонецЕсли;
	
	Если СтатусПоддержкиКонфигурации = СтатусПоддержкиКонфигурации_КонфигурацияУстарела() Тогда
		
		ВерсияСовместимости = МинимальнаяВерсияПоддерживаемойКонфигурации();
		
		ТекстСообщения = НСтр(
				"ru = 'Тариф ""Стартовый"" не поддерживает работу на версиях  
				|конфигурации ниже " + ВерсияСовместимости + ". Для продолжения работы обновите 
				|конфигурацию до актуальной версии или перейдите на тариф 
				|""Универсальный"".'");
		
	КонецЕсли;
	
	Метрика_ПоказатьПредупреждениеОНеДоступностиКонфигурацииНаТарифе();
	
	ПоказатьПредупреждениеОНеДоступнойКонфигурацииТарифа(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Функция МинимальнаяВерсияПоддерживаемойКонфигурации()
	
	МодульЯдро = Модуль_ЯдроНаСервере();
	
	Результат = МодульЯдро.МинимальнаяВерсияПоддерживаемойКонфигурации();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПредупреждениеОНеДоступнойКонфигурацииТарифа(ТекстСообщения) Экспорт
	
	ЗаголовокСообщения = "";
	
	КнопкаПоУмолчанию = КодВозвратаДиалога.Отмена;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Узнать подробнее");
	СписокКнопок.Добавить(КнопкаПоУмолчанию, "Вернуться к выбору организаций");
	
	ИмяОбработчикаПослеВызоваВопроса = "ПослеВызоваПредупрежденияОНеДоступнойКонфигурацииТарифа";
	Таймаут = 0;
	
	ОповещениеОЗавершении = НовыйОписаниеОповещения(
			ИмяОбработчикаПослеВызоваВопроса,
			ЭтаФорма);
	
	ПоказатьВопросПереопределенная(
		ОповещениеОЗавершении,
		ТекстСообщения,
		СписокКнопок,
		Таймаут,
		КнопкаПоУмолчанию,
		ЗаголовокСообщения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеВызоваПредупрежденияОНеДоступнойКонфигурацииТарифа(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		Метрика_УзнатьПодробнееОНеДоступностиКонфигурацииНаТарифе();
		
		АдресСсылки = "https://promo.diadoc.ru/tariff-universal";
		
		ПерейтиПоСсылке(АдресСсылки);
		
		ПоказатьПредупреждениеКонфигурацияНеДоступнаНаТарифеСтартовом();
		
	Иначе
		
		Метрика_ЗаписатьВернутьсяКВыборуОрганизаций();
		
		ОткрытьФормуАвторизации();
		
	КонецЕсли;
	
КонецПроцедуры

// }	НАСТРОЙКИ


// {	ТЕХПОДДЕРЖКА

&НаКлиенте
Процедура ОткрытьБыструюНастройку(Команда)
	
	КатегорияМетрики = Метрика_НазваниеКатегории().БыстраяНастройка;
	ДействиеМетрики = "Мастер первого запуска";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	Платформа = Модуль_Платформа();
	Платформа.ЗапуститьНастройкуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРуководствоПользователя(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики		= "Руководство пользователя";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);

	ЗапуститьПриложение("https://support.kontur.ru/pages/viewpage.action?pageId=83865676");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюОбновлений(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики		= "История обновлений";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, "Открытие формы", ДействиеМетрики);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстОбновлений = ИсторияОбновлений();
	ТекстовыйДокумент.УстановитьТекст(ТекстОбновлений);
	ТекстовыйДокумент.ТолькоПросмотр = Истина;
	ТекстовыйДокумент.Показать("История обновлений");
	
КонецПроцедуры

&НаСервере
Функция ИсторияОбновлений()
	
	Возврат ОбработкаОбъект().ИсторияОбновлений();
	
КонецФункции

&НаКлиенте
Процедура ПровестиДиагностику(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики		= "Провести диагностику";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	ЗапуститьПриложение("https://help.kontur.ru/diadoc");
	
КонецПроцедуры

&НаКлиенте
Процедура ДистанционнаяПомощь(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики		= "Дистанционная помощь VNC";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	ЗапуститьПриложение("https://help.kontur.ru/vnc");
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонТехподдержки(Команда)
	
	// BSLLS:DeprecatedMessage-off
	Сообщить("Телефон поддержки 8-800-500-10-18");
	// BSLLS:DeprecatedMessage-on
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказатьОбратныйЗвонок(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики		= "Заказать обратный звонок";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	ЗапуститьПриложение("https://www.diadoc.ru/support#callback");
	
КонецПроцедуры

// Открывает окно выбора ораганизации и затем - страницу Центра поддержки
//
// Параметры:
//  КатегорияМетрики - Строка, Неопределено - категоря метрики
//  НазваниеФормы - Строка, Неопределено - Название формы для записи TraceId
//  РежимОткрытияЦП - Строка, Неопределено - см Ядро.ЦП_РежимыОткрытияЦП()
// 
&НаКлиенте
Процедура ЦентрПоддержки_Открыть(Знач КатегорияМетрики = Неопределено, Знач НазваниеФормы = Неопределено, РежимОткрытияЦП = Неопределено) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ЦентрПоддержки_Открыть(КатегорияМетрики, НазваниеФормы, РежимОткрытияЦП);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦентрПоддержки(Команда)
	
	КатегорияМетрики = Метрика_НазваниеКатегории().Техподдержка;
	
	ЦентрПоддержки_Открыть(КатегорияМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВТехподдержку(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики		= "Написать письмо в техподдержку";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.Обработчик_ОтправитьEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТехническуюИнформацию(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Техподдержка;
	ДействиеМетрики		= "Техническая информация";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		ИдентификаторЯщика = Организации_ИдентификаторПоССылке(ОтборПоОрганизации);
		Если ЗначениеЗаполнено(ИдентификаторЯщика) Тогда
			ПараметрыФормы.Вставить("ОтборПоОрганизации", ИдентификаторЯщика);
		Иначе
			ПараметрыФормы.Вставить("ОтборПоОрганизации", "");
		КонецЕсли;
	Иначе
		ПараметрыФормы.Вставить("ОтборПоОрганизации", "");
	КонецЕсли;
	
	ОткрытьФормуДиадокМодально("ФормаТехническаяИнформацияУправляемая", ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Функция РежимПрокси(Настройки)
	
	Если Настройки.РежимПрокси = "NoProxy" Тогда
		Результат= "без прокси";
	ИначеЕсли Настройки.РежимПрокси = "UseDefaultProxy" Тогда
		Результат = "использовать системные настройки";
	Иначе
		Результат = "использовать настройки прокси";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЛогинДляОбмена(Настройки)
	
	Если ЗначениеЗаполнено(Настройки.СлужебнаяУчетнаяЗаписьЛогин) Тогда
		Результат = Настройки.СлужебнаяУчетнаяЗаписьЛогин;
	Иначе
		Результат = "не заполнен";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обертка для формирования ключей параметров, передаваемых в URL
&НаКлиенте
Функция ПродуктовыйПараметр(ИмяПараметра)
	
	Возврат СтрЗаменить("scope/1CDiadoc/%ИмяПараметра%", "%ИмяПараметра%", ИмяПараметра);
	
КонецФункции

// Обертка для формирования ключей параметров, передаваемых в URL
&НаКлиенте
Функция БазовыйПараметр(ИмяПараметра)
	
	Возврат СтрЗаменить("base/%ИмяПараметра%", "%ИмяПараметра%", ИмяПараметра);
	
КонецФункции

// Преобразует коллекцию элементов КлючИЗначение в строку параметров URI
//
// Параметры:
//  КоллекцияПараметров - Структура - коллекция элементов КлючИЗначение
// 
// Возвращаемое значение:
//  Строка - строка параметров в формате ?paramName1=paramValue1&paramName2=paramValue2&...&paramNameN=paramValueN
&НаКлиентеНаСервереБезКонтекста
Функция СтруктуруВСтрокуПараметровURI(КоллекцияПараметров)
	
	Результат = "";
	
	Для Каждого Параметр Из КоллекцияПараметров Цикл 
		
		Если Не ЗначениеЗаполнено(Параметр.Значение) Тогда 
			Продолжить;
		КонецЕсли;
		
		Результат = Результат 
					+ "" + Параметр.Ключ
					+ "=" + СокрЛП(Параметр.Значение)
					+ "&";
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		Результат = "?" + Лев(Результат, СтрДлина(Результат)-1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразует коллекцию элементов КлючИЗначение в строку, представляющую собой массив параметров URI
//
// Параметры:
//  КоллекцияПараметров - Структура, Соответствие - коллекция элементов КлючИЗначение
// 
// Возвращаемое значение:
//  Строка - коллекция KeyValue в формате: {"key1":"value1","key2":"value2",...,"keyN":"valueN"}
&НаКлиентеНаСервереБезКонтекста
Функция СтруктуруВКоллекциюПараметровURI(КоллекцияПараметров)
	
	Результат = "";
	
	Для Каждого Параметр Из КоллекцияПараметров Цикл 
		
		Если Не ЗначениеЗаполнено(Параметр.Значение) Тогда 
			Продолжить;
		КонецЕсли;
		
		Ключ 		= Параметр.Ключ;
		Значение 	= СокрЛП(Параметр.Значение);
		Значение 	= СтрЗаменить(Значение, "\"	, "\\"	); // экранируем обратный слеш
		Значение 	= СтрЗаменить(Значение, """", "\"""	); // экранируем кавычки
		
		ПараметрСтрокой = """" + Ключ + """:""" + Значение + """";
		
		Результат = Результат + ПараметрСтрокой + ",";
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		Результат = Лев(Результат, СтрДлина(Результат)-1);
		Результат = СтрЗаменить("{%Параметры%}", "%Параметры%", Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// }	ТЕХПОДДЕРЖКА


// {	ПОСТРАНИЧНЫЙ ПРОСМОТР СПИСКА

&НаСервере
Процедура ОбновитьЗаголовокНомерСтраницы()
	
	НовыйЗаголовок = Строка(НомерСтраницы) + " из " + Строка(КоличествоСтраниц);
	Элементы.НомерСтраницы.Заголовок = НовыйЗаголовок;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКнопкиНавигацииПоСтраницам()
	
	Элементы.ПерваяСтраница.Доступность		 = ?(НомерСтраницы > 1, Истина, Ложь);
	Элементы.ПредыдущаяСтраница.Доступность	 = ?(НомерСтраницы > 1, Истина, Ложь);
	Элементы.СледующаяСтраница.Доступность	 = ?(НомерСтраницы < КоличествоСтраниц, Истина, Ложь);
	Элементы.ПоследняяСтраница.Доступность	 = ?(НомерСтраницы < КоличествоСтраниц, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерваяСтраница(Команда)
	
	НомерСтраницы = 1;
	ОбновитьСтраницуСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяСтраница(Команда)
	
	НомерСтраницы = НомерСтраницы - 1;
	ОбновитьСтраницуСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяСтраница(Команда)
	
	НомерСтраницы = НомерСтраницы + 1;
	ОбновитьСтраницуСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоследняяСтраница(Команда)
	
	НомерСтраницы = КоличествоСтраниц;
	ОбновитьСтраницуСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерСтраницыПриИзменении(Элемент)
	
	Если РазмерСтраницы = 0 Тогда
		РазмерСтраницы = 1;
	КонецЕсли;
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().ПостраничныйПросмотр;
	ДействиеМетрики		= "Изменить показатель";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("Значение", РазмерСтраницы);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, , Переменные);
	
	ОбновитьСтраницуСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерСтраницыАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда // Подбор выполнен с помощью кнопки выбора из списка
		
		СписокВыбора		 = МетодСервераБезКонтекста(Истина, "ОбработкаОбъект().СписокДокументов_СписокВыбораРазмераСтраницы");
		ОписаниеОповещения	 = НовыйОписаниеОповещения("ОбработчикПослеВыбораИзМенюРазмераСтраницы", ЭтаФорма);
		
		Форма_ПоказатьВыборИзМеню(ЭтаФорма, ОписаниеОповещения, СписокВыбора, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеВыбораИзМенюРазмераСтраницы(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		РазмерСтраницы = Результат.Значение;
		ОбновитьСтраницуСпискаДокументов();
		
	КонецЕсли;
	
КонецПроцедуры

// }	ПОСТРАНИЧНЫЙ ПРОСМОТР СПИСКА


// {	ОСНОВНЫЕ ДЕЙСТВИЯ

&НаКлиенте
Процедура ВыбратьРежимДляОтправки(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СменаВкладки;
	ДействиеМетрики		= "Для отправки";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	ОбновитьСписок(РежимыОтображения().ДляОтправки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРежимИсходящие(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СменаВкладки;
	ДействиеМетрики		= "Исходящие";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	Если НЕ ИспользуетсяПодсистемаДиадок Тогда
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.СформироватьИзвещенияОПолучении();
		Модуль_Платформа.СформироватьОтменуФиксацииГИСМТ();
	КонецЕсли;
	
	ОбновитьСписок(РежимыОтображения().Исходящие);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРежимВходящие(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СменаВкладки;
	ДействиеМетрики		= "Входящие";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);

	Если НЕ ИспользуетсяПодсистемаДиадок Тогда
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.СформироватьИзвещенияОПолучении();
	КонецЕсли;
	
	ОбновитьСписок(РежимыОтображения().Входящие);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРежимВнутренние(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СменаВкладки;
	ДействиеМетрики		= "Внутренние";

	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);

	Если НЕ ИспользуетсяПодсистемаДиадок Тогда
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.СформироватьИзвещенияОПолучении();
		Модуль_Платформа.СформироватьОтменуФиксацииГИСМТ();
	КонецЕсли;
	
	ОбновитьСписок(РежимыОтображения().Внутренние);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтбораПоСтатусу(РежимОтображения)
	
	Если РежимОтображения <> РежимыОтображения().ДляОтправки Тогда
		
		Элементы.ГруппаОтборСтатус.Видимость = Истина;
		
		УстановитьОтборПоСтатусу(РежимОтображения);
		
	Иначе
		
		Элементы.ГруппаОтборСтатус.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтбораПоКонтрагенту(РежимОтображения)
	
	Если РежимОтображения <> РежимыОтображения().Внутренние Тогда
		
		Элементы.ГруппаОтборКонтрагент.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаОтборКонтрагент.Видимость = Ложь;
		ВключитьОтборПоКонтрагенту = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтбораПоВидуПакета(РежимОтображения)
	
	Если РежимОтображения = РежимыОтображения().ДляОтправки Тогда
		
		Элементы.ГруппаОтборПоВидуПакета.Видимость 	= Истина;
		
		УстановитьОтборПоВидуПакета();
		
	Иначе
		
		Элементы.ГруппаОтборПоВидуПакета.Видимость 	= Ложь;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПользователяНажатие(Элемент)
	
	КатегорияМетрики = Метрика_НазваниеКатегории().ИнициализацияМодуля;
	ДействиеМетрики = "Сменить пользователя";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ПоказатьИндикаторДлительнойОперации();
	
	ОткрытьФормуАвторизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделениеДокументов(Команда)
	
	УстановитьФлажки = ЕстьВыбранныеСтрокиСпискаДокументов();
	
	ОбработатьВыделениеДокументов(УстановитьФлажки);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьВыбранныеСтрокиСпискаДокументов()
	
	Результат = Истина;
	
	Для Каждого СтрокаСписка Из СписокДокументов Цикл
		
		Если СтрокаСписка.Флажок Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗагрузкуНовогоПакета(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Создать отдельный пакет";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);

	ОткрытьФормуНовогоПакета();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуДокументовСДискаВВыбранныеПакеты(Команда)
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрокТЧ(Ложь);
	КоличествоСтрок = ДанныеВыделенныхСтрок.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		
		ПоказатьПредупреждениеНеВыбраноНиОднойСтроки();
		
	Иначе
		
		КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
		ДействиеМетрики		= "Добавить в выбранные пакеты";
		
		Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
		Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
		
		ОткрытьФормуДобавленияДокументовСДискаВВыбранныеПакеты();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НетНужногоДокумента(Команда)
	
	Метрика_НетНужногоДокумента();
	
	ПоказатьФормуНетНужногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуНетНужногоДокумента()
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "НетНужногоДокумента");
	
	ОповещениеОЗакрытииФормы = НовыйОписаниеОповещения("ОповещениеОЗакрытииФормыНетНужногоДокумента", ЭтаФорма);
	
	ОткрытьФормуДиадокМодально(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы,
		ОповещениеОЗакрытииФормы
	);

КонецПроцедуры

&НаКлиенте
Процедура Метрика_НетНужногоДокумента()
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().НетНужногоДокумента;
	ДействиеМетрики		= Метрика_НазваниеДействий().ОткрытиеПомощника;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ИдентификаторПользователя = Ядро.ИдентификаторТекущегоПользователяСервиса();
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		ИдентификаторПользователя = "Пользователь не авторизован";
	КонецЕсли;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("UserID", ИдентификаторПользователя);
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Ядро.Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(
		КатегорияМетрики,
		ДействиеМетрики,
		Неопределено,
		ДопПеременные
	);

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗакрытииФормыНетНужногоДокумента(ПараметрОповещения = Неопределено, ПараметрыОбработки = Неопределено) Экспорт
	
	ОбновитьГлавныйСписок();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГлавныйСписок()
	
	ИмяСобытия = "Диадок_ОбновитьГлавныйСписок";
	ПараметрыОповещения = Неопределено;
	ИсточникОповещения = ИдентификаторОсновнойФормы();
	
	Оповестить(
		ИмяСобытия,
		ПараметрыОповещения,
		ИсточникОповещения
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Переотправка(Команда)
	
	Метрика_Переотправка();
	
	ПоказатьФормуПереотправка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуПереотправка()
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "Переотправка");
	
	ОткрытьФормуДиадокМодально(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы
	);

КонецПроцедуры

&НаКлиенте
Процедура Метрика_Переотправка()
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Переотправка;
	ДействиеМетрики		= Метрика_НазваниеДействий().ОткрытиеПомощника;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ИдентификаторПользователя = Ядро.ИдентификаторТекущегоПользователяСервиса();
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		ИдентификаторПользователя = "Пользователь не авторизован";
	КонецЕсли;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("UserID", ИдентификаторПользователя);
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Ядро.Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(
		КатегорияМетрики,
		ДействиеМетрики,
		Неопределено,
		ДопПеременные
	);

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		КлючТекущейСтроки = ТекущиеДанные.Ключ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрокаЭлементФормы, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяСтрока = Элемент.ТекущиеДанные;
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		
		Если Поле.Имя = "СписокДокументовДокумент"
			И ЗначениеЗаполнено(ВыбраннаяСтрока.Документ) Тогда
			
			Модуль_Платформа = Модуль_Платформа();
			Модуль_Платформа.ПоказатьЗначениеЛок(ВыбраннаяСтрока.Документ);
			
		Иначе
			ОткрытьФормуПакета(ВыбраннаяСтрока);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПакета(ВыбраннаяСтрока)
	
	СтрокаСписка = Новый_СтруктураДанныхСтрокиСписка(ВыбраннаяСтрока);
	
	КлючПакетаДокументов = КлючПакетаДокументов(ВыбраннаяСтрока);
	РежимФормы = РежимыФормыПакета().ОтображениеПакета;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
	ПараметрыФормы.Вставить("Ключ",								КлючПакетаДокументов);
	ПараметрыФормы.Вставить("СтрокаСписка",						СтрокаСписка);
	ПараметрыФормы.Вставить("ВыбранныеФайлы",					Неопределено);
	ПараметрыФормы.Вставить("РежимФормы",						РежимФормы);
	ПараметрыФормы.Вставить("РежимОтображенияДокументов",		РежимОтображенияДокументов);
	ПараметрыФормы.Вставить("ИдентификаторОсновнойФормы",		ИдентификаторОсновнойФормы());
	
	мОткрытьФорму("ФормаПакетаУправляемая", ПараметрыФормы, , ЭтаФорма, КлючПакетаДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНовогоПакета()
	
	ВыбранныеФайлы = ВыбратьФайлыДляДобавленияВПакет();
	
	Если НЕ ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	КлючПакетаДокументов 	= КлючПакетаДокументов(Неопределено);
	СтрокаСписка 			= Новый_СтруктураДанныхСтрокиСписка(Неопределено);
	РежимФормы				= РежимыФормыПакета().СозданиеНовогоПакета;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
	ПараметрыФормы.Вставить("Ключ",								КлючПакетаДокументов);
	ПараметрыФормы.Вставить("СтрокаСписка",						СтрокаСписка);
	ПараметрыФормы.Вставить("ВыбранныеФайлы",					ВыбранныеФайлы);
	ПараметрыФормы.Вставить("РежимФормы",						РежимФормы);
	ПараметрыФормы.Вставить("РежимОтображенияДокументов",		РежимОтображенияДокументов);
	ПараметрыФормы.Вставить("ИдентификаторОсновнойФормы",		ИдентификаторОсновнойФормы());
	
	ПараметрОрганизация = Неопределено;
	ПараметрКонтрагент  = Неопределено;
	
	Если ВключитьОтборПоОрганизации 
		И ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		ПараметрОрганизация = ОтборПоОрганизации;
	КонецЕсли; 
	
	Если ВключитьОтборПоКонтрагенту 
		И ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		ПараметрКонтрагент = ОтборПоКонтрагенту;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Организация",					ПараметрОрганизация);
	ПараметрыФормы.Вставить("Контрагент",					ПараметрКонтрагент);
	
	мОткрытьФорму("ФормаПакетаУправляемая", ПараметрыФормы, , ЭтаФорма, КлючПакетаДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДобавленияДокументовСДискаВВыбранныеПакеты()
	
	КлючФормыПакета = РежимыФормыПакета().ДобавлениеДокументовСДиска;
	РежимФормы = РежимыФормыПакета().ДобавлениеДокументовСДиска;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
	ПараметрыФормы.Вставить("Ключ",								КлючФормыПакета);
	ПараметрыФормы.Вставить("СтрокаСписка",						Неопределено);
	ПараметрыФормы.Вставить("ВыбранныеФайлы",					Неопределено);
	ПараметрыФормы.Вставить("РежимФормы",						РежимФормы);
	ПараметрыФормы.Вставить("РежимОтображенияДокументов",		РежимОтображенияДокументов);
	ПараметрыФормы.Вставить("ИдентификаторОсновнойФормы",		ИдентификаторОсновнойФормы());
	
	ФормаПакетаДобавленияДокументовСДиска = ПолучитьФормуОбработки("ФормаПакетаУправляемая", ЭтаФорма, ПараметрыФормы);
	
	Если ФормаПакетаДобавленияДокументовСДиска.Открыта() Тогда
		ФормаПакетаДобавленияДокументовСДиска.Активизировать();
	Иначе
		ФормаПакетаДобавленияДокументовСДиска = "";
		
		ВыбранныеФайлы = ВыбратьФайлыДляДобавленияВПакет();
		
		Если НЕ ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("ВыбранныеФайлы", ВыбранныеФайлы);
		
		ОписаниеОповещения = НовыйОписаниеОповещения("ПослеДобавленияДокументовСДискаВВыбранныеПакеты", ЭтаФорма);
		
		мОткрытьФорму("ФормаПакетаУправляемая", ПараметрыФормы, ОписаниеОповещения, ЭтаФорма, КлючФормыПакета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияДокументовСДискаВВыбранныеПакеты(ДокументыСДиска, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументыСДиска) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РежимОтображенияДокументов = РежимыОтображения().ДляОтправки Тогда
		Возврат;
	КонецЕсли;
	
	КлючиВыбранныхПакетов = Новый Массив;
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрокТЧ(Ложь);
	
	Для Каждого СтрокаСписка Из ДанныеВыделенныхСтрок Цикл
		КлючиВыбранныхПакетов.Добавить(СтрокаСписка.Ключ);
	КонецЦикла;
	
	ПослеДобавленияДокументовСДискаВВыбранныеПакетыНаСервере(ДокументыСДиска, КлючиВыбранныхПакетов);
	
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияДокументовСДискаВВыбранныеПакетыНаСервере(ДокументыСДиска, КлючиВыбранныхПакетов)
	
	МенеджерМодуля = ОбработкаОбъект();
	МенеджерМодуля.ПоместитьВКэшДобавленныеВВыбранныеВПакетыДокументыСДискаИОбновитьСписок(ДокументыСДиска, КлючиВыбранныхПакетов, СписокДокументов);
	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьФайлыДляДобавленияВПакет() 
	
	Результат = Новый Массив;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок			= "Выберите файл";
	Диалог.ПолноеИмяФайла		= ""; 
	Диалог.Фильтр				= НСтр("ru = 'Все файлы(*.*)|*.*'"); 
    Диалог.МножественныйВыбор	= Истина;
	
	Если Диалог.Выбрать() Тогда
		Результат = Диалог.ВыбранныеФайлы;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КлючПакетаДокументов(ВыбраннаяСтрока) 
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		
		Результат = Новый УникальныйИдентификатор;
		
	Иначе
		
		Результат = РежимОтображенияДокументов + " " + ВыбраннаяСтрока.Ключ;
		
		Если ЗначениеЗаполнено(ВыбраннаяСтрока.ВидПакетаID) Тогда
			Результат = Результат + " " + ВыбраннаяСтрока.ВидПакетаID
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СписокДокументовСортироватьПоВозрастанию(Команда)
	
	СписокДокументовСортировать("Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовСортироватьПоУбыванию(Команда)

	СписокДокументовСортировать("Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовСортировать(НаправлениеСортировки)
	
	ИмяТекущейКолонки = СтрЗаменить(Элементы.СписокДокументов.ТекущийЭлемент.Имя, "СписокДокументов", "");
	
	СписокДокументов.Сортировать(ИмяТекущейКолонки + " " + НаправлениеСортировки);
	УбратьИконкиПакета();
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьИконкиПакета()
	
	Для Каждого СтрокаСписка Из СписокДокументов Цикл
		СтрокаСписка.ИндексИконкиПакета = 0;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)

	КатегорияМетрики	= Метрика_НазваниеКатегории().ОбменССервером;
	ДействиеМетрики		= "Обмен с сервером";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ИдентификаторОсновнойФормы = ИдентификаторОсновнойФормы();
	ОповещениеОЗакрытииНастроек = НовыйОписаниеОповещения("ПослеЗакрытияФормыНастроек", ЭтаФорма);
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ВыполнитьОбменССерверомСФормойПрогресса(ИдентификаторОсновнойФормы, ОповещениеОЗакрытииНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики		= "Период";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаПериода",				НастройкаВыбораПериода);
	ПараметрыФормы.Вставить("РежимОтображенияДокументов",	РежимОтображенияДокументов);
	
	Оповещение = НовыйОписаниеОповещения("ОбработкаВыбораПериода", ЭтаФорма);
	ОткрытьФормуДиадокМодально("НастройкаПериодаУправляемая", ЭтаФорма, ПараметрыФормы, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериода(РезультатВыбораПериода = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если РезультатВыбораПериода <> Неопределено Тогда
		
		НастройкаВыбораПериода = РезультатВыбораПериода;
		
		ОбновитьСписок();
		
		УстановитьЗаголовокКнопкиПериода();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФильтры(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики		= "Расширенные фильтры";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимОтображенияДокументов", РежимОтображенияДокументов);
	
	ОткрытьФормуДиадокМодально("ФормаФильтровУправляемая", ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтры(КомпоновщикНастроек) Экспорт
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().Фильтры;
	ДействиеМетрики		= "Применить";

	Объект.КомпоновщикНастроекОтбора = КомпоновщикНастроек;
	
	МассивФильтров = МассивУстановленныхФильтров();
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("Массив фильтров", МассивФильтров);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, , Переменные);
	
	УстановитьТекущиеОтборыНаСервере(КомпоновщикНастроек);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущиеОтборыНаСервере(КомпоновщикНастроек)
	
	ОбработкаОбъект().СохранитьНастройкуКомпановкиДанныхДляРежима(РежимОтображенияДокументов, КомпоновщикНастроек);
	ОбработкаОбъект().ТаблицаОтборов_УстановитьОтборыСпискаДокументов(РежимОтображенияДокументов);
	
	ОбновитьСтраницуСпискаДокументовНаСервере();
	
	КоличествоУстановленныхФильтров = КоличествоУстановленныхФильтров();	
	УстановитьЗаголовокКнопкиФильтров(КоличествоУстановленныхФильтров);
	
КонецПроцедуры

&НаСервере
Функция КоличествоУстановленныхФильтров()
	
	Результат = 0;
	
	КомпоновщикНастроекОтбора = ОбработкаОбъект().КомпоновщикНастроекОтбора;
	
	Для Каждого Отбор Из КомпоновщикНастроекОтбора.Настройки.Отбор.Элементы Цикл
		
		Если Отбор.Использование Тогда
			
			Результат = Результат + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МассивУстановленныхФильтров()
	
	Результат = Новый Массив;
	
	Для Каждого Отбор Из Объект.КомпоновщикНастроекОтбора.Настройки.Отбор.Элементы Цикл
		
		Если Отбор.Использование Тогда
			Результат.Добавить(Строка(Отбор.ЛевоеЗначение));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокКнопкиФильтров(КоличествоУстановленныхФильтров)
	 
	Если ЗначениеЗаполнено(КоличествоУстановленныхФильтров) Тогда
		
		Если Элементы.Фильтры.Заголовок <> Строка(КоличествоУстановленныхФильтров) Тогда
			
			Элементы.Фильтры.Картинка 		= Элементы.КартинкаФильтрыАктивныеСкрытая.Картинка;
			Элементы.Фильтры.Отображение	= ОтображениеКнопки.КартинкаИТекст;
			Элементы.Фильтры.Ширина 		= 6;
			Элементы.Фильтры.Заголовок		= КоличествоУстановленныхФильтров;
			
		КонецЕсли;
		
	Иначе
		
		СброситьЗаголовокКнопкиФильтров();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЗаголовокКнопкиФильтров()
	 
	Элементы.Фильтры.Картинка 		= Элементы.КартинкаФильтрыНеактивныеСкрытая.Картинка;
	Элементы.Фильтры.Отображение	= ОтображениеКнопки.Картинка;
	Элементы.Фильтры.Ширина 		= 4;
	Элементы.Фильтры.Заголовок 		= "";
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСтатусу(РежимОтображения)
	
	СписокВыбораСтатусов = Элементы.ОтборПоСтатусу.СписокВыбора;
	
	Если ЗначениеЗаполнено(СписокВыбораСтатусов) Тогда
		СписокВыбораСтатусов.Очистить();
	КонецЕсли;
	
	СписокЗначенийСтатусов = ОбработкаОбъект().СписокЗначенийСтатусов(РежимОтображения);
	
	Для Каждого Элемент Из СписокЗначенийСтатусов Цикл
	
		СписокВыбораСтатусов.Добавить(Элемент.Значение);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВидуПакета()
	
	СписокВыбораВидовПакета = Элементы.ОтборПоВидуПакета.СписокВыбора;
	
	Если Не ЗначениеЗаполнено(СписокВыбораВидовПакета) Тогда
		
		СписокЗначенийВидовПакета = ОбработкаОбъект().СписокЗначенийВидовПакета();
		
		Для Каждого Элемент Из СписокЗначенийВидовПакета Цикл
			СписокВыбораВидовПакета.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОбновитьСписок(Команда = Неопределено)
	
	Модуль_Платформа = Модуль_Платформа();
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().ОбменССервером;
	ДействиеМетрики		= "Обновить список";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	Если НЕ ИспользуетсяПодсистемаДиадок
		И ЗначениеЗаполнено(РежимОтображенияДокументов)
		И РежимОтображенияДокументов <> РежимыОтображения().ДляОтправки Тогда
		
		Модуль_Платформа.СформироватьИзвещенияОПолучении();
		
	КонецЕсли;
	
	Если НЕ ИспользуетсяПодсистемаДиадок
		И ЗначениеЗаполнено(РежимОтображенияДокументов)
		И (РежимОтображенияДокументов = РежимыОтображения().Исходящие
			ИЛИ РежимОтображенияДокументов = РежимыОтображения().Внутренние) Тогда
		
		Модуль_Платформа.СформироватьОтменуФиксацииГИСМТ();
		
	КонецЕсли;
	
	ОбновитьСписок();
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСкачатьОбновлениеНажатие(Элемент)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СкачатьОбновление;
	ДействиеМетрики		= "Скачать обновление";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьФормуОбновления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбновления() Экспорт
	
	ТекущаяВерсия	= МетодСервераБезКонтекста(Истина, "ОбработкаОбъект().ВерсияОбработки");
	НоваяВерсия		= ДанныеДляОбновленияМодуля.ОписаниеОбновленияМодуля.Версия;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НоваяВерсия",		НоваяВерсия);
	ПараметрыФормы.Вставить("ТекущаяВерсия",	ТекущаяВерсия);
	ПараметрыФормы.Вставить("ДанныеДляОбновленияМодуля", ДанныеДляОбновленияМодуля);
	
	мОткрытьФорму("ФормаОбновленияУправляемая", ПараметрыФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура НадписьОкончанияОплаченногоПериодаНажатие(Элемент)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().ОнлайнСчета;
	ДействиеМетрики		= "Оплатить счет";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	ОткрытьФормуСпискаОнлайнСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаОнлайнСчетов()
	
	Модуль_ЯдроНаКлиенте().ОнлайнСчета_ОткрытьФорму(ЭтаФорма);
	
КонецПроцедуры

// }	ОСНОВНЫЕ ДЕЙСТВИЯ

// {	ДОПОЛНИТЕЛЬНЫЕ ДЕЙСТВИЯ

&НаСервере
Процедура ЗаполнитьМенюДействий(РежимОтображенияДокументов)
	
	Ядро = Модуль_ЯдроНаСервере();
	
	РежимыОтображения = РежимыОтображения();
	
	РежимДляОтправки	= (РежимОтображенияДокументов = РежимыОтображения.ДляОтправки);
	РежимИсходящие		= (РежимОтображенияДокументов = РежимыОтображения.Исходящие);
	РежимВходящие		= (РежимОтображенияДокументов = РежимыОтображения.Входящие);
	РежимВнутренние		= (РежимОтображенияДокументов = РежимыОтображения.Внутренние);
	
	ОтключитьАнализ = Модуль_ЯдроНаСервере().ОбщиеНастройки_Прочитать("ОтключитьАнализДляВходящихДокументов");
	
	Элементы.ГруппаЗагрузитьСКомпьютера.Видимость		= РежимДляОтправки;
	Элементы.ВыполнитьПерезаполнениеПакета.Видимость 	= РежимДляОтправки И ИспользуетсяПодсистемаДиадок;
	Элементы.ВыполнитьПодписаниеИОтправку.Видимость		= РежимДляОтправки ИЛИ РежимИсходящие ИЛИ РежимВнутренние;
	Элементы.ОткрытьПомощникПоискаДокумента.Видимость = РежимДляОтправки;
	
	Если РежимВнутренние Тогда
		
		Элементы.ВыполнитьПодписатьВходящие.Заголовок = "Подписать входящий";
		Элементы.ВыполнитьОтказатьВПодписи.Заголовок = "Отказать в подписи";
		
	Иначе
		
		Элементы.ВыполнитьПодписатьВходящие.Заголовок = "Подписать";
		Элементы.ВыполнитьОтказатьВПодписи.Заголовок = "Отказать контрагенту в подписи";
			
	КонецЕсли;
	
	Элементы.ВыполнитьПередатьВПодразделение.Видимость	= НЕ РежимДляОтправки;
	Элементы.ВыполнитьСохранитьДокумент.Видимость		= НЕ РежимДляОтправки;
	Элементы.ВыполнитьПолучитьПечатнуюФорму.Видимость 	= НЕ РежимДляОтправки;
	Элементы.ГруппаОтборСтатус.Видимость				= НЕ РежимДляОтправки;
	
	Элементы.ВыполнитьПерезаполнитьИОтправить.Видимость	= РежимИсходящие;
	Элементы.ГруппаПереотправка.Видимость				= РежимИсходящие;
	
	Элементы.ГруппаПодписаниеВходящих.Видимость					= РежимВходящие ИЛИ РежимВнутренние;
	Элементы.ГруппаДействияВ1С.Видимость						= РежимВходящие;
	Элементы.ПоказыватьЗавершенные.Видимость					= РежимВходящие И ИспользуетсяПодсистемаДиадок;
	Элементы.ВыполнитьПометитьДокументыКакЗавершенные.Видимость	= РежимВходящие И ИспользуетсяПодсистемаДиадок;
	Элементы.ВыполнитьРасшифроватьДокументы.Видимость			= РежимВходящие И ИспользуетсяПодсистемаДиадок И НЕ ЕстьОграниченияПоТарифу;
	Элементы.ГруппаАнализИОбработка.Видимость					= РежимВходящие И ИспользуетсяПодсистемаДиадок И НЕ ОтключитьАнализ;
	
	Элементы.ГруппаАннулирование.Видимость = (РежимВходящие ИЛИ РежимИсходящие ИЛИ РежимВнутренние);
	
	ОбработкаОбъект().ЗаполнитьДополнительныеКнопкиИзПодключаемогоМодуля(ЭтаФорма, РежимОтображенияДокументов, Элементы.ДополнительныеДействия);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикПроизвольнойКнопки(Команда)
	
	ИмяКнопкиВПМ = СтрЗаменить(Команда.Имя, "НажатиеДополнительнойКнопки_", "");
	
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("ИмяФормы",                     ИмяТекущейФормы());
	ПараметрыПМ.Вставить("РежимОтображенияДокументов",	 РежимОтображенияДокументов);
	ПараметрыПМ.Вставить("ИмяКнопки",					 ИмяКнопкиВПМ);
	ПараметрыПМ.Вставить("ВыделенныеСтроки",			 ДанныеВыделенныхСтрокТЧ(Истина));
	
	НажатиеДополнительнойКнопки(ПараметрыПМ);
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеДополнительнойКнопки(ПараметрыПМ) Экспорт 
	
	// для совместимости со старыми ПМ добавим в ПараметрыПМ РежимОтображенияДокументов и ВыделенныеСтроки
	
	Если Не ПараметрыПМ.Свойство("РежимОтображенияДокументов") Тогда
		ПараметрыПМ.Вставить("РежимОтображенияДокументов", РежимОтображенияДокументов);
	КонецЕсли;
	
	Если Не ПараметрыПМ.Свойство("ВыделенныеСтроки") Тогда
		ПараметрыПМ.Вставить("ВыделенныеСтроки", ДанныеВыделенныхСтрокТЧ(Истина));
	КонецЕсли;
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.НажатиеДополнительнойКнопки(ПараметрыПМ);
	
КонецПроцедуры

// }	ДОПОЛНИТЕЛЬНЫЕ ДЕЙСТВИЯ


// {	МАССОВАЯ ОБРАБОТКА ДОКУМЕНТОВ

// { Создание документов

&НаКлиенте
Функция ИспользоватьФормуСозданияДокументов()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Результат = Ядро.ПодключаемыйМодуль_ИспользоватьФормуСозданияДокументов();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСоздатьДокументы(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СозданиеДокументов;
	ДействиеМетрики		= "Создать";
	
	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ();
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		ДействияЭДО().СоздатьДокумент,
		КатегорияМетрики,
		ДействиеМетрики,
		ЭтаФорма
	);
	
	ДополнительныеПараметры = Новый Структура;
	ПараметрыОбработки.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ИспользоватьФормуСозданияДокументов() Тогда
		ОбработчикСоздатьДокументы = "ПоказатьФормуСозданияДокументовУчета";
	Иначе
		ОбработчикСоздатьДокументы = "ОбработатьСоздатьДокументы";
	КонецЕсли;
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок(ОбработчикСоздатьДокументы, ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуСозданияДокументовУчета(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ПоказатьФормуСозданияДокументовУчета(ПараметрОповещения, ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСоздатьДокументы(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт 
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработатьСоздатьДокументы(ПараметрОповещения, ПараметрыОбработки);
	
КонецПроцедуры

// } Создание документов


// { Сопоставление документов

&НаКлиенте
Процедура ВыполнитьСопоставитьДокументы(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СопоставлениеДокументов;
	ДействиеМетрики		= "Сопоставить";

	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ();
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());

	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().СопоставитьДокумент, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьСопоставитьДокументы", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСопоставитьДокументы(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	ВыполнитьМассовуюОбработкуДанных("СопоставитьДокументы", ДанныеДляОбработки, Действие);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
КонецПроцедуры

// } Сопоставление документов


// { Анализ документов

&НаКлиенте
Процедура ВыполнитьАнализДокументов(Команда)
	
	КатегорияМетрики = Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики = "Выполнить анализ документов";
	
	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ(Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
			ДанныеДляОбработки,
			ДействияЭДО().АнализДокумента,
			КатегорияМетрики,
			ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьАнализДокументов", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАнализДокументов(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	
	ВыполнитьМассовуюОбработкуДанных("АнализДокументов", ДанныеДляОбработки, Действие);
		
КонецПроцедуры

// } Анализ документов


// { Анализ пакетов

&НаКлиенте
Процедура ВыполнитьАнализПакетов(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Выполнить анализ";
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрокТЧ(Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеВыделенныхСтрок.Количество());

	ВыбранныеПакеты = Новый Соответствие;
		
	Для Каждого СтрокаСписка Из ДанныеВыделенныхСтрок Цикл
		ВыбранныеПакеты.Вставить(СтрокаСписка.Пакет);
	КонецЦикла;
	
	ДанныеДляОбработки = Новый Массив;
	
	Для Каждого КлючЗначение Из ВыбранныеПакеты Цикл
		ДанныеДляОбработки.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().АнализПакета, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьАнализаПакетов", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАнализаПакетов(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;

	ВыполнитьМассовуюОбработкуДанных("АнализПакетов", ДанныеДляОбработки, Действие);
	
КонецПроцедуры

// } Анализ пакетов


// { Выполнить требуемые действия

&НаКлиенте
Процедура ВыполнитьТребуемоеДействие(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Выполнить действие в 1С";

	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ();
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());

	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().ВыполнитьДействие, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьТребуемоеДействие", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	ВыполнитьМассовуюОбработкуДанных("ТребуемоеДействие", ДанныеДляОбработки, Действие);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
КонецПроцедуры

// } Выполнить требуемые действия


// { Пометка документов завершенными

&НаКлиенте
Процедура ВыполнитьПометитьДокументыКакЗавершенные(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Пометить как завершенный";

	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ();
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());

	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().ПометитьКакЗавершенный, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПометитьДокументыКакЗавершенные", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПометитьДокументыКакЗавершенные(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	ОбновляемыеРеквизиты = Новый Структура;
	ОбновляемыеРеквизиты.Вставить("ТребуемоеДействиеВ1С", "");
	ОбновляемыеРеквизиты.Вставить("ТребуемоеДействиеВДД", "");
	ОбновляемыеРеквизиты.Вставить("АнализПроведен",		 Истина);
		
	ВыполнитьМассовуюОбработкуДанных("ПометитьДокументыКакЗавершенные", ДанныеДляОбработки, Действие, ОбновляемыеРеквизиты);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
КонецПроцедуры

// } Пометка документов завершенными


// { Расшифровка

&НаКлиенте
Процедура ВыполнитьРасшифроватьДокументы(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Расшифровать";

	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ();
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());

	Действие = ДействияЭДО().Расшифровать;
	
	ДействиеДоступно = ДействиеДоступно(Действие, КатегорияМетрики, ДействиеМетрики);
	
	Если ДействиеДоступно Тогда
		
		ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, Действие, КатегорияМетрики, ДействиеМетрики);
		
		ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьРасшифроватьДокументы", ПараметрыОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРасшифроватьДокументы(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	ВыполнитьМассовуюОбработкуДанных("РасшифроватьДокументы", ДанныеДляОбработки, Действие);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
КонецПроцедуры

// } Расшифровка


// { Сохранение документов на диск

&НаКлиенте
Процедура ВыполнитьСохранитьДокумент(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СкачиваниеДокументов;
	ДействиеМетрики		= "Скачать документы";

	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ(Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ПакетыДокументов, ДействияЭДО().СохранитьДокумент, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьСохранитьДокумент", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСохранитьДокумент(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	ВыполнитьМассовуюОбработкуДанных("СохранитьДокументы", ДанныеДляОбработки, Действие);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
КонецПроцедуры

// } Сохранение документов на диск


// { Получение печатных форм

&НаКлиенте
Процедура ВыполнитьПолучитьПечатнуюФорму(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории().СкачиваниеДокументов;
	ДействиеМетрики		= "Получить печатную форму";

	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ(Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());

	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().ПолучитьПечатнуюФорму, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПолучитьПечатнуюФорму", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучитьПечатнуюФорму(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		// Без прогресса обработки, т.к. используется ЗапуститьПриложение.
		Модуль_Платформа.ПолучитьПечатнуюФормуСервераДиадок(Документ);
	КонецЦикла;
	
КонецПроцедуры

// } Получение печатных форм


// { Передача в подразделение

&НаКлиенте
Процедура ВыполнитьПередатьВПодразделение(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Передать в подразделение";
	
	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ(Истина, Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().ПередатьВПодразделение, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПередатьВПодразделение", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПередатьВПодразделение(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработатьПередатьВПодразделение(ПараметрОповещения, ПараметрыОбработки);
	
КонецПроцедуры

// } Передача в подразделение


// { Согласование

&НаКлиенте
Процедура ВыполнитьПередатьНаСогласование(Команда)
	
	ВыполнитьДействиеПоМаршрутизации(ДействияЭДО().ПередатьНаСогласование);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПередатьНаПодпись(Команда)
	
	ВыполнитьДействиеПоМаршрутизации(ДействияЭДО().ПередатьНаПодпись);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПередатьПоМаршруту(Команда)
	
	ВыполнитьДействиеПоМаршрутизации(ДействияЭДО().ПередатьПоМаршруту);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСогласовать(Команда)
	
	ВыполнитьДействиеПоМаршрутизации(ДействияЭДО().Согласование);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтказатьВСогласовании(Команда)
	
	ВыполнитьДействиеПоМаршрутизации(ДействияЭДО().ОтказВСогласовании);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПоМаршрутизации(Действие)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= Метрика_НазваниеДействияМаршрутизации(Действие);
	
	Если РежимОтображенияДокументов = РежимыОтображения().ДляОтправки Тогда
		
		ДанныеДляОбработки	= ДанныеВыделенныхСтрокТЧ(Ложь);
		ДокументыОтправлены = Ложь;
		
	Иначе
		
		ДанныеДляОбработки	= ДанныеДокументовВыделенныхСтрокТЧ(, Истина);
		ДокументыОтправлены = Истина;
		
	КонецЕсли;
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, Действие, КатегорияМетрики, ДействиеМетрики);
	ПараметрыОбработки.Вставить("ДокументыОтправлены", ДокументыОтправлены);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьДействиеПоМаршрутизации", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДействиеПоМаршрутизации(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработатьДействиеПоМаршрутизации(ПараметрОповещения, ПараметрыОбработки);
	
КонецПроцедуры

// } Согласование


// { Аннулирование

&НаКлиенте
Процедура ВыполнитьАннулировать(Команда) Экспорт
	
	ВыполнитьДействиеПоАннулированию(ДействияЭДО().Аннулировать);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтказатьВАннулировании(Команда) Экспорт
	
	ВыполнитьДействиеПоАннулированию(ДействияЭДО().ОтказатьВАннулировании);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПоАннулированию(Действие)
	
	Модуль_Платформа = Модуль_Платформа();
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= Модуль_Платформа.Метрика_НазваниеДействияАннулирования(Действие);

	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ(, Истина);

	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	ДействияЭДО = ДействияЭДО();
	
	Если Действие = ДействияЭДО.Аннулировать Тогда
		
		ДействиеДоступно = ДействиеДоступно(Действие, КатегорияМетрики, ДействиеМетрики);
		
	Иначе
		
		ДействиеДоступно = ДействиеДоступноЧерезУниверсальноеСообщение(
			Действие,
			КатегорияМетрики,
			ДействиеМетрики,
			ДанныеДляОбработки);
		
	КонецЕсли;
	
	Если ДействиеДоступно Тогда
		
		ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, Действие, КатегорияМетрики, ДействиеМетрики);
		
		ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьДействиеПоАннулированию", ПараметрыОбработки);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДействиеПоАннулированию(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	ОбрабатываютсяДокументыНаОтправку = РежимОтображенияДокументов = РежимыОтображения().ДляОтправки;
	
	ПараметрыОбработки.Вставить("ОбрабатываютсяДокументыНаОтправку", ОбрабатываютсяДокументыНаОтправку);
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработкаАннулирования(ПараметрыОбработки);
	
КонецПроцедуры

// } Аннулирование


// { Отправка пакетов

&НаКлиенте
Процедура ВыполнитьПодписаниеИОтправку(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Подписать и отправить";
	
	ДанныеДляОбработки = ДанныеВыделенныхСтрокТЧ(Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());

	Действие = ДействияЭДО().ПодписатьИОтправить;
	
	ДействиеДоступно = ДействиеДоступно(Действие, КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
	
	Если ДействиеДоступно Тогда
		
		ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
			ДанныеДляОбработки,
			Действие,
			КатегорияМетрики,
			ДействиеМетрики
		);
		ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПакетыНаОтправку", ПараметрыОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПодписаниеИОтправкуГосключ(Команда)
	
	КатегорияМетрики = Неопределено;
	ДействиеМетрики = Неопределено;
	
	ДанныеДляОбработки = ДанныеВыделенныхСтрокТЧ(Истина);
	
	Действие = ДействияЭДО().ПодписатьИОтправитьГосключ;
	
	ДействиеДоступно = ДействиеДоступноГосключ(Действие, ДанныеДляОбработки);
	
	Если ДействиеДоступно Тогда
		
		ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
			ДанныеДляОбработки,
			Действие,
			КатегорияМетрики,
			ДействиеМетрики
		);
		ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПакетыНаОтправку", ПараметрыОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДействиеДоступно(Действие, КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки = Неопределено)
	
	Результат = Истина;
	
	Если Не ЕстьСертификаты Тогда
		
		ДействияЭДО = ДействияЭДО();
		
		Если ЗначениеЗаполнено(ДанныеДляОбработки) Тогда
			ТребуетсяСертификат = ТребуетсяПодписьДокументов(ДанныеДляОбработки);
		Иначе
			ТребуетсяСертификат = Истина;
		КонецЕсли;
		
		Если ТребуетсяСертификат Тогда
			
			Если Действие = ДействияЭДО.ПодписатьИОтправить
				ИЛИ Действие = ДействияЭДО.ПодписатьВходящий 
				ИЛИ Действие = ДействияЭДО.ОтказатьВПодписи Тогда
				
				ТекстСообщения = "Подписание недоступно под логином.
								 |Авторизуйтесь с помощью сертификата или передайте документ на подпись сотруднику c сертификатом.";
				
			ИначеЕсли Действие = ДействияЭДО.Аннулировать
				ИЛИ Действие = ДействияЭДО.ОтказатьВАннулировании Тогда 
				
				ТекстСообщения = "Аннулирование недоступно под логином.
								 |Авторизуйтесь с помощью сертификата.";
				
			ИначеЕсли Действие = ДействияЭДО.Расшифровать Тогда 
				
				ТекстСообщения = "Расшифровка документов недоступна под логином.
								 |Авторизуйтесь с помощью сертификата.";
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				
				Модуль_ЯдроНаКлиенте().Метрика_ДобавитьОшибку_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, ТекстСообщения);

				Сообщить(ТекстСообщения, СтатусСообщения.Информация);
				Результат = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДействиеДоступноГосключ(Действие, ДанныеДляОбработки = Неопределено)
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДействиеДоступноЧерезУниверсальноеСообщение(Действие, КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки)
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляОбработки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДействияЭДО = ДействияЭДО();
	
	Если Действие <> ДействияЭДО.ОтказатьВПодписи
		И Действие <> ДействияЭДО.ОтказатьВАннулировании Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Модуль_Платформа = Модуль_Платформа();
	
	ВыбранныеBoxId = Модуль_Платформа.BoxIdИзДокументов(ДанныеДляОбработки);
	
	ЯщикиБезПраваНаФормированиеУС = Новый Массив;
	
	Для Каждого BoxId Из ВыбранныеBoxId Цикл
		
		ФормироватьУС = Ядро.УС_ДоступноФормированиеУниверсальныхСообщений(BoxId);
		
		Если ФормироватьУС = Неопределено Тогда
			
			Результат = ДействиеДоступно(Действие, КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
			Возврат Результат;
			
		Иначе
			
			Результат = Результат ИЛИ ФормироватьУС;
			
			Если НЕ ФормироватьУС Тогда
				ЯщикиБезПраваНаФормированиеУС.Добавить(BoxId);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Результат Тогда
		ПоказатьПредупреждениеОбОтсутствииПравНаФормированиеУС(ЯщикиБезПраваНаФормированиеУС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПредупреждениеОбОтсутствииПравНаФормированиеУС(ЯщикиБезПраваНаФормированиеУС)

	Модуль_Платформа = Модуль_Платформа();
	
	ТекстHTML = Модуль_Платформа.HTML_ПредупреждениеОбОтсутствииПравНаФормированиеУС(ЯщикиБезПраваНаФормированиеУС);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ТекстСообщения", ТекстHTML);
	
	ОповещениеОЗакрытииФормы = Неопределено;
	
	ОткрытьФормуДиадокМодально(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы,
		ОповещениеОЗакрытииФормы,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
	
КонецПроцедуры

&НаКлиенте
Функция ТребуетсяПодписьДокументов(ВыбранныеДокументы)
	
	Результат = Ложь;
	
	Для Каждого ВыбранныйДокумент Из ВыбранныеДокументы Цикл
		Если Не ВыбранныйДокумент.Шаблон Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПакетыНаОтправку(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработатьПакетыНаОтправку(ПараметрОповещения, ПараметрыОбработки);
	
КонецПроцедуры

// } Отправка пакетов


// { Отправка готовых ответов

&НаКлиенте
Процедура ВыполнитьОтправитьГотовыеОтветы(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Ответить контрагенту";

	ДанныеДляОбработки	= ДанныеДокументовВыделенныхСтрокТЧ(, Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().ОтправитьОтвет, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьОтправкуГотовыхОтветов", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтправкуГотовыхОтветов(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	ДоступныеДанныеДляОбработки = Новый Массив;
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		Если ЗначениеЗаполнено(Документ.РезультатАнализа.ТребуемоеДействиеВДД) Тогда
			ДоступныеДанныеДляОбработки.Добавить(Документ);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоВыбранныхДокументов = ДанныеДляОбработки.Количество();
	КоличествоДоступныхДокументов = ДоступныеДанныеДляОбработки.Количество();
	
	Если КоличествоДоступныхДокументов = 0 Тогда
		Модуль_Платформа.ПоказатьПредупреждениеОНевозможностиВыполненияДействия(ПараметрыОбработки);
	Иначе
		
		Ядро = Модуль_ЯдроНаКлиенте();
		
		Если КоличествоВыбранныхДокументов > КоличествоДоступныхДокументов Тогда
			
			ПараметрыОбработки.ДанныеДляОбработки = ДоступныеДанныеДляОбработки;
			
			ОписаниеОповещенияЗавершения = НовыйОписаниеОповещения(
				"ОбработатьСогласиеОЧастичнойОтправкеГотовыхОтветов",
				ЭтаФорма,
				ПараметрыОбработки
			);
			
			Модуль_Платформа.ПоказатьВопросОЧастичномВыполненииДействия(ПараметрыОбработки, ОписаниеОповещенияЗавершения);
			
		Иначе
			
			ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДоступныеДанныеДляОбработки);
			
			ВыполнитьМассовуюОбработкуДанных("ОбработатьДокументыСПодписанием", ПакетыДокументов, Действие);
			
			Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(
				КатегорияМетрики,
				ДействиеМетрики,
				ДоступныеДанныеДляОбработки
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСогласиеОЧастичнойОтправкеГотовыхОтветов(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт 
	
	Если ПараметрОповещения = КодВозвратаДиалога.Да Тогда
		
		Действие			= ПараметрыОбработки.Действие;
		ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
		КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
		ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
		
		Ядро = Модуль_ЯдроНаКлиенте();
		
		ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
		
		ВыполнитьМассовуюОбработкуДанных("ОбработатьДокументыСПодписанием", ПакетыДокументов, Действие);
		
		Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
		
	ИначеЕсли ПараметрОповещения = КодВозвратаДиалога.Прервать Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.ОткрытьФормуСпискаОшибокЛок(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

// } Отправка готовых ответов


// { Подписать входящие

&НаКлиенте
Процедура ВыполнитьПодписатьВходящие(Команда)
	
	ВыполнитьПодписатьИлиОтказатьВходящие(ДействияЭДО().ПодписатьВходящий);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПодписатьИлиОтказатьВходящие(Действие)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= Метрика_НазваниеДействияПодписание(Действие);
	
	ДанныеДляОбработки = ДанныеДокументовВыделенныхСтрокТЧ(, Истина);

	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());

	ДействияЭДО = ДействияЭДО();
	
	Если Действие = ДействияЭДО.ПодписатьВходящий Тогда
		
		ДействиеДоступно = ДействиеДоступно(Действие, КатегорияМетрики, ДействиеМетрики);
		
	Иначе
		
		ДействиеДоступно = ДействиеДоступноЧерезУниверсальноеСообщение(
			Действие,
			КатегорияМетрики,
			ДействиеМетрики,
			ДанныеДляОбработки);
		
	КонецЕсли;
	
	Если ДействиеДоступно Тогда
		
		ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, Действие, КатегорияМетрики, ДействиеМетрики);
		
		ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПодписатьВходящие", ПараметрыОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодписатьВходящие(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	
	ДоступныеДанныеДляОбработки = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().Документы_ДоступныеДляПодписанияВходящие", ДанныеДляОбработки, Действие);
	
	КоличествоВыбранныхДокументов = ДанныеДляОбработки.Количество();
	КоличествоДоступныхДокументов = ДоступныеДанныеДляОбработки.Количество();
	
	Если КоличествоДоступныхДокументов = 0 Тогда
		Модуль_Платформа.ПоказатьПредупреждениеОНевозможностиВыполненияДействия(ПараметрыОбработки);
	Иначе
		
		Если КоличествоВыбранныхДокументов > КоличествоДоступныхДокументов Тогда
			
			ПараметрыОбработки.ДанныеДляОбработки = ДоступныеДанныеДляОбработки;
			
			ОписаниеОповещенияЗавершения = НовыйОписаниеОповещения("ОбработатьСогласиеОЧастичномПодписанииВходящих", ЭтаФорма, ПараметрыОбработки);
			Модуль_Платформа.ПоказатьВопросОЧастичномВыполненииДействия(ПараметрыОбработки, ОписаниеОповещенияЗавершения);
			
		Иначе
			
			Если Действие = ДействияЭДО().ПодписатьВходящий Тогда
				ЗапроситьДанныеДляОтветныхТитулов(, ПараметрыОбработки);
			Иначе
				ЗапроситьКомментарийДляОтказаВПодписи(, ПараметрыОбработки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСогласиеОЧастичномПодписанииВходящих(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт 
	
	Если ПараметрОповещения = КодВозвратаДиалога.Да Тогда
		
		Действие = ПараметрыОбработки.Действие;
		
		Если Действие = ДействияЭДО().ПодписатьВходящий Тогда
			ЗапроситьДанныеДляОтветныхТитулов(, ПараметрыОбработки);
		Иначе
			ЗапроситьКомментарийДляОтказаВПодписи(, ПараметрыОбработки);
		КонецЕсли;
		
	ИначеЕсли ПараметрОповещения = КодВозвратаДиалога.Прервать Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.ОткрытьФормуСпискаОшибокЛок(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьДанныеДляОтветныхТитулов(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	
	ДанныеДляПодписания = Ядро.Документы_ВидыДокументовДляПодписания(ДанныеДляОбработки);
	ПараметрыОбработки.Вставить("ДанныеДляПодписания", ДанныеДляПодписания);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДокумента", ТекущаяДата());
	ПараметрыФормы.Вставить("ГрупповоеДействие", ПараметрыОбработки.ГрупповоеДействие);
	
	Для Каждого КлючЗначение Из ДанныеДляПодписания Цикл 
		
		ВидДокумента = КлючЗначение.Значение;
		ТипКонтента = ВидДокумента.ТипКонтента;
		
		ТолькоАктыСРазногласиями = ВыбраныТолькоФормализованныеАктыСверокСРазногласиями(ДанныеДляОбработки, ТипКонтента);
		
		Если ТолькоАктыСРазногласиями Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("ИдентификаторЯщика",	ВидДокумента.BoxId);
		ПараметрыФормы.Вставить("ТипДокумента",	ВидДокумента.ТипДокумента);
		ПараметрыФормы.Вставить("ТипКонтента", 	ТипКонтента);
		ПараметрыФормы.Вставить("КонтрагентПоддерживаетМЧД"	, ПараметрыОбработки.КонтрагентПоддерживаетМЧД);
		
		ОписаниеОповещения = НовыйОписаниеОповещения("ЗапросДанныхДляОтветныхТитуловПослеЗакрытия", ЭтаФорма, ПараметрыОбработки);
		ОткрытьФормуДиадокМодально("ТитулПокупателяУправляемая", ЭтаФорма, ПараметрыФормы, ОписаниеОповещения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВыбраныТолькоФормализованныеАктыСверокСРазногласиями(ДанныеДляОбработки, ТипКонтента)
	
	Результат = Ложь;
	
	Если ЭтоФормализованныйАктСверки405(ТипКонтента) Тогда
		
		АктыСверок = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().Документы_ОпределитьНаличиеРазногласийВФормализованныхАктахСверок", ДанныеДляОбработки);
		АктыСРазногласиями = АктыСверок.АктыСРазногласиями;
		
		Если АктыСРазногласиями.Количество() > 0 Тогда
			ПоказатьСлужебноеСообщениеОНеобходимостиПодписатьАктыСверкиСРазногласиямиИзФормыДокументов();
			УдалитьАктыСверокСРазногласиямиИзДанныхДляОбработки(ДанныеДляОбработки, АктыСРазногласиями);
		КонецЕсли;
		
		Если АктыСверок.АктыБезРазногласий.Количество() = 0 Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УдалитьАктыСверокСРазногласиямиИзДанныхДляОбработки(ДанныеДляОбработки, АктыСРазногласиями)
	
	КлючиАктовСРазногласиями = Новый Массив;
	
	Для Каждого АктСРазногласиями Из АктыСРазногласиями Цикл
		КлючиАктовСРазногласиями.Добавить(АктСРазногласиями.Ключ);
	КонецЦикла;
	
	ИндексВМассиве = ДанныеДляОбработки.ВГраница();
	
	Пока ИндексВМассиве >= 0 Цикл
		
		ВыделенныйДокумент = ДанныеДляОбработки[ИндексВМассиве];
		
		Если НЕ КлючиАктовСРазногласиями.Найти(ВыделенныйДокумент.Ключ) = Неопределено Тогда
			ДанныеДляОбработки.Удалить(ИндексВМассиве);
		КонецЕсли;
		
		ИндексВМассиве = ИндексВМассиве - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросДанныхДляОтветныхТитуловПослеЗакрытия(ДанныеОтвета, ПараметрыОбработки) Экспорт
	
	Если ДанныеОтвета <> Неопределено Тогда
		
		ДанныеДляПодписания	= ПараметрыОбработки.ДанныеДляПодписания;
		
		ДопПараметры = ДанныеОтвета.ДополнительныеПараметры;
		
		BoxId			= ДопПараметры.BoxId;
		ТипДокумента	= ДопПараметры.ТипДокумента;
		ТипКонтента		= ДопПараметры.ТипКонтента;
		
		КлючШаблонаОтветногоТитула = КлючШаблонаОтветногоТитула(BoxId, ТипДокумента, ТипКонтента);
		
		ДанныеДляПодписания[КлючШаблонаОтветногоТитула].ДанныеОтвета = ДанныеОтвета;
		
		ВсеВидыТитуловЗаполнены = Истина;
		
		Для Каждого КлючЗначение Из ДанныеДляПодписания Цикл
			
			ОтветДляДокумента = КлючЗначение.Значение;
			
			Если НЕ ЗначениеЗаполнено(ОтветДляДокумента.ДанныеОтвета) Тогда
				ВсеВидыТитуловЗаполнены = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВсеВидыТитуловЗаполнены Тогда
		
			ЗаполнитьКонтентОтвета(ПараметрыОбработки);

			ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
			
			ДополнитьАктыСверкиДаннымиОтправителяАктаСверки(ДанныеДляОбработки, ПараметрыОбработки.Действие);
			
			КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
			ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
			
			Ядро = Модуль_ЯдроНаКлиенте();
			
			ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);

			ВыполнитьМассовуюОбработкуДанных("ОбработатьДокументыСПодписанием", ПакетыДокументов, ДействияЭДО().ОтправитьОтвет);
			
			Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);
			
			// + шх Калашников АН - 00-00020261: Сделать возможность массово подписывать документы в Диадоке
			Если шхРежимПодписания Тогда
				// Обновление интерфейса.
				Оповестить("ОбновитьМоиЗадачиИОповещения");
				Оповестить("СостояниеЗаявкиПриИзменении");
			КонецЕсли;
			// - шх Калашников АН - 00-00020261: Сделать возможность массово подписывать документы в Диадоке
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтентОтвета(ПараметрыОбработки)
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	ДанныеДляПодписания	= ПараметрыОбработки.ДанныеДляПодписания;
	ОтветЭДО			= ОтветыЭДО()[Действие];
	Модуль_Ядро			= Модуль_ЯдроНаКлиенте();
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		
		BoxId			= Документ.Идентификаторы.BoxId;
		ТипДокумента	= Документ.Тип.ТипДокумента;
		ТипКонтента		= Документ.Тип.ТипКонтента;
		
		Если Не Модуль_Ядро.Документы_ФормироватьОтветныйТитул(Документ) Тогда
			ТипКонтента = "";
		КонецЕсли;
		
		КлючШаблонаОтветногоТитула = КлючШаблонаОтветногоТитула(BoxId, ТипДокумента, ТипКонтента);
		
		ДанныеОтвета = ДанныеДляПодписания[КлючШаблонаОтветногоТитула].ДанныеОтвета;
		
		Если ЭтоФормализованныйАктСверки405(ТипКонтента) Тогда
			ДанныеОтвета = Модуль_Ядро.КопияКоллекцииЗначений(ДанныеОтвета);
		КонецЕсли;
		
		Документ.СлужебнаяИнформация.Вставить("КонтентОтвета", ДанныеОтвета);
		Документ.СлужебнаяИнформация.Вставить("КонтрактМЧД", ДанныеОтвета.ДополнительныеПараметры.КонтрактМЧД);
		Документ.РезультатАнализа.ТребуемоеДействиеВДД = ОтветЭДО;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция КлючШаблонаОтветногоТитула(BoxId, ТипДокумента, ТипКонтента)
	
	Возврат BoxId + "_" + ТипДокумента + "_" + ТипКонтента;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьАктыСверкиДаннымиОтправителяАктаСверки(ДанныеДляОбработки, Действие)
	
	Если Действие <> ДействияЭДО().ПодписатьВходящий Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		
		ТипКонтента = Документ.Тип.ТипКонтента;
		
		Если НЕ ЭтоФормализованныйАктСверки405(ТипКонтента) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтентОтвета = Документ.СлужебнаяИнформация.КонтентОтвета;
		
		IdentityInfoSender = КонтентОтвета.ReconciliationAct.IdentityInfoSender;
		
		МетодСервераБезКонтекста(Ложь, "Модуль_Ядро().Документы_ЗаполнитьХранилищеКонтента", Документ);
		
		IdentityInfoSender.BaseIdFile = СтрЗаменить(Документ.Метаданные.FileName, ".xml", "");
		IdentityInfoSender.DateFileInfoSender = Документ.СлужебнаяИнформация.Контент.DateCreateFile;
		IdentityInfoSender.TimeFileInfoSender = Документ.СлужебнаяИнформация.Контент.TimeCreateFile;
		IdentityInfoSender.SignSender = Документ.Документооборот.ХранилищеКонтента.Подпись.ДанныеПодписи;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСлужебноеСообщениеОНеобходимостиПодписатьАктыСверкиСРазногласиямиИзФормыДокументов()
	
	ТекстHTML = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().HTMLАктыСверокСРазногласиямиНеобходимоПодписыватьИзФормыДокумента");
	ЗаголовокФормыСообщения = НСтр("ru = 'Служебные сообщения'");
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОткрытьФормуHTMLСообщения(ТекстHTML, ЗаголовокФормыСообщения, ЭтаФорма);
	
КонецПроцедуры

// } Подписать входящие


// { Отказ в подписи входящих

&НаКлиенте
Процедура ВыполнитьОтказатьВПодписиВходящих(Команда)
	
	ВыполнитьПодписатьИлиОтказатьВходящие(ДействияЭДО().ОтказатьВПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьКомментарийДляОтказаВПодписи(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Модуль_Платформа = Модуль_Платформа();
	
	ВыбранныеBoxId = Модуль_Платформа.BoxIdИзДокументов(ПараметрыОбработки.ДанныеДляОбработки);
	
	Если ВыбранныеBoxId.Количество() = 1 Тогда
		
		BoxId = ВыбранныеBoxId[0];
		
		ФормироватьУС = Ядро.УС_ДоступноФормированиеУниверсальныхСообщений(BoxId);
		
		Если ФормироватьУС = Неопределено Тогда
			ПредставлениеПодписанта = Ядро.Подписант_ПредставлениеПодписанта(BoxId);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПредставлениеПодписанта"	, ПредставлениеПодписанта);
	ПараметрыФормы.Вставить("АдресЯщика"				, BoxId);
	ПараметрыФормы.Вставить("ГрупповоеДействие"			, ПараметрыОбработки.ГрупповоеДействие);
	ПараметрыФормы.Вставить("КонтрагентПоддерживаетМЧД"	, ПараметрыОбработки.КонтрагентПоддерживаетМЧД);
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ЗапросКомментарияДляОтказаВПодписиПослеЗакрытия", ЭтаФорма, ПараметрыОбработки);
	ОткрытьФормуДиадокМодально("ФормаОтветаПоДокументуУправляемая", ЭтаФорма, ПараметрыФормы, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросКомментарияДляОтказаВПодписиПослеЗакрытия(ДанныеОтвета, ПараметрыОбработки) Экспорт
	
	Если ДанныеОтвета <> Неопределено Тогда
		
		ЗаполнитьОтветДляОтказаВПодписи(ПараметрыОбработки, ДанныеОтвета);
		
		ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
		КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
		ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
		
		Ядро = Модуль_ЯдроНаКлиенте();
		
		ПакетыДокументов = Ядро.СгруппироватьДокументыПоПакетам(ДанныеДляОбработки);
		
		ВыполнитьМассовуюОбработкуДанных("ОбработатьДокументыСПодписанием", ПакетыДокументов, ДействияЭДО().ОтправитьОтвет);
		
		Ядро.Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки);

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтветДляОтказаВПодписи(ПараметрыОбработки, ДанныеОтвета)
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	
	ОтветЭДО = ОтветыЭДО()[Действие];
	
	Для Каждого Документ Из ДанныеДляОбработки Цикл
		
		Документ.СлужебнаяИнформация.Вставить("КонтентОтвета", ДанныеОтвета);
		Документ.РезультатАнализа.ТребуемоеДействиеВДД = ОтветЭДО; 
		
	КонецЦикла;
	
	КонтрактМЧД = СвойствоСтруктуры(ДанныеОтвета.ДополнительныеПараметры, "КонтрактМЧД");
	ДополнитьДокументыСведениямиМЧДНаКлиенте(ДанныеДляОбработки, КонтрактМЧД);
	
КонецПроцедуры

// } Отказ в подписи входящих


// { Перезаполнение

&НаКлиенте
Процедура ВыполнитьПерезаполнениеПакета(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Перезаполнить";

	ДанныеДляОбработки	= ДанныеВыделенныхСтрокТЧ(Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().ПерезаполнитьПакет, КатегорияМетрики, ДействиеМетрики);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПерезаполнениеПакетов", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПерезаполнениеПакетов(ПараметрОповещения = Неопределено, ПараметрыОбработки=Неопределено) Экспорт 
	
	Отказ = Ложь;
	
	Действие			= ПараметрыОбработки.Действие;
	ДанныеДляОбработки	= ПараметрыОбработки.ДанныеДляОбработки;
	КатегорияМетрики	= ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики		= ПараметрыОбработки.ДействиеМетрики;
	
	БылоПредыдущееДействие = ПараметрыОбработки.Свойство("ПредыдущееДействие");
	
	Если БылоПредыдущееДействие Тогда
	
		СписокОшибок = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().СписокОшибок");
		
		Если ЗначениеЗаполнено(СписокОшибок) Тогда
			
			Модуль_Платформа = Модуль_Платформа();
			Модуль_Платформа.ПоказатьОшибкиОбработкиДанных(Действие, ЭтаФорма, Истина);
			
			ОбновитьСписок();
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ДанныеДляПерезаполнения	= Новый Массив;
		Пакеты					= Новый Массив;
		
		Для Каждого СтрокаСписка Из ДанныеДляОбработки Цикл
			
			Если ЗначениеЗаполнено(СтрокаСписка.Пакет) Тогда
				Ключ = СтрокаСписка.Пакет;
			Иначе
				Ключ = СтрокаСписка.LetterId;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Ключ) Тогда
				
				Если Пакеты.Найти(Ключ) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Пакеты.Добавить(Ключ);
				
			КонецЕсли;
			
			ДанныеДляПерезаполнения.Добавить(СтрокаСписка);
			
		КонецЦикла;
		
		ВыполнитьМассовуюОбработкуДанных("ПерезаполнитьПакет", ДанныеДляПерезаполнения, Действие);
		
		Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_МассовоеДействиеПоДокументам(КатегорияМетрики, ДействиеМетрики, ДанныеДляПерезаполнения);

	КонецЕсли;
		
КонецПроцедуры

// } Перезаполнение


// { Перезаполнение и отправка

&НаКлиенте
Процедура ВыполнитьПерезаполнитьИОтправить(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииРежимаОтображения();
	ДействиеМетрики		= "Перезаполнить и отправить";
	
	ДанныеДляОбработки = ДанныеВыделенныхСтрокТЧ(Истина);
	
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, ДанныеДляОбработки.Количество());
	
	Если Не ЕстьСертификаты Тогда
		
		ТекстОшибки = "Подписание недоступно под логином. Авторизуйтесь с помощью сертификата.";
		
		Ядро = Модуль_ЯдроНаКлиенте();
		Ядро.Метрика_ДобавитьОшибку_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, ТекстОшибки);
		
		Сообщить(ТекстОшибки, СтатусСообщения.Информация);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, ДействияЭДО().ПереотправитьПакет, КатегорияМетрики, ДействиеМетрики);
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("ОбработатьПерезаполнитьИОтправитьПакеты", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПерезаполнитьИОтправитьПакеты(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт 
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ОбработчикЗапросаАннулированияПереотправляемыхПакетов", ЭтаФорма, ПараметрыОбработки);
	
	ТекстВопроса = "Запросить аннулирование ранее отправленных документов?";
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Да);
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет);
	
	КнопкаПоУмолчанию = КодВозвратаДиалога.Да;
	
	ПоказатьВопросПереопределенная(ОписаниеОповещения, ТекстВопроса, КнопкиВопроса, , КнопкаПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗапросаАннулированияПереотправляемыхПакетов(АннулироватьПредыдущийДокумент = Неопределено, ПараметрыОбработки) Экспорт 
	
	Если АннулироватьПредыдущийДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модуль_Платформа = Модуль_Платформа();
	
	ЗапроситьАннулирование = (АннулироватьПредыдущийДокумент = КодВозвратаДиалога.Да);
	ПараметрыОбработки.Вставить("ЗапроситьАннулирование", ЗапроситьАннулирование);
	
	ВыделенныеСтроки			= ДанныеВыделенныхСтрокТЧ(Истина);
	ДоступныеДляОбработкиСтроки	= МетодСервераБезКонтекста(Истина, "Модуль_Ядро().Документы_ДоступныеДляПерезаполненияИОтправки", ВыделенныеСтроки);
	
	КоличествоВыбранныхДокументов	= ВыделенныеСтроки.Количество();
	КоличествоДоступныхДокументов	= ДоступныеДляОбработкиСтроки.Количество();
	
	Если КоличествоДоступныхДокументов = 0 Тогда
		Модуль_Платформа.ПоказатьОшибкиОбработкиДанных("ПереотправитьПакет", ЭтаФорма, Истина);
	ИначеЕсли КоличествоВыбранныхДокументов > КоличествоДоступныхДокументов Тогда
		
		ПараметрыОбработки.ДанныеДляОбработки = ДоступныеДляОбработкиСтроки;
		
		ОписаниеОповещенияЗавершения = НовыйОписаниеОповещения("ОбработатьСогласиеОЧастичномПерезаполненииИОтправке", ЭтаФорма, ПараметрыОбработки);
		Модуль_Платформа.ПоказатьВопросОЧастичномВыполненииДействия(ПараметрыОбработки, ОписаниеОповещенияЗавершения);
		
	Иначе
		
		ОбработатьПерезаполнениеИОтправкуПакетов(ПараметрыОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСогласиеОЧастичномПерезаполненииИОтправке(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт
    
	Если ПараметрОповещения = КодВозвратаДиалога.Да Тогда
		ОбработатьПерезаполнениеИОтправкуПакетов(ПараметрыОбработки);
	ИначеЕсли ПараметрОповещения = КодВозвратаДиалога.Прервать Тогда
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.ОткрытьФормуСпискаОшибокЛок(ЭтаФорма);
	Иначе
		Возврат;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПерезаполнениеИОтправкуПакетов(ПараметрыОбработки)
	
	КатегорияМетрики = ПараметрыОбработки.КатегорияМетрики;
	ДействиеМетрики = ПараметрыОбработки.ДействиеМетрики;
	ДействияЭДО = ДействияЭДО();
	
	ПараметрыДляПереотправки = Новый_ПараметрыГрупповойОбработки(
			ПараметрыОбработки.ДанныеДляОбработки,
			ДействияЭДО.ПереотправитьПакет,
			КатегорияМетрики,
			ДействиеМетрики);
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
			"ОбработатьПерезаполнениеПакетов",
			ЭтаФорма,
			ПараметрыДляПереотправки);
	
	Если ПараметрыОбработки.ЗапроситьАннулирование Тогда
		
		ДанныеДляОбработки = ДокументыПакетовСтрокСписка(ПараметрыОбработки.ДанныеДляОбработки);
		
		ЗаполнитьИПроверитьМЧДпоУмолчаниюПередОтправкойДокументов(ДанныеДляОбработки);
		
		ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
				ДанныеДляОбработки,
				ДействияЭДО.Аннулировать,
				КатегорияМетрики,
				"Аннулировать");
		
		ПараметрыОбработки.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		
		ОбработатьДействиеПоАннулированию( , ПараметрыОбработки);
		
	Иначе
		
		ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

// } Перезаполнение и отправка


// { Обработка очереди задач

// BSLLS:NumberOfOptionalParams-off
// BSLLS:NumberOfParams-off
&НаКлиенте
Функция Новый_ПараметрыГрупповойОбработки(
	ДанныеДляОбработки,
	Действие,
	КатегорияМетрики,
	ДействиеМетрики,
	ФормаВыполнения = Неопределено,
	ИдентификаторЯщика = Неопределено,
	КонтрагентПоддерживаетМЧД = Истина,
	ВыполнениеИзФормыПакета = Ложь) Экспорт
	
	Если ФормаВыполнения = Неопределено Тогда
		ФормаВыполнения = ЭтаФорма;
	КонецЕсли;
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики,
		ФормаВыполнения,
		ИдентификаторЯщика,
		КонтрагентПоддерживаетМЧД,
		ВыполнениеИзФормыПакета,
		РежимОтображенияДокументов,
		ИдентификаторОсновнойФормы()
	);
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
		"ЗавершениеОбработкиДокументов",
		ЭтаФорма,
		Результат
	);
	
	Результат.ОписаниеОповещения = ОписаниеОповещения;
	
	Возврат Результат;
	
КонецФункции
// BSLLS:NumberOfOptionalParams-on
// BSLLS:NumberOfParams-on

&НаКлиенте
Процедура ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок(ИмяОбработчика, ПараметрыОбработки = Неопределено)
	
	ДанныеДляОбработки = ПараметрыОбработки.ДанныеДляОбработки;
	КоличествоСтрок = ДанныеДляОбработки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		
		ПоказатьПредупреждениеНеВыбраноНиОднойСтроки();
		
	ИначеЕсли КоличествоСтрок = 1
		И ЕстьОграниченияПоТарифу Тогда
		
		ПараметрыОбработки.ГрупповоеДействие = Истина;
		
		ОписаниеГрупповойОперации = Новый_ОписаниеГрупповойОперации(
				ИмяОбработчика,
				ПараметрыОбработки);
		
		ОбработчикСогласияНаГрупповуюОбработкуВыделенныхСтрок(
			КодВозвратаДиалога.Да,
			ОписаниеГрупповойОперации);
		
	Иначе
		
		Модуль_Ядро = Модуль_ЯдроНаКлиенте();
		
		ОбрабатываемаяСущность = ОбрабатываемаяСущность();
		ШаблонВопроса = "Вы собираетесь выполнить групповые действия. %1ов к обработке %2. Продолжить?";
		ТекстВопроса = Модуль_Ядро.Общее_ПодставитьПараметрыВСтроку(
				ШаблонВопроса,
				ОбрабатываемаяСущность,
				КоличествоСтрок);
		
		ПараметрыОбработки.ГрупповоеДействие = Истина;
		
		ОписаниеГрупповойОперации = Новый_ОписаниеГрупповойОперации(
				ИмяОбработчика,
				ПараметрыОбработки);
		
		ОписаниеОповещения = НовыйОписаниеОповещения(
				"ОбработчикСогласияНаГрупповуюОбработкуВыделенныхСтрок",
				ЭтаФорма,
				ОписаниеГрупповойОперации);
		
		ПоказатьВопросПереопределенная(
			ОписаниеОповещения,
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеНеВыбраноНиОднойСтроки()
	
	ОбрабатываемаяСущность = ОбрабатываемаяСущность();
	ТекстПредупреждения = "Выберите хотя бы один " + НРег(ОбрабатываемаяСущность);
	
	ПоказатьПредупреждениеПереопределенная(, ТекстПредупреждения);
	
КонецПроцедуры

// Обработчик согласия на групповое действие
//
// Параметры:
//  Ответ - КодВозвратаДиалога - выбор пользователя в методе ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок
//  ОписаниеГрупповойОперации - Структура - См. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура ОбработчикСогласияНаГрупповуюОбработкуВыделенныхСтрок(Ответ, ОписаниеГрупповойОперации) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Нет Тогда
		ПроверитьПараметрыГрупповойОперацииИВыполнитьОбработчик(ОписаниеГрупповойОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Новый_ОписаниеГрупповойОперации(ИмяОбработчика, ПараметрыОбработки) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИмяОбработчикаГрупповойОперации"	, ИмяОбработчика);
	Результат.Вставить("ПараметрыГрупповойОбработки"		, ПараметрыОбработки);
	
	Возврат Результат;
	
КонецФункции

// Проверяет данные перед выполнением групповой операции 
//	1. Проверяет сертификаты на КЭП
//	2. Проверяет данные МЧД
//	3. Выполняет обработчик групповой операции
//
// Параметры:
//	ОписаниеГрупповойОперации - Структура - см. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура ПроверитьПараметрыГрупповойОперацииИВыполнитьОбработчик(ОписаниеГрупповойОперации) 
	
	КЭП_НачатьПроверкуДанныхГрупповойОперации(ОписаниеГрупповойОперации);
	
КонецПроцедуры

// Непосредственно выполняет обработчик групповой операции после выполнения проверок и всех интерактивных действий
//
// Параметры:
//  Результат - Произвольный - Не используется
//	ОписаниеГрупповойОперации - Структура - см. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура Обработчик_ВыполнитьГрупповуюОперациюПослеЗавершенияПроверок(Результат, ОписаниеГрупповойОперации) Экспорт
	
	ОписаниеОповещенияОбработчика = НовыйОписаниеОповещения(
		ОписаниеГрупповойОперации.ИмяОбработчикаГрупповойОперации, 
		ЭтаФорма, 
		ОписаниеГрупповойОперации.ПараметрыГрупповойОбработки
	);
	
	ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещенияОбработчика, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМассовуюОбработкуДанных(ИмяОбработчика,
											ДанныеДляОбработки,
											Действие,
											ДополнительныеПараметры = Неопределено
	)
	
	ОбрабатываютсяДокументыНаОтправку = РежимОтображенияДокументов = РежимыОтображения().ДляОтправки;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Действие", Действие);
	ПараметрыОповещения.Вставить("РежимОтображенияДокументов", РежимОтображенияДокументов);
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
		"ЗавершениеОбработкиДокументов",
		ЭтаФорма,
		ПараметрыОповещения
	);
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ВыполнитьМассовуюОбработкуДанных(
		ИмяОбработчика,
		ДанныеДляОбработки,
		Действие,
		ДополнительныеПараметры,
		ОписаниеОповещения,
		ОбрабатываютсяДокументыНаОтправку
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбработкиДокументов(ПараметрОповещения, ПараметрыОбработки = Неопределено) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ЗавершениеОбработкиДокументов(ПараметрыОбработки.Действие, ЭтаФорма);
	
	Если ПараметрыОбработки.РежимОтображенияДокументов = ЭтаФорма.РежимОтображенияДокументов Тогда
		ОбновитьСписок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОчередьЗадач_ПричинаОшибки(ИнформацияОбОшибке)
	
	Результат		= ИнформацияОбОшибке;
	ПричинаОшибки	= ИнформацияОбОшибке;
	
	Пока ПричинаОшибки <> Неопределено Цикл
		
		ПричинаОшибки = ПричинаОшибки.Причина;
		
		Если ПричинаОшибки <> Неопределено И ПричинаОшибки.НомерСтроки > 0 Тогда
			Результат = ПричинаОшибки;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПредставлениеДействияЭДО(Действие)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ПредставленияДействийЭДО = Ядро.Перечисление_ПредставленияДействийЭДО();
	Результат = ПредставленияДействийЭДО[Действие];
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = "Обработка";
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбрабатываемаяСущность()
	
	РежимыОтображения = РежимыОтображения();
	
	Если РежимОтображенияДокументов = РежимыОтображения.ДляОтправки Тогда
		Результат = "Пакет";
	Иначе
		Результат = "Документ";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// } Обработка очереди задач

// }	МАССОВАЯ ОБРАБОТКА ДОКУМЕНТОВ


// {	ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Функция РежимыОтображения() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДляОтправки",	"ОтправкаПакетов");
	Результат.Вставить("Исходящие",		"ОтправленныеДокументы");
	Результат.Вставить("Входящие",		"ПолученныеДокументы");
	Результат.Вставить("Внутренние",	"ВнутренниеДокументы");
	
	Возврат Результат
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокФормы() // ШХ
	
	ОбработкаОбъект = ОбработкаОбъект();
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	НомерРелиза = ОбработкаОбъект.ПолнаяВерсияОбработки();
	РежимОтладкиВключен = ОбработкаОбъект.РежимОтладкиВключен();
	РежимЛогированияВключен = Модуль_Ядро.РежимЛогированияВключен();
	
	СтрокаИмяМодуля = "Контур.Диадок / ";
	СтрокаНомерРелиза = Строка(НомерРелиза);
	СтрокаИмяТарифа = ?(ЕстьОграниченияПоТарифу, "Тариф ""Стартовый"" / ", "");
	СтрокаРежимОтладки = ?(РежимОтладкиВключен, " (РЕЖИМ ОТЛАДКИ)", "");
	СтрокаРежимЛогирования = ?(РежимЛогированияВключен, " (РЕЖИМ ЛОГИРОВАНИЯ)", "");
	
	НовыйЗаголовок = СтрокаИмяМодуля
		+ СтрокаИмяТарифа
		+ СтрокаНомерРелиза
		+ СтрокаРежимОтладки
		+ СтрокаРежимЛогирования;
	
	ЭтаФорма.Заголовок = НовыйЗаголовок + ?(ЭтотОбъект.шхРежимОткрытияERP = "", "", " [подписание/просмотр]");
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьЗаголовокКнопкиАвторизацииПоУмолчанию()
	
	ЗаголовокПоУмолчанию = "Авторизация ...";
	Элементы.ПредставлениеПользователя.Заголовок = ЗаголовокПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокКнопкиПериода()
	
	Элементы.ВыбратьПериод.Заголовок = ЗаголовокКнопкиВыбораПериода();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаголовокКнопкиВыбораПериода()
	
	РежимыОтображения = РежимыОтображения();
	
	Если РежимОтображенияДокументов = РежимыОтображения.ДляОтправки Тогда
		ТекстРежимОтбораПоПериоду = "документа";
	ИначеЕсли РежимОтображенияДокументов = РежимыОтображения.Исходящие Тогда
		ТекстРежимОтбораПоПериоду = ?(НастройкаВыбораПериода.РежимОтбораПоПериоду = "ПоДатеДокумента", "документа", "отправки");
	Иначе
		ТекстРежимОтбораПоПериоду = ?(НастройкаВыбораПериода.РежимОтбораПоПериоду = "ПоДатеДокумента", "документа", "получения");
	КонецЕсли;
	
	ТекстРежимОтбораПоПериоду = "по дате " + ТекстРежимОтбораПоПериоду;
	
	Результат = СтруктураПериода().Представление + " " + "(" + ТекстРежимОтбораПоПериоду + ")";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтруктураПериода()
	
	ДатаНачала		 = НастройкаВыбораПериода.ДатаНачала;
	ДатаОкончания	 = НастройкаВыбораПериода.ДатаОкончания;
	
	Если ДатаОкончания < ДатаНачала Тогда
		ДатаОкончания = '00010101';
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецДня(ДатаОкончания);
	КонецЕсли;
	
	Представление = ПредставлениеПериода(ДатаНачала, ДатаОкончания);
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Представление = "<период не установлен>";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецДня('39990101');
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаНачала",	ДатаНачала);
	Результат.Вставить("ДатаОкончания",	ДатаОкончания);
	Результат.Вставить("Представление",	Представление);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписок(НовыйРежимОтображенияДокументов = Неопределено, ОтборПоПакету = Неопределено, КоличествоДокументов = 0) Экспорт
	
	Состояние("Обновление списка документов...");
	
	ФормаПрогресса = Форма_ПрогрессВыполнения();
	
	Если ФормаПрогресса.Открыта() И ФормаПрогресса.ПрогрессВыполнен() Тогда
		ФормаПрогресса.Закрыть();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НовыйРежимОтображенияДокументов)
		И НЕ ЗначениеЗаполнено(РежимОтображенияДокументов) Тогда
		
		Если ЗначениеЗаполнено(РежимОтображенияПриЗапуске) Тогда
			НовыйРежимОтображенияДокументов = РежимОтображенияПриЗапуске;
		Иначе
			НовыйРежимОтображенияДокументов = РежимыОтображения().ДляОтправки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтборПоПакету) Тогда
		СписокДокументов.Очистить();
	КонецЕсли;
	
	КатегорияМетрики = Метрика_НазваниеКатегорийПостроенияСписка(НовыйРежимОтображенияДокументов);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрика_НачатьЗамер_СУчетомЗаполненияКонтекстаПоКонтекстуОднойЗаписью(КатегорияМетрики);
	
	Отказ = Ложь;
	
	Попытка
	
		ПараметрыОбновленияСписка = ПараметрыОбновленияСпискаДокументов(НовыйРежимОтображенияДокументов, ОтборПоПакету);
		ОбновитьСписокНаСервере(ПараметрыОбновленияСписка);
		
	Исключение
	
		Отказ = Истина;
		Ошибка = ИнформацияОбОшибке();
		
		ТекстОшибкиРасширенный = "";
		
		Если Ошибка.Причина <> Неопределено Тогда
			Если Найти(Ошибка.Причина.Описание, "недостаточно прав") > 0 Тогда
				
				ТекстОшибкиРасширенный = Символы.ПС + "У пользователя недостаточно прав на исполнение операции над базой данных.";
				
			ИначеЕсли Ошибка.Причина.Причина <> Неопределено
				И Найти(Ошибка.Причина.Причина.Описание, "недостаточно прав") > 0 Тогда
				
				ТекстОшибкиРасширенный = Символы.ПС + "У пользователя недостаточно прав на исполнение операции над базой данных.";
				
			КонецЕсли;
		КонецЕсли;
		
		ТекстПредупреждения = НСтр("ru = 'При заполнении списка документов возникли ошибки."
		    + ТекстОшибкиРасширенный + "
			|Для просмотра подробной информации об ошибке перейдите в журнал регистрации 1С или обратитесь к техническому специалисту'");
		
		ПоказатьПредупреждениеПереопределенная(, ТекстПредупреждения);
		
	КонецПопытки;
	
	КоличествоДокументов = ПолучитьКоличествоДокументов(ОтборПоПакету);
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Количество документов", КоличествоДокументов);
	ДопПеременные.Вставить("Отказ", Отказ);
	
	Ядро.Метрика_ЗавершитьЗамер_СУчетомЗаполненияКонтекстаПоКонтекстуОднойЗаписью(КатегорияМетрики, ДопПеременные);
	
	УстановитьЗаголовокКнопкиПериода();
	
	УстановитьТекущуюСтрокуСпискаДокументов(); 
	
	ДействиеМетрики = РежимОтображенияДокументов; 
	
	Если НЕ ЗначениеЗаполнено(ДействиеМетрики) Тогда
		ДействиеМетрики = РежимыОтображения().ДляОтправки;
	КонецЕсли;
	
	Если Отказ Тогда
		
		ВидОперации		 = НСтр("ru = 'Обновление списка документов'");
		ТекстСообщения	 = НСтр("ru = 'Не удалось обновить список документов'");
		ТекстОшибки		 = КраткоеПредставлениеОшибки(Ошибка);
		
		_ОбработатьОшибку(
			ВидОперации,
			Ошибка,
			ТекстСообщения
		);
		
		Ядро.Метрика_ДобавитьОшибку_СУчетомЗаполненияКонтекста(КатегорияМетрики, ДействиеМетрики, ТекстОшибки);
		
	КонецЕсли;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Наименование колонок", Метрика_КолонкиФормыСписка());
	ПредставлениеМетрики = Метрика_НазваниеФормы();
	
	Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики, , ДопПеременные, ПредставлениеМетрики);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоДокументов(ОтборПоПакету)
	
	Результат = 1;
	
	Если Не ЗначениеЗаполнено(ОтборПоПакету) Тогда
		АдресСпискаДокументов = Объект.ОбщийКонтекстКлиентСервер.АдресКэшаСпискаДокументов;
		Результат = ПолучитьКоличествоДокументовИзКэша(АдресСпискаДокументов);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоличествоДокументовИзКэша(АдресСпискаДокументов)
	
	Результат = 0;
	
	КэшСпискаДокументовЛокальный = ПолучитьИзВременногоХранилища(АдресСпискаДокументов);
	
	Если ЗначениеЗаполнено(КэшСпискаДокументовЛокальный) Тогда
		
		Результат = КэшСпискаДокументовЛокальный.Количество();
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте 
Функция ПараметрыОбновленияСпискаДокументов(НовыйРежимОтображенияДокументов, ОтборПоПакету = Неопределено)
// ШХ
// Добавлен "РежиПользователя"

	Результат = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().Контракт_ПараметрыПолученияСпискаДокументов");
	
	СтруктураПериода = СтруктураПериода();
	
	Если ЗначениеЗаполнено(НовыйРежимОтображенияДокументов) Тогда
		РежимДляОбновления = НовыйРежимОтображенияДокументов;
	Иначе
		РежимДляОбновления = РежимОтображенияДокументов;
	КонецЕсли;
	
	ВыбранныеВидыДокументов = ВыбранныеВидыДокументовНаСервере(РежимДляОбновления);
	
	Результат.Режим							 = РежимДляОбновления;
	Результат.НачалоПериода					 = СтруктураПериода.ДатаНачала;
	Результат.КонецПериода					 = СтруктураПериода.ДатаОкончания;
	Результат.МассивВыбранныхВидов			 = ВыбранныеВидыДокументов;
	Результат.ПоказыватьЗавершенные			 = ПоказыватьЗавершенные;
	Результат.РежимОтбораПоПериоду			 = НастройкаВыбораПериода.РежимОтбораПоПериоду;
	Результат.ВключитьОтборПоОрганизации	 = ВключитьОтборПоОрганизации;
	Результат.ВключитьОтборПоКонтрагенту	 = ВключитьОтборПоКонтрагенту;
	Результат.ВключитьОтборПоСтатусу		 = ВключитьОтборПоСтатусу;
	Результат.ОтборПоПакету					 = ОтборПоПакету;
	
	Результат.ОтборПоСтатусу				 = ?(ВключитьОтборПоСтатусу, ОтборПоСтатусу, Неопределено);
	
	Если ВключитьОтборПоКонтрагенту Тогда
		Результат.ОтборПоКонтрагенту		 = ?(ЗначениеЗаполнено(ОтборПоКонтрагенту), ОтборПоКонтрагенту, Неопределено);
	КонецЕсли;
	Если ВключитьОтборПоОрганизации Тогда
		Результат.ОтборПоОрганизации		 = ?(ЗначениеЗаполнено(ОтборПоОрганизации), ОтборПоОрганизации, Неопределено);
	КонецЕсли;
	// + шх Калашников АН - 00-00020261
	Результат.РежимПользователя = ЭтотОбъект.шхРежимОткрытияERP;
	Если Результат.РежимПользователя = "ПросмотрДокумента" Тогда 
		Результат.ОтборПоДокументу1С = ЭтотОбъект.шхТекущиеДокументы;
	КонецЕсли;
	// - шх Калашников АН - 00-00020261
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыбранныеВидыДокументовНаСервере(РежимДляОбновления)
	
	Результат = Новый Массив;
	
	Если РежимДляОбновления = РежимыОтображения().ДляОтправки Тогда
		
		Если ВключитьОтборПоВидуПакета Тогда
			Результат.Добавить(ОтборПоВидуПакета);
		Иначе
			
			МассивВидовПакетов = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().МассивВидовПакетов");
			
			Для Каждого ВидПакета Из МассивВидовПакетов Цикл
				Результат.Добавить(ВидПакета.Идентификатор);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокНаСервере(Знач ПараметрыОбновленияСписка)
	
	РежимОтображенияДокументов = ПараметрыОбновленияСписка.Режим;
	РежимОтображенияПриЗапуске = РежимОтображенияДокументов;
	
	ПереключитьВидимостьКолонок(РежимОтображенияДокументов);
	
	УстановитьВидимостьОтбораПоСтатусу(РежимОтображенияДокументов);
	УстановитьВидимостьОтбораПоВидуПакета(РежимОтображенияДокументов);
	УстановитьВидимостьОтбораПоКонтрагенту(РежимОтображенияДокументов);
	
	ЗаполнитьМенюДействий(РежимОтображенияДокументов);
	УстановитьЦветКнопокПереключенияРежимов();
	НастроитьДополнительныеКолонки();
	НастроитьФормуПриСменеРежима();
		
	МенеджерМодуля = ОбработкаОбъект();
	
	МенеджерМодуля.СписокДокументов_ОбновитьКэш(ПараметрыОбновленияСписка, СписокДокументов);
	МенеджерМодуля.ТаблицаОтборов_УстановитьОтборыСпискаДокументов(РежимОтображенияДокументов);
	
	ОбновитьСтраницуСпискаДокументовНаСервере();
	
	КоличествоУстановленныхФильтров = КоличествоУстановленныхФильтров();
	УстановитьЗаголовокКнопкиФильтров(КоличествоУстановленныхФильтров);
	
	ПроверитьСобытияЛентыКонтрагентов();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриСменеРежима()
	
	Если РежимОтображенияДокументов = РежимыОтображения().ДляОтправки Тогда
		
		ЗаголовокКолонкиОшибок = "Ошибки";
		
		РазворачиватьПакетыНаОтправкуПоДокументам = Модуль_ЯдроНаСервере().ОбщиеНастройки_Прочитать("РазворачиватьПакетыНаОтправкуПоДокументам");
		
		Если РазворачиватьПакетыНаОтправкуПоДокументам Тогда
			ЗаголовокКолонкиСодержимоеПакета = "Документ";
		Иначе
			ЗаголовокКолонкиСодержимоеПакета = "Пакет документов";
		КонецЕсли;
		
		Элементы.СписокДокументовСодержимоеПакета.Заголовок = ЗаголовокКолонкиСодержимоеПакета;
		
	Иначе
		ЗаголовокКолонкиОшибок = "Ошибки проверки";
	КонецЕсли;
	
	Элементы.СписокДокументовОшибкиПроверкиТекст.Заголовок = ЗаголовокКолонкиОшибок;
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьВидимостьКолонок(РежимОтображенияДокументов)
	
	ОтключитьВидимостьКолонок();

	ПереключаемыеКолонки = ОбработкаОбъект().МассивПереключаемыхКолонокСписка(РежимОтображенияДокументов);
	
	Для Каждого КолонкаФормы Из Элементы.СписокДокументов.ПодчиненныеЭлементы Цикл
		
		Для Каждого КолонкаТаблицы Из ПереключаемыеКолонки Цикл
			
			Если КолонкаФормы.Имя = "СписокДокументов" + КолонкаТаблицы Тогда
				
				КолонкаФормы.Видимость = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВидимостьКолонок()
	
	МассивНеизменныхКолонок = ОбработкаОбъект().МассивНеизменныхКолонок();
	
	Для Каждого КолонкаФормы Из Элементы.СписокДокументов.ПодчиненныеЭлементы Цикл
		
		ИмяКолонки = СтрЗаменить(КолонкаФормы.Имя, "СписокДокументов", "");
		
		Если МассивНеизменныхКолонок.Найти(ИмяКолонки) = Неопределено Тогда
			КолонкаФормы.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНастройкуИспользованияПлагиновПослеАвторизации()
	
	МодульЯдро = Модуль_ЯдроНаСервере();
	
	ТекущаяНастройкаИспользованияПлагинов = МодульЯдро.ОбщиеНастройки_Прочитать("ИспользоватьПлагины");
	Объект.ОбщийКонтекстКлиентСервер.ИспользоватьПлагины = ТекущаяНастройкаИспользованияПлагинов;
	
	КнопкаОткрытьСписокПлагинов = Элементы.ОткрытьСписокПлагинов;
	КнопкаОткрытьСписокПлагинов.Видимость = ТекущаяНастройкаИспользованияПлагинов;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветКнопокПереключенияРежимов()
	
	ЦветАктивнойКнопки		= ЦветаСтиля.ЦветФонаКнопки;
	ЦветНеактивнойКнопки	= Новый Цвет(230, 230, 230);
	
	Элементы.ВыбратьРежимДляОтправки.ЦветФона	= ЦветНеактивнойКнопки;
	Элементы.ВыбратьРежимИсходящие.ЦветФона		= ЦветНеактивнойКнопки;
	Элементы.ВыбратьРежимВходящие.ЦветФона		= ЦветНеактивнойКнопки;
	Элементы.ВыбратьРежимВнутренние.ЦветФона	= ЦветНеактивнойКнопки;
	
	РежимыОтображения = РежимыОтображения();
	
	Если РежимОтображенияДокументов = РежимыОтображения.ДляОтправки Тогда
		
		Элементы.ВыбратьРежимДляОтправки.ЦветФона = ЦветАктивнойКнопки;
		
	ИначеЕсли РежимОтображенияДокументов = РежимыОтображения.Исходящие Тогда
		
		Элементы.ВыбратьРежимИсходящие.ЦветФона = ЦветАктивнойКнопки;
		
	ИначеЕсли РежимОтображенияДокументов = РежимыОтображения.Входящие Тогда
		
		Элементы.ВыбратьРежимВходящие.ЦветФона = ЦветАктивнойКнопки;
		
	ИначеЕсли РежимОтображенияДокументов = РежимыОтображения.Внутренние Тогда
		
		Элементы.ВыбратьРежимВнутренние.ЦветФона = ЦветАктивнойКнопки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДополнительныеКолонки()
	
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("Режим", РежимОтображенияДокументов);
	НастройкиДопКолонок = Модуль_ЯдроНаСервере().ПодключаемыйМодуль_ОбработатьСобытие("ПолучитьНастройкиДополнительныхКолонокСпискаДокументов", ПараметрыПМ);
	
	Для Сч = 1 По 5 Цикл
		Элементы["СписокДокументовДопРеквизит" + Формат(Сч, "ЧГ=0")].Видимость = Ложь;
	КонецЦикла;
	
	Если НастройкиДопКолонок <> Неопределено Тогда
		Для Сч = 0 По НастройкиДопКолонок.Количество() - 1 Цикл
			
			Если Сч > 4 Тогда
				ВызватьИсключение "Допускается не более 5 дополнительных колонок в списке документов";
			КонецЕсли;
			
			ТекКолонка = Элементы["СписокДокументовДопРеквизит" + Формат(Сч + 1, "ЧГ=0")];
			ТекКолонка.Заголовок = НастройкиДопКолонок[Сч].Заголовок;
			ТекКолонка.Видимость = Истина;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтраницуСпискаДокументов()
	
	СписокДокументов.Очистить();
	ОбновитьСтраницуСпискаДокументовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтраницуСпискаДокументовНаСервере() Экспорт
	
	РежимОтображенияДокументовДляОтправки = (РежимОтображенияДокументов = РежимыОтображения().ДляОтправки);
	
	ПараметрыСтраницы	 = ОбработкаОбъект().СписокДокументов_ЗагрузитьСтраницу(НомерСтраницы, РазмерСтраницы, РежимОтображенияДокументовДляОтправки, СписокДокументов);
	НомерСтраницы		 = ПараметрыСтраницы.НомерСтраницы;
	КоличествоСтраниц	 = ПараметрыСтраницы.КоличествоСтраниц;
	
	ОбновитьЗаголовокНомерСтраницы();
	ОбновитьКнопкиНавигацииПоСтраницам();
	
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("Режим", РежимОтображенияДокументов);
	НастройкиДопКолонок = Модуль_ЯдроНаСервере().ПодключаемыйМодуль_ОбработатьСобытие("ПолучитьНастройкиДополнительныхКолонокСпискаДокументов", ПараметрыПМ);
	
	Для Сч = 1 По 5 Цикл
		Элементы["СписокДокументовДопРеквизит" + Сч].ТекстПодвала = "";
	КонецЦикла;
		
	Если ТипЗнч(НастройкиДопКолонок) = Тип("Массив") Тогда
		
		ОписаниеЧисла = Новый ОписаниеТипов("Число");
		Для Сч = 0 По НастройкиДопКолонок.ВГраница() Цикл
			Если НастройкиДопКолонок[Сч].Тип = ОписаниеЧисла Тогда
				ИмяКолонки = "ДопРеквизит" + (Сч + 1);
				Элементы["СписокДокументов" + ИмяКолонки].ТекстПодвала = СписокДокументов.Итог(ИмяКолонки);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ИтогСписокДокументовСуммаДокумента = СписокДокументов.Итог("СуммаДокумента");
	
КонецПроцедуры

&НаКлиенте
Функция ВыделенныеСтрокиСпискаДокументов()
	
	Результат = Новый Массив;
	
	Если ЕстьОграниченияПоТарифу Тогда
		ТекСтрока = Элементы.СписокДокументов.ТекущаяСтрока;
		Если НЕ ТекСтрока = Неопределено Тогда
			СтрокаСписка = СписокДокументов.НайтиПоИдентификатору(ТекСтрока);
			Если НЕ СтрокаСписка = Неопределено Тогда
				Результат.Добавить(СтрокаСписка);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Для Каждого СтрокаСписка Из СписокДокументов Цикл
			Если СтрокаСписка.Флажок Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаСписка.BoxId)
					ИЛИ ЯщикиНеТребующиеОплаты.Получить(СтрокаСписка.BoxId) <> Неопределено Тогда
						Результат.Добавить(СтрокаСписка);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Новый_СтруктураДанныхСтрокиСписка(Источник)
	
	Результат = Новый Структура(СтруктураДанныхСтрокиСпискаСтрокой);
	Если Источник <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, Источник);
	КонецЕсли;
	Результат.СлужебнаяИнформация = Новый Структура;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДанныеВыделенныхСтрокТЧ(ОбрабатыватьШаблоны)

	Результат = Новый Массив;
	
	ВыделенныеСтроки = ВыделенныеСтрокиСпискаДокументов();
	
	Для Каждого СтрокаТЧ Из ВыделенныеСтроки Цикл
		
		Если СтрокаТЧ.Видимость И (НЕ СтрокаТЧ.Шаблон ИЛИ ОбрабатыватьШаблоны) Тогда
			
			СтруктураСтроки = Новый_СтруктураДанныхСтрокиСписка(СтрокаТЧ);
			
			Результат.Добавить(СтруктураСтроки);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДанныеДокументовВыделенныхСтрокТЧ(ОбрабатыватьШаблоны = Ложь, ДобавитьЗаблокированные = Ложь)
	
	ДанныеДокументов = Новый Массив;
	ПакетыДокументов = Новый Массив;
	МассивПакетов	 = Новый Массив;
	
	ВыделенныеСтроки = ВыделенныеСтрокиСпискаДокументов();
	
	Для Каждого СтрокаТЧ Из ВыделенныеСтроки Цикл
		
		СтруктураСтроки = Новый_СтруктураДанныхСтрокиСписка(СтрокаТЧ);
		
		Если СтрокаТЧ.Видимость И (Не СтрокаТЧ.Шаблон Или ОбрабатыватьШаблоны) Тогда
			
			Если (СтрокаТЧ.ЗаблокированныйПакет И ДобавитьЗаблокированные) Тогда
				
				LetterId = СтруктураСтроки.LetterId;
				
				Если МассивПакетов.Найти(LetterId) = Неопределено Тогда
					
					ИдентификаторыПакета = ИдентификаторыПакетаДокумента(СтруктураСтроки);
					
					ПакетыДокументов.Добавить(ИдентификаторыПакета);
					МассивПакетов.Добавить(LetterId);
					
				КонецЕсли;
				
			Иначе
				
				ДанныеДокументов.Добавить(СтруктураСтроки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = МассивДокументовИзДанныхДокументов(ДанныеДокументов);
	ДополнитьМассивДокументовДокументамиПакетов(Результат, ПакетыДокументов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДокументыПакетовСтрокСписка(СтрокиСписка)
	
	Результат = Новый Массив;
	
	ПакетыДокументов	= Новый Массив;
	ОбработанныеПакеты	= Новый Массив;
	
	Для Каждого СтрокаСписка Из СтрокиСписка Цикл
		
		Если ЗначениеЗаполнено(СтрокаСписка.Пакет) Тогда
			Ключ = СтрокаСписка.Пакет;
		Иначе
			Ключ = СтрокаСписка.LetterId;
		КонецЕсли;
		
		Если ОбработанныеПакеты.Найти(Ключ) = Неопределено Тогда
			
			ИдентификаторыПакета = ИдентификаторыПакетаДокумента(СтрокаСписка);
			ПакетыДокументов.Добавить(ИдентификаторыПакета);
			ОбработанныеПакеты.Добавить(Ключ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьМассивДокументовДокументамиПакетов(Результат, ПакетыДокументов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИдентификаторыПакетаДокумента(СтрокаСписка)
	
	Документ = ДокументИзДанныхСтрокиТЧ(СтрокаСписка);
	
	Результат = Модуль_ЯдроНаСервере().Контракт_ИдентификаторыПакета();
	
	Результат.BoxId		= Документ.Идентификаторы.BoxId;
	Результат.LetterId	= Документ.Идентификаторы.LetterId;
	Результат.ПакетЭДО	= Документ.Идентификаторы.ПакетЭДО;
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ДополнитьМассивДокументовДокументамиПакетов(МассивДокументов, ИдентификаторыПакетов)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ДокументыПакетов = Ядро.Пакеты_ДокументыПакетов(ИдентификаторыПакетов);
	
	Ядро.ДополнитьМассив(МассивДокументов, ДокументыПакетов);
	
КонецПроцедуры

&НаСервере
Функция МассивДокументовИзДанныхДокументов(СтрокиСпискаДокументов) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаСписка Из СтрокиСпискаДокументов Цикл
		
		Документ = ДокументИзДанныхСтрокиТЧ(СтрокаСписка);
		Результат.Добавить(Документ);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДокументИзДанныхСтрокиТЧ(СтрокаСписка) Экспорт
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	Результат = Модуль_Ядро.Документ_ДокументИзДанныхСтрокиСписка(СтрокаСписка);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДействияЭДО() Экспорт
	
	Результат = Модуль_ЯдроНаКлиенте().Перечисление_ДействияЭДО();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтветыЭДО() Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Результат = Ядро.Перечисление_ВариантыОтветаПоДокументу();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СписокДокументовПередНачаломИзменения(Элемент, Отказ)
	
	ИмяТекущейКолонки = Элементы.СписокДокументов.ТекущийЭлемент.Имя;
	
	Если ИмяТекущейКолонки <> "СписокДокументовФлажок" Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыделениеДокументов(УстановитьФлажки)
	
	ПолеФормыСписка = Элементы.СписокДокументов;
	
	Для Каждого СтрокаСписка Из СписокДокументов Цикл
		
		ИдентификаторСтроки = СтрокаСписка.ПолучитьИдентификатор();
		
		Если Не ПолеФормыСписка.ПроверитьСтроку(ИдентификаторСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСписка.Флажок = УстановитьФлажки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОтпечаткиСертификатовКонтекстаСеанса(КонтекстСеанса)
	
	Результат = Новый Массив;
	
	Для Каждого текКлючЗначение Из КонтекстСеанса Цикл
		
		ДанныеКонтекстаСеанса = текКлючЗначение.Значение;
		Отпечаток = ДанныеКонтекстаСеанса.ОтпечатокСертификата;
		
		Если ЗначениеЗаполнено(Отпечаток)
			И Результат.Найти(Отпечаток) = Неопределено Тогда
			
			Результат.Добавить(Отпечаток);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция АвторизованныеПользователиКонтекстаСеанса(КонтекстСеанса)
	
	ОбработанныеИдентификаторы = Новый Массив;
	
	Результат = Новый Массив;
	
	Для Каждого текКлючЗначение Из КонтекстСеанса Цикл
		
		ПользовательДД = текКлючЗначение.Значение.Сессия.Пользователь;
		
		Если ОбработанныеИдентификаторы.Найти(ПользовательДД.Идентификатор) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработанныеИдентификаторы.Добавить(ПользовательДД.Идентификатор);
		Результат.Добавить(СокрЛП(ПользовательДД.Представление));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеТекущегоПользователяДиадок(Форма)
	
	ИменаПользователей = АвторизованныеПользователиКонтекстаСеанса(Форма.КонтекстСеансаКлиентСервер);
	
	Если ИменаПользователей.Количество() = 0 Тогда // Не авторизован
		
		ПредставлениеТекущегоПользователя = "Авторизуйтесь";
		
	ИначеЕсли ИменаПользователей.Количество() = 1 Тогда 
		
		ПредставлениеТекущегоПользователя = ИменаПользователей[0];
		
	Иначе // Несколько активных сессий
		
		ПредставлениеТекущегоПользователя = "Список сертификатов";
		
	КонецЕсли;
	
	Форма.Элементы.АвторизацияПодСертификатом.Видимость = Форма.ЕстьСертификаты;
	Форма.Элементы.ПредставлениеПользователя.Заголовок = ПредставлениеТекущегоПользователя;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтрокуСпискаДокументов()

	Если Не ЗначениеЗаполнено(КлючТекущейСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", КлючТекущейСтроки);
	
	СтрокиСписка = СписокДокументов.НайтиСтроки(Отбор);
	Если СтрокиСписка.Количество() >= 1 Тогда
		Элементы.СписокДокументов.ТекущаяСтрока = СтрокиСписка[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗначенияПараметровОбщегоКонтекста()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.ОбщийКонтекст_ДополнитьЗначениямиИзОбщихНастроек(Объект.ОбщийКонтекстКлиентСервер);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеКатегории() Экспорт
	
	Результат = Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории();

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция Метрика_КатегорияНастройка()
	
	Результат = Метрика_НазваниеКатегории().Настройка;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_КатегорияНайтиНужныйДокумент()
	
	КатегорииМетрик = Метрика_НазваниеКатегории();
	
	Результат = КатегорииМетрик.НайтиНужныйДокумент;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_ДействиеОткрытиеПомощника()
	
	ДействияМетрик = Метрика_НазваниеДействий();
	
	Результат = ДействияМетрик.ОткрытиеПомощника;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики)
	
	НазваниеФормы = Метрика_НазваниеФормы();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		КатегорияМетрики,
		ДействиеМетрики
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(
		КатегорияМетрики,
		ДействиеМетрики
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных = 1)
	
	НазваниеФормыДляМетрики = Метрика_НазваниеФормы();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьПоведение_МассовоеДействиеНажатиеКнопки(НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		КоличествоДанных);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеДействий() Экспорт
	
	Результат = Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий();

	Возврат Результат;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ДействиеОткрытьСписокПлагинов()
	Возврат "Плагины";
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеКатегорииРежимаОтображения() Экспорт
	
	Результат = "";
	
	Если РежимОтображенияДокументов = РежимыОтображения().ДляОтправки Тогда
		Результат = "Действие в документах на отправку";
	ИначеЕсли РежимОтображенияДокументов = РежимыОтображения().Исходящие Тогда
		Результат = "Действие в исходящих";
	ИначеЕсли РежимОтображенияДокументов = РежимыОтображения().Входящие Тогда
		Результат = "Действие во входящих";	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

// Возвращает наименование категории метрики для действия построения списка документов
// из метода Метрика_НазваниеКатегории Модуля Ядро.
// 
// Параметры:
//    ВариантРежимаОтображенияДокументов - Строка - Выбранный пользователем режим построения списка.
// 
// Возвращаемое значение:
//    Строка - Наименование категории метрики.
// 
&НаКлиенте
Функция Метрика_НазваниеКатегорийПостроенияСписка(ВариантРежимаОтображенияДокументов)
	
	Если ЗначениеЗаполнено(ВариантРежимаОтображенияДокументов) Тогда
		Метрика_РежимОтображенияДокументов = ВариантРежимаОтображенияДокументов;
	Иначе
		Метрика_РежимОтображенияДокументов = РежимОтображенияДокументов;
	КонецЕсли;
	
	Если Метрика_РежимОтображенияДокументов = РежимыОтображения().ДляОтправки Тогда
		Результат = Метрика_НазваниеКатегории().ПостроениеСпискаНаОтправку;
	ИначеЕсли Метрика_РежимОтображенияДокументов = РежимыОтображения().Исходящие Тогда
		Результат = Метрика_НазваниеКатегории().ПостроениеСпискаИсходящие;
	ИначеЕсли Метрика_РежимОтображенияДокументов = РежимыОтображения().Входящие Тогда
		Результат = Метрика_НазваниеКатегории().ПостроениеСпискаВходящие;
	Иначе
		Результат = Метрика_НазваниеКатегории().РежимОтображенияСпискаНеОпределен;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеДействияМаршрутизации(Действие) Экспорт
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Результат = Ядро.Метрика_НазваниеДействияМаршрутизации(Действие);
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Функция Метрика_НазваниеДействияПодписание(Действие)
	
	Результат = "";
	
	Если Действие = ДействияЭДО().ПодписатьВходящий Тогда
		Результат = "Подписать";
	ИначеЕсли Действие = ДействияЭДО().ОтказатьВПодписи Тогда
		Результат = "Отказать контрагенту в подписи";
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_НазваниеФормы()
	
	Возврат "Основная форма";
	
КонецФункции 

&НаКлиенте
Функция Метрика_КолонкиФормыСписка()

	МассивИменЭлементов = Новый Массив;
	
	Для каждого ПодчиненныйЭлементы Из Элементы.СписокДокументов.ПодчиненныеЭлементы Цикл
		
		Если ПодчиненныйЭлементы.Видимость = Истина Тогда
		
			МассивИменЭлементов.Добавить(ПодчиненныйЭлементы.Заголовок);
		
		КонецЕсли;
	
	КонецЦикла;
	
	Результат = Модуль_ЯдроНаКлиенте().СоединитьСтроку(МассивИменЭлементов, ";");
	Возврат Результат;
	
КонецФункции

// Возвращает признак что в конфигурации есть объекты для хранения данных, РегистрДопСведений или ПодсистемаДиадока.
//
// Возвращаемое значение:
//    Булево
//
&НаСервере
Функция СистемаХраненияОпределена()
	
	Ядро = Модуль_ЯдроНаСервере();
	Данные = Ядро.РезультатИнициализацииОсновногоМодуля();
	
	Результат = (Данные.УстановленРегистрДопСведений Или Данные.УстановленаПодсистемаДиадока);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВключитьДекорациюДлительнойОперации()
	
	Элементы.ГруппаДлительнаяОперация.Видимость = Истина;
	Элементы.СписокДокументов.Видимость = Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьДекорацииДлительнойОперации()
	
	ЭтаФорма.ПорядковыйНомерОперацииЗагрузки = ЭтаФорма.ПорядковыйНомерОперацииЗагрузки + 1;
	КоличествоОпераций = 7;
	
	ШаблонЗаголовка = НСтр(
		"ru = 'Запускаем модуль %1/%2.
		|Это может занять несколько минут.'"
	);
	
	Ядро = Модуль_ЯдроНаКлиенте();
	ТекстЗаголовкаДекорации = Ядро.Общее_ПодставитьПараметрыВСтроку(
		ШаблонЗаголовка,
		ЭтаФорма.ПорядковыйНомерОперацииЗагрузки,
		КоличествоОпераций
	);
	
	Элементы.НадписьДлительнаяОперация.Заголовок = ТекстЗаголовкаДекорации;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьДекорациюДлительнойОперацииОтложенно()
	
	ПодключитьОбработчикОжидания("ОтключитьДекорациюДлительнойОперации", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьДекорациюДлительнойОперации() Экспорт
	
	Элементы.ГруппаДлительнаяОперация.Видимость = Ложь;
	Элементы.СписокДокументов.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИндикаторДлительнойОперации()
	
	Элементы.ГруппаКружок.Видимость = Истина;
	Элементы.ГруппаПредупреждение.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИндикаторПредупреждения()
	
	Элементы.ГруппаКружок.Видимость = Ложь;
	Элементы.ГруппаПредупреждение.Видимость = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РежимыФормыПакета()
	
	Результат = Новый Структура;
	
	Результат.Вставить("СозданиеНовогоПакета", "СозданиеНовогоПакета");
	Результат.Вставить("ОтображениеПакета", "ОтображениеПакета");
	Результат.Вставить("ДобавлениеДокументовСДиска", "ДобавлениеДокументовСДиска");
	
	Возврат Результат
	
КонецФункции

&НаСервере
Процедура СформироватьМетрикуДействияПереходаВМодульИзДокумента1С()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ПерейтиВМодуль;
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().ДействияИзДокумента1С;
	МеткаМетрики = "Нажать кнопку";
	ПредставлениеМетрики = "Документ1С";
	TraceId = "РаботаИзИнтерфейса1С" + ИсточникОткрытия.УникальныйИдентификатор();
	
	Ядро.Метрика_ДобавитьПоведение(
		КатегорияМетрики,
		ДействиеМетрики,
		МеткаМетрики,
		Неопределено,
		ПредставлениеМетрики,
		TraceId
	);
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Источник", СокрЛП(ТипЗнч(ИсточникОткрытия)));
	
	ИдентификаторЯщика = Ядро.ДокументыУчета_ИдентификаторЯщикаОрганизацииДокумента(ИсточникОткрытия);
	
	Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
		ИдентификаторЯщика,
		КатегорияМетрики,
		ДействиеМетрики,
		Неопределено,
		ДопПеременные,
		ПредставлениеМетрики,
		TraceId
	);
	
КонецПроцедуры

// }	ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ ФОРМЫ


// {	Уведомления пользователя

&НаКлиенте
Процедура ОбработатьЭкстренныеУведомления()
	
	ОбновитьНадписьДекорацииДлительнойОперации();
	
	Если ЕстьУведомления Тогда
		
		ПоказатьУведомленияПриЗапуске();
		
	Иначе
		
		ИнтервалОжидания = 0.1;
		ВыполнитьОднократно = Истина;
		
		ПодключитьОбработчикОжидания("ОбработчикПослеОткрытияФормы", ИнтервалОжидания, ВыполнитьОднократно);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПроверитьНаличиеУведомленийНаСервере()
	
	СостояниеУведомленийПользователя = ПолучитьСостояниеУведомлений();
	ВозможныеСостоянияУведомлений = Перечисление_СостоянияУведомленийПользователя();
	
	УстановитьОформлениеКнопкиУведомления(СостояниеУведомленийПользователя);
	
	Результат = СостояниеУведомленийПользователя <> ВозможныеСостоянияУведомлений.НетУведомлений;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьОформлениеКнопкиУведомления(СостояниеУведомленийПользователя)
	
	ВозможныеСостоянияУведомлений = Перечисление_СостоянияУведомленийПользователя();
	
	ОтображениеКнопкиУведомления = ОтображениеКнопки.Картинка; 
	Если СостояниеУведомленийПользователя = ВозможныеСостоянияУведомлений.ЕстьВажныеНеПрочитанные Тогда
		ЦветФонаКнопки = ЦветКнопкиЕстьВажныеНепрочитанные();
	ИначеЕсли СостояниеУведомленийПользователя = ВозможныеСостоянияУведомлений.ЕстьНеПрочитанные Тогда
		ЦветФонаКнопки = ЦветКнопкиЕстьНепрочитанные();
	Иначе
		ЦветФонаКнопки = ЦветКнопкиПоУмолчанию();
	КонецЕсли;
	
	Элементы.ОткрытьУведомления.ЦветФона = ЦветФонаКнопки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦветКнопкиПоУмолчанию()
	
	Возврат ЦветаСтиля.ЦветФонаКнопки;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЦветКнопкиЕстьВажныеНепрочитанные()
	
	Результат = Новый Цвет(237, 125, 125);
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЦветКнопкиЕстьНепрочитанные()
	
	Результат = Новый Цвет(250, 227, 143);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьУведомленияПриЗапуске()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Фильтр", ФильтрУведомленийФормы());
	
	ОписаниеОповещения = НовыйОписаниеОповещения("ПослеЗакрытияФормыУведомленияПользователя", ЭтаФорма);
	
	Платформа = Модуль_Платформа();
	Платформа.ОткрытьФормуУведомлений(ПараметрыФормы, ЭтаФорма, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУведомления()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Фильтр", ФильтрУведомленийФормы());
	
	Оповещение = НовыйОписаниеОповещения("ОбработкаЗакрытияФормыУведомлений", ЭтаФорма);
	
	Платформа = Модуль_Платформа();
	Платформа.ОткрытьФормуУведомлений(ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияФормыУведомлений(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	УстановитьОформлениеКнопкиУведомления(РезультатЗакрытия);
	
КонецПроцедуры

// Возвращает элементы фильтра для отбора уведомлений
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * form_name - Строка - Идентификатор текущей формы для отбора уведомлений (см. УведомленияИдентификаторФормы)
//
&НаКлиентеНаСервереБезКонтекста
Функция ФильтрУведомленийФормы()
	
	Результат = Новый Структура;
	Результат.Вставить("form_name", УведомленияИдентификаторФормы());
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УведомленияИдентификаторФормы()
	
	Возврат "ОсновнаяФорма";
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыУведомленияПользователя(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	УстановитьОформлениеКнопкиУведомления(РезультатЗакрытия);
	
	ИнтервалОжидания = 0.1;
	ВыполнитьОднократно = Истина;
	
	ПодключитьОбработчикОжидания("ОбработчикПослеОткрытияФормы", ИнтервалОжидания, ВыполнитьОднократно);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСостояниеУведомлений()
	
	Фильтр = ФильтрУведомленийФормы();
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	Результат = Модуль_Ядро.УведомленияПользователей_ТекущееСостояние(Фильтр);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СостоянияУведомленийПользователя()
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	Результат = Модуль_Ядро.Перечисление_СостоянияУведомленийПользователя();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьУведомления(Команда)
	
	Метрики_ЗаписатьНажатие_ОткрытьУведомления();
	
	Метрики_ЗаписатьСтатистику_ОткрытьУведомления();
	
	ПоказатьУведомления();
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ЗаписатьНажатие_ОткрытьУведомления()
	
	КатегорияМетрики = Метрика_НазваниеКатегории().ЭкстренноеУведомление;
	ДействиеМетрики = Метрика_ДействиеПоказатьУведомления();
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ЗаписатьСтатистику_ОткрытьУведомления()
	
	КатегорияМетрики = Метрика_НазваниеКатегории().ЭкстренноеУведомление;
	ДействиеМетрики = Метрика_ДействиеПоказатьУведомления();
	
	Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_ДействиеПоказатьУведомления()
	
	Возврат "ПоказатьУведомленияОсновнойФормы";
	
КонецФункции

// }	Уведомления пользователя

// {	ОБЩИЕ МЕТОДЫ

&НаКлиенте
Процедура ОбновитьСвойствоЭлементаФормы(Элемент, СвойствоЭлемента, ЗначениеСвойства) Экспорт
	
	Если Элемент[СвойствоЭлемента] <> ЗначениеСвойства Тогда
		Элемент[СвойствоЭлемента] = ЗначениеСвойства;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПоляФормы(Отказ, Форма, ИмяПоля, Синоним = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Форма[ИмяПоля]) Тогда
		ВывестиСообщениеПользователю("Не заполнено поле """
									+ ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяПоля)
									+ """", , Форма);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НельзяРаботатьСФайлами()
	
	Результат = Ложь;
	
	#Если ВебКлиент Тогда
		
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ПоказатьПредупреждениеПереопределенная(, "Не подключено расширение для работы с файлами. Обратитесь к администратору для решения проблемы.", 30);
		Результат = Истина;
		
	КонецЕсли;
	
	#КонецЕсли

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОповеститьИлиПерейтиПоСсылке(Знач АдресСсылки, ДополнительныеПараметры, ФормаСобытия) Экспорт
	
	Платформа = Модуль_Платформа();
	Платформа.ОповеститьИлиПерейтиПоСсылке(АдресСсылки, ДополнительныеПараметры, ФормаСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылке(АдресСсылки)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЗапуститьПриложение(АдресСсылки);
	#Иначе
		ПерейтиПоНавигационнойСсылке(АдресСсылки);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ТипКлиента()
	
	Результат = Неопределено;
	
	#Если ТонкийКлиент Тогда
		Результат = "Тонкий клиент";
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		Результат = "Толстый клиент обычное приложение";
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		Результат = "Толстый клиент управляемые формы";
	#ИначеЕсли ВебКлиент Тогда
		Результат = "Веб клиент";
	#ИначеЕсли НаСервере Тогда
		Результат = "Сервер";
	#ИначеЕсли ВнешнееСоединение Тогда
		Результат = "Внешнее соединение";
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Результат = Модуль_ЯдроНаКлиенте().СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыВМассив(Параметр0 = NULL,
						 Параметр1 = NULL,
						 Параметр2 = NULL,
						 Параметр3 = NULL,
						 Параметр4 = NULL) Экспорт
	
	Результат = Модуль_ЯдроНаКлиенте().ПараметрыВМассив(Параметр0, Параметр1, Параметр2, Параметр3, Параметр4);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоФормализованныйАктСверки405(ТипКонтента)
	
	Возврат Нрег(ТипКонтента) = "reconciliationact405";
	
КонецФункции

// {	ТИПИЗАЦИЯ ПОЛЯ СОСТАВНОГО ТИПА

&НаКлиенте
Процедура ПоказатьВыборТипаДанныхЭлементаСоставногоТипа(ЭлементСоставногоТипа) Экспорт
	
	СписокВыбора = ПолучитьСписокДоступныхТиповЭлементаСоставногоТипа();
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭлементСоставногоТипа", ЭлементСоставногоТипа);
		
	ОбработчикОповещения = НовыйОписаниеОповещения("ОбработатьВыборТипаЭлементаСоставногоТипа", ЭтаФорма, ДопПараметры);
	
	смв().смв_ПоказатьВыборЭлемента(ОбработчикОповещения, "Выбор типа данных", ЭлементСоставногоТипа, СписокВыбора)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТипаЭлементаСоставногоТипа(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		ЭлементСоставногоТипа = ДополнительныеПараметры.ЭлементСоставногоТипа;
		
		УстановитьОграничениеТипаЭлементаСоставногоТипа(ЭлементСоставногоТипа, РезультатВыбора.Значение);
		УстановитьВидимостьКнопокЭлементаСоставногоТипа(ЭлементСоставногоТипа);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхТиповЭлементаСоставногоТипа()
	
	Результат = Новый СписокЗначений;
	
	Для Каждого СправочникМетаданных Из Метаданные.Справочники Цикл
		Результат.Добавить(Тип("СправочникСсылка." + СправочникМетаданных.Имя), СправочникМетаданных.Синоним); 
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьОграничениеТипаЭлементаСоставногоТипа(ЭлементСоставногоТипа, ВыбранныйТип) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.УстановитьОграничениеТипаЭлементаСоставногоТипа(ЭлементСоставногоТипа, ВыбранныйТип);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКнопокЭлементаСоставногоТипа(ЭлементСоставногоТипа) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.УстановитьВидимостьКнопокЭлементаСоставногоТипа(ЭлементСоставногоТипа);
	
КонецПроцедуры

&НаКлиенте
Функция ОграничениеТипа_Неопределено() Экспорт
	
	Результат = Новый ОписаниеТипов("Неопределено");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбщийКонтекстОбработки()
	
	Модуль = ОбработкаОбъект();
	Результат = Модуль.ОбщийКонтекстКлиентСервер;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеСпискаДокументов()
	
	УстановитьУсловноеОформление_СписокДокументов_Видимость();
	УстановитьУсловноеОформление_СписокДокументов_СтатусНеОтправлен();
	УстановитьУсловноеОформление_СписокДокументов_ОшибкиПроверкиТекст();
	УстановитьУсловноеОформление_СписокДокументов_ПредставлениеНеформализованногоДокумента();
	УстановитьУсловноеОформление_СписокДокументов_ВнешнийСтатусОшибка();
	УстановитьУсловноеОформление_СписокДокументов_СтатусТЭДООшибка();
	
	СписокТиповДокументовУсловногоОформленияУПД = Новый СписокЗначений;
	СписокТиповДокументовУсловногоОформленияУПД.Добавить("UniversalTransferDocument");
	СписокТиповДокументовУсловногоОформленияУПД.Добавить("UniversalTransferDocumentRevision");
	
	СписокТиповДокументовУсловногоОформленияУКД = Новый СписокЗначений;
	СписокТиповДокументовУсловногоОформленияУКД.Добавить("UniversalCorrectionDocument");
	СписокТиповДокументовУсловногоОформленияУКД.Добавить("UniversalCorrectionDocumentRevision");
	
	СписокДокументовВозможноСопоставить = Новый СписокЗначений;
	СписокДокументовВозможноСопоставить.Добавить("UniversalTransferDocument");
	СписокДокументовВозможноСопоставить.Добавить("UniversalTransferDocumentRevision");
	СписокДокументовВозможноСопоставить.Добавить("UniversalCorrectionDocument");
	СписокДокументовВозможноСопоставить.Добавить("UniversalCorrectionDocumentRevision");
	СписокДокументовВозможноСопоставить.Добавить("Invoice");
	СписокДокументовВозможноСопоставить.Добавить("InvoiceRevision");
	СписокДокументовВозможноСопоставить.Добавить("InvoiceCorrection");
	СписокДокументовВозможноСопоставить.Добавить("InvoiceCorrectionRevision");
	СписокДокументовВозможноСопоставить.Добавить("XmlTorg12");
	СписокДокументовВозможноСопоставить.Добавить("XmlAcceptanceCertificate");
	СписокДокументовВозможноСопоставить.Добавить("XmlTorgBlr");
	
	УстановитьУсловноеОформление_СписокДокументовПолученныеДокументы(СписокДокументовВозможноСопоставить);
	УстановитьУсловноеОформление_СписокДокументов_ТипДокументаНеОпределен(СписокТиповДокументовУсловногоОформленияУКД, СписокТиповДокументовУсловногоОформленияУПД);
	
	УстановитьУсловноеОформление_СписокДокументов_СЧФДОП(СписокТиповДокументовУсловногоОформленияУПД);
	УстановитьУсловноеОформление_СписокДокументов_СЧФ(СписокТиповДокументовУсловногоОформленияУПД);
	УстановитьУсловноеОформление_СписокДокументов_ДОП(СписокТиповДокументовУсловногоОформленияУПД);
	
	УстановитьУсловноеОформление_СписокДокументов_КСЧФДИС(СписокТиповДокументовУсловногоОформленияУКД);
	УстановитьУсловноеОформление_СписокДокументов_КСЧФ(СписокТиповДокументовУсловногоОформленияУКД);
	УстановитьУсловноеОформление_СписокДокументов_ДИС(СписокТиповДокументовУсловногоОформленияУКД);
	
	УстановитьУсловноеОформление_СписокДокументовСтатусКритичностьМЧД();
	УстановитьУсловноеОформление_СписокДокументовСтатусКритичностьПКФНС();
	
	УстановитьУсловноеОформление_СписокДокументовПодразделение();
	УстановитьУсловноеОформление_СписокДокументовКонтрагент();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_ВнешнийСтатусОшибка()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ВнешнийСтатус");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение	= "ошибка";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(206, 0, 20));
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовВнешнийСтатус");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_СтатусТЭДООшибка()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДокументов.СтатусТЭДО");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = "ошибка";
	
	// BSLLS:StyleElementConstructors-off
	// BSLLS:MagicNumber-off
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(206, 0, 20));
	// BSLLS:MagicNumber-on
	// BSLLS:StyleElementConstructors-on
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовСтатусТЭДО");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_ПредставлениеНеформализованногоДокумента()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение	= "Nonformalized";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовПредставлениеДляНеформализованногоДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_ТипДокументаНеОпределен(Знач СписокТиповДокументовУсловногоОформленияУКД, Знач СписокТиповДокументовУсловногоОформленияУПД)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУПД;
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУКД;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовФункцияДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_ДИС(Знач СписокТиповДокументовУсловногоОформленияУКД)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ФункцияДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Basic";
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУКД;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "ДИС");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовФункцияДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_КСЧФ(Знач СписокТиповДокументовУсловногоОформленияУКД)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ФункцияДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Invoice";
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУКД;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "КСЧФ");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовФункцияДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_КСЧФДИС(Знач СписокТиповДокументовУсловногоОформленияУКД)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ФункцияДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "InvoiceAndBasic";
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУКД;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "КСЧФДИС");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовФункцияДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_ДОП(Знач СписокТиповДокументовУсловногоОформленияУПД)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ФункцияДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Basic";
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУПД;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "ДОП");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовФункцияДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_СЧФ(Знач СписокТиповДокументовУсловногоОформленияУПД)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ФункцияДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Invoice";
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУПД;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "СЧФ");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовФункцияДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_СЧФДОП(Знач СписокТиповДокументовУсловногоОформленияУПД)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ФункцияДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "InvoiceAndBasic";
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокТиповДокументовУсловногоОформленияУПД;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "СЧФДОП");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовФункцияДокумента");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументовПолученныеДокументы(СписокДокументовВозможноСопоставить)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.Документ");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("РежимОтображенияДокументов");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "ПолученныеДокументы";
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ТипДокумента");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокДокументовВозможноСопоставить;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(240, 240, 240));
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_ОшибкиПроверкиТекст()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.ОшибкиПроверкиТекст");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 214, 214));
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_СтатусНеОтправлен()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.Статус");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Не отправлен";
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументов_Видимость()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокДокументов.Видимость");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= Ложь;
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовВидимость");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументовСтатусКритичностьМЧД()
	
	Ядро = Модуль_ЯдроНаСервере();
	УровниКритичности = Ядро.Контракт_УровниКритичностиСтатусаДокумента();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДокументов.СтатусМЧДКритичность");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = УровниКритичности.Error;
	// BSLLS:StyleElementConstructors-off
	// BSLLS:MagicNumber-off
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(220, 20, 60));
	// BSLLS:MagicNumber-on
	// BSLLS:StyleElementConstructors-on
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовСтатусМЧД");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументовСтатусКритичностьПКФНС()
	
	Ядро = Модуль_ЯдроНаСервере();
	УровниКритичности = Ядро.Контракт_УровниКритичностиСтатусаДокумента();
	
	СписокКритичности = Новый СписокЗначений;
	СписокКритичности.Добавить(УровниКритичности.Error);
	СписокКритичности.Добавить(УровниКритичности.Warning);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДокументов.СтатусПКФНСКритичность");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СписокКритичности;
	// BSLLS:StyleElementConstructors-off
	// BSLLS:MagicNumber-off
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(235, 168, 0));
	// BSLLS:MagicNumber-on
	// BSLLS:StyleElementConstructors-on
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовСтатусПКФНС");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументовПодразделение()
	
	ЭлементСписокДокументовПодразделение = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбораСписокДокументовПодразделение = ЭлементСписокДокументовПодразделение.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораСписокДокументовПодразделение.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ИспользоватьСопоставлениеПодразделений");
	ЭлементОтбораСписокДокументовПодразделение.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораСписокДокументовПодразделение.ПравоеЗначение	= Истина;
	
	ЭлементСписокДокументовПодразделение.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< из настройки >'"));
	ЭлементСписокДокументовПодразделение.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));
	
	ОформляемоеПолеСписокДокументовПодразделение = ЭлементСписокДокументовПодразделение.Поля.Элементы.Добавить();
	ОформляемоеПолеСписокДокументовПодразделение.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовПодразделение");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление_СписокДокументовКонтрагент()
	
	ЭлементСписокДокументовКонтрагент = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбораСписокДокументовКонтрагент = ЭлементСписокДокументовКонтрагент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораСписокДокументовКонтрагент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДокументов.Контрагент");
	ЭлементОтбораСписокДокументовКонтрагент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ПолеПредставление = Новый ПолеКомпоновкиДанных("СписокДокументов.ПредставлениеКонтрагентаЭДО");
	ЭлементСписокДокументовКонтрагент.Оформление.УстановитьЗначениеПараметра("Текст", ПолеПредставление);
	ЭлементСписокДокументовКонтрагент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));
	
	ОформляемоеПолеСписокДокументовКонтрагент = ЭлементСписокДокументовКонтрагент.Поля.Элементы.Добавить();
	ОформляемоеПолеСписокДокументовКонтрагент.Поле = Новый ПолеКомпоновкиДанных("СписокДокументовКонтрагент");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКнопкиНастроекДоверенности()
	
	Элементы.ОткрытьСписокДоверенностей.Видимость = ЕстьЯщикДляДействийСДокументамиВКоторомНужнаМЧД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДоверенностей(Команда) Экспорт
	
	ОткрытьФормуСпискаДоверенностей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаДоверенностей(ИдентификаторЯщика = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИдентификаторЯщика) Тогда
		ИдентификаторЯщикаДляФормы = ИдентификаторЯщика;
	ИначеЕсли ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		ИдентификаторЯщика = Организации_ИдентификаторПоССылке(ОтборПоОрганизации);
		Если ЗначениеЗаполнено(ИдентификаторЯщика) Тогда
			ИдентификаторЯщикаДляФормы = ИдентификаторЯщика;
		КонецЕсли;
	Иначе
		ИдентификаторЯщикаДляФормы = "";
	КонецЕсли;
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОткрытьФормуСпискаДоверенностей(ИдентификаторЯщикаДляФормы);

КонецПроцедуры

// }	ТИПИЗАЦИЯ ПОЛЯ СОСТАВНОГО ТИПА

// }	ОБЩИЕ МЕТОДЫ

// {	МЧД

// Для переданных данных групповой операции выполняет проверку данных МЧД
//
// Параметры:
//	ОписаниеГрупповойОперации - Структура - см. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура МЧД_НачатьПроверкуДанныхГрупповойОперации(ОписаниеГрупповойОперации)
	
	ПараметрыГрупповойОбработки = ОписаниеГрупповойОперации.ПараметрыГрупповойОбработки;
	ТекущееДействиеЭДО = ПараметрыГрупповойОбработки.Действие;
	
	ТребуетсяМЧД = Модуль_ЯдроНаКлиенте().МЧД_ДействияТребующиеДоверенность().Получить(ТекущееДействиеЭДО);
	
	Если ТребуетсяМЧД = Истина Тогда
		
		МЧД_ПроверитьДанныеГрупповойОперацииНаПоддержкуМЧДВРоуминге(ОписаниеГрупповойОперации);
		
	Иначе
		
		Обработчик_ВыполнитьГрупповуюОперациюПослеЗавершенияПроверок(Неопределено, ОписаниеГрупповойОперации);
		
	КонецЕсли;
	
КонецПроцедуры

// Для переданных данных групповой операции выполняет проверку контрагентов на возможность отправки МЧД в роуминг
// Выводит диалог выбора с ошибками проверки
//
// Параметры:
//	ОписаниеГрупповойОперации - Структура - см. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура МЧД_ПроверитьДанныеГрупповойОперацииНаПоддержкуМЧДВРоуминге(ОписаниеГрупповойОперации)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ПараметрыГрупповойОбработки = ОписаниеГрупповойОперации.ПараметрыГрупповойОбработки;
	ОшибкиПроверокМЧД = ЗаполнитьИПроверитьМЧДВРоумингеПередОтправкойДокументов(ПараметрыГрупповойОбработки.ДанныеДляОбработки);
	
	Если ОшибкиПроверокМЧД.Количество() Тогда
		
		ОписаниеОповещенияОбработчика = НовыйОписаниеОповещения(
			"Обработчик_ПослеПроверкиКонтрагентовНаПоддержкуМЧДВРоуминге", 
			ЭтаФорма, 
			ОписаниеГрупповойОперации
		);
		
		Действие = ПараметрыГрупповойОбработки.Действие;
		ГрупповоеДействие = ПараметрыГрупповойОбработки.ГрупповоеДействие;
		
		ПараметрыДляПроверкиМЧД = ПараметрыДляПроверкиМЧД(ОписаниеОповещенияОбработчика, Неопределено, Неопределено, Действие, ГрупповоеДействие);
		ПараметрыДляПроверкиМЧД.ОшибкиПроверокМЧД = ОшибкиПроверокМЧД;
	
		ПоказатьВопрос_КонтрагентыДокументовНеПоддерживаютМЧД(ПараметрыДляПроверкиМЧД);
		
	Иначе
		Обработчик_ПослеПроверкиКонтрагентовНаПоддержкуМЧДВРоуминге(Неопределено, ОписаниеГрупповойОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьИПроверитьМЧДВРоумингеПередОтправкойДокументов(ДанныеДляОбработки)
	
	Ядро = Модуль_ЯдроНаСервере();
	Результат = Новый Массив;
	
	ОшибкиПоОрганизациям = Новый Соответствие;
	
	ИнформацияОбОператораторах = Неопределено;
	
	Для каждого Документ Из ДанныеДляОбработки Цикл
		
		Если Документ.Направление = "Внутреннее" Тогда
			Продолжить;
		КонецЕсли;
		
		СтороныДокументооборота		 = СтороныДокументооборотаДляПроверкиПоддержкиМЧДВРоуминге(Документ);
		ОрганизацияBoxId			 = СтороныДокументооборота.Организация.BoxId;
		
		Если Ядро.МЧД_ТребуетсяДоверенность(ОрганизацияBoxId) Тогда
			
			КонтрагентFNSParticipantId	 = СтороныДокументооборота.Контрагент.FNSParticipantId;
			КонтрагентПоддерживаетМЧД	 = Ядро.МЧД_ОператорЭДОПоддерживаетДоверенности(ОрганизацияBoxId, КонтрагентFNSParticipantId);
			
			Если НЕ КонтрагентПоддерживаетМЧД Тогда
				
				ДополнитьДокументСведениямиМЧДКлиентСервер(Документ, Неопределено);
				ДополнитьСписокОшибокМЧДВРоуминге(ОшибкиПоОрганизациям, СтороныДокументооборота);
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ОшибкаПоОрганизациям Из ОшибкиПоОрганизациям Цикл
		Результат.Добавить(ОшибкаПоОрганизациям.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СтороныДокументооборотаДляПроверкиПоддержкиМЧДВРоуминге(Документ)
	
	Ядро = Модуль_ЯдроНаСервере();
	РежимыОтображения = РежимыОтображения();
	
	Результат = Новый Структура("Контрагент, Организация");

	ЕстьОтправитель = Документ.Свойство("Отправитель");
	ЕстьПолучатель = Документ.Свойство("Получатель");
	
	Если ЕстьОтправитель И ЕстьПолучатель Тогда
		
		Результат.Контрагент = Ядро.Документы_Контрагент(Документ);
		Результат.Организация = Ядро.Документы_Организация(Документ);
		
	Иначе
		
		ИдентификаторыОрганизации	 = Ядро.Новый_ИдентификаторыСправочника(Документ.Организация);
		УчастникДО_Организации		 = Ядро.Организации_ЗаполнитьУчастникаДО(ИдентификаторыОрганизации);
		ИдентификаторыКонтрагента	 = Ядро.Новый_ИдентификаторыСправочника(Документ.Контрагент); 
		УчастникДО_Контрагенты		 = Ядро.Контрагенты_ЗаполнитьУчастникаДО(ИдентификаторыКонтрагента, ИдентификаторыОрганизации);
		
		ОрганизацияBoxId			 = УчастникДО_Организации.BoxId;
		КонтрагентFNSParticipantId	 = УчастникДО_Контрагенты.FNSParticipantId;
		КонтрагентНаименование		 = УчастникДО_Контрагенты.Наименование;
		
		Результат.Контрагент = УчастникДО_Контрагенты;
		Результат.Организация = УчастникДО_Организации;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ()

&НаСервере
Процедура ДополнитьСписокОшибокМЧДВРоуминге(ОшибкиПоОрганизациям, СтороныДокументооборота)
	
	Ядро = Модуль_ЯдроНаСервере();
	
	КонтрагентFNSParticipantId	 = СтороныДокументооборота.Контрагент.FNSParticipantId;
	ОрганизацияBoxId			 = СтороныДокументооборота.Организация.BoxId;
	
	ОписаниеОшибки = ОшибкиПоОрганизациям.Получить(ОрганизацияBoxId);
	Если ОписаниеОшибки = Неопределено Тогда
		
		Метрика_ВидыОшибокПроверокМЧД = Метрика_ВидыОшибокПроверокМЧД();
		РазделыОшибок = Ядро.МЧД_РазделыОшибокПроверкиМЧД();
		
		ОписаниеОшибки = Новый_ОписаниеОшибкиПроверкиМЧДпоУмолчанию(
			РазделыОшибок.КонтрагентНеПоддерживаетМЧДВРоуминге,
			"",
			Новый Массив,
			Метрика_ВидыОшибокПроверокМЧД.НеУказанаДоверенность,
			ОрганизацияBoxId
		);
		
		ОшибкиПоОрганизациям.Вставить(ОрганизацияBoxId, ОписаниеОшибки);
		
	КонецЕсли;
	
	ИдентификаторФНСОператора	 = Ядро.ИдентификаторФНСИзИдентификаторУчастникаЭДО(КонтрагентFNSParticipantId);
	ПредставлениеОператораЭДО	 = Ядро.ПредставлениеОператораЭДО(ИдентификаторФНСОператора, ОрганизацияBoxId);
	ПредставлениеКонтрагента	 = СтороныДокументооборота.Контрагент.Наименование + " (" + ПредставлениеОператораЭДО + ")";
	
	ОшибкаВСписке = ОписаниеОшибки.СписокОшибок.Найти(ПредставлениеКонтрагента);
	Если ОшибкаВСписке = Неопределено Тогда
		ОписаниеОшибки.СписокОшибок.Добавить(ПредставлениеКонтрагента);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеПроверкиКонтрагентовНаПоддержкуМЧДВРоуминге(Результат, ОписаниеГрупповойОперации) Экспорт
	
	ПараметрыГрупповойОбработки = ОписаниеГрупповойОперации.ПараметрыГрупповойОбработки;
	ТекущееДействиеЭДО = ПараметрыГрупповойОбработки.Действие;
	
	Если ТекущееДействиеЭДО = ДействияЭДО().ПодписатьВходящий Тогда
		Обработчик_ВыполнитьГрупповуюОперациюПослеЗавершенияПроверок(Неопределено, ОписаниеГрупповойОперации);
	Иначе
		МЧД_ПроверитьДанныеГрупповойОперацииНаМЧДПоУмолчанию(ОписаниеГрупповойОперации);
	КонецЕсли;
	
КонецПроцедуры

// Для переданных данных групповой операции выполняет заполнение МЧД по умолчанию
// Выводит диалог выбора с ошибками проверки
//
// Параметры:
//	ОписаниеГрупповойОперации - Структура - см. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура МЧД_ПроверитьДанныеГрупповойОперацииНаМЧДПоУмолчанию(ОписаниеГрупповойОперации)

	ПараметрыГрупповойОбработки = ОписаниеГрупповойОперации.ПараметрыГрупповойОбработки;
	
	ТекущееДействиеЭДО = ПараметрыГрупповойОбработки.Действие;
	
	ОшибкиПроверокМЧД = ЗаполнитьИПроверитьМЧДпоУмолчаниюПередОтправкойДокументов(
		ПараметрыГрупповойОбработки.ДанныеДляОбработки
	);
	Если ОшибкиПроверокМЧД.Количество() Тогда
		
		ОписаниеОповещенияОбработчика = НовыйОписаниеОповещения(
			"Обработчик_ВыполнитьГрупповуюОперациюПослеЗавершенияПроверок", 
			ЭтаФорма, 
			ОписаниеГрупповойОперации
		);
		
		Модуль_Платформа = Модуль_Платформа();
		Метрика_НазванияФормМЧД = Модуль_Платформа.Метрика_НазванияФормМЧД();
		
		ПараметрыДляПроверкиМЧД = ПараметрыДляПроверкиМЧД(
			ОписаниеОповещенияОбработчика,
			Неопределено,
			Неопределено,
			ТекущееДействиеЭДО
		);
		ПараметрыДляПроверкиМЧД.ОшибкиПроверокМЧД = ОшибкиПроверокМЧД;
		ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики = Метрика_НазванияФормМЧД.НетПодходящихДовереностей;
		
		ОбработчикВопроса = НовыйОписаниеОповещения(
			"ОбработатьРезультатПриГрупповыхДействияхНаФормеВопросаМЧД",
			ЭтаФорма,
			ПараметрыДляПроверкиМЧД
		);
		
		Модуль_Платформа.ПоказатьВопрос_НетПодходящейДоверенности(ПараметрыДляПроверкиМЧД, ОбработчикВопроса);
		
	Иначе
		Обработчик_ВыполнитьГрупповуюОперациюПослеЗавершенияПроверок(Неопределено, ОписаниеГрупповойОперации);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает праметры для метода проверки МЧД 
// 
// Параметры:
//    ОповещениеЗавершения		 - Структура - описание оповещения выполняемого после проверки МЧД.
//    ИдентификаторЯщика		 - Строка - .
//    ВыбраннаяМЧД				 - Структура - см. Модуль_Ядро.Контракт_МЧД().
//    ДействиеЭДО				 - Строка - элемент структуры ДействияЭДО().
//    ИдентификаторыДокумента	 - Структура - идентификаторы документа по которому выполняется ооперация, см Модуль_Ядро.Контракт_Идентификаторы().
// 
// Возвращаемое значение:
//    Структура
// 
&НаКлиенте
Функция ПараметрыДляПроверкиМЧД(ОповещениеЗавершения, ИдентификаторЯщика, ВыбраннаяМЧД, ДействиеЭДО, ГрупповоеДействие = Ложь) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.ПараметрыДляПроверкиМЧД(
		ОповещениеЗавершения,
		ИдентификаторЯщика,
		ВыбраннаяМЧД,
		ДействиеЭДО,
		ГрупповоеДействие
	);
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку переданной мчд и по результатам выводит сообщения пользователю
//
// Параметры:
//    ПараметрыДляПроверкиМЧД	 - Структура - см.ПараметрыДляПроверкиМЧД().
//
&НаКлиенте
Процедура ПроверитьМЧДИВыполнитьОповещение(ПараметрыДляПроверкиМЧД) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ПроверитьМЧДИВыполнитьОповещение(ПараметрыДляПроверкиМЧД);
	
КонецПроцедуры

// Выводит вопрос "Оператор контрагента не поддерживает МЧД"
// Используется для группового действия
//
// Параметры:
//	ПараметрыДляПроверкиМЧД - Структура - см. ПараметрыДляПроверкиМЧД()
//
&НаКлиенте
Процедура ПоказатьВопрос_КонтрагентыДокументовНеПоддерживаютМЧД(ПараметрыДляПроверкиМЧД) 
	
	Модуль_Платформа = Модуль_Платформа();
	
	ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики = Модуль_Платформа.Метрика_НазванияФормМЧД().ПоддержкаОператоромМЧД;
	
	Модуль_Платформа.Метрика_ОткрытиеФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД);
	
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.Продолжить, ДействияНаФормеВопросаМЧД.Продолжить);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок, ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаМЧД.Закрыть, ДействияНаФормеВопросаМЧД.Закрыть);
	
	ШаблонВопроса = 
	"Не для всех выделенных документов можно выполнить операцию: %1 с МЧД в роуминге.
	|
	|Перейдите по кнопке ""Подробнее"" для просмотра причин. 
	|
	|Нажмите ""Продолжить"", чтобы выполнить действие для всех документов. Они отправятся без МЧД или с ней.";

	ПредставлениеДействияЭДО = ПредставлениеДействияЭДО(ПараметрыДляПроверкиМЧД.ДействиеЭДО);
	
	ТекстВопроса = Модуль_ЯдроНаКлиенте().Общее_ПодставитьПараметрыВСтроку(ШаблонВопроса, ПредставлениеДействияЭДО);
	
	ОбработчикВопроса = НовыйОписаниеОповещения("ОбработатьРезультатНаФормеВопроса_КонтрагентНеПоддерживаетМЧД", ЭтаФорма, ПараметрыДляПроверкиМЧД);
	ПоказатьВопросПереопределенная(ОбработчикВопроса, ТекстВопроса, КнопкиВопроса, , ДействияНаФормеВопросаМЧД.Закрыть);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатНаФормеВопроса_КонтрагентНеПоддерживаетМЧД(ВыбранноеДействие, ПараметрыДляПроверкиМЧД) Экспорт
	
	ДобавитьМетрикиПриГрупповыхДействияхНаФормеВопросаМЧД(ВыбранноеДействие, ПараметрыДляПроверкиМЧД);
	
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	ПродолжитьБезМЧД	 = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.Продолжить;
	ОткрытьСписокОшибок	 = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок;
	
	Если ПродолжитьБезМЧД Тогда
		
		ВыполнитьОбработкуОповещенияПереопределенная(ПараметрыДляПроверкиМЧД.ОповещениеЗавершения);
		
	ИначеЕсли ОткрытьСписокОшибок Тогда
		
		ОшибкиПроверокМЧД = ПараметрыДляПроверкиМЧД.ОшибкиПроверокМЧД;
		
		ОбработчикЗакрытияФормыHTML = НовыйОписаниеОповещения("ОбработатьЗакрытиеФормыHTMLСообщения", ЭтаФорма, ПараметрыДляПроверкиМЧД); 
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Режим", "КонтрагентыНеПоддерживаютМЧД");
		ПараметрыОткрытияФормы.Вставить("ОшибкиПроверокМЧД", ОшибкиПроверокМЧД);
		
		ОткрытьФормуДиадокМодально(
			"ФормаHTMLСообщенияУправляемая",
			ЭтаФорма,
			ПараметрыОткрытияФормы,
			ОбработчикЗакрытияФормыHTML
		);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьИПроверитьМЧДпоУмолчаниюПередОтправкойДокументов(ДанныеДляОбработки)
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.ЗаполнитьИПроверитьМЧДпоУмолчаниюПередОтправкойДокументов(ДанныеДляОбработки);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Новый_ОписаниеОшибкиПроверкиМЧДпоУмолчанию(Раздел, РасшифровкаСтатуса, СписокОшибок, Метрика_ВидОшибкиПроверкиМЧД, ИдентификаторЯщика)

	Результат = Новый Структура;
	Результат.Вставить("Раздел"				, Раздел);
	Результат.Вставить("РасшифровкаСтатуса"	, РасшифровкаСтатуса);
	Результат.Вставить("СписокОшибок"		, СписокОшибок);
	Результат.Вставить("Метрика_ВидОшибкиПроверкиМЧД"		, Метрика_ВидОшибкиПроверкиМЧД);
	Результат.Вставить("ИдентификаторЯщика"		, ИдентификаторЯщика);
	 
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РезультатВыбораМЧД(РазрешитьДействие, КонтрактМЧД) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("РазрешитьДействие"	, РазрешитьДействие);
	Результат.Вставить("КонтрактМЧД"		, КонтрактМЧД);
	
	Возврат Результат;
	
КонецФункции 

// см. ДополнитьДокументыСведениямиМЧДКлиентСервер()
// 
&НаКлиенте
Процедура ДополнитьДокументыСведениямиМЧДНаКлиенте(КонтрактыДокументов, КонтрактМЧД) Экспорт
	
	Для Каждого Документ Из КонтрактыДокументов Цикл	
		ДополнитьДокументСведениямиМЧДКлиентСервер(Документ, КонтрактМЧД)
	КонецЦикла;
	
КонецПроцедуры

// Дополняет служебную информацию переданных документов КонтрактомМЧД 
// 
// Параметры:
//    Документ		 - Структура - ДокументДД, см. Модуль_Ядро.Контракт_Документ().
//    КонтрактМЧД	 - Структура - см. Модуль_Ядро.Контракт_МЧД().
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ДополнитьДокументСведениямиМЧДКлиентСервер(Документ, КонтрактМЧД)
	
	Если НЕ Документ.СлужебнаяИнформация.Свойство("КонтрактМЧД") Тогда
		Документ.СлужебнаяИнформация.Вставить("КонтрактМЧД", КонтрактМЧД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПриГрупповыхДействияхНаФормеВопросаМЧД(ВыбранноеДействие, ДополнительныеПараметры) Экспорт
	
	ДобавитьМетрикиПриГрупповыхДействияхНаФормеВопросаМЧД(ВыбранноеДействие, ДополнительныеПараметры);
	
	ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
	
	ПродолжитьБезМЧД = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД;
	ПродолжитьСМЧД = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ПродолжитьСМЧД;
	ДействоватьСМЧД = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ДействоватьСМЧД;
	ОткрытьСписокОшибок = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок;
	
	Если ПродолжитьБезМЧД
		ИЛИ ПродолжитьСМЧД
		ИЛИ ДействоватьСМЧД Тогда
		
		ВыполнитьОбработкуОповещенияПереопределенная(ДополнительныеПараметры.ОповещениеЗавершения);
		
	ИначеЕсли ОткрытьСписокОшибок Тогда
		
		ОшибкиПроверокМЧД = ДополнительныеПараметры.ОшибкиПроверокМЧД;
		
		ОбработчикЗакрытияФормыHTML = НовыйОписаниеОповещения(
				"ОбработатьЗакрытиеФормыHTMLСообщения",
				ЭтаФорма,
				ДополнительныеПараметры);
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Режим", "СписокОшибокМЧД");
		ПараметрыОткрытияФормы.Вставить("СписокОшибокМЧД", ОшибкиПроверокМЧД);
		
		ОткрытьФормуДиадокМодально(
			"ФормаHTMLСообщенияУправляемая",
			ЭтаФорма,
			ПараметрыОткрытияФормы,
			ОбработчикЗакрытияФормыHTML);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМетрикиПриГрупповыхДействияхНаФормеВопросаМЧД(ВыбранноеДействие, ПараметрыДляПроверкиМЧД)
	
	МетрикиОписаниеОповещенияПереопределяемая = СвойствоСтруктуры(
			ПараметрыДляПроверкиМЧД,
			"ОписаниеОповещенияДобавленияМетрики");
	
	Если МетрикиОписаниеОповещенияПереопределяемая = Неопределено Тогда
		
		ДействияНаФормеВопросаМЧД = ДействияНаФормеВопросаМЧД();
		
		ПродолжитьБезМЧД = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ПродолжитьБезМЧД
			ИЛИ ВыбранноеДействие = ДействияНаФормеВопросаМЧД.Продолжить;
		ПродолжитьСМЧД = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ПродолжитьСМЧД
			ИЛИ ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ДействоватьСМЧД;
		ОткрытьСписокОшибок = ВыбранноеДействие = ДействияНаФормеВопросаМЧД.ОткрытьСписокОшибок;
		
		Если ПродолжитьСМЧД Тогда
			Возврат;
		КонецЕсли;
		
		Если ПродолжитьБезМЧД Тогда
			Метрика_ПродолжитьБезМЧД(ПараметрыДляПроверкиМЧД);
			Возврат;
		КонецЕсли;
		
		Если ОткрытьСписокОшибок Тогда
			Метрика_СписокОшибокМЧД(ПараметрыДляПроверкиМЧД, Истина);
			Возврат;
		КонецЕсли;
		
		Метрика_ЗакрытиеФормыФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД);
		
	Иначе
		
		ВыполнитьОбработкуОповещенияПереопределенная(МетрикиОписаниеОповещенияПереопределяемая, ВыбранноеДействие);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыHTMLСообщения(Результат, ДополнительныеПараметры) Экспорт

	Если ДополнительныеПараметры <> Неопределено Тогда
		
		Если ДополнительныеПараметры.Свойство("ОшибкиПроверокМЧД") Тогда
		
			Метрика_СписокОшибокМЧД(ДополнительныеПараметры, Ложь);
			
			Модуль_Платформа = Модуль_Платформа();
			Метрика_НазванияФормМЧД = Модуль_Платформа.Метрика_НазванияФормМЧД();
			
			Если ДополнительныеПараметры.НазваниеФормыДляМетрики = Метрика_НазванияФормМЧД.ПоддержкаОператоромМЧД Тогда
				ПоказатьВопрос_КонтрагентыДокументовНеПоддерживаютМЧД(ДополнительныеПараметры);
			Иначе
				
				ДополнительныеПараметры.НазваниеФормыДляМетрики = Метрика_НазванияФормМЧД.НетПодходящихДовереностей;
				ОбработчикВопроса = НовыйОписаниеОповещения(
					"ОбработатьРезультатПриГрупповыхДействияхНаФормеВопросаМЧД",
					ЭтаФорма,
					ДополнительныеПараметры
				);
				Модуль_Платформа.ПоказатьВопрос_НетПодходящейДоверенности(ДополнительныеПараметры, ОбработчикВопроса);
			КонецЕсли;
			
		ИначеЕсли ДополнительныеПараметры.Свойство("СписокОшибокКЭП") Тогда
			
			ПоказатьВопрос_НеДляВсехДокументовМожноВыполнитьДействиеКЭП(ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДействияНаФормеВопросаМЧД() Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.ДействияНаФормеВопросаМЧД();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьПроверкуОшибкокМЧДПоУмолчанию()
	
	БольшеНеПоказывать = МетодСервераБезКонтекста(
		Истина,
		"ОбработкаОбъект().НастройкиПользователяПрочитать_НеПоказыватьПредупрежденияПоМЧД");
	
	Если БольшеНеПоказывать = Ложь Тогда
		
		ПодключитьОбработчикОжидания("ПоказатьПредупреждениеСОшибкамиМЧДУСотрудниковПоОрганизациям", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет наличие ошибок в установках МЧД по умолчанию и при наличии открывает форму сообщения 
//
&НаКлиенте
Процедура ПоказатьПредупреждениеСОшибкамиМЧДУСотрудниковПоОрганизациям() Экспорт
	
	ОшибкиПроверкиМЧД = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().МЧД_ПроверитьНаличиеДоверенностейУСотрудниковПоОрганизациям");
	
	Если ЗначениеЗаполнено(ОшибкиПроверкиМЧД) Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Режим",				"ОшибкиМЧД");
		ПараметрыОткрытияФормы.Вставить("ОшибкиПроверкиМЧД",	ОшибкиПроверкиМЧД);
		
		ОповещениеОЗакрытииФормы = Неопределено;
		
		ОткрытьФормуДиадокМодально(
			"ФормаHTMLСообщенияУправляемая",
			ЭтаФорма,
			ПараметрыОткрытияФормы,
			ОповещениеОЗакрытииФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьЯщикДляДействийСДокументамиВКоторомНужнаМЧД()
	
	Результат = Ложь;
	
	СтрокиКонтекста = Модуль_ЯдроНаКлиенте().КонтекстСеанса_СтрокиКонтекста();
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		КонтекстЯщика = СтрокаКонтекста.Значение;
		Если КонтекстЯщика.ТребуетсяМЧД Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_ВидыОшибокПроверокМЧД()

	Результат = Новый Структура; 
	Результат.Вставить("НеУказанаДоверенность"				, "НеУказанаДоверенность");
	Результат.Вставить("ДоверенностьНеПодходит"				, "ДоверенностьНеПодходит");
	Результат.Вставить("ОператорНеПоддерживаетМЧДВРоуминге"	, "ОператорНеПоддерживаетМЧДВРоуминге");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ПродолжитьБезМЧД(ДополнительныеПараметры)
	
	Модуль_Платформа = Модуль_Платформа();
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики		 = Метрика_НазваниеКатегории().УведомлениеПриМассовыхДействиях;
	ДопПеременные			 = Метрика_ДополнительныеПеременныеМЧД(ДополнительныеПараметры);
	НазваниеФормыДляМетрики	 = ДополнительныеПараметры.НазваниеФормыДляМетрики;
	ЛейблМетрики			 = Метрика_НазваниеДействий().НажатиеКнопки;
	ПредставлениеМетрики	 = Модуль_Платформа.Метрика_ЛейблПоНазваниюФормыМЧД(НазваниеФормыДляМетрики);
	TraceId					 = Ядро.TraceId();
	
	ДействиеМетрики = Метрика_НазваниеДействий().ДействоватьБезДоверенности;
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		ЛейблМетрики,
		ПредставлениеМетрики,
		TraceId
	);
	Для каждого ОписаниеОшибки Из ДополнительныеПараметры.ОшибкиПроверокМЧД Цикл
		Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
			ОписаниеОшибки.ИдентификаторЯщика,
			КатегорияМетрики,
			ДействиеМетрики,
			ЛейблМетрики,
			ДопПеременные,
			ПредставлениеМетрики,
			TraceId
		);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_СписокОшибокМЧД(ДополнительныеПараметры, ОткрытиеФормы)
	
	Модуль_Платформа = Модуль_Платформа();
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики		 = Метрика_НазваниеКатегории().УведомлениеПриМассовыхДействиях;
	ДопПеременные			 = Метрика_ДополнительныеПеременныеМЧД(ДополнительныеПараметры);
	ЛейблМетрики			 = Метрика_НазваниеДействий().НажатиеКнопки;
	TraceId					 = Ядро.TraceId();
	
	Если ОткрытиеФормы Тогда
	
		НазваниеФормыДляМетрики	 = ДополнительныеПараметры.НазваниеФормыДляМетрики;
		ПредставлениеМетрики	 = Модуль_Платформа.Метрика_ЛейблПоНазваниюФормыМЧД(НазваниеФормыДляМетрики);
		
		ДействиеМетрики = Метрика_НазваниеДействий().Подробнее;
		Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
			НазваниеФормыДляМетрики,
			КатегорияМетрики,
			ДействиеМетрики,
			ЛейблМетрики,
			ПредставлениеМетрики,
			TraceId
		);
		Для каждого ОписаниеОшибки Из ДополнительныеПараметры.ОшибкиПроверокМЧД Цикл
			Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
				ОписаниеОшибки.ИдентификаторЯщика,
				КатегорияМетрики,
				ДействиеМетрики,
				ЛейблМетрики,
				ДопПеременные,
				ПредставлениеМетрики,
				TraceId
			);
		КонецЦикла;
	
	КонецЕсли;
	
	Если ОткрытиеФормы Тогда
		ДействиеМетрики			 = Метрика_НазваниеДействий().ОткрытиеФормы;
	Иначе
		ДействиеМетрики			 = Метрика_НазваниеДействий().ЗакрытиеФормы;
	КонецЕсли;
	
	НазваниеФормыДляМетрики		 = Модуль_Платформа.Метрика_НазванияФормМЧД().ОписаниеОшибокСМЧД;
	ПредставлениеМетрики		 = Модуль_Платформа.Метрика_ЛейблПоНазваниюФормыМЧД(НазваниеФормыДляМетрики);
	Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ОткрытиеФормы,
		ЛейблМетрики,
		ПредставлениеМетрики,
		TraceId
	);
	Для каждого ОписаниеОшибки Из ДополнительныеПараметры.ОшибкиПроверокМЧД Цикл
		ДопПеременные.Вставить("Идентификатор ошибки", ОписаниеОшибки.Метрика_ВидОшибкиПроверкиМЧД);
		Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
			ОписаниеОшибки.ИдентификаторЯщика,
			КатегорияМетрики,
			ДействиеМетрики,
			ЛейблМетрики,
			ДопПеременные,
			ПредставлениеМетрики,
			TraceId
		);
	КонецЦикла;

КонецПроцедуры

// Возвращает дополнительные переменные для отправки метрик по МЧД на основании параметров формы проверки МЧД
// 
// Параметры:
//    ПараметрыДляПроверкиМЧД - Структура - см. ПараметрыДляПроверкиМЧД().
// 
// Возвращаемое значение:
//    Структура
// 
&НаКлиенте
Функция Метрика_ДополнительныеПеременныеМЧД(ПараметрыДляПроверкиМЧД) Экспорт
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.Метрика_ДополнительныеПеременныеМЧД(ПараметрыДляПроверкиМЧД);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ЗакрытиеФормыФормыПредупрежденияПослеПроверкиМЧД(ПараметрыДляПроверкиМЧД)
	
	Модуль_Платформа = Модуль_Платформа();
	Ядро = Модуль_ЯдроНаКлиенте();
	
	НазваниеФормыДляМетрики	 = ПараметрыДляПроверкиМЧД.НазваниеФормыДляМетрики;
	ДопПеременные			 = Метрика_ДополнительныеПеременныеМЧД(ПараметрыДляПроверкиМЧД);
	ЛейблМетрики			 = Метрика_НазваниеДействий().НажатиеКнопки;
	ПредставлениеМетрики	 = Модуль_Платформа.Метрика_ЛейблПоНазваниюФормыМЧД(НазваниеФормыДляМетрики);
	TraceId					 = Ядро.TraceId();
	
	Если ПараметрыДляПроверкиМЧД.ГрупповоеДействие Тогда
		КатегорияМетрики	= Метрика_НазваниеКатегории().УведомлениеПриМассовыхДействиях;
	Иначе
		КатегорияМетрики	= Метрика_НазваниеКатегории().УведомлениеИзФормыПакета;
	КонецЕсли;
	
	ДействиеМетрики = Метрика_НазваниеДействий().ЗакрытиеФормы;
	Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(
		НазваниеФормыДляМетрики,
		КатегорияМетрики,
		Ложь,
		ЛейблМетрики,
		ПредставлениеМетрики,
		TraceId
	);
	Для каждого ОписаниеОшибки Из ПараметрыДляПроверкиМЧД.ОшибкиПроверокМЧД Цикл
		Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(
			ОписаниеОшибки.ИдентификаторЯщика,
			КатегорияМетрики,
			ДействиеМетрики,
			ЛейблМетрики,
			ДопПеременные,
			ПредставлениеМетрики,
			TraceId
		);
	КонецЦикла;

КонецПроцедуры

// }	МЧД

// {	РЕДАКТИРОВАНИЕ ОСНОВАНИЯ ПОЛНОМОЧИЙ

&НаКлиенте
Функция НовыйРеквизитыДокументаОснованияПолномочий(ДокНаименование, Номер, Дата, ДопСведения)

	Результат = Новый Структура;
	
	Результат.Вставить("Наименование", ДокНаименование);
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("Дата", Дата);
	Результат.Вставить("ДопСведения", ДопСведения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СформироватьПредставлениеДокументаОснованияПолномочий(РеквизитыДокумента) Экспорт
	
	Результат = "Не заполнено";

	Если РеквизитыДокумента <> Неопределено
		И ЗначениеЗаполнено(РеквизитыДокумента.Наименование) Тогда
		
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(РеквизитыДокумента.Наименование);
		ЧастиСтроки.Добавить(" № " + РеквизитыДокумента.Номер);
		ЧастиСтроки.Добавить(" от " + Формат(РеквизитыДокумента.Дата, "ДФ=dd.MM.yyyy"));
		
		Результат = Модуль_ЯдроНаКлиенте().СоединитьСтроку(ЧастиСтроки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРедактированияОснованияПолномочий(РеквизитыДокумента, ОписаниеОповещения, Владелец) Экспорт
	
	ПараметрыОткрытияФормы = НовыйПараметрыФормыРедактированияОснованияПолномочий(РеквизитыДокумента);
	
	ОткрытьФормуДиадокМодально(
		"РедактированиеОснованияПолномочийУправляемая",
		Владелец,
		ПараметрыОткрытияФормы,
		ОписаниеОповещения
	);
	
КонецПроцедуры

&НаКлиенте
Функция НовыйПараметрыФормыРедактированияОснованияПолномочий(РеквизитыДокумента)

	Если РеквизитыДокумента = Неопределено Тогда
		НаименованиеДокумента = "";
		Номер = "";
		Дата = '00010101';
		ДопСведения = "";
	Иначе
		НаименованиеДокумента = РеквизитыДокумента.Наименование;
		Номер = РеквизитыДокумента.Номер;
		Дата = РеквизитыДокумента.Дата;
		ДопСведения = РеквизитыДокумента.ДопСведения;
	КонецЕсли;
	
	Результат = НовыйРеквизитыДокументаОснованияПолномочий(НаименованиеДокумента, Номер, Дата, ДопСведения);
	
	Возврат Результат;
	
КонецФункции

// }	РЕДАКТИРОВАНИЕ ОСНОВАНИЯ ПОЛНОМОЧИЙ

// {	КЭП

&НаКлиенте
Процедура НачатьПроверкуОшибокКЭП()
	
	ПодключитьОбработчикОжидания("ПоказатьПредупреждениеСОшибкамиКЭППослеАвторизации", 0.1, Истина);
	
КонецПроцедуры

// Проверяет наличие ошибок в установках МЧД по умолчанию и при наличии открывает форму сообщения 
//
&НаКлиенте
Процедура ПоказатьПредупреждениеСОшибкамиКЭППослеАвторизации() Экспорт
	
	СписокОшибокКЭП = МетодСервераБезКонтекста(Истина, "Модуль_Ядро().КЭП_ПолучитьОшибкиПоСтрокамКонтекста");
	
	Если ЗначениеЗаполнено(СписокОшибокКЭП) Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Режим",			"ОшибкиКЭППриАвторизации");
		ПараметрыОткрытияФормы.Вставить("СписокОшибокКЭП",	СписокОшибокКЭП);
		
		ОповещениеОЗакрытииФормы = Неопределено;
		
		ОткрытьФормуДиадокМодально(
			"ФормаHTMLСообщенияУправляемая",
			ЭтаФорма,
			ПараметрыОткрытияФормы,
			ОповещениеОЗакрытииФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДействияНаФормеВопросаКЭП()
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.ДействияНаФормеВопросаКЭП();
	
	Возврат Результат;
	
КонецФункции

// Для переданных данных групповой операции выполняет проверку сертификатов на КЭП. 
// Далее запускает проверку МЧД
//
// Параметры:
//	ОписаниеГрупповойОперации - Структура - см. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура КЭП_НачатьПроверкуДанныхГрупповойОперации(ОписаниеГрупповойОперации)
	
	ПараметрыГрупповойОбработки	 = ОписаниеГрупповойОперации.ПараметрыГрупповойОбработки;
	РезультатПроверкиКЭП		 = КЭП_ПроверитьДанныеГрупповойОперацииНаСервере(ПараметрыГрупповойОбработки.ДанныеДляОбработки, ПараметрыГрупповойОбработки.Действие);
	ЕстьДокументыДляОбработки	 = ЗначениеЗаполнено(РезультатПроверкиКЭП.ДанныеДляОбработкиБезОшибок);
	
	Если ЗначениеЗаполнено(РезультатПроверкиКЭП.ОшибкиПроверки) 
		И ЕстьДокументыДляОбработки Тогда
		
		ПараметрыГрупповойОбработки.ДанныеДляОбработки = РезультатПроверкиКЭП.ДанныеДляОбработкиБезОшибок;
		
		ОписаниеГрупповойОперации.Вставить("СписокОшибокКЭП", РезультатПроверкиКЭП.ОшибкиПроверки);
		
		ПоказатьВопрос_НеДляВсехДокументовМожноВыполнитьДействиеКЭП(ОписаниеГрупповойОперации);
		
	ИначеЕсли ЗначениеЗаполнено(РезультатПроверкиКЭП.ОшибкиПроверки) 
		И НЕ ЕстьДокументыДляОбработки Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.ПоказатьВопрос_ДляДокументаНевозможноВыполнитьДействиеКЭП(РезультатПроверкиКЭП.ОшибкиПроверки);
		
	Иначе
		МЧД_НачатьПроверкуДанныхГрупповойОперации(ОписаниеГрупповойОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КЭП_ПроверитьДанныеГрупповойОперацииНаСервере(ДанныеДляОбработки, ДействиеЭДО)
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.КЭП_ПроверитьДанныеГрупповойОперацииНаСервере(ДанныеДляОбработки, ДействиеЭДО);
	
	Возврат Результат;
	
КонецФункции

// Показывает пользователям форму с визуализацией ошибок проверок 
//
// Параметры:
//	ОписаниеГрупповойОперации - Структура - см. Новый_ОписаниеГрупповойОперации()
//
&НаКлиенте
Процедура ПоказатьВопрос_НеДляВсехДокументовМожноВыполнитьДействиеКЭП(ОписаниеГрупповойОперации)
		
	ДействияНаФормеВопросаКЭП = ДействияНаФормеВопросаКЭП();
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаКЭП.Продолжить			, ДействияНаФормеВопросаКЭП.Продолжить);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаКЭП.ОткрытьСписокОшибок, ДействияНаФормеВопросаКЭП.ОткрытьСписокОшибок);
	КнопкиВопроса.Добавить(ДействияНаФормеВопросаКЭП.Закрыть			, ДействияНаФормеВопросаКЭП.Закрыть);
	
	ТекстВопроса = 
	"Для работы с электронными документами в Диадоке требуется выпустить квалифицированный сертификат (КЭП).
	|
	|- Чтобы узнать о возможных причинах ошибки и посмотреть инструкции, нажмите на кнопку ""Подробнее"".
	|- Чтобы выполнить действие для доступных документов, нажмите на кнопку ""Продолжить""."; 
	
	ОбработчикЗакрытияВопроса = НовыйОписаниеОповещения("ОбработатьРезультатВыбора_НеДляВсехДокументовМожноВыполнитьДействиеКЭП", ЭтаФорма, ОписаниеГрупповойОперации);
	
	ПоказатьВопросПереопределенная(ОбработчикЗакрытияВопроса, ТекстВопроса, КнопкиВопроса, , ДействияНаФормеВопросаКЭП.Закрыть , "Не для всех документов в списке можно выполнить действие");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыбора_НеДляВсехДокументовМожноВыполнитьДействиеКЭП(ВыбранноеДействие, ОписаниеГрупповойОперации) Экспорт
	
	ДействияНаФормеВопросаКЭП = ДействияНаФормеВопросаКЭП();
	
	ПродолжитьДляДоступных	 = ВыбранноеДействие = ДействияНаФормеВопросаКЭП.Продолжить;
	ОткрытьСписокОшибок		 = ВыбранноеДействие = ДействияНаФормеВопросаКЭП.ОткрытьСписокОшибок;
	
	Если ПродолжитьДляДоступных Тогда
		
		ЕстьДанныеДляОбработки = ОписаниеГрупповойОперации.ПараметрыГрупповойОбработки.ДанныеДляОбработки.Количество() > 0;
		
		Если ЕстьДанныеДляОбработки Тогда
			МЧД_НачатьПроверкуДанныхГрупповойОперации(ОписаниеГрупповойОперации);
		КонецЕсли;
		
	ИначеЕсли ОткрытьСписокОшибок Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.Метрика_СписокОшибокКЭП(ОписаниеГрупповойОперации.СписокОшибокКЭП);
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Режим",			"ОшибкиКЭППриДействии");
		ПараметрыОткрытияФормы.Вставить("СписокОшибокКЭП",	ОписаниеГрупповойОперации.СписокОшибокКЭП);
		
		ОбработчикЗакрытияФормыHTML = НовыйОписаниеОповещения("ОбработатьЗакрытиеФормыHTMLСообщения", ЭтаФорма, ОписаниеГрупповойОперации);
		
		ОткрытьФормуДиадокМодально(
			"ФормаHTMLСообщенияУправляемая",
			ЭтаФорма,
			ПараметрыОткрытияФормы,
			ОбработчикЗакрытияФормыHTML
		);
		
	КонецЕсли;
		
КонецПроцедуры

// }	КЭП

//{		АВТООБНОВЛЕНИЕ МОДУЛЯ

&НаСервере
Процедура ПодготовитьДанныеДляОбновленияМодуля()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	МоментНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ДанныеДляОбновленияМодуля = Ядро.ДанныеДляОбновленияМодуля();
	
	Ядро.Метрика_ДобавитьЗамер_СборДанныхДляОбновленияМодуля(МоментНачалаЗамера, "НаСервере");
		
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДанныеДляОбновленияМодуля()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	МоментНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Ядро.ДополнитьДанныеДляОбновленияМодуля(ДанныеДляОбновленияМодуля);
	
	ЕстьНоваяВерсияМодуля = ДанныеДляОбновленияМодуля.ОписаниеОбновленияМодуля.ЕстьНоваяВерсия;
	
	Ядро.Метрика_ДобавитьЗамер_СборДанныхДляОбновленияМодуля(МоментНачалаЗамера, "НаКлиенте");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМодульАвтоматически(Отказ)
	
	РезультатОбновления = Модуль_ЯдроНаКлиенте().ОбновитьМодульАвтоматически(ДанныеДляОбновленияМодуля);
	
	Если РезультатОбновления = "Success" Тогда
		
		ПослеУспешногоОбновленияМодуля();
	
		Отказ = Истина;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУспешногоОбновленияМодуля()
	
	ЗакрытьГлавнуюФорму();
	
	МестоположенияМодуля = ДанныеДляОбновленияМодуля.Перечисления.МестоположенияМодуля;
	РасположениеМодуля = ДанныеДляОбновленияМодуля.ОписаниеРасположенияМодуля;
	
	Если РасположениеМодуля.Местоположение = МестоположенияМодуля.РасширениеКонфигурации Тогда
		
		УведомитьПользователяОбУспешномОбновленииРасширенияКонфигурации();
		
	Иначе
		
		Попытка
			ПодключитьНовуюВерсиюМодуля();
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ПопроситьПользователяПерезапуститьМодуль();
			Возврат; // чтобы переоткрытие не зациклилось
		КонецПопытки;
		
		ОткрытьФорму(ИмяФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УведомитьПользователяОбУспешномОбновленииРасширенияКонфигурации()
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
			"ОбработатьДействиеПользователяПослеОбновленияРасширения",
			ЭтаФорма);
	
	ЗаголовокВопроса = "Обновление модуля";
	ТекстСообщения = "Модуль автоматически обновлен до актуальной версии. Для работы с модулем перезапустите программу.";
	
	КнопкаПоУмолчанию = КодВозвратаДиалога.ОК;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Закрыть");
	Кнопки.Добавить(КнопкаПоУмолчанию, "Перезапустить");
	
	ПоказатьВопросПереопределенная(
		ОписаниеОповещения,
		ТекстСообщения,
		Кнопки, ,
		КнопкаПоУмолчанию,
		ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДействиеПользователяПослеОбновленияРасширения(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = КодВозвратаДиалога.ОК Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Подключает новую версию модуля в метаданные сеанса
//
&НаКлиенте
Процедура ПодключитьНовуюВерсиюМодуля()
	
	МестоположенияМодуля = ДанныеДляОбновленияМодуля.Перечисления.МестоположенияМодуля;
	
	РасположениеМодуля = ДанныеДляОбновленияМодуля.ОписаниеРасположенияМодуля;
	
	ВнешняяОбработка = РасположениеМодуля.Ссылка;
	ПутьКФайлу		 = РасположениеМодуля.ПутьКФайлу;
	Местоположение	 = РасположениеМодуля.Местоположение;
	
	Если Местоположение = МестоположенияМодуля.ФайлНаДиске Тогда
		
		ПодключитьОбработкуМодуляИзФайла(ПутьКФайлу);
					
	ИначеЕсли Местоположение = МестоположенияМодуля.ЭлементСправочника Тогда
		
		ПодключитьОбработкуМодуляИзСправочника(ВнешняяОбработка);
		
	Иначе // этого сценария не должно быть
					
		ВызватьИсключение "ПодключениеНовойВерсииМодуля.НекорректноеРасположениеМодуля: " + Местоположение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработкуМодуляИзФайла(ПутьКФайлу)
	
	ДвоичныеДанные	 = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресВХ			 = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ВнешниеОбработки_Подключить(АдресВХ);
	
КонецПроцедуры

&НаСервере	
Процедура ПодключитьОбработкуМодуляИзСправочника(ВнешняяОбработка)
	
	ОбработкаОбъект  = РеквизитФормыВЗначение("Объект");
	
	ДвоичныеДанные	 = ОбработкаОбъект.ДвоичныеДанныеВнешнейОбработки(ВнешняяОбработка);
	АдресВХ			 = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ВнешниеОбработки_Подключить(АдресВХ);
	
КонецПроцедуры

&НаСервере
Процедура ВнешниеОбработки_Подключить(АдресВХ)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ПодключитьВнешнююОбработку(АдресВХ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПопроситьПользователяПерезапуститьМодуль()
	
	Таймаут = 0;
	ОписаниеОповещения = Неопределено;
	ЗаголовокПредупреждения = "Выполнено обновление модуля";
	ТекстПредупреждения = НСтр("ru = 'Перезапустите модуль, пожалуйста.'");
	
	ПоказатьПредупреждениеПереопределенная(
		ОписаниеОповещения,
		ТекстПредупреждения,
		Таймаут,
		ЗаголовокПредупреждения
	);
	
КонецПроцедуры

//}		АВТООБНОВЛЕНИЕ МОДУЛЯ

//{		ОБЕРТКИ

&НаКлиенте
Функция Общее_СоединитьСтроку(Строки, Разделитель = "")
	
	Результат = Модуль_ЯдроНаКлиенте().СоединитьСтроку(Строки, Разделитель);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура _ОбработатьОшибку(Знач ВидОперации, Знач Ошибка, Знач Пояснение = "")
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Ошибка_Обработать(
		ВидОперации,
		Ошибка,
		Пояснение
	);
	
КонецПроцедуры

//}		ОБЕРТКИ

//{		ПОДКЛЮЧАЕМЫЙ МОДУЛЬ

&НаСервере
Процедура УправлениеПМ_ВыгрузитьВСервис()
	
	Ядро = Модуль_ЯдроНаСервере();
	Ядро.УправлениеПМ_ПроверитьВерсииФайловИВыгрузитьВСервис();

КонецПроцедуры

//}		ПОДКЛЮЧАЕМЫЙ МОДУЛЬ

//{		СПРАВКА

&НаКлиенте
Процедура Справка_ПоказатьПриПервомЗапуске()
	
	КлючКэша = "СправкаПоказанаНовомуПользователюПриЗапуске";
	СправкаПоказана = Кэш_Прочитать(КлючКэша);
	
	Если СправкаПоказана = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПервыйЗапуск Тогда
		
		Справка_ОткрытьРаздел("НемногоОМодулеШаг1");
		
		СправкаПоказана = Истина;
		Кэш_Поместить(КлючКэша, СправкаПоказана);
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура Справка_ОткрытьРаздел(РазделСправки)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РазделСправки", РазделСправки);
	
	ОткрытьФормуДиадокМодально("ФормаСправкиУправляемая", ЭтаФорма, ПараметрыОткрытияФормы);
	
КонецПроцедуры

//}		СПРАВКА


//{		ОЦЕНКА РАБОТЫ МОДУЛЯ

&НаКлиенте
Процедура ПоказатьПлашкуОтзываПоРаботеСКонтрагентами()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	СценарийМодуляДляОтзыва = СценарииМодуля.РаботаСКонтрагентами;
	
	ТребуетсяОценка = ТребуетсяПоказатьПлашкуОтзываПоРаботе();
	
	УстановитьВидимостьКнопокОбратнойСвязи(ТребуетсяОценка);
	УстановитьЗаголовокОценкиРаботыСМодулем();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПлашкуОтзываПоРаботеСОплатойСервиса()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	СценарийМодуляДляОтзыва = СценарииМодуля.ОплатаСервиса;
	
	ТребуетсяОценка = ТребуетсяПоказатьПлашкуОтзываПоРаботе();
	
	УстановитьВидимостьКнопокОбратнойСвязи(ТребуетсяОценка);
	УстановитьЗаголовокОценкиРаботыСМодулем();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПлашкуОтзываПоРаботеСПоискомДокументовНаОтправку()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	// BSLLS:UnusedLocalVariable-off
	СценарийМодуляДляОтзыва = СценарииМодуля.ПоискДокументовНаОтправку;
	// BSLLS:UnusedLocalVariable-on
	
	ТребуетсяОценка = ТребуетсяПоказатьПлашкуОтзываПоРаботе();
	
	УстановитьВидимостьКнопокОбратнойСвязи(ТребуетсяОценка);
	УстановитьЗаголовокОценкиРаботыСМодулем();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПлашкуОтзываПоРаботеСЛентойКонтрагентов()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	// BSLLS:UnusedLocalVariable-off
	СценарийМодуляДляОтзыва = СценарииМодуля.СобытияЛентыКонтрагентов;
	// BSLLS:UnusedLocalVariable-on
	
	ТребуетсяОценка = ТребуетсяПоказатьПлашкуОтзываПоРаботе();
	
	УстановитьВидимостьКнопокОбратнойСвязи(ТребуетсяОценка);
	УстановитьЗаголовокОценкиРаботыСМодулем();
	
КонецПроцедуры

&НаКлиенте
Функция ТребуетсяПоказатьПлашкуОтзываПоРаботе()
	
	Платформа = Модуль_Платформа();
	Результат = Платформа.ОтзывПоРаботеСМодулем_ТребуетсяОценка(СценарийМодуляДляОтзыва);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьКнопокОбратнойСвязи(Видимость)
	
	Элементы.ГруппаОценкаРаботыМодуля.Видимость = Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокОценкиРаботыСМодулем()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	
	Если СценарийМодуляДляОтзыва = СценарииМодуля.РаботаСКонтрагентами Тогда
		ЗаголовокОценки = НСтр("ru = 'Возникли трудности при работе с контрагентами?'");
	ИначеЕсли СценарийМодуляДляОтзыва = СценарииМодуля.ОплатаСервиса Тогда
		ЗаголовокОценки = НСтр("ru = 'Возникли трудности с подписками?'");
	ИначеЕсли СценарийМодуляДляОтзыва = СценарииМодуля.ПоискДокументовНаОтправку Тогда
		ЗаголовокОценки = НСтр("ru = 'Возникли трудности при поиске документов?'");
	ИначеЕсли СценарийМодуляДляОтзыва = СценарииМодуля.СобытияЛентыКонтрагентов Тогда
		ЗаголовокОценки = НСтр("ru = 'Возникли трудности при работе с событиями?'");
	КонецЕсли;
	
	Элементы.ДекорацияОценкаРаботыСМодулем.Заголовок = ЗаголовокОценки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаРаботыСМодулемДа(Команда)
	
	Метрики_ПриНажатии_ОценкаРаботыСМодулемДа();
	ПоказатьФормуОценкиРаботыСМодулем();
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаРаботыСМодулемНет(Команда)
	
	УстановитьВидимостьКнопокОбратнойСвязи(Ложь);
	Метрики_ПриНажатии_ОценкаРаботыСМодулемНет();
	ЗаписатьДатуОценкиРаботыСМодулем(СценарийМодуляДляОтзыва);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуОценкиРаботыСМодулем()
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Сценарий", СценарийМодуляДляОтзыва);
	
	ОповещениеОЗакрытииФормы = НовыйОписаниеОповещения("ПослеОбработкиОценкаРаботыСМодулем", ЭтаФорма);
	
	ОткрытьФормуДиадокМодально(
		"ОтзывОРаботеМодуляУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы,
		ОповещениеОЗакрытииФормы,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

// Обработчик закрытия формы обратной связи по оцениваемому сценариию работы с модулем
//
// Параметры:
//  Отзыв - Строка, Неопределено - Комментарий пользователя. Неопределено, если отказался оставлять отзыв.
//  ДополнительныеПараметры - Неопределено - Не используется
//
&НаКлиенте
Процедура ПослеОбработкиОценкаРаботыСМодулем(Отзыв, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Отзыв = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Метрики_ЗаписатьОС_ЕстьТрудностиВРаботеСМодулем(Отзыв);
	ЗаписатьДатуОценкиРаботыСМодулем(СценарийМодуляДляОтзыва);
	УстановитьВидимостьКнопокОбратнойСвязи(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДатуОценкиРаботыСМодулем(СценарийМодуля)
	
	МодульОбъекта = ОбработкаОбъект();
	МодульОбъекта.ЗаписатьДатуОценкиРаботыСМодулем(СценарийМодуля);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ПриНажатии_ОценкаРаботыСМодулемДа()
	
	Категория = Метрики_КатегорияТрудностиСРаботойСМодулем();
	Действие = Метрики_ДействиеНегативныйОтзывОРаботеСМодулем();
	
	Метрика_ЗаписатьНажатиеКнопки(Категория, Действие);
	
КонецПроцедуры 

&НаКлиенте
Процедура Метрики_ПриНажатии_ОценкаРаботыСМодулемНет()
	
	Категория = Метрики_КатегорияТрудностиСРаботойСМодулем();
	Действие = Метрики_ДействиеПозитивныйОтзывОРаботеСМодулем();
	
	Метрика_ЗаписатьНажатиеКнопки(Категория, Действие);
	Метрики_ЗаписатьОС_НетТрудностейВРаботеСМодулем();
	
КонецПроцедуры 

&НаКлиенте
Процедура Метрики_ЗаписатьОС_ЕстьТрудностиВРаботеСМодулем(Отзыв)
	
	Трассировка = Метрики_ИдентификаторТрассировки();
	Категория = Метрики_КатегорияТрудностиСРаботойСМодулем();
	Действие = Метрики_ДействиеНегативныйОтзывОРаботеСМодулем();
	КоллекцияBoxId = Новый Массив;
	ИдентификаторыПользователей = Новый Массив;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	
	ЕстьПроблемыСОплатой = (СценарийМодуляДляОтзыва = СценарииМодуля.ОплатаСервиса);
	
	СтрокиКонтекста = Ядро.КонтекстСеанса_СтрокиКонтекста(ЕстьПроблемыСОплатой);
	
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		
		ЗначениеКонтекста = СтрокаКонтекста.Значение;
		
		ИдентификаторЯщика = ЗначениеКонтекста.Ящик.Идентификатор;
		ИдентификаторПользователя = ЗначениеКонтекста.Сессия.Пользователь.Идентификатор;
		
		КоллекцияBoxId.Добавить(ИдентификаторЯщика);
		
		Если ИдентификаторыПользователей.Найти(ИдентификаторПользователя) = Неопределено Тогда
			ИдентификаторыПользователей.Добавить(ИдентификаторПользователя);
		КонецЕсли;
		
	КонецЦикла;
	
	ИдентификаторБазы1С = Ядро.ОбщийКонтекст_Прочитать("ИдентификаторБазы1С");
	
	Переменные = Новый Структура;
	Переменные.Вставить("BoxId", КоллекцияBoxId);
	Переменные.Вставить("BaseID", ИдентификаторБазы1С);
	Переменные.Вставить("UserID", ИдентификаторыПользователей);
	Переменные.Вставить("Комментарий", Отзыв);
	
	Ядро.Метрика_ЗаписатьОбратнуюСвязь(
		Категория,
		Действие,
		Переменные,
		Трассировка);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ЗаписатьОС_НетТрудностейВРаботеСМодулем()
	
	Трассировка = Метрики_ИдентификаторТрассировки();
	Категория = Метрики_КатегорияТрудностиСРаботойСМодулем();
	Действие = Метрики_ДействиеПозитивныйОтзывОРаботеСМодулем();
	КоллекцияBoxId = Новый Массив;
	ИдентификаторыПользователей = Новый Массив;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	
	ЕстьПроблемыСОплатой = Ложь;
	Если СценарийМодуляДляОтзыва = СценарииМодуля.ОплатаСервиса Тогда
		ЕстьПроблемыСОплатой = Истина;
	КонецЕсли;
	
	СтрокиКонтекста = Ядро.КонтекстСеанса_СтрокиКонтекста(ЕстьПроблемыСОплатой);
	Для Каждого СтрокаКонтекста Из СтрокиКонтекста Цикл
		
		ЗначениеКонтекста = СтрокаКонтекста.Значение;
		
		ИдентификаторЯщика = ЗначениеКонтекста.Ящик.Идентификатор;
		ИдентификаторПользователя = ЗначениеКонтекста.Сессия.Пользователь.Идентификатор;
		
		КоллекцияBoxId.Добавить(ИдентификаторЯщика);
		
		Если ИдентификаторыПользователей.Найти(ИдентификаторПользователя) = Неопределено Тогда
			ИдентификаторыПользователей.Добавить(ИдентификаторПользователя);
		КонецЕсли;
		
	КонецЦикла;
	
	ИдентификаторБазы1С = Ядро.ОбщийКонтекст_Прочитать("ИдентификаторБазы1С");
	
	Переменные = Новый Структура;
	Переменные.Вставить("BoxId", КоллекцияBoxId);
	Переменные.Вставить("BaseID", ИдентификаторБазы1С);
	Переменные.Вставить("UserID", ИдентификаторыПользователей);
	
	Ядро.Метрика_ЗаписатьОбратнуюСвязь(
		Категория,
		Действие,
		Переменные,
		Трассировка);
	
КонецПроцедуры

&НаКлиенте
Функция Метрики_ИдентификаторТрассировки()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Результат = Ядро.TraceId();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрики_КатегорияТрудностиСРаботойСМодулем()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СценарииМодуля = Ядро.Перечисление_СценарииМодуляДляОтзывов();
	
	Если СценарийМодуляДляОтзыва = СценарииМодуля.РаботаСКонтрагентами Тогда
		Результат = "ТрудностиСКонтрагентами";
	ИначеЕсли СценарийМодуляДляОтзыва = СценарииМодуля.ОплатаСервиса Тогда
		Результат = "ТрудностиСПодписками";
	ИначеЕсли СценарийМодуляДляОтзыва = СценарииМодуля.ПоискДокументовНаОтправку Тогда
		Результат = "ТрудностиПриПоискеДокументов";
	ИначеЕсли СценарийМодуляДляОтзыва = СценарииМодуля.СобытияЛентыКонтрагентов Тогда
		Результат = "ТрудностиССобытиямиКА";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_ДействиеПозитивныйОтзывОРаботеСМодулем()
	Возврат "Нет"; // Пользователь сказал, что трудностей нет
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Метрики_ДействиеНегативныйОтзывОРаботеСМодулем()
	Возврат "Да"; // Пользователь сказал, что есть трудности и оставил отзыв
КонецФункции

//}		ОЦЕНКА РАБОТЫ МОДУЛЯ

// {	ПОДПИСКИ И ОПЛАТЫ

&НаСервере	
Процедура ОбработатьНаличиеПредложенийДляПокупки()
	
	МодульЯдро = Модуль_ЯдроНаСервере();
	
	ПредложенияДляВсехЛицевыхСчетов = МодульЯдро.ПредложенияДляПокупки_ПредложенияДляВсехЛицевыхСчетов();
	
	МодульЯдро.Метрика_ДобавитьСтатистику_ПредложенияДляПокупки(ПредложенияДляВсехЛицевыхСчетов);
	
	СводноеОписаниеПредложений = МодульЯдро.ЛичныйКабинет_ДоступныеТипыПредложений(ПредложенияДляВсехЛицевыхСчетов);
	
	Если СводноеОписаниеПредложений.ПодпискаНаМодульЗакончилась Тогда
	
		ПоказатьБаннерВосстановитьДоступ();
	
	ИначеЕсли СводноеОписаниеПредложений.ПодпискаНаМодульЗаканчивается Тогда
	
		ПоказатьБаннерПерейтиКПодпискамЗаканчиваетсяПодписка();
	
	ИначеЕсли СводноеОписаниеПредложений.ПакетЗакончился Тогда
	
		ПоказатьБаннерПерейтиКПодпискамЗакончилсяПакет();
	
	ИначеЕсли СводноеОписаниеПредложений.ПакетЗаканчивается Тогда
	
		ПоказатьБаннерПерейтиКПодпискамЗаканчиваетсяПакет();
	
	ИначеЕсли СводноеОписаниеПредложений.МаршрутЗакончился Тогда
	
		ПоказатьБаннерМаршрутЗакончился();
	
	ИначеЕсли СводноеОписаниеПредложений.МаршрутЗаканчивается Тогда
	
		ПоказатьБаннерМаршрутЗаканчивается();
	
	ИначеЕсли СводноеОписаниеПредложений.ЛицензияНаКоннекторы Тогда
	
		ПоказатьБаннерЛицензияНаКоннекторы();
	
	ИначеЕсли СводноеОписаниеПредложений.ЛицензияНаAPI Тогда
	
		ПоказатьБаннерЛицензияНаAPI();
	
	ИначеЕсли СводноеОписаниеПредложений.СертификатЗакончился Тогда
	
		ПоказатьБаннерСертификатЗакончился();
	
	ИначеЕсли СводноеОписаниеПредложений.СертификатЗаканчивается Тогда
	
		ПоказатьБаннерСертификатЗаканчивается();
	
	ИначеЕсли СводноеОписаниеПредложений.ПромоМодуля Тогда
	
		ПоказатьБаннерПромо();
	
	ИначеЕсли СводноеОписаниеПредложений.РекомендацияПлагинов Тогда
	
		ПоказатьБаннерРекомендацииПокупкиПлагинов();
		
	ИначеЕсли СводноеОписаниеПредложений.РекомендацияПакетов Тогда
	
		ПоказатьБаннерРекомендацииПокупкиПакетаДокументов();
		
	Иначе
	
		СброситьВидимостьБаннеровДляВсехТиповПредложений();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодпискиИОплата(Команда)

	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ТолькоСрочные", Ложь);
	
	РежимОткрытияФормы = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФормуДиадокМодально("ПодпискиИОплатаУправляемая", ЭтаФорма, ПараметрыОткрытияФормы, , РежимОткрытияФормы);
	
	ПоказатьПлашкуОтзываПоРаботеСОплатойСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодпискиИОплатаИзБаннера(Элемент)
	
	РежимОткрытияФормыПодпискиИОплата = РежимБаннераПриОткрытииФормыПодпискиИОплата();
	ОтображатьТолькоСрочные = НЕ (Элементы.НадписьТекстБаннераРекомендацияПакетаДокументов.Видимость
								ИЛИ Элементы.НадписьТекстБаннераРекомендацияПлагинов.Видимость);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ТолькоСрочные", ОтображатьТолькоСрочные);
	ПараметрыОткрытияФормы.Вставить("РежимБаннера", РежимОткрытияФормыПодпискиИОплата);
	
	РежимОткрытияФормы = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФормуДиадокМодально("ПодпискиИОплатаУправляемая", ЭтаФорма, ПараметрыОткрытияФормы, , РежимОткрытияФормы);
	
	ПоказатьПлашкуОтзываПоРаботеСОплатойСервиса();
	
КонецПроцедуры

&НаКлиенте
Функция РежимБаннераПриОткрытииФормыПодпискиИОплата()
	
	Если Элементы.ГруппаБаннерВосстановитьДоступ.Видимость Тогда
		
		Результат = "Восстановить доступ";
		
	ИначеЕсли Элементы.ГруппаБаннерПромо.Видимость Тогда
		
		Результат = "Получить доступ";
		
	ИначеЕсли Элементы.НадписьТекстБаннераРекомендацияПлагинов.Видимость Тогда
		
		Результат = "Подключить плагины";
		
	ИначеЕсли Элементы.НадписьТекстБаннераРекомендацияПакетаДокументов.Видимость Тогда
		
		Результат = "Подключить пакет";
		
	ИначеЕсли Элементы.НадписьТекстБаннераПерейтиКПодпискамЗакончилсяСертификат.Видимость
		ИЛИ Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяСертификат.Видимость Тогда
		
		Результат = "Продлить сертификат";
		
	Иначе
		Результат = "Перейти к подпискам";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КартинкаБаннераЗакрытьНажатие(Элемент)
	
	Элементы.ГруппаБаннер.Видимость = Ложь;
	
	Если Элементы.НадписьТекстБаннераРекомендацияПлагинов.Видимость Тогда 
	
		Модуль_Платформа().ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПлагинов();
	
	ИначеЕсли Элементы.НадписьТекстБаннераРекомендацияПакетаДокументов.Видимость Тогда 
	
		Модуль_Платформа().ПредложенияДляПокупки_ЗаписатьДатуЗакрытияРекомендацииПокупкиПакетаДокументов();
	
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерВосстановитьДоступ()
	
	ПоказатьБаннер(Элементы.ГруппаБаннерВосстановитьДоступ, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерПерейтиКПодпискамЗаканчиваетсяПодписка()
	
	ПоказатьБаннерПерейтиКПодпискам();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяПодписка.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерПерейтиКПодпискамЗакончилсяПакет()
	
	ПоказатьБаннерПерейтиКПодпискам();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗакончилсяПакет.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерПерейтиКПодпискамЗаканчиваетсяПакет()
	
	ПоказатьБаннерПерейтиКПодпискам();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяПакет.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерПерейтиКПодпискам()
	
	ПоказатьБаннер(Элементы.ГруппаБаннерПерейтиКПодпискам, Истина);
	Элементы.НадписьГиперссылкаБаннераПерейтиКПодпискам.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерВыпуститьСертификат()
	
	ПоказатьБаннер(Элементы.ГруппаБаннерПерейтиКПодпискам, Истина);
	Элементы.НадписьГиперссылкаБаннераВыпуститьСертификат.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерМаршрутЗакончился()
	
	ПоказатьБаннерПерейтиКПодпискам();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗакончилсяМаршрут.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерМаршрутЗаканчивается()
	
	ПоказатьБаннерПерейтиКПодпискам();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяМаршрут.Видимость = Истина;
	
КонецПроцедуры		

&НаСервере
Процедура ПоказатьБаннерЛицензияНаКоннекторы()
	
	ПоказатьБаннерПерейтиКПодпискам();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЛицензияНаКоннекторы.Видимость = Истина;
	
КонецПроцедуры		

&НаСервере
Процедура ПоказатьБаннерЛицензияНаAPI()
	
	ПоказатьБаннерПерейтиКПодпискам();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЛицензияНаAPI.Видимость = Истина;
	
КонецПроцедуры		

&НаСервере
Процедура ПоказатьБаннерСертификатЗакончился()
	
	ПоказатьБаннерВыпуститьСертификат();	
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗакончилсяСертификат.Видимость = Истина;
	
КонецПроцедуры		

&НаСервере
Процедура ПоказатьБаннерСертификатЗаканчивается()
	
	ПоказатьБаннерВыпуститьСертификат();
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяСертификат.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерПромо()
	
	ПоказатьБаннер(Элементы.ГруппаБаннерПромо, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерРекомендацииПокупкиПакетаДокументов()
	
	ТребуетсяПоказать = ОбработкаОбъект().ПредложенияДляПокупки_ТребуетсяПоказатьРекомендациюПокупкиПакетаДокументов();
	
	Если ТребуетсяПоказать Тогда
		
		ПоказатьБаннерРекомендации();
		Элементы.НадписьТекстБаннераРекомендацияПакетаДокументов.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерРекомендацииПокупкиПлагинов()
	
	ТребуетсяПоказать = ОбработкаОбъект().ПредложенияДляПокупки_ТребуетсяПоказатьРекомендациюПокупкиПлагинов();
	
	Если ТребуетсяПоказать Тогда
		
		ПоказатьБаннерРекомендации();
		Элементы.НадписьТекстБаннераРекомендацияПлагинов.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерРекомендации()
	
	ПоказатьБаннер(Элементы.ГруппаБаннерРекомендация, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннер(ГруппаОтображаемогоБаннера, ДоступноЗакрытиеБаннера)
	
	СброситьВидимостьБаннеровДляВсехТиповПредложений();
	
	Если НЕ Модуль_ЯдроНаСервере().ПриложениеСтаршеВерсии("8.3.8") Тогда
		Элементы.ГруппаБаннер.ЦветФона = ГруппаОтображаемогоБаннера.ЦветФона;
	КонецЕсли;
	
	ГруппаОтображаемогоБаннера.Видимость = Истина;
	Элементы.ГруппаБаннер.Видимость = Истина;
	Элементы.ГруппаБаннераЗакрыть.Видимость = ДоступноЗакрытиеБаннера;
	
КонецПроцедуры

&НаСервере
Процедура СброситьВидимостьБаннеровДляВсехТиповПредложений()
	
	Элементы.ГруппаБаннер.Видимость = Ложь;
	Элементы.ГруппаБаннерПромо.Видимость = Ложь;
	
	Элементы.ГруппаБаннерВосстановитьДоступ.Видимость = Ложь;
	
	Элементы.ГруппаБаннерПерейтиКПодпискам.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяПодписка.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяПакет.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗакончилсяПакет.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗакончилсяМаршрут.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяМаршрут.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЛицензияНаКоннекторы.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЛицензияНаAPI.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗакончилсяСертификат.Видимость = Ложь;
	Элементы.НадписьТекстБаннераПерейтиКПодпискамЗаканчиваетсяСертификат.Видимость = Ложь;
	Элементы.НадписьГиперссылкаБаннераПерейтиКПодпискам.Видимость = Ложь;
	Элементы.НадписьГиперссылкаБаннераВыпуститьСертификат.Видимость = Ложь;
	
	Элементы.ГруппаБаннерРекомендация.Видимость = Ложь;
	Элементы.НадписьТекстБаннераРекомендацияПакетаДокументов.Видимость = Ложь;
	Элементы.НадписьТекстБаннераРекомендацияПлагинов.Видимость = Ложь;
	
КонецПроцедуры

// }	ПОДПИСКИ И ОПЛАТЫ

// {	ЛОГИСТИКА

&НаСервере
Процедура УстановитьВидимостьЭлементовДляЛогистики()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ПредложитьУстановкуЛогистики = Ядро.КонтурЛогистика_ПредложитьУстановитьМодуль();
	ИспользуетсяМодульЛогистики = Ядро.КонтурЛогистика_ИспользуетсяМодульЛогистики();
	
	ПоказатьЭлементыЛогистики = ПредложитьУстановкуЛогистики ИЛИ ИспользуетсяМодульЛогистики;
	
	Элементы.ГруппаБаннерЛогистики.Видимость = ПредложитьУстановкуЛогистики;
	Элементы.РазделительОсновногоРаздела.Видимость = ПоказатьЭлементыЛогистики;
	Элементы.ОткрытьПеревозочныеДокументы.Видимость = ПоказатьЭлементыЛогистики;
	
КонецПроцедуры

&НаКлиенте
Процедура БаннерУстановкаЛогистикиТекстГиперссылкаНажатие(Элемент)
	
	ОткрытьМастерУстановкиЛогистики(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеревозочныеДокументы(Команда)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ИспользуетсяМодульЛогистики = Ядро.КонтурЛогистика_ИспользуетсяМодульЛогистики();
	
	Если ИспользуетсяМодульЛогистики Тогда
		
		Метрика_ПриПереходеНаРабочийСтолЛогистики();
		
		Период = Новый СтандартныйПериод(НастройкаВыбораПериода.ДатаНачала, НастройкаВыбораПериода.ДатаОкончания);
		
		Ядро.КонтурЛогистика_ОткрытьРабочийСтол(Период);
		
	Иначе
		ОткрытьМастерУстановкиЛогистики(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМастерУстановкиЛогистики(ПереходИзБаннера)
	
	Метрика_ПриОткрытииМастераУстановкиЛогистики(ПереходИзБаннера);
	
	ИмяОбработки = ПодключитьМастерУстановкиЛогистики();
	
	Если ИмяОбработки <> Неопределено Тогда
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", , ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодключитьМастерУстановкиЛогистики()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ОбработкаМастераУстановкиЛогистики = Ядро.КонтурЛогистика_ПодключитьМастерУстановки();
	
	Если ОбработкаМастераУстановкиЛогистики <> Неопределено Тогда
		Результат = ОбработкаМастераУстановкиЛогистики.Метаданные().Имя;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КартинкаБаннераЛогистикиЗакрытьНажатие(Элемент)
	
	Элементы.ГруппаБаннерЛогистики.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ОтображениеБаннераЛогистики()
	
	Если НЕ Элементы.ГруппаБаннерЛогистики.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Ядро.Метрика_НазваниеКатегории().ИнтеграцияСЛогистикой;
	ДействиеМетрики = Ядро.Метрика_НазваниеДействий().ОтображениеБаннераЛогистики;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("KonturBaseID", Ядро.ОбщийКонтекст_КонтурИдентификаторИБ());
	
	Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(
		КатегорияМетрики,
		ДействиеМетрики,
		,
		ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПриОткрытииМастераУстановкиЛогистики(ПереходИзБаннера)
	
	Метрика_НазваниеДействий = Метрика_НазваниеДействий();
	
	Если ПереходИзБаннера Тогда
		ДействиеМетрики = Метрика_НазваниеДействий.УстановкаИзБаннера;
	Иначе
		ДействиеМетрики = Метрика_НазваниеДействий.УстановкаПоКнопке;
	КонецЕсли;
	
	Метрика_ПриВыполненииДействияЛогистики(ДействиеМетрики);
	
КонецПроцедуры
	
&НаКлиенте
Процедура Метрика_ПриПереходеНаРабочийСтолЛогистики()
	
	ДействиеМетрики = Метрика_НазваниеДействий().ПереходВРабочийСтол;
	
	Метрика_ПриВыполненииДействияЛогистики(ДействиеМетрики);
	
КонецПроцедуры
	
&НаКлиенте
Процедура Метрика_ПриВыполненииДействияЛогистики(ДействиеМетрики)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	НаименованиеФормы = Метрика_НазваниеФормы();
	КатегорияМетрики = Метрика_НазваниеКатегории().ИнтеграцияСЛогистикой;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("KonturBaseID", Ядро.ОбщийКонтекст_КонтурИдентификаторИБ());
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		КатегорияМетрики,
		ДействиеМетрики);
	
	Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(
		КатегорияМетрики,
		ДействиеМетрики,
		,
		ДопПеременные);
	
КонецПроцедуры

// }	ЛОГИСТИКА

&НаКлиенте
Процедура Метрика_ПоказатьПредупреждениеОНеДоступностиКонфигурацииНаТарифе()
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	Метка = "";
	КатегорияМетрики = Метрика_КонфигурацияНеДоступна();
	ДействиеМетрики = Метрика_ОткрытиеФормы();
	
	Переменные = Новый Структура;
	Переменные.Вставить("Причина", СтатусПоддержкиКонфигурации);
	
	Модуль_Ядро.Метрика_ДобавитьСтатистику(
		КатегорияМетрики,
		ДействиеМетрики,
		Метка,
		Переменные);
	
КонецПроцедуры
	
&НаКлиенте
Процедура Метрика_УзнатьПодробнееОНеДоступностиКонфигурацииНаТарифе()
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	НаименованиеФормы = Метрика_НазваниеФормы();
	КатегорияМетрики = Метрика_КонфигурацияНеДоступна();
	ДействиеМетрики = Метрика_УзнатьПодробнее();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		КатегорияМетрики,
		ДействиеМетрики);
	
	Модуль_Ядро.Метрика_ДобавитьСтатистику(
		КатегорияМетрики,
		ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ЗаписатьВернутьсяКВыборуОрганизаций()
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	НаименованиеФормы = Метрика_НазваниеФормы();
	КатегорияМетрики = Метрика_КонфигурацияНеДоступна();
	ДействиеМетрики = Метрика_ВернутьсяКВыборуОрганизаций();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		КатегорияМетрики,
		ДействиеМетрики);
	
	Модуль_Ядро.Метрика_ДобавитьСтатистику(
		КатегорияМетрики,
		ДействиеМетрики);
	
КонецПроцедуры

	
&НаКлиенте
Процедура Метрика_ПоказатьПредупреждениеОТарифе()
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	КатегорияМетрики = Метрика_НастройкаНедоступна();
	ДействиеМетрики = Метрика_ОткрытиеФормы();
	НазваниеФормы = Метрика_НазваниеФормы();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы, 
		КатегорияМетрики, 
		ДействиеМетрики);
		
	Модуль_Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(
		КатегорияМетрики, 
		ДействиеМетрики);

КонецПроцедуры

&НаКлиенте
Функция Метрика_ОткрытиеФормы()
	
	Возврат "ОткрытиеФормы";

КонецФункции

&НаКлиенте
Функция Метрика_НастройкаНедоступна()
	
	Возврат "НастройкаНедоступна";

КонецФункции

&НаКлиенте
Функция Метрика_КонфигурацияНеДоступна()
	
	Возврат "КонфигурацияНедоступна";

КонецФункции

&НаКлиенте
Функция Метрика_УзнатьПодробнее()
	
	Возврат "УзнатьПодробнее";

КонецФункции

&НаКлиенте
Функция Метрика_ВернутьсяКВыборуОрганизаций()
	
	Возврат "ВернутьсяКВыборуОрганизаций";

КонецФункции

//{		НАЙТИ НУЖНЫЙ ДОКУМЕНТ

&НаКлиенте
Процедура ОткрытьПомощникПоискаДокумента(Команда)
	
	Метрики_ЗаписатьНажатие_НайтиНужныйДокумент();
	Метрики_ЗаписатьСтатистику_НайтиНужныйДокумент();
	
	ОбработчикОткрытияФормыПоискаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ЗаписатьНажатие_НайтиНужныйДокумент()
	
	КатегорияМетрики = Метрика_КатегорияНайтиНужныйДокумент();
	ДействиеМетрики = Метрика_ДействиеОткрытиеПомощника();
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ЗаписатьСтатистику_НайтиНужныйДокумент()
	
	КатегорияМетрики = Метрика_КатегорияНайтиНужныйДокумент();
	ДействиеМетрики = Метрика_ДействиеОткрытиеПомощника();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОткрытияФормыПоискаДокумента()
	
	ОбработчикЗакрытия = НовыйОписаниеОповещения(
		"ОбработчикЗакрытияФормыПоискаДокумента",
		ЭтаФорма
	);
	
	Платформа = Модуль_Платформа();
	Платформа.ПоказатьПомощникПоискаДокумента(ОбработчикЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыПоискаДокумента(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПоказатьПлашкуОтзываПоРаботеСПоискомДокументовНаОтправку();
	
КонецПроцедуры

//}		НАЙТИ НУЖНЫЙ ДОКУМЕНТ

// { Лента контрагентов

&НаКлиенте
Процедура СобытияЛентыКонтрагентов(Команда)
	
	КатегорияМетрики = "ЛентаКонтрагентов";
	ДействиеМетрики = "События";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	Элементы.ГруппаСобытияЛентыКонтрагентов.Видимость =
		НЕ Элементы.ГруппаСобытияЛентыКонтрагентов.Видимость;
	
	Если ПоказыватьОнбордингЛентыКонтрагентов 
		И Элементы.ГруппаСобытияЛентыКонтрагентов.Видимость Тогда
		
		ПоказатьОнбордингСобытияЛентыКонтрагентов();
		
	КонецЕсли;
	
	ПоказатьПлашкуОтзываПоРаботеСЛентойКонтрагентов();
	
	ДействиеМетрики = "ОткрытиеФормы";
	
	Если НЕ Элементы.ГруппаСобытияЛентыКонтрагентов.Видимость Тогда
		
		ДействиеМетрики = "ЗакрытиеФормы";
		
	КонецЕсли;
	
	Если  Элементы.ГруппаСобытияЛентыКонтрагентов.Видимость Тогда
		
		НачатьУстановкуПоляСобытияКонтрагентов();
		
	КонецЕсли;
	
	Метрика_ДобавитьСтатистику_ПоКонтексту(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстПоляСобытияЛентыКонтрагентовНаСервере()
	
	МодульЯдро = Модуль_ЯдроНаСервере();
	// BSLLS:UnusedLocalVariable-off
	HTMLЛентаКонтрагентов = МодульЯдро.HTML_СобытияЛентыКонтрагентов(
			ЛентаКонтрагентовОрганизация);
	// BSLLS:UnusedLocalVariable-on
КонецПроцедуры

&НаСервере
Процедура НастроитьИнтерфейсЛентыКонтрагентов()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Если НЕ УведомлятьОНовыхСобытиях Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СписокДляОтбора = Элементы.ЛентаКонтрагентовОрганизация.СписокВыбора;
	
	СписокДляОтбораОрганизации = Ядро.Организации_СписокОрганизацийДляВыбора(Ложь);
	
	Для Каждого ТекОрганизация Из СписокДляОтбораОрганизации Цикл
		
		Если НЕ ЗначениеЗаполнено(ЛентаКонтрагентовОрганизация) Тогда
			ЛентаКонтрагентовОрганизация = ТекОрганизация.Значение;
		КонецЕсли;
		
		НовыйЭлемент = СписокДляОтбора.Добавить();
		НовыйЭлемент.Значение = ТекОрганизация.Значение;
		НовыйЭлемент.Представление = ТекОрганизация.Представление;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСобытияЛентыКонтрагентов()
	
	Ядро = Модуль_ЯдроНаСервере();
	
	Если НЕ УведомлятьОНовыхСобытиях Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.СобытияЛентыКонтрагентов.ЦветФона = Новый Цвет();
	БиблиотекаКартинокЯдра = Ядро.БиблиотекаКартинок();
	ОформлениеКругОранжевый16 = БиблиотекаКартинокЯдра.ОформлениеКругОранжевый16;
	ОформлениеПустое16 = БиблиотекаКартинокЯдра.ОформлениеПустое16;
	
	ЛентаКонтрагентовОрганизация = Неопределено;
	
	СписокДляОтбора = Элементы.ЛентаКонтрагентовОрганизация.СписокВыбора;
	СписокДляОтбора.Очистить();
	
	СписокДляОтбораОрганизации = Ядро.Организации_СписокОрганизацийДляВыбора(Ложь);
	
	Для Каждого ТекОрганизация Из СписокДляОтбораОрганизации Цикл
		
		НовыйЭлемент = СписокДляОтбора.Добавить();
		НовыйЭлемент.Значение = ТекОрганизация.Значение;
		НовыйЭлемент.Представление = ТекОрганизация.Представление;
		
		ЕстьНовыеСобытия = Ядро.ЛентаКонтрагентов_ЕстьНовыеСобытияДляПользователя(
				ТекОрганизация.Значение);
		
		Если ЕстьНовыеСобытия Тогда
			
			ЛентаКонтрагентовОрганизация = ТекОрганизация.Значение;
			// BSLLS:MagicNumber-off
			Элементы.СобытияЛентыКонтрагентов.ЦветФона = Новый Цвет(255, 237, 166);
			// BSLLS:MagicNumber-on
			НовыйЭлемент.Картинка = ОформлениеКругОранжевый16;
			
		Иначе
			
			НовыйЭлемент.Картинка = ОформлениеПустое16;

		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЛентаКонтрагентовОрганизация)
		И ЗначениеЗаполнено(СписокДляОтбора) Тогда
		
		ЛентаКонтрагентовОрганизация = СписокДляОтбора[0].Значение;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛентаКонтрагентовОрганизация) 
		И Элементы.ГруппаСобытияЛентыКонтрагентов.Видимость Тогда
		
		УстановитьТекстПоляСобытияЛентыКонтрагентовНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛентаКонтрагентовОрганизацияПриИзменении(Элемент)
	
	КатегорияМетрики = "ЛентаКонтрагентов";
	ДействиеМетрики = "СменаФильтраПоОрганизации";
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
	НачатьУстановкуПоляСобытияКонтрагентов();	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуПоляСобытияКонтрагентов()
	
	Элементы.ГруппаПолеСобытий.Видимость = Ложь;
	Элементы.ДекорацияЗагрузкиСобытий.Видимость = Истина;
	
	ПодключитьОбработчикОжидания(
		"ЗавершитьУстановкуПоляСобытияКонтрагентов", 
		0.01, 
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУстановкуПоляСобытияКонтрагентов() Экспорт
	
	УстановитьТекстПоляСобытияЛентыКонтрагентовНаСервере();
	
	Элементы.ГруппаПолеСобытий.Видимость = Истина;
	Элементы.ДекорацияЗагрузкиСобытий.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLЛентаКонтрагентовПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	АдресСсылки = Неопределено;
	ДополнительныеПараметры = Неопределено;
	
	ДанныеСобытия.Свойство("href", АдресСсылки);
	                           
	Если ЗначениеЗаполнено(АдресСсылки) Тогда
		// BSLLS:UnusedLocalVariable-off
		СтандартнаяОбработка = Ложь;
		// BSLLS:UnusedLocalVariable-on
		ОповеститьИлиПерейтиПоСсылке(
			АдресСсылки,
			ДополнительныеПараметры,
			ЭтаФорма);
			
		Метрика_ПерейтиПоСсылкеЛентыКонтрагентов(АдресСсылки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПерейтиПоСсылкеЛентыКонтрагентов(АдресСсылки)
	
	КатегорияМетрики = "ЛентаКонтрагентов";
	// BSLLS:DeprecatedFind-off
	Если Найти(АдресСсылки, "ПосмотретьПриглашение") > 0 Тогда
		
		ДействиеМетрики = "ПосмотретьПриглашение";
		
	ИначеЕсли Найти(АдресСсылки, "ПосмотретьКомментарии") > 0 Тогда
		
		ДействиеМетрики = "ПосмотретьКомментарий";
		
	ИначеЕсли Найти(АдресСсылки, "ОткрытьСопоставлениеКонтрагента") > 0 Тогда
		
		ДействиеМетрики = "СопоставитьКонтрагента";
		
	Иначе
		
		ДействиеМетрики = "НеизвестнаяСсылка";
		
	КонецЕсли;
	// BSLLS:DeprecatedFind-on
	
	Метрика_ЗаписатьНажатиеКнопки(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьКомментарииКонтрагента(
		Base64Строка,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	ДанныеСтроки = ДанныеКомментарияДляОповещения(Base64Строка);
	
	ЗаголовокФормыПредупреждения = ДанныеСтроки.ЗаголовокФормыПредупреждения;
	Комментарий = ДанныеСтроки.Комментарий;
	ТекстПредупреждения = ДанныеСтроки.ТекстПредупреждения;

	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОткрытьФормуПредупреждения(
		ТекстПредупреждения,
		Комментарий,
		ЗаголовокФормыПредупреждения);
	
КонецПроцедуры
	
&НаСервере
Функция ДанныеКомментарияДляОповещения(Знач Base64Строка)
	
	Ядро = Модуль_ЯдроНаСервере();
	ЗначениеДанных = Base64Значение(Base64Строка);
	СтрокаДанных = Ядро.СтрокаИзДвоичныхДанных(ЗначениеДанных);
	Результат = Ядро.ПарсерJSON_Прочитать(СтрокаДанных);
	
	Возврат Результат;
	
КонецФункции
	
&НаКлиенте
Процедура ОткрытьСопоставлениеКонтрагента(
		ИденификаторКонтрагента = Неопределено,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	ДанныеОрганизации = ДанныеОрганизации(ЛентаКонтрагентовОрганизация);
	ДанныеКонтрагента = ДанныеКонтрагента(ЛентаКонтрагентовОрганизация, ИденификаторКонтрагента);
	
	ОткрытьФормуКонтрагента(ДанныеОрганизации, ДанныеКонтрагента);
	
КонецПроцедуры

&НаСервере
// BSLLS:MissingReturnedValueDescription-off
// BSLLS:MissingParameterDescription-off
Функция ДанныеКонтрагента(Знач ИдентификаторОрганизации, Знач ИденификаторКонтрагента)
	// BSLLS:MissingReturnedValueDescription-on
	// BSLLS:MissingParameterDescription-on
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	ИдентификаторыКонтрагента = Модуль_Ядро.Новый_ИдентификаторыСправочника(
			Неопределено,
			ИденификаторКонтрагента);
	
	ДанныеКонтрагента = Модуль_Ядро.Контрагенты_ЗаполненныеРеквизиты(
			ИдентификаторыКонтрагента);
	
	Если ИспользуетсяПодсистемаДиадок
		И НЕ ЗначениеЗаполнено(ДанныеКонтрагента.ID) Тогда
		
		ДанныеКонтрагента = Модуль_Ядро.Контрагенты_ДанныеКонтрагентаАПИ(
				ИдентификаторОрганизации,
				ИденификаторКонтрагента);
		
		Модуль_Ядро.Контрагенты_ОбновитьКонтрагентаЭДО(
			ДанныеКонтрагента,
			ИдентификаторОрганизации);
		
		ДанныеКонтрагента = Модуль_Ядро.Контрагенты_ЗаполненныеРеквизиты(
				ИдентификаторыКонтрагента);
		
	КонецЕсли;
	
	Возврат ДанныеКонтрагента;
	
КонецФункции

&НаСервере
Функция ДанныеОрганизации(Знач ИдентификаторОрганизации)
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	ИдентификаторыОрганизации = Модуль_Ядро.Новый_ИдентификаторыСправочника(
			Неопределено,
			ИдентификаторОрганизации);
	
	ДанныеОрганизации = Модуль_Ядро.Организации_ЗаполненныеРеквизиты(
			ИдентификаторыОрганизации);
	
	Возврат ДанныеОрганизации;
	
КонецФункции
	
&НаКлиенте
Процедура ПосмотретьПриглашениеКонтрагента(
		ИденификаторКонтрагента = Неопределено,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	ПоказатьФормуВыбранногоПриглашения(ИденификаторКонтрагента);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПоказатьФормуВыбранногоПриглашения(ИденификаторКонтрагента)
	
	ДополнительныеПараметры = ПараметрыОткрытияФормыПриглашенияКонтрагента(
			ИденификаторКонтрагента);
	
	ПоказатьФормуПриглашения(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуПриглашения(ДополнительныеПараметры)
	
	ОписаниеЗакрытияФормы = НовыйОписаниеОповещения(
			"ЗакрытаФормаПриглашения",
			ЭтаФорма,
			ДополнительныеПараметры
		);
	
	ОткрытьФормуДиадокМодально(
		"ФормаПриглашенияУправляемая",
		ЭтаФорма,
		ДополнительныеПараметры,
		ОписаниеЗакрытияФормы
	);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыПриглашенияКонтрагента(ИденификаторКонтрагента)
	
	Результат = Новый Структура;
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	ДанныеОрганизации = ДанныеОрганизации(ЛентаКонтрагентовОрганизация);
	ДанныеКонтрагента = ДанныеКонтрагента(
		ЛентаКонтрагентовОрганизация, 
		ИденификаторКонтрагента);

	ПараметрКонтрагенты = Новый Массив;
	ПараметрКонтрагенты.Добавить(ДанныеКонтрагента);
	
	Приглашения = Модуль_Ядро.Контрагенты_КомментарийИДокументПриглашения(
			ДанныеОрганизации,
			ПараметрКонтрагенты
		);
	
	Приглашение = Приглашения.Получить(ДанныеКонтрагента.ID);
	
	Результат.Вставить("Приглашение", Приглашение);
	Результат.Вставить("ДанныеОрганизации", ДанныеОрганизации);
	Результат.Вставить("ДанныеКонтрагента", ДанныеКонтрагента);
	
	Если ДанныеКонтрагента.Статус = Статус_ОжидаемОтветНаПриглашение() Тогда
		РежимОткрытия = "Исходящее";
	Иначе
		РежимОткрытия = "Входящее";
	КонецЕсли;
	
	Результат.Вставить("ТекущийРежим", РежимОткрытия);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытаФормаПриглашения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = НРег(Результат.Команда);
	
	Если Команда = НРег("Отменить") Тогда
		Возврат;
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-off
	Если Команда = НРег("Отказать") Тогда
		
		ОтказатьВПриглашении(ДополнительныеПараметры);
		
	ИначеЕсли Команда = НРег("Принять") Тогда
		
		ПринятьКонтрагентов(ДополнительныеПараметры);
		
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-on
	НачатьУстановкуПоляСобытияКонтрагентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВПриглашении(ДополнительныеПараметры)
	
	ОписаниеЗакрытияФормы = НовыйОписаниеОповещения(
			"ОтказатьВПриглашенииЗавершение",
			ЭтаФорма,
			ДополнительныеПараметры
		);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", "ОтказатьВПриглашении");
	
	ОткрытьФормуДиадокМодально(
		"ФормаВводаV2Управляемая",
		ЭтаФорма,
		ПараметрыФормы,
		ОписаниеЗакрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВПриглашенииЗавершение(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = Результат.Комментарий;
	
	ОтказатьВПриглашенииКонтрагентовНаСервере(
		Комментарий,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ОтказатьВПриглашенииКонтрагентовНаСервере(Знач Комментарий, Знач ДополнительныеПараметры)
	
	Контрагенты_Заблокировать(
			ДополнительныеПараметры,
			Комментарий);
	
	НовыйСтатус = Статус_РаботаетВДиадок();
	
	ОбновитьДанныеКонтрагентаВКэше(
		ДополнительныеПараметры,
		НовыйСтатус);
	
КонецПроцедуры

&НаСервере
Функция Контрагенты_Заблокировать(Знач ДополнительныеПараметры, Комментарий)
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	ДанныеОрганизации = ДополнительныеПараметры.ДанныеОрганизации;
	ДанныеКонтрагента = ДополнительныеПараметры.ДанныеКонтрагента;
	
	МассивКонтрагентов = Новый Массив;
	МассивКонтрагентов.Добавить(ДанныеКонтрагента);
	
	Результат = Модуль_Ядро.Контрагенты_Заблокировать(
			ДанныеОрганизации,
			МассивКонтрагентов,
			Комментарий
		);
	
	НовыйСтатус = Статус_ЗаблокированМной();
	
	Модуль_Ядро.Контрагенты_ЗаписатьСтатусДляМассиваКонтрагентов(
		ДанныеОрганизации,
		Результат,
		НовыйСтатус
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПринятьКонтрагентов(ДополнительныеПараметры)
	
	ИдентификаторЯщика = ДополнительныеПараметры.ДанныеОрганизации.ID;
	
	ОписаниеДоверенности = МашиночитаемаяДоверенность(ИдентификаторЯщика);
	
	Если ЗначениеЗаполнено(ОписаниеДоверенности.Ошибки) Тогда
		
		ВыбраннаяМЧД = ОписаниеДоверенности.МЧД;
		ДействиеЭДО = "";
		
		ОписаниеОповещенияОЗавершении = НовыйОписаниеОповещения(
				"ПринятьКонтрагентовЗавершение",
				ЭтаФорма,
				ДополнительныеПараметры);
		
		ПараметрыДляПроверкиМЧД = ПараметрыДляПроверкиМЧД(
				ОписаниеОповещенияОЗавершении,
				ИдентификаторЯщика,
				ВыбраннаяМЧД,
				ДействиеЭДО
			);
		
		ПараметрыДляПроверкиМЧД.ОшибкиПроверокМЧД = ОписаниеДоверенности.Ошибки;
		
		ОписаниеОповещения = НовыйОписаниеОповещения(
				"ОбработатьРезультатПриГрупповыхДействияхНаФормеВопросаМЧД",
				ЭтаФорма,
				ПараметрыДляПроверкиМЧД
			); 
			
		МодульПлатформа = Модуль_Платформа();
		
		МодульПлатформа.ПоказатьВопрос_НетПодходящейДоверенности(
			ПараметрыДляПроверкиМЧД,
			ОписаниеОповещения
		);
		
	Иначе
		
		ПринятьКонтрагентовЗавершение(
			ОписаниеДоверенности.МЧД,
			ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция МашиночитаемаяДоверенность(ИдентификаторЯщика)
	
	Результат = Новый Структура;
	Результат.Вставить("МЧД");
	Результат.Вставить("Ошибки");
	
	МодульПлатформа = Модуль_Платформа();
	
	Если НЕ МодульПлатформа.ТребуетсяМЧД(ИдентификаторЯщика) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОшибкиПроверкиМЧД = Новый Массив;
	
	ИдентификаторыЯщиков = Новый Массив;
	ИдентификаторыЯщиков.Добавить(ИдентификаторЯщика);
	
	КонтрактыМЧД = МодульПлатформа.ПолучитьДействующиеМЧДпоУмолчанию(
			ИдентификаторыЯщиков,
			ОшибкиПроверкиМЧД);
	
	КонтрактМЧД = КонтрактыМЧД.Получить(ИдентификаторЯщика);
	
	Результат.МЧД = КонтрактМЧД;
	Результат.Ошибки = ОшибкиПроверкиМЧД;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПринятьКонтрагентовЗавершение(КонтрактМЧД, ДополнительныеПараметры) Экспорт
	
	Приглашение = ДополнительныеПараметры.Приглашение;
	
	СведенияОФайле = Приглашение.Файл;
	
	Если СведенияОФайле.ТребуетсяПодпись Тогда
		
		Модуль_Ядро = Модуль_ЯдроНаКлиенте();
		
		ДанныеПодписи = Модуль_Ядро.ПодписьДанных(
				ДополнительныеПараметры.ДанныеОрганизации.ID,
				СведенияОФайле.Данные);
		
		СведенияОФайле.Вставить("ДанныеПодписи", ДанныеПодписи);
		
		Если ЗначениеЗаполнено(КонтрактМЧД) Тогда
			СведенияОФайле.Вставить("КонтрактМЧД", КонтрактМЧД);
		КонецЕсли;
		
	КонецЕсли;
	
	ПринятьКонтрагентовНаСервере(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПринятьКонтрагентовНаСервере(Знач ДополнительныеПараметры)
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	Приглашения = Новый Соответствие;
	Приглашения.Вставить(
		ДополнительныеПараметры.ДанныеКонтрагента.ID,
		ДополнительныеПараметры.Приглашение);
	
	Модуль_Ядро.Контрагенты_ПринятьПриглашение(
		ДополнительныеПараметры.ДанныеОрганизации,
		Приглашения
	);
	
	НовыйСтатус = Статус_МойКонтрагент();
	
	ОбновитьДанныеКонтрагентаВКэше(
		ДополнительныеПараметры,
		НовыйСтатус);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКонтрагентаВКэше(Знач ДополнительныеПараметры, НовыйСтатус = Неопределено)
	
	Ядро = Модуль_ЯдроНаСервере();
	
	ПараметрыСпискаДляСпискаДокументов = Ядро.Контрагенты_ПараметрыПолученияСпискаПартнеров(
			ДополнительныеПараметры.ДанныеОрганизации);
	КэшКонтрагентовДляСпискаДокументов = Ядро.Контрагенты_ЗаполненныйСписок(
			ПараметрыСпискаДляСпискаДокументов);
	
	ДанныеКонтрагента = ДополнительныеПараметры.ДанныеКонтрагента;
	
	УдалитьДанныеКонтрагентаИзСписка(
		КэшКонтрагентовДляСпискаДокументов,
		ДанныеКонтрагента);
	
	Если ДанныеКонтрагента.Статус = Статус_МойКонтрагент() Тогда
		
		СтрокаТаблицы = КэшКонтрагентовДляСпискаДокументов.Добавить();
		СтрокаТаблицы.РеквизитыСвязанныхСправочников = ДанныеКонтрагента.СвязанныеСправочники;
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеКонтрагента);
		
		Ядро.Кэш_Поместить(
			ПараметрыСпискаДляСпискаДокументов.Ключ,
			КэшКонтрагентовДляСпискаДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДанныеКонтрагентаИзСписка(Список, Знач НовыеДанныеКонтрагента)
	
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("ID", НовыеДанныеКонтрагента.ID);
	
	СтрокиСписка = Список.НайтиСтроки(ПараметрыОтбораСтрок);
	
	Для Каждого СтрокаСписка Из СтрокиСписка Цикл
		
		Список.Удалить(СтрокаСписка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтрагента(ДанныеОрганизации, ДанныеКонтрагента)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ID", ДанныеКонтрагента.ID);
	ПараметрыФормы.Вставить("ДанныеКонтрагента", ДанныеКонтрагента);
	ПараметрыФормы.Вставить("ДанныеОрганизации", ДанныеОрганизации);
	ПараметрыФормы.Вставить("ИмяСправочника", "Контрагенты"); 
	ПараметрыФормы.Вставить("ОткрытоИзМастераПервогоЗапуска", Истина);
	
	ОписаниеОповещения = НовыйОписаниеОповещения(
			"ПослеЗакрытияФормыКонтрагента",
			ЭтаФорма,
			ПараметрыФормы);
	
	ОткрытьФормуДиадокМодально(
		"ФормаЭлементаСправочникаУправляемая",
		ЭтаФорма,
		ПараметрыФормы,
		ОписаниеОповещения);
	
КонецПроцедуры
		
&НаКлиенте
Процедура ПослеЗакрытияФормыКонтрагента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьУстановкуПоляСобытияКонтрагентов();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Статус_МойКонтрагент()
	
	Возврат "IsMyCounteragent";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Статус_ЗаблокированМной()
	
	Возврат "isRejectedByMe";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Статус_РаботаетВДиадок()
	
	Возврат "NotInCounteragentList";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Статус_ОжидаемОтветНаПриглашение()
	
	Возврат "IsInvitedByMe";
	
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	// ШХ
	
	//ТребуетсяОбновитьСписок = Ложь;
	//
	//Если Параметры.Свойство("РежимПодписания") Тогда
	//	
	//	Если Не шхРежимПодписания = Параметры.РежимПодписания Тогда
	//		шхРежимПодписания = Параметры.РежимПодписания;
	//		ТребуетсяОбновитьСписок = Истина;
	//	КонецЕсли;
	//	
	//	Если шхРежимПодписания Тогда
	//		
	//		РежимОтображенияПриЗапуске = РежимыОтображения().Входящие;
	//		
	//		Если Параметры.Свойство("ТекущийДокумент") Тогда
	//			Если Не ТипЗнч(Параметры.ТекущийДокумент) = Тип("Массив") Тогда
	//				ПереводВМассив = Новый Массив;
	//				ПереводВМассив.Добавить(Параметры.ТекущийДокумент);
	//				шхТекущиеДокументы = Новый ФиксированныйМассив(ПереводВМассив);
	//			Иначе
	//				шхТекущиеДокументы = Новый ФиксированныйМассив(Параметры.ТекущийДокумент);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//ИначеЕсли шхРежимПодписания Тогда
	//	
	//	шхРежимПодписания = Ложь;
	//	шхТекущиеДокументы = Неопределено;
	//	ТребуетсяОбновитьСписок = Истина;
	//	
	//КонецЕсли;
	//
	//Если ТребуетсяОбновитьСписок Тогда
	//	Элементы.шхКнопкаВыполнитьОтклонитьЭтап.Доступность = шхРежимПодписания;
	//	ОжиданиеОбновленияСписка();
	//КонецЕсли;
	
КонецПроцедуры

//}		НАЙТИ НУЖНЫЙ ДОКУМЕНТ

#Область ДоработкиШХ

&НаКлиенте
Процедура шхРежимПользователяПриИзменении(Элемент) // + шх
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура шхВыполнитьОтклонитьЭтап(Команда) // + шх Калашников АН - 00-00020261: Сделать возможность массово подписывать документы в Диадоке

	ПричинаОтклонения = "";
	
	Оповещение = Новый ОписаниеОповещения("шхОбработатьОтклонитьПослеВводаКомментария", ЭтотОбъект);
	
	ПоказатьВводСтроки(Оповещение, ПричинаОтклонения, "Причина отклонения",, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура шхОбработатьОтклонитьПослеВводаКомментария(Строка, ДополнительныеПараметры) Экспорт // + шх Калашников АН - 00-00020261: Сделать возможность массово подписывать документы в Диадоке
	
	ВыделенныеСтроки = Новый Массив;
	ДанныеДокументов = Новый Массив;
	Для Каждого СтрокаСписка Из СписокДокументов Цикл
		Если СтрокаСписка.Флажок Тогда
			
			СтруктураСтроки = Новый_СтруктураДанныхСтрокиСписка(СтрокаСписка);
			Если СтрокаСписка.Видимость И Не СтрокаСписка.Шаблон Тогда
				ДанныеДокументов.Добавить(СтруктураСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДляОбработки = МассивДокументовИзДанныхДокументов(ДанныеДокументов);
	Действие = "ШХ_ОтклонитьЭтап";
	КатегорияМетрики = "";
	ДействиеМетрики = "";
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(ДанныеДляОбработки, Действие, КатегорияМетрики, ДействиеМетрики);
	ПараметрыОбработки.Вставить("КомментарийОтклонения", Строка);
	
	ПолучитьСогласиеНаГрупповуюОбработкуВыделенныхСтрок("шхОбработатьОтклонитьЭтап", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура шхОбработатьОтклонитьЭтап(ПараметрОповещения = Неопределено, ПараметрыОбработки) Экспорт // + шх Калашников АН - 00-00020261: Сделать возможность массово подписывать документы в Диадоке

	шхОтклонитьИСнятьСЭтапа(ПараметрыОбработки.ДанныеДляОбработки, ПараметрыОбработки.КомментарийОтклонения);
	
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");		
	Оповестить("СостояниеЗаявкиПриИзменении");

	ОбновитьСписок();	
	
КонецПроцедуры

&НаСервере
Процедура шхОтклонитьИСнятьСЭтапа(Знач ДанныеДляОбработки, Знач Комментарий = "") // + шх Калашников АН - 00-00020261: Сделать возможность массово подписывать документы в Диадоке

	Для Каждого ТекДанные Из ДанныеДляОбработки Цикл
		Если ТекДанные.ЭтапПодписания Тогда
			ТекущийЭтап_ = Новый Структура();
		    ТекущийЭтап_.Вставить("Этап", ТекДанные.Этап);
		    ТекущийЭтап_.Вставить("ДокументСогласования", ТекДанные.Процесс); // документСсылка.ЭкземплярПроцесса
		    ТекущийЭтап_.Вставить("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ДокументУчета, "Организация"));
		    ТекущийЭтап_.Вставить("Комментарий", Комментарий);
		    Замещение = (ТекДанные.Подписывает <> Пользователи.ТекущийПользователь()); // Пользователь по этапу не равен текущему пользователю
		    МодульУправленияПроцессамиУХ.ВернутьДокументНаДоработку(, ТекущийЭтап_, ТекДанные.ДокументУчета, ТекДанные.Подписывает, Замещение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция шхДанныеПоТекущемуДокументу(Знач ТекущийДокумент) // ШХ // т1к О.Н.Кошелев, 2023-11-09{Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Диадок_Документы.Документ КАК Источник,
	               |	Диадок_Документы.Организация КАК Организация,
	               |	Диадок_Документы.Контрагент КАК Контрагент,
	               |	Диадок_Документы.ДатаДокумента КАК ДатаДокумента,
	               |	Диадок_Документы.ДатаЗагрузки КАК ДатаЗагрузки,
	               |	Диадок_Документы.Ссылка КАК ДокументДиадок,
	               |	Диадок_Документы.LetterId КАК Пакет
	               |ИЗ
	               |	Справочник.Диадок_Документы КАК Диадок_Документы
	               |ГДЕ
	               |	Диадок_Документы.Документ В(&Документ)";
	Запрос.УстановитьПараметр("Документ", ТекущийДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеПотекущемуДокументу = Новый Структура("Источник,ДатаДокумента,ДатаЗагрузки,ДокументДиадок,Контрагент,Пакет");
		ЗаполнитьЗначенияСвойств(ДанныеПотекущемуДокументу, Выборка);
		Результат.Добавить(ДанныеПотекущемуДокументу);
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

// }Лента контрагентов
