//**********************************************
//{		ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция Прочитать(Строка) Экспорт
	
	#Если ВебКлиент Тогда
		
		ТекстОшибки = НСтр("ru = 'Вэб клиенте не поддерживается чтение из строки JSON'");
		
		ВызватьИсключение ТекстОшибки;
		
	#КонецЕсли
	
	Результат = Платформа_ПрочитатьJSON(Строка);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Записать(Значение) Экспорт
	
	#Если ВебКлиент Тогда
		
		ТекстОшибки = НСтр("ru = 'Вэб клиенте не поддерживается запись в строку JSON'");
		
		ВызватьИсключение ТекстОшибки;
		
	#КонецЕсли
	
	Результат = Платформа_ЗаписатьJSON(Значение);
	
	Возврат Результат;
	
КонецФункции

//}		ПРОГРАММНЫЙ ИНТЕРФЕЙС

//**********************************************
//{		ЧТЕНИЕ И ЗАПИСЬ JSON

&НаКлиенте
Функция Платформа_ПрочитатьJSON(Строка)
	
	ЕстьОшибкаЧтенияИзСтроки = Ложь;
	ЕстьОшибкаЧтенияИзФайла = Ложь;
	
	Результат = Платформа_ПрочитатьИзСтроки(
			Строка,
			ЕстьОшибкаЧтенияИзСтроки
		);
	
	Если ЕстьОшибкаЧтенияИзСтроки Тогда
		
		Результат = Платформа_ПрочитатьИзФайла(
				Строка,
				ЕстьОшибкаЧтенияИзФайла
			);
		
	КонецЕсли;
	
	Отказ = (ЕстьОшибкаЧтенияИзСтроки И ЕстьОшибкаЧтенияИзФайла);
	
	Если Отказ Тогда
		
		ЖурналРегистрации_ЗаписатьОшибку(
			"ОшибкаЧтенияJSON",
			Строка
		);
		
		ВызватьИсключение "Не удалось прочитать JSON";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Платформа_ПрочитатьИзСтроки(Строка, Отказ)
	
	Чтение = Новый("ЧтениеJSON");
	Чтение.УстановитьСтроку(Строка);
	
	Попытка
		
		Результат = Вычислить("ПрочитатьJSON(Чтение)");
		
	Исключение
		
		Отказ = Истина;
		
		Инфо = ИнформацияОбОшибке();
		Ошибка = КраткоеПредставлениеОшибки(Инфо);
		
		ЖурналРегистрации_ЗаписатьПредупреждение(
			"ЧтениеИзСтроки",
			Ошибка
		);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Платформа_ПрочитатьИзФайла(Строка, Отказ)
	
	Кодировка = "utf-8";
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
	
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(Строка);
	ТД.Записать(ИмяВремФайла, Кодировка);
	ТД = Неопределено;
	
	Чтение = Новый("ЧтениеJSON");
	Чтение.ОткрытьФайл(ИмяВремФайла, Кодировка);
	
	Попытка
		
		Результат = Вычислить("ПрочитатьJSON(Чтение)");
		
	Исключение
		
		Отказ = Истина;
		Инфо = ИнформацияОбОшибке();
		Ошибка = КраткоеПредставлениеОшибки(Инфо);
		
		ЖурналРегистрации_ЗаписатьПредупреждение(
			"ЧтениеИзФайла",
			Ошибка
		);
		
	КонецПопытки;
	
	Чтение.Закрыть();
	
	Попытка
		УдалитьФайлы(ИмяВремФайла);
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Ошибка = ПодробноеПредставлениеОшибки(Инфо);
		ЖурналРегистрации_ЗаписатьПредупреждение("УдалениеВременногоФайла", Ошибка);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Платформа_ЗаписатьJSON(Значение)
	
	Запись = Новый ("ЗаписьJSON");
	Запись.УстановитьСтроку();
	
	Выполнить("ЗаписатьJSON(Запись, Значение)");
	
	Результат = Запись.Закрыть();
	
	Возврат Результат;
	
КонецФункции

//}		ЧТЕНИЕ И ЗАПИСЬ JSON 

&НаСервере
Функция ИдентификаторСобытияЖурналаРегистрации(ИмяСобытия)
	
	Результат = "Диадок.ПарсерJSON." + СокрЛП(ИмяСобытия);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЖурналРегистрации_ЗаписатьОшибку(ИмяСобытия, Ошибка)
	
	СобытиеЖР = ИдентификаторСобытияЖурналаРегистрации(ИмяСобытия);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖР,
		УровеньЖурналаРегистрации.Ошибка,
		Неопределено,
		Неопределено,
		Ошибка
	);
	
КонецПроцедуры

&НаСервере
Процедура ЖурналРегистрации_ЗаписатьПредупреждение(ИмяСобытия, Ошибка)
	
	СобытиеЖР = ИдентификаторСобытияЖурналаРегистрации(ИмяСобытия);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖР,
		УровеньЖурналаРегистрации.Предупреждение,
		Неопределено,
		Неопределено,
		Ошибка
	);
	
КонецПроцедуры

