////////////////////////////////////////////////////////////////////////////////
// Методы для работы с операционной системой
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
Перем СтдСтрЛок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// МЕТОДЫ ГК

// Получает значение разделителя пути, используемого в операционной системе,
// в контексте которой выполняется вызов.
//
// Возвращаемое значение:
//  Строка - Разделитель пути возвращается в виде строки. Например: "\".
///
Функция ПолучитьРазделительПутиЛок() Экспорт
	
	Попытка
		// BSLLS:ExecuteExternalCodeInCommonModule-off
		// BSLLS:ExecuteExternalCode-off
		// отключено т.к. код не является произвольным, см. std770
		РазделительПути = Вычислить("ПолучитьРазделительПути()");
		// BSLLS:ExecuteExternalCodeInCommonModule-on
		// BSLLS:ExecuteExternalCode-on
	Исключение
		РазделительПути = ?(ЭтоWindows(), РазделительПутиWindows(), РазделительПутиUnix());
	КонецПопытки;
	
	Возврат РазделительПути;
	
КонецФункции // ПолучитьРазделительПутиЛок

// ПРОЧЕЕ

// Возвращает Истина, если приложение запущено под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Windows
//
Функция ЭтоWindows() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
КонецФункции // ЭтоWindows

// Возвращает Истина, если приложение запущено под управлением ОС Linux.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Linux
//
Функция ЭтоLinux() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64
		ИЛИ Строка(СистемнаяИнформация.ТипПлатформы) = "Linux_E2K"
		ИЛИ Строка(СистемнаяИнформация.ТипПлатформы) = "Linux_ARM64";
	
КонецФункции // ЭтоLinux

// Возвращает Истина, если приложение запущено под управлением macOS.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением macOS
//
Функция ЭтоMacOS() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат Строка(СистемнаяИнформация.ТипПлатформы) = "MacOS_x86"
		ИЛИ Строка(СистемнаяИнформация.ТипПлатформы) = "MacOS_x86_64";
	
КонецФункции // ЭтоMacOS

// Возвращает объем оперативной памяти, доступной  приложению.
//
// Возвращаемое значение:
//  Число - количество гигабайтов оперативной памяти с точностью до десятых долей.
//
Функция ОперативнаяПамятьДоступнаяПриложению() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Мегабайт = 1024;
	Возврат Окр(СистемнаяИнформация.ОперативнаяПамять / Мегабайт, 1);
	
КонецФункции // ОперативнаяПамятьДоступнаяПриложению

// Раскладывает полное имя файла на составляющие.
//
// Параметры:
//  ПолноеИмяФайла - Строка - полный путь к файлу.
//  Каталог - Булево - признак того, что требуется разложить полное имя папки, а не файла.
//
// Возвращаемое значение:
//   Структура - имя файла, разложенное на составные части(аналогично свойствам объекта Файл):
//		ПолноеИмя - Строка - содержит полный путь к файлу, т.е. полностью соответствует входному параметру ПолноеИмяФайла.
//		Путь - Строка - содержит путь к каталогу, в котором лежит файл.
//		Имя - Строка - содержит имя файла с расширением, без пути к файлу.
//		Расширение - Строка - содержит расширение файла.
//		ИмяБезРасширения - Строка - содержит имя файла без расширения и без пути к файлу.
//
Функция РазобратьИмяФайла(Знач ПолноеИмяФайла, Каталог = Ложь) Экспорт
	
	СтруктураИмениФайла = Новый Структура("ПолноеИмя,Путь,Имя,Расширение,ИмяБезРасширения");
	
	// Убираем из полного имени файла завершающий слеш и сохраняем получившееся полное имя в структуре.
	Если Каталог
		И (Прав(ПолноеИмяФайла, 1) = "/"
			ИЛИ Прав(ПолноеИмяФайла, 1) = "\") Тогда
		
		Если Каталог Тогда
			ПолноеИмяФайла = Сред(ПолноеИмяФайла, 1, СтрДлина(ПолноеИмяФайла) - 1);
		Иначе
			// Если путь к файлу заканчивается слешем, то у файла нет имени.
			СтруктураИмениФайла.ПолноеИмя = ПолноеИмяФайла;
			СтруктураИмениФайла.Путь = ПолноеИмяФайла;
			СтруктураИмениФайла.Имя = "";
			СтруктураИмениФайла.Расширение = "";
			СтруктураИмениФайла.ИмяБезРасширения = "";
			Возврат СтруктураИмениФайла;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураИмениФайла.Вставить("ПолноеИмя", ПолноеИмяФайла);
	
	// Если полное имя файла оказалось пустым, то остальные параметры структуры возвращаем пустыми.
	Если СтрДлина(ПолноеИмяФайла) = 0 Тогда
		СтруктураИмениФайла.Путь = "";
		СтруктураИмениФайла.Имя = "";
		СтруктураИмениФайла.Расширение = "";
		СтруктураИмениФайла.ИмяБезРасширения = "";
		Возврат СтруктураИмениФайла;
	КонецЕсли;
	
	НаправлениеПоискаСКонца = "СКонца";
	
	// Выделяем путь к файлу и имя файла.
	Если СтдСтр().СтрНайтиЛок(ПолноеИмяФайла, "/") > 0 Тогда
		ПозицияРазделителя = СтдСтр().СтрНайтиЛок(ПолноеИмяФайла, "/", НаправлениеПоискаСКонца);
	ИначеЕсли СтдСтр().СтрНайтиЛок(ПолноеИмяФайла, "\") > 0 Тогда
		ПозицияРазделителя = СтдСтр().СтрНайтиЛок(ПолноеИмяФайла, "\", НаправлениеПоискаСКонца);
	Иначе
		ПозицияРазделителя = 0;
	КонецЕсли;
	
	СтруктураИмениФайла.Путь = Лев(ПолноеИмяФайла, ПозицияРазделителя);
	СтруктураИмениФайла.Имя = Сред(ПолноеИмяФайла, ПозицияРазделителя + 1);
	
	// Папки не имеют расширений, а для файла выделяем расширение.
	Если Каталог Тогда
		СтруктураИмениФайла.Расширение = "";
		СтруктураИмениФайла.ИмяБезРасширения = СтруктураИмениФайла.Имя;
	Иначе
		ПозицияТочки = СтдСтр().СтрНайтиЛок(СтруктураИмениФайла.Имя, ".", НаправлениеПоискаСКонца);
		Если ПозицияТочки = 0 Тогда
			СтруктураИмениФайла.Расширение = "";
			СтруктураИмениФайла.ИмяБезРасширения = СтруктураИмениФайла.Имя;
		Иначе
			СтруктураИмениФайла.Расширение = Сред(СтруктураИмениФайла.Имя, ПозицияТочки + 1);
			СтруктураИмениФайла.ИмяБезРасширения = Лев(СтруктураИмениФайла.Имя, ПозицияТочки - 1);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураИмениФайла;
	
КонецФункции // РазобратьИмяФайла

// Раскладывает путь на каталоги.
//
// Параметры:
// 	Путь - Строка - путь до файла
// 	ПутьUnix - Булево, Неопределено - является путем unix
//
// Возвращаемое значение:
//   Массив - массив элементов, содержащих дерево пути
//
Функция РазделитьПуть(Путь, ПутьUnix = Неопределено) Экспорт
	
	ПутьСокрЛП = СокрЛП(Путь);
	
	Если ПутьUnix = Истина Тогда
		РазделительПути = РазделительПутиUnix();
	ИначеЕсли ПутьUnix = Ложь Тогда
		РазделительПути = РазделительПутиWindows();
	Иначе
		РазделительПути = ПолучитьРазделительПутиЛок();
	КонецЕсли;
	
	Если СтдСтр().СтрНайтиЛок(ПутьСокрЛП, РазделительПути) > 0 Тогда
		МассивСлов = СтдСтр().СтрРазделитьЛок(ПутьСокрЛП, РазделительПути, Ложь);
	Иначе
		Противоположный = Новый Соответствие;
		Противоположный.Вставить(РазделительПутиWindows(), РазделительПутиUnix());
		Противоположный.Вставить(РазделительПутиUnix(), РазделительПутиWindows());
		МассивСлов = СтдСтр().СтрРазделитьЛок(ПутьСокрЛП, Противоположный[РазделительПути], Ложь);
	КонецЕсли;
	
	Возврат МассивСлов;
	
КонецФункции // РазделитьПуть

// Соединяет элементы массива в путь, используя разделитель системы
//
// Параметры:
//  МассивЭлементовПути - Массив - перечень элементов каталога
//  РазделительПути - Строка - Разделитель элементов пути (необязательный)
//
// Возвращаемое значение:
//  Строка - объединенный путь к файлу
//
Функция СоединитьПуть(МассивЭлементовПути, РазделительПути = Неопределено) Экспорт
	
	Результат = "";
	
	Если РазделительПути = Неопределено Тогда
		РП = ПолучитьРазделительПутиЛок();
	Иначе
		РП = Строка(РазделительПути);
	КонецЕсли;
	
	Если МассивЭлементовПути.Количество() > 0 Тогда
		
		Результат = МассивЭлементовПути[0];
		
		Для Итератор = 1 По МассивЭлементовПути.ВГраница() Цикл
			Результат = Результат + РП + МассивЭлементовПути[Итератор];
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СоединитьПуть

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция РазделительПутиWindows()
	
	Возврат "\";
	
КонецФункции // РазделительПутиWindows

Функция РазделительПутиUnix()
	
	Возврат "/";
	
КонецФункции // РазделительПутиUnix

Функция СтдСтр()
	
	Если СтдСтрЛок = Неопределено Тогда
		ПараметрыПроверки = Новый Структура;
		ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
		ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
		Если ПараметрыПроверки.ИспользуемоеИмяФайла = Неопределено Тогда
			СтдСтрЛок = Новый("DataProcessorObject.КонтурДиадокСтдСтр");
		Иначе
			СтдСтрЛок = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтр");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтдСтрЛок;
	
КонецФункции // СтдСтр