// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НаименованиеСистемы Экспорт;
Перем КраткоеНаименованиеСистемы Экспорт;
Перем КраткоеНаименованиеСистемыПредложныйПадеж Экспорт;
Перем ТелефонТехПоддержки Экспорт;
Перем ИспользоватьИконкуСистемы Экспорт;

Перем Модуль_ИнтеграцияОбщий Экспорт; // Устарел. Нужен только для совместимости со старыми ПМ
Перем Модуль_ЗаполнениеКонтента Экспорт;
Перем Модуль_Интеграция Экспорт;
Перем Модуль_РаботаССерверомДиадок Экспорт;
Перем ИмяМодуляИнтеграции Экспорт;

Перем ИспользуетсяПодключаемыйМодуль Экспорт;
Перем ВнешнийМодуль Экспорт; // объект обработки - подключаемого модуля.

Перем ИспользоватьПодсистемуКонтурDiadoc Экспорт;

Перем ЗапущенКакВнешнийМодуль Экспорт;  // признак того, что модуль запущен из версии Pro в качестве источника данных.

Перем РежимОтладки Экспорт;
Перем КаталогОбработок Экспорт;

Перем ОбщиеПараметры;

Перем Контекст1САдаптерКонфигурации;

Перем Кэш;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//**********************************************
//{#Область ПрограммныйИнтерфейс

// Конструктор дополнительных параметров создания документа информационной базы.
// 
// Возвращаемое значение:
//  Структура:
//    * Формат - Структура - описание формата электронного документа.
//    * Контрагент - Произвольный - Ссылка на контрагента ИБ.
//    * Организация - Произвольный - Ссылка на организацию ИБ.
//    * ЦенаВключаетНДС - Булево - Истина, если нужно пересчитать цены и включить в них НДС.
//    * ДокументОснование - Произвольный - Ссылка на документ ИБ, который нужно использовать в качестве основания.
//
Функция ПараметрыСозданияДокументаИнформационнойБазы() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Формат");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Организация");
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ДокументОснование");
	Результат.Вставить("ИспользоватьКонтурМаркировку", КонстантаИспользоватьСервисКонтурМаркировка());
	
	Возврат Результат;

КонецФункции

// Создает новый экземпляр документа информационной базы и заполняет его
// по данным электронного документа. Созданный объект при этом не записывается.
// 
//
// Параметры:
//  Содержимое - ДвоичныеДанные - бинарные данные файла.
//             - ОбъектXDTO - объектная модель формализованного документа (ФНС).
//             - Строка - содержимое XML-файла.
//             - Строка - путь к файлу.
//  ИдентификаторОперации - Строка - Идентификатор правила создания и заполнения документа ИБ.
//  ДополнительныеПараметры - Структура - (Необязательный) дополнительные параметры заполнения документа ИБ.
// 
// Возвращаемое значение:
//  ДокументОбъект, СправочникОбъект - заполненный объект информационной базы.
//
// Пример 1:
//  ПараметрыСоздания = ПараметрыСозданияДокументаИнформационнойБазы();
//  ПараметрыСоздания.Контрагент = Документ.Отправитель.Организация;
//  ПараметрыСоздания.ЦенаВключаетНДС = Истина;
//  НовыйДокумент = НовыйДокументИнформационнойБазы(ФайлXML, "ПоступлениеТоваровУслуг", ПараметрыСоздания);
//
// Пример 2:
//  НовыйДокумент = НовыйДокументИнформационнойБазы("C:\temp\УПД 1.xml", "ПоступлениеТоваровУслуг_Оборудование");
//
// Пример 3:
//  ПараметрыСоздания = ПараметрыСозданияДокументаИнформационнойБазы();
//  ПараметрыСоздания.ДокументОснование = СсылкаНаПТУ;
//  ПараметрыСоздания.Формат = НовоеОписаниеФорматаЭлектронногоДокумента("Invoice", "default", "utd820_05_01_01_hyphen");
//  НовыйДокумент = НовыйДокументИнформационнойБазы(Utd820SellerContent, "СчетФактураПолученный", ПараметрыСоздания);
//
Функция НовыйДокументИнформационнойБазы(Содержимое, ИдентификаторОперации, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыСоздания = ПараметрыСозданияДокументаИнформационнойБазы();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСоздания, ДополнительныеПараметры);
	КонецЕсли;
	
	ГенерацияXML = МодульГенерацияXML();
	ОбъектXDTO = ГенерацияXML.XML_В_ОбъектXDTO(Содержимое);
	
	ФорматЭД = ДополнительныеПараметры.Формат;
	ДанныеЭД = ДанныеЭлектронногоДокумента(ОбъектXDTO, ФорматЭД, ПараметрыСоздания.Контрагент);
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	НовыйОбъект = МенеджерИнтеграции.НовыйДокументИнформационнойБазы(
		ИдентификаторОперации,
		ПараметрыСоздания,
		ДанныеЭД
	);
	
	Возврат НовыйОбъект;
	
КонецФункции

// Получает список правил для создания учетных документов
// на основании электронных документов в указанном формате.
//
// Параметры:
//  ФорматЭД - Структура - содержит свойства:
//    * ИмяТипа			 - Строка - имя типа документа (TypeNamedId);
//    * ФункцияДокумента - Строка - функция документа (Function);
//    * ВерсияФормата	 - Строка - версия формата контента (Version);
// 
// Возвращаемое значение:
//  СписокЗначений - идентификаторы правил создания и их пользовательские представления.
//
Функция ПравилаСозданияДокументовУчета(ФорматЭД) Экспорт
	
	Результат = Новый СписокЗначений;
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	
	ОписаниеФормата = ПолноеОписаниеФорматаЭлектронногоДокумента(ФорматЭД);
	
	МенеджерИнтеграции.ЗаполнитьПравилаСозданияДокументовУчета(Результат, ФорматЭД);
	
	Возврат Результат;
	
КонецФункции

// Получает номенклатуру информационной базы, соответствующую идентификаторам номенклатуры контрагента.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип.ВладелецНоменклатурыБЭД - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Строка, Массив из Строка - идентификаторы номенклатуры контрагента.
// 
// Возвращаемое значение:
//  Соответствие - содержит:
//    * Ключ - Строка - идентификатор номенклатуры контрагента.
//    * Значение - Структура - номенклатура информационной базы (см. МенеджерИнтеграции.НоваяНоменклатураИнформационнойБазы)
//
Функция ПрочитатьСопоставлениеНоменклатуры(ВладелецНоменклатуры, ИдентификаторыНоменклатуры) Экспорт
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	
	Результат = МенеджерИнтеграции.ПрочитатьСопоставлениеНоменклатуры(
		ВладелецНоменклатуры,
		ИдентификаторыНоменклатуры
	);
	
	Возврат Результат;
	
КонецФункции

// Записывает соответствие номенклатуры информационной базы с номенклатурой поставщика.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - сведения о номенклатуре контрагента (см. МенеджерИнтеграции.НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - сведения о номенклатуре информационной базы (см. МенеджерИнтеграции.НоваяНоменклатураИнформационнойБазы)
//
Процедура ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	
	МенеджерИнтеграции.ЗаписатьСопоставлениеНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ);
	
КонецПроцедуры

// Ищет варианты сопоставления номенклатуры по номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - см. Контракт_НоменклатураКонтрагента
// 
// Возвращаемое значение:
//  Массив из Контракт_НоменклатураИнформационнойБазы
//
Функция ВариантыСопоставленияНоменклатуры(НоменклатураКонтрагента) Экспорт 
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	Результат = МенеджерИнтеграции.ВариантыСопоставленияНоменклатуры(НоменклатураКонтрагента);
	Возврат Результат;
	
КонецФункции

// Возвращает описание и взаимосвязь объектов, составляющих номенклатуру информационной базы.
// Результат базируется на определяемых типах и переопределяемых методах.
//
// Возвращаемое значение:
//  Структура - данные о структуре номенклатуры информационной базы:
//   * ВладелецНоменклатурыПредставлениеОбъекта - Строка - представление единичного объекта владельца номенклатуры.
//   * НоменклатураПредставлениеОбъекта - Строка - представление единичного объекта номенклатуры.
//   * ХарактеристикаПредставлениеОбъекта - Строка - представление единичного объекта характеристики.
//   * УпаковкаПредставлениеОбъекта - Строка - представление единичного объекта упаковки.
//   * ИмяПараметраСвязиХарактеристики - Строка - имя параметра связи характеристики от номенклатуры.
//   * ИмяПараметраСвязиУпаковки - Строка - имя параметра связи упаковки от номенклатуры.
//
Функция МетаданныеСопоставленияНоменклатуры() Экспорт
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	Результат = МенеджерИнтеграции.МетаданныеСопоставленияНоменклатуры();
	
	Возврат Результат;
	
КонецФункции

// Возвращает свойства набора номенклатур информационной базы.
// Определяет обязательность использования характеристики и упаковки.
//
// Параметры:
//  СсылкаИлиМассив - Массив из ОпределяемыйТип.НоменклатураБЭД, ОпределяемыйТип.НоменклатураБЭД
//    - ссылки на номенклатуру ИБ, для которой требуется определить свойства. Если передается ссылка, преобразуется в массив.
//
// Возвращаемое значение:
// Соответствие, Неопределено - в случае незаполненного набора номенклатуры возвращается Неопределено. Соответствие содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//
Функция СвойстваНоменклатурыИнформационнойБазы(СсылкаИлиМассив) Экспорт
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	Результат = МенеджерИнтеграции.СвойстваНоменклатурыИнформационнойБазы(СсылкаИлиМассив);
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторСвойстваДиадокИспользоватьСервисКонтурМаркировка()
	
	Возврат "ДиадокИспользоватьСервисКонтурМаркировка";
	
КонецФункции

//}#КонецОбласти ПрограммныйИнтерфейс


//**********************************************
//{		КЭШИРОВАНИЕ 

// Устарела, следует использовать Кэш_Прочитать
//
Функция ЭДО_Кэш_Прочитать(ИмяЗначения) Экспорт
	
	Возврат Кэш_Прочитать(ИмяЗначения);
	
КонецФункции

// Устарела, следует использовать Кэш_Поместить
//
Процедура ЭДО_Кэш_Поместить(ИмяЗначения, Значение) Экспорт
	
	Кэш_Поместить(ИмяЗначения, Значение);
	
КонецПроцедуры

Функция Кэш_Прочитать(ИмяЗначения) Экспорт
	
	Результат = Неопределено;
	
	Если Кэш <> Неопределено Тогда
		Результат = Кэш[ИмяЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура Кэш_Поместить(ИмяЗначения, Значение) Экспорт
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Кэш.Вставить(ИмяЗначения, Значение);
	
КонецПроцедуры

//}		КЭШИРОВАНИЕ


//**********************************************
//{#Область СлужебныеПроцедурыИФункции

Функция ИмяБиблиотекиГенерацияXML()
	Возврат "ГенерацияXML";
КонецФункции

Функция ИмяБиблиотекиФорматыЭД()
	Возврат "ФорматыЭД";
КонецФункции

Функция ИмяМенеджераИнтеграции()
	Возврат "Модуль_ИнтеграцияУниверсальнаяЛогика";
КонецФункции

Функция МодульГенерацияXML()
	
	ИмяМодуля = ИмяБиблиотекиГенерацияXML();
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция МодульМенеджерИнтеграции()
	
	ИмяМодуля = ИмяМенеджераИнтеграции();
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция МодульФорматыЭлектронныхДокументов()
	
	ИмяМодуля = ИмяБиблиотекиФорматыЭД();
	Результат = ПолучитьМодульПрог(ИмяМодуля);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеЭлектронногоДокумента(ОбъектXDTO, ФорматЭД, Контрагент)
	
	ПротоСтруктура = ПротоСтруктураЭлектронногоДокумента(ОбъектXDTO);
	
	ФорматыЭД = МодульФорматыЭлектронныхДокументов();
	
	Если ФорматыЭД.ЭтоАктСверкиВзаиморасчетов(ФорматЭД) Тогда
		
		ТабличнаяЧастьПрото = ПротоСтруктура.ReconciliationAct.ReconciliationActTable;
		
		Шапка = ШапкаЭлектронногоДокумента405(ПротоСтруктура);
		ТабличнаяЧасть = ТабличнаяЧастьЭлектронногоДокумента405(ТабличнаяЧастьПрото);
		Итоги = ИтогиЭлектронногоДокумента405(ТабличнаяЧастьПрото);
		ЭтоАванс = Ложь;
		
	Иначе
		
		Шапка = ШапкаЭлектронногоДокумента(ПротоСтруктура);
		ТабличнаяЧасть = ТабличнаяЧастьЭлектронногоДокумента(ОбъектXDTO, Контрагент);
		Итоги = ИтогиЭлектронногоДокумента(ПротоСтруктура);
		ЭтоАванс = ЭтоЭлектронныйСчетФактураНаАванс(ТабличнаяЧасть);
		
	КонецЕсли;
	
	ИтогиУменьшение = ИтогиУменьшениеЭлектронногоДокумента(ПротоСтруктура);
	ИтогиУвеличение = ИтогиУвеличениеЭлектронногоДокумента(ПротоСтруктура);
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка",				Шапка);
	Результат.Вставить("ТабличнаяЧасть",	ТабличнаяЧасть);
	Результат.Вставить("Формат",			ФорматЭД);
	Результат.Вставить("Итоги",				Итоги);
	Результат.Вставить("ИтогиУменьшение",	ИтогиУменьшение);
	Результат.Вставить("ИтогиУвеличение",	ИтогиУвеличение);
	Результат.Вставить("ЭтоАванс",			ЭтоАванс);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйРеквизитыШапкиЭлектронногоДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	Результат.Вставить("ДатаИсправления");
	Результат.Вставить("НомерИсправления");
	Результат.Вставить("РеквизитыОснования");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьРеквизитыОснования(ШапкаЭД, Прото)
	
	Перем Invoices;
	
	Если Не Прото.Свойство("Invoices", Invoices) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОснования = Новый Массив;
	
	Для Каждого Invoice Из Invoices Цикл
		
		Основание = Новый Структура;
		Основание.Вставить("Дата", Invoice.InvoiceDate);
		Основание.Вставить("Номер", Invoice.InvoiceNumber);
		
		РеквизитыОснования.Добавить(Основание);
		
	КонецЦикла;
	
	ШапкаЭД.РеквизитыОснования = РеквизитыОснования;
	
КонецПроцедуры

Функция НовыйИтогиТабличнойЧасти()
	
	Результат = Новый Структура;
	Результат.Вставить("Количество");
	Результат.Вставить("СуммаВсего");
	Результат.Вставить("СуммаБезНДС");
	Результат.Вставить("СуммаНДС");
	
	Возврат Результат;
	
КонецФункции

Функция ШапкаЭлектронногоДокумента(Прото)

	Если Прото.Свойство("DocumentDate") Тогда
		ДатаДокумента = Прото.DocumentDate;
	ИначеЕсли Прото.Свойство("Date") Тогда
		ДатаДокумента = Прото.Date;
	Иначе
		ДатаДокумента = Неопределено;
	КонецЕсли;
	
	Если Прото.Свойство("DocumentNumber") Тогда
		НомерДокумента = Прото.DocumentNumber;
	ИначеЕсли Прото.Свойство("Number") Тогда
		НомерДокумента = Прото.Number;
	Иначе
		НомерДокумента = Неопределено;
	КонецЕсли;
	
	ДатаИсправления = Неопределено;
	Если Прото.Свойство("RevisionDate") Тогда
		ДатаИсправления = Прото.RevisionDate;
	КонецЕсли;
	
	НомерИсправления = Неопределено;
	Если Прото.Свойство("RevisionNumber") Тогда
		НомерИсправления = Прото.RevisionNumber;
	КонецЕсли;
	
	Результат = НовыйРеквизитыШапкиЭлектронногоДокумента();
	Результат.Дата = ДатаДокумента;
	Результат.Номер = НомерДокумента;
	Результат.ДатаИсправления = ДатаИсправления;
	Результат.НомерИсправления = НомерИсправления;
	
	ЗаполнитьРеквизитыОснования(Результат, Прото);
	
	Возврат Результат;
	
КонецФункции

Функция ТабличнаяЧастьЭлектронногоДокумента(ОбъектXDTO, Контрагент)
	
	ГенерацияXML = МодульГенерацияXML();
	
	Результат = ГенерацияXML.ЭДО_ПолучитьТабличнуюЧастьИзКонтентаXML(ОбъектXDTO);
	
	ЗаполнитьНоменклатуруИнформационнойБазы(Результат, Контрагент);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНоменклатуруИнформационнойБазы(ТабличнаяЧасть, Контрагент)
	
	ТабличнаяЧасть.Колонки.Добавить("НоменклатураИнформационнойБазы");
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		СопоставлениеНоменклатуры = ПрочитатьСопоставлениеНоменклатуры(Контрагент, Строка.ИдентификаторНоменклатуры);
		
		НоменклатураИБ = СопоставлениеНоменклатуры.Получить(Строка.ИдентификаторНоменклатуры);
		
		Строка.НоменклатураИнформационнойБазы = НоменклатураИБ;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИтогиЭлектронногоДокумента(Прото)

	Количество	= 0;
	СуммаВсего	= 0;
	СуммаБезНДС	= 0;
	СуммаНДС	= 0;
	
	Если Прото.Свойство("Table") Тогда
		ИтогоПоДокументу = Прото.Table;
		
		Если ИтогоПоДокументу.Свойство("TotalNet") Тогда
			Количество = ИтогоПоДокументу.TotalNet;
		КонецЕсли;
		
		Если ИтогоПоДокументу.Свойство("Total") Тогда
			СуммаВсего = ИтогоПоДокументу.Total;
		КонецЕсли;
		
		Если ИтогоПоДокументу.Свойство("TotalWithVatExcluded") Тогда
			СуммаБезНДС = ИтогоПоДокументу.TotalWithVatExcluded;
		КонецЕсли;
		
		Если ИтогоПоДокументу.Свойство("Vat") Тогда
			СуммаНДС = ИтогоПоДокументу.Vat;
		КонецЕсли;
	КонецЕсли;
		
	Результат = НовыйИтогиТабличнойЧасти();
	Результат.Количество	= Количество;
	Результат.СуммаВсего	= СуммаВсего;
	Результат.СуммаБезНДС	= СуммаБезНДС;
	Результат.СуммаНДС		= СуммаНДС;
	
	Возврат Результат;

КонецФункции

Функция ИтогиУменьшениеЭлектронногоДокумента(Прото)

	Количество	= 0;
	СуммаВсего	= 0;
	СуммаБезНДС	= 0;
	СуммаНДС	= 0;
	
	Если Прото.Свойство("InvoiceCorrectionTable") Тогда
		УменьшениеПоДокументу = Прото.InvoiceCorrectionTable.TotalsDec;
		
		Если УменьшениеПоДокументу.Свойство("Total") Тогда
			СуммаВсего = УменьшениеПоДокументу.Total;
		КонецЕсли;
		
		Если УменьшениеПоДокументу.Свойство("TotalWithVatExcluded") Тогда
			СуммаБезНДС = УменьшениеПоДокументу.TotalWithVatExcluded;
		КонецЕсли;
		
		Если УменьшениеПоДокументу.Свойство("Vat") Тогда
			СуммаНДС = УменьшениеПоДокументу.Vat;
		КонецЕсли;
	КонецЕсли;
		
	Результат = НовыйИтогиТабличнойЧасти();
	Результат.Количество	= Количество;
	Результат.СуммаВсего	= СуммаВсего;
	Результат.СуммаБезНДС	= СуммаБезНДС;
	Результат.СуммаНДС		= СуммаНДС;
	
	Возврат Результат;

КонецФункции

Функция ИтогиУвеличениеЭлектронногоДокумента(Прото)

	Количество	= 0;
	СуммаВсего	= 0;
	СуммаБезНДС	= 0;
	СуммаНДС	= 0;
	
	Если Прото.Свойство("InvoiceCorrectionTable") Тогда
		УвеличениеПоДокументу = Прото.InvoiceCorrectionTable.TotalsInc;
		
		Если УвеличениеПоДокументу.Свойство("Total") Тогда
			СуммаВсего = УвеличениеПоДокументу.Total;
		КонецЕсли;
		
		Если УвеличениеПоДокументу.Свойство("TotalWithVatExcluded") Тогда
			СуммаБезНДС = УвеличениеПоДокументу.TotalWithVatExcluded;
		КонецЕсли;
		
		Если УвеличениеПоДокументу.Свойство("Vat") Тогда
			СуммаНДС = УвеличениеПоДокументу.Vat;
		КонецЕсли;
	КонецЕсли;
		
	Результат = НовыйИтогиТабличнойЧасти();
	Результат.Количество	= Количество;
	Результат.СуммаВсего	= СуммаВсего;
	Результат.СуммаБезНДС	= СуммаБезНДС;
	Результат.СуммаНДС		= СуммаНДС;
	
	Возврат Результат;

КонецФункции

Функция ПротоСтруктураЭлектронногоДокумента(ОбъектXDTO)

	ГенерацияXML	= МодульГенерацияXML();
	ПротоСтруктура	= ГенерацияXML.ОбъектXDTO_В_ProtoСтруктура(ОбъектXDTO);
	
	Возврат ПротоСтруктура;

КонецФункции

Функция ЭтоЭлектронныйСчетФактураНаАванс(ТабличнаяЧастьЭД)
	
	Результат = Истина;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧастьЭД Цикл
		
		НДСИНА = ЭтоСтавкаНДСИНА(СтрокаТЧ.СтавкаНДС);
		
		Если Не НДСИНА И ЗначениеЗаполнено(СтрокаТЧ.СуммаБезНДС)
			Или НДСИНА И ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
 КонецФункции

Функция ЭтоСтавкаНДСИНА(Знач ПредставлениеСтавки)
	
	Результат = Ложь;
	
	ПредставлениеСтавки = ВРег(ПредставлениеСтавки);
	
	Если ПредставлениеСтавки = ВРег("ИсчНалАг") 
		Или ПредставлениеСтавки = ВРег("НДС исчисляется налоговым агентом") Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ШапкаЭлектронногоДокумента405(Прото)
	
	Результат = НовыйШапкаЭлектронногоДокумента405();
	
	Результат.Дата = Прото.DateCreateFile;
	Результат.Номер = Прото.ActNumber;
	Результат.ДатаНачала = Прото.ReconcilationDateFrom;
	Результат.ДатаОкончания = Прото.ReconcilationDateTo;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйШапкаЭлектронногоДокумента405()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	Результат.Вставить("ДатаНачала");
	Результат.Вставить("ДатаОкончания");
	
	Возврат Результат;
	
КонецФункции

Функция ТабличнаяЧастьЭлектронногоДокумента405(Прото)
	
	Результат = НовыйТабличнаяЧастьАктаСверки405();
	
	Результат.СальдоНачДебет = СвойствоСтруктуры(Прото, "BalanceDebitFrom", Неопределено);
	Результат.СальдоНачКредит = СвойствоСтруктуры(Прото, "BalanceAmountFrom", Неопределено);
	Результат.ОборотДебет = СвойствоСтруктуры(Прото, "TurnoverDebit", Неопределено);
	Результат.ОборотКредит = СвойствоСтруктуры(Прото, "TurnoverAmount", Неопределено);
	Результат.СальдоКонДебет = СвойствоСтруктуры(Прото, "BalanceDebitEnd", Неопределено);
	Результат.СальдоКонКредит = СвойствоСтруктуры(Прото, "BalanceAmountEnd", Неопределено);
	
	ПрочитатьСвойства_СведенияОДоговорах405(Результат, Прото);
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьСвойства_СведенияОДоговорах405(СтрокиТабличнойЧасти, ИсточникДанных)
	
	КоллекцияДоговоров = СвойствоСтруктуры(ИсточникДанных, "ContractInfo", Новый Массив);
	
	Для Каждого ЭлементДоговор Из КоллекцияДоговоров Цикл
		
		СтрокаДоговор = НовыйСведенияОДоговоре405();
		
		СтрокаДоговор.ИдДоговора = СвойствоСтруктуры(ЭлементДоговор, "ContractId", Неопределено);
		СтрокаДоговор.Описание = СвойствоСтруктуры(ЭлементДоговор, "ContractAdditionalInfo", Неопределено);
		СтрокаДоговор.Номер = СвойствоСтруктуры(ЭлементДоговор, "ContractNumber", Неопределено);
		СтрокаДоговор.Дата = СвойствоСтруктуры(ЭлементДоговор, "ContractDate", Неопределено);
		СтрокаДоговор.СальдоНачДебет = СвойствоСтруктуры(ЭлементДоговор, "BalanceDebitFrom", Неопределено);
		СтрокаДоговор.СальдоНачКредит = СвойствоСтруктуры(ЭлементДоговор, "BalanceAmountFrom", Неопределено);
		СтрокаДоговор.ОборотДебет = СвойствоСтруктуры(ЭлементДоговор, "TurnoverDebit", Неопределено);
		СтрокаДоговор.ОборотКредит = СвойствоСтруктуры(ЭлементДоговор, "TurnoverAmount", Неопределено);
		СтрокаДоговор.СальдоКонДебет = СвойствоСтруктуры(ЭлементДоговор, "BalanceDebitEnd", Неопределено);
		СтрокаДоговор.СальдоКонКредит = СвойствоСтруктуры(ЭлементДоговор, "BalanceAmountEnd", Неопределено);
		
		DocumentInfo = СвойствоСтруктуры(ЭлементДоговор, "DocumentInfo", Новый Массив);
		
		ПрочитатьСвойства_СведенияОДокументах405(СтрокаДоговор, DocumentInfo);
		
		СтрокиТабличнойЧасти.Договор.Добавить(СтрокаДоговор);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОДокументах405(СтрокаДоговор, DocumentInfo)
	
	Для Каждого ЭлементДокумент Из DocumentInfo Цикл
		
		СтрокаДокумент = НовыйСведенияОДокументе405();
		
		СтрокаДокумент.Наименование = СвойствоСтруктуры(ЭлементДокумент, "DocumentName", Неопределено);
		СтрокаДокумент.Номер = СвойствоСтруктуры(ЭлементДокумент, "DocumentNumber", Неопределено);
		СтрокаДокумент.Дата = СвойствоСтруктуры(ЭлементДокумент, "DocumentDate", Неопределено);
		СтрокаДокумент.ИдДокумента = СвойствоСтруктуры(ЭлементДокумент, "DocumentId", Неопределено);
		СтрокаДокумент.ДопИнфо = СвойствоСтруктуры(ЭлементДокумент, "AdditionalInfo", Неопределено);
		
		OperationInfo = СвойствоСтруктуры(ЭлементДокумент, "OperationInfo", Новый Массив);
		
		ПрочитатьСвойства_СведенияОбОперациях405(СтрокаДокумент, OperationInfo);
		
		СтрокаДоговор.Документ.Добавить(СтрокаДокумент);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСвойства_СведенияОбОперациях405(СтрокаДокумент, OperationInfo)
	
	Для Каждого ЭлементОперация Из OperationInfo Цикл
		
		СтрокаОперация = НовыйСведенияОбОперации405();
		
		СтрокаОперация.Дата = СвойствоСтруктуры(ЭлементОперация, "OperationDate", Неопределено);
		СтрокаОперация.Наименование = СвойствоСтруктуры(ЭлементОперация, "OperationName", Неопределено);
		СтрокаОперация.СуммаДебет = СвойствоСтруктуры(ЭлементОперация, "SumDebit", Неопределено);
		СтрокаОперация.СуммаКредит = СвойствоСтруктуры(ЭлементОперация, "SumAmount", Неопределено);
		
		СтрокаДокумент.Операция.Добавить(СтрокаОперация);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйТабличнаяЧастьАктаСверки405()
	
	Результат = Новый Структура;
	Результат.Вставить("Договор", Новый Массив);
	Результат.Вставить("СальдоНачДебет", 0);
	Результат.Вставить("СальдоНачКредит", 0);
	Результат.Вставить("ОборотДебет", 0);
	Результат.Вставить("ОборотКредит", 0);
	Результат.Вставить("СальдоКонДебет", 0);
	Результат.Вставить("СальдоКонКредит", 0);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСведенияОДоговоре405()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдДоговора", "");
	Результат.Вставить("Документ", Новый Массив);
	Результат.Вставить("Описание", "");
	Результат.Вставить("Номер", "");
	Результат.Вставить("Дата", "");
	Результат.Вставить("СальдоНачДебет", 0);
	Результат.Вставить("СальдоНачКредит", 0);
	Результат.Вставить("ОборотДебет", 0);
	Результат.Вставить("ОборотКредит", 0);
	Результат.Вставить("СальдоКонДебет", 0);
	Результат.Вставить("СальдоКонКредит", 0);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСведенияОДокументе405()
	
	Результат = Новый Структура;
	Результат.Вставить("Операция", Новый Массив);
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Номер", "");
	Результат.Вставить("Дата", "");
	Результат.Вставить("ИдДокумента", "");
	Результат.Вставить("ДопИнфо", "");
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСведенияОбОперации405()
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("СуммаДебет", 0);
	Результат.Вставить("СуммаКредит", 0);
	
	Возврат Результат;
	
КонецФункции

Функция ИтогиЭлектронногоДокумента405(Прото)
	
	СальдоНачДеб = СвойствоСтруктуры(Прото, "BalanceDebitFrom", Неопределено);
	СальдоНачКр = СвойствоСтруктуры(Прото, "BalanceAmountFrom", Неопределено);
	ОборотДеб = СвойствоСтруктуры(Прото, "TurnoverDebit", Неопределено);
	ОборотКр = СвойствоСтруктуры(Прото, "TurnoverAmount", Неопределено);
	СальдоКонДеб = СвойствоСтруктуры(Прото, "BalanceDebitEnd", Неопределено);
	СальдоКонКр = СвойствоСтруктуры(Прото, "BalanceAmountEnd", Неопределено);
	
	Результат = Новый Структура;
	Результат.Вставить("СальдоНачДеб", СальдоНачДеб);
	Результат.Вставить("СальдоНачКр", СальдоНачКр);
	Результат.Вставить("ОборотДеб", ОборотДеб);
	Результат.Вставить("ОборотКр", ОборотКр);
	Результат.Вставить("СальдоКонДеб", СальдоКонДеб);
	Результат.Вставить("СальдоКонКр", СальдоКонКр);
	
	Возврат Результат;
	
КонецФункции

//}#КонецОбласти СлужебныеПроцедурыИФункции


//} СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид"			   , "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование"   , ПредставлениеМодуля());
	ПараметрыРегистрации.Вставить("Информация"	   , "Модуль для обмена электронными документами через сервис Диадок");
	ПараметрыРегистрации.Вставить("Версия"		   , ВерсияОбработки());
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Разрешения", ДополнительныеРазрешенияВнешнейОбработки());
	ПараметрыРегистрации.Вставить("ВерсияБСП", "0.0.0.0");
	ПараметрыРегистрации.Вставить("Команды", КомандыВнешнейОбработки());
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ЭтоВнешняяОбработка()
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
	
	Возврат ПараметрыПроверки.ИспользуемоеИмяФайла <> Неопределено;
	
КонецФункции

Функция ПредставлениеМодуля()
	Возврат "Диадок Стандарт";
КонецФункции

Функция НоваяТаблицаКомандВнешнейОбработки()
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Представление", ТипСтрока);
	Результат.Колонки.Добавить("Идентификатор", ТипСтрока);
	Результат.Колонки.Добавить("Использование", ТипСтрока);
	Результат.Колонки.Добавить("ПоказыватьОповещение", ТипСтрока);
	Результат.Колонки.Добавить("Модификатор", ТипСтрока);
	
	Возврат Результат;
	
КонецФункции

Функция КомандыВнешнейОбработки()
	
	Результат = НоваяТаблицаКомандВнешнейОбработки();
	
	Возврат Результат;
	
КонецФункции

Функция ДополнительныеРазрешенияВнешнейОбработки()
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

//} СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

//{ ВЕРСИЯ

Функция ВерсияОбработки() Экспорт
	
	Версия = "5.48.25";
	
	Результат = Версия + "." + НомерСборки();
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияОбработкиБезНомераСборки() Экспорт
	
	ВерсияОбработки = ВерсияОбработки();
	
	ДлинаСтрокиНомерСборки		 = СтрДлина(НомерСборки());
	ДлинаСтрокиБезНомераСборки	 = СтрДлина(ВерсияОбработки) - ДлинаСтрокиНомерСборки - 1;
	
	Результат = Лев(ВерсияОбработки, ДлинаСтрокиБезНомераСборки);
	
	Возврат Результат;
	
КонецФункции

Функция НомерСборки()
	
	Возврат "621";
	
КонецФункции

Функция ВерсияВнешнейКомпоненты() Экспорт
	
	Возврат "5.32.4.635";
	
КонецФункции

//} ВЕРСИЯ

//{ ПАРАМЕТРЫ СЕРВИСА ДИАДОК

Функция КлючРазработчика() Экспорт
	
	Результат = ОбщиеПараметры.КлючРазработчика;
	Возврат Результат;
	
КонецФункции

Функция АдресСервиса() Экспорт
	
	Возврат "https://diadoc.kontur.ru/";
	
КонецФункции

Функция АдресАпи() Экспорт
	
	Результат = ОбщиеПараметры.АдресDiadocAPI;
	Возврат Результат;
	
КонецФункции

Функция ЗаголовокОсновнойФормы() Экспорт 
	
	Возврат "Контур.Диадок";
	
КонецФункции

//} ПАРАМЕТРЫ СЕРВИСА ДИАДОК

Функция КлючРазработчикаПоУмолчанию()
	
	Возврат "1S82-5-48-4ebb53a8-cea0-4f25-a79c-ea90d40bf343";
	
КонецФункции

Функция АдресСервисаПоУмолчанию()
	
	Возврат "https://diadoc.kontur.ru/";
	
КонецФункции

Функция АдресАпиПоУмолчанию()
	
	Возврат "https://diadoc-api.kontur.ru:443";
	
КонецФункции

Функция НовыйПараметрыМодуля()
	
	Результат = Новый Структура;
	Результат.Вставить("ТочностьЦены", 2);
	Результат.Вставить("АдресDiadocAPI", АдресАпиПоУмолчанию());
	Результат.Вставить("КлючРазработчика", КлючРазработчикаПоУмолчанию());
	Результат.Вставить("ПутьКФайлуКомпоненты", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура Инициализировать(Параметры = Неопределено) Экспорт
	
	ИсполняемыеПараметры = НовыйПараметрыМодуля();
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		ЗаполнитьЗначенияСвойств(ИсполняемыеПараметры, Параметры);
	КонецЕсли;
	
	ОбщиеПараметры = Новый ФиксированнаяСтруктура(ИсполняемыеПараметры);
	
КонецПроцедуры

Процедура ИнициализироватьПеременныеМодуля()
	
	ЗапущенКакВнешнийМодуль = Ложь; // Запущен в DDPro в качестве источника данных.
	
	ЗаполнитьОписаниеМодуля();
	
	ИспользоватьПодсистемуКонтурDiadoc = Метаданные.Подсистемы.Найти("КонтурDiadoc") <> Неопределено;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	ВнешнийМодуль = Неопределено;
	Контекст1САдаптерКонфигурации = Неопределено;
	
	СброситьКэшМодулей();
	СброситьКэш();
	
КонецПроцедуры

Процедура СброситьКэшМодулей() Экспорт
	
	Модуль_Интеграция			 = Неопределено;
	Модуль_ИнтеграцияОбщий		 = Неопределено;
	Модуль_ЗаполнениеКонтента	 = Неопределено;
	Модуль_РаботаССерверомДиадок = Неопределено;
	
	НеобязательныеРеквизиты = Новый Структура;
	НеобязательныеРеквизиты.Вставить("Ядро", Неопределено);
	НеобязательныеРеквизиты.Вставить("ОсновнойМодуль", Неопределено);
	
	Для Каждого КлючИЗначение Из КэшМодулей() Цикл
		ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение, НеобязательныеРеквизиты);
	КонецЦикла;
	
	КэшМодулей().Очистить();
	
КонецПроцедуры

Функция КэшМодулей() Экспорт
	
	Результат = ЭДО_Кэш_Прочитать("КэшМодулей");
	
	Если Результат = Неопределено Тогда 
		Результат = Новый Соответствие;
		ЭДО_Кэш_Поместить("КэшМодулей", Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СброситьКэш()
	
	Если Кэш <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из Кэш Цикл
			Попытка
				КлючИЗначение.Значение.Очистить();
			Исключение КонецПопытки;
		КонецЦикла;
		
		Кэш.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеМодуля()
	
	НаименованиеСистемы 					  = "Диадок";
	КраткоеНаименованиеСистемы 				  = "Диадок";
	КраткоеНаименованиеСистемыПредложныйПадеж = "Диадоке";
	ТелефонТехподдержки 					  = "8 800 500-10-18";
	
	ИспользоватьИконкуСистемы = Истина;
	
КонецПроцедуры

Функция ПолучитьИмяМодуляИнтеграции(РучнойВыбор = Ложь) Экспорт
	
	Результат = Новый Структура("ИмяМодуляИнтеграции, ОпределенАвтоматически", "", Ложь);
	
	Если РучнойВыбор Тогда
		
		#Если Клиент Тогда
			
			РезультатВыбора = СписокМодулейИнтеграции().ВыбратьЭлемент("Выберите базовую конфигурацию");
			
			Если РезультатВыбора <> Неопределено Тогда
				Результат.ИмяМодуляИнтеграции = РезультатВыбора.Значение;
				СохранитьЗначение("ДиадокИмяБазовогоМодуля", Результат.ИмяМодуляИнтеграции);
			КонецЕсли;
			
		#КонецЕсли
		
	Иначе
		
		Результат.ИмяМодуляИнтеграции = ОпределитьИмяМодуляИнтеграцииАвтоматически();
		
		Если ЗначениеЗаполнено(Результат.ИмяМодуляИнтеграции) Тогда
			
			Результат.ОпределенАвтоматически = Истина;
			
		Иначе
			
			#Если Клиент Тогда
				Результат.ИмяМодуляИнтеграции = Строка(ВосстановитьЗначение("ДиадокИмяБазовогоМодуля"));
			#КонецЕсли
			
			Если СписокМодулейИнтеграции().НайтиПоЗначению(Результат.ИмяМодуляИнтеграции) = Неопределено Тогда
				Результат.ИмяМодуляИнтеграции = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МодульИнтеграцииОпределенАвтоматически() Экспорт
	
	ОпределенноеИмя = ОпределитьИмяМодуляИнтеграцииАвтоматически();
	
	Результат = ЗначениеЗаполнено(ОпределенноеИмя);
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьИмяМодуляИнтеграцииАвтоматически()
	
	Результат = "";
	
	Если 	Найти(Метаданные.Синоним, "Бухгалтерия предприятия, редакция 2.0") > 0
		ИЛИ Найти(Метаданные.Синоним, "Бухгалтерия предприятия КОРП, редакция 2.0") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияБух";
		
	ИначеЕсли Найти(Метаданные.Синоним, "10.3") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияУТ103";
				
	ИначеЕсли Найти(Метаданные.Синоним, "Управление торговлей") > 0 И Найти(Метаданные.Синоним, "10.2") = 0 Тогда // Управление торговлей, редакция 10.2 снята с поддержки в 5.38.01
		
		Результат = "Модуль_ИнтеграцияУТ103";
		
	ИначеЕсли Найти(Метаданные.Синоним, "Комплексная автоматизация") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияКА";
		
	ИначеЕсли Найти(Метаданные.Синоним, "Управление производственным предприятием, редакция 1.3") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияУПП13";
		
	ИначеЕсли Найти(Метаданные.Синоним, "Управление ремонтным предприятием, редакция 1.3") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияУПП13";
		
	ИначеЕсли Найти(Метаданные.Синоним, "Альфа-Авто") > 0 И Найти(Метаданные.Синоним, "4.1") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияАльфаАвто41";
		
	ИначеЕсли Найти(Метаданные.Синоним, "Альфа-Авто") > 0 И Найти(Метаданные.Синоним, "5") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияАльфаАвто41";
		
	ИначеЕсли Найти(ВРЕГ(Метаданные.Синоним), "ТКПТ") > 0 Тогда
		
		Результат = "Модуль_ИнтеграцияТКПТ";
		
	ИначеЕсли Метаданные.Имя = "ДАЛИОНУправлениеМагазином" ИЛИ Метаданные.Имя = "ДАЛИОНУправлениеМагазиномПРО" Тогда
		
		Результат = "Модуль_ИнтеграцияДалионУМ";
		
	ИначеЕсли Метаданные.Имя = "ТорговыйДом" И Метаданные.Поставщик = "ООО «АСТ СОФТ»" Тогда
		
		Результат = "Модуль_ИнтеграцияАсторТД";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокМодулейИнтеграции() Экспорт
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("Модуль_ИнтеграцияБух"		 , "Бухгалтерия предприятия, редакция 2.0");
	Результат.Добавить("Модуль_ИнтеграцияУТ103"		 , "Управление торговлей, редакция 10.3");
	Результат.Добавить("Модуль_ИнтеграцияКА"		 , "Комплексная автоматизация, редакция 1.1");
	Результат.Добавить("Модуль_ИнтеграцияУПП13"		 , "Управление производственным предприятием, редакция 1.3");
	Результат.Добавить("Модуль_ИнтеграцияАльфаАвто41", "Альфа-Авто: Автосалон+Автосервис+Автозапчасти");
	Результат.Добавить("Модуль_ИнтеграцияДалионУМ"	 , "ДАЛИОН: Управление магазином, редакция 1.2");
	Результат.Добавить("Модуль_ИнтеграцияАсторТД"	 , "Астор: Торговый дом 7 SE");
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьМодулиЯдра(Отказ = Ложь) Экспорт
	
	Если НЕ ЗапущенКакВнешнийМодуль Тогда
		Модуль_РаботаССерверомДиадок = Модуль_РаботаССерверомДиадок();
		ОдинСАдаптер_Инициализировать(Отказ);
	КонецЕсли;
	
	Модуль_Интеграция = ПолучитьМодульИнтеграции();
	
	Если Модуль_Интеграция = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Для совместимости со старыми ПМ
	Модуль_ИнтеграцияОбщий	  = Модуль_Интеграция;
	Модуль_ЗаполнениеКонтента = ЭтотОбъект;
	
	КэшМодулей().Вставить("Модуль_Интеграция"		 	  	 , Модуль_Интеграция);
	КэшМодулей().Вставить("Модуль_ИнтеграцияОбщий"	 	  	 , Модуль_Интеграция);
	КэшМодулей().Вставить("Модуль_ЗаполнениеКонтента"	 	 , ЭтотОбъект);
	КэшМодулей().Вставить("Модуль_Диадок_РаботаСКонтентом"	 , ЭтотОбъект);
	КэшМодулей().Вставить("Модуль_Логика_ПрофилиКонфигурации", ЭтотОбъект);
	
КонецПроцедуры

Функция ПолучитьМодульИнтеграции()
	
	Результат = Неопределено;
	
	РучнойВыбор = Ложь;
	
	Пока Результат = Неопределено Цикл
		
		Если НЕ ЗапущенКакВнешнийМодуль ИЛИ НЕ ЗначениеЗаполнено(ИмяМодуляИнтеграции) Тогда
			ИмяМодуляИнтеграции = ПолучитьИмяМодуляИнтеграции(РучнойВыбор).ИмяМодуляИнтеграции;
		КонецЕсли;
		
		Если РучнойВыбор И НЕ ЗначениеЗаполнено(ИмяМодуляИнтеграции) Тогда
			Прервать; // Пользователь отказался выбрать модуль интеграции вручную
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяМодуляИнтеграции) Тогда
			
			Попытка
				Результат = ВнешняяОбработкаИзМакета(ИмяМодуляИнтеграции);
			Исключение 
				ОписаниеОшибки = ОписаниеОшибки();
				Сообщить(ОписаниеОшибки, СтатусСообщения.Важное);
				ИмяМодуляИнтеграции = Неопределено;
			КонецПопытки;
			
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			
			#Если Клиент Тогда
				
				Ответ = Вопрос("Загрузить модуль интеграции не удалось!
					 		   |		Изменить модуль интеграции?",
							   РежимДиалогаВопрос.ДаНет, , , НаименованиеСистемы);
				
				РучнойВыбор = Ответ = КодВозвратаДиалога.Да;
				
			#КонецЕсли
			
			// Автоматически загрузить модуль уже пытались и не получилось.
			Если НЕ РучнойВыбор Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяМодуляИнтеграции) Тогда
		ВызватьИсключение "Не выбран модуль интеграции!";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодключитьКомпонентуДиадока(Отказ)
	
	ПутьКФайлу = ОбщиеПараметры.ПутьКФайлуКомпоненты;
	РезультатПодключения = Модуль_РаботаССерверомДиадок.ПодключитьКомпонентуДиадока(ПутьКФайлу);
	
	ВерсияКомпоненты	 = РезультатПодключения.ВерсияКомпоненты;
	ТребуетсяПерезапуск	 = РезультатПодключения.ТребуетсяПерезапуск;
	
	Если ТребуетсяПерезапуск Тогда
		
		ФормаОшибки = Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки");
		
		ЗаголовокОшибки = НСтр("ru = 'Обновление внешней компоненты'");
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Для подключения внешней компоненты версии %1
		|необходимо перезапустить программу'"), ВерсияКомпоненты);
		
		ФормаОшибки.ПоказатьОшибку(ЗаголовокОшибки, ТекстОшибки);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьМодуль_РаботаССерверомДиадок(Отказ = Ложь) Экспорт
	
	ПодключитьКомпонентуДиадока(Отказ);
	
	Если Не Отказ Тогда
		Модуль_РаботаССерверомДиадок.ЗаполнитьПараметрыDiadocInvoiceAPI();
		Модуль_РаботаССерверомДиадок.ИнициализироватьКонтекст(, , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ВнешняяОбработкаИзМакета(ИмяОбработки)
	
	ИмяМакета = ИмяОбработки + "_epf";
	
	Попытка
		
		Если Не ЭтоВнешняяОбработка() Тогда
			
			ПрефиксОбработокРасширения = "КонтурДиадокСтандартОФ_";
			Результат = Обработки[ПрефиксОбработокРасширения + ИмяОбработки].Создать();
			
		ИначеЕсли РежимОтладки = Истина И ЗначениеЗаполнено(КаталогОбработок) Тогда
			
			ИмяФайла = ИмяОбработки + ".epf";
			ПолноеИмяФайла = ОбъединитьПути(КаталогОбработок, ИмяФайла);
			
			Файл = Новый Файл(ПолноеИмяФайла);
			
			Если НЕ Файл.Существует() Тогда
				СоздатьКаталог(Файл.Путь);
				ПолучитьМакет(ИмяМакета).Записать(ПолноеИмяФайла);
			КонецЕсли;
			
			Результат = ВнешниеОбработки_Создать(ПолноеИмяФайла);
			
		Иначе
			
			Результат = ВнешниеОбработки_СоздатьБезПредупреждений(ПолучитьМакет(ИмяМакета));
			
		КонецЕсли;
		
		НеобязательныеРеквизиты = Новый Структура;
		НеобязательныеРеквизиты.Вставить("Ядро", ЭтотОбъект);
		НеобязательныеРеквизиты.Вставить("ОсновнойМодуль", ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(Результат, НеобязательныеРеквизиты);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОписаниеОшибки = "Ошибка создания обработки из макета """ + ИмяОбработки + """:" + ОписаниеОшибки;
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Создает внешнюю обработку без предупреждения об опасных действиях. 
//
Функция ВнешниеОбработки_СоздатьБезПредупреждений(ДвоичныеДанные)
	
	ОписаниеЗащитыБезПредупреждений = ОписаниеЗащитыБезПредупреждений();
	
	Если СравнитьВерсии(ВерсияПриложения(), "8.2") = "ПерваяМеньше" Тогда
		// В 8.1 нет возможности подключения обработки через временное хранилище.
		ПодключитьЧерезВременноеХранилище = Ложь;
	Иначе
		#Если Клиент Тогда
			ПодключитьЧерезВременноеХранилище = Ложь;
		#Иначе
			ПодключитьЧерезВременноеХранилище = Истина;
		#КонецЕсли
	КонецЕсли;
	
	Если ПодключитьЧерезВременноеХранилище Тогда 
		
		АдресОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		// BSLLS:UsingExternalCodeTools-off
		Если ОписаниеЗащитыБезПредупреждений = Неопределено Тогда
			ИмяОбработки = ВнешниеОбработки.Подключить(АдресОбработки, , Ложь);
		Иначе
			ИмяОбработки = ВнешниеОбработки.Подключить(АдресОбработки, , Ложь, ОписаниеЗащитыБезПредупреждений);
		КонецЕсли;
		// BSLLS:UsingExternalCodeTools-on
		
		УдалитьИзВременногоХранилища(АдресОбработки);
		
		// BSLLS:UsingExternalCodeTools-off
		Результат = ВнешниеОбработки.Создать(ИмяОбработки, Ложь);
		// BSLLS:UsingExternalCodeTools-on
		
	Иначе
		
		ИмяВремФайла = ПолучитьИмяВременногоФайла("epf");
		
		ДвоичныеДанные.Записать(ИмяВремФайла);
		
		Результат = ВнешниеОбработки_Создать(ИмяВремФайла);
		
		УдалитьФайлы(ИмяВремФайла);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обертка для создания внешних обработок по имени файла, разными версиями платформы.
//
Функция ВнешниеОбработки_Создать(ИмяФайла)
	
	Результат = Неопределено;
	
	ВерсияПриложения = ВерсияПриложения();
	
	Если СравнитьВерсии(ВерсияПриложения, "8.3.11") <> "ПерваяМеньше" Тогда
		
		// BSLLS:UsingExternalCodeTools-off
		Результат = ВнешниеОбработки.Создать(ИмяФайла, Ложь, ОписаниеЗащитыБезПредупреждений());
		// BSLLS:UsingExternalCodeTools-on
		
	ИначеЕсли СравнитьВерсии(ВерсияПриложения, "8.2") <> "ПерваяМеньше" Тогда
		
		// BSLLS:UsingExternalCodeTools-off
		Результат = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
		// BSLLS:UsingExternalCodeTools-on
		
	Иначе
		
		// BSLLS:UsingExternalCodeTools-off
		Результат = ВнешниеОбработки.Создать(ИмяФайла);  // 8.1
		// BSLLS:UsingExternalCodeTools-on
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Возвращает ОписаниеЗащитыОтОпасныхДействий, если возможно.
//
Функция ОписаниеЗащитыБезПредупреждений()
	
	Результат = Неопределено;
	
	Попытка
		Результат = Новый("ОписаниеЗащитыОтОпасныхДействий");
		Результат.ПредупреждатьОбОпасныхДействиях = Ложь;
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			Неопределено,
			Неопределено,
			ПодробноеПредставлениеОшибки(Ошибка)
		);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМодульПрог(ИмяМодуля) Экспорт
	
	Результат = КэшМодулей()[ИмяМодуля];
	
	Если Результат = Неопределено Тогда
		
		Если Метаданные().Формы.Найти(ИмяМодуля) = Неопределено Тогда
			
			Результат = ВнешняяОбработкаИзМакета(ИмяМодуля);
			
		Иначе
			
			Попытка
				Результат = ПолучитьФорму(ИмяМодуля);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ОписаниеОшибки = "Ошибка получения формы обработки """ + ИмяМодуля + """:" + ОписаниеОшибки;
				ВызватьИсключение ОписаниеОшибки;
			КонецПопытки;
			
		КонецЕсли;
		
		КэшМодулей().Вставить(ИмяМодуля, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СуществуетОбъектМетаданных(ПолноеИмяОбъекта) Экспорт
	
	КэшСуществуетОбъектМетаданных = ЭДО_Кэш_Прочитать("КэшСуществуетОбъектМетаданных");
	
	Если КэшСуществуетОбъектМетаданных = Неопределено Тогда
		КэшСуществуетОбъектМетаданных = Новый Соответствие;
		ЭДО_Кэш_Поместить("КэшСуществуетОбъектМетаданных", КэшСуществуетОбъектМетаданных);
	КонецЕсли;
	
	Результат = КэшСуществуетОбъектМетаданных[ПолноеИмяОбъекта];
	
	Если Результат = Неопределено Тогда
		Результат = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта) <> Неопределено;
		КэшСуществуетОбъектМетаданных.Вставить(ПолноеИмяОбъекта, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеРегиона(КодРегиона) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.НаименованиеРегиона(КодРегиона);
	Возврат Результат
	
КонецФункции

Функция КодРегиона(Знач НаименованиеРегиона) Экспорт
	
	НаименованиеРегиона = НРег(НаименованиеРегиона);
	КодРегиона = "";
	
	Если Найти(НаименованиеРегиона, "адыгея") > 0 Тогда 
		КодРегиона = "01";
	ИначеЕсли Найти(НаименованиеРегиона, "башкортостан") > 0 Тогда 
		КодРегиона = "02";
	ИначеЕсли Найти(НаименованиеРегиона, "алтайский") > 0 Тогда 
		КодРегиона = "22";
	ИначеЕсли Найти(НаименованиеРегиона, "алтай") > 0 Тогда 
		КодРегиона = "04";
	ИначеЕсли Найти(НаименованиеРегиона, "ингушетия") > 0 Тогда 
		КодРегиона = "06";
	ИначеЕсли Найти(НаименованиеРегиона, "кабардино") > 0 Тогда 
		КодРегиона = "07";
	ИначеЕсли Найти(НаименованиеРегиона, "карачаево") > 0 Тогда 
		КодРегиона = "09";
	ИначеЕсли Найти(НаименованиеРегиона, "карелия") > 0 Тогда 
		КодРегиона = "10";
	ИначеЕсли Найти(НаименованиеРегиона, "коми") > 0 Тогда 
		КодРегиона = "11";
	ИначеЕсли Найти(НаименованиеРегиона, "марий") > 0 Тогда 
		КодРегиона = "12";
	ИначеЕсли Найти(НаименованиеРегиона, "мордовия") > 0 Тогда 
		КодРегиона = "13";
	ИначеЕсли Найти(НаименованиеРегиона, "татарстан") > 0 Тогда 
		КодРегиона = "16";
	ИначеЕсли Найти(НаименованиеРегиона, "тыва") > 0 Тогда 
		КодРегиона = "17";
	ИначеЕсли Найти(НаименованиеРегиона, "удмуртская") > 0 Тогда 
		КодРегиона = "18";
	ИначеЕсли Найти(НаименованиеРегиона, "тыва") > 0 Тогда 
		КодРегиона = "17";
	ИначеЕсли Найти(НаименованиеРегиона, "хакасия") > 0 Тогда 
		КодРегиона = "19";
	ИначеЕсли Найти(НаименованиеРегиона, "чувашская") > 0 Тогда 
		КодРегиона = "21";
	ИначеЕсли Найти(НаименованиеРегиона, "чувашия") > 0 Тогда 
		КодРегиона = "21";
	ИначеЕсли Найти(НаименованиеРегиона, "краснодарский") > 0 Тогда 
		КодРегиона = "23";
	ИначеЕсли Найти(НаименованиеРегиона, "приморский") > 0 Тогда 
		КодРегиона = "25";
	ИначеЕсли Найти(НаименованиеРегиона, "ставропольский") > 0 Тогда 
		КодРегиона = "26";
	ИначеЕсли Найти(НаименованиеРегиона, "хабаровский") > 0 Тогда 
		КодРегиона = "27";
	ИначеЕсли Найти(НаименованиеРегиона, "амурская") > 0 Тогда 
		КодРегиона = "28";
	ИначеЕсли Найти(НаименованиеРегиона, "архангельская") > 0 Тогда 
		КодРегиона = "29";
	ИначеЕсли Найти(НаименованиеРегиона, "астраханская") > 0 Тогда 
		КодРегиона = "30";
	ИначеЕсли Найти(НаименованиеРегиона, "белгородская") > 0 Тогда 
		КодРегиона = "31";
	ИначеЕсли Найти(НаименованиеРегиона, "брянская") > 0 Тогда 
		КодРегиона = "32";
	ИначеЕсли Найти(НаименованиеРегиона, "владимирская") > 0 Тогда 
		КодРегиона = "33";
	ИначеЕсли Найти(НаименованиеРегиона, "волгоградская") > 0 Тогда 
		КодРегиона = "34";
	ИначеЕсли Найти(НаименованиеРегиона, "вологодская") > 0 Тогда 
		КодРегиона = "35";
	ИначеЕсли Найти(НаименованиеРегиона, "воронежская") > 0 Тогда 
		КодРегиона = "36";
	ИначеЕсли Найти(НаименованиеРегиона, "ивановская") > 0 Тогда 
		КодРегиона = "37";
	ИначеЕсли Найти(НаименованиеРегиона, "иркутская") > 0 Тогда 
		КодРегиона = "38";
	ИначеЕсли Найти(НаименованиеРегиона, "калининградская") > 0 Тогда 
		КодРегиона = "39";
	ИначеЕсли Найти(НаименованиеРегиона, "калужская") > 0 Тогда 
		КодРегиона = "40";
	ИначеЕсли Найти(НаименованиеРегиона, "камчатский") > 0 Тогда 
		КодРегиона = "41";
	ИначеЕсли Найти(НаименованиеРегиона, "кемеровская") > 0 Тогда 
		КодРегиона = "42";
	ИначеЕсли Найти(НаименованиеРегиона, "кировская") > 0 Тогда 
		КодРегиона = "43";
	ИначеЕсли Найти(НаименованиеРегиона, "костромская") > 0 Тогда 
		КодРегиона = "44";
	ИначеЕсли Найти(НаименованиеРегиона, "курганская") > 0 Тогда 
		КодРегиона = "45";
	ИначеЕсли Найти(НаименованиеРегиона, "курская") > 0 Тогда 
		КодРегиона = "46";
	ИначеЕсли Найти(НаименованиеРегиона, "ленинградская") > 0 Тогда 
		КодРегиона = "47";
	ИначеЕсли Найти(НаименованиеРегиона, "липецкая") > 0 Тогда 
		КодРегиона = "48";
	ИначеЕсли Найти(НаименованиеРегиона, "магаданская") > 0 Тогда 
		КодРегиона = "49";
	ИначеЕсли Найти(НаименованиеРегиона, "московская") > 0 Тогда 
		КодРегиона = "50";
	ИначеЕсли Найти(НаименованиеРегиона, "мурманская") > 0 Тогда 
		КодРегиона = "51";
	ИначеЕсли Найти(НаименованиеРегиона, "нижегородская") > 0 Тогда 
		КодРегиона = "52";
	ИначеЕсли Найти(НаименованиеРегиона, "новосибирская") > 0 Тогда 
		КодРегиона = "54";
	ИначеЕсли Найти(НаименованиеРегиона, "томская") > 0 Тогда 
		КодРегиона = "70";
	ИначеЕсли Найти(НаименованиеРегиона, "омская") > 0 Тогда 
		КодРегиона = "55";
	ИначеЕсли Найти(НаименованиеРегиона, "оренбургская") > 0 Тогда 
		КодРегиона = "56";
	ИначеЕсли Найти(НаименованиеРегиона, "орловская") > 0 Тогда 
		КодРегиона = "57";
	ИначеЕсли Найти(НаименованиеРегиона, "пензенская") > 0 Тогда 
		КодРегиона = "58";
	ИначеЕсли Найти(НаименованиеРегиона, "пермский") > 0 Тогда 
		КодРегиона = "59";
	ИначеЕсли Найти(НаименованиеРегиона, "псковская") > 0 Тогда 
		КодРегиона = "60";
	ИначеЕсли Найти(НаименованиеРегиона, "ростовская") > 0 Тогда 
		КодРегиона = "61";
	ИначеЕсли Найти(НаименованиеРегиона, "рязанская") > 0 Тогда 
		КодРегиона = "62";
	ИначеЕсли Найти(НаименованиеРегиона, "самарская") > 0 Тогда 
		КодРегиона = "63";
	ИначеЕсли Найти(НаименованиеРегиона, "саратовская") > 0 Тогда 
		КодРегиона = "64";
	ИначеЕсли Найти(НаименованиеРегиона, "сахалинская") > 0 Тогда 
		КодРегиона = "65";
	ИначеЕсли Найти(НаименованиеРегиона, "саха") > 0 Тогда 
		КодРегиона = "14";
	ИначеЕсли Найти(НаименованиеРегиона, "якутия") > 0 Тогда 
		КодРегиона = "14";
	ИначеЕсли Найти(НаименованиеРегиона, "смоленская") > 0 Тогда 
		КодРегиона = "67";
	ИначеЕсли Найти(НаименованиеРегиона, "тамбовская") > 0 Тогда 
		КодРегиона = "68";
	ИначеЕсли Найти(НаименованиеРегиона, "тверская") > 0 Тогда 
		КодРегиона = "69";
	ИначеЕсли Найти(НаименованиеРегиона, "тульская") > 0 Тогда 
		КодРегиона = "71";
	ИначеЕсли Найти(НаименованиеРегиона, "тюменская") > 0 Тогда 
		КодРегиона = "72";
	ИначеЕсли Найти(НаименованиеРегиона, "ульяновская") > 0 Тогда 
		КодРегиона = "73";
	ИначеЕсли Найти(НаименованиеРегиона, "челябинская") > 0 Тогда 
		КодРегиона = "74";
	ИначеЕсли Найти(НаименованиеРегиона, "забайкальский") > 0 Тогда 
		КодРегиона = "75";
	ИначеЕсли Найти(НаименованиеРегиона, "ярославская") > 0 Тогда 
		КодРегиона = "76";
	ИначеЕсли Найти(НаименованиеРегиона, "еврейская") > 0 Тогда 
		КодРегиона = "79";
	ИначеЕсли Найти(НаименованиеРегиона, "ненецкий") > 0 Тогда 
		КодРегиона = ?(Найти(НаименованиеРегиона, "ямало") > 0, "89", "83");
	ИначеЕсли Найти(НаименованиеРегиона, "мансийский") > 0 Тогда 
		КодРегиона = "86";
	ИначеЕсли Найти(НаименованиеРегиона, "чукотский") > 0 Тогда 
		КодРегиона = "87";
	ИначеЕсли Найти(НаименованиеРегиона, "чеченская") > 0 Тогда 
		КодРегиона = "20";
	ИначеЕсли Найти(НаименованиеРегиона, "свердловская") > 0 Тогда 
		КодРегиона = "66";
	ИначеЕсли Найти(НаименованиеРегиона, "новгородская") > 0 Тогда 
		КодРегиона = "53";
	ИначеЕсли Найти(НаименованиеРегиона, "горьковская") > 0 Тогда // синоним нижегородской
		КодРегиона = "52";
	ИначеЕсли Найти(НаименованиеРегиона, "бурятия") > 0 Тогда 
		КодРегиона = "03";
	ИначеЕсли Найти(НаименованиеРегиона, "пермская") > 0 Тогда // Пермская обл - синоним Пермского края
		КодРегиона = "59";
	ИначеЕсли Найти(НаименованиеРегиона, "красноярский") > 0 Тогда 
		КодРегиона = "24";
	ИначеЕсли Найти(НаименованиеРегиона, "северная осетия") > 0 Тогда 
		КодРегиона = "15";
	ИначеЕсли Найти(НаименованиеРегиона, "камчатская") > 0 Тогда // Камчатская обл - синоним Камчатского края
		КодРегиона = "41";
	ИначеЕсли Найти(НаименованиеРегиона, "калмыкия") > 0 Тогда 
		КодРегиона = "08";
	ИначеЕсли Найти(НаименованиеРегиона, "читинская") > 0 Тогда // Забайкальский край
		КодРегиона = "75";
	ИначеЕсли Найти(НаименованиеРегиона, "москва") > 0 Тогда 
		КодРегиона = "77";
	ИначеЕсли Найти(НаименованиеРегиона, "калмыкия") > 0 Тогда 
		КодРегиона = "08";
	ИначеЕсли Найти(НаименованиеРегиона, "дагестан") > 0 Тогда 
		КодРегиона = "05";
	ИначеЕсли Найти(НаименованиеРегиона, "санкт-петербург") > 0 Тогда 
		КодРегиона = "78";
	ИначеЕсли Найти(НаименованиеРегиона, "ленинград") > 0 Тогда 
		КодРегиона = "78";
	ИначеЕсли Найти(НаименованиеРегиона, "крым") > 0 Тогда 
		КодРегиона = "91";
	ИначеЕсли Найти(НаименованиеРегиона, "севастополь") > 0 Тогда 
		КодРегиона = "92";
	КонецЕсли;
	
	Возврат КодРегиона;
	
КонецФункции	

Функция ВерсияПриложения() Экспорт
	
	Результат = ЭДО_Кэш_Прочитать("ВерсияПриложения");
	
	Если Результат = Неопределено Тогда
		
		СисИнфо = Новый СистемнаяИнформация;
		
		Результат = СисИнфо.ВерсияПриложения;
		
		ЭДО_Кэш_Поместить("ВерсияПриложения", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Универсальный метод для получения сведений по шапке документов.
// Состав полей и их значений может быть переопределен в интеграционном модуле 
// конфигурации или в подключаемом модуле с помощью событий:
//  - ПриПодготовкеЗапросаПоШапкеДокумента
//  - ПослеПолученияДанныхШапкиДокумента
//
// Параметры:
//  Ссылка - ДокументСсылка - документ, данные шапки которого нужно получить.
// 
// Возвращаемое значение:
//  Структура - реквизиты шапки документа:
//    * Ссылка							 - ДокументСсылка	 - ссылка на документ.
//    * Проведен						 - Булево			 - Истина, если документ проведен.
//    * Дата							 - Дата				 - дата документа.
//    * Номер							 - Строка			 - номер документа.
//    * НомерНаПечать					 - Строка			 - номер документа для вывода на печать (без префиксов и лидирующих нолей).
//    * ИмяМетаданных					 - Строка			 - имя вида документа.
//    * Представление					 - Строка			 - см. функцию ПредставлениеДокумента.
//    * ХозяйственнаяОперация			 - Ссылка			 - элемент перечисления или справочника "ХозяйственныеОперации"
//    * ВидОперации						 - Ссылка			 - вид операции документа.
//    * СуммаДокумента					 - Число			 - сумма документа с НДС.
//    * ЦенаВключаетНДС					 - Булево			 - Истина, если цены указаны с учетом НДС.
//    * ВалютаДокумента					 - СправочникСсылка	 - валюта документа.
//    * ВалютаДокументаКод				 - Строка			 - код валюты документа.
//    * КурсДокумента					 - Число			 - курс валюты документа.
//    * КратностьДокумента				 - Число			 - кратность валюты документа.
//    * РасчетыВУсловныхЕдиницах		 - Булево			 - Истина, если расчеты ведутся в условных единицах.
//    * ИдентификаторГосКонтракта		 - Строка			 - Идентификатор государственного контракта, договора (соглашения)
//    * Организация						 - СправочникСсылка	 - организация документа.
//    * БанковскийСчетОрганизации		 - СправочникСсылка	 - банковский счет организации документа.
//    * ЦифровойИндексОбособленногоПодразделения - Строка, Число - цифровой индекс обособленного подразделения.
//    * Грузоотправитель				 - СправочникСсылка	 - грузоотправитель.
//    * БанковскийСчетГрузоотправителя	 - СправочникСсылка	 - банковский счет грузоотправителя.
//    * Контрагент						 - СправочникСсылка	 - контрагент документа.
//    * БанковскийСчетКонтрагента		 - СправочникСсылка	 - банковский счет контрагента.
//    * Грузополучатель					 - СправочникСсылка	 - грузополучатель.
//    * БанковскийСчетГрузополучателя	 - СправочникСсылка	 - банковский счет грузополучателя.
//    * АдресДоставки					 - Строка			 - адрес доставки груза.
//
Функция ДанныеШапки(СсылкаНаОбъект, ВидЭД = Неопределено)
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда 
		
		ОписаниеОш = НСтр("ru = 'Не заполнено значение первого параметра <Ссылка>!'");
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
	МетаданныеДокумента = СсылкаНаОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Проведен");
	Реквизиты.Вставить("Дата");
	Реквизиты.Вставить("Номер");
	Реквизиты.Вставить("Организация");
	Реквизиты.Вставить("БанковскийСчетОрганизации");
	Реквизиты.Вставить("Контрагент");
	Реквизиты.Вставить("БанковскийСчетКонтрагента");
	Реквизиты.Вставить("Грузоотправитель");
	Реквизиты.Вставить("БанковскийСчетГрузоотправителя");
	Реквизиты.Вставить("Грузополучатель");
	Реквизиты.Вставить("БанковскийСчетГрузополучателя");
	Реквизиты.Вставить("ИдентификаторГосКонтракта");
	Реквизиты.Вставить("Договор");
	Реквизиты.Вставить("РасчетыВУсловныхЕдиницах");
	Реквизиты.Вставить("ВалютаДокумента");
	Реквизиты.Вставить("ВалютаДокументаКод");
	Реквизиты.Вставить("КурсДокумента");
	Реквизиты.Вставить("КратностьДокумента");
	Реквизиты.Вставить("ЦенаВключаетНДС");
	Реквизиты.Вставить("СуммаДокумента");
	
	Реквизиты.Вставить("АдресДоставки");
	Реквизиты.Вставить("СведенияОТранспортировкеИГрузе");
	
	Реквизиты.Вставить("ОбособленноеПодразделение");
	Реквизиты.Вставить("ЦифровойИндексОбособленногоПодразделения", "0");
	
	// Вызовем обработчик события, переопределенный в модуле интеграции
	ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеДокумента, ВидЭД);
	
	// Проверим существование всех необходимых реквизитов и заполним
	// выражения для полей с зарезервированными именами (ИмяПоляСсылка, ИмяПоляПредставление и т.д.)
	ЗаполнитьВыраженияПолейЗапроса(Реквизиты, МетаданныеДокумента);
	
	// Сформируем и выполним запрос по реквизитам
	Шапка = ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	// Дополним итоговую структуру вспомогательными данными
	Шапка.Вставить("Ссылка"			, СсылкаНаОбъект);
	Шапка.Вставить("ВидЭД"			, ВидЭД);
	Шапка.Вставить("НомерНаПечать"	, НомерНаПечать(Шапка));
	Шапка.Вставить("ИмяМетаданных"	, МетаданныеДокумента.Имя);
	Шапка.Вставить("Представление"	, ПредставлениеДокумента(Шапка));
	
	// Вызовем обработчик события, переопределенный в модуле интеграции
	ПослеПолученияДанныхШапкиДокумента(Шапка);
	
	Возврат Шапка;
	
КонецФункции

// Универсальный метод для получения товарной части документа.
//
// Параметры:
//  Шапка - Структура - см. функцию ДанныеШапки
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит информацию о товарной части документа:
//     * ИмяТабличнойЧасти - Строка, Неопределено - имя табличной части документа;
//     * НомерСтроки - Число - номер строки документа;
//     * Номенклатура - СправочникСсылка - номенклатура документа;
//     * НоменклатураПредставление - Строка - представление номенклатуры;
//     * НоменклатураКод - Строка - код или артикул номенклатуры;
//     * ЭтоУслуга - Булево - Истина, если номенклатура является услугой;
//     * ПризнакТоварРаботаУслуга - Строка - тип номенклатуры в терминах сервиса {NotSpecified, Property, Job, Service, PropertyRights, Other};
//     * Характеристика - СправочникСсылка, Неопределено - характеристика номенклатуры;
//     * Серия - СправочникСсылка, Неопределено - серия номенклатуры;
//     * Упаковка - СправочникСсылка - упаковка (единица измерения) номенклатуры;
//     * ЕдиницаИзмерения - СправочникСсылка - единица измерения номенклатуры;
//     * ЕдиницаИзмеренияКод - Строка - код единицы измерения по ОКЕИ;
//     * ВидУпаковки - СправочникСсылка, Неопределено - (устарел, удалить);
//     * СтранаПроисхождения - СправочникСсылка, Неопределено - страна происхождения;
//     * СтранаПроисхожденияКод - Строка - код страны происхождения по ОКСМ;
//     * НомерГТД - СправочникСсылка, Неопределено - номер ГТД;
//     * КодТНВЭД - СправочникСсылка, Неопределено - код ТН ВЭД;
//     * СтавкаНДС - ПеречислениеСсылка, СправочникСсылка - ставка НДС;
//     * СтавкаНДСПредставление - Строка - представление ставки НДС (см. ПредставлениеСтавкиНДС);
//     * Количество - Число - количество упаковок;
//     * КоличествоВОдномМесте - Число - коэффициент упаковки;
//     * Цена - Число - цена за упаковку (без НДС и скидок/наценок);
//     * Сумма - Число - сумма без НДС;
//     * СуммаНДС - Число - сумма налога;
//     * СуммаСНДС - Число - сумма с учетом НДС;
//     * Масса - Число, Неопределено - масса;
//     * МассаНетто - Число, Неопределено - масса (нетто);
//
Функция ДанныеТабличныхЧастей(Шапка) 
	
	Если Не ЗначениеЗаполнено(Шапка) Тогда 
		
		ОписаниеОш = НСтр("ru = 'Не заполнено значение первого параметра <Данные шапки документа>!'");
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
	ОписаниеСтрокиТЧ = НоваяСтрокаТоварнойЧасти();
	Результат = Новый ТаблицаЗначений;
	
	Для Каждого Элемент Из ОписаниеСтрокиТЧ Цикл 
		Результат.Колонки.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	СчетФактура	 = Неопределено;
	ЭтоКСФ		 = Ложь;
	ЭтоУКД_Дис	 = Ложь;
	
	ПромежуточныйРезультат = ТЧПолучитьДанныеЗапроса(Шапка.Ссылка, СчетФактура, ЭтоКСФ, ЭтоУКД_Дис);
	
	Счетчик = 0;
	
	Для Каждого СтрокаИсточник Из ПромежуточныйРезультат Цикл 
		
		Счетчик = Счетчик + 1;
		
		СтрокаПриемник = Результат.Добавить();
		СтрокаПриемник.НомерСтроки = Счетчик;
		СтрокаПриемник.ИмяТабличнойЧасти = "Неопределено";
		
		СтрокаПриемник.Номенклатура = СтрокаИсточник.НоменклатураСсылка;
		СтрокаПриемник.НоменклатураКод = СтрокаИсточник.КодНоменклатуры;
		СтрокаПриемник.НоменклатураПредставление = СтрокаИсточник.Номенклатура;
		
		СтрокаПриемник.ЕдиницаИзмерения		 = СтрокаИсточник.ЕдиницаИзмерения;
		СтрокаПриемник.ЕдиницаИзмеренияКод	 = СтрокаИсточник.КодЕдиницыИзмерения;
		
		Если ЗначениеЗаполнено(СтрокаИсточник.Характеристика) Тогда 
			СтрокаПриемник.Характеристика = СтрокаИсточник.Характеристика;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИсточник.Серия) Тогда 
			СтрокаПриемник.Серия = СтрокаИсточник.Серия;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИсточник.ВидУпаковки) Тогда 
			СтрокаПриемник.ВидУпаковки = СтрокаИсточник.ВидУпаковки;
		КонецЕсли;
		
		СтрокаПриемник.ЭтоУслуга = СтрокаИсточник.ЭтоУслуга;
		СтрокаПриемник.ПризнакТоварРаботаУслуга = ?(СтрокаПриемник.ЭтоУслуга, "Service", "Property");
		
		СтрокаПриемник.СтавкаНДС = СтрокаИсточник.СтавкаНДС;
		СтрокаПриемник.СтавкаНДСПредставление = Модуль_Интеграция.ПолучитьПредставлениеСтавкиНДС(СтрокаПриемник.СтавкаНДС, Истина);
		
		Если ЗначениеЗаполнено(СтрокаИсточник.НомерГТД) Тогда 
			СтрокаПриемник.НомерГТД = СтрокаИсточник.НомерГТД;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПриемник.СтранаПроисхождения) Тогда 
			СтрокаПриемник.СтранаПроисхождения		 = СтрокаИсточник.СтранаПроисхождения;
			СтрокаПриемник.СтранаПроисхожденияКод	 = СтрокаПриемник.СтранаПроисхождения.Код;
		КонецЕсли;
		
		СтрокаПриемник.Количество = СтрокаИсточник.Количество;
		СтрокаПриемник.КоличествоВОдномМесте = СтрокаИсточник.КоличествоВОдномМесте;
		СтрокаПриемник.КоличествоМест = СтрокаИсточник.КоличествоМест;
		СтрокаПриемник.Масса = СтрокаИсточник.Масса;
		
		СтрокаПриемник.СуммаНДС = СтрокаИсточник.СуммаНДС;
		Если Шапка.ЦенаВключаетНДС = Неопределено ИЛИ Шапка.ЦенаВключаетНДС Тогда 
			СтрокаПриемник.СуммаСНДС = СтрокаИсточник.Сумма;
			СтрокаПриемник.Цена		 = СтрокаПриемник.СуммаСНДС / ?(ЗначениеЗаполнено(СтрокаПриемник.Количество), СтрокаПриемник.Количество, 1);
		Иначе
			СтрокаПриемник.СуммаСНДС = СтрокаИсточник.Сумма + СтрокаИсточник.СуммаНДС;
			СтрокаПриемник.Цена		 = СтрокаИсточник.Цена;
		КонецЕсли;
		СтрокаПриемник.Сумма = СтрокаПриемник.СуммаСНДС - СтрокаПриемник.СуммаНДС;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает номер документа для вывода на печать; из номера удаляются префиксы и лидирующие нули.
//
// Параметры:
//  СсылкаИлиСтруктура - ДокументСсылка	 - документ, номер которого нужно получить.
//                     - Структура		 - структура с ключом "Номер".
// 
// Возвращаемое значение:
//  Строка - Номер на печать.
//
Функция НомерНаПечать(СсылкаИлиСтруктура)
	
	СсылкаНаОбъект = Неопределено;
	Если ТипЗнч(СсылкаИлиСтруктура) = Тип("Структура") Тогда 
		СсылкаНаОбъект = СсылкаИлиСтруктура.Ссылка;
	Иначе
		СсылкаНаОбъект = СсылкаИлиСтруктура;
	КонецЕсли;
	
	НомерОбъекта = Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(СсылкаНаОбъект);
	
	Возврат НомерОбъекта;
	
КонецФункции

// Возвращает пользовательское представление документа для отображения в интерфейсе и сообщениях.
//
// Параметры:
//  Шапка - Структура - см. функцию ДанныеШапки
// 
// Возвращаемое значение:
//  Строка - представление документа в виде "<Представление вида документа> <Номер> от <Дата> (<Операция>)".
//
Функция ПредставлениеДокумента(Шапка)
	
	Результат = НСтр("ru = '%1 %2 от %3'");
	Результат = СтрЗаменить(Результат, "%1", Шапка.Ссылка.Метаданные().Представление());
	Результат = СтрЗаменить(Результат, "%2", Шапка.НомерНаПечать);
	Результат = СтрЗаменить(Результат, "%3", Формат(Шапка.Дата, "ДЛФ=D"));
	
	Возврат Результат;
	
КонецФункции

Функция НоваяСтрокаТоварнойЧасти()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяТабличнойЧасти");
	Результат.Вставить("НомерСтроки");
	
	Результат.Вставить("НоменклатураПредставление");
	
	Результат.Вставить("Номенклатура");
	Результат.Вставить("НоменклатураКод");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Серия");
	
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("ЕдиницаИзмеренияКод");
	Результат.Вставить("ВидУпаковки");
	
	Результат.Вставить("ЭтоУслуга");
	Результат.Вставить("ПризнакТоварРаботаУслуга");
	
	Результат.Вставить("СтранаПроисхождения");
	Результат.Вставить("СтранаПроисхожденияКод");
	
	Результат.Вставить("НомерГТД");
	Результат.Вставить("КодТНВЭД");
	
	Результат.Вставить("СтавкаНДС");
	Результат.Вставить("СтавкаНДСПредставление");
	
	Результат.Вставить("Количество");
	Результат.Вставить("КоличествоВОдномМесте");
	Результат.Вставить("КоличествоМест");
	Результат.Вставить("Цена");
	Результат.Вставить("Сумма");
	Результат.Вставить("СуммаНДС");
	Результат.Вставить("СуммаСНДС");
	Результат.Вставить("Масса");
	Результат.Вставить("МассаНетто");
	
	Результат.Вставить("СтранаПроисхожденияДоИзменения");
	Результат.Вставить("СтранаПроисхожденияДоИзмененияКод");
	
	Результат.Вставить("ЕдиницаИзмеренияДоИзменения");
	Результат.Вставить("ЕдиницаИзмеренияДоИзмененияКод");
	
	Результат.Вставить("НомерГТДДоИзменения");
	Результат.Вставить("КодТНВЭДДоИзменения");
	Результат.Вставить("СтавкаНДСДоИзменения");
	Результат.Вставить("СтавкаНДСДоИзмененияПредставление");
	
	Результат.Вставить("КоличествоДоИзменения");
	Результат.Вставить("ЦенаДоИзменения");
	Результат.Вставить("СуммаДоИзменения");
	Результат.Вставить("СуммаНДСДоИзменения");
	Результат.Вставить("СуммаСНДСДоИзменения");
	
	Результат.Вставить("НомерГТДПредставление");
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданный параметр может использоваться в качестве ключа структуры:
// ключ может быть только строковым и должен удовлетворять требованиям, 
// предъявляемым к именованию переменных встроенного языка.
//
// Параметры:
//  ПроверяемоеЗначение - Произвольный - Произвольное значение.
// 
// Возвращаемое значение:
//  Булево - Истина, если проверяемое значение может использоваться в качестве ключа структуры.
//
Функция СтрокаСоответствуетТребованиямККлючуСтруктуры(ПроверяемоеЗначение)
	
	Результат = Ложь;
	
	Если Ложь
		Или ПроверяемоеЗначение = "НЕОПРЕДЕЛЕНО"
		Или ПроверяемоеЗначение = "ИСТИНА"
		Или ПроверяемоеЗначение = "ЛОЖЬ" Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипЗнч(ПроверяемоеЗначение) = Тип("Строка") И ПроверяемоеЗначение = СокрЛП(ПроверяемоеЗначение) Тогда
		
		Попытка
			НоваяСтруктура = Новый Структура(ПроверяемоеЗначение);
			Результат = (НоваяСтруктура.Количество() = 1);
		Исключение КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет существование реквизитов, значения которых нужно получить.
// Если требуемый реквизит отсутствует, то выражение для получения его значения
// заменяется на "НЕОПРЕДЕЛЕНО".
// Выражения для получения значений и представлений реквизитов ссылочных типов
// автоматически заменяются на "<ИмяРеквизита>" и "ПРЕДСТАВЛЕНИЕ(<ИмяРеквизита>)".
//
// Параметры:
//  Реквизиты			 - Структура - в качестве ключа передается псевдоним поля для возвращаемой структуры с результатом, 
//                                     а в качестве значения (опционально) фактическое имя поля в таблице или произвольное выражение.
//                                     Если ключ задан, а значение не определено, то имя поля берется из ключа.
//  МетаданныеИсточника	 - ОбъектМетаданных - Метаданные документа или его табличной части.
//
Процедура ЗаполнитьВыраженияПолейЗапроса(Реквизиты, МетаданныеИсточника)
	
	Для Каждого ОписаниеРеквизита Из Реквизиты Цикл 
		
		Псевдоним = ОписаниеРеквизита.Ключ;
		Выражение = ОписаниеРеквизита.Значение;
		
		Если Не ЗначениеЗаполнено(Выражение) Тогда 
			Выражение = Псевдоним;
		КонецЕсли;
		
		Если Не СтрокаСоответствуетТребованиямККлючуСтруктуры(Выражение) Тогда 
			// Значит, это не имя реквизита, а сложное выражение или поле, получаемое через точку.
			// Такие выражения обрабатывать не будем, а в случае ошибки выполнение запроса выпадет в исключение.
			Продолжить;
		КонецЕсли;
		
		// Будем искать реквизит, для которого строится выражение поля запроса.
		// Если такой реквизит не найдется, запишем в выражение поля запроса "НЕОПРЕДЕЛЕНО".
		РеквизитНайден = Ложь;
		
		Если ЕстьРеквизитМетаданных(МетаданныеИсточника, Выражение, Истина) Тогда
			
			РеквизитНайден = Истина;
			Реквизиты.Вставить(Псевдоним, Выражение);
			
		Иначе // Проверим, можно ли получить требуемое поле через точку от реквизита.
			
			// Будем проверять только наиболее часто встречающиеся разыменования
			ВозможныеПоляРеквизита = Новый Массив;
			ВозможныеПоляРеквизита.Добавить("Код");
			ВозможныеПоляРеквизита.Добавить("Наименование");
			
			Для Каждого ПолеЧерезТочку Из ВозможныеПоляРеквизита Цикл 
				
				Если Не КонецСтрокиРавен(Выражение, ПолеЧерезТочку) Тогда 
					Продолжить;
				КонецЕсли;
				
				ИмяРеквизита = ОбрезатьСтрокуСправа(Выражение, СтрДлина(ПолеЧерезТочку));
				
				Если ЕстьРеквизитМетаданных(МетаданныеИсточника, ИмяРеквизита) Тогда
					
					РеквизитНайден = Истина;
					Выражение = "ЕСТЬNULL(%1.%2, НЕОПРЕДЕЛЕНО)";
					Выражение = СтрЗаменить(Выражение, "%1", ИмяРеквизита);
					Выражение = СтрЗаменить(Выражение, "%2", ПолеЧерезТочку);
					
					Реквизиты.Вставить(Псевдоним, Выражение);
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не РеквизитНайден Тогда 
			Реквизиты.Вставить(Псевдоним, "НЕОПРЕДЕЛЕНО");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет существование реквизита метаданных.
//
// Параметры:
//  ОбъектМетаданных				 - ОбъектМетаданных	 - метаданные произвольного объекта.
//  ИмяРеквизита					 - Строка			 - имя проверяемого реквизита.
//  ПроверятьСтандартныеРеквизиты	 - Булево			 - Истина, если при проверке следует учитывать стандартные реквизиты (Код, Наименование и т.д.)
// 
// Возвращаемое значение:
//  Булево - Истина, если реквизит с заданным именем существует.
//
Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь) Экспорт
	
	Если ОбъектМетаданных = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьРеквизит = ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
	
	Если Не ЕстьРеквизит И ПроверятьСтандартныеРеквизиты Тогда 
		
		КоллекцияРеквизитов = ОбъектМетаданных.СтандартныеРеквизиты;
		
		Для Каждого СтандартныйРеквизит Из КоллекцияРеквизитов Цикл 
			
			Если ВРег(СтандартныйРеквизит.Имя) = ВРег(ИмяРеквизита) Тогда 
				ЕстьРеквизит = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЕстьРеквизит;
	
КонецФункции

// Определяет, заканчивается ли строка указанной подстрокой.
// Аналог функции СтрЗаканчиваетсяНа, реализованной в платформе 8.3.6.
// ВНИМАНИЕ! Имя функции нельзя изменить на СтрокаЗаканчиваетсяНа(), т.к.
// в некоторых типовых конфигурациях метод с таким именем присутствует
// в глобальном общем модуле.
//
// Параметры:
//  Строка			 - Строка - Строка, окончание которой проверяется на совпадение с подстрокой поиска.
//  СтрокаПоиска	 - Строка - Строка, содержащая предполагаемое окончание строки. 
//                              В случае если переданное значение является пустой строкой генерируется исключение.
//  УчитыватьРегистр - Булево - Истина, если проверять совпадение следует с учетом регистра.
// 
// Возвращаемое значение:
//  Булево - Истина, если строка заканчивается указанной подстрокой.
//
Функция КонецСтрокиРавен(Знач Строка, Знач СтрокаПоиска, УчитыватьРегистр = Истина) Экспорт
	
	Если Не ТипЗнч(СтрокаПоиска) = Тип("Строка") Тогда 
		ТекстИсключения = НСтр("ru = 'Ошибка при вызове метода контекста (КонецСтрокиРавен): 
                                |Недопустимое значение параметра (параметр номер ''2'')'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если Не УчитыватьРегистр Тогда 
		Строка		 = ВРег(Строка);
		СтрокаПоиска = ВРег(СтрокаПоиска);
	КонецЕсли;
	
	Результат = Ложь;
	Если ЗначениеЗаполнено(СтрокаПоиска) 
		И Прав(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаляет с конца строки заданное количество символов.
//
// Параметры:
//  Строка				 - Строка	 - исходная строка.
//  КоличествоСимволов	 - Число	 - количество удаляемых символов.
// 
// Возвращаемое значение:
//  Строка - обрезанная строка.
//
Функция ОбрезатьСтрокуСправа(Строка, КоличествоСимволов = 1) Экспорт
	
	Результат = Лев(Строка, СтрДлина(Строка) - КоличествоСимволов);
	
	Возврат Результат;
	
КонецФункции


// Возвращает представление статустов взаимоотношений контрагентов в сервисе
// 
// Возвращаемое значение:
//  Структура
//
Функция ПредставлениеСтатусовВзаимоотношений() Экспорт
	
	Результат= Новый Соответствие;
	Результат.Вставить("IsMyCounteragent"		, "Партнерские отношения");
	Результат.Вставить("InvitesMe"				, "Получен запрос");
	Результат.Вставить("IsInvitedByMe"			, "Ожидается ответ");
	Результат.Вставить("RejectsMe"				, "Заблокировал меня");
	Результат.Вставить("IsRejectedByMe"			, "Заблокирован мной");
	Результат.Вставить("IsOrganization"			, "Совпадает с организацией");
	Результат.Вставить("NotInCounteragentList"	, "Имеет доступ в " + КраткоеНаименованиеСистемы);
	Результат.Вставить("IsActive"				, "Работает в " + КраткоеНаименованиеСистемыПредложныйПадеж);
	
	Возврат Результат;
	
КонецФункции

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКИ()
	
	ВидыКИ = Новый Структура;
	ВидыКИ.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	ВидыКИ.Вставить("ФактическийАдрес", "ФактическийАдрес");
	ВидыКИ.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	ВидыКИ.Вставить("Факс", "Факс");
	
	Результат = Новый ФиксированнаяСтруктура(ВидыКИ);
	
	Возврат Результат;
	
КонецФункции

// Возвращает полный список видов электронных документов.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - синтетическое перечисление.
//
Функция Перечисление_ВидыЭД() Экспорт
	
	ВидыЭД = Новый Структура;
	ВидыЭД.Вставить("СчетНаОплату", "СчетНаОплату");
	ВидыЭД.Вставить("ТоварнаяНакладная", "ТоварнаяНакладная");
	ВидыЭД.Вставить("АктОбОказанииУслуг", "АктОбОказанииУслуг");
	ВидыЭД.Вставить("СчетФактура", "СчетФактура");
	ВидыЭД.Вставить("СоглашениеОбИзмененииСтоимости", "СоглашениеОбИзмененииСтоимости");
	ВидыЭД.Вставить("КорректировочныйСчетФактура", "КорректировочныйСчетФактура");
	
	Результат = Новый ФиксированнаяСтруктура(ВидыЭД);
	
	Возврат Результат;
	
КонецФункции

// Возвращает коллекцию имен инфополей, которые зарезервированы
// под хранение и передачу служебной информации.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. тело функции.
//
Функция ЗарезервированныеИменаИнфоПолей()
	
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныеУсловия"		, "ДопУсловия");
	Результат.Вставить("ДополнительнаяИнформация"	, "ДопИнформация");
	Результат.Вставить("СрокОплаты"					, "СрокОплаты");
	Результат.Вставить("ИдентификаторПлатежа"		, "УИП");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Конструктор коллекции, содержащей общепринятые реквизиты компании (юридического лица или индивидуального предпринимателя).
// 
// Возвращаемое значение:
// Структура - см. содержимое функции
//
Функция НовыйРеквизитыЮрФизЛица()
	
	Реквизиты = Новый Структура();
	Реквизиты.Вставить("Ссылка"); // Ссылка на компанию
	Реквизиты.Вставить("ЮридическоеФизическоеЛицо"); // ЮридическоеЛицо или ФизическоеЛицо
	// Наименования
	Реквизиты.Вставить("Представление",                      "");
	Реквизиты.Вставить("ПолноеНаименование",                 "");
	Реквизиты.Вставить("СокращенноеНаименование",            "");
	Реквизиты.Вставить("НаименованиеДляПечатныхФорм",        "");
	Реквизиты.Вставить("ФамилияИнициалыФизлица",             ""); // Фамилия И.О.
	Реквизиты.Вставить("ФИОФизлица",                         ""); // Фамилия Имя Отчество
	// Адреса и контактная информация
	Реквизиты.Вставить("ЮридическийАдрес",                   "");
	Реквизиты.Вставить("ЮридическийАдресСтруктурой",         "");
	Реквизиты.Вставить("ФактическийАдрес",                   ""); 
	Реквизиты.Вставить("ФактическийАдресСтруктурой",         "");
	Реквизиты.Вставить("ПочтовыйАдрес",                      ""); 
	Реквизиты.Вставить("Телефоны",                           ""); 
	Реквизиты.Вставить("Факс",                               ""); 
	Реквизиты.Вставить("Email",                              "");
	// Регистрационные данные
	Реквизиты.Вставить("ОГРН",                               ""); // Здесь же ОГРНИП для ИП, рег. номер для иностранных контрагентов
	Реквизиты.Вставить("ДатаРегистрации",                    "");
	Реквизиты.Вставить("КодПоОКПО",                          "");
	Реквизиты.Вставить("ИНН",                                "");
	Реквизиты.Вставить("КПП",                                ""); // Только для ЮЛ
	Реквизиты.Вставить("СвидетельствоСерияНомер",            "");           // Только для ИП
	Реквизиты.Вставить("СвидетельствоДатаВыдачи",            '0001-01-01'); // Только для ИП
	Реквизиты.Вставить("Свидетельство",                      ""); // Свидетельство строкой, только для ИП
	Реквизиты.Вставить("ДокументУдостоверяющийЛичность",     ""); // Только для физлица
	Реквизиты.Вставить("ИндивидуальныйПредприниматель",      Неопределено); // Только для организаций-ИП: ссылка на физ. лицо
	Реквизиты.Вставить("СтранаРегистрации",                  Неопределено);
	Реквизиты.Вставить("НалоговыйНомерВСтранеРегистрации",   "");
	// Банковские реквизиты
	Реквизиты.Вставить("НомерСчета",                         "");
	Реквизиты.Вставить("ТекстКорреспондента",                "");
	Реквизиты.Вставить("БИК",                                "");
	Реквизиты.Вставить("Банк",                               "");
	Реквизиты.Вставить("АдресБанка",                         "");
	Реквизиты.Вставить("КоррСчет",                           "");
	// Должностные лица юридического лица
	Реквизиты.Вставить("РуководительФИО"                   , "");
	Реквизиты.Вставить("ДолжностьРуководителяПредставление", "");
	
	Реквизиты.Вставить("ТипЮрФизЛица"					   , ""); // ЮридическоеЛицо, ФизическоеЛицо, ИностраннаяКомпания
	
	Возврат Реквизиты;
	
КонецФункции

// Предоставляет реквизиты компании (юридического лица или предпринимателя), например, для вывода в печатной форме.
//
// Параметры:
//  ЮрФизЛицо		 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период			 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет	 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                     Если не передан, будут включены реквизиты основного банковского счета.
// 
// Возвращаемое значение:
// см. НовыйРеквизитыКомпании() - коллекция общепринятых реквизитов компании.
//
Функция РеквизитыЮрФизЛица(ЮрФизЛицо, Период = '00010101', Знач БанковскийСчет = Неопределено)
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЮрФизЛицо) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Результат = НовыйРеквизитыЮрФизЛица();
	Результат.Ссылка = ЮрФизЛицо;
	
	СтандартнаяОбработка = Истина;
	ПриПолученииРеквизитовЮрФизЛица(Результат, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		Буфер = Вычислить("УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ЮрФизЛицо, Период,, БанковскийСчет)");
		ЗаполнитьЗначенияСвойств(Результат, Буфер);
				
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.НаименованиеДляПечатныхФорм) Тогда 
		Результат.НаименованиеДляПечатныхФорм = Результат.ПолноеНаименование;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры дополнительных параметров процедуры ПрочитатьСведенияОбАдресахЮрФизЛица()
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//     * ПолучатьЮридическийАдрес	 - Булево - Истина, если требуется получить юридический адрес.
//     * ПолучатьФактическийАдрес	 - Булево - Истина, если требуется получить фактический адрес.
//     * АдресДоставки				 - Строка - строковое представление адреса. Если указано, 
//                                              будет выполнен поиск сведений о фактическом адресе
//                                              по переданному представлению.
//
Функция ПараметрыПолученияКонтактнойИнформацииЮрФизЛица()
	
	Результат = Новый Структура;
	Результат.Вставить("ПолучатьЮридическийАдрес", Истина);
	Результат.Вставить("ПолучатьФактическийАдрес", Истина);
	Результат.Вставить("АдресДоставки", Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Дополняет реквизиты организации сведениями о контактной информации.
//
// Параметры:
//  РеквизитыОрганизации	 - Структура - см. функцию РеквизитыЮрФизЛица();
//  ДополнительныеПараметры	 - Структура - (Необязательный) параметры запроса контактной информации (см. ПараметрыПолученияКонтактнойИнформацииЮрФизЛица());
// 
Процедура ПрочитатьСведенияОбАдресахЮрФизЛица(РеквизитыОрганизации, ДополнительныеПараметры = Неопределено)
	
	ПараметрыЗапросаКИ = ПараметрыПолученияКонтактнойИнформацииЮрФизЛица();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыЗапросаКИ, ДополнительныеПараметры);
	КонецЕсли;
	
	Если ПараметрыЗапросаКИ.ПолучатьЮридическийАдрес
		И Не ЗначениеЗаполнено(РеквизитыОрганизации.ЮридическийАдресСтруктурой) Тогда
		МенеджерИнтеграции = МодульМенеджерИнтеграции();
		РеквизитыОрганизации.ЮридическийАдресСтруктурой = МенеджерИнтеграции.СведенияОбАдресе(РеквизитыОрганизации.Ссылка, Истина);
	КонецЕсли;
	
	Если ПараметрыЗапросаКИ.ПолучатьФактическийАдрес
		И Не ЗначениеЗаполнено(РеквизитыОрганизации.ФактическийАдресСтруктурой) Тогда
		МенеджерИнтеграции = МодульМенеджерИнтеграции();
		РеквизитыОрганизации.ФактическийАдресСтруктурой = МенеджерИнтеграции.СведенияОбАдресе(РеквизитыОрганизации.Ссылка, Ложь, ПараметрыЗапросаКИ.АдресДоставки);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структурированную информацию о договоре, соглашении или
// ином основании отгрузки/перехода прав собственности.
//
// Параметры:
//  Шапка - Структура - реквизиты шапки документа (см. ДанныеШапки)
// 
// Возвращаемое значение:
//  Неопределено - если не удалось получить реквизиты основания передачи.
//  Структура - содержит поля:
//     * Представление - Строка - представление основания (договора, соглашения);
//     * Номер - Строка - (необязательный) номер основания;
//     * Дата - Дата - (необязательный) дата основания;
//
Функция РеквизитыДоговора(Шапка)
	
	Результат = Новый Структура;
	Результат.Вставить("Представление");
	Результат.Вставить("Номер");
	Результат.Вставить("Дата");
	
	СтандартнаяОбработка = Истина;
	ПриПолученииРеквизитовДоговора(Результат, Шапка, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда 
		
		Договор = Шапка.Договор;
		Если ЗначениеЗаполнено(Договор) Тогда 
			Результат.Представление = СокрЛП(Договор.Наименование);
			Результат.Номер = СокрЛП(Договор.Номер);
			Результат.Дата = Договор.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Представление) Тогда 
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры дополнительных параметров процедуры ЗаполнитьИнформациюОбОрганизации()
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//     * ВидАдреса - Перечисление_ВидыКИ - вид адреса для заполнения свойства Address.
//
Функция ПараметрыЗаполненияИнформацииОбОрганизации()
	
	Результат = Новый Структура;
	Результат.Вставить("ВидАдреса", Перечисление_ВидыКИ().ЮридическийАдрес);
	
	Возврат Результат;
	
КонецФункции

// Заполняет сведения об участнике сделки.
//
// Параметры:
//  СведенияОбОрганизации	 - Структура - см. функцию Новый_ExtendedOrganizationInfo()
//  РеквизитыОрганизации	 - Структура - см. функцию РеквизитыЮрФизЛица()
//  ДополнительныеПараметры	 - Структура - (Необязательный) см. функцию ПараметрыЗаполненияИнформацииОбОрганизации()
//
Процедура ЗаполнитьИнформациюОбОрганизации(СведенияОбОрганизации, РеквизитыОрганизации, ДополнительныеПараметры = Неопределено)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияИнформацииОбОрганизации();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	// ОбщиеСвойства
	СведенияОбОрганизации.Name	 = РеквизитыОрганизации.НаименованиеДляПечатныхФорм;
	СведенияОбОрганизации.Inn	 = РеквизитыОрганизации.ИНН;
	СведенияОбОрганизации.Kpp	 = РеквизитыОрганизации.КПП;
	СведенияОбОрганизации.Okpo	 = РеквизитыОрганизации.КодПоОкпо;
	СведенияОбОрганизации.Phone	 = РеквизитыОрганизации.Телефоны;
	
	СведенияОбОрганизации.BankAccountNumber	 = РеквизитыОрганизации.НомерСчета;
	СведенияОбОрганизации.BankId			 = РеквизитыОрганизации.БИК;
	СведенияОбОрганизации.BankName			 = ?(ЗначениеЗаполнено(РеквизитыОрганизации.Банк), СокрЛП(РеквизитыОрганизации.Банк), Неопределено); // Банк может быть ссылкой
	
	// Адрес
	ИспользоватьЮридическийАдрес = (ПараметрыЗаполнения.ВидАдреса = Перечисление_ВидыКИ().ЮридическийАдрес);
	
	СведенияОбАдресе = ?(ИспользоватьЮридическийАдрес, РеквизитыОрганизации.ЮридическийАдресСтруктурой, РеквизитыОрганизации.ФактическийАдресСтруктурой);
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	МенеджерИнтеграции.Заполнить_AddressInfo(СведенияОбОрганизации.Address, СведенияОбАдресе);
	
	ОрганизацияИП = СтрДлина(РеквизитыОрганизации.ИНН) = 12;
	ТипОрганизации = ?(ОрганизацияИП, "IndividualEntity", "LegalEntity");
	
	// ExtendedOrganizationInfo
	Если СведенияОбОрганизации.Свойство("CorrespondentAccount") Тогда 
		СведенияОбОрганизации.CorrespondentAccount = РеквизитыОрганизации.КоррСчет;
	КонецЕсли;
	
	Если СведенияОбОрганизации.Свойство("Email") Тогда
		СведенияОбОрганизации.Email = РеквизитыОрганизации.Email;
	КонецЕсли;
	
	Если СведенияОбОрганизации.Свойство("Type") Тогда 
		СведенияОбОрганизации.Type = ТипОрганизации;
	КонецЕсли;
	
	// OrganizationInfo
	Если СведенияОбОрганизации.Свойство("IsSoleProprietor") Тогда 
		СведенияОбОрганизации.IsSoleProprietor = (ТипОрганизации = "IndividualEntity");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет сведения таблицы счета на оплату.
//
// Параметры:
//  ТаблицаЭД	 - Структура		 - см. функцию Новый_ProformaInvoiceTable()
//  ДанныеТЧ	 - ТаблицаЗначений	 - см. функцию ДанныеТабличныхЧастей()
//
Процедура ЗаполнитьТаблицуСчетаНаОплату(ТаблицаЭД, ДанныеТЧ)
	
	// Итоги
	ТаблицаЭД.TotalWithVatExcluded	 = ДанныеТЧ.Итог("Сумма");
	ТаблицаЭД.TotalVat				 = ДанныеТЧ.Итог("СуммаНДС");
	ТаблицаЭД.Total					 = ДанныеТЧ.Итог("СуммаСНДС");
	ТаблицаЭД.GrandTotal			 = ТаблицаЭД.Total;
	
	// Строки таблицы
	Для Каждого СтрокаТЧ Из ДанныеТЧ Цикл 
		
		СтрокаЭД = ТаблицаЭД.Items.Добавить();
		
		СтрокаЭД.Product	 = СтрокаТЧ.НоменклатураПредставление;
		СтрокаЭД.Unit		 = СтрокаТЧ.ЕдиницаИзмеренияКод;
		СтрокаЭД.UnitName	 = Строка(СтрокаТЧ.ЕдиницаИзмерения);
		СтрокаЭД.Quantity	 = СтрокаТЧ.Количество;
		СтрокаЭД.Price		 = СтрокаТЧ.Цена;
		СтрокаЭД.TaxRate	 = СтрокаТЧ.СтавкаНДСПредставление;
		СтрокаЭД.Excise		 = Неопределено;
		СтрокаЭД.Vat		 = СтрокаТЧ.СуммаНДС;
		СтрокаЭД.Subtotal	 = СтрокаТЧ.СуммаСНДС;
		СтрокаЭД.SubtotalWithVatExcluded = СтрокаТЧ.Сумма;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(СтрокаЭД, СтрокаТЧ);
		
	КонецЦикла;
	
КонецПроцедуры

// Событие возникает перед выполнением запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить выражения полей запроса для получения данных шапки.
//
// Параметры:
//  Реквизиты			 - Структура		 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение;
//  МетаданныеИсточника	 - ОбъектМетаданных	 - Метаданные документа-источника;
//  ВидЭД 				 - Строка			 - вид подгатавливаемого электронного документа (см. Перечисление_ВидыЭД());
//
// Пример:
//		Если ЕстьРеквизитМетаданных(МетаданныеИсточника, "Грузоотправитель") Тогда 
//			
//			Реквизиты.Грузоотправитель = 
//			"ВЫБОР
//			|	КОГДА Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//			|		ТОГДА Организация
//			|	ИНАЧЕ Грузоотправитель
//			|КОНЕЦ";
//			
//		КонецЕсли;
//
Процедура ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника, ВидЭД)
	
	ВидыЭД = Перечисление_ВидыЭД();
	
	Если ВидЭД = ВидыЭД.СчетНаОплату Тогда 
		
		Реквизиты.Вставить("ПолучательПлатежа");
		Реквизиты.Вставить("Плательщик");
		Реквизиты.Вставить("СуммаСкидки");
		Реквизиты.Вставить("НазначениеПлатежа");
		Реквизиты.Вставить("ДополнительныеУсловия");
		Реквизиты.Вставить("ДополнительнаяИнформация");
		Реквизиты.Вставить("ИдентификаторПлатежа");
		Реквизиты.Вставить("СрокОплаты");
		
	КонецЕсли;
	
	Реквизиты.Договор = "ДоговорКонтрагента";
	Реквизиты.РасчетыВУсловныхЕдиницах = "ДоговорКонтрагента.РасчетыВУсловныхЕдиницах";
	Реквизиты.КурсДокумента = "КурсВзаиморасчетов";
	Реквизиты.КратностьДокумента = "КратностьВзаиморасчетов";
	Реквизиты.ЦенаВключаетНДС = "СуммаВключаетНДС";
	
	Модуль_Интеграция.ПриПодготовкеЗапросаПоШапкеДокумента(Реквизиты, МетаданныеИсточника, ВидЭД);
	
КонецПроцедуры

// Событие возникает после выполнения запроса по шапке документа (см. ДанныеШапки).
// Позволяет переопределить или дополнить данные шапки документа.
//
// Параметры:
//  Шапка - Структура - Структура со значениями реквизитов документа.
//
// Пример:
//   Шапка.БанковскийСчетОрганизации = СчетОрганизации(Шапка.Организация);
//
Процедура ПослеПолученияДанныхШапкиДокумента(Шапка)
	
	Модуль_Интеграция.ПослеПолученияДанныхШапкиДокумента(Шапка);
	
КонецПроцедуры

// Событие возникает при получении сведений об организации, контрагенте или физическом лице.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка)
	
	Модуль_Интеграция.ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка);
	
КонецПроцедуры

// Событие возникает при получении реквизитов договора, соглашения
// или иного основания передачи/перехода прав собственности.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка)
	
	Модуль_Интеграция.ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка);
	
КонецПроцедуры

//{ ОБЩИЕ ПРОЦЕДУРЫ И ФУНКУЦИИ

Функция СериализоватьДанные(Структура) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(Структура); 
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);	
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция ДесериализоватьДанные(Данные) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Данные);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

Функция ПолучитьСтруктуруПараметровДляОтправкиПакета() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Вкл");
	Результат.Вставить("Документ");
	Результат.Вставить("ТипДокумента");
	Результат.Вставить("DocumentType");
	Результат.Вставить("ToDepartmentId");
	Результат.Вставить("ЭтоТестовыйДокумент");
	Результат.Вставить("ТребуетсяНомерЗаказа");
	Результат.Вставить("НомерЗаказа");
	Результат.Вставить("ДопСведения");
	Результат.Вставить("ВнешняяПечатнаяФорма");
	Результат.Вставить("ВыгружатьExel");
	Результат.Вставить("Отправитель");
	Результат.Вставить("Получатель");
	Результат.Вставить("CustomDocumentId");
	Результат.Вставить("Id");
	Результат.Вставить("ВидДокумента");
	Результат.Вставить("ДокументОснованиеДляУПДСчфДоп");
	Результат.Вставить("ФункцияУПД");
	Результат.Вставить("ИдентификаторСтрокиДокумента");
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	Результат.Вставить("ЭтоФайл");
	Результат.Вставить("СвойстваФайла");
	Результат.Вставить("ДанныеФайла");
	Результат.Вставить("ФорматОтправки");
	
	Возврат Результат;
	
КонецФункции

Функция ИнициироватьТаблицуСоответствияCustomIdСсылке1С() Экспорт
	
	ТаблицаСоответствияCustomIdСсылке1С = Новый ТаблицаЗначений;
	
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("CustomDocumentId");
	
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("Type");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ДокументСсылкаВ1С");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ДокументОснованиеДляУПДСчфДоп");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ЭтоВПФ");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ВнешняяПечатнаяФорма");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ЭтоКорректировкаИсправление");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ЗаполненНаОсновании");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ЭтоФайл");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ПервичныйИдентификаторПакета");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ИдентификаторСтрокиДокумента");
	ТаблицаСоответствияCustomIdСсылке1С.Колонки.Добавить("ФорматОтправки");
	
	Возврат ТаблицаСоответствияCustomIdСсылке1С;
	
КонецФункции

// Возвращает строку: "Равны" / "ПерваяБольше" / "ПерваяМеньше".
// Версии типа "1.0.1b" сравнивать нельзя.
//
Функция СравнитьВерсии(Знач ПерваяВерсия, Знач ВтораяВерсия, Разделитель = ".") Экспорт
	
	Результат = "Равны";  // ПерваяБольше / ПерваяМеньше
	
	Пока НЕ ПустаяСтрока(ПерваяВерсия) ИЛИ НЕ ПустаяСтрока(ВтораяВерсия) Цикл
		
		Поз = Найти(ПерваяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(ПерваяВерсия, Поз - 1));
			ПерваяВерсия = Сред(ПерваяВерсия, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(ПерваяВерсия), 0, Число(ПерваяВерсия));
			ПерваяВерсия = "";
		КонецЕсли;
		
		Поз = Найти(ВтораяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(ВтораяВерсия, Поз - 1));
			ВтораяВерсия = Сред(ВтораяВерсия, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(ВтораяВерсия), 0, Число(ВтораяВерсия));
			ВтораяВерсия = "";
		КонецЕсли;
		
		Если НомерПервойВерсии > НомерВторойВерсии Тогда
			
			Результат = "ПерваяБольше";
			Прервать;
			
		ИначеЕсли НомерПервойВерсии < НомерВторойВерсии Тогда
			
			Результат = "ПерваяМеньше";
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураФИО(ФИО) Экспорт
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	
	МассивПодстрок = Преобразование_СтрокуВМассивПодстрок(ФИО, " ", Ложь, Истина);
	
	РазмерМассива = МассивПодстрок.Количество();
	
	Если РазмерМассива > 0 Тогда
		СтруктураФИО.Фамилия = МассивПодстрок[0];
	КонецЕсли;
	
	Если РазмерМассива > 1 Тогда
		СтруктураФИО.Имя = МассивПодстрок[1];
	КонецЕсли;
	
	Если РазмерМассива > 2 Тогда
		СтруктураФИО.Отчество = МассивПодстрок[2];
	КонецЕсли;
	
	Возврат СтруктураФИО;
	
КонецФункции

Функция РазделительПакетаЗапросов() Экспорт
	
	Возврат "		
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"
	
КонецФункции

Функция РазделительОбъединенияЗапросов(БезДубликатов= Ложь) Экспорт
	
	Возврат "		
	|
	|ОБЪЕДИНИТЬ " + ?(БезДубликатов, "", "ВСЕ") + "
	|
	|"
	
КонецФункции

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита, ЗначениеРеквизита = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Попытка
		Объект_ЗначениеРеквизита = Объект[ИмяРеквизита];
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	Если НЕ Отказ Тогда
		ЗначениеРеквизита = Объект_ЗначениеРеквизита;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

Функция ПредопределенныйЭлемент(Менеджер, ИмяПредопределенногоЭлемента) Экспорт
	
	Попытка 
		Возврат Менеджер[ИмяПредопределенногоЭлемента];
	Исключение КонецПопытки;
	
КонецФункции

Функция ТипДокументаУПД(ФункцияДокумента) Экспорт
	
	ТипыДокументов = Новый Соответствие;
	
	ТипыДокументов.Вставить("СЧФДОП"		 , "УПД Счф Доп");
	ТипыДокументов.Вставить("СЧФ"			 , "УПД Счф");
	ТипыДокументов.Вставить("ДОП"			 , "УПД Доп");
	
	ТипыДокументов.Вставить("InvoiceAndBasic", "УПД Счф Доп");
	ТипыДокументов.Вставить("Invoice"		 , "УПД Счф");
	ТипыДокументов.Вставить("Basic"			 , "УПД Доп");
	
	ТипыДокументов.Вставить("СвРК"			 , "УПД СвРК");
	ТипыДокументов.Вставить("СвЗК"			 , "УПД СвЗК");
	
	Результат = Строка(ТипыДокументов[ФункцияДокумента]);
	
	Возврат Результат;
	
КонецФункции

Функция ТипДокументаУКД(ФункцияДокумента) Экспорт
	
	ТипыДокументов = Новый Соответствие;
	
	ТипыДокументов.Вставить("КСЧФДИС"		 , "УКД Ксчф Дис");
	ТипыДокументов.Вставить("КСЧФ"			 , "УКД Ксчф");
	ТипыДокументов.Вставить("ДИС"			 , "УКД Дис");
	
	ТипыДокументов.Вставить("InvoiceAndBasic", "УКД Ксчф Дис");
	ТипыДокументов.Вставить("Invoice"		 , "УКД Ксчф");
	ТипыДокументов.Вставить("Basic"			 , "УКД Дис");
	
	ТипыДокументов.Вставить("СвИСРК"			 , "УКД СвИСРК");
	ТипыДокументов.Вставить("СвИСЗК"			 , "УКД СвИСЗК");
	
	Результат = Строка(ТипыДокументов[ФункцияДокумента]);
	
	Возврат Результат;
	
КонецФункции

Функция ТипДокументаИУПД(ФункцияДокумента) Экспорт
	
	ТипыДокументов = Новый Соответствие;
	
	ТипыДокументов.Вставить("СЧФДОП"		 , "Исправление УПД Счф Доп");
	ТипыДокументов.Вставить("СЧФ"			 , "Исправление УПД Счф");
	ТипыДокументов.Вставить("ДОП"			 , "Исправление УПД Доп");
	
	ТипыДокументов.Вставить("InvoiceAndBasic", "Исправление УПД Счф Доп");
	ТипыДокументов.Вставить("Invoice"		 , "Исправление УПД Счф");
	ТипыДокументов.Вставить("Basic"			 , "Исправление УПД Доп");
	
	ТипыДокументов.Вставить("СвРК"			 , "Исправление УПД СвРК");
	ТипыДокументов.Вставить("СвЗК"			 , "Исправление УПД СвЗК");
	
	Результат = Строка(ТипыДокументов[ФункцияДокумента]);
	
	Возврат Результат;
	
КонецФункции

Функция ФункцияУПД(ФункцияДокумента) Экспорт
	
	СоответствиеФункций = Новый Соответствие;
	СоответствиеФункций.Вставить("InvoiceAndBasic", "СЧФДОП");
	СоответствиеФункций.Вставить("Invoice"		  , "СЧФ");
	СоответствиеФункций.Вставить("Basic"		  , "ДОП");
	
	Результат = Строка(СоответствиеФункций[БазоваяФункцияДокумента(ФункцияДокумента)]);
	
	Возврат Результат;
	
КонецФункции

Функция ФункцияУКД(ФункцияДокумента) Экспорт
	
	СоответствиеФункций = Новый Соответствие;
	СоответствиеФункций.Вставить("InvoiceAndBasic", "КСЧФДИС");
	СоответствиеФункций.Вставить("Invoice"		  , "КСЧФ");
	СоответствиеФункций.Вставить("Basic"		  , "ДИС");
	
	Результат = Строка(СоответствиеФункций[БазоваяФункцияДокумента(ФункцияДокумента)]);
	
	Возврат Результат;
	
КонецФункции

Функция БазоваяФункцияДокумента(ФункцияДокумента) Экспорт
	
	СоответствиеФункций = Новый Соответствие;
	
	СоответствиеФункций.Вставить("СЧФДОП", "InvoiceAndBasic");
	СоответствиеФункций.Вставить("СЧФ"	 , "Invoice");
	СоответствиеФункций.Вставить("ДОП"	 , "Basic");
	
	СоответствиеФункций.Вставить("КСЧФДИС", "InvoiceAndBasic");
	СоответствиеФункций.Вставить("КСЧФ"	  , "Invoice");
	СоответствиеФункций.Вставить("ДИС"	  , "Basic");
	
	СоответствиеФункций.Вставить("InvoiceAndBasic", "InvoiceAndBasic");
	СоответствиеФункций.Вставить("Invoice"		  , "Invoice");
	СоответствиеФункций.Вставить("Basic"		  , "Basic");
	
	Результат = Строка(СоответствиеФункций[ФункцияДокумента]);
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание возможных фильтров документов 
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Ключ - Строка - Идентификатор типа
//   * Значение - Структура
//			* Представление		- Строка - Пользовательское представление
//			* ЗначениеФильтра	- Число - Строковый идентификатор фильтра
Функция ФильтрыДокументовПоТипу() Экспорт
	
	Результат = Новый Структура;
	
	ДобавитьВозможныйФильтрПоТипу(Результат, "ВсеДокументы"	,	"Все документы"				,	0);
	ДобавитьВозможныйФильтрПоТипу(Результат, "Накладные"	,	"Накладные"					,	1);
	ДобавитьВозможныйФильтрПоТипу(Результат, "Торг12"		,	"Торг-12"					,	11);
	ДобавитьВозможныйФильтрПоТипу(Результат, "Акт"			,	"Акт"						,	12);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УПД_ДОП"		,	ТипДокументаУПД("ДОП")		,	13);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УКД_ДИС"		,	ТипДокументаУКД("ДИС")		,	14);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ИУПД_ДОП"		,	ТипДокументаИУПД("ДОП")		,	15);
	
	ДобавитьВозможныйФильтрПоТипу(Результат, "СФ"			,	"Счета-фактуры"				,	2);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ОСФ"			,	"Оригинальные СФ"			,	21);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ИСФ"			,	"Исправленные СФ"			,	22);
	ДобавитьВозможныйФильтрПоТипу(Результат, "КСФ"			,	"Корректировочные СФ"		,	23);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УПД_СЧФ"		,	ТипДокументаУПД("СЧФ")		,	24);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УКД_КСЧФ"		,	ТипДокументаУКД("КСЧФ")		,	25);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ИУПД_СЧФ"		,	ТипДокументаИУПД("СЧФ")		,	26);
	
	ДобавитьВозможныйФильтрПоТипу(Результат, "УПД_СЧФДОП"	,	ТипДокументаУПД("СЧФДОП")	,	5);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УПД_СвРК"		,	ТипДокументаУПД("СвРК")		,	49);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УПД_СвЗК"		,	ТипДокументаУПД("СвЗК")		,	50);
	
	ДобавитьВозможныйФильтрПоТипу(Результат, "УКД_КСЧФДИС"	,	ТипДокументаУКД("КСЧФДИС")	,	6);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УКД_СвИСРК"	,	ТипДокументаУКД("СвИСРК")	,	51);
	ДобавитьВозможныйФильтрПоТипу(Результат, "УКД_СвИСЗК"	,	ТипДокументаУКД("СвИСЗК")	,	52);
	
	ДобавитьВозможныйФильтрПоТипу(Результат, "ИУПД_СЧФДОП"	,	ТипДокументаИУПД("СЧФДОП")	,	7);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ИУПД_СвРК"	,	ТипДокументаИУПД("СвРК")	,	53);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ИУПД_СвЗК"	,	ТипДокументаИУПД("СвЗК")	,	54);
	
	ДобавитьВозможныйФильтрПоТипу(Результат, "Торг2"					,	"Акт о расхождениях ТОРГ-2",	8);
	ДобавитьВозможныйФильтрПоТипу(Результат, "СчетаНаОплату"			,	"Счета на оплату",				3);
	ДобавитьВозможныйФильтрПоТипу(Результат, "Неформализованные"		,	"Неформализованные",			4);
	ДобавитьВозможныйФильтрПоТипу(Результат, "АктСверки"				,	"Акт сверки",					41);
	ДобавитьВозможныйФильтрПоТипу(Результат, "Детализация"				,	"Детализация",					42);
	ДобавитьВозможныйФильтрПоТипу(Результат, "Договор"					,	"Договор",						43);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ПротоколСогласованияЦены"	,	"Протокол согласования цены",	44);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ПриглашениеКЭДО"			,	"Приглашение к ЭДО",			45);
	ДобавитьВозможныйФильтрПоТипу(Результат, "РеестрСертификатов"		,	"Реестр сертификатов",			46);
	ДобавитьВозможныйФильтрПоТипу(Результат, "ЦеновойЛист"				,	"Ценовой лист",					47);
	ДобавитьВозможныйФильтрПоТипу(Результат, "Прочее"					,	"Прочее",						48);
	
	Возврат Результат;
	
КонецФункции // ВозможныеТипыДокументов()

//Агентские функции для 820 и 736 форматов
// Возвращаемое значение:
//  Массив - список агентских функций электронных документов.
Функция АгентскиеФункцииУПДУКД() Экспорт
	
	ФункцииЭлектронныхДокументов = ФункцииЭлектронныхДокументов();
	
	Результат = Новый Массив;
	Результат.Добавить(ФункцииЭлектронныхДокументов.СвРК);
	Результат.Добавить(ФункцииЭлектронныхДокументов.СвЗК);
	Результат.Добавить(ФункцииЭлектронныхДокументов.СвИСРК);
	Результат.Добавить(ФункцииЭлектронныхДокументов.СвИСЗК);
	
	Возврат Результат;
	
КонецФункции // АгентскиеФункцииУПДУКД()

// Добавляет описание возможного типа документов в структуру
Процедура ДобавитьВозможныйФильтрПоТипу(КоллекцияФильтров, Ключ, Представление, ЗначениеФильтра)
	
	СтруктураТипа = Новый Структура("Представление, ЗначениеФильтра", Представление, ЗначениеФильтра); 
	
	КоллекцияФильтров.Вставить(Ключ, СтруктураТипа);
	
КонецПроцедуры

// Функция создает пустую таблицу значений, с указанными в параметрах колонками
//
// Параметры:
//  Колонки	 - Структура, Строка - коллекция колонок для создаваемой таблицы значений
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция НоваяТаблицаЗначений(Колонки) Экспорт
	
	Если ТипЗнч(Колонки) = Тип("Структура") Тогда
		СтруктураКолонок = Колонки;
	Иначе
		СтруктураКолонок = Новый Структура(Колонки);
	КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;
	
	Для Каждого КлючИЗначение Из СтруктураКолонок Цикл
		Результат.Колонки.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //НоваяТаблицаЗначений()

// Создает массив и копирует в него значения, содержащиеся в колонке коллекции строк
//
// Параметры:
//	КоллекцияСтрок - коллекция, для которой доступен обход посредством  
//		оператора Для каждого … Из … Цикл
//	ИмяКолонки - строка с именем поля коллекции, значения которого нужно выгрузить
//	ТолькоУникальныеЗначения - булево, необязательный, если истина, 
//		то в массив будут включены только различающиеся значения 
//
Функция ВыгрузитьКолонку(КоллекцияСтрок, ИмяКолонки, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	МассивЗначений = Новый Массив;
	
	УникальныеЗначения = Новый Соответствие;
	
	Для каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
		Значение = СтрокаКоллекции[ИмяКолонки];
		Если ТолькоУникальныеЗначения И УникальныеЗначения[Значение] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивЗначений.Добавить(Значение);
		УникальныеЗначения.Вставить(Значение, Истина);
	КонецЦикла; 
	
	Возврат МассивЗначений;
	
КонецФункции

// Удаляет все вхождения переданного значения из массива.
//
// Параметры:
//  Массив - массив, из которого необходимо удалить значение;
//  Значение - удаляемое значение из массива.
// 
Процедура УдалитьВсеВхожденияЗначенияИзМассива(Массив, Значение) Экспорт
	
	КоличествоЭлементовКоллекции = Массив.Количество();
	
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
		
		Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		
		Если Массив[Индекс] = Значение Тогда
			
			Массив.Удалить(Индекс);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Ищет ссылку на объект БД по метаданным и переданному реквизиту. Поиск просиходит через запрос.
//
// Параметры:
//  ОбъектМетаданных	 - ОбъектМетаданных - Метаданные справочника или документа.
//  ИмяРеквизита		 - Строка - имя реквизита по которому идет поиск
//  ЗначРеквизита		 - Строка, Число, СправочникСсылка, ДокументСсылка, ПеречислениеСсылка
//							- значение реквизита по которому идет поиск
// 
// Возвращаемое значение:
//  Неопределено						 - если переданного реквизита нет в метаданных.
//  ДокументСсылка, СправочникСсылка	 - найденный объект.
//
Функция НайтиСсылкуНаОбъектПоРеквизиту(ОбъектМетаданных, ИмяРеквизита, ЗначРеквизита) Экспорт
	
	Результат = Неопределено;
	
	Если ОбъектМетаданных <> Неопределено 
		И ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, Истина) Тогда
		
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИскОбъект.Ссылка КАК Ссылка
		|ИЗ
		|	" + ПолноеИмяОбъектаМетаданных + " КАК ИскОбъект
		|ГДЕ
		|	ИскОбъект." + ИмяРеквизита + " = &ЗначРеквизита";
		
		Запрос.УстановитьПараметр("ЗначРеквизита", ЗначРеквизита);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// функция убирает из ИНН 2 лидирующих нуля, если ИНН начинается с 00
Функция УдалитьЛишниеНулиИНН(ИНН) Экспорт
	
	Если Лев(ИНН, 2) = "00" Тогда
		Возврат Сред(ИНН, 3);
	Иначе
		Возврат ИНН;
	КонецЕсли;
	
КонецФункции

Функция КорректныйИНН(ИНН) Экспорт
	
	Если ИНН = "0000000000" ИЛИ ИНН = "000000000000" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДлинаИНН = СтрДлина(ИНН);
	
	Если ДлинаИНН <> 10 И ДлинаИНН <> 12 Тогда
		Возврат Ложь; // Строка ИНН не допустимой длины
	КонецЕсли;
	
	Если СтрДлина(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(
		ИНН, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) > 0
		Тогда
		Возврат Ложь; // Строка ИНН содержит недопустимые символы
	КонецЕсли;
	
	Если ДлинаИНН = 10 Тогда
		
		КонтрольноеЧисло10 = КорректныйИНН_СуммаКонтрольногоЧисла10(ИНН) % 11;
		КонтрольноеЧисло10 = ?(КонтрольноеЧисло10 > 9, КонтрольноеЧисло10 % 10, КонтрольноеЧисло10);
		
		Возврат КонтрольноеЧисло10 = Число(Сред(ИНН, 10, 1));
		
	ИначеЕсли ДлинаИНН = 12 Тогда
		
		КонтрольноеЧисло11 = (Число(Сред(ИНН, 1, 1)) * 7 + КорректныйИНН_СуммаКонтрольногоЧисла10(Сред(ИНН, 2, 9))) % 11;
		КонтрольноеЧисло11 = ?(КонтрольноеЧисло11 > 9, КонтрольноеЧисло11 % 10, КонтрольноеЧисло11);
		
		КонтрольноеЧисло12 = (Число(Сред(ИНН, 1, 1)) * 3 + Число(Сред(ИНН, 2, 1)) * 7 + КорректныйИНН_СуммаКонтрольногоЧисла10(Сред(ИНН, 3, 9))) % 11;
		КонтрольноеЧисло12 = ?(КонтрольноеЧисло12 > 9, КонтрольноеЧисло12 % 10, КонтрольноеЧисло12);
		
		Возврат КонтрольноеЧисло11 = Число(Сред(ИНН, 11, 1)) И КонтрольноеЧисло12 = Число(Сред(ИНН, 12, 1));
		
	КонецЕсли;
	
КонецФункции

Функция КорректныйИНН_СуммаКонтрольногоЧисла10(ИНН)
	
	Возврат Число(Сред(ИНН, 1, 1)) * 2 + Число(Сред(ИНН, 2, 1)) * 4 + Число(Сред(ИНН, 3, 1)) * 10 + Число(Сред(ИНН, 4, 1)) * 3 +
	Число(Сред(ИНН, 5, 1)) * 5 + Число(Сред(ИНН, 6, 1)) * 9 + Число(Сред(ИНН, 7, 1)) * 4 + Число(Сред(ИНН, 8, 1)) * 6 + Число(Сред(ИНН, 9, 1)) * 8;
	
КонецФункции

Функция ШаблонРезультатаВыполненияФункции() Экспорт
	
	Возврат Новый Структура("Отказ, ОписаниеОшибки", Ложь, "");
	
КонецФункции

Процедура СократитьСтруктуру(Структура, НеобходимыеПоля, ОбязательныеПоля= "") Экспорт
	
	ОбязательныеКлючи= Новый Структура(ОбязательныеПоля);
	НеобходимыеКлючи=  Новый Структура(НеобходимыеПоля);
	УдаляемыеКлючи=    Новый Массив;
	
	Для Каждого КлючИЗначение Из Структура Цикл
		Если НЕ НеобходимыеКлючи.Свойство(КлючИЗначение.Ключ) И НЕ ОбязательныеКлючи.Свойство(КлючИЗначение.Ключ) Тогда
			УдаляемыеКлючи.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Ключ Из УдаляемыеКлючи Цикл
		Структура.Удалить(Ключ);
	КонецЦикла;
	
КонецПроцедуры

Функция ЭДО_БиблиотекаКартинок() Экспорт
	
	Результат = ЭДО_Кэш_Прочитать("БиблиотекаКартинок");
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура;
		
		Рисунки = ПолучитьМакет("БиблиотекаКартинок").Рисунки;
		
		Для Каждого Рисунок Из Рисунки Цикл
			Результат.Вставить(Рисунок.Имя, Рисунок.Картинка);
		КонецЦикла;
		
		ЭДО_Кэш_Поместить("БиблиотекаКартинок", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаРубльПараметрыПрописи() Экспорт
	
	Возврат "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
КонецФункции

Функция ФамилияСИнициалами(ФИО) Экспорт
	
	Перем Фамилия, Имя, Отчество;
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		ФИО.Свойство("FirstName", Имя);
		
		Если ФИО.Свойство("Surname", Фамилия) Тогда
			ФИО.Свойство("Patronymic", Отчество);
		ИначеЕсли ФИО.Свойство("LastName", Фамилия) Тогда
			ФИО.Свойство("MiddleName", Отчество);
		КонецЕсли;
		
	Иначе
		
		СтруктураФИО = СтруктураФИО(ФИО);
		
		Имя 	 = СтруктураФИО.Имя;
		Фамилия  = СтруктураФИО.Фамилия;
		Отчество = СтруктураФИО.Отчество;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Фамилия) Тогда
		
		Инициалы = ?(ЗначениеЗаполнено(Имя), ВРег(Лев(Имя, 1)) + ".", "") + ?(ЗначениеЗаполнено(Отчество), ВРег(Лев(Отчество, 1)) + ".", "");
		
		Возврат Фамилия + ?(ЗначениеЗаполнено(Инициалы), " " + Инициалы, "");
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Процедура СкопироватьКнопки(КнопкиИсточника, КнопкиПриемника) Экспорт
	
	#Если Клиент Тогда
		
		КнопкиПриемника.Очистить();
		
		ПредыдущаяКнопкаРазделитель = Ложь;
		
		Для Каждого КнопкаИсточника Из КнопкиИсточника Цикл
			
			Если КнопкаИсточника.Доступность ИЛИ КнопкаИсточника.КнопкаПоУмолчанию = Истина Тогда
				
				Если КнопкаИсточника.КнопкаПоУмолчанию = Истина Тогда
					ИмяКнопкиПоУмолчанию = КнопкаИсточника.Имя;
				КонецЕсли;
				
				Если ПредыдущаяКнопкаРазделитель И КнопкаИсточника.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяКнопка = КнопкиПриемника.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяКнопка, КнопкаИсточника, , "Кнопки");
				
				Если КнопкаИсточника.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю Тогда
					
					СкопироватьКнопки(КнопкаИсточника.Кнопки, НоваяКнопка.Кнопки);
					
					Если НоваяКнопка.Кнопки.Количество() = 0 Тогда
						КнопкиПриемника.Удалить(НоваяКнопка);
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				ПредыдущаяКнопкаРазделитель = НоваяКнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ИмяКнопкиПоУмолчанию) Тогда
			КнопкиПриемника.Найти(ИмяКнопкиПоУмолчанию).КнопкаПоУмолчанию = Истина;
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Функция СсылкаПоGUID(Менеджер, GUID) Экспорт
	
	Попытка
		Ссылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(GUID));
	Исключение КонецПопытки;
	
	ИмяТаблицы = Метаданные.НайтиПоТипу(ТипЗнч(Менеджер)).ПолноеИмя();
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ " + ИмяТаблицы + " ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Не удалось найти ссылку по уникальному идентификатору!
		|Таблица: " + ИмяТаблицы + "
		|Уникальный идентификатор: " + GUID;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция СтрокаКоличествоДокументов(КоличествоДокументов) Экспорт
	
	Возврат Строка(КоличествоДокументов) + " " + СтрЗаменить(ЧислоПрописью(КоличествоДокументов, , "документ, документа, документов, м,,,,,0"), ЧислоПрописью(КоличествоДокументов, , ",,,,,,,,0"), "");
	
КонецФункции

Процедура ОбновитьСостояниеИндикатора(Индикатор) Экспорт
	
	#Если Клиент Тогда
		
		Индикатор.Счетчик = Индикатор.Счетчик + 1;
		
		ТекущийПрогресс = ЦЕЛ(Индикатор.Счетчик / Индикатор.Количество * 100);
		
		Если ТекущийПрогресс > Индикатор.Прогресс Тогда
			
			Если Индикатор.Прерывание Тогда
				ОбработкаПрерыванияПользователя();
			КонецЕсли;
			
			Индикатор.Прогресс = ТекущийПрогресс;
			
			Состояние(ТекстСостоянияИндикатора(Индикатор));
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Функция НовыйИндикатор(Представление, МаксимальноеЗначение) Экспорт
	
	Индикатор = Новый Структура;
	Индикатор.Вставить("Представление", "Заполнение идентификаторов ЭДО");
	Индикатор.Вставить("ДатаНачала"	  , ТекущаяДата());
	Индикатор.Вставить("Количество"	  , МаксимальноеЗначение);
	Индикатор.Вставить("Счетчик"   	  , 0);
	Индикатор.Вставить("Прогресс"	  , 0);
	Индикатор.Вставить("Прерывание"	  , Истина);
	
	Возврат Индикатор;
	
КонецФункции

Функция ТекстСостоянияИндикатора(Индикатор) Экспорт
	
	Если Индикатор.Счетчик < Индикатор.Количество Тогда
		
		Осталось = (ТекущаяДата() - Индикатор.ДатаНачала) * (Индикатор.Количество / Индикатор.Счетчик - 1);
		
		ОсталосьДней = Цел(Осталось / (24*60*60));
		
		ТекстОсталось = ", Осталось: ~";
		
		Если ОсталосьДней > 0 Тогда
			ТекстОсталось = ТекстОсталось + ОсталосьДней + "д";
		КонецЕсли;
		
		ТекстОсталось = ТекстОсталось + Формат('00010101' + Осталось, "ДЛФ=T");
		
	Иначе
		ТекстОсталось = "";
	КонецЕсли;
	
	Возврат Индикатор.Представление + ": " + Формат(Индикатор.Счетчик / Индикатор.Количество * 100, "ЧЦ=3; ЧДЦ=0; ЧН=") + "%" + ТекстОсталось;
	
КонецФункции // ПолучитьТекстСостоянияИндикатораЛкс()

Функция ГиперСсылкаДокумент1СПредставление(СсылкаИлиМассив) Экспорт
	
	СтрокаДокумент = "";
	СтрокаКоличествоДокументов = "";
	
	Если ЗначениеЗаполнено(СсылкаИлиМассив) Тогда
		
		Если ТипЗнч(СсылкаИлиМассив) = Тип("Массив") Тогда
			
			СтрокаДокумент = Строка(СсылкаИлиМассив[0]);
			
			КоличествоДокументов = СсылкаИлиМассив.Количество();
			
			Если КоличествоДокументов > 1 Тогда
				СтрокаКоличествоДокументов = "  ( и еще " + (КоличествоДокументов - 1) + ")";
			КонецЕсли;
			
		Иначе
			СтрокаДокумент = Строка(СсылкаИлиМассив);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаДокумент + СтрокаКоличествоДокументов;
	
КонецФункции

// фукнция для получения результата запроса из одной записи и одного поля
//
Функция ПолучитьРезультатЗапроса(Запрос, ИмяПоля = "Ссылка", ПустоеЗначение = Неопределено) Экспорт 
	
	Результат = ПустоеЗначение;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка[ИмяПоля];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или фиксированной структуры.
//
// Параметры:
//   Структура           - Структура, ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа.
//   Ключ                - Строка       - имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - необязательный, возвращается когда в структуре нет значения по указанному ключу.
//
// Возвращаемое значение:
//   Произвольный        - значение свойства структуры или параметра "ЗначениеПоУмолчанию".
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Результат = ЗначениеПоУмолчанию;
	
	ЭтоСтруктура = Ложь
	Или ТипЗнч(Структура) = Тип("Структура")
	Или ТипЗнч(Структура) = Тип("ФиксированнаяСтруктура");
	
	Если ЭтоСтруктура И Структура.Свойство(Ключ) Тогда
		Результат = Структура[Ключ];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //СвойствоСтруктуры()

Функция ПлатформаСтаршеЧем_8_3_6_1977()
	
	СИ = Новый СистемнаяИнформация;
	ВерсияПлатформы = СИ.ВерсияПриложения;
	
	ВерсияПлатформыМассивом = Преобразование_СтрокуВМассивПодстрок(СИ.ВерсияПриложения, ".");
	ВтораяЦифраВерсии = Число(ВерсияПлатформыМассивом[1]);
	ТретьяЦифраВерсии = Число(ВерсияПлатформыМассивом[2]);
	
	Если ВтораяЦифраВерсии < 3
		ИЛИ (ВтораяЦифраВерсии = 3 И ТретьяЦифраВерсии < 6)  Тогда
		// 8.3.6 - самая первая официальная платформа на https://releases.1c.ru/project/Platform83
		// Предполагаем, что старше нее в линейке 8.3.6 ничего нет.
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции //ПлатформаСтаршеЧем_8_3_6_1977()

// Разбивает строку на элементы, помещая их в массив
//
// Параметры:
//  Строка					- Строка		- исходная строка
//  РазделительПодстрок		- Произвольный	- разделитель по которому происходит декомпозиция строки 
//  ПропускатьПустыеСтроки	- Булево		- признак, ограничивающий добавление в массив пустые строки
//  ПрименятьСокрЛП	 		- Булево		- признак, позволяющий убрать пробелы справа и слева от подстроки
// 
// Возвращаемое значение:
//   Массив 
//
Функция Преобразование_СтрокуВМассивПодстрок(Знач Строка, РазделительПодстрок = ",", ПропускатьПустыеСтроки = Ложь, ПрименятьСокрЛП = Ложь) Экспорт
	
	МассивПодстрок 		= Новый Массив;
	ДлинаРазделителя 	= СтрДлина(РазделительПодстрок);
	ПозицияРазделителя 	= Найти(Строка, РазделительПодстрок);
	
	Пока ПозицияРазделителя > 0 Цикл
		
		Подстрока = Лев(Строка, ПозицияРазделителя - 1);
		
		Если НЕ ПропускатьПустыеСтроки ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			МассивПодстрок.Добавить(?(ПрименятьСокрЛП, СокрЛП(Подстрока), Подстрока));
		КонецЕсли;
		
		Строка = Сред(Строка, ПозицияРазделителя + ДлинаРазделителя);
		
		ПозицияРазделителя = Найти(Строка, РазделительПодстрок);
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Строка) Тогда
		МассивПодстрок.Добавить(?(ПрименятьСокрЛП, СокрЛП(Строка), Строка));
	КонецЕсли;
	
	Возврат МассивПодстрок;
	
КонецФункции //Преобразование_СтрокуВМассивПодстрок()

// Объединяет элементы массива в строку с использованием разделителя
//
// Параметры:
//  МассивСтрок	 				- Массив 		- обрабатываемый массив 
//  Разделитель	 				- Произвольный	- добавляется между элементами массива
//  ПропускатьПустыеЗначения	- Булево		- признак, ограничивающий вывод в строку пустые значения
// 
// Возвращаемое значение:
//   Строка  
//
Функция Преобразование_МассивВСтроку(МассивСтрок, Разделитель = ",", ПропускатьПустыеЗначения = Ложь) Экспорт
	
	Результат	= "";
	
	Если ТипЗнч(МассивСтрок) = Тип("Массив") Тогда
		
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			
			Если ПропускатьПустыеЗначения И НЕ ЗначениеЗаполнено(ЭлементМассива) Тогда
				Продолжить;
			КонецЕсли;
			
			Результат = Результат + ?(СтрДлина(Результат) = 0, "", Разделитель) + ЭлементМассива;	
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(МассивСтрок) = Тип("Строка") Тогда
		
		Результат = МассивСтрок;		
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции //Преобразование_МассивВСтроку()

//Проверяет наличие заданного значения в кэш
//
// Параметры:
//	Значение	- Произвольный						- Искомое значение
//	Кэш			- Массив, Структура, 
//				  Соответствие, ТаблицаЗначений		- Коллекция, в которой осуществляется поиск значения
//
// Возвращает:
//	Булево
Функция ЗначениеЗаполненоИОтсутствуетВКеш(Значение, Кэш) Экспорт
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Если ТипЗнч(Кэш) = Тип("Массив") Тогда
			
			Результат = (Кэш.Найти(Значение) = Неопределено);
			
		ИначеЕсли ТипЗнч(Кэш) = Тип("Структура") Тогда
			
			Результат = (Кэш.Свойство(Значение) = Ложь);
			
		ИначеЕсли ТипЗнч(Кэш) = Тип("Соответствие") Тогда
			
			Результат = (Кэш.Получить(Значение) = Неопределено);
			
		ИначеЕсли ТипЗнч(Кэш) = Тип("ТаблицаЗначений") Тогда
			
			Результат = (Кэш.НайтиСтроки(Значение).Количество() = 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ЗначениеЗаполненоИОтсутствуетВКеш()

// Процедура добавляет структурированное инфополе в контент исходящего документа.
//
// Параметры:
//  Массив	 - <Массив> - Коллекция инфополей шапки или табличной части документа
//  Key		 - <Строка> - Ключ добавляемого свойства
//  Value	 - <Строка> - Значение добавляемого свойства
//
Процедура ДополнитьМассивKeyValue(Массив, Key, Value)
	
	НовыйЭлемент = Новый Структура;
	
	НовыйЭлемент.Вставить("Key",	Key);
	НовыйЭлемент.Вставить("Value",	Value);
	
	Массив.Добавить(НовыйЭлемент);
	
КонецПроцедуры

// Подставляет параметры в строку, максимальное число параметров - 6.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон содержащий маркеры подстановки вида: "%1..%N"
//                        . Нумерация маркеров начинается с 1.
//                          N не может быть более 6.
//  Параметр<n>  - Строка - подставляемые параметры.
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
Функция ПодставитьПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено
	, Параметр6 = Неопределено) Экспорт
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	Результат = СтрЗаменить(Результат	, "%6", Параметр6);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
		Строка(ТипЗнч(Реквизиты)));
		
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		СокрЛП(КлючИЗначение.Значение),
		СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы
// для нескольких объектов.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИменаРеквизитов - Строка, имена реквизитов перечисленные через запятую,
//				в формате требований к свойствам структуры.
//				Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на объект, а Значение - структура, которая 
//				содержит список свойств, как список имен в строке
//				ИменаРеквизитов, со значениям реквизитов, прочитанными
//				из информационной базы.
// 
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если ТипЗнч(МассивСсылок) = Тип("Массив") ИЛИ ТипЗнч(МассивСсылок) = Тип("ФиксированныйМассив") Тогда
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		Если НЕ Метаданные.ОбщиеМодули.Найти("ОбщегоНазначения") = Неопределено Тогда
			СтрокаСообщения = "Неверный тип параметра ""МассивСсылок""";
			Выполнить("ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения)");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на объект, Значение - значение прочитанного реквизита
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Процедура ДополнитьСтруктуруСоответствие(Приемник, Источник) Экспорт
	
	Для Каждого КлючИЗначение Из Источник Цикл
		Приемник.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаменитьНедопустимыеСимволыИмениФайла(ИмяФайла) Экспорт
	
	Результат = ИмяФайла;
	
	НедопустимыеСимволы = "\/:*?""<>|";
	
	Для Сч = 1 По СтрДлина(НедопустимыеСимволы) Цикл
		Результат = СтрЗаменить(Результат, Сред(НедопустимыеСимволы, Сч, 1), "_");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Base64СтрокаИзДвоичныхДанных(ДвоичныеДанные) Экспорт
	
	Результат = Base64Строка(ДвоичныеДанные);
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	
	Возврат Результат;
	
КонецФункции

// Сравнивает текущую версию приложения с переданной версией.
// Параметры:
//  СтрокаВерсии1 - Строка - номер версии
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция ПриложениеСтаршеВерсии(Версия)
	
	РезультатыФункции = Кэш_Прочитать("РезультатыФункции_ПриложениеСтаршеВерсии");
	
	Если РезультатыФункции = Неопределено Тогда
		РезультатыФункции = Новый Соответствие;
	КонецЕсли;
	
	Результат = РезультатыФункции[Версия];
	
	Если Результат = Неопределено Тогда
		
		СисИнфо = Новый СистемнаяИнформация;
		
		Результат = СравнитьВерсии(СисИнфо.ВерсияПриложения, Версия) = "ПерваяМеньше";
		
		РезультатыФункции.Вставить(Версия, Результат);
		
		Кэш_Поместить("РезультатыФункции_ПриложениеСтаршеВерсии", РезультатыФункции);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодироватьЧислоHEX(Знач Число)
	
	Результат = "";
	
	Если Число <= 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Словарь = "0123456789ABCDEF";
	
	Пока Истина Цикл
		
		Результат = Сред(Словарь, Число % 16 + 1, 1) + Результат;
		
		Если Число < 16 Тогда
			Прервать;
		КонецЕсли;
		
		Число = Число / 16;
		
	КонецЦикла;
	
	НечетнаяДлина = СтрДлина(Результат) % 2 > 0;
	
	Если НечетнаяДлина Тогда
		Результат = "0" + Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Кодирует строку URL в URL кодировке, cпецсимволы URL не кодируются
//
// Параметры:
//  Строка - Строка - строка URL
// 
// Возвращаемое значение:
//  Строка - закодированная строка URL
//
Функция КодироватьСтрокуURL(Строка) Экспорт
	
	Результат = "";
	
	Если ПриложениеСтаршеВерсии("8.3") Тогда
		
		СпецСимволы = "!#$%'()*+,/:;=?@[]&_.-";
		
		Код_А = КодСимвола("А");
		Код_п = КодСимвола("п");
		Код_р = КодСимвола("р");
		Код_я = КодСимвола("я");
		
		ДлинаСтроки = СтрДлина(Строка);
		
		Для Сч = 1 По ДлинаСтроки Цикл
			
			Символ	 = Сред(Строка, Сч, 1);
			Код		 = КодСимвола(Символ);
			ЭтоСпецСимвол = Найти(СпецСимволы, Символ) > 0;
			
			ДопустимыйСимвол = ЭтоСпецСимвол
			Или (Символ >= "a" И Символ <= "z")
			Или (Символ >= "A" И Символ <= "Z")
			Или (Символ >= "0" И Символ <= "9");
			
			Если ДопустимыйСимвол Тогда
				
				Результат = Результат + Символ;
				
			ИначеЕсли Код >= Код_А И Код <= Код_п Тогда
				
				Результат = Результат + "%" + КодироватьЧислоHEX(208) + "%" + КодироватьЧислоHEX(144 + Код - Код_А);
				
			ИначеЕсли Код >= Код_р И Код <= Код_я Тогда
				
				Результат = Результат + "%" + КодироватьЧислоHEX(209) + "%" + КодироватьЧислоHEX(128 + Код - Код_р);
				
			ИначеЕсли Символ = "ё" Тогда
				
				Результат = Результат + "%D1%91";
				
			ИначеЕсли Символ = "Ё" Тогда
				
				Результат = Результат + "%D0%81";
				
			ИначеЕсли Символ = Символы.НПП Тогда
				
				Результат = Результат + "%C2%A0";
				
			Иначе
				
				Результат = Результат + "%" + КодироватьЧислоHEX(Код);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Результат = Вычислить("КодироватьСтроку(Строка, СпособКодированияСтроки.URLВКодировкеURL)");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение - Строка - проверяемая строка.
//
// Возвращаемое значение:
//  Булево - Истина, если строка содержит только цифры или пустая.
//
Функция ТолькоЦифрыВСтроке(Значение) Экспорт
	
	Результат	 = Истина;
	КодСимвола0	 = КодСимвола("0");
	КодСимвола9	 = КодСимвола("9");
	ДлинаСтроки	 = СтрДлина(Значение);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Значение, НомерСимвола);
		
		Если КодСимвола < КодСимвола0 Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Объединяет части пути через разделитель
//
Функция ОбъединитьПути(П1, П2, П3 = Неопределено, П4 = Неопределено) Экспорт
	
	Результат = П1;
	РазделительПути = "\";
	
	ЧастиПути = Новый Массив;
	ЧастиПути.Добавить(П2);
	ЧастиПути.Добавить(П3);
	ЧастиПути.Добавить(П4);
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> РазделительПути Тогда
			Результат = Результат + РазделительПути;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает полное имя файла текущей внешней обработки
// 
// Возвращаемое значение:
//  Строка       - если обработка подключена из файла
//  Неопределено - если обработка подключена через временное хранилище
//                 или добавлена в состав конфигурации
//
Функция ИспользуемоеИмяФайлаОбработки() Экспорт
	
	Результат = Неопределено;
	
	МетаданныеОбработки = ЭтотОбъект.Метаданные();
	
	Если Не Метаданные.Обработки.Содержит(МетаданныеОбработки) Тогда
		
		ИмяФайла = ЭтотОбъект.ИспользуемоеИмяФайла;
		
		// Метод ЭтоАдресВременногоХранилища() может не сработать,
		// потому что файла во временном хранилище может уже не быть
		ЭтоПутьКФайлу = НРег(Прав(ИмяФайла, 4)) = ".epf";
		
		Если ЭтоПутьКФайлу Тогда
			Результат = ИмяФайла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает путь из полного имени файла
//
// Параметры:
//  ПолноеИмяФайла - Строка - полное имя файла
// 
// Возвращаемое значение:
//  Строка - путь к файлу
//
Функция ПутьКФайлу(ПолноеИмяФайла) Экспорт
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Результат = Файл.Путь;
	
	Возврат Результат;
	
КонецФункции

// Проверяет существование файла
//
// Параметры:
//  ПолноеИмяФайла - Строка - полное имя файла,
//                            который нужно проверить
// 
// Возвращаемое значение:
//  Строка - путь к файлу
//
Функция ФайлСуществует(ПолноеИмяФайла) Экспорт
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Результат = Файл.Существует();
	
	Возврат Результат;
	
КонецФункции

Функция ПричинаОшибки(ИнформацияОбОшибке) Экспорт
	
	Если ИнформацияОбОшибке.Причина = Неопределено Тогда
		
		Результат = ИнформацияОбОшибке;
		
	Иначе
		
		Результат = ПричинаОшибки(ИнформацияОбОшибке.Причина);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в табличной части протоконтента сведения о маркировке.
//
// Параметры:
//  Контент			 	- Структура 	- Протоконтент в формате приказа 820@
//  СсылкаНаДокумент 	- ЛюбаяСсылка 	- Ссылка основание электронного документа
//  ИспользоватьКМ		- Булево		- Истина, если получать сведения о маркировке
// 	                                		нужно с помощью подсистемы "Контур.Маркировка"
//
Процедура МенеджерИнтеграции_ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаДокумент, ИспользоватьКМ)
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	МенеджерИнтеграции.ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаДокумент, ИспользоватьКМ);
	
КонецПроцедуры

// Загружает в учетный документ сведения о маркировке из товарной части ЭД.
//
// Параметры:
//  ДокументОбъект	- ЛюбойОбъект 		- документ-владелец штрихкодов
//  ТоварнаяЧасть 	- ТаблицаЗначений 	- данные товарной части электронного документа.
//                  						См. Форма_Диадок_ЭД.Новый_ТабличнаяЧастьСтруктурыДокумента
//  ИспользоватьКМ	- Булево			- истина, если получать сведения о маркировке
// 	                                		нужно с помощью подсистемы "Контур.Маркировка"
//
Процедура МенеджерИнтеграции_ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, ИспользоватьКМ) Экспорт
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	МенеджерИнтеграции.ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, ИспользоватьКМ);
	
КонецПроцедуры

// Возвращает ссылку на общий модуль по имени
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//  ОбщийМодуль - общий модуль
//
Функция ОбщийМодуль(Имя) Экспорт
	
	МодульСуществует = СуществуетОбъектМетаданных("ОбщийМодуль." + Имя);
	
	Если Не МодульСуществует Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	КонецЕсли;
	
	Результат = Вычислить(Имя);
	
	Возврат Результат;
	
КонецФункции

Функция НовоеПрограммноеПеречисление(ЗначенияПеречисления)
	
	Результат = Новый Структура;
	
	Для Каждого Значение Из ЗначенияПеречисления Цикл
		Результат.Вставить(Значение, Значение);
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Имя события для записи в журнал регистрации.
//
Функция СобытиеЖурналаРегистрации()
	
	Результат = НСтр("ru = 'Диадок'; en = 'Diadoc'");
	
	Возврат Результат;
	
КонецФункции

// Проверяет элементы структуры на заполнение значениями
// 
Функция СтруктураЗаполнена(Структура)
	
	Результат = Ложь;
	
	Для Каждого КлючИЗначение Из Структура Цикл
		
		ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
		
		Если ТипЗначения = Тип("Структура") Тогда
			Результат = СтруктураЗаполнена(КлючИЗначение.Значение);
		ИначеЕсли ТипЗначения = Тип("Булево") Тогда
			Результат = КлючИЗначение.Значение = Истина;
		Иначе
			Результат = ЗначениеЗаполнено(КлючИЗначение.Значение);
		КонецЕсли;
		
		Если Результат = Истина Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//{ Признак

Функция ЭтоЛюбойТипСчетаФактуры(Type) Экспорт
	
	Результат = (ВРЕГ(Лев(Type, 7)) = ВРЕГ("Invoice"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактура(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("Invoice"));
	
	Возврат Результат; 
	
КонецФункции

Функция ЭтоСчетФактураИсправленный(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("InvoiceRevision"));
	
	Возврат Результат; 
	
КонецФункции

Функция ЭтоСчетФактураКорректировочный(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("InvoiceCorrection"));
	
	Возврат Результат; 
	
КонецФункции

Функция ЭтоИКСФ(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("InvoiceCorrectionRevision"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоУПД(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("UniversalTransferDocument"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоУПД_СЧФ(Type, DocumentFunction) Экспорт
	
	Результат = ЭтоУПД(Type)
	И ВРЕГ(БазоваяФункцияДокумента(DocumentFunction)) = ВРЕГ("Invoice");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоУКД(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("UniversalCorrectionDocument"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИУПД(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("UniversalTransferDocumentRevision"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФункцияСЧФДОП(DocumentFunction) Экспорт
	
	Результат = (ВРЕГ(DocumentFunction) = "СЧФДОП");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФункцияСЧФ(DocumentFunction) Экспорт
	
	Результат = (ВРЕГ(DocumentFunction) = "СЧФ");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФункцияДОП(DocumentFunction) Экспорт
	
	Результат = (ВРЕГ(DocumentFunction) = "ДОП");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктОВыполненииРабот(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("XmlAcceptanceCertificate"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйТОРГ12(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("XmlTorg12"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйДокумент(Type) Экспорт
	
	// TODO: метод устарел. Необходимо перейти на метод "ЭтоФормализованныйФормат"
	
	ПодходящиеТипы = Новый Соответствие;
	
	ПодходящиеТипы.Вставить("Invoice"					 		 , Истина);
	ПодходящиеТипы.Вставить("InvoiceRevision"			 		 , Истина);
	ПодходящиеТипы.Вставить("InvoiceCorrection"			 		 , Истина);
	ПодходящиеТипы.Вставить("InvoiceCorrectionRevision"			 , Истина);
	ПодходящиеТипы.Вставить("XmlTorg12"							 , Истина);
	ПодходящиеТипы.Вставить("XmlAcceptanceCertificate"			 , Истина);
	ПодходящиеТипы.Вставить("UniversalTransferDocument"	 		 , Истина);
	ПодходящиеТипы.Вставить("UniversalTransferDocumentRevision"	 , Истина);
	ПодходящиеТипы.Вставить("UniversalCorrectionDocument"		 , Истина);
	ПодходящиеТипы.Вставить("UniversalCorrectionDocumentRevision", Истина);
	
	// Дополнительные виртуальные типы DocumentToSend
	ПодходящиеТипы.Вставить("UtdInvoice"				 , Истина);
	ПодходящиеТипы.Вставить("UtdTorg12"					 , Истина);
	ПодходящиеТипы.Вставить("UtdAcceptanceCertificate"	 , Истина);
	ПодходящиеТипы.Вставить("UcdInvoiceCorrection"		 , Истина);
	ПодходящиеТипы.Вставить("TovTorg"					 , Истина);
	ПодходящиеТипы.Вставить("XmlAcceptanceCertificate552", Истина);
	
	Результат = ПодходящиеТипы[Type] = Истина;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, является ли формат документа формализованным.
//
// Параметры:
//  ФорматЭД - Структура - см. ОписаниеФорматаЭлектронногоДокумента;
// 
// Возвращаемое значение:
//  Булево - Истина, если это формат для отправки формализованных документов.
//
Функция ЭтоФормализованныйФормат(ФорматЭД) Экспорт
	
	БазовыеФорматы = БазовыеФорматы();
	
	ФормализованныеФорматы = Новый Массив;
	
	ФормализованныеФорматы.Добавить(БазовыеФорматы.utd820);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.utd);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.ucd736);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.ucd);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.tovtorg);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.rezru);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.invoice);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.invoicecor);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.torg12);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.act);
	ФормализованныеФорматы.Добавить(БазовыеФорматы.torg2);
	
	Результат = Ложь;
	Если ФормализованныеФорматы.Найти(ФорматЭД.БазовыйФормат) <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНеформализованныйБезМетаданных(Type) Экспорт 
	
	ПодходящиеТипы = Новый Соответствие;
	
	ПодходящиеТипы.Вставить("Nonformalized"			, Истина);
	ПодходящиеТипы.Вставить("Contract"			 	, Истина);
	ПодходящиеТипы.Вставить("ReconciliationAct"		, Истина);
	ПодходящиеТипы.Вставить("ServiceDetails"		, Истина);
	ПодходящиеТипы.Вставить("PriceList"				, Истина);
	ПодходящиеТипы.Вставить("PriceListAgreement"	, Истина);
	ПодходящиеТипы.Вставить("TrustConnectionRequest", Истина);
	ПодходящиеТипы.Вставить("SupplementaryAgreement", Истина);
	ПодходящиеТипы.Вставить("CertificateRegistry"	, Истина);
	
	Результат = ПодходящиеТипы[Type] = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВходящийДокЕщеБезПодписиИОтказа(Status) Экспорт
	
	Результат = (ВРЕГ(Status) = ВРЕГ("InboundWaitingForRecipientSignature"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВходящийДокумент(DocumentDirection) Экспорт
	
	Результат = (ВРЕГ(DocumentDirection) = ВРЕГ("Inbound"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсходящийДокумент(DocumentDirection) Экспорт
	
	Результат = (ВРЕГ(DocumentDirection) = ВРЕГ("Outbound"));
	
	Возврат Результат;			
	
КонецФункции

//Функция документа входит в коллекцию агентских функций для 820 и 736 форматов
//
// Параметры: 
//	ФункцияДокумента - Строка - функция электронного документа
//
// Возвращаемое значение:
//	Булево - Истина, если документ входит в коллекцию агентских функций, см. метод АгентскиеФункцииУПДУКД()
//	
Функция ЭтоАгентскаяФункцияУПДУКД(DocumentFunction) Экспорт
	
	АгентскиеФункцииУПДУКД = АгентскиеФункцииУПДУКД();
	
	Результат = АгентскиеФункцииУПДУКД.Найти(DocumentFunction) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетНаОплату(Type) Экспорт
	
	Результат = (ВРЕГ(Type) = ВРЕГ("NonformalizedProforma"));
	
	Возврат Результат;
	
КонецФункции

// Формирует признак соответствует ли переданный тип электронного документа
// документу ТОРГ-2
//
// Параметры:
//	ИмяТипа	- Строка - Имя типа электронного документа. См. метод "ФорматЭлектронногоДокумента"
//
// Возвращаемое значение:
//	Булево - Истина, если соответствует
//
Функция ЭтоТорг2(ИмяТипа) Экспорт
	
	Результат = (ВРЕГ(ИмяТипа) = ВРЕГ("Torg2"));
	
	Возврат Результат;
	
КонецФункции

// Формирует признак о том, что формат документа устарел
//
// Параметры:
//	ВерсияФормата	- Строка	- информация о версии XSD схемы, в соотвествии с которой сформирован документ
//	ДатаОтправки	- ДатаВремя	- дата и время отправки документа (в текущем часовом поясе)
//
// Возвращаемое значение:
//	Булево	- Истина, если формат документа устарел
Функция ЭтоУстаревшийФорматЭлектронногоДокумента(ВерсияФормата, ДатаОтправки = Неопределено) Экспорт
	
	Если ЭтоУПД_ВФормате155Приказа(ВерсияФормата) Тогда
		
		// с 01.01.2020 УПД в формате 155 приказа должен быть отправлен в формате 820 приказа
		Результат = НЕ ЗначениеЗаполнено(ДатаОтправки)
		ИЛИ ДатаОтправки >= ДатаПрекращенияДействияУПД155();
		
	ИначеЕсли ЭтоСФ_ВФормате93Приказа(ВерсияФормата) Тогда
		
		// с 01.07.2017 СФ в формате 93 приказа должен быть отправлен в формате УПД
		// с 14.04.2015 СФ в формате 93 приказа должен быть отправлен в версии 5.02
		Результат = НЕ ЗначениеЗаполнено(ДатаОтправки) 
		ИЛИ ДатаОтправки >= ДатаПрекращенияДействияСчетаФактуры93();
		
	Иначе
		Результат = Ложь;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Признак того, что документ УПД в формате 155 приказа
//
// Параметры:
//	ВерсияФормата - Строка - версия вложения в терминах API (наример, utd820_05_01_01, tovtorg_05_01_04 и т.д.)
//
// Возвращаемое значение:
//	Булево - Истина, если документ УПД в формате 155 приказа
Функция ЭтоУПД_ВФормате155Приказа(ВерсияФормата) Экспорт
	
	БазовыеФорматы	= БазовыеФорматы();
	БазовыйФормат	= БазовыйФорматВерсииКонтента(ВерсияФормата);
	
	Результат = (БазовыйФормат = БазовыеФорматы.utd);
	
	Возврат Результат;
	
КонецФункции

// Признак того, что документ СФ в формате 93 приказа
//
// Параметры:
//	ВерсияФормата - Строка - версия вложения в терминах API (наример, utd820_05_01_01, tovtorg_05_01_04 и т.д.)
//
// Возвращаемое значение:
//	Булево - Истина, если документ СФ в формате 93 приказа
Функция ЭтоСФ_ВФормате93Приказа(ВерсияФормата) Экспорт
	
	БазовыеФорматы	= БазовыеФорматы();
	БазовыйФормат	= БазовыйФорматВерсииКонтента(ВерсияФормата);
	
	Результат = (	БазовыйФормат = БазовыеФорматы.invoice 
	Или БазовыйФормат = БазовыеФорматы.invoicecor	);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, установлены ли на текущий момент настройки по отправке документа в устаревшем формате
//
// Возвращаемое значение:
//	Булево	- Истина, если такие настройка установлены
Функция ЕстьНастройкаОтправкиВУстаревшемФормате() Экспорт
	
	Результат = Ложь;
	
	НастройкиОтправки = Модуль_Данные1С_СвязиОбъектов().НастройкиФорматаОтправкиПоОрганизациям();
	
	НастройкиОтправкиПоКонтрагентам = Модуль_Данные1С_СвязиОбъектов().НастройкиФорматаОтправкиПоКонтрагентам();
	Для каждого Элемент Из НастройкиОтправкиПоКонтрагентам Цикл
		НастройкиОтправки.Вставить(Элемент.Ключ, Элемент.Значение); 	
	КонецЦикла; 
	
	Для Каждого Элемент Из НастройкиОтправки Цикл
		
		КлючНастройки = Элемент.Значение;
		
		Если ЗначениеЗаполнено(КлючНастройки) И ЭтоНастройкаОтправкиВУстаревшемФормате(КлючНастройки) Тогда
			
			Результат = Истина;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет содержит ли настройка возможность отправки документа в устаревшем формате
//
// Параметры:
//  КлючНастройки - Строка - значение настройки "ДиадокФормироватьУПД"
// 
// Возвращаемое значение:
//  Булево - Истина, если настройка содержит возможность отправки докумета в устаревшем формате
//
Функция ЭтоНастройкаОтправкиВУстаревшемФормате(КлючНастройки) Экспорт
	
	Результат =		НастройкаВключаетОтправкуУКД189(КлючНастройки)
	ИЛИ НастройкаВключаетОтправкуУПД155(КлючНастройки)
	ИЛИ НастройкаВключаетОтправкуСчетаФактуры93(КлючНастройки);
	
	Возврат Результат;
	
КонецФункции

// Проверяет содержит ли настройка возможность отправки счета-фактуры 93@
//
// Параметры:
//  КлючНастройки - Строка - значение настройки "ДиадокФормироватьУПД"
// 
// Возвращаемое значение:
//  Булево - Истина, если настройка содержит возможность отправки счета-фактуры 93@
//
Функция НастройкаВключаетОтправкуСчетаФактуры93(КлючНастройки)
	
	Результат = Ложь;
	
	Если 	КлючНастройки = "НЕТ"
		Или КлючНастройки = "ТОРГ12АКТ"
		Или КлючНастройки = "ДОП" Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет содержит ли настройка возможность отправки УПД 155@
//
// Параметры:
//  КлючНастройки - Строка - значение настройки "ДиадокФормироватьУПД"
// 
// Возвращаемое значение:
//  Булево - Истина, если настройка содержит возможность отправки УПД 155@
//
Функция НастройкаВключаетОтправкуУПД155(КлючНастройки)
	
	Результат = Ложь;
	
	ЭтоНастройкаУПД155 = 	КлючНастройки = "СФ"
	Или КлючНастройки = "СЧФ"
	Или	КлючНастройки = "СЧФДОП"
	Или КлючНастройки = "СЧФ_ДОП"
	Или КлючНастройки = "СФТОРГ12АКТ";
	
	Если ЭтоНастройкаУПД155 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет содержит ли настройка возможность отправки УКД 189@
//
// Параметры:
//  КлючНастройки - Строка - значение настройки "ДиадокФормироватьУПД"
// 
// Возвращаемое значение:
//  Булево - Истина, если настройка содержит возможность отправки УКД 189@
//
Функция НастройкаВключаетОтправкуУКД189(КлючНастройки)
	
	Результат = Ложь;
	
	Если 	КлючНастройки = "СЧФДОП_820"
		Или КлючНастройки = "СЧФ_ДОП_820"
		Или КлючНастройки = "СФТОРГ12АКТ_820" Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьИдентификаторСервисаВзаиморасчеты(Идентификатор)
	
	Результат = Врег(Идентификатор) = "COACSU";	// отправлен из сервиса сверки
	
	Возврат Результат;
	
КонецФункции

// Признак того, что электронный документ(ЭД) это акт сверки, который был отправлен из сервиса Контур.Взаиморасчеты
//
// Параметры:
//	ИмяТипа				- Строка	- Имя типа электронного документа. См. метод "ФорматЭлектронногоДокумента"
//	CustomDocumentId	- Строка 	- Идентификатор документа, заданный внешней системой
//
// Возвращаемое значение:
// 	Булево - Истина, если ЭД это акт сверки, отправленный из сервиса Контур.Взаиморасчеты
Функция ЭтоАктСверкиИзСервисаВзаиморасчеты(ИмяТипа, CustomDocumentId) Экспорт
	
	Результат = ЭтоАктСверкиВзаиморасчетов(ИмяТипа)
	И ЕстьИдентификаторСервисаВзаиморасчеты(CustomDocumentId);
	
	Возврат Результат;
	
КонецФункции

// Признак того, что электронный документ(ЭД) является актом сверки взаиморасчетов
//
// Параметры:
//	ИмяТипа	- Строка	- Имя типа электронного документа. См. метод "ФорматЭлектронногоДокумента"
//
// Возвращаемое значение:
//	Булево - Истина, если ЭД является актом сверки
Функция ЭтоАктСверкиВзаиморасчетов(ИмяТипа)
	
	Результат = (ВРЕГ(ИмяТипа) = ВРЕГ("ReconciliationAct"));
	
	Возврат Результат;
	
КонецФункции


//} Признак

Функция СтатусАннулирования_ПредложениеОтсутствует() Экспорт
	
	Возврат "RevocationStatusNone"; 
	
КонецФункции		

Функция СтатусАннулирования_Аннулирован() Экспорт
	
	Возврат "RevocationAccepted";
	
КонецФункции

Функция СтатусАннулирования_Отклонено() Экспорт
	
	Возврат "RevocationRejected"; 
	
КонецФункции

Функция СтатусАннулирования_ПолученВходящийЗапрос() Экспорт
	
	Возврат "RequestsMyRevocation";
	
КонецФункции

Функция СтатусОтветногоДействия_ОжидаетсяПодписьПолучателя() Экспорт
	
	Возврат "WaitingForRecipientSignature";
	
КонецФункции

Функция СтатусОтветногоДействия_ОтказВПодписи() Экспорт
	
	Возврат "RecipientSignatureRequestRejected";
	
КонецФункции

Функция СтатусСогласования_Согласован() Экспорт
	
	Возврат "Approved";
	
КонецФункции

Функция СтатусСогласования_Отказано() Экспорт
	
	Возврат "Disapproved";
	
КонецФункции

Функция СтатусСогласования_ЗапрошенаПодпись() Экспорт
	
	Возврат "SignatureRequested";
	
КонецФункции

Функция СтатусСогласования_НеСогласовывался() Экспорт
	
	Возврат "None";
	
КонецФункции

Функция СтатусСогласования_ВПодписиОтказано() Экспорт
	
	Возврат "SignatureDenied";
	
КонецФункции

Функция СтатусСогласованияДокумента(Document) Экспорт
	
	Результат = Неопределено;
	
	Если Document <> Неопределено И 
		Document.ResolutionStatus <> Неопределено Тогда
		Результат = Document.ResolutionStatus.Type;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПустойИдентификаторПодразделения() Экспорт
	
	Возврат "00000000-0000-0000-0000-000000000000";
	
КонецФункции

// Наполняет список выбора данными, переданными в виде списка значений.
//
// Параметры:
//  СписокВыбора 	- СписокЗначений - список выбора элемента формы, который нужно наполнить значениями.
//	СписокЗначений 	- СписокЗначений - коллекция, содержащая нужные значения.
//
Процедура ЗаполнитьСписокВыбораПоСпискуЗначений(СписокВыбора, СписокЗначений) Экспорт
	
	СписокВыбора.Очистить();
	
	Для Каждого ЭлементКоллекции Из СписокЗначений Цикл
		
		СписокВыбора.Добавить(ЭлементКоллекции.Значение, ЭлементКоллекции.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОснованиеПередачи_БезДокументаОснования()
	
	Результат = "Без документа-основания";
	
	Возврат Результат;
	
КонецФункции

Функция ОснованиеПередачи_Отсутствует()
	
	Результат = "Отсутствует";
	
	Возврат Результат;
	
КонецФункции

//} ОБЩИЕ ПРОЦЕДУРЫ И ФУНКУЦИИ

//{ ФОРМАТЫ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

// Получает описание формата из объекта Document.
//
// Параметры:
//  ЭДОбъект - COMОбъект - Объект, производный от Document;
//
// Возвращаемое значение:
//  Структура - см. функцию НовоеОписаниеФорматаЭлектронногоДокумента.
//
Функция ФорматЭлектронногоДокумента(Document) Экспорт
	
	ВерсияФормата 		= Document.Version;
	ФункцияДокумента 	= Document.DocumentFunction;
	ИмяТипа			 	= Document.TypeNamedId;
	
	Результат = ОписаниеФорматаЭлектронногоДокумента(ИмяТипа, ФункцияДокумента, ВерсияФормата);
	
	Возврат Результат;
	
КонецФункции

// Описывает возможные значения базовых версий форматов контента.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция БазовыеФорматы() Экспорт
	
	Результат = Новый Структура;
	
	// универсальный передаточный документ в формате 820@
	Результат.Вставить("utd820", "utd820");
	
	// универсальный передаточный документ в формате 155@
	Результат.Вставить("utd", "utd");
	
	// универсальный корректировочный документ в формате 736@
	Результат.Вставить("ucd736", "ucd736");
	
	// универсальный корректировочный документ в формате 189@
	Результат.Вставить("ucd", "ucd");
	
	// накладная в формате 551@
	Результат.Вставить("tovtorg", "tovtorg");
	
	// акт выполненных работ в формате 552@
	Результат.Вставить("rezru", "rezru");
	
	// счет-фактура
	Результат.Вставить("invoice", "invoice");
	
	// корректировочный счет-фактура
	Результат.Вставить("invoicecor", "invoicecor");
	
	// накладная в формате 172@
	Результат.Вставить("torg12", "torg12");
	
	// акт выполненных работ в формате 172@
	Результат.Вставить("act", "act");
	
	// акт о расхождениях в формате 423@
	Результат.Вставить("torg2", "torg2");
	
	// счет на оплату
	Результат.Вставить("proformainvoice", "proformainvoice");
	
	// неизвестное: свои типы и т.д.
	Результат.Вставить("unknown", "unknown");
	
	// полуформализованный и неформализованный
	Результат.Вставить("v1", "v1");
	
	Возврат Результат;
	
КонецФункции

// Описывает возможные значения типов протоконтента.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ТипыКонтента() Экспорт
	
	Результат = Новый Структура;
	
	// УПД в формате 820@
	Результат.Вставить("Utd820SellerContent", "Utd820SellerContent");
	
	// УПД в формате 155@
	Результат.Вставить("UtdSellerContent", "UtdSellerContent");
	
	// УКД в формате 189@
	Результат.Вставить("UcdSellerContent", "UcdSellerContent");
	
	// Товарная накладная в формате 551@
	Результат.Вставить("TovTorgSellerContent", "TovTorgSellerContent");
	
	// Товарная накладная в формате 172@
	Результат.Вставить("Torg12SellerContent", "Torg12SellerContent");
	
	// Акт выполненных работ в формте 552@
	Результат.Вставить("Act552SellerContent", "Act552SellerContent");
	
	// Акт выполненных работ в формте 172@
	Результат.Вставить("AcceptanceCertificateSellerContent", "AcceptanceCertificateSellerContent");
	
	// Счет-фактура
	Результат.Вставить("InvoiceContent", "InvoiceContent");
	
	// Корректировочный счет-фактура
	Результат.Вставить("InvoiceCorrectionContent", "InvoiceCorrectionContent");
	
	// Счет на оплату
	Результат.Вставить("ProformaInvoiceContent", "ProformaInvoiceContent");
	
	// Полуформализованный или неформализованный
	Результат.Вставить("NonformalizedContent", "NonformalizedContent");
	
	// Акт о расхождениях в формате 423@
	Результат.Вставить("Torg2SenderTitle", "Torg2SenderTitle");
	
	Возврат Результат;
	
КонецФункции

// Определяет базовую версию формата контента.
//
// Параметры:
//  ВерсияФормата - Строка - версия вложения в терминах API (наример, utd820_05_01_01, tovtorg_05_01_04 и т.д.)
// 
// Возвращаемое значение:
//  Строка - возможные значения определены в функции БазовыеФорматы()
//
Функция БазовыйФорматВерсииКонтента(ВерсияФормата) Экспорт
	
	БазовыеФорматы = БазовыеФорматы();
	
	Если НРег(Лев(ВерсияФормата, 7)) = "utd820_" Тогда
		
		Результат = БазовыеФорматы.utd820;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 4)) = "utd_" Тогда
		
		Результат = БазовыеФорматы.utd;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 7)) = "ucd736_" Тогда
		
		Результат = БазовыеФорматы.ucd736;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 4)) = "ucd_" Тогда
		
		Результат = БазовыеФорматы.ucd;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 8)) = "tovtorg_" Тогда
		
		Результат = БазовыеФорматы.tovtorg;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 6)) = "rezru_" Тогда
		
		Результат = БазовыеФорматы.rezru;
		
	ИначеЕсли ВерсияФормата = "UniversalCorrectionDocument" Тогда
		
		Результат = БазовыеФорматы.ucd;
		
	ИначеЕсли ВерсияФормата = "UniversalTransferDocument" Тогда
		
		Результат = БазовыеФорматы.utd;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 8)) = "invoice_" Тогда
		
		Результат = БазовыеФорматы.invoice;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 11)) = "invoicecor_" Тогда
		
		Результат = БазовыеФорматы.invoicecor;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 7)) = "torg12_" Тогда
		
		Результат = БазовыеФорматы.torg12;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 4)) = "act_" Тогда
		
		Результат = БазовыеФорматы.act;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 16)) = "proformainvoice_" Тогда
		
		Результат = БазовыеФорматы.proformainvoice;
		
	ИначеЕсли НРег(ВерсияФормата) = "v1" Тогда
		
		Результат = БазовыеФорматы.v1;
		
	ИначеЕсли НРег(Лев(ВерсияФормата, 6)) = "torg2_" Тогда
		
		Результат = БазовыеФорматы.torg2;
		
	Иначе
		
		Результат = БазовыеФорматы.unknown; // Все остальное будем считать неформализованными
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать ПредставлениеФорматаЭД.
// Возвращает пользовательское представление формата
// электронных документов.
//
// Параметры:
//  ФорматЭД - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента;
// 
// Возвращаемое значение:
//  Строка - представление формата.
//
Функция ПользовательскоеПредставлениеФормата(ФорматЭД) Экспорт
	
	Результат = ПредставлениеФорматаЭД(ФорматЭД.ИмяТипа, ФорматЭД.ФункцияДокумента);
	
	Возврат Результат;
	
КонецФункции

// Определяет значение параметра ФункцияУПД, используемого при
// сборе контента по документам, отправляемым в формате УПД или УКД.
//
// Параметры:
//  ФорматОтправки - Структура - см. функцию НовоеОписаниеФорматаЭлектронногоДокумента();
// 
// Возвращаемое значение:
//  Строка - для накладных, актов или счетов-фактур в формате УПД/УКД.
//  Неопределено - для всех остальных
//
Функция ФункцияДокументаДляСбораКонтента(ФорматОтправки) Экспорт
	
	ВерсияФормата = ФорматОтправки.ВерсияФормата;
	Если ВерсияФормата = "v1" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ФорматОтправки.ФункцияДокумента <> "default" Тогда
		Возврат ФорматОтправки.ФункцияДокумента;
	КонецЕсли;
	
	БазовыеФорматы = БазовыеФорматы();
	БазовыйФормат = БазовыйФорматВерсииКонтента(ВерсияФормата);
	
	ТребуетсяВычислитьФункцию = Ложь;
	Если БазовыйФормат = БазовыеФорматы.utd820
		Или БазовыйФормат = БазовыеФорматы.utd
		Или БазовыйФормат = БазовыеФорматы.ucd Тогда
		ТребуетсяВычислитьФункцию = Истина;
	КонецЕсли;
	
	Если Не ТребуетсяВычислитьФункцию Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипДокумента = ФорматОтправки.ИмяТипа;
	
	Если ТипДокумента = "Invoice" 
		Или ТипДокумента = "InvoiceRevision" Тогда
		
		Результат = "СЧФ";
		
	ИначеЕсли ТипДокумента = "InvoiceCorrection" 
		Или ТипДокумента = "InvoiceCorrectionRevision" Тогда
		
		Результат = "КСЧФ";
		
	Иначе // Накладные или акты в формате УПД
		Результат = "ДОП";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

// Определяет тип протоконтента по идентификатору базовой версии формата.
//
// Параметры:
//  ВерсияФормата - Строка - см. функцию БазовыеФорматы;
// 
// Возвращаемое значение:
//  Строка 
//
Функция ТипКонтентаПоБазовомуФормату(БазовыйФормат)
	
	БазовыеФорматы	 = БазовыеФорматы();
	ТипыКонтента	 = ТипыКонтента();
	
	ТипыКонтентаБазовыхФорматов = Новый Соответствие;
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.utd820			, ТипыКонтента.Utd820SellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.utd				, ТипыКонтента.UtdSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.ucd736			, ТипыКонтента.UcdSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.ucd				, ТипыКонтента.UcdSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.tovtorg			, ТипыКонтента.TovTorgSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.torg12			, ТипыКонтента.Torg12SellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.rezru			, ТипыКонтента.Act552SellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.act				, ТипыКонтента.AcceptanceCertificateSellerContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.invoice			, ТипыКонтента.InvoiceContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.invoicecor		, ТипыКонтента.InvoiceCorrectionContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.proformainvoice	, ТипыКонтента.ProformaInvoiceContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.v1				, ТипыКонтента.NonformalizedContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.unknown			, ТипыКонтента.NonformalizedContent);
	ТипыКонтентаБазовыхФорматов.Вставить(БазовыеФорматы.torg2			, ТипыКонтента.Torg2SenderTitle);
	
	Результат = ТипыКонтентаБазовыхФорматов[БазовыйФормат];
	
	Возврат Результат;
	
КонецФункции

// Определяет имя типа документа в терминах компоненты AddinDiadocAPI (DocumentType),
// который соответствует указанному типу документа (typeNamedId).
//
// Параметры:
//  ИмяТипа - Строка - см. ИдентификаторыТиповДокументов;
// 
// Возвращаемое значение:
//  Строка.
//
Функция ТипДокументаКомпоненты(ИмяТипа)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	Результат = ИмяТипа;
	
	Если ИмяТипа = ТипыДокументов.ProformaInvoice Тогда
		Результат = "NonformalizedProforma";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает полное описание формата электронного документа по структуре, содержащей
// имя типа, функцию документа и версию формата вложения.
//
// Параметры:
//  ФорматЭД - Структура - содержит ключи:
//   * ИмяТипа - Строка - идентификатор типа документа (TypeNamedId)
//   * ФункцияДокумента - Строка - идентификатор функции документа (Function)
//   * ВерсияФормата - Строка - идентификатор версии вложения (Version).
// 
// Возвращаемое значение:
//  Структура - полное описание формата (см. ОписаниеФорматаЭлектронногоДокумента)
//
Функция ПолноеОписаниеФорматаЭлектронногоДокумента(ФорматЭД)
	
	ЭтоПолноеОписаниеФормата = ЭтоПолноеОписаниеФорматаЭД(ФорматЭД);
	
	Если ЭтоПолноеОписаниеФормата Тогда
		
		Результат = ФорматЭД;
		
	Иначе
		
		Результат = ОписаниеФорматаЭлектронногоДокумента(
		ФорматЭД.ИмяТипа,
		ФорматЭД.ФункцияДокумента,
		ФорматЭД.ВерсияФормата
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру, описывающую формат электронного документа.
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//  * ИмяТипа			 - Строка - Именованный идентификатор типа документа;
//  * ФункцияДокумента	 - Строка - Функция документа;
//  * ВерсияФормата		 - Строка - Версия формата;
//  * Представление		 - Строка - Представление формата;
//  * БазовыйФормат		 - Строка - Идентификатор базового формата (см. БазовыеФорматы);
//  * ТипКонтента		 - Строка - (Для совместимости) Тип протоконтента (см. ТипыКонтента);
//  * DocumentType		 - Строка - (Для совместимости) Тип документа в терминах компоненты;
//
Функция НовоеОписаниеФорматаЭлектронногоДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяТипа");
	Результат.Вставить("ВерсияФормата");
	Результат.Вставить("ФункцияДокумента");
	Результат.Вставить("Представление");
	Результат.Вставить("БазовыйФормат");
	Результат.Вставить("ТипКонтента"); // Для совместимости
	Результат.Вставить("DocumentType"); // Для совместимости
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданная структура содержит полное описание формата электронных документов.
//
// Параметры:
//  ФорматЭД - Структура - описание формата.
// 
// Возвращаемое значение:
//  Булево - Истина, если параметр содержит полное описание формата.
//
Функция ЭтоПолноеОписаниеФорматаЭД(ФорматЭД)
	
	Результат = Истина;
	
	ШаблонФормата = НовоеОписаниеФорматаЭлектронногоДокумента();
	
	Для Каждого Элемент Из ШаблонФормата Цикл
		
		Если Не ФорматЭД.Свойство(Элемент.Ключ) Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПользовательскоеПредставлениеФункцииДокумента(ФункцияДокумента)
	
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	
	ПредставленияФункций = Новый Соответствие;
	
	ПредставленияФункций.Вставить(ФункцииДокументов.ПоУмолчанию	, "");
	ПредставленияФункций.Вставить(ФункцииДокументов.СЧФДОП		, НСтр("ru = 'Счф Доп'; en='Invoice and basic'"));
	ПредставленияФункций.Вставить(ФункцииДокументов.СЧФ			, НСтр("ru = 'Счф'; en='Invoice'"));	
	ПредставленияФункций.Вставить(ФункцииДокументов.ДОП			, НСтр("ru = 'Доп'; en='Basic'"));
	ПредставленияФункций.Вставить(ФункцииДокументов.КСЧФДИС		, НСтр("ru = 'Ксчф Дис'; en='Invoice and basic'"));
	ПредставленияФункций.Вставить(ФункцииДокументов.КСЧФ		, НСтр("ru = 'Ксчф'; en='Invoice'"));
	ПредставленияФункций.Вставить(ФункцииДокументов.ДИС			, НСтр("ru = 'Дис'; en='Basic'"));
	ПредставленияФункций.Вставить(ФункцииДокументов.БезДопИнфо	, "(без доп. инф.)");
	ПредставленияФункций.Вставить(ФункцииДокументов.СДопИнфо	, "(с доп. инф.)");
	
	Результат = ПредставленияФункций[ФункцияДокумента];
	
	Если Результат = Неопределено Тогда
		Результат = ФункцияДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Идентификаторы функций документов в терминах Web API Diadoc.
// см. http://api-docs.diadoc.ru/ru/latest/proto/FullVersion.html (Function).
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ФункцииЭлектронныхДокументов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПоУмолчанию", "default");
	Результат.Вставить("СЧФДОП"		, "СЧФДОП");
	Результат.Вставить("СЧФ"		, "СЧФ");
	Результат.Вставить("ДОП"		, "ДОП");
	Результат.Вставить("КСЧФДИС"	, "КСЧФДИС");
	Результат.Вставить("КСЧФ"		, "КСЧФ");
	Результат.Вставить("ДИС"		, "ДИС");
	Результат.Вставить("БезДопИнфо"	, "NoAdditionalInfo");
	Результат.Вставить("СДопИнфо"	, "WithAdditionalInfo");
	Результат.Вставить("СвРК"		, "СвРК");
	Результат.Вставить("СвЗК"		, "СвЗК");
	Результат.Вставить("СвИСРК"		, "СвИСРК");
	Результат.Вставить("СвИСЗК"		, "СвИСЗК");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Идентификаторы типов документов в терминах Diadoc Web API 
// см. http://api-docs.diadoc.ru/ru/latest/proto/FullVersion.html (TypeNamedId).
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ИдентификаторыТиповДокументов() Экспорт
	
	ВозможныеЗначения = Новый Массив;
	ВозможныеЗначения.Добавить("UniversalTransferDocument");
	ВозможныеЗначения.Добавить("UniversalTransferDocumentRevision");
	ВозможныеЗначения.Добавить("UniversalCorrectionDocument");
	ВозможныеЗначения.Добавить("UniversalCorrectionDocumentRevision");
	ВозможныеЗначения.Добавить("XmlTorg12");
	ВозможныеЗначения.Добавить("Torg12");
	ВозможныеЗначения.Добавить("XmlAcceptanceCertificate");
	ВозможныеЗначения.Добавить("AcceptanceCertificate");
	ВозможныеЗначения.Добавить("Invoice");
	ВозможныеЗначения.Добавить("InvoiceRevision");
	ВозможныеЗначения.Добавить("InvoiceCorrection");
	ВозможныеЗначения.Добавить("InvoiceCorrectionRevision");
	ВозможныеЗначения.Добавить("ProformaInvoice");
	ВозможныеЗначения.Добавить("ReconciliationAct");
	ВозможныеЗначения.Добавить("Nonformalized");
	ВозможныеЗначения.Добавить("TrustConnectionRequest");
	ВозможныеЗначения.Добавить("PriceList");
	ВозможныеЗначения.Добавить("PriceListAgreement");
	ВозможныеЗначения.Добавить("CertificateRegistry");
	ВозможныеЗначения.Добавить("Contract");
	ВозможныеЗначения.Добавить("Torg13");
	ВозможныеЗначения.Добавить("ServiceDetails");
	ВозможныеЗначения.Добавить("SupplementaryAgreement");
	ВозможныеЗначения.Добавить("StorageInventoryAcceptanceCertificate");
	ВозможныеЗначения.Добавить("ReturnInventoryAcceptanceCertificate");
	ВозможныеЗначения.Добавить("PowerOfAttorney");
	ВозможныеЗначения.Добавить("Torg2");
	ВозможныеЗначения.Добавить("Letter");
	
	Возврат НовоеПрограммноеПеречисление(ВозможныеЗначения);
	
КонецФункции

// Формирует представление для формата электронных документов
// для отображения в пользовательском интерфейсе
//
// Параметры:
//  ИмяТипа			 - Строка - см. ИдентификаторыТиповДокументов;
//  ФункцияДокумента - Строка - см. ФункцииЭлектронныхДокументов;
// 
// Возвращаемое значение:
//  Строка - представление формата ЭД.
//
Функция ПредставлениеФорматаЭД(ИмяТипа, ФункцияДокумента)
	
	ПредставлениеТипа	 = ПредставлениеТипаЭлектронногоДокумента(ИмяТипа);
	ПредставлениеФункции = ПредставлениеФункцииЭлектронногоДокумента(ФункцияДокумента);
	
	Результат = ПредставлениеТипа;
	Если ЗначениеЗаполнено(ПредставлениеФункции) Тогда
		Результат = Результат + " " + ПредставлениеФункции;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление типа электронного документа для отображения
// в пользовательском интерфейсе.
//
// Параметры:
//  ИмяТипа - Строка - см. ИдентификаторыТиповДокументов;
// 
// Возвращаемое значение:
//  Строка.
//
Функция ПредставлениеТипаЭлектронногоДокумента(ИмяТипа)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	
	ПредставленияТипов = Новый Соответствие;
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalTransferDocument
	, НСтр("ru = 'УПД'; en = 'UTD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalTransferDocumentRevision
	, НСтр("ru = 'ИУПД'; en = 'Revision of UTD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalCorrectionDocument
	, НСтр("ru = 'УКД'; en = 'UAD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.UniversalCorrectionDocumentRevision
	, НСтр("ru = 'ИУКД'; en = 'Revision of UAD'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.XmlTorg12
	, НСтр("ru = 'Торг-12'; en='TORG-12'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Torg12
	, НСтр("ru = 'Торг-12'; en='TORG-12'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.XmlAcceptanceCertificate
	, НСтр("ru = 'Акт'; en='Act'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.AcceptanceCertificate
	, НСтр("ru = 'Акт'; en='Act'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Invoice
	, НСтр("ru = 'Счет-фактура'; en='Tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.InvoiceRevision
	, НСтр("ru = 'Исправление СФ'; en='Revision of tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.InvoiceCorrection
	, НСтр("ru = 'Корректировочный СФ'; en = 'Corrective tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.InvoiceCorrectionRevision
	, НСтр("ru = 'Исправление КСФ'; en = 'Revision of corrective tax invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ProformaInvoice
	, НСтр("ru = 'Счет на оплату'; en='Proforma invoice'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ReconciliationAct
	, НСтр("ru = 'Акт сверки'; en='Reconciliation act'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.TrustConnectionRequest
	, НСтр("ru = 'Приглашение к ЭДО'; en='Trust connection request'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.PriceList
	, НСтр("ru = 'Прайс-лист'; en='Price list'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.PriceListAgreement
	, НСтр("ru = 'Протокол согласования цены'; en='Price approval protocol'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.CertificateRegistry
	, НСтр("ru = 'Реестр сертификатов'; en='Certificate registry'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Contract
	, НСтр("ru = 'Договор'; en='Contract'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Nonformalized
	, НСтр("ru = 'Неформализованный'; en='Nonformalized document'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Torg13
	, НСтр("ru = 'ТОРГ-13'; en='TORG-13'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ServiceDetails
	, НСтр("ru = 'Детализация'; en='Service details'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.SupplementaryAgreement
	, НСтр("ru = 'Доп. соглашение к договору'; en='Supplementary agreement'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.StorageInventoryAcceptanceCertificate
	, НСтр("ru = 'Акт МХ-1'; en='Act MH-1'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.ReturnInventoryAcceptanceCertificate
	, НСтр("ru = 'Акт МХ-3'; en='Act MH-3'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.PowerOfAttorney
	, НСтр("ru = 'Доверенность'; en='Letter of authority'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Torg2
	, НСтр("ru = 'Акт Торг-2'; en='Act Torg-2'"));
	
	ПредставленияТипов.Вставить(ТипыДокументов.Letter
	, НСтр("ru = 'Письмо'; en='Letter'"));
	
	Результат = ПредставленияТипов[ИмяТипа];
	Если Результат = Неопределено Тогда
		Результат = ИмяТипа;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление функции электронного документа для отображения
// в пользовательском интерфейсе.
//
// Параметры:
//  ФункцияДокумента - Строка - см. ФункцииЭлектронныхДокументов;
// 
// Возвращаемое значение:
//  Строка.
//
Функция ПредставлениеФункцииЭлектронногоДокумента(ФункцияДокумента)
	
	ФункцииДокументов = ФункцииЭлектронныхДокументов();
	
	ПредставленияФункций = Новый Соответствие;
	
	ПредставленияФункций.Вставить(ФункцииДокументов.ПоУмолчанию
	, "");
	
	ПредставленияФункций.Вставить(ФункцииДокументов.СЧФДОП
	, НСтр("ru = 'Счф Доп'; en='Invoice and basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.СЧФ
	, НСтр("ru = 'Счф'; en='Invoice'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.ДОП
	, НСтр("ru = 'Доп'; en='Basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.КСЧФДИС
	, НСтр("ru = 'Ксчф Дис'; en='Invoice and basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.КСЧФ
	, НСтр("ru = 'Ксчф'; en='Invoice'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.ДИС
	, НСтр("ru = 'Дис'; en='Basic'"));
	
	ПредставленияФункций.Вставить(ФункцииДокументов.БезДопИнфо
	, "");
	
	ПредставленияФункций.Вставить(ФункцииДокументов.СДопИнфо
	, "");
	
	Результат = ПредставленияФункций[ФункцияДокумента];
	Если Результат = Неопределено Тогда
		Результат = ФункцияДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует описание формата электронного документа.
//
// Параметры:
//  ИмяТипа			 - Строка - typeNameId (см. ИдентификаторыТиповДокументов())
//  ФункцияДокумента - Строка - Function (см. ФункцииЭлектронныхДокументов())
//  ВерсияФормата	 - Строка - Version (см. значения перечисления ВерсииФорматовЭлектронныхДокументов())
// 
// Возвращаемое значение:
//  Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента.
//
Функция ОписаниеФорматаЭлектронногоДокумента(ИмяТипа, ФункцияДокумента, ВерсияФормата) Экспорт
	
	БазовыйФормат	 = БазовыйФорматВерсииКонтента(ВерсияФормата);
	ТипКонтента		 = ТипКонтентаПоБазовомуФормату(БазовыйФормат);
	ТипДокументаCOM	 = ТипДокументаКомпоненты(ИмяТипа);
	Представление	 = ПредставлениеФорматаЭД(ИмяТипа, ФункцияДокумента);
	
	Результат = НовоеОписаниеФорматаЭлектронногоДокумента();
	Результат.ИмяТипа			 = ИмяТипа;
	Результат.ВерсияФормата		 = ВерсияФормата;
	Результат.ФункцияДокумента	 = ФункцияДокумента;
	
	// Расчетные параметры
	Результат.Представление	 = Представление;
	Результат.БазовыйФормат	 = БазовыйФормат;
	Результат.ТипКонтента	 = ТипКонтента;
	Результат.DocumentType	 = ТипДокументаCOM;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

//} ФОРМАТЫ ЭЛЕКТРОННЫХ ДОКУМЕНТОВ

//{ НАСТРОЙКА ФОРМАТА ОТПРАВКИ ДОКУМЕНТОВ

// Настройка формата отправки документов, для новой организации
//
// Возвращаемое значение:
//  Строка - см. фукнцию НастройкиФорматаОтправкиДокументов
//
Функция НастройкаФорматаОтправкиДокументовПоУмолчанию() Экспорт
	
	ТаблицаНастроек = ТаблицаНастроекФорматовОтправки();
	
	Стр = ТаблицаНастроек.Найти(Истина, "ОсновнаяНастройка");
	
	Результат = Стр.КлючНастройки;
	
	Возврат Результат;
	
КонецФункции

// Настройка формата отправки документов, в зависимости от варианта отправки счетов-фактур и накладных
//
// Параметры:
//  ВариантОтправкиСФ        - Строка - см. функцию ВариантыОтправкиСчетовФактур;
//  ВариантОтправкиНакладных - Строка - см. функцию ВариантыОтправкиНакладных;
// 
// Возвращаемое значение:
//  Строка - см. фукнцию НастройкиФорматаОтправкиДокументов
//
Функция НастройкаФорматаОтправкиДокументов(ВариантОтправкиСФ, ВариантОтправкиНакладных) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ВариантОтправкиСФ)
		Или Не ЗначениеЗаполнено(ВариантОтправкиНакладных) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаНастроек = ТаблицаНастроекФорматовОтправки();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВариантОтправкиСФ"		, ВариантОтправкиСФ);
	СтруктураОтбора.Вставить("ВариантОтправкиНакладных"	, ВариантОтправкиНакладных);
	
	СтрокиТаблицы = ТаблицаНастроек.НайтиСтроки(СтруктураОтбора);
	
	Если Не ЗначениеЗаполнено(СтрокиТаблицы) Тогда
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось получить общую настройку формата отправки документов!
		|Формат отправки счетов-фактур: %1
		|Формат отправки накладных: %2'"), ВариантОтправкиСФ, ВариантОтправкиНакладных);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = СтрокиТаблицы[0].КлючНастройки;
	
	Возврат Результат;
	
КонецФункции

// Представление настройки формата отправки документов, для списков организаций и контрагентов
//
// Параметры:
//  КлючНастройки - Строка - см. функцию НастройкиФорматаОтправкиДокументов;
// 
// Возвращаемое значение:
//  Строка - представление настройки
//
Функция ПредставлениеНастройкиФорматаОтправкиДокументов(КлючНастройки) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(КлючНастройки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Настройки = НастройкиФорматаОтправкиДокументов();
	
	Представления = Новый Соответствие;
	
	Представления.Вставить(Настройки.СЧФДОП_820_736
	, НСтр("ru = 'УПД, УКД в формате 736 приказа для комплектов передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(Настройки.СЧФ_ДОП_820_736
	, НСтр("ru = 'УПД, УКД в формате 736 приказа раздельно для каждого передаточного документа и счета-фактуры'"));
	
	Представления.Вставить(Настройки.СФТОРГ12АКТ_820_736
	, НСтр("ru = 'СФ, ТОРГ12, АКТ в формате 820 приказа; КСФ в формате 736 приказа'"));
	
	Представления.Вставить(Настройки.СЧФДОП_820
	, НСтр("ru = 'УПД, УКД в формате 189 приказа для комплектов передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(Настройки.СЧФ_ДОП_820
	, НСтр("ru = 'УПД, УКД в формате 189 приказа раздельно для каждого передаточного документа и счета-фактуры'"));
	
	Представления.Вставить(Настройки.СФТОРГ12АКТ_820
	, НСтр("ru = 'СФ, ТОРГ12, АКТ в формате 820 приказа; КСФ в формате 189 приказа'"));
	
	Представления.Вставить(Настройки.СЧФДОП
	, НСтр("ru = 'УПД в формате 155 приказа, УКД для комплектов передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(Настройки.СЧФ_ДОП
	, НСтр("ru = 'УПД в формате 155 приказа, УКД раздельно для каждого передаточного документа и счета-фактуры'"));
	
	Представления.Вставить(Настройки.СЧФ
	, НСтр("ru = 'УПД в формате 155 приказа, УКД только для счетов-фактур'"));
	
	Представления.Вставить(Настройки.ДОП
	, НСтр("ru = 'УПД в формате 155 приказа, УКД только для передаточных документов'"));
	
	Представления.Вставить(Настройки.СФТОРГ12АКТ
	, НСтр("ru = 'СФ, ТОРГ12, АКТ в формате 155 приказа; КСФ в формате 189 приказа'"));
	
	Представления.Вставить(Настройки.СФ
	, НСтр("ru = 'СФ в формате 155 приказа, КСФ в формате 189 приказа'"));
	
	Представления.Вставить(Настройки.ТОРГ12АКТ
	, НСтр("ru = 'ТОРГ12/Акт в формате 155 приказа'"));
	
	Представления.Вставить(Настройки.НЕТ
	, НСтр("ru = 'СФ, КСФ в устаревшем формате'"));
	
	Результат = Представления[КлючНастройки];
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось получить представление формата отправки документов %1!'"), КлючНастройки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вариант отправки счетов-фактур, в зависимости от настройки формата отправки документов
//
// Параметры:
//  КлючНастройки - Строка - см. функцию НастройкиФорматаОтправкиДокументов;
// 
// Возвращаемое значение:
//  Строка - см. фукнцию ВариантыОтправкиСчетовФактур
//
Функция ВариантОтправкиСчетовФактур(КлючНастройки) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(КлючНастройки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаНастроек = ТаблицаНастроекФорматовОтправки();
	
	СтрокаТаблицы = ТаблицаНастроек.Найти(КлючНастройки, "КлючНастройки");
	
	Если СтрокаТаблицы = Неопределено Тогда
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось получить настройку формата отправки счета-фактуры!
		|Формат отправки документов: %1'"), КлючНастройки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = СтрокаТаблицы.ВариантОтправкиСФ;
	
	Возврат Результат;
	
КонецФункции

// Вариант отправки накладных, в зависимости от настройки формата отправки документов
//
// Параметры:
//  КлючНастройки - Строка - см. функцию НастройкиФорматаОтправкиДокументов;
// 
// Возвращаемое значение:
//  Строка - см. фукнцию ВариантыОтправкиНакладных
//
Функция ВариантОтправкиОтправкиНакладных(КлючНастройки) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(КлючНастройки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаНастроек = ТаблицаНастроекФорматовОтправки();
	
	СтрокаТаблицы = ТаблицаНастроек.Найти(КлючНастройки, "КлючНастройки");
	
	Если СтрокаТаблицы = Неопределено Тогда
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось получить настройку формата отправки счета-фактуры!
		|Формат отправки документов: %1'"), КлючНастройки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = СтрокаТаблицы.ВариантОтправкиНакладных;
	
	Возврат Результат;
	
КонецФункции

// Вариант отправки накладных по умолчанию, в зависимости от варианта отправки счетов-фактур
//
// Параметры:
//  ВариантОтправкиСФ - Строка - см. функцию ВариантыОтправкиСчетовФактур;
//
// Возвращаемое значение:
//  Строка - см. фукнцию ВариантыОтправкиНакладных
//
Функция ВариантОтправкиНакладныхПоУмолчанию(ВариантОтправкиСФ) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ВариантОтправкиСФ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаНастроек = ТаблицаНастроекФорматовОтправки();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВариантОтправкиСФ", ВариантОтправкиСФ);
	СтруктураОтбора.Вставить("ОсновнойВариантОтправкиНакладных", Истина);
	
	СтрокиТаблицы = ТаблицаНастроек.НайтиСтроки(СтруктураОтбора);
	
	Если Не ЗначениеЗаполнено(СтрокиТаблицы) Тогда
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось получить настройку по умолчанию для формата отправки накладных %1!'"), ВариантОтправкиСФ);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = СтрокиТаблицы[0].ВариантОтправкиНакладных;
	
	Возврат Результат;
	
КонецФункции

// Представление варианта отправки счетов-фактур, для списков выбора
//
// Параметры:
//  КлючНастройки - Строка - см. функцию ВариантыОтправкиСчетовФактур;
// 
// Возвращаемое значение:
//  Строка - представление настройки
//
Функция ПредставлениеВариантаОтправкиСчетовФактур(КлючНастройки) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(КлючНастройки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВариантыОтправки = ВариантыОтправкиСчетовФактур();
	
	Представления = Новый Соответствие;
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ПОЛНЫЙ_820_736
	, НСтр("ru = 'УПД, УКД в формате 736 приказа для комплекта передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_СФ_820_736
	, НСтр("ru = 'УПД, УКД в формате 736 приказа для счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.СФ_820_736
	, НСтр("ru = 'В формате 820 приказа (КСФ - в формате 736 приказа)'"));		
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ПОЛНЫЙ_820
	, НСтр("ru = 'УПД, УКД в формате 189 приказа для комплекта передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_СФ_820
	, НСтр("ru = 'УПД, УКД в формате 189 приказа для счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.СФ_820
	, НСтр("ru = 'В формате 820 приказа (КСФ - в формате 189 приказа)'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ПОЛНЫЙ
	, НСтр("ru = 'УПД в формате 155 приказа, УКД для комплекта передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_СФ
	, НСтр("ru = 'УПД в формате 155 приказа, УКД для счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.СФ_155
	, НСтр("ru = 'В формате 155 приказа (КСФ - в формате 189 приказа)'"));
	
	Представления.Вставить(ВариантыОтправки.СФ_93
	, НСтр("ru = 'В формате 93 приказа'"));
	
	Результат = Представления[КлючНастройки];
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось получить представление формата отправки счетов-фактур %1!'"), КлючНастройки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Представление варианта отправки накладных и актов, для списков выбора
//
// Параметры:
//  КлючНастройки - Строка - см. функцию ВариантыОтправкиНакладных;
// 
// Возвращаемое значение:
//  Строка - представление настройки
//
Функция ПредставлениеВариантаОтправкиНакладных(КлючНастройки) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(КлючНастройки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВариантыОтправки = ВариантыОтправкиНакладных();
	
	Представления = Новый Соответствие;
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ПОЛНЫЙ_820_736		
	, НСтр("ru = 'УПД, УКД в формате 736 приказа для комплекта передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ТОРГ12АКТ_820_736
	, НСтр("ru = 'УПД, УКД в формате 736 приказа для передаточных документов'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ПОЛНЫЙ_820
	, НСтр("ru = 'УПД, УКД в формате 189 приказа для комплекта передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ТОРГ12АКТ_820
	, НСтр("ru = 'УПД, УКД в формате 189 приказа для передаточных документов'"));
	
	Представления.Вставить(ВариантыОтправки.ТОРГ12АКТ_820
	, НСтр("ru = 'В формате 820 приказа'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ПОЛНЫЙ
	, НСтр("ru = 'УПД в формате 155 приказа, УКД для комплекта передаточных документов и счетов-фактур'"));
	
	Представления.Вставить(ВариантыОтправки.УПД_УКД_ТОРГ12АКТ
	, НСтр("ru = 'УПД в формате 155 приказа, УКД для передаточных документов'"));
	
	Представления.Вставить(ВариантыОтправки.ТОРГ12АКТ_155
	, НСтр("ru = 'В формате 155 приказа'"));
	
	Представления.Вставить(ВариантыОтправки.ТОРГ12АКТ_172
	, НСтр("ru = 'В формате 172 приказа'"));
	
	Результат = Представления[КлючНастройки];
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		ТекстОшибки = ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Не удалось получить представление формата отправки накладных %1!'"), КлючНастройки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Список для выбора варианта отправки счетов-фактур,
// в карточках организации и контрагента
//
// Возвращаемое значение:
//  СписокЗначений - элемент списка содержит:
//    * Значение      - Строка - см. функцию ВариантыОтправкиСчетовФактур;
//    * Представление - Строка - см. функцию ПредставлениеВариантаОтправкиСчетовФактур;
//
Функция СписокВыбораВариантовОтправкиСчетовФактур() Экспорт
	
	Результат = Новый СписокЗначений;
	
	ТаблицаНастроек = ТаблицаНастроекФорматовОтправки();
	
	Для Каждого Стр Из ТаблицаНастроек Цикл
		
		ВариантОтправкиСФ	 = Стр.ВариантОтправкиСФ;
		УстаревшаяНастройка	 = Стр.УстаревшаяНастройка;
		
		Если Не УстаревшаяНастройка И Результат.НайтиПоЗначению(ВариантОтправкиСФ) = Неопределено Тогда
			
			ПредставлениеВарианта = ПредставлениеВариантаОтправкиСчетовФактур(ВариантОтправкиСФ);
			
			Результат.Добавить(ВариантОтправкиСФ, ПредставлениеВарианта);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Список для выбора варианта отправки накладных,
// в зависимости от варианта отправки счетов-фактур
//
// Параметры:
//  ВариантОтправкиСФ - Строка - см. функцию ВариантыОтправкиСчетовФактур;
//
// Возвращаемое значение:
//  СписокЗначений - элемент списка содержит:
//    * Значение      - Строка - см. функцию ВариантыОтправкиНакладных;
//    * Представление - Строка - см. функцию ПредставлениеВариантаОтправкиНакладных;
//
Функция СписокВыбораВариантовОтправкиНакладных(ВариантОтправкиСФ) Экспорт
	
	Результат = Новый СписокЗначений;
	
	ТаблицаНастроек = ТаблицаНастроекФорматовОтправки();
	
	Для Каждого Стр Из ТаблицаНастроек Цикл
		
		ВариантОтправкиНакладных = Стр.ВариантОтправкиНакладных;
		
		Если Не Стр.УстаревшаяНастройка
			И Стр.ВариантОтправкиСФ = ВариантОтправкиСФ
			И Результат.НайтиПоЗначению(ВариантОтправкиНакладных) = Неопределено Тогда
			
			ПредставлениеВарианта = ПредставлениеВариантаОтправкиНакладных(ВариантОтправкиНакладных);
			
			Результат.Добавить(ВариантОтправкиНакладных, ПредставлениеВарианта);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Псевдоперечисление ключей настроек форматов отправки документов,
// которые записываются в свойства "ФормироватьУПД" или "ФормироватьУПДКонтрагент";
//
// Возвращаемое значение:
//  Структура
//
Функция НастройкиФорматаОтправкиДокументов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("СЧФДОП_820_736"	, "СЧФДОП_820_736");	// УПД Счф Доп 820@, УКД Ксчф Дис 736@
	Результат.Вставить("СЧФДОП_820"	, "СЧФДОП_820"); // УПД Счф Доп 820@, УКД Ксчф Дис 820@
	Результат.Вставить("СЧФДОП"		, "СЧФДОП");	 // УПД Счф Доп 155@, УКД Ксчф Дис 189@
	
	Результат.Вставить("СЧФ_ДОП_820_736", "СЧФ_ДОП_820_736");	// УПД Счф 820@, УПД Доп 820@, УКД КСчф 736@
	Результат.Вставить("СЧФ_ДОП_820", "СЧФ_ДОП_820"); // УПД Счф 820@, УКД КСчф 189@, УПД Доп 820@
	Результат.Вставить("СЧФ_ДОП"	, "СЧФ_ДОП");	  // УПД Счф 155@, УКД КСчф 189@, УПД Доп 155@
	
	Результат.Вставить("СФТОРГ12АКТ_820_736", "СФТОРГ12АКТ_820_736"); 	// СФ 820@, КСФ 736@, Торг/Акт 820@
	Результат.Вставить("СФТОРГ12АКТ_820", "СФТОРГ12АКТ_820"); // СФ 820@, КСФ 189@, Торг/Акт 820@
	Результат.Вставить("СФТОРГ12АКТ"	, "СФТОРГ12АКТ");	  // СФ 155@, КСФ 189@, Торг/Акт 155@
	
	Результат.Вставить("СЧФ", "СЧФ"); // УПД Счф 155@, УКД КСчф 189@, Торг/Акт 172@
	Результат.Вставить("ДОП", "ДОП"); // СФ 93@, КСФ 93@, УПД Доп 155@
	
	Результат.Вставить("СФ"			, "СФ");		// СФ 155@, КСФ 189@, Торг/Акт 172@
	Результат.Вставить("ТОРГ12АКТ"	, "ТОРГ12АКТ");	// СФ 93@, КСФ 93@, Торг/Акт 155@
	Результат.Вставить("НЕТ"		, "НЕТ");		// СФ 93@, КСФ 93@, Торг/Акт 172@
	
	Возврат Результат;
	
КонецФункции

// Псевдоперечисление вариантов отправки счетов-фактур
//
// Возвращаемое значение:
//  Структура
//
Функция ВариантыОтправкиСчетовФактур()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД_УКД_ПОЛНЫЙ_820_736"	, "УПД_УКД_ПОЛНЫЙ_820_736"); // УПД Счф Доп 820@, УКД Ксчф Дис 736@
	Результат.Вставить("УПД_УКД_ПОЛНЫЙ_820"		, "УПД_УКД_ПОЛНЫЙ_820");	// УПД Счф Доп 820@, УКД Ксчф Дис 189@
	Результат.Вставить("УПД_УКД_ПОЛНЫЙ"			, "УПД_УКД_ПОЛНЫЙ");	 	// УПД Счф Доп 155@, УКД Ксчф Дис 189@
	
	Результат.Вставить("УПД_УКД_СФ_820_736"	, "УПД_УКД_СФ_820_736"); // УПД Счф 820@, УКД КСчф 736@
	Результат.Вставить("УПД_УКД_СФ_820"		, "УПД_УКД_СФ_820");	// УПД Счф 820@, УКД КСчф 189@
	Результат.Вставить("УПД_УКД_СФ"			, "УПД_УКД_СФ");		// УПД Счф 155@, УКД КСчф 189@
	
	Результат.Вставить("СФ_820_736"	, "СФ_820_736"); // СФ 820@, КСФ 736@
	Результат.Вставить("СФ_820"		, "СФ_820"); 	// СФ 820@, КСФ 189@
	Результат.Вставить("СФ_155"		, "СФ_155");	// СФ 155@, КСФ 189@
	
	Результат.Вставить("СФ_93", "СФ_93"); // СФ 93@, КСФ 93@
	
	Возврат Результат;
	
КонецФункции

// Псевдоперечисление вариантов отправки накладных и актов
//
// Возвращаемое значение:
//  Структура
//
Функция ВариантыОтправкиНакладных()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД_УКД_ПОЛНЫЙ_820_736"	, "УПД_УКД_ПОЛНЫЙ_820_736"); // УПД Счф Доп 820@, УКД Ксчф Дис 736@
	Результат.Вставить("УПД_УКД_ПОЛНЫЙ_820"		, "УПД_УКД_ПОЛНЫЙ_820"); 	// УПД Счф Доп 820@, УКД Ксчф Дис 820@
	Результат.Вставить("УПД_УКД_ПОЛНЫЙ"			, "УПД_УКД_ПОЛНЫЙ");	 	// УПД Счф Доп 155@, УКД Ксчф Дис 189@
	
	Результат.Вставить("УПД_УКД_ТОРГ12АКТ_820_736"	, "УПД_УКД_ТОРГ12АКТ_820_736");	// УПД Доп 820@, УКД Дис 736@
	Результат.Вставить("УПД_УКД_ТОРГ12АКТ_820"		, "УПД_УКД_ТОРГ12АКТ_820");	 	// УПД Доп 820@
	Результат.Вставить("УПД_УКД_ТОРГ12АКТ"			, "УПД_УКД_ТОРГ12АКТ");		 	// УПД Доп 155@
	
	Результат.Вставить("ТОРГ12АКТ_820", "ТОРГ12АКТ_820"); // Торг/Акт 820@
	Результат.Вставить("ТОРГ12АКТ_155", "ТОРГ12АКТ_155"); // Торг/Акт 155@
	Результат.Вставить("ТОРГ12АКТ_172", "ТОРГ12АКТ_172"); // Торг/Акт 172@
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу всех возможных настроек форматов отправки документов
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//    * КлючНастройки                    - Строка - значение для записи в карточке организации или контрагента
//                                                  в свойство "ФормироватьУПД" или "ФормироватьУПДКонтрагент";
//    * ВариантОтправкиСФ                - Строка - см. функцию ВариантыОтправкиСчетовФактур;
//    * ВариантОтправкиНакладных         - Строка - см. функцию НастройкиФорматаОтправкиНакладной;
//    * ОсновнойВариантОтправкиНакладных - Булево - Истина, вариант отправки счета-фактуры,
//                                                  автоматически заполняется формат отправки накладной;
//    * ОсновнаяНастройка                - Булево - Истина, если настройка автоматически заполняется
//                                                  в карточке новой сопоставленной организации;
//    * УстаревшаяНастройка              - Булево - Истина, если настройка больше не отображается
//                                                  в списке для выбора формата отправки
//
Функция ТаблицаНастроекФорматовОтправки()
	
	Результат = Новый ТаблицаЗначений;
	
	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	Результат.Колонки.Добавить("КлючНастройки"						, ОписаниеСтроки);
	Результат.Колонки.Добавить("ВариантОтправкиСФ"					, ОписаниеСтроки);
	Результат.Колонки.Добавить("ВариантОтправкиНакладных"			, ОписаниеСтроки);
	Результат.Колонки.Добавить("ОсновнойВариантОтправкиНакладных"	, ОписаниеБулево);
	Результат.Колонки.Добавить("ОсновнаяНастройка"					, ОписаниеБулево);
	Результат.Колонки.Добавить("УстаревшаяНастройка"				, ОписаниеБулево);
	
	Настройки = НастройкиФорматаОтправкиДокументов();
	ВариантыОтправкиСФ	 = ВариантыОтправкиСчетовФактур();
	ВариантыОтправкиНакл = ВариантыОтправкиНакладных();
	
	// СФ 820@, УКД 736@
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СЧФДОП_820_736
	, ВариантыОтправкиСФ.УПД_УКД_ПОЛНЫЙ_820_736
	, ВариантыОтправкиНакл.УПД_УКД_ПОЛНЫЙ_820_736
	, Истина, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СЧФ_ДОП_820_736
	, ВариантыОтправкиСФ.УПД_УКД_СФ_820_736
	, ВариантыОтправкиНакл.УПД_УКД_ТОРГ12АКТ_820_736
	, Истина, Ложь);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СФТОРГ12АКТ_820_736
	, ВариантыОтправкиСФ.СФ_820_736
	, ВариантыОтправкиНакл.ТОРГ12АКТ_820
	, Истина, Ложь);
	
	// СФ 820@, УКД 189@
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СЧФДОП_820
	, ВариантыОтправкиСФ.УПД_УКД_ПОЛНЫЙ_820
	, ВариантыОтправкиНакл.УПД_УКД_ПОЛНЫЙ_820
	, Истина, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СЧФ_ДОП_820
	, ВариантыОтправкиСФ.УПД_УКД_СФ_820
	, ВариантыОтправкиНакл.УПД_УКД_ТОРГ12АКТ_820
	, Истина, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СФТОРГ12АКТ_820
	, ВариантыОтправкиСФ.СФ_820
	, ВариантыОтправкиНакл.ТОРГ12АКТ_820
	, Истина, Ложь, Истина);
	
	// СФ 155@
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СЧФДОП
	, ВариантыОтправкиСФ.УПД_УКД_ПОЛНЫЙ
	, ВариантыОтправкиНакл.УПД_УКД_ПОЛНЫЙ
	, Истина, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СЧФ_ДОП
	, ВариантыОтправкиСФ.УПД_УКД_СФ
	, ВариантыОтправкиНакл.УПД_УКД_ТОРГ12АКТ
	, Истина, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СЧФ
	, ВариантыОтправкиСФ.УПД_УКД_СФ
	, ВариантыОтправкиНакл.ТОРГ12АКТ_172
	, Ложь, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СФТОРГ12АКТ
	, ВариантыОтправкиСФ.СФ_155
	, ВариантыОтправкиНакл.ТОРГ12АКТ_155
	, Истина, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.СФ
	, ВариантыОтправкиСФ.СФ_155
	, ВариантыОтправкиНакл.ТОРГ12АКТ_172
	, Ложь, Ложь, Истина);
	
	// СФ 93@
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.НЕТ
	, ВариантыОтправкиСФ.СФ_93
	, ВариантыОтправкиНакл.ТОРГ12АКТ_172
	, Истина, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.ДОП
	, ВариантыОтправкиСФ.СФ_93
	, ВариантыОтправкиНакл.УПД_УКД_ТОРГ12АКТ
	, Ложь, Ложь, Истина);
	
	ДобавитьНастройкуФорматаОтправки(Результат
	, Настройки.ТОРГ12АКТ
	, ВариантыОтправкиСФ.СФ_93
	, ВариантыОтправкиНакл.ТОРГ12АКТ_155
	, Ложь, Ложь, Истина);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьНастройкуФорматаОтправки(ТаблицаНастроек
	, КлючНастройки, ВариантОтправкиСФ, ВариантОтправкиНакладных
	, ОсновнойВариантОтправкиНакладных, ОсновнаяНастройка, УстаревшаяНастройка = Ложь)
	
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.КлючНастройки					 = КлючНастройки;
	НоваяСтрока.ВариантОтправкиСФ				 = ВариантОтправкиСФ;
	НоваяСтрока.ВариантОтправкиНакладных		 = ВариантОтправкиНакладных;
	НоваяСтрока.ОсновнойВариантОтправкиНакладных = ОсновнойВариантОтправкиНакладных;
	НоваяСтрока.ОсновнаяНастройка				 = ОсновнаяНастройка;
	НоваяСтрока.УстаревшаяНастройка				 = УстаревшаяНастройка;
	
КонецПроцедуры

//} НАСТРОЙКА ФОРМАТА ОТПРАВКИ ДОКУМЕНТОВ

//{ РАБОТА С API	

//выполнение GET запроса
Функция ЗапросНаПолучениеФайла(ПутьКФайлу, ФайлРезультата = "", Заголовки = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если ФайлРезультата = "" Тогда 
		ФайлРезультата = ПолучитьИмяВременногоФайла();
	КонецЕсли;	
	
	Ответ = Компонента_HttpTransport(ПутьКФайлу, Заголовки, ФайлРезультата);
	
	Если Ответ.StatusCode = 200 Тогда
		Результат = Ответ.HttpContent.FilePath;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Готовит GET запрос в Билли по наличию выставленных счетов на оплату. Возвращает ответ от Билли.
//
// Параметры:
//  ИНН  					- Строка - ИНН организации
//  КПП  					- Строка - КПП организации.
//  АвторизационныйТокен  	- Строка - Токен, под которым проходила авторизация в Диадок
//
// Возвращаемое значение:
//   Структура, Строка   - если от сервера Билли вернулся корректный JSON, Тогда возвращает структуру, в противном случае вернет непосредственно строку JSON.
//
Функция Kontur_API_PortalBills_Metas(ИНН, КПП = "", АвторизационныйТокен) Экспорт
	
	АдресЗапроса = "https://api.kontur.ru/renewals/api/v3/metas/byinn";
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("productId=diadoc");
	МассивПараметров.Добавить("source=widget");
	МассивПараметров.Добавить("inn=" + ИНН);
	
	Если ЗначениеЗаполнено(КПП) Тогда
		МассивПараметров.Добавить("kpp=" + КПП);
	КонецЕсли;
	
	АдресЗапроса = АдресЗапроса + "?" + Преобразование_МассивВСтроку(МассивПараметров, "&");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept"			, "application/json");
	Заголовки.Вставить("Content-Type"	, "application/json; charset=utf-8");
	Заголовки.Вставить("x-Auth-ddToken"	, АвторизационныйТокен);
	
	Попытка
		Ответ 		= Компонента_HttpTransport(АдресЗапроса, Заголовки);
		Результат 	= РазобранныйОтветАПИ(Ответ.HttpContent.DataString);
	Исключение
		ВызватьИсключение;			
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//GET запрос в Билли по сохранению файла счета на оплату
Функция Kontur_API_PortalBills_pdf(ИДТарифа, ИДЛицевогоСчета, АвторизационныйТокен) Экспорт
	
	АдресЗапроса = "https://api.kontur.ru/renewals/api/v2/pdf";
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("billId=" + ИДТарифа);
	МассивПараметров.Добавить("accountId=" + ИДЛицевогоСчета);
	МассивПараметров.Добавить("productId=diadoc");
	МассивПараметров.Добавить("realm=diadoc");
	
	АдресЗапроса = АдресЗапроса + "?" + Преобразование_МассивВСтроку(МассивПараметров, "&");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("x-Auth-ddToken"	, АвторизационныйТокен);
	
	Попытка
		Результат = ЗапросНаПолучениеФайла(АдресЗапроса, , Заголовки);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_HttpContent()
	
	Возврат Новый Структура("DataString, FilePath", "", Неопределено);
	
КонецФункции //Новый_HttpContent()

Функция Новый_HttpОтвет()
	
	Возврат Новый Структура("StatusCode, HttpContent", 0, Новый_HttpContent());
	
КонецФункции //Новый_HttpContent()

// Отправляет HTTP запрос, используя внешнюю компоненту
//
// Параметры:
//  АдресЗапроса  	- Строка - адрес метода, к которому обращаемся
//  Заголовки 		- Соответствие - заголовки для HTTP запроса
//  ФайлРезультата	- Строка - полный путь до файла, в который необходимо вернуть результат запроса
//
// Возвращаемое значение:
//   Структура   	- содержит ключи: DataString, FilePath
//
Функция Компонента_HttpTransport(АдресЗапроса, Заголовки = Неопределено, ФайлРезультата = "") Экспорт
	
	Ответ = Новый_HttpОтвет();
	
	DiadocConnection = Модуль_РаботаССерверомДиадок.ПолучитьDiadocConnection();
	
	Если ТипЗнч(DiadocConnection) = Тип("COMОбъект") Тогда
		
		Transport 			= DiadocConnection.CreateHttpTransport();
		Factory 			= Transport.CreateContentFactory();
		
		Request			= Transport.CreateRequest();
		Request.Uri 	= АдресЗапроса;
		
		// по умолчанию используется метод GET
		
		Если ТипЗнч(Заголовки) = Тип("Соответствие") Тогда
			Для каждого ЭлЗаголовок Из Заголовки Цикл
				Request.AddHeader(ЭлЗаголовок.Ключ, ЭлЗаголовок.Значение);
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ФайлРезультата) Тогда
			Request.ResponseContent	= Factory.CreateFileContent(ФайлРезультата);
		Иначе
			Request.ResponseContent = Factory.CreateMemoryContent();
		КонецЕсли;
		
		Response = Transport.Send(Request);
		
		Ответ.StatusCode = Response.StatusCode;
		Ответ.HttpContent.FilePath = Request.ResponseContent.FilePath;
		Ответ.HttpContent.DataString = Request.ResponseContent.DataString;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // Компонента_HttpTransport()

// Преобразует содержимое JSON в коллекцию
//
// Параметры:
//  СтрокаJSON  - Строка - ответ сервера в формате JSON
// Возвращаемое значение:
//   Структура, Строка
//
Функция РазобранныйОтветАПИ(СтрокаJSON)
	
	Если ПлатформаСтаршеЧем_8_3_6_1977() Тогда
		
		Результат = ПолучитьМодульПрог("ПарсерJSON").Прочитать(СтрокаJSON);
		
		//читаем своим парсером
		Если  НЕ ТипЗнч(Результат) = Тип("Строка")
			И НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
			Результат = СтрокаJSON;
			// не смогли разобрать ответ - скорее всего, вернулась ошибка. Передадим ее как есть.
		КонецЕсли;
		
	Иначе
		
		ИмяВремФайла = ПолучитьИмяВременногоФайла();
		
		ТД = Новый ТекстовыйДокумент;
		ТД.УстановитьТекст(СтрокаJSON);
		ТД.Записать(ИмяВремФайла, "UTF-8");
		
		Чтение = Новый("ЧтениеJSON");//8.3
		Чтение.ОткрытьФайл(ИмяВремФайла, "UTF-8");
		Попытка
			Результат = Вычислить("ПрочитатьJSON(Чтение)");
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат СтрокаJSON;  // некорректный JSON - сервер вернул текст ошибки. Вернем его просто как строку.
		КонецПопытки;
		Чтение.Закрыть();
		УдалитьФайлы(ИмяВремФайла);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // РазобранныйОтветАПИ()

//} РАБОТА С API

//{ КЛАССИФИКАТОРЫ

Функция КодСтраны(НаименованиеСтраны) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.КодСтраны(НаименованиеСтраны);
	Возврат Результат;
	
КонецФункции

Функция НаименованиеСтраны(КодСтраны) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.НаименованиеСтраны(КодСтраны);
	Возврат Результат;
	
КонецФункции

//} КЛАССИФИКАТОРЫ

// Хранит ссылки вызываемые ресурсы
//
// Возвращаемое значение:
//	Структура	
Функция АдресаИнтернетРесурсов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("СтраницаСменыПароля"		, "https://auth.kontur.ru/recover");
	Результат.Вставить("СтраницаОбратногоЗвонка"	, "https://www.diadoc.ru/support#callback");
	Результат.Вставить("СтраницаЗаявкаНаМодуль1С"	, "https://www.diadoc.ru/order1c?comment=модуль_1C_8_2_и_8_3");
	Результат.Вставить("СправкаУстановкаСертификата", "https://www.kontur-extern.ru/support/faq/34/62");   
	Результат.Вставить("ПортальнаяАвторизация"		, "https://auth.kontur.ru/");
	Результат.Вставить("СтраницаДиагностики"		, "https://help.kontur.ru/diadoc");
	Результат.Вставить("ОнлайнКонсультант"			, "https://api.kontur.ru/chat-widget");
	Результат.Вставить("УдаленноеПодключение"		, "https://help.kontur.ru/vnc");
	Результат.Вставить("ИсторияОбновленийБезШапки"	, "https://support.kontur.ru/1s/41563-informaciya_ob_obnovleniyax_modulya_diadok_dlya_1s");
	Результат.Вставить("ИсторияОбновленийСшапкой"	, "https://support.kontur.ru/1s/41564-informaciya_ob_obnovleniyax_modulya_diadok_dlya_1s");
	Результат.Вставить("СтраницаКонтурВзаиморасчеты", "https://kontur.ru/akt-sverki");
	
	Результат.Вставить("АдресФайлаVersionDD"		, "https://diadoc-api.kontur.ru/1c-addin/versionDD.xml");
	
	Результат.Вставить("ПриказОбУтвержденииФормата820", "https://normativ.kontur.ru/document?moduleId=1&documentId=328588");
	Результат.Вставить("ПриказОбУтвержденииФормата736", "https://normativ.kontur.ru/document?moduleId=1&documentId=375857");
	Результат.Вставить("ПриказОбУтвержденииФормата189", "https://normativ.kontur.ru/document?moduleId=1&documentId=339567");
	
	Результат.Вставить("Инструкция_СтартоваяСтраница"		, "https://support.kontur.ru/pages/viewpage.action?pageId=83864647");
	Результат.Вставить("Инструкция_ПараметрыОтправки"		, "https://support.kontur.ru/pages/viewpage.action?pageId=83864675");
	Результат.Вставить("Инструкция_ПереотправкаДокуметов"	, "https://support.kontur.ru/pages/viewpage.action?pageId=83864711");
	Результат.Вставить("Инструкция_НетДокументовНаОтправку"	, "https://support.kontur.ru/pages/viewpage.action?pageId=83864689");
	Результат.Вставить("Инструкция_КакЗаполнитьОснованиеУПД", "https://support.kontur.ru/pages/viewpage.action?pageId=83864682");
	Результат.Вставить("Инструкция_ЗаполнитьДолжностьСотрудника", "https://support.kontur.ru/pages/viewpage.action?pageId=83854208");
	Результат.Вставить("Инструкция_КакЗаполнитьГТД"			, "https://support.kontur.ru/pages/viewpage.action?pageId=83864679");
	Результат.Вставить("Инструкция_ИспользоватьСервисКонтурМаркировка", "https://support.kontur.ru/pages/viewpage.action?pageId=83864699");
	
	Результат.Вставить("АдресСервисаДиадок", АдресАпи());
	Результат.Вставить("СтраницаФайловВнешнейКомпоненты", "https://diadoc-api.kontur.ru/1c-addin");
	
	Результат.Вставить("МЧДПодробнееОбИзменениях"				, "https://www.diadoc.ru/blog/21927-kak_popravki_v_63_fz_povliyayut_na_biznes_processy_kompanij_v_2022_godu");		
	Результат.Вставить("МЧДВыпуститьНовую"						, "https://support.kontur.ru/pages/viewpage.action?pageId=83872873");
	Результат.Вставить("МЧДЗагрузитьВВебе"						, "https://support.kontur.ru/pages/viewpage.action?pageId=83872848");
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыВПФ(ИдентификаторВПФ) Экспорт
	
	КэшПараметровВПФ = ЭДО_Кэш_Прочитать("КэшПараметровВПФ");
	
	Если КэшПараметровВПФ = Неопределено Тогда
		КэшПараметровВПФ = Новый Соответствие;
		ЭДО_Кэш_Поместить("КэшПараметровВПФ", КэшПараметровВПФ);
	КонецЕсли;
	
	Результат = КэшПараметровВПФ[ИдентификаторВПФ];
	
	Если Результат = Неопределено Тогда
		Результат = Новый Структура("ВнешняяОбработка, ДополнительныеПараметры, НомерВПФ");
		КэшПараметровВПФ.Вставить(ИдентификаторВПФ, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СброситьКэшПараметровВПФ() Экспорт
	
	ЭДО_Кэш_Поместить("КэшПараметровВПФ", Неопределено);
	
КонецПроцедуры

//} ОБЩИЕ ПРОЦЕДУРЫ И ФУНКУЦИИ

//{ РАБОТА С СЕРВЕРОМ ДИАДОК

Функция РаботаССерверомДиадок_ПолучитьСтруктуруОшибкиВнешнейКомпоненты(Подробности) Экспорт
	Возврат Модуль_РаботаССерверомДиадок.ПолучитьСтруктуруОшибкиВнешнейКомпоненты(Подробности);
КонецФункции

Функция РаботаССерверомДиадок_ПолучитьDepartment(Organization, DepartmentKpp) Экспорт
	Возврат Модуль_РаботаССерверомДиадок.ПолучитьDepartment(Organization, DepartmentKpp);
КонецФункции

//} РАБОТА С СЕРВЕРОМ ДИАДОК


//{ Модуль_Диадок_РаботаСКонтентом

//{ОБЩИЕ ФУНКЦИИ

// Возвращает дату, после которой не рекомендуется отправка счета-факутры в формате 93@
// 
// Возвращаемое значение:
//  Дата
//
Функция ДатаПрекращенияДействияСчетаФактуры93() Экспорт
	
	Результат = '20170701';
	
	Возврат Результат;
	
КонецФункции

// Возвращает дату, после которой не рекомендуется отправка УПД в формате 155@
// 
// Возвращаемое значение:
//  Дата
//
Функция ДатаПрекращенияДействияУПД155() Экспорт
	
	Результат = '20200101';
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение настройки организации "ВыводитьНаименованиеТовараСКодами" из контекста
//
// Параметры:
//	BoxID_или_Организация1С - Строка - BoxID ящика;
//							- СправочникСсылка.Организации - организация 1С
// 
// Возвращаемое значение:
//  Булево
//
Функция ТребуетсяВыводитьНаименованиеТовараСКодами(BoxID_или_Организация1С) Экспорт
	
	Возврат Модуль_РаботаССерверомДиадок().ДанныеКонтекстаДиадок(BoxID_или_Организация1С, "ВыводитьНаименованиеТовараСКодами");
	
КонецФункции

Процедура Дополнить_StructedAdditionalInfos_ДопСведениями(StructedAdditionalInfos, ДопСведения) Экспорт
	
	МассивДопСведений = Преобразование_СтрокуВМассивПодстрок(ДопСведения, ";", Истина);
	
	Для Каждого ДопСведение Из МассивДопСведений Цикл
		
		ПозицияРазделителя = Найти(ДопСведение, "=");
		
		Если ПозицияРазделителя > 0 Тогда
			
			_Key	= Лев(ДопСведение,  ПозицияРазделителя - 1);
			_Value	= Сред(ДопСведение, ПозицияРазделителя + 1);
			
			Если НЕ ПустаяСтрока(_Key) И НЕ ПустаяСтрока(_Value) Тогда
				StructedAdditionalInfos.Добавить(Новый Структура("Key, Value", СокрЛП(_Key), СокрЛП(_Value)));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция ДобавитьРазделитель(Стр, Префикс = "") 
	Возврат ?(ЗначениеЗаполнено(стр), Префикс + сокрЛП(Стр) + ", ", "");
КонецФункции

Функция ЭтоСлужебноеСвойствоСтруктурыКонтента(Знач ИмяСвойства)
	
	СлужебныеСвойства = Новый Массив;
	СлужебныеСвойства.Добавить(ВРег(ИмяСвойстваСлужебнаяИнформация())); // зарезервированное свойство для передачи произвольных данных в структуру контента
	СлужебныеСвойства.Добавить("ОШИБКИВДАННЫХ"); // ошибки валидации, найденные на этапе сбора контента
	СлужебныеСвойства.Добавить("ССЫЛКАНАЕИ"); // зарезервированное имя свойства для проверки единицы измерения
	СлужебныеСвойства.Добавить("ССЫЛКА"); // для обратной совместимости
	СлужебныеСвойства.Добавить("КОНСТРУКТОРЫ");
	
	Результат = (СлужебныеСвойства.Найти(ВРег(ИмяСвойства)) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьContentПоСтруктуре(content, СтруктураДанных, описаниеСтруктурыДанных = "") Экспорт
	
	Если ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда 
		
		Для Каждого Элемент Из СтруктураДанных Цикл 
			
			Если ЭтоСлужебноеСвойствоСтруктурыКонтента(Элемент.Ключ)
				Или Элемент.Значение = Неопределено Тогда
				// Исключаем неинициализированные и служебные свойства
				Продолжить;
			КонецЕсли;
			
			Если (Элемент.ключ = "Totals")
				Или (Элемент.ключ = "TotalGrossQuantity")
				Или (Элемент.ключ = "TotalParcelsQuantity")
				Или (Элемент.ключ = "TotalSum") Тогда
				// итоги не инициализируем в объекте
			ИначеЕсли типЗнч(Элемент.значение) = тип("Структура") Тогда 
				Попытка
					ЭлементКонтента = content[Элемент.ключ];
				Исключение
					ВызватьИсключение("Не удается инициализировать реквизит " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
				КонецПопытки;
				ЗаполнитьContentПоСтруктуре(ЭлементКонтента, Элемент.Значение, описаниеСтруктурыДанных + "." + Элемент.ключ);
			ИначеЕсли Элемент.ключ = "Items" Тогда 
				Для Каждого стр Из СтруктураДанных.items Цикл 
					Попытка 
						item = content.addItem();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(item, стр, описаниеСтруктурыДанных + ".Items");
				КонецЦикла;
			ИначеЕсли Элемент.ключ = "PaymentDocuments" Тогда 
				Для Каждого стр Из СтруктураДанных.PaymentDocuments Цикл 
					Попытка 
						PaymentDocument = content.addPaymentDocument();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(PaymentDocument, стр, описаниеСтруктурыДанных + ".PaymentDocuments");
				КонецЦикла;
			ИначеЕсли Элемент.ключ = "StructedAdditionalInfos" Тогда
				Для Каждого стр Из СтруктураДанных.StructedAdditionalInfos Цикл
					Попытка 
						AdditionalInfo = content.addStructedAdditionalInfo();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(AdditionalInfo, стр, описаниеСтруктурыДанных + ".StructedAdditionalInfos");
				КонецЦикла;	
			ИначеЕсли Элемент.ключ = "OriginalInvoices" Тогда 
				Для Каждого стр Из СтруктураДанных.OriginalInvoices Цикл 
					Попытка 
						OriginalInvoice = content.addOriginalInvoice();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(OriginalInvoice, стр, описаниеСтруктурыДанных + ".OriginalInvoices");
				КонецЦикла;	
			ИначеЕсли Элемент.ключ = "AdditionalInfoId" И ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
				Для каждого стр Из СтруктураДанных.AdditionalInfoId.StructedAdditionalInfos Цикл
					Попытка 
						AdditionalInfo = content.AdditionalInfoId.addStructedAdditionalInfo();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(AdditionalInfo, стр, описаниеСтруктурыДанных + ".StructedAdditionalInfos");
				КонецЦикла;	
			ИначеЕсли Элемент.ключ = "TransferBases" Тогда
				Для Каждого стр Из СтруктураДанных.TransferBases Цикл
					Попытка 
						TransferBase = content.addTransferBase();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(TransferBase, стр, описаниеСтруктурыДанных + ".TransferBases");
				КонецЦикла;	
			ИначеЕсли Элемент.ключ = "Waybills" Тогда
				Для Каждого стр Из СтруктураДанных.Waybills Цикл
					Попытка 
						Waybill = content.addWaybill();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(Waybill, стр, описаниеСтруктурыДанных + ".Waybills");
				КонецЦикла;	
			ИначеЕсли Элемент.ключ = "Invoices" Тогда
				Для каждого стр Из СтруктураДанных.Invoices Цикл
					Попытка 
						Invoice = content.addInvoice();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(Invoice, стр, описаниеСтруктурыДанных + ".Invoices");
				КонецЦикла;
			ИначеЕсли Элемент.ключ = "CorrectionBases" Тогда
				Для каждого стр Из СтруктураДанных.CorrectionBases Цикл
					Попытка 
						CorrectionBase = content.addCorrectionBase();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки() );
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(CorrectionBase, стр, описаниеСтруктурыДанных + ".CorrectionBases");
				КонецЦикла;
			ИначеЕсли Элемент.ключ = "Signers" Тогда
				Для каждого стр Из СтруктураДанных.Signers Цикл
					Попытка 
						Signer = content.addSigner();  
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки() );
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(Signer, стр, описаниеСтруктурыДанных + ".Signers");
				КонецЦикла;	
			ИначеЕсли (Найти(Элемент.ключ, "Ссылка") = 0) И (Элемент.Значение <> Неопределено) Тогда
				Попытка
					content[Элемент.ключ] =  ?(типЗнч(Элемент.Значение) = Тип("Строка"), СокрЛП(Элемент.Значение), Элемент.Значение);
				Исключение
					ВызватьИсключение("Не удается инициализировать реквизит " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки() );
				КонецПопытки
			КонецЕсли;
		КонецЦикла;	
	Иначе // это строка таблицы
		Для каждого колонка Из СтруктураДанных.владелец().колонки Цикл 
			
			ИмяКолонки = Колонка.Имя;
			Если ЭтоСлужебноеСвойствоСтруктурыКонтента(ИмяКолонки)
				Или СтруктураДанных[ИмяКолонки] = Неопределено Тогда
				// Исключаем неинициализированные и служебные свойства
				Продолжить;
			КонецЕсли;
			
			Если (колонка.Имя = "OriginalValues") Или (колонка.Имя = "CorrectedValues")
				Или (колонка.имя = "AmountsDec") Или (колонка.имя = "AmountsInc") Тогда
				Попытка
					ЭлементКонтента = content[колонка.Имя];
				Исключение
					ВызватьИсключение("Не удается инициализировать реквизит " + колонка.Имя + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
				КонецПопытки;
				ЗаполнитьContentПоСтруктуре(ЭлементКонтента, СтруктураДанных[колонка.имя], описаниеСтруктурыДанных + "." + колонка.имя);
				
			ИначеЕсли Колонка.Имя = "StructedAdditionalInfos" Тогда
				Для каждого стр Из СтруктураДанных.StructedAdditionalInfos Цикл
					Попытка 
						StructedAdditionalInfos = content.addStructedAdditionalInfo();
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Колонка.Имя + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(StructedAdditionalInfos, стр, описаниеСтруктурыДанных + ".StructedAdditionalInfos");
				КонецЦикла;
			ИначеЕсли Колонка.Имя = "CustomDeclarations" И СтруктураДанных.CustomDeclarations <> Неопределено Тогда
				Для каждого стр Из СтруктураДанных.CustomDeclarations Цикл
					Попытка 
						CustomDeclaration = content.addCustomDeclaration();
					Исключение 	
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Колонка.Имя + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(CustomDeclaration, стр, описаниеСтруктурыДанных + ".CustomDeclarations");
				КонецЦикла;
			ИначеЕсли Колонка.Имя = "InvoiceRevisions" И СтруктураДанных.InvoiceRevisions <> Неопределено Тогда
				Для каждого стр Из СтруктураДанных.InvoiceRevisions Цикл
					Попытка 
						InvoiceRevision = content.addInvoiceRevision();
					Исключение
						ВызватьИсключение("Не удается добавить элемент в коллекцию " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(InvoiceRevision, стр, описаниеСтруктурыДанных + ".InvoiceRevisions");
				КонецЦикла;
			ИначеЕсли ТипЗнч(СтруктураДанных[колонка.имя]) = Тип("Структура") Тогда
				Если Найти(колонка.имя, ИмяСвойстваСлужебнаяИнформация()) = 0 Тогда
					Попытка
						ЭлементКонтента = content[колонка.имя];
					Исключение
						ВызватьИсключение("Не удается инициализировать реквизит " + Элемент.ключ + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
					КонецПопытки;
					ЗаполнитьContentПоСтруктуре(ЭлементКонтента, СтруктураДанных[колонка.имя], описаниеСтруктурыДанных + "." + колонка.имя);
				КонецЕсли;
			ИначеЕсли (Найти(колонка.имя, "Ссылка") = 0) И (СтруктураДанных[колонка.имя] <> Неопределено) Тогда
				Попытка
					content[колонка.Имя] = ?(ТипЗнч(СтруктураДанных[колонка.имя]) = Тип("Строка"), СокрЛП(СтруктураДанных[колонка.имя]), СтруктураДанных[колонка.имя]);
				Исключение
					ВызватьИсключение("Не удается инициализировать реквизит " + колонка.имя + " для объекта " + описаниеСтруктурыДанных + " по причине: " + ОписаниеОшибки());
				КонецПопытки
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПоКонтенту(Content, СтруктураДанных, ТипКонтента = "") Экспорт
	
	Перем Конструкторы;
	
	Если Content = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	СтруктураДанных.Свойство("Конструкторы", Конструкторы);
	СтруктураДанных.Удалить("Конструкторы");
	
	ЗаполнитьСтруктуруПоКонтентуРекурсивно(Content, СтруктураДанных, ТипКонтента, Конструкторы);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПоКонтентуРекурсивно(Content, СтруктураДанных, ПолноеИмяРодителя, Конструкторы)
	
	Если Content = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
			
			Ключ = Элемент.Ключ;
			
			ПолноеИмя = ПолноеИмяРодителя + "." + Ключ;
			
			Конструктор = Конструктор(ПолноеИмя, Конструкторы);
			Если Конструктор <> Неопределено Тогда
				СтруктураДанных[Ключ] = НовыйЭлементContent(Ключ, Конструктор, Конструкторы, ПолноеИмяРодителя);
			КонецЕсли;
			
			ТипЭлемента= ТипЗнч(СтруктураДанных[Ключ]);
			
			Если ТипЭлемента = Тип("Структура") Тогда 
				
				ЗаполнитьСтруктуруПоКонтентуРекурсивно(ЭлементКонтента(Content, Ключ, ПолноеИмя), СтруктураДанных[Ключ], ПолноеИмя, Конструкторы);
				
			ИначеЕсли ТипЭлемента = Тип("ТаблицаЗначений") ИЛИ ТипЭлемента = Тип("Массив") Тогда 
				
				ЗаполнитьКоллекциюЭлементаСтруктурыПоКонтенту(Content[Ключ], СтруктураДанных[Ключ], Ключ, ПолноеИмяРодителя, Конструкторы)
				
			ИначеЕсли Найти(Ключ, "Ссылка") = 0 Тогда
				
				СтруктураДанных[Ключ] = ЭлементКонтента(Content, Ключ, ПолноеИмя);
				
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе // Строка таблицы значений
		
		ТаблицаЗначений= СтруктураДанных.Владелец();
		
		Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			
			Ключ = Колонка.Имя;
			
			ПолноеИмя = ПолноеИмяРодителя + "." + Ключ;
			
			Конструктор = Конструктор(ПолноеИмя, Конструкторы);
			Если Конструктор <> Неопределено Тогда
				СтруктураДанных[Ключ] = НовыйЭлементContent(Ключ, Конструктор, Конструкторы, ПолноеИмяРодителя);
			КонецЕсли;
			
			ТипЭлемента = ТипЗнч(СтруктураДанных[Ключ]);
			
			Если ТипЭлемента = Тип("Структура") Тогда 
				
				ЗаполнитьСтруктуруПоКонтентуРекурсивно(ЭлементКонтента(Content, Ключ, ПолноеИмя), СтруктураДанных[Ключ], ПолноеИмя, Конструкторы);
				
			ИначеЕсли ТипЭлемента = Тип("ТаблицаЗначений") ИЛИ ТипЭлемента = Тип("Массив") Тогда 
				
				ЗаполнитьКоллекциюЭлементаСтруктурыПоКонтенту(ЭлементКонтента(Content, Ключ, ПолноеИмя), СтруктураДанных[Ключ], Ключ, ПолноеИмяРодителя, Конструкторы)
				
			ИначеЕсли Найти(Ключ, "Ссылка") = 0 И Найти(Ключ, ИмяСвойстваСлужебнаяИнформация()) = 0 Тогда   
				
				СтруктураДанных[Ключ] = ЭлементКонтента(Content, Ключ, ПолноеИмя);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ЭлементКонтента(Content, Ключ, ПолноеИмя)
	
	Попытка
		Возврат Content[Ключ];
	Исключение
		ВызватьИсключение("Ошибка чтения """ + ПолноеИмя + """: " + ОписаниеОшибки());
	КонецПопытки
	
КонецФункции

Процедура ЗаполнитьКоллекциюЭлементаСтруктурыПоКонтенту(Content, Коллекция, Ключ, ПолноеИмяРодителя, Конструкторы)
	
	ТипКоллекцииТаблицаЗначений = ТипЗнч(Коллекция) = Тип("ТаблицаЗначений");
	
	ПолноеИмя = ПолноеИмяРодителя + "." + Ключ;
	
	ВГраница = Content.Count - 1;
	Для ИндексЦикла = 0 По ВГраница Цикл
		
		Попытка 
			ЭлементContent = Content.GetItem(ИндексЦикла);
		Исключение 	
			ВызватьИсключение("Ошибка чтения коллекции """ + ПолноеИмя + """: " + ОписаниеОшибки());
		КонецПопытки;
		
		Если ТипКоллекцииТаблицаЗначений Тогда
			
			НовыйЭлемент = Коллекция.Добавить();
			
			ЗаполнитьСтруктуруПоКонтентуРекурсивно(ЭлементContent, НовыйЭлемент, ПолноеИмя, Конструкторы);
			
		Иначе // Массив
			
			Конструктор = Конструктор(ПолноеИмя + ".Item", Конструкторы);
			
			Если Конструктор <> Неопределено Тогда
				
				НовыйЭлемент = НовыйЭлементContent(Ключ, Конструктор, Конструкторы, ПолноеИмяРодителя);
				
				ЗаполнитьСтруктуруПоКонтентуРекурсивно(ЭлементContent, НовыйЭлемент, ПолноеИмя, Конструкторы);
				
				Коллекция.Добавить(НовыйЭлемент);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьДанныеОПодписях(Document, Content, BuyerContent) Экспорт
	
	Подписи = ИнициализироватьСтруктуруДанныхПодписей();
	
	Подписи.DocumentMetaData.DocumentID			   = Document.DocumentID;
	Подписи.DocumentMetaData.TimeStamp  		   = Document.TimeStamp;
	Подписи.DocumentMetaData.SenderSignatureStatus = Document.SenderSignatureStatus;
	
	SenderSignature = Document.GetSenderSignature();
	Если SenderSignature <> Неопределено Тогда
		Подписи.DocumentMetaData.SenderName = SenderSignature.Certificate.OrganizationName;
	КонецЕсли;
	
	RecipientSignature = Document.GetRecipientSignature();
	Если RecipientSignature <> Неопределено Тогда
		Подписи.DocumentMetaData.RecipientName = RecipientSignature.Certificate.OrganizationName;
	КонецЕсли;
	
	Если Content.Свойство("Signer") Тогда
		Подписи.SellerSigner = Content.Signer;
	ИначеЕсли Content.Свойство("Signers") И ЗначениеЗаполнено(Content.Signers) Тогда
		Подписи.SellerSigner = Content.Signers[0].SignerDetails;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(BuyerContent) Тогда
		
		Если BuyerContent.Свойство("Signer") Тогда
			Подписи.BuyerSigner = BuyerContent.Signer;
		ИначеЕсли BuyerContent.Свойство("Signers") И ЗначениеЗаполнено(BuyerContent.Signers) Тогда
			Подписи.BuyerSigner = BuyerContent.Signers[0].SignerDetails;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьСтруктуруПоКонтенту(Document.GetSenderSignature()	 , Подписи.SenderSignature);
	ЗаполнитьСтруктуруПоКонтенту(Document.GetRecipientSignature(), Подписи.RecipientSignature);
	
	Возврат Подписи;
	
КонецФункции	

Функция ИнициализироватьСтруктуруДанныхПодписей()
	
	Результат =	Новый Структура("SellerSigner, BuyerSigner, SenderSignature, RecipientSignature, DocumentMetaData");
	
	Результат.SellerSigner =		  Новый_Signer();
	Результат.BuyerSigner =		  Новый_Signer();
	Результат.SenderSignature =	  Новый_Signature();
	Результат.RecipientSignature = Новый_Signature();
	Результат.DocumentMetaData =   Новый Структура("Timestamp, DocumentID, SenderSignatureStatus, SenderName, RecipientName");
	
	Возврат Результат;
	
КонецФункции

Функция ВизуализироватьДопПоля(нечто) Экспорт
	
	Если ТипЗнч(нечто) = ОдинСАдаптер_Документы_ПолучитьТипСправочникаОрганизации() Тогда
		Организация = нечто;
		BoxId = Модуль_Данные1С_СвязиОбъектов().Организация_2_BoxID(Организация)
	Иначе 
		Document = нечто;
		BoxId = ?(Document.Direction = "Inbound", Document.Counteragent.id, Document.Organization.Id);
	КонецЕсли;
	
	СписокОрганизацийНеТребующихВизуализацииДопПоля = ВернутьСписокОрганизацийНеТребующихВизуализацииДопПоля();
	Если (ЗначениеЗаполнено(BoxId))
		И (СписокОрганизацийНеТребующихВизуализацииДопПоля.НайтиПоЗначению(BoxId) <> Неопределено) Тогда 
		Возврат Ложь
	Иначе 
		Возврат Истина;
	КонецЕсли;	
КонецФункции

Функция НовыйContent(Имя) Экспорт
	
	Конструкторы = Новый Соответствие;
	
	Content = Вычислить("Новый_" + Имя + "(""" + Имя + """, Конструкторы)");
	
	Если ЗначениеЗаполнено(Конструкторы) Тогда
		Content.Вставить("Конструкторы", Конструкторы);
	КонецЕсли;
	
	Возврат Content;
	
КонецФункции

Функция НовыйЭлементContent(ИмяЭлемента, Конструктор, Конструкторы= Неопределено, Родитель= "")
	
	Возврат Вычислить(Конструктор + "(""" + Родитель + "." + ИмяЭлемента + """, Конструкторы)");
	
КонецФункции

Процедура ДобавитьКонструктор(ИмяЭлемента, Конструктор, Конструкторы, Родитель = "", КонструкторЭлементов = "")
	
	Если ЗначениеЗаполнено(ИмяЭлемента) И Конструкторы <> Неопределено Тогда
		
		Конструкторы.Вставить(Родитель + "." + ИмяЭлемента, Конструктор);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКонструкторЭлементаМассива(Конструктор, Конструкторы, ПолноеИмя)
	
	Если Конструкторы <> Неопределено Тогда
		
		Конструкторы.Вставить(ПолноеИмя + ".Item", Конструктор);
		
	КонецЕсли;
	
КонецПроцедуры

Функция Конструктор(Ключ, Конструкторы)
	
	Если Конструкторы <> Неопределено Тогда
		
		Возврат Конструкторы[Ключ];
		
	КонецЕсли;
	
КонецФункции

Функция Значение1C_В_СтрокаCOM(Значение1С, ФорматнаяСтрока= "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение1С) Тогда
		Возврат "";
	ИначеЕсли НЕ ПустаяСтрока(ФорматнаяСтрока) Тогда
		Возврат Формат(Значение1С, ФорматнаяСтрока);
	Иначе
		Возврат СокрЛП(Значение1С);
	КонецЕсли;
	
КонецФункции

Функция СформироватьПредставлениеАдресаПоContent(AddressContent) Экспорт 
	
	Результат = "";
	
	Если AddressContent.IsForeign = Ложь И ЗначениеЗаполнено(AddressContent.RegionCode) = Истина Тогда
		
		КодРегиона 	= AddressContent.RegionCode;
		Индекс 		= AddressContent.ZipCode;
		Район 		= AddressContent.Territory;
		Город 		= AddressContent.City;
		НаселПункт  = AddressContent.Locality;
		Улица       = AddressContent.Street;
		Дом         = AddressContent.Building;
		Корпус      = AddressContent.Block;
		Кварт       = AddressContent.Apartment;
		
		ПредставлениеАдреса = ДобавитьРазделитель(Индекс) + ДобавитьРазделитель(НаименованиеРегиона(КодРегиона)) + ДобавитьРазделитель(Район) +
		ДобавитьРазделитель(Город) + ДобавитьРазделитель(НаселПункт) + ДобавитьРазделитель(Улица) +
		ДобавитьРазделитель(Дом, "дом №") + ДобавитьРазделитель(Корпус, "корпус ") + ДобавитьРазделитель(Кварт, "кв ");
		
		Результат = Лев(ПредставлениеАдреса, СтрДлина(ПредставлениеАдреса) - 2);
		
	ИначеЕсли ЗначениеЗаполнено(AddressContent.AddressText) = Истина Тогда
		НаименованиеСтраны = НаименованиеСтраны(AddressContent.CountryCode);
		Результат = ?(ЗначениеЗаполнено(НаименованиеСтраны), НаименованиеСтраны, Строка(AddressContent.CountryCode)) + ", " + AddressContent.AddressText; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция СформироватьПредставлениеИННКПП(Inn, Kpp) Экспорт
	
	Если ЗначениеЗаполнено(Kpp) Тогда
		Возврат "ИНН/КПП: " + Inn + "/" + Kpp;
	ИначеЕсли ЗначениеЗаполнено(inn) Тогда
		Возврат "ИНН: " + Inn;
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеИННКПП(CounteragentContent) Экспорт
	ИНН =   CounteragentContent.inn;
	КПП =   CounteragentContent.kpp;
	Если стрДлина(ИНН) = 10 Тогда
		Возврат ?(ЗначениеЗаполнено(ИНН), ИНН, "-") + "/" + ?(ЗначениеЗаполнено(КПП), КПП, "-");
	Иначе 
		Возврат ?(ЗначениеЗаполнено(ИНН), ИНН, "-") + "/-";
	КонецЕсли;
КонецФункции	

Функция ПротоКонтентДокумента(Document) Экспорт
	
	КэшКонтента = КэшПротоКонтентаДокумента(Document.OrganizationId, Document.DocumentId);
	
	Если КэшКонтента.ПротоКонтент = Неопределено Тогда
		
		ФайлXML = Модуль_РаботаССерверомДиадок().ПолучитьФайлТитулаПродавца(Document);
		
		ГенерацияXML = МодульГенерацияXML();
		КэшКонтента.ПротоКонтент = ГенерацияXML.XML_В_ProtoСтруктура(ФайлXML);
		
	КонецЕсли;
	
	Возврат КэшКонтента.ПротоКонтент;
	
КонецФункции

Функция ПротоКонтентОтветногоТитулаДокумента(Document) Экспорт
	
	КэшКонтента = КэшПротоКонтентаДокумента(Document.OrganizationId, Document.DocumentId);
	
	Если КэшКонтента.ПротоКонтентОтветногоТитула = Неопределено Тогда
		
		ФайлXML = Модуль_РаботаССерверомДиадок().ПолучитьФайлТитулаПокупателя(Document);
		
		Если ЗначениеЗаполнено(ФайлXML) Тогда
			ГенерацияXML = МодульГенерацияXML();
			КэшКонтента.ПротоКонтентОтветногоТитула = ГенерацияXML.XML_В_ProtoСтруктура(ФайлXML);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КэшКонтента.ПротоКонтентОтветногоТитула;
	
КонецФункции

Функция СформироватьОтветныйТитулДокумента(Document, ПротоКонтент) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	
	ВсеБазовыеФорматы = БазовыеФорматы();
	
	ФорматЭД = ФорматЭлектронногоДокумента(Document);
	
	БазовыйФормат = ФорматЭД.БазовыйФормат;
	
	ТипКонтента = ФорматЭД.ТипКонтента;
	ТипКонтента = СтрЗаменить(ТипКонтента, "SellerContent", "BuyerContent");
	ТипКонтента = СтрЗаменить(ТипКонтента, "SenderTitle", "RecipientTitle");
	
	ФайлТитулаПродавца	 = Модуль_РаботаССерверомДиадок.ПолучитьФайлТитулаПродавца(Document);
	ФайлПодписиПродавца	 = Модуль_РаботаССерверомДиадок.ПолучитьФайлПодписиПродавца(Document);
	
	ПротоКонтентXDTO			 = ГенерацияXML.ПротоКонтент_В_ПротоКонтентXDTO(ПротоКонтент, ТипКонтента);
	ПараметрыФормированияФайла	 = ГенерацияXML.XML_ПараметрыФормированияФайла();
	
	Если БазовыйФормат = ВсеБазовыеФорматы.utd820 Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_УПД_820(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ФайлПодписиПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.utd Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_УПД_155(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ФайлПодписиПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.ucd736 Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_УКД_736(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ФайлПодписиПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.ucd Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_УКД(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ФайлПодписиПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.tovtorg Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_Торг_551(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ФайлПодписиПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.rezru Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_Акт_552(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ФайлПодписиПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.torg12 Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_Торг_172(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.act Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_Акт_172(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ПараметрыФормированияФайла);
		
	ИначеЕсли БазовыйФормат = ВсеБазовыеФорматы.torg2 Тогда
		
		ОбъектXDTO = ГенерацияXML.XML_ОтветныйТитул_Торг2(ПротоКонтентXDTO
		, ФайлТитулаПродавца, ФайлПодписиПродавца, ПараметрыФормированияФайла);
		
	Иначе
		
		ШаблонСтроки = НСтр("ru = 'Ошибка заполнения титула покупателя, неизвестный тип контента %1'");
		ТекстОшибки = ПодставитьПараметрыВСтроку(ШаблонСтроки, ТипКонтента);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = ГенерацияXML.ОбъектXDTO_В_ДвоичныеДанные(ОбъектXDTO);
	
	Возврат Результат;
	
КонецФункции

Функция КэшПротоКонтентаДокумента(BoxID, DocumentId)
	
	МаксимальныйРазмерКэша = 100;
	
	КэшПротоКонтента = ЭДО_Кэш_Прочитать("КэшПротоКонтента");
	
	Если КэшПротоКонтента = Неопределено Тогда
		
		КэшПротоКонтента = Новый Структура;
		КэшПротоКонтента.Вставить("МассивКлючей", Новый Массив);
		КэшПротоКонтента.Вставить("Соответствие", Новый Соответствие);
		
		ЭДО_Кэш_Поместить("КэшПротоКонтента", КэшПротоКонтента);
		
	КонецЕсли;
	
	Ключ = BoxID + DocumentId;
	Результат = КэшПротоКонтента.Соответствие[Ключ];
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ПротоКонтент");
		Результат.Вставить("ПротоКонтентОтветногоТитула");
		
		Если КэшПротоКонтента.МассивКлючей.Количество() = МаксимальныйРазмерКэша Тогда
			КэшПротоКонтента.Соответствие.Удалить(КэшПротоКонтента.МассивКлючей[0]);
			КэшПротоКонтента.МассивКлючей.Удалить(0);
		КонецЕсли;
		
		КэшПротоКонтента.Соответствие.Вставить(Ключ, Результат);
		КэшПротоКонтента.МассивКлючей.Добавить(Ключ);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОформитьОшибкиВHTML(СписокОшибок, ЗаголовокОшибки = "") Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.ОформитьОшибкиВHTML(СписокОшибок, ЗаголовокОшибки);
	Возврат Результат;
	
КонецФункции

Функция СписокОшибокВСтрокуXml(ДокументСсылка, СписокОшибок) Экспорт
	
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("СписокОшибок"		, СписокОшибок);
	СтруктураОшибки.Вставить("ДокументСсылка"	, ДокументСсылка);
	
	Результат = СериализоватьДанные(СтруктураОшибки);
	
	Возврат Результат;
	
КонецФункции

// Проверяет заполнение значений на всех уровнях структуры
//
// Возвращаемое значение:
//  Булево - Истина, если хотя бы одно значение в структуре заполнено
Функция СтруктураКонтентаЗаполнена(СтруктураКонтента) Экспорт
	
	Результат = Ложь;
	
	Для каждого Элемент Из СтруктураКонтента Цикл
		
		Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда 
			
			Результат = СтруктураКонтентаЗаполнена(Элемент.Значение);
			
		Иначе
			
			Результат = ЗначениеЗаполнено(Элемент.Значение) И Элемент.Значение <> Ложь;
			
		КонецЕсли;
		
		Если Результат = Истина Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьСтруктуруАдреса(СтруктураАдреса) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.ПроверитьСтруктуруАдреса(СтруктураАдреса);
	Возврат Результат;
	
КонецФункции

// Возвращает COM-объект Document, соответствующий исходному документу, отправленному из ДокументСсылка.
// Возвращает Неопределено, если такой Document не найден.
Функция ПолучитьИсправляемыйDocument(ДокументСсылка)
	
	Результат = Неопределено;
	
	Докоснование =  Модуль_Интеграция.ПолучитьСФОснованиеДляИСФДиадок(ДокументССылка) ;
	Если НЕ ЗначениеЗаполнено(Докоснование) Тогда
		Возврат Результат; // "Отстутствует счет-фактура, который должен являться основанием данного документа.";
	КонецЕсли;
	
	docId =     Модуль_Данные1С_СвязиОбъектов().Документ_2_DocumentID(Докоснование);
	Если НЕ ЗначениеЗаполнено(DocId) Тогда 
		Возврат Результат; //"Первоначальный документ <a href=""СЧЕТФАКТУРАВЫДАННЫЙ:"+Докоснование.УникальныйИдентификатор()+"""a>"+ДокОснование+"</a> не передавался через Диадок"
	КонецЕсли;
	
	Organization = Модуль_РаботаССерверомДиадок.ПолучитьЯщикДиадокДляОрганизации(ДокументСсылка.Организация);
	Результат =  Organization.getDocumentById(docId);
	
	Возврат Результат;
	
КонецФункции	

Функция ПривестиКЧислу(н)
	
	Возврат ?(н = Неопределено, 0, н);
	
КонецФункции

Функция ИмяФайлаПечатнойФормы(ВидДокумента, НомерДокумента, ДатаДокумента, ФорматФайла)
	
	ДатаДокументаСтрокой = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	НормализованныйНомер = ЗаменитьНедопустимыеСимволы(НомерДокумента);
	
	Результат = ПодставитьПараметрыВСтроку("%1 №%2 от %3.%4"
	, ВидДокумента, НормализованныйНомер, ДатаДокументаСтрокой, ФорматФайла);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(НомерДокумента) Экспорт 
	
	Результат = НомерДокумента;
	
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(Результат, ТекСимвол) <> 0 Тогда
			Результат = СтрЗаменить(Результат, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеДанныхФайла(ТипДокумента) Экспорт
	
	Результат = Неопределено;
	
	Если ТипДокумента = "Nonformalized" Тогда
		
		Результат = Новый_Nonformalized();
		
	ИначеЕсли ТипДокумента = "PriceListAgreement" Тогда
		
		Результат = Новый_Nonformalized();
		Результат.NeedRecipientSignature = Истина;
		
	ИначеЕсли ТипДокумента = "CertificateRegistry" Тогда 
		
		Результат = Новый_Nonformalized();
		
	ИначеЕсли ТипДокумента = "ServiceDetails" Или ТипДокумента = "ReconciliationAct" Тогда
		
		Результат = Новый_ServiceDetails();
		
	ИначеЕсли ТипДокумента = "ProformaInvoice"
		Или ТипДокумента = "NonformalizedProforma" Тогда
		
		Результат = Новый_ProformaInvoice();
		
	ИначеЕсли ТипДокумента = "PriceList" Тогда
		
		Результат = Новый_PriceList();
		
	ИначеЕсли ТипДокумента = "AcceptanceCertificate" Тогда
		
		Результат = Новый_AcceptanceCertificate();
		
	ИначеЕсли ТипДокумента = "Contract" Тогда
		
		Результат = Новый_Contract();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеФорматаДляОтправкиФайла(DocumentType) Экспорт
	
	ТипыКонтента = ТипыКонтента();
	
	ТипДокумента = DocumentType;
	
	// Имя типа документа API не всегда совпадает с именем протообъекта
	Если ВРег(DocumentType) = ВРег("NonformalizedProforma") Тогда
		ТипДокумента = "ProformaInvoice";
	КонецЕсли;
	
	Результат = ОписаниеФорматаЭлектронногоДокумента(ТипДокумента, "default", "v1");
	
	Возврат Результат;
	
КонецФункции

// Возвращает зарезервированное имя свойства для передачи произвольных данных в структуру контента.
// Например, ссылки на источники, по которым сформирована структура контента,
// или любые иные сведения, определенные в событии ПМ "ПослеЗаполненияКонтента".
// 
// Возвращаемое значение:
//  Строка.
//
Функция ИмяСвойстваСлужебнаяИнформация() Экспорт
	
	Возврат "СлужебнаяИнформация";
	
КонецФункции

Функция ЗначениеВМассив(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		Результат.Добавить(Значение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Осуществляет поиск строк таблицы значений, отвечающих заданным условиям поиска, представленной в виде массива структур.
// Аналог метода ТаблицаЗначений.НайтиСтроки(<ПараметрыОтбора>)
//
// Параметры:
//  МассивСтруктур   - Массив   - Все элементы массива: структуры с одинаковым набором ключей.
//  ПараметрыОтбора   - Структура - Задает условия поиска: ключ структуры определяет имя свойства структуры массива,
//                                 по которой будет осуществляться поиск, а значение структуры - искомое значение.
//
// Возвращаемое значение:
//  Массив - содержит струтуры из массива, соответствующих условиям поиска.
//
Функция МассивСтруктур_НайтиСтроки(МассивСтруктур, ПараметрыОтбора) Экспорт
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(МассивСтруктур) Тогда
		
		Для Каждого Структура Из МассивСтруктур Цикл
			
			СтруктураСоответствуетОтбору = Истина;
			
			Для Каждого ЭлементОтбора Из ПараметрыОтбора Цикл
				
				Если Структура[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
					СтруктураСоответствуетОтбору = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтруктураСоответствуетОтбору Тогда
				Результат.Добавить(Структура);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив переданных параметров в порядке их расположения
// 
// Параметры:
//  Параметр0 - Произвольный - значение, которое будет добавлено в массив по индексу 0
//  Параметр1 - Произвольный - значение, которое будет добавлено в массив по индексу 1
//  Параметр2 - Произвольный - значение, которое будет добавлено в массив по индексу 2
//  Параметр3 - Произвольный - значение, которое будет добавлено в массив по индексу 3
//  Параметр4 - Произвольный - значение, которое будет добавлено в массив по индексу 4
//
// Возвращаемое значение:
//   Массив - массив переданных параметров.
//
Функция ПараметрыВМассив(Параметр0 = NULL
	, Параметр1 = NULL
	, Параметр2 = NULL
	, Параметр3 = NULL
	, Параметр4 = NULL) Экспорт
	
	Результат = Новый Массив(5);
	
	Результат[0] = Параметр0;
	Результат[1] = Параметр1;
	Результат[2] = Параметр2;
	Результат[3] = Параметр3;
	Результат[4] = Параметр4;
	
	Для Сч = -Результат.ВГраница() По 0 Цикл
		
		Если Результат[-Сч] = NULL Тогда
			Результат.Удалить(-Сч);
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//}ОБЩИЕ ФУНКЦИИ

//{ ФАЙЛЫ

Функция НовыеСвойстваФайла() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("ПолноеИмя");
	Результат.Вставить("РазмерВБайтах");
	Результат.Вставить("ДвоичныеДанные");
	
	Возврат Результат;
	
КонецФункции

//} ФАЙЛЫ

//{ФУНКЦИИ РАБОТЫ С ОБЩЕРОССИЙСКИМИ КЛАССИФИКАТОРАМИ

Процедура ДобавитьВТаблицуПересчета(ТаблицаПересчета, Код1, Наименование1, Код2, Наименование2, Коэффициент)
	
	стр =  ТаблицаПересчета.Добавить();
	Стр.Код1 			= Код1;
	Стр.Наименование1 	= Наименование1;
	Стр.Код2 			= Код2;
	Стр.Наименование2 	= Наименование2;
	Стр.Коэффициент		= Коэффициент;
	
КонецПроцедуры	

Функция ТаблицаПересчета()
	
	Результат = ЭДО_Кэш_Прочитать("ТаблицаПересчета");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Код1");
	Результат.Колонки.Добавить("Наименование1");
	Результат.Колонки.Добавить("Код2");
	Результат.Колонки.Добавить("Наименование2");
	Результат.Колонки.Добавить("Коэффициент");
	Результат.Колонки.Индекс(Результат.Колонки.Код1);
	Результат.Колонки.Индекс(Результат.Колонки.Код2);
	
	//длина
	ДобавитьВТаблицуПересчета(Результат, "009", "Мм", "008", "Км", 1000);
	ДобавитьВТаблицуПересчета(Результат, "009", "Мм", "006", "М" , 1000000);
	ДобавитьВТаблицуПересчета(Результат, "009", "Мм", "005", "Дм", 10000000);
	ДобавитьВТаблицуПересчета(Результат, "009", "Мм", "004", "См", 100000000);
	ДобавитьВТаблицуПересчета(Результат, "009", "Мм", "003", "мм", 1000000000);
	ДобавитьВТаблицуПересчета(Результат, "008", "Км", "006", "М" , 1000);
	ДобавитьВТаблицуПересчета(Результат, "008", "Км", "005", "Дм", 10000);
	ДобавитьВТаблицуПересчета(Результат, "008", "Км", "004", "См", 100000);
	ДобавитьВТаблицуПересчета(Результат, "008", "Км", "003", "мм", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "006", "М", "005", "Дм", 10);
	ДобавитьВТаблицуПересчета(Результат, "006", "М", "004", "См", 100);
	ДобавитьВТаблицуПересчета(Результат, "006", "М", "003", "мм", 1000);
	ДобавитьВТаблицуПересчета(Результат, "005", "Дм", "004", "См", 10);
	ДобавитьВТаблицуПересчета(Результат, "005", "Дм", "003", "мм", 100);
	ДобавитьВТаблицуПересчета(Результат, "004", "См", "003", "мм", 10);
	
	//прощадь
	ДобавитьВТаблицуПересчета(Результат, "061", "Км2", "059", "га", 100);
	ДобавитьВТаблицуПересчета(Результат, "061", "Км2", "058", "тыс м2", 1000);
	ДобавитьВТаблицуПересчета(Результат, "061", "Км2", "109", "ар", 10000);
	ДобавитьВТаблицуПересчета(Результат, "061", "Км2", "055", "м2", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "061", "Км2", "053", "дм2", 100000000);
	ДобавитьВТаблицуПересчета(Результат, "061", "Км2", "051", "см2", 10000000000);
	ДобавитьВТаблицуПересчета(Результат, "061", "Км2", "051", "мм2", 1000000000000);
	ДобавитьВТаблицуПересчета(Результат, "059", "га", "058", "тыс м2", 10);
	ДобавитьВТаблицуПересчета(Результат, "059", "га", "109", "ар", 100);
	ДобавитьВТаблицуПересчета(Результат, "059", "га", "055", "м2", 10000);
	ДобавитьВТаблицуПересчета(Результат, "059", "га", "053", "дм2", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "059", "га", "051", "см2", 100000000);
	ДобавитьВТаблицуПересчета(Результат, "059", "га", "051", "мм2", 10000000000);
	ДобавитьВТаблицуПересчета(Результат, "058", "тыс м2", "109", "ар", 10);
	ДобавитьВТаблицуПересчета(Результат, "058", "тыс м2", "055", "м2", 1000);
	ДобавитьВТаблицуПересчета(Результат, "058", "тыс м2", "053", "дм2", 100000);
	ДобавитьВТаблицуПересчета(Результат, "058", "тыс м2", "051", "см2", 10000000);
	ДобавитьВТаблицуПересчета(Результат, "058", "тыс м2", "051", "мм2", 1000000000);
	ДобавитьВТаблицуПересчета(Результат, "109", "ар", "055", "м2", 100);
	ДобавитьВТаблицуПересчета(Результат, "109", "ар", "053", "дм2", 10000);
	ДобавитьВТаблицуПересчета(Результат, "109", "ар", "051", "см2", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "109", "ар", "051", "мм2", 100000000);
	ДобавитьВТаблицуПересчета(Результат, "055", "м2", "053", "дм2", 100);
	ДобавитьВТаблицуПересчета(Результат, "055", "м2", "051", "см2", 10000);
	ДобавитьВТаблицуПересчета(Результат, "055", "м2", "051", "мм2", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "053", "дм2", "051", "см2", 100);
	ДобавитьВТаблицуПересчета(Результат, "053", "дм2", "051", "мм2", 10000);
	ДобавитьВТаблицуПересчета(Результат, "051", "см2", "051", "мм2", 100);
	
	//объем
	ДобавитьВТаблицуПересчета(Результат, "113", "м3", "112", "л", 1000);
	ДобавитьВТаблицуПересчета(Результат, "113", "м3", "111", "см3", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "113", "м3", "110", "мм3", 1000000000);
	ДобавитьВТаблицуПересчета(Результат, "112", "л" , "111", "см3", 1000);
	ДобавитьВТаблицуПересчета(Результат, "112", "л", "110", "мм3", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "111", "см3", "110", "мм3", 1000);
	
	//вес
	ДобавитьВТаблицуПересчета(Результат, "168", "тн", "206", "ц", 10);
	ДобавитьВТаблицуПересчета(Результат, "168", "тн", "166", "кг", 1000);
	ДобавитьВТаблицуПересчета(Результат, "168", "тн", "163", "г", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "168", "тн", "162", "кар", 5000000);
	ДобавитьВТаблицуПересчета(Результат, "168", "тн", "161", "мг", 1000000000);
	ДобавитьВТаблицуПересчета(Результат, "206", "ц", "166", "кг", 100);
	ДобавитьВТаблицуПересчета(Результат, "206", "ц", "163", "г", 100000);
	ДобавитьВТаблицуПересчета(Результат, "206", "ц", "162", "кар", 500000);
	ДобавитьВТаблицуПересчета(Результат, "206", "ц", "161", "мг", 100000000);
	ДобавитьВТаблицуПересчета(Результат, "166", "кг", "163", "г", 1000);
	ДобавитьВТаблицуПересчета(Результат, "166", "кг", "162", "кар", 5000);
	ДобавитьВТаблицуПересчета(Результат, "166", "кг", "161", "мг", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "163", "г", "162", "кар", 5);
	ДобавитьВТаблицуПересчета(Результат, "163", "г", "161", "мг", 1000);
	ДобавитьВТаблицуПересчета(Результат, "162", "кар", "161", "мг", 200);
	
	//кВт
	ДобавитьВТаблицуПересчета(Результат, "215", "мВт", "214", "кВт", 1000);
	ДобавитьВТаблицуПересчета(Результат, "215", "мВт", "212", "Вт", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "214", "кВт", "212", "Вт", 1000);
	
	ДобавитьВТаблицуПересчета(Результат, "247", "гВт.ч", "246", "мВт.ч", 1000);
	ДобавитьВТаблицуПересчета(Результат, "247", "гВт.ч", "245", "кВт.ч", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "247", "гВт.ч", "243", "Вт.ч", 1000000000);
	ДобавитьВТаблицуПересчета(Результат, "246", "мВт.ч", "245", "кВт.ч", 1000);
	ДобавитьВТаблицуПересчета(Результат, "246", "мВт.ч", "243", "Вт.ч", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "245", "кВт.ч", "243", "Вт.ч", 1000);
	
	//калории
	ДобавитьВТаблицуПересчета(Результат, "234", "1000 ГКал", "233", "Гкал", 1000);
	ДобавитьВТаблицуПересчета(Результат, "234", "1000 ГКал", "232", "ккал", 1000000);
	ДобавитьВТаблицуПересчета(Результат, "233", "Гкал ГКал", "232", "ккал", 1000);
	
	ЭДО_Кэш_Поместить("ТаблицаПересчета", Результат);
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьКоэффициентПересчета(КодЕИ1, КодЕИ2) Экспорт
	
	ВыборкаСтрок = ТаблицаПересчета().НайтиСтроки(Новый Структура("Код1, Код2", КодЕИ1, КодЕИ2));
	
	Возврат ?(ВыборкаСтрок.Количество() = 0, Неопределено, ВыборкаСтрок[0].Коэффициент);
	
КонецФункции	

Функция ПроверитьЕИ(ЕИ, КодЕИ, ОшибкаЕИНеНайдена, ОшибкаЕИНеТотКод) Экспорт
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(ЕИ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ГенерацияXML = МодульГенерацияXML();
	ПодходящиеЕИ = ГенерацияXML.ПодходящиеЕдиницыИзмерения(ЕИ.Наименование);
	
	Для Каждого СтрокаОКЕИ Из ПодходящиеЕИ Цикл
		Если СтрокаОКЕИ.Код = КодЕИ Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;	
	
	Если ПодходящиеЕИ.Количество() = 0 Тогда
		
		ОшибкаЕИНеНайдена = Истина;
		
		Результат = "
		|Единица измерения  «<a href=""ЕДИНИЦА:" + ЕИ.Метаданные().Имя + ":" + ЕИ.уникальныйИдентификатор() + """>" + ЕИ + "</a>»
		|не найдена в <a href=""Открыть_ОКЕИ"" title=""Общероссийский классификатор единиц измерения"">ОКЕИ</a></br>";
		
	ИначеЕсли ПодходящиеЕИ.Количество() = 1 Тогда
		
		ОшибкаЕИНеТотКод = Истина;
		
		Результат = "
		|Код единицы измерения «<a href=""ЕДИНИЦА:" + ЕИ.Метаданные().Имя + ":" + ЕИ.уникальныйИдентификатор()+""">" + ЕИ + "</a>» - "+КодЕИ+"
		|не соответствует коду по <a href=""Открыть_ОКЕИ"" title=""Общероссийский классификатор единиц измерения"">ОКЕИ</a> - "+ПодходящиеЕИ[0].код + "</br>";
		
	Иначе 
		
		ОшибкаЕИНеТотКод = Истина;
		
		Результат = "
		|Код единицы измерения «<a href=""ЕДИНИЦА:" + ЕИ.Метаданные().Имя + ":" + ЕИ.уникальныйИдентификатор()+""">" + ЕИ + "</a>» - " + КодЕИ + "
		|не соответствует коду по <a href=""Открыть_ОКЕИ"" title=""Общероссийский классификатор единиц измерения"">ОКЕИ</a> </br>";
		
		Для Каждого СтрокаОКЕИ Из ПодходящиеЕИ Цикл
			Результат = Результат + Символы.ПС + "Единице измерения «"+СтрокаОКЕИ.НаименованиеПолное+"», (" + СтрокаОКЕИ.НаименованиеКраткое + ") соответствует код ОКЕИ " + СтрокаОКЕИ.код + "</br>";
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция КлассификаторВалютПолучитьНаименованиеПоКоду(Код) Экспорт
	Если СокрЛП(Строка(Код)) = "643" Тогда
		Возврат "RUB";
	ИначеЕсли СокрЛП(Строка(Код)) = "978" Тогда
		Возврат "EUR";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

//}ФУНКЦИИ РАБОТЫ С ОБЩЕРОССИЙСКИМИ КЛАССИФИКАТОРАМИ

//}ТЕЛО МОДУЛЯ

//{ПРОТО КОНТЕНТ

//{ ИНТЕРФЕЙС

Функция ДополнительныеПараметрыФормированияПечатнойФормы() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПоказатьДопСведения", Ложь);
	Результат.Вставить("ПротоКонтентОтвета");
	Результат.Вставить("ДанныеШтампа");
	
	Результат.Вставить("ВыводитьНаименованиеТовараСКодами", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПечатнаяФормаПрото(Прото, ФорматОтправки, ДопПараметры) Экспорт
	
	ТипДокумента = ФорматОтправки.ИмяТипа;
	ТипКонтента = ФорматОтправки.ТипКонтента;
	
	МодульПечатныеФормы = ПолучитьМодульПрог("ПечатныеФормы");
	Результат = МодульПечатныеФормы.ПечатнаяФормаПротоКонтента(Прото, ТипКонтента, ТипДокумента, ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

// Формирует протоструктуру для отправки электронного документа в заданном формате.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ФорматОтправки	 - Структура - содержит свойства:
//    * ИмяТипа			 - Строка - имя типа документа (typeNameId);
//    * ФункцияДокумента - Строка - функция документа (Function);
//    * ВерсияФормата	 - Строка - версия формата контента (Version);
//  ДополнительныеПараметры - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентФормализованногоДокумента(СсылкаНаДокумент, ФорматОтправки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	ОписаниеФормата = ОписаниеФорматаЭлектронногоДокумента(ФорматОтправки.ИмяТипа
	, ФорматОтправки.ФункцияДокумента
	, ФорматОтправки.ВерсияФормата);
	
	БазовыеФорматы = БазовыеФорматы();
	БазовыйФормат = ОписаниеФормата.БазовыйФормат;
	
	ПараметрыФормирования.ФункцияДокумента = ФункцияУниверсальногоДокумента(ОписаниеФормата);
	
	Если БазовыйФормат = БазовыеФорматы.utd820 Тогда
		
		Результат = КонтентУПД820(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.utd Тогда
		
		Результат = КонтентУПД155(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.ucd736 Тогда
		
		Результат = КонтентУКД736(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.ucd Тогда
		
		Результат = КонтентУКД189(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.torg12 Тогда
		
		Результат = КонтентНакладной172(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.act Тогда
		
		Результат = КонтентАкта172(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.invoice Тогда
		
		Результат = КонтентСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.invoicecor Тогда
		
		Результат = КонтентКорректировочногоСчетаФактуры93(СсылкаНаДокумент, ПараметрыФормирования);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.proformainvoice Тогда
		
		Результат = КонтентФормализованногоСчета(СсылкаНаДокумент, ПараметрыФормирования);
		
	Иначе
		
		ТекстОшибки = ПодставитьПараметрыВСтроку("Формат отправки не поддерживается!
		|Тип документа: %1
		|Функция документа: %2
		|Версия документа: %3"
		, ОписаниеФормата.ИмяТипа
		, ОписаниеФормата.ФункцияДокумента
		, ОписаниеФормата.ВерсияФормата);
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации()
		, УровеньЖурналаРегистрации.Ошибка
		, СсылкаНаДокумент.Метаданные()
		, СсылкаНаДокумент
		, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ЗаполнитьСлужебнуюИнформациюШапки(Результат.СлужебнаяИнформация, СсылкаНаДокумент);
	
	Возврат Результат;
	
КонецФункции

// Создает структуру параметров для заполнения служебной информации о документе,
// которая будет передана в протоструктуру контента документа.
// 
// Возвращаемое значение:
//  Структура.
//
Функция НовыйСлужебнаяИнформацияШапки(СсылкаНаОбъект = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", СсылкаНаОбъект);
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	
	Возврат Результат;
	
КонецФункции

// Дополняет структуру контента документа служебной информацией об источнике заполнения контента:
// ссылками на сам документ, контрагента, организацию и т.д.
//
// Параметры:
//  Контент - Структура - протоструктура с контентом электронного документа;
//  СсылкаНаОбъект - ЛюбаяСсылка - источник данных для формирования контента;
//
Процедура ЗаполнитьСлужебнуюИнформациюШапки(СлужебнаяИнформация, СсылкаНаОбъект)
	
	ТребуемыеРеквизиты = Новый Структура;
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "Организация") Тогда
		ТребуемыеРеквизиты.Вставить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитМетаданных(МетаданныеОбъекта, "Контрагент") Тогда
		ТребуемыеРеквизиты.Вставить("Контрагент");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		
		ЗначенияРеквизитов = ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, ТребуемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(СлужебнаяИнформация, ЗначенияРеквизитов);
		
	КонецЕсли;
	
	СлужебнаяИнформация.Ссылка = СсылкаНаОбъект;
	
КонецПроцедуры

Процедура ИнициализироватьСлужебныеПоляПрото(Контент)
	
	Контент.Вставить("ОшибкиВДанных", Новый Массив);
	Контент.Вставить(ИмяСвойстваСлужебнаяИнформация(), НовыйСлужебнаяИнформацияШапки());
	
КонецПроцедуры

// Возвращает информацию о стране происхождения товара в формате строки.
//
// Параметры:
//  КоллекцияСведений - Структура - Коллекция сведений о стране происхождения:
//      * СтранаПроисхождения - СправочникСсылка.СтраныМира - Страна происхождения товара.
//      * НомерГТД            - СправочникСсылка.НомераГТД - Номер грузовой таможенной декларации.
//
// Возвращаемое значение:
//   Строка - Сведения о стране происхождения товара для поля StructedAdditionalInfo в формате Ключ=Значение.
//
Функция СведенияОСтранеПроисхожденияСтрокой(КоллекцияСведений) Экспорт
	
	ПараметрыСтроки = Новый Массив;
	
	Если ЗначениеЗаполнено(КоллекцияСведений.СтранаПроисхождения) Тогда
		
		КодСтраныПроисхождения = ПривестиКЧислу(СокрЛП(КоллекцияСведений.СтранаПроисхождения.Код));
		
		ШаблонКодСтраныПроисхождения	= НСтр("ru = 'цифровой код страны происхождения=%1'");
		ПараметрКодСтраныПроисхождения	= ПодставитьПараметрыВСтроку(ШаблонКодСтраныПроисхождения, КодСтраныПроисхождения);
		
		ШаблонСтранаПроисхождения	= НСтр("ru = 'краткое наименование страны происхождения=%1'");
		ПараметрСтранаПроисхождения	= ПодставитьПараметрыВСтроку(ШаблонСтранаПроисхождения, КоллекцияСведений.СтранаПроисхождения);
		
		ПараметрыСтроки.Добавить(ПараметрКодСтраныПроисхождения);
		ПараметрыСтроки.Добавить(ПараметрСтранаПроисхождения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоллекцияСведений.НомерГТД) Тогда
		
		ШаблонНомерГТД		= НСтр("ru = 'регистрационный номер декларации на товары=%1'");
		ПараметрНомерГТД	= ПодставитьПараметрыВСтроку(ШаблонНомерГТД, КоллекцияСведений.НомерГТД);
		
		ПараметрыСтроки.Добавить(ПараметрНомерГТД);
		
	КонецЕсли;
	
	СведенияОстранеПроисхождения = Преобразование_МассивВСтроку(ПараметрыСтроки, ";");
	
	Возврат СведенияОстранеПроисхождения;
	
КонецФункции

// Возвращает информацию о стране происхождения товара в виде структуры.
//
// Параметры:
//  СтрокаДанных - СтрокаТаблицыЗначений - Строка табличной части Товары.
//
// Возвращаемое значение:
//   Структура - Сведения о стране происхождения товара для поля StructedAdditionalInfo:
//      * СтранаПроисхождения - СправочникСсылка.СтраныМира - Страна происхождения товара.
//      * НомерГТД            - СправочникСсылка.НомераГТД - Номер грузовой таможенной декларации.
//
Функция КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных)
	
	Результат = Новый Структура;
	Результат.Вставить("СтранаПроисхождения"	, СтрокаДанных.СтранаПроисхождения);
	Результат.Вставить("НомерГТД"				, СтрокаДанных.НомерГТД);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру дополнительных параметров для методов сбора контента.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * ИспользоватьСервисКонтурМаркировка - Булево - Истина, если для получения сведений о маркировке следует
//                                                    использовать данные подсистемы Контур.Маркировка.
//    * УказыватьОтсутствиеОснованияУПД - Булево - Истина, если при незаполненном основании передачи
//                                                 товаров (услуг, работ) в поле GroundName следует
//                                                 в указывать строку, определенную форматом для пустого
//                                                 основания передачи (например, "Отсутствует" для 155@
//                                                 или "Без документа-основания" для 820@).
//    * ФункцияДокумента - Строка - функция документа для формирования XML. Обязательно для УПД/УКД.
//    * ДополнительныеСведенияСтрокой - Строка - (Устарел) Список доп. полей в формате "ИмяПоля = Значение".
//                                               Доп. поля указываются через точку с запятой.
//    * ПараметрыСогласования - Структура - Заполняется при передаче документа на согласование/подпись:
//       ** ФИОПодписанта - Строка - Фамилия, имя и отчетство подписанта;
//       ** ДолжностьПодписанта - Строка - должность подписанта;
//       ** ФИОПолучателя - Строка - Фамилия, имя и отчество получателя;
//       ** ДолжностьПолучателя - Строка - должность получателя;
//    * ОтправительИдентификаторЭДО - Строка - идентификатор участника ЭДО отправителя документа;
//    * ПолучательИдентификаторЭДО - Строка - идентификатор участника ЭДО получателя документа;
//    * ДанныеСотрудника - Структура - см. ДанныеКонтекстаДиадок(Организация, "ДанныеСотрудника");
//    * ТипДокумента - Строка - идентификатор типа документа (используется только для Актов в формате УПД);
//    * НомерЗаказа - Строка - используется только для накладной 172@;
//
Функция ДополнительныеПараметрыПолученияКонтента() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("УказыватьОтсутствиеОснованияУПД", Ложь);
	Результат.Вставить("ДополнительныеСведенияСтрокой", "");
	Результат.Вставить("ФункцияДокумента", Неопределено);
	Результат.Вставить("ПараметрыСогласования", Неопределено);
	Результат.Вставить("ОтправительИдентификаторЭДО", Неопределено);
	Результат.Вставить("ПолучательИдентификаторЭДО", Неопределено);
	Результат.Вставить("ДанныеСотрудника", Неопределено);
	Результат.Вставить("НомерЗаказа", Неопределено);
	Результат.Вставить("ТипДокумента", Неопределено);
	Результат.Вставить("ИспользоватьСервисКонтурМаркировка", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру с параметрами события ПМ "ПослеЗаполненияКонтента"
//
// Параметры:
//  Контент			 - Структура	 - протоконтент;
//  ТипКонтента		 - Строка		 - идентификатор типа контента (см. ТипыКонтента())
//  СсылкаНаДокумент - ЛюбаяСсылка	 - ссылка на документ информационной базы;
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ПараметрыЗаполненияКонтентаДляПМ(Контент, ТипКонтента, СсылкаНаДокумент)
	
	Результат = Новый Структура;
	Результат.Вставить("Content", Контент);
	Результат.Вставить("ТипКонтента", ТипКонтента);
	Результат.Вставить("ДокументСсылка", СсылкаНаДокумент);
	
	// Необязательные параметры
	Результат.Вставить("ПараметрыОтправкиНаСогласование"); // Устарел, для совместимости со старыми ПМ
	Результат.Вставить("НомерЗаказа"); // Используется только для накладной 172@
	Результат.Вставить("ДопСведения");
	Результат.Вставить("DocumentType"); // Устарел, для совместимости с ПМ 1.4 или ниже.
	Результат.Вставить("Данные"); // Устарел, данные документа, по которым был заполнен контент
	
	Возврат Результат;
	
КонецФункции

// Программный интерфейс вызова события ПМ 
//
// Параметры:
//  Контент - Структура - протоструктура с описанием контента.
//  ТипКонтента - Строка - см. метод ТипыКонтента().
//  СсылкаНаДокумент - ЛюбаяСсылка - документ информационной базы, на основании которого собирается контент.
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента.
//
Процедура ПМ_ПослеЗаполненияКонтента(Контент, ТипКонтента, СсылкаНаДокумент, ПараметрыФормирования) Экспорт
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Контент, ТипКонтента, СсылкаНаДокумент);
	ПараметрыПМ.ДопСведения = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	
	ВсеТипыКонтента = ТипыКонтента();
	Если ТипКонтента = ВсеТипыКонтента.UtdSellerContent Тогда
		ПараметрыПМ.DocumentType = "UniversalTransferDocument";
	КонецЕсли;
	
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
КонецПроцедуры

// Формирует и заполняет структуру Utd820SellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУПД820(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	РежимСовместимости155и820 = КонстантаРежимСовместимостиФорматов155и820();
	
	Контент155 = Новый_UTDSellerContent();
	СтруктураДокумента = ДанныеДляФормированияУПД(СсылкаНаДокумент, ПараметрыФормирования);
	ЗаполнитьКонтентУПД155(Контент155, СтруктураДокумента, ПараметрыФормирования);
	
	Если РежимСовместимости155и820 Тогда
		
		ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Контент155, ТипыКонтента().UtdSellerContent, СсылкаНаДокумент);
		ПараметрыПМ.DocumentType = "UniversalTransferDocument";
		ПараметрыПМ.Данные		 = СтруктураДокумента;
		ПараметрыПМ.ДопСведения	 = ДополнительныеПараметры.ДополнительныеСведенияСтрокой;
		ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
		ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
		
	КонецЕсли;
	
	Результат = Новый_Utd820SellerContent();
	ЗаполнитьКонтентУПД820ИзКонтентаУПД155(Результат, Контент155);
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции(); 
	
	МенеджерИнтеграции.ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку(Результат, СсылкаНаДокумент);
	
	ИспользоватьКМ = ПараметрыФормирования.ИспользоватьСервисКонтурМаркировка;
	МенеджерИнтеграции.ЗаполнитьСведенияОМаркировке(Результат, СсылкаНаДокумент, ИспользоватьКМ);
	
	МенеджерИнтеграции.ЗаполнитьСведенияПрослеживаемости(Результат);
	
	МенеджерИнтеграции.ЗаполнитьОбстФормСЧФ820(Результат, СсылкаНаДокумент, ПараметрыФормирования.ФункцияДокумента);
	
	Если Не РежимСовместимости155и820 Тогда
		
		ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().Utd820SellerContent, СсылкаНаДокумент);
		ПараметрыПМ.ДопСведения = ДополнительныеПараметры.ДополнительныеСведенияСтрокой;
		ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
		ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру UtdSellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУПД155(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_UTDSellerContent();
	СтруктураДокумента = ДанныеДляФормированияУПД(СсылкаНаДокумент, ПараметрыФормирования);
	ЗаполнитьКонтентУПД155(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().UtdSellerContent, СсылкаНаДокумент);
	ПараметрыПМ.DocumentType = "UniversalTransferDocument";
	ПараметрыПМ.Данные		 = СтруктураДокумента;
	ПараметрыПМ.ДопСведения	 = ДополнительныеПараметры.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру ProformaInvoiceContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУКД189(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_UCDSellerContent();
	Результат.FormatVersion = БазовыеФорматы().ucd;
	
	СтруктураДокумента = ДанныеДляФормированияУКД(СсылкаНаДокумент, ДополнительныеПараметры);
	ЗаполнитьКонтентУКД(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	ПроверитьЗаполнитьАтрибутWithoutVat736(Результат);
	ПроверитьЗаполнитьItemOriginalNumber736(Результат);
	
	ЗаполнитьКонтент189ПоДаннымКонтент736(Результат);
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().UcdSellerContent, СсылкаНаДокумент);
	ПараметрыПМ.DocumentType = "UCDSellerContent";
	ПараметрыПМ.Данные		 = СтруктураДокумента;
	ПараметрыПМ.ДопСведения	 = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру ProformaInvoiceContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентУКД736(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_UCDSellerContent();
	Результат.FormatVersion = БазовыеФорматы().ucd736;
	
	СтруктураДокумента = ДанныеДляФормированияУКД(СсылкаНаДокумент, ДополнительныеПараметры);
	ЗаполнитьКонтентУКД(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	ПроверитьЗаполнитьАтрибутWithoutVat736(Результат);
	ПроверитьЗаполнитьItemOriginalNumber736(Результат);
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	
	ИспользоватьКМ = ПараметрыФормирования.ИспользоватьСервисКонтурМаркировка;
	МенеджерИнтеграции.ЗаполнитьСведенияОМаркировке736(Результат, СсылкаНаДокумент, ИспользоватьКМ);
	
	МенеджерИнтеграции.ЗаполнитьСведенияПрослеживаемости736(Результат);
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().UcdSellerContent, СсылкаНаДокумент);
	ПараметрыПМ.DocumentType = "UCDSellerContent";
	ПараметрыПМ.Данные		 = СтруктураДокумента;
	ПараметрыПМ.ДопСведения	 = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьДельта(Amounts) Экспорт
	
	Результат = Ложь;
	
	Если Amounts.TotalWithVatExcluded <> Неопределено
		Или Amounts.Vat <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьАтрибутWithoutVat736(Контент736)
	
	ТабличнаяЧасть = Контент736.InvoiceCorrectionTable;
	
	ЕстьУвеличение = Ложь;
	ЕстьУменьшение = Ложь;
	
	ВсегоУвелБезНДС = Истина;
	ВсегоУмБезНДС = Истина;
	
	Для Каждого Элемент Из ТабличнаяЧасть.Items Цикл
		
		СтавкаДоИзменения = Элемент.OriginalValues.TaxRate;
		ДоИзмененияБезНДС = ЭтоСтавкаБезНДС(СтавкаДоИзменения);
		Элемент.OriginalValues.WithoutVat = XMLСтрока(ДоИзмененияБезНДС);
		
		СтавкаПослеИзменения = Элемент.CorrectedValues.TaxRate;
		ПослеИзмененияБезНДС = ЭтоСтавкаБезНДС(СтавкаПослеИзменения);
		Элемент.CorrectedValues.WithoutVat = XMLСтрока(ПослеИзмененияБезНДС);
		
		Если ЕстьДельта(Элемент.AmountsInc) Тогда
			ЕстьУвеличение = Истина;
			ВсегоУвелБезНДС = ВсегоУвелБезНДС И ДоИзмененияБезНДС И ПослеИзмененияБезНДС;
		КонецЕсли;
		
		Если ЕстьДельта(Элемент.AmountsDec) Тогда
			ЕстьУменьшение = Истина;
			ВсегоУмБезНДС = ВсегоУмБезНДС И ДоИзмененияБезНДС И ПослеИзмененияБезНДС;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьУвеличение Тогда
		ТабличнаяЧасть.TotalsInc.WithoutVat = XMLСтрока(ВсегоУвелБезНДС);
	КонецЕсли;
	
	Если ЕстьУменьшение Тогда
		ТабличнаяЧасть.TotalsDec.WithoutVat = XMLСтрока(ВсегоУмБезНДС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьItemOriginalNumber736(Контент736)
	
	СтрокиТабличнойЧасти = Контент736.InvoiceCorrectionTable.Items;
	
	НомерПоПорядку = 0;
	
	Для Каждого Item Из СтрокиТабличнойЧасти Цикл
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
		Если Item.OriginalNumber <> Неопределено Тогда // Может быть 0, поэтому сравнение с Неопределено
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиИсходногоСФ = НомерПоПорядку;
		
		ЭтоНоваяСтрока = ЭтоНоваяСтрокаКорректировки(Item);
		
		Если ЭтоНоваяСтрока Тогда
			НомерСтрокиИсходногоСФ = Неопределено;
		КонецЕсли;
		
		Item.OriginalNumber = НомерСтрокиИсходногоСФ;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, является ли строка корректировочного документа (ucd) новой.
//
// Параметры:
//  Item - СтрокаТаблицыЗначений - элемент коллекции UcdSellerContent.InvoiceCorrectionTable.Items.
// 
// Возвращаемое значение:
//  Булево - Истина, если это новая строка (её не было в исходном документе).
//
Функция ЭтоНоваяСтрокаКорректировки(Item)
	
	ЗначенияДоИзменения = Item.OriginalValues;
	
	Результат = Истина;
	
	Если ЗначениеЗаполнено(ЗначенияДоИзменения.Quantity)
		Или ЗначениеЗаполнено(ЗначенияДоИзменения.TotalWithVatExcluded)
		Или ЗначениеЗаполнено(ЗначенияДоИзменения.Total)
		Или ЗначениеЗаполнено(ЗначенияДоИзменения.Vat) Тогда
		
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьКонтент189ПоДаннымКонтент736(ПротоКонтентУКД)
	
	ПротоКонтентУКД.EventContent.TransferDocDetails = ПредставлениеTransferDocDetails(ПротоКонтентУКД.EventContent.TransferDocDetails736);
	
	Для Каждого CorrectionBase Из ПротоКонтентУКД.EventContent.CorrectionBases Цикл
		
		Если CorrectionBase.BaseDocumentName = ОснованиеПередачи_БезДокументаОснования() Тогда
			CorrectionBase.BaseDocumentName = ОснованиеПередачи_Отсутствует();
		КонецЕсли;
		
	КонецЦикла;
	
	СтавкаНДС_ИсчНалАг = СтавкаНДС_ИсчНалАг();
	
	Для Каждого Item Из ПротоКонтентУКД.InvoiceCorrectionTable.Items Цикл
		
		Item.ItemTracingInfos = Новый Массив;
		
		Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			
			Если Item.CorrectedValues.TotalWithVatExcluded >= Item.OriginalValues.TotalWithVatExcluded Тогда // увеличение
				Item.AmountsInc.Vat		= 0;
				Item.AmountsInc.Total 	= 0;			
			Иначе // уменьшение
				Item.AmountsDec.Vat		= 0;
				Item.AmountsDec.Total 	= 0;			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеTransferDocDetails(TransferDocDetails736)
	
	Результат = "";
	
	Для Каждого BaseDocument Из TransferDocDetails736 Цикл
		
		Результат = Результат 	+ ?(ПустаяСтрока(Результат), "", ", ")
		+ BaseDocument.BaseDocumentName + "№" + BaseDocument.BaseDocumentNumber 
		+ " от " + BaseDocument.BaseDocumentDate;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру Torg12SellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентНакладной172(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_Torg12SellerContent();
	СтруктураДокумента = ДанныеДляФормированияТорг12(СсылкаНаДокумент, Ложь, Ложь);
	ЗаполнитьКонтентНакладной172(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().Torg12SellerContent, СсылкаНаДокумент);
	ПараметрыПМ.DocumentType = "XmlTorg12";
	ПараметрыПМ.Данные		 = СтруктураДокумента;
	ПараметрыПМ.НомерЗаказа	 = ПараметрыФормирования.НомерЗаказа;
	ПараметрыПМ.ДопСведения	 = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру AcceptanceCertificateSellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентАкта172(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_AcceptanceCertificateSellerContent();
	СтруктураДокумента = ДанныеДляФормированияТорг12(СсылкаНаДокумент, Истина, Ложь);
	ЗаполнитьКонтентАкта172(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().AcceptanceCertificateSellerContent, СсылкаНаДокумент);
	ПараметрыПМ.DocumentType = "XmlAcceptanceCertificate";
	ПараметрыПМ.Данные		 = СтруктураДокумента;
	ПараметрыПМ.ДопСведения	 = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру InvoiceContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентСчетаФактуры93(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_InvoiceContent();
	СтруктураДокумента = ДанныеДляФормированияСчетФактуры(СсылкаНаДокумент, Ложь);
	ЗаполнитьКонтентСчетаФактуры93(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	Если ЗначениеЗаполнено(Результат.InvoiceRevisionNumber) Тогда
		ТипДокумента = "InvoiceRevision"; 
	Иначе
		ТипДокумента = "Invoice";
	КонецЕсли;
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().InvoiceContent, СсылкаНаДокумент);
	ПараметрыПМ.DocumentType = ТипДокумента;
	ПараметрыПМ.Данные		 = СтруктураДокумента;
	ПараметрыПМ.ДопСведения	 = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру InvoiceCorrectionContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентКорректировочногоСчетаФактуры93(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_InvoiceCorrectionContent();
	СтруктураДокумента = ДанныеДляФормированияСчетФактуры(СсылкаНаДокумент, Истина);
	ЗаполнитьКонтентКорректировочногоСчетаФактуры93(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	ПараметрыПМ = ПараметрыЗаполненияКонтентаДляПМ(Результат, ТипыКонтента().InvoiceCorrectionContent, СсылкаНаДокумент);
	ПараметрыПМ.DocumentType = "InvoiceCorrection";
	ПараметрыПМ.Данные		 = СтруктураДокумента;
	ПараметрыПМ.ДопСведения	 = ПараметрыФормирования.ДополнительныеСведенияСтрокой;
	ПараметрыПМ.ПараметрыОтправкиНаСогласование = ПараметрыФормирования.ПараметрыСогласования;
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияКонтента", ПараметрыПМ);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру ProformaInvoiceSellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ДополнительныеПараметры - Структура, Неопределено - см. функцию ДополнительныеПараметрыПолученияКонтента();
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентФормализованногоСчета(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтента();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Результат = Новый_ProformaInvoiceSellerContent();
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("Шапка", ДанныеШапки(СсылкаНаДокумент, Перечисление_ВидыЭД().СчетНаОплату));
	СтруктураДокумента.Вставить("ДанныеТЧ", ДанныеТабличныхЧастей(СтруктураДокумента.Шапка));
	
	ЗаполнитьКонтентФормализованногоСчета(Результат, СтруктураДокумента, ПараметрыФормирования);
	
	Возврат Результат;
	
КонецФункции

//} ИНТЕРФЕЙС

//{ ЗАПОЛНЕНИЕ

// Получает документ-основание произвольного документа.
// Если оснований несколько, берется только первое.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - произвольный документ, основание которого требуется получить.
// 
// Возвращаемое значение:
//  ДокументСсылка - документ-основание.
//
Функция ПервыйДокументОснование(СсылкаНаДокумент)
	
	Результат = Неопределено;
	
	МетаданныеДокумента	 = СсылкаНаДокумент.Метаданные();
	ИмяДокумента		 = МетаданныеДокумента.Имя;
	
	ПолноеИмяТаблицыОснований = СтрЗаменить("Документ.%ИмяДокумента%.ТабличнаяЧасть.ДокументыОснования", "%ИмяДокумента%", ИмяДокумента);
	
	Если СуществуетОбъектМетаданных(ПолноеИмяТаблицыОснований) Тогда 
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.%ИмяДокумента%.ДокументыОснования КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяДокумента%", ИмяДокумента);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Результат = Выборка.ДокументОснование;
		КонецЕсли;
		
	ИначеЕсли ЕстьРеквизитМетаданных(МетаданныеДокумента, "ДокументОснование") Тогда 
		
		Результат = ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ДокументОснование");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПересчитыватьВВалютуРегламентированногоУчета(ВалютаДокумента)
	
	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияАльфаАвто41" Тогда
		
		Модуль_ИнтеграцияАльфаАвто = ПолучитьМодульПрог("Модуль_ИнтеграцияАльфаАвто41");
		ВалютаРегл = Модуль_ИнтеграцияАльфаАвто.ПолучитьВалютуРегламентированногоУчета();
		
	Иначе
		
		ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
		
	КонецЕсли;
	
	Результат = ВалютаДокумента <> ВалютаРегл;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьКонтентУПД155(СтруктураКонтента, СтруктураДокумента, ДопПараметры)
	
	ДанныеШапки = СтруктураДокумента.ДанныеШапки;
	
	Если ДанныеШапки.Свойство("СчетФактураСсылка") Тогда
		СтруктураКонтента.СчетФактураСсылка = ДанныеШапки.СчетФактураСсылка;
	КонецЕсли;
	
	Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(СтруктураКонтента.Seller, ДанныеШапки.Организация,  ДанныеШапки.Дата, Истина, ДанныеШапки.БанковскийСчетОрганизации);
	
	СтруктураКонтента.Seller.FnsParticipantId = ДопПараметры.ОтправительИдентификаторЭДО;
	
	ЭтоИП = СтруктураКонтента.Seller.Type = "IndividualEntity";
	Если ЭтоИП 
		И ДанныеШапки.Свойство("ДатаНомерСвидетельстваОРегистрации") 
		И ЗначениеЗаполнено(ДанныеШапки.ДатаНомерСвидетельстваОРегистрации) Тогда
		
		СтруктураКонтента.Seller.IndividualEntityRegistrationCertificate = ДанныеШапки.ДатаНомерСвидетельстваОРегистрации;
		
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("КПППродавца") И ЗначениеЗаполнено(ДанныеШапки.КПППродавца) Тогда
		СтруктураКонтента.Seller.kpp = ДанныеШапки.КПППродавца;
	КонецЕсли;
	
	Если ДанныеШапки.СодержитТовары Тогда
		
		СтруктураКонтента.Shipper.SameAsSeller = НЕ ДанныеШапки.Свойство("Грузоотправитель") ИЛИ НЕ ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) ИЛИ НРег(ДанныеШапки.Грузоотправитель) = "он же";
		
		ГрузоотправительСсылка = ?(СтруктураКонтента.Shipper.SameAsSeller,  ДанныеШапки.Организация, ДанныеШапки.Грузоотправитель);
		Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(СтруктураКонтента.Shipper.OrganizationInfo, ГрузоотправительСсылка, ДанныеШапки.Дата, Ложь);
		
		ГрузополучательСсылка = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
		Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(СтруктураКонтента.Consignee,  ГрузополучательСсылка, ДанныеШапки.Дата, Ложь, , ДанныеШапки.АдресДоставки);
		
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("Агент") И ЗначениеЗаполнено(ДанныеШапки.Агент) Тогда
		
		ДанныеCreator = Новый_ExtendedOrganizationInfo();
		Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(ДанныеCreator, ДанныеШапки.Агент, ДанныеШапки.Дата, Истина);
		
		СтруктураКонтента.Creator = ДанныеCreator.Name + ", " + СформироватьПредставлениеИННКПП(ДанныеCreator.Inn, ДанныеCreator.Kpp);
		СтруктураКонтента.CreatorBase = Строка(ДанныеШапки.ДоговорАгента);
		
	Иначе
		СтруктураКонтента.Creator = СтруктураКонтента.Seller.Name + ", ИНН/КПП: " + ПредставлениеИННКПП(СтруктураКонтента.Seller);
	КонецЕсли;
	
	Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(СтруктураКонтента.Buyer, ДанныеШапки.Контрагент, ДанныеШапки.Дата, Истина);
	
	СтруктураКонтента.Buyer.FnsParticipantId = ДопПараметры.ПолучательИдентификаторЭДО;
	
	Если ДанныеШапки.Свойство("КПППокупателя") И ЗначениеЗаполнено(ДанныеШапки.КПППокупателя) Тогда
		СтруктураКонтента.Buyer.kpp = ДанныеШапки.КПППокупателя;
	КонецЕсли;
	
	СтруктураКонтента.Function	= ДанныеШапки.Функция;
	СтруктураКонтента.Number	= ДанныеШапки.Номер;
	СтруктураКонтента.Date		= ДанныеШапки.Дата;
	
	Если ДанныеШапки.Свойство("НомераДляСФ") Тогда
		Если ДанныеШапки.НомераДляСФ.ЭтоИСФ Тогда
			СтруктураКонтента.RevisionNumber 	= ДанныеШапки.НомераДляСФ.НомерИсправления;
			СтруктураКонтента.RevisionDate   	= ДанныеШапки.НомераДляСФ.ДатаИсправления;
			СтруктураКонтента.Number 			= ДанныеШапки.НомераДляСФ.НомерДокумента;
			СтруктураКонтента.Date   			= ДанныеШапки.НомераДляСФ.ДатаДокумента;
		Иначе
			СтруктураКонтента.Number	= ДанныеШапки.НомераДляСФ.НомерДокумента;
			СтруктураКонтента.Date		= ДанныеШапки.НомераДляСФ.ДатаДокумента;
		КонецЕсли;
	КонецЕсли;
	Если ДанныеШапки.Свойство("ДатаНомерДокументовОплаты") Тогда
		Для каждого ПРД Из ДанныеШапки.ДатаНомерДокументовОплаты Цикл 
			Стр = СтруктураКонтента.PaymentDocuments.Добавить();
			Стр.Number = ПРД.НомерПлатежноРасчетногоДокумента;
			Стр.Date   = ПРД.ДатаПлатежноРасчетногоДокумента;
		КонецЦикла;	
	КонецЕсли;
	
	СтруктураКонтента.Currency = ?(ПустаяСтрока(ДанныеШапки.ВалютаДокумента), "", СокрЛП(ДанныеШапки.ВалютаДокумента.Код));
	СтруктураКонтента.ВалютаСсылка =  ДанныеШапки.ВалютаДокумента;
	
	ДанныеШапки.Свойство("ИдентификаторГосконтракта", СтруктураКонтента.GovernmentContractInfo);
	
	СтруктураКонтента.AdditionalInfoId.Вставить("StructedAdditionalInfos", ДанныеШапки.ДопИнфо);
	Дополнить_StructedAdditionalInfos_ДопСведениями(СтруктураКонтента.AdditionalInfoId.StructedAdditionalInfos, ДопПараметры.ДополнительныеСведенияСтрокой);
	
	СФНаАванс = ДанныеШапки.Свойство("СФНаАванс") И ДанныеШапки.СФНаАванс;
	
	TotalNet = 0;
	Total 	 = 0;
	Vat 	 = 0;
	TotalWithVatExcluded = 0;
	
	ВсеСтроки_СтавкаНДС_БезНДС	 = Истина;
	ВсеСтроки_СтавкаНДС_ИсчНалАг = Истина;
	
	СтавкаНДС_БезНДС   = СтавкаНДС_БезНДС();
	СтавкаНДС_ИсчНалАг = СтавкаНДС_ИсчНалАг();
	
	Точность = ОбщиеПараметры.ТочностьЦены;
	
	Для Каждого СтрокаДанных Из СтруктураДокумента.ТабличнаяЧасть Цикл 
		
		Item = СтруктураКонтента.InvoiceTable.Items.Добавить();
		
		Item.Product	= СтрокаДанных.Номенклатура;
		Item.VendorCode	= СтрокаДанных.КодНоменклатуры;
		Item.ItemMark	= СтрокаДанных.ПризнакТРУ;
		Item.TaxRate 	= СтрокаДанных.СтавкаНДС;
		
		Если НРег(Item.TaxRate) <> НРег(СтавкаНДС_БезНДС) Тогда
			ВсеСтроки_СтавкаНДС_БезНДС = Ложь;
		КонецЕсли;	
		
		НДС_ИсчНалАг = Item.TaxRate = СтавкаНДС_ИсчНалАг;
		
		Если НЕ НДС_ИсчНалАг Тогда
			ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
		КонецЕсли;
		
		Если НДС_ИсчНалАг Тогда
			Item.SubtotalWithVatExcluded = СтрокаДанных.Сумма;
		ИначеЕсли НЕ СФНаАванс Тогда 	
			Item.SubtotalWithVatExcluded = СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДС, 0);	
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(СтрокаДанных.Количество)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
			
			Item.Quantity = ?(СФНаАванс И СтрокаДанных.Количество = 0, Неопределено, СтрокаДанных.Количество); //для отображения прочерка в вэбе
			Item.UnitCode = XML_КодЕдиницыИзмерения(СтрокаДанных.КодЕдиницыИзмерения);
			Item.UnitName = СокрЛП(СтрокаДанных.ЕдиницаИзмерения);
			
			Если ТипЗнч(СтрокаДанных.Цена) = Тип("Число") Тогда
				
				РасчетнаяЦена = Окр(Item.SubtotalWithVatExcluded / Item.Quantity, Точность);
				ОтклонениеОтРасчетной = (РасчетнаяЦена - СтрокаДанных.Цена) * СтрокаДанных.Количество;
				
				Если СтрокаДанных.СуммаВключаетНДС ИЛИ Макс(ОтклонениеОтРасчетной, -ОтклонениеОтРасчетной) > 0.03 Тогда
					Item.Price = РасчетнаяЦена;	
				Иначе
					Item.Price = Окр(СтрокаДанных.Цена, Точность);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			//не инициируем поля UnitCode, UnitName, Quantity, Price, чтобы в печатной форме ЭД были прочерки   
		КонецЕсли;
		
		Если НДС_ИсчНалАг Тогда
			Item.Vat 		= 0;
			Item.Subtotal	= 0;
		Иначе
			
			Если НРег(Item.TaxRate) = НРег(СтавкаНДС_БезНДС) Тогда
				Item.Vat = Неопределено;
			Иначе
				Item.Vat = СтрокаДанных.СуммаНДС;
			КонецЕсли;
			
			Item.Subtotal = СтрокаДанных.Сумма + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
			
		КонецЕсли;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		
		Item.StructedAdditionalInfos	= СтрокаДанных.ДопИнфо;
		
		TotalNet = TotalNet + ПривестиКЧислу(Item.Quantity);
		Total 	 = Total + ПривестиКЧислу(Item.Subtotal);
		Vat 	 = Vat + ПривестиКЧислу(Item.Vat);
		
		Если НЕ СФНаАванс ИЛИ НДС_ИсчНалАг Тогда
			TotalWithVatExcluded = TotalWithVatExcluded + ПривестиКЧислу(Item.SubtotalWithVatExcluded);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.СтранаПроисхождения) Тогда
			
			ТЗ_ГТД = Новый_CustomDeclarations();
			
			СтрокаТЗ_ГТД = ТЗ_ГТД.Добавить();
			СтрокаТЗ_ГТД.CountryCode       = СокрЛП(СтрокаДанных.СтранаПроисхождения.Код);
			СтрокаТЗ_ГТД.DeclarationNumber = Модуль_Интеграция.ПолучитьНомерГТД(СтрокаДанных.НомерГТД);
			
			Item.CustomDeclarations = ТЗ_ГТД;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураКонтента.InvoiceTable.TotalNet = TotalNet;
	СтруктураКонтента.InvoiceTable.Total	= ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, ДанныеШапки.СуммаДокумента);
	СтруктураКонтента.InvoiceTable.Vat		= ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, ДанныеШапки.СуммаНДСДокумента));
	
	Если НЕ СФНаАванс ИЛИ ВсеСтроки_СтавкаНДС_ИсчНалАг Тогда
		СтруктураКонтента.InvoiceTable.TotalWithVatExcluded = ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, TotalWithVatExcluded, ДанныеШапки.СуммаБезНДСДокумента);
	КонецЕсли;			
	
	СтруктураКонтента.TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	Если ДанныеШапки.Свойство("ДатаОтгрузки") Тогда
		СтруктураКонтента.TransferInfo.TransferDate = ДанныеШапки.ДатаОтгрузки;
	КонецЕсли;
	
	КоллекцияОснованияПередачи = ДанныеШапки.ОснованияПередачи;
	
	Для Каждого ЭлементКоллекции Из КоллекцияОснованияПередачи Цикл
		
		СтрокаТЗ_ОснПер = СтруктураКонтента.TransferInfo.TransferBases.Добавить();
		
		СтрокаТЗ_ОснПер.DocumentName 	= ЭлементКоллекции.DocumentName;
		СтрокаТЗ_ОснПер.DocumentNumber 	= ЭлементКоллекции.DocumentNumber;
		СтрокаТЗ_ОснПер.DocumentDate 	= ЭлементКоллекции.DocumentDate;
		СтрокаТЗ_ОснПер.DocumentInfo 	= ЭлементКоллекции.DocumentInfo;
		
		СтрокаТЗ_ОснПер.СлужебнаяИнформация = ЭлементКоллекции.СлужебнаяИнформация;
		
	КонецЦикла;
	
	Если ДанныеШапки.СодержитТовары И (ДанныеШапки.Функция = "InvoiceAndBasic" ИЛИ ДанныеШапки.Функция = "Basic")
		И ЗначениеЗаполнено(ДопПараметры.ДанныеСотрудника) И ЗначениеЗаполнено(ДопПараметры.ДанныеСотрудника.Должность) Тогда
		
		СтруктураКонтента.TransferInfo.Employee.EmployeePosition = ДопПараметры.ДанныеСотрудника.Должность;
		СтруктураКонтента.TransferInfo.Employee.Surname    		 = ДопПараметры.ДанныеСотрудника.Фамилия;
		СтруктураКонтента.TransferInfo.Employee.FirstName  		 = ДопПараметры.ДанныеСотрудника.Имя;
		СтруктураКонтента.TransferInfo.Employee.Patronymic 		 = ДопПараметры.ДанныеСотрудника.Отчество;
		
	КонецЕсли;
	
	Если ДанныеШапки.Функция = "InvoiceAndBasic" Тогда
		СтруктураКонтента.Name = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ИначеЕсли ДанныеШапки.Функция = "Basic" Тогда
		СтруктураКонтента.Name = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (Документ об оказании услуг)";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтентУПД820ИзКонтентаУПД155(СтруктураКонтента, Контент155)
	
	ЗаполнитьЗначенияСвойств(СтруктураКонтента, Контент155);
	
	// Наименование, дата и номер документа
	СтруктураКонтента.DocumentName	 = Контент155.Name;
	СтруктураКонтента.DocumentDate	 = Контент155.Date;
	СтруктураКонтента.DocumentNumber = Контент155.Number;
	
	// Составитель документа и его полномочия
	СтруктураКонтента.DocumentCreator		 = Контент155.Creator;
	СтруктураКонтента.DocumentCreatorBase	 = Контент155.CreatorBase;
	
	// Участники сделки
	Buyer		 = Новый_ExtendedOrganizationInfo820();
	Seller		 = Новый_ExtendedOrganizationInfo820();
	Consignee	 = Новый_ExtendedOrganizationInfo820();
	
	ЗаполнитьЗначенияСвойств(Buyer		, Контент155.Buyer);
	ЗаполнитьЗначенияСвойств(Seller		, Контент155.Seller);
	ЗаполнитьЗначенияСвойств(Consignee	, Контент155.Consignee);
	
	Если СтруктураЗаполнена(Consignee) Тогда
		Consignee.HyphenInn = НЕ ЗначениеЗаполнено(Consignee.Inn);
	КонецЕсли;
	
	Shipper = Новый_Shipper820();
	Shipper.SameAsSeller = Контент155.Shipper.SameAsSeller;
	ЗаполнитьЗначенияСвойств(Shipper.OrganizationInfo, Контент155.Shipper.OrganizationInfo);
	
	Если СтруктураЗаполнена(Shipper.OrganizationInfo) Тогда
		Shipper.OrganizationInfo.HyphenInn = НЕ ЗначениеЗаполнено(Shipper.OrganizationInfo.Inn);
	КонецЕсли;
	
	СтруктураКонтента.Buyers.Добавить(Buyer);
	СтруктураКонтента.Sellers.Добавить(Seller);
	СтруктураКонтента.Shippers.Добавить(Shipper);
	СтруктураКонтента.Consignees.Добавить(Consignee);
	
	// Основания передачи
	Для Каждого ОснПер Из СтруктураКонтента.TransferInfo.TransferBases Цикл
		
		Если ОснПер.DocumentName = "Отсутствует" Тогда
			ОснПер.DocumentName = "Без документа-основания";
		КонецЕсли;
		
	КонецЦикла;
	
	// Табличная часть
	ТабличнаяЧасть = СтруктураКонтента.Table;
	ЗаполнитьЗначенияСвойств(ТабличнаяЧасть, Контент155.InvoiceTable, , "Items");
	
	ВсеСтрокиБезНДС = Истина;
	
	Для Каждого Item155 Из Контент155.InvoiceTable.Items Цикл
		
		СтрокаТЧ = Новый_Utd820Item();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Item155, , "CustomDeclarations");
		
		СтрокаТЧ.Unit			 = Item155.UnitCode;
		СтрокаТЧ.ItemVendorCode	 = Item155.VendorCode;
		СтрокаТЧ.ItemToRelease	 = Item155.ToRelease;
		СтрокаТЧ.WithoutVat		 = "false";
		
		Если ЗначениеЗаполнено(Item155.CustomDeclarations) Тогда
			Для каждого СтрокаТЗ Из Item155.CustomDeclarations Цикл
				CustomDeclaration = Новый_CustomDeclaration820();
				ЗаполнитьЗначенияСвойств(CustomDeclaration, СтрокаТЗ);
				СтрокаТЧ.CustomDeclarations.Добавить(CustomDeclaration);
			КонецЦикла;
		КонецЕсли;
		
		Если СтрокаТЧ.TaxRate = "без НДС" Тогда
			СтрокаТЧ.WithoutVat = "true";
		Иначе
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		ТабличнаяЧасть.Items.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
	ТабличнаяЧасть.WithoutVat = ?(ВсеСтрокиБезНДС, "true", "false");
	
КонецПроцедуры

Процедура ЗаполнитьКонтентУКД(СтруктураКонтента, СтруктураДокумента, ДопПараметры)
	
	ДанныеШапки = СтруктураДокумента.ДанныеШапки;
	ВалютаДокумента = ДанныеШапки.ВалютаДокумента;
	
	Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(СтруктураКонтента.Seller, ДанныеШапки.Организация,  ДанныеШапки.Дата, Истина, ДанныеШапки.БанковскийСчетОрганизации);
	
	СтруктураКонтента.Seller.FnsParticipantId = ДопПараметры.ОтправительИдентификаторЭДО;
	
	Если ДанныеШапки.Свойство("КПППродавца") И ЗначениеЗаполнено(ДанныеШапки.КПППродавца) Тогда
		СтруктураКонтента.Seller.kpp = ДанныеШапки.КПППродавца;
	КонецЕсли;
	
	Если ДанныеШапки.Свойство("Агент") И ЗначениеЗаполнено(ДанныеШапки.Агент) Тогда
		
		ДанныеCreator = Новый_ExtendedOrganizationInfo();
		Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(ДанныеCreator, ДанныеШапки.Агент, ДанныеШапки.Дата, Истина);
		
		СтруктураКонтента.Creator = ДанныеCreator.Name + ", " + СформироватьПредставлениеИННКПП(ДанныеCreator.Inn, ДанныеCreator.Kpp);
		СтруктураКонтента.CreatorBase = Строка(ДанныеШапки.ДоговорАгента);
		
	Иначе
		СтруктураКонтента.Creator = СтруктураКонтента.Seller.Name + ", ИНН/КПП: " + ПредставлениеИННКПП(СтруктураКонтента.Seller);
	КонецЕсли;
	
	Модуль_Интеграция.Заполнить_ExtendedOrganizationInfo(СтруктураКонтента.Buyer, ДанныеШапки.Контрагент, ДанныеШапки.Дата, Истина);
	
	СтруктураКонтента.Buyer.FnsParticipantId = ДопПараметры.ПолучательИдентификаторЭДО;
	
	Если ДанныеШапки.Свойство("КПППокупателя") И ЗначениеЗаполнено(ДанныеШапки.КПППокупателя) Тогда
		СтруктураКонтента.Buyer.kpp = ДанныеШапки.КПППокупателя;
	КонецЕсли;
	
	СтруктураКонтента.Function 	= ДанныеШапки.Функция;
	СтруктураКонтента.Number 	= ДанныеШапки.Номер;
	СтруктураКонтента.Date   	= ДанныеШапки.Дата;
	
	Если ДанныеШапки.Свойство("НомераДляКСФ") Тогда
		
		НомераДляКСФ = ДанныеШапки.НомераДляКСФ;
		
		Если НомераДляКСФ.ЭтоИКСФ Тогда
			СтруктураКонтента.Number 		 = НомераДляКСФ.НомерКСФ;
			СтруктураКонтента.Date  		 = НомераДляКСФ.ДатаКСФ;
			СтруктураКонтента.RevisionNumber = НомераДляКСФ.НомерИКСФ;
			СтруктураКонтента.RevisionDate   = НомераДляКСФ.ДатаИКСФ;
		Иначе
			СтруктураКонтента.Number	= НомераДляКСФ.НомерКСФ;
			СтруктураКонтента.Date		= НомераДляКСФ.ДатаКСФ;
		КонецЕсли;
		
		ЗаполнитьInvoiceForCorrectionInfo(СтруктураКонтента.Invoices, НомераДляКСФ);
		
	КонецЕсли;
	
	СтруктураКонтента.Currency = ?(ПустаяСтрока(ДанныеШапки.ВалютаДокумента), "", СокрЛП(ДанныеШапки.ВалютаДокумента.Код));
	СтруктураКонтента.ВалютаСсылка =  ДанныеШапки.ВалютаДокумента;
	
	ДанныеШапки.Свойство("ИдентификаторГосконтракта", СтруктураКонтента.GovernmentContractInfo);
	
	СтруктураКонтента.AdditionalInfoId.Вставить("StructedAdditionalInfos", ДанныеШапки.ДопИнфо);
	Дополнить_StructedAdditionalInfos_ДопСведениями(СтруктураКонтента.AdditionalInfoId.StructedAdditionalInfos, ДопПараметры.ДополнительныеСведенияСтрокой);
	
	ПересчитыватьВВалютуРегламентированногоУчета	= ПересчитыватьВВалютуРегламентированногоУчета(ВалютаДокумента);
	
	ЗаполнитьInvoiceCorrectionTable(СтруктураКонтента.InvoiceCorrectionTable, СтруктураДокумента.ТабличнаяЧасть, ПересчитыватьВВалютуРегламентированногоУчета);
	
	ЗаполнитьEventContent(СтруктураКонтента.EventContent, ДанныеШапки);
	
	Если ДанныеШапки.Функция = "InvoiceAndBasic" Тогда
		СтруктураКонтента.Name = "Корректировочный счет-фактура и документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	ИначеЕсли ДанныеШапки.Функция = "Basic" Тогда
		СтруктураКонтента.Name = "Документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьInvoiceForCorrectionInfo(Invoices, НомераДляКСФ)
	
	InvoiceForCorrectionInfo 		= Новый_InvoiceForCorrectionInfo();
	СтрокаInvoiceForCorrectionInfo 	= InvoiceForCorrectionInfo.Добавить();
	
	СтрокаInvoiceForCorrectionInfo.InvoiceDate		= НомераДляКСФ.ДатаИсходногоДокумента;
	СтрокаInvoiceForCorrectionInfo.InvoiceNumber	= НомераДляКСФ.НомерИсходногоДокумента;
	
	InvoiceRevisionInfo = Новый_InvoiceRevisionInfo();
	
	Если НомераДляКСФ.УчитыватьИсправлениеИсходногоДокумента Тогда 
		
		СтрокаInvoiceRevisionInfo 	= InvoiceRevisionInfo.Добавить();
		
		СтрокаInvoiceRevisionInfo.RevisionNumber	= Формат(НомераДляКСФ.НомерИсправленияИсходногоДокумента, "ЧДЦ=0; ЧГ=0");
		СтрокаInvoiceRevisionInfo.RevisionDate		= НомераДляКСФ.ДатаИсправленияИсходногоДокумента;
		
	КонецЕсли;
	
	СтрокаInvoiceForCorrectionInfo.InvoiceRevisions = InvoiceRevisionInfo;
	
	Invoices = InvoiceForCorrectionInfo;
	
КонецПроцедуры

Процедура ЗаполнитьInvoiceCorrectionTable(InvoiceCorrectionTable, ТаблицаТоваров, ПересчитыватьВВалютуРегламентированногоУчета)
	
	TotalsDec_Total 				= 0;
	TotalsDec_TotalWithVatExcluded 	= 0;
	TotalsDec_Vat 					= 0;
	
	TotalsInc_Total 				= 0;
	TotalsInc_TotalWithVatExcluded 	= 0;
	TotalsInc_Vat 					= 0;
	
	ЕстьУвеличение = Ложь;
	ЕстьУменьшение = Ложь;
	
	ВсеСтроки_СтавкаНДС_БезНДС	 = Истина;
	ВсеСтроки_СтавкаНДС_ИсчНалАг = Истина;
	
	СтавкаНДС_БезНДС   = СтавкаНДС_БезНДС();
	СтавкаНДС_ИсчНалАг = СтавкаНДС_ИсчНалАг();
	
	Точность = ОбщиеПараметры.ТочностьЦены;
	
	Для Каждого СтрокаДанных Из ТаблицаТоваров Цикл 
		
		Item = InvoiceCorrectionTable.Items.Добавить();
		
		Item.StructedAdditionalInfos = СтрокаДанных.ДопИнфо;
		
		Item.AmountsDec 		= Новый_AmountsDiff();
		Item.AmountsInc 		= Новый_AmountsDiff();
		Item.OriginalValues		= Новый_InvoiceItemFields();
		Item.CorrectedValues 	= Новый_InvoiceItemFields();
		
		Item.ItemTracingInfos	= Новый Массив;
		
		Item.Product		= СтрокаДанных.Номенклатура;
		Item.ItemVendorCode	= СтрокаДанных.КодНоменклатуры;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		
		Item.CorrectedValues.TaxRate = СтрокаДанных.СтавкаНДС;
		Если ЗначениеЗаполнено(СтрокаДанных.СтавкаНДСДоИзменения) Тогда
			Item.OriginalValues.TaxRate	 = СтрокаДанных.СтавкаНДСДоИзменения;
		Иначе
			Item.OriginalValues.TaxRate	 = СтрокаДанных.СтавкаНДС;							 
		КонецЕсли;								 
		
		Если НРег(Item.CorrectedValues.TaxRate) <> НРег(СтавкаНДС_БезНДС) Тогда
			ВсеСтроки_СтавкаНДС_БезНДС = Ложь;
		КонецЕсли;
		
		Если Item.CorrectedValues.TaxRate <> СтавкаНДС_ИсчНалАг Тогда
			ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
		КонецЕсли;
		
		Item.OriginalValues.TotalWithVatExcluded  = СтрокаДанных.СуммаДоИзменения - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДСДоИзменения, 0);
		Item.CorrectedValues.TotalWithVatExcluded = СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.суммаНДС, 0);
		
		Если  ЗначениеЗаполнено(СтрокаДанных.КоличествоДоИзменения) Тогда
			
			Item.OriginalValues.Quantity 	= СтрокаДанных.КоличествоДоИзменения;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения) Тогда
				
				Item.OriginalValues.UnitCode	= XML_КодЕдиницыИзмерения(СтрокаДанных.КодЕдиницыИзмеренияДоИзменения);
				
				Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаДанных.ЕдиницаИзмеренияДоИзменения, "Наименование") Тогда
					Item.OriginalValues.UnitName = СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Наименование;
				Иначе
					Item.OriginalValues.UnitName = СокрЛП(СтрокаДанных.ЕдиницаИзмеренияДоИзменения);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПересчитыватьВВалютуРегламентированногоУчета Тогда
				
				Item.OriginalValues.Price = ?(СтрокаДанных.СуммаВключаетНДС,
				Окр((СтрокаДанных.СуммаДоИзменения - СтрокаДанных.СуммаНДСДоИзменения) / СтрокаДанных.КоличествоДоИзменения, Точность),
				Окр(СтрокаДанных.СуммаДоИзменения / СтрокаДанных.КоличествоДоИзменения, Точность)
				);
				
			Иначе
				
				Item.OriginalValues.Price = ?(СтрокаДанных.СуммаВключаетНДС,
				Окр((СтрокаДанных.СуммаДоИзменения - СтрокаДанных.СуммаНДСДоИзменения) / СтрокаДанных.КоличествоДоИзменения, Точность),
				Окр(СтрокаДанных.ЦенаДоИзменения, Точность)
				);	
				
			КонецЕсли;
			
		Иначе
			// не инициируем поля UnitCode, UnitName, Quantity, Price, чтобы в печатной форме ЭД были прочерки   
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(СтрокаДанных.Количество) Тогда
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
				
				Item.CorrectedValues.UnitCode = XML_КодЕдиницыИзмерения(СтрокаДанных.КодЕдиницыИзмерения);
				
				Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаДанных.ЕдиницаИзмерения, "Наименование") Тогда
					Item.CorrectedValues.UnitName = СтрокаДанных.ЕдиницаИзмерения.Наименование;
				Иначе
					Item.CorrectedValues.UnitName = СокрЛП(СтрокаДанных.ЕдиницаИзмерения);
				КонецЕсли;
				
			КонецЕсли;
			
			// если до количество было, а теперь его не стало - заполняем 0, а не "-"!!!
			Если ЗначениеЗаполнено(СтрокаДанных.КоличествоДоИзменения) И Не ЗначениеЗаполнено(СтрокаДанных.Количество) Тогда
				Item.CorrectedValues.Quantity 	= 0;
			Иначе
				Item.CorrectedValues.Quantity 	= СтрокаДанных.Количество;
				
				Если ПересчитыватьВВалютуРегламентированногоУчета Тогда
					
					Item.CorrectedValues.Price  	= ?(СтрокаДанных.СуммаВключаетНДС, 
					Окр((СтрокаДанных.Сумма - СтрокаДанных.СуммаНДС) / СтрокаДанных.Количество, Точность),
					Окр(СтрокаДанных.Сумма / СтрокаДанных.Количество, Точность)
					);
					
				Иначе	
					
					Item.CorrectedValues.Price  	= ?(СтрокаДанных.СуммаВключаетНДС, 
					Окр((СтрокаДанных.Сумма - СтрокаДанных.СуммаНДС) / СтрокаДанных.Количество, Точность),
					Окр(СтрокаДанных.Цена, Точность)
					);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			// не инициируем поля UnitCode, UnitName, Quantity, Price, чтобы в печатной форме ЭД были прочерки   
		КонецЕсли;
		
		// НДС и сумма с НДС до изменения
		Если Item.OriginalValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.OriginalValues.Vat = 0;
			Item.OriginalValues.Total = 0;
		Иначе
			
			Если НРег(Item.OriginalValues.TaxRate) = НРег(СтавкаНДС_БезНДС) Тогда
				Item.OriginalValues.Vat = Неопределено;
			Иначе
				Item.OriginalValues.Vat = СтрокаДанных.СуммаНДСДоИзменения;
			КонецЕсли;
			
			Item.OriginalValues.Total   = СтрокаДанных.СуммаДоИзменения + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДСДоИзменения);
			
		КонецЕсли;
		
		// НДС и сумма с НДС после изменения
		Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.CorrectedValues.Vat = 0;
			Item.CorrectedValues.Total = 0;
		Иначе
			
			Если НРег(Item.CorrectedValues.TaxRate) = НРег(СтавкаНДС_БезНДС) Тогда
				Item.CorrectedValues.Vat = Неопределено;
			Иначе
				Item.CorrectedValues.Vat = СтрокаДанных.СуммаНДС;
			КонецЕсли;
			
			Item.CorrectedValues.Total = СтрокаДанных.Сумма + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
			
		КонецЕсли;
		
		
		Если Item.CorrectedValues.TotalWithVatExcluded >= Item.OriginalValues.TotalWithVatExcluded Тогда
			
			// Увеличение
			ЕстьУвеличение = Истина;
			
			Item.AmountsDec.TotalWithVatExcluded = Неопределено;
			Item.AmountsDec.Vat 	= Неопределено;
			Item.AmountsDec.Total 	= Неопределено;
			
			Item.AmountsInc.TotalWithVatExcluded = Item.CorrectedValues.TotalWithVatExcluded - Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsInc.Vat 	= Неопределено;
				Item.AmountsInc.Total 	= Неопределено;
			Иначе
				
				Если НРег(Item.CorrectedValues.TaxRate) = НРег(СтавкаНДС_БезНДС) Тогда
					Item.AmountsInc.Vat = 0;
				Иначе
					Item.AmountsInc.Vat = ПривестиКЧислу(Item.CorrectedValues.Vat) - ПривестиКЧислу(Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsInc.Total = Item.CorrectedValues.Total - Item.OriginalValues.Total;
				
			КонецЕсли;
			
		Иначе
			
			// Уменьшение
			ЕстьУменьшение = Истина;
			
			Item.AmountsInc.TotalWithVatExcluded = Неопределено;
			Item.AmountsInc.Vat 	= Неопределено;
			Item.AmountsInc.Total 	= Неопределено;
			
			Item.AmountsDec.TotalWithVatExcluded = - Item.CorrectedValues.TotalWithVatExcluded + Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsDec.Vat 	= Неопределено;
				Item.AmountsDec.Total 	= Неопределено;
			Иначе
				
				Если НРег(Item.CorrectedValues.TaxRate) = НРег(СтавкаНДС_БезНДС) Тогда
					Item.AmountsDec.Vat = 0;
				Иначе
					Item.AmountsDec.Vat = - ПривестиКЧислу(Item.CorrectedValues.Vat) + ПривестиКЧислу(Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsDec.Total = -Item.CorrectedValues.Total + Item.OriginalValues.Total;
				
			КонецЕсли;
			
		КонецЕсли;
		
		TotalsDec_Total 				= TotalsDec_Total + ПривестиКЧислу(Item.AmountsDec.Total);
		TotalsDec_TotalWithVatExcluded 	= TotalsDec_TotalWithVatExcluded + ПривестиКЧислу(Item.AmountsDec.TotalWithVatExcluded);
		TotalsDec_Vat 					= TotalsDec_Vat + ПривестиКЧислу(Item.AmountsDec.Vat);
		
		TotalsInc_Total 				= TotalsInc_Total + ПривестиКЧислу(Item.AmountsInc.Total);
		TotalsInc_TotalWithVatExcluded 	= TotalsInc_TotalWithVatExcluded + ПривестиКЧислу(Item.AmountsInc.TotalWithVatExcluded);
		TotalsInc_Vat 					= TotalsInc_Vat + ПривестиКЧислу(Item.AmountsInc.Vat);
		
		Если НЕ СтрокаДанных.ЭтоУслуга Тогда
			
			СведенияОСтранеПроисхожденияТовара = КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных);
			
			ДопИнформацияОСтранеПроисхождения = СведенияОСтранеПроисхожденияСтрокой(СведенияОСтранеПроисхожденияТовара);
			
			Дополнить_StructedAdditionalInfos_ДопСведениями(Item.StructedAdditionalInfos, ДопИнформацияОСтранеПроисхождения);
			
		КонецЕсли;
		
	КонецЦикла;	  
	
	Если ЕстьУвеличение Тогда
		InvoiceCorrectionTable.TotalsInc.Total 					= TotalsInc_Total; 
		InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded 	= TotalsInc_TotalWithVatExcluded; 
		Если ВсеСтроки_СтавкаНДС_БезНДС Тогда
			InvoiceCorrectionTable.TotalsInc.Vat = Неопределено;
		ИначеЕсли ВсеСтроки_СтавкаНДС_ИсчНалАг Тогда
			InvoiceCorrectionTable.TotalsInc.Vat = 0;
		Иначе
			InvoiceCorrectionTable.TotalsInc.Vat = TotalsInc_Vat;
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьУменьшение Тогда
		InvoiceCorrectionTable.TotalsDec.Total					= TotalsDec_Total; 
		InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded 	= TotalsDec_TotalWithVatExcluded; 
		Если ВсеСтроки_СтавкаНДС_БезНДС Тогда
			InvoiceCorrectionTable.TotalsDec.Vat = Неопределено;
		ИначеЕсли ВсеСтроки_СтавкаНДС_ИсчНалАг Тогда
			InvoiceCorrectionTable.TotalsDec.Vat = 0;
		Иначе
			InvoiceCorrectionTable.TotalsDec.Vat = TotalsDec_Vat;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьEventContent(EventContent, ШапкаУКД)
	
	Для Каждого ПередаточныйДокумент Из ШапкаУКД.РеквизитыПередаточныхДокументов Цикл	
		
		Новый_BaseDocument = EventContent.TransferDocDetails736.Добавить();
		
		Новый_BaseDocument.BaseDocumentName 	= ПередаточныйДокумент.BaseDocumentName;
		Новый_BaseDocument.BaseDocumentNumber 	= ПередаточныйДокумент.BaseDocumentNumber;
		Новый_BaseDocument.BaseDocumentDate 	= ПередаточныйДокумент.BaseDocumentDate;
		
	КонецЦикла;
	
	Если ШапкаУКД.Свойство("ИныеСведенияОбИзмененииСтоимости") Тогда
		EventContent.CostChangeInfo = ШапкаУКД.ИныеСведенияОбИзмененииСтоимости;
	КонецЕсли;
	Если ШапкаУКД.Свойство("ДатаУведомления") Тогда
		EventContent.NotificationDate = ШапкаУКД.ДатаУведомления;
	КонецЕсли;
	
	EventContent.OperationContent = "Изменение стоимости товаров и услуг";
	
	ОснованияПередачи = ШапкаУКД.ОснованияПередачи;
	Если ОснованияПередачи.Количество() > 0 Тогда
		Для Каждого ОснованиеПередачи Из ОснованияПередачи Цикл
			СтрокаCorrectionBases = EventContent.CorrectionBases.Добавить();			
			ЗаполнитьЗначенияСвойств(СтрокаCorrectionBases, ОснованиеПередачи);
		КонецЦикла;
	Иначе
		СтрокаCorrectionBases = EventContent.CorrectionBases.Добавить();			
		СтрокаCorrectionBases.BaseDocumentName = ОснованиеПередачи_БезДокументаОснования();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтентНакладной172(Content, СтруктураДокумента, ДополнительныеПараметры)
	
	НомерЗаказа						 = ДополнительныеПараметры.НомерЗаказа;
	ПараметрыСогласования			 = ДополнительныеПараметры.ПараметрыСогласования;
	ДополнительныеСведенияСтрокой	 = ДополнительныеПараметры.ДополнительныеСведенияСтрокой;
	
	ДанныеШапки					 = СтруктураДокумента.ДанныеШапки;
	БанковскийСчетОрганизации	 = СтруктураДокумента.БанковскийСчетОрганизации;
	СтруктураДоговора			 = СтруктураДокумента.СтруктураДоговора;
	ТаблицаТоваров				 = СтруктураДокумента.ТаблицаТоваров;
	
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Seller, ДанныеШапки.Организация,  ДанныеШапки.Дата,  БанковскийСчетОрганизации , Истина);
	
	ГрузоотправительСсылка = ?((ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) = Ложь) Или (ДанныеШапки.Грузоотправитель = "он же"),  ДанныеШапки.Организация, ДанныеШапки.Грузоотправитель);
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Shipper, ГрузоотправительСсылка, ДанныеШапки.Дата, , Ложь);
	
	Content.ShipperDepartment =  ДанныеШапки.Подразделение;
	
	ГрузополучательСсылка = ?(ЗначениеЗаполнено(ДанныеШапки.Грузополучатель), ДанныеШапки.Грузополучатель, ДанныеШапки.Контрагент);
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Consignee,  ГрузополучательСсылка, ДанныеШапки.Дата, , Ложь, , ДанныеШапки.АдресДоставки);
	
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Buyer, ДанныеШапки.Контрагент, ДанныеШапки.Дата, , Истина);
	
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда 
		content.GroundName 		= "Заказ";
		content.GroundNumber 	= СокрЛП(НомерЗаказа);
	Иначе	
		content.GroundName 		= СтруктураДоговора.GroundName;
		content.GroundDate 		= СтруктураДоговора.GroundDate;
		content.GroundNumber 	= СтруктураДоговора.GroundNumber;
	КонецЕсли;	
	content.Number =  ДанныеШапки.Номер;
	content.Date   = ДанныеШапки.Дата;
	
	ИдКонтрагента = Модуль_Данные1С_СвязиОбъектов().Контрагент_2_CounteragentBoxID(ДанныеШапки.Контрагент);
	
	Если НужноФормироватьДопИнфоПоШаблону(ИдКонтрагента) = Истина Тогда
		content.AdditionalInfo = СформироватьСтрокуДопИнфоПоШаблону(ДополнительныеСведенияСтрокой);
	Иначе
		content.AdditionalInfo = СформироватьСтрокуДопИнфо(ДополнительныеСведенияСтрокой, ДанныеШапки.Допинфо);
	КонецЕсли;
	
	TotalParcelsQuantity 	= 0;
	TotalGrossQuantity 		= 0;
	TotalMassQuantity		= 0;			
	
	Точность = ОбщиеПараметры.ТочностьЦены;
	
	Для каждого строкаТаблицы Из ТаблицаТоваров Цикл 
		
		XmlTorg12ItemContent= content.items.добавить();
		
		XmlTorg12ItemContent.Product =  		СтрокаТаблицы.Номенклатура;
		XmlTorg12ItemContent.ProductCode =	СтрокаТаблицы.КодНоменклатуры;
		XmlTorg12ItemContent.UnitCode =		ItemContent_UnitCode(СтрокаТаблицы.ЕдиницаИзмерения, СтрокаТаблицы.КодЕдиницыИзмерения);
		XmlTorg12ItemContent.UnitName =		СтрокаТаблицы.ЕдиницаИзмерения.Наименование;
		XmlTorg12ItemContent.Quantity =  	СтрокаТаблицы.Количество;
		XmlTorg12ItemContent.TaxRate =		СтрокаТаблицы.СтавкаНДС;
		XmlTorg12ItemContent.Vat =			СтрокаТаблицы.СуммаНДС;
		XmlTorg12ItemContent.Total =			СтрокаТаблицы.Сумма + ?(СтрокаТаблицы.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
		XmlTorg12ItemContent.TotalWithVatExcluded= XmlTorg12ItemContent.Total - XmlTorg12ItemContent.Vat;
		
		РасчетнаяЦена = Окр(XmlTorg12ItemContent.TotalWithVatExcluded / ?(XmlTorg12ItemContent.Quantity = 0, 1, XmlTorg12ItemContent.Quantity), Точность);
		ОтклонениеОтРасчетной =  (РасчетнаяЦена-СтрокаТаблицы.Цена)*СтрокаТаблицы.Количество;
		
		Если (СтрокаТаблицы.СуммаВключаетНДС = Истина) Или (Макс(ОтклонениеОтРасчетной, -ОтклонениеОтРасчетной)>0.03) Тогда
			XmlTorg12ItemContent.Price = РасчетнаяЦена ;	
		Иначе
			XmlTorg12ItemContent.Price = СтрокаТаблицы.Цена;
		КонецЕсли;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(XmlTorg12ItemContent, строкаТаблицы);
		
		XmlTorg12ItemContent.AdditionalInfo 		= строкаТаблицы.ДопИнфо;
		
		Если ЗначениеЗаполнено(строкаТаблицы.КоличествоМест) Тогда
			XmlTorg12ItemContent.ParcelsQuantity =  строкаТаблицы.КоличествоМест;
			XmlTorg12ItemContent.ParcelCapacity  =  строкаТаблицы.КоличествоВОдномМесте;
			XmlTorg12ItemContent.ParcelType      =  ?(ЗначениеЗаполнено(строкаТаблицы.ВидУпаковки), строкаТаблицы.ВидУпаковки.Наименование, "");
			XmlTorg12ItemContent.GrossQuantity   =  строкаТаблицы.Масса;
			TotalGrossQuantity      = TotalGrossQuantity + ?(ЗначениеЗаполнено(XmlTorg12ItemContent.GrossQuantity), XmlTorg12ItemContent.GrossQuantity, 0);
			TotalParcelsQuantity = TotalParcelsQuantity + XmlTorg12ItemContent.ParcelsQuantity;
		КонецЕсли;	
		
		TotalMassQuantity = TotalMassQuantity + XmlTorg12ItemContent.Quantity;
		
	КонецЦикла;
	content.Totals.ParcelsQuantity 			= TotalParcelsQuantity;
	content.Totals.GrossQuantity 			= TotalGrossQuantity;
	content.Totals.Quantity 				= TotalMassQuantity;
	
	content.Totals.TotalWithVatExcluded 	= ДанныеШапки.СуммаБезНДСДокумента;
	content.Totals.Total 					= ДанныеШапки.СуммаДокумента;
	content.Totals.Vat 						= ДанныеШапки.СуммаНДСДокумента;
	
	content.SupplyDate 						= content.Date; 
	
	Content.commons.TotalSumInWords =   Модуль_Интеграция.ПолучитьСуммуПрописьюДиадок(ДанныеШапки.СуммаДокумента,  ПолучитьВалютуРегламентированногоУчета() );
	Если ЗначениеЗаполнено(TotalParcelsQuantity) Тогда
		Content.commons.TotalParcelsQuantityInWords = стрзаменить(числоПрописью(TotalParcelsQuantity, "ДП = Ложь"), "  00", "");
	КонецЕсли;	
	
	Если Не ЗапущенКакВнешнийМодуль Тогда
		
		Если ПараметрыСогласования = Неопределено Тогда
			
			ПараметрыПодписания = Модуль_Данные1С_СвязиОбъектов().ПолучитьПараметрыПодписанияТ12вДиадок(ДанныеШапки.Организация);
		Иначе
			
			ПараметрыПодписания = Новый Структура;
			
			ПараметрыПодписания.Вставить("СпособПодписания", ОдинСАдаптер_НастройкиТекущегоПользователя_ПолучитьНастройку(Модуль_Данные1С_СвязиОбъектов().ИдентификаторСвойстваСпособПодписанияТ12()));
			
			Если ЗначениеЗаполнено(ПараметрыСогласования.ФИОПодписанта) Тогда
				ПараметрыПодписания.Вставить("ФИОПодписанта"	  , ПараметрыСогласования.ФИОПодписанта);
				ПараметрыПодписания.Вставить("ДолжностьПодписанта", ?(НЕ ПустаяСтрока(ПараметрыСогласования.ДолжностьПодписанта), ПараметрыСогласования.ДолжностьПодписанта, "_"));
			Иначе
				ПараметрыПодписания.Вставить("ФИОПодписанта"	  , ПараметрыСогласования.ФИОПолучателя);
				ПараметрыПодписания.Вставить("ДолжностьПодписанта", ?(НЕ ПустаяСтрока(ПараметрыСогласования.ДолжностьПолучателя), ПараметрыСогласования.ДолжностьПолучателя, "_"));
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыПодписания.СпособПодписания = "3" Или ПараметрыПодписания.СпособПодписания = "4" Тогда
			заполнитьПодписантаДляXmlTorg12(content.SupplyPerformedBy,  ПредставлениеВизирующего(ПараметрыПодписания));
		КонецЕсли;	
		Если (ПараметрыПодписания.СпособПодписания <> "2") И (ПараметрыПодписания.СпособПодписания <> "3") Тогда 
			заполнитьПодписантаДляXmlTorg12(content.SupplyAllowedBy,  ПредставлениеВизирующего(ПараметрыПодписания));
		КонецЕсли;
		Если ПараметрыПодписания.СпособПодписания = "2" Или ПараметрыПодписания.СпособПодписания = "4" Тогда 
			ПараметрыПодписания.ДолжностьПодписанта = "Главный (старший) бухгалтер";
			заполнитьПодписантаДляXmlTorg12(content.ChiefAccountant,  ПредставлениеВизирующего(ПараметрыПодписания));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтентАкта172(Content, СтруктураДокумента, ДополнительныеПараметры)
	
	ПараметрыСогласования			 = ДополнительныеПараметры.ПараметрыСогласования;
	ДополнительныеСведенияСтрокой	 = ДополнительныеПараметры.ДополнительныеСведенияСтрокой;
	
	ДанныеШапки					 = СтруктураДокумента.ДанныеШапки;
	БанковскийСчетОрганизации	 = СтруктураДокумента.БанковскийСчетОрганизации;
	СтруктураДоговора			 = СтруктураДокумента.СтруктураДоговора;
	ТаблицаТоваров				 = СтруктураДокумента.ТаблицаТоваров;
	
	// поставщик: организация-продавец
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Seller, ДанныеШапки.Организация,  ДанныеШапки.Дата,  БанковскийСчетОрганизации, Истина);
	
	ПредставлениеИсполнителя = Модуль_Интеграция.ПолучитьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Организация, ДанныеШапки.Дата);
	ПредставлениеЗаказчика   = Модуль_Интеграция.ПолучитьПредставлениеКонтрагентаДляАкта(ДанныеШапки.Контрагент, ДанныеШапки.Дата);
	
	
	НомерДоговора = ?(СтруктураДоговора.GroundNumber = "", "", " по договору № " + СтруктураДоговора.GroundNumber);
	ДатаДоговора = ?(СтруктураДоговора.GroundDate = Дата(1, 1, 1), "", " от " + Формат(СтруктураДоговора.GroundDate, "ДФ=dd.MM.yyyy"));
	ДатаДоговора =
		?((СтруктураДоговора.GroundNumber
			= "" И СтруктураДоговора.GroundDate <> Дата(1, 1, 1)), " по договору " + ДатаДоговора, ДатаДоговора);
	
	текстАкта =
		"Мы, нижеподписавшиеся, представитель " + ПредставлениеИсполнителя
		+ " (далее «Исполнитель»), с одной стороны, и представитель " + ПредставлениеЗаказчика + " (далее «Заказчик»), с другой стороны," +
		" составили настоящий акт о том, что «Исполнитель» выполнил, а  «Заказчик» принял следующие работы (услуги)"
		+ НомерДоговора + ДатаДоговора + ":";
	
	
	// прочие реквизиты шапки	
	content.Number = ДанныеШапки.Номер;
	content.Date   = ДанныеШапки.Дата;
	content.Title  = текстАкта;
	
	ИдКонтрагента = Модуль_Данные1С_СвязиОбъектов().Контрагент_2_CounteragentBoxID(ДанныеШапки.Контрагент);
	
	Если НужноФормироватьДопИнфоПоШаблону(ИдКонтрагента) = Истина Тогда
		content.AdditionalInfo = СформироватьСтрокуДопИнфоПоШаблону(ДополнительныеСведенияСтрокой);
	Иначе
		content.AdditionalInfo = СформироватьСтрокуДопИнфо(ДополнительныеСведенияСтрокой, ДанныеШапки.Допинфо);
	КонецЕсли;
	
	content.SignatureDate =	content.Date;
	
	Точность = ОбщиеПараметры.ТочностьЦены;
	
	Для каждого строкаТаблицы Из ТаблицаТоваров Цикл 
		Item = content.items.Добавить();
		Если (ЗначениеЗаполнено(строкаТаблицы.Количество) = Ложь)
			Или (ЗначениеЗаполнено(строкаТаблицы.КодЕдиницыИзмерения) = Ложь)
			Или (ЗначениеЗаполнено(строкаТаблицы.Сумма) = Ложь) Тогда
			Item.Description =  строкаТаблицы.Номенклатура;
		Иначе 
			Item.Name = СтрокаТаблицы.Номенклатура;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.КодЕдиницыИзмерения) Тогда
			Item.UnitCode = ItemContent_UnitCode(СтрокаТаблицы.ЕдиницаИзмерения, СтрокаТаблицы.КодЕдиницыИзмерения);
			Если Item.UnitCode = "" И ЗначениеЗаполнено(Item.Name) Тогда
				Item.Description = 	Item.Name;
				Item.Name = 			Неопределено;	
			КонецЕсли;
		Иначе
			Item.UnitCode = "";
		КонецЕсли;
		
		Item.UnitName 	=  ?(ЗначениеЗаполнено(строкаТаблицы.ЕдиницаИзмерения), строкаТаблицы.ЕдиницаИзмерения.Наименование, "");
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			Item.Quantity = СтрокаТаблицы.Количество;
		КонецЕсли;
		
		Item.Vat 		=  строкаТаблицы.СуммаНДС;
		Item.Total 		=  строкаТаблицы.Сумма + ?(строкаТаблицы.СуммаВключаетНДС, 0, строкаТаблицы.СуммаНДС) ;
		Item.TotalWithVatExcluded = Item.Total - Item.Vat;
		Item.Price 		=  ?(НЕ ЗначениеЗаполнено(item.Quantity), Неопределено, Окр(item.TotalWithVatExcluded / item.Quantity, Точность));
		
		Если ЗначениеЗаполнено(item.Quantity) Тогда
			РасчетнаяЦена = Окр(item.TotalWithVatExcluded / item.Quantity, Точность);
			ОтклонениеОтРасчетной =  (РасчетнаяЦена - строкаТаблицы.Цена) * строкаТаблицы.Количество;
			Если (строкаТаблицы.СуммаВключаетНДС = Истина) Или (Макс(ОтклонениеОтРасчетной, -ОтклонениеОтРасчетной) > 0.03) Тогда
				item.price = РасчетнаяЦена;	
			Иначе
				item.price = строкаТаблицы.Цена;	
			КонецЕсли;
		Иначе 
			Item.Price   = Неопределено;
		КонецЕсли;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, строкаТаблицы);
		
		Item.AdditionalInfo = строкаТаблицы.ДопИнфо;
		
		Если Item.Total = 0 Тогда
			Item.Total = Неопределено;
		КонецЕсли;
		Если  Item.TotalWithVatExcluded = 0 Тогда
			Item.TotalWithVatExcluded = Неопределено;
		КонецЕсли;
		Если  Item.Vat = 0 И СтрокаТаблицы.СтавкаНДС = "" Тогда
			Item.Vat = Неопределено;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если Не ЗапущенКакВнешнийМодуль Тогда
		Если ПараметрыСогласования <> Неопределено И ЗначениеЗаполнено(ПараметрыСогласования.ФИОПодписанта) Тогда
			ЗаполнитьФИОПодписанта(content.Official, ПараметрыСогласования.ФИОПодписанта);
			content.Official.JobTitle = СокрЛП(?(НЕ ПустаяСтрока(ПараметрыСогласования.ДолжностьПодписанта), ПараметрыСогласования.ДолжностьПодписанта, "_"));
		Иначе
			ПараметрыПодписания = Модуль_Данные1С_СвязиОбъектов().ПолучитьПараметрыПодписанияТ12вДиадок(ДанныеШапки.Организация);
			заполнитьПодписантаДляXmlTorg12(content.Official,  ПредставлениеВизирующего(параметрыПодписания));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтентФормализованногоСчета(Content, СтруктураДокумента, ДополнительныеПараметры)
	
	Шапка	 = СтруктураДокумента.Шапка;
	ДанныеТЧ = СтруктураДокумента.ДанныеТЧ;
	
	Content.DocumentDate	 = Шапка.Дата;
	Content.DocumentNumber	 = Шапка.НомерНаПечать;
	
	Content.Currency	 = Шапка.ВалютаДокументаКод;
	Content.CurrencyRate = Шапка.КурсДокумента;
	
	// Заполнение сведений о продавце и получателе платежа
	Продавец	 = Шапка.Организация;
	Получатель	 = Шапка.ПолучательПлатежа;
	Если Получатель = Продавец Тогда 
		Получатель = Неопределено;
	КонецЕсли;
	
	СчетПродавца	 = ?(ЗначениеЗаполнено(Получатель), Неопределено, Шапка.БанковскийСчетОрганизации);
	СчетПолучателя	 = Шапка.БанковскийСчетОрганизации;
	
	РеквизитыПродавца = РеквизитыЮрФизЛица(Продавец, Шапка.Дата, СчетПродавца);
	ПрочитатьСведенияОбАдресахЮрФизЛица(РеквизитыПродавца);
	ЗаполнитьИнформациюОбОрганизации(Content.Seller, РеквизитыПродавца);
	
	Если ЗначениеЗаполнено(Получатель) Тогда 
		РеквизитыПолучателя = РеквизитыЮрФизЛица(Получатель, Шапка.Дата, СчетПолучателя);
		ПрочитатьСведенияОбАдресахЮрФизЛица(РеквизитыПолучателя);
		ЗаполнитьИнформациюОбОрганизации(Content.Recipient, РеквизитыПолучателя);
	Иначе 
		Content.Recipient = Неопределено;
	КонецЕсли;
	
	// Заполнение сведений о покупателе и плательщике
	Покупатель = Шапка.Контрагент;
	Плательщик = Шапка.Плательщик;
	Если Плательщик = Покупатель Тогда 
		Плательщик = Неопределено;
	КонецЕсли;
	
	СчетПокупателя = ?(ЗначениеЗаполнено(Плательщик), Неопределено, Шапка.БанковскийСчетКонтрагента);
	СчетПлательщика = Шапка.БанковскийСчетКонтрагента;
	
	ПараметрыЗапросаКИ = ПараметрыПолученияКонтактнойИнформацииЮрФизЛица();
	ПараметрыЗапросаКИ.АдресДоставки = Шапка.АдресДоставки;
	
	РеквизитыПокупателя = РеквизитыЮрФизЛица(Покупатель, Шапка.Дата, СчетПокупателя);
	ПрочитатьСведенияОбАдресахЮрФизЛица(РеквизитыПокупателя, ПараметрыЗапросаКИ);
	ЗаполнитьИнформациюОбОрганизации(Content.Buyer, РеквизитыПокупателя, ПараметрыЗапросаКИ);
	
	Если ЗначениеЗаполнено(Плательщик) Тогда 
		РеквизитыПлательщика = РеквизитыЮрФизЛица(Плательщик, Шапка.Дата, СчетПлательщика);
		ПрочитатьСведенияОбАдресахЮрФизЛица(РеквизитыПлательщика);
		ЗаполнитьИнформациюОбОрганизации(Content.Payer, РеквизитыПлательщика);
	Иначе 
		Content.Payer = Неопределено;
	КонецЕсли;
	
	Договор = РеквизитыДоговора(Шапка);
	Если ЗначениеЗаполнено(Договор) Тогда 
		Content.Contract.Name	 = Договор.Представление;
		Content.Contract.Number	 = Договор.Номер;
		Content.Contract.Date	 = Договор.Дата;
	Иначе 
		Content.Contract = Неопределено;
	КонецЕсли;
	
	Content.GovernmentContractInfo = Шапка.ИдентификаторГосКонтракта;
	Content.PaymentPurpose = Шапка.НазначениеПлатежа;
	
	ИнфоПоля = Новый Структура;
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().ДополнительныеУсловия	, Шапка.ДополнительныеУсловия);
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().ДополнительнаяИнформация, Шапка.ДополнительнаяИнформация);
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().ИдентификаторПлатежа	, Шапка.ИдентификаторПлатежа);
	ИнфоПоля.Вставить(ЗарезервированныеИменаИнфоПолей().СрокОплаты				, Шапка.СрокОплаты);
	
	Для Каждого Поле Из ИнфоПоля Цикл 
		Если ЗначениеЗаполнено(Поле.Значение) Тогда 
			ДополнитьМассивKeyValue(Content.StructedAdditionalInfos, Поле.Ключ, Поле.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьТаблицуСчетаНаОплату(Content.ProformaInvoiceTable, ДанныеТЧ);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентСчетаФактуры93(Content, ДанныеДляПечати, ДополнительныеПараметры)
	
	ДанныеСотрудника				 = ДополнительныеПараметры.ДанныеСотрудника;
	ПараметрыСогласования			 = ДополнительныеПараметры.ПараметрыСогласования;
	ДополнительныеСведенияСтрокой	 = ДополнительныеПараметры.ДополнительныеСведенияСтрокой;
	
	Content.Number 	= ДанныеДляПечати.НомераДляСФ.НомерДокумента;
	Content.Date 	= ДанныеДляПечати.НомераДляСФ.ДатаДокумента;
	Если ДанныеДляПечати.НомераДляСФ.ЭтоИСФ Тогда
		Content.InvoiceRevisionNumber 	= ДанныеДляПечати.НомераДляСФ.НомерИсправления;
		Content.InvoiceRevisionDate 	= ДанныеДляПечати.НомераДляСФ.ДатаИсправления;
	КонецЕсли;	
	
	Для каждого ПРД Из ДанныеДляПечати.ДатаНомерДокументовОплаты Цикл 
		Стр = content.PaymentDocuments.Добавить();
		Стр.Number = ПРД.НомерПлатежноРасчетногоДокумента;
		Стр.date   = ПРД.ДатаПлатежноРасчетногоДокумента;
	КонецЦикла;	
	
	content.currency 		= ?(ПустаяСтрока(ДанныеДляПечати.ВалютаДокумента), "", СокрЛП(ДанныеДляПечати.ВалютаДокумента.Код));
	content.ВалютаСсылка 	= ДанныеДляПечати.ВалютаДокумента;
	
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент, ДанныеДляПечати.Дата, , Истина, Истина);
	Если ЗначениеЗаполнено(ДанныеДляПечати.КПППокупателя) Тогда
		Content.Buyer.kpp = ДанныеДляПечати.КПППокупателя
	КонецЕсли;	
	
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Seller, ДанныеДляПечати.Организация, ДанныеДляПечати.Дата, , Истина, Истина);
	
	Попытка
		Если НЕ ДанныеДляПечати.Свойство("Поставщик") // Если есть свойство "Поставщик", значит Грузоотправитель уже обработан
			И ДанныеДляПечати.Организация <> Content.Seller.Ссылка Тогда
			
			//значит ДанныеДляПечати.Организация является подразделением Content.Seller.Ссылка 
			ДанныеДляПечати.Грузоотправитель = ДанныеДляПечати.Организация;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ДанныеДляПечати.Грузоотправитель = "он же" Тогда 
		Content.Shipper.SameAsSellerOrBuyer = Истина;
	ИначеЕсли ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель) Тогда  
		Модуль_Интеграция.ЗаполнитьСтруктуруГрузоПолучателяОтправителя(Content.Shipper, ДанныеДляПечати.Грузоотправитель, ДанныеДляПечати.Дата); 
	Иначе 
		Content.Shipper.SameAsSellerOrBuyer = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель) Тогда
		Модуль_Интеграция.ЗаполнитьСтруктуруГрузоПолучателяОтправителя(Content.Consignee, ДанныеДляПечати.Грузополучатель, ДанныеДляПечати.Дата, ДанныеДляПечати.АдресДоставки); 
		Если ЗначениеЗаполнено(ДанныеДляПечати.АдресДоставки) Тогда
			Модуль_Интеграция.ЗаполнитьСтруктуруАдреса(Content.Consignee.Address, ДанныеДляПечати.Контрагент, , ДанныеДляПечати.АдресДоставки);
		КонецЕсли;
	Иначе 
		Content.Consignee.SameAsSellerOrBuyer = Ложь;
	КонецЕсли;
	
	Content.StructedAdditionalInfos = ДанныеДляПечати.ДопИнфо;
	Дополнить_StructedAdditionalInfos_ДопСведениями(Content.StructedAdditionalInfos, ДополнительныеСведенияСтрокой);
	
	Точность = ОбщиеПараметры.ТочностьЦены;
	
	Для каждого Стр Из ДанныеДляПечати.ТабличнаяЧасть Цикл
		
		item = content.items.Добавить();
		
		item.Product = Стр.Номенклатура;
		
		Если Стр.Количество = 0 ИЛИ ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) = Ложь Тогда
			item.UnitCode 				= Неопределено;
			item.Quantity 				= Неопределено;
		Иначе
			
			Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
				item.UnitCode = ItemContent_UnitCode(Стр.ЕдиницаИзмерения, Стр.КодЕдиницыИзмерения);
			Иначе
				item.UnitCode = "";
			КонецЕсли;
			
			item.Quantity 				= Стр.Количество;
		КонецЕсли;
		
		Если ДанныеДляПечати.СФНаАванс = Ложь Тогда 
			
			item.TotalWithVatExcluded = Стр.Сумма - ?(Стр.СуммаВключаетНДС, Стр.суммаНДС, 0);
			
			Если ЗначениеЗаполнено(item.Quantity) Тогда
				
				РасчетнаяЦена = Окр(item.TotalWithVatExcluded / item.Quantity, Точность);
				ОтклонениеОтРасчетной = (РасчетнаяЦена - Стр.Цена) * Стр.Количество;
				Если Стр.СуммаВключаетНДС = Истина ИЛИ Макс(ОтклонениеОтРасчетной, -ОтклонениеОтРасчетной) > 0.03 Тогда
					item.price = РасчетнаяЦена;	
				Иначе
					item.price = Стр.Цена;	
				КонецЕсли;
				
			Иначе
				item.price = Неопределено;	
			КонецЕсли;
		КонецЕсли;	
		
		Item.Vat						= ?(Стр.СтавкаНДС = "без НДС", Неопределено, Стр.СуммаНДС);
		Item.Total						= Стр.Сумма + ?(Стр.СуммаВключаетНДС, 0, Стр.СуммаНДС);
		Item.TaxRate               		= Стр.СтавкаНДС;
		Item.CountriesOfOrigin  		= ?(ЗначениеЗаполнено(Стр.СтранаПроисхождения), СокрЛП(Стр.СтранаПроисхождения.Код), "");
		Item.CustomsDeclarationNumbers 	= Модуль_Интеграция.ПолучитьНомерГТД(Стр.НомерГТД);
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, Стр);
		
	КонецЦикла;	
	
	Для каждого Item Из content.items Цикл
		Item.StructedAdditionalInfos = Новый Массив;
	КонецЦикла;
	
	//заполняем итоги
	Content.Totals.Total	= ДанныеДляПечати.СуммаДокумента;
	Content.Totals.Vat		= ДанныеДляПечати.СуммаНДСДокумента;
	Content.Totals.TotalWithVatExcluded = ДанныеДляПечати.СуммаБезНДСДокумента;
	
	Если Не ЗапущенКакВнешнийМодуль Тогда
		
		Если ПараметрыСогласования <> Неопределено И ЗначениеЗаполнено(ПараметрыСогласования.ФИОПодписанта) Тогда
			ЗаполнитьФИОПодписанта(Content.Signer, ПараметрыСогласования.ФИОПодписанта);
		Иначе
			Content.Signer.Surname 		= ДанныеСотрудника.Фамилия;
			Content.Signer.FirstName 	= ДанныеСотрудника.Имя;
			Content.Signer.Patronymic 	= ДанныеСотрудника.Отчество;
		КонецЕсли;
		
		Content.Signer.Inn 										= Content.seller.inn;
		Content.Signer.IsSoleProprietor							= Content.seller.IsSoleProprietor;
		Content.Signer.SoleProprietorRegistrationCertificate 	= ДанныеДляПечати.ДатаНомерСвидетельстваОРегистрации;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтентКорректировочногоСчетаФактуры93(Content, СтруктураДокумента, ДополнительныеПараметры)
	
	ДанныеСотрудника				 = ДополнительныеПараметры.ДанныеСотрудника;
	ПараметрыСогласования			 = ДополнительныеПараметры.ПараметрыСогласования;
	ДополнительныеСведенияСтрокой	 = ДополнительныеПараметры.ДополнительныеСведенияСтрокой;
	
	ДанныеДляПечати = СтруктураДокумента;
	
	Content.InvoiceCorrectionNumber = ДанныеДляПечати.НомераДляКСФ.НомерКСФ;
	Content.InvoiceCorrectionDate   = ДанныеДляПечати.НомераДляКСФ.ДатаКСФ;
	
	Если ДанныеДляПечати.НомераДляКСФ.ЭтоИКСФ = Истина Тогда 
		//это ксф с исправлением
		Content.InvoiceCorrectionRevisionNumber = ДанныеДляПечати.НомераДляКСФ.НомерИКСФ;
		Content.InvoiceCorrectionRevisionDate   = ДанныеДляПечати.НомераДляКСФ.ДатаИКСФ;
	КонецЕсли;
	
	//укажем данные на оригинальную счф
	OriginalInvoices = Новый Структура("Date, Number, InvoiceRevisionDate, InvoiceRevisionNumber");
	
	OriginalInvoices.Date	= ДанныеДляПечати.НомераДляКСФ.ДатаИсходногоДокумента;
	OriginalInvoices.Number = ДанныеДляПечати.НомераДляКСФ.НомерИсходногоДокумента;
	Если ДанныеДляПечати.НомераДляКСФ.УчитыватьИсправлениеИсходногоДокумента Тогда 
		OriginalInvoices.InvoiceRevisionNumber	= формат(ДанныеДляПечати.НомераДляКСФ.НомерИсправленияИсходногоДокумента, "ЧДЦ=0; ЧГ=0");
		OriginalInvoices.InvoiceRevisionDate	= ДанныеДляПечати.НомераДляКСФ.ДатаИсправленияИсходногоДокумента;
	КонецЕсли;
	
	Content.OriginalInvoices.Добавить(OriginalInvoices);			
	
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Buyer, ДанныеДляПечати.Контрагент, ДанныеДляПечати.Дата, , Истина, Истина);
	Если ЗначениеЗаполнено(ДанныеДляПечати.КПППокупателя) Тогда
		Content.Buyer.kpp = ДанныеДляПечати.КПППокупателя;
	КонецЕсли;	
	
	Модуль_Интеграция.ЗаполнитьСтруктурируЮрФизЛица(Content.Seller, ДанныеДляПечати.Организация, ДанныеДляПечати.Дата, , Истина, Истина);
	
	content.currency 		= ?(ПустаяСтрока(ДанныеДляПечати.ВалютаДокумента), "", СокрЛП(ДанныеДляПечати.ВалютаДокумента.Код));
	content.ВалютаСсылка 	= ДанныеДляПечати.ВалютаДокумента;
	
	Content.StructedAdditionalInfos = ДанныеДляПечати.ДопИнфо;
	Дополнить_StructedAdditionalInfos_ДопСведениями(Content.StructedAdditionalInfos, ДополнительныеСведенияСтрокой);
	
	Content.TotalsDec.Total 				= Неопределено;
	Content.TotalsDec.TotalWithVatExcluded 	= Неопределено;
	Content.TotalsDec.Vat 					= Неопределено;
	
	Content.TotalsInc.Total 				= Неопределено;
	Content.TotalsInc.TotalWithVatExcluded 	= Неопределено;
	Content.TotalsInc.Vat 					= Неопределено;
	
	Точность = ОбщиеПараметры.ТочностьЦены;
	
	Для Каждого СтрокаДанных Из ДанныеДляпечати.ТабличнаяЧасть Цикл 
		
		Item = content.items.Добавить();
		item.StructedAdditionalInfos = СтрокаДанных.ДопИнфо;
		Item.AmountsDec 			 = Новый_AmountsDiff();
		Item.AmountsInc 			 = Новый_AmountsDiff();
		Item.OriginalValues 		 = Новый_InvoiceItemFields();
		Item.CorrectedValues 		 = Новый_InvoiceItemFields();
		
		Item.Product = СтрокаДанных.Номенклатура;
		
		ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		
		Если СтрокаДанных.количествоДоИзменения = 0 И СтрокаДанных.количество = 0 Тогда
			Item.OriginalValues.UnitCode  = "";
			Item.CorrectedValues.UnitCode = "";
		Иначе
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения) Тогда
				Item.OriginalValues.UnitCode = ItemContent_UnitCode(СтрокаДанных.ЕдиницаИзмеренияДоИзменения, СтрокаДанных.КодЕдиницыИзмеренияДоИзменения);
			Иначе
				Item.OriginalValues.UnitCode = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
				Item.CorrectedValues.UnitCode = ItemContent_UnitCode(СтрокаДанных.ЕдиницаИзмерения, СтрокаДанных.КодЕдиницыИзмерения);
			Иначе
				Item.CorrectedValues.UnitCode = "";
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаДанных.КоличествоДоИзменения <> 0 Тогда
			Item.OriginalValues.Quantity = ?(ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения), СтрокаДанных.КоличествоДоИзменения, Неопределено);
		Иначе
			Item.OriginalValues.Quantity = Неопределено;
		КонецЕсли;
		
		Если СтрокаДанных.Количество <> 0 Тогда
			Item.CorrectedValues.Quantity = ?(ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения), СтрокаДанных.Количество, Неопределено);
		ИначеЕсли  ЗначениеЗаполнено(Item.OriginalValues.Quantity) Тогда 
			//если до количество было, а теперь его не стало - заполняем 0 а не "-"!!!
			Item.CorrectedValues.Quantity = 0;
		Иначе	
			Item.CorrectedValues.Quantity = Неопределено;
		КонецЕсли;
		
		Item.OriginalValues.TotalWithVatExcluded  = СтрокаДанных.СуммаДоИзменения - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДСДоИзменения, 0);
		Item.CorrectedValues.TotalWithVatExcluded = СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.суммаНДС, 0);
		
		Item.OriginalValues.Price  = ?(НЕ ЗначениеЗаполнено(Item.OriginalValues.Quantity), Неопределено, Окр(Item.OriginalValues.TotalWithVatExcluded / Item.OriginalValues.Quantity, Точность));
		Item.CorrectedValues.Price = ?(НЕ ЗначениеЗаполнено(Item.CorrectedValues.Quantity), Неопределено, Окр(Item.CorrectedValues.TotalWithVatExcluded / Item.CorrectedValues.Quantity, Точность));
		
		Item.OriginalValues.TaxRate    = ?(ЗначениеЗаполнено(СтрокаДанных.СтавкаНДСДоИзменения) = Истина, СтрокаДанных.СтавкаНДСДоИзменения, СтрокаДанных.СтавкаНДС);
		Item.CorrectedValues.TaxRate   = СтрокаДанных.СтавкаНДС;
		
		
		Item.OriginalValues.Vat  = ?(Item.OriginalValues.TaxRate = "без НДС", Неопределено, СтрокаДанных.СуммаНДСДоИзменения);
		Item.CorrectedValues.Vat = ?(Item.CorrectedValues.TaxRate = "без НДС", Неопределено, СтрокаДанных.СуммаНДС);
		
		Item.OriginalValues.Total   = СтрокаДанных.СуммаДоИзменения + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДСДоИзменения);
		Item.CorrectedValues.Total  = СтрокаДанных.Сумма + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
		
		Если Item.OriginalValues.TotalWithVatExcluded < Item.CorrectedValues.TotalWithVatExcluded Тогда 
			Item.AmountsInc.TotalWithVatExcluded = Item.CorrectedValues.TotalWithVatExcluded - Item.OriginalValues.TotalWithVatExcluded;
			Item.AmountsDec.TotalWithVatExcluded = 0;
		Иначе 
			Item.AmountsInc.TotalWithVatExcluded = 0; 
			Item.AmountsDec.TotalWithVatExcluded = - Item.CorrectedValues.TotalWithVatExcluded + Item.OriginalValues.TotalWithVatExcluded
		КонецЕсли;
		
		СуммаНДСДо    = ?(Item.OriginalValues.Vat = Неопределено, 0, Item.OriginalValues.Vat);
		СуммаНДСПосле = ?(Item.CorrectedValues.Vat = Неопределено, 0, Item.CorrectedValues.Vat);
		
		Если Item.OriginalValues.Vat = Неопределено И Item.CorrectedValues.Vat = Неопределено Тогда 
			Item.AmountsInc.Vat = Неопределено;
			Item.AmountsDec.Vat = Неопределено; 
		ИначеЕсли СуммаНДСДо < СуммаНДСПосле Тогда 
			Item.AmountsInc.Vat = СуммаНДСПосле - СуммаНДСДо;
			Item.AmountsDec.Vat = 0; 
		Иначе 
			Item.AmountsInc.Vat = 0;
			Item.AmountsDec.Vat = - СуммаНДСПосле + СуммаНДСДо;
		КонецЕсли;
		
		Если Item.OriginalValues.Total < Item.CorrectedValues.Total Тогда 
			Item.AmountsInc.Total = Item.CorrectedValues.Total - Item.OriginalValues.Total;
			Item.AmountsDec.Total = 0;
		Иначе 
			Item.AmountsInc.Total = 0;
			Item.AmountsDec.Total = - Item.CorrectedValues.Total + Item.OriginalValues.Total;
		КонецЕсли;
		
		Если Item.AmountsDec.TotalWithVatExcluded <> 0 Тогда 
			Content.TotalsDec.TotalWithVatExcluded = ПривестиКЧислу(Content.TotalsDec.TotalWithVatExcluded) + Item.AmountsDec.TotalWithVatExcluded; 
		КонецЕсли;	
		Если ПривестиКЧислу(Item.AmountsDec.Vat) <> 0 Тогда
			Content.TotalsDec.Vat = ПривестиКЧислу(Content.TotalsDec.Vat) + Item.AmountsDec.Vat; 
		КонецЕсли;	
		Если Item.AmountsDec.Total <> 0 Тогда 
			Content.TotalsDec.Total	= ПривестиКЧислу(Content.TotalsDec.Total) + Item.AmountsDec.Total; 
		КонецЕсли;	
		
		Если Item.AmountsInc.TotalWithVatExcluded <> 0 Тогда 
			Content.TotalsInc.TotalWithVatExcluded = ПривестиКЧислу(Content.TotalsInc.TotalWithVatExcluded) + Item.AmountsInc.TotalWithVatExcluded; 
		КонецЕсли;	
		Если ПривестиКЧислу(Item.AmountsInc.Vat) <> 0 Тогда 
			Content.TotalsInc.Vat = ПривестиКЧислу(Content.TotalsInc.Vat)+ Item.AmountsInc.Vat; 
		КонецЕсли;	
		Если Item.AmountsInc.Total <> 0 Тогда 
			Content.TotalsInc.Total = ПривестиКЧислу(Content.TotalsInc.Total) + Item.AmountsInc.Total; 
		КонецЕсли;	
	КонецЦикла;
	
	Если Не ЗапущенКакВнешнийМодуль Тогда
		
		Если ПараметрыСогласования <> Неопределено И ЗначениеЗаполнено(ПараметрыСогласования.ФИОПодписанта) Тогда
			ЗаполнитьФИОПодписанта(Content.Signer, ПараметрыСогласования.ФИОПодписанта);
		Иначе
			Content.Signer.Surname 		= ДанныеСотрудника.Фамилия;
			Content.Signer.FirstName 	= ДанныеСотрудника.Имя;
			Content.Signer.Patronymic 	= ДанныеСотрудника.Отчество;
		КонецЕсли;
		
		Content.Signer.Inn = Content.seller.inn;
		Content.Signer.IsSoleProprietor	= Content.seller.IsSoleProprietor;
		Content.Signer.SoleProprietorRegistrationCertificate = ДанныеДляПечати.ДатаНомерСвидетельстваОРегистрации;
		
	КонецЕсли;
	
КонецПроцедуры

//} ЗАПОЛНЕНИЕ

//{ ВАЛИДАЦИЯ

Процедура ВызватьИсключениеВалидацииПротоКонтента(ПротоКонтент, ФорматОтправки, СсылкаНаДокумент) Экспорт
	
	СписокОшибок = ВалидацияПротоКонтента(ПротоКонтент, ФорматОтправки);
	
	Если ЗначениеЗаполнено(СписокОшибок) Тогда
		ТекстОшибки = СписокОшибокВСтрокуXml(СсылкаНаДокумент, СписокОшибок);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Функция ВалидацияДанныхФайла(DocumentType, ДанныеФайла) Экспорт
	
	Результат = Новый Массив;
	
	Если 	DocumentType = "AcceptanceCertificate" 
		ИЛИ DocumentType = "ReconciliationAct" 
		ИЛИ DocumentType = "NonformalizedProforma" 
		ИЛИ DocumentType = "Contract" Тогда
		
		Если ДанныеФайла.Свойство("DocumentNumber")
			И НЕ ЗначениеЗаполнено(ДанныеФайла.DocumentNumber) Тогда
			ДобавитьОшибкуВалидации(Результат, " - Номер документа");
		КонецЕсли;
		
		Если ДанныеФайла.Свойство("DocumentDate")
			И НЕ ЗначениеЗаполнено(ДанныеФайла.DocumentDate) Тогда
			ДобавитьОшибкуВалидации(Результат, " - Дата документа");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеФайла.Свойство("TotalVat")
		И НЕ ЗначениеЗаполнено(ДанныеФайла.TotalVat)
		И (НЕ ДанныеФайла.Свойство("БезНДС")
		ИЛИ НЕ ДанныеФайла.БезНДС) Тогда
		ДобавитьОшибкуВалидации(Результат, " - НДС");
	КонецЕсли;
	
	Если ДанныеФайла.Свойство("TotalSum")
		И НЕ ЗначениеЗаполнено(ДанныеФайла.TotalSum) Тогда
		ДобавитьОшибкуВалидации(Результат, " - Сумма с НДС");
	КонецЕсли;
	
	Если ДанныеФайла.Свойство("ContractPrice")
		И НЕ ЗначениеЗаполнено(ДанныеФайла.ContractPrice)
		И (НЕ ДанныеФайла.Свойство("ЦенаНеУказана")
		ИЛИ НЕ ДанныеФайла.ЦенаНеУказана) Тогда
		ДобавитьОшибкуВалидации(Результат, " - Цена");
	КонецЕсли;
	
	Результат = ОформитьОшибкиВHTML(Результат, "Необходимо заполнить следующие поля:");
	Возврат Результат;
	
КонецФункции

Функция ВалидацияПротоКонтента(ПротоКонтент, ФорматОтправки) Экспорт
	
	БазовыеФорматы	= БазовыеФорматы();
	БазовыйФормат	= ФорматОтправки.БазовыйФормат;
	
	Если БазовыйФормат = БазовыеФорматы.utd820 Тогда
		
		ЗаголовокHTML = "При формировании файла УПД обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияUTD820(ПротоКонтент);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.utd Тогда
		
		ЗаголовокHTML = "При формировании файла УПД обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияUTD(ПротоКонтент);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.ucd736 Тогда
		
		ЗаголовокHTML = "При формировании файла УКД обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияUCD736(ПротоКонтент);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.ucd Тогда
		
		ЗаголовокHTML = "При формировании файла УКД обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияUCD(ПротоКонтент);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.torg12 Тогда
		
		ЗаголовокHTML = "При формировании файла накладной обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияXmlTorg12Content(ПротоКонтент);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.act Тогда
		
		ЗаголовокHTML = "При формировании файла акта обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияXmlAcceptanceCertificateContent(ПротоКонтент);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.invoice Тогда
		
		ЗаголовокHTML = "При формировании файла счета-фактуры обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияInvoiceContent(ПротоКонтент);
		
	ИначеЕсли БазовыйФормат = БазовыеФорматы.invoicecor Тогда
		
		ЗаголовокHTML = "При формировании файла корректировочного счета-фактуры обнаружены следующие ошибки:";
		СписокОшибок = ВалидацияInvoiceCorrectionContent(ПротоКонтент);
		
	КонецЕсли;
	
	Если ПротоКонтент.Свойство("ОшибкиВДанных") Тогда
		ДобавитьГруппуОшибокВалидации(СписокОшибок, ПротоКонтент.ОшибкиВДанных, "Ошибки в данных");
	КонецЕсли;
	
	Результат = ОформитьОшибкиВHTML(СписокОшибок, ЗаголовокHTML);
	
	Возврат Результат;
	
КонецФункции

Функция ВалидацияUTD(UTDContent)
	
	// Функция возвращает список ошибок 
	ГенерацияXML = МодульГенерацияXML();
	списокОшибок = ГенерацияXML.ВалидацияUTD(UTDContent);
	
	Возврат СписокОшибок;
	
КонецФункции

Функция ВалидацияUTD820(UTDContent)
	
	ГенерацияXML = МодульГенерацияXML();
	СписокОшибок = ГенерацияXML.ВалидацияUTD820(UTDContent);
	
	Возврат СписокОшибок;
	
КонецФункции

Функция ВалидацияUCD(UCDContent)
	
	ГенерацияXML = МодульГенерацияXML();
	СписокОшибок = ГенерацияXML.ВалидацияUCD(UCDContent);
	
	Возврат СписокОшибок;
	
КонецФункции

Функция ВалидацияUCD736(UCDContent)
	
	ГенерацияXML = МодульГенерацияXML();
	СписокОшибок = ГенерацияXML.ВалидацияUCD736(UCDContent);
	
	Возврат СписокОшибок;
	
КонецФункции

Функция ВалидацияInvoiceContent(InvoiceContent)
	
	// Функция фозвращает список ошибок 
	ГенерацияXML = МодульГенерацияXML();
	СписокОшибок = ГенерацияXML.ВалидацияInvoiceContent(InvoiceContent);
	
	Возврат СписокОшибок;
	
КонецФункции

Функция ВалидацияInvoiceCorrectionContent(InvoiceCorrectionContent)
	
	ГенерацияXML = МодульГенерацияXML();
	СписокОшибок = ГенерацияXML.ВалидацияInvoiceCorrectionContent(InvoiceCorrectionContent);
	
	Возврат СписокОшибок;
	
КонецФункции	

Функция ВалидацияXmlAcceptanceCertificateContent(xmlAcceptanceCertificateContent)
	
	ГенерацияXML = МодульГенерацияXML();
	СписокОшибок = ГенерацияXML.ВалидацияXmlAcceptanceCertificateContent(xmlAcceptanceCertificateContent);
	
	Если Не ЗапущенКакВнешнийМодуль Тогда
		
		ПараметрыПодписания =  Модуль_Данные1С_СвязиОбъектов().ПолучитьПараметрыПодписанияТ12вДиадок(xmlAcceptanceCertificateContent.Seller.Ссылка);
		ОшибкиПодписания = Новый Массив;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыПодписания.ФИОПодписанта) Тогда
			
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Отсутствует ФИО подписанта");
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Перейдите в <окно настройки> и заполните отсутствующие поля", """НАСТРОЙКАПАРАМЕТРОВПОДПИСАНИЯ""");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыПодписания.ДолжностьПодписанта) Тогда
			
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Отсутствует должность подписанта");
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Перейдите в <настройки сотрудника Диадока> и заполните должность", """НАСТРОЙКДОЛЖНОСТИПОДПИСАНТА""");
			
		КонецЕсли;
		
		ДобавитьГруппуОшибокВалидации(СписокОшибок, ОшибкиПодписания, "Не настроены параметры подписания документа");
		
	КонецЕсли;
	
	Возврат СписокОшибок;
	
КонецФункции	                                                         

Функция ВалидацияXmlTorg12Content(XmlTorg12Content)
	
	ГенерацияXML = МодульГенерацияXML();
	СписокОшибок = ГенерацияXML.ВалидацияXmlTorg12Content(XmlTorg12Content);
	
	Если Не ЗапущенКакВнешнийМодуль Тогда
		
		ПараметрыПодписания = Модуль_Данные1С_СвязиОбъектов().ПолучитьПараметрыПодписанияТ12вДиадок(XmlTorg12Content.Seller.Ссылка);
		ОшибкиПодписания = Новый Массив;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыПодписания.ФИОПодписанта) Тогда
			
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Отсутствует ФИО подписанта");
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Перейдите в <окно настройки> и заполните отсутствующие поля", "НАСТРОЙКАПАРАМЕТРОВПОДПИСАНИЯ");
			
		КонецЕсли;
		
		Если  НЕ ЗначениеЗаполнено(ПараметрыПодписания.ДолжностьПодписанта)
			И НЕ ПараметрыПодписания.СпособПодписания = "2" Тогда
			
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Отсутствует должность подписанта");
			ДобавитьОшибкуВалидации(ОшибкиПодписания, "Перейдите в <настройки сотрудника Диадока> и заполните должность", "НАСТРОЙКДОЛЖНОСТИПОДПИСАНТА");
			
		КонецЕсли;
		
		ДобавитьГруппуОшибокВалидации(СписокОшибок, ОшибкиПодписания, "Не настроены параметры подписания документа");
		
		Если  НЕ СтруктураКонтентаЗаполнена(XmlTorg12Content.SupplyAllowedBy)
			И НЕ СтруктураКонтентаЗаполнена(XmlTorg12Content.ChiefAccountant)
			И НЕ СтруктураКонтентаЗаполнена(XmlTorg12Content.SupplyPerformedBy) Тогда
			
			ДобавитьОшибкуВалидации(СписокОшибок, "Не указано ни одного лица, подписавшего документ. Заполните ответственных лиц организации: руководителя или главного бухгалтера.");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокОшибок;
	
КонецФункции	

//} ВАЛИДАЦИЯ

//{ ПУСТЫЕ СТРУКТУРЫ ДЛЯ ИНИЦИАЛИЗАЦИИ КОНТЕНТА

Функция Новый_Organization(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/Organization.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("Id");
	Результат.Вставить("Name");
	Результат.Вставить("Inn");
	Результат.Вставить("Kpp");
	Результат.Вставить("AuthenticateType");
	Результат.Вставить("Login");
	Результат.Вставить("FnsParticipantId");
	Результат.Вставить("FnsRegistrationDate");
	Результат.Вставить("IsTest");
	Результат.Вставить("IsPilot");
	Результат.Вставить("EncryptedDocumentsAllowed");
	
	Результат.Вставить("Departments", НовыйЭлементContent("Departments", "Новый_Departments"		, Конструкторы, ПолноеИмя));
	Результат.Вставить("Certificate", НовыйЭлементContent("Certificate", "Новый_PersonalCertificate", Конструкторы, ПолноеИмя));
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Counteragent(ПолноеИмя = "", Конструкторы= Неопределено)
	
	Content = Новый Структура("Id, Name, Inn, Kpp, Address, Departments, LastEventTimestampTicks, MessageFromCounteragent, Organization, IsTest, IsPilot, IsActive, IsRoaming, IsLiquidated, FnsParticipantId, IsLiquidated");
	
	Content.Address =	  НовыйЭлементContent("Address"		, "Новый_AddressInfo" , Конструкторы, ПолноеИмя);
	Content.Departments =  НовыйЭлементContent("Departments"	, "Новый_Departments" , Конструкторы, ПолноеИмя);
	Content.Organization = НовыйЭлементContent("Organization", "Новый_Organization", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_Torg12SellerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Content= Новый Структура(
	"Date, Number, WaybillDate, WaybillNumber, OperationCode, GroundName, GroundDate, GroundNumber,
	|Seller, Buyer, Shipper, Consignee, ShipperDepartment, ShipperOkdp, SupplyDate, AttachmentSheetsQuantity,
	|ChiefAccountant, AdditionalInfo, SupplyAllowedBy, ChiefAccountant, SupplyPerformedBy, Commons, Totals, Items, Signer");
	
	Content.Seller=  		   НовыйЭлементContent("Seller"			  , "Новый_OrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Buyer=  		   НовыйЭлементContent("Buyer"			  , "Новый_OrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Shipper=  		   НовыйЭлементContent("Shipper"		  , "Новый_OrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Consignee=  	   НовыйЭлементContent("Consignee"		  , "Новый_OrganizationInfo", Конструкторы, ПолноеИмя);
	Content.SupplyAllowedBy=   НовыйЭлементContent("SupplyAllowedBy"  , "Новый_Official"		, Конструкторы, ПолноеИмя);
	Content.ChiefAccountant=   НовыйЭлементContent("ChiefAccountant"  , "Новый_Official"		, Конструкторы, ПолноеИмя);
	Content.SupplyPerformedBy= НовыйЭлементContent("SupplyPerformedBy", "Новый_Official"		, Конструкторы, ПолноеИмя);
	Content.Commons=  		   НовыйЭлементContent("Commons"		  , "Новый_Torg12Commons"	, Конструкторы, ПолноеИмя);
	Content.Totals=  		   НовыйЭлементContent("Totals"			  , "Новый_Torg12Totals"	, Конструкторы, ПолноеИмя);
	Content.Items=  		   НовыйЭлементContent("Items"			  , "Новый_Torg12Items"		, Конструкторы, ПолноеИмя);
	Content.Signer=  		   НовыйЭлементContent("Signer"			  , "Новый_Signer"			, Конструкторы, ПолноеИмя);
	
	ИнициализироватьСлужебныеПоляПрото(Content);
	
	Возврат Content;
	
КонецФункции

Функция Новый_Torg12BuyerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Content = Новый Структура("ShipmentReceiptDate, Attorney, Receiver, Accepter, Signer, AdditionalInfo, Type");
	
	Content.Attorney= НовыйЭлементContent("Attorney", "Новый_Attorney", Конструкторы, ПолноеИмя);
	Content.Receiver= НовыйЭлементContent("Receiver", "Новый_Official", Конструкторы, ПолноеИмя);
	Content.Accepter= НовыйЭлементContent("Accepter", "Новый_Official", Конструкторы, ПолноеИмя);
	Content.Signer=   НовыйЭлементContent("Signer"	, "Новый_Signer"  , Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_AcceptanceCertificateSellerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Content = Новый Структура(
	"Date, Number, Title, SignatureDate, Seller,
	|Items, Official, Attorney, Signer, AdditionalInfo, Type");
	
	Content.Seller =   НовыйЭлементContent("Seller"	, "Новый_OrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Official = НовыйЭлементContent("Official", "Новый_Official"		  , Конструкторы, ПолноеИмя);
	Content.Attorney = НовыйЭлементContent("Attorney", "Новый_Attorney"		  , Конструкторы, ПолноеИмя);
	Content.Signer =   НовыйЭлементContent("Signer"	, "Новый_Signer"		  , Конструкторы, ПолноеИмя);
	
	Content.Items =    НовыйЭлементContent("Items"	, "Новый_AcceptanceCertificateItems", Конструкторы, ПолноеИмя);
	
	ИнициализироватьСлужебныеПоляПрото(Content);
	
	Возврат Content;
	
КонецФункции	

Функция Новый_AcceptanceCertificateBuyerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Content = Новый Структура("Complaints, SignatureDate, Official, Attorney, Signer, AdditionalInfo, Type");
	
	Content.Official = НовыйЭлементContent("Official", "Новый_Official", Конструкторы, ПолноеИмя);
	Content.Attorney = НовыйЭлементContent("Attorney", "Новый_Attorney", Конструкторы, ПолноеИмя);
	Content.Signer =   НовыйЭлементContent("Signer"	, "Новый_Signer"  , Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_InvoiceContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Content = Новый Структура(
	"Date, Number, InvoiceRevisionDate, InvoiceRevisionNumber,
	|Currency, PaymentDocuments, Seller, Shipper, Consignee, Buyer,
	|Signer, StructedAdditionalInfos, Totals, Items, ВалютаСсылка");
	
	Content.Seller =    НовыйЭлементContent("Seller"			  , "Новый_OrganizationInfo"		, Конструкторы, ПолноеИмя);
	Content.Buyer =     НовыйЭлементContent("Buyer"			  , "Новый_OrganizationInfo"		, Конструкторы, ПолноеИмя);
	Content.Shipper =   НовыйЭлементContent("Shipper"		  , "Новый_ShipperOrConsigneeInfo"	, Конструкторы, ПолноеИмя);
	Content.Consignee = НовыйЭлементContent("Consignee"		  , "Новый_ShipperOrConsigneeInfo"	, Конструкторы, ПолноеИмя);
	Content.Totals =    НовыйЭлементContent("Totals"			  , "Новый_InvoiceTotals"			, Конструкторы, ПолноеИмя);
	Content.Signer =    НовыйЭлементContent("Signer"			  , "Новый_Signer"					, Конструкторы, ПолноеИмя);
	Content.Items = 	   НовыйЭлементContent("Items"			  , "Новый_InvoiceItems"			, Конструкторы, ПолноеИмя);
	
	Content.PaymentDocuments= 		 НовыйЭлементContent("PaymentDocuments" 	  , "Новый_PaymentDocuments"	   , Конструкторы, ПолноеИмя);
	Content.StructedAdditionalInfos= НовыйЭлементContent("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	ИнициализироватьСлужебныеПоляПрото(Content);
	
	Возврат content;
	
КонецФункции

Функция Новый_InvoiceCorrectionContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Content = Новый Структура(
	"InvoiceCorrectionDate, InvoiceCorrectionNumber, 
	|InvoiceCorrectionRevisionDate, InvoiceCorrectionRevisionNumber,
	|Currency, ВалютаСсылка, Seller, Buyer, Signer, StructedAdditionalInfos,
	|OriginalInvoices, Items, TotalsDec, TotalsInc");
	
	Content.Seller=    НовыйЭлементContent("Seller"	  , "Новый_OrganizationInfo" , Конструкторы, ПолноеИмя);
	Content.Buyer=     НовыйЭлементContent("Buyer"	  , "Новый_OrganizationInfo" , Конструкторы, ПолноеИмя);
	Content.Signer=    НовыйЭлементContent("Signer"	  , "Новый_Signer"			 , Конструкторы, ПолноеИмя);
	Content.TotalsDec= НовыйЭлементContent("TotalsDec", "Новый_InvoiceTotalsDiff", Конструкторы, ПолноеИмя);
	Content.TotalsInc= НовыйЭлементContent("TotalsInc", "Новый_InvoiceTotalsDiff", Конструкторы, ПолноеИмя);
	
	Content.Items= НовыйЭлементContent("Items", "Новый_InvoiceCorrectionItems", Конструкторы, ПолноеИмя);
	
	Content.OriginalInvoices=    	 НовыйЭлементContent("OriginalInvoices"		  , "Новый_OriginalInvoices"	   , Конструкторы, ПолноеИмя);
	Content.StructedAdditionalInfos= НовыйЭлементContent("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	ИнициализироватьСлужебныеПоляПрото(Content);
	
	Возврат Content;
	
КонецФункции

Функция Новый_UTDSellerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Content= Новый Структура(
	"Function, СчетФактураСсылка, Name, Date, Number, Seller, Buyer, Shipper, Consignee, InvoiceTable,
	|Currency, ВалютаСсылка, CurrencyRate, RevisionDate, RevisionNumber, AdditionalInfoId, TransferInfo,
	|Creator, CreatorBase, GovernmentContractInfo, Signers, PaymentDocuments");
	
	Content.Seller=  		  НовыйЭлементContent("Seller"			, "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Buyer=  		  НовыйЭлементContent("Buyer"			, "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Consignee=  	  НовыйЭлементContent("Consignee"		, "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Shipper=  		  НовыйЭлементContent("Shipper"			, "Новый_Shipper"				  , Конструкторы, ПолноеИмя);
	Content.TransferInfo=  	  НовыйЭлементContent("TransferInfo"	, "Новый_TransferInfo"			  , Конструкторы, ПолноеИмя);
	Content.InvoiceTable=	  НовыйЭлементContent("InvoiceTable"	, "Новый_InvoiceTable"			  , Конструкторы, ПолноеИмя);
	Content.PaymentDocuments= НовыйЭлементContent("PaymentDocuments", "Новый_PaymentDocuments"		  , Конструкторы, ПолноеИмя);
	Content.AdditionalInfoId= НовыйЭлементContent("AdditionalInfoId", "Новый_AdditionalInfoId"		  , Конструкторы, ПолноеИмя);
	Content.Signers= 		  НовыйЭлементContent("Signers"			, "Новый_ExtendedSigners"		  , Конструкторы, ПолноеИмя);
	
	ИнициализироватьСлужебныеПоляПрото(Content);
	
	Возврат Content;
	
КонецФункции

Функция Новый_UTDBuyerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Content= Новый Структура("Creator, CreatorBase, OperationCode, OperationContent, AcceptanceDate, Employee, OtherIssuer, AdditionalInfoId, Signers");
	
	Content.Employee=  	 НовыйЭлементContent("Employee"   , "Новый_Employee"	   , Конструкторы, ПолноеИмя);
	Content.OtherIssuer= НовыйЭлементContent("OtherIssuer", "Новый_OtherIssuer"	   , Конструкторы, ПолноеИмя);
	Content.Signers= 	 НовыйЭлементContent("Signers"	  , "Новый_ExtendedSigners", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_Utd820BuyerContent() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("AcceptanceDate");
	
	Результат.Вставить("DocumentCreator");
	Результат.Вставить("DocumentCreatorBase");
	
	Результат.Вставить("OperationCode");
	Результат.Вставить("OperationContent");
	
	Результат.Вставить("Employee"	, Новый_Employee());
	Результат.Вставить("OtherIssuer", Новый_OtherIssuer());
	
	Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
	
	Результат.Вставить("BuyerInfoCircumPublicProc", Новый_BuyerInfoCircumPublicProc());
	
	Результат.Вставить("ContentOperCode", Новый_ContentOperCode());
	
	Результат.Вставить("Signers", Новый Массив); // Новый_ExtendedSigner()
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Utd820SellerContent() Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/UtdSellerContent.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentDate");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("Function");
	
	Результат.Вставить("RevisionDate");
	Результат.Вставить("RevisionNumber");
	
	Результат.Вставить("DocumentName");
	Результат.Вставить("DocumentCreator");
	Результат.Вставить("DocumentCreatorBase");
	
	Результат.Вставить("Currency");
	Результат.Вставить("CurrencyRate");
	
	Результат.Вставить("GovernmentContractInfo");
	Результат.Вставить("CircumFormatInvoice");
	Результат.Вставить("ApprovedStructureAdditionalInfoFields");
	
	Результат.Вставить("HyphenRevisionDate");
	Результат.Вставить("HyphenRevisionNumber");
	
	Результат.Вставить("Sellers", Новый Массив); // Новый_ExtendedOrganizationInfo820()
	Результат.Вставить("Buyers" , Новый Массив); // Новый_ExtendedOrganizationInfo820()
	
	Результат.Вставить("Shippers"  , Новый Массив); // Новый_Shipper820()
	Результат.Вставить("Consignees", Новый Массив); // Новый_ExtendedOrganizationInfo820()
	
	Результат.Вставить("FactorInfo", Новый_ExtendedOrganizationInfo820());
	
	Результат.Вставить("Table", Новый_Utd820Table());
	Результат.Вставить("TransferInfo", Новый_TransferInfo820());
	
	Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId());
	
	Результат.Вставить("Signers", Новый Массив);
	Результат.Вставить("PaymentDocuments", Новый Массив);
	
	Результат.Вставить("MainAssignMonetaryClaim"	, Новый_TransferBase820());
	Результат.Вставить("SellerInfoCircumPublicProc"	, Новый_SellerInfoCircumPublicProc());
	Результат.Вставить("DocumentShipments"			, Новый_DocumentShipments());
	
	ИнициализироватьСлужебныеПоляПрото(Результат);
	
	Возврат Результат;
	
КонецФункции	

Функция Новый_UCDSellerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Content = Новый Структура(
	"Function, СчетФактураСсылка, Name, Date, Number, Invoices, Seller, Buyer, Signers, EventContent,
	|InvoiceCorrectionTable, Currency, ВалютаСсылка, CurrencyRate, CurrencyName, RevisionDate, RevisionNumber,
	|AdditionalInfoId, Creator, CreatorBase, GovernmentContractInfo");
	
	Content.Вставить("FormatVersion");
	
	Content.Invoices = НовыйЭлементContent("Invoices", "Новый_InvoiceForCorrectionInfo", Конструкторы, ПолноеИмя);
	Content.Seller	 = НовыйЭлементContent("Seller"	 , "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Buyer	 = НовыйЭлементContent("Buyer"	 , "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя);
	Content.Signers	 = НовыйЭлементContent("Signers" , "Новый_ExtendedSigners"		   , Конструкторы, ПолноеИмя);
	
	Content.EventContent		   = НовыйЭлементContent("EventContent"			 , "Новый_EventContent"			 , Конструкторы, ПолноеИмя);
	Content.InvoiceCorrectionTable = НовыйЭлементContent("InvoiceCorrectionTable", "Новый_InvoiceCorrectionTable", Конструкторы, ПолноеИмя);
	Content.AdditionalInfoId	   = НовыйЭлементContent("AdditionalInfoId"		 , "Новый_AdditionalInfoId"		 , Конструкторы, ПолноеИмя);
	
	ИнициализироватьСлужебныеПоляПрото(Content);
	
	Возврат Content;
	
КонецФункции

Функция Новый_UCDBuyerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Возврат Новый_UTDBuyerContent(ПолноеИмя, Конструкторы);
	
КонецФункции

Функция Новый_TovTorgSellerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentName");
	
	Результат.Вставить("DocumentDate");
	Результат.Вставить("DocumentNumber");
	
	Результат.Вставить("RevisionDate");
	Результат.Вставить("RevisionNumber");
	
	Результат.Вставить("Currency");
	Результат.Вставить("CurrencyRate");
	
	Результат.Вставить("DocumentCreator");
	Результат.Вставить("DocumentCreatorBase");
	
	Результат.Вставить("OperationType");
	
	Результат.Вставить("GovernmentContractInfo");
	
	Результат.Вставить("Table", НовыйЭлементContent("Table", "Новый_TovTorgTable", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("Seller", НовыйЭлементContent("Seller", "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя));
	Результат.Вставить("Buyer" , НовыйЭлементContent("Buyer" , "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("Shipper"  , НовыйЭлементContent("Shipper"  , "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя));
	Результат.Вставить("Carrier"  , НовыйЭлементContent("Carrier"  , "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя));
	Результат.Вставить("Consignee", НовыйЭлементContent("Consignee", "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("TransferInfo"	 , НовыйЭлементContent("TransferInfo"	 , "Новый_TovTorgTransferInfo", Конструкторы, ПолноеИмя));
	Результат.Вставить("AdditionalInfoId", НовыйЭлементContent("AdditionalInfoId", "Новый_AdditionalInfoId"	  , Конструкторы, ПолноеИмя));
	
	Результат.Вставить("Signers", НовыйЭлементContent("Signers", "Новый_ExtendedSigners", Конструкторы, ПолноеИмя));
	Результат.Вставить("Grounds", НовыйЭлементContent("Grounds", "Новый_Grounds"		, Конструкторы, ПолноеИмя));
	
	ИнициализироватьСлужебныеПоляПрото(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_TovTorgBuyerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentCreator");
	Результат.Вставить("DocumentCreatorBase");
	
	Результат.Вставить("OperationCode");
	Результат.Вставить("OperationContent");
	
	Результат.Вставить("AcceptanceDate");
	
	Результат.Вставить("Employee"	, НовыйЭлементContent("Employee"   , "Новый_Employee"	, Конструкторы, ПолноеИмя));
	Результат.Вставить("OtherIssuer", НовыйЭлементContent("OtherIssuer", "Новый_OtherIssuer", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("AdditionalInfo", НовыйЭлементContent("AdditionalInfo", "Новый_AdditionalInfoId", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("Signers", НовыйЭлементContent("Signers", "Новый_ExtendedSigners", Конструкторы, ПолноеИмя));
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Act552SellerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentName");
	
	Результат.Вставить("DocumentDate");
	Результат.Вставить("DocumentNumber");
	
	Результат.Вставить("RevisionDate");
	Результат.Вставить("RevisionNumber");
	
	Результат.Вставить("Currency");
	Результат.Вставить("CurrencyRate");
	
	Результат.Вставить("DocumentCreator");
	Результат.Вставить("DocumentCreatorBase");
	
	Результат.Вставить("OperationType");
	Результат.Вставить("OperationTitle");
	
	Результат.Вставить("GovernmentContractInfo");
	
	Результат.Вставить("Seller", НовыйЭлементContent("Seller", "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя));
	Результат.Вставить("Buyer" , НовыйЭлементContent("Buyer" , "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("TransferInfo"  , НовыйЭлементContent("TransferInfo"	 , "Новый_Act552TransferInfo", Конструкторы, ПолноеИмя));
	Результат.Вставить("AdditionalInfo", НовыйЭлементContent("AdditionalInfo", "Новый_AdditionalInfoId"	 , Конструкторы, ПолноеИмя));
	
	Результат.Вставить("Works"	, НовыйЭлементContent("Works"  , "Новый_Works"			, Конструкторы, ПолноеИмя));
	Результат.Вставить("Signers", НовыйЭлементContent("Signers", "Новый_ExtendedSigners", Конструкторы, ПолноеИмя));
	Результат.Вставить("Grounds", НовыйЭлементContent("Grounds", "Новый_Grounds"		, Конструкторы, ПолноеИмя));
	
	ИнициализироватьСлужебныеПоляПрото(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Act552BuyerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentCreator");
	Результат.Вставить("DocumentCreatorBase");
	
	Результат.Вставить("OperationType");
	Результат.Вставить("OperationContent");
	
	Результат.Вставить("AcceptanceDate");
	
	Результат.Вставить("CreatedThingInfo");
	Результат.Вставить("CreatedThingAcceptDate");
	
	Результат.Вставить("AdditionalInfoId", НовыйЭлементContent("AdditionalInfoId", "Новый_AdditionalInfoId", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("Signers", НовыйЭлементContent("Signers", "Новый_ExtendedSigners", Конструкторы, ПолноеИмя));
	
	Возврат Результат;
	
КонецФункции

Функция Новый_TovTorgTable(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Items", НовыйЭлементContent("Items", "Новый_TovTorgItems", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("TotalQuantity");
	Результат.Вставить("TotalGross");
	Результат.Вставить("TotalNet");
	
	Результат.Вставить("TotalWithVatExcluded");
	Результат.Вставить("TotalVat");
	Результат.Вставить("Total");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_TovTorgItems(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	ДобавитьКонструктор("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	Колонки = Новый Структура;
	
	Колонки.Вставить("Product");
	Колонки.Вставить("Feature");
	Колонки.Вставить("Sort");
	Колонки.Вставить("VendorCode");
	Колонки.Вставить("ProductCode");
	
	Колонки.Вставить("UnitName");
	Колонки.Вставить("Unit");
	
	Колонки.Вставить("PackageType");
	Колонки.Вставить("QuantityInPack");
	
	Колонки.Вставить("ItemToRelease");
	Колонки.Вставить("Quantity");
	Колонки.Вставить("Gross");
	Колонки.Вставить("Net");
	
	Колонки.Вставить("Price");
	Колонки.Вставить("SubtotalWithVatExcluded");
	Колонки.Вставить("TaxRate");
	Колонки.Вставить("Vat");
	Колонки.Вставить("Subtotal");
	
	Колонки.Вставить("ItemAccountDebit");
	Колонки.Вставить("ItemAccountCredit");
	
	Колонки.Вставить("StructedAdditionalInfos");
	
	Колонки.Вставить("СсылкаНаЕИ");
	
	Результат = НоваяТаблицаЗначений(Колонки);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Act552WorkDescription(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Items", НовыйЭлементContent("Items", "Новый_Act552WorkItems", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("StartingDate");
	Результат.Вставить("CompletionDate");
	
	Результат.Вставить("TotalWithVatExcluded");
	Результат.Вставить("TotalVat");
	Результат.Вставить("Total");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Act552WorkItems(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	ДобавитьКонструктор("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	Колонки = Новый Структура;
	
	Колонки.Вставить("Name");
	Колонки.Вставить("Description");
	
	Колонки.Вставить("UnitCode");
	Колонки.Вставить("UnitName");
	
	Колонки.Вставить("Quantity");
	
	Колонки.Вставить("Price");
	Колонки.Вставить("SubtotalWithVatExcluded");
	Колонки.Вставить("TaxRate");
	Колонки.Вставить("Vat");
	Колонки.Вставить("Subtotal");
	
	Колонки.Вставить("ItemAccountDebit");
	Колонки.Вставить("ItemAccountCredit");
	
	Колонки.Вставить("StructedAdditionalInfos");
	
	Колонки.Вставить("СсылкаНаЕИ");
	
	Результат = НоваяТаблицаЗначений(Колонки);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_TovTorgTransferInfo(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/TovTorgTransferInfo.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("OperationInfo");
	Результат.Вставить("TransferDate");
	Результат.Вставить("Attachment");
	
	Результат.Вставить("Employee"	, НовыйЭлементContent("Employee"   , "Новый_Employee"	, Конструкторы, ПолноеИмя));
	Результат.Вставить("OtherIssuer", НовыйЭлементContent("OtherIssuer", "Новый_OtherIssuer", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("Waybills", НовыйЭлементContent("Waybills", "Новый_Waybills", Конструкторы, ПолноеИмя));
	
	Результат.Вставить("StructedAdditionalInfos", НовыйЭлементContent("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя));
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Act552TransferInfo(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/Act552TransferInfo.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("OperationInfo");
	Результат.Вставить("TransferDate");
	
	Результат.Вставить("CreatedThingInfo");
	Результат.Вставить("CreatedThingTransferDate");
	
	Результат.Вставить("StructedAdditionalInfos", НовыйЭлементContent("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя));
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Works(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	ДобавитьКонструкторЭлементаМассива("Новый_Act552WorkDescription", Конструкторы, ПолноеИмя);
	
	Возврат Новый Массив;
	
КонецФункции

Функция Новый_Grounds(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	ДобавитьКонструкторЭлементаМассива("Новый_GroundInfo", Конструкторы, ПолноеИмя);
	
	Возврат Новый Массив;
	
КонецФункции

Функция Новый_GroundInfo(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/GroundInfo.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("Name");
	Результат.Вставить("Number");
	Результат.Вставить("Date");
	Результат.Вставить("Info");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_AddressInfo(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат Новый Структура(
	"IsForeign, ZipCode, RegionCode, Territory, City, Locality, Street,
	|Building, Block, Apartment, CountryCode, AddressText, AddressCode");
	
КонецФункции

Функция Новый_OrganizationInfo(ПолноеИмя = "", Конструкторы = Неопределено) 
	
	Content= Новый Структура(
	"IsSoleProprietor, Name, Inn, Kpp,  Address,
	|BankAccountNumber, BankName, BankId, Phone, Fax, Okopf, Okpo");
	
	Content.Address= НовыйЭлементContent("Address", "Новый_AddressInfo", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_ExtendedOrganizationInfo(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Content = Новый Структура(
	"BoxId, Name, Inn, Kpp,  Address, FnsParticipantId, Type,
	|Okopf, Okpo, Okdp, Phone, Email, CorrespondentAccount,
	|BankAccountNumber, BankName, BankId,  Department, AdditionalInfo,
	|OrganizationOrPersonInfo, IndividualEntityRegistrationCertificate");
	
	Content.Address = НовыйЭлементContent("Address", "Новый_AddressInfo", Конструкторы, ПолноеИмя);
	
	Content.Вставить("Ссылка");
	
	Возврат Content;
	
КонецФункции

Функция Новый_ExtendedOrganizationInfo820(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт 
	
	Content = Новый Структура(
	"BoxId, Name, Inn, HyphenInn, Kpp,  Address, FnsParticipantId, Type,
	|Okopf, Okpo, Okdp, Phone, Email, CorrespondentAccount,
	|BankAccountNumber, BankName, BankId,  Department, AdditionalInfo,
	|OrganizationOrPersonInfo, IndividualEntityRegistrationCertificate");
	
	Content.Address = НовыйЭлементContent("Address", "Новый_AddressInfo", Конструкторы, ПолноеИмя);
	
	Content.Вставить("Ссылка");
	
	Возврат Content;
	
КонецФункции

Функция Новый_Shipper(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content= Новый Структура("OrganizationInfo, SameAsSeller");
	
	Content.OrganizationInfo= НовыйЭлементContent("OrganizationInfo", "Новый_ExtendedOrganizationInfo", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_Shipper820(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура("OrganizationInfo, SameAsSeller");
	
	Content.OrganizationInfo = НовыйЭлементContent("OrganizationInfo", "Новый_ExtendedOrganizationInfo820", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_ShipperOrConsigneeInfo(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура("IsSoleProprietor, Name, Address, SameAsSellerOrBuyer, Ссылка");
	
	Content.Address = НовыйЭлементContent("Address", "Новый_AddressInfo", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_InvoiceForCorrectionInfo(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	ДобавитьКонструктор("InvoiceRevisions", "Новый_InvoiceRevisionInfo", Конструкторы, ПолноеИмя);
	
	Возврат НоваяТаблицаЗначений("InvoiceDate, InvoiceNumber, InvoiceRevisions");
	
КонецФункции

Функция Новый_InvoiceRevisionInfo(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат НоваяТаблицаЗначений("RevisionDate, RevisionNumber");
	
КонецФункции

Функция Новый_InvoiceTable(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура("TotalWithVatExcluded, Vat, Total, TotalNet, Items");
	
	Content.Items = НовыйЭлементContent("Items", "Новый_ExtendedInvoiceItems", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_Utd820Item() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Product");
	Результат.Вставить("ItemVendorCode");
	Результат.Вставить("ItemCharact");
	Результат.Вставить("ItemArticle");
	Результат.Вставить("ItemKind");
	Результат.Вставить("CatalogCode");
	Результат.Вставить("ItemTypeCode");
	
	Результат.Вставить("ItemMark");
	Результат.Вставить("AdditionalProperty");
	
	Результат.Вставить("Unit");
	Результат.Вставить("UnitName");
	
	Результат.Вставить("ItemToRelease");
	Результат.Вставить("Quantity");
	
	Результат.Вставить("Price");
	Результат.Вставить("SubtotalWithVatExcluded");
	Результат.Вставить("TaxRate");
	Результат.Вставить("Vat");
	Результат.Вставить("WithoutVat");
	Результат.Вставить("Subtotal");
	Результат.Вставить("Excise");
	
	Результат.Вставить("HyphenUnit");
	Результат.Вставить("HyphenVat");
	Результат.Вставить("HyphenSubtotal");
	
	Результат.Вставить("CustomDeclarations"		, Новый Массив); // Новый_CustomDeclaration820()
	Результат.Вставить("StructedAdditionalInfos", Новый Массив); // Новый_StructedAdditionalInfo()
	
	Результат.Вставить("ItemTracingInfos"			, Новый Массив); // Новый_ItemTracingInfo()
	Результат.Вставить("ItemIdentificationNumbers"	, Новый Массив); // Новый_ItemIdentificationNumber()
	
	Результат.Вставить(ИмяСвойстваСлужебнаяИнформация());
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Utd820Table()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Items", Новый Массив);
	
	Результат.Вставить("TotalNet");
	
	Результат.Вставить("TotalWithVatExcluded");
	Результат.Вставить("Vat");
	Результат.Вставить("Total");
	Результат.Вставить("WithoutVat");
	
	Результат.Вставить("HyphenVat");
	Результат.Вставить("HyphenTotal");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Torg12Items(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат НоваяТаблицаЗначений(
	"Product, UnitCode, Quantity, Price, TaxRate, TotalWithVatExcluded,
	|Vat, Total, Feature, Sort, Article, ProductCode, UnitName, ParcelType,
	|ParcelCapacity, ParcelsQuantity, GrossQuantity, AdditionalInfo, 
	|НоменклатураСсылка, ХарактеристикаСсылка, СерияСсылка, СсылкаНаЕИ, СлужебнаяИнформация");
	
КонецФункции

Функция Новый_ExtendedInvoiceItems(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструктор("CustomDeclarations"	 , "Новый_CustomDeclarations"	  , Конструкторы, ПолноеИмя);
	ДобавитьКонструктор("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	Возврат НоваяТаблицаЗначений(
	"Product, UnitCode, UnitName, Quantity, Price, Excise, TaxRate,
	|SubtotalWithVatExcluded, Vat, Subtotal, ItemMark, AdditionalProperty,
	|VendorCode, ToRelease, AccountDebit, AccountCredit, CustomDeclarations, StructedAdditionalInfos,
	|НоменклатураСсылка, ХарактеристикаСсылка, СерияСсылка, ЕдиницаИзмеренияСсылка, СлужебнаяИнформация");
	
КонецФункции

Функция Новый_InvoiceCorrectionTable(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура("TotalsInc, TotalsDec, Items");
	
	Content.TotalsDec	= НовыйЭлементContent("TotalsDec", "Новый_InvoiceTotalsDiff", Конструкторы, ПолноеИмя);
	Content.TotalsInc	= НовыйЭлементContent("TotalsInc", "Новый_InvoiceTotalsDiff", Конструкторы, ПолноеИмя);
	Content.Items 		= НовыйЭлементContent("Items", "Новый_ExtendedInvoiceCorrectionItems", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_ItemTracingInfo736(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("QuantityDiff");
	Результат.Вставить("RegNumberUnit");
	Результат.Вставить("Unit");
	Результат.Вставить("ItemAddInfo");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ExtendedInvoiceCorrectionItems(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструктор("OriginalValues" , "Новый_InvoiceItemFields", Конструкторы, ПолноеИмя);
	ДобавитьКонструктор("CorrectedValues", "Новый_InvoiceItemFields", Конструкторы, ПолноеИмя);
	
	ДобавитьКонструктор("AmountsInc", "Новый_AmountsDiff", Конструкторы, ПолноеИмя);
	ДобавитьКонструктор("AmountsDec", "Новый_AmountsDiff", Конструкторы, ПолноеИмя);
	
	ДобавитьКонструктор("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	ДобавитьКонструктор("ItemTracingInfos",
	"Новый_ItemTracingInfo736",
	Конструкторы,
	ПолноеИмя);
	
	ДобавитьКонструктор("OriginalItemIdentificationNumbers",
	"Новый_ItemIdentificationNumber",
	Конструкторы,
	ПолноеИмя);
	
	ДобавитьКонструктор("CorrectedItemIdentificationNumbers",
	"Новый_ItemIdentificationNumber",
	Конструкторы,
	ПолноеИмя);
	
	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить("Product");
	ИменаКолонок.Добавить("OriginalValues");
	ИменаКолонок.Добавить("CorrectedValues");
	ИменаКолонок.Добавить("AmountsInc");
	ИменаКолонок.Добавить("AmountsDec");
	ИменаКолонок.Добавить("ItemAccountDebit");
	ИменаКолонок.Добавить("ItemAccountCredit");
	ИменаКолонок.Добавить("StructedAdditionalInfos");
	ИменаКолонок.Добавить("НоменклатураСсылка");
	ИменаКолонок.Добавить("ХарактеристикаСсылка");
	ИменаКолонок.Добавить("СерияСсылка");
	ИменаКолонок.Добавить("СлужебнаяИнформация");
	
	ИменаКолонок.Добавить("OriginalNumber");
	ИменаКолонок.Добавить("ItemTracingInfos");
	ИменаКолонок.Добавить("ItemCharact");
	ИменаКолонок.Добавить("ItemKind");
	ИменаКолонок.Добавить("ItemArticle");
	ИменаКолонок.Добавить("ItemVendorCode");
	ИменаКолонок.Добавить("ItemTypeCode");
	ИменаКолонок.Добавить("OriginalUnitName");
	ИменаКолонок.Добавить("CorrectedUnitName");
	
	Разделитель = ", ";
	КолонкиСтрокой = Преобразование_МассивВСтроку(ИменаКолонок, Разделитель);
	
	Результат = НоваяТаблицаЗначений(КолонкиСтрокой);
	
	ОписаниеТиповМассив = Новый ОписаниеТипов("Массив");
	Результат.Колонки.Добавить("OriginalItemIdentificationNumbers"	, ОписаниеТиповМассив);
	Результат.Колонки.Добавить("CorrectedItemIdentificationNumbers"	, ОписаниеТиповМассив);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_EventContent(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура();
	
	Content.Вставить("OperationContent");
	Content.Вставить("NotificationDate");
	Content.Вставить("TransferDocDetails");
	Content.Вставить("TransferDocDetails736");
	Content.Вставить("CostChangeInfo");
	Content.Вставить("CorrectionBases");
	
	Content.TransferDocDetails736 	= НовыйЭлементContent("TransferDocDetails736", "Новый_BaseDocumentName", Конструкторы, ПолноеИмя);
	Content.CorrectionBases 		= НовыйЭлементContent("CorrectionBases", "Новый_CorrectionBases", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_CorrectionBases(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат НоваяТаблицаЗначений("BaseDocumentName, BaseDocumentNumber, BaseDocumentDate, AdditionalInfo");
	
КонецФункции

Функция Новый_BaseDocumentName(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Колонки = "BaseDocumentName, BaseDocumentNumber, BaseDocumentDate, AdditionalInfo, BaseIdFile";
	
	Результат = НоваяТаблицаЗначений(Колонки);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_TransferInfo(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура(
	"OperationInfo, OperationType, TransferDate, TransferTextInfo,
	|Carrier, Employee, OtherIssuer, CreatedThingTransferDate,
	|CreatedThingInfo, AdditionalInfoId, TransferBases, Waybills");
	
	Content.TransferBases= 	  НовыйЭлементContent("TransferBases"	, "Новый_TransferBases"				, Конструкторы, ПолноеИмя);
	Content.Waybills= 		  НовыйЭлементContent("Waybills"		, "Новый_Waybills"					, Конструкторы, ПолноеИмя);
	Content.Carrier= 		  НовыйЭлементContent("Carrier" 		, "Новый_ExtendedOrganizationInfo"	, Конструкторы, ПолноеИмя);
	Content.Employee= 		  НовыйЭлементContent("Employee"		, "Новый_Employee"					, Конструкторы, ПолноеИмя);
	Content.OtherIssuer= 	  НовыйЭлементContent("OtherIssuer"		, "Новый_OtherIssuer"				, Конструкторы, ПолноеИмя);
	Content.AdditionalInfoId= НовыйЭлементContent("AdditionalInfoId", "Новый_AdditionalInfoId"			, Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_TransferInfo820(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура(
	"OperationInfo, OperationType, TransferDate, TransferTextInfo,
	|Carrier, Employee, OtherIssuer, CreatedThingTransferDate,
	|CreatedThingInfo, AdditionalInfoId, TransferBases, Waybills,
	|TransferStartDate, TransferEndDate");
	
	Content.TransferBases	 = НовыйЭлементContent("TransferBases"		, "Новый_TransferBases820"				, Конструкторы, ПолноеИмя);
	Content.Waybills		 = НовыйЭлементContent("Waybills"			, "Новый_Waybills"						, Конструкторы, ПолноеИмя);
	Content.Carrier			 = НовыйЭлементContent("Carrier" 			, "Новый_ExtendedOrganizationInfo820"	, Конструкторы, ПолноеИмя);
	Content.Employee		 = НовыйЭлементContent("Employee"			, "Новый_Employee"						, Конструкторы, ПолноеИмя);
	Content.OtherIssuer		 = НовыйЭлементContent("OtherIssuer"		, "Новый_OtherIssuer"					, Конструкторы, ПолноеИмя);
	Content.AdditionalInfoId = НовыйЭлементContent("AdditionalInfoId"	, "Новый_AdditionalInfoId"				, Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_ExtendedSigners(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	ДобавитьКонструкторЭлементаМассива("Новый_ExtendedSigner", Конструкторы, ПолноеИмя);
	
	Возврат Новый Массив;
	
КонецФункции

Функция Новый_ExtendedSigner(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/ExtendedSigner.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("BoxId");
	Результат.Вставить("CertificateThumbprint");
	
	Результат.Вставить("SignerDetails", Новый_ExtendedSignerDetails());
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Official(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("JobTitle, Surname, FirstName, Patronymic");
	
КонецФункции

Функция Новый_Attorney(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура("Date, Number, Issuer, IssuerAdditionalInfo, IssuerOrganizationName, Recipient, RecipientAdditionalInfo");
	
	Content.Issuer =    НовыйЭлементContent("Issuer"   , "Новый_Official", Конструкторы, ПолноеИмя);
	Content.Recipient = НовыйЭлементContent("Recipient", "Новый_Official", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_PersonalCertificate(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("BeginDate");
	Результат.Вставить("EndDate");
	Результат.Вставить("Inn");
	Результат.Вставить("Kpp");
	Результат.Вставить("IsQualifiedElectronicSignature");
	Результат.Вставить("IssuerName");
	Результат.Вставить("Name");
	Результат.Вставить("OrganizationName");
	Результат.Вставить("SerialNumber");
	Результат.Вставить("Thumbprint");
	Результат.Вставить("JobTitle");
	Результат.Вставить("Algorithm");
	Результат.Вставить("AlgorithmOID");
	Результат.Вставить("OwnerType");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Signature(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура("Certificate, SignDate, SignatureAuthenticityDate");
	
	Content.Certificate = НовыйЭлементContent("Issuer"   , "Новый_PersonalCertificate", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_AcceptanceCertificateItems(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат НоваяТаблицаЗначений(
	"Name, Description, UnitCode, UnitName, Quantity, Price,
	|TotalWithVatExcluded, Vat, Total, AdditionalInfo,
	|НоменклатураСсылка, ХарактеристикаСсылка, СерияСсылка, СсылкаНаЕИ, СлужебнаяИнформация");
	
КонецФункции	

Функция Новый_InvoiceItems(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструктор("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	Возврат НоваяТаблицаЗначений(
	"Product, UnitCode, ЕдиницаИзмеренияСсылка, Quantity, Price,
	|CountriesOfOrigin, СтранаПроисхожденияСсылка, CustomsDeclarationNumbers,
	|Excise, TaxRate, TotalWithVatExcluded, Vat, Total, StructedAdditionalInfos, 
	|НоменклатураСсылка, ХарактеристикаСсылка, СерияСсылка, СсылкаНаЕИ, СлужебнаяИнформация");
	
КонецФункции

Функция Новый_TransferBases(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат НоваяТаблицаЗначений("DocumentName, DocumentNumber, DocumentDate, DocumentInfo, СлужебнаяИнформация");
	
КонецФункции

Функция Новый_TransferBases820(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат НоваяТаблицаЗначений("DocumentName, DocumentNumber, DocumentDate, DocumentInfo, BaseDocumentId, СлужебнаяИнформация");
	
КонецФункции

Функция Новый_TransferBase820(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentName");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("DocumentDate");
	Результат.Вставить("DocumentInfo");
	Результат.Вставить("BaseDocumentId");
	
	Результат.Вставить(ИмяСвойстваСлужебнаяИнформация());
	
	Возврат Результат;
	
КонецФункции

Функция Новый_SellerInfoCircumPublicProc(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("DateStateContract");
	Результат.Вставить("NumberStateContract");
	Результат.Вставить("PersonalAccountSeller");
	Результат.Вставить("SellerBudjetClassCode");
	Результат.Вставить("SellerTargetCode");
	Результат.Вставить("SellerTreasuryCode");
	Результат.Вставить("SellerTreasuryName");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_BuyerInfoCircumPublicProc()
	
	Результат = Новый Структура;
	
	Результат.Вставить("PersonalAccountBuyer");
	
	Результат.Вставить("ProcCode");
	Результат.Вставить("NameFinAuthority");
	Результат.Вставить("BuyerRegistryEntryNumber");
	Результат.Вставить("BuyerLiabNumber");
	Результат.Вставить("BuyerTreasuryCode");
	Результат.Вставить("SellerTreasuryName");
	
	Результат.Вставить("OKTMOBuy");
	Результат.Вставить("OKTMOPlaceDelivery");
	
	Результат.Вставить("PayDeadLine");
	Результат.Вставить("PriorityPayment");
	Результат.Вставить("TypePayment");
	Результат.Вставить("NumberFundsLiab");
	
	Результат.Вставить("InfoFundsLiab", Новый Массив); // Новый_InfoFundsLiab()
	
	Возврат Результат;
	
КонецФункции

Функция Новый_InfoFundsLiab() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("NumberString");
	Результат.Вставить("ObjectCodeFAIP");
	Результат.Вставить("TypeFundsSource");
	Результат.Вставить("BuyerBudjetClassCode");
	Результат.Вставить("BuyerTargetCode");
	Результат.Вставить("AmountAdvance");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ContentOperCode()
	
	Результат = Новый Структура;
	
	Результат.Вставить("TotalCode");
	Результат.Вставить("NameDiscrepDocument");
	Результат.Вставить("TypeDiscrepDocument");
	Результат.Вставить("NumberDiscrepDocument");
	Результат.Вставить("DateDiscrepDocument");
	Результат.Вставить("IdDiscrepDocument");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ItemTracingInfo() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("RegNumberUnit");
	Результат.Вставить("Unit");
	Результат.Вставить("UnitName");
	Результат.Вставить("Quantity");
	Результат.Вставить("ItemAddInfo");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ItemIdentificationNumber() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("TransPackageId");
	Результат.Вставить("Units"		, Новый Массив);
	Результат.Вставить("PackageIds"	, Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_DocumentShipments(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат НоваяТаблицаЗначений("Name, Number, Date");
	
КонецФункции

Функция Новый_Waybills(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструкторЭлементаМассива("Новый_Waybill", Конструкторы, ПолноеИмя);
	
	Возврат Новый Массив;
	
КонецФункции

Функция Новый_Waybill(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/Waybill.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentDate");
	Результат.Вставить("DocumentNumber");
	
	Возврат Результат; 
	
КонецФункции

Функция Новый_AmountsDiff(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат Новый Структура("Excise, TotalWithVatExcluded, Vat, Total");
	
КонецФункции

Функция Новый_InvoiceTotalsDiff(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат Новый Структура("TotalWithVatExcluded, Vat, Total, WithoutVat");
	
КонецФункции

Функция Новый_InvoiceItemFields(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("UnitCode");
	Результат.Вставить("UnitName");
	Результат.Вставить("Quantity");
	
	Результат.Вставить("Price");
	Результат.Вставить("TotalWithVatExcluded");
	Результат.Вставить("TaxRate");
	Результат.Вставить("Vat");
	Результат.Вставить("Total");
	Результат.Вставить("Excise");
	Результат.Вставить("WithoutVat");
	
	Результат.Вставить("ЕдиницаИзмеренияСсылка");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_InvoiceCorrectionItems(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструктор("OriginalValues" , "Новый_InvoiceItemFields", Конструкторы, ПолноеИмя);
	ДобавитьКонструктор("CorrectedValues", "Новый_InvoiceItemFields", Конструкторы, ПолноеИмя);
	
	ДобавитьКонструктор("AmountsInc", "Новый_AmountsDiff", Конструкторы, ПолноеИмя);
	ДобавитьКонструктор("AmountsDec", "Новый_AmountsDiff", Конструкторы, ПолноеИмя);
	
	ДобавитьКонструктор("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	Возврат НоваяТаблицаЗначений(
	"Product, StructedAdditionalInfos, AmountsDec, AmountsInc, OriginalValues, CorrectedValues,
	|НоменклатураСсылка, ХарактеристикаСсылка, СерияСсылка, СлужебнаяИнформация");
	
КонецФункции

Функция Новый_PaymentDocuments(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат НоваяТаблицаЗначений("Date, Number");
	
КонецФункции

Функция Новый_Torg12Commons(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("TotalGrossQuantity, TotalGrossQuantityInWords, TotalParcelsQuantity, TotalParcelsQuantityInWords, TotalQuantity, TotalQuantityInWords, TotalSum, TotalSumInWords");
	
КонецФункции

Функция Новый_Torg12Totals(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("GrossQuantity, Quantity, ParcelsQuantity, TotalWithVatExcluded, Total, Vat");
	
КонецФункции

Функция Новый_Signer(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// https://diadocsdk-1c.readthedocs.io/ru/latest/ComObjects/Signer.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("Surname");
	Результат.Вставить("FirstName");
	Результат.Вставить("Patronymic");
	Результат.Вставить("INN");
	Результат.Вставить("JobTitle");
	Результат.Вставить("IsSoleProprietor");
	Результат.Вставить("SoleProprietorRegistrationCertificate");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_OriginalInvoices(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструкторЭлементаМассива("Новый_OriginalInvoice", Конструкторы, ПолноеИмя);
	
	Возврат Новый Массив;
	
КонецФункции

Функция Новый_OriginalInvoice(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("Date, Number, InvoiceRevisionDate, InvoiceRevisionNumber");
	
КонецФункции

Функция Новый_CustomDeclarations(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	//ДобавитьКонструкторЭлементаМассива("Новый_CustomDeclaration", Конструкторы, ПолноеИмя);
	
	Возврат НоваяТаблицаЗначений("CountryCode, DeclarationNumber, СтранаПроисхожденияСсылка");
	
КонецФункции

Функция Новый_CustomDeclaration820() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("CountryCode");
	Результат.Вставить("DeclarationNumber");
	Результат.Вставить("HyphenCountry");
	
	Результат.Вставить("СтранаПроисхожденияСсылка");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ExtendedSignerDetails(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	// http://diadocsdk-1c.readthedocs.io/ru/latest/ExtendedSignerDetails.html
	
	Результат = Новый Структура;
	
	Результат.Вставить("Status");
	Результат.Вставить("SignerType");
	Результат.Вставить("SignerInfo");
	
	Результат.Вставить("Surname");
	Результат.Вставить("FirstName");
	Результат.Вставить("Patronymic");
	
	Результат.Вставить("JobTitle");
	
	Результат.Вставить("Inn");
	Результат.Вставить("OrganizationName");
	Результат.Вставить("RegistrationCertificate");
	
	Результат.Вставить("Powers");
	Результат.Вставить("PowersBase");
	Результат.Вставить("OrganizationPowersBase");
	
	Возврат Результат; 
	
КонецФункции

Функция Новый_AdditionalInfoId(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура("InfoFileId, StructedAdditionalInfos");
	
	Content.StructedAdditionalInfos = НовыйЭлементContent("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	Возврат Content;
	
КонецФункции

Функция Новый_StructedAdditionalInfos(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструкторЭлементаМассива("Новый_StructedAdditionalInfo", Конструкторы, ПолноеИмя);
	
	Возврат Новый Массив;
	
КонецФункции

Функция Новый_StructedAdditionalInfo(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("Key, Value");
	
КонецФункции

Функция Новый_Employee(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("EmployeePosition, EmployeeInfo, EmployeeBase, Surname, FirstName, Patronymic");
	
КонецФункции

Функция Новый_OtherIssuer(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("EmployeePosition, EmployeeInfo, OrganizationName, OrganizationBase, EmployeeBase, Surname, FirstName, Patronymic");
	
КонецФункции

Функция Новый_InvoiceTotals(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Возврат Новый Структура("TotalWithVatExcluded, Total, Vat");
	
КонецФункции

Функция Новый_ExtendedSignerDetailsToPost(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Возврат Новый Структура("JobTitle, RegistrationCertificate, SignerType, SignerInfo, Powers, Status, PowersBase, OrganizationPowersBase");
	
КонецФункции

Функция Новый_Departments(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструкторЭлементаМассива("Новый_Department", Конструкторы, ПолноеИмя);
	
	Возврат Новый Массив;
	
КонецФункции

Функция Новый_Department(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Id");
	Результат.Вставить("Kpp");
	Результат.Вставить("Name");
	Результат.Вставить("Abbreviation");
	
	Результат.Вставить("Subdepartments", НовыйЭлементContent("Subdepartments", "Новый_Departments", Конструкторы, ПолноеИмя));
	Результат.Вставить("Address"	   , НовыйЭлементContent("Address"		 , "Новый_AddressInfo", Конструкторы, ПолноеИмя));
	
	Возврат Результат;
	
КонецФункции

Функция Новый_OrganizationUser(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура;
	
	Content.Вставить("Id"  			);
	Content.Вставить("Name"			);
	Content.Вставить("Position"		);
	Content.Вставить("IsCurrentUser");
	
	Content.Вставить("Permissions", НовыйЭлементContent("Permissions", "Новый_UserPermissions", Конструкторы, ПолноеИмя));
	
	Возврат Content;
	
КонецФункции

Функция Новый_UserPermissions(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Content = Новый Структура;
	
	Content.Вставить("IsAdministrator"         );
	Content.Вставить("DocumentsAccessLevel"	   );
	Content.Вставить("CanSignDocuments"        );
	Content.Вставить("CanAddResolutions"   	   );
	Content.Вставить("CanRequestResolutions"   );
	
	Content.Вставить("UserDepartment"	  , НовыйЭлементContent("UserDepartment"	 , "Новый_Department"	, Конструкторы, ПолноеИмя));
	Content.Вставить("SelectedDepartments", НовыйЭлементContent("SelectedDepartments", "Новый_Departments", Конструкторы, ПолноеИмя));
	
	Возврат Content;
	
КонецФункции

Функция Новый_Nonformalized()
	
	Результат = Новый Структура;
	
	// Мета
	Результат.Вставить("FileName");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("DocumentDate");
	
	// Служебные поля
	Результат.Вставить("Comment");
	Результат.Вставить("NeedRecipientSignature", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ServiceDetails()
	
	Результат = Новый Структура;
	
	// Мета
	Результат.Вставить("FileName");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("DocumentDate");
	
	// Служебные поля
	Результат.Вставить("Comment");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ProformaInvoice()
	
	Результат = Новый Структура;
	
	// Мета
	Результат.Вставить("FileName");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("DocumentDate");
	Результат.Вставить("Grounds");
	Результат.Вставить("TotalSum");
	Результат.Вставить("TotalVat");
	
	// Служебные поля
	Результат.Вставить("Comment");
	Результат.Вставить("БезНДС", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_PriceList()
	
	Результат = Новый Структура;
	
	// Мета
	Результат.Вставить("FileName");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("DocumentDate");
	Результат.Вставить("PriceListEffectiveDate");
	Результат.Вставить("ContractDocumentNumber");
	Результат.Вставить("ContractDocumentDate");
	
	// Служебные поля
	Результат.Вставить("Comment");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_AcceptanceCertificate()
	
	Результат = Новый Структура;
	
	// Мета
	Результат.Вставить("FileName");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("DocumentDate");
	Результат.Вставить("TotalSum");
	Результат.Вставить("TotalVat");
	Результат.Вставить("Grounds");
	
	// Служебные поля
	Результат.Вставить("Comment");
	Результат.Вставить("БезНДС", Ложь);
	Результат.Вставить("NeedRecipientSignature", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Contract(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	// Мета
	Результат.Вставить("FileName");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("DocumentDate");
	Результат.Вставить("ContractType");
	Результат.Вставить("ContractPrice");
	
	// Служебные поля
	Результат.Вставить("Comment");
	Результат.Вставить("ЦенаНеУказана", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру Contract объекта ProformaInvoiceSellerContent.
//
// Возвращаемое значение:
//  Структура - содержит ключи:
//     * Name	 - Строка	 - Наименование договора;
//     * Number	 - Строка	 - (Необязательный) Номер договора;
//     * Date	 - Дата		 - (Необязательный) Дата договора;
//
Функция Новый_ContractInfo(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Name");
	Результат.Вставить("Number");
	Результат.Вставить("Date");
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру ProformaInvoiceSellerContent.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//     * DocumentDate - Дата - Дата составления счета на оплату;
//     * DocumentNumber - Строка - Номер счета на оплату;
//     * Seller - Структура - Сведения о продавце, БанкРекв обязательны для СвПрод (см. Новый_ExtendedOrganizationInfo());
//     * Buyer - Структура - Сведения о покупателе (см. Новый_ExtendedOrganizationInfo());
//     * Recipient - Структура - (Необязательный) Сведения о получателе платежа (см. Новый_ExtendedOrganizationInfo());
//     * Payer - Структура - (Необязательный) Сведения о плательщике (см. Новый_ExtendedOrganizationInfo());
//     * Contract - Структура - (Необязательный) Договор (см. Новый_ContractInfo());
//     * Currency - Строка - (Необязательный) Код валюты по Общероссийскому классификатору валют;
//     * CurrencyRate - Число - (Необязательный) Курс валюты;
//     * GovernmentContractInfo - Строка - (Необязательный) Идентификатор государственного контракта;
//     * PaymentPurpose - Строка - (Необязательный) Назначение платежа;
//     * Signer - Структура - Сведения о лице, подписывающем файл счета на оплату в электронной форме (см. Новый_Signer());
//     * ProformaInvoiceTable - Структура - Сведения об отгруженных товарах (о выполненных работах, оказанных услугах), переданных имущественных правах (см. Новый_ProformaInvoiceTable());
//     * PersonalAccountInfo - Массив - Сведения по изменению лицевого счета;
//     * AdditionalInfo - Массив - Дополнительные сведения к документу, содержит структуры StructedAdditionalInfo (см. Новый_StructedAdditionalInfo());
//
Функция Новый_ProformaInvoiceSellerContent(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentDate");
	Результат.Вставить("DocumentNumber");
	Результат.Вставить("Seller");
	Результат.Вставить("Buyer");
	Результат.Вставить("Recipient");
	Результат.Вставить("Payer");
	Результат.Вставить("Contract");
	Результат.Вставить("Currency");
	Результат.Вставить("CurrencyRate");
	Результат.Вставить("GovernmentContractInfo");
	Результат.Вставить("PaymentPurpose");
	Результат.Вставить("Signer");
	Результат.Вставить("ProformaInvoiceTable");
	Результат.Вставить("PersonalAccountInfo");
	Результат.Вставить("StructedAdditionalInfos");
	
	// Участники сделки
	Результат.Seller	 = НовыйЭлементContent("Seller"		, "Новый_ExtendedOrganizationInfo"	, Конструкторы, ПолноеИмя);
	Результат.Buyer		 = НовыйЭлементContent("Buyer"		, "Новый_ExtendedOrganizationInfo"	, Конструкторы, ПолноеИмя);
	Результат.Recipient	 = НовыйЭлементContent("Recipient"	, "Новый_ExtendedOrganizationInfo"	, Конструкторы, ПолноеИмя);
	Результат.Payer		 = НовыйЭлементContent("Payer"		, "Новый_ExtendedOrganizationInfo"	, Конструкторы, ПолноеИмя);
	
	// Договор, соглашение
	Результат.Contract = НовыйЭлементContent("Contract", "Новый_ContractInfo", Конструкторы, ПолноеИмя);
	
	// Подписант
	Результат.Signer = НовыйЭлементContent("Signer", "Новый_Signer", Конструкторы, ПолноеИмя);
	
	// Табличная часть
	Результат.ProformaInvoiceTable = НовыйЭлементContent("ProformaInvoiceTable", "Новый_ProformaInvoiceTable", Конструкторы, ПолноеИмя);
	
	// Сведения о лицевых счетах
	Результат.PersonalAccountInfo = НовыйЭлементContent("PersonalAccountInfo", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя); // Как и StructuredAdditionalInfos представляет собой массив структур с ключами "Key" и "Value"
	
	// Дополнительная информация
	Результат.StructedAdditionalInfos = НовыйЭлементContent("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	ИнициализироватьСлужебныеПоляПрото(Результат);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует коллекцию строк табличной части объекта ProformaInvoiceSellerContent.
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//     * Product - Строка - Наименование товара (описание выполненных работ, оказанных услуг), имущественных прав;
//     * Unit - Строка - Код единицы измерения по Общероссийскому классификатору единиц измерения или «0000» (при отсутствии необходимой единицы измерения в ОКЕИ). 
//                       В случае указания значения 0000 наименование единицы измерения определяется пользователем;
//     * UnitName - Строка - (Необязательный) Наименование единицы измерения;
//     * Quantity - Число - (Необязательный) Количество (объем);
//     * Price - Число - (Необязательный) Цена (тариф) за единицу измерения;
//     * SubtotalWithVatExcluded - Число - (Необязательный) Стоимость товаров (работ, услуг), имущественных прав без налога - всего;
//     * TaxRate - Строка - Налоговая ставка;
//     * Excise - Строка - (Необязательный) Сумма акциза;
//     * Vat - Число - (Необязательный) Сумма налога, предъявляемая покупателю;
//     * Subtotal - Число - Стоимость товаров (работ, услуг), имущественных прав с налогом - всего;
//     * StructedAdditionalInfos - Массив - Дополнительные сведения к строке документа, содержит структуры StructedAdditionalInfo (см. Новый_StructedAdditionalInfo());
//
Функция Новый_ProformaInvoiceItems(ПолноеИмя = "", Конструкторы = Неопределено)
	
	ДобавитьКонструктор("StructedAdditionalInfos", "Новый_StructedAdditionalInfos", Конструкторы, ПолноеИмя);
	
	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить("Product");
	ИменаКолонок.Добавить("Unit");
	ИменаКолонок.Добавить("UnitName");
	ИменаКолонок.Добавить("Quantity");
	ИменаКолонок.Добавить("Price");
	ИменаКолонок.Добавить("SubtotalWithVatExcluded");
	ИменаКолонок.Добавить("TaxRate");
	ИменаКолонок.Добавить("Excise");
	ИменаКолонок.Добавить("Vat");
	ИменаКолонок.Добавить("Subtotal");
	ИменаКолонок.Добавить("StructedAdditionalInfos");
	ИменаКолонок.Добавить(ИмяСвойстваСлужебнаяИнформация());
	
	ИменаКолонокСтрокой = Преобразование_МассивВСтроку(ИменаКолонок, ", ", Истина);
	
	Возврат НоваяТаблицаЗначений(ИменаКолонокСтрокой);
	
КонецФункции

// Инициализирует табличную часть объекта ProformaInvoiceSellerContent.
//
// Возвращаемое значение:
//  Структура содержит ключи:
//     * Items - Массив - содержит структуры ProformaInvoiceItem (см. Новый_ProformaInvoiceItem)
//     * TotalWithVatExcluded - Число - Всего к оплате без налога
//     * TotalVat - Число - Сумма налога (всего), предъявляемая покупателю
//     * Total - Число - Всего к оплате с учетом налога
//     * GrandTotal - Число - (Необязательный) Итого к оплате, с учетом дополнительных начислений, перерасчетов и оплат
//
Функция Новый_ProformaInvoiceTable(ПолноеИмя = "", Конструкторы = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Items");
	Результат.Вставить("TotalWithVatExcluded");
	Результат.Вставить("TotalVat");
	Результат.Вставить("Total");
	Результат.Вставить("GrandTotal");
	
	Результат.Items = НовыйЭлементContent("Items", "Новый_ProformaInvoiceItems", Конструкторы, ПолноеИмя);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Torg2RecipientTitle() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentCreator");
	Результат.Вставить("DocumentCreatorBase");
	Результат.Вставить("CompilationInfoDate");
	Результат.Вставить("TotalAcceptanceContent");
	Результат.Вставить("AdditionalInfoId", Новый_AdditionalInfoId_Torg2());
	
	Результат.Вставить("Signers", Новый Массив); // Новый_SignerTorg2()
	
	Возврат Результат;
	
КонецФункции

Функция Новый_AdditionalInfoId_Torg2()
	
	Результат = Новый Структура;
	Результат.Вставить("InfoFileId");
	Результат.Вставить("AdditionalInfo", Новый Массив); // Новый_IdValue
	
	Возврат Результат;
	
КонецФункции

Функция Новый_IdValue(Id = Неопределено, Value = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Id", Id);
	Результат.Вставить("Value", Value);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_SignerTorg2() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("SignerDetails", Новый_SignerDetailsTorg2());
	
	Возврат Результат;
	
КонецФункции

Функция Новый_SignerDetailsTorg2()
	
	Результат = Новый_ExtendedSignerDetailsBase();
	
	Результат.Вставить("SignerPowers");
	Результат.Вставить("SignerStatus");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ExtendedSignerDetailsBase()
	
	Результат = Новый Структура;
	
	Результат.Вставить("LastName");
	Результат.Вставить("FirstName");
	Результат.Вставить("MiddleName");
	Результат.Вставить("Position");
	Результат.Вставить("Inn");
	Результат.Вставить("RegistrationCertificate");
	Результат.Вставить("SignerType");
	Результат.Вставить("SignerOrganizationName");
	Результат.Вставить("SignerInfo");
	Результат.Вставить("SignerPowersBase");
	Результат.Вставить("SignerOrgPowersBase");
	
	Возврат Результат;
	
КонецФункции


//} ПУСТЫЕ СТРУКТУРЫ ДЛЯ ИНИЦИАЛИЗАЦИИ КОНТЕНТА

//{ ДАННЫЕ ДЛЯ ФОРМИРОВАНИЯ УПД/УКД

// Определяет значение параметра ФункцияУПД, используемого в
// методах заполнения контента. Алгоритм следующий:
//  - Пробуем определить результат по имени типа электронного документа (typeNamedId);
//  - В случае неудачи берем значение функции из формата отправки;
//  - Если результат не определен, возвращаем функцию по умолчанию;
//
// Параметры:
//  ФорматОтправки - Структура - см. НовоеОписаниеФорматаЭлектронногоДокумента;
// 
// Возвращаемое значение:
//  Строка - возможные значения указаны в перечислении ФункцииЭлектронныхДокументов;
//
Функция ФункцияУниверсальногоДокумента(ФорматОтправки)
	
	ТипыДокументов = ИдентификаторыТиповДокументов();
	ФункцииЭД = ФункцииЭлектронныхДокументов();
	
	ИмяТипа = ФорматОтправки.ИмяТипа;
	
	Если ИмяТипа = ТипыДокументов.Invoice
		Или ИмяТипа = ТипыДокументов.InvoiceRevision Тогда
		
		Результат = ФункцииЭД.СЧФ;
		
	ИначеЕсли ИмяТипа = ТипыДокументов.InvoiceCorrection
		Или ИмяТипа = ТипыДокументов.InvoiceCorrectionRevision Тогда
		
		Результат = ФункцииЭД.КСЧФ;
		
	ИначеЕсли ИмяТипа = ТипыДокументов.XmlTorg12
		Или ИмяТипа = ТипыДокументов.XmlAcceptanceCertificate Тогда
		
		Результат = ФункцииЭД.ДОП;
		
	Иначе
		
		Результат = ФорматОтправки.ФункцияДокумента;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = ФункцииЭД.ПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляФормированияУПД(ДокСсылка, ДопПараметры) Экспорт 
	
	Если ДопПараметры.ФункцияДокумента = "СЧФДОП" ИЛИ ДопПараметры.ФункцияДокумента = "СЧФ" Тогда
		
		СчетФактура 	   = ДокСсылка;
		ДокументыОснования = Модуль_Интеграция.ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(ДокСсылка);
		
	Иначе
		
		СчетФактура = Неопределено;
		
		ДокументыОснования = Новый Массив;
		ДокументыОснования.Добавить(ДокСсылка);
		
	КонецЕсли;
	
	Накладная = ?(ДокументыОснования[0].Метаданные().Имя = "РеализацияОтгруженныхТоваров", ДокументыОснования[0].ДокументОтгрузки, ДокументыОснования[0]);
	
	ДанныеШапки = Модуль_Интеграция.ПолучитьСтруктуруШапки(Накладная, СчетФактура);
	
	ДанныеШапки.Вставить("Номер"					, Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(Накладная));
	ДанныеШапки.Вставить("Подразделение"			, Модуль_Интеграция.ПолучитьПодразделениеИзДокумента(Накладная));
	
	Если НЕ ДанныеШапки.Свойство("БанковскийСчетОрганизации") Тогда
		ДанныеШапки.Вставить("БанковскийСчетОрганизации", Модуль_Интеграция.ПолучитьБанковскийСчетПоДокументу(Накладная));
	КонецЕсли;
	
	ДанныеШапки.Вставить("Функция", ?(ДопПараметры.ФункцияДокумента = "СЧФДОП", "InvoiceAndBasic", ?(ДопПараметры.ФункцияДокумента = "СЧФ", "Invoice", "Basic")));
	
	Если ДопПараметры.ФункцияДокумента = "СЧФДОП" ИЛИ ДопПараметры.ФункцияДокумента = "ДОП" Тогда
		ДатаОтгрузки = Накладная.Дата;
		Если ДатаОтгрузки <> ДанныеШапки.Дата Тогда
			ДанныеШапки.Вставить("ДатаОтгрузки", ДатаОтгрузки);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеШапки.Вставить("СуммаДокумента"		, Неопределено);
	ДанныеШапки.Вставить("СуммаНДСДокумента"	, Неопределено);
	ДанныеШапки.Вставить("СуммаБезНДСДокумента"	, Неопределено);
	
	СвГосРегИП = Модуль_Интеграция.ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(ДокСсылка.Организация);
	ДанныеШапки.Вставить("ДатаНомерСвидетельстваОРегистрации", СвГосРегИП);
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		
		ДанныеШапки.Вставить("НомераДляСФ"						 , Модуль_Интеграция.ПолучитьНомераДляСФ(СчетФактура));
		ДанныеШапки.Вставить("СФНаАванс"						 , Модуль_Интеграция.ЭтоСчетФактуранаАванс(СчетФактура));
		ДанныеШапки.Вставить("КПППокупателя"						 , Модуль_Интеграция.ПолучитьКПППокупателя(СчетФактура));
		ДанныеШапки.Вставить("ДатаНомерДокументовОплаты"		 , Модуль_Интеграция.ПолучитьДатуНомерДокументовОплаты(СчетФактура));
		ДанныеШапки.Вставить("СчетФактура"						 , СчетФактура);
		
		ТабличнаяЧасть = ПолучитьТаблицуСФ(СчетФактура, ДокументыОснования, Ложь, Ложь, ДанныеШапки);
		
	Иначе
		
		Если ДопПараметры.ТипДокумента = "XmlAcceptanceCertificate" Тогда
			ДанныеШапки.Вставить("ЭтоАкт", Истина);
		КонецЕсли;
		
		ТабличнаяЧасть = ПолучитьДанныеТабличнойЧастиДляДокументаРеализации(Накладная, ДанныеШапки, Истина);
		
	КонецЕсли;
	
	ДанныеШапки.Вставить("КПППродавца", Модуль_Интеграция.ПолучитьКПППродавца(ДокСсылка));
	ДанныеШапки.Вставить("СодержитТовары", ТабличнаяЧасть.Найти(Ложь, "ЭтоУслуга") <> Неопределено);
	
	Если НЕ ДанныеШапки.СодержитТовары Тогда
		ДанныеШапки.Грузоотправитель = Неопределено;
		ДанныеШапки.Грузополучатель  = Неопределено;
	КонецЕсли;
	
	ЗаполнитьОснованияПередачи(ДанныеШапки, ДокументыОснования, ДопПараметры);
	
	ДанныеШапки.Вставить("НДСИсчисляетсяНалоговымАгентом",	НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокСсылка));
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		
		Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
			СтрокаТЧ.СтавкаНДС	= СтавкаНДС_ИсчНалАг();
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьИтоговыеСуммыДокумента(ТабличнаяЧасть, ДанныеШапки);
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки"   , ДанныеШапки);
	Результат.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьОснованияПередачи(ДанныеШапки, ДокументыОснования, ДопПараметры)
	
	ДанныеШапки.Вставить("ОснованияПередачи", Новый_TransferBases());
	
	УказыватьОтсутствиеОснованияУПД = ДопПараметры.УказыватьОтсутствиеОснованияУПД;
	
	ДобавленныеОснования = Новый Соответствие;
	Для Каждого ДокументОснование Из ДокументыОснования Цикл
		
		СтруктураОснования = Модуль_Интеграция.ПолучитьСтруктуруОснованияУПД(ДокументОснование, ДанныеШапки);
		
		Если Не ЗначениеЗаполнено(СтруктураОснования.GroundName) 
			Или ДобавленныеОснования[СтруктураОснования.Основание] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныеОснования.Вставить(СтруктураОснования.Основание, Истина);
		
		ДобавитьОснованиеПередачи(ДанныеШапки, СтруктураОснования, УказыватьОтсутствиеОснованияУПД);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДобавленныеОснования) Тогда
		ЗаполнитьОснованияПередачиПоДоговору(ДанныеШапки, УказыватьОтсутствиеОснованияУПД);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОснованияПередачиПоДоговору(ДанныеШапки, УказыватьОтсутствиеОснованияУПД)
	
	ЭтоУПД = Истина;
	Договор = СвойствоСтруктуры(ДанныеШапки, "ДоговорКонтрагента");
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерИнтеграции = МодульМенеджерИнтеграции();
	СтруктураОснования = МенеджерИнтеграции.ПолучитьСтруктуруОснованияПоДоговору(Договор, ЭтоУПД);
	ДобавитьОснованиеПередачи(ДанныеШапки, СтруктураОснования, УказыватьОтсутствиеОснованияУПД);
	
КонецПроцедуры

Процедура ДобавитьОснованиеПередачи(ДанныеШапки, СтруктураОснования, УказыватьОтсутствиеОснованияУПД = Ложь)
	
	НоваяСтрока = ДанныеШапки.ОснованияПередачи.Добавить();
	
	Если Не ЗначениеЗаполнено(СтруктураОснования.GroundDate) И УказыватьОтсутствиеОснованияУПД Тогда
		НоваяСтрока.DocumentName   = "Отсутствует";
		НоваяСтрока.DocumentNumber = "";
		НоваяСтрока.DocumentDate   = Дата(1, 1, 1);
	Иначе
		НоваяСтрока.DocumentName   = СтруктураОснования.GroundName;
		НоваяСтрока.DocumentNumber = СокрЛП(СтруктураОснования.GroundNumber);
		НоваяСтрока.DocumentDate   = СтруктураОснования.GroundDate;
	КонецЕсли;
	
	СлужебнаяИнформация = Новый Структура;
	СлужебнаяИнформация.Вставить("ОснованиеСсылка");
	
	СлужебнаяИнформация.ОснованиеСсылка = СтруктураОснования.Основание;
	
	НоваяСтрока.СлужебнаяИнформация = СлужебнаяИнформация;
	
КонецПроцедуры

Функция ДанныеДляФормированияУКД(ДокСсылка, ДопПараметры) Экспорт 
	
	Если ДопПараметры.ФункцияДокумента = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияДокумента = "КСЧФ" Тогда
		СчетФактура 	   = ДокСсылка;
		ДокументыОснования = Модуль_Интеграция.ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(ДокСсылка);
	Иначе
		СчетФактура 		= Неопределено;
		ДокументыОснования 	= Новый Массив;
		ДокументыОснования.Добавить(ДокСсылка);
	КонецЕсли;
	
	Если ДокументыОснования[0].Метаданные().Имя = "РеализацияОтгруженныхТоваров" Тогда
		Накладная = ДокументыОснования[0].ДокументОтгрузки;
	Иначе
		Накладная = ДокументыОснования[0];
	КонецЕсли;
	
	ДанныеШапки = Модуль_Интеграция.ПолучитьСтруктуруШапки(Накладная, СчетФактура);
	
	ДанныеШапки.Вставить("НомераДляКСФ", Модуль_Интеграция.ПолучитьНомераДляКСФ(ДокСсылка));
	
	ДанныеШапки.Вставить("Номер", 			Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(Накладная));
	ДанныеШапки.Вставить("Подразделение", 	Модуль_Интеграция.ПолучитьПодразделениеИзДокумента(Накладная));
	
	Если НЕ ДанныеШапки.Свойство("БанковскийСчетОрганизации") Тогда
		ДанныеШапки.Вставить("БанковскийСчетОрганизации", Модуль_Интеграция.ПолучитьБанковскийСчетПоДокументу(Накладная));
	КонецЕсли;
	
	Если ДопПараметры.ФункцияДокумента = "КСЧФДИС" Тогда
		ФункцияДокумента = "InvoiceAndBasic";
	ИначеЕсли ДопПараметры.ФункцияДокумента = "КСЧФ" Тогда
		ФункцияДокумента = "Invoice";
	Иначе
		ФункцияДокумента = "Basic"; 	
	КонецЕсли;
	
	ДанныеШапки.Вставить("Функция", ФункцияДокумента);
	
	Если ДопПараметры.ФункцияДокумента = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияДокумента = "ДИС" Тогда
		ДатаУведомления = Накладная.Дата;
		Если ДатаУведомления <> ДанныеШапки.Дата Тогда
			ДанныеШапки.Вставить("ДатаУведомления", ДатаУведомления);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеШапки.Вставить("КПППродавца", Модуль_Интеграция.ПолучитьКПППродавца(ДокСсылка));
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		ДанныеШапки.Вставить("КПППокупателя", Модуль_Интеграция.ПолучитьКПППокупателя(СчетФактура)); 
	КонецЕсли;
	
	ТабличнаяЧасть = ПолучитьТаблицуСФ(СчетФактура, ДокументыОснования, Истина, ДопПараметры.ФункцияДокумента = "ДИС", ДанныеШапки);
	
	Если Накладная.Метаданные().Реквизиты.Найти("СопроводительныеДокументы") <> Неопределено Тогда
		ДанныеШапки.Вставить("ИныеСведенияОбИзмененииСтоимости", Накладная.СопроводительныеДокументы);
	КонецЕсли;
	
	ДанныеШапки.Вставить("ОснованияПередачи"		, Новый_CorrectionBases());
	
	РеквизитыПередаточныхДокументов		= Новый_BaseDocumentName();
	ДобавленныеПередаточныеДокументы	= Новый Соответствие;
	
	ТипПередаточногоДокумента = "УПД ";
	
	ДобавленныеОснования = Новый Соответствие;
	
	Для Каждого ДокументОснование Из ДокументыОснования Цикл
		
		Если ДанныеШапки.Свойство("ДоговорКонтрагента") Тогда
			МенеджерИнтеграции = МодульМенеджерИнтеграции();
			СтруктураОснования = МенеджерИнтеграции.ПолучитьСтруктуруОснованияПоДоговору(ДанныеШапки.ДоговорКонтрагента, Истина);
		Иначе
			СтруктураОснования = Модуль_Интеграция.ПолучитьСтруктуруОснования(ДокументОснование, Ложь, Истина);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураОснования.GroundDate) 
			И ЗначениеЗаполнено(СтруктураОснования.GroundName)
			И ДобавленныеОснования[СтруктураОснования.Основание] <> Истина Тогда
			
			ДобавленныеОснования.Вставить(СтруктураОснования.Основание, Истина);
			
			НоваяСтрока = ДанныеШапки.ОснованияПередачи.Добавить();
			НоваяСтрока.BaseDocumentName   = СтруктураОснования.GroundName;
			НоваяСтрока.BaseDocumentNumber = СокрЛП(СтруктураОснования.GroundNumber);
			НоваяСтрока.BaseDocumentDate   = СтруктураОснования.GroundDate;
			
		КонецЕсли;
		
		ИсправляемыйДокументРеализации = Модуль_Интеграция.ПолучитьИсправляемыйДокументРеализации(ДокументОснование);
		Если ДопПараметры.ФункцияДокумента = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияДокумента = "КСЧФ" Тогда 
			СФВыданный = Модуль_Интеграция.ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ИсправляемыйДокументРеализации);
			Если ЗначениеЗаполнено(СФВыданный) Тогда
				ПередаточныйДокумент = СФВыданный;
			Иначе
				ПередаточныйДокумент = ИсправляемыйДокументРеализации;
			КонецЕсли;
		Иначе
			ПередаточныйДокумент = ИсправляемыйДокументРеализации;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПередаточныйДокумент)
			Или ДобавленныеПередаточныеДокументы[ПередаточныйДокумент] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныеПередаточныеДокументы.Вставить(ПередаточныйДокумент, Истина);
		
		ЭлементBaseDocument = РеквизитыПередаточныхДокументов.Добавить();
		
		ЭлементBaseDocument.BaseDocumentName	= ТипПередаточногоДокумента;
		ЭлементBaseDocument.BaseDocumentNumber 	= Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ПередаточныйДокумент);
		ЭлементBaseDocument.BaseDocumentDate 	= Формат(ПередаточныйДокумент.Дата, "ДФ=dd.MM.yyyy");
		
	КонецЦикла;
	
	ДанныеШапки.Вставить("РеквизитыПередаточныхДокументов", РеквизитыПередаточныхДокументов); 
	
	ДанныеШапки.Вставить("НДСИсчисляетсяНалоговымАгентом",	НДСПоДокументуИсчисляетсяНалоговымАгентом(ИсправляемыйДокументРеализации));
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		
		Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
			
			СтрокаТЧ.СтавкаНДС				= СтавкаНДС_ИсчНалАг();
			СтрокаТЧ.СтавкаНДСДоИзменения	= СтавкаНДС_ИсчНалАг();
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки", 		ДанныеШапки);
	Результат.Вставить("ТабличнаяЧасть", 	ТабличнаяЧасть);
	
	Возврат Результат;
	
КонецФункции 	

//} ДАННЫЕ ДЛЯ ФОРМИРОВАНИЯ УПД/УКД

//{ ПРОЧЕЕ

Функция СократитьПредставлениеТелефона(телефонСтрока) Экспорт
	
	Если (СтрДлина(телефонСтрока) <= 20) Или (Найти(ТелефонСтрока, ";") = 0) Тогда
		Возврат ТелефонСтрока
	КонецЕсли;
	
	НовыйТелефон = "";
	СтарыйТелефон = ТелефонСтрока;
	Пока найти(СтарыйТелефон, ";") > 0 Цикл
		Если (НовыйТелефон = "") Или (СтрДлина(НовыйТелефон) + найти(СтарыйТелефон, ";") <= 20) Тогда
			//добавим кусок
			НовыйТелефон = ?(НовыйТелефон = "", "",  НовыйТелефон + ";") + Лев(СтарыйТелефон, Найти(СтарыйТелефон, ";") - 1);
			СтарыйТелефон = Прав(СтарыйТелефон, СтрДлина(СтарыйТелефон) - Найти(СтарыйТелефон, ";"));
		Иначе 
			СтарыйТелефон = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйТелефон;
	
КонецФункции

Функция ПредставлениеТелефона(Знач Телефоны, ТипТелефона, Знач МаксимальнаяДлинаСтроки, Разделитель= ";") Экспорт
	
	ПозицияНачалаФакса = Найти(Телефоны, "факс:");
	
	Если ПозицияНачалаФакса > 0 Тогда
		
		Если ТипТелефона = "Телефон" Тогда
			Телефоны = Лев(Телефоны, ПозицияНачалаФакса - 1);
		ИначеЕсли ТипТелефона= "Факс" Тогда
			Телефоны = Сред(Телефоны, ПозицияНачалаФакса + 5);
		КонецЕсли;
		
	КонецЕсли;
	
	МассивПодстрок= Преобразование_СтрокуВМассивПодстрок(Телефоны, Разделитель, Истина, Истина);
	
	Результат =	  "";
	Разделитель1 = "";
	
	Для Каждого Подстрока Из МассивПодстрок Цикл
		
		МаксимальнаяДлинаСтроки= МаксимальнаяДлинаСтроки - СтрДлина(Подстрока);
		
		Если МаксимальнаяДлинаСтроки < 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Разделитель1 + Подстрока;
		
		Разделитель1 = Разделитель;
		
		Если МаксимальнаяДлинаСтроки = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьТипДокумента(ДокументСсылка, НаименованиеТипа)
	
	Результат = НРег(ДокументСсылка.Метаданные().Имя) = НРег(НаименованиеТипа);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеВизирующего(ПараметрыПодписания, ИНН = Неопределено)  
	фио =  ПараметрыПодписания.ФиоПодписанта ;
	Official  = Новый Структура;
	Если ФИО = " " Тогда 
		Official.Вставить("Surname", " ");
		Official.Вставить("FirstName", " ");
		Official.Вставить("Patronymic", " ");
	Иначе 	 
		Official.Вставить("Surname", ВыделитьСлово(фио));
		Official.Вставить("FirstName", ВыделитьСлово(фио));
		Official.Вставить("Patronymic", ВыделитьСлово(фио));
	КонецЕсли;
	Official.Вставить("JobTitle" , ПараметрыПодписания.ДолжностьПодписанта);
	Если     ИНН <> Неопределено Тогда
		Official.Вставить("Inn" , ИНН);
	КонецЕсли;	
	Возврат   Official;
КонецФункции 

Процедура УстановитьАдресКонтрагента(КонтрагентСсылка, Address) Экспорт 
	
	ВидКИ_ЮрАдрес = Модуль_Интеграция.ПолучитьВидЮрАдресаКонтрагента();
	наб = регистрысведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	наб.Отбор.объект.установить(контрагентСсылка);
	наб.Отбор.Тип.установить(перечисления.ТипыКонтактнойИнформации.Адрес);
	наб.Отбор.Вид.установить(ВидКИ_ЮрАдрес);
	наб.Прочитать();
	
	Если наб.Количество() = 0 Тогда 
		ЗаписьРегистра = наб.Добавить();
		ЗаписьРегистра.Объект 	= КонтрагентСсылка;
		ЗаписьРегистра.Тип		= перечисления.ТипыКонтактнойИнформации.Адрес;
		ЗаписьРегистра.Вид 		= ВидКИ_ЮрАдрес;
		ПредыдущийАдрес = "";
	Иначе 	  
		ЗаписьРегистра =наб[0];
		ПредыдущийАдрес = ЗаписьРегистра.Представление;
	КонецЕсли;	
	ЗаписьРегистра.Поле1 =  Address.ZipCode;
	ЗаписьРегистра.Поле2 =  НаименованиеРегиона(Address.RegionCode);
	ЗаписьРегистра.Поле3 =  Address.Territory;
	ЗаписьРегистра.Поле4 =  Address.City;
	ЗаписьРегистра.Поле5 =  Address.Locality;
	ЗаписьРегистра.Поле6 =  Address.Street;
	ЗаписьРегистра.Поле7 =  Address.Building;
	ЗаписьРегистра.Поле8 =  Address.Block;
	ЗаписьРегистра.Поле9 =  Address.Apartment;
	ЗаписьРегистра.Представление =  Модуль_Интеграция.ПолучитьПредставлениеАдресаДляДиадок(ЗаписьРегистра);
	
	наб.Записать();
	записьЖурналаРегистрации("Диадок.ОбновлениеАдреса", , ,
		КонтрагентСсылка,
		?(ПредыдущийАдрес = "", "Установлен юридический адрес:",
			"Юридический адрес заменен с " + ПредыдущийАдрес + " на: ") + ЗаписьРегистра.Представление);
	
КонецПроцедуры

Функция ПолучитьВалютуРегламентированногоУчета()
	
	Если НЕ Метаданные.Константы.Найти("ВалютаРегламентированногоУчетаОрганизаций") = Неопределено Тогда
		Возврат  Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Иначе
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();	
	КонецЕсли;
	
КонецФункции

Функция СтавкаНДС_ИсчНалАг() Экспорт
	
	Возврат "ИсчНалАг";
	
КонецФункции // СтавкаНДС_ИсчНалАг()

Функция СтавкаНДС_БезНДС() Экспорт 
	
	Возврат "без НДС";
	
КонецФункции

Функция ЭтоСтавкаБезНДС(Ставка)
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(Ставка)
		Или НРег(Ставка) = НРег(СтавкаНДС_БезНДС()) Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьИтоговыеСуммыДокумента(ТабличнаяЧасть, ДанныеШапки)
	
	СуммаБезНДСДокумента = 0;
	СуммаНДСДокумента    = 0;
	СуммаДокумента       = 0;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		СуммаБезНДСДокумента = СуммаБезНДСДокумента + СтрокаТЧ.Сумма - ?(СтрокаТЧ.СуммаВключаетНДС, СтрокаТЧ.СуммаНДС, 0);
		СуммаНДСДокумента    = СуммаНДСДокумента + СтрокаТЧ.СуммаНДС;
		СуммаДокумента       = СуммаДокумента + СтрокаТЧ.Сумма + ?(СтрокаТЧ.СуммаВключаетНДС, 0, СтрокаТЧ.СуммаНДС);
	КонецЦикла;
	
	ДанныеШапки.СуммаБезНДСДокумента = Окр(СуммаБезНДСДокумента, 2);
	ДанныеШапки.СуммаНДСДокумента    = Окр(СуммаНДСДокумента, 2);
	ДанныеШапки.СуммаДокумента       = Окр(СуммаДокумента, 2);
	
КонецПроцедуры

Процедура ОчиститьСсылкиСтраныИГТДВСтрокеТабЧасти(СтрокаТЧ)
	
	Если  ЗначениеЗаполнено(СтрокаТЧ.СтранаПроисхождения)
		И ПустаяСтрока(Модуль_Интеграция.ПолучитьНомерГТД(СтрокаТЧ.НомерГТД))
		И СтранаЧленТС(СтрокаТЧ.СтранаПроисхождения.Код) Тогда
		
		Если СтранаРФ(СтрокаТЧ.СтранаПроисхождения.Код) Тогда
			СтрокаТЧ.СтранаПроисхождения = Справочники.КлассификаторСтранМира.ПустаяСсылка();
		КонецЕсли;
		
		СтрокаТЧ.НомерГТД = Модуль_Интеграция.ПустаяСсылкаНаНомерГТД();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных)
	
	СлужебнаяИнформация = Новый Структура;
	СлужебнаяИнформация.Вставить("Номенклатура");
	СлужебнаяИнформация.Вставить("Характеристика");
	СлужебнаяИнформация.Вставить("Серия");
	СлужебнаяИнформация.Вставить("НомерГТД");
	СлужебнаяИнформация.Вставить("Упаковка");
	СлужебнаяИнформация.Вставить("УпаковкаДоИзменения");
	СлужебнаяИнформация.Вставить("ЕдиницаИзмерения");
	СлужебнаяИнформация.Вставить("ЕдиницаИзмеренияДоИзменения");
	СлужебнаяИнформация.Вставить("СтранаПроисхождения");
	СлужебнаяИнформация.Вставить("ДанныеПрослеживаемости");
	СлужебнаяИнформация.Вставить("ПрослеживаемыйТовар");
	СлужебнаяИнформация.Вставить("ДокументОтгрузки");
	
	ЗаполнитьЗначенияСвойств(СлужебнаяИнформация, СтрокаДанных);
	
	НоменклатураСсылка = СтрокаДанных.Номенклатура;
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаДанных, "НоменклатураСсылка") Тогда 
		НоменклатураСсылка = СтрокаДанных.НоменклатураСсылка;
	КонецЕсли;
	
	СлужебнаяИнформация.Номенклатура = НоменклатураСсылка;
	
	Item.СлужебнаяИнформация = СлужебнаяИнформация;
	
	// для обратной совместимости с ПМ
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "НоменклатураСсылка") Тогда 
		Item.НоменклатураСсылка = НоменклатураСсылка;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "ХарактеристикаСсылка") Тогда 
		Item.ХарактеристикаСсылка = СтрокаДанных.Характеристика;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "СерияСсылка") Тогда 
		Item.СерияСсылка = СтрокаДанных.Серия;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "ЕдиницаИзмеренияСсылка") Тогда 
		Item.ЕдиницаИзмеренияСсылка = СлужебнаяИнформация.ЕдиницаИзмерения;
	ИначеЕсли ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "СсылкаНаЕИ") Тогда 
		Item.СсылкаНаЕИ = СлужебнаяИнформация.ЕдиницаИзмерения;
	ИначеЕсли ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "OriginalValues") 
		И ЕстьРеквизитИлиСвойствоОбъектаЛок(Item.OriginalValues, "ЕдиницаИзмеренияСсылка") Тогда 
		Item.OriginalValues.ЕдиницаИзмеренияСсылка = СлужебнаяИнформация.ЕдиницаИзмеренияДоИзменения;
	ИначеЕсли ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "CorrectedValues") 
		И ЕстьРеквизитИлиСвойствоОбъектаЛок(Item.CorrectedValues, "ЕдиницаИзмеренияСсылка") Тогда 
		Item.CorrectedValues.ЕдиницаИзмеренияСсылка = СлужебнаяИнформация.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(Item, "СтранаПроисхожденияСсылка") Тогда 
		Item.СтранаПроисхожденияСсылка = СлужебнаяИнформация.СтранаПроисхождения;
	КонецЕсли;
	
КонецПроцедуры

Функция ItemContent_UnitCode(ЕдиницаИзмерения, КодЕдиницыИзмерения, ПредставлениеПустого = "")
	
	ГенерацияXML = МодульГенерацияXML();
	КодЕдиницыКорректный = ГенерацияXML.КодЕдиницыИзмеренияСоответствуетКлассификатору(ЕдиницаИзмерения, СокрЛП(КодЕдиницыИзмерения));
	
	Если КодЕдиницыКорректный Тогда
		Результат = КодЕдиницыИзмерения;	
	Иначе
		Результат = ПредставлениеПустого;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция XML_КодЕдиницыИзмерения(КодЕдиницыИзмерения) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕдиницыИзмерения);
	Возврат Результат;
	
КонецФункции

// Возвращает наименование единицы измерения по таблице ОКЕИ
// 
// Параметры:
//	КодЕдиницыИзмерения - Строка - 	код единицы измерения
//	ПолноеНаименование	- Булево - 	Истина, если нужно полное наименование,
//									Ложь, если нужно сокращенное наименование
//
// Возвращаемое значение:
//	Строка
Функция НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(КодЕдиницыИзмерения, ПолноеНаименование = Ложь) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.НаименованиеЕдиницыИзмерения(КодЕдиницыИзмерения, ПолноеНаименование);
	
	Возврат Результат;
	
КонецФункции

//} ПРОЧЕЕ

//} ПРОТО КОНТЕНТ

//{ ФОРМИРОВАНИЕ XML Торг-12

Функция СформироватьСтрокуДопИнфо(ДопИнфо1, ДопИнфо2)
	Возврат ДопИнфо1 + ?(ЗначениеЗаполнено(ДопИнфо1) И ЗначениеЗаполнено(ДопИнфо2), " ", "") + ПреобразоватьМассивВСтроку(ДопИнфо2);
КонецФункции

Функция СформироватьСтрокуДопИнфоПоШаблону(ДопСведения)
	
	ДопСведенияПоШаблону = "";
	
	Если ЗначениеЗаполнено(ДопСведения) = Истина Тогда
		ДопСведенияПоШаблону = "<Данные>"; 
		МассивДопСведений = Преобразование_СтрокуВМассивПодстрок(ДопСведения, ";", Истина);
		Для Каждого Строка Из МассивДопСведений Цикл
			МассивОтСтроки = Преобразование_СтрокуВМассивПодстрок(Строка, "=", Истина);
			Если МассивОтСтроки.Количество() > 0 Тогда
				ДопСведенияПоШаблону = ДопСведенияПоШаблону + "<Реквизит Имя=""" + МассивОтСтроки[0] + """";
			КонецЕсли;
			Если МассивОтСтроки.Количество() > 1 Тогда
				ДопСведенияПоШаблону = ДопСведенияПоШаблону + " Значение=""" + МассивОтСтроки[1] + """/>";
			Иначе
				ДопСведенияПоШаблону = ДопСведенияПоШаблону + " Значение=""""/>"
			КонецЕсли;
		КонецЦикла;
		ДопСведенияПоШаблону = ДопСведенияПоШаблону + "</Данные>"
	КонецЕсли;
	
	Возврат ДопСведенияПоШаблону;
	
КонецФункции

Функция ПреобразоватьМассивВСтроку(Массив)
	Строка = "";
	Если ЗначениеЗаполнено(Массив) Тогда
		Для Каждого Стр Из Массив Цикл
			Если Стр.Key = "_" Тогда
				Строка = Строка + Стр.Value;
			Иначе
				Строка = Строка + " " + Стр.Key + ":" + Стр.Value + ";";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Строка;
КонецФункции

Процедура заполнитьПодписантаДляXmlTorg12(Official, Визирующий)
	
	Official.Surname	= Визирующий.Surname;
	Official.FirstName	= Визирующий.FirstName;
	Official.Patronymic	= Визирующий.Patronymic;
	Official.JobTitle	= Визирующий.JobTitle;
	
КонецПроцедуры	

Процедура ЗаполнитьФИОПодписанта(official, фио)
	
	ф = фио;
	official.Surname = ВыделитьСлово(ф);
	official.FirstName = ВыделитьСлово(ф);
	official.Patronymic = ВыделитьСлово(ф);
	
КонецПроцедуры 

Функция ИнициализацияТаблицыСФ(ЭтоКСФ)
	
	ТаблицаСФ = Новый ТаблицаЗначений();
	
	ТаблицаСФ.Колонки.Добавить("Номенклатура");
	ТаблицаСФ.Колонки.Добавить("НоменклатураСсылка");
	ТаблицаСФ.Колонки.Добавить("КодНоменклатуры");
	ТаблицаСФ.Колонки.Добавить("КодЕдиницыИзмерения");
	ТаблицаСФ.Колонки.Добавить("ПризнакТРУ");
	ТаблицаСФ.Колонки.Добавить("Масса", Новый ОписаниеТипов("Число"));
	ТаблицаСФ.Колонки.Добавить("СтранаПроисхождения");
	ТаблицаСФ.Колонки.Добавить("НомерГТД");
	ТаблицаСФ.Колонки.Добавить("Количество");
	ТаблицаСФ.Колонки.Добавить("Упаковка");
	ТаблицаСФ.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаСФ.Колонки.Добавить("Цена");
	ТаблицаСФ.Колонки.Добавить("СтавкаНДС");
	ТаблицаСФ.Колонки.Добавить("СуммаНДС");
	ТаблицаСФ.Колонки.Добавить("Сумма");
	ТаблицаСФ.Колонки.Добавить("СуммаВключаетНДС");
	ТаблицаСФ.Колонки.Добавить("ЭтоУслуга", Новый ОписаниеТипов("Булево"));
	ТаблицаСФ.Колонки.Добавить("ДопИнфо");
	
	ТаблицаСФ.Колонки.Добавить("Характеристика");
	ТаблицаСФ.Колонки.Добавить("Серия");
	
	ТаблицаСФ.Колонки.Добавить("ДокументОтгрузки");
	
	ДобавитьКолонкиПрослеживаемости(ТаблицаСФ);
	
	Если ЭтоКСФ Тогда 
		ТаблицаСФ.Колонки.Добавить("СтранаПроисхожденияДоИзменения");
		ТаблицаСФ.Колонки.Добавить("НомерГТДДоИзменения");
		ТаблицаСФ.Колонки.Добавить("КоличествоДоИзменения");
		ТаблицаСФ.Колонки.Добавить("УпаковкаДоИзменения");
		ТаблицаСФ.Колонки.Добавить("ЕдиницаИзмеренияДоИзменения");
		ТаблицаСФ.Колонки.Добавить("КодЕдиницыИзмеренияДоИзменения");
		ТаблицаСФ.Колонки.Добавить("ЦенаДоИзменения");
		ТаблицаСФ.Колонки.Добавить("СтавкаНДСДоИзменения");
		ТаблицаСФ.Колонки.Добавить("СуммаНДСДоИзменения");
		ТаблицаСФ.Колонки.Добавить("СуммаДоИзменения");
	КонецЕсли;	
	
	Возврат ТаблицаСФ;
	
КонецФункции

Функция ИнициализацияТаблицыТоваров()
	
	ТаблицаТоваров = Новый ТаблицаЗначений();
	
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("НоменклатураСсылка");
	ТаблицаТоваров.Колонки.Добавить("КодНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Упаковка");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("КодЕдиницыИзмерения");
	ТаблицаТоваров.Колонки.Добавить("ВидУпаковки");
	ТаблицаТоваров.Колонки.Добавить("КоличествоВОдномМесте");
	ТаблицаТоваров.Колонки.Добавить("КоличествоМест");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("СуммаВключаетНДС");
	ТаблицаТоваров.Колонки.Добавить("ЭтоУслуга", Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("Масса", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ДопИнфо");
	ТаблицаТоваров.Колонки.Добавить("Характеристика");
	ТаблицаТоваров.Колонки.Добавить("Серия");
	ТаблицаТоваров.Колонки.Добавить("СтранаПроисхождения");
	ТаблицаТоваров.Колонки.Добавить("НомерГТД");
	ТаблицаТоваров.Колонки.Добавить("ПризнакТРУ");
	ТаблицаТоваров.Колонки.Добавить("ДокументОтгрузки");
	
	ДобавитьКолонкиПрослеживаемости(ТаблицаТоваров);
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ДобавитьКолонкиПрослеживаемости(Таблица)
	
	Таблица.Колонки.Добавить("ДанныеПрослеживаемости");
	Таблица.Колонки.Добавить("ПрослеживаемыйТовар");
	Таблица.Колонки.Добавить("ИдентификаторСтроки");
	
КонецПроцедуры

Функция ТЧПолучитьДанныеЗапроса(ДокументСсылка, СчетФактура, ЭтоКСФ, ЭтоУКД_Дис = Ложь)
	
	СтандартнаяОбработка = Истина;
	
	Если СчетФактура = Неопределено И Не ЭтоУКД_Дис Тогда
		ТабличнаяЧасть = ИнициализацияТаблицыТоваров();
	Иначе
		ТабличнаяЧасть = ИнициализацияТаблицыСФ(ЭтоКСФ);
	КонецЕсли;
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ДокументСсылка", ДокументСсылка);
	ПараметрыСобытия.Вставить("СчетФактура"	  , СчетФактура);
	ПараметрыСобытия.Вставить("ЭтоКСФ"		  , ЭтоКСФ);
	ПараметрыСобытия.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	
	ОбработкаСобытияПодключаемогоМодуля("ДанныеДляКонтента_ТабличнаяЧасть", ПараметрыСобытия, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат ПараметрыСобытия.ТабличнаяЧасть;
	Иначе
		
		РезультатЗапроса = Модуль_Интеграция.ПолучитьРезультатЗапросаТЧ(ДокументСсылка, СчетФактура, ЭтоКСФ);
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			РезультатЗапроса = Неопределено;
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаДанных = ТабличнаяЧасть.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка);
				
				СтрокаДанных.КодЕдиницыИзмерения	= СокрЛП(СтрокаДанных.КодЕдиницыИзмерения);
				СтрокаДанных.КодНоменклатуры		= СокрЛП(СтрокаДанных.КодНоменклатуры);
				СтрокаДанных.ДопИнфо 				= Новый Массив;
				
				Если ЭтоКСФ Тогда
					СтрокаДанных.КодЕдиницыИзмеренияДоИзменения = СокрЛП(Выборка.КодЕдиницыИзмеренияДоИзменения);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаДанных.ПризнакТРУ) Тогда
					
					Если СтрокаДанных.ЭтоУслуга Тогда 
						СтрокаДанных.ПризнакТРУ = "Service";
					Иначе
						// Все, что не является услугой, по умолчанию считаем имуществом.
						// Если надо что-то другое, можно переопределить в подключаемом модуле.
						СтрокаДанных.ПризнакТРУ = "Property";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИспользуетсяУчетПрослеживаемыхТоваров(ДокументСсылка.Дата) Тогда
			Модуль_Интеграция.ЗаполнитьСведенияПрослеживаемостиДляОтправки(ТабличнаяЧасть, ДокументСсылка);
		КонецЕсли; 
		
		Возврат ТабличнаяЧасть;
		
	КонецЕсли;
	
КонецФункции

Функция ДанныеДляФормированияТорг12(ДокССылка, ЭтоАкт, ЭтоУПД) Экспорт
	
	ДанныеДляФормированияТорг12 = Новый Структура;
	
	ДокТоварный = ?(ПроверитьТипДокумента(Докссылка, "РеализацияОтгруженныхТоваров"), ДокССылка.ДокументОтгрузки, ДокССылка);
	
	СуммаВключаетНДС 		= ?(ДокТоварный.Метаданные().Реквизиты.Найти("СуммаВключаетНДС") = Неопределено, Истина, ДокТоварный.СуммаВключаетНДС);
	СуммаДокумента 			= Модуль_Интеграция.ПолучитьСуммуДокумента(ДокТоварный);
	СуммаНДСДокумента		= Модуль_Интеграция.ПолучитьСуммуНДС(ДокТоварный);
	СуммаБезНДСДокумента	= СуммаДокумента - СуммаНДСДокумента;
	
	ДанныеШапки = Модуль_Интеграция.ПолучитьСтруктуруШапки(ДокТоварный);
	ДанныеШапки.Вставить("Подразделение"	, Модуль_Интеграция.ПолучитьПодразделениеИзДокумента(ДокТоварный));
	ДанныеШапки.Вставить("Номер"			, Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ДокТоварный));
	ДанныеШапки.Вставить("Дата"				, ДокТоварный.Дата);
	ДанныеШапки.Вставить("СуммаВключаетНДС"	, СуммаВключаетНДС);
	ДанныеШапки.Вставить("НДСИсчисляетсяНалоговымАгентом",	НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокТоварный));
	
	ДанныеШапки.Вставить("СуммаДокумента"		, СуммаДокумента);
	ДанныеШапки.Вставить("СуммаНДСДокумента"	, СуммаНДСДокумента);
	ДанныеШапки.Вставить("СуммаБезНДСДокумента"	, СуммаБезНДСДокумента);
	
	ТаблицаТоваров = ПолучитьДанныеТабличнойЧастиДляДокументаРеализации(ДокТоварный, ДанныеШапки, ЭтоУПД);
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		
		Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
			СтрокаТЧ.СтавкаНДС = СтавкаНДС_ИсчНалАг();
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеДляФормированияТорг12.Вставить("БанковскийСчетОрганизации", Модуль_Интеграция.ПолучитьБанковскийСчетПоДокументу(ДокТоварный));
	ДанныеДляФормированияТорг12.Вставить("СтруктураДоговора"		, Модуль_Интеграция.ПолучитьСтруктуруОснования(ДокССылка, ЭтоАкт, ЭтоУПД));
	ДанныеДляФормированияТорг12.Вставить("ТаблицаТоваров"			, ТаблицаТоваров);
	ДанныеДляФормированияТорг12.Вставить("ДанныеШапки"				, ДанныеШапки);
	
	Возврат ДанныеДляФормированияТорг12;
	
КонецФункции

// Проверяет, есть ли в договоре данного документа флаг "НДС исчисляется налоговым агентом"
// Возможно, тут еще надо проверять дату: Константы.ДатаНачалаОперацийСТоварамиОблагаемымиНДСУПокупателя
Функция НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка)
	
	Возврат Модуль_Интеграция.НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка);
	
КонецФункции // НДСПоДокументуИсчисляетсяНалоговымАгентом()

Функция ПолучитьДанныеТабличнойЧастиДляДокументаРеализации(ДокументСсылка, ДанныеШапки, ЭтоУПД) Экспорт
	
	МассивСтрокДляУдаления = Новый Массив();
	
	ТабличнаяЧасть = ТЧПолучитьДанныеЗапроса(ДокументСсылка, Неопределено, Ложь);
	
	ЭтоАкт = ДанныеШапки.Свойство("ЭтоАкт");	
	
	ТребуетсяПерезаполнитьСуммыПоУЕвРублях = Модуль_Интеграция.ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокументСсылка, , , ЭтоАкт);
	
	Если ТребуетсяПерезаполнитьСуммыПоУЕвРублях Тогда 
		Модуль_Интеграция.ПерезаполнитьСуммыПоУЕвРублях(ТабличнаяЧасть, ДокументСсылка, ДанныеШапки);
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		СтрокаТЧ.СтавкаНДС 			= Модуль_Интеграция.ПолучитьПредставлениеСтавкиНДС(СтрокаТЧ.СтавкаНДС, ЭтоУПД);
		СтрокаТЧ.КодНоменклатуры 	= Модуль_Интеграция.ПолучитьКодНоменклатурыДляТорг12(СтрокаТЧ.КодНоменклатуры, СтрокаТЧ.НоменклатураСсылка);
		СтрокаТЧ.Номенклатура		= СтрокаТЧ.Номенклатура + Модуль_Интеграция.ПолучитьПредставлениеХарактеристикиИСерии(СтрокаТЧ);
		
		ОчиститьСсылкиСтраныИГТДВСтрокеТабЧасти(СтрокаТЧ);
		
		Если СтрокаТЧ.Сумма = 0 И СтрокаТЧ.Количество = 0 Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокДляУдаления.Количество() = ТабличнаяЧасть.Количество() Тогда 
		МассивСтрокДляУдаления = Новый Массив;
	КонецЕсли;
	
	Для каждого СтрокаНаУдаление Из МассивСтрокДляУдаления Цикл
		ТабличнаяЧасть.Удалить(СтрокаНаУдаление);
	КонецЦикла;
	
	Возврат ТабличнаяЧасть;
	
КонецФункции

//} ФОРМИРОВАНИЕ XML Торг-12

//{ ФОРМИРОВАНИЕ СФ

Функция ВСтрокеКСФНетИзменений(СтрокаТЧ)
	
	Если СтрокаТЧ.ЕдиницаИзмеренияДоИзменения = СтрокаТЧ.ЕдиницаИзмерения
		И СтрокаТЧ.КоличествоДоИзменения = СтрокаТЧ.Количество
		И СтрокаТЧ.ЦенаДоИзменения = СтрокаТЧ.Цена
		И СтрокаТЧ.СуммаДоИзменения = СтрокаТЧ.Сумма
		И СтрокаТЧ.СуммаНДСДоИзменения = СтрокаТЧ.СуммаНДС
		И СтрокаТЧ.СтавкаНДСДоИзменения = СтрокаТЧ.СтавкаНДС
		И СтрокаТЧ.СуммаДоИзменения = СтрокаТЧ.Сумма
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеТабличнойЧастиДляСФ(ДокументРеализации, СчетФактура, ЭтоКСФ = Ложь, ТребуетсяПерезаполнитьСуммыПоУЕвРублях, ЭтоУКД_Дис = Ложь, ДанныеШапки = Неопределено) 
	
	МассивСтрокДляУдаления =	Новый Массив();
	
	ТабличнаяЧасть = ТЧПолучитьДанныеЗапроса(ДокументРеализации, СчетФактура, ЭтоКСФ, ЭтоУКД_Дис);
	
	Если ТребуетсяПерезаполнитьСуммыПоУЕвРублях Тогда 
		Модуль_Интеграция.ПерезаполнитьСуммыПоУЕвРублях(ТабличнаяЧасть, ДокументРеализации, ДанныеШапки);
	КонецЕсли;	
	
	ЕстьЕдиницаИзмеренияДоИзменения = ТабличнаяЧасть.Колонки.Найти("ЕдиницаИзмеренияДоИзменения") <> Неопределено;
	
	Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если ЭтоКСФ = Истина И ВСтрокеКСФНетИзменений(СтрокаТЧ) Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаТЧ);
		ИначеЕсли ЭтоКСФ = Ложь И СтрокаТЧ.Сумма = 0 И СтрокаТЧ.Количество = 0 Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаТЧ);
		КонецЕсли;
		
		СтрокаТЧ.СтавкаНДС = Модуль_Интеграция.ПолучитьПредставлениеСтавкиНДС(СтрокаТЧ.СтавкаНДС, Истина);
		Если ЭтоКСФ = Истина Тогда
			СтрокаТЧ.СтавкаНДСДоИзменения = Модуль_Интеграция.ПолучитьПредставлениеСтавкиНДС(СтрокаТЧ.СтавкаНДСДоИзменения, Истина);
		КонецЕсли;
		
		СтрокаТЧ.Номенклатура = СтрокаТЧ.Номенклатура + Модуль_Интеграция.ПолучитьПредставлениеХарактеристикиИСерии(СтрокаТЧ);
		
		Если ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияАльфаАвто41" Тогда
			
			ЭтоАвторабота = Модуль_Интеграция.ЭтоАвторабота(СтрокаТЧ.НоменклатураСсылка);
			
			Если ЭтоАвторабота Тогда
				СтрокаТЧ.ЕдиницаИзмерения = СчетФактура.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
				СтрокаТЧ.КодЕдиницыИзмерения = "356";
				
				Если ЕстьЕдиницаИзмеренияДоИзменения Тогда
					СтрокаТЧ.ЕдиницаИзмеренияДоИзменения = СчетФактура.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
					СтрокаТЧ.КодЕдиницыИзмеренияДоИзменения = "356";
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если (ЭтоКСФ = Ложь) И (МассивСтрокДляУдаления.Количество() = ТабличнаяЧасть.Количество()) Тогда 
		// Если в ИСФ нет ненулевых строк - Тогда выводим все строки с 0-м
		МассивСтрокДляУдаления =	Новый Массив();
	КонецЕсли;
	
	Для каждого СтрокаНаУдаление Из МассивСтрокДляУдаления Цикл
		ТабличнаяЧасть.Удалить(СтрокаНаУдаление);
	КонецЦикла;
	
	Возврат ТабличнаяЧасть;
	
КонецФункции

Функция СтранаЧленТС(Знач КодСтраны)
	
	СтраныТС = Новый Массив;
	СтраныТС.Добавить("643"); // Россия
	СтраныТС.Добавить("051"); // Армения
	СтраныТС.Добавить("112"); // Беларусь
	СтраныТС.Добавить("398"); // Казахстан
	СтраныТС.Добавить("417"); // Киргизия
	СтраныТС.Добавить("981"); // ЕАЭС
	
	КодСтраны = СокрЛП(КодСтраны);
	
	Результат = СтраныТС.Найти(КодСтраны) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция СтранаРФ(Знач КодСтраны)
	
	КодСтраны = СокрЛП(КодСтраны);
	
	Результат = КодСтраны = "643";
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуСФ(СчетФактура, МассивДокументовОснований, ЭтоКСФ, ЭтоУКД_Дис = Ложь, ДанныеШапки = Неопределено)
	
	ТабличнаяЧасть = ИнициализацияТаблицыСФ(ЭтоКСФ);
	
	Для каждого ДокументОснование Из МассивДокументовОснований Цикл
		
		ДокТоварный = ?(ПроверитьТипДокумента(ДокументОснование, "РеализацияОтгруженныхТоваров"), ДокументОснование.ДокументОтгрузки, ДокументОснование);
		ТребуетсяПерезаполнитьСуммыПоУЕвРублях = Модуль_Интеграция.ТребуетсяПерезаполнитьСуммыПоУЕвРублях(ДокТоварный, СчетФактура, Истина);
		ДанныеТЧ = ПолучитьДанныеТабличнойЧастиДляСФ(ДокТоварный, СчетФактура, ЭтоКСФ, ТребуетсяПерезаполнитьСуммыПоУЕвРублях, ЭтоУКД_Дис, ДанныеШапки);
		
		Для каждого СтрокаДанных Из ДанныеТЧ Цикл
			
			СтрокаСФ = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСФ, СтрокаДанных);
			СтрокаСФ.КодНоменклатуры = Модуль_Интеграция.ПолучитьКодНоменклатурыДляТорг12(СтрокаСФ.КодНоменклатуры, СтрокаСФ.НоменклатураСсылка);
			
			Если ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияАльфаАвто41" Тогда
				
				Модуль_ИнтеграцияАльфаАвто = ПолучитьМодульПрог("Модуль_ИнтеграцияАльфаАвто41");
				
				СтрокаСФ.НоменклатураСсылка = Модуль_ИнтеграцияАльфаАвто.ВернутьСсылкуНаНоменклатуру(СтрокаДанных.НоменклатураСсылка);
				
				ЭтоУслуга = Модуль_ИнтеграцияАльфаАвто.ЭтоУслуга(СтрокаСФ.НоменклатураСсылка);
				ЭтоАвторабота = Модуль_ИнтеграцияАльфаАвто.ЭтоАвторабота(СтрокаДанных.НоменклатураСсылка);
				
				СтрокаСФ.ЭтоУслуга = ЭтоУслуга;
				
				Если ЭтоУслуга
					И НЕ ЭтоАвторабота
					И ЗначениеЗаполнено(СтрокаСФ.ЕдиницаИзмерения)
					И СтрокаСФ.ЕдиницаИзмерения.Наименование = "-" Тогда
					
					СтрокаСФ.ЕдиницаИзмерения 		= Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
					СтрокаСФ.КодЕдиницыИзмерения 	= "";
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОчиститьСсылкиСтраныИГТДВСтрокеТабЧасти(СтрокаСФ);
			
		КонецЦикла;
		
	КонецЦикла;
	
	КолонкиСуммирования = Новый Массив;
	КолонкиСуммирования.Добавить("Количество");
	КолонкиСуммирования.Добавить("Масса");
	КолонкиСуммирования.Добавить("СуммаНДС");
	КолонкиСуммирования.Добавить("Сумма");
	КолонкиСуммирования.Добавить("ДопИнфо");
	
	Если ЭтоКСФ Тогда
		КолонкиСуммирования.Добавить("КоличествоДоИзменения");
		КолонкиСуммирования.Добавить("СуммаНДСДоИзменения");
		КолонкиСуммирования.Добавить("СуммаДоИзменения");
	КонецЕсли;
	
	СписокКолонокДляСвертки = "";
	РазделительСписка 		= "";
	Для Каждого ТекКолонка Из ТабличнаяЧасть.Колонки Цикл
		
		КолонкаИсключение = "ИдентификаторСтроки";
		
		Если КолонкиСуммирования.Найти(ТекКолонка.Имя) = Неопределено
			И НРег(ТекКолонка.Имя) <> НРег(КолонкаИсключение) Тогда
			
			СписокКолонокДляСвертки = СписокКолонокДляСвертки + РазделительСписка + ТекКолонка.Имя; 
			РазделительСписка = ",";
		КонецЕсли;
		
	КонецЦикла;
	ТабличнаяЧасть.Свернуть(СписокКолонокДляСвертки, "Количество,Масса,СуммаНДС,Сумма" + ?(ЭтоКСФ, ",КоличествоДоИзменения,СуммаНДСДоИзменения,СуммаДоИзменения", ""));
	
	ТабличнаяЧасть.Колонки.Добавить("ДопИнфо");
	Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		СтрокаТЧ.ДопИнфо = Новый Массив;
	КонецЦикла;
	
	Возврат ТабличнаяЧасть;
	
КонецФункции

Функция ДанныеДляФормированияСчетФактуры(СчетФактура, ЭтоКСФ) Экспорт
	
	МассивДокументовОснований =	Модуль_Интеграция.ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СчетФактура);
	Если МассивДокументовОснований.Количество() = 0 Тогда
		ВызватьИсключение "Для " + СчетФактура + " не найдены документы основания";
	КонецЕсли;
	
	ДокументОснование	= МассивДокументовОснований[0];
	ДокТоварный 		= ?(ПроверитьТипДокумента(ДокументОснование, "РеализацияОтгруженныхТоваров"), ДокументОснование.ДокументОтгрузки, ДокументОснование);
	ДанныеСФ 			= Модуль_Интеграция.ПолучитьСтруктуруШапки(ДокТоварный, СчетФактура);
	
	Если ЭтоКСФ = Истина Тогда 
		ДанныеСФ.Вставить("НомераДляКСФ", Модуль_Интеграция.ПолучитьНомераДляКСФ(СчетФактура));
	Иначе 	
		ДанныеСФ.Вставить("НомераДляСФ", Модуль_Интеграция.ПолучитьНомераДляСФ(СчетФактура));
	КонецЕсли;	
	ДанныеСФ.Вставить("СФНаАванс", Модуль_Интеграция.ЭтоСчетФактуранаАванс(СчетФактура));
	ДанныеСФ.Вставить("ДатаНомерСвидетельстваОРегистрации", Модуль_Интеграция.ПолучитьДатуНомерСвидетельстваОГосРегистрацииИП(СчетФактура.Организация));
	ДанныеСФ.Вставить("КПППокупателя", Модуль_Интеграция.ПолучитьКПППокупателя(СчетФактура)); 
	ДанныеСФ.Вставить("ДатаНомерДокументовОплаты", Модуль_Интеграция.ПолучитьДатуНомерДокументовОплаты(СчетФактура));
	ДанныеСФ.Вставить("НДСИсчисляетсяНалоговымАгентом",	НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокТоварный));
	
	ДанныеСФ.Вставить("СуммаДокумента"		, Неопределено);
	ДанныеСФ.Вставить("СуммаНДСДокумента"	, Неопределено);
	ДанныеСФ.Вставить("СуммаБезНДСДокумента", Неопределено);
	
	ДанныеСФ.Вставить("ТабличнаяЧасть", ПолучитьТаблицуСФ(СчетФактура, МассивДокументовОснований, ЭтоКСФ, Ложь, ДанныеСФ));
	
	Если ДанныеСФ.НДСИсчисляетсяНалоговымАгентом Тогда
		
		ЕстьРеквизитСтавкаНДСДоИзменения = (НЕ ДанныеСФ.ТабличнаяЧасть.Колонки.Найти("СтавкаНДСДоИзменения") = Неопределено);
		
		Для Каждого СтрокаТЧ Из ДанныеСФ.ТабличнаяЧасть Цикл
			СтрокаТЧ.СтавкаНДС = СтавкаНДС_ИсчНалАг();
			Если ЕстьРеквизитСтавкаНДСДоИзменения Тогда
				СтрокаТЧ.СтавкаНДСДоИзменения = СтавкаНДС_ИсчНалАг();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеСФ.ТабличнаяЧасть.НайтиСтроки(Новый Структура("ЭтоУслуга", Ложь)).Количество() = 0 Тогда 
		ДанныеСФ.Грузоотправитель	= "";
		ДанныеСФ.Грузополучатель	= "";
	Иначе
		Если ИмяМодуляИнтеграции = "Модуль_ИнтеграцияАльфаАвто41" Тогда
			Если ЗначениеЗаполнено(СчетФактура.Грузополучатель) Тогда
				ДанныеСФ.Грузополучатель = СчетФактура.Грузополучатель;
			КонецЕсли;
			Если ДанныеСФ.Организация = ДанныеСФ.Грузоотправитель Тогда
				ДанныеСФ.Грузоотправитель = "он же";	
			КонецЕсли;
		Иначе
			Если ДанныеСФ.Свойство("Поставщик") И ДанныеСФ.Поставщик <> ДанныеСФ.Организация Тогда
				ДанныеСФ.Грузоотправитель = ДанныеСФ.Организация;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеСФ;
	
КонецФункции 	

//} ФОРМИРОВАНИЕ СФ

//{ ВНЕШНЯЯ ПЕЧАТНАЯ ФОРМА

Функция СформироватьВнешнююПечатнуюФормуДокументаПакета(ДокументПакета, Организация, ПараметрыСогласования = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	DocumentType	 = ДокументПакета.DocumentType;
	ВидДокумента	 = ДокументПакета.ТипДокумента;
	ДокументСсылка	 = ДокументПакета.Документ;
	
	Если ЗначениеЗаполнено(ДокументПакета.ВнешняяПечатнаяФорма) Тогда
		
		ВнешняяПечатнаяФорма = ДокументПакета.ВнешняяПечатнаяФорма;
		
	Иначе
		
		НастройкиВПФ = Модуль_Данные1С_СвязиОбъектов().ПолучитьНастройкиВнешнихПечатныхФормДляДиадок(Организация);
		
		Если DocumentType = "XmlAcceptanceCertificate" Тогда
			
			ВнешняяПечатнаяФорма = НастройкиВПФ.ДиадокВнешняяПечатнаяФормаАкта;
			
		ИначеЕсли DocumentType = "NonformalizedProforma" Тогда
			
			ВнешняяПечатнаяФорма = НастройкиВПФ.ДиадокВнешняяПечатнаяФормаСчета;
			
		ИначеЕсли DocumentType = "ReconciliationAct" Тогда
			
			ВнешняяПечатнаяФорма = НастройкиВПФ.ДиадокВнешняяПечатнаяФормаСверки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнешняяПечатнаяФорма) Тогда
		
		Результат = СформироватьВнешнююПечатнуюФорму(ДокументСсылка, ВнешняяПечатнаяФорма, ВидДокумента);
		
	Иначе
		
		Если DocumentType = "NonformalizedProforma" Тогда
			
			Результат = СформироватьПечатнуюФормуСчетаНаОплату(ДокументСсылка, ПараметрыСогласования);
			
		ИначеЕсли DocumentType = "ReconciliationAct" Тогда
			
			Результат = СформироватьПечатнуюФормуАктаСверки(ДокументСсылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат)
		И DocumentType = "XmlAcceptanceCertificate" Тогда
		Результат.Вставить("DocumentType", "AcceptanceCertificate"); // Полуформализованный Акт
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыОтправкиВПФ(ИдентификаторВПФ, ДокументСсылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Выгружать"					, Истина);
	Результат.Вставить("ВыгружатьEXEL"				, Ложь);
	Результат.Вставить("ТребоватьОтветнойПодписи"	, Истина);
	
	ПараметрыОтправки = Модуль_Интеграция.ВПФ_РезультатФункции(ИдентификаторВПФ, "ПолучитьПараметрыОтправкиЧерезДиадок", ДокументСсылка);
	
	Если ЗначениеЗаполнено(ПараметрыОтправки) Тогда
		ДополнитьСтруктуруСоответствие(Результат, ПараметрыОтправки);
	КонецЕсли;
	
	Если Не Результат.Свойство("ФорматФайла") Тогда
		Результат.Вставить("ФорматФайла", ?(Результат.ВыгружатьEXEL, "xlsx","pdf"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(ДокументСсылка, ИдентификаторВПФ, ВидДокумента) Экспорт
	
	ПечатнаяФорма = Модуль_Интеграция.ВПФ_Печать(ДокументСсылка, ИдентификаторВПФ);
	ПараметрыОтправки = ПараметрыОтправкиВПФ(ИдентификаторВПФ, ДокументСсылка);
	
	Дата	 = ДокументСсылка.Дата;
	Номер	 = Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ДокументСсылка);
	Сумма	 = Модуль_Интеграция.ПолучитьСуммуДокумента(ДокументСсылка);
	ДокументБезНДС = Модуль_Интеграция.ДокументБезНДС(ДокументСсылка);
	
	ФорматФайла = ПараметрыОтправки.ФорматФайла;
	ИмяФайла = ИмяФайлаПечатнойФормы(ВидДокумента, Номер, Дата, ФорматФайла);
	
	Результат = НовыеДанныеВнешнейПечатнойФормы();
	Результат.Таблица	 = ПечатнаяФорма;
	Результат.Дата		 = Дата;
	Результат.Номер		 = Номер;
	Результат.Сумма		 = Сумма;
	Результат.ДокументБезНДС = ДокументБезНДС;
	
	Результат.ИмяФайла = ИмяФайла;
	Результат.ФорматФайла = ФорматФайла;
	Результат.ТребоватьОтветнойПодписи = ПараметрыОтправки.ТребоватьОтветнойПодписи;
	
	Если Не ДокументБезНДС Тогда
		Результат.СуммаНДС = Модуль_Интеграция.ПолучитьСуммуНДС(ДокументСсылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру результата формирования внешних печатных форм
//
// Возвращаемое значение:
//  Структура - содержит поля:
//    * Дата           - Дата   - дата документа;
//    * Номер          - Строка - номер документа;
//    * Сумма          - Число  - общая сумма документа;
//    * СуммаНДС       - Число  - общая сумма НДС документа;
//    * ДокументБезНДС - Булево - Истина, если документ не содержит НДС;
//    * ФорматФайла    - Строка - формат в котором файл должен быть отправлен, pdf или xlsx;
//    * ИмяФайла       - Строка - имя файла с расширением;
//    * Таблица        - ТабличныйДокумент - печатная форма документа
//    * ТребоватьОтветнойПодписи - Булево  - Истина, если файл должен быть подписан получаталем;
//
Функция НовыеДанныеВнешнейПечатнойФормы()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Таблица");
	
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	
	Результат.Вставить("Сумма");
	Результат.Вставить("СуммаНДС");
	Результат.Вставить("ДокументБезНДС", Ложь);
	
	Результат.Вставить("ИмяФайла");
	Результат.Вставить("ФорматФайла");
	
	Результат.Вставить("ТребоватьОтветнойПодписи", Ложь);
	Результат.Вставить("СписокОшибок", "");
	
	Возврат Результат;
	
КонецФункции

//{ СЧЕТ НА ОПЛАТУ

// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату
//	Параметры:
//		ДокументСчетаНаОплатуСсылка	- ДокументСсылка	- Ссылка на документ, по которому формируется печатная форма
//		ДополнительныеПараметры	- Структура	- дополнительные параметры.
//			* ПараметрыСогласования - Структура - параметры согласования
//			* ФИОПодписанта - Строка
//
//	Возвращаемое значение:
//		Структура - см. НовыеДанныеВнешнейПечатнойФормы()
//	
Функция СформироватьПечатнуюФормуСчетаНаОплату(СсылкаНаДокумент, ДополнительныеПараметры) Экспорт
	
	СтруктураДокумента	 = ДанныеДляФормированияСчетаНаОплату(СсылкаНаДокумент);
	ПечатнаяФорма		 = СформироватьПечатнуюФормуСчетаНаОплатуПоДанным(СтруктураДокумента, ДополнительныеПараметры);
	ДанныеШапки			 = СтруктураДокумента.ДанныеШапки;
	
	ВидДокумента = "Счет";
	ФорматФайла = "pdf";
	ИмяФайла = ИмяФайлаПечатнойФормы(ВидДокумента, ДанныеШапки.Номер, ДанныеШапки.Дата, ФорматФайла);
	
	Результат = НовыеДанныеВнешнейПечатнойФормы();
	Результат.Таблица		 = ПечатнаяФорма;
	Результат.Дата			 = ДанныеШапки.Дата;
	Результат.Номер			 = ДанныеШапки.Номер;
	Результат.Сумма			 = ДанныеШапки.Сумма;
	Результат.ДокументБезНДС = ДанныеШапки.ДокументБезНДС;
	
	Результат.ИмяФайла		 = ИмяФайла;
	Результат.ФорматФайла	 = ФорматФайла;
	Результат.ТребоватьОтветнойПодписи = Ложь;
	
	Если Не Результат.ДокументБезНДС Тогда
		Результат.СуммаНДС = ДанныеШапки.СуммаНДС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляФормированияСчетаНаОплату(СсылкаНаДокумент)
	
	Номер = Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(СсылкаНаДокумент);
	МетаданныеДокумента = СсылкаНаДокумент.Метаданные();
	
	Если ЕстьРеквизитМетаданных(МетаданныеДокумента, "ДокументОтгрузки") Тогда
		
		ДокументОтгрузки = СсылкаНаДокумент.ДокументОтгрузки;
		ДанныеШапки		 = Модуль_Интеграция.ПолучитьСтруктуруШапки(ДокументОтгрузки);
		ТаблицаТоваров	 = ПолучитьДанныеТабличнойЧастиДляСчетаНаОплату(ДокументОтгрузки, ДанныеШапки);
		БанковскийСчетОрганизации		 = Модуль_Интеграция.ПолучитьБанковскийСчетПоДокументу(ДокументОтгрузки);
		НДСИсчисляетсяНалоговымАгентом	 = НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументОтгрузки);
		
	Иначе
		
		ДанныеШапки		 = Модуль_Интеграция.ПолучитьСтруктуруШапки(СсылкаНаДокумент);
		ТаблицаТоваров	 = ПолучитьДанныеТабличнойЧастиДляСчетаНаОплату(СсылкаНаДокумент, ДанныеШапки);
		БанковскийСчетОрганизации		 = Модуль_Интеграция.ПолучитьБанковскийСчетПоДокументу(СсылкаНаДокумент);
		НДСИсчисляетсяНалоговымАгентом	 = НДСПоДокументуИсчисляетсяНалоговымАгентом(СсылкаНаДокумент);
		
	КонецЕсли;
	
	Сумма	 = 0;
	СуммаНДС = 0;
	ДокументБезНДС = Истина;
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		Сумма	 = Сумма 	+ СтрокаТЧ.Сумма;
		СуммаНДС = СуммаНДС + СтрокаТЧ.СуммаНДС;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС)
			И НРег(СтрокаТЧ.СтавкаНДС) <> НРег("без НДС")
			И СтрокаТЧ.СтавкаНДС <> "0" Тогда
			ДокументБезНДС = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ДанныеШапки.СуммаВключаетНДС Тогда
		Сумма = Сумма + СуммаНДС;
	КонецЕсли;
	
	ДанныеШапки.Вставить("Номер"							, Номер);
	ДанныеШапки.Вставить("Сумма"							, Сумма);
	ДанныеШапки.Вставить("СуммаНДС"							, СуммаНДС);
	ДанныеШапки.Вставить("ДокументБезНДС"					, ДокументБезНДС);
	ДанныеШапки.Вставить("БанковскийСчетОрганизации"		, БанковскийСчетОрганизации);
	ДанныеШапки.Вставить("НДСИсчисляетсяНалоговымАгентом"	, НДСИсчисляетсяНалоговымАгентом);
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеШапки"	, ДанныеШапки);
	Результат.Вставить("ТаблицаТоваров"	, ТаблицаТоваров);
	
	Возврат Результат;
	
КонецФункции

// Формирует ПФ счета на оплату по переданным данным документа
//	Параметры:
//		СтруктураДокумента	- Структура	- см. ДанныеДляФормированияСчетаНаОплату()
//		ДополнительныеПараметры	- Структура	- дополнительные параметры.
//			* ПараметрыСогласования - Структура - параметры согласования
//			* ФИОПодписанта - Строка
//
//	Возвращаемое значение:
//		ТабличныйДокумент
//		
Функция СформироватьПечатнуюФормуСчетаНаОплатуПоДанным(СтруктураДокумента, ДополнительныеПараметры)
	
	ДанныеШапки					 = СтруктураДокумента.ДанныеШапки;
	ТаблицаТоваров				 = СтруктураДокумента.ТаблицаТоваров;
	БанковскийСчетОрганизации	 = ДанныеШапки.БанковскийСчетОрганизации;
	
	Таб= Новый ТабличныйДокумент;
	
	Таб.ОриентацияСтраницы= ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб= 		Истина;
	
	Макет= ПолучитьМакет("СчетНаОплату");
	
	Область= Макет.ПолучитьОбласть("ШапкаСчета1");
	Если ЗначениеЗаполнено(БанковскийСчетОрганизации) Тогда
		
		Если ДанныеШапки.Свойство("ОрганизацияПолучатель") Тогда
			ОрганизацияПолучатель= ДанныеШапки.ОрганизацияПолучатель;
		Иначе
			ОрганизацияПолучатель= ДанныеШапки.Организация;
		КонецЕсли;
		
		РеквизитыПолучателя= Модуль_Интеграция.ПолучитьРеквизитыОрганизацииДляСчетаНаОплату(ОрганизацияПолучатель, ДанныеШапки.Дата);
		РеквизитыБанковскогоСчета= Модуль_Интеграция.ПолучитьСтруктуруБанковскогоСчета(ОрганизацияПолучатель, БанковскийсчетОрганизации);
		
		Область.Параметры.БанкПолучателя= 	   РеквизитыБанковскогоСчета.Банк;
		Область.Параметры.БИКБанкаПолучателя=  РеквизитыБанковскогоСчета.БИК;
		Область.Параметры.СчетБанкаПолучателя= РеквизитыБанковскогоСчета.КоррСчет;
		Область.Параметры.СчетПолучателя= 	   РеквизитыБанковскогоСчета.НомерСчета;
		Область.Параметры.Получатель= 		   РеквизитыБанковскогоСчета.ТекстПолучателя;
		Область.Параметры.ИННПолучателя= 	   РеквизитыПолучателя.ИНН;
		Область.Параметры.КПППолучателя= 	   РеквизитыПолучателя.КПП;
		
	КонецЕсли;
	Таб.Вывести(Область);
	
	Область=  Макет.ПолучитьОбласть("ШапкаСчета2");
	Область.Параметры.Заголовок = "Счет на оплату № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДФ=dd.MM.yyyy");
	Таб.Вывести(Область);
	
	Область=  Макет.ПолучитьОбласть("ШапкаСчета3");
	Область.Параметры.Поставщик = Модуль_Интеграция.ПолучитьОписаниеОрганизацииДляСчетаНаОплату(ДанныеШапки.Организация, ДанныеШапки.Дата);
	Таб.Вывести(Область);
	
	Область=  Макет.ПолучитьОбласть("ШапкаСчета4");
	Область.Параметры.Покупатель =  Модуль_Интеграция.ПолучитьОписаниеОрганизацииДляСчетаНаОплату(ДанныеШапки.Контрагент, ДанныеШапки.Дата);
	Таб.Вывести(Область);
	
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	
	СуммаВсего = 	0;
	СуммаВсегоНДС = 	0;
	Ц = 0;
	
	Для Каждого Стр Из ТаблицаТоваров Цикл
		Ц = Ц + 1;
		СтрокаТаблицы.Параметры.НомерСтроки = 		Ц;
		СтрокаТаблицы.Параметры.Товар = 				Стр.Номенклатура;
		СтрокаТаблицы.Параметры.Количество = 		Стр.Количество;
		СтрокаТаблицы.Параметры.ЕдиницаИзмерения = 	Стр.ЕдиницаИзмерения;
		СтрокаТаблицы.Параметры.Цена = 				Стр.Цена;
		СтрокаТаблицы.Параметры.Сумма = 				Стр.сумма;
		
		СуммаВсего = 	СуммаВсего 		+ Стр.Сумма;
		СуммаВсегоНДС = СуммаВсегоНДС + Стр.СуммаНДС;
		
		Таб.Вывести(СтрокаТаблицы);
	КонецЦикла;
	СуммаВключаетНДС = 	ДанныеШапки.СуммаВключаетНДС;
	СуммаВсегоСНДС = 	СуммаВсего + ?(СуммаВключаетНДС, 0, СуммаВсегоНДС);
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.Всего = СуммаВсего; 
	Таб.Вывести(Область);
	
	Область= Макет.ПолучитьОбласть("ПодвалНДС");
	
	Если ДанныеШапки.НДСИсчисляетсяНалоговымАгентом Тогда
		Область.Параметры.НДС = 		"НДС исчисляется налоговым агентом";
		Область.Параметры.ВсегоНДС = "-";	
	ИначеЕсли СуммаВсегоНДС <> 0 Тогда
		Область.Параметры.НДС = 		?(СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
		Область.Параметры.ВсегоНДС = Формат(СуммаВсегоНДС, "ЧЦ=15; ЧДЦ=2");
	Иначе
		Область.Параметры.НДС = 		"Без налога (НДС)";
		Область.Параметры.ВсегоНДС = "-";
	КонецЕсли;
	
	Таб.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПодвалИтогоКОплате");
	Область.Параметры.ИтогоКОплате = СуммаВсегоСНДС;
	Таб.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПодвалСуммаПрописью");
	Область.Параметры.ИтоговаяСтрока = "Всего наименований " + ТаблицаТоваров.Количество() 
	+ ", на сумму " + Формат(СуммаВсегоСНДС, "ЧЦ=15; ЧДЦ=2") + " " + СокрП(ДанныеШапки.ВалютаДокумента);
	
	Область.Параметры.СуммаПрописью = ЧислоПрописью(СуммаВсегоСНДС, , ДанныеШапки.ВалютаДокумента.ПараметрыПрописиНаРусском);
	Таб.Вывести(Область);
	
	Область= Макет.ПолучитьОбласть("ПодвалСчета");
	ФИОРуководителя= Модуль_Интеграция.ПолучитьФИОРуководителяДляСчета(ДанныеШапки, ДополнительныеПараметры);
	Область.Параметры.ФИОРуководителя= ФИОРуководителя;
	Таб.Вывести(Область);
	
	Возврат Таб;
	
КонецФункции

Функция ПолучитьДанныеТабличнойЧастиДляСчетаНаОплату(ДокументСсылка, ДанныеШапки) Экспорт
	
	Результат = ТЧПолучитьДанныеЗапроса(ДокументСсылка, Неопределено, Ложь);
	
	Для Сч = - (Результат.Количество() - 1) По 0 Цикл
		
		СтрокаТЧ = Результат[-Сч];
		
		Если СтрокаТЧ.Сумма = 0 И СтрокаТЧ.Количество = 0 Тогда
			
			Результат.Удалить(-Сч);
			
		Иначе
			
			СтрокаТЧ.СтавкаНДС		 = Модуль_Интеграция.ПолучитьПредставлениеСтавкиНДС(СтрокаТЧ.СтавкаНДС, Ложь);
			СтрокаТЧ.КодНоменклатуры = Модуль_Интеграция.ПолучитьКодНоменклатурыДляТорг12(СтрокаТЧ.КодНоменклатуры, СтрокаТЧ.НоменклатураСсылка);
			СтрокаТЧ.Номенклатура	 = СтрокаТЧ.Номенклатура + Модуль_Интеграция.ПолучитьПредставлениеХарактеристикиИСерии(СтрокаТЧ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//} СЧЕТ НА ОПЛАТУ

//{ АКТ СВЕРКИ

// Формирует структуру с данными, которые необходимы для визуализации ПФ сверки взаиморасчетов. 
//	Параметры:
//		СсылкаНаДокумент	- ДокументСсылка	- Ссылка на документ, по которому формируется печатная форма
//		ДополнительныеПараметры	- Структура, Неопределено	- дополнительные параметры.
//			* ПараметрыСогласования - Структура - параметры согласования
//			* ФИОПодписанта - Строка
//
//	Возвращаемое значение:
//		Структура - см. НовыеДанныеВнешнейПечатнойФормы()
//
Функция СформироватьПечатнуюФормуАктаСверки(СсылкаНаДокумент, ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураДокумента	 = Модуль_Интеграция.ПолучитьДанныеДляФормированияАктаСверки(СсылкаНаДокумент);
	ПечатнаяФорма		 = СформироватьПечатнуюФормуАктаСверкиПоДанным(СтруктураДокумента);
	
	ТипДокумента = "Акт сверки";
	ФорматФайла	 = "pdf";
	ИмяФайла	 = ИмяФайлаПечатнойФормы(ТипДокумента, СтруктураДокумента.Номер, СтруктураДокумента.Дата, ФорматФайла);
	
	Результат = НовыеДанныеВнешнейПечатнойФормы();
	Результат.Таблица		 = ПечатнаяФорма;
	Результат.Дата			 = СтруктураДокумента.Дата;
	Результат.Номер			 = СтруктураДокумента.Номер;
	Результат.ИмяФайла		 = ИмяФайла;
	Результат.ФорматФайла	 = ФорматФайла;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеПредставителяДляШапки(ПредставительОрганизации, ПредставлениеОрганизации)
	Возврат ?(ЗначениеЗаполнено(ПредставительОрганизации.Должность), ПредставительОрганизации.Должность, "представитель") +
	" " + ПредставлениеОрганизации + " " + ?(ЗначениеЗаполнено(ПредставительОрганизации.ФИО), ПредставительОрганизации.ФИО, "");
КонецФункции	

Функция РазвернутоеПредставлениеСуммы(Сумма, Валюта)
	Возврат  формат(Сумма, "ЧДЦ=2") + " " + Валюта +
	" (" + Модуль_Интеграция.ПолучитьСуммуПрописьюДиадок(Сумма, Валюта) + ")"
КонецФункции

Функция ПредставлениеРезультатовСверки(ДатаОкончанияСверки, ПредставлениеОрганизации, ПредставлениеКонтрагента, ОрганизацияИтогСальдо, валютаДокумента)
	
	результат =  "на " + формат(ДатаОкончанияСверки, "ДФ=dd.MM.yyyy") + " задолженность ";
	Если ОрганизацияИтогСальдо > 0 Тогда 
		результат = результат + "в пользу " + ПредставлениеОрганизации + " " +
		РазвернутоеПредставлениеСуммы(ОрганизацияИтогСальдо, ВалютаДокумента);
	ИначеЕсли ОрганизацияИтогСальдо < 0 Тогда 
		результат = результат + "в пользу " + ПредставлениеКонтрагента + " " +
		РазвернутоеПредставлениеСуммы(-ОрганизацияИтогСальдо, ВалютаДокумента);
	Иначе 
		результат = результат + "отсутствует";
	КонецЕсли;
	
	Возврат  результат;
	
КонецФункции

Функция СформироватьПечатнуюФормуАктаСверкиПоДанным(ДанныеСверки)
	
	Таб = Новый ТабличныйДокумент;
	
	Таб.АвтоМасштаб = Истина;
	
	Макет = ЭтотОбъект.ПолучитьМакет("АктСверкиВзаиморасчетов");
	
	ЗаголовокАкта = макет.ПолучитьОбласть("Заголовок");
	
	ОписаниеПериода = "за период: " + ПредставлениеПериода(НачалоДня(ДанныеСверки.ДатаНачалаСверки), КонецДня(ДанныеСверки.ДатаОкончанияСверки), "ФП = Истина");
	ПредставительОрганизации = ДанныеСверки.ПредставительОрганизации;
	ПредставительКонтрагента = ДанныеСверки.ПредставительКонтрагента;
	ЗаголовокАктаСверки =  "взаимных расчетов " + ОписаниеПериода  + Символы.ПС
	+ "между " + ДанныеСверки.ПредставлениеОрганизации + Символы.ПС + "и " + ДанныеСверки.ПредставлениеКонтрагента;
	Если ЗначениеЗаполнено(ДанныеСверки.ДоговорКонтрагента) Тогда 
		ЗаголовокАктаСверки = ЗаголовокАктаСверки + символы.ПС+
		"по договору "+ДанныеСверки.ДоговорКонтрагента;
	КонецЕсли;   
	
	ЗаголовокТаблицы = "Мы, нижеподписавшиеся, " + ПредставлениеПредставителяДляШапки(ПредставительОрганизации, ДанныеСверки.ПредставлениеОрганизации) + ", с одной стороны, и " +
	ПредставлениеПредставителяДляШапки(ПредставительКонтрагента, ДанныеСверки.ПредставлениеКонтрагента) + ", с другой стороны, составили настоящий акт сверки в том, что состояние " +
	"взаимных расчетов по данным учета следующее:";
	
	ЗаголовокАкта.Параметры.ЗаголовокАктаСверки = ЗаголовокАктаСверки;
	ЗаголовокАкта.Параметры.ЗаголовокТаблицы = ЗаголовокТаблицы;
	
	Таб.Вывести(ЗаголовокАкта);
	
	Шапка = макет.ПолучитьОбласть("Шапка|Секция");
	Шапка.Параметры.Шапка = "По данным " + ДанныеСверки.ПредставлениеОрганизации + ", " + ДанныеСверки.ВалютаДокумента;
	Таб.Вывести(Шапка);
	Шапка.Параметры.Шапка = "По данным " + ДанныеСверки.ПредставлениеКонтрагента + ", " + ДанныеСверки.ВалютаДокумента;
	Таб.Присоединить(Шапка);
	
	// выводим табличную часть
	СтрокаСальдо = Макет.ПолучитьОбласть("Сальдо|Секция");
	СальдоНачальное = ДанныеСверки.СальдоНачальное;
	СтрокаСальдо.Параметры.Дебет  = ?(СальдоНачальное > 0, СальдоНачальное, 0);
	СтрокаСальдо.Параметры.Кредит = ?(СальдоНачальное > 0, 0, -СальдоНачальное);
	Таб.Вывести(СтрокаСальдо);
	
	СтрокаСальдо.Параметры.Дебет  = ?(СальдоНачальное > 0, 0, -СальдоНачальное);
	СтрокаСальдо.Параметры.Кредит = ?(СальдоНачальное > 0, СальдоНачальное, 0);
	Таб.Присоединить(СтрокаСальдо);
	
	МассивДанныхПоДоговорам = ДанныеСверки.МассивДанныхПоДоговорам;
	СтрокаТаблицы = макет.ПолучитьОбласть("Строка|Секция");
	СтрокаНачалоДоговора = макет.получитьОбласть("ДоговорНачалоСекции|Секция");
	СтрокаКонецДоговора  = макет.получитьОбласть("ДоговорКонецСекции|Секция");
	ПустойШаблон = Новый Структура("Дата, представлениеДокумента, Дебет, Кредит");
	
	ОрганизацияИтогДт = 0;
	ОрганизацияИтогКт = 0;
	КонтрагентИтогДт = 0;
	КонтрагентИтогКт = 0;
	
	Для каждого ДанныеДоговора Из МассивДанныхПоДоговорам Цикл 
		Договор = ДанныеДоговора.ДоговорСсылка;
		ДанныеОрганизации = ДанныеДоговора.ДанныеОрганизации;
		ДанныеКонтрагента = ДанныеДоговора.ДанныеКонтрагента;
		
		Если ЗначениеЗаполнено(Договор) Тогда 
			СтрокаНачалоДоговора.Параметры.договор = Договор;
			Таб.Вывести(СтрокаНачалоДоговора);
			Таб.присоединить(СтрокаНачалоДоговора);
		КонецЕсли;
		
		Для ц = 0 По макс(ДанныеОрганизации.Количество(), ДанныеКонтрагента.Количество()) - 1 Цикл 
			СтрокаТаблицы.Параметры.Заполнить(?(ц < ДанныеОрганизации.Количество(), ДанныеОрганизации[ц],  ПустойШаблон));
			Таб.Вывести(СтрокаТаблицы);
			СтрокаТаблицы.Параметры.Заполнить(?(ц < ДанныеКонтрагента.Количество(), ДанныеКонтрагента[ц],  ПустойШаблон));
			Таб.Присоединить(СтрокаТаблицы);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Договор) Тогда 
			СтрокаКонецДоговора.Параметры.Дебет  =  ДанныеОрганизации.Итог("Дебет");
			СтрокаКонецДоговора.Параметры.Кредит =  ДанныеОрганизации.Итог("Кредит");
			Таб.Вывести(СтрокаКонецДоговора);
			СтрокаКонецДоговора.Параметры.Дебет  =  ДанныеКонтрагента.Итог("Дебет");
			СтрокаКонецДоговора.Параметры.Кредит =  ДанныеКонтрагента.Итог("Кредит");
			Таб.Присоединить(СтрокаКонецДоговора);
		КонецЕсли;	
		
		ОрганизацияИтогДт = ОрганизацияИтогДт +  ДанныеОрганизации.Итог("Дебет");
		ОрганизацияИтогКт = ОрганизацияИтогКт +  ДанныеОрганизации.Итог("Кредит");
		КонтрагентИтогДт  = КонтрагентИтогДт +  ДанныеКонтрагента.Итог("Дебет");
		КонтрагентИтогКт  = КонтрагентИтогКт +  ДанныеКонтрагента.Итог("Кредит");
	КонецЦикла;	
	
	ОрганизацияИтогСальдо = СальдоНачальное + ОрганизацияИтогДт - ОрганизацияИтогКт;
	КонтрагентИтогСальдо = -СальдоНачальное + КонтрагентИтогДт - КонтрагентИтогКт;
	
	// заполним итог по организации
	ПодвалИтоги = макет.ПолучитьОбласть("ПодвалИтоги|Секция");
	ПодвалИтоги.Параметры.ОборотыДт = ОрганизацияИтогДт;
	ПодвалИтоги.Параметры.ОборотыКт = ОрганизацияИтогКт;
	ПодвалИтоги.Параметры.Дебет  = ?(ОрганизацияИтогСальдо > 0, ОрганизацияИтогСальдо, 0);
	ПодвалИтоги.Параметры.Кредит = ?(ОрганизацияИтогСальдо > 0, 0, -ОрганизацияИтогСальдо);
	ПодвалИтоги.параметры.ПредставлениеОрганизации = "По данным " + ДанныеСверки.ПредставлениеОрганизации;
	ПодвалИтоги.параметры.РезультатыСверки = ПредставлениеРезультатовСверки(ДанныеСверки.ДатаОкончанияСверки, ДанныеСверки.ПредставлениеОрганизации, ДанныеСверки.ПредставлениеКонтрагента, ОрганизацияИтогСальдо, ДанныеСверки.ВалютаДокумента);
	Таб.Вывести(ПодвалИтоги);
	
	
	Если ДанныеСверки.СверкаСогласована  Тогда 
		ПодвалИтоги.Параметры.ОборотыДт = КонтрагентИтогДт;
		ПодвалИтоги.Параметры.ОборотыКт = КонтрагентИтогКт;
		ПодвалИтоги.Параметры.Дебет  = ?(КонтрагентИтогСальдо > 0, КонтрагентИтогСальдо, 0);
		ПодвалИтоги.Параметры.Кредит = ?(КонтрагентИтогСальдо > 0, 0, -КонтрагентИтогСальдо);
		ПодвалИтоги.параметры.ПредставлениеОрганизации = "По данным " + ДанныеСверки.ПредставлениеКонтрагента;
		ПодвалИтоги.параметры.РезультатыСверки = ПредставлениеРезультатовСверки(ДанныеСверки.ДатаОкончанияСверки, ДанныеСверки.ПредставлениеКонтрагента, ДанныеСверки.ПредставлениеОрганизации, КонтрагентИтогСальдо, ДанныеСверки.ВалютаДокумента);
	Иначе 
		ПодвалИтоги.Параметры.ОборотыДт = "";
		ПодвалИтоги.Параметры.ОборотыКт = "";
		ПодвалИтоги.Параметры.Дебет  = "";
		ПодвалИтоги.Параметры.Кредит = "";
		ПодвалИтоги.параметры.ПредставлениеОрганизации = "";
		ПодвалИтоги.параметры.РезультатыСверки = "";
	КонецЕсли;	 
	Таб.Присоединить(ПодвалИтоги);
	
	Если  ДанныеСверки.СверкаСогласована И ДанныеСверки.Расхождение <> 0 Тогда 
		ПодвалРасхождение = Макет.ПолучитьОбласть("Расхождение");
		СуммаРасхождение = ?(ДанныеСверки.Расхождение > 0, ДанныеСверки.Расхождение, -ДанныеСверки.Расхождение);
		ОписаниеРасхождения = "В результате сверки выявлено расхождение информации о состоянии расчетов в размере " +
		РазвернутоеПредставлениеСуммы(СуммаРасхождение, ДанныеСверки.ВалютаДокумента);
		ПодвалРасхождение.параметры.Расхождение = ОписаниеРасхождения; 
		Таб.Вывести(ПодвалРасхождение);
	КонецЕсли;	 
	
	//и, наконец. подписи
	ПодвалПодписи = макет.ПолучитьОбласть("ПодвалПодпись|Секция");
	ПодвалПодписи.Параметры.ПредставлениеОрганизации = ДанныеСверки.ПредставлениеОрганизации;
	ПодвалПодписи.Параметры.Должность				 = ДанныеСверки.ПредставительОрганизации.Должность;
	ПодвалПодписи.Параметры.ФИО						 = ДанныеСверки.ПредставительОрганизации.ФИО;
	Таб.Вывести(ПодвалПодписи);
	
	ПодвалПодписи.Параметры.ПредставлениеОрганизации = ДанныеСверки.ПредставлениеКонтрагента;
	ПодвалПодписи.Параметры.Должность				 = ДанныеСверки.ПредставительКонтрагента.Должность;
	ПодвалПодписи.Параметры.ФИО						 = ДанныеСверки.ПредставительКонтрагента.ФИО;
	Таб.Присоединить(ПодвалПодписи);
	
	Возврат Таб;
	
КонецФункции

//} АКТ СВЕРКИ

//} ВНЕШНЯЯ ПЕЧАТНАЯ ФОРМА

//{ ФОРМИРОВАНИЕ ДОКУМЕНТОВ 1С

Процедура Заполнить_Строку_Данными1С(СтрокаТЧ, ПараметрыЗаполнения) Экспорт
	
	Item = СтрокаТЧ.XmlTorg12_Item;
	
	Если ПараметрыЗаполнения.ВидОперации = "ПоступлениеОбъектовСтроительства" Тогда 
		СтрокаТЧ.Номенклатура 		= Справочники.ОбъектыСтроительства.ПустаяСсылка();
		СтрокаТЧ.ЕдиницаИзмерения	= "";
	ИначеЕсли ПараметрыЗаполнения.ВидОперации = "ПоступлениеНМА" Тогда
		СтрокаТЧ.Номенклатура 		= Справочники.НематериальныеАктивы.ПустаяСсылка();
		СтрокаТЧ.ЕдиницаИзмерения 	= "";
	ИначеЕсли ПараметрыЗаполнения.ВидОперации = "ПоступлениеАвтомобилей" Тогда
		
		Автомобиль = Номенклатура_ПолучитьАвтомобильПоVIN(Item.Name);
		
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			СтрокаТЧ.Номенклатура	= Автомобиль;	
		Иначе
			СтрокаТЧ.Номенклатура	= Справочники.Автомобили.ПустаяСсылка();
		КонецЕсли;
		
		СтрокаТЧ.VINЭД = Номенклатура_ПолучитьVINИзНаименования(Item.Name);
		
	Иначе
		
		СтрокаТЧ.Номенклатура = Номенклатура_ПолучитьНоменклатуруПоставщика(ПараметрыЗаполнения.Контрагент, Item.Name, Item.Code, Item.NomenclatureArticle);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) И ЗначениеЗаполнено(Item.Code) Тогда
			СтрокаТЧ.Номенклатура = Номенклатура_ПолучитьНоменклатуруПоАртикулу(Item.Code);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) = Ложь Тогда
			СтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;	 
		
		Если ПараметрыЗаполнения.ВидОперации = "ПоступлениеДопРасходов" Тогда
			СтрокаТЧ.ЕдиницаИзмерения = "";	 
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураПараметровСобытия = Новый Структура();
	СтруктураПараметровСобытия.Вставить("НайденнаяНоменклатура",	СтрокаТЧ.Номенклатура);
	СтруктураПараметровСобытия.Вставить("Контрагент",				ПараметрыЗаполнения.Контрагент);
	СтруктураПараметровСобытия.Вставить("КодНоменклатуры",			Item.Code);
	СтруктураПараметровСобытия.Вставить("АртикулНоменклатуры",		?(ЗначениеЗаполнено(Item.VendorCode), Item.VendorCode, Item.NomenclatureArticle));
	СтруктураПараметровСобытия.Вставить("НаименованиеНоменклатуры",	Item.Name);
	СтруктураПараметровСобытия.Вставить("ДопСведения",				?(ЗначениеЗаполнено(Item.AdditionalInfos), Item.AdditionalInfos, Item.StructedAdditionalInfos));
	
	НоменклатураПМ = ОбработкаСобытияПодключаемогоМодуля("ПолучитьНоменклатуру1С", СтруктураПараметровСобытия);
	
	Если НоменклатураПМ <> Неопределено Тогда
		СтрокаТЧ.Номенклатура = НоменклатураПМ;
	КонецЕсли;
	
	СтрокаТЧ.СтавкаНДС = Модуль_Данные1С_СвязиОбъектов().ItemStruct_2_СтавкаНДС(Item);
	
	ЗаполнитьСтрокуПоНоменклатуре(СтрокаТЧ, ПараметрыЗаполнения.ВидОперации, ПараметрыЗаполнения.СуммаВключаетНДС, ПараметрыЗаполнения.ИспользоватьЕдиницуИзмерения, ПараметрыЗаполнения.Type);
	
КонецПроцедуры

Процедура ЗаполнитьДанными1С(ТабличнаяЧасть, ПараметрыЗаполнения) Экспорт
	
	НомерСтроки = 0;
	
	Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		НомерСтроки = НомерСтроки + 1;
		СтрокаТабличнойЧасти.НомерСтроки = НомерСтроки;
		
		Заполнить_Строку_Данными1С(СтрокаТабличнойЧасти, ПараметрыЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПоНоменклатуре(СтрокаТЧ, ВидОперации, СуммаВключаетНДС, ИспользоватьЕдиницуИзмерения, Type) Экспорт
	
	ЗаполнитьТипНоменклатуры(СтрокаТЧ, ВидОперации, Type);
	
	Если ИспользоватьЕдиницуИзмерения Тогда
		СтрокаТЧ.ЕдиницаИзмерения = Модуль_Данные1С_СвязиОбъектов().ItemStruct_2_ЕдиницаИзмерения(СтрокаТЧ.XmlTorg12_Item, СтрокаТЧ.Номенклатура);
		
		Коэффициент =  Модуль_Данные1С_СвязиОбъектов().ПолучитьКоэффициентПересчетаПоItemStruct(СтрокаТЧ.XmlTorg12_Item, СтрокаТЧ.ЕдиницаИзмерения);
		ПересчитатьСтрокуПоКоэффициенту(СтрокаТЧ, ВидОперации, Коэффициент, СуммаВключаетНДС);
	КонецЕсли;
	
	СтрокаТЧ.ЕИ_Обязательна = ИспользоватьЕдиницуИзмерения И ВидОперации <> "ПоступлениеАвтомобилей" И (СтрокаТЧ.Тип <> "Услуга" ИЛИ ВидОперации = "УслугиСтороннихОрганизаций");
	
	Если СтрокаТЧ.Номенклатура.Метаданные().Реквизиты.Найти("Артикул") <> Неопределено Тогда
		Артикул = СтрокаТЧ.Номенклатура.Артикул;
	Иначе
		Артикул = СтрокаТЧ.Номенклатура.Код;
	КонецЕсли;
	
	СтрокаТЧ.Артикул = Артикул;
	Если ВидОперации = "ПоступлениеАвтомобилей" Тогда
		СтрокаТЧ.VIN = СтрокаТЧ.Номенклатура.VIN;
	КонецЕсли;
	
	ПересчитатьПоляСУчетомНДС(СтрокаТЧ, ВидОперации, СуммаВключаетНДС);
	
КонецПроцедуры

Процедура ПересчитатьСтрокуПоКоэффициенту(СтрокаТЧ, ВидОперации, Коэффициент, СуммаВключаетНДС) Экспорт
	
	СтрокаТЧ.Количество = СтрокаТЧ.Количество * Коэффициент;
	
	ПересчитатьПоляСУчетомНДС(СтрокаТЧ, ВидОперации, СуммаВключаетНДС);
	
КонецПроцедуры

Процедура ЗаполнитьТипНоменклатуры(СтрокаТЧ, ВидОперации, Type) Экспорт
	
	Если ТипЗнч(СтрокаТЧ.Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда 
		ЭтоУслуга = Ложь;
	Иначе 	
		ЭтоУслуга = НоменклатураЯвляетсяУслугой(СтрокаТЧ.Номенклатура);
	КонецЕсли;	
	
	Если ВидОперации = "ПоступлениеОборудования" Тогда 
		СтрокаТЧ.Тип = "Оборудование";
	ИначеЕсли ВидОперации = "ПоступлениеОбъектовСтроительства" Тогда 
		СтрокаТЧ.Тип = "Объект стр";
	ИначеЕсли ВидОперации = "ПоступлениеНМА" Тогда 
		СтрокаТЧ.Тип = "НМА";
	ИначеЕсли ВидОперации = "ПоступлениеАвтомобилей" Тогда 
		СтрокаТЧ.Тип = "Автомобиль";
	ИначеЕсли ЭтоУслуга ИЛИ ВидОперации = "ПоступлениеДопРасходов" Тогда
		СтрокаТЧ.Тип = "Услуга";
	Иначе 
		СтрокаТЧ.Тип = "Товар";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьПоляСУчетомНДС(СтрокаТЧ, ВидОперации, СуммаВключаетНДС) Экспорт
	
	Если СуммаВключаетНДС Тогда
		СтрокаТЧ.Сумма = СтрокаТЧ.XmlTorg12_ItemSubtotal;
	Иначе
		СтрокаТЧ.Сумма = СтрокаТЧ.XmlTorg12_ItemSubtotalWithVatExcluded;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.Сумма) Тогда
		СтрокаТЧ.Сумма = 0;
	КонецЕсли;
	
	СтрокаТЧ.Цена = ?(СтрокаТЧ.Количество = 0, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма / СтрокаТЧ.Количество);
	
КонецПроцедуры

Функция ПолучитьДоговорКонтрагента(Организация, Контрагент, ДоговорСвойство, НазваниеТипаСправочника, ВидОперации) Экспорт
	
	Перем ДоговорКонтрагента;
	
	Если ЗначениеЗаполнено(ДоговорСвойство) Тогда
		ДоговорКонтрагента = ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект("DDContract", ДоговорСвойство);
	КонецЕсли;
	
	// не во всех формализованных документах форматом предусмотрено передавать наименование договора
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ДоговорКонтрагента = Модуль_Интеграция.ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, Модуль_Интеграция.ПолучитьСписокВидовДоговоров(ВидОперации));
	КонецЕсли;
	
	Если ДоговорКонтрагента = Неопределено Тогда
		ДоговорКонтрагента = Новый(НазваниеТипаСправочника);
	КонецЕсли;
	
	Возврат ДоговорКонтрагента;
	
КонецФункции

Функция ОпределитьВидОперации(ТЗ_Items)
	
	Если ИмяМодуляИнтеграции = "Модуль_ИнтеграцияАльфаАвто41" Тогда
		Для Каждого Item Из ТЗ_Items Цикл
			Если Найти(Item.Name, "VIN") > 0 Тогда
				Возврат "ПоступлениеАвтомобилей";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат "ПокупкаКомиссия";
	
КонецФункции

Функция ОпределитьИспользованиеЕдиницыИзмерения(DocumentType, ВидОперации)
	
	Если (	ВидОперации = "ВозвратОтПокупателя" 
		ИЛИ ВидОперации = "ПоступлениеОбъектовСтроительства" 
		ИЛИ ВидОперации = "ПоступлениеНМА"
		ИЛИ ВидОперации = "ПоступлениеДопРасходов"
		ИЛИ ВидОперации = "ПоступлениеАвтомобилей")
		ИЛИ (DocumentType = "XmlAcceptanceCertificate" И ВидОперации <> "УслугиСтороннихОрганизаций") Тогда
		
		Возврат	Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеНастройкиСуммаВключаетНДС()
	
	Результат = Неопределено;
	
	#Если Клиент Тогда
		Результат = ВосстановитьЗначение("Диадок_РежимВводаВходящейНакладнойСуммаВключаетНДС");
	#КонецЕсли
	
	Результат = ?(Результат = Неопределено, Истина, Результат);
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьГрузоотправителяГрузополучателя1С(Параметры)
	
	Возврат Модуль_Интеграция.ПолучитьГрузоотправителяГрузополучателя1С(Параметры);
	
КонецФункции

//{ УНИВЕРСАЛЬНЫЙ ШАБЛОН ДОКУМЕНТА 1С

Функция УниверсальныйШаблонДокумента1С(Document, ВидОперации = "") Экспорт
	
	Результат = Новый_УниверсальныйШаблонДокумента1С();
	СодержаниеДокумента = Форма_Диадок_ЭД().СтруктураСодержаниеДокумента(Document);
	
	ЗаполнитьШапкуШаблонаДокумента1С(Результат, СодержаниеДокумента, ВидОперации);
	ЗаполнитьТабличнуюЧастьШаблонаДокумента1С(Результат.ТабличнаяЧасть, СодержаниеДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_УниверсальныйШаблонДокумента1С()
	
	ШаблонДокумента1С = Новый Структура();
	
	ШаблонДокумента1С.Вставить("DocumentType");
	ШаблонДокумента1С.Вставить("Организация");
	ШаблонДокумента1С.Вставить("Контрагент");
	ШаблонДокумента1С.Вставить("ДоговорСвойство");
	ШаблонДокумента1С.Вставить("ДоговорКонтрагента");
	ШаблонДокумента1С.Вставить("Склад");
	ШаблонДокумента1С.Вставить("Подразделение");
	ШаблонДокумента1С.Вставить("СуммаВключаетНДС");
	ШаблонДокумента1С.Вставить("ДатаВходящегоДокумента");
	ШаблонДокумента1С.Вставить("НомерВходящегоДокумента");
	ШаблонДокумента1С.Вставить("ВидОперации");
	ШаблонДокумента1С.Вставить("ИспользоватьЕдиницуИзмерения");
	
	ШаблонДокумента1С.Вставить("ТабличнаяЧасть", Новый_ТабличнаяЧастьУниверсальногоШаблонаДокумента1С());
	
	Возврат ШаблонДокумента1С;
	
КонецФункции

Функция Новый_ТабличнаяЧастьУниверсальногоШаблонаДокумента1С()
	
	ИменаКолонок = "НомерСтроки, Тип, VINЭД, АртикулЭД, НоменклатураИзЭД, ЕдиницаИзЭД, Артикул, VIN, Номенклатура,
	|ЕдиницаИзмерения, Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, Комитент, Всего, ГТД, СтранаПроисхожденияЭД, СтранаПроисхождения,
	|КодСтраныПроисхожденияЭД, XmlTorg12_Item, XmlTorg12_ItemSubtotal, XmlTorg12_ItemSubtotalWithVatExcluded, ЕИ_Обязательна";
	
	ИменаКолонок = ИменаКолонок + ", СведенияОМаркировке, СведенияПрослеживаемости";
	
	Возврат НоваяТаблицаЗначений(ИменаКолонок);
	
КонецФункции	

Процедура ЗаполнитьШапкуШаблонаДокумента1С(ШаблонДокумента1С, СтСодержаниеДокумента, ВидОперации)
	
	Document = СтСодержаниеДокумента.Document;
	
	ШаблонДокумента1С.СуммаВключаетНДС				= ПолучитьЗначениеНастройкиСуммаВключаетНДС();
	ШаблонДокумента1С.Организация					= Модуль_Данные1С_СвязиОбъектов().BoxIDDepartment_2_Организация(Document.OrganizationId, Document.Department);
	ШаблонДокумента1С.Контрагент					= Модуль_Данные1С_СвязиОбъектов().CounteragentBoxID_2_Контрагент(Document.Counteragent.Id, Document.OrganizationId);
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ШаблонДокумента1С.ВидОперации				= ВидОперации;
	Иначе
		ШаблонДокумента1С.ВидОперации				= ОпределитьВидОперации(СтСодержаниеДокумента.Items);
	КонецЕсли;
	ШаблонДокумента1С.ИспользоватьЕдиницуИзмерения	= ОпределитьИспользованиеЕдиницыИзмерения(Document.Type, ШаблонДокумента1С.ВидОперации);
	ШаблонДокумента1С.ДатаВходящегоДокумента		= Document.DocumentDate;
	ШаблонДокумента1С.НомерВходящегоДокумента		= Document.DocumentNumber;
	
	ШаблонДокумента1С.DocumentType					= Document.Type;
	
	Если СтСодержаниеДокумента.Свойство("Shipper") Тогда
		
		Параметры = Новый Структура("инн, кпп", СтСодержаниеДокумента.Shipper.Inn, СтСодержаниеДокумента.Shipper.Kpp);
		
		Грузоотправитель = ПолучитьГрузоотправителяГрузополучателя1С(Параметры);
		Если ЗначениеЗаполнено(Грузоотправитель) Тогда
			ШаблонДокумента1С.Вставить("Грузоотправитель", Грузоотправитель);	
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтСодержаниеДокумента.Свойство("Consignee") Тогда
		
		Параметры = Новый Структура("инн, кпп", СтСодержаниеДокумента.Consignee.Inn, СтСодержаниеДокумента.Consignee.Kpp);
		
		Грузополучатель = ПолучитьГрузоотправителяГрузополучателя1С(Параметры);
		Если ЗначениеЗаполнено(Грузополучатель) Тогда
			ШаблонДокумента1С.Вставить("Грузополучатель", Грузополучатель);	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Document.Department <> Неопределено Тогда
		
		DepartmentID = Document.Department.Id;
		
		ШаблонДокумента1С.Склад			= ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект("DepartmentID"	   , DepartmentID);
		ШаблонДокумента1С.Подразделение	= ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект("Подр_DepartmentID", DepartmentID);
		
	КонецЕсли;
	
	ШаблонДокумента1С.ДоговорСвойство = СтСодержаниеДокумента.НаименованиеДоговора;
	Если ЗначениеЗаполнено(ШаблонДокумента1С.Контрагент) Тогда
		
		ШаблонДокумента1С.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(ШаблонДокумента1С.Организация, 
		ШаблонДокумента1С.Контрагент, 
		ШаблонДокумента1С.ДоговорСвойство, 
		ОдинСАдаптер_Документы_ПолучитьТипСправочникаДоговоров(), 
		ШаблонДокумента1С.ВидОперации);
	Иначе
		ШаблонДокумента1С.ДоговорКонтрагента = Новый(ОдинСАдаптер_Документы_ПолучитьТипСправочникаДоговоров());
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьШаблонаДокумента1С(ТабличнаяЧасть, СтСодержаниеДокумента)
	
	ТабличнаяЧасть.Очистить();
	
	Если СтСодержаниеДокумента.Document.Type = "UniversalTransferDocument" 
		И БазоваяФункцияДокумента(СтСодержаниеДокумента.Document.Function) = "InvoiceAndBasic" Тогда
		
		Для Каждого Item Из СтСодержаниеДокумента.Items Цикл
			
			ДобавитьСтрокуВТабличнуюЧастьШаблонаСДаннымиЭД(ТабличнаяЧасть, Item, Истина);
			
		КонецЦикла;
		
	Иначе
		
		СоответствиеСтрокСГТД =	Форма_Диадок_ЭД().ПолучитьСоответствиеСтрокСГТД(СтСодержаниеДокумента);
		
		Для Каждого Item Из СтСодержаниеДокумента.Items Цикл
			
			Если СоответствиеСтрокСГТД = Неопределено ИЛИ СоответствиеСтрокСГТД[Item].Количество() = 0 Тогда
				ДобавитьСтрокуВТабличнуюЧастьШаблонаСДаннымиЭД(ТабличнаяЧасть, Item);
			Иначе
				ДобавитьСтрокиВТабличнуюЧастьШаблонаПоСоответствиюГТД(ТабличнаяЧасть, Item, СоответствиеСтрокСГТД[Item]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТабличнуюЧастьШаблонаСДаннымиЭД(ТабличнаяЧасть, СтрокаТЗ_Item, ЗаполнятьГТД = Ложь)
	
	СтрокаТЧШаблона = ТабличнаяЧасть.Добавить(); 
	
	СтрокаТЧШаблона.НоменклатураИзЭД 		= СтрокаТЗ_Item.Name;
	СтрокаТЧШаблона.АртикулЭД 				= СтрокаТЗ_Item.Code;
	СтрокаТЧШаблона.ЕдиницаИзЭД 			= СтрокаТЗ_Item.UnitName;
	СтрокаТЧШаблона.Количество 				= СтрокаТЗ_Item.Quantity;
	СтрокаТЧШаблона.СуммаНДС 				= СтрокаТЗ_Item.Vat;
	СтрокаТЧШаблона.Всего 					= СтрокаТЗ_Item.Subtotal;
	
	СтрокаТЧШаблона.XmlTorg12_Item 			= СтрокаТЗ_Item;
	СтрокаТЧШаблона.XmlTorg12_ItemSubtotal 	= СтрокаТЗ_Item.Subtotal;
	СтрокаТЧШаблона.XmlTorg12_ItemSubtotalWithVatExcluded = СтрокаТЗ_Item.SubtotalWithVatExcluded;
	
	Если ЗаполнятьГТД И ЗначениеЗаполнено(СтрокаТЗ_Item.TDNumber) Тогда
		
		СтрокаТЧШаблона.ГТД 						= СтрокаТЗ_Item.TDNumber;
		СтрокаТЧШаблона.КодСтраныПроисхожденияЭД	= СтрокаТЗ_Item.CountryCode;
		СтрокаТЧШаблона.СтранаПроисхожденияЭД		= НаименованиеСтраны(СтрокаТЗ_Item.CountryCode);
		СтрокаТЧШаблона.СтранаПроисхождения			= Справочники.КлассификаторСтранМира.НайтиПоКоду(СтрокаТЧШаблона.КодСтраныПроисхожденияЭД);
		
	КонецЕсли;
	
	СтрокаТЧШаблона.СведенияОМаркировке			 = СтрокаТЗ_Item.СведенияОМаркировке;
	СтрокаТЧШаблона.СведенияПрослеживаемости	 = СтрокаТЗ_Item.СведенияПрослеживаемости;
	
КонецПроцедуры

Процедура ДобавитьСтрокиВТабличнуюЧастьШаблонаПоСоответствиюГТД(ТабличнаяЧасть, СтрокаDocument, InvoiceItemsПоГТД)
	
	// согласно логики алгоритма TotalQuantity не может быть 0, т.к. это количество товара с конкретным ГТД
	
	ВсегоИтого		= 0;
	СуммаНДСИтого	= 0;
	СтрокаТЧШаблона	= Неопределено;
	
	TotalQuantity = InvoiceItemsПоГТД.Итог("Quantity");
	
	Для каждого СтрокаInvoice Из InvoiceItemsПоГТД Цикл
		
		СтрокаТЧШаблона = ТабличнаяЧасть.Добавить();
		
		СтрокаТЧШаблона.НоменклатураИзЭД 			= СтрокаDocument.Name;
		СтрокаТЧШаблона.АртикулЭД 					= СтрокаDocument.Code;
		СтрокаТЧШаблона.ЕдиницаИзЭД 				= СтрокаDocument.UnitName;
		СтрокаТЧШаблона.Количество 					= СтрокаInvoice.Quantity;
		СтрокаТЧШаблона.СуммаНДС 					= СтрокаDocument.Vat * СтрокаInvoice.Quantity / TotalQuantity;
		СтрокаТЧШаблона.Всего 						= СтрокаDocument.Subtotal * СтрокаInvoice.Quantity / TotalQuantity;
		
		СтрокаТЧШаблона.XmlTorg12_Item 				= СтрокаDocument;
		СтрокаТЧШаблона.XmlTorg12_ItemSubtotal 		= СтрокаDocument.Subtotal * СтрокаInvoice.Quantity / TotalQuantity;
		СтрокаТЧШаблона.XmlTorg12_ItemSubtotalWithVatExcluded = СтрокаDocument.SubtotalWithVatExcluded * СтрокаInvoice.Quantity / TotalQuantity;
		
		СтрокаТЧШаблона.ГТД 						= СтрокаInvoice.TDNumber;
		СтрокаТЧШаблона.КодСтраныПроисхожденияЭД	= СтрокаInvoice.CountryCode;
		СтрокаТЧШаблона.СтранаПроисхожденияЭД 		= НаименованиеСтраны(СтрокаInvoice.CountryCode);
		СтрокаТЧШаблона.СтранаПроисхождения 		= Справочники.КлассификаторСтранМира.НайтиПоКоду(СтрокаТЧШаблона.КодСтраныПроисхожденияЭД);
		
		СтрокаТЧШаблона.СведенияОМаркировке 		= СтрокаDocument.СведенияОМаркировке;
		СтрокаТЧШаблона.СведенияПрослеживаемости 	= СтрокаDocument.СведенияПрослеживаемости;
		
		ВсегоИтого 		= ВсегоИтого 	+ СтрокаТЧШаблона.Всего;
		СуммаНДСИтого 	= СуммаНДСИтого + СтрокаТЧШаблона.СуммаНДС;
		
	КонецЦикла;
	
	Если СтрокаТЧШаблона <> Неопределено Тогда
		СтрокаТЧШаблона.Всего 		= СтрокаТЧШаблона.Всего 	+ (СтрокаDocument.Subtotal - ВсегоИтого);
		СтрокаТЧШаблона.СуммаНДС 	= СтрокаТЧШаблона.СуммаНДС 	+ (СтрокаDocument.Vat - СуммаНДСИтого);
	КонецЕсли;
	
КонецПроцедуры

//} УНИВЕРСАЛЬНЫЙ ШАБЛОН ДОКУМЕНТА 1С

Функция ПолучитьПеречислениеКолонокДляСвертки(ПеречислениеИзмерений, ТаблицаЗначений)
	
	Результат = "";
	Шаблон =  ПеречислениеИзмерений + ",";
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл 
		Если Найти(Шаблон, Колонка.Имя + ",") = 0 Тогда 
			Результат = Колонка.Имя + ", " + Результат;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Результат <> "" Тогда
		Результат = Лев(Результат, СтрДлина(Результат) - 2);
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции

//} ФОРМИРОВАНИЕ ДОКУМЕНТОВ 1С

//{ РАБОТА С 1С АДАПТЕРОМ

Процедура ОдинСАдаптер_Инициализировать(Отказ = Ложь) Экспорт
	ПолучитьМодульПрог("Модуль_1САдаптер").Инициализировать(Контекст1САдаптерКонфигурации, Отказ);
КонецПроцедуры

Функция ОдинСАдаптер_Документы_ПолучитьТипСправочникаГТД() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьТипСправочникаГТД(Контекст1САдаптерКонфигурации);
КонецФункции

Функция ОдинСАдаптер_Документы_ПолучитьТипСправочникаОрганизации() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьТипСправочникаОрганизации(Контекст1САдаптерКонфигурации);
КонецФункции

Функция ОдинСАдаптер_Документы_ПолучитьТипДокументаСчетФактураВыданный() Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьТипДокументаСчетФактураВыданный(Контекст1САдаптерКонфигурации);
	
	Возврат Результат;
	
КонецФункции

Функция ОдинСАдаптер_Документы_ПолучитьТипДокументаСчетФактураПолученный() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьТипДокументаСчетФактураПолученный(Контекст1САдаптерКонфигурации);
КонецФункции

Функция ОдинСАдаптер_Документы_ПолучитьТипДокументаРеализацияТоваровУслуг() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьТипДокументаРеализацияТоваровУслуг(Контекст1САдаптерКонфигурации);
КонецФункции

Функция ОдинСАдаптер_Документы_ПолучитьТипСправочникаДоговоров() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьТипСправочникаДоговоров(Контекст1САдаптерКонфигурации);
КонецФункции

Функция ОдинСАдаптер_Документы_ПолноеИмяДокументаСчетФактураВыданный() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьПолноеИмяДокументаСчетФактураВыданный(Контекст1САдаптерКонфигурации);
КонецФункции

Функция ОдинСАдаптер_Документы_ПолноеИмяДокументаСчетФактураПолученный() Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").Документы_ПолучитьПолноеИмяДокументаСчетФактураПолученный(Контекст1САдаптерКонфигурации);
КонецФункции

Функция ОдинСАдаптер_НастройкиТекущегоПользователя_ПолучитьНастройку(НаименованиеНастройки, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если Контекст1САдаптерКонфигурации = Неопределено Тогда
		ВызватьИсключение "Модуль 1С-адаптер не инициализирован";
	КонецЕсли;
	
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").НастройкиТекущегоПользователя_ПолучитьНастройку(Контекст1САдаптерКонфигурации, НаименованиеНастройки, ЗначениеПоУмолчанию);
	
КонецФункции

Функция ОдинСАдаптер_НастройкиТекущегоПользователя_ПолучитьНастройку1С(НаименованиеНастройки) Экспорт
	
	Если Контекст1САдаптерКонфигурации = Неопределено Тогда
		ВызватьИсключение "Модуль 1С-адаптер не инициализирован";
	КонецЕсли;
	
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").НастройкиТекущегоПользователя_ПолучитьНастройку1С(Контекст1САдаптерКонфигурации, НаименованиеНастройки);
	
КонецФункции

Функция ОдинСАдаптер_НастройкиТекущегоПользователя_ПолучитьНастройку1С_СкладПоУмолчанию() Экспорт
	
	Если Контекст1САдаптерКонфигурации = Неопределено Тогда
		ВызватьИсключение "Модуль 1С-адаптер не инициализирован";
	КонецЕсли;
	
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").НастройкиТекущегоПользователя_ПолучитьНастройку1С_СкладПоУмолчанию(Контекст1САдаптерКонфигурации);
	
КонецФункции

Процедура ОдинСАдаптер_НастройкиТекущегоПользователя_УстановитьНастройку(НаименованиеНастройки, Значение) Экспорт
	
	Если Контекст1САдаптерКонфигурации = Неопределено Тогда
		ВызватьИсключение "Адаптер 1С конфигурации не инициализирован";
	КонецЕсли;
	
	ПолучитьМодульПрог("Модуль_1САдаптер").НастройкиТекущегоПользователя_УстановитьНастройку(Контекст1САдаптерКонфигурации, НаименованиеНастройки, Значение);
	
КонецПроцедуры

Функция ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект(НаименованиеСвойства, ЗначениеСвойства, НаименованиеСвойства2 = Неопределено, ЗначениеСвойства2 = Неопределено) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_НайтиОбъект(Контекст1САдаптерКонфигурации, НаименованиеСвойства, ЗначениеСвойства, НаименованиеСвойства2, ЗначениеСвойства2);
КонецФункции

Функция ОдинСАдаптер_СвойстваОбъектов_НайтиОбъекты(НаименованиеСвойства, ЗначениеСвойства, НаименованиеСвойства2 = Неопределено, ЗначениеСвойства2 = Неопределено) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_НайтиОбъекты(Контекст1САдаптерКонфигурации, НаименованиеСвойства, ЗначениеСвойства, НаименованиеСвойства2, ЗначениеСвойства2);
КонецФункции

Функция ОдинСАдаптер_СвойстваОбъектов_НайтиСвойство(НаименованиеСвойства) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_НайтиСвойство(Контекст1САдаптерКонфигурации, НаименованиеСвойства);
КонецФункции

Функция ОдинСАдаптер_НайтиОбъектыПоМассивуЗначений(НаименованиеСвойства, ЗначениеСвойства) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_НайтиОбъектыПоМассивуЗначений(Контекст1САдаптерКонфигурации, НаименованиеСвойства, ЗначениеСвойства);
КонецФункции

Процедура ОдинСАдаптер_Заполнить_ТаблицуКонтрагентовДиадок_Контрагентами1С(ТаблицаСКонтрагентами) Экспорт
	ПолучитьМодульПрог("Модуль_1САдаптер").Заполнить_ТаблицуКонтрагентовДиадок_Контрагентами1С(Контекст1САдаптерКонфигурации, ТаблицаСКонтрагентами);
КонецПроцедуры

Процедура ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(Объект, НаименованиеСвойства, ЗначениеСвойства) Экспорт
	
	ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_УстановитьЗначениеСвойства(Контекст1САдаптерКонфигурации, Объект, НаименованиеСвойства, ЗначениеСвойства);
	
КонецПроцедуры

Функция ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеСвойства(Объект, НаименованиеСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_ПолучитьЗначениеСвойства(Контекст1САдаптерКонфигурации, Объект, НаименованиеСвойства, ЗначениеПоУмолчанию);
КонецФункции

Функция ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначенияСвойстваОбъектов(Объекты, НаименованиеСвойства) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_ПолучитьЗначенияСвойстваОбъектов(Контекст1САдаптерКонфигурации, Объекты, НаименованиеСвойства);
	
КонецФункции

Процедура ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеКонстанты(НаименованиеКонстанты, ЗначениеКонстанты) Экспорт
	ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_УстановитьЗначениеКонстанты(Контекст1САдаптерКонфигурации, НаименованиеКонстанты, ЗначениеКонстанты);
КонецПроцедуры

Функция ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты(НаименованиеКонстанты, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат	ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_ПолучитьЗначениеКонстанты(Контекст1САдаптерКонфигурации, НаименованиеКонстанты, ЗначениеПоУмолчанию);
КонецФункции

Функция ОдинСАдаптер_СвойстваОбъектов_ПолучитьСсылкуНаСвойство(ИдентификаторСвойства) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_ПолучитьСсылкуНаСвойство(Контекст1САдаптерКонфигурации, ИдентификаторСвойства);
КонецФункции

Функция ОдинСАдаптер_СвойстваОбъектов_ПолучитьТаблицуСвойствСкладов(ИдентификаторыСвойств) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптер").СвойстваОбъектов_ПолучитьТаблицуСвойстваСкладов(Контекст1САдаптерКонфигурации, ИдентификаторыСвойств);
КонецФункции

Процедура ВнешнийАдаптер_СопоставлятьДокументыФоном(ДатаНачала, ДатаОкончания) Экспорт
	Модуль_ВнешнийАдаптер().СопоставитьДокументыФоном(ДатаНачала, ДатаОкончания);
КонецПроцедуры

//} РАБОТА С 1С АДАПТЕРОМ

//{ РАБОТА С НОМЕНКЛАТУРОЙ

Процедура Номенклатура_УстановитьСоответствие(Номенклатура, Контрагент, Code, NomenclatureArticle, Name) Экспорт
	УстановитьНоменклатуруПоставщика(Номенклатура, Контрагент, Code, NomenclatureArticle, Name);
КонецПроцедуры

Функция Номенклатура_ПолучитьНоменклатуруПоставщика(Контрагент, Name, Code, NomenclatureArticle) Экспорт
	Возврат ПолучитьНоменклатуруПоставщика(Контрагент, Name, Code, NomenclatureArticle);
КонецФункции

Функция Номенклатура_ПолучитьНоменклатуруПоАртикулу(NomenclatureArticle) Экспорт
	Возврат ПолучитьНоменклатуруПоАртикулу(NomenclatureArticle);
КонецФункции

Функция Номенклатура_ПолучитьАвтомобильПоVIN(NomenclatureName) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптерПолучениеДокументов_Рарус").ПолучитьАвтомобильПоVIN(NomenclatureName);
КонецФункции

Функция Номенклатура_ПолучитьVINИзНаименования(NomenclatureName) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_1САдаптерПолучениеДокументов_Рарус").НайтиVINВНаименовании(NomenclatureName);
КонецФункции

//} РАБОТА С НОМЕНКЛАТУРОЙ


//{ РАБОТА С ШАБЛОНАМИ ДОП ПОЛЕЙ

Функция ПолучитьШаблонКлючейДопСведений(ИдКонтрагента, DocumentType) Экспорт
	
	СловарьШаблоновКлючейДопСведений = ПолучитьСловарьШаблоновКлючейДопСведений();
	
	ОтборСтрок =			Новый Структура("ИдКонтрагента, DocumentType", ИдКонтрагента, DocumentType);
	НайденныеСтроки =	СловарьШаблоновКлючейДопСведений.НайтиСтроки(ОтборСтрок);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ШаблонКлючей = НайденныеСтроки[0].ШаблонКлючей;
	Иначе
		ШаблонКлючей = "";
	КонецЕсли;
	
	Возврат ШаблонКлючей;
	
КонецФункции

Функция ПолучитьСловарьШаблоновКлючейДопСведений() 
	
	СловарьШаблонов = Новый ТаблицаЗначений;
	
	СловарьШаблонов.Колонки.Добавить("ИдКонтрагента");
	СловарьШаблонов.Колонки.Добавить("DocumentType");
	СловарьШаблонов.Колонки.Добавить("ШаблонКлючей");
	
	// проктер Тестовая организация
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "434d7fb5e20645e2ab85192f1a2db10d@diadoc.ru", "XmlTorg12", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;PO=;заказчик=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "434d7fb5e20645e2ab85192f1a2db10d@diadoc.ru", "XmlAcceptanceCertificate", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;PO=;заказчик=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "434d7fb5e20645e2ab85192f1a2db10d@diadoc.ru", "Invoice", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;НаимБанк=;БИК=;НомерСчета=;");
	
	// проктер
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "03288824e3374f509fe2e5503742cd88@diadoc.ru", "XmlTorg12", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;PO=;заказчик=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "03288824e3374f509fe2e5503742cd88@diadoc.ru", "XmlAcceptanceCertificate", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;PO=;заказчик=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "03288824e3374f509fe2e5503742cd88@diadoc.ru", "Invoice", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;НаимБанк=;БИК=;НомерСчета=;");
	
	// авто
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "c19b1b8c75ab4ca3a2ab8ea3771631ab@diadoc.ru", "XmlTorg12", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;PO=;заказчик=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "c19b1b8c75ab4ca3a2ab8ea3771631ab@diadoc.ru", "XmlAcceptanceCertificate", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;PO=;заказчик=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "c19b1b8c75ab4ca3a2ab8ea3771631ab@diadoc.ru", "Invoice", "тип_комплекта=;контракт=;номер_контракта=;дата_контракта=;НаимБанк=;БИК=;НомерСчета=;");
	
	// апатит
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "a2fbbbfba58040689c8f7c19d1b111ed@diadoc.ru", "XmlTorg12", "НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "a2fbbbfba58040689c8f7c19d1b111ed@diadoc.ru", "XmlAcceptanceCertificate", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "a2fbbbfba58040689c8f7c19d1b111ed@diadoc.ru", "Invoice", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	
	// апатит (балаковский ф-л)
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "aa1b1962b50d42349d310acb27fa5760@diadoc.ru", "XmlTorg12", "НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "aa1b1962b50d42349d310acb27fa5760@diadoc.ru", "XmlAcceptanceCertificate", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "aa1b1962b50d42349d310acb27fa5760@diadoc.ru", "Invoice", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	
	// фосагро
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "64d1058f69f74ab4bee0e15567860044@diadoc.ru", "XmlTorg12", "НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "64d1058f69f74ab4bee0e15567860044@diadoc.ru", "XmlAcceptanceCertificate", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "64d1058f69f74ab4bee0e15567860044@diadoc.ru", "Invoice", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	
	// метахим
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "b88f8a5db1e8447aa8f8fdcb9da3adb1@diadoc.ru", "XmlTorg12", "НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "b88f8a5db1e8447aa8f8fdcb9da3adb1@diadoc.ru", "XmlAcceptanceCertificate", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "b88f8a5db1e8447aa8f8fdcb9da3adb1@diadoc.ru", "Invoice", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	
	// фосагро (череповец)
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "200ad0208fe84e488ef4575dac492b65@diadoc.ru", "XmlTorg12", "НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "200ad0208fe84e488ef4575dac492b65@diadoc.ru", "XmlAcceptanceCertificate", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "200ad0208fe84e488ef4575dac492b65@diadoc.ru", "Invoice", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	
	// Папирус (для тестирования группы Фосагро)
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "6b630accf48b4ad397fe276f3f4c219f@diadoc.ru", "XmlTorg12", "НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "6b630accf48b4ad397fe276f3f4c219f@diadoc.ru", "XmlAcceptanceCertificate", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "6b630accf48b4ad397fe276f3f4c219f@diadoc.ru", "Invoice", "Договор=;ДатаДоговор=;НомерДопСогл=;ДатаДопСогл=;КомисИНН=;КомисКПП=;");
	
	// Тестовое Юрлицо 2 (Для тестирования группы S7)
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "ed60fb4bcc2a46c49452ea21582f59ad@diadoc.ru", "Invoice", "ДоговорНомер=;ДоговорДата=;");
	// S7 - ПАО "Авиакомпания Сибирь"
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "bd79cbf7708f45e1891fb398affa6fc6@diadoc.ru", "Invoice", "ДоговорНомер=;ДоговорДата=;");
	// S7 - ООО Глобус
	ДобавитьСтрокуВСловарь(СловарьШаблонов, "c9768a6086f64e1690d4bc81f09ca86a@diadoc.ru", "Invoice", "ДоговорНомер=;ДоговорДата=;");
	
	
	Возврат СловарьШаблонов;
	
КонецФункции // ()

Процедура ДобавитьСтрокуВСловарь(СловарьШаблонов, ИдКонтрагента, DocumentType, ШаблонКлючей)
	
	НоваяСтрока = СловарьШаблонов.Добавить();
	
	НоваяСтрока.ИдКонтрагента = ИдКонтрагента; 
	НоваяСтрока.DocumentType = DocumentType;
	НоваяСтрока.ШаблонКлючей = ШаблонКлючей;
	
КонецПроцедуры // ДобавитьСтрокуВСловарь()

Функция НужноФормироватьДопИнфоПоШаблону(ИдКонтрагента) Экспорт 
	
	Если ИдКонтрагента = "a2fbbbfba58040689c8f7c19d1b111ed@diadoc.ru" // апатит
		ИЛИ ИдКонтрагента = "aa1b1962b50d42349d310acb27fa5760@diadoc.ru" // апатит (балаковский ф-л)
		ИЛИ ИдКонтрагента = "64d1058f69f74ab4bee0e15567860044@diadoc.ru" // фосагро
		ИЛИ ИдКонтрагента = "b88f8a5db1e8447aa8f8fdcb9da3adb1@diadoc.ru" // метахим
		ИЛИ ИдКонтрагента = "200ad0208fe84e488ef4575dac492b65@diadoc.ru" // фосагро (череповец)
		ИЛИ ИдКонтрагента = "6b630accf48b4ad397fe276f3f4c219f@diadoc.ru" Тогда // Папирус
		КонвертироватьДопСвойства = Истина;
	Иначе
		КонвертироватьДопСвойства = Ложь;
	КонецЕсли;
	
	Возврат КонвертироватьДопСвойства;
	
КонецФункции

Функция НеобходимоЗаполнятьШаблонДопПолейЗначениями(ИдКонтрагента) Экспорт
	
	Если ИдКонтрагента = "ed60fb4bcc2a46c49452ea21582f59ad@diadoc.ru" //Тестовое юрлицо 2 -> Тестирование группы S7 
		ИЛИ ИдКонтрагента = "bd79cbf7708f45e1891fb398affa6fc6@diadoc.ru" //S7 - ПАО "Авиакомпания Сибирь"
		ИЛИ ИдКонтрагента = "c9768a6086f64e1690d4bc81f09ca86a@diadoc.ru" Тогда // S7 - ООО Глобус 
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


//} РАБОТА С ШАБЛОНАМИ ДОП ПОЛЕЙ	

//{ РАБОТА С ДОГОВОРАМИ КОНТРАГЕНТОВ

Процедура Договор_УстановитьСоответствие(Договор, ДоговорСвойство) Экспорт
	ПолучитьФорму("Модуль_Данные1С_СвязиОбъектов").УстановитьСоотвествиеДоговора(Договор, ДоговорСвойство);
КонецПроцедуры

//} РАБОТА С ДОГОВОРАМИ КОНТРАГЕНТОВ

//{ РАБОТА С ПРОФИЛЕМ КОНФИГУРАЦИИ

Функция ПолучитьПрофильКонфигурации() Экспорт
	
	Результат = ЭДО_Кэш_Прочитать("ПрофильКонфигурации");
	
	Если Результат = Неопределено Тогда
		
		Результат = СформироватьПрофильКонфигурации();
		
		Если Результат <> Неопределено Тогда
			ЭДО_Кэш_Поместить("ПрофильКонфигурации", Результат);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПрофильКонфигурации(Отказ = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПрофильКонфигурации = СформироватьПрофильКонфигурации();
	
	Если ПрофильКонфигурации = Неопределено Тогда
		Отказ = Истина;
	Иначе
		ЭДО_Кэш_Поместить("ПрофильКонфигурации", ПрофильКонфигурации);
	КонецЕсли;
	
КонецПроцедуры


Функция СформироватьПрофильКонфигурации() Экспорт
	стПрофильКонфигурации = Новый Структура;
	
	Если Метаданные.Справочники.Найти("НоменклатураПоставщиков") <> Неопределено Тогда
		стПрофильКонфигурации.Вставить("ХранениеНоменклатурыПоставщиков", Новый Структура("Вариант", "Справочник_НоменклатураПоставщиков"));
	ИначеЕсли Метаданные.РегистрыСведений.Найти("НоменклатураКонтрагентов") <> Неопределено Тогда
		стПрофильКонфигурации.Вставить("ХранениеНоменклатурыПоставщиков", Новый Структура("Вариант", "РегистрСведений_НоменклатураКонтрагентов"));
	ИначеЕсли Метаданные.РегистрыСведений.Найти("НоменклатураПоставщика") <> Неопределено Тогда 
		стПрофильКонфигурации.Вставить("ХранениеНоменклатурыПоставщиков", Новый Структура("Вариант", "РегистрСведений_НоменклатураПоставщика"));
	ИначеЕсли Метаданные.РегистрыСведений.Найти("ЗначенияСвойствОбъектов") <> Неопределено Тогда 
		стПрофильКонфигурации.Вставить("ХранениеНоменклатурыПоставщиков", Новый Структура("Вариант", "СвойстваОбъектов_Номенклатура"));
	Иначе
		стПрофильКонфигурации.Вставить("ХранениеНоменклатурыПоставщиков", Новый Структура("Вариант", Неопределено));
	КонецЕсли;
	
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("Услуга") <> Неопределено Тогда
		стПрофильКонфигурации.Вставить("Услуги", Новый Структура("Вариант, Реквизит, ЗначениеРеквизита", "ПоРеквизиту", "Услуга", Истина));
	ИначеЕсли Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ВидТовара") <> Неопределено Тогда
		стПрофильКонфигурации.Вставить("Услуги", Новый Структура("Вариант, Реквизит, ЗначениеРеквизита", "ПоРеквизиту", "ВидТовара", Перечисления.ВидыТоваров.Услуга));
	Иначе
		стПрофильКонфигурации.Вставить("Услуги", Новый Структура("Вариант", "ПоТипуНоменклатуры"));
	КонецЕсли;
	
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("Артикул") <> Неопределено Тогда
		стПрофильКонфигурации.Вставить("ЕстьАртикул", Истина);
	Иначе
		стПрофильКонфигурации.Вставить("ЕстьАртикул", Ложь);
	КонецЕсли;
	
	Если НЕ ЗапущенКакВнешнийМодуль Тогда
		
		Если ПолучитьМодульПрог("Модуль_1САдаптер").ОпределитьПрофиль_НастройкиТекущегоПользователя() = "Модуль_1САдаптерНастройкиТекущегоПользователя_Рарус" Тогда
			стПрофильКонфигурации.Вставить("ХранениеНастроекПользователей", Новый Структура("Вариант", "Рарус"));
		Иначе
			стПрофильКонфигурации.Вставить("ХранениеНастроекПользователей", Новый Структура("Вариант", "1С"));
		КонецЕсли;
		
	КонецЕсли;
	
	//определим доступные операции по поступлению
	стОперацииПоступления = Новый Структура;
	стОперацииПоступления.Вставить("ПоступлениеОборудования", Метаданные.Справочники.Найти("ОбъектыСтроительства") <> Неопределено);
	стОперацииПоступления.Вставить("ВозвратОтПокупателя", Найти(Метаданные.Синоним, "Альфа-Авто") = 0);
	стОперацииПоступления.Вставить("ПоступлениеНМА", Метаданные.Документы.Найти("ПоступлениеНМА") <> Неопределено);
	стПрофильКонфигурации.Вставить("НастройкиПоступления", стОперацииПоступления);
	
	//определим справочник, в котором хранится список подразделений
	МассивПрикладныхРешенийИсключений = Новый Массив;
	МассивПрикладныхРешенийИсключений.Добавить("Модуль_ИнтеграцияАльфаАвто41");
	МассивПрикладныхРешенийИсключений.Добавить("Модуль_ИнтеграцияБух");
	МассивПрикладныхРешенийИсключений.Добавить("Модуль_ИнтеграцияТКПТ");
	МассивПрикладныхРешенийИсключений.Добавить("Модуль_ИнтеграцияДалионУМ");
	
	ИндексЭлементаМассива = МассивПрикладныхРешенийИсключений.Найти(ИмяФормыПрикладногорешенияДляИнтеграцииДиадок());
	стПрофильКонфигурации.Вставить("ИспользоватьСопоставлениеПодразделений", ?(ИндексЭлементаМассива = Неопределено, Истина, Ложь));
	
	Если НЕ Метаданные.Справочники.Найти("ПодразделенияОрганизаций") = Неопределено Тогда
		стПрофильКонфигурации.Вставить("НаименованиеСправочникаПодразделений", "ПодразделенияОрганизаций");
	ИначеЕсли НЕ Метаданные.Справочники.Найти("ПодразделенияКомпании") = Неопределено Тогда 
		стПрофильКонфигурации.Вставить("НаименованиеСправочникаПодразделений", "ПодразделенияКомпании");
	Иначе
		стПрофильКонфигурации.Вставить("НаименованиеСправочникаПодразделений", "Подразделения");
	КонецЕсли;
	
	стПрофильКонфигурации.Вставить("НаименованиеСправочникаСкладов", ?(метаданные.справочники.найти("СкладыКомпании") <> Неопределено, "СкладыКомпании", "Склады"));
	стПрофильКонфигурации.Вставить("НаименованиеСправочникаДоговоров", ?(метаданные.справочники.найти("ДоговорыКонтрагентов") <> Неопределено, "ДоговорыКонтрагентов", ?(Метаданные.Справочники.Найти("ДоговорыВзаиморасчетов") <> Неопределено, "ДоговорыВзаиморасчетов", "Договоры")));
	стПрофильКонфигурации.Вставить("НаименованиеСправочникаОрганизации", ?(метаданные.справочники.найти("Организации") <> Неопределено, "Организации", "Фирмы"));
	
	
	стПрофильКонфигурации.Вставить("АнализироватьВидОперацииРТУ", (ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияУПП13") или (ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияКА") );
	
	Возврат стПрофильКонфигурации;
КонецФункции


Функция ПолучитьНоменклатуруПоставщика(Контрагент, НаименованиеНоменклатуры, КодНоменклатуры, АртикулНоменклатуры) Экспорт
	
	КодНоменклатуры = ?(ПустаяСтрока(КодНоменклатуры), Неопределено, КодНоменклатуры);
	АртикулНоменклатуры = ?(ПустаяСтрока(АртикулНоменклатуры), Неопределено, АртикулНоменклатуры);
	НаименованиеНоменклатуры =	?(ПустаяСтрока(НаименованиеНоменклатуры), Неопределено, НаименованиеНоменклатуры);
	Номенклатура = Неопределено;    
	Выборка = Неопределено;
	стПрофильКонфигурации = ПолучитьПрофильКонфигурации();
	
	Если стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант = "Справочник_НоменклатураПоставщиков" Тогда
		Выборка = ПолучитьВыборкуПоСпрНомПост(Контрагент, "Идентификатор", КодНоменклатуры);
		Если Выборка.Количество() = 0 Тогда
			Выборка = ПолучитьВыборкуПоСпрНомПост(Контрагент, "Артикул", АртикулНоменклатуры);
			Если Выборка.Количество() = 0 Тогда
				Если (Выборка.Количество() = 0)
						И (ЗначениеЗаполнено(КодНоменклатуры) = Ложь) И (ЗначениеЗаполнено(АртикулНоменклатуры) = Ложь) Тогда
					Выборка = ПолучитьВыборкуПоСпрНомПост(Контрагент, "Наименование", НаименованиеНоменклатуры);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант
			= "РегистрСведений_НоменклатураКонтрагентов" Тогда
		Выборка = ПолучитьВыборкуПоРегСведНомПост(Контрагент, "КодНоменклатурыКонтрагента", КодНоменклатуры);
		Если Выборка = Неопределено ИЛИ Выборка.Количество() = 0 Тогда
			Выборка = ПолучитьВыборкуПоРегСведНомПост(Контрагент, "ШтрихКодНоменклатурыКонтрагента", КодНоменклатуры);
			Если Выборка = Неопределено ИЛИ Выборка.Количество() = 0 Тогда
				Выборка = ПолучитьВыборкуПоРегСведНомПост(Контрагент, "АртикулНоменклатурыКонтрагента", АртикулНоменклатуры);
				Если Выборка = Неопределено ИЛИ (Выборка.Количество() = 0) И (ЗначениеЗаполнено(КодНоменклатуры) = Ложь) И (ЗначениеЗаполнено(АртикулНоменклатуры) = Ложь) Тогда
					Выборка = ПолучитьВыборкуПоРегСведНомПост(Контрагент, "НаименованиеНоменклатурыКонтрагента", НаименованиеНоменклатуры, "ПОДОБНО");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант = "РегистрСведений_НоменклатураПоставщика" Тогда
		
		РезультатЗапроса = Неопределено;
		
		Если ЗначениеЗаполнено(КодНоменклатуры) Тогда
			РезультатЗапроса = ПолучитьРезультатЗапросаПоРегиструНоменклатураПоставщика(Контрагент, "Код", КодНоменклатуры);
		КонецЕсли;
		
		Если (РезультатЗапроса = Неопределено ИЛИ РезультатЗапроса.Пустой()) И ЗначениеЗаполнено(АртикулНоменклатуры) Тогда
			РезультатЗапроса = ПолучитьРезультатЗапросаПоРегиструНоменклатураПоставщика(Контрагент, "Артикул", АртикулНоменклатуры);
		КонецЕсли;
		
		// Поиск по наименованию выполняется только в том случае, если попыток получить номенклатуру выше небыло: РезультатЗапроса = Неопределено.
		Если РезультатЗапроса = Неопределено И ЗначениеЗаполнено(НаименованиеНоменклатуры) Тогда
			РезультатЗапроса = ПолучитьРезультатЗапросаПоРегиструНоменклатураПоставщика(Контрагент, "Наименование", НаименованиеНоменклатуры, "ПОДОБНО");
		КонецЕсли;
		
		Если РезультатЗапроса <> Неопределено И НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать(); 
			Выборка.Следующий();
			Возврат Выборка.Номенклатура;
		КонецЕсли;
		
	ИначеЕсли стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант = "СвойстваОбъектов_Номенклатура" Тогда
		НаименованиеСвойства = ИдентификаторСвойстваНоменклатураКонтрагента_Код(?(Контрагент = Неопределено, "", Контрагент.УникальныйИдентификатор()));
		Номенклатура = ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект(НаименованиеСвойства, КодНоменклатуры);
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			НаименованиеСвойства =  ИдентификаторСвойстваНоменклатураКонтрагента_Артикул(?(Контрагент = Неопределено, "", Контрагент.УникальныйИдентификатор()));
			Номенклатура = ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект(НаименованиеСвойства, АртикулНоменклатуры);
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				НаименованиеСвойства = ИдентификаторСвойстваНоменклатураКонтрагента_Наименование(?(Контрагент = Неопределено, "", Контрагент.УникальныйИдентификатор()));
				Номенклатура = ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект(НаименованиеСвойства, НаименованиеНоменклатуры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Выборка) И Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.Номенклатура;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВыборкуПоСпрНомПост(Контрагент, НаименованиеРеквизита, ЗначениеРеквизита)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ном.Номенклатура
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК Ном
	|ГДЕ
	|	Ном.Владелец = &Контрагент
	|	И Ном."+ НаименованиеРеквизита+ " = &ЗначениеРеквизита";
	
	Возврат	Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьВыборкуПоРегСведНомПост(Контрагент, НаименованиеРеквизита, ЗначениеРеквизита, Оператор = "=")
	
	Попытка
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ном.Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураКонтрагентов КАК Ном
		|ГДЕ
		|	Ном.Контрагент = &Контрагент
		|	И Ном."+ НаименованиеРеквизита + " " + Оператор + " (&ЗначениеРеквизита)";
		
		
		ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();
		
		Возврат ВыборкаИзЗапроса;	
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьРезультатЗапросаПоРегиструНоменклатураПоставщика(Контрагент, НаименованиеРеквизита, ЗначениеРеквизита, Оператор = "=")
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураПоставщика КАК Т
	|ГДЕ
	|	Поставщик = &Контрагент
	|	И "+ НаименованиеРеквизита + " " + Оператор + " (&ЗначениеРеквизита)");
	
	Запрос.УстановитьПараметр("Контрагент"		 , Контрагент);
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
	
	Возврат Запрос.Выполнить();	
	
КонецФункции

Процедура УстановитьНоменклатуруПоставщика(Номенклатура, Контрагент, Код, Артикул, Наименование) Экспорт
	
	Если типЗнч(Номенклатура) <> тип("СправочникСсылка.Номенклатура") Тогда
		Возврат
	КонецЕсли;	
	стПрофильКонфигурации = ПолучитьПрофильКонфигурации();
	Если стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант = "Справочник_НоменклатураПоставщиков" Тогда
		Выборка = Вычислить("Справочники.НоменклатураПоставщиков.Выбрать(, Контрагент, Новый Структура(""Идентификатор"", Код))");
		
		ЕстьСоответствие = Ложь;
		Если Выборка.Следующий() Тогда
			ЕстьСоответствие = Истина;
		Иначе
			Выборка = Вычислить("Справочники.НоменклатураПоставщиков.Выбрать(, Контрагент, Новый Структура(""Артикул"", Артикул))");
			Если Выборка.Следующий() Тогда
				ЕстьСоответствие = Истина;
			ИначеЕсли (ЗначениеЗаполнено(Код)=Ложь) И (ЗначениеЗаполнено(Наименование) = Ложь) Тогда 
				Выборка = Вычислить("Справочники.НоменклатураПоставщиков.Выбрать(, Контрагент, Новый Структура(""Наименование"", Наименование))");
				Если Выборка.Следующий() Тогда
					ЕстьСоответствие = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьСоответствие Тогда
			Если Выборка.номенклатура <> Номенклатура Тогда
				элементОбъект = Выборка.ПолучитьОбъект();
				элементОбъект.Номенклатура = Номенклатура;
				элементОбъект.Записать();
			КонецЕсли;
		Иначе
			элементОбъект = Вычислить("Справочники.НоменклатураПоставщиков.СоздатьЭлемент()");
			элементОбъект.Владелец = Контрагент;
			элементОбъект.Наименование = Наименование; 
			элементОбъект.Номенклатура = Номенклатура;
			элементОбъект.Идентификатор = Код;
			элементОбъект.Артикул = Артикул;
			элементОбъект.Записать();
		КонецЕсли;
	ИначеЕсли стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант = "РегистрСведений_НоменклатураКонтрагентов" Тогда
		
		СуществующаяНоменклатура = ПолучитьНоменклатуруПоставщика(Контрагент, Наименование, Код, Артикул);
		
		Если СуществующаяНоменклатура = Номенклатура Тогда
			Возврат;
		КонецЕсли;
		
		Если СуществующаяНоменклатура <> Неопределено Тогда
			мз = РегистрыСведений.НоменклатураКонтрагентов.СоздатьМенеджерЗаписи();
			мз.Контрагент = Контрагент;
			мз.Номенклатура = СуществующаяНоменклатура;
			мз.Прочитать();
			мз.Номенклатура = Номенклатура;
			мз.НаименованиеНоменклатурыКонтрагента=	Наименование;
			мз.КодНоменклатурыКонтрагента = Код;
			мз.АртикулНоменклатурыКонтрагента = Артикул;
		Иначе
			мз = РегистрыСведений.НоменклатураКонтрагентов.СоздатьМенеджерЗаписи();
			мз.Контрагент = Контрагент;
			мз.Номенклатура = Номенклатура;
			мз.НаименованиеНоменклатурыКонтрагента=	Наименование;
			мз.КодНоменклатурыКонтрагента = Код;
			мз.АртикулНоменклатурыКонтрагента = Артикул;
		КонецЕсли;
		
		Попытка
			мз.Записать();
		Исключение
			Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(
			"Внимание!",
			"Не удалось сохранить установить соответствие номенклатуры к номенклатуре контрагента.",
			ОписаниеОшибки());	
		КонецПопытки;
		
	ИначеЕсли стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант = "РегистрСведений_НоменклатураПоставщика" Тогда
		
		СуществующаяНоменклатура= ПолучитьНоменклатуруПоставщика(Контрагент, Наименование, Код, Артикул);
		
		Если СуществующаяНоменклатура <> Номенклатура Тогда
			
			Попытка
				
				Если СуществующаяНоменклатура <> Неопределено Тогда
					Запись= РегистрыСведений.НоменклатураПоставщика.СоздатьМенеджерЗаписи();
					Запись.Номенклатура= СуществующаяНоменклатура;
					Запись.Поставщик= 	 Контрагент;
					Запись.КодНоменклатурыПоставщика= 1;
					Запись.Удалить();
				КонецЕсли;
				
				Запись= РегистрыСведений.НоменклатураПоставщика.СоздатьМенеджерЗаписи();
				Запись.Номенклатура= Номенклатура;
				Запись.Поставщик= 	 Контрагент;
				Запись.КодНоменклатурыПоставщика= 1;
				
				Запись.Наименование= Наименование;
				Запись.Код= 		 Код;
				Запись.Артикул= 	 Артикул;
				
				Запись.Записать();
				
			Исключение
				Получитьформу("Модуль_СообщенияДляПользователей_Форма_ВыводОшибки").ПоказатьОшибку(
				"Внимание!",
				"Не удалось запомнить соответствие номенклатуры поставщика.",
				ОписаниеОшибки());	
			КонецПопытки;
			
		КонецЕсли;
		
	ИначеЕсли стПрофильКонфигурации.ХранениеНоменклатурыПоставщиков.Вариант = "СвойстваОбъектов_Номенклатура" Тогда
		
		НаименованиеСвойства =  ИдентификаторСвойстваНоменклатураКонтрагента_Код(?(Контрагент = Неопределено, "", Контрагент.УникальныйИдентификатор()));
		НоменклатураСтарая = ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект(НаименованиеСвойства, Код);
		Если НЕ ЗначениеЗаполнено(НоменклатураСтарая) Тогда
			НаименованиеСвойства =  ИдентификаторСвойстваНоменклатураКонтрагента_Артикул(?(Контрагент = Неопределено, "", Контрагент.УникальныйИдентификатор()));
			НоменклатураСтарая = ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект(НаименованиеСвойства, Артикул);
			Если НЕ ЗначениеЗаполнено(НоменклатураСтарая) Тогда
				НаименованиеСвойства = ИдентификаторСвойстваНоменклатураКонтрагента_Наименование(?(Контрагент = Неопределено, "", Контрагент.УникальныйИдентификатор()));
				НоменклатураСтарая = ОдинСАдаптер_СвойстваОбъектов_НайтиОбъект(НаименованиеСвойства, Наименование);
			КонецЕсли;
		КонецЕсли;
		
		Если НоменклатураСтарая <> Номенклатура И ЗначениеЗаполнено(НоменклатураСтарая) Тогда
			ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(НоменклатураСтарая, ИдентификаторСвойстваНоменклатураКонтрагента_Код(Контрагент.УникальныйИдентификатор()), "");
			ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(НоменклатураСтарая, ИдентификаторСвойстваНоменклатураКонтрагента_Артикул(Контрагент.УникальныйИдентификатор()), "");
			ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(НоменклатураСтарая, ИдентификаторСвойстваНоменклатураКонтрагента_Наименование(Контрагент.УникальныйИдентификатор()), "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Код) Тогда
			ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(Номенклатура, ИдентификаторСвойстваНоменклатураКонтрагента_Код(Контрагент.УникальныйИдентификатор()), Код);
		КонецЕсли;
		Если ЗначениеЗаполнено(Артикул) Тогда
			ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(Номенклатура, ИдентификаторСвойстваНоменклатураКонтрагента_Артикул(Контрагент.УникальныйИдентификатор()), Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(Наименование) Тогда
			ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеСвойства(Номенклатура, ИдентификаторСвойстваНоменклатураКонтрагента_Наименование(Контрагент.УникальныйИдентификатор()), Наименование);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НоменклатураЯвляетсяУслугой(Номенклатура) Экспорт
	стПрофильКонфигурации = ПолучитьПрофильКонфигурации();
	Если стПрофильКонфигурации.Услуги.Вариант = "ПоРеквизиту" Тогда
		Возврат Номенклатура[стПрофильКонфигурации.Услуги.Реквизит] = стПрофильКонфигурации.Услуги.ЗначениеРеквизита;
	Иначе
		Если ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияТКПТ" Тогда
			ТипНоменклатурыУслуга = Справочники.ТипыНоменклатуры.НайтиПоНаименованию("Услуга");
			Если НЕ ТипНоменклатурыУслуга = Справочники.ТипыНоменклатуры.ПустаяСсылка() Тогда
				Возврат ?(Номенклатура.ТипНоменклатуры = ТипНоменклатурыУслуга, Истина, Ложь);	
			Иначе
				Возврат Ложь;	
			КонецЕсли;
		Иначе
			Возврат ?(Номенклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Услуга, Истина, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьНоменклатуруПоАртикулу(АртикулНоменклатуры) Экспорт
	стПрофильКонфигурации = ПолучитьПрофильКонфигурации();
	Если стПрофильКонфигурации.ЕстьАртикул Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &АртикулНоменклатуры";
		
		Запрос.УстановитьПараметр("АртикулНоменклатуры", АртикулНоменклатуры );
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецФункции


Функция ИННВалидный(Контрагент) Экспорт
	стПрофильКонфигурации = ПолучитьПрофильКонфигурации();
	
	Если стПрофильКонфигурации.ХранениеНастроекПользователей.Вариант = "1С" Тогда
		
		Если ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияДалионУМ"
			ИЛИ ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() = "Модуль_ИнтеграцияАсторТД" Тогда
			Возврат Истина;
		КонецЕсли;
		
		Попытка
			Возврат Вычислить("РегламентированнаяОтчетность.ИННСоответствуетТребованиям(Контрагент.ИНН, Контрагент.ЮрФизЛицо)");
		Исключение 
			Возврат Вычислить("ИННСоответствуетТребованиям(Контрагент.ИНН, Контрагент.ЮрФизЛицо)");
		КонецПопытки;	
		
	ИначеЕсли стПрофильКонфигурации.ХранениеНастроекПользователей.Вариант = "Рарус" Тогда
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПолучитьНомерНаПечатьДиадок(ДокументСсылка) Экспорт
	Возврат Модуль_Интеграция.ПолучитьНомерНаПечатьДиадок(ДокументСсылка);
КонецФункции


Функция ИдентификаторСвойстваНоменклатураКонтрагента_Код(ИдентификаторКонтрагента) Экспорт
	
	Возврат "ДДНомКонтр_Код" + ИдентификаторКонтрагента;
	
КонецФункции	 

Функция ИдентификаторСвойстваНоменклатураКонтрагента_Артикул(ИдентификаторКонтрагента) Экспорт
	
	Возврат "ДДНомКонтр_Арт" + ИдентификаторКонтрагента;
	
КонецФункции

Функция ИдентификаторСвойстваНоменклатураКонтрагента_Наименование(ИдентификаторКонтрагента) Экспорт
	
	Возврат "ДДНомКонтр_Наи" + ИдентификаторКонтрагента;
	
КонецФункции

//} РАБОТА С ПРОФИЛЕМ КОНФИГУРАЦИИ

//{ ФУНКЦИИ ИНТЕГРАЦИИ С ПРИКЛАДНЫМИ РЕШНИЯМИ

Функция ИмяФормыПрикладногорешенияДляИнтеграцииДиадок() Экспорт
	
	Возврат ИмяМодуляИнтеграции;
	
КонецФункции 

Функция ПолучитьТекстПоддерживаемыхКонфигураций() Экспорт
	Возврат 
	"    Бухгалтерия предприятия,
	|    Комплексная автоматизация,
	|    Управление торговлей,
	|    Управление производственным предприятием";
КонецФункции

Функция СоздатьДокументВ1СПоступление(Параметры, стВероятныеПоля, Document, ТабличнаяЧасть = Неопределено, СуммаВключаетНДС = Истина, ВидОперации, ЗаполнениеГТД = Ложь) Экспорт
	
	ДокументОбъект = Модуль_Интеграция.СоздатьДокументПоступлениеТоваровУслуг(	Параметры, 
	стВероятныеПоля, 
	Document, 
	ТабличнаяЧасть, 
	СуммаВключаетНДС, 
	ВидОперации, 
	ЗаполнениеГТД	);
	
	ИспользоватьСервисКонтурМаркировка = КонстантаИспользоватьСервисКонтурМаркировка();
	МенеджерИнтеграции_ЗагрузитьКодыМаркировки(ДокументОбъект, ТабличнаяЧасть, ИспользоватьСервисКонтурМаркировка);
	
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("Document"			, Document);
	ПараметрыПМ.Вставить("ДокументОбъект"	, ДокументОбъект);
	Если ЭтоФормализованныйДокумент(Document.type) Тогда
		ПараметрыПМ.Вставить("СтруктураКонтента", ПротоКонтентДокумента(Document));	
	Иначе
		ПараметрыПМ.Вставить("СтруктураКонтента", Неопределено);
	КонецЕсли;
	
	ОбработкаСобытияПодключаемогоМодуля("ПослеЗаполненияНовогоДокументаПоступления", ПараметрыПМ);
	
	Если ИмяМодуляИнтеграции = "Модуль_ИнтеграцияАльфаАвто41" Тогда
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ДокументОбъект.ОбменДанными.Загрузка = Ложь;
		
	КонецЕсли;
	
	ФормаДокумента = ДокументОбъект.ПолучитьФорму();
	ФормаДокумента.Модифицированность = Истина;
	ФормаДокумента.ОткрытьМодально();
	Если ФормаДокумента.Модифицированность() Тогда
		Результат = Неопределено;
	Иначе
		Результат = ДокументОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция СоздатьДокументВ1СВозврат(параметры, стВероятныеПоля, ЭДОбъект) Экспорт
	ДокументОбъект = Модуль_Интеграция.СоздатьДокументВозвратТоваровОтПокупателя(параметры, стВероятныеПоля, ЭДОбъект);
	ДокументОбъект.ПолучитьФорму().ОткрытьМодально();
	Если ДокументОбъект.Модифицированность() = Ложь Тогда
		Возврат ДокументОбъект.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура УстановитьДоговорВСчетеФактуреДляДиадок(СчетФактура) Экспорт 
	Модуль_Интеграция.УстановитьДоговорВСчетеФактуреДляДиадокПР(СчетФактура);
КонецПроцедуры

Функция  ПолучитьСуммуДокументаВВалютеРегламентированногоУчетаДиадок(ДокументССылка) Экспорт 
	Возврат  Модуль_Интеграция.ПолучитьСуммуДокументаВВалютеРегламентированногоУчета_Диадок(ДокументССылка);
КонецФункции	

Функция ЭтоРТУ(СсылкаНаОбъект)   Экспорт
	Возврат  Модуль_Интеграция.ЭтоРТУ_ДД(СсылкаНаОбъект);
КонецФункции 

// Возвращает признак применения Федерального Закона 
// который вводит понятие прослеживаемости для определенных групп товаров
// Параметры
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ применяется
//           Ложь   - ФЗ не применяется
Функция ИспользуетсяУчетПрослеживаемыхТоваров(Дата) Экспорт
	
	МенеджерИнтеграции	 = МодульМенеджерИнтеграции();
	Результат			 = МенеджерИнтеграции.ИспользуетсяУчетПрослеживаемыхТоваров(Дата);
	
	Возврат Результат;
	
КонецФункции

//} ФУНКЦИИ ИНТЕГРАЦИИ С ПРИКЛАДНЫМИ РЕШНИЯМИ

//{ РАБОТА С "ВНЕШНИМИ" КОМПОНЕНТАМИ

Функция ВнешнийАдаптер_ПолучитьСобытияИзмененийСтатусовДокументов(ОрганизацияСсылка, ИдентификаторПоследнейПорции = Неопределено) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ВнешнийАдаптер").ПолучитьСобытияИзмененийСтатусовДокументов(ОрганизацияСсылка, ИдентификаторПоследнейПорции);
КонецФункции

Функция ВнешнийАдаптер_ПолучитьИдентификаторПоследнейПорции(ОрганизацияСсылка) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ВнешнийАдаптер").ПолучитьИдентификаторПоследнейПорции(ОрганизацияСсылка);
КонецФункции

Процедура ВнешнийАдаптер_ЗагрузитьФайлыИзДД(Организация = Неопределено) Экспорт
	ПолучитьМодульПрог("Модуль_ВнешнийАдаптер").ЗагрузитьФайлыИзДДВ1С(Организация);
КонецПроцедуры

//} РАБОТА С "ВНЕШНИМИ" КОМПОНЕНТАМИ

//{ КОНСТАНТЫ

Функция ВернутьСписокОрганизацийТребующихНомерЗаказа() Экспорт
	СписокОрганизаций = Новый списокЗначений;
	СписокОрганизаций.Добавить("53717c42b4f74fd384330094aeb0f15a@diadoc.ru");
	СписокОрганизаций.Добавить("ca7fe457542f467987df60bb9997208f@diadoc.ru");
	СписокОрганизаций.Добавить("481f205217df46d9bc21b0d8f02b6f2b@diadoc.ru");
	
	Возврат СписокОрганизаций;
	
КонецФункции	

Функция ВернутьСписокОрганизацийНеТребующихСверкиПоНомеру() Экспорт
	
	СписокОрганизаций =	Новый СписокЗначений;
	СписокОрганизаций.Добавить("7c25b4816a974cca9b33884611b38cda@diadoc.ru");
	
	Возврат СписокОрганизаций;
	
КонецФункции

Функция ВернутьСписокОрганизацийНеТребующихВизуализацииДопПоля() Экспорт
	
	СписокОрганизаций = Новый списокЗначений;
	СписокОрганизаций.Добавить("c19b1b8c75ab4ca3a2ab8ea3771631ab@diadoc.ru");
	
	Возврат СписокОрганизаций;
	
КонецФункции

Функция ОтправлятьВПФБезРТУ() Экспорт
	Возврат Ложь;		
КонецФункции 

Функция ФормироватьСфНаОснованииРТУ() Экспорт
	Возврат Ложь;
	//Возврат Истина;
КонецФункции 	

Функция ИдентификаторКонстантыРежимСовместимостиФорматов155и820()
	Возврат "РежимСовместимостиФорматов155и820";
КонецФункции

Функция КонстантаРежимСовместимостиФорматов155и820() Экспорт
	
	ИдентификаторКонстанты = ИдентификаторКонстантыРежимСовместимостиФорматов155и820();
	Результат = ЭДО_Кэш_Прочитать(ИдентификаторКонстанты);
	
	Если Результат = Неопределено Тогда
		
		ЗначениеСтрокой = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты(ИдентификаторКонстанты, "Нет");
		
		Результат = НРег(ЗначениеСтрокой) = НРег("Да");
		
		ЭДО_Кэш_Поместить(ИдентификаторКонстанты, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьКонстантуРежимСовместимостиФорматов155и820(Значение) Экспорт
	
	ЗначениеСтрокой = ?(Значение = Истина, "Да", "Нет");
	
	ИдентификаторКонстанты = ИдентификаторКонстантыРежимСовместимостиФорматов155и820();
	
	ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеКонстанты(ИдентификаторКонстанты, ЗначениеСтрокой);
	
	ЭДО_Кэш_Поместить(ИдентификаторКонстанты, Значение);
	
КонецПроцедуры

// Устанавливает в константу ДиадокСохраненнаяВерсияМодуля версию текущей обработки.
Процедура ЗаписатьКонстантуДиадокСохраненнаяВерсияМодуля() Экспорт
	
	Идентификатор = Модуль_Данные1С_СвязиОбъектов().ИдентификаторСвойстваДиадокСохраненнаяВерсияМодуля();
	
	ОдинСАдаптер_СвойстваОбъектов_УстановитьЗначениеКонстанты(Идентификатор, ВерсияОбработки());		
	
КонецПроцедуры	

// Номер версии последнего запущенного модуля.
// 
// Возвращаемое значение:
//  Строка - версия последнего запущенного модуля.
Функция КонстантаДиадокСохраненнаяВерсияМодуля() Экспорт
	
	Идентификатор = Модуль_Данные1С_СвязиОбъектов().ИдентификаторСвойстваДиадокСохраненнаяВерсияМодуля();
	
	ЗначениеСтрокой = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты(Идентификатор, "");
	
	Возврат ЗначениеСтрокой;
	
КонецФункции

Функция КонстантаДиадокПодключаемыйМодульПуть() Экспорт
	
	Идентификатор = Модуль_Данные1С_СвязиОбъектов().ИдентификаторСвойстваДиадокПодключаемыйМодульПуть();
	
	ЗначениеСтрокой = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты(Идентификатор, "");
	
	Возврат ЗначениеСтрокой;
	
КонецФункции

Функция КонстантаДиадокПодключаемыйМодульТип() Экспорт
	
	Идентификатор = Модуль_Данные1С_СвязиОбъектов().ИдентификаторСвойстваДиадокПодключаемыйМодульТип();
	
	ЗначениеСтрокой = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты(Идентификатор, "");
	
	Возврат ЗначениеСтрокой;
	
КонецФункции

Функция КонстантаДиадокПодключаемыйМодульИмяОбработки() Экспорт
	
	Идентификатор = Модуль_Данные1С_СвязиОбъектов().ИдентификаторСвойстваДиадокПодключаемыйМодульИмяОбработки();
	
	ЗначениеСтрокой = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты(Идентификатор, "");
	
	Возврат ЗначениеСтрокой;
	
КонецФункции

Функция КонстантаИспользоватьСервисКонтурМаркировка() Экспорт
	
	НаименованиеКонстанты = ИдентификаторСвойстваДиадокИспользоватьСервисКонтурМаркировка();
	
	Результат = ЭДО_Кэш_Прочитать(НаименованиеКонстанты);
	
	Если Результат = Неопределено Тогда
		
		ЗначениеСтрокой = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты(НаименованиеКонстанты, "Нет");
		
		Результат = НРег(ЗначениеСтрокой) = НРег("Да");
		
		ЭДО_Кэш_Поместить(НаименованиеКонстанты, Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} КОНСТАНТЫ

//{ ПОДКЛЮЧАЕМЫЙ МОДУЛЬ

Функция ПолучитьСсылкуНаПодключаемыйМодуль() Экспорт
	
	ИмяСправочника = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты("ДиадокПодключаемыйМодульВидСправочника");
	GUIDСсылка	   = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты("ДиадокПодключаемыйМодульGUID");
	
	Если ЗначениеЗаполнено(ИмяСправочника) И ЗначениеЗаполнено(GUIDСсылка) Тогда
		
		НовыйGUID = Новый УникальныйИдентификатор(GUIDСсылка);
		СсылкаМодуль = Справочники[ИмяСправочника].ПолучитьСсылку(НовыйGUID);
		
		Если ЗначениеЗаполнено(СсылкаМодуль) Тогда
			Возврат СсылкаМодуль;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ИнициализироватьВнешнийПодключаемыйМодуль() Экспорт
	
	Если ИспользуетсяПодключаемыйМодуль = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ВнешнийМодуль = Неопределено Тогда
		Возврат ВнешнийМодуль;
	КонецЕсли;
	
	ВнешнийМодуль 					= Неопределено;
	ИспользуетсяПодключаемыйМодуль 	= Ложь;
	
	ПодключаемыйМодульТип = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты("ДиадокПодключаемыйМодульТип");                
	
	Если ЗначениеЗаполнено(ПодключаемыйМодульТип) И НЕ ПодключаемыйМодульТип = "Нет" Тогда
		
		Если ПодключаемыйМодульТип = "Диск" Тогда
			
			ПодключаемыйМодульПуть = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты("ДиадокПодключаемыйМодульПуть");
			Если ЗначениеЗаполнено(ПодключаемыйМодульПуть) Тогда
				
				// BSLLS:SetPrivilegedMode-off
				УстановитьПривилегированныйРежим(Истина);
				// BSLLS:SetPrivilegedMode-on
				
				// BSLLS:UsingExternalCodeTools-off
				ВнешнийМодуль = ВнешниеОбработки.Создать(СокрЛП(ПодключаемыйМодульПуть), Ложь); //в небезопасном режиме, т.к. ПМ может содержать небезопасный код
				// BSLLS:UsingExternalCodeTools-on
				
				ВнешнийМодуль.Инициализировать(ЭтотОбъект);
				ИспользуетсяПодключаемыйМодуль = Истина;
			КонецЕсли;	
			
		ИначеЕсли ПодключаемыйМодульТип = "1С" Тогда
			
			Модуль = ПолучитьСсылкуНаПодключаемыйМодуль();
			Если ЗначениеЗаполнено(Модуль) Тогда
				МетаданныеСправочника = Модуль.Метаданные();
				ИмяРеквизита = "";
				ИмяТиповогоРеквизита = "";
				
				Если ИмяРеквизита = "" Тогда //вдруг его переименуют
					ИмяРеквизита = "";
					Для Каждого Реквизит Из МетаданныеСправочника.Реквизиты Цикл
						Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
							ИмяРеквизита = Реквизит.Имя;
							//будем брать последний реквизит такого типа т.к. это более вероятно, если найдем наш - гуд
							Если ИмяТиповогоРеквизита = Реквизит.Имя Тогда
								Прервать;  //найден ожидаемый реквизит нужного типа
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
					МодульОбъект 	= Модуль.ПолучитьОбъект();
					ИмяФайла 		= ПолучитьИмяВременногоФайла();
					ДвоичныеДанные 	= МодульОбъект[ИмяРеквизита].Получить();
					ДвоичныеДанные.Записать(ИмяФайла);
					
					// BSLLS:UsingExternalCodeTools-off
					ВнешнийМодуль = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
					// BSLLS:UsingExternalCodeTools-on
					
					ВнешнийМодуль.Инициализировать(ЭтотОбъект);
					ИспользуетсяПодключаемыйМодуль = Истина;
					УдалитьФайлы(ИмяФайла);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ПодключаемыйМодульТип = "Конфигурация" Тогда
			
			ПодключаемыйМодульИмяОбработки = ОдинСАдаптер_СвойстваОбъектов_ПолучитьЗначениеКонстанты("ДиадокПодключаемыйМодульИмяОбработки");
			Если ЗначениеЗаполнено(ПодключаемыйМодульИмяОбработки) Тогда
				ВнешнийМодуль = Обработки[ПодключаемыйМодульИмяОбработки].Создать();
				ВнешнийМодуль.Инициализировать(ЭтотОбъект);
				ИспользуетсяПодключаемыйМодуль = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ВнешнийМодуль;
	
КонецФункции

//	ИмяСобытия 				     - 	Тип: Строка.
//									Идентификатор события, которое необходимо обработать
//
//	ПараметрыПодключаемогоМодуля - 	Тип: Структура. Необязательный
//									Параметры, которые будут доступны подключаемому модулю.
//
//	СтандартнаяОбработкаДиадок   - 	Тип: Булево. Необязательный
//									Передается признак выполнения стандартной обработки события. 
//									Если в теле процедуры указать ему значение Ложь, стандартная обработка события производиться не будет.
Функция ОбработкаСобытияПодключаемогоМодуля(ИмяСобытия, ПараметрыПодключаемогоМодуля = Неопределено, СтандартнаяОбработкаДиадок = Неопределено) Экспорт
	
	Если ИспользуетсяПодключаемыйМодуль = Истина Тогда
		Попытка
			РезультатОбработки = ВнешнийМодуль.ОбработатьСобытиеДиадок(ИмяСобытия, ПараметрыПодключаемогоМодуля, СтандартнаяОбработкаДиадок);
			Возврат РезультатОбработки;
		Исключение
			ТекстОшибки = "Ошибка при обработке события """ + ИмяСобытия + """ подключаемого модуля. " + Символы.ПС + ОписаниеОшибки();
			ВызватьИсключение(ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//} ПОДКЛЮЧАЕМЫЙ МОДУЛЬ

Функция ПолучитьВидКлиента()
	
	видКлиента = "не определен";	
	
	#Если ТонкийКлиент Тогда
		ВидКлиента =	"Тонкий клиент";
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
		ВидКлиента =	"Толстый клиент обычное приложение";
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		ВидКлиента =	"Толстый клиент управляемые формы";
	#ИначеЕсли ВебКлиент Тогда
		ВидКлиента =	"Веб клиент";
	#ИначеЕсли НаСервере Тогда
		ВидКлиента =	"Сервер";
	#ИначеЕсли ВнешнееСоединение Тогда
		ВидКлиента =	"Внешнее соединение";
	#КонецЕсли
	
	Возврат ВидКлиента;
	
КонецФункции

Функция ПолучитьИнформациюДляТехподдержки() Экспорт 
	
	Результат = Новый Структура("ВерсияОбработки, ВерсияКомпоненты, ФайлКомпоненты, ВерсияОС, ТипПлатформы, ВерсияПлатформы, ВидКлиента, СтрокаСоединения, МодульИнтеграции, ИспользованиеПодключаемогоМодуля, ИнформацияОКонфигурации");
	
	Результат.ВерсияОбработки  = ВерсияОбработки();
	Результат.ВерсияКомпоненты = ВерсияВнешнейКомпоненты();
	
	ФайлКомпоненты = ОбщиеПараметры.ПутьКФайлуКомпоненты;
	Если Не ЗначениеЗаполнено(ФайлКомпоненты) Тогда
		ФайлКомпоненты = Модуль_РаботаССерверомДиадок.ПутьКФайлуКомпонентыДиадока(Результат.ВерсияКомпоненты);
	КонецЕсли;
	
	Результат.ФайлКомпоненты = ФайлКомпоненты;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Результат.ВерсияОС = СистемнаяИнформация.ВерсияОС;
	Результат.ТипПлатформы = СистемнаяИнформация.ТипПлатформы;
	Результат.ВерсияПлатформы = ВерсияПриложения();
	Результат.ВидКлиента =  ПолучитьВидКлиента();
	Результат.СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Результат.МодульИнтеграции = ПолучитьИмяМодуляИнтеграции();
	Результат.ИспользованиеПодключаемогоМодуля = ?(ИспользуетсяПодключаемыйМодуль = Истина, "Используется", "Не используется");
	Результат.ИнформацияОКонфигурации = Метаданные.ПодробнаяИнформация + " (" + Метаданные.Версия + ")";
	
	
	Возврат Результат;
	
КонецФункции	

Функция Диадок_ПолучитьВТ(МенеджерВремТаб, ИмяВремтаб = "", Порядок = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаб;
	Запрос.Текст =
	"ВЫБРАТЬ
	| *
	|ИЗ
	| ВремТаб КАК ВремТаб
	|
	|УПОРЯДОЧИТЬ ПО Порядок";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВремТаб", ИмяВремтаб); 
	Если Порядок = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УПОРЯДОЧИТЬ ПО Порядок", "");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Порядок", Порядок);
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

Процедура УстановитьРежимСверткиЭлементаУправления(ЭлементУправления, РежимСвертки, ОбновитьПривязки = Истина) Экспорт
	
	#Если Клиент Тогда
		
		Если ОбновитьПривязки Тогда
			Привязки = ПривязкиЭлементаУправления(ЭлементУправления);
		КонецЕсли;
		
		Если ЭлементУправления.Свертка <> РежимСвертки Тогда
			ЭлементУправления.Свертка = РежимСвертки;
		КонецЕсли;
		
		// Обновляем привязки, для того чтобы избежать ошибки расположения элементов на форме (DDSUPPORT-14526).
		Если ОбновитьПривязки Тогда
			ЭлементУправления.УстановитьПривязку(ГраницаЭлементаУправления.Верх,  Привязки.Верх.ПервыйЭлемент,  Привязки.Верх.ГраницаПервогоЭлемента,  Привязки.Верх.ВторойЭлемент,  Привязки.Верх.ГраницаВторогоЭлемента);
			ЭлементУправления.УстановитьПривязку(ГраницаЭлементаУправления.Низ,   Привязки.Низ.ПервыйЭлемент,   Привязки.Низ.ГраницаПервогоЭлемента,   Привязки.Низ.ВторойЭлемент,   Привязки.Низ.ГраницаВторогоЭлемента);
			ЭлементУправления.УстановитьПривязку(ГраницаЭлементаУправления.Лево,  Привязки.Лево.ПервыйЭлемент,  Привязки.Лево.ГраницаПервогоЭлемента,  Привязки.Лево.ВторойЭлемент,  Привязки.Лево.ГраницаВторогоЭлемента);
			ЭлементУправления.УстановитьПривязку(ГраницаЭлементаУправления.Право, Привязки.Право.ПервыйЭлемент, Привязки.Право.ГраницаПервогоЭлемента, Привязки.Право.ВторойЭлемент, Привязки.Право.ГраницаВторогоЭлемента);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Функция ПривязкиЭлементаУправления(ЭлементУправления) Экспорт
	
	#Если Клиент Тогда
		
		Привязки = Новый Структура;
		Привязки.Вставить("Верх" , Новый Структура("ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента"));
		Привязки.Вставить("Низ"	 , Новый Структура("ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента"));
		Привязки.Вставить("Лево" , Новый Структура("ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента"));
		Привязки.Вставить("Право", Новый Структура("ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента"));
		
		ЭлементУправления.ПолучитьПривязку(ГраницаЭлементаУправления.Верх,  Привязки.Верх.ПервыйЭлемент,  Привязки.Верх.ГраницаПервогоЭлемента,  Привязки.Верх.ВторойЭлемент,  Привязки.Верх.ГраницаВторогоЭлемента);
		ЭлементУправления.ПолучитьПривязку(ГраницаЭлементаУправления.Низ, 	Привязки.Низ.ПервыйЭлемент,   Привязки.Низ.ГраницаПервогоЭлемента,   Привязки.Низ.ВторойЭлемент,   Привязки.Низ.ГраницаВторогоЭлемента);
		ЭлементУправления.ПолучитьПривязку(ГраницаЭлементаУправления.Лево,  Привязки.Лево.ПервыйЭлемент,  Привязки.Лево.ГраницаПервогоЭлемента,  Привязки.Лево.ВторойЭлемент,  Привязки.Лево.ГраницаВторогоЭлемента);
		ЭлементУправления.ПолучитьПривязку(ГраницаЭлементаУправления.Право, Привязки.Право.ПервыйЭлемент, Привязки.Право.ГраницаПервогоЭлемента, Привязки.Право.ВторойЭлемент, Привязки.Право.ГраницаВторогоЭлемента);
		
		Возврат Привязки;
		
	#КонецЕсли
	
КонецФункции

Процедура ОбновитьСвойствоЭлементаФормы(Элемент, СвойствоЭлемента, ЗначениеСвойства) Экспорт
	
	Если Элемент[СвойствоЭлемента] <> ЗначениеСвойства Тогда
		Элемент[СвойствоЭлемента] = ЗначениеСвойства;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСвойствоЭлементаФормыАвтоОтметкаНезаполненного(Элемент, НоваяАвтоОтметкаНезаполненного) Экспорт
	
	Если НоваяАвтоОтметкаНезаполненного = Ложь Тогда
		ОбновитьСвойствоЭлементаФормы(Элемент, "АвтоОтметкаНезаполненного", Ложь);
		ОбновитьСвойствоЭлементаФормы(Элемент, "ОтметкаНезаполненного"    , Ложь);
	Иначе
		ОбновитьСвойствоЭлементаФормы(Элемент, "АвтоОтметкаНезаполненного", Истина);
		ОбновитьСвойствоЭлементаФормы(Элемент, "ОтметкаНезаполненного"    , НЕ ЗначениеЗаполнено(Элемент.Значение));
	КонецЕсли;
	
КонецПроцедуры

//{ УСТАРЕВШИЕ

// Устарела в 5.28.01. Следует использовать метод НастройкиФорматаОтправкиДокументов
Функция ФорматыДокументовНаОтправку() Экспорт
	
	Возврат НастройкиФорматаОтправкиДокументов();
	
КонецФункции

// Устарела в 5.28.01. Следует использовать метод "Преобразование_МассивВСтроку" 
//с параметрами: "МассивСтрок", "Разделитель", "ПропускатьПустыеЗначения"
Функция МассивВСтроку(Массив, СимволРазделителя = ",", ПропускатьПустыеЗначения = Ложь) Экспорт
	
	Возврат Преобразование_МассивВСтроку(Массив, СимволРазделителя, ПропускатьПустыеЗначения);
	
КонецФункции

// Устарела в 5.28.01. Следует использовать метод "Преобразование_СтрокуВМассивПодстрок"
//с параметрами: "Строка", "РазделительПодстрок", "ПропускатьПустыеЗначения", "ПрименятьСокрЛП"
Функция ПреобразоватьСтрокуВМассивПодстрок(Знач Строка, Разделитель= ",", ПропускатьПустыеСтроки= Ложь, ПрименятьСокрЛП= Ложь) Экспорт
	
	Возврат Преобразование_СтрокуВМассивПодстрок(Строка, Разделитель, ПропускатьПустыеСтроки, ПрименятьСокрЛП); 
	
КонецФункции

// Устарела в 5.35.01. Следует использовать метод "ЭтоСчетФактураИсправленный"
Функция ЭтоСчетФактураИсправленная(Type) Экспорт
	
	Результат = ЭтоСчетФактураИсправленный(Type);
	
	Возврат Результат; 
	
КонецФункции

// Устарела в 5.35.01. Следует использовать метод "ЭтоНеформализованныйБезМетаданных"
Функция ЭтоНеформализованныйДокументБезМетаданных(Document) Экспорт
	
	Результат = ЭтоНеформализованныйБезМетаданных(Document.Type);
	
	Возврат Результат;
	
КонецФункции

//} УСТАРЕВШИЕ


//{ Валидация - рефакторинг

Функция ДобавитьОшибкуВалидации(СписокОшибок = Неопределено, ТекстОшибки, СсылкаДляИсправления = Неопределено) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.ДобавитьОшибкуВалидации(СписокОшибок, ТекстОшибки, СсылкаДляИсправления);
	Возврат Результат;
	
КонецФункции

Функция ДобавитьГруппуОшибокВалидации(СписокОшибок, СписокДобавляемыхОшибок, ШаблонЗаголовка, СсылкаДляИсправления = Неопределено) Экспорт
	
	ГенерацияXML = МодульГенерацияXML();
	Результат = ГенерацияXML.ДобавитьГруппуОшибокВалидации(СписокОшибок, СписокДобавляемыхОшибок, ШаблонЗаголовка, СсылкаДляИсправления);
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьМассивОшибокВалидации(СписокОшибок1, СписокОшибок2)
	
	ГенерацияXML = МодульГенерацияXML();
	ГенерацияXML.ДополнитьМассивОшибокВалидации(СписокОшибок1, СписокОшибок2);
	
КонецПроцедуры

// Преобразует текст вида
//  "СПРАВОЧНИК.ДОГОВОРЫКОНТРАГЕНТОВ:35C3C512-6B05-11E9-9239-D46D6D51F7B5"
//  в ссылку на элемент справочника/документа
//  Если тест не указывает на элемент данных, вернет Неопределено
//
// Параметры:
//  ТекстГиперссылки - Строка - строка и GUID
// 
// Возвращаемое значение:
//  ДокументСсылка, СправочникСсылка - Ссылка на элемент данных
//
Функция СсылкаНаЭлементДанныхИзГиперссылки(Знач ТекстГиперссылки) Экспорт
	
	Результат = Неопределено;
	
	ВидМетаданных = Неопределено;
	
	Если Лев(ТекстГиперссылки, 11) = "СПРАВОЧНИК." Тогда
		ГруппаМетаданных = Справочники;
		ТекстГиперссылки = Сред(ТекстГиперссылки, 12);
	ИначеЕсли Лев(ТекстГиперссылки, 9) = "ДОКУМЕНТ." Тогда
		ГруппаМетаданных = Документы;
		ТекстГиперссылки = Сред(ТекстГиперссылки, 10);
	КонецЕсли;	
	
	Если ГруппаМетаданных <> Неопределено Тогда
		
		ПодгруппаМетаданных = Лев(ТекстГиперссылки, СтрДлина(ТекстГиперссылки) - 37);  // конкретный вид справочника/документа.
		ГуидСтрокой = Прав(ТекстГиперссылки, 36);
		Гуид = Новый УникальныйИдентификатор(ГуидСтрокой);
		
		Результат = ГруппаМетаданных[ПодгруппаМетаданных].ПолучитьСсылку(Гуид);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} Валидация - рефакторинг

//{ ОБЕРТКИ

Функция Модуль_Данные1С_СвязиОбъектов() Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_Данные1С_СвязиОбъектов");
	
	Возврат Результат;
	
КонецФункции

Функция Модуль_Логика_ПоведениеФорм() Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_Логика_ПоведениеФорм");
	
	Возврат Результат;
	
КонецФункции

Функция Модуль_Логика_СверкаДанных() Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_Логика_СверкаДанных");
	
	Возврат Результат;
	
КонецФункции

Функция Модуль_РаботаССерверомДиадок() Экспорт
	
	Если Модуль_РаботаССерверомДиадок = Неопределено Тогда
		Модуль_РаботаССерверомДиадок = ПолучитьМодульПрог("Модуль_РаботаССерверомДиадок");	
	КонецЕсли;
	
	Возврат Модуль_РаботаССерверомДиадок;
	
КонецФункции

Функция Модуль_ВнешнийАдаптер() Экспорт
	
	Результат = ПолучитьМодульПрог("Модуль_ВнешнийАдаптер");
	
	Возврат Результат;
	
КонецФункции

Функция Форма_Диадок_ЭД() Экспорт 
	
	Результат = ПолучитьМодульПрог("Форма_Диадок_ЭД");
	
	Возврат Результат;
	
КонецФункции

Функция Библиотека_ГенерацияXML() Экспорт
	
	Результат = МодульГенерацияXML();
	
	Возврат Результат;
	
КонецФункции

Функция Библиотека_УведомленияПользователей() Экспорт 
	
	Результат = ПолучитьМодульПрог("УведомленияПользователей");
	
	Возврат Результат;
	
КонецФункции

// Дополняет таблицу значений-приемник данными из таблицы значений-источник.
//
// Параметры:
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую будут добавлены строки из таблицы-источника.
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой будут браться строки для заполнения;
//  
Процедура ДополнитьТаблицу(ТаблицаПриемник, ТаблицаИсточник) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Новый_QuantityDiff(ПолноеИмя = "", Конструкторы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("QuantityInc");
	Результат.Вставить("QuantityDec");
	Результат.Вставить("OriginalQuantity");
	Результат.Вставить("CorrectedQuantity");
	
	Возврат Результат;
	
КонецФункции

//} ОБЕРТКИ

ИнициализироватьПеременныеМодуля();
