// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_ТиповойМодуль;
Перем НеИспользуется_РежимУправляемыхФорм;

Перем Ядро; // ОбработкаОбъект.КонтурДиадокЯдро
Перем ОсновнойМодуль; // ОбработкаОбъект.КонтурДиадокВызовыПМ
Перем ГенерацияXML; // ОбработкаОбъект.КонтурДиадокГенерацияXML
Перем ПечатныеФормыЛок; // ОбработкаОбъект.КонтурДиадокПечатныеФормы
Перем РаботаСМаркировкойЛок; // ОбработкаОбъект.КонтурДиадокРаботаСМаркировкой

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира
Перем СоответствиеПрайсЛистовПоставщиков;
Перем РедакцияАльфаАвто;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормыЛок = Модуль_ПечатныеФормы;
	РаботаСМаркировкойЛок = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормыЛок = Неопределено;
	РаботаСМаркировкойЛок = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html
	
	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		Возврат ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);
		
		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
		
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);		
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПриОткрытииФормы" Тогда
		
		Возврат ПриОткрытииФормы(Параметры);

	ИначеЕсли ИмяСобытия = "ПриПолученииДанныхТабличнойЧасти" Тогда
		
		Возврат ПриПолученииДанныхТабличнойЧасти(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции

///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd970");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd970",	Неопределено,	"ID_СчетФактура");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd970",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd970",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd970",	"ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd970",	"СЧФДОП",		"ID_УПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"СЧФ",			"ID_УПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"ДОП",			"ID_УПД_ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)", 		"ProformaInvoice", 						"");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ЗаказНаряд",			"Заказ-наряд", 						"Nonformalized",						"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_Акт",					"Акт", 								"Nonformalized",						"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_Квитанция",			"Квитанция", 						"Nonformalized",						"");

	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	
	КатегорииПакетов = КатегорииПакетов();

	НужнаВТДокументыБезНДС = Ложь;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ВидПакетаID		= ОписаниеВидаПакета.ID;
		КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
		
		Если 		ВидПакетаID = "ID_ОсновнойПакет" 
				ИЛИ ВидПакетаID = "ID_УПД"
				ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Ложь);
			
		ИначеЕсли 	ВидПакетаID = "ID_УКД" 
				ИЛИ ВидПакетаID = "ID_УКД_раздельно"
				ИЛИ ВидПакетаID = "ID_КСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Ложь);
			
		ИначеЕсли	ВидПакетаID = "ID_УПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Ложь);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД" 
				ИЛИ ВидПакетаID = "ID_ИУПД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУКД" 
				ИЛИ ВидПакетаID = "ID_ИУКД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИКСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_ИСФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" 
				ИЛИ ВидПакетаID = "ID_УПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_ИУПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_УКД_БезНДС" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
			
			НужнаВТДокументыБезНДС = Истина;
			
		ИначеЕсли	ВидПакетаID = "ID_Счет" 
				ИЛИ ВидПакетаID = "ID_СчетФормализованный" Тогда
		
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
			
        ИначеЕсли	ВидПакетаID = "ID_АктСверки" Тогда
						
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
			
		ИначеЕсли	ВидПакетаID = "ID_ЗаказНаряды" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ЗаказНаряды(ОписаниеВидаПакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;
	
	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		Основание = СтрокаСписка.Документ.ДокументОснование;
		
		Если МожноСформироватьПередаточныйДокумент(Основание) Тогда
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Основание, "ID_УПД_ДОП");
		КонецЕсли;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаСписка.Документ, "ID_СчетФактура");
		
		Основание = СтрокаСписка.Документ.ДокументОснование;
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Основание);
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_ДОП");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_ДИС");
		
	// Исправления первичных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
		Основание = СтрокаСписка.Документ.ДокументОснование;
		
		Если МожноСформироватьПередаточныйДокумент(Основание) Тогда
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Основание, "ID_УПД_ДОП");
		КонецЕсли;	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Корректировочные документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_КСЧФ");
		
		Основание = СтрокаСписка.Документ.ДокументОснование;
		
		Если МожноСформироватьПередаточныйДокумент(Основание) Тогда
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Основание, "ID_УКД_ДИС");
		КонецЕсли;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_КСФ");
		
	// Исправления корректировочных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД_КСЧФ");
		
		Основание = СтрокаСписка.Документ.ДокументОснование;
		
		Если МожноСформироватьПередаточныйДокумент(Основание) Тогда
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Основание, "ID_ИУКД_ДИС");
		КонецЕсли;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИКСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИКСФ");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
	// Исправления СФ на аванс
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Прочие документы
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");		
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ЗаказНаряды" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ЗаказНаряд");
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Акт");
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Квитанция");
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html
	
	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника		= Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый)
		Или ОсновнойМодуль.ТипСоответствуетКонтентуУКД(ВидДокументаРазвернутый) Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		ДополнительныеПараметры = Новый Структура;
		
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
		
		ДополнительныеПараметры.Вставить("ПараметрыСогласования", Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"		, ДанныеСотрудника); // Графа 10 (РабОргПрод)
		
		ДополнительныеПараметры.Вставить("ФИОПодписанта", " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД", ФункцияУПД);
		ДополнительныеПараметры.Вставить("FormatVersion", FormatVersion);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" Тогда
		
		ДополнительныеПараметры = Неопределено;
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(
			НеИспользуется_ТиповойМодуль,
			НеИспользуется_РежимУправляемыхФорм,
			Документ1С, "АктСверки",
			ДополнительныеПараметры
		);
		
		Результат.Метаданные.DocumentNumber = ДанныеПечатнойФормы.Номер;
		Результат.Метаданные.DocumentDate = ДанныеПечатнойФормы.Дата;
		Результат.Метаданные.FileName = ДанныеПечатнойФормы.ИмяФайла;
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
	ИначеЕсли ID = "ID_Счет" Тогда
		
		ТабДокумент = СчетаНаОплату_ПечатнаяФорма1С(Документ1С);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
		ИмяФайла = "Счет № " + Документ1С.Номер + " от " + Формат(Документ1С.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
		НомерДокумента = ПредставлениеНомера(Документ1С);
		
		Результат.Метаданные.DocumentDate	= Документ1С.Дата;
		Результат.Метаданные.DocumentNumber	= НомерДокумента;
		Результат.Метаданные.FileName		= ИмяФайла;
		
		Если TypeNamedId = "ProformaInvoice" Тогда
			Результат.Метаданные.TotalSum = Документ1С.СуммаДокумента;
			Результат.Метаданные.TotalVat = СуммаНДССчетаНаОплату(Документ1С);
		КонецЕсли;
		
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
				
		УдалитьФайлы(ИмяВременногоФайла);
		
	ИначеЕсли ID = "ID_ЗаказНаряд" Тогда
		
		ТабДокумент = Документ1С.ПолучитьОбъект().ПечатьЗаказНаряд(Новый ТабличныйДокумент);
		
		Если ТабДокумент <> Неопределено Тогда
			
			УстановитьПоляТабличногоДокумента(ТабДокумент);
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
			ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			ИмяФайла = "Заказ-наряд № " + Документ1С.Номер + " от " + Формат(Документ1С.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
			НомерДокумента = ПредставлениеНомера(Документ1С);
			
			Результат.Метаданные.DocumentDate	= Документ1С.Дата;
			Результат.Метаданные.DocumentNumber	= НомерДокумента;
			Результат.Метаданные.FileName		= ИмяФайла;
			
			Результат.ЗапрашиватьОтветнуюПодпись = Истина;
			Результат.ДвоичныеДанные			= Новый ДвоичныеДанные(ИмяВременногоФайла);
			
			УдалитьФайлы(ИмяВременногоФайла);
			
		КонецЕсли;
		
	ИначеЕсли ID = "ID_Акт" Тогда
		
		ТабДокумент = Документ1С.ПолучитьОбъект().ПечатьАктОбОказанииУслугУслугиИМатериалы(Новый ТабличныйДокумент);
		
		УстановитьПоляТабличногоДокумента(ТабДокумент);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
		ИмяФайла = "Акт № " + Документ1С.Номер + " от " + Формат(Документ1С.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
		НомерДокумента = ПредставлениеНомера(Документ1С);
		
		Результат.Метаданные.DocumentDate	= Документ1С.Дата;
		Результат.Метаданные.DocumentNumber	= НомерДокумента;
		Результат.Метаданные.FileName		= ИмяФайла;
		
		Результат.ЗапрашиватьОтветнуюПодпись = Истина;
		Результат.ДвоичныеДанные			= Новый ДвоичныеДанные(ИмяВременногоФайла);
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	ИначеЕсли ID = "ID_Квитанция" Тогда
		
		ТабДокумент = Документ1С.ПолучитьОбъект().ПечатьКвитанция(Новый ТабличныйДокумент);
		
		Если ТабДокумент <> Неопределено Тогда
			
			УстановитьПоляТабличногоДокумента(ТабДокумент);
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
			ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			ИмяФайла = "Квитанция № " + Документ1С.Номер + " от " + Формат(Документ1С.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
			НомерДокумента = ПредставлениеНомера(Документ1С);
			
			Результат.Метаданные.DocumentDate	= Документ1С.Дата;
			Результат.Метаданные.DocumentNumber	= НомерДокумента;
			Результат.Метаданные.FileName		= ИмяФайла;
			
			Результат.ЗапрашиватьОтветнуюПодпись = Истина;
			Результат.ДвоичныеДанные			= Новый ДвоичныеДанные(ИмяВременногоФайла);
			
			УдалитьФайлы(ИмяВременногоФайла);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура УстановитьПоляТабличногоДокумента(ТабДокумент)
	
	Если ТипЗнч(ТабДокумент) <> Тип("ТабличныйДокумент") Тогда
		Возврат;
	КонецЕсли;
	
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСнизу = 5;
	ТабДокумент.ПолеСправа = 5;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры

Функция СуммаНДССчетаНаОплату(Документ1С)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(СчетНаОплатуТовары.СуммаНДС) КАК СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплату.Товары КАК СчетНаОплатуТовары
		|ГДЕ
		|	СчетНаОплатуТовары.Ссылка = &Документ1С";
	
	Запрос.УстановитьПараметр("Документ1С", Документ1С);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДС
	Иначе
		СуммаНДС = Неопределено;
	КонецЕсли;
	
	Возврат СуммаНДС;
КонецФункции

Функция ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры)
	
	ЗаполнитьРеквизитыДокумента(Параметры);
	
	Документ				= Параметры.Документ;
	РеквизитыДокумента		= Документ.Реквизиты;
	ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
	ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
	
	ДанныеПечатнойФормы = СформироватьВнешнююПечатнуюФорму(Документ.ДокументУчета, ВнешняяПечатнаяФорма, ИдентификаторКоманды);
	
	Документ.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	Документ.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
	Документ.Метаданные.DocumentDate	= РеквизитыДокумента.Дата;
	Документ.Метаданные.DocumentNumber	= РеквизитыДокумента.Номер;
	
	Если Документ.Метаданные.Свойство("TotalSum") Тогда
		Документ.Метаданные.TotalSum = РеквизитыДокумента.Сумма;
	КонецЕсли;
	
	Если Документ.Метаданные.Свойство("TotalVat") Тогда
		Документ.Метаданные.TotalVat = РеквизитыДокумента.СуммаНДС;
	КонецЕсли;
	
	ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
	ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
	ХранилищеКонтента.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	СлужебнаяИнформация = Документ.СлужебнаяИнформация;
	СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
	
	УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html
	
	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЕстьСуммаДокумента = ДокументУчета.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено;
	
	Если ЕстьСуммаДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаДокумента";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОсновнойМодуль.Общее_ЗначенияРеквизитовОбъекта(ДокументУчета, ИменаРеквизитов);
	
	Реквизиты.Номер	= СокрЛП(ЗначенияРеквизитов.Номер);
	Реквизиты.Дата = ЗначенияРеквизитов.Дата;
	
	Если ЕстьСуммаДокумента Тогда
		Реквизиты.Сумма	= ЗначенияРеквизитов.СуммаДокумента;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ТребуетсяПересчетНормыВремени(ДокументОснованиеПересчета)
	
	Результат = Ложь;
	
	Результат = (ТипЗнч(ДокументОснованиеПересчета) = Тип("ДокументСсылка.ЗаказНаряд"));
	
	Возврат Результат;
	
КонецФункции


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html
	
	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента = Документ.Тип;
	ФункцияДокумента = Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		ДатаДокумента = Документ.Реквизиты.Дата;
		НомерДокумента = Документ.Реквизиты.Номер;
		
		Результат = НайтиПоступленияТоваров(
			Организация,
			Контрагент,
			ДатаДокумента,
			НомерДокумента
		);
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		ДатаДокумента = Документ.Реквизиты.Дата;
		НомерДокумента = Документ.Реквизиты.Номер;
		
		Результат = НайтиСчетаФактурыПолученные(
			Организация,
			Контрагент,
			ДатаДокумента,
			НомерДокумента
		);
		
	ИначеЕсли ЭтоФормализованныйАктСверки405(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		НачалоПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.BeginDate);
		ОкончаниеПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.EndDate);
		
		Результат = НайтиАктыСверкиВзаиморасчетов(
			Организация,
			Контрагент,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктСверки405(ТипЭД)
	
	Результат = НРег(ТипЭД.ТипДокумента) = НРег("ReconciliationAct")
				И НРег(ТипЭД.ТипКонтента) = НРег("reconciliationact405");
	
	Возврат Результат;
	
КонецФункции

Функция НайтиАктыСверкиВзаиморасчетов(Организация, Контрагент, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериодаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументАктСверки.Ссылка
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ДокументАктСверки
	|ГДЕ
	|	НЕ ДокументАктСверки.ПометкаУдаления
	|	И ДокументАктСверки.Организация = &Организация
	|	И ДокументАктСверки.Контрагент = &Контрагент
	|	И ДокументАктСверки.ДатаНачала = &ДатаНачала
	|	И ДокументАктСверки.ДатаОкончания = &ДатаОкончания";
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСчетаФактурыПолученные(Организация, Контрагент, ДатаДокумента, НомерДокумента)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиСчетаФактурыПолученные();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиСчетаФактурыПолученные()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументСчетФактураПолученный.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК ДокументСчетФактураПолученный
	|ГДЕ
	|	НЕ ДокументСчетФактураПолученный.ПометкаУдаления
	|	И ДокументСчетФактураПолученный.Организация = &Организация
	|	И ДокументСчетФактураПолученный.Контрагент = &Контрагент
	|	И ДокументСчетФактураПолученный.ВхДокДата = &ДатаДокумента
	|	И ДокументСчетФактураПолученный.ВхДокНомер = &НомерДокумента";
	
	Возврат Результат;
	
КонецФункции

Функция НайтиПоступленияТоваров(Организация, Контрагент, ДатаДокумента, НомерДокумента)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиПоступленияТоваров();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиПоступленияТоваров()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
	|	И ПоступлениеТоваровУслуг.ВхДокДата = &ДатаДокумента
	|	И ПоступлениеТоваровУслуг.ВхДокНомер = &НомерДокумента";
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	Ошибки = Новый Массив;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	ОтключитьПроверкуСопоставленияНоменклатуры = Параметры.ОтключитьПроверкуСопоставленияНоменклатуры;
	
	Документ = Параметры.Документ;
	
	ПроверитьФункциюДокумента(Параметры, Ошибки);
	ПроверитьЗаполнитьИдентификаторОперации(Параметры, Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Ошибки = ЗначениеВМассив(Результат.ОписаниеОшибки);
	
	ПроверитьЗаполнениеДокумента(НовыйОбъект, Ошибки, ОтключитьПроверкуСопоставленияНоменклатуры);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
		
	КонецЕсли;
	
	Если НовыйОбъект <> Неопределено Тогда
		
		НовыйОбъект.ОбменДанными.Загрузка = Истина;
		
	КонецЕсли;
	
	Если ИспользоватьДатуЭД
		И НЕ ЭтоФормализованныйАктСверки405(Документ.Тип) Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаНоменклатурыДляСопоставления = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html
	
	Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	
	ДокументДД	= Параметры.ДокументДД;
	ПакетДД		= Параметры.ПакетДД;
	
	Ошибки		= Новый Массив;
	Документ1С	= Неопределено;
	
	СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	
	ТипДокумента 	= НРег(СтруктураДанных.ТипДокумента);
	ТипКонтента 	= НРег(СтруктураДанных.ТипКонтента);
	ФункцияДокумента = НРег(СтруктураДанных.ФункцияДокумента);	
	
	Контрагент	= СтруктураДанных.Контрагент;
	Организация	= СтруктураДанных.Организация;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда			
		Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
		Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	КонецЕсли;
	
	
	// Выполним сопоставление документа
	МассивДокументов1С = ОсновнойМодуль.НайтиСопоставлениеДокумента(Параметры.Документ);
	
	Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
		Документ1С = МассивДокументов1С[0];
	КонецЕсли;
	
    // НАКЛАДНЫЕ
	Если ТипДокумента = "xmltorg12" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда		
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
		Иначе			
			ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
		КонецЕсли;		
		
	// СЧЕТА-ФАКТУРЫ
	ИначеЕсли ТипДокумента = "invoice" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда		
						
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
		КонецЕсли;
		
		ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820" ИЛИ ТипКонтента = ТипКонтентаUtd970());
		
		Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
			Ошибки.Добавить("Счет-фактура в старом формате.");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("ДокументДляСопоставления", Документ1С);
	Результат.Вставить("Ошибки", Ошибки);	
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html
	
	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
		ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
		ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 	= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента = РеквизитыДокумента.ФункцияДокумента;
	Организация		= РеквизитыДокумента.Организация;
	Контрагент		= РеквизитыДокумента.Контрагент; 
	
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
		
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
	
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваров",				Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеАвтомобилей",			Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратОтПокупателя",				Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратОтПокупателяАвтомобилей",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваров",				Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеДопРасходов",			Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионера",				Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионераЗаАвтомобили",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			ОтборСФ.Вставить("ЕстьКорректировка", Ложь); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			ОтборКоррСФ.Вставить("ЕстьКорректировка", Истина);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления",			Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступленияАвтомобилей",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ЗаказПоставщику",					Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ЗаказПоставщикуНаАвтомобиль",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетОтПоставщика",				Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетОтПоставщикаЗаАвтомобили",	Отбор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		НоменклатураКод = Элемент.Код;
		НоменклатураАртикул = Элемент.Артикул;
		НоменклатураНаименование = Элемент.Наименование;
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			НоменклатураНаименование,
			НоменклатураКод,
			НоменклатураАртикул
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции



///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html
	
	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И РеализацияТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслуг.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНачала
	|	И ПоступлениеТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияАвтомобилей.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияАвтомобилей.Ссылка)
	|ИЗ
	|	Документ.РеализацияАвтомобилей КАК РеализацияАвтомобилей
	|ГДЕ
	|	РеализацияАвтомобилей.Проведен = ИСТИНА
	|	И РеализацияАвтомобилей.Организация = &Организация
	|	И РеализацияАвтомобилей.Дата >= &ДатаНачала
	|	И РеализацияАвтомобилей.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияАвтомобилей.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеАвтомобилей.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеАвтомобилей.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей КАК ПоступлениеАвтомобилей
	|ГДЕ
	|	ПоступлениеАвтомобилей.Проведен = ИСТИНА
	|	И ПоступлениеАвтомобилей.Организация = &Организация
	|	И ПоступлениеАвтомобилей.Дата >= &ДатаНачала
	|	И ПоступлениеАвтомобилей.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеАвтомобилей.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			= Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	= Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПриОткрытииФормы(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pri_Otkrytii_Formy.html
	
	Форма		= Параметры.Форма;
	ИмяФормы	= Параметры.ИмяФормы;
	
	// Пример для снятия флажков у всех видов пакетов на отправку
	
	//Если ИмяФормы = "ОсновнаяФорма" Тогда
	//
	//	ДеревоФильтров = Форма.ДеревоФильтров;
	//	
	//	СтрокаОтправкаПакетов = ДеревоФильтров.Строки.Найти("ОтправкаПакетов");
	//	
	//	Если СтрокаОтправкаПакетов <> Неопределено Тогда
	//		
	//		Для Каждого СтрокаВидыПакетов Из СтрокаОтправкаПакетов.Строки Цикл
	//			СтрокаВидыПакетов.Пометка = Ложь;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриПолученииДанныхТабличнойЧасти(Параметры) Экспорт 
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pri_Poluchenii_Dannykh_Tablichnoy_Chasti.html
	
	Форма			 = Параметры.Форма;
	ИмяФормы		 = Параметры.ИмяФормы;
	Элемент			 = Параметры.Элемент;
	ОформленияСтрок	 = Параметры.ОформленияСтрок;
	
	//Для Каждого Эл Из ОформленияСтрок Цикл
	//	
	//	Если Эл.ДанныеСтроки.НомерСтроки % 2 = 0 Тогда
	//		Эл.Ячейки.Документ.ЦветФона	= WebЦвета.Аквамарин;
	//		Эл.ЦветФона					= WebЦвета.Древесный;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
	КатегорииПакетов = КатегорииПакетов();
	
	ОсновнойПакет			= КатегорииПакетов.ОсновнойПакет;
	КорректировочныйПакет	= КатегорииПакетов.КорректировочныйПакет;
	СчетФактураНаАванс		= КатегорииПакетов.СчетФактураНаАванс;
	СчетНаОплату			= КатегорииПакетов.СчетНаОплату;
	АктCверки				= КатегорииПакетов.АктCверки;
	ЗаказНаряд				= КатегорииПакетов.ЗаказНаряд;
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД",								"ID_УПД, ID_УПД_ДОП",								ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ОсновнойПакет",		"СФ + ТОРГ12/Акт",					"ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура",	ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_раздельно",		"УПД СЧФ + УПД ДОП",				"ID_УПД_СЧФ, ID_УПД_ДОП",							ОсновнойПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД",								"ID_УКД",											КорректировочныйПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_раздельно",		"УКД КСЧФ + УКД ДИС",				"ID_УКД_КСЧФ, ID_УКД_ДИС",							КорректировочныйПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ",								"ID_КСФ",											КорректировочныйПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СФ_НаАванс",			"СФ (на аванс)",					"ID_СчетФактура",									СчетФактураНаАванс);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_НаАванс",			"УПД СЧФ (на аванс)",				"ID_УПД_СЧФ",										СчетФактураНаАванс);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)",			"ID_Счет",											СчетНаОплату);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки",						"ID_АктСверки",										АктCверки);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ЗаказНаряды",			"Заказ-наряды",						"ID_ЗаказНаряд, ID_Акт, ID_Квитанция",				ЗаказНаряд);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)",				"ID_ИУПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_раздельно",		"УПД СЧФ + УПД ДОП (исправление)",	"ID_ИУПД_СЧФ, ID_УПД_ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)",					"ID_ИСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)",				"ID_ИУКД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ + УКД ДИС (исправление)",	"ID_ИУКД_КСЧФ, ID_ИУКД_ДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)",				"ID_ИКСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_НаАванс",			"УПД (исправление на аванс)",		"ID_ИУПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ_НаАванс",			"СФ (исправление на аванс)",		"ID_ИСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12_Акт_БезНДС",	"ТОРГ12/Акт (без НДС)",				"ID_АктФормализованный, ID_ТОРГ12");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_БезНДС",			"УПД ДОП (без НДС)",				"ID_УПД_ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_БезНДС",			"УПД ДОП (исправление без СФ)",	"ID_ИУПД_ДОП");

	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_БезНДС",			"УКД ДИС (без СФ)",				"ID_УКД_ДИС");

	ЗаполнитьНаименованияКатегорийПакетов(ТЗ);
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	МетаданныеДокумента1С = Документ1С.Метаданные();
	
	ЕстьРеквизитПодразделение	= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "ПодразделениеКомпании");
	ЕстьРеквизитОрганизация		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "Организация");
	ЕстьРеквизитКонтрагент		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "Контрагент");
	
	ИменаРеквизитов = Новый Массив;
		
	Если ЕстьРеквизитПодразделение Тогда
		ИменаРеквизитов.Добавить("ПодразделениеКомпании");
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
		
	Разделитель 		= ",";
	ТребуемыеРеквизиты 	= СтрСоединитьЛок(ИменаРеквизитов, Разделитель);
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		Реквизиты = Ядро.Общее_ЗначенияРеквизитовОбъекта(Документ1С, ТребуемыеРеквизиты);
	КонецЕсли;
	
	// В коллекции ПоляОтправителя и ПоляПолучателя индекс элементов соответствует приоритету этих элементов.
	// Чем меньше индекс, тем выше приоритет.
	
	Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(Реквизиты.ПодразделениеКомпании) Тогда
		ПоляОтправителя.Добавить(Реквизиты.ПодразделениеКомпании);
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Организация);
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ПоляПолучателя.Добавить(Реквизиты.Контрагент);
	КонецЕсли;
	
КонецПроцедуры

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
			
КонецПроцедуры

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт
						
КонецПроцедуры

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Результат = ПредставлениеНомера(Документ);
	
	Возврат Результат;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
		
			
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетНаОплату"));
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	СоответствияРеквизитов.Номер = "ВхДокНомер";
	СоответствияРеквизитов.дата = "ВхДокДата";
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  КоллекцияДокументов - Массив - коллекция документов учета
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если НЕ МетаданныеЭлемента.Реквизиты.Найти("Организация") = Неопределено Тогда
		Реквизиты.Добавить("Организация");	
	КонецЕсли;
	
	Если НЕ МетаданныеЭлемента.Реквизиты.Найти("Контрагент") = Неопределено Тогда
		Реквизиты.Добавить("Контрагент");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	ИменаРеквизитов = СтрСоединитьЛок(Реквизиты, ","); 
	
	Результат = Общее_ЗначенияРеквизитовОбъектов(КоллекцияДокументов, ИменаРеквизитов);
	
	Возврат Результат;
	
КонецФункции

// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ЕстьТиповаяПечатнаяФорма = Ложь;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С.
// Для получения подчиненных документов используется критерии отбора СвязанныеДокументы.
//
// Параметры:
//  ДокументУчета	 - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(Документ) Экспорт
	
	Результат = Новый Массив;
		
	СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, Документ);
	
	ДокументОснование = ЗначениеРеквизитаОбъектаЛок(Документ, "ДокументОснование");
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если ЭтоЗаказНаряд(ДокументОснование)
			Или ЭтоРеализацияТоваров(ДокументОснование) 
			Или ЭтоРеализацияАвтомобилей(ДокументОснование) Тогда
			
			Результат.Добавить(ДокументОснование);
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, ДокументОснование);
			
		ИначеЕсли ЭтоЗаказПокупателя(ДокументОснование) Тогда
						
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, ДокументОснование);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Добавить(Документ);	
	
	Возврат Результат;	
	
КонецФункции

Процедура СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, Документ)
	
	СвязанныеДокументы = СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ);
	
	Для Каждого СсылкаНаОбъект Из СвязанныеДокументы Цикл

		Если КоллекцияПриемник.Найти(СсылкаНаОбъект) = Неопределено Тогда
			КоллекцияПриемник.Добавить(СсылкаНаОбъект); 
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, СсылкаНаОбъект)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  Документ - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ)
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодчиненныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.ПодчиненныеДокументы(&Ссылка) КАК ПодчиненныеДокументы";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;	
	
КонецФункции

Функция ЭтоЗаказНаряд(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаряд"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияТоваров(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваров"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияАвтомобилей(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияАвтомобилей"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗаказПокупателя(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя"));
	Возврат Результат;
	
КонецФункции

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка - счет-фактура, основание которой нужно найти;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ИмяТабличнойЧасти = Неопределено;
	Выборка = Ядро.Общее_ВыборкаДанныхОбъекта(СчетФактура, ИмяТабличнойЧасти, "ДокументОснование");
			
	Пока Выборка.Следующий() Цикл 
		
		ДокументОснование = Выборка.ДокументОснование;
		
		Если Результат.Найти(ДокументОснование) = Неопределено Тогда
			Результат.Добавить(ДокументОснование);
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат Результат;
	
КонецФункции

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
	
	Если НЕ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КоллекцияОснований = ДокументыОснованияСчетаФактуры(ДокументУчета);

КонецПроцедуры

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  ПеречислениеСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	Если СтрНайтиЛок("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = ПредставлениеСтавкиБезНДС();
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайтиЛок("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайтиЛок("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайтиЛок("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайтиЛок("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайтиЛок("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайтиЛок("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайтиЛок("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайтиЛок("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайтиЛок("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайтиЛок("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайтиЛок("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	ПеречислениеСтавокНДС = СоответствиеСтавокНДСИзСправочника();
	
	Результат = ПеречислениеСтавокНДС.Получить(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеСтавокНДСИзСправочника()
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ставка КАК Ставка,
	|	Т.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Т.Наименование ПОДОБНО ""%/%""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетнаяСтавка
	|ИЗ
	|	Справочник.СтавкиНДС КАК Т
	|ГДЕ
	|	НЕ Т.Ссылка = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.РасчетнаяСтавка Тогда
			КлючСоответствия = Строка(ВыборкаДетальныеЗаписи.Ставка) + "/" + Строка(ВыборкаДетальныеЗаписи.Ставка + 100);
		Иначе
			КлючСоответствия = Строка(ВыборкаДетальныеЗаписи.Ставка);
		КонецЕсли;
		
		Результат.Вставить(КлючСоответствия, ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	Результат.Вставить(ПредставлениеСтавкиБезНДС(), Справочники.СтавкиНДС.БезНДС);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - ПеречислениеСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	Результат = "##";
	
	Если ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Если ЗначениеСтавки = Справочники.СтавкиНДС.БезНДС Тогда
			
			Результат = "без НДС";
			
		ИначеЕсли СтрНайтиЛок(ЗначениеСтавки.Наименование, "/") > 0 Тогда
			
			Результат = СтрШаблонЛок(
				"%1/%2",
				Формат(ЗначениеСтавки.Ставка, "ЧН=0"),
				Формат(ЗначениеСтавки.Ставка + 100, "ЧН=0")
			);
			
		Иначе
			
			Результат = Формат(ЗначениеСтавки.Ставка, "ЧН=0");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	ДокументыКонфигурации = Метаданные.Документы;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомиссионера);
	Результат.Добавить(ДокументыКонфигурации.КорректировкаРеализации);
	Результат.Добавить(ДокументыКонфигурации.РеализацияТоваров);
	Результат.Добавить(ДокументыКонфигурации.РеализацияАвтомобилей);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомитенту);
	Результат.Добавить(ДокументыКонфигурации.СчетФактураВыданный);
	Результат.Добавить(ДокументыКонфигурации.СчетНаОплату);
	Результат.Добавить(ДокументыКонфигурации.ЗаказНаряд);

	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ

//*****************************************************************************
//{ СБОР КОНТЕНТА УПД970

//{ УПД970. Программный интерфейс

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка		 - ДокументСсылка - ссылка на учетный документ 1С,
//										по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры	 - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаПродавца(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры) Экспорт
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Если ЭтоСчетФактураНаАванс(ДокСсылка) Тогда
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданныйНаАванс(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
		Иначе
			Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданный(
				ДокСсылка,
				ФункцияДокумента,
				ДополнительныеПараметры);
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуРеализацияТоваров(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализации(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ЭтоРеализацияАгентскихУслуг(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуРеализацияАгентскихУслуг(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ЭтоАктОбОказанииУслуг(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуАктОбОказанииУслуг(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуРеализацияАвтомобилей(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ЭтоИсправлениеРеализацииАвтомобилей(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализацииАвтомобилей(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуЗаказНаряд(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомиссионера(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуВозвратПоставщику(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ДокСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//} УПД970. Программный интерфейс

//{ УПД970. Заполнение протоструктуры по документам

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданный(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		ДанныеПоДокументу.СведенияОДокументахОплаты
	);
	
	Если ДанныеШапки.Исправление Тогда
		УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки);
	Иначе
		УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Ссылка, ДанныеШапки.Дата);
	КонецЕсли;
	
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	ПересчитыватьНормыВремени = ТребуетсяПересчетНормыВремени(ДанныеШапки.ДокументОснование);
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры,
		ПересчитыватьНормыВремени
	);
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДанныеПоДокументу.ДокументыОснования, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСведенияОСоставителеФайла(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураВыданныйНаАванс(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Ссылка, ДанныеШапки.Дата);
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		ДанныеПоДокументу.СведенияОДокументахОплаты
	);
	
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	УПД970_ЗаполнитьСведенияОСоставителеФайла(Контент);
	
	УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры
	);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуРеализацияТоваров(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаРеализацияТоваров(ДокСсылка);
	
	УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализации(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокСсылка);
	
	УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуРеализацияАвтомобилей(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаРеализацияАвтомобилей(ДокСсылка);
	
	УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуКорректировкаРеализацииАвтомобилей(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаКорректировкаРеализацииАвтомобилей(ДокСсылка);
	
	УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуРеализацияАгентскихУслуг(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаРеализацияАгентскихУслуг(ДокСсылка);
	
	УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуАктОбОказанииУслуг(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаАктОбОказанииУслуг(ДокСсылка);
	
	УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуЗаказНаряд(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаЗаказНаряд(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Ссылка, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСведенияОСоставителеФайла(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуОтчетКомиссионера(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаОтчетКомиссионера(ДокСсылка);
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Ссылка, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСведенияОСоставителеФайла(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуВозвратПоставщику(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаВозвратПоставщику(ДокСсылка);
	
	УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка);
	
	Возврат Контент;
	
КонецФункции

//{ УПД970. Заполнение протоструктуры по документам. Общее

Процедура УПД970_ЗаполнитьОбщиеДанныеКонтента(Контент, ДанныеПоДокументу, ФункцияДокумента, ДополнительныеПараметры)
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Ссылка, ДанныеШапки.Дата);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу.ТабличныеДанные,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДанныеШапки.Ссылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСведенияОСоставителеФайла(Контент);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуНомер(Контент, ДокСсылка, ДатаДокумента)
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДатаДокумента;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьДатуНомерДляИсправительногоДокумента(Контент, ДанныеШапки)
	
	Контент.RevisionNumber = ДанныеШапки.НомерИсправления;
	Контент.RevisionDate = ДанныеШапки.Дата;
	
	Если ЗначениеЗаполнено(ДанныеШапки.НомерИсходногоДокумента) Тогда
		DocumentNumber = ДанныеШапки.НомерИсходногоДокумента;
	Иначе
		DocumentNumber = ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ДатаИсходногоДокумента) Тогда
		DocumentDate = ДанныеШапки.ДатаИсходногоДокумента;
	Иначе
		DocumentDate = ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента;
	КонецЕсли;
	
	Контент.DocumentNumber = DocumentNumber;
	Контент.DocumentDate = DocumentDate;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВалюту(Контент, ВалютаКод)
	
	Контент.Currency = ВалютаКод;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, СведенияОДокументахОплаты)
	
	Для Каждого СтрокаТаблицы Из СведенияОДокументахОплаты Цикл
		
		PaymentDocument = Контракт_PaymentDocumentInfo();
		
		PaymentDocument.Number = СтрокаТаблицы.НомерДокумента;
		PaymentDocument.Date = СтрокаТаблицы.ДатаДокумента;
		
		Контент.PaymentDocuments.Добавить(PaymentDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, СведенияОбУчастникахЭДО)
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОбУчастникахЭДО.Организация);
	Seller.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОбУчастникахЭДО.Контрагент);
	Buyer.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Контрагент.Ссылка;
	
	Грузоотправитель = СведенияОбУчастникахЭДО.Грузоотправитель;
	Если Грузоотправитель <> Неопределено Тогда
		
		Shipper = Контракт_Shipper970();
		Shipper.SameAsSeller = Ложь;
		
		Контент.Shippers.Добавить(Shipper);
		
		Если Грузоотправитель.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка
			И Контент.Function <> ФункцияДокументаУПД_ДОП() Тогда
			
			Shipper.SameAsSeller = Истина;
			
		Иначе
			
			ShipperInfo = Контракт_ExtendedOrganizationInfo970();
			Shipper.OrganizationInfo = ShipperInfo;
			УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, Грузоотправитель);
			ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СведенияОбУчастникахЭДО.Грузополучатель <> Неопределено Тогда
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		Контент.Consignees.Добавить(Consignee);
		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, СведенияОбУчастникахЭДО.Грузополучатель);
		Consignee.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Грузополучатель.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьExtendedOrganizationInfo(Content, ДанныеУчастникаЭДО)
	
	Content.Type = УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО);
	
	Content.Name = ДанныеУчастникаЭДО.Наименование;
	
	Content.Inn = ДанныеУчастникаЭДО.ИНН;
	Content.Kpp = ДанныеУчастникаЭДО.КПП;
	Content.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	Content.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
	
	Content.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРНИП;
	Content.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаОГРНИП;
	
	Content.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	
	Content.Country = ДанныеУчастникаЭДО.СтранаНаименование;
	Content.CountryCode = ДанныеУчастникаЭДО.СтранаКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		Content.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.ЭлектроннаяПочта) Тогда
		Content.Email.Добавить(ДанныеУчастникаЭДО.ЭлектроннаяПочта);
	КонецЕсли;
	
	Content.BankName = ДанныеУчастникаЭДО.НаименованиеБанка;
	Content.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	Content.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	Content.BankId = ДанныеУчастникаЭДО.БИК;
	
	УПД970_ЗаполнитьAddressInfo(Content, ДанныеУчастникаЭДО.Адрес);
	
	Content.СлужебнаяИнформация.Ссылка = ДанныеУчастникаЭДО.Ссылка;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьAddressInfo(OrganizationInfo, СведенияОбАдресе)
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат;
	КонецЕсли;
	
	AddressInfo = Контракт_AddressInfo970();
	OrganizationInfo.Address = AddressInfo;
	
	ВидыАдресов = ГенерацияXML.Перечисление_ВидыАдресов();
	
	Если СведенияОбАдресе.ТипАдреса = АдминистративноТерриториальныйАдрес()
		И ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		
		AddressRF = УПД970_НовыйAddressRF(СведенияОбАдресе);
		
		AddressInfo.AddressRF = AddressRF;
		AddressInfo.Type = ВидыАдресов.АдресРФ;
		
	Иначе
		
		AddressText = УПД970_НовыйAddressText(СведенияОбАдресе);
		
		AddressInfo.AddressText = AddressText;
		AddressInfo.Type = ВидыАдресов.АдресСтрокой;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_НовыйAddressRF(СведенияОбАдресе)
	
	Результат = Контракт_AddressRFInfo();
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = СведенияОбАдресе.Регион;
	Результат.Territory = СведенияОбАдресе.Район;
	
	Результат.City = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Город,
		СведенияОбАдресе.ГородСокращение);
	
	Результат.Locality = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.НаселенныйПункт,
		СведенияОбАдресе.НаселенныйПунктСокращение);
		
	Результат.Street = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Улица,
		СведенияОбАдресе.УлицаСокращение);
	
	ИмяПоляНомер = "Номер";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание) Тогда 
		СведенияОбАдресе.Здание.Свойство(ИмяПоляНомер, Результат.Building);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса) Тогда 
		СведенияОбАдресе.Корпуса[0].Свойство(ИмяПоляНомер, Результат.Block);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда 
		СведенияОбАдресе.Помещения[0].Свойство(ИмяПоляНомер, Результат.Apartment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйAddressText(СведенияОбАдресе)
	
	Результат = Контракт_AddressTextInfo();
	
	Результат.AddressText = СведенияОбАдресе.Представление;
	Результат.CountryCode = СведенияОбАдресе.КодСтраны;
	Результат.Country = СведенияОбАдресе.Страна;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(Контент, ТабличныеДанные, ДополнительныеПараметры,
	ПересчитыватьНормыВремени = Ложь)
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	ИспользоватьСервисКонтурМаркировка = ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка;
	
	ВсеСтрокиБезНДС = Истина;
	
	Если Контент.Table = Неопределено Тогда
		Table = Контракт_InvoiceTable970();
		Контент.Table = Table;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы);
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			Количество = Окр(СтрокаТаблицы.Количество, ТочностьКоличества);
			
			Если ПересчитыватьНормыВремени
				И ЕстьРеквизитИлиСвойствоОбъектаЛок(СтрокаТаблицы, "Коэффициент")
				И ТипЗнч(СтрокаТаблицы.Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда
				Количество = Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Коэффициент, ТочностьКоличества);
			КонецЕсли;
			
			Item.Quantity = Количество;
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		
		Item.Price = УПД970_ЦенаБезНДС(Item, СтрокаТаблицы.Цена, ТочностьЦены);
		
		УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(Item, СтрокаТаблицы);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		УПД970_ПересчитатьИтоговыеЗначенияТаблицы(Table, Item);
		
		Если НЕ ИспользоватьСервисКонтурМаркировка Тогда
			УПД970_ЗаполнитьКодыМаркировкиВСтрокеКонтента(Item, СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(Контент, ТабличныеДанные, ДополнительныеПараметры)
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = УПД970_НаименованиеНоменклатурыСчетФактурыНаАванс(СтрокаТаблицы);
		Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
		
		Item.ItemVendorCode = СтрокаТаблицы.КодИлиАртикулНоменклатуры;
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияСтроки();
		Item.СлужебнаяИнформация.Номенклатура = СтрокаТаблицы.Номенклатура;
		Item.СлужебнаяИнформация.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.Vat = ТабличныеДанные.Итог("СуммаНДС");
	Table.Total = ТабличныеДанные.Итог("СуммаВсего");
	
КонецПроцедуры

Процедура УПД970_ПересчитатьИтоговыеЗначенияТаблицы(Table, Item)
	
	Если Table.TotalNet = Неопределено Тогда
		Table.TotalNet = 0;
	КонецЕсли;
	
	Если Table.TotalWithVatExcluded = Неопределено Тогда
		Table.TotalWithVatExcluded = 0;
	КонецЕсли;
	
	Если Table.Vat = Неопределено Тогда
		Table.Vat = 0;
	КонецЕсли;
	
	Если Table.Total = Неопределено Тогда
		Table.Total = 0;
	КонецЕсли;
	
	Если Item.Quantity <> Неопределено Тогда
		Table.TotalNet = Table.TotalNet + Item.Quantity;
	КонецЕсли;
	
	Table.Vat = Table.Vat + Item.Vat;
	Table.TotalWithVatExcluded = Table.TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
	Table.Total = Table.Total + Item.Subtotal;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы)
	
	Item.Product = УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы);
	Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
	
	Item.ItemVendorCode = СтрокаТаблицы.КодНоменклатуры;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
		
		КодЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод);
		ИмяЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
		
		Item.Unit = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕИ);
		Item.UnitName = ИмяЕИ;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ПредставлениеНоменклатуры(СтрокаТаблицы)
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПолноеНаименование) Тогда
		НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураПолноеНаименование;
	Иначе
		НаименованиеНоменклатуры = СтрокаТаблицы.НоменклатураНаименование;
	КонецЕсли;
	
	ПредставлениеДопСведенийОНоменклатуре = "";
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ХарактеристикаНоменклатурыНаименование) Тогда
		ПредставлениеДопСведенийОНоменклатуре = СтрШаблонЛок(" (%1)", СтрокаТаблицы.ХарактеристикаНоменклатурыНаименование);
	КонецЕсли;
	
	Результат = НаименованиеНоменклатуры + ПредставлениеДопСведенийОНоменклатуре;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыВТерминахПрото(ТипНоменклатуры)
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Если ТипНоменклатуры = УПД970_ТипНоменклатурыУслуга() Тогда
		Результат = ТипыНоменклатуры.Услуга;
	Иначе
		Результат = ТипыНоменклатуры.Имущество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(Item, СтрокаТаблицы)
	
	УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаТаблицы);
	
	Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
		УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СтрокаТаблицы);
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СведенияГТД)
	
	ЭтоСтранаПроисхожденияРоссия = СведенияГТД.СтранаПроисхожденияКод = ОсновнаяСтрана().Код;
	Если ЭтоСтранаПроисхожденияРоссия Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СведенияГТД.НомерГТД)
		И (Не ЗначениеЗаполнено(СведенияГТД.СтранаПроисхожденияКод)
			Или СведенияГТД.СтранаПроисхожденияУчастникЕАЭС) Тогда
		Возврат;
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = СведенияГТД.СтранаПроисхожденияКод;
	CustomDeclaration.DeclarationNumber = СокрЛП(СведенияГТД.НомерГТД);
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СтрокаТаблицы)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД) Тогда
		Возврат;
	КонецЕсли;
	
	Item.CustomDeclarations.Очистить();
	
	ItemTracingInfo = Контракт_ItemTracingInfo970();
	
	ItemTracingInfo.RegNumberUnit = СокрЛП(СтрокаТаблицы.НомерГТД);
	ItemTracingInfo.Quantity = СтрокаТаблицы.Количество;
	ItemTracingInfo.SumWithoutVat = Item.SubtotalWithVatExcluded;
	ItemTracingInfo.Unit = СтрокаТаблицы.ЕдиницаИзмеренияКод;
	ItemTracingInfo.UnitName = СтрокаТаблицы.ЕдиницаИзмеренияНаименование;
	
	Item.ItemTracingInfos.Добавить(ItemTracingInfo);
	
	СведенияГТД = Новый Структура;
	СведенияГТД.Вставить("СтранаПроисхожденияКод", СтрокаТаблицы.СтранаПроисхожденияКод);
	СведенияГТД.Вставить("НомерГТД", "Прослеж");
	СведенияГТД.Вставить("СтранаПроисхожденияУчастникЕАЭС", Ложь);
	
	УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СведенияГТД);
	
КонецПроцедуры

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	Результат.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	Результат.Номенклатура = СтрокаТаблицы.Номенклатура;
	Результат.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
	Результат.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
	Результат.НомерГТД = СтрокаТаблицы.НомерГТД;
	Результат.Характеристика = СтрокаТаблицы.ХарактеристикаНоменклатуры;
	
	Если ЭтоСчетФактура(СтрокаТаблицы.Ссылка) Тогда
		Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка.ДокументОснование;
	Иначе
		Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка;
	КонецЕсли;
	
	Результат.ПрослеживаемыйТовар = СтрокаТаблицы.ПрослеживаемыйТовар;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, КоллекцияДокументов, ФункцияДокумента)
	
	ДокументыОтгрузки = УПД970_ДокументыОтгрузки(КоллекцияДокументов);
	
	СтрокиТаблицы = Контент.Table.Items;
	
	НаименованиеДокумента = УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		РеквизитыДокументовОтгрузки = ЗначенияРеквизитовОбъектовЛок(ДокументыОтгрузки, "Ссылка, Дата");
		
		Для Каждого КлючЗначение Из РеквизитыДокументовОтгрузки Цикл
			
			РеквизитыДокумента = КлючЗначение.Значение;
			
			НомерДокумента = ПредставлениеНомера(РеквизитыДокумента.Ссылка);
			ДатаДокумента = РеквизитыДокумента.Дата;
			
			DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
			Контент.DocumentShipments.Добавить(DocumentShipment);
			
		КонецЦикла;
		
	Иначе
		
		НомерДокумента = Контент.DocumentNumber;
		ДатаДокумента = Контент.DocumentDate;
		
		DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
		Контент.DocumentShipments.Добавить(DocumentShipment);
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента)
	
	Результат = Контракт_DocumentShipments970();
	
	Результат.Name = НаименованиеДокумента;
	Результат.Number = НомерДокумента;
	Результат.Date = ДатаДокумента;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
	Контент,
	ОснованияПередачиТоваров,
	ДополнительныеПараметры)
	
	Перем УказыватьОтсутствиеОснованияУПД;
	
	TransferInfo = Контракт_TransferInfo970();
	Контент.TransferInfo = TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	ДополнительныеПараметры.Свойство("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
	
	Для Каждого РеквизитыОснования Из ОснованияПередачиТоваров Цикл
		
		РеквизитыЗаполнены = УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования);
		
		Если Не РеквизитыЗаполнены
			И УказыватьОтсутствиеОснованияУПД = Истина Тогда
			
			TransferInfo.TransferBases.Очистить();
			Прервать;
			
		Иначе
			
			TransferBase = УПД970_НовыйTransferBase(РеквизитыОснования);
			TransferInfo.TransferBases.Добавить(TransferBase);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если TransferInfo.TransferBases.Количество() = 0 Тогда
		TransferInfo.WithoutTransferBase = Истина;
	КонецЕсли;
	
	УПД970_ЗаполнитьДатуОтгрузки(Контент);
	
КонецПроцедуры

Функция УПД970_НовыйTransferBase(РеквизитыОснования)
	
	Результат = Контракт_TransferBases970();
	
	Результат.Name = РеквизитыОснования.Наименование;
	Результат.Number = РеквизитыОснования.Номер;
	Результат.Date = РеквизитыОснования.Дата;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДатуОтгрузки(Контент)
	
	Если Контент.Function <> ФункцияДокументаУПД_СЧФ() Тогда
		
		ДатаОтгрузки = Контент.DocumentDate;
		
		Для Каждого DocumentShipment Из Контент.DocumentShipments Цикл
			ДатаОтгрузки = DocumentShipment.Date;
			Прервать;
		КонецЦикла;
		
		Контент.TransferInfo.TransferDate = ДатаОтгрузки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента)
	
	Если ФункцияДокумента <> ФункцияДокументаУПД_СЧФ()
		И Контент.DocumentShipments.Количество() > 0 Тогда
		Контент.DocumentName = Контент.DocumentShipments[0].Name;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОСоставителеФайла(Контент)
	
	Если Контент.Sellers.Количество() > 0 Тогда
		
		Seller = Контент.Sellers[0];
		
		ИНН = Seller.Inn;
		Если Не ЗначениеЗаполнено(ИНН) Тогда
			ИНН = "-";
		КонецЕсли;
		
		КПП = Seller.Kpp;
		Если Не ЗначениеЗаполнено(КПП) Тогда 
			КПП = "-";
		КонецЕсли;
		
		ИННКПП = СтрШаблонЛок("ИНН/КПП %1/%2", ИНН, КПП);
		
		РеквизитыСоставителя = Новый Массив;
		РеквизитыСоставителя.Добавить(Seller.Name);
		РеквизитыСоставителя.Добавить(ИННКПП);
		
		Контент.DocumentCreator = СтрСоединитьЛок(РеквизитыСоставителя, ", ");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры)
	
	Перем ДанныеСотрудника;
	
	ДополнительныеПараметры.Свойство("ДанныеСотрудника", ДанныеСотрудника);
		
	ЕстьТовары = УПД970_ВДокументеЕстьТовары(Контент.Table.Items);
	
	НеобходимоЗаполнитьСведения = (ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность)
		И Контент.Function <> ФункцияДокументаУПД_СЧФ()
		И ЕстьТовары);
	
	Если НеобходимоЗаполнитьСведения Тогда
		
		Employee = Контракт_Employee970();
		
		Employee.Surname = ДанныеСотрудника.Фамилия;
		Employee.FirstName = ДанныеСотрудника.Имя;
		Employee.Patronymic = ДанныеСотрудника.Отчество;
		Employee.EmployeePosition = ДанныеСотрудника.Должность;
		
		Контент.TransferInfo.Employee = Employee;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ИспользоватьСервисКонтурМаркировка)
	
	Если НЕ ИспользоватьСервисКонтурМаркировка Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		РаботаСМаркировкойЛок.ЗаполнитьСведенияОМаркировке970(Контент);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ПодробнаяОшибка = Ядро.Общее_ПодставитьПараметрыВСтроку(
			"Не удалось заполнить сведения о маркировке по причине:
			|%1",
			ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
			"Диадок.РаботаСМаркировкой",
			УровеньЖурналаРегистрации.Ошибка,
			ДокСсылка.Метаданные(),
			ДокСсылка,
			ПодробнаяОшибка);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьКодыМаркировкиВСтрокеКонтента(Item, СтрокаТаблицы)
	
	КодыМаркировки = СтрокаТаблицы.КодыМаркировки;
	
	Если НЕ ЗначениеЗаполнено(КодыМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификационныйНомер = Контракт_ItemIdentificationNumber970();
	ИдентификационныйНомер.Units = Общее_СкопироватьМассив(КодыМаркировки);
	
	Item.ItemIdentificationNumbers.Добавить(ИдентификационныйНомер);
	
КонецПроцедуры

//} УПД970. Заполнение протоструктуры по документам. Общее

//} УПД970. Заполнение протоструктуры по документам

//{ УПД970. Исходные данные по документам

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданный());
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединитьЛок(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапкиТаблица = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = Общее_СтрокаТаблицыЗначенийВСтруктуру(ДанныеШапкиТаблица[0]);
	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	
	СведенияОДокументахОплаты = УПД970_СведенияОДокументахОплаты(ДанныеШапки.ПлатежноРасчетныеДокументы);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(
		ДанныеШапки.ДокументОснование
	);
	
	ДанныеКодовМаркировки = УПД970_ДанныеКодовМаркировкиДокументаОснованияСчетФактуры(ДанныеШапки.ДокументОснование);
	ОтборПоИдентификатору = Ложь;
	
	УПД970_ДобавитьДанныеКодовМаркировкиВТабличныеДанные(ТабличныеДанные, ДанныеКодовМаркировки, ОтборПоИдентификатору);
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	Если УПД970_ВТабличныхДанныхДокументаНетТоваров(ТабличныеДанные) Тогда
		СведенияОбУчастникахЭДО.Грузоотправитель = Неопределено;
		СведенияОбУчастникахЭДО.Грузополучатель = Неопределено;
	КонецЕсли;
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	Результат = УПД970_Контракт_ДанныеСчетФактура();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.ДокументыОснования = ЗначениеВМассив(ДанныеШапки.ДокументОснование);
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоСчетФактураНаАванс = Ложь;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.ОснованияПередачиТоваров = ОснованияПередачиТоваров;
	Результат.СведенияОбУчастникахЭДО = СведенияОбУчастникахЭДО;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданныйНаАванс(ДокСсылка)
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаДанныхШапкиСчетФактураНаАванс());
	ТекстыЗапросов.Добавить(УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураНаАванс());
	
	ТекстЗапроса = СтрСоединитьЛок(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	
	ДанныеШапки = Общее_СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	
	СведенияОДокументахОплаты = УПД970_СведенияОДокументахОплаты(ДанныеШапки.ПлатежноРасчетныеДокументы);
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	Результат = УПД970_Контракт_ДанныеСчетФактура();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоСчетФактураНаАванс = Истина;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.СведенияОбУчастникахЭДО = СведенияОбУчастникахЭДО;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаРеализацияТоваров(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияТоваров();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияТоваров();
	ТекстЗапросаКодовМаркировки = УПД970_ТекстЗапросаКодовМаркировкиДокументаРеализацияТоваров();
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаКорректировкаРеализации(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализации();
	ТекстЗапросаКодовМаркировки = УПД970_ТекстЗапросаКодовМаркировкиДокументаКорректировкаРеализации();
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаРеализацияАвтомобилей(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияАвтомобилей();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияАвтомобилей();
	ТекстЗапросаКодовМаркировки = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаКорректировкаРеализацииАвтомобилей(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализацииАвтомобилей();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализацииАвтомобилей();
	ТекстЗапросаКодовМаркировки = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаРеализацияАгентскихУслуг(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияАгентскихУслуг();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияАгентскихУслуг();
	ТекстЗапросаКодовМаркировки = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаАктОбОказанииУслуг(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаАктОбОказанииУслуг();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаАктОбОказанииУслуг();
	ТекстЗапросаКодовМаркировки = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаЗаказНаряд(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаЗаказНаряд();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаЗаказНаряд();
	ТекстЗапросаКодовМаркировки = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомитенту(ДокСсылка, СчетФактура)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитенту();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитенту();
	ТекстЗапросаКодовМаркировки = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		СчетФактура, // Отчет комитенту всегда строим по СФ
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОтчетКомиссионера(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионера();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионера();
	ТекстЗапросаКодовМаркировки = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаВозвратПоставщику(ДокСсылка)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратПоставщику();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратПоставщику();
	ТекстЗапросаКодовМаркировки = УПД970_ТекстЗапросаКодовМаркировкиДокументаВозвратПоставщику();
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеПервичногоДокумента(
	ДокСсылка,
	ТекстЗапросаДанныхШапки,
	ТекстЗапросаТабличныхДанных,
	ТекстЗапросаКодовМаркировки)
	
	ЕстьДанныеКодовМаркировки = ЗначениеЗаполнено(ТекстЗапросаКодовМаркировки);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхШапки);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныхДанных);
	
	Если ЕстьДанныеКодовМаркировки Тогда
		ТекстыЗапросов.Добавить(ТекстЗапросаКодовМаркировки);
	КонецЕсли;
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединитьЛок(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0];
	ТабличныеДанные = РезультатыЗапроса[1];
	
	Если ЕстьДанныеКодовМаркировки Тогда
		ДанныеКодовМаркировки = РезультатыЗапроса[2];
	Иначе
		ДанныеКодовМаркировки = Неопределено;
	КонецЕсли;
	
	Результат = УПД970_ОбработатьДанныеПервичногоДокумента(
		ДанныеШапки,
		ТабличныеДанные,
		ДанныеКодовМаркировки
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбработатьДанныеПервичногоДокумента(
	РезультатЗапросаПоШапке,
	РезультатЗапросаПоТаблицам,
	РезультатЗапросаПоКодамМаркировки)
	
	ДанныеШапкиТаблица = РезультатЗапросаПоШапке.Выгрузить();
	ДанныеШапки = Общее_СтрокаТаблицыЗначенийВСтруктуру(ДанныеШапкиТаблица[0]);
	
	ТабличныеДанные = РезультатЗапросаПоТаблицам.Выгрузить();
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом);
	ЭтоДоговорСКомиссионером = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером);
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	Если УПД970_ВТабличныхДанныхДокументаНетТоваров(ТабличныеДанные) Тогда
		СведенияОбУчастникахЭДО.Грузоотправитель = Неопределено;
		СведенияОбУчастникахЭДО.Грузополучатель = Неопределено;
	КонецЕсли;
	
	Если РезультатЗапросаПоКодамМаркировки = Неопределено Тогда
		ДанныеКодовМаркировки = Неопределено;
	Иначе
		ДанныеКодовМаркировки = РезультатЗапросаПоКодамМаркировки.Выгрузить();
	КонецЕсли;
	
	ОтборПоИдентификатору = Истина;
	
	УПД970_ДобавитьДанныеКодовМаркировкиВТабличныеДанные(ТабличныеДанные, ДанныеКодовМаркировки, ОтборПоИдентификатору);
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваров(
		ДанныеШапки.ДоговорНомер,
		ДанныеШапки.ДоговорДата
	);
	
	Результат = УПД970_Контракт_ДанныеПервичногоДокумента();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ЭтоДоговорСКомиссионером = ЭтоДоговорСКомиссионером;
	Результат.СведенияОбУчастникахЭДО = СведенияОбУчастникахЭДО;
	Результат.ОснованияПередачиТоваров = ОснованияПередачиТоваров;
	
	Возврат Результат;
	
КонецФункции

//{ УПД970. Исходные данные по документам. Тексты запросов

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.Исправление КАК Исправление,
	|	ДанныеШапки.НомерИсправления КАК НомерИсправления,
	|	ДанныеШапки.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	ДанныеШапки.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.ПлатежноРасчетныеДокументы КАК ПлатежноРасчетныеДокументы,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(Контрагенты.ГоловнойКонтрагент, НЕОПРЕДЕЛЕНО) КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(Контрагенты.КПП, """") КАК КонтрагентКПП,
	|	ДанныеШапки.ДокументОснование КАК ДокументОснование,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураВыданный()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторТовара,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СправочникГТД.Страна
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.Код
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.УчастникЕАЭС
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Коэффициент КАК Коэффициент,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО ТабТовары.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираГТД
	|		ПО СправочникГТД.Страна = КлассификаторСтранМираГТД.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабТовары.Номенклатура ССЫЛКА Справочник.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторТовара,
	|	""Товар"" КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	"""" КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СправочникГТД.Страна
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.УчастникЕАЭС
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное, ""шт"") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код, ""796"") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Коэффициент КАК Коэффициент,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрАвтомобили.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабТовары.Номенклатура = СпрАвтомобили.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО ТабТовары.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираГТД
	|		ПО СправочникГТД.Страна = КлассификаторСтранМираГТД.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабТовары.Номенклатура ССЫЛКА Справочник.Автомобили
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	""Услуга"" КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтоработы.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтоработы.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтоработы.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ДоговорыВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах, ""ч"") КАК ЕдиницаИзмеренияНаименование,
	|	""356"" КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Коэффициент КАК Коэффициент,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК СпрАвтоработы
	|		ПО ТабТовары.Номенклатура = СпрАвтоработы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО ТабТовары.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ПО ТабТовары.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|	И ТабТовары.Номенклатура ССЫЛКА Справочник.Автоработы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураНаАванс()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетФактураВыданный.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СчетФактураВыданный.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	СчетФактураВыданный.Организация КАК Организация,
	|	СчетФактураВыданный.Организация.КПП КАК ОрганизацияКПП,
	|	СчетФактураВыданный.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(Контрагенты.ГоловнойКонтрагент, НЕОПРЕДЕЛЕНО) КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(Контрагенты.КПП, """") КАК КонтрагентКПП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК ПлатежноРасчетныеДокументы,
	|	СчетФактураВыданный.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	СчетФактураВыданный.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО СчетФактураВыданный.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО СчетФактураВыданный.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО СчетФактураВыданный.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаСчетФактураНаАванс()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Прочее"" КАК ТипНоменклатуры,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Код КАК КодИлиАртикулНоменклатуры
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияТоваров()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ДанныеШапки.Контрагент КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.РеализацияТоваров КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияТоваров()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ТабТовары.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СправочникГТД.Страна
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.Код
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.УчастникЕАЭС
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО ТабТовары.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираГТД
	|		ПО СправочникГТД.Страна = КлассификаторСтранМираГТД.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиДокументаРеализацияТоваров()
	
	Результат = УПД970_ТекстЗапросаКодовМаркировкиОбщее("РеализацияТоваров");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализации()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ДанныеШапки.Контрагент КАК Грузополучатель,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализации()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ТабТовары.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СправочникГТД.Страна
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.Код
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.УчастникЕАЭС
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО ТабТовары.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираГТД
	|		ПО СправочникГТД.Страна = КлассификаторСтранМираГТД.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТабРаботы.Ссылка,
	|	ТабРаботы.НомерСтроки,
	|	"""",
	|	""Услуга"",
	|	ТабРаботы.Работа,
	|	ВЫРАЗИТЬ(СпрАвтоработы.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрАвтоработы.Наименование КАК СТРОКА(1000)),
	|	СпрАвтоработы.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(ДоговорыВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах, ""ч""),
	|	""356"",
	|	"""",
	|	ТабРаботы.Количество,
	|	ТабРаботы.Цена,
	|	ТабРаботы.СтавкаНДС,
	|	ТабРаботы.СуммаНДС,
	|	ТабРаботы.СуммаВсего - ТабРаботы.СуммаНДС,
	|	ТабРаботы.СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализации.Работы КАК ТабРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК СпрАвтоработы
	|		ПО ТабРаботы.Работа = СпрАвтоработы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК ДанныеШапки
	|		ПО ТабРаботы.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ТабРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиДокументаКорректировкаРеализации()
	
	Результат = УПД970_ТекстЗапросаКодовМаркировкиОбщее("КорректировкаРеализации");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ДанныеШапки.Контрагент КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.РеализацияАвтомобилей КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабАвтомобили.Ссылка КАК Ссылка,
	|	ТабАвтомобили.НомерСтроки КАК НомерСтроки,
	|	""Товар"" КАК ТипНоменклатуры,
	|	ТабАвтомобили.Автомобиль КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрАвтомобили.VIN КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	"""" КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.шт) КАК ЕдиницаИзмерения,
	|	""шт"" КАК ЕдиницаИзмеренияНаименование,
	|	""796"" КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТабАвтомобили.Количество КАК Количество,
	|	ТабАвтомобили.Цена КАК Цена,
	|	ТабАвтомобили.СтавкаНДС КАК СтавкаНДС,
	|	ТабАвтомобили.СуммаНДС КАК СуммаНДС,
	|	ТабАвтомобили.СуммаВсего - ТабАвтомобили.СуммаНДС КАК СуммаБезНДС,
	|	ТабАвтомобили.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК ТабАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабАвтомобили.Автомобиль = СпрАвтомобили.Ссылка
	|ГДЕ
	|	ТабАвтомобили.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаКорректировкаРеализацииАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ДанныеШапки.Контрагент КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.КорректировкаРеализацииАвтомобилей КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаКорректировкаРеализацииАвтомобилей()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабАвтомобили.Ссылка КАК Ссылка,
	|	ТабАвтомобили.НомерСтроки КАК НомерСтроки,
	|	""Товар"" КАК ТипНоменклатуры,
	|	ТабАвтомобили.Автомобиль КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрАвтомобили.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрАвтомобили.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	"""" КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	"""" КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.шт) КАК ЕдиницаИзмерения,
	|	""шт"" КАК ЕдиницаИзмеренияНаименование,
	|	""796"" КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТабАвтомобили.Количество КАК Количество,
	|	ТабАвтомобили.Цена КАК Цена,
	|	ТабАвтомобили.СтавкаНДС КАК СтавкаНДС,
	|	ТабАвтомобили.СуммаНДС КАК СуммаНДС,
	|	ТабАвтомобили.СуммаВсего - ТабАвтомобили.СуммаНДС КАК СуммаБезНДС,
	|	ТабАвтомобили.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК ТабАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК СпрАвтомобили
	|		ПО ТабАвтомобили.Автомобиль = СпрАвтомобили.Ссылка
	|ГДЕ
	|	ТабАвтомобили.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаРеализацияАгентскихУслуг()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.РеализацияТоваров КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаРеализацияАгентскихУслуг()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	""Услуга"" КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаАктОбОказанииУслуг()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.РеализацияТоваров КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаАктОбОказанииУслуг()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	""Услуга"" КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаЗаказНаряд()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.ЗаказНаряд КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаЗаказНаряд()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Порядок,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	""Товар"" КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СправочникГТД.Страна
	|		КОГДА СпрНоменклатура.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.Код
	|		КОГДА СпрНоменклатура.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.УчастникЕАЭС
	|		КОГДА СпрНоменклатура.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ЗаказНаряд.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО СпрНоменклатура.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираГТД
	|		ПО СправочникГТД.Страна = КлассификаторСтранМираГТД.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТабРаботы.Ссылка,
	|	ТабРаботы.НомерСтроки,
	|	""Услуга"",
	|	ТабРаботы.Работа,
	|	ВЫРАЗИТЬ(СпрАвтоработы.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрАвтоработы.Наименование КАК СТРОКА(1000)),
	|	СпрАвтоработы.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(ДоговорыВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах, ""ч""),
	|	""356"",
	|	"""",
	|	ТабРаботы.Количество,
	|	ТабРаботы.Цена,
	|	ТабРаботы.СтавкаНДС,
	|	ТабРаботы.СуммаНДС,
	|	ТабРаботы.СуммаВсего - ТабРаботы.СуммаНДС,
	|	ТабРаботы.СуммаВсего,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаказНаряд.Работы КАК ТабРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы КАК СпрАвтоработы
	|		ПО ТабРаботы.Работа = СпрАвтоработы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ДанныеШапки
	|		ПО ТабРаботы.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ТабРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомитенту()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	"""" КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомитенту()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Услуга"" КАК ТипНоменклатуры,
	|	""Запасы"" КАК ИмяТабличнойЧасти,
	|	1 КАК ИдентификаторСтроки,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	"""" КАК ХарактеристикаНоменклатурыНаименование,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаОтчетКомиссионера()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ДанныеШапки.Контрагент КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	"""" КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаОтчетКомиссионера()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СправочникГТД.Страна
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.Код
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.УчастникЕАЭС
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ОтчетКомиссионера.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО ТабТовары.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираГТД
	|		ПО СправочникГТД.Страна = КлассификаторСтранМираГТД.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаВозвратПоставщику()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.ПодразделениеКомпании КАК Подразделение,
	|	ЕСТЬNULL(Подразделения.Организация, НЕОПРЕДЕЛЕНО) КАК ГоловноеПодразделение,
	|	ЕСТЬNULL(Подразделения.КПП, """") КАК ПодразделениеКПП,
	|	ЕСТЬNULL(Подразделения.Наименование, """") КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ДанныеШапки.Организация КАК Грузоотправитель,
	|	ДанныеШапки.Контрагент КАК Грузополучатель,
	|	ДанныеШапки.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Контрагенты.ОсновнойБанковскийСчет КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосКонтракта,
	|	ДанныеШапки.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДоговорДата,
	|	ДоговорыВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК Подразделения
	|		ПО ДанныеШапки.ПодразделениеКомпании = Подразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеШапки.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|		ПО ДанныеШапки.ДоговорВзаиморасчетов = ДоговорыВзаиморасчетов.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличныхДанныхДокументаВозвратПоставщику()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабТовары.Ссылка КАК Ссылка,
	|	ТабТовары.НомерСтроки КАК НомерСтроки,
	|	ТабТовары.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НоменклатураПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК НоменклатураНаименование,
	|	СпрНоменклатура.Артикул КАК КодНоменклатуры,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СпрХарактеристикиНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СправочникГТД.Страна
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(СпрНоменклатура.СтранаПроисхождения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.Код
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.Код, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникГТД.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираГТД.УчастникЕАЭС
	|		КОГДА ТабТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		КОГДА ЕСТЬNULL(КлассификаторСтранМира.НужнаГТД, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ЕСТЬNULL(КлассификаторСтранМира.УчастникЕАЭС, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(СправочникГТД.Наименование, """") КАК НомерГТД,
	|	ТабТовары.Количество КАК Количество,
	|	ТабТовары.Цена КАК Цена,
	|	ТабТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТабТовары.СуммаНДС КАК СуммаНДС,
	|	ТабТовары.СуммаВсего - ТабТовары.СуммаНДС КАК СуммаБезНДС,
	|	ТабТовары.СуммаВсего КАК СуммаВсего,
	|	СпрНоменклатура.Прослеживаемый КАК ПрослеживаемыйТовар
	|ИЗ
	|	Документ.ВозвратПоставщику.Товары КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
	|		ПО ТабТовары.ХарактеристикаНоменклатуры = СпрХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТабТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГТД КАК СправочникГТД
	|		ПО ТабТовары.ГТД = СправочникГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираГТД
	|		ПО СправочникГТД.Страна = КлассификаторСтранМираГТД.Ссылка
	|ГДЕ
	|	ТабТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиДокументаВозвратПоставщику()
	
	Результат = УПД970_ТекстЗапросаКодовМаркировкиОбщее("ВозвратПоставщику");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаКодовМаркировкиОбщее(ТипДокумента)
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабКодыМаркировки.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ТабКодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЛОЖЬ КАК Обработан
	|ИЗ
	|	Документ.РеализацияТоваров.КодыМаркировки КАК ТабКодыМаркировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК ТабТовары
	|		ПО ТабКодыМаркировки.Ссылка = ТабТовары.Ссылка
	|			И ТабКодыМаркировки.ИдентификаторТовара = ТабТовары.ИдентификаторТовара
	|ГДЕ
	|	ТабКодыМаркировки.Ссылка = &Ссылка";
	
	БазовыйТипДокумента = "РеализацияТоваров";
	Результат = СтрЗаменить(Результат, БазовыйТипДокумента, ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Исходные данные по документам. Тексты запросов

//} УПД970. Исходные данные по документам

//{ УПД970. Служебные процедуры и функции

Функция УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента)
	
	Результат = Неопределено;
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		Результат = УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу);
		
	Иначе
		
		Результат = УПД970_ОбстоятельстваФормированияУПД(ДанныеПоДокументу);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияУПД(ДанныеПоДокументу)
	
	Результат = Неопределено;
	
	Если ДанныеПоДокументу.ЭтоДоговорСКомиссионером Тогда
		Результат = "00005";
	КонецЕсли;
	
	Если ДанныеПоДокументу.ЭтоДоговорСКомитентом Тогда
		Результат = "00007";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу)
	
	Перем Результат;
	
	ЭтоКомиссионнаяТорговля = (ДанныеПоДокументу.ЭтоДоговорСКомитентом Или ДанныеПоДокументу.ЭтоДоговорСКомиссионером);
	
	Если ДанныеПоДокументу.ЭтоСчетФактураНаАванс Тогда
		Результат = "2";
	ИначеЕсли ЭтоКомиссионнаяТорговля Тогда
		Результат = "1";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияПередачиТоваровПоОснованиюСчетФактураВыданный(ДокументОснования)
	
	РеквизитыДокумента = "ДоговорВзаиморасчетов.НомерДоговора, ДоговорВзаиморасчетов.ДатаНачала";
	
	ЗначенияРеквизитовДокумента = ЗначенияРеквизитовОбъектаЛок(ДокументОснования, РеквизитыДокумента);
	
	Результат = УПД970_РеквизитыОснованияПередачиТоваров(
		ЗначенияРеквизитовДокумента.ДоговорВзаиморасчетовНомерДоговора,
		ЗначенияРеквизитовДокумента.ДоговорВзаиморасчетовДатаНачала
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияПередачиТоваров(НомерДоговора, ДатаДоговора)
	
	Результат = Новый Массив;
	
	РеквизитыОснования = Новый Структура;
	РеквизитыОснования.Вставить("Наименование", "Договор");
	РеквизитыОснования.Вставить("Номер", НомерДоговора);
	РеквизитыОснования.Вставить("Дата", ДатаДоговора);
	
	Результат.Добавить(РеквизитыОснования);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ОбновитьГрузополучателяПоДаннымСчетФактуры(СведенияОГрузополучателе, Грузополучатель, ДатаДокумента)
	
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОГрузополучателе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
		Грузополучатель,
		ДатаДокумента
	);
	
КонецПроцедуры

Функция УПД970_СведенияОбУчастникахЭДО(ДанныеШапки)
	
	// Продавец
	
	СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		ДанныеШапки.Организация,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетОрганизации
	);
	
	ЭтоОПНаОбщемБалансе = ЗначениеЗаполнено(ДанныеШапки.ПодразделениеКПП);
	
	Если ЭтоОПНаОбщемБалансе Тогда
		КППОрганизации = ДанныеШапки.ПодразделениеКПП;
	Иначе
		КППОрганизации = СведенияОбОрганизации.КПП;
	КонецЕсли;
	
	СведенияОбОрганизации.КПП = КППОрганизации;
	
	// Покупатель
	Если ЗначениеЗаполнено(ДанныеШапки.ГоловнойКонтрагент) Тогда
		Контрагент = ДанныеШапки.ГоловнойКонтрагент;
	Иначе
		Контрагент = ДанныеШапки.Контрагент;
	КонецЕсли;
	
	СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Контрагент,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетКонтрагента
	);
	
	Если ЗначениеЗаполнено(ДанныеШапки.ГоловнойКонтрагент) Тогда
		СведенияОКонтрагенте.КПП = ДанныеШапки.КонтрагентКПП;
	КонецЕсли;
	
	// Грузоотправитель
	Если ЭтоОПНаОбщемБалансе Тогда
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДО(ДанныеШапки.Организация, ДанныеШапки.Дата);
		
		СведенияОГрузоотправителе.Ссылка = ДанныеШапки.Подразделение;
		СведенияОГрузоотправителе.Адрес = УПД970_СведенияОФактическомАдресе(ДанныеШапки.Подразделение, ДанныеШапки.Дата);
		СведенияОГрузоотправителе.Наименование = ДанныеШапки.ПодразделениеНаименование;
		СведенияОГрузоотправителе.КПП = ДанныеШапки.ПодразделениеКПП;
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузоотправитель,
			ДанныеШапки.Дата
		);
		
	Иначе
		
		СведенияОГрузоотправителе = Неопределено;
		
	КонецЕсли;
	
	// Грузополучатель
	СведенияОГрузополучателе = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		
		СведенияОГрузополучателе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузополучатель,
			ДанныеШапки.Дата
		);
		
	КонецЕсли;
	
	Результат = УПД970_Контракт_УчастникиЭДО();
	Результат.Организация = СведенияОбОрганизации;
	Результат.Контрагент = СведенияОКонтрагенте;
	Результат.Грузоотправитель = СведенияОГрузоотправителе;
	Результат.Грузополучатель = СведенияОГрузополучателе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсЮрАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсФактАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_Контракт_ДанныеУчастникаЭДО();
	
	Результат.Ссылка = Ссылка;
	Результат.Наименование = ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("Наименование"));
	Результат.ИНН = СокрЛП(ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("ИНН")));
	Результат.КПП = ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("КПП"));
	Результат.КодПоОКПО = ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("ОКПО"));
	Результат.НаименованиеБанка = ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("Банк"));
	Результат.НомерСчета = ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("БанковскийСчет"));
	Результат.КоррСчет = СокрЛП(ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("КоррСчет")));
	Результат.БИК = СокрЛП(ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("БИК")));
	Результат.Телефоны = ПредставлениеРеквизитовУчастникаЭДО(Ссылка, Новый Структура("ТелефонРабочий"));
	
	ВидКИАдресЭлектроннойПочты = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
	
	Результат.ЭлектроннаяПочта = АдресЭлектроннойПочты(Ссылка, ВидКИАдресЭлектроннойПочты);
	
	ФормаСобственности = ЗначениеРеквизитаОбъектаЛок(Ссылка, "ФормаСобственности");
	
	Если ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо
		Или ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		
		Результат.ЭтоЮрЛицо = Истина;
	Иначе
		Результат.ЭтоЮрЛицо = Ложь;
	КонецЕсли;
	
	Результат.ЭтоФизЛицо = (ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо);
	
	Если ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		
		Результат.ОГРНИП = УПД970_СведенияОбОГРНИП(Ссылка);
		Результат.ДатаОГРНИП = ЗначениеРеквизитаОбъектаЛок(Ссылка, "ДатаРегистрации");
		
	КонецЕсли;
	
	Если Ссылка.Метаданные().Реквизиты.Найти("СтранаРегистрации") <> Неопределено Тогда
		СтранаРегистрации = ЗначениеРеквизитаОбъектаЛок(Ссылка, "СтранаРегистрации");
		
		ДанныеСтраны = ЗначенияРеквизитовОбъектаЛок(СтранаРегистрации, "Код, Наименование");
		
		Результат.СтранаКод = ДанныеСтраны.Код;
		Результат.СтранаНаименование = ДанныеСтраны.Наименование;
	Иначе
		Результат.СтранаКод = ОсновнаяСтрана().Код;
		Результат.СтранаНаименование = ОсновнаяСтрана().Наименование;
	КонецЕсли;
	
	Результат.Нерезидент = Ложь;
	Результат.Свидетельство = "";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений)
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	ПоляАдреса = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ЮридическийАдрес, ДатаСведений);
	
	Если ПоляАдреса <> Неопределено Тогда
		
		Результат = УПД970_НовыйСведенияОбАдресе();
		
		УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(Результат, ПоляАдреса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений)
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	ПоляАдреса = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ФактическийАдрес, ДатаСведений);
	
	Если ПоляАдреса <> Неопределено Тогда
		
		Результат = УПД970_НовыйСведенияОбАдресе();
		
		УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(Результат, ПоляАдреса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидАдреса, ДатаСведений)
	
	Результат = Неопределено;
	
	ВидКИ = ВидАдресаЮрФизЛица(Ссылка, ВидАдреса);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("Вид", ВидКИ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И Т.Вид = &Вид";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		
		Результат = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		ЗаполнитьТипыАдресныхОбъектов(Результат);
		
		УПД970_АдаптироватьПоляСтруктурыАдресов(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(СведенияОбАдресе, ЗаписьКИ)
	
	СведенияОбАдресе.Представление = ЗаписьКИ.Представление;
	
	Индекс = Неопределено;
	КодСтраны = Неопределено;
	НаименованиеСтраны = Неопределено;
	
	Если Не Общее_ВСтрокеТолькоЦифры(ЗаписьКИ.Поле1) Тогда 
		НаименованиеСтраны = СокрП(ЗаписьКИ.Поле1);
		КодСтраны = ГенерацияXML.КодСтраны(НаименованиеСтраны);
	Иначе
		Индекс = СокрП(ЗаписьКИ.Поле1);
	КонецЕсли;
	
	СведенияОбАдресе.Регион = СокрЛП(ЗаписьКИ.Поле2);
	КодРегиона = УПД970_КодРегиона(СведенияОбАдресе.Регион);
	
	Если ЗначениеЗаполнено(КодРегиона) Тогда // Это структурированный адрес РФ
		
		СведенияОбАдресе.ТипАдреса = АдминистративноТерриториальныйАдрес();
		
		СведенияОбАдресе.Страна = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.Индекс = Индекс;
		СведенияОбАдресе.КодСтраны = ОсновнаяСтрана().Код;
		СведенияОбАдресе.КодРегиона = КодРегиона;
		СведенияОбАдресе.Район = ЗаписьКИ.Поле3;
		СведенияОбАдресе.Город = ЗаписьКИ.Поле4;
		СведенияОбАдресе.НаселенныйПункт = ЗаписьКИ.Поле5;
		СведенияОбАдресе.Улица = ЗаписьКИ.Поле6;
		
		СведенияОбАдресе.Здание.ТипЗдания = ЗаписьКИ.ТипДома;
		СведенияОбАдресе.Здание.Номер = ЗаписьКИ.Поле7;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле8) Тогда
			
			Корпус = Новый Структура;
			Корпус.Вставить("ТипКорпуса", ЗаписьКИ.ТипКорпуса);
			Корпус.Вставить("Номер", ЗаписьКИ.Поле8);
			
			СведенияОбАдресе.Корпуса.Добавить(Корпус);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле9) Тогда
			
			Помещение = Новый Структура;
			Помещение.Вставить("ТипПомещения", ЗаписьКИ.ТипКвартиры);
			Помещение.Вставить("Номер", ЗаписьКИ.Поле9); 
			СведенияОбАдресе.Помещения.Добавить(Помещение);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(КодСтраны) Тогда // Это иностранный или российский адрес в свободной форме
		
		СведенияОбАдресе.КодСтраны = КодСтраны;
		СведенияОбАдресе.Страна = НаименованиеСтраны;
		
	Иначе // Это российский адрес, который не удалось разложить в структуру
		
		СведенияОбАдресе.Страна = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.КодСтраны = ОсновнаяСтрана().Код;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_КодРегиона(Знач НаименованиеРегиона)
	
	Результат = "";
	
	НаименованиеРегиона = Врег(НаименованиеРегиона);
	
	КодыРегионов = ГенерацияXML.КодыРегионов();
	
	Для Каждого КодРегиона Из КодыРегионов Цикл
		
		Если Врег(КодРегиона.Значение) = НаименованиеРегиона Тогда
			Результат = КодРегиона.Ключ;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_АдаптироватьПоляСтруктурыАдресов(СведенияОбАдресе)
	
	ТипСтрока = Тип("Строка");
	
	Если ТипЗнч(СведенияОбАдресе.Страна) <> ТипСтрока Тогда
		СведенияОбАдресе.Страна = НРег(XMLСтрока(СведенияОбАдресе.Страна));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипДома) <> ТипСтрока Тогда
		СведенияОбАдресе.ТипДома = НРег(XMLСтрока(СведенияОбАдресе.ТипДома));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипКвартиры) <> ТипСтрока Тогда
		СведенияОбАдресе.ТипКвартиры = НРег(XMLСтрока(СведенияОбАдресе.ТипКвартиры));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипКорпуса) <> ТипСтрока Тогда
		СведенияОбАдресе.ТипКорпуса = НРег(XMLСтрока(СведенияОбАдресе.ТипКорпуса));
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_СведенияОбОГРНИП(Ссылка)
	
	Результат = "";
	
	Если Ссылка.Метаданные().Реквизиты.Найти("ОГРН") <> Неопределено Тогда
		Результат = ЗначениеРеквизитаОбъектаЛок(Ссылка, "ОГРН");
	ИначеЕсли Ссылка.Метаданные().Реквизиты.Найти("НалоговыйНомер") <> Неопределено Тогда
		Результат = ЗначениеРеквизитаОбъектаЛок(Ссылка, "НалоговыйНомер");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВТабличныхДанныхДокументаНетТоваров(ТабличныеДанные)
	
	ОтборСтрок = Новый Структура("ТипНоменклатуры", УПД970_ТипНоменклатурыТовар());
	СтрокиСТоварами = ТабличныеДанные.НайтиСтроки(ОтборСтрок);
	
	Результат = (СтрокиСТоварами.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыТовар()
	Возврат "Товар";
КонецФункции

Функция УПД970_ТипНоменклатурыУслуга()
	Возврат "Услуга";
КонецФункции

Функция УПД970_НовыйСведенияОбАдресе()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Представление", "");
	Результат.Вставить("ТипАдреса", "");
	Результат.Вставить("Страна", "");
	Результат.Вставить("КодСтраны", "");
	Результат.Вставить("Индекс", "");
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("Регион", "");
	Результат.Вставить("Район", "");
	Результат.Вставить("Город", "");
	Результат.Вставить("ГородСокращение", "");
	Результат.Вставить("НаселенныйПункт", "");
	Результат.Вставить("НаселенныйПунктСокращение", "");
	Результат.Вставить("Улица", "");
	Результат.Вставить("УлицаСокращение", "");
	
	Здание = Новый Структура;
	Здание.Вставить("ТипЗдания", "");
	Здание.Вставить("Номер", "");
	
	Результат.Вставить("Здание", Здание);
	Результат.Вставить("Корпуса", Новый Массив);
	Результат.Вставить("Помещения", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО)
	
	ВидыЮрФизЛиц = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	ЭтоРезидент = НЕ ДанныеУчастникаЭДО.Нерезидент;
	
	Если НЕ ДанныеУчастникаЭДО.ЭтоЮрЛицо
		И НЕ ДанныеУчастникаЭДО.ЭтоФизЛицо
		И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИндивидуальныйПредприниматель;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ЮридическоеЛицо;
		
	ИначеЕсли НЕ ДанныеУчастникаЭДО.ЭтоЮрЛицо И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностранныйГражданин;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо
		И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностраннаяОрганизация;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоФизЛицо Тогда
		
		Результат = ВидыЮрФизЛиц.ФизическоеЛицо;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Не удалось определить тип участника ЭДО.
				|Заполните корректные реквизиты участников ЭДО в базе 1С 
				|(организация, грузоотправитель, контрагент, грузополучатель)'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЦенаБезНДС(Item, ЦенаИзДокумента, Разрядность)
	
	ДопустимоеОтклонение = 0.03;
	
	Если Item.Quantity = 0 Тогда
		
		Результат = 0;
		
	Иначе
		
		Результат = Окр(Item.SubtotalWithVatExcluded / Item.Quantity, Разрядность);
		ОтклонениеВЦене = (Результат - ЦенаИзДокумента) * Item.Quantity;
		
		ОтклонениеВЦенеПоМодулю = Макс(ОтклонениеВЦене, -ОтклонениеВЦене);
		
		Если ОтклонениеВЦенеПоМодулю <= ДопустимоеОтклонение Тогда
			Результат = Окр(ЦенаИзДокумента, Разрядность);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДокументыОтгрузки(ИсходныеДокументы)
	
	Результат = Новый Массив;
	
	Для Каждого ИсходныйДокумент Из ИсходныеДокументы Цикл
		
		ДокументОтгрузки = УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент);
		
		Результат.Добавить(ДокументОтгрузки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент)
	
	Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.КорректировкаРеализации")
		ИЛИ ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		
		ДокументРеализации = ЗначениеРеквизитаОбъектаЛок(ИсходныйДокумент, "ДокументОснование");
		Результат = УПД970_ИсправляемыйДокументОтгрузки(ДокументРеализации);
		
	Иначе
		
		Результат = ИсходныйДокумент;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФДОП() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьТовары(СтрокиТаблицы)
	
	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы)
	
	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования)
	
	ОбязательныеРеквизитыЗаполнены = (РеквизитыОснования <> Неопределено
		И ЗначениеЗаполнено(РеквизитыОснования.Наименование)
		И ЗначениеЗаполнено(РеквизитыОснования.Номер)
		И ЗначениеЗаполнено(РеквизитыОснования.Дата));
	
	Возврат ОбязательныеРеквизитыЗаполнены;
	
КонецФункции

Функция УПД970_СведенияОДокументахОплаты(ПлатежноРасчетныеДокументы) Экспорт
	
	Результат = Новый Массив;
	
	ПлатежноРасчетныеДокументыМассивом = Общее_РазделитьСтроку(ПлатежноРасчетныеДокументы, ";", Ложь);
	
	Для Каждого ПредставлениеПРД Из ПлатежноРасчетныеДокументыМассивом Цикл
		
		Если ПустаяСтрока(ПредставлениеПРД) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерДата = УПД970_ВыделитьНомерДатуИзСтроки(ПредставлениеПРД);
		
		ПлатежныйДокумент = Новый Структура;
		ПлатежныйДокумент.Вставить("НомерДокумента", НомерДата.Номер);
		ПлатежныйДокумент.Вставить("ДатаДокумента", НомерДата.Дата);
		
		Результат.Добавить(ПлатежныйДокумент);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВыделитьНомерДатуИзСтроки(ИсходнаяСтрока)
	
	Подстроки = Общее_РазделитьСтроку(ИсходнаяСтрока, "№");
	СтрокаНомерДата = СокрЛП(Подстроки[Подстроки.ВГраница()]);
	
	Подстроки = Общее_РазделитьСтроку(СтрокаНомерДата, "от", Ложь);
	Номер = СокрЛП(Подстроки[0]);
	
	СтрокаДата = "";
	Если Подстроки.Количество() > 1 Тогда
		СтрокаДата = СокрЛП(Подстроки[1]);
	КонецЕсли;
	
	Подстроки =  Общее_РазделитьСтроку(СтрокаДата, ".");
	
	День = 1;
	Если Подстроки.Количество() > 0 Тогда
		День = СокрЛП(Подстроки[0]);
	КонецЕсли;
	
	Месяц = 1;
	Если Подстроки.Количество() > 1 Тогда
		Месяц = СокрЛП(Подстроки[1]);
	КонецЕсли;
	
	ВИсходнойСтрокеДвеЧасти = 2;
	Год = 1;
	Если Подстроки.Количество() > ВИсходнойСтрокеДвеЧасти Тогда
		Год = Подстроки[2];
		Год = СтрЗаменить(Год, "г.", "");
		Год = СтрЗаменить(Год, "г", "");
		Год = СокрЛП(Год);
	КонецЕсли;
	
	Попытка
		Дата = Дата(Год, Месяц, День);
	Исключение
		Дата = Дата(1, 1, 1);
	КонецПопытки;
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("Дата", Дата);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДобавитьДанныеКодовМаркировкиВТабличныеДанные(
	ТабличныеДанные,
	ДанныеКодовМаркировки,
	ОтборПоИдентификатору)
	
	ТабличныеДанные.Колонки.Добавить("КодыМаркировки");
	
	Если НЕ ЗначениеЗаполнено(ДанныеКодовМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из ТабличныеДанные Цикл
		
		КодыМаркировки = Новый Массив;
		
		ОтборКодовМаркировки = УПД970_ОтборКодовМаркировки(ДанныеСтроки, ОтборПоИдентификатору);
		
		СтрокиКодов = ДанныеКодовМаркировки.НайтиСтроки(ОтборКодовМаркировки);
		
		Для Каждого СтрокаКода Из СтрокиКодов Цикл
			
			КодМаркировки = УПД970_КодМаркировкиБезСкобок(СтрокаКода.КодМаркировки);
			
			КодыМаркировки.Добавить(КодМаркировки);
			
			СтрокаКода.Обработан = Истина;
			
		КонецЦикла;
		
		ДанныеСтроки.КодыМаркировки = КодыМаркировки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УПД970_ОтборКодовМаркировки(ДанныеСтроки, ОтборПоИдентификатору)
	
	Результат = Новый Структура;
	
	Если ОтборПоИдентификатору Тогда
		
		Результат.Вставить("ИдентификаторТовара", ДанныеСтроки.ИдентификаторТовара);
		
	Иначе
		
		Результат.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
		Результат.Вставить("ХарактеристикаНоменклатуры", ДанныеСтроки.ХарактеристикаНоменклатуры);
		Результат.Вставить("Обработан", Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КодМаркировкиБезСкобок(Штрихкод)
	
	Если Не СтрНачинаетсяСЛок(Штрихкод, "(") Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Результат = СтрЗаменить(Штрихкод, "(01)", "01");
	Результат = СтрЗаменить(Результат, "(21)", "21");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеКодовМаркировкиДокументаОснованияСчетФактуры(ДокументОснование)
	
	МетаданныеДокумента = ДокументОснование.Метаданные();
	ЕстьТабличнаяЧастьКодыМаркировки = (МетаданныеДокумента.ТабличныеЧасти.Найти("КодыМаркировки") <> Неопределено);
	
	Если ЕстьТабличнаяЧастьКодыМаркировки Тогда
		
		ТекстЗапроса = УПД970_ТекстЗапросаКодовМаркировкиОбщее(МетаданныеДокумента.Имя);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НаименованиеНоменклатурыСчетФактурыНаАванс(СтрокаТаблицы)
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПолноеНаименование) Тогда
		Результат = СтрокаТаблицы.НоменклатураПолноеНаименование;
	ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураНаименование) Тогда
		Результат = СтрокаТаблицы.НоменклатураНаименование;
	Иначе
		Результат = "Предварительная оплата";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеСчетФактура()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("ДокументыОснования");
	Результат.Вставить("СведенияОДокументахОплаты");
	Результат.Вставить("СведенияОбУчастникахЭДО");
	
	Результат.Вставить("ЭтоСчетФактураНаАванс");
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");
	Результат.Вставить("ОснованияПередачиТоваров");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеПервичногоДокумента()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("ЭтоДоговорСКомиссионером");
	Результат.Вставить("СчетФактура");
	Результат.Вставить("СведенияОбУчастникахЭДО");
	Результат.Вставить("ОснованияПередачиТоваров");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_УчастникиЭДО()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Грузоотправитель");
	Результат.Вставить("Грузополучатель");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеУчастникаЭДО()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("Наименование");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("ЭтоЮрЛицо");
	Результат.Вставить("ЭтоФизЛицо");
	Результат.Вставить("КодПоОКПО");
	Результат.Вставить("ОГРНИП");
	Результат.Вставить("ДатаОГРНИП");
	Результат.Вставить("Телефоны");
	Результат.Вставить("ЭлектроннаяПочта");
	Результат.Вставить("СтранаНаименование");
	Результат.Вставить("СтранаКод");
	Результат.Вставить("Нерезидент");
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации");
	Результат.Вставить("Свидетельство");
	Результат.Вставить("НаименованиеБанка");
	Результат.Вставить("НомерСчета");
	Результат.Вставить("КоррСчет");
	Результат.Вставить("БИК");
	Результат.Вставить("Адрес");
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Служебные процедуры и функции

//{ УПД970. Контракты протоструктуры

Функция Контракт_ПротоструктураУПД970()
	
	ИмяТипа = "Utd970SellerContent";
	
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформация();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформация()
	
	ИмяТипа = "СлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.ContentsDocumentProductsType = Контракт_ContentsDocumentProductsType();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ContentsDocumentProductsType()
	
	ИмяТипа = "ContentsDocumentProductsType";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ExtendedOrganizationInfo970()
	
	ИмяТипа = "ExtendedOrganizationInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияОрганизации();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Shipper970()
	
	ИмяТипа = "Shipper970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияОрганизации()
	
	ИмяТипа = "OrganizationСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressInfo970()
	
	ИмяТипа = "AddressInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressRFInfo()
	
	ИмяТипа = "AddressRFInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressSARInfo()
	
	ИмяТипа = "AddressSARInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressTextInfo()
	
	ИмяТипа = "AddressTextInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressObjectNumberInfo()
	
	ИмяТипа = "AddressObjectNumberInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentShipments970()
	
	ИмяТипа = "DocumentShipment970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_TransferInfo970()
	
	ИмяТипа = "TransferInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_TransferBases970()
	
	ИмяТипа = "TransferBase970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Employee970()
	
	ИмяТипа = "Employee970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_InvoiceTable970()
	
	ИмяТипа = "InvoiceTable970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemTracingInfo970()
	
	ИмяТипа = "ItemTracingInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_CustomDeclarations()
	
	ИмяТипа = "CustomDeclaration";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияСтроки()
	
	ИмяТипа = "ItemСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Item970()
	
	ИмяТипа = "Item970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_PaymentDocumentInfo()
	
	ИмяТипа = "PaymentDocumentInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemIdentificationNumber970()
	
	ИмяТипа = "ItemIdentificationNumber970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Контракты протоструктуры

//} СБОР КОНТЕНТА УПД970

//*****************************************************************************
//{ СБОР КОНТЕНТА ФНС29

Функция СчетФНС29(СсылкаНаОбъект) Экспорт
	Ошибка = "ИнтеграцияААА5: формирование электронных счетов в формате ФНС 29@ не реализовано";
	ВызватьИсключение Ошибка;
КонецФункции

//} СБОР КОНТЕНТА ФНС29
//*****************************************************************************

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция СтрНайтиЛок(Строка, ПодстрокаПоиска)
	
	Результат = Ядро.СтрНайтиЛок(Строка, ПодстрокаПоиска);
	
	Возврат Результат;
	
КонецФункции

Функция СтрСоединитьЛок(Строки, Разделитель = "")
	
	Результат = Ядро.СоединитьСтроку(Строки, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция СтрШаблонЛок(ШаблонСтроки, Параметр1,
	Параметр2 = Неопределено,
	Параметр3 = Неопределено,
	Параметр4 = Неопределено,
	Параметр5 = Неопределено)
	
	Результат = Ядро.ПараметрыВСтроку(ШаблонСтроки, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов)
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если ТипЗнч(МассивСсылок) = Тип("Массив") ИЛИ ТипЗнч(МассивСсылок) = Тип("ФиксированныйМассив") Тогда
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		Если НЕ Метаданные.ОбщиеМодули.Найти("ОбщегоНазначения") = Неопределено Тогда
			СтрокаСообщения = "Неверный тип параметра ""МассивСсылок""";
			Выполнить("ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения)");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция РезультатФункцииОшибка(ОшибкаИлиМассив)
	
	Если ТипЗнч(ОшибкаИлиМассив) = Тип("Массив") Тогда
		КоллекцияОшибок = ОшибкаИлиМассив;
	Иначе
		КоллекцияОшибок = Новый Массив;
		КоллекцияОшибок.Добавить(ОшибкаИлиМассив);
	КонецЕсли;
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(КоллекцияОшибок);
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	// Ограничения типам реквизитов для текущей конфигурации
	ВладелецТип = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов;
	
	НоменклатураТип = МетаданныеРегистра.Измерения.Номенклатура.Тип;
	
	КодТип = МетаданныеРегистра.Реквизиты.Артикул.Тип;
	АртикулТип = МетаданныеРегистра.Реквизиты.Артикул.Тип;
	НаименованиеТип = Новый ОписаниеТипов("Строка");
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, Наименование, Код = "", Артикул = "")
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент	 = Контрагент;
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Код			 = Код;
	НоваяСтрока.Артикул		 = Артикул;
	
КонецПроцедуры

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = ОперацияПоступлениеТоваров();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОперацияПоступлениеТоваров()
	Возврат "ПоступлениеТоваров";
КонецФункции

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки)
		Или ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
	Если Не ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		
		Если Не Документ.Тип.Формализованный Тогда
			Ошибки.Добавить("Документ неформализованный.");
		КонецЕсли;
		
		Ошибки.Добавить("Для этого формата или типа документа нельзя создать документ.");
		Ошибки.Добавить("Сопоставьте документ вручную из карточки документа.");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьФункциюДокумента(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ТипЭД.ФункцияДокумента) Тогда
		ТекстОшибки = "Не задана операция для создания учетного документа!";
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных)
	
	МетаданныеОснованийСФ = Метаданные.Документы.СчетФактураПолученный.ВводитсяНаОсновании;
	Результат = МетаданныеОснованийСФ.Содержит(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	Результат = Ложь;
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Если ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных) Тогда
		
		Результат = (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.СчетФактураПолученный"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Ищем в пакете документ счета-фактуры: если есть, то сразу создаем его в 1С.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Основание для создания счета-фактуры полученного.
//  Документ - Структура - электронный документ (см. Контракт_Документ).
//  ИспользоватьДатуЭД - Булево - Истина, заполнять дату документа из документа ЭДО
//
Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		Или Не ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
	
	Если Не ЗначениеЗаполнено(ЭлектронныйСФ)
		Или ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;

	ДокументОбъект.Записать();
	
	ДатаДокумента = ТекущаяДатаСеанса();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	ДокументСФ.Заполнить(ДокументОбъект.Ссылка);
	ДокументСФ.ВхДокНомер = ЭлектронныйСФ.Реквизиты.Номер;
	ДокументСФ.ВхДокДата = ЭлектронныйСФ.Реквизиты.Дата;
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.Записать();
	
	Если Не ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск счета-фактуры, полученного в одном пакете с указанным электронным документом.
//
// Параметры:
//  Документ - Структура - электронный документ (см. Контракт_Документ).
// 
// Возвращаемое значение:
//  Структура - электронный счет-фактура (см. Контракт_Документ).
//  Неопределено - если в пакете с указанным документом не найден счет-фактура.
//
Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента)
		Или ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) 
				Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(ДокументУчета.ДокументОснование, ДобавляемыйКомментарий);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПроверитьЗаполнениеДокумента(ДокументОбъект, Ошибки, ОтключитьПроверкуСопоставленияНоменклатуры)
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОтключитьПроверкуСопоставленияНоменклатуры Тогда	
		
		ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки)
	
	ПроверяемыеТаблицы = Новый Структура;
	ПроверяемыеТаблицы.Вставить("Товары", Неопределено);
	ПроверяемыеТаблицы.Вставить("Услуги", Неопределено);
	
	ЗаполнитьЗначенияСвойств(ПроверяемыеТаблицы, ДокументОбъект);
	
	Для Каждого ЭлементСтруктуры Из ПроверяемыеТаблицы Цикл
		
		ПроверяемаяТаблица = ЭлементСтруктуры.Значение;
		
		Если ПроверяемаяТаблица = Неопределено
			Или ЗначениеЗаполнено(Ошибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТовар Из ПроверяемаяТаблица Цикл
			
			Номенклатура = СтрокаТовар.Номенклатура;
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				
				ТекстОшибки = НСтр(
						"ru = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.';
						|en = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.'"
					);
				
				Ошибки.Добавить(ТекстОшибки);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция Общее_СтрокаВДату(Значение)
	
	ИнтерфейсАА5 = ОбщийМодульПоИмениЛок("сфпСтроковыеФункцииКлиентСервер");
	Результат = ИнтерфейсАА5.СтрокаВДату(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция ВидАдресаЮрФизЛица(Ссылка, ТипАдреса)
	
	Результат = Неопределено;
	
	ВидыКИЮридическийАдрес = Перечисление_ВидыКонтактнойИнформации().ЮридическийАдрес;
	
	Если ТипАдреса = ВидыКИЮридическийАдрес Тогда
		ВидЭлементаКИ = "АдресЮридический";
	Иначе
		ВидЭлементаКИ = "АдресФактический";
	КонецЕсли;
	
	Результат = Справочники.ВидыКонтактнойИнформации[ВидЭлементаКИ];
	
	Возврат Результат;
	
КонецФункции

Функция НоваяЗаписьКонтактнойИнформации()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипАдреса");
	Результат.Вставить("Представление");
	Результат.Вставить("КодСтраны");
	Результат.Вставить("Страна");
	Результат.Вставить("Поле1");
	Результат.Вставить("Поле2");
	Результат.Вставить("Поле3");
	Результат.Вставить("Поле4");
	Результат.Вставить("Поле5");
	Результат.Вставить("Поле6");
	Результат.Вставить("Поле7");
	Результат.Вставить("Поле8");
	Результат.Вставить("Поле9");
	Результат.Вставить("Поле10");
	Результат.Вставить("ТипДома", "дом");
	Результат.Вставить("ТипКорпуса", "корпус");
	Результат.Вставить("ТипКвартиры", "кв.");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТипыАдресныхОбъектов(ЗначенияПолей)
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипДома) Тогда 
		ЗначенияПолей.ТипДома = "дом";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКорпуса) Тогда 
		ЗначенияПолей.ТипКорпуса = "корпус";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКвартиры) Тогда 
		ЗначенияПолей.ТипКвартиры = "кв.";
	КонецЕсли;
	
КонецПроцедуры

Функция АдминистративноТерриториальныйАдрес()
	
	Результат = "Административно-территориальный";
	
	Возврат Результат;
	
КонецФункции

Функция ОсновнаяСтрана()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "РОССИЯ");
	Результат.Вставить("Код", "643");
	
	Возврат Результат;
	
КонецФункции

Функция АдресЭлектроннойПочты(Объект, ВидАдреса)
	
	Результат = "";
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &ВидАдреса
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Объект"	 , Объект);
	Запрос.УстановитьПараметр("ВидАдреса", ВидАдреса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Представление;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	Возврат "без НДС";
КонецФункции

Функция ХозОперацияДокументаРавнаУказанной(ДокСсылка, ХозОперацияДокумента)
	
	ХозОперацияВДокументе = ЗначениеРеквизитаОбъектаЛок(ДокСсылка, "ХозОперация");
	
	Результат = (ХозОперацияВДокументе = ХозОперацияДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	
	Если ТипОбъекта = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		ТабДокумент = ДокументОбъект.ПечатьСчетНаОплату(Новый ТабличныйДокумент);
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплатуВPDF";
		
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили") Тогда
		
		ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		ТабДокумент = ДокументОбъект.ПечатьСчетНаОплатуЗаАвтомобили(Новый ТабличныйДокумент);
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьСчетНаОплатуЗаАвтомобилиВPDF";
		
	Иначе
		
		Ошибка = СтрШаблон(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	УстановитьПоляТабличногоДокумента(ТабДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции

// Заполняет модель данных электронного счета на оплату.
//
// Параметры:
//  * Шапка - Контракт шапки неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  * ТабличнаяЧасть - Контракт табличной части неформализованного счета на оплату по форме ДД (см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату() 
//  * ОснованиеЭлектронногоСчета - ЛюбаяСсылка - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанные(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета) Экспорт
	
	Ошибка = "Отправка счетов на оплату по форме Диадока не поддерживается в вашей конфигурации!";
	ВызватьИсключение Ошибка;
	
КонецПроцедуры

Функция АктыСверок_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	Если ТипОбъекта <> Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда
		
		Ошибка = СтрШаблонЛок(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ТабДокумент = СсылкаНаОбъект.ПолучитьОбъект().ПечатьАктСверки(Новый ТабличныйДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//{ Взаимодействие с библиотекой ГенерацияXML

Функция ФункцияДокументаУПД_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции

Функция ФункцияДокументаУПД_ДОП()
	Возврат ГенерацияXML_ФункцииУПД().ДОП;
КонецФункции

Функция ФункцияДокументаУПД_СЧФДОП()
	Возврат ГенерацияXML_ФункцииУПД().СЧФДОП;
КонецФункции

Функция ГенерацияXML_ФункцииУПД()
	Результат = ГенерацияXML.Перечисление_ФункцииУПД();
	Возврат Результат;	
КонецФункции

Функция ГенерацияXML_Перечисление_ВидыЮрФизЛиц()
	
	Результат = ГенерацияXML.Перечисление_ВидыЮрФизЛиц();
	Возврат Результат;
	
КонецФункции

Функция ГенерацияXML_КодыРегионов()
	
	Результат = ГенерацияXML.КодыРегионов();
	Возврат Результат;
	
КонецФункции

Функция Новый_ЭлементПрото(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы);
	
	Возврат Результат;
	
КонецФункции

//} Взаимодействие с библиотекой ГенерацияXML

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность = "")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция КатегорииПакетов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"ОсновнойПакет");
	Результат.Вставить("КорректировочныйПакет", "КорректировочныйПакет");
	Результат.Вставить("СчетФактураНаАванс", 	"СчетФактураНаАванс");
	Результат.Вставить("СчетНаОплату", 			"СчетНаОплату");
	Результат.Вставить("АктCверки", 			"АктCверки");
	Результат.Вставить("ЗаказНаряд", 			"ЗаказНаряд");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКатегории()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"Первичные документы");
	Результат.Вставить("КорректировочныйПакет", "Корректировочные документы");
	Результат.Вставить("СчетФактураНаАванс", 	"Счет-фактура на аванс");
	Результат.Вставить("СчетНаОплату", 			"Счет на оплату");
	Результат.Вставить("АктCверки", 			"Акт сверки");
	Результат.Вставить("ЗаказНаряд", 			"Заказ-наряд");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНаименованияКатегорийПакетов(ТЗ)
	
	НаименованиеКатегории = НаименованиеКатегории();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.КатегорияПакета) Тогда
			СтрокаТЗ.НаименованиеКатегории = НаименованиеКатегории[СтрокаТЗ.КатегорияПакета];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция МожноСформироватьПередаточныйДокумент(Документ1С)
	
	Результат = Истина;
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ЗаказНаряд"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	Если ИсключаемыеТипы.Найти(ТипДокумента) <> Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоУслуги = ДокументСодержитТолькоУслуги(Документ1С);
	ВидДокумента = "ID_ТОРГ12";
	
	Если ТолькоУслуги Тогда
		ВидДокумента = "ID_АктФормализованный";
	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, ВидДокумента);
	
КонецПроцедуры

Функция ДокументСодержитТолькоУслуги(Документ1С)
	
	Результат = Истина;
	
	ЕстьТовары = Документ1С.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено;
	ЕстьАвтомобили = Документ1С.Метаданные().ТабличныеЧасти.Найти("Автомобили") <> Неопределено;
	ЭтоОтчетКомитенту = ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомитенту");
	
	Если ЕстьАвтомобили Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ЕстьТовары И Не ЭтоОтчетКомитенту Тогда
		
		ШаблонЗапроса =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК ВсегоСтрок,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТЧ.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыУслуга
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьУслуги,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ ТЧ.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыУслуга
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьТовары
		|ИЗ
		|	&ПолноеИмяТаблицы КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &СсылкаНаОбъект";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СсылкаНаОбъект", Документ1С);
		Запрос.УстановитьПараметр("ВидНоменклатурыУслуга", Перечисления.ВидыНоменклатуры.Услуга);
		
		ПолноеИмяТаблицы = СтрШаблонЛок("%1.%2", Документ1С.Метаданные().ПолноеИмя(), "Товары");
		
		Запрос.Текст = СтрЗаменить(ШаблонЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ВсегоСтрок > 0 Тогда
				Результат = Выборка.ЕстьУслуги И Не Выборка.ЕстьТовары;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Результат)
		
	// Ищем ТОРГ-12 или УПД, относящийся к другому (не к текущему) пакету, и находящийся в статусе "Требуется подпись" или "Подписан".
	// Еще искомый документ должен быть уже проверен и признан "хорошим" (возможно, его еще не подписали, но уже проверили)
	// Если такой есть, то по текущему документу будем отказывать в подписи, т.к. это дубль
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить("XmlTorg12");
	ТипыДокументов.Добавить("UniversalTransferDocument");
	
	Статусы  = Новый Массив;
	Статусы.Добавить("Подписан");
	Статусы.Добавить("Требуется подпись");
	
	Если ОсновнойМодуль.ЭДО_Использовать1СЭДО() Тогда 
		//TODO добавить проверку дублей для 1С-ЭДО
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.АнализПроведен КАК АнализПроведен,
		|	Диадок_Документы.ТекстОшибки КАК ОшибкиПроверкиТекст
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка <> &ТекущийДокументДД
		|	И Диадок_Документы.LetterId <> &LetterId
		|	И Диадок_Документы.Документ = &Документ1С
		|	И (Диадок_Документы.Направление = ""Inbound"" или Диадок_Документы.Направление = ""Входящее"" )  //переходный период перед релизом 1.0.0
		|	И Диадок_Документы.ТипДокумента В(&ТипДокумента)
		|	И Диадок_Документы.АнализПроведен
		|	И Диадок_Документы.Статус В(&Статусы)
		|	И Выразить(Диадок_Документы.ТекстОшибки как строка(1)) = """"     //  ТекстОшибки сейчас неограниченная строка. Выразить работает в сторону уменьшения длины, но не увеличения
		//|	И Диадок_Документы.ДатаЗагрузки <= &ДатаЗагрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диадок_Документы.ДатаЗагрузки";
		
		Запрос.УстановитьПараметр("ТекущийДокументДД",	ДокументДД);
		Запрос.УстановитьПараметр("Документ1С",			Документ1С);
		Запрос.УстановитьПараметр("ТипДокумента",		ТипыДокументов);
		Запрос.УстановитьПараметр("Статусы",			Статусы);		
		Запрос.УстановитьПараметр("LetterId",			ДокументДД.LetterId);
		Запрос.УстановитьПараметр("ДатаЗагрузки",		ДокументДД.ДатаЗагрузки);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 И ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда
			Док = Выборка[0].Ссылка;
			Результат.Добавить("ДУБЛИКАТ: накладная уже была учтена в электронном виде (дата " + формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy")
			+ ", номер " + Док.НомерДокумента + ", загружен из Диадок " + Док.ДатаЗагрузки + ")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат =
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Документ,
	|	СчетФактура.Номер КАК НомерДокумента,
	|	СчетФактура.Дата КАК ДатаДокумента,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.Организация КАК Организация,
	|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетФактура.Проведен
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданный)
	|	И НЕ СчетФактура.Исправление
	|	И НЕ &ПлатежныеДокументыОснования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка,
	|	СчетФактура.Номер,
	|	СчетФактура.Дата,
	|	СчетФактура.Контрагент,
	|	СчетФактура.Организация,
	|	СчетФактура.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И НЕ СчетФактура.ПометкаУдаления
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетФактура.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданный)
	|	И НЕ СчетФактура.Исправление
	|	И НЕ &ПлатежныеДокументыОснования";
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
										   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Исправление", "СчетФактура.Исправление");
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");

	Если ВидСчетаФактуры = "НаАванс" Тогда
		
		Результат = СтрЗаменить(Результат, "НЕ &ПлатежныеДокументыОснования", "&ПлатежныеДокументыОснования");	
		
	ИначеЕсли ВидСчетаФактуры = "Корректировочный" Тогда
		
		Результат = СтрЗаменить(Результат, "ХозОперации.СчетФактураВыданный", "ХозОперации.СчетФактураВыданныйКорректировка");
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПлатежныеДокументыОснования",	"(ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.Выписка)
																		|ИЛИ ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ПриходныйКассовыйОрдер))");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета, Исправление);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	   		    	        	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;

	Результат =
	"ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
	|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И ВТ_ДокументыБезНДС.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
	|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";	
	    	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(Результат, "И (ВТ_ДокументыБезНДС.ЭтоИсправление)", "И (НЕ ВТ_ДокументыБезНДС.ЭтоИсправление)");
	КонецЕсли;

	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		Результат = СтрЗаменить(Результат, "И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)", "И (ВТ_ДокументыБезНДС.ЭтоКорректировка)");
	КонецЕсли;

	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
										   
	Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
									   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
										   
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета, , Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
	|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
	|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
	|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
	|	СчетНаОплатуПокупателю.Организация КАК Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
	|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
	|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ЗаказНаряды(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК Документ,
	|	ЗаказНаряд.Номер КАК НомерДокумента,
	|	ЗаказНаряд.Дата КАК ДатаДокумента,
	|	ЗаказНаряд.Заказчик КАК Контрагент,
	|	ЗаказНаряд.Организация КАК Организация,
	|	ЗаказНаряд.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ЗаказНаряд.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ЗаказНаряд.Заказчик = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ЗаказНаряд.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ЗаказНаряд.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаказНаряд.Проведен
	|	И ЗаказНаряд.ВидРемонта.ТипРемонта = ЗНАЧЕНИЕ(Перечисление.ТипыРемонта.Платный)";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета, Исправление = Ложь, БезНДС = Ложь)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	ПодстрокаПоиска = "ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета";
	
	Если ОсновнойМодуль.ИспользоватьПодсистемуДиадока()
		И НЕ Исправление 
		И НЕ БезНДС Тогда
		
		Если ЗначениеЗаполнено(КатегорияПакета) Тогда
			ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """";
		Иначе
			ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID;
		КонецЕсли;
		
	Иначе
		ПодстрокаЗамены = "ИСТИНА";
	КонецЕсли;

	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Результат = Ядро.СписокНаОтправку_ТекстЗапроса_ВременныеТаблицы();
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВТДокументыБезНДС()
			
	Результат = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.ЭтоИсправление,
	|	ВТ_ПодходящиеДокументы.ЭтоКорректировка,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданный.Ссылка ЕСТЬ NULL"; 
	
	Возврат Результат;
			
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	 
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияАвтомобилей", "Автомобили");

	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваров", "Товары");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Работы", ТекстОтбораДокументов, "Истина");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, , "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Работы", ТекстОтбораДокументов, , "Истина");

	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументахРеализацииАвтомобилей();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализацииАвтомобилей", "Автомобили", ТекстОтбораДокументов, "Истина");

	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторонРеализацииАвтомобилей();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализацииАвтомобилей", "Автомобили", ТекстОтбораДокументов, , "Истина");

	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь", Корректировка = "Ложь")
	
	ТЧ	= "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;

	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК ЭтоИсправление,
	|	&Корректировка КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	Результат = СтрЗаменить(Результат, "&Корректировка", Корректировка);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
			
КонецПроцедуры

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ХозОперация = 
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ХозОперация = 
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументахРеализацииАвтомобилей()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ХозОперация = 
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторонРеализацииАвтомобилей()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ХозОперация = 
	|	ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейКорректировкаПоСогласованиюСторон)";
	
	Возврат Результат;
	
КонецФункции

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	ИначеЕсли TypeNamedId = "InvoiceCorrection" ИЛИ TypeNamedId = "InvoiceCorrectionRevision" Тогда
		Результат = "КСЧФ";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ, ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы = Неопределено, ДопПараметры = Неопределено)
	
	ДвоичныеДанные	= ВнешняяПечатнаяФорма.Хранилище.Получить();
	ИмяФайла		= ПолучитьИмяВременногоФайла();
	
	ДвоичныеДанные.Записать(ИмяФайла);
	
	// BSLLS:UsingExternalCodeTools-off
	ОбработкаПФ = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
	// BSLLS:UsingExternalCodeTools-on
	
	УдалитьФайлы(ИмяФайла);
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	ТабДок = Новый ТабличныйДокумент;
	
	ТабличныйДокумент = ОбработкаПФ.Печать(ДокументОбъект, ТабДок);

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
	ИмяФайла = ВнешняяПечатнаяФорма.Наименование + " № " + Документ.Номер + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
	
	ИмяФайла = ЗаменитьНедопустимыеСимволы(ИмяФайла);
	
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(СтрокаОбработки)
	
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(СтрокаОбработки, ТекСимвол) <> 0 Тогда
			СтрокаОбработки = СтрЗаменить(СтрокаОбработки, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат СтрокаОбработки;
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Процедура ДобавитьЗначениеВСписок(Список, Значение, Представление)
	
	Если Список.НайтиПоЗначению(Значение) = Неопределено Тогда
		Список.Добавить(Значение, Представление);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - Докумена учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПредставлениеНомера(Документ)
	
	СокращенныйНомер = Ложь;
	
	Результат = Вычислить("дкПолучитьНомерДляПечати(Документ, СокращенныйНомер)");
	
	Возврат Результат;
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

Функция ЭтоСчетФактураНаАванс(ДокСсылка)
	
	Результат = Ложь;
	
	ДокументОснование = ЗначениеРеквизитаОбъектаЛок(ДокСсылка, "ДокументОснование");
	
	ТипДокументаОснование = ТипЗнч(ДокументОснование);
	
	Результат = (ТипДокументаОснование = Тип("ДокументСсылка.Выписка") 
		Или ТипДокументаОснование = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
	);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактура(ДокСсылка)
	
	Результат = (ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправлениеРеализации(ДокСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ХозОперацияИсправление = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах;
		
		Результат = ХозОперацияДокументаРавнаУказанной(ДокСсылка, ХозОперацияИсправление);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправлениеРеализацииАвтомобилей(ДокСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		
		ХозОперацияИсправление = Справочники.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах;
		
		Результат = ХозОперацияДокументаРавнаУказанной(ДокСсылка, ХозОперацияИсправление);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеализацияАгентскихУслуг(ДокСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		ХозОперацияАгентскиеУслуги = Справочники.ХозОперации.РеализацияАгентскихУслуг;
		
		Результат = ХозОперацияДокументаРавнаУказанной(ДокСсылка, ХозОперацияАгентскиеУслуги);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоАктОбОказанииУслуг(ДокСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		ХозОперацияАктОбОказанииУслуг = Справочники.ХозОперации.АктОбОказанииУслуг;
		
		Результат = ХозОперацияДокументаРавнаУказанной(ДокСсылка, ХозОперацияАктОбОказанииУслуг);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Общее_СтрокаТаблицыЗначенийВСтруктуру(СтрокаТЗ)
	
	Результат = Новый Структура;
	
	Для Каждого Колонка Из СтрокаТЗ.Владелец().Колонки Цикл
		
		Результат.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКонтактнойИнформации() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес", "ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	Результат.Вставить("Телефон", "Телефон");
	Результат.Вставить("Факс", "Факс");
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)
	
	ЭлементыАдресногоОбъекта = Новый Массив;
	ЭлементыАдресногоОбъекта.Добавить(Элемент1);
	ЭлементыАдресногоОбъекта.Добавить(Элемент2);
	
	Результат = СокрЛП(СтрСоединитьЛок(ЭлементыАдресногоОбъекта, " "));
	
	Возврат Результат;
	
КонецФункции

Функция Общее_РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока = СокрЛП(Строка);
			Строка = "";
		Иначе
			Подстрока = СокрЛП(Лев(Строка, Поз - 1));
			Строка = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Общее_СкопироватьМассив(Источник)
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Источник Цикл
		Результат.Добавить(Ядро.КопияКоллекцииЗначений(Элемент));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

// Определяет, что строка начинается с указанной подстроки. Определение выполняется с учетом регистра, аналогично функции Найти
//
// Параметры:
//  Строка - Строка - Строка, начало которой проверяется на совпадение с подстрокой поиска
//  СтрокаПоиска - Строка - Строка, содержащая предполагаемое начало строки
//
// Возвращаемое значение:
//  Булево - Истина, начинается с указанной подстроки.
//
Функция СтрНачинаетсяСЛок(Знач Строка, Знач СтрокаПоиска)
	
	Результат = (Лев(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска);
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектовЛок(Ссылки, ИменаРеквизитов)
	
	Результат = Вычислить("обЗначенияРеквизитовОбъектов(Ссылки, ИменаРеквизитов)");
	Возврат Результат;
	
КонецФункции

Функция ЗначениеРеквизитаОбъектаЛок(СсылкаНаОбъект, ИмяРеквизита)
	
	ИнтерфейсАА5 = ОбщийМодульПоИмениЛок("сфпОбщегоНазначения");
	Результат = ИнтерфейсАА5.сфпЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, Реквизиты)
	
	ИнтерфейсАА5 = ОбщийМодульПоИмениЛок("сфпОбщегоНазначения");
	Результат = ИнтерфейсАА5.сфпЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблонЛок("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

Функция ПредставлениеРеквизитовУчастникаЭДО(Элемент, Знач СтруктураПараметров = Неопределено)
	
	Результат = Вычислить("спПолучитьПредставление(Элемент, СтруктураПараметров)");
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(ОбъектЛок, ИмяСвойства)
	
	Возврат Ядро.Общее_ЕстьРеквизитИлиСвойствоОбъекта(ОбъектЛок, ИмяСвойства);
	
КонецФункции


//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

НеИспользуется_РежимУправляемыхФорм = Ложь; // Определяет версию типового модуля: ОФ / УФ
СоответствиеПрайсЛистовПоставщиков = Новый Соответствие;
РедакцияАльфаАвто = Лев(Метаданные.Версия, 1);
