
//*************************************************************
//{ ПЕРЕМЕННЫЕ МОДУЛЯ

&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

//*************************************************************
//{ СЕРВИСНЫЕ МЕТОДЫ

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма()
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Результат = ОсновнаяФорма().Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

//*************************************************************
//} СЕРВИСНЫЕ МЕТОДЫ

//*************************************************************
//{ ПРЕДОПРЕДЕЛЕННЫЕ СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	Параметры.Свойство("РазделСправки", ТекущийРаздел);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПоказатьСтраницуТекущегоРазделаСправки();	

	Метрика_ДобавитьСтатистику_ОткрытиеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекущийРаздел) Тогда
		Метрика_ДобавитьПоведение_ЗакрытиеФормы();
		Метрика_ДобавитьСтатистику_ЗакрытиеФормы();
	КонецЕсли;
	
КонецПроцедуры

//} ПРЕДОПРЕДЕЛЕННЫЕ СОБЫТИЯ ФОРМЫ
//*************************************************************

//*************************************************************
//{ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	АдресСсылки = Неопределено;
	
	ДанныеСобытия.Свойство("href", АдресСсылки);

	Если ЗначениеЗаполнено(АдресСсылки) Тогда
		
		ПараметрыОповещения = ПараметрыИзОповещенияHTML(АдресСсылки);
		
		Если ЭтоОповещениеHTML(АдресСсылки) Тогда
			
			Если ЭтоПереходПоВнешнейСсылке(ПараметрыОповещения) Тогда
				
				АдресСсылки = ПараметрыОповещения.АдресСсылки;
				
				ПерейтиПоВнешнейСсылке(АдресСсылки);
				
				Метрика_ДобавитьПоведение_ПереходПоВнешнейСсылке(ПараметрыОповещения);
				Метрика_ДобавитьСтатистику_ПереходПоВнешнейСсылке(ПараметрыОповещения);
				
			Иначе
				
				Метрика_ДобавитьПоведение_ПереходВРаздел(ПараметрыОповещения);
				Метрика_ДобавитьСтатистику_ПереходВРаздел(ПараметрыОповещения);
				
				ПерейтиВРазделСправки(ПараметрыОповещения);
				
			КонецЕсли;
           		
		ИначеЕсли ЭтоОповещениеHTMLиЗакрытиеФормы(АдресСсылки) Тогда
			
			Метрика_ДобавитьПоведение_ЗакрытиеФормы(ПараметрыОповещения);
			Метрика_ДобавитьСтатистику_ЗакрытиеФормы();
			
			ТекущийРаздел = "";
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//} ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//*************************************************************

//*************************************************************
//{ ОБРАБОТКА ДЕЙСТВИЙ ПО ССЫЛКАМ В ДОКУМЕНТЕ HTML

&НаКлиенте
Процедура ПерейтиВРазделСправки(ПараметрыСсылки)
	
	ТекущийРаздел = ПараметрыСсылки.Раздел;
	ПоказатьСтраницуТекущегоРазделаСправки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоВнешнейСсылке(АдресСсылки)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЗапуститьПриложение(АдресСсылки);
	#Иначе
		ПерейтиПоНавигационнойСсылке(АдресСсылки);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоОповещениеHTMLиЗакрытиеФормы(АдресСсылки)
	
	Результат = (Найти(НРег(АдресСсылки), "alertandclose:") > 0);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоОповещениеHTML(АдресСсылки)
	
	Результат = (Найти(НРег(АдресСсылки), "alert:") > 0);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПараметрыИзОповещенияHTML(АдресСсылки)
	
	Результат = Новый Структура;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	СтрокаПараметров = СтрЗаменить(АдресСсылки, "alert:", "");
	СтрокаПараметров = СтрЗаменить(СтрокаПараметров, "alertandclose:", "");
	МассивПараметров = Ядро.РазделитьСтрокуЛок(СтрокаПараметров, "&");
	
	Для Каждого СтрокаКлючЗначение Из МассивПараметров Цикл
		КлючЗначение = Ядро.РазделитьСтрокуЛок(СтрокаКлючЗначение, "=");
		Результат.Вставить(КлючЗначение[0], КлючЗначение[1]);		
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Функция ЭтоПереходПоВнешнейСсылке(ПараметрыСсылки)
	
	Результат = ПараметрыСсылки.Свойство("АдресСсылки");
	Возврат Результат;
	
КонецФункции

//} ОБРАБОТКА ДЕЙСТВИЙ ПО ССЫЛКАМ В ДОКУМЕНТЕ HTML
//*************************************************************

//*************************************************************
//{ СЛУЖЕБНЫЕ

&НаКлиенте
Процедура ПоказатьСтраницуТекущегоРазделаСправки()
	
	Если ПустаяСтрока(ТекущийРаздел) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстHTMLДокумента = ПодготовитьHTMLСтраницуНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьHTMLСтраницуНаСервере()
	
	ТекстHTML = "";
	
	Разделы = РазделыСправки();
	
	Если ТекущийРаздел = Разделы.НемногоОМодулеШаг1 Тогда
		ТекстHTML = ТекстHTML_НемногоОМодулеШаг1();	
	ИначеЕсли ТекущийРаздел = Разделы.НемногоОМодулеШаг2 Тогда
		ТекстHTML = ТекстHTML_НемногоОМодулеШаг2();	
	КонецЕсли;
	
	ДополнитьТекстHTMLКартинками(ТекстHTML);
	
	Возврат ТекстHTML;
	
КонецФункции

&НаСервере
Процедура ДополнитьТекстHTMLКартинками(ТекстHTML)
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(ТекстHTML);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	КартинкиHTMLСтраницы = ДокументHTML.Картинки;
	
	Если КартинкиHTMLСтраницы.Количество() Тогда
		
		ВсеКартинки = Модуль_ЯдроНаСервере().БиблиотекаКартинок();	
		
		Для Каждого КартинкаHTML Из КартинкиHTMLСтраницы Цикл
			КартинкаBase64 = "";
			ИмяКартинки = КартинкаHTML.Источник + "_Base64";
			ВсеКартинки.Свойство(ИмяКартинки, КартинкаBase64);
			КартинкаHTML.Источник = "data:image/png;base64," + КартинкаBase64;
		КонецЦикла;
		
	КонецЕсли;
	
	ЗапиcьHTML = Новый ЗаписьHTML;
	ЗапиcьHTML.УстановитьСтроку();
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументHTML, ЗапиcьHTML);
	
	ТекстHTML = ЗапиcьHTML.Закрыть()
	
КонецПроцедуры

&НаСервере
Функция РазделыСправки()
	
	Результат = Новый Структура;
	Результат.Вставить("НемногоОМодулеШаг1", "НемногоОМодулеШаг1");
	Результат.Вставить("НемногоОМодулеШаг2", "НемногоОМодулеШаг2");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

//} СЛУЖЕБНЫЕ
//*************************************************************

//*************************************************************
//{ ТЕКСТ HTML

&НаСервере
Функция ТекстHTML_НемногоОМодулеШаг1()

	Результат =
	"<html>
	|<head>
	|	<meta http-equiv=""content-type"" content=""text/html;charset=utf-8"">
	|	<link rel=""stylesheet"" type=""text/css"" href=""__STYLE__"">
	|</head>
	|<body>
	|	<div class=""container"">
	|		<div class=""title"">
	|			<p><b>Немного о модуле</b></p>
	|		</div>
	|		<div class=""main-block"">
	|			<div>
	|				<p>Модуль готов к работе! Предлагаем ознакомиться с интерфейсом основной формы Диадока.</p>
	|				<p>Вверху вы можете переключиться на нужный раздел, нажав на одну из кнопок. По умолчанию открывается раздел «Для отправки».</p>
	|			</div>
	|			<div class=""image-container"">
	|				<img class=""image"" src=""НемногоОМодулеШаг1"">
	|			</div>
	|			<div>
	|				<p><strong>- «Для отправки»:</strong> здесь будут появляться документы, которые вы создали в 1С, но еще не отправили. Если документ
	|				 не отображается, то рекомендуем ознакомиться с самыми популярными причинами по ссылке ""Нет нужного документа"".</p>
	|				<p><strong>- «Исходящие»:</strong> все документы, которые вы отправили через Диадок. В списке отображаются статусы.
	|				 Так, вы можете проконтролировать, что контрагент подписал документ.</p>
	|				<p><strong>- «Входящие»:</strong> список документов, которые вы получили от контрагентов. Обратите внимание, что во
	|				 входящих есть возможность массово переносить документы из Диадока в 1С. Нажмите «Создать», и сервис постарается подобрать 
	|				 нужную номенклатуру. Вы в любой момент можете поменять номенклатуру, а модуль запомнит ваш выбор, и в следующий раз вам не 
	|				 придется вручную переносить и сопоставлять позиции.</p>
	|			</div>
	|		</div>
	|		<div class=""command-panel"">
	|			<a class=""y-button"" href=""alert:Раздел=НемногоОМодулеШаг2&ИмяКнопки=Далее&Действие=Переход на 2 шаг"">Далее</a>
	|		</div>
	|	</div>
	|	<style>
	|		.container {
	|			font-family: Arial;
	|		}
	|		p {
	|			margin: 8px
	|		}
	|		.title {
	|			padding-left: 10px;
	|			font-size: 24px;
	|		}
	|		.main-block {
	|			padding: 0 10px 0 5px;
	|			font-size: 14px;
	|		}
	|		img {
	|			width: 882px;
	|			border: 1px solid rgba(0, 0, 0, .2);
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 3px 3px 4px rgba(0, 0, 0, .3);
	|		}
	|		.image-container {
	|			display: grid;
	|			place-items: center;
	|			padding: 10px 0;
	|		}
	|		.command-panel {
	|			right: 15;
	|           float: right;
	|			margin-top: 5px;
	|			margin-right: 0px;
	|			margin-left: auto;
	|			padding-right: 20px; 
	|		}
	|		.y-button {
	|			appearance: none;
	|			text-decoration: none;
	|			border-radius: 3px;
	|			border: 1px solid rgba(199, 152, 4, .1);
	|			background-image: linear-gradient(to bottom, #ffe93a 0%, #fee001 51%, #edd100 100%);
	|			color: rgb(5, 5, 5);
	|			padding: 5px 30px;
	|			font-size: 14px;
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 2px 2px 3px rgba(0, 0, 0, .6);
	|		}
	|		.y-button:active {
	|			transform: translateY(-1px);
	|			box-shadow: 0 5px 10px rgba(0, 0, 0, 0.2);
	|		}		
	|	</style>
	|</body>
	|</html>";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстHTML_НемногоОМодулеШаг2()
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	Если Модуль_Ядро.ЕстьОграниченияПоТарифу() Тогда
		Результат = ТекстHTML_НемногоОМодулеШаг2_ТарифСтартовый();
	Иначе
		Результат = ТекстHTML_НемногоОМодулеШаг2_ТарифУниверсальный();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстHTML_НемногоОМодулеШаг2_ТарифСтартовый()

	Результат =
	"<html>
	|<head>
	|	<meta http-equiv=""content-type"" content=""text/html;charset=utf-8"">
	|	<link rel=""stylesheet"" type=""text/css"" href=""__STYLE__"">
	|</head>
	|<body>
	|	<div class=""container"">
	|		<div class=""title"">
	|			<p><b>Немного о модуле</b></p>
	|		</div>
	|		<div class=""main-block"">
	|			<div class=""paragraph"">
	|				<p>Обработка документов доступна:</p>
	|				<p><strong>- Из карточки документа:</strong> для этого нужно дважды нажать на строчку с названием документа - откроется его карточка, на которой можно выбрать нужное действие.</p>
	|				<p><strong>- Из списка:</strong> встаньте на строчку с нужным документом и выберите нужное действие на командной панели. Например, подписать и отправить.</p>
	|				<p>Обратите внимание, массовая обработка документов доступна только на тарифе ""Универсальный"".</p>
	|			</div>
	|			<div class=""image-container"">
	|				<img class=""image-main"" src=""НемногоОМодулеШаг2"">
	|			</div>
	|			<div class=""paragraph"">
	|				<p>Все настройки по организациям и контрагентам вы можете сделать, перейдя по кнопке <img class=""fig"" src=""КартинкаНастройки""></p>
	|				<p>Обратите внимание на кнопку <img class=""fig"" src=""КартинкаЗнакВопроса""><br>Там вы найдете ссылки на руководство пользователя, поддержку и обновление модуля.</br></p>
	|			</div>
	|			<div class=""paragraph"">
	|				<p>Подробнее ознакомиться с основными сценариями в Диадоке можно с помощью <a href=""alert:АдресСсылки=https://www.diadoc.ru/integrations/1c#documents-sending&ИмяКнопки=Видеоинструкции на сайте&Действие=Переход на сайт"">видеоинструкций&nbsp;на&nbsp;сайте</a></p>
	|				<p>Успешной работы!</p>
	|			</div>
	|		</div>
	|		<div class=""command-panel"">
	|			<a class=""g-button"" href=""alert:Раздел=НемногоОМодулеШаг1&ИмяКнопки=Назад&Действие=Вернуться на 1 шаг"">Назад</a>
	|			<a class=""y-button"" href=""alertandclose:Раздел=НемногоОМодулеШаг2&ИмяКнопки=Начать работу&Действие=Закрытие формы"">Начать работу</a>
	|		</div>
	|	</div>
	|	<style>
	|		.container {
	|			font-family: Arial;
	|		}
	|		p {
	|			margin: 8px
	|		}
	|		.title {
	|			padding-left: 10px;
	|			font-size: 24px;
	|		}
	|		.main-block {
	|			padding: 0 10px 0 5px;
	|			font-size: 14px;
	|		}
	|		.image-main {
	|			width: 882px;
	|			border: 1px solid rgba(0, 0, 0, .2);
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 3px 3px 4px rgba(0, 0, 0, .3);
	|		}
	|		.image-container {
	|			display: grid;
	|			place-items: center;
	|			padding: 10px 0;
	|		}
	|		.fig {
	|			height: 16px;
	|			padding-left: 5px;
	|			padding-right: 2px;
	|			margin-bottom: -2px;
	|		}
	|		.paragraph {
	|			margin-top: 3px;
	|		}
	|		.paragraph a {
	|			padding-left: 10px;
	|		}
	|		.command-panel {
	|			right: 15;
	|			float: right;
	|			margin-top: 5px;
	|			margin-right: 0px;
	|			margin-left: auto;
	|			padding-right: 20px; 
	|		}
	|		.y-button {
	|			display: inline-block;
	|			position: relative;
	|			float: right
	|			appearance: none;
	|			text-decoration: none;
	|			border-radius: 3px;
	|			border: 1px solid rgba(199, 152, 4, .1);
	|			background-image: linear-gradient(to bottom, #ffe93a 0%, #fee001 51%, #edd100 100%);
	|			color: rgb(5, 5, 5);
	|			padding: 5px 8px;
	|			font-size: 14px;
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 2px 2px 3px rgba(0, 0, 0, .6);
	|		}
	|		.y-button:active {
	|			transform: translateY(-1px);
	|			box-shadow: 0 5px 10px rgba(0, 0, 0, 0.2);
	|		}
	|		.g-button {
	|			display: inline-block;
	|			position: relative;
	|			margin-right: 15px;
	|			appearance: none;
	|			text-decoration: none;
	|			border-radius: 3px;
	|			background-image: linear-gradient(to bottom, #ffffff 0%, #f4f4f4 100%);
	|			color: rgb(5, 5, 5);
	|			border: 1px solid rgba(0, 0, 0, .1);
	|			padding: 5px 30px;
	|			font-size: 14px;
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 2px 2px 3px rgba(0, 0, 0, .6);
	|		}
	|		.g-button:active {
	|			transform: translateY(-1px);
	|			box-shadow: 0 5px 10px rgba(0, 0, 0, 0.2);
	|		}		
	|	</style>
	|</body>
	|</html>";
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстHTML_НемногоОМодулеШаг2_ТарифУниверсальный()

	Результат =
	"<html>
	|<head>
	|	<meta http-equiv=""content-type"" content=""text/html;charset=utf-8"">
	|	<link rel=""stylesheet"" type=""text/css"" href=""__STYLE__"">
	|</head>
	|<body>
	|	<div class=""container"">
	|		<div class=""title"">
	|			<p><b>Немного о модуле</b></p>
	|		</div>
	|		<div class=""main-block"">
	|			<div class=""paragraph"">
	|				<p>Обратите внимание, документы можно обрабатывать:</p>
	|				<p><strong>- По одному:</strong> для этого нужно дважды нажать на строчку с названием документа - откроется его карточка, на которой можно выбрать нужное действие.</p>
	|				<p><strong>-  Массово:</strong> выделите документы в списке. На командной панели выберите нужное действие. Например, подписать и отправить.</p>
	|			</div>
	|			<div class=""image-container"">
	|				<img class=""image-main"" src=""НемногоОМодулеШаг2"">
	|			</div>
	|			<div class=""paragraph"">
	|				<p>Все настройки по организациям и контрагентам вы можете сделать, перейдя по кнопке <img class=""fig"" src=""КартинкаНастройки""></p>
	|				<p>Обратите внимание на кнопку <img class=""fig"" src=""КартинкаЗнакВопроса""><br>Там вы найдете ссылки на руководство пользователя, поддержку и обновление модуля.</br></p>
	|			</div>
	|			<div class=""paragraph"">
	|				<p>Подробнее ознакомиться с основными сценариями в Диадоке можно с помощью <a href=""alert:АдресСсылки=https://www.diadoc.ru/integrations/1c#documents-sending&ИмяКнопки=Видеоинструкции на сайте&Действие=Переход на сайт"">видеоинструкций&nbsp;на&nbsp;сайте</a></p>
	|				<p>Успешной работы!</p>
	|			</div>
	|		</div>
	|		<div class=""command-panel"">
	|			<a class=""g-button"" href=""alert:Раздел=НемногоОМодулеШаг1&ИмяКнопки=Назад&Действие=Вернуться на 1 шаг"">Назад</a>
	|			<a class=""y-button"" href=""alertandclose:Раздел=НемногоОМодулеШаг2&ИмяКнопки=Начать работу&Действие=Закрытие формы"">Начать работу</a>
	|		</div>
	|	</div>
	|	<style>
	|		.container {
	|			font-family: Arial;
	|		}
	|		p {
	|			margin: 8px
	|		}
	|		.title {
	|			padding-left: 10px;
	|			font-size: 24px;
	|		}
	|		.main-block {
	|			padding: 0 10px 0 5px;
	|			font-size: 14px;
	|		}
	|		.image-main {
	|			width: 882px;
	|			border: 1px solid rgba(0, 0, 0, .2);
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 3px 3px 4px rgba(0, 0, 0, .3);
	|		}
	|		.image-container {
	|			display: grid;
	|			place-items: center;
	|			padding: 10px 0;
	|		}
	|		.fig {
	|			height: 16px;
	|			padding-left: 5px;
	|			padding-right: 2px;
	|			margin-bottom: -2px;
	|		}
	|		.paragraph {
	|			margin-top: 3px;
	|		}
	|		.paragraph a {
	|			padding-left: 10px;
	|		}
	|		.command-panel {
	|			right: 15;
	|			float: right;
	|			margin-top: 5px;
	|			margin-right: 0px;
	|			margin-left: auto;
	|			padding-right: 20px; 
	|		}
	|		.y-button {
	|			display: inline-block;
	|			position: relative;
	|			float: right
	|			appearance: none;
	|			text-decoration: none;
	|			border-radius: 3px;
	|			border: 1px solid rgba(199, 152, 4, .1);
	|			background-image: linear-gradient(to bottom, #ffe93a 0%, #fee001 51%, #edd100 100%);
	|			color: rgb(5, 5, 5);
	|			padding: 5px 8px;
	|			font-size: 14px;
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 2px 2px 3px rgba(0, 0, 0, .6);
	|		}
	|		.y-button:active {
	|			transform: translateY(-1px);
	|			box-shadow: 0 5px 10px rgba(0, 0, 0, 0.2);
	|		}
	|		.g-button {
	|			display: inline-block;
	|			position: relative;
	|			margin-right: 15px;
	|			appearance: none;
	|			text-decoration: none;
	|			border-radius: 3px;
	|			background-image: linear-gradient(to bottom, #ffffff 0%, #f4f4f4 100%);
	|			color: rgb(5, 5, 5);
	|			border: 1px solid rgba(0, 0, 0, .1);
	|			padding: 5px 30px;
	|			font-size: 14px;
	|			box-shadow: -2px -2px 3px rgba(255, 255, 255, .6), 2px 2px 3px rgba(0, 0, 0, .6);
	|		}
	|		.g-button:active {
	|			transform: translateY(-1px);
	|			box-shadow: 0 5px 10px rgba(0, 0, 0, 0.2);
	|		}
	|	</style>
	|</body>
	|</html>";
	
	Возврат Результат;
	
КонецФункции

//} ТЕКСТ HTML
//*************************************************************

//*************************************************************
//{ МЕТРИКИ

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ОткрытиеФормы()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = КатегорияМетрики();
	Действие = Ядро.Метрика_НазваниеДействий().ОткрытиеФормы;
	
	Ядро.Метрика_ЗаписатьСтатистику(Категория, Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ЗакрытиеФормы()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = КатегорияМетрики();
	Действие = Ядро.Метрика_НазваниеДействий().ЗакрытиеФормы;
	
	Ядро.Метрика_ЗаписатьСтатистику(Категория, Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_ЗакрытиеФормы(ПараметрыОповещения = Неопределено)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	НаименованиеФормы = НаименованиеФормы();
	Категория = КатегорияМетрики();
	Действие = Ядро.Метрика_НазваниеДействий().ЗакрытиеФормы;
	Метка = "Нажать кнопку";

	Если ПараметрыОповещения = Неопределено Тогда
		Представление = "Закрыть";
	Иначе
		Представление = ПараметрыОповещения.ИмяКнопки;
	КонецЕсли;
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		Категория,
		Действие,
		Метка,
		Представление);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ПереходВРаздел(ПараметрыОповещения)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = КатегорияМетрики();
	Действие = ПараметрыОповещения.Действие;
	
	Ядро.Метрика_ЗаписатьСтатистику(Категория, Действие);

КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_ПереходВРаздел(ПараметрыОповещения)
	
	НаименованиеФормы = НаименованиеФормы();
	Категория = КатегорияМетрики();
	Действие = ПараметрыОповещения.Действие;
	Представление = ПараметрыОповещения.ИмяКнопки;
	Метка = "Нажать кнопку";

	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		Категория,
		Действие,
		Метка,
		Представление);

КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ПереходПоВнешнейСсылке(ПараметрыОповещения)
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Категория = КатегорияМетрики();
	Действие = ПараметрыОповещения.Действие;
	
	Ядро.Метрика_ЗаписатьСтатистику(Категория, Действие);

КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьПоведение_ПереходПоВнешнейСсылке(ПараметрыОповещения)
	
	НаименованиеФормы = НаименованиеФормы();
	Категория = КатегорияМетрики();
	Действие = ПараметрыОповещения.Действие;
	Представление = ПараметрыОповещения.ИмяКнопки;
	Метка = "Нажать кнопку";

	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		Категория,
		Действие,
		Метка,
		Представление);
	
КонецПроцедуры

&НаКлиенте
Функция КатегорияМетрики()

	Результат = "Справка " + ТекущийРаздел;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НаименованиеФормы()
	
	Возврат "Справка";
	
КонецФункции

//} МЕТРИКИ
//*************************************************************
