// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:ExportVariables-off
Перем ВыведенныеОбласти Экспорт; // Массив, в который складываются текущие области
Перем ИменаСтартовыхОбластейТабличныхЧастей Экспорт; // должен быть Массив
Перем ВыведенныеТабличныеЧасти Экспорт; // Соответствие, где Ключ - имя стартовой области, Значение = массив "строк" (наверное, тоже Массив)

Перем ПараметрыВыведенныхОбластей Экспорт; //здесь будет Массив Структур. Структура имеет 2 элемента - "ИмяОбласти" и "Параметры" (вложенная структура)

Перем мТекущаяОбластьГруппировки;
Перем мТабДок; // В действительности ничто не мешает нам параллельно создать тот же самый ТабличныйДокумент и его тоже при необходимости вернуть.

// пачка переменных для эмуляции табличного документа
Перем АвтоМасштаб Экспорт;
Перем ВерхнийКолонтитул Экспорт;
Перем ВстроенныеТаблицы Экспорт;
Перем Вывод Экспорт;
Перем ВыделенныеОбласти Экспорт;
Перем ВысотаСтраницы Экспорт;
Перем ВысотаТаблицы Экспорт;
Перем Защита Экспорт;
Перем ИмяПараметровПечати Экспорт;
Перем ИмяПринтера Экспорт;
Перем ИмяСохраненияПоложенияОкна Экспорт;
//перем ИспользуемоеИмяФайла Экспорт;  // Зарезервированное имя, перенесено в Реквизиты
Перем ИтогиСнизу Экспорт;
Перем ИтогиСправа Экспорт;
Перем КлючПараметровПечати Экспорт;
Перем КлючСохраненияПоложенияОкна Экспорт;
Перем КодЯзыкаМакета Экспорт;
Перем КоличествоЭкземпляров Экспорт;
Перем МасштабПечати Экспорт;
Перем НаправлениеПерехода Экспорт;
Перем НижнийКолонтитул Экспорт;
Перем Области Экспорт;
Перем ОбластьПечати Экспорт;
//перем ОриентацияСтраницы Экспорт;  // Зарезервированное имя, перенесено в Реквизиты
Перем ОтображатьГруппировки Экспорт;
Перем ОтображатьЗаголовки Экспорт;
Перем ОтображатьСетку Экспорт;
Перем Параметры Экспорт;
Перем ПовторятьПриПечатиКолонки Экспорт;
Перем ПовторятьПриПечатиСтроки Экспорт;
Перем ПолеСверху Экспорт;
Перем ПолеСлева Экспорт;
Перем ПолеСнизу Экспорт;
Перем ПолеСправа Экспорт;
Перем РазборПоКопиям Экспорт;
Перем РазмерКолонтитулаСверху Экспорт;
Перем РазмерКолонтитулаСнизу Экспорт;
Перем РазмерСтраницы Экспорт;
Перем Рисунки Экспорт;
Перем СохранятьСвойстваОтображения Экспорт;
Перем ТекущаяОбласть Экспорт;
Перем ТолькоПросмотр Экспорт;
//перем ТочностьПечати Экспорт;  // Зарезервированное имя, перенесено в Реквизиты
Перем ФиксацияСверху Экспорт;
Перем ФиксацияСлева Экспорт;
Перем ФиксированныйФон Экспорт;
перем ФоноваяКартинка Экспорт;
Перем ЦветТекстаГруппировки Экспорт;
Перем ЦветТекстаЗаголовков Экспорт;
перем ЦветФонаГруппировки Экспорт;
Перем ЦветФонаЗаголовков Экспорт;
Перем ЧерноБелаяПечать Экспорт;
Перем ЧерноБелыйПросмотр Экспорт;
Перем ШиринаСтраницы Экспорт;
Перем ШиринаТаблицы Экспорт;
Перем ЭкземпляровНаСтранице Экспорт;
// BSLLS:ExportVariables-on
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//**************************************
//{		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Истина);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Версия = "0.1.0";
	
	Результат = Версия + "." + НомерСборки();
	
	Возврат Результат;
	
КонецФункции

// Сквозной номер сборки, обновляется автоматически
//
Функция НомерСборки()
	
	Возврат "2";
	
КонецФункции

//}		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

//{ Заглушки для эмуляции табличного документа
	
Процедура Вывести(Область) Экспорт
	
	ВыведенныеОбласти.Добавить(Область);
	
	// И альтернативный вариант добавления области. Кажется, что им будет легче пользоваться.
	НовЭлемент = Новый Структура;
	НовЭлемент.Вставить("ИмяОбласти",	ИмяОбласти(Область));
	НовЭлемент.Вставить("Параметры",	СтруктураПараметровОбласти(Область));
	ПараметрыВыведенныхОбластей.Добавить(НовЭлемент);
	
	мТекущаяОбластьГруппировки = Область; // к этой  области будем добавлять то, что накидывается в Присоединить
	
	мИмяОбласти = ИмяОбласти(Область);
	Если НЕ ИменаСтартовыхОбластейТабличныхЧастей.Найти(мИмяОбласти) = Неопределено Тогда
		мТекущаяОбластьГруппировки = Новый Массив;
		мТекущаяОбластьГруппировки.Добавить(Область);
		
		ТекТабличнаяЧасть = ВыведенныеТабличныеЧасти[мИмяОбласти];
		Если ТекТабличнаяЧасть = Неопределено Тогда
			ТекТабличнаяЧасть = Новый Массив;
			ВыведенныеТабличныеЧасти.Вставить(мИмяОбласти, ТекТабличнаяЧасть);
		КонецЕсли;
		
		ТекТабличнаяЧасть.Добавить(мТекущаяОбластьГруппировки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Присоединить(Область) Экспорт
	
	// Тожет немного отличаться от Вывести: здесь не новая строка, а "присоединение" к предыдущей.
	// Т.е. мы можем здесь группировать области между собой.
	ВыведенныеОбласти.Добавить(Область);
	
	НовЭлемент = Новый Структура;
	НовЭлемент.Вставить("ИмяОбласти",	ИмяОбласти(Область));
	НовЭлемент.Вставить("Параметры",	СтруктураПараметровОбласти(Область));
	ПараметрыВыведенныхОбластей.Добавить(НовЭлемент);
	
	Если НЕ мТекущаяОбластьГруппировки = Неопределено Тогда
		мТекущаяОбластьГруппировки.Добавить(Область);
	КонецЕсли;
	//Область.Параметры.Вставить(ИмяВиртуальногоПараметраСсылки(), мТекущаяОбластьГруппировки);
	// и как-то прикрепить к мТекущаяОбластьГруппировки;
	
КонецПроцедуры

Функция ПроверитьВывод(Область) Экспорт
	Возврат Истина;
КонецФункции

Функция ВставитьОбласть(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ВывестиВертикальныйРазделительСтраниц(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ВывестиГоризонтальныйРазделительСтраниц(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗакончитьАвтогруппировкуКолонок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗакончитьАвтогруппировкуСтрок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗакончитьГруппуКолонок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗакончитьГруппуСтрок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция Записать(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция КоличествоСтраниц(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция КоличествоУровнейГруппировокКолонок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция КоличествоУровнейГруппировокСтрок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиЗначение(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиТекст(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция Напечатать(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция НачатьАвтогруппировкуКолонок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция НачатьАвтогруппировкуСтрок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция НачатьГруппуКолонок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция НачатьГруппуСтрок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция Область(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат мТабДок.Область(п1, п2, п3, п4);
	
КонецФункции

Функция Очистить(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция Показать(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПоказатьУровеньГруппировокКолонок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПоказатьУровеньГруппировокСтрок(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбласть(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПроверитьПрисоединение(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция Прочитать(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция Скрыть(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция УдалитьОбласть(п1 = Неопределено,
	п2 = Неопределено,
	п3 = Неопределено,
	п4 = Неопределено,
	п5 = Неопределено,
	п6 = Неопределено,
	п7 = Неопределено,
	п8 = Неопределено,
	п9 = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции


//ВставитьОбласть (InsertArea)

//Вывести (Put)

// (PutVerticalPageBreak)
// (PutHorizontalPageBreak)
// (EndColumnAutoGrouping)
// (EndRowAutoGrouping)
// (EndColumnGroup)
// (EndRowGroup)
// (Write)
// (PageCount)
// (ColumnGroupLevelCount)
// (RowGroupsLevelCount)
// (FindValue)
// (FindText)
// (Print)
// (StartColumnAutoGrouping)
// (StartRowAutoGrouping)
// (StartColumnGroup)
// (StartRowGroup)
// (Area)
// (Clear)
// (Show)
// (ShowColumnGroupLevel)
// (ShowRowGroupLevel)
// (GetArea)

//Присоединить (Join)
//ПроверитьВывод (CheckPut)

// (CheckAttachment)
// (Read)
// (Hide)
// (DeleteArea)

//} заглушки для эмуляции табличного документа


//{ Основные методы

// Возвращает СТРУКТУРУ параметров, переданных в Область
Функция СтруктураПараметровОбласти(Область) Экспорт
	
	Результат = Новый Структура;
	Для Каждого ИмяПараметра Из МассивИменПараметровОбласти(Область) Цикл
		Результат.Вставить(ИмяПараметра, Область.Параметры[ИмяПараметра]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяВиртуальногоПараметраСсылки() Экспорт
	Возврат "ВиртуальныйПараметр_Ссылка_РодительскаяОбласть";
КонецФункции

// Возвращает массив ИМЕН параметров, переданных в Область, чтобы в дальнейшем можно было получить их значения
Функция МассивИменПараметровОбласти(Область)
	
	Результат = Новый Массив;
	
	// Сериализуем область в XML, чтобы извлечь имена параметров
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	Сериализатор.ЗаписатьXML(Запись, Область);
	ТекстОбласти = Запись.Закрыть();
	
	// И теперь пробежимся по XML и извлечем имена
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ТекстОбласти);
	Пока Чтение.Прочитать() Цикл
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "parameter" Или Чтение.Имя = "detailParameter" Тогда
				Чтение.Прочитать();
				Результат.Добавить(Чтение.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя области табличного документа
Функция ИмяОбласти(Область)
	
	Результат = Область.Области[0].Имя; // Опасно! Надо добиться ошибки на реальном примере и придумать, что с этим делать. Гуиды, например, генерировать.
	
	Возврат Результат;
	
КонецФункции

Процедура Инициализировать()
		
	// Поиграемся с разными вариантами представления, чтобы понять, какой будет удобнее в применении.

	ВыведенныеОбласти						 = Новый Массив;
	ИменаСтартовыхОбластейТабличныхЧастей	 = Новый Массив;
	ВыведенныеТабличныеЧасти				 = Новый Соответствие;
	ПараметрыВыведенныхОбластей				 = Новый Массив;

	мТабДок = Новый ТабличныйДокумент;
	
	ВерхнийКолонтитул = мТабДок.ВерхнийКолонтитул;
	НижнийКолонтитул = мТабДок.НижнийКолонтитул;

КонецПроцедуры

// Процедура предназначена для добавления "виртуальной области" с параметрами.
Процедура ДобавитьПроизвольныйПараметрВРезультаты(ИмяОбласти, ЗначенияПараметров) Экспорт
	
// Можно использовать в случае, если какие-то промежуточные параметры не выводятся на печать, а используются для внутренних расчетов,
//  но их тоже необходимо получить на выходе
// В этом случае в коде подготовки печатной формы вызываем примерно так:
//		Если ТипЗначения(ТабличныйДокумент) <> Тип("ТабличныйДокумент") Тогда
//			ТабличныйДокумент.ДобавитьПроизвольныйПараметрВРезультаты("АдресГрузополучателя", "г.Арамиль, ул. Ленина, д.1");
//		КонецЕсли;
// А в модуле Диадок к этому значению потом можно обращаться как обычно:
//		АдресГрузополучателя = ОбластьИзДанныхЭмулятораПечати(ДанныеПечати, "АдресГрузополучателя");

	НовЭлемент = Новый Структура;
	НовЭлемент.Вставить("ИмяОбласти",	ИмяОбласти);
	НовЭлемент.Вставить("Параметры",	ЗначенияПараметров);
	ПараметрыВыведенныхОбластей.Добавить(НовЭлемент);
	
КонецПроцедуры

// Возвращает Массив из параметров областей с заданным именем. например, "СтрокаТоваров". В основном используется для доступа к табличным частям.
Функция МассивСтрокИзДанныхЭмулятораПечати(ИмяОбласти) Экспорт
	Результат =  Новый Массив;
	Для Каждого Стр Из ПараметрыВыведенныхОбластей Цикл
		Если Стр.ИмяОбласти = ИмяОбласти Тогда
			Результат.Добавить(Стр.Параметры);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Возвращает параметры единичной области, например, "ДанныеОПокупателе" или "ШапкаДокумента"
Функция ОбластьИзДанныхЭмулятораПечати(ИмяОбласти) Экспорт
	
	Для Каждого Стр Из ПараметрыВыведенныхОбластей Цикл
		Если Стр.ИмяОбласти = ИмяОбласти Тогда
			Возврат Стр.Параметры;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

//}

Инициализировать();
