// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
&НаСервере
Перем _ОбработкаОбъект; // Указатель на основную обработку

&НаСервере
Перем _МодульЯдроНаСервере;

&НаКлиенте
Перем ДанныеПредложенийИПодписок; // Коллекция данных по предложениям и активным подпискам

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

// { Сервисные методы

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Результат = Модуль_Платформа().Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

// } Сервисные методы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	Параметры.Свойство("ТолькоСрочные", ТолькоСрочные);
	Параметры.Свойство("РежимБаннера", РежимБаннера);
	
	ИнициализироватьФорму();
	
	УстановитьСвойстваФормыТакси();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваФормыТакси()
	
	СвойствоПодсказкаВвода = Новый Структура("ПодсказкаВвода");
	СвойствоПодсказкаВвода.ПодсказкаВвода = "Организация";
	ЗаполнитьЗначенияСвойств(Элементы.ОтборПоОрганизации, СвойствоПодсказкаВвода);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	Модуль_Ядро = Модуль_ЯдроНаСервере();
	
	ДанныеПредложенийИПодписок = Модуль_Ядро.ЛичныйКабинет_ДанныеПредложенийИПодписок();
	
	ЭтаФорма.АдресДополнительныеПараметры = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПоместитьВоВременноеХранилище(ДанныеПредложенийИПодписок, ЭтаФорма.АдресДополнительныеПараметры);
	
	ЗаполнитьСписокВыбораОрганизации(ДанныеПредложенийИПодписок);
	
	СформироватьСтраницуHTML(ДанныеПредложенийИПодписок);
	
	ИнициализироватьНастройку_НовоеВВерсии_БольшеНеПоказывать();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтраницуHTML(ДанныеПредложенийИПодписок)
	
	ЭтаФорма.ТекстHTML = ОбработкаОбъект().HTMLПодпискиИОплата_HTMLСтраница(ДанныеПредложенийИПодписок,
																			ОтборПоОрганизации,
																			ТолькоСрочные);
	ЭтаФорма.ТекущийЭлемент = Элементы.ТекстHTML;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// BSLLS:UnusedLocalVariable-off
	ДанныеПредложенийИПодписок = ПолучитьИзВременногоХранилища(АдресДополнительныеПараметры);
	// BSLLS:UnusedLocalVariable-on
	УдалитьИзВременногоХранилища(АдресДополнительныеПараметры);
	
	ПоказатьФормуОнбордингаОтложено();
	
	Метрика_ПриОткрытии();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОрганизации(ДанныеПредложенийИПодписок)
	
	СписокДляОтбора = Элементы.ОтборПоОрганизации.СписокВыбора;
	
	НовыйЭлемент = СписокДляОтбора.Добавить();
	НовыйЭлемент.Значение = Неопределено;
	НовыйЭлемент.Представление = "Все организации";
	
	Для Каждого ДанныеПредложенийИПодписокЯщика Из ДанныеПредложенийИПодписок Цикл
		
		Если СписокДляОтбора.НайтиПоЗначению(ДанныеПредложенийИПодписокЯщика.BoxId) = Неопределено Тогда
		
			НовыйЭлемент = СписокДляОтбора.Добавить();
			НовыйЭлемент.Значение = ДанныеПредложенийИПодписокЯщика.BoxId;
			НовыйЭлемент.Представление = ДанныеПредложенийИПодписокЯщика.ОрганизацияНаименование;
			
		КонецЕсли;
		
		УстановитьОтборДляПервойОрганизации = НЕ ЗначениеЗаполнено(ОтборПоОрганизации)
											И НЕ ЗначениеЗаполнено(РежимБаннера)
											И НЕ ТолькоСрочные;
		
		Если УстановитьОтборДляПервойОрганизации Тогда
			ОтборПоОрганизации = ДанныеПредложенийИПодписокЯщика.BoxId;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	
	СформироватьСтраницуHTML(ДанныеПредложенийИПодписок);
	
	Метрика_ОтборПоОрганизацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииОчистка(Элемент, СтандартнаяОбработка)
	
	СформироватьСтраницуHTML(ДанныеПредложенийИПодписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСрочныеПриИзменении(Элемент)
	
	СформироватьСтраницуHTML(ДанныеПредложенийИПодписок);
	
	Метрика_ИзменениеРежимаТолькоСрочные();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	АдресСсылки = Неопределено;
	ДополнительныеПараметры = Неопределено;
	
	ДанныеСобытия.Свойство("href", АдресСсылки);
	
	Если ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.ОповеститьИлиПерейтиПоСсылке(АдресСсылки, ДополнительныеПараметры, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик открытия Центра поддержки из html ссылки 
//
// Параметры:
//  РежимОткрытияЦП			- Строка, Неопределено - см. Ядро.ЦП_РежимыОткрытияЦП()
//  ДополнительныеПараметры - Произвольный - параметры оповещения
//
&НаКлиенте
Процедура ОбработатьНажатие_ОткрытьЦентрПоддержки(РежимОткрытияЦП = Неопределено,
												  ДополнительныеПараметры = Неопределено) Экспорт
	
	НазваниеФормы = Метрика_НазваниеФормы();
	Категория = Метрика_НазваниеКатегории().ЦентрПоддержки;
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ЦентрПоддержки_Открыть(Категория, НазваниеФормы, РежимОткрытияЦП);
	
КонецПроцедуры

// Обработчик открытия Сервиса предложений из ссылки html
//
// Параметры:
//  ИдентификаторСсылки		- Строка - идентификатор ссылки html
//  ДополнительныеПараметры - Произвольный - параметры оповещения
//
&НаКлиенте
Процедура ОбработатьНажатие_ОткрытьСсылкуСервисаПредложений(ИдентификаторСсылки = Неопределено,
															ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИдентификаторСсылки) Тогда
		
		СтрокаПоискаИндекса = "raw_id=";
		
		Если Лев(ИдентификаторСсылки, СтрДлина(СтрокаПоискаИндекса)) = СтрокаПоискаИндекса Тогда
			
			ИндексСтроки = Число(СтрЗаменить(ИдентификаторСсылки, СтрокаПоискаИндекса, ""));
			ОписаниеПредложенияДляПокупки = ДанныеПредложенийИПодписок.Получить(ИндексСтроки);
			АдресСсылкиДляПерехода = ОписаниеПредложенияДляПокупки.Ссылка;
			
			Если ЗначениеЗаполнено(ОписаниеПредложенияДляПокупки.Ссылка) Тогда
				
				Модуль_Платформа = Модуль_Платформа();
				Модуль_Платформа.ОповеститьИлиПерейтиПоСсылке(АдресСсылкиДляПерехода, ДополнительныеПараметры, ЭтаФорма);
				Метрика_ОткрытьСсылкуСервисаПредложений(ОписаниеПредложенияДляПокупки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик открытия Личного кабинета из ссылки html
//
// Параметры:
//  СсылкаДляПерехода		- Строка - идентификатор ссылки html
//  ДополнительныеПараметры - Произвольный - параметры оповещения
//
&НаКлиенте
Процедура ОбработатьНажатие_ОткрытьСсылкуЛичногоКабинета(СсылкаДляПерехода = Неопределено,
														 ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СсылкаДляПерехода) Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		Модуль_Платформа.ОповеститьИлиПерейтиПоСсылке(СсылкаДляПерехода, ДополнительныеПараметры, ЭтаФорма);
		Метрика_ОткрытьСсылкуЛичногоКабинета();
		
	КонецЕсли;
	
КонецПроцедуры

// { Онбординг

&НаСервере
Процедура ИнициализироватьНастройку_НовоеВВерсии_БольшеНеПоказывать()
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	// BSLLS:UnusedLocalVariable-off
	НеПоказыватьОнбординг = ОбработкаОбъект.НастройкиПользователяПрочитать_НеПоказыватьПодпискиИОплатаОнбординг();
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуОнбордингаОтложено()
	
	Если НеПоказыватьОнбординг Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОднократно = Истина;
	Интервал = 0.1;
	
	ПодключитьОбработчикОжидания("ПоказатьФормуОнбординга", Интервал, ВыполнитьОднократно);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуОнбординга()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", "ПодпискиИОплатаОнбординг");
	
	ОбработчикЗакрытия = Неопределено;
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыФормы,
		ОбработчикЗакрытия
	);
	
КонецПроцедуры

// } Онбординг

// { Метрики

&НаКлиенте
Функция Метрика_НазваниеФормы()
	
	Результат = Заголовок;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеДействий()

	Результат = Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеКатегории()
	
	Результат = Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории();
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура Метрика_ПриОткрытии()
	
	Если ЗначениеЗаполнено(РежимБаннера) Тогда
		Метрика_ПриОткрытииИзБаннераОсновнойФормы();
	КонецЕсли;
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	НазваниеФормы = Метрика_НазваниеФормы();
	КатегорияМетрики = Метрика_НазваниеКатегории().ОнлайнПродажи;
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_ДействиеСФормой(НазваниеФормы, КатегорияМетрики, Истина, , НазваниеФормы);
	
КонецПроцедуры 

&НаКлиенте
Процедура Метрика_ПриОткрытииИзБаннераОсновнойФормы()
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	НазваниеФормы = "Основная форма";
	КатегорияМетрики = Метрика_НазваниеКатегории().ОнлайнПродажи;
	ДействиеМетрики	= РежимБаннера;
	НазваниеМетки = "Нажатие ссылки";
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, КатегорияМетрики, ДействиеМетрики, НазваниеМетки);
	
	Для Каждого ДанныеПредложения Из ДанныеПредложенийИПодписок Цикл
		
		Если ДанныеПредложения.ЭтоПредложение Тогда
			
			BoxId = ДанныеПредложения.BoxId;
			ЛицевойСчет = ДанныеПредложения.ЛицевойСчет;
			
			Переменные = Новый Соответствие;
			Переменные.Вставить("AccountId", ЛицевойСчет);
			
			Модуль_Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, КатегорияМетрики, ДействиеМетрики, , Переменные);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ОтборПоОрганизацииПриИзменении()
	
	Если НЕ ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		Возврат;
	КонецЕсли;
	
	КатегорияМетрики = Метрика_НазваниеКатегории().ОнлайнПродажи;
	ДействиеМетрики	= "Отбор по организации";
	НазваниеФормы = Метрика_НазваниеФормы();
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, КатегорияМетрики, ДействиеМетрики);
	Модуль_Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(ОтборПоОрганизации, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ИзменениеРежимаТолькоСрочные()
	
	КатегорияМетрики = Метрика_НазваниеКатегории().ОнлайнПродажи;
	ДействиеМетрики	= Метрика_НазваниеДействий().ЛичныйКабинетСрочные;
	НазваниеФормы = Метрика_НазваниеФормы();
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, КатегорияМетрики, ДействиеМетрики);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("Значение", ТолькоСрочные);
	
	Если ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		BoxId = ОтборПоОрганизации;
		Модуль_Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, КатегорияМетрики, ДействиеМетрики, , Переменные);
	Иначе
		Модуль_Ядро.Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(КатегорияМетрики, ДействиеМетрики, , Переменные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ОткрытьСсылкуСервисаПредложений(ОписаниеПредложенияДляПокупки)
	
	BoxId = ОписаниеПредложенияДляПокупки.BoxId;
	ПредложениеДляПокупки = ОписаниеПредложенияДляПокупки.ИсходныеДанные;
	
	КатегорияМетрики = Метрика_НазваниеКатегории().ОнлайнПродажи;
	ДействиеМетрики	= ОписаниеПредложенияДляПокупки.Действие;
	НазваниеФормы = Метрика_НазваниеФормы();
	НазваниеМетки = Метрика_НазваниеМеткиДляГиперссылки();
	
	Переменные = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ПредложениеДляПокупки) Тогда
		
		Переменные.Вставить("AccountId", ОписаниеПредложенияДляПокупки.ЛицевойСчет);
		Переменные.Вставить("ReasonForOffer", ПредложениеДляПокупки.ОснованиеПредложения);
		Переменные.Вставить("Activity", ПредложениеДляПокупки.Тип);
		Переменные.Вставить("ScenarioId", ПредложениеДляПокупки.Сценарий);
		
		Если ЗначениеЗаполнено(ПредложениеДляПокупки.ПодпискаПродления) Тогда
			Переменные.Вставить("EntitytId", ПредложениеДляПокупки.ПодпискаПродления);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПредложениеДляПокупки.Тариф) Тогда
			Переменные.Вставить("TariffId", ПредложениеДляПокупки.Тариф);
		КонецЕсли;
		
	КонецЕсли;
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, КатегорияМетрики, ДействиеМетрики, НазваниеМетки);
	Модуль_Ядро.Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId, КатегорияМетрики, ДействиеМетрики, , Переменные);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ОткрытьСсылкуЛичногоКабинета()
	
	КатегорияМетрики = Метрика_НазваниеКатегории().ОнлайнПродажи;
	ДействиеМетрики	= Метрика_НазваниеДействий().ЛичныйКабинет;
	НазваниеФормы = Метрика_НазваниеФормы();
	НазваниеМетки = Метрика_НазваниеМеткиДляГиперссылки();
	
	Модуль_Ядро = Модуль_ЯдроНаКлиенте();
	
	Модуль_Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(НазваниеФормы, КатегорияМетрики, ДействиеМетрики, НазваниеМетки);
	Модуль_Ядро.Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеМеткиДляГиперссылки()
	
	Возврат "Нажатие гиперссылки";
	
КонецФункции

// } Метрики
