// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_ТиповойМодуль;
Перем НеИспользуется_РежимУправляемыхФорм;

Перем Ядро;
Перем ОсновнойМодуль;
Перем ГенерацияXML;
Перем ПечатныеФормы;
Перем РаботаСМаркировкой;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормы = Модуль_ПечатныеФормы;
	РаботаСМаркировкой = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормы = Неопределено;
	РаботаСМаркировкой = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html
    
	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);
		
		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
	
		
		///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
		
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "УстановитьУсловноеОформление" Тогда
		
		Возврат УстановитьУсловноеОформление(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции

///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	Возврат Неопределено;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	Результат = "";
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	Возврат Неопределено;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html
	
	Возврат Неопределено;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html
			
	Возврат Неопределено;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
		
	Возврат Неопределено;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
		
	Возврат Неопределено;
	
КонецФункции


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	ПроверитьЗаполнитьИдентификаторОперации(Параметры);
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Документ = Параметры.Документ;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Ошибки = ЗначениеВМассив(Результат.ОписаниеОшибки);
	
	ПроверитьЗаполнениеДокумента(НовыйОбъект, Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ИспользоватьДатуЭД Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаСопоставленияНоменклатуры = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаСопоставленияНоменклатуры, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html

	Результат = Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html
		
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html

	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
		ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
		ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
	
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
	
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваров", Отбор);
												
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваров", Отбор);
						
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			ОтборСФ.Вставить("Корректировочный", Ложь);
			
			ОтборПоТипуСФ = Новый Массив;
			ОтборПоТипуСФ.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПолученныхСчетовФактур.НаПоступление"));
			
			ОтборСФ.Вставить("ТипСчетаФактуры", ОтборПоТипуСФ);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
						
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			ОтборКоррСФ.Вставить("Корректировочный", Истина);
			
			ОтборПоТипуСФ = Новый Массив;
			ОтборПоТипуСФ.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПолученныхСчетовФактур.НаПоступление"));
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
										
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ЗаказПоставщику",		Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
			
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			Элемент
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции


///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////

// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
		
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html
	
	Результат = Новый Массив; 
	// не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
			
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html
		
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html
    	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
			
	Возврат Истина;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваров.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваров.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Проведен = ИСТИНА
	|	И РеализацияТоваров.Организация = &Организация
	|	И РеализацияТоваров.Дата >= &ДатаНачала
	|	И РеализацияТоваров.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваров.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваров.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваров.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Проведен = ИСТИНА
	|	И ПоступлениеТоваров.Организация = &Организация
	|	И ПоступлениеТоваров.Дата >= &ДатаНачала
	|	И ПоступлениеТоваров.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваров.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
			
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
		
	Возврат Истина;
	
КонецФункции

Функция УстановитьУсловноеОформление(Параметры)

	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Ustanovit%27_Uslovnoye_Oformleniye.html
		
	Возврат Истина;

КонецФункции

Функция НайтиСопоставлениеДокумента(Параметры)
	
	// https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html

	Документ = Параметры.Документ;
	
	ТипЭД = Документ.Тип; 
	ТипДокумента		= Документ.Тип.ТипДокумента;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	
	Если ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Неопределено;					
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация"		, Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент"		, Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента"	, Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента"	, Документ.Реквизиты.Номер);
	
	Если 	ЭтоПередаточныйДокумент(Документ.Тип)
		Или ЭтоУниверсальныйПередаточныйДокумент(Документ.Тип) Тогда
			
		Результат = НайтиПоступленияТоваров(ПараметрыОтбора);
				
	ИначеЕсли ЭтоСчетФактура(ТипЭД) Тогда
		
		Результат = НайтиСчетаФактурыПолученные(ПараметрыОтбора);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей  
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	// остается значение по умолчанию
	
КонецПроцедуры

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
			
КонецПроцедуры

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт
						
КонецПроцедуры

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
		
			
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  КоллекцияДокументов - Массив - коллекция документов учета
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Организация");	
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Контрагент");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(КоллекцияДокументов, Реквизиты, Истина);
	
	Возврат Результат;
	
КонецФункции

// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С.
// Для получения подчиненных документов используется критерии отбора СвязанныеДокументы.
//
// Параметры:
//  ДокументУчета	 - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(Документ) Экспорт
	
	Результат = Новый Массив;
		
	СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, Документ);
	
	Результат.Добавить(Документ);
	
	Возврат Результат;	
	
КонецФункции	

Процедура СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, Документ)
	
	СвязанныеДокументы = СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ);
	
	Для Каждого СсылкаНаОбъект Из СвязанныеДокументы Цикл
		Если КоллекцияПриемник.Найти(СсылкаНаОбъект) = Неопределено Тогда
			КоллекцияПриемник.Добавить(СсылкаНаОбъект); 
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, СсылкаНаОбъект)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  Документ - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ)
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;	
	
КонецФункции

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
	
КонецПроцедуры

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  СправочникСсылка, ПеречислениеСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	Замены = Новый Соответствие;
	Замены.Вставить("ИсчНалАг", "НДС исчисляется налоговым агентом");
	
	ПредставлениеБЭД = Замены.Получить(ПредставлениеСтавки);
	Если Не ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		ПредставлениеБЭД = ПредставлениеСтавки;
	КонецЕсли;
	
	МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ФорматыЭДОПовтИсп");
	
	Результат = МодульБЭД.СтавкаНДСИзПредставления(ПредставлениеБЭД);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - СправочникСсылка, ПеречислениеСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	МодульБЭД = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЭДО");
	
	Результат = МодульБЭД.СтавкаНДСИзСоответствия(, ЗначениеСтавки);
	
	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	МетаданныеНоменклатурыКонтрагентов = Метаданные.РегистрыСведений.НоменклатураКонтрагентовБЭД;
	
	ВладелецТип = Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип;
	
	НоменклатураТип = Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип;
	ХарактеристикаТип = Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатурыБЭД.Тип;
	
	НаименованиеТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Наименование.Тип;
	АртикулТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Артикул.Тип;
	КодТип = АртикулТип; // поля "Код" в регистре нет
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("Характеристика"         , ХарактеристикаТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, НоменклатураКонтрагента)
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент				= Контрагент;
	НоваяСтрока.Наименование			= НоменклатураКонтрагента.Наименование;
	НоваяСтрока.Код						= НоменклатураКонтрагента.Код;
	НоваяСтрока.Артикул					= НоменклатураКонтрагента.Артикул;
	НоваяСтрока.НоменклатураКонтрагента = НоменклатураКонтрагента;
	
КонецПроцедуры

Функция НайтиПоступленияТоваров(ПараметрыОтбора) 
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	НЕ ПоступлениеТоваров.ПометкаУдаления
		|	И ПоступлениеТоваров.Организация = &Организация
		|	И ПоступлениеТоваров.Контрагент = &Контрагент
		|	И ПоступлениеТоваров.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеТоваров.НомерВходящегоДокумента = &НомерДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

Функция НайтиСчетаФактурыПолученные(ПараметрыОтбора) 
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ДатаСоставления = &ДатаДокумента
		|	И СчетФактураПолученный.Номер = &НомерДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = "ПоступлениеТоваров";
				
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД) Тогда
		
		Результат = "СчетФактураПолученный";
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия)
	
	Если ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭД = ПараметрыСобытия.Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
КонецПроцедуры

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоСтруктуры_Локальная(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = ОсновнойМодуль.ЭДО_Служебные_СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнениеДокумента(ДокументОбъект, Ошибки)
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	ИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Если ТребуетсяУказыватьНоменклатуру(ИмяОбъекта) Тогда
		
		ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуетсяУказыватьНоменклатуру(ПолноеИмяОбъекта)
	
	ОбъектыСНоменклатурой = Новый Массив;
	ОбъектыСНоменклатурой.Добавить("Документ.ПоступлениеТоваров");
	
	Результат = (ОбъектыСНоменклатурой.Найти(ПолноеИмяОбъекта) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки)
	
	Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
		
		Номенклатура = СтрокаТЧ.Номенклатура;
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			
			ТекстОшибки = НСтр(
				"ru = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.';
				|en = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.'"
			);
			
			Ошибки.Добавить(ТекстОшибки);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	МетаданныеОснованийСФ = Новый Массив;
	МетаданныеОснованийСФ.Добавить(Метаданные.Документы.ПоступлениеТоваров);
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Результат = (МетаданныеОснованийСФ.Найти(ОбъектМетаданных) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		ИЛИ НЕ ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
	ВидСчетаФактуры = Перечисления.ТипыПолученныхСчетовФактур.НаПоступление;
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйСФ)
		ИЛИ ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	ОснованиеСФ = ДокументОбъект.Ссылка;
		
	ДатаДокумента = ТекущаяДатаСеанса();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	СтруктураДляСФ = Новый Структура;
	СтруктураДляСФ.Вставить("ДокументОснование", ОснованиеСФ);
	СтруктураДляСФ.Вставить("Основание", ОснованиеСФ);
	СтруктураДляСФ.Вставить("ВидСчетаФактуры", ВидСчетаФактуры);
	
	ДокументСФ.Заполнить(СтруктураДляСФ);
	
	ДокументСФ.Организация = СвойствоСтруктуры_Локальная(ЭлектронныйСФ.Получатель, "Организация");
	ДокументСФ.Контрагент = СвойствоСтруктуры_Локальная(ЭлектронныйСФ.Отправитель, "Организация");
	ДокументСФ.ДатаСоставления = СвойствоСтруктуры_Локальная(ЭлектронныйСФ.Реквизиты, "Дата");
	ДокументСФ.Номер = СвойствоСтруктуры_Локальная(ЭлектронныйСФ.Реквизиты, "Номер");
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.Корректировочный = Ложь;
	ДокументСФ.КодВидаОперации = КодВидаОперацииСчетаФактурыПолученного(ОснованиеСФ);
	ДокументСФ.ПолученВЭлектронномВиде = Истина;
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	
	ДокументСФ.Записать();
	
	Если НЕ ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодВидаОперацииСчетаФактурыПолученного(ДокументыОснования)
	
	Если Не ЗначениеЗаполнено(ДокументыОснования) Тогда
		Основание = Неопределено;
	ИначеЕсли ТипЗнч(ДокументыОснования) = Тип("Массив") Тогда
		Основание = ДокументыОснования[0];
	Иначе
		Основание = ДокументыОснования;
	КонецЕсли;
	
	КодВидаОперации = "";
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		КодВидаОперации = "03";
	Иначе
		КодВидаОперации = "01";
	КонецЕсли;
	
	Возврат КодВидаОперации;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		
		Для Каждого СтрокаОснование Из ДокументУчета.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(СтрокаОснование.ДокументОснование, ДобавляемыйКомментарий);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция РезультатФункцииОшибка(ОшибкаИлиМассив)
	
	Если ТипЗнч(ОшибкаИлиМассив) = Тип("Массив") Тогда
		КоллекцияОшибок = ОшибкаИлиМассив;
	Иначе
		КоллекцияОшибок = Новый Массив;
		КоллекцияОшибок.Добавить(ОшибкаИлиМассив);
	КонецЕсли;
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(КоллекцияОшибок);
	
	Возврат Результат;
	
КонецФункции

//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ


//****************************************************************************
//{ ОБЕРТКИ

// Проверяет, что электронный документ является передаточным документом и счетом-фактурой.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Булево - Истина, если это УПД с функцией СЧФДОП.
//
Функция ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
	
	Результат = Ядро.Документы_ЭтоУниверсальныйПередаточныйДокумент(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является передаточным документом.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Булево - Истина, если это накладная, акт или УПД с функцией ДОП.
//
Функция ЭтоПередаточныйДокумент(ТипЭД)
	
	Результат = Ядро.Документы_ЭтоПередаточныйДокумент(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является счетом-фактурой.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Булево - Истина, если это СФ или УПД с функцией СЧФ.
//
Функция ЭтоСчетФактура(ТипЭД) Экспорт
			
	Результат = Ядро.Документы_ЭтоСчетФактура(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что функция электронного документа является агентский
//
// Параметры:
//	ФункцияДокумента - Строка - функция электронного документа
//
// Возвращаемое значение:
//	Булево - Истина, если функция является агентский
Функция ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента)
	
	Результат = ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента);
	
	Возврат Результат;
	
КонецФункции

//} ОБЕРТКИ

НеИспользуется_РежимУправляемыхФорм = Истина; // Определяет версию типового модуля: ОФ / УФ