// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off

// + ШХ
// т1к Персианов М.С. 06.09.2023
// Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
//Перем Ядро;
Перем Ядро Экспорт;
// - ШХ
Перем Кэш;
Перем СписокДокументов Экспорт;
Перем ОбщийКонтекстКлиентСервер Экспорт;
Перем КлючAPIРазработчика Экспорт;

// Истина, если требуется переопределить стандартное хранилище плагинов
Перем КонтурПлагины_ПереопределитьСистемуХранения;

// Имя подключенного интеграционного модуля
Перем _ТекущийИМ;

Перем _ТекущаяСтрокаКонтекста; // ФиксированнаяСтруктура - см. Ядро.МодельСтрокаКонтекстаСеанса

// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//**************************************
//{		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Истина);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Версия = "0.4.2";
	
	Результат = Версия + "." + НомерСборки();
	
	Возврат Результат;
	
КонецФункции

// Сквозной номер сборки, обновляется автоматически
//
Функция НомерСборки()
	
	Возврат "19";
	
КонецФункции

//}		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ


//#Область ПрограммныйИнтерфейс_КонтекстСеанса

// Выбирает для обработки указанный ящик. Перед вызовом метода необходимо авторизоваться
// и заполнить контекст сеанса. Если в контексте сеанса отсутствуют сведения о ящике с
// указанным идентификатором, будет вызвано исключение.
//
// @ПубличныйПрограммныйИнтерфейс
//
// Параметры:
//  Ящик - Строка - адрес или идентификатор ящика
//
Процедура ЭДО_УстановитьТекущийЯщик(Знач Ящик) Экспорт
	
	ИмяМетода = "КонтурДиадокВызовыПМ.ЭДО_УстановитьКонтекст";
	_ПроверитьПараметр(ИмяМетода, "Ящик", Ящик, Тип("Строка"));
	
	ИдентификаторЯщика = НРег(Ядро.АдресЯщикаВИдентификатор(Ящик));
	ВызыватьИсключение = Ложь;
	_ТекущаяСтрокаКонтекста = Ядро.КонтекстСеанса_СтрокаКонтекста(ИдентификаторЯщика, ВызыватьИсключение);
	
	Если _ТекущаяСтрокаКонтекста = Неопределено Тогда
		Ошибка = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			"НеАвторизован: В контексте сеанса нет данных организации из Диадока (BoxId = %1)",
			ИдентификаторЯщика
		);
		ЖурналРегистрации_ЗаписатьОшибку("КонтекстСеанса", Ошибка);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти ПрограммныйИнтерфейс_КонтекстСеанса


//#Область СлужебныеПроцедурыИФункции_КонтекстСеанса

Процедура _ПроверитьКонтекстТекущегоЯщика()
	
	Если _ТекущаяСтрокаКонтекста = Неопределено Тогда
		
		Ошибка = "Требуется установить контекст текущего ящика (см. 'ЭДО_УстановитьКонтекст')";
		ЖурналРегистрации_ЗаписатьОшибку("КонтекстСеанса", Ошибка);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти СлужебныеПроцедурыИФункции_КонтекстСеанса


//#Область ПрограммныйИнтерфейс_СопоставлениеНоменклатуры

// Добавляет вариант сопоставления номенклатуры
//
// Параметры:
//  ВариантыСопоставления	 - Массив - Массив уже найденных вариантов или пустой массив
//  Номенклатура			 - СправочникСсылка - Найденная номенклатура информационной базы
//  Характеристика			 - СправочникСсылка - Найденная Характеристика информационной базы
//  Упаковка				 - СправочникСсылка - Найденная Упаковка информационной базы
//
Процедура ДобавитьВариантСопоставленияНоменклатуры(ВариантыСопоставления, Номенклатура, Характеристика = Неопределено, Упаковка = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураИБ = Новый_НоменклатураИнформационнойБазы(Номенклатура, Характеристика, Упаковка);
	
	ВариантыСопоставления.Добавить(НоменклатураИБ);
	
КонецПроцедуры

// Конструктор описания номенклатуры информационной базы.
//
// Параметры:
//  Номенклатура - ОпределяемыйТип.НоменклатураБЭД, СправочникСсылка.Номенклатура - (необязательный) номенклатура.
//  Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД, СправочникСсылка.ХарактеристикиНоменклатуры - (необязательный) характеристика номенклатуры
//  Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыБЭД, СправочникСсылка.КлассификаторЕдиницИзмерения - (необязательный) упаковка / единица измерения номенклатуры
// 
// Возвращаемое значение:
//  Структура - см. Контракт_НоменклатураИнформационнойБазы.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Новый_НоменклатураИнформационнойБазы(Номенклатура = Неопределено, Характеристика = Неопределено, Упаковка = Неопределено) Экспорт
	
	Результат = Контракт_НоменклатураИнформационнойБазы();
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Результат.Номенклатура = Номенклатура;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Результат.Характеристика = Характеристика;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Результат.Упаковка = Упаковка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает номенклатуру информационной базы, сопоставленную с номенклатурой электронного документа.
//
// Параметры:
//  Документ - Структура - описание электронного документа (см. Контракт_Документ).
// 
// Возвращаемое значение:
//  Соответствие - Ключ - идентификатор номенклатуры ЭД,
//                 Значение - сопоставленная номенклатура (см. Новый_НоменклатураИнформационнойБазы).
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция СопоставленнаяНоменклатураЭлектронногоДокумента(Документ) Экспорт
	
	Результат = Новый Соответствие; // Ключ - идентификатор, значение - НоменклатураИБ
	
	ТаблицаСопоставления = Ядро.Номенклатура_ТаблицаСопоставленияНоменклатуры(Документ);
	ДополнитьКолонкиТаблицыСопоставленияНоменклатуры(ТаблицаСопоставления);
	
	Для Каждого Строка Из ТаблицаСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоменклатураИБ = Новый_НоменклатураИнформационнойБазы(
			Строка.Номенклатура,
			Строка.Характеристика,
			Строка.Упаковка
		);
		
		Идентификатор = Строка.НоменклатураКонтрагента.Идентификатор;
		
		Результат.Вставить(Идентификатор, НоменклатураИБ);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Записывает сопоставление номенклатуры электронного документа с номенклатурой информационной базы.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип.ВладелецНоменклатурыБЭД, СправочникСсылка.Контрагенты - Контрагент или Партнер
//  НоменклатураЭД - Структура - см. Контракт_НоменклатураЭлектронногоДокумента
//  НоменклатураИБ - Структура - см. Контракт_НоменклатураИнформационнойБазы
//  НеИспользуется_ТиповойМодуль - ОбработкаОбъект - (Устарел, не используется) стандартная библиотека интеграции.
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура ТиповойМодуль_ЗаписатьСопоставлениеНоменклатуры(ВладелецНоменклатуры, НоменклатураЭД, НоменклатураИБ, НеИспользуется_ТиповойМодуль = Неопределено) Экспорт
	
	Если Не ИспользуетсяИнтеграционныйМодуль() Тогда
		
		Контекст = Новый Структура;
		
		ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(
			"ТиповойМодуль_ЗаписатьСопоставлениеНоменклатуры",
			Контекст
		);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВладелецНоменклатуры) Тогда
		ВызватьИсключение "Не указан владелец номенклатуры электронного документа!";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураЭД.Идентификатор) Тогда
		ВызватьИсключение "Не указан идентификатор номенклатуры электронного документа!";
	КонецЕсли;
	
	НоменклатураКонтрагента = Ядро.Новый_НоменклатураКонтрагента(
		ВладелецНоменклатуры,
		НоменклатураЭД.Идентификатор
	); // Внутренний контракт
	
	НоменклатураКонтрагента.Код = НоменклатураЭД.Код;
	НоменклатураКонтрагента.Артикул = НоменклатураЭД.Артикул;
	НоменклатураКонтрагента.Наименование = НоменклатураЭД.Наименование;
	НоменклатураКонтрагента.Характеристика = НоменклатураЭД.Характеристика;
	НоменклатураКонтрагента.СтавкаНДС = НоменклатураЭД.СтавкаНДС;
	НоменклатураКонтрагента.ЕдиницаИзмерения = НоменклатураЭД.ЕдиницаИзмерения;
	НоменклатураКонтрагента.ЕдиницаИзмеренияКод = НоменклатураЭД.ЕдиницаИзмеренияКод;
	
	Попытка
		
		Ядро.МенеджерИнтеграции_СопоставлениеНоменклатурыЗаписать(
			НоменклатураКонтрагента,
			НоменклатураИБ
		);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		
		ВидОперации = "Запись сопоставления номенклатуры";
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		ДопИнформация = Новый Массив;
		ТекстСообщения = КраткоеПредставлениеОшибки(Ошибка);
		
		Ядро.Ошибка_Обработать(
			ВидОперации,
			ТекстОшибки,
			ДопИнформация,
			ТекстСообщения
		);
		
	КонецПопытки;
	
КонецПроцедуры

//#КонецОбласти ПрограммныйИнтерфейс_СопоставлениеНоменклатуры


//#Область ПрограммныйИнтерфейс_РаботаСКонтрагентами

// Выполняет групповое сопоставление контрагентов (версия 2).
//
// Параметры:
//  BoxId - Строка - идентификатор ящика организации в сервисе Диадок
//  ОтборПоСтатусуПартнерскихОтношений - Строка, Массив - Статусы партнерских отношений для отбора контрагентов Диадока
//  	см. значения перечисления CounteragentStatus на странице https://developer.kontur.ru/Docs/diadoc-api/proto/Counteragent.html
// 
// Возвращаемое значение:
//  ТаблицаЗначений - результаты сопоставления контрагентов информационной базы с контрагентами ЭДО
//   * Ссылка - Произвольный - контрагент в учетной системе
//   * ИНН- Строка - ИНН контрагента
//   * КПП- Строка - КПП контрагента
//   * Статус - Строка - статус сопоставления контрагентов (Сопоставлен, ЕстьДубли, НеНайден)
//   * Количество - Число - Количество найденных контрагентов сервиса по заданным ИНН-КПП с учетом статуса партнерства
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция ЭДО_ВыполнитьГрупповоеСопоставлениеКонтрагентовV2(Знач BoxId, Знач ОтборПоСтатусуПартнерскихОтношений = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(BoxId) Тогда
		ТекстОшибки = "Не задано значение параметра (BoxId)";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Организация = Организации_ЗаполненныеРеквизиты(, BoxId);
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		
		ТекстОшибки = Общее_ПараметрыВСтроку(
			"Не удалось прочитать параметры организации (BoxId = %1)",
			СокрЛП(BoxId)
		);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ЗначениеОтбора = СтатусыПартнерскихОтношенийОтборПоУмолчанию();
	Если ЗначениеЗаполнено(ОтборПоСтатусуПартнерскихОтношений) Тогда
		ЗначениеОтбора = ОтборПоСтатусуПартнерскихОтношений;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
		СтатусыОтношений = ЗначениеОтбора;
	Иначе
		СтатусыОтношений = Новый Массив;
		СтатусыОтношений.Добавить(ЗначениеОтбора);
	КонецЕсли;
	
	СопоставлениеКонтрагентов = Ядро.Контрагенты_ГрупповоеСопоставлениеV2(
		Организация,
		СтатусыОтношений
	);
	
	Результат = ПолучитьРезультатСопоставленияКонтрагентов(СопоставлениеКонтрагентов.ДетальныеДанные);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти ПрограммныйИнтерфейс_СопоставлениеНоменклатуры


//#Область ПрограммныйИнтерфейс_ПроверкаТиповДокументов

// Проверяет, что электронный документ является передаточным документом и счетом-фактурой.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это УПД с функцией СЧФДОП.
//
Функция ЭтоУниверсальныйПередаточныйДокумент(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоУниверсальныйПередаточныйДокумент(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является счетом-фактурой.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это СФ или УПД с функцией СЧФ.
//
Функция ЭтоСчетФактура(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоСчетФактура(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является передаточным документом.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это накладная, акт или УПД с функцией ДОП.
//
Функция ЭтоПередаточныйДокумент(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоПередаточныйДокумент(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является соглашением об изменении стоимости и корректировочным документом.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это УКД с функцией ДИС.
//
Функция ЭтоКорректировочныйДокумент(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоКорректировочныйДокумент(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является соглашением об изменении стоимости и корректировочным счетом-фактурой.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это УКД с функцией КСЧФДИС.
//
Функция ЭтоУниверсальныйКорректировочныйДокумент(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоУниверсальныйКорректировочныйДокумент(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является корректировочным счетом-фактурой.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это УКД с функцией КСЧФДИС или ДИС.
//
Функция ЭтоКорректировочныйСчетФактура(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоКорректировочныйСчетФактура(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является соглашением об изменении стоимости.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это УКД с функцией ДИС.
//
Функция ЭтоСоглашениеОбИзмененииСтоимости(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоСоглашениеОбИзмененииСтоимости(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является актом о расхождениях.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это акт о расхождениях.
//
Функция ЭтоАктОРасхождениях(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоАктОРасхождениях(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что электронный документ является счетом на оплату.
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, если это счет на оплату.
//
Функция ЭтоСчетНаОплату(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	Результат = Ядро.Документы_ЭтоСчетНаОплату(ТипЭД);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что функция электронного документа является агентский
//
// Параметры:
//  ФункцияДокумента - Строка - функция электронного документа
//
// Возвращаемое значение:
//  Булево - Истина, если функция является агентский
//
Функция ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Экспорт
	
	Результат = Ядро.Документы_ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти ПрограммныйИнтерфейс_ПроверкаТиповДокументов


//#Область ПрограммныйИнтерфейс_ПроверкаТиповКонтейнеров

// Проверяет, что тип или вид электронного документа используется
// для отправки документов в формате приказа 970@, 820@ или 155@
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, тип документа связан с контентом типа "utd970", "utd820" или "utd"
//
Функция ТипСоответствуетКонтентуУПД(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	
	ТипыКонтента = Ядро.Перечисление_ТипыКонтентов();
	
	ДопустимыеЗначения = Новый Массив;
	ДопустимыеЗначения.Добавить(ТипыКонтента.utd970);
	ДопустимыеЗначения.Добавить(ТипыКонтента.utd820);
	ДопустимыеЗначения.Добавить(ТипыКонтента.utd);
	
	Результат = (ДопустимыеЗначения.Найти(ТипЭД.ТипКонтента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что тип или вид электронного документа используется
// для отправки документов в формате приказа 736@ или 189@
//
// Параметры:
//  ОписаниеТипаЭД - Структура - см. Контракт_ТипЭлектронногоДокумента или Контракт_ВидЭлектронногоДокумента
// 
// Возвращаемое значение:
//  Булево - Истина, тип документа связан с контентом типа "ucd736" или "ucd"
//
Функция ТипСоответствуетКонтентуУКД(ОписаниеТипаЭД) Экспорт
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД);
	
	ТипыКонтента = Ядро.Перечисление_ТипыКонтентов();
	
	ДопустимыеЗначения = Новый Массив;
	ДопустимыеЗначения.Добавить(ТипыКонтента.ucd);
	ДопустимыеЗначения.Добавить(ТипыКонтента.ucd736);
	
	Результат = (ДопустимыеЗначения.Найти(ТипЭД.ТипКонтента) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти ПрограммныйИнтерфейс_ПроверкаТиповКонтейнеров


//#Область ПрограммныйИнтерфейс_РаботаСКонтентом

// Добавляет новый элемент в коллекцию информационных полей контента.
//
// Параметры:
//  Контент - ОбъектXDTO, Структура - контент электронного документа.
//  Ключ - Строка - (Необязательный) имя информационного поля.
//  Значение - Строка - (Необязательный) значение информационного поля.
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура ДобавитьИнформационноеПоле(Контент, Ключ = "", Значение = "") Экспорт
	
	ИмяМетода = "ВызовыПМ.ДобавитьИнформационноеПоле";
	
	Если ТипЗнч(Ключ) <> Тип("Строка") Тогда
		ВызватьИсключениеНедопустимоеЗначениеПараметра(ИмяМетода, "Ключ");
	КонецЕсли;
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		ВызватьИсключениеНедопустимоеЗначениеПараметра(ИмяМетода, "Значение");
	КонецЕсли;
	
	ТипПараметраКонтент = ТипЗнч(Контент);
	
	Если ТипПараметраКонтент = Тип("ОбъектXDTO") Тогда
		
		ДобавитьИнформационноеПолеВОбъектXDTO(Контент, Ключ, Значение);
		
	ИначеЕсли ТипПараметраКонтент = Тип("Структура") Тогда
		
		ДобавитьИнформационноеПолеВСтруктуру(Контент, Ключ, Значение);
		
	Иначе
		
		ВызватьИсключениеНедопустимоеЗначениеПараметра(ИмяМетода, "Контент");
		
	КонецЕсли;
	
КонецПроцедуры

// Конструктор сведений об авансовых счетах-фактурах для заполнения графы 5б
// 
// Возвращаемое значение:
//  Структура - см. Контракт_АвансИнфо
//
// Пример:
//  АвансИнфо = ОсновнойМодуль.Новый_АвансИнфо();
//  АвансИнфо.Номер = НомерАСФ;
//  АвансИнфо.Дата = ДатаАСФ;
//
Функция Новый_АвансИнфо() Экспорт
	Результат = Контракт_АвансИнфо();
	Возврат Результат;
КонецФункции

// Добавляет сведения для заполнения графы 5б счета-фактуры
//
// Параметры:
//  Контент - ОбъектXDTO, Структура - контент электронного документа (UTD970SellerContent)
//  АвансИнфо - Структура - сведения об авансовом счете-фактуре (см. Контракт_АвансИнфо)
//
// Пример:
//  Контент = ПараметрыСобытия.Результат.Content;
//  Выборка = Запрос.Выполнить().Выбрать();
//  Пока Выборка.Следующий() Цикл
//      АвансИнфо = ОсновнойМодуль.Новый_АвансИнфо();
//      АвансИнфо.Номер = Выборка.НомерАСФ;
//      АвансИнфо.Дата = Выборка.ДатаАСФ;
//      ОсновнойМодуль.Авансы_Добавить(Контент, АвансИнфо);
//  КонецЦикла;
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура Авансы_Добавить(Контент, АвансИнфо) Экспорт
	
	ИмяМетода = "КонтурДиадокВызовыПМ.УПД_ДобавитьАванс";
	
	ДопустимыеТипыКонтента = Новый Массив;
	ДопустимыеТипыКонтента.Добавить(Тип("ОбъектXDTO"));
	ДопустимыеТипыКонтента.Добавить(Тип("Структура"));
	
	_ПроверитьПараметр(ИмяМетода, "Контент", Контент, ДопустимыеТипыКонтента);
	
	ОжидаемыеТипыСвойствАванса = Новый_АвансИнфо();
	ОжидаемыеТипыСвойствАванса.Дата = Тип("Дата");
	ОжидаемыеТипыСвойствАванса.Номер = Тип("Строка");
	ОжидаемыеТипыСвойствАванса.ИсправлениеДата = Тип("Дата");
	ОжидаемыеТипыСвойствАванса.ИсправлениеНомер = Тип("Число");
	
	_ПроверитьПараметр(ИмяМетода, "АвансИнфо", АвансИнфо, Тип("Структура"), ОжидаемыеТипыСвойствАванса);
	_Проверить(ЗначениеЗаполнено(АвансИнфо.Дата), "Не заполнено поле 'АвансИнфо.Дата'", ИмяМетода);
	_Проверить(ЗначениеЗаполнено(АвансИнфо.Номер), "Не заполнено поле 'АвансИнфо.Номер'", ИмяМетода);
	
	ЕстьНомерИсправления = ЗначениеЗаполнено(АвансИнфо.ИсправлениеНомер);
	ЕстьДатаИсправления = ЗначениеЗаполнено(АвансИнфо.ИсправлениеДата);
	ЭтоИсправление = ЕстьНомерИсправления Или ЕстьДатаИсправления;
	
	Если ЭтоИсправление Тогда
		
		_Проверить(ЕстьНомерИсправления, "Не заполнено поле 'АвансИнфо.ИсправлениеНомер'", ИмяМетода);
		_Проверить(ЕстьДатаИсправления, "Не заполнено поле 'АвансИнфо.ИсправлениеДата'", ИмяМетода);
		_Проверить(
			АвансИнфо.ИсправлениеДата >= АвансИнфо.Дата,
			"'АвансИнфо.ИсправлениеДата' не может быть меньше 'АвансИнфо.Дата'",
			ИмяМетода
		);
		
		// BSLLS:NestedFunctionInParameters-off
		AdditionalInfo = Общее_ПараметрыВСтроку(
			"%1 № %2 от %3",
			Конст_ИмяДокументаИспАСЧФ(),
			XMLСтрока(АвансИнфо.ИсправлениеНомер),
			Формат(АвансИнфо.ИсправлениеДата, "ДФ=dd.MM.yyyy")
		);
		// BSLLS:NestedFunctionInParameters-on
		
	КонецЕсли;
	
	ТипПараметраКонтент = ТипЗнч(Контент);
	
	Если ТипПараметраКонтент = Тип("ОбъектXDTO") Тогда
		
		Элемент = НовыйЭлементСпискаXDTO(Контент.AccompanyingDocuments);
		
		УстановитьЗначениеXDTO(Элемент, "Name", Конст_ИмяДокументаАСЧФ());
		УстановитьЗначениеXDTO(Элемент, "Date", АвансИнфо.Дата);
		УстановитьЗначениеXDTO(Элемент, "Number", АвансИнфо.Номер);
		
		Если ЭтоИсправление Тогда
			УстановитьЗначениеXDTO(Элемент, "AdditionalInfo", AdditionalInfo);
		КонецЕсли;
		
	ИначеЕсли ТипПараметраКонтент = Тип("Структура") Тогда
		
		Коллекция = Неопределено;
		Если Не Контент.Свойство("AccompanyingDocuments", Коллекция) Тогда
			Коллекция = Новый Массив;
			Контент.Вставить("AccompanyingDocuments", Коллекция);
		КонецЕсли;
		
		Элемент = Новый Структура;
		Элемент.Вставить("Name", Конст_ИмяДокументаАСЧФ());
		Элемент.Вставить("Date", АвансИнфо.Дата);
		Элемент.Вставить("Number", АвансИнфо.Номер);
		Если ЭтоИсправление Тогда
			Элемент.Вставить("AdditionalInfo", AdditionalInfo);
		КонецЕсли;
		
		Коллекция.Добавить(Элемент);
		
	Иначе
		
		ВызватьИсключениеНедопустимоеЗначениеПараметра(ИмяМетода, "Контент");
		
	КонецЕсли;
	
КонецПроцедуры

// Очищает сведения об авансах (графа 5б счета-фактуры)
//
// Параметры:
//  Контент - ОбъектXDTO, Структура - контент электронного документа (UTD970SellerContent)
//
// Пример:
//  Контент = ПараметрыСобытия.Результат.Content;
//  ОсновнойМодуль.Авансы_Очистить(Контент);
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура Авансы_Очистить(Контент) Экспорт
	
	ИмяМетода = "КонтурДиадокВызовыПМ.УПД_ДобавитьАванс";
	
	ДопустимыеТипыКонтента = Новый Массив;
	ДопустимыеТипыКонтента.Добавить(Тип("ОбъектXDTO"));
	ДопустимыеТипыКонтента.Добавить(Тип("Структура"));
	
	_ПроверитьПараметр(ИмяМетода, "Контент", Контент, ДопустимыеТипыКонтента);
	
	Коллекция = Контент.AccompanyingDocuments;
	ОбратныйИндекс = Коллекция.Количество() - 1;
	
	Пока ОбратныйИндекс >= 0 Цикл
		
		Элемент = Коллекция[ОбратныйИндекс];
		Если Элемент.Name = Конст_ИмяДокументаАСЧФ() Тогда
			Коллекция.Удалить(ОбратныйИндекс);
		КонецЕсли;
		
		ОбратныйИндекс = ОбратныйИндекс - 1;
		
	КонецЦикла;
	
КонецПроцедуры

//#КонецОбласти ПрограммныйИнтерфейс_РаботаСКонтентом


//#Область ПрограммныйИнтерфейс_ВалидацияДокументов

// Дополняет коллекцию ошибок валидации электронного документа.
//
// Параметры:
//  Ошибки - Массив - коллекция ошибок
//  Текст - Строка - шаблон текста ошибки.
//  Ссылка - Строка, ЛюбаяСсылка - адрес гиперссылки.
//
// Примеры:
//   ДобавитьОшибкуВалидации(Ошибки, "Это текст без гиперссылки");
//   ДобавитьОшибкуВалидации(Ошибки, "Это текст с гиперссылкой на страницу <kontur.ru>", "https://kontur.ru/");
//   ДобавитьОшибкуВалидации(Ошибки, "Это текст с гиперссылкой на <контрагента>", СсылкаНаДокумент.Контрагент);
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура ДобавитьОшибкуВалидации(Ошибки, Текст, Ссылка = "") Экспорт
	
	НоваяОшибка = Новый_ОшибкаВалидации(Текст, Ссылка);
	Ошибки.Добавить(НоваяОшибка);
	
КонецПроцедуры

// Начинает новую группу ошибок валидации электронного документа.
//
// Параметры:
//  Ошибки - Массив - коллекция ошибок
//  Текст - Строка - шаблон текста ошибки.
//  Ссылка - Строка, ЛюбаяСсылка - адрес гиперссылки.
//
// Примеры:
//   НачатьГруппуОшибокВалидации(Ошибки, "Это текст без гиперссылки");
//   НачатьГруппуОшибокВалидации(Ошибки, "Это текст с гиперссылкой на страницу <kontur.ru>", "https://kontur.ru/");
//   НачатьГруппуОшибокВалидации(Ошибки, "Это текст с гиперссылкой на <контрагента>", СсылкаНаДокумент.Контрагент);
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура НачатьГруппуОшибокВалидации(Ошибки, Текст, Ссылка = "") Экспорт
	
	НоваяОшибка = Новый_ОшибкаВалидации(Текст, Ссылка);
	НоваяОшибка.ЭтоГруппа = Истина;
	Ошибки.Добавить(НоваяОшибка);
	
КонецПроцедуры

//#КонецОбласти ПрограммныйИнтерфейс_ВалидацияДокументов


//#Область ПубличныеКонтракты_Контент

// Контракт структуры для отправки неформализованных счетов на оплату
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * Таблица - ТабличныйДокумент - печатная форма документа
//    * ИмяВременногоФайла - Строка - путь к файлу печатной формы в формате PDF
//    * ИмяФайла - Строка - имя файла-вложения электронного документа
//    * Дата - Дата - дата электронного документа
//    * Номер - Строка - номер электронного документа
//    * Сумма - Число - Сумма электронного документа
//    * СуммаНДС - Число - Сумма НДС электронного документа
//    * ДокументБезНДС - Булево - Истина, если документ без НДС
//
Функция Контракт_НеформализованныйСчетНаОплату()
	
	Результат = Новый Структура;
	Результат.Вставить("Таблица", Неопределено);
	Результат.Вставить("ИмяВременногоФайла", "");
	Результат.Вставить("ИмяФайла", "");
	Результат.Вставить("Дата", Дата(1, 1, 1));
	Результат.Вставить("Номер", "");
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("СуммаНДС", 0);
	Результат.Вставить("ДокументБезНДС", Ложь);
	Результат.Вставить("КодВалюты", "");
	
	Возврат Результат;
	
КонецФункции

// Контракт структуры для отправки неформализованных актов сверки.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * Таблица - ТабличныйДокумент - печатная форма документа
//    * ИмяВременногоФайла - Строка - путь к файлу печатной формы в формате PDF
//    * ИмяФайла - Строка - имя файла-вложения электронного документа
//    * Дата - Дата - дата электронного документа
//    * Номер - Строка - номер электронного документа
//
Функция Контракт_НеформализованныйАктСверки()
	
	Результат = Новый Структура;
	Результат.Вставить("Таблица", Неопределено);
	Результат.Вставить("ИмяВременногоФайла", "");
	Результат.Вставить("ИмяФайла", "");
	Результат.Вставить("Дата", Дата(1, 1, 1));
	Результат.Вставить("Номер", "");
	
	Возврат Результат;
	
КонецФункции

// Контракт структуры для заполнения сведений об авансовых счетах-фактурах
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * Дата - Дата - дата авансового счета-фактуры
//    * Номер - Строка - номер авансового счета-фактуры
//    * ИсправлениеДата - Дата - дата исправления авансового счета-фактуры
//    * ИсправлениеНомер - Число - номер исправления авансового счета-фактуры
//
Функция Контракт_АвансИнфо()
	Результат = Новый Структура;
	Результат.Вставить("Номер", "");
	Результат.Вставить("Дата", Дата(1, 1, 1));
	Результат.Вставить("ИсправлениеНомер", 0);
	Результат.Вставить("ИсправлениеДата", Дата(1, 1, 1));
	Возврат Результат;
КонецФункции

//#КонецОбласти ПубличныеКонтракты_Контент


//#Область ПубличныеКонтракты_СопоставлениеНоменклатуры

// Контракт структуры НоменклатураИнформационнойБазы.
// 
// Возвращаемое значение:
//  Структура:
//    * Номенклатура - ОпределяемыйТип.НоменклатураБЭД, СправочникСсылка.Номенклатура, Неопределено - номенклатура.
//    * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД, СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - характеристика номенклатуры
//    * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыБЭД, СправочникСсылка.КлассификаторЕдиницИзмерения, Неопределено - упаковка / единица измерения номенклатуры
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_НоменклатураИнформационнойБазы()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Упаковка");
	
	Возврат Результат;
	
КонецФункции

// Контракт структуры НоменклатураЭлектронногоДокумента.
// 
// Возвращаемое значение:
//  Структура:
//    * Идентификатор - Строка - идентификатор номенклатуры документа
//    * Код - Строка - код номенклатуры
//    * Артикул - Строка - артикул номенклатуры
//    * Наименование - Строка - наименование номенклатуры
//    * Характеристика - Строка - наименование характеристики
//    * СтавкаНДС - Строка - представление ставки НДС
//    * ЕдиницаИзмерения - Строка - наименование единицы измерения
//    * ЕдиницаИзмеренияКод - Строка - код единицы измерения
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_НоменклатураЭлектронногоДокумента()
	
	ПустаяСтрока = "";
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", ПустаяСтрока);
	Результат.Вставить("Код", ПустаяСтрока);
	Результат.Вставить("Артикул", ПустаяСтрока);
	Результат.Вставить("Наименование", ПустаяСтрока);
	Результат.Вставить("Характеристика", ПустаяСтрока);
	Результат.Вставить("СтавкаНДС", ПустаяСтрока);
	Результат.Вставить("ЕдиницаИзмерения", ПустаяСтрока);
	Результат.Вставить("ЕдиницаИзмеренияКод", ПустаяСтрока);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти ПубличныеКонтракты_СопоставлениеНоменклатуры


//#Область ПубличныеКонтракты_ВалидацияДокументов

Функция Контракт_ОшибкаВалидацииДокумента()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Текст");
	Результат.Вставить("Ссылка");
	Результат.Вставить("ЭтоГруппа", Ложь);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти ПубличныеКонтракты_ВалидацияДокументов


//#Область ПубличныеКонтракты_ФорматыДокументов

// Публичный контракт описания типа (формата) электроннного документа.
// 
// Возвращаемое значение:
//  Структура:
//    * ТипКонтента - Строка - идентификатор базового формата
//                             см. https://developer.kontur.ru/Docs/Diadoc_UM/objects/Tipy_Kontenta.html
//    * ТипДокумента - Строка - идентификатор типа, соответствует TypeNamedId в Diadoc Web API
//                              см. https://developer.kontur.ru/Docs/Diadoc_UM/objects/Tipy_Dokumentov.html
//    * ФункцияДокумента - Строка - функция документа, принимает значения "InvoiceAndBasic", "Invoice", "Basic" и ""
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_ТипЭлектронногоДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипКонтента", "");
	Результат.Вставить("ТипДокумента", "");
	Результат.Вставить("ФункцияДокумента", "");
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт описания вида электроннного документа (ВидДокументаРазвернутый).
// Список возможных видов документов и их параметры определяется в событии ПолучитьТаблицуИспользуемыхВидовДокументов
// 
// Возвращаемое значение:
//  Структура:
//    * ID - Строка - внутренний идентификатор вида документа
//    * ТипКонтента - Строка - идентификатор схемы контейнера информации отправителя (XDTO_SellerContent).
//                             Принимает значения:
//                              - Utd970SellerContent - информация продавца для УПД, накладной, акта или СФ в формате 970@
//                              - Utd820SellerContent - информация продавца для УПД, накладной, акта или СФ в формате 820@
//                              - UtdSellerContent - информация продавца для УПД, накладной, акта или СФ в формате 155@
//                              - UcdSellerContent - информация продавца для УКД или КСФ в формате 736@ или 189@
//                              - TovTorgSellerContent - информация продавца для товарной накладной в формате 551@
//                              - Act552SellerContent - информация продавца для акта выполненных работ в формате 552@
//                              - Torg2SenderTitle - информация отправителя для акта о расхождениях (Торг-2) в формате 423@
//                              - ProformaInvoiceSellerContent - информация продавца для счета на оплату в формате Диадока
//                              - ReconciliationActSenderTitle - информация отправителя для акта сверки в формате 405@
//                              - Torg12SellerContent - информация продавца для накладной в формате 172@
//                              - AcceptanceCertificateSellerContent - информация продавца для акта в формате 172@
//                              - InvoiceContent - информация продавца для СФ в формате 93@
//                              - InvoiceCorrectionContent - информация продавца для КСФ в формате 93@
//    * TypeNamedId - Строка - идентификатор типа, соответствует TypeNamedId в Diadoc Web API
//                             см. https://developer.kontur.ru/Docs/Diadoc_UM/objects/Tipy_Dokumentov.html
//    * FunctionName - Строка - функция документа, возможные значения зависят от типа документа.
//                              Для УПД: "СЧФДОП", "СЧФ", "ДОП", "СвРК", "СвЗК"
//                              Для УКД: "КСЧФДИС", "КСЧФ", "ДИС", "СвИСРК", "СвИСЗК"
//                              Для Торг-2: "NoAdditionalInfo", "WithAdditionalInfo"
//                              Для остальных документов: "" (пустая строка)
//    * FormatVersion - Строка - идентификатор базового формата (то же, что "ТипКонтента" в Контракт_ТипЭлектронногоДокумента)
//                               см. https://developer.kontur.ru/Docs/Diadoc_UM/objects/Tipy_Kontenta.html
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_ВидЭлектронногоДокумента()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ID", "");
	Результат.Вставить("ТипКонтента", "");
	Результат.Вставить("TypeNamedId", "");
	Результат.Вставить("FunctionName", "");
	Результат.Вставить("FormatVersion", "");
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти ПубличныеКонтракты_ФорматыДокументов


//#Область ПубличныеКонтракты_КонтекстСеанса

// Публичный контракт строки контекста сеанса
// 
// Возвращаемое значение:
//  Структура.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_СтрокаКонтекстаСеанса()
	
	Результат = Новый Структура;
	Результат.Вставить("Box", Неопределено); // Контракт_ЯщикДиадока
	Результат.Вставить("BoxId", ""); // адрес ящика (в формате <...@diadoc.ru>)
	Результат.Вставить("OrgId", ""); // идентификатор организации
	Результат.Вставить("Токен", ""); // авторизационный токен
	Результат.Вставить("Логин", ""); // (Устарело) всегда пустая строка
	Результат.Вставить("ТипАвторизации", ""); // (Устарело) значение "Сертификат", "Логин" или "ПорталБраузер"
	Результат.Вставить("ОтпечатокСертификата", ""); // отпечаток сертификата
	Результат.Вставить("Сертификат", Неопределено); // Контракт_ОписаниеСертификата
	Результат.Вставить("ГОСТСертификата", ""); // (Устарело) всегда пустая строка
	Результат.Вставить("ИНН", ""); // ИНН организации
	Результат.Вставить("КПП", ""); // КПП организации
	Результат.Вставить("ОрганизацияДиадок", Неопределено); // СправочникСсылка.Диадок_ЮрФизЛица (только для СХ-1)
	Результат.Вставить("ОрганизацияНаименование", ""); // Наименование организации
	Результат.Вставить("ПраваПользователя", Неопределено); // OrganizationUserPermissions
	Результат.Вставить("ОписаниеПользователя", Неопределено); // Контракт_ОписаниеПользователяДиадока
	Результат.Вставить("ТребуетсяОплатаСервиса", Ложь);
	Результат.Вставить("ЭтоТестоваяОрганизация", Ложь);
	Результат.Вставить("МожноПодписыватьДокументы", Ложь);
	Результат.Вставить("ТребуетсяМЧД", Ложь);
	Результат.Вставить("ДополнительныеФункции", Неопределено); // Контракт_НастройкиЯщикаДиадока
	
	Результат.Вставить("СервисПодпискиНаМодуль", Контракт_ДоступныйСервис()); // Для совместимости с плагинами (служебное поле)
	Результат.Вставить("ЛицевыеСчета", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт описания ящика Диадока
// 
// Возвращаемое значение:
//  Структура.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_ЯщикДиадока()
	
	Результат = Новый Структура;
	Результат.Вставить("BoxId", "");
	Результат.Вставить("Title", "");
	Результат.Вставить("Organization", Неопределено); // Organization
	Результат.Вставить("InvoiceFormatVersion", "");
	Результат.Вставить("EncryptedDocumentsAllowed", "");
	Результат.Вставить("BoxIdGuid", "");
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт описания организации Диадока
// 
// Возвращаемое значение:
//  Структура.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_Организация()
	
	Результат = Новый Структура;
	Результат.Вставить("BoxId",				 "");
	Результат.Вставить("OrgId",				 "");
	Результат.Вставить("ИНН",				 "");
	Результат.Вставить("КПП",				 "");
	Результат.Вставить("Наименование",		 "");
	Результат.Вставить("ОГРН",				 "");
	Результат.Вставить("FnsParticipantId",	 "");
	Результат.Вставить("Подразделения",		 Новый Массив);
	Результат.Вставить("Пилотная",			 Ложь);
	Результат.Вставить("Активная",			 Ложь);
	Результат.Вставить("Тестовая",			 Ложь);
	Результат.Вставить("Филиал",			 Ложь);
	Результат.Вставить("Роуминг",			 Ложь);
	Результат.Вставить("Sociability",		 "");
	Результат.Вставить("ДатаЛиквидации",	 Дата(1, 1, 1));
	Результат.Вставить("Иностранная",		 Ложь);
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт настроек ящика в Диадоке
// 
// Возвращаемое значение:
//  Структура.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_НастройкиЯщикаДиадока()
	
	Результат = Новый Структура;
	Результат.Вставить("РазрешеноШифрование", Ложь);
	Результат.Вставить("РазрешенаСогласующаяПодпись", Ложь);
	Результат.Вставить("РазрешенаПересылкаТретьейСтороне", Ложь);
	Результат.Вставить("РазрешенаОтправкаЧерезПромежуточногоПолучателя", Ложь);
	Результат.Вставить("РазрешенаОтправкаЗаблокированныхПакетов", Ложь);
	Результат.Вставить("ВыводитьНаименованиеТовараСКодами", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт лицевого счета
// 
// Возвращаемое значение:
//  Структура:
//    * ЛицевойСчет - Строка - идентификатор ЛС;
//    * КодПродукта - Строка - код продукта;
//    * ДоступныеСервисы - Массив - коллекция доступных сервисов для ЛС, см. Контракт_ДоступныйСервис; 
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_ЛицевойСчет()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ЛицевойСчет");
	Результат.Вставить("КодПродукта");
	Результат.Вставить("ДоступныеСервисы", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт доступного сервиса
// 
// Возвращаемое значение:
//  Структура:
//    * Идентификатор - Строка - идентификатор сервиса;
//    * Представление - Строка - представление сервиса;
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_ДоступныйСервис()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("Представление", "");
	Результат.Вставить("ИдентификаторПодписки", "");
	Результат.Вставить("ЛицевойСчет", "");
	Результат.Вставить("КодПродукта", "");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ДоступныйСервис(ДанныеДоступногоСервиса)
	
	Результат = Контракт_ДоступныйСервис();
	
	Результат.Идентификатор = ДанныеДоступногоСервиса.Идентификатор;
	Результат.Представление = ДанныеДоступногоСервиса.Представление;
	Результат.ИдентификаторПодписки = ДанныеДоступногоСервиса.ИдентификаторПодписки;
	Результат.ЛицевойСчет = ДанныеДоступногоСервиса.ЛицевойСчет;
	Результат.КодПродукта = ДанныеДоступногоСервиса.КодПродукта;
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт описания пользователя Диадока
// 
// Возвращаемое значение:
//  Структура.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_ОписаниеПользователяДиадока()
	
	Результат = Новый Структура;
	Результат.Вставить("Id", "");
	Результат.Вставить("ФИО", "");
	Результат.Вставить("Фамилия", "");
	Результат.Вставить("Имя", "");
	Результат.Вставить("Отчество", "");
	Результат.Вставить("Должность", "");
	Результат.Вставить("ИННСертификата", "");
	
	Возврат Результат;
	
КонецФункции

// Публичный контракт сертификата
// 
// Возвращаемое значение:
//  Структура.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_ОписаниеСертификата()
	
	ПустаяДата = '00010101';
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("ДатаВыдачи", ПустаяДата);
	Результат.Вставить("СрокДействия", ПустаяДата);
	Результат.Вставить("ОтпечатокСертификата", "");
	Результат.Вставить("Издатель", "");
	Результат.Вставить("ОрганизацияИздателя", "");
	Результат.Вставить("Организация", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("Тип", "");
	Результат.Вставить("Ошибка", Неопределено);
	Результат.Вставить("ЭтоКЭП", Ложь);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти ПубличныеКонтракты_КонтекстСеанса


//#Область ПубличныеКонтракты_ОтменаФиксацииКодовМаркировки

// Формирует квитанцию об отмене фиксации кодов маркировки.
// Перед вызовом метода следует указать ящик (см. ЭДО_УстановитьТекущийЯщик)
//
// @ПубличныйПрограммныйИнтерфейс
//
// Параметры:
//  ЭлектронныйДокумент - СправочникСсылка.Диадок_Документы - электронный документ, по которому требуется сформировать
//                                                            квитанцию об отмене фиксации кодов маркировки
// 
// Возвращаемое значение:
//  ДвоичныеДанные - файл квитанции об отмене фиксации
//
Функция ЭДО_ОтменаФиксации_СформироватьКвитанцию(Знач ЭлектронныйДокумент) Экспорт
	
	_ПроверитьКонтекстТекущегоЯщика();
	_ПроверитьПодсистемуХраненияКонтурДиадок();
	
	ИмяМетода = "КонтурДиадокВызовыПМ.ЭДО_ОтменаФиксации_СформироватьКвитанцию";
	_ПроверитьПараметр(ИмяМетода, "ЭлектронныйДокумент", ЭлектронныйДокумент, Тип("СправочникСсылка.Диадок_Документы"));
	
	ДокументИнфо = Документы_СохраненныйДокумент(ЭлектронныйДокумент);
	
	ИмяФайлаВложения = ДокументИнфо.Метаданные.FileName;
	ОрганизацияИНН = _ТекущаяСтрокаКонтекста.Ящик.Организация.ИНН;
	Результат = Ядро.Новый_ДвоичныйКонтентОтменыФиксации(ИмяФайлаВложения, ОрганизацияИНН);
	
	Возврат Результат;
	
КонецФункции // ЭДО_ОтменаФиксации_СформироватьКвитанцию

// Отправляет квитанцию об отмене фиксации кодов маркировки
// Перед вызовом метода следует указать ящик (см. ЭДО_УстановитьТекущийЯщик)
//
// @ПубличныйПрограммныйИнтерфейс
//
// Параметры:
//  ЭлектронныйДокумент - СправочникСсылка.Диадок_Документы - электронный документ, по которому требуется отправить
//                                                            квитанцию об отмене фиксации кодов маркировки
//  ОтменаФиксации - ДвоичныеДанные - файл квитанции об отмене фиксации
//  Подпись - ДвоичныеДанные - файл подписи к квитанции об отмене фиксации
//
Процедура ЭДО_ОтменаФиксации_ОтправитьКвитанцию(ЭлектронныйДокумент, ОтменаФиксации, Подпись) Экспорт
	
	_ПроверитьКонтекстТекущегоЯщика();
	_ПроверитьПодсистемуХраненияКонтурДиадок();
	
	ИмяМетода = "КонтурДиадокВызовыПМ.ЭДО_ОтменаФиксации_ОтправитьКвитанцию";
	_ПроверитьПараметр(ИмяМетода, "ЭлектронныйДокумент", ЭлектронныйДокумент, Тип("СправочникСсылка.Диадок_Документы"));
	_ПроверитьПараметр(ИмяМетода, "ОтменаФиксации", ОтменаФиксации, Тип("ДвоичныеДанные"));
	_ПроверитьПараметр(ИмяМетода, "Подпись", Подпись, Тип("ДвоичныеДанные"));
	
	BoxId = _ТекущаяСтрокаКонтекста.Ящик.Идентификатор;
	МЧД = МЧДСлужебный_ТекущаяДоверенность(BoxId);
	PowerOfAttorney = Ядро.АПИ_Новый_PowerOfAttorneyToPost(МЧД);
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("MessageId", "LetterId");
	ТребуемыеРеквизиты.Вставить("EntityId", "DocumentId");
	ИдентификаторыЭД = Общее_ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент, ТребуемыеРеквизиты);
	
	SignedContent = Ядро.АПИ_Новый_SignedContent(ОтменаФиксации, Подпись, , , PowerOfAttorney);
	Вложение = Ядро.АПИ_Новый_TtGisFixationCancellationRequestAttachment(
		ИдентификаторыЭД.EntityId,
		SignedContent
	);
	
	ДанныеДляОтправки = Новый Структура;
	ДанныеДляОтправки.Вставить("TtGisFixationCancellationRequests", Новый Массив);
	ДанныеДляОтправки.TtGisFixationCancellationRequests.Добавить(Вложение);
	
	Идентификаторы = Новый_Идентификаторы(, , BoxId, ИдентификаторыЭД.MessageId);
	РезультатОтправки = Ядро.РезультатPostMessagePatch(Идентификаторы, ДанныеДляОтправки);
	
КонецПроцедуры // ЭДО_ОтменаФиксации_ОтправитьКвитанцию

//#КонецОбласти ПубличныеКонтракты_ОтменаФиксацииКодовМаркировки


//#Область СлужебныйПрограммныйИнтерфейс

// Получает описания используемых видов пакетов. Дефолтный список пакетов, поставляемых вместе с
// типовым интеграционным модулем, может быть переопределен в событии ПолучитьТаблицуИспользуемыхПакетов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//    * ID - Строка - идентификатор вида пакета
//    * Наименование - Строка - пользовательское представление вида пакета
//    * СоставПакета - Строка - идентификаторы видов документов (через запятую)
//    * КатегорияПакета - Строка - идентификатор категории пакетов
//    * НаименованиеКатегории - Строка - пользовательское представление категории пакетов
//    * Шаблон - Булево - Истина, если пакет является шаблоном
//
// @СлужебныйПрограммныйИнтерфейс
//
Функция ИспользуемыеВидыПакетов() Экспорт
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ID", ТипСтрока, "Идентификатор");
	Результат.Колонки.Добавить("Наименование", ТипСтрока, "Представление");
	Результат.Колонки.Добавить("СоставПакета", ТипСтрока, "Состав пакета");
	Результат.Колонки.Добавить("КатегорияПакета", ТипСтрока, "Идентификатор категории");
	Результат.Колонки.Добавить("НаименованиеКатегории", ТипСтрока, "Представление категории");
	Результат.Колонки.Добавить("Шаблон", ТипБулево, "Это шаблон");
	
	Данные = Ядро.ИнтеграцияСлужебный_ПолучитьТаблицуИспользуемыхПакетов();
	
	Для Каждого Запись Из Данные Цикл
		
		ВидПакета = Результат.Добавить();
		ВидПакета.ID = Запись.ID;
		ВидПакета.Наименование = Запись.Наименование;
		ВидПакета.СоставПакета = Запись.СоставПакета;
		ВидПакета.КатегорияПакета = Запись.КатегорияПакета;
		ВидПакета.НаименованиеКатегории = Запись.НаименованиеКатегории;
		ВидПакета.Шаблон = Запись.Шаблон;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти СлужебныйПрограммныйИнтерфейс


//**********************************************
//{		КОНТУР.ПЛАГИНЫ

// Точка интеграции продукта и библиотеки плагинов.
// Позволяет переопределить стандартное поведение библиотеки плагинов.
//
// Параметры:
//  ИмяСобытия - Строка - идентификатор служебного события.
//  ПараметрыСобытия - Структура - параметры служебного события.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события в библиотеке.
//
// @СлужебныйПрограммныйИнтерфейс
//
Процедура КонтурПлагины_ОбработатьСлужебноеСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка) Экспорт
	
	ИмяСобытияНРег = НРег(ИмяСобытия);
	СтандартнаяОбработка = Ложь;
	
	Если ИмяСобытияНРег = НРег("ПриПолученииИдентификатораПроекта") Тогда
		
		ПараметрыСобытия.Результат = КонтурПлагины_ИмяПроекта();
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриВыполненииHTTPЗапроса") Тогда
		
		КонтурПлагины_ПриВыполненииHTTPЗапроса(
			ПараметрыСобытия.ОписаниеОтвета,
			ПараметрыСобытия.ОписаниеЗапроса
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриЧтенииКэша") Тогда
		
		Ключ = ПараметрыСобытия.Ключ;
		
		ПараметрыСобытия.Результат = Ядро.Кэш_Прочитать(Ключ);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриПомещенииКэша") Тогда
		
		Ключ = ПараметрыСобытия.Ключ;
		Значение = ПараметрыСобытия.Значение;
		
		Ядро.Кэш_Поместить(Ключ, Значение);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриЗагрузкеПлагина") Тогда
		
		КонтурПлагины_ПриЗагрузкеПлагина(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПрочитатьФайлПлагина") Тогда
		
		КонтурПлагины_ПрочитатьФайлПлагина(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриПолученииСпискаЗагруженныхПлагинов") Тогда
		
		КонтурПлагины_ПриПолученииСпискаЗагруженныхПлагинов(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриПроверкеВозможностиНастройки") Тогда
		
		КонтурПлагины_ПриПроверкеВозможностиНастройки(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
		
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриУдаленииПлагина") Тогда
		
		КонтурПлагины_ПриУдаленииПлагина(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриВключенииПлагина") Тогда
		
		КонтурПлагины_ПриВключенииПлагина(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриОтключенииПлагина") Тогда
		
		КонтурПлагины_ПриОтключенииПлагина(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриПолученииНастроекПлагина") Тогда
		
		КонтурПлагины_ПриПолученииНастроекПлагина(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриСохраненииНастроекПлагина") Тогда
		
		КонтурПлагины_ПриСохраненииНастроекПлагина(
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	ИначеЕсли ИмяСобытияНРег = НРег("ПриПолученииМетрики") Тогда
		
		КонтурПлагины_ПриПолученииМетрики(ПараметрыСобытия);
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
	КонтурПлагины_ЛогироватьОбработкуСобытия(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

// @СлужебныйПрограммныйИнтерфейс
//
Процедура КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды) Экспорт
	
	Ядро.КонтурПлагины_ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды);
	
КонецПроцедуры

// Содержит имя проекта основного модуля.
//
// Возвращаемое значение:
//  Строка.
//
Функция КонтурПлагины_ИмяПроекта()
	Возврат "Diadoc";
КонецФункции

Процедура КонтурПлагины_ПриВыполненииHTTPЗапроса(ОписаниеОтвета, ОписаниеЗапроса)
	
	ВнешниеСервисы = Ядро.Модуль_ВнешниеСервисы(Ядро);
	
	ПараметрыЗапроса = ВнешниеСервисы.ПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Метод		 = ОписаниеЗапроса.Метод;
	ПараметрыЗапроса.АдресМетода = ОписаниеЗапроса.ПутьНаСервере;
	ПараметрыЗапроса.ТелоЗапроса = ОписаниеЗапроса.ТелоЗапроса;
	ПараметрыЗапроса.Заголовки	 = ОписаниеЗапроса.Заголовки;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = ОписаниеЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Для Каждого Параметр Из ОписаниеЗапроса.Параметры Цикл
		ПараметрыЗапроса.Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ПараметрыСервиса = Ядро.ПараметрыСервиса_Диадок();
	ПараметрыСервиса.АдресВебСервиса = ОписаниеЗапроса.ИмяСервера;
	
	ОписаниеОтвета = ВнешниеСервисы.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
КонецПроцедуры

Процедура КонтурПлагины_ПриПолученииМетрики(ПараметрыСобытия)
	
	Ядро.КонтурПлагины_ЗарегистрироватьСобытиеМетрики(ПараметрыСобытия);
	
КонецПроцедуры

Процедура КонтурПлагины_ЛогироватьОбработкуСобытия(Знач ИмяОбработчика, Знач ЗначенияПараметров, Знач СтандартнаяОбработка)
	
	Если Не ЭДО_Служебные_РежимОтладкиВключен() Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонКомментария =
	"Обработчик = %1
	|СтандартнаяОбработка = %2";
	
	КомментарийЖР = Общее_ПараметрыВСтроку(
		ШаблонКомментария,
		ИмяОбработчика,
		СтандартнаяОбработка
	);
	
	ЖурналРегистрации_ЗаписатьИнформацию("Плагины", КомментарийЖР);
	
КонецПроцедуры

Функция ИспользуетсяСтандартноеХранилищеПлагинов()
	
	Результат = НЕ КонтурПлагины_ПереопределитьСистемуХранения;
	
	Возврат Результат;
	
КонецФункции

Процедура КонтурПлагины_ПриПолученииСпискаЗагруженныхПлагинов(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	УстановленныеПлагины = Ядро.КонтурПлагины_КоллекцияУстановленныхПлагинов();
	
	Результат = Новый Массив;
	
	Для Каждого Запись Из УстановленныеПлагины Цикл
		
		ОписаниеПлагина = Новый Структура;
		ОписаниеПлагина.Вставить("Идентификатор", Запись.ID);
		ОписаниеПлагина.Вставить("Версия", Запись.Версия);
		ОписаниеПлагина.Вставить("Включен", Запись.Включен);
		ОписаниеПлагина.Вставить("Представление", Запись.Представление);
		
		ПараметрыСобытия.Результат.Добавить(ОписаниеПлагина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КонтурПлагины_ПриПроверкеВозможностиНастройки(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	Результат = Новый_ОписаниеПроверкиСохраненияНастроек();
	
	РезультатИнициализации = Ядро.РезультатИнициализацииОсновногоМодуля();
	
	Если НЕ РезультатИнициализации.УстановленаПодсистемаДиадока Тогда
		
		ТекстОшибки = НСтр(
			"ru = 'В составе конфигурации не найдена подсистема Диадок.
			|Для использования функциональности плагинов нужно добавить подсистему Диадок в состав объектов конфигурацийй.'"
		);
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = ТекстОшибки;
		
	ИначеЕсли РезультатИнициализации.СписокОшибокДоступа.Количество() > 0 Тогда
		
		СписокОшибокСтрокой = "";
		
		Для Каждого Элемент Из РезультатИнициализации.СписокОшибокДоступа Цикл
			СписокОшибокСтрокой = СписокОшибокСтрокой + "- " + Элемент.Значение + Символы.ПС;
		КонецЦикла;
		
		ШаблонТекстаОшибки = НСтр(
			"ru = 'При обращении к системе харанения Диадок возникли следующие ошибки: 
			|
			|%1
			|Устраните ошибки и попробуйте использовать функциональность плагинов снова.'"
		);
		
		ТекстОшибки = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			ШаблонТекстаОшибки,
			СписокОшибокСтрокой
		);
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = ТекстОшибки;
		
	Иначе
		
		Результат.Успешно = Истина;
		Результат.ОписаниеОшибки = "";
		
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
КонецПроцедуры

Процедура КонтурПлагины_ПриЗагрузкеПлагина(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	СведенияОПлагине = ПараметрыСобытия.Описание;
	
	Ядро.КонтурПлагины_ЗагрузитьПлагин(
		ПараметрыСобытия.Файл,
		СведенияОПлагине.Идентификатор,
		СведенияОПлагине.Версия,
		СведенияОПлагине.Включен,
		СведенияОПлагине.Представление
	);
	
КонецПроцедуры

Процедура КонтурПлагины_ПрочитатьФайлПлагина(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторПлагина = ПараметрыСобытия.Идентификатор;
	
	ДвоичныеДанныеПлагина = Ядро.КонтурПлагины_ПрочитатьФайлПлагина(ИдентификаторПлагина);
	
	Если ЗначениеЗаполнено(ДвоичныеДанныеПлагина) Тогда
		
		ПараметрыСобытия.Результат = ДвоичныеДанныеПлагина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтурПлагины_ПриУдаленииПлагина(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторПлагина = ПараметрыСобытия.Идентификатор;
	
	Попытка
		
		Ядро.КонтурПлагины_УдалитьПлагин(ИдентификаторПлагина);
		
		ПараметрыСобытия.Результат.Успешно = Истина;
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ПодробноеПредставление = ПодробноеПредставлениеОшибки(Ошибка);
		
		ПараметрыСобытия.Результат.ОписаниеОшибки = ПодробноеПредставление;
		ПараметрыСобытия.Результат.Успешно = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура КонтурПлагины_ПриВключенииПлагина(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторПлагина = ПараметрыСобытия.Идентификатор;
	ВключитьПлагин = Истина;
	
	Ядро.КонтурПлагины_ВключитьОтключитьПлагин(
		ИдентификаторПлагина,
		ВключитьПлагин
	);
	
КонецПроцедуры

Процедура КонтурПлагины_ПриОтключенииПлагина(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторПлагина = ПараметрыСобытия.Идентификатор;
	ВключитьПлагин = Ложь;
	
	Ядро.КонтурПлагины_ВключитьОтключитьПлагин(
		ИдентификаторПлагина,
		ВключитьПлагин
	);
	
	ПараметрыСобытия.Результат.Успешно = Истина;
	
КонецПроцедуры

Процедура КонтурПлагины_ПриПолученииНастроекПлагина(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторПлагина = ПараметрыСобытия.Идентификатор;
	
	НастройкиПлагина = Ядро.КонтурПлагины_ПрочитатьНастройкиПлагина(ИдентификаторПлагина);
	
	Если ЗначениеЗаполнено(НастройкиПлагина) Тогда
		
		ПараметрыСобытия.Результат.Данные = НастройкиПлагина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтурПлагины_ПриСохраненииНастроекПлагина(ПараметрыСобытия, СтандартнаяОбработка)
	
	Если ИспользуетсяСтандартноеХранилищеПлагинов() Тогда
		
		СтандартнаяОбработка = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторПлагина = ПараметрыСобытия.Идентификатор;
	НастройкиПлагина = ПараметрыСобытия.Настройки;
	
	Ядро.КонтурПлагины_СохранитьНастройкиПлагина(
		ИдентификаторПлагина,
		НастройкиПлагина
	);
	
КонецПроцедуры

Функция Новый_ОписаниеПроверкиСохраненияНастроек()
	
	Результат = Новый Структура();
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("ОписаниеОшибки", "");
	
	Возврат Результат;
	
КонецФункции

//}		КОНТУР.ПЛАГИНЫ


//{		СЛУЖЕБНЫЕ

// Возвращает идентификатор типового интеграционного модуля.
// 
// Возвращаемое значение:
//  Строка - имя интеграционного модуля. Пустая строка, если типовой ИМ не используется.
//
// @СлужебныйПрограммныйИнтерфейс
//
Функция ИдентификаторИнтеграционногоМодуля() Экспорт
	
	Возврат _ТекущийИМ;
	
КонецФункции

Процедура Автотесты_ВыполнитьТесты() Экспорт
	
	Ядро.Автотесты_ВыполнитьТесты();
	
КонецПроцедуры

Процедура ИнициализироватьМодуль(Модуль_Ядро, ПереопределитьСистемуХраненияПлагинов, ИмяИМ) Экспорт
	
	Ядро = Модуль_Ядро;
	
	ОбщийКонтекстКлиентСервер = Модуль_Ядро.ОбщийКонтекстКлиентСервер;
	КлючAPIРазработчика = Модуль_Ядро.ОбщийКонтекстКлиентСервер.КлючРазработчика;
	КонтурПлагины_ПереопределитьСистемуХранения = ПереопределитьСистемуХраненияПлагинов;
	
	_ТекущийИМ = ИмяИМ;
	
	Если СписокДокументов = Неопределено Тогда
		СписокДокументов = Новый_СписокДокументов();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	
КонецПроцедуры

// Дополняет таблицу сопоставления номенклатуры колонками "Характеристика" и "Упаковка".
//
// Параметры:
//  ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры.
//
Процедура ДополнитьКолонкиТаблицыСопоставленияНоменклатуры(ТаблицаСопоставления)
	
	КолонкиТаблицы = ТаблицаСопоставления.Колонки;
	
	Если КолонкиТаблицы.Найти("Характеристика") = Неопределено Тогда
		КолонкиТаблицы.Добавить("Характеристика");
	КонецЕсли;
	
	Если КолонкиТаблицы.Найти("Упаковка") = Неопределено Тогда
		КолонкиТаблицы.Добавить("Упаковка");
	КонецЕсли;

КонецПроцедуры

Функция Новый_ОшибкаВалидации(Текст, Ссылка)
	
	Результат = Контракт_ОшибкаВалидацииДокумента();
	Результат.Текст = Текст;
	Результат.Ссылка = Ссылка;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_Идентификаторы(ДокументЭДО = Неопределено, ПакетЭДО = Неопределено, BoxId = "", LetterId = "", DocumentId = "")

	Результат = Ядро.Контракт_Идентификаторы();
	
	Результат.ДокументЭДО	= ДокументЭДО;
	Результат.ПакетЭДО		= ПакетЭДО;
	Результат.BoxId			= BoxId;
	Результат.LetterId		= LetterId;
	Результат.DocumentId	= DocumentId;

	Возврат Результат;
	
КонецФункции

Функция Новый_СписокДокументов()
	
	Результат = Ядро.Новый_СписокДокументов();

	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПодключаемыйМодуль_ОбработатьСобытие(ИмяСобытия, Параметры = Неопределено) Экспорт
	
	ЧерныйСписок = Новый Массив;
	ЧерныйСписок.Добавить(НРег("ПолучитьЗаполненныйОбъектДокумента1С"));
	ЧерныйСписок.Добавить(НРег("НайтиСопоставлениеДокумента"));
	ЧерныйСписок.Добавить(НРег("НайтиСопоставлениеНоменклатуры"));
	ЧерныйСписок.Добавить(НРег("СопоставитьНоменклатуруПоставщика"));
	ЧерныйСписок.Добавить(НРег("СписокТиповДокументовДляСоздания"));
	ЧерныйСписок.Добавить(НРег("ПодготовитьЭлектронныйДокумент"));
	ЧерныйСписок.Добавить(НРег("ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме"));
	ЧерныйСписок.Добавить(НРег("ОпределитьТипЗначенияОбъекта"));
	ЧерныйСписок.Добавить(НРег("ПолучитьТаблицуИспользуемыхПакетов"));
	ЧерныйСписок.Добавить(НРег("ПолучитьТаблицуИспользуемыхВидовДокументов"));
	
	ВызовСобытияЗапрещен = (ЧерныйСписок.Найти(НРег(ИмяСобытия)) <> Неопределено);
	
	Если ВызовСобытияЗапрещен Тогда
		
		ИмяФункции = "ЭДО_ПодключаемыйМодуль_ОбработатьСобытие";
		
		Ошибка = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			"%1: Вызов обработчика события запрещен (%2)
			|Рекомендуется отказаться от использования функции %3 или использовать другое имя события",
			ИмяФункции,
			ИмяСобытия,
			ИмяФункции
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Результат = Ядро.ПодключаемыйМодуль_ОбработатьСобытие(ИмяСобытия, Параметры);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, подключен ли типовой интеграционный модуль.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ИспользуетсяИнтеграционныйМодуль()
	
	ИдентификаторИМ = ИдентификаторИнтеграционногоМодуля();
	Результат = ЗначениеЗаполнено(ИдентификаторИМ);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(Знач ВызывающийМетод, Контекст)
	
	Ядро.Метрика_ДобавитьОшибку_ОтсутствуетИнтеграционныйМодуль(ВызывающийМетод, Контекст);
	
	КраткийТекстОшибки = "Интеграционный модуль не подключен";
	
	ЖурналРегистрации_ЗаписатьОшибку(
		ВызывающийМетод,
		КраткийТекстОшибки
	);
	
	ПодробныйТекстОшибки = Общее_ПараметрыВСтроку(
		"Ошибка при вызове метода стандартной библиотеки интеграции (%1) по причине: %2",
		ВызывающийМетод,
		КраткийТекстОшибки
	);
	
	ВызватьИсключение ПодробныйТекстОшибки;
	
КонецПроцедуры

Процедура ЖурналРегистрации_ЗаписатьОшибку(Знач ИмяСобытия, Знач Комментарий)
	
	ИдентификаторСобытия = ЖурналРегистрации_ИдентификаторСобытия(ИмяСобытия);
	
	ЗаписьЖурналаРегистрации(
		ИдентификаторСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		Неопределено,
		Неопределено,
		Комментарий
	);
	
КонецПроцедуры

Процедура ЖурналРегистрации_ЗаписатьИнформацию(Знач ИмяСобытия, Знач Комментарий)
	
	ИдентификаторСобытия = ЖурналРегистрации_ИдентификаторСобытия(ИмяСобытия);
	
	ЗаписьЖурналаРегистрации(
		ИдентификаторСобытия,
		УровеньЖурналаРегистрации.Информация,
		Неопределено,
		Неопределено,
		Комментарий
	);
	
КонецПроцедуры

Функция ЖурналРегистрации_ИдентификаторСобытия(ИмяСобытия)
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(ЖурналРегистрации_ИдентификаторПродукта());
	Подстроки.Добавить(ЖурналРегистрации_ИмяМодуля());
	Подстроки.Добавить(ИмяСобытия);
	
	Разделитель = ".";
	
	Результат = Общее_СоединитьСтроку(Подстроки, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция ЖурналРегистрации_ИдентификаторПродукта()
	Возврат "КонтурДиадок";
КонецФункции

Функция ЖурналРегистрации_ИмяМодуля()
	Возврат "ВызовыПМ";
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// ВАЖНО: В результирующую строку добавляются только непустые значения!
// Платформенный метод СтрСоединить объединяет строки безусловно.
// Нужно это учитывать, если в качестве разделителя задана непустая строка.
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - коллекция объединяемых строк.
//  Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
// Пример:
//   
//   Строки = Новый Массив;
//   Строки.Добавить("Элемент0");
//   Строки.Добавить("");
//   Строки.Добавить("Элемент2");
//   
//   СоединитьСтроку(Строки, "#") = "Элемент0#Элемент2"
//   СтрСоединить(Строки, "#") = "Элемент0##Элемент2"
//   СоединитьСтроку(Строки, "") = СтрСоединить(Строки, "") = "Элемент0Элемент2"
//
Функция Общее_СоединитьСтроку(Строки, Знач Разделитель = "")
	
	Результат = "";
	ТекРазделитель = "";
	
	Для Каждого Строка Из Строки Цикл
		
		Если Не ЗначениеЗаполнено(Строка) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + ТекРазделитель + Строка;
		ТекРазделитель = Разделитель;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон строки с параметрами;
//  Параметр<n>	 - Строка - подставляемый параметр.
//
// Пример:
//  ПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
// 
// Возвращаемое значение:
//  Строка - строка с подставленными параметрами.
//
Функция Общее_ПараметрыВСтроку(ШаблонСтроки,
	Параметр1,
	Параметр2 = Неопределено,
	Параметр3 = Неопределено,
	Параметр4 = Неопределено,
	Параметр5 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат, "%2", Параметр2);
	Результат = СтрЗаменить(Результат, "%3", Параметр3);
	Результат = СтрЗаменить(Результат, "%4", Параметр4);
	Результат = СтрЗаменить(Результат, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции


//}		СЛУЖЕБНЫЕ


//{		ВСПОМОГАТЕЛЬНЫЕ

Функция ПолучитьРезультатСопоставленияКонтрагентов(Знач АдресДетальныхДанных)
	
	Результат = Новый_РезультатыГрупповогоСопоставленияКонтрагентов();
	
	ДетальныеДанныеСопоставления = ПолучитьИзВременногоХранилища(АдресДетальныхДанных);
	
	Для Каждого ЗаписьДетальныеДанные Из ДетальныеДанныеСопоставления Цикл
		
		СтрокаРезультат = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезультат, ЗаписьДетальныеДанные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_РезультатыГрупповогоСопоставленияКонтрагентов()
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("ИНН", ОписаниеТиповСтрока);
	Результат.Колонки.Добавить("КПП", ОписаниеТиповСтрока);
	Результат.Колонки.Добавить("Статус", ОписаниеТиповСтрока);
	Результат.Колонки.Добавить("Количество", ОписаниеТиповЧисло);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПартнерскихОтношенийОтборПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить("IsMyCounteragent");
	Результат.Добавить("InvitesMe");
	Результат.Добавить("IsInvitedByMe");
	
	Возврат Результат;
		
КонецФункции

Процедура ВызватьИсключениеНедопустимоеЗначениеПараметра(Знач ИмяМетода, Знач ИмяПараметра)
	
	Ошибка = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
		"Недопустимое значение параметра %1 в %2.",
		ИмяПараметра,
		ИмяМетода
	);
	
	ВызватьИсключение Ошибка;
	
КонецПроцедуры

Процедура ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Таблица, Колонки, ОписаниеТипов = Неопределено) Экспорт
	
	Ядро.ДобавитьКолонкиВТаблицуЗначений(Таблица, Колонки, ОписаниеТипов);
	
КонецПроцедуры

Процедура ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0 = Неопределено, 
																Значение1 = Неопределено, 
																Значение2 = Неопределено, 
																Значение3 = Неопределено, 
																Значение4 = Неопределено, 
																Значение5 = Неопределено) Экспорт
	
	Ядро.ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Функция ЭДО_Служебные_АдресЯщикаКонтрагента(Гуид) Экспорт
	
	Результат = Ядро.ИдентификаторВАдресЯщика(Гуид);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_КаноническийГуид(Гуид) Экспорт
	
	Результат = Ядро.АдресЯщикаВИдентификатор(Гуид);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_ВнешниеСервисы() Экспорт
	
	Результат = Ядро.Модуль_ВнешниеСервисы(Ядро);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_ПолучитьМакет(ИмяМакета) Экспорт
	
	Если ИмяМакета <> "ТиповойМодульДиадокУФ_epf" И ИмяМакета <> "ТиповойМодульДиадок_epf" Тогда
		
		ТекстОшибки = "Недопустимое имя макета! Допускается только макет типового модуля";
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = Ядро.Макеты_ФайлТиповогоМодуля();
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_МассивВСтроку(МассивОшибок, Знач Разделитель = Неопределено) Экспорт
	
	Результат = Ядро.СоединитьСтроку(МассивОшибок, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_ПодставитьПараметрыВСтроку(ШаблонСтроки,
												Параметр1,
												Параметр2 = Неопределено,
												Параметр3 = Неопределено,
												Параметр4 = Неопределено,
												Параметр5 = Неопределено) Экспорт
	
	Результат = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонСтроки, Параметр1,  Параметр2, Параметр3, Параметр4, Параметр5);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_РежимОтладкиВключен() Экспорт
	
	Результат = ХранилищеНастроекДанныхФорм.Загрузить("Диадок", "РежимОтладки");
	
	Если Результат = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Результат = Ядро.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

// Функция - Есть реквизит или свойство объекта
//
// Параметры:
//  Объект	 - в котором проверяется наличие реквизита или свойства
//  Свойство - проверяемое свойство по имени
// 
// Возвращаемое значение:
//  Булево - признак наличия реквизита/свойства
//
Функция ЭДО_Служебные_ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
	
	Результат = Ядро.Общее_ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	РезультатСравнения = Ядро.СравнитьВерсии(СтрокаВерсии1, СтрокаВерсии2);
	
	Если РезультатСравнения > 0 Тогда
		Результат = "ПерваяБольше";
	ИначеЕсли РезультатСравнения < 0 Тогда
		Результат = "ПерваяМеньше";
	Иначе
		Результат = "Равны";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Строка, Колонка) Экспорт
	
	Результат = Строка(Область.ПолучитьОбласть(Строка, Колонка).ТекущаяОбласть.Текст);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, ИмяПоля = "Ссылка", ПустоеЗначение = Неопределено) Экспорт
	
	Результат = Ядро.ПолучитьРезультатЗапроса(Запрос, ИмяПоля, ПустоеЗначение);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_РазложитьСтрокуВМассивСлов(Знач Строка, Разделитель = ",", ВключатьПустые = Истина) Экспорт 
	
	Результат = Ядро.РазделитьСтрокуЛок(Строка, Разделитель, ВключатьПустые);
	Возврат Результат;
	
КонецФункции

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  Массив - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив;
Функция ЭДО_Служебные_СвернутьМассив(Массив) Экспорт 
	
	Результат = Ядро.Общее_СвернутьМассив(Массив);
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_ПарсерJSON() Экспорт
	
	Результат = ЭтотОбъект;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_СтруктураВJSON(Структура) Экспорт
	
	Результат = Ядро.ПарсерJSON_Записать(Структура);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Использовать1СЭДО() Экспорт
	
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйРезультатФункции(ОсновнойОбъект = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеОшибки",	"");
	Результат.Вставить("ОсновнойОбъект",	ОсновнойОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция ДатаXML_в_Дата1С(ДатаXML) Экспорт
	
	Результат = Ядро.ДатаXML_в_Дата1С(ДатаXML);
	
	Возврат Результат;
	
КонецФункции

Функция ДвоичныеДанные_В_Текст(ДД, ТипФайла = Неопределено) Экспорт
	
	Результат = Ядро.ДвоичныеДанные_В_Текст(ДД, ТипФайла);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЗаписьЖурналаРегистрации(ИмяСобытия, 
											Уровень = Неопределено, 
											ОбъектМетаданных = Неопределено, 
											Данные = Неопределено, 
											Комментарий = Неопределено) Экспорт
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий);

КонецПроцедуры

Функция ЭДО_Модуль_НовыйЭмуляторТабличногоДокумента() Экспорт
	
	Результат = Ядро.Модуль_ЭмуляторТабДокумента(Ядро);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Модуль_КаталогОбработки() Экспорт
	
	Результат = Ядро.Кэш_Прочитать("КаталогОбработки");
	
	Если Результат = Неопределено Тогда
		
		СтруктураИмяФайла = Новый Структура("ИспользуемоеИмяФайла");
		
		ЗаполнитьЗначенияСвойств(СтруктураИмяФайла, ЭтотОбъект);
		
		Если ЗначениеЗаполнено(СтруктураИмяФайла.ИспользуемоеИмяФайла) Тогда
			
			Файл = Новый Файл(СтруктураИмяФайла.ИспользуемоеИмяФайла);
			
			Результат = Файл.Путь;
			
		Иначе
			
			Результат = "";
			
		КонецЕсли;
		
		Ядро.Кэш_Поместить("КаталогОбработки", Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция DoParse(СтрокаJSON) Экспорт
	
	Модуль_ПарсерJSON = Ядро.Модуль_ПарсерJSON(Ядро);
	Результат = Модуль_ПарсерJSON.Прочитать(СтрокаJSON);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначений_2_МассивСтруктур(ТЗ) Экспорт
	
	Результат = Ядро.ТаблицаЗначенийВМассивСтруктур(ТЗ);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Кэш_Прочитать(ИмяЗначения) Экспорт
	
	Результат = Неопределено;
	
	Если Кэш <> Неопределено Тогда
		Результат = Кэш.Получить(ИмяЗначения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_Кэш_Поместить(ИмяЗначения, Значение) Экспорт
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Соответствие;
	КонецЕсли;
	
	Кэш.Вставить(ИмяЗначения, Значение);
	
КонецПроцедуры

Процедура ОбработатьРезультатФункции(РезультатФункции) Экспорт
	
	Если ЗначениеЗаполнено(РезультатФункции.ОписаниеОшибки) Тогда
		Сообщить(РезультатФункции.ОписаниеОшибки + Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКодРегионаДляДиадок(НаименованиеРегиона) Экспорт
	
	Результат = "";
	
	Если СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Адыгея")) > 0 Тогда
		Результат = "01";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Башкортостан")) > 0 Тогда
		Результат = "02";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Алтайский")) > 0 Тогда
		Результат = "22";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ингушетия")) > 0 Тогда
		Результат = "06";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Кабардино")) > 0 Тогда
		Результат = "07";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Карачаево")) > 0 Тогда
		Результат = "09";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Карелия")) > 0 Тогда
		Результат = "10";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Коми")) > 0 Тогда
		Результат = "11";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Марий")) > 0 Тогда
		Результат = "12";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Мордовия")) > 0 Тогда
		Результат = "13";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Якутия")) > 0 Тогда
		Результат = "14";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Татарстан")) > 0 Тогда
		Результат = "16"; 
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Тыва")) > 0 Тогда
		Результат = "17";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Удмуртская")) > 0 Тогда
		Результат = "18";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Хакасия")) > 0 Тогда
		Результат = "19";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Чувашская")) > 0 Тогда
		Результат = "21";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Чувашия")) > 0 Тогда
		Результат = "21";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Алтай")) > 0 Тогда
		Результат = "04";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Краснодарский")) > 0 Тогда
		Результат = "23";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Приморский")) > 0 Тогда
		Результат = "25";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ставропольский")) > 0 Тогда
		Результат = "26";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Хабаровский")) > 0 Тогда
		Результат = "27";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Амурская")) > 0 Тогда
		Результат = "28";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Архангельская")) > 0 Тогда
		Результат = "29";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Астраханская")) > 0 Тогда
		Результат = "30";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Белгородская")) > 0 Тогда
		Результат = "31";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Брянская")) > 0 Тогда
		Результат = "32";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Владимирская")) > 0 Тогда
		Результат = "33";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Волгоградская")) > 0 Тогда
		Результат = "34";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Вологодская")) > 0 Тогда
		Результат = "35";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Воронежская")) > 0 Тогда
		Результат = "36";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ивановская")) > 0 Тогда
		Результат = "37";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Иркутская")) > 0 Тогда
		Результат = "38";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Калининградская")) > 0 Тогда
		Результат = "39";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Калужская")) > 0 Тогда
		Результат = "40";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Камчатский")) > 0 Тогда
		Результат = "41";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Кемеровская")) > 0 Тогда
		Результат = "42";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Кировская")) > 0 Тогда
		Результат = "43";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Костромская")) > 0 Тогда
		Результат = "44";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Курганская")) > 0 Тогда
		Результат = "45";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Курская")) > 0 Тогда
		Результат = "46";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ленинградская")) > 0 Тогда
		Результат = "47";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Липецкая")) > 0 Тогда
		Результат = "48";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Магаданская")) > 0 Тогда
		Результат = "49";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Московская")) > 0 Тогда
		Результат = "50";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Мурманская")) > 0 Тогда
		Результат = "51";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Нижегородская")) > 0 Тогда
		Результат = "52";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Новосибирская")) > 0 Тогда
		Результат = "54";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Томская")) > 0 Тогда
		Результат = "70";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Омская")) > 0 Тогда
		Результат = "55";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Оренбургская")) > 0 Тогда
		Результат = "56";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Орловская")) > 0 Тогда
		Результат = "57";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Пензенская")) > 0 Тогда
		Результат = "58";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Пермский")) > 0 Тогда
		Результат = "59";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Псковская")) > 0 Тогда
		Результат = "60";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ростовская")) > 0 Тогда
		Результат = "61";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Рязанская")) > 0 Тогда
		Результат = "62";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Самарская")) > 0 Тогда
		Результат = "63";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Саратовская")) > 0 Тогда
		Результат = "64";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Сахалинская")) > 0 Тогда
		Результат = "65";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Саха")) > 0 Тогда // саху ставим после сахалина
		Результат = "14";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Смоленская")) > 0 Тогда
		Результат = "67";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Тамбовская")) > 0 Тогда
		Результат = "68";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Тверская")) > 0 Тогда
		Результат = "69";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Тульская")) > 0 Тогда
		Результат = "71";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Тюменская")) > 0 Тогда
		Результат = "72";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ульяновская")) > 0 Тогда
		Результат = "73";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Челябинская")) > 0 Тогда
		Результат = "74";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Забайкальский")) > 0 Тогда
		Результат = "75";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ярославская")) > 0 Тогда
		Результат = "76";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Еврейская")) > 0 Тогда
		Результат = "79";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ненецкий")) > 0 Тогда
		Результат = "83";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Мансийский")) > 0 Тогда
		Результат = "86";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Чукотский")) > 0 Тогда
		Результат = "87";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Чеченская")) > 0 Тогда
		Результат = "20";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Свердловская")) > 0 Тогда
		Результат = "66";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Новгородская")) > 0 Тогда
		Результат = "53";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Горьковская")) > 0 Тогда // синоним нижегородской
		Результат = "52";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Бурятия")) > 0 Тогда
		Результат = "03";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Пермская")) > 0 Тогда // Пермская обл - синоним Пермского края
		Результат = "59";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Красноярский")) > 0 Тогда
		Результат = "24";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Северная Осетия")) > 0 Тогда
		Результат = "15";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Камчатская")) > 0 Тогда // Камчатская обл - синоним Камчатского края
		Результат = "41";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Калмыкия")) > 0 Тогда
		Результат = "08";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Читинская")) > 0 Тогда // Забайкальский край
		Результат = "75";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Москва")) > 0 Тогда
		Результат = "77";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Дагестан")) > 0 Тогда
		Результат = "05";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Санкт-Петербург")) > 0 Тогда
		Результат = "78";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Ленинград")) > 0 Тогда
		Результат = "78";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Крым")) > 0 Тогда
		Результат = "91";
	ИначеЕсли СтрНайтиЛок(ВРег(НаименованиеРегиона), ВРег("Севастополь")) > 0 Тогда
		Результат = "92";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура Ошибка_ДобавитьВФайл(ТекстОшибки) Экспорт 
	
	Ядро.Ошибка_ДобавитьВФайл(ТекстОшибки);
	
КонецПроцедуры

Процедура _ПроверитьПодсистемуХраненияКонтурДиадок()
	
	Если Метаданные.Справочники.Найти("Диадок_Документы") = Неопределено Тогда
		Ошибка = "Не установлена подсистема 'Контур.Диадок'";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
КонецПроцедуры

// Сокращает строку до нужной длины, при этом обрезанная часть хешируется,
// обеспечивая уникальность строки.
//
// Параметры:
//  Строка - Строка - исходная строка произвольной длины.
//  МаксимальнаяДлина - Число - требуемое максимальное количество символов в строке.
// 
// Возвращаемое значение:
//   Строка - строка, не превышающая максимальную длину.
//
Функция Общее_СократитьСтрокуКонтрольнойСуммой(Строка, МаксимальнаяДлина) Экспорт
	
	Результат = Ядро.Общее_СократитьСтрокуКонтрольнойСуммой(Строка, МаксимальнаяДлина);
	Возврат Результат;
	
КонецФункции

Функция Общее_ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Результат = Ядро.Общее_ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ВыборкаДанныхОбъекта(Ссылка, ИмяТабличнойЧасти, ПоляВыборки) Экспорт
	
	Результат = Ядро.Общее_ВыборкаДанныхОбъекта(Ссылка, ИмяТабличнойЧасти, ПоляВыборки);

	Возврат Результат;
	
КонецФункции

Функция ФиксированныеДанныеЛок(Данные)
	
	Возврат Ядро.ФиксированныеДанные(Данные);
	
КонецФункции

// Находит первое вхождение искомой строки как подстроки в исходной строке.
// Сравнение выполняется с учетом регистра.
//
// Параметры:
//  Строка - Строка - Исходная строка
//  ПодстрокаПоиска - Строка - Искомая строка
// 
// Возвращаемое значение:
//  Число - Позиция первого знака найденной подстроки.
//          Нумерация символов в строке начинается с 1.
//          Если строка не содержит указанной подстроки, то возвращается 0.
//
Функция СтрНайтиЛок(Строка, ПодстрокаПоиска)
	
	// BSLLS:DeprecatedFind-off
	Результат = Найти(Строка, ПодстрокаПоиска);
	// BSLLS:DeprecatedFind-on
	
	Возврат Результат;
	
КонецФункции

//{ Проверка параметров (аналоги методов БСП)

// Вызывает исключение, если тип значения параметра ИмяПараметра процедуры или функции ИмяПроцедурыИлиФункции
// отличается от ожидаемого.
// Для быстрой диагностики типов параметров, передаваемых в процедуры и функции программного интерфейса.
//
// В связи с особенностью реализации ОписанияТипов всегда включает в себя тип <Неопределено>.
// если требуется жесткая проверка типа, используйте в параметре ОжидаемыеТипы 
// конкретный тип, массив или соответствие типов.
//
// Параметры:
//   ИмяПроцедурыИлиФункции - Строка - имя процедуры или функции, параметр которой проверяется.
//   ИмяПараметра - Строка - имя проверяемого параметра процедуры или функции.
//   ЗначениеПараметра - Произвольный - фактическое значение параметра.
//   ОжидаемыеТипы - ОписаниеТипов
//                 - Тип
//                 - Массив
//                 - ФиксированныйМассив
//                 - Соответствие
//                 - ФиксированноеСоответствие - тип(ы)
//       параметра процедуры или функции.
//   ОжидаемыеТипыСвойств - Структура - если ожидаемый тип - структура, то 
//       в этом параметре можно указать типы ее свойств.
//   ОжидаемыеЗначения - Массив, Строка - допустимые значения параметра в виде массива или строки через запятую.
//
Процедура _ПроверитьПараметр(Знач ИмяПроцедурыИлиФункции, Знач ИмяПараметра, Знач ЗначениеПараметра, 
	Знач ОжидаемыеТипы, Знач ОжидаемыеТипыСвойств = Неопределено, Знач ОжидаемыеЗначения = Неопределено)
	
	Контекст = "КонтурДиадокВызовыПМ._ПроверитьПараметр";
	_Проверить(ТипЗнч(ИмяПроцедурыИлиФункции) = Тип("Строка"), 
		ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПроцедурыИлиФункции"), 
		Контекст);
	_Проверить(ТипЗнч(ИмяПараметра) = Тип("Строка"), 
		ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПараметра"), 
			Контекст);
	
	ЭтоКорректныйТип = _ЗначениеОжидаемогоТипа(ЗначениеПараметра, ОжидаемыеТипы);
	_Проверить(ЭтоКорректныйТип <> Неопределено, 
		ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ОжидаемыеТипы"),
		Контекст);
		
	Если ЗначениеПараметра = Неопределено Тогда
		ПредставлениеЗначенияПараметра = "Неопределено";
	ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("ДвоичныеДанные") И ЗначениеПараметра.Размер() = 0 Тогда
		ПредставлениеЗначенияПараметра = "";
	Иначе
		ПредставлениеЗначенияПараметра = Строка(ЗначениеПараметра);
	КонецЕсли;
	
	_Проверить(ЭтоКорректныйТип,
		ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
			           |Ожидалось: %3; передано значение: %4 (тип %5).'"),
			ИмяПараметра, ИмяПроцедурыИлиФункции, _ПредставлениеТипов(ОжидаемыеТипы), 
			ПредставлениеЗначенияПараметра,
		ТипЗнч(ЗначениеПараметра)));
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") И ОжидаемыеТипыСвойств <> Неопределено Тогда
		
		_Проверить(ТипЗнч(ОжидаемыеТипыСвойств) = Тип("Структура"), 
			ЭДО_Служебные_ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПроцедурыИлиФункции"),
			Контекст);
		
		Для каждого Свойство Из ОжидаемыеТипыСвойств Цикл
			
			ОжидаемоеИмяСвойства = Свойство.Ключ;
			ОжидаемыйТипСвойства = Свойство.Значение;
			ЗначениеСвойства = Неопределено;
			
			_Проверить(ЗначениеПараметра.Свойство(ОжидаемоеИмяСвойства, ЗначениеСвойства), 
				ЭДО_Служебные_ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение параметра %1 (Структура) в %2. 
					           |В структуре ожидалось свойство %3 (тип %4).'"), 
					ИмяПараметра, ИмяПроцедурыИлиФункции, ОжидаемоеИмяСвойства, ОжидаемыйТипСвойства));
			
			ЭтоКорректныйТип = _ЗначениеОжидаемогоТипа(ЗначениеСвойства, ОжидаемыйТипСвойства);
			
			СообщениеОбОшибке = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимое значение свойства %1 в параметре %2 (Структура) в %3. 
				      |Ожидалось: %4; передано значение: %5'"), 
				ОжидаемоеИмяСвойства, ИмяПараметра,	ИмяПроцедурыИлиФункции,
				_ПредставлениеТипов(ОжидаемыйТипСвойства), 
				?(ЗначениеСвойства <> Неопределено, ЗначениеСвойства, НСтр("ru = 'Неопределено'")));
				
				СообщениеОбОшибке = СообщениеОбОшибке + " (тип " + ТипЗнч(ЗначениеСвойства) + ").";
			
			_Проверить(ЭтоКорректныйТип, СообщениеОбОшибке);
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если ОжидаемыеЗначения <> Неопределено Тогда
		Если ТипЗнч(ОжидаемыеЗначения) = Тип("Строка") Тогда
			ОжидаемыеЗначения = ЭДО_Служебные_РазложитьСтрокуВМассивСлов(ОжидаемыеЗначения, ",");
		КонецЕсли; 
		_Проверить(ОжидаемыеЗначения.Найти(ЗначениеПараметра) <> Неопределено,
			ЭДО_Служебные_ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
				           |Ожидалось: %3; 
				           |передано значение: %4 (тип %5).'"),
				ИмяПараметра, ИмяПроцедурыИлиФункции, Общее_СоединитьСтроку(ОжидаемыеЗначения, ","), 
				ПредставлениеЗначенияПараметра, ТипЗнч(ЗначениеПараметра)));
	КонецЕсли;
	
КонецПроцедуры

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//
Процедура _Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "")
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 в %2'"), ТекстИсключения, КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

Функция _ЗначениеОжидаемогоТипа(Значение, ОжидаемыеТипы)
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗнч(ОжидаемыеТипы) = Тип("ОписаниеТипов") Тогда
		Возврат ОжидаемыеТипы.Типы().Найти(ТипЗначения) <> Неопределено;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Тип") Тогда
		Возврат ТипЗначения = ОжидаемыеТипы;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Массив") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив") Тогда
		Возврат ОжидаемыеТипы.Найти(ТипЗначения) <> Неопределено;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		Возврат ОжидаемыеТипы.Получить(ТипЗначения) <> Неопределено;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция _ПредставлениеТипов(ОжидаемыеТипы)
	
	Если ТипЗнч(ОжидаемыеТипы) = Тип("Массив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = "";
		Индекс = 0;
		Для Каждого Элемент Из ОжидаемыеТипы Цикл
			
			Если ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
				Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда 
				
				Тип = Элемент.Ключ;
			Иначе 
				Тип = Элемент;
			КонецЕсли;
			
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ", ";
			КонецЕсли;
			
			Результат = Результат + _ПредставлениеТипа(Тип);
			Индекс = Индекс + 1;
			Если Индекс > 10 Тогда
				Результат = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1,... (всего %2 типов)'"), 
					Результат, 
					ОжидаемыеТипы.Количество());
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе 
		Возврат _ПредставлениеТипа(ОжидаемыеТипы);
	КонецЕсли;
	
КонецФункции

Функция _ПредставлениеТипа(Тип)
	
	Если Тип = Неопределено Тогда
		
		Возврат "Неопределено";
		
	ИначеЕсли ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				ЭДО_Служебные_ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1,... (всего %2 типов)'"),
					Лев(ТипСтрокой, 150),
					Тип.Типы().Количество()), 
				ТипСтрокой);
		
	Иначе
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				Лев(ТипСтрокой, 150) + "...", 
				ТипСтрокой);
		
	КонецЕсли;
	
КонецФункции

//} Проверка параметров

//}		ВСПОМОГАТЕЛЬНЫЕ


//{		ДОКУМЕНТЫ

// Приводит описание типа документа к контракту ТипЭлектронногоДокумента.
// Описание типа документа можно передавать в одном из двух форматов:
//  * структура ВидДокументаРазвернутый - как в событии ПодготовитьЭлектронныйДокумент
//  * поле Тип структуры Документ - как в событии ПолучитьЗаполненныйОбъектДокумента1С
//
// Параметры:
//  ОписаниеТипаЭД - Структура, ФиксированнаяСтруктура - 
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. Контракт_ТипЭлектронногоДокумента
//
Функция ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаЭД)
	
	ТипПараметра = ТипЗнч(ОписаниеТипаЭД);
	
	Если ТипПараметра <> Тип("Структура")
		И ТипПараметра <> Тип("ФиксированнаяСтруктура") Тогда
		
		Ошибка = Общее_ПараметрыВСтроку(
			"ФорматыЭД_ТипЭлектронногоДокумента: Параметр ""ОписаниеТипаЭД"" имеет недопустимый тип (%1)
			|Ожидается Структура или ФиксированнаяСтруктура",
			Строка(ТипПараметра)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Если ФорматыЭД_ЭтоДокументТип(ОписаниеТипаЭД) Тогда
		
		ТипКонтента = ОписаниеТипаЭД.ТипКонтента;
		ТипДокумента = ОписаниеТипаЭД.ТипДокумента;
		ФункцияДокумента = ОписаниеТипаЭД.ФункцияДокумента;
		
	ИначеЕсли ФорматыЭД_ЭтоВидДокументаРазвернутый(ОписаниеТипаЭД) Тогда
		
		ТипКонтента = ОписаниеТипаЭД.FormatVersion;
		ТипДокумента = ОписаниеТипаЭД.TypeNamedId;
		ФункцияДокумента = ОписаниеТипаЭД.FunctionName;
		
	Иначе
		
		Ошибка = Общее_ПараметрыВСтроку(
			"ФорматыЭД_ТипЭлектронногоДокумента: Недопустимое значение параметра ""ОписаниеТипаЭД""
			|Ожидается контракт ВидДокументаРазвернутый или Документ.Тип",
			Строка(ТипПараметра)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Результат = Новый_ТипЭлектронногоДокумента(
		ТипКонтента,
		ТипДокумента,
		ФункцияДокумента
	);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданный параметр соответствует структуре "ВидДокументаРазвернутый"
//
// Параметры:
//  ОписаниеТипаЭД - Структура, ФиксированнаяСтруктура - описание типа электронного документа
// 
// Возвращаемое значение:
//  Булево - Истина, если это ВидДокументаРазвернутый
//
Функция ФорматыЭД_ЭтоВидДокументаРазвернутый(ОписаниеТипаЭД)
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("FormatVersion");
	ИменаПолей.Добавить("TypeNamedId");
	ИменаПолей.Добавить("FunctionName");
	
	Результат = Истина;
	
	Для Каждого Ключ Из ИменаПолей Цикл
		
		Если Не ОписаниеТипаЭД.Свойство(Ключ) Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданный параметр внутреннему контракту "Документ.Тип"
//
// Параметры:
//  ОписаниеТипаЭД - Структура, ФиксированнаяСтруктура - описание типа электронного документа
// 
// Возвращаемое значение:
//  Булево - Истина, если это ВидДокументаРазвернутый
//
Функция ФорматыЭД_ЭтоДокументТип(ОписаниеТипаЭД)
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("ТипКонтента");
	ИменаПолей.Добавить("ТипДокумента");
	ИменаПолей.Добавить("ФункцияДокумента");
	
	Результат = Истина;
	
	Для Каждого Ключ Из ИменаПолей Цикл
		
		Если Не ОписаниеТипаЭД.Свойство(Ключ) Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры ТипЭлектронногоДокумента
//
// Параметры:
//  ТипКонтента - Строка - идентификатор базового формата (короткое представление поля Version структуры FullVersion)
//  ТипДокумента - Строка - идентификатор типа документа (TypeNamedId)
//  ФункцияДокумента - Строка - функция документа. Допускается передавать значение функции
//                              как во внутреннем формате (как в системе хранения), так и
//                              в "сыром" виде (как в ответе метода GetDocumentTypes)
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. Контракт_ТипЭлектронногоДокумента
//
Функция Новый_ТипЭлектронногоДокумента(Знач ТипКонтента, Знач ТипДокумента, Знач ФункцияДокумента)
	
	Модель = Контракт_ТипЭлектронногоДокумента();
	Модель.ТипКонтента = НРег(ТипКонтента);
	Модель.ТипДокумента = ТипДокумента;
	Модель.ФункцияДокумента = Ядро.Документы_ФункцияДокументаДляХранения(ФункцияДокумента);
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, содержит ли электронный документ сведения о маркируемой продукции
//
// Параметры:
//  ИнформацияОДокументе - Строка - Имя файла XML
//                       - Структура - описание электронного документа (см. Контракт_Документ)
// 
// Возвращаемое значение:
//  Булево - Истина, в файле XML передаются коды маркировки
//
Функция Документы_ЕстьМаркируемаяПродукция(ИнформацияОДокументе) Экспорт
	
	ТипПараметра = ТипЗнч(ИнформацияОДокументе);
	
	Если ТипПараметра = Тип("Строка") Тогда
		
		ИмяФайлаВложения = ИнформацияОДокументе;
		
	ИначеЕсли ТипПараметра = Тип("Структура") Тогда
		
		ИмяФайлаВложения = ИнформацияОДокументе.ИмяФайла;
		
	Иначе
		
		Ошибка = НСтр(
			"ru = 'Несоответствие типов: Неожиданный тип параметра ""ИнформацияОДокументе"" (%1)';
			|sys = 'TypeError: Неожиданный тип параметра ""ИнформацияОДокументе"" (%1)'"
		);
		
		Ошибка = ЭДО_Служебные_ПодставитьПараметрыВСтроку(Ошибка, Строка(ТипПараметра));
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	НормализованноеИмяФайла = СокрЛП(ВРег(ИмяФайлаВложения));
	
	Результат = Ложь;
	
	Если Прав(НормализованноеИмяФайла, 4) = ".XML" Тогда
		
		ИдФайл = Лев(НормализованноеИмяФайла, СтрДлина(НормализованноеИмяФайла) - 4);
		Результат = _ЕстьМаркируемаяПродукцияСлужебный(ИдФайл);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разбирает идентификатор XML-файла и определяет по нему, содержит ли файл сведения о маркируемой продукции:
// * В форматах 820@ (УПД, СФ, накладная, акт), 736@ (УКД, КСФ) и 423@ (Торг-2) префикс ИдФайл заканчивается на "MARK"
// * В формате 691@ (КС-2, КС-3) ИдФайл содержит префикс ON_AKTREZRABPXX, где XX = "01"
// * В формате 970@ (УПД, СФ, накладная, акт) ИдФайл имеет вид R_T_A_O_GGGGMMDD_N1_N2_N3_N4_N5_N6_N7, где N2 - признак маркировки
//
// Параметры:
//  ИдФайл - Строка - Идентификатор файла
// 
// Возвращаемое значение:
//  Булево.
//
Функция _ЕстьМаркируемаяПродукцияСлужебный(Знач ИдФайл)
	
	ПрефиксМарк820 = "ON_NSCHFDOPPRMARK_";
	ПрефиксМарк736 = "ON_NKORSCHFDOPPRMARK_";
	ПрефиксМарк691 = "ON_AKTREZRABP01_";
	ПрефиксМарк423 = "DP_PRIRASXPRINMARK_";
	
	Префикс970 = "ON_NSCHFDOPPR_";
	
	Если Найти(ИдФайл, ПрефиксМарк820) = 1
		Или Найти(ИдФайл, ПрефиксМарк736) = 1
		Или Найти(ИдФайл, ПрефиксМарк423) = 1
		Или Найти(ИдФайл, ПрефиксМарк691) = 1 Тогда
		
		Результат = Истина;
		
	ИначеЕсли Найти(ИдФайл, Префикс970) = 1 Тогда
		
		Результат = Ложь;
		
		ЧастиИдФайл = ЭДО_Служебные_РазложитьСтрокуВМассивСлов(ИдФайл, "_", Истина);
		
		// В формате 820 может быть такой же префикс, но в отличие от 970 ИдФайл состоит из 6 частей
		Если ЧастиИдФайл.Количество() = 12 Тогда
			
			ПризнакМаркируемаяПродукция = ЧастиИдФайл[7]; // N3
			Результат = (ПризнакМаркируемаяПродукция = "1");
			
		КонецЕсли;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, 
																Документ1С, 
																ВидДокументаСтрокой, 
																ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ядро.Пакеты_ДобавитьДокументВПакет(Пакет, Документ1С, ВидДокументаСтрокой, ДополнительныеПараметры);
		
	Возврат Результат;	
	
КонецФункции

Функция ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента) Экспорт
	
	Результат = Ядро.Документы_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
		
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Перечисление_ВидыЭДО() Экспорт
	
	Результат = Ядро.Перечисление_ВидыЭДО();
		
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ДобавитьПравилоСопоставленияДокумента(НаборПравил, ВидМетаданных, ИмяМетаданных, Отбор = Неопределено) Экспорт
	
	Ядро.Документы_ДобавитьПравилоСопоставления(НаборПравил, ВидМетаданных, ИмяМетаданных, Отбор);
	
КонецПроцедуры	

Функция ФункцияДокументаДляXML(ТипДокумента, ФункцияДокумента) Экспорт
	
	Результат = Ядро.Документы_ФункцияДокументаДляXML(ТипДокумента, ФункцияДокумента);
	
	Возврат Результат;
	
КонецФункции	

Функция ЭДО_ПолучитьРеквизитыДокумента(ДокументЭДО, ПакетЭДО = Неопределено) Экспорт
	
	Документ	= Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	Результат	= Ядро.ПодключаемыйМодуль_РеквизитыДокумента(Документ);	
		
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьТабличнуюЧастьИзКонтентаXML(Контент, НеИспользуется_ЭтоКорректировка = Ложь) Экспорт
	
	Результат = Ядро.Документы_ПолучитьТабличнуюЧастьИзКонтентаXML(Контент);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокументыПакета(ДокументЭДО) Экспорт
	
	ПакетЭДО = ЭДО_ПолучитьРеквизитДокумента("Пакет", ДокументЭДО);
	
	ПакетыЭДО = Новый Массив;
	ПакетыЭДО.Добавить(ПакетЭДО);
	
	Результат = ЭДО_ПолучитьДокументыДляМассиваПакетов(ПакетыЭДО);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСопоставлениеДокументаДД_С_Документом_1С(ДокументЭДО, Документ1С, ПроверятьСуществующееСопоставление = Истина) Экспорт
	
	Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	ОбновляемыеРеквизиты = Новый Структура("ДокументУчета", Документ1С);
	
	Ядро.ХранениеДанных_ОбновлениеРеквизитовДокумента(Идентификаторы, ОбновляемыеРеквизиты);
	
КонецПроцедуры

Функция ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId) Экспорт
	
	Идентификаторы = Новый_Идентификаторы(, , BoxId, LetterId, DocumentId );
	
	Результат = Ядро.Документы_СсылкаНаДокументЭДО(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ЗаписатьРеквизитыДокумента(ДокументЭДО, СтруктураРеквизитов) Экспорт
	
	Идентификаторы = Новый Структура;
	Идентификаторы.Вставить("ДокументЭДО", ДокументЭДО);
	
	Ядро.ХранениеДанных_ОбновлениеРеквизитовДокумента(Идентификаторы, СтруктураРеквизитов);
	
КонецПроцедуры

// Возвращает структуру документа по ссылке
//
// Параметры:
//  ДокументЭДО - СправочникСсылка.Диадок_Документы
// 
// Возвращаемое значение:
//  Структура - см. функцию Ядро.Контракт_Документ()
//
Функция Документы_СохраненныйДокумент(ДокументЭДО) Экспорт
	
	Результат = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	
	Возврат Результат;
	
КонецФункции

// Возвращает шаблон, на основании которого был создан документ
//
// Параметры:
//  Документ - Структура - см. функцию Контракт_Документ()
// 
// Возвращаемое значение:
//  Структура    - см. функцию Ядро.Контракт_Документ()
//  Неопределено - если документ не был создан по шаблону
//
Функция Документы_ШаблонДокумента(Документ) Экспорт
	
	Результат = Ядро.Документы_ШаблонДокумента(Документ);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьДокументыДляМассиваПакетов(ПакетыЭДО) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	ИменаКолонок = "Ссылка, Документ, Пакет, Организация, DocumentId, LetterId, BoxId, Статус, ЗаблокированныйПакет";
	Ядро.ДобавитьКолонкиВТаблицуЗначений(Результат, ИменаКолонок);
	
	ИдентификаторыПакетов = Новый Массив;
	
	Для Каждого ПакетЭДО Из ПакетыЭДО Цикл
		
		ИдентификаторыПакета = Новый Структура("ПакетЭДО", ПакетЭДО);
		ИдентификаторыПакетов.Добавить(ИдентификаторыПакета);
		
	КонецЦикла;
	
	ДокументыПакета = Ядро.Пакеты_ДокументыПакетов(ИдентификаторыПакетов);
	
	Для Каждого ДокументПакета Из ДокументыПакета Цикл
		
		Идентификаторы = ДокументПакета.Идентификаторы;
		
		СтрокаТЗ = Результат.Добавить();
		
		СтрокаТЗ.Ссылка					= Идентификаторы.ДокументЭДО;
		СтрокаТЗ.Документ				= Идентификаторы.ДокументЭДО;
		СтрокаТЗ.Пакет					= Идентификаторы.ПакетЭДО;
		СтрокаТЗ.DocumentId				= Идентификаторы.DocumentId;
		СтрокаТЗ.LetterId				= Идентификаторы.LetterId;
		СтрокаТЗ.BoxId					= Идентификаторы.BoxId;
		СтрокаТЗ.Статус					= ДокументПакета.Статусы.Статус;
		СтрокаТЗ.ЗаблокированныйПакет	= ДокументПакета.Заблокирован;
		
		Если ДокументПакета.Направление = ЭДО_Перечисление_Направления().Исходящее Тогда
			
			СтрокаТЗ.Организация = ДокументПакета.Отправитель.Организация;
			
		ИначеЕсли ДокументПакета.Направление = ЭДО_Перечисление_Направления().Входящее Тогда
			
			СтрокаТЗ.Организация = ДокументПакета.Получатель.Организация;
			
		Иначе
			СтрокаТЗ.Организация = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьРеквизитДокумента(ИмяРеквизита, ДокументЭДО)
	
	Результат = ДокументЭДО[ИмяРеквизита];
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьСтатусДокумента(ДокументЭДО) Экспорт
	
	Результат = ЭДО_ПолучитьРеквизитДокумента("Статус", ДокументЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьТипВходящегоДокумента(ДокументЭДО, УчитыватьТипКонтента = Истина) Экспорт

	Результат = ЭДО_ПолучитьРеквизитДокумента("ТипКонтента", ДокументЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьСвязанныйДокумент1С(ДокументЭДО) Экспорт
	
	Результат = ЭДО_ПолучитьРеквизитДокумента("Документ", ДокументЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьСсылкуНаДанныеХранилища(ДокументЭДО, ИмяХранилища) Экспорт
	
	Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	
	Результат = Ядро.ХранениеДанных_СсылкаНаДанныеХранилища(Идентификаторы, ИмяХранилища);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьДанныеХранилища(ДокументЭДО, ИмяХранилища, ИмяРеквизита = "ХранилищеДанных") Экспорт
	
	Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	
	ДанныеХранилища = Ядро.ХранениеДанных_ДанныеХранилища(Идентификаторы, ИмяХранилища);
	
	Результат = ДанныеХранилища.Данные;
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификаторы сущности предложения об аннулировании
//
// Параметры:
//  ДокументЭДО	 - Ссылка	 - Ссылка на элемент справочника Диадок_Документы
// 
// Возвращаемое значение:
//   - Структура
//
Функция ЭДО_ИдентификаторыПредложенияОбАннулировании(ДокументЭДО) Экспорт
	
	Результат = Новый Структура("BoxId, MessageId, EntityId");
	
	Документ = Документы_СохраненныйДокумент(ДокументЭДО);
	ПредложениеОбАннулировании = Ядро.Документы_ПредложениеОбАннулировании(Документ);
	
	Результат.BoxId = Документ.Идентификаторы.BoxId;
	Результат.MessageId = Документ.Идентификаторы.LetterId;
	Результат.EntityId = ПредложениеОбАннулировании.Описание;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьПредставлениеДокумента(ДокументЭДО, ВыводитьСумму = Ложь, ВыводитьСтатусы = Ложь) Экспорт

	Документ = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	Результат = Ядро.Документы_ПредставлениеДокумента(Документ, ВыводитьСумму, ВыводитьСтатусы);
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьМассивИдентификаторовПоМассивуДокументов(МассивДокументов) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документы", МассивДокументов);
	
	//TODO: убрать прямое обращение к подсистеме хранения
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.BoxId КАК BoxId,
		|	Диадок_Документы.LetterId КАК LetterId,
		|	Диадок_Документы.DocumentId КАК DocumentId,
		|	Диадок_Документы.Ссылка КАК Документ1С,
		|	Диадок_Документы.Статус
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка В(&Документы)
		|ИТОГИ ПО
		|	BoxId,
		|	LetterId";
	
	Результат = Новый Массив;
	ВыборкаПоBox = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоBox.Следующий() Цикл
		
		ВыборкаПоLetter = ВыборкаПоBox.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоLetter.Следующий() Цикл
			
			Идентификаторы = Новый Структура("BoxId, LetterId, АдресЯщика");
			ЗаполнитьЗначенияСвойств(Идентификаторы, ВыборкаПоLetter);
			Идентификаторы.Вставить("АдресЯщика", ЭДО_Служебные_АдресЯщикаКонтрагента(Идентификаторы.BoxId));
			Идентификаторы.Вставить("Documents", Новый Массив);
			
			ВыборкаПоDocument = ВыборкаПоLetter.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоDocument.Следующий() Цикл
				СтруктураДокумента = Новый Структура("DocumentId, Документ1С, Статус");
				ЗаполнитьЗначенияСвойств(СтруктураДокумента, ВыборкаПоDocument);
				Идентификаторы.Documents.Добавить(СтруктураДокумента);
			КонецЦикла;
			Результат.Добавить(Идентификаторы);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Документ_СсылкаВБраузере(ДокументЭДО) Экспорт
	
	Документ	= Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	Результат	= Ядро.Документы_СсылкаВБраузере(Документ);
	
	Возврат Результат;
	
КонецФункции

// История событий по документу
//
// Параметры:
//  РеквизитыДокумента	 - Структура - см. Контракт_Документ() - реквизиты
//
// Возвращаемое значение:
//   Массив - Коллекция элементов см. Контракт_ЭлементИсторииДО()
//
Функция ЭДО_ИсторияПоДокументу(РеквизитыДокумента) Экспорт
	
	Результат = Новый Массив;
	
	Идентификаторы = Новый_Идентификаторы(
			,
			,
			РеквизитыДокумента.BoxId,
			РеквизитыДокумента.LetterId,
			РеквизитыДокумента.DocumentId);
	
	Документы_ИсторияДО = Ядро.Документы_ИсторияДО(Идентификаторы);
	
	Для Каждого ЭлементИсторииДО Из Документы_ИсторияДО Цикл
		
		Модель = Контракт_ЭлементИсторииДО();
		ЗаполнитьЗначенияСвойств(Модель, ЭлементИсторииДО);
		
		Результат.Добавить(Модель);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ЭлементИсторииДО()
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", '00010101');
	Результат.Вставить("BoxId", "");
	Результат.Вставить("Организация", "");
	Результат.Вставить("Подписант", "");
	Результат.Вставить("Должность", "");
	Результат.Вставить("Описание", "");
	Результат.Вставить("Комментарий", "");
	Результат.Вставить("Тип", "");
	Результат.Вставить("ДокументURL", "");
	Результат.Вставить("ШаблонДокументаURL", "");
	Результат.Вставить("ИнструкцияURL", "");
	Результат.Вставить("ДанныеПодписи", "");
	Результат.Вставить("ПараметрыСохранения");
	Результат.Вставить("DocflowNamedId", "");
	Результат.Вставить("Детализация", "");
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ОписаниеТипаДокумента(ИмяТипа) Экспорт
	
	ТипыДокументов	= ЭДО_ПредопределенныеСписки_ПолучитьУстаревшиеТипыВнешнейКомпоненты();
	Результат		= ТипыДокументов.Найти(ИмяТипа, "Наименование");
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПредопределенныеСписки_ПолучитьУстаревшиеТипыВнешнейКомпоненты()
	
	Результат = Новый ТаблицаЗначений;
	
	ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, 
		"Наименование, Описание, Формализованный, СтруктураСодержимого, СтруктураМетаданных, ПодписаниеПолучателем,
		|ТипКонтентаПодписи, ТипКонтентаОтказаПодписи, ТипКонтентаЗапросаУточнения, ИмяМеты, РеквизитыМетаданных,
		|КраткоеПредставление, ГруппировкаДокументов, ТипДокументаВЯдре, ВерсияДокументаВЯдре");
	
	Область = ПолучитьМакет("ТипыДокументов").ПолучитьОбласть("ТипыДокументов");
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Наименование					= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 1);
		НоваяСтрока.Описание						= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 2);
		НоваяСтрока.Формализованный					= ЗначениеЗаполнено(ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 3));
		НоваяСтрока.СтруктураСодержимого			= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 4);
		НоваяСтрока.СтруктураМетаданных				= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 5);
		НоваяСтрока.ПодписаниеПолучателем			= (НРег(ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 6)) = "да");
		НоваяСтрока.ТипКонтентаПодписи				= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 7);
		НоваяСтрока.ТипКонтентаОтказаПодписи		= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 8);
		НоваяСтрока.ТипКонтентаЗапросаУточнения		= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 9);
		НоваяСтрока.ИмяМеты							= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 10);
		НоваяСтрока.РеквизитыМетаданных				= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 11);
		НоваяСтрока.КраткоеПредставление			= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 12);
		НоваяСтрока.ГруппировкаДокументов			= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 13);
		НоваяСтрока.ТипДокументаВЯдре				= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 14);  // как документ называется в HTTP API
		НоваяСтрока.ВерсияДокументаВЯдре			= ЭДО_Служебные_ПолучитьТекстЯчейкиОбласти(Область, Сч, 15);  // Формат документа в HTTP API
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ОписаниеТипаДокумента_V2(ТипДокумента, ТипКонтента) Экспорт
	
	ВиртуальныйТипДокумента = "";
	
	Если ЗначениеЗаполнено(ТипКонтента) Тогда
		
		СоответствиеТипов = Новый Соответствие;
		СоответствиеТипов.Вставить("Invoice",						"UtdInvoice");
		СоответствиеТипов.Вставить("InvoiceRevision",				"UtdInvoiceRevision");
		СоответствиеТипов.Вставить("XmlAcceptanceCertificate",		"UtdAcceptanceCertificate");
		СоответствиеТипов.Вставить("XmlTorg12",						"UtdTorg12");
		СоответствиеТипов.Вставить("UniversalTransferDocument",		"UniversalTransferDocument");
		СоответствиеТипов.Вставить("InvoiceCorrection",				"UcdInvoiceCorrection");
		СоответствиеТипов.Вставить("InvoiceCorrectionRevision",		"UcdInvoiceCorrectionRevision");
		СоответствиеТипов.Вставить("UniversalCorrectionDocument",	"UniversalCorrectionDocument");
		СоответствиеТипов.Вставить("TovTorg",						"TovTorg");
		СоответствиеТипов.Вставить("XmlAcceptanceCertificate552",	"XmlAcceptanceCertificate552");
		
		ВиртуальныйТипДокумента = СоответствиеТипов[ТипДокумента];
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВиртуальныйТипДокумента) Тогда
		ВиртуальныйТипДокумента = ТипДокумента;
	КонецЕсли;
	
	Результат = ЭДО_ОписаниеТипаДокумента(ВиртуальныйТипДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ДокументМенеджер_РеквизитыДокументаСтрокой() Экспорт

	Результат =  
	"Ссылка,
	|Тип,
	|ТипКонтента,
	|Функция,
	|ОписаниеФорматаКонтента,
	|ОписаниеТипаДокумента,	
	|Метаданные,
	|РеквизитыДокумента,
	|Вид,
	|ВидID,
	|Документ1С,
	|InitialDocumentIds,
	|Content,
	|ДвоичныеДанные,
	|ЗашифрованныеДвоичныеДанные,
	|ДвоичныеДанныеПодписи,
	|Ключ,
	|LetterID,
	|DocumentID,
	|BoxID,
	|PatchedContentId,
	|ЗапрашиватьОтветнуюПодпись,
	|Комментарий,
	|ПараметрыСогласования,
	|ТочностьЦены, ТочностьКоличества,
	|Заголовок,
	|ДатаСоздания,
	|ИмяФайла,
	|Сумма,
	|СуммаНДС,
	|СуммаДоговора,
	|ТипДоговора,
	|Основание,
	|ДатаДокумента,
	|НомерДокумента";
	
	Возврат Результат;			
		
КонецФункции 

Функция ЭДО_Документы_ПолучитьДокументыПоСтатусу(BoxId, LetterId, Статус) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Диадок_Документы.Ссылка
	               |ИЗ
	               |	Справочник.Диадок_Документы КАК Диадок_Документы
	               |ГДЕ
	               |	Диадок_Документы.BoxId = &BoxId
	               |	И Диадок_Документы.LetterId = &LetterId
	               |	И Диадок_Документы.Статус = &Статус";
	Запрос.УстановитьПараметр("BoxId", BoxId);
	Запрос.УстановитьПараметр("LetterId", LetterId);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса	= Запрос.Выполнить().Выгрузить();
	Результат			= РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
				
КонецФункции

Функция ЭДО_ПолучитьДанныеДляСохраненияДокументооборота(ДокументДД) Экспорт 
	
	МассивИменАннулирования = ЭДО_Служебные_РазложитьСтрокуВМассивСлов("ПредложениеОбАннулированииПокупателя,
																	   |ПредложениеОбАннулированииПродавца,
																	   |ОтказВПодписанииАннулированияПокупателя,
																	   |ОтказВПодписанииАннулированияПродавца,
																	   |ПодписьАннулированияПокупателя,
																	   |ПодписьАннулированияПродавца");
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ДокументДД);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Диадок_ХранениеДанных.Ссылка,
	|	Диадок_ХранениеДанных.Наименование КАК ИмяХранилища,
	|	Диадок_ХранениеДанных.ИмяФайла
	|ИЗ
	|	Справочник.Диадок_ХранениеДанных КАК Диадок_ХранениеДанных
	|ГДЕ
	|	Диадок_ХранениеДанных.Владелец = &Владелец";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИндексПодписи = 0;
	
	Пока Выборка.Следующий() Цикл
		
		ЭтоАннулирование = Не МассивИменАннулирования.Найти(Выборка.ИмяХранилища) = Неопределено;
		
		ДвоичныеДанные = ЭДО_ПолучитьДанныеХранилища(ДокументДД, Выборка.ИмяХранилища);
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") И ЗначениеЗаполнено(Выборка.ИмяФайла) Тогда
			Результат.Добавить(Новый Структура("ИмяФайла, ДвоичныеДанные, ЭтоАннулирование", Выборка.ИмяФайла, ДвоичныеДанные, ЭтоАннулирование));
		КонецЕсли;
		
		// Пока что будем сохранять только основную подпись, поскольку хранение согласующей подписи не реализовано
		
		ДвоичныеДанныеПодписи = ЭДО_ПолучитьХранилищеПодписи(ДокументДД, Выборка.ИмяХранилища);
		Если ТипЗнч(ДвоичныеДанныеПодписи) = Тип("ДвоичныеДанные") И ЗначениеЗаполнено(Выборка.ИмяФайла) Тогда
			
			ИндексПодписи = ИндексПодписи + 1;
			ИмяФайлаДокумента = ЭДО_РеквизитыИмениФайла(Выборка.ИмяФайла).ИмяБезРасширения;
			ИмяФайлаПодписи = ИмяФайлаДокумента + "_SGN_" + Формат(ИндексПодписи, "ЧГ=0") + ".sgn";
			
			Результат.Добавить(Новый Структура("ИмяФайла, ДвоичныеДанные, ЭтоАннулирование", ИмяФайлаПодписи, ДвоичныеДанныеПодписи, ЭтоАннулирование));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_РеквизитыИмениФайла(Знач ИмяФайла)
	
	Результат = Новый Структура("ИмяБезРасширения, Путь, Расширение", "", "", "");
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Ф = Новый Файл(ИмяФайла);
	
	Результат.ИмяБезРасширения	= Ф.ИмяБезРасширения;
	Результат.Путь				= Ф.Путь;
	Результат.Расширение		= Ф.Расширение;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Документы_ДанныеПодписанияВходящего(Документ) Экспорт

	Результат = Ядро.Документы_ДанныеПодписанияВходящего(Документ);
	
	Возврат Результат;
	
КонецФункции

Функция НазваниеДокументаAPI(TypeNamedId) Экспорт
	
	Результат = Ядро.Списки_НазваниеДокументаAPI(TypeNamedId);
	
	Возврат Результат;
	
КонецФункции

// РАБОТА С ТЭГАМИ

// Получает тэги документа
//
// Параметры:
//  ИдентификаторыДокумента	 - 	Структура - см. Контракт_Идентификаторы()
// 
// Возвращаемое значение:
//  Соответствие - где "Ключ" - имя тэга, "Значение" - его значение
//
Функция Документы_ПолучитьТэги(ИдентификаторыДокумента) Экспорт
	
	Результат = Ядро.Документы_ПолучитьТэги(ИдентификаторыДокумента);
	Возврат Результат;
	
КонецФункции

// Добавляет или изменяет тэги документа
//
// Параметры:
//  ИдентификаторыДокумента	 - 	Структура - см. Контракт_Идентификаторы()
//  Тэги					 - 	Соответствие - где "Ключ" - имя тэга, "Значение" - его значение
// 
// Возвращаемое значение:
//  Булево - признак успешного добавления тэгов
//
Функция Документы_ДобавитьТэги(ИдентификаторыДокумента, Тэги) Экспорт
	
	Результат = Ядро.Документы_ДобавитьТэги(ИдентификаторыДокумента, Тэги);
	Возврат Результат;
	
КонецФункции

// Удаляет тэги документа
//
// Параметры:
//  ИдентификаторыДокумента	 - 	Структура - см. Контракт_Идентификаторы()
//  Ключи					 - 	Массив - элементами массива являются имена тэгов строкового типа
// 
// Возвращаемое значение:
//  Булево - признак успешного удаления тэгов
//
Функция Документы_УдалитьТэги(ИдентификаторыДокумента, Ключи) Экспорт
	
	Результат = Ядро.Документы_УдалитьТэги(ИдентификаторыДокумента, Ключи);
	Возврат Результат;
	
КонецФункции

//}		ДОКУМЕНТЫ


//{		СПРАВОЧНИКИ

Функция ЭДО_СправочникМенеджер_ПолучитьЭлемент(ИмяСправочника, ИдентификаторЭлемента) Экспорт
	
	Результат = Неопределено;
	
	Если ИмяСправочника = "ВидыПакетов" Тогда
		
		ВидыПакета	= Ядро.ПредопределенныеСписки_ВидыПакетов();
		
		Если ТипЗнч(ИдентификаторЭлемента) = Тип("Строка") Тогда
			Результат = ВидыПакета.Получить(ИдентификаторЭлемента);
		ИначеЕсли ИдентификаторЭлемента <> Неопределено Тогда
			
			Для Каждого КлючИЗначение Из ВидыПакета Цикл
				
				ВидПакета = КлючИЗначение.Значение;
				
				Если ВидПакета.Наименование = ИдентификаторЭлемента.Наименование Тогда
					Результат = ВидПакета;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Новый Структура("ID, Наименование, СоставПакета, КатегорияПакета, Шаблон, УПД");
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Модуль_ОбщиеНастройки() Экспорт
	
	Результат = Ядро.ХранениеДанных_ОбщиеНастройки();
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьОбщиеНастройки(ОбщиеНастройки) Экспорт
	
	Результат = Ядро.ОбщиеНастройки_ЗаписатьНастройки(ОбщиеНастройки);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Модуль_ТаблицаОрганизацийПользователя() Экспорт
	
	Результат = Ядро.Организации_ТаблицаСопоставленныхОрганизаций();
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьСинхронизациюКонтрагентовОрганизаций(ДобавитьКонтрагентовДляПриглашения = Истина) Экспорт
	
	Если ИспользоватьПодсистемуДиадока() Тогда
		Ядро.Справочники_ВыполнитьСинхронизацию(ДобавитьКонтрагентовДляПриглашения);
	КонецЕсли;	
	
КонецПроцедуры

Функция ЭДО_СправочникМенеджер_ПолучитьСписокЭлементов(ИмяСправочника, Владелец = Неопределено, ПереченьРеквизитов = Неопределено) Экспорт
	
	Если ИмяСправочника = "ВидыПакетов" Тогда
		
		ВидыПакетов = Ядро.МассивВидовПакетов();
		
		Результат = Новый ТаблицаЗначений;
		
		Результат.Колонки.Добавить("Ссылка");
		Результат.Колонки.Добавить("ID");
		Результат.Колонки.Добавить("Наименование");
		
		Для Каждого СтруктураВидаПакета Из ВидыПакетов Цикл
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураВидаПакета);
			
			НоваяСтрока.ID = СтруктураВидаПакета.Идентификатор;		
			
		КонецЦикла;	
	
	ИначеЕсли ИмяСправочника = "ВидыДокументов" Тогда
		
		ВидыПакетов = Ядро.МассивВидовДокументов();
		
		Результат = Новый ТаблицаЗначений;
		
		Результат.Колонки.Добавить("Ссылка");
		Результат.Колонки.Добавить("ID");
		Результат.Колонки.Добавить("Наименование");
		
		Для Каждого Элемент Из ВидыПакетов Цикл
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			
			НоваяСтрока.ID = Элемент.Идентификатор;
			
		КонецЦикла;
	
	ИначеЕсли ИмяСправочника = "ПодразделенияОрганизаций" Тогда
		
		ИдентификаторВладельца = Новый Структура("ID, Ссылка", Владелец, Новый Структура("ИмяСправочника", "Организации"));
		Результат = Ядро.ХранениеДанных_ПодразделенияВладельца(ИдентификаторВладельца);
		
	Иначе
		Результат = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Процедура ЭДО_СправочникМенеджер_УстановитьЗначениеДопРеквизита(Элемент, ИмяРеквизита, Значение, ЗначениеСтрока = "") Экспорт

	Ядро.ХранениеДанных_УстановитьЗначениеДопРеквизита(Элемент, ИмяРеквизита, Значение, ЗначениеСтрока);

КонецПроцедуры

Процедура ЭДО_СправочникМенеджер_УдалитьДопРеквизит(Элемент, ИмяРеквизита) Экспорт

	Ядро.ХранениеДанных_УстановитьЗначениеДопРеквизита(Элемент, ИмяРеквизита, Неопределено, Неопределено);

КонецПроцедуры

Функция ЭДО_ПрочитатьЗначенияСвойств1СЭДО(ОбъектСсылка, НаименованиеСвойства, СПрефиксом = Истина) Экспорт
	
	Модуль_ХранениеДанных = Ядро.Модуль_ХранениеДанных(Ядро);
	Результат = Модуль_ХранениеДанных.ДопРеквизиты_Значение_1С(ОбъектСсылка, НаименованиеСвойства, СПрефиксом);
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_УстановитьЗначениеСвойства1СЭДО(ИмяРеквизита, Значение, Элемент, СПрефиксом = Истина) Экспорт

	Модуль_ХранениеДанных = Ядро.Модуль_ХранениеДанных(Ядро);
	
	Модуль_ХранениеДанных.ДопРеквизиты_УстановитьЗначение_1С(Элемент, ИмяРеквизита, Значение, СПрефиксом);

КонецПроцедуры

Функция ЭДО_СправочникМенеджер_ЗначениеДопРеквизита(Элемент, ИмяРеквизита) Экспорт

	Результат = Ядро.ХранениеДанных_ЗначениеДопРеквизита(Элемент, ИмяРеквизита);
	
	Возврат Результат;

КонецФункции

Функция ЭДО_СправочникМенеджер_НайтиПоНаименованию(Элемент, ИмяРеквизита) Экспорт

	Модуль_ХранениеДанных = Ядро.Модуль_ХранениеДанных(Ядро);
	Результат = Модуль_ХранениеДанных.ДопСправочники_СсылкаПоНаименованию(Элемент, ИмяРеквизита);
	
	Возврат Результат;

КонецФункции

// Возвращает список доступных пользователю организаций.
// Если токен доступа не передан явно, используется сессия
// текущего пользователя в указанном ящике.
//
// Параметры:
//  BoxId - Строка - адрес или идентификатор ящика
//  ТокенДоступа - Строка - авторизационный токен (только для схемы DiadocAuth)
// 
// Возвращаемое значение:
//  Массив из Контракт_Организация - список организаций.
//
Функция ЭДО_ПолучитьСписокОрганизацийДиадока(BoxId = Неопределено, ТокенДоступа = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ТокенДоступа) Тогда
		Сессия = Ядро.Новый_СессияДиадокНеизвестнаяСхема(ТокенДоступа);
	Иначе
		
		ВызыватьИсключение = Ложь;
		СтрокаКонтекста = Ядро.КонтекстСеанса_СтрокаКонтекста(BoxId, ВызыватьИсключение);
		
		Если СтрокаКонтекста = Неопределено
			И ЗначениеЗаполнено(BoxId) Тогда
			СтрокаКонтекста = Ядро.КонтекстСеанса_СтрокаКонтекста("", ВызыватьИсключение);
		КонецЕсли;
		
		Если СтрокаКонтекста = Неопределено Тогда
			Ошибка = ЭДО_Служебные_ПодставитьПараметрыВСтроку("Не удалось определить параметры соединения (BoxId = %1)", BoxId);
			ВызватьИсключение Ошибка;
		КонецЕсли;
		
		Сессия = СтрокаКонтекста.Сессия;
		
	КонецЕсли;
	
	Результат = Ядро.Организации_ДоступныеОрганизации(Сессия);
	
	Возврат Результат;
	
КонецФункции

// Выполняет групповое сопоставление контрагентов.
// При использовании альтернативной системы хранения необходимо
// передавать сведения об организации сервиса.
//
// Параметры:
//  Организация - Структура - данные организации сервиса (см. Организации_ЗаполненныеРеквизиты).
// 
// Возвращаемое значение:
//  Структура - результат сопоставления:
//   * КоличествоСопоставленных - Число - количество успешно сопоставленных контрагентов.
//   * МассивОшибокДублей - Массив из Строка - коллекция ошибок сопоставления, связанных с дублями контрагентов.
//   * МассивОшибокСопоставления - Массив из Строка - коллекция прочих ошибок сопоставления.
//
Функция ЭДО_ВыполнитьГрупповоеСопоставлениеКонтрагентов(Организация = Неопределено) Экспорт
	
	Если Не ИспользоватьПодсистемуДиадока()
		И Не ЗначениеЗаполнено(Организация) Тогда
		
		ТекстОшибки = "Для группового сопоставления контрагентов требуется указать данные организации!";
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = Ядро.Контрагенты_ГрупповоеСопоставление(Организация);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПодразделенияОрганизацииВДиадоке(BoxId) Экспорт
	
	Результат = Ядро.Подразделения_ОрганизацииВДиадоке(BoxId);
	
	Возврат Результат;
	
КонецФункции

// Позволяет отправить приглашения контрагентам
//
// Параметры:
//  Организация			 - 	 - Ссылка	 - Ссылка, содержащая данные об организации, от лица которой осуществляется приглашение
//  МассивКонтрагентов	 - 	 - Массив	 - Массив ссылок с данными о приглашаемых контрагентах
//  ТекстПриглашения	 - 	 - Строка	 - Строка с текстом приглашения
//  InvitationDocument	 - 	 - Структура:
//		* FileName					 - Строка - Имя файла приглашения
//		* SignedContent				 - Структура:
//			* Content - ДвоичныеДанные - Двоичные данные файла приглашения
//			* Signature - ДвоичныеДанные - Двоичные данные подписи файла приглашения
//		* ЗапрашиватьОтветнуюПодпись - Булево - параметр, определяющий запрос подписи файла приглашения
//	Статус				 - 	 - Строка	 - Статус контрагентов в сервисе (см. Ядро.Перечисление_СтатусыКонтрагентов)
// 
// Возвращаемое значение:
// Массив приглашенных контрагентов
//
Функция ЭДО_Контрагенты_Пригласить(ОрганизацияСсылка, МассивСсылокКонтрагентов, ТекстПриглашения, InvitationDocument = Неопределено, Статус) Экспорт
	
	Организация = Организации_ЗаполненныеРеквизиты(ОрганизацияСсылка);
	
	МассивКонтрагентов = Новый Массив;
	
	Для Каждого Ссылка Из МассивСсылокКонтрагентов Цикл
		
		Контрагент = Контрагенты_ЗаполненныеРеквизиты(Ссылка);
		
		МассивКонтрагентов.Добавить(Контрагент);
		
	КонецЦикла;
	
	ПараметрыПриглашения = Новый Структура;
	
	ПараметрыПриглашения.Вставить("ТекстПриглашения", ТекстПриглашения);
	
	Если InvitationDocument <> Неопределено Тогда
		
		Если InvitationDocument.Свойство("FileName") Тогда
			ПараметрыПриглашения.Вставить("ИмяФайла", InvitationDocument.FileName);
		КонецЕсли;
		
		Если InvitationDocument.Свойство("SignedContent") Тогда
			ПараметрыПриглашения.Вставить("ДвоичныеДанныеФайла", InvitationDocument.SignedContent.Content);
			ПараметрыПриглашения.Вставить("ДвоичныеДанныеПодписи", InvitationDocument.SignedContent.Signature);
		КонецЕсли;
		
		ПараметрыПриглашения.Вставить("ЗапрашиватьОтветнуюПодпись", InvitationDocument.SignatureRequested);
		
	КонецЕсли;
	
	РезультатОтправкиПриглашений = Ядро.Контрагенты_ОтправитьПриглашение(Организация, МассивКонтрагентов, ПараметрыПриглашения);
	
	Результат = РезультатОтправкиПриглашений.ПриглашенныеКонтрагенты;
	
	Ядро.Контрагенты_ЗаписатьСтатусДляМассиваКонтрагентов(Организация, Результат, Статус);
	
	Возврат Результат;
	
КонецФункции

// Получает идентификатор подразделения организации Диадока, которое сопоставлено
// с указанным объектом информационной базы.
//
// Параметры:
//  СвязанныйОбъектИБ - ЛюбаяСсылка - объект для поиска сопоставленного подразделения
//  BoxId - Строка - идентификатор ящика организации
// 
// Возвращаемое значение:
//  Строка - идентификатор подразделения в ящике организации.
//
// Пример:
//  Пакет.fromDepartmentId = ОсновнойМодуль.ЭДО_Справочники_ИдентификаторПодразделенияОрганизации(Документ1С.Подразделение, BoxId);
//
Функция ЭДО_Справочники_ИдентификаторПодразделенияОрганизации(СвязанныйОбъектИБ, BoxId) Экспорт
	
	Результат = Ядро.Подразделения_ИдентификаторПодразделенияОрганизации(СвязанныйОбъектИБ, BoxId);
	
	Возврат Результат;
	
КонецФункции

// Получает идентификатор подразделения контрагента, которое сопоставлено
// с указанным объектом информационной базы.
//
// Параметры:
//  СвязанныйОбъектИБ - ЛюбаяСсылка - объект для поиска сопоставленного подразделения
//  CounteragentBoxId - Строка - идентификатор ящика контрагента
// 
// Возвращаемое значение:
//  Строка - идентификатор подразделения в ящике контрагента.
//
// Пример:
//  Пакет.toDepartmentId = ОсновнойМодуль.ЭДО_Справочники_ИдентификаторПодразделенияКонтрагента(Документ1С.Грузополучатель, CounteragentBoxId);
//
Функция ЭДО_Справочники_ИдентификаторПодразделенияКонтрагента(СвязанныйОбъектИБ, CounteragentBoxId) Экспорт
	
	Результат = Ядро.Подразделения_ИдентификаторПодразделенияКонтрагента(СвязанныйОбъектИБ, CounteragentBoxId);
	
	Возврат Результат;
	
КонецФункции

//}		СПРАВОЧНИКИ


//{		КОНТЕНТ

Процедура ЗаполнитьКонтентXDTOПоСтруктуре(Контент, Структура) Экспорт
	
	Ядро.ЗаполнитьКонтентXDTOПоСтруктуре(Контент, Структура);
	
КонецПроцедуры

Функция ПолучитьДопСвойствоШапкиДокумента(ИмяСвойства, КонтентXDTO, ТипДокумента) Экспорт
	
	Результат = Ядро.Документы_ПолучитьДопСвойствоШапки(КонтентXDTO, ИмяСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция XML_В_XDTO(ДвоичныеДанные) Экспорт
	
	Результат = Ядро.ГенерацияXML_XML_В_ОбъектXDTO(ДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектXDTO_В_ProtoСтруктура(ОбъектXDTO) Экспорт
	
	Результат = Ядро.ГенерацияXML_ОбъектXDTO_В_ProtoСтруктура(ОбъектXDTO);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Модуль_РаботаСКонтентом() Экспорт
	
	Результат = Ядро.Модуль_ГенерацияXML(Ядро);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьПустойКонтентОтветаДляДокумента(ДокументЭДО, Вердикт) Экспорт
	
	Результат = Ядро.Документы_ПолучитьПустойКонтентОтвета(ДокументЭДО, Вердикт);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьСтруктурированныйКонтентВходящегоДокумента(ДокументЭДО) Экспорт
	
	Документ = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	
	Если Документ.Тип.Формализованный Тогда
		ДвоичныеДанныеКонтента = Ядро.Документы_ДвоичныеДанныеКонтента(Документ.Идентификаторы);
		Результат = ЭДО_Модуль_ГенерацияXML().XML_В_ProtoОбъектXDTO(ДвоичныеДанныеКонтента);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Модуль_ГенерацияXML() Экспорт
	
	Результат = Ядро.Модуль_ГенерацияXML(Ядро);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьПустойКонтентОтвета(ТипКонтента, ДействиеВДД) Экспорт
	
	ТипКонтентаОтвета	= Ядро.Документы_ТипКонтентаОтвета(ТипКонтента, ДействиеВДД);
	Результат			= Ядро.ГенерацияXML_ПолучитьПустуюПротоСтруктуру(ТипКонтентаОтвета, Истина);
	
	Возврат Результат;	
	
КонецФункции

Функция ОбъектXDTOВСтруктуру(ОбъектXDTO, ПреобразовыватьСпискиВМассивы = Истина) Экспорт
	
	Результат = Ядро.ОбъектXDTOВСтруктуру(ОбъектXDTO, ПреобразовыватьСпискиВМассивы);
	
	Возврат Результат;
	
КонецФункции

Функция ДД_Компонента_ДоступныеТипыКонтентов() Экспорт
	
	Результат = Новый Массив;
	
	ProtoФабрикаXDTO = Ядро.Модуль_ГенерацияXML(Ядро).ProtoФабрикаXDTO();
	
	Для Каждого Пакет Из ProtoФабрикаXDTO.Пакеты Цикл
		
		Если Пакет.URIПространстваИмен = ДД_Компонента_URIТиповКомпоненты() Тогда
			
			Для Каждого Свойство Из Пакет.КорневыеСвойства Цикл
				Результат.Добавить(Свойство.Тип);
			КонецЦикла;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДД_Компонента_URIТиповКомпоненты() Экспорт
	
	Возврат "http://diadoc.kontur.ru/dll_types";
	
КонецФункции

Функция ДД_Компонента_ИмяКонтентаОтветаДляТипаДокумента(ТипКонтента, Вердикт) Экспорт
	
	Результат = ЭДО_ПолучитьТипКонтентаОтвета(ТипКонтента, Вердикт);
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьТипКонтентаОтвета(ТипКонтента, Вердикт) Экспорт 
	
	Результат = Ядро.Документы_ТипКонтентаОтвета(ТипКонтента, Вердикт);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ОписаниеФорматаКонтента(Знач ТипКонтента = Неопределено, ТипДокумента = Неопределено) Экспорт
	
	Результат = Ядро.Списки_ОписаниеФорматаКонтента(ТипКонтента);
	
	Возврат Результат;
		
КонецФункции

Функция ДД_Компонента_ПолучитьПустойКонтент(ИмяКонтента, СоздатьВсеСвойства = Ложь) Экспорт
	
	Результат = Ядро.ГенерацияXML_ПолучитьПустуюПротоСтруктуру(ИмяКонтента, СоздатьВсеСвойства);
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные контента по идентификаторам электронного документа
//
// Параметры:
//	ДокументЭДО - СправочникСсылка.Диадок_Документы, Структура - описание электронного документа
//
// Возвращаемое значение:
//	Структура - см. Ядро.Контракт_ДанныеХранения()
Функция ЭДО_ПолучитьХранилищеКонтента(ДокументЭДО) Экспорт
	
	// если в качестве параметра передана структура, 
	// то набор ключей должен соответствовать контракту "Ядро.Контракт_Идентификаторы()"
	
	Если ТипЗнч(ДокументЭДО) <> Тип("Структура") Тогда
		Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	Иначе
		Идентификаторы = ДокументЭДО;
	КонецЕсли;
	
	Результат = Ядро.Документы_ДвоичныеДанныеКонтента(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьХранилищеПодписи(ДокументЭДО, НаименованиеХранилища = "ХранилищеКонтента") Экспорт
	
	Если ТипЗнч(ДокументЭДО) <> Тип("Структура") Тогда
		Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	Иначе
		Идентификаторы = ДокументЭДО;
	КонецЕсли;
	
	Результат = Ядро.Документы_ДвоичныеДанныеПодписи(Идентификаторы, НаименованиеХранилища);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьUtdSellerContentИзInvoiceContent(Content) Экспорт
	
	Возврат ЭДО_Модуль_ГенерацияXML().ПолучитьUtdSellerContentИзInvoiceContent(Content);
	
КонецФункции

Функция ЭДО_ПолучитьUtd820SellerContentИзUtdSellerContent(Content) Экспорт
	
	Если ТипЗнч(Content) = Тип("Структура") Тогда
		UtdSellerContent = ДД_Компонента_ПолучитьПустойКонтент("UtdSellerContent", Истина);
		ЗаполнитьКонтентXDTOПоСтруктуре(UtdSellerContent, Content);
	Иначе
		UtdSellerContent = Content;
	КонецЕсли; 
	
	ОбъектXDTO = ЭДО_Модуль_ГенерацияXML().ПолучитьUtd820SellerContentИзUtdSellerContent(UtdSellerContent);
	
	Результат = ОбъектXDTOВСтруктуру(ОбъектXDTO);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьUcdSellerContentИзInvoiceCorrectionContent(Content) Экспорт
	
	Возврат ЭДО_Модуль_ГенерацияXML().ПолучитьUcdSellerContentИзInvoiceCorrectionContent(Content);
	
КонецФункции

Функция ИмяТитулаДляПолученияПолномочийПодписанта(ИмяФормата) Экспорт
	
	Если НРег(ИмяФормата) = "utd_05_01_02" Тогда
		Результат = "Utd";
	ИначеЕсли НРег(ИмяФормата) = "ucd_05_01_01" Тогда
		Результат = "Ucd";
	ИначеЕсли НРег(ИмяФормата) = "rezru_05_01_01" Тогда
		Результат = "AccCert552";
	ИначеЕсли НРег(ИмяФормата) = "tovtorg_05_01_02" Тогда
		Результат = "TovTorg551";
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодписантаВКонтентеДокументаТекущимПользователем(ContentXDTO, BoxID, ВидТитула = Неопределено, Сторона = "Продавец") Экспорт
	
	ТипКонтента = ContentXDTO.Тип().Имя;
	
	Документ = Новый Структура;
	
	Тип = Новый Структура;
	Тип.Вставить("ТипКонтента", ТипКонтента);
	
	Идентификаторы = Новый Структура;
	Идентификаторы.Вставить("BoxID", BoxID);
	
	Документ.Вставить("Тип",			Тип);
	Документ.Вставить("Идентификаторы",	Идентификаторы); 
	
	Ядро.Документы_ЗаполнитьПротоСтруктуруПодписантом(Документ, ContentXDTO, Сторона);
	
КонецПроцедуры

Функция ЭДО_ПолучитьСохраненныеДанныеДляОтправкиОтвета(ДокументЭДО, ПакетЭДО) Экспорт
	
	Результат = Новый Структура;
	
	СохраненныеДанные = ПолучитьВердиктИСодержимоеОтветаПоДокументу(ДокументЭДО);
	
	Если НЕ ЗначениеЗаполнено(СохраненныеДанные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторыДокумента = Новый Структура;
	
	ИдентификаторыДокумента.Вставить("boxId",		ЭДО_Служебные_АдресЯщикаКонтрагента(ДокументЭДО.BoxId));
	ИдентификаторыДокумента.Вставить("documentId",	ДокументЭДО.DocumentId);
	ИдентификаторыДокумента.Вставить("letterId",	ДокументЭДО.LetterId);
	
	Результат.Вставить("ДокументДД",			ДокументЭДО);
	Результат.Вставить("ПакетДД",				ПакетЭДО);
	Результат.Вставить("СтруктураОтвета",		СохраненныеДанные.КонтентОтвета);
	Результат.Вставить("Вердикт",				СохраненныеДанные.Вердикт);
	Результат.Вставить("Идентификаторы",		ИдентификаторыДокумента);
		
	Если СохраненныеДанные.Вердикт = ЭДО_Перечисление_ВариантыОтветаПоДокументу().Подписать Тогда
		
		Результат.Вставить("ВидОтвета",	"AcceptDocument");
		Результат.Вставить("НовыйСтатус",	"Подписан");
		
	ИначеЕсли СохраненныеДанные.Вердикт = ЭДО_Перечисление_ВариантыОтветаПоДокументу().ОтказатьВПодписи Тогда
		
		Результат.Вставить("ВидОтвета",	"RejectDocument");
		Результат.Вставить("НовыйСтатус",	"Отказано в подписи контрагенту");
		
	ИначеЕсли СохраненныеДанные.Вердикт = ЭДО_Перечисление_ВариантыОтветаПоДокументу().ЗапроситьУточнение Тогда
		
		Результат.Вставить("ВидОтвета",	"CorrectionRequest");
		Результат.Вставить("НовыйСтатус",	"Ожидается уточнение");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВердиктИСодержимоеОтветаПоДокументу(ДокументЭДО)
	
	СтруктураДанных = ДокументЭДО.ХранилищеОтвета.Получить();
	
	Если ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда
		
		Результат = Новый Структура;
		
		Результат.Вставить("Вердикт",		ДокументЭДО.ТребуемоеДействиеВДД);
		Результат.Вставить("КонтентОтвета",	СтруктураДанных);
		
		// Ответ уже был отправлен и ТребуемоеДействиеВДД было при этом очищено
		Если НЕ ЗначениеЗаполнено(Результат.Вердикт) Тогда 
			СтруктураДанных.Свойство("Вердикт", Результат.Вердикт);
		КонецЕсли;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция XML_В_ProtoСтруктура(ДвоичныеДанные) Экспорт
	
	Результат = Ядро.Модуль_ГенерацияXML(Ядро).XML_В_ProtoСтруктура(ДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции	

Функция НовыйЭлементСпискаXDTO(СписокXDTO) Экспорт
	
	ИмяТипаЭлементаСписка = СписокXDTO.ВладеющееСвойство.Тип.Имя;
	
	ИнициализироватьВложенныеЭлементы = Истина;
	ЭлементСписка = ДД_Компонента_ПолучитьПустойКонтент(ИмяТипаЭлементаСписка, ИнициализироватьВложенныеЭлементы);
	
	Результат = СписокXDTO.Добавить(ЭлементСписка);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьЗначениеXDTO(Элемент, ИмяРеквизита, ЗначениеРеквизита)
	
	Если ЗначениеРеквизита = Неопределено
		Или ЗначениеРеквизита = Null Тогда
		Возврат;
	КонецЕсли;
	
	Элемент[ИмяРеквизита] = ЗначениеРеквизита;
	
КонецПроцедуры

Процедура ДобавитьИнформационноеПолеВОбъектXDTO(Контент, Ключ, Значение)
	
	ИмяСпискаИнфоПолей = ИмяСвойства_StructedAdditionalInfos();
	КоллекцияИнфоПолей = Контент[ИмяСпискаИнфоПолей];
	
	Элемент = НовыйЭлементСпискаXDTO(КоллекцияИнфоПолей);
	
	ИмяПоляКлюч = ИмяСвойства_Key();
	ИмяПоляЗначение = ИмяСвойства_Value();
	
	УстановитьЗначениеXDTO(Элемент, ИмяПоляКлюч, Ключ);
	УстановитьЗначениеXDTO(Элемент, ИмяПоляЗначение, Значение);
	
КонецПроцедуры

Процедура ДобавитьИнформационноеПолеВСтруктуру(Контент, Ключ, Значение)
	
	ИмяСпискаИнфоПолей = ИмяСвойства_StructedAdditionalInfos();
	КоллекцияИнфоПолей = Неопределено;
	
	ИмяПоляКлюч = ИмяСвойства_Key();
	ИмяПоляЗначение = ИмяСвойства_Value();
	
	Если Не Контент.Свойство(ИмяСпискаИнфоПолей, КоллекцияИнфоПолей) Тогда
		КоллекцияИнфоПолей = Новый Массив;
		Контент.Вставить(ИмяСпискаИнфоПолей, КоллекцияИнфоПолей);
	КонецЕсли;
	
	Элемент = Новый Структура;
	Элемент.Вставить(ИмяПоляКлюч, Ключ);
	Элемент.Вставить(ИмяПоляЗначение, Значение);
	
	КоллекцияИнфоПолей.Добавить(Элемент);
	
КонецПроцедуры

Функция ИмяСвойства_Key()
	Возврат "Key";
КонецФункции

Функция ИмяСвойства_Value()
	Возврат "Value";
КонецФункции

Функция ИмяСвойства_StructedAdditionalInfos()
	Возврат "StructedAdditionalInfos";
КонецФункции

Функция Конст_ИмяДокументаАСЧФ()
	Возврат "АСЧФ";
КонецФункции

Функция Конст_ИмяДокументаИспАСЧФ()
	Возврат "ИспАСЧФ";
КонецФункции

Процедура ЗаполнитьПризнакиПрослеживаемыхИМаркируемыхТоваров(Контент, ПризнакиПрослеживаемыхИМаркируемыхТоваров) Экспорт
	
	_ПроверитьПараметр(
		"ЗаполнитьПризнакиПрослеживаемыхИМаркируемыхТоваров",
		"ПризнакиПрослеживаемыхИМаркируемыхТоваров",
		ПризнакиПрослеживаемыхИМаркируемыхТоваров,
		Тип("Структура"));
	
	ТипБулево = Тип("Булево");
	
	ОжидаемыеТипыСвойств = Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваров(
		ТипБулево, ТипБулево, ТипБулево, ТипБулево, ТипБулево);
	
	_ПроверитьПараметр(
		"ЗаполнитьПризнакиПрослеживаемыхИМаркируемыхТоваров",
		"ПризнакиПрослеживаемыхИМаркируемыхТоваров",
		ПризнакиПрослеживаемыхИМаркируемыхТоваров,
		Тип("Структура"),
		ОжидаемыеТипыСвойств);

	ГенерацияXML = ЭДО_Модуль_ГенерацияXML();
	ГенерацияXML.Заполнить_ПризнакиПрослеживаемыхИМаркируемыхТоваровДокументаУПД970(
		Контент,
		ПризнакиПрослеживаемыхИМаркируемыхТоваров);
	
КонецПроцедуры

Функция Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваров(
	ЕстьПрослеживаемаяПродукция = Ложь,
	ЕстьМаркируемаяПродукция = Ложь,
	ЕстьАлкогольнаяПродукция = Ложь,
	ЕстьТабачнаяПродукция = Ложь,
	ЕстьНефтепродукты = Ложь) Экспорт
	
	ГенерацияXML = ЭДО_Модуль_ГенерацияXML();
	
	Результат = ГенерацияXML.Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваровУПД970(
		ЕстьПрослеживаемаяПродукция,
		ЕстьМаркируемаяПродукция,
		ЕстьАлкогольнаяПродукция,
		ЕстьТабачнаяПродукция,
		ЕстьНефтепродукты);
	
	Возврат Результат;
	
КонецФункции

//}		КОНТЕНТ


//{		ТИПОВОЙ МОДУЛЬ

// Создает типовой модуль из макета вызывающего модуля,
// или из "каталога с модулем" в случае режима отладки.
//
// Параметры:
//  ИмяФайлаСМодулем		- Двоичные данные	- типовой модуль из макета или
//                            Строка			- каталог, где лежит модуль(в режиме отладки).
//  НеИспользуется_РежимУправляемыхФорм	- Булево, Неопределено			- управляемые/обычные формы.
//  РежимОтладки
//   *Булево				- режим отладки включен/выключен
//   *Неопределено			- режим отладки типового модуля определяется автоматически. см. ТиповойМодуль_РежимОтладки()
//  КаталогСМодулем			- Строка			- каталог вложенных обработок для отладки.
// 
// Возвращаемое значение:
//   ВнешняяОбработка - объект модуля.
//
Функция ИнициализацияТиповогоМодуля(ИмяФайлаСМодулем, НеИспользуется_РежимУправляемыхФорм = Неопределено, РежимОтладки = Неопределено, КаталогСМодулем = "") Экспорт
	
	Результат = Ядро.Модуль_ТиповойМодуль(ЭтотОбъект, РежимОтладки, КаталогСМодулем);
	
	Возврат Результат;
	
КонецФункции

// Заполняет контекст типового модуля для обычных форм.
//
// Параметры:
//  ТиповойМодуль	- ВнешняяОбработка	- объект модуля.
//  РежимОтладки	- Булево			- режим отладки включен/выключен.
//  КаталогСМодулем	- Строка			- каталог вложенных обработок для отладки.
//
Процедура ИнициализацияТиповогоМодуляОФ(ТиповойМодульДиадока, РежимОтладки = Ложь, КаталогСМодулем = "") Экспорт
	
	Ядро.ИнициализироватьТиповойМодульОФ(ТиповойМодульДиадока, РежимОтладки, КаталогСМодулем);
	
КонецПроцедуры

// Заполняет контекст типового модуля для управляемых форм.
//
// Параметры:
//  ТиповойМодуль	- ВнешняяОбработка	- объект модуля.
//  РежимОтладки	- Булево			- режим отладки включен/выключен.
//  КаталогСМодулем	- Строка			- каталог вложенных обработок для отладки.
//
Процедура ИнициализацияТиповогоМодуляУФ(ТиповойМодульДиадока, РежимОтладки = Ложь, КаталогСМодулем = "") Экспорт
	
	Ядро.ИнициализироватьТиповойМодульУФ(ТиповойМодульДиадока, РежимОтладки, КаталогСМодулем);
	
КонецПроцедуры

Функция ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль = Неопределено, НеИспользуется_РежимУправляемыхФорм = Неопределено, Документ1С, ТипКонтента, ДополнительныеПараметры) Экспорт
	
	Если Не ИспользуетсяИнтеграционныйМодуль() Тогда
		
		Контекст = Новый Структура;
		Контекст.Вставить("ТипКонтента", ТипКонтента);
		Контекст.Вставить("ТипУчетногоДокумента", Документ1С.Метаданные().ПолноеИмя());
		
		ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(
			"ТиповойМодуль_ПолучитьКонтент",
			Контекст
		);
		
	КонецЕсли;
	
	Результат = Ядро.ТиповойМодуль_ПолучитьКонтент(
		Документ1С,
		ТипКонтента,
		ДополнительныеПараметры
	);
	
	Возврат Результат;
	
КонецФункции


// Формирует сведения для отправки неформализованного документа
//
// Параметры:
//  НеИспользуется_ТиповойМодуль - Произвольный - не используется (для обратной совместимости)
//  НеИспользуется_РежимУправляемыхФорм - Произвольный - не используется (для обратной совместимости)
//  Документ1С - ЛюбаяСсылка - ссылка на учетный документ, на основании которого формируется электронный документ
//  ИмяПечатнойФормы - Строка - идентификатор вида печатной формы (принимает значения: "СчетНаОплату", "АктСверки")
//  НеИспользуется_ДополнительныеПараметры - Структура - не используется (для обратной совместимости)
// 
// Возвращаемое значение:
//  Структура - Контракт_НеформализованныйСчетНаОплату, если ИмяПечатнойФормы = "СчетНаОплату"
//            - Контракт_НеформализованныйАктСверки, , если ИмяПечатнойФормы = "АктСверки"
//
Функция ТиповойМодуль_СформироватьПечатнуюФорму(НеИспользуется_ТиповойМодуль = Неопределено,
												НеИспользуется_РежимУправляемыхФорм = Неопределено,
												Документ1С,
												ИмяПечатнойФормы,
												НеИспользуется_ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ИспользуетсяИнтеграционныйМодуль() Тогда
		
		Контекст = Новый Структура;
		Контекст.Вставить("ИмяПечатнойФормы", ИмяПечатнойФормы);
		Контекст.Вставить("ТипУчетногоДокумента", Документ1С.Метаданные().ПолноеИмя());
		
		ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(
			"ТиповойМодуль_СформироватьПечатнуюФорму",
			Контекст
		);
		
	КонецЕсли;
	
	Если НРег(ИмяПечатнойФормы) = НРег("СчетНаОплату")
		И Ядро.ФормироватьСчетаНаОплатуСредствамиУМ() Тогда
		
		// BSLLS:MissingTemporaryFileDeletion-off
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
		// BSLLS:MissingTemporaryFileDeletion-on
		
		ТабличныйДокумент = Ядро.СчетаНаОплату_ПечатнаяФорма(Документ1С);
		ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
		
		Мета = Ядро.СчетаНаОплату_Метаданные(Документ1С);
		
		Результат = Контракт_НеформализованныйСчетНаОплату();
		Результат.Таблица = ТабличныйДокумент;
		Результат.ИмяВременногоФайла = ИмяВременногоФайла;
		Результат.ИмяФайла = Мета.ИмяФайлаВложения;
		Результат.Дата = Мета.Дата;
		Результат.Номер = Мета.Номер;
		Результат.Сумма = Мета.Сумма;
		Результат.СуммаНДС = Мета.СуммаНДС;
		Результат.ДокументБезНДС = Мета.ДокументБезНДС;
		Результат.КодВалюты = Мета.КодВалюты;
		
	ИначеЕсли НРег(ИмяПечатнойФормы) = НРег("АктСверки") Тогда
		
		// BSLLS:MissingTemporaryFileDeletion-off
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
		// BSLLS:MissingTemporaryFileDeletion-on
		
		ТабличныйДокумент = Ядро.АктыСверок_ПечатнаяФорма(Документ1С);
		ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
		
		Мета = Ядро.АктыСверок_Метаданные(Документ1С);
		
		Результат = Контракт_НеформализованныйАктСверки();
		Результат.Таблица = ТабличныйДокумент;
		Результат.ИмяВременногоФайла = ИмяВременногоФайла;
		Результат.ИмяФайла = Мета.ИмяФайлаВложения;
		Результат.Дата = Мета.Дата;
		Результат.Номер = Мета.Номер;
		
	Иначе
		
		Результат = Ядро.ТиповойМодуль_СформироватьПечатнуюФорму(
			Документ1С,
			ИмяПечатнойФормы,
			НеИспользуется_ДополнительныеПараметры
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТиповойМодуль_ВалидацияКонтента(ТиповойМодульДиадока, 
										НеИспользуется_РежимУправляемыхФорм = Неопределено, 
										Документ1С, 
										ТипПротоКонтента, 
										Content, 
										ДополнительныеПараметры) Экспорт
	
	Результат = Ядро.Документы_ВалидацияКонтента(Content, ТипПротоКонтента);
	
	Возврат Результат;
	
КонецФункции

Функция ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль = Неопределено, Параметры) Экспорт
	
	Если Не ИспользуетсяИнтеграционныйМодуль() Тогда
		
		Контекст = Новый Структура;
		
		ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(
			"ТиповойМодуль_СоздатьДокумент",
			Контекст
		);
		
	КонецЕсли;
	
	Результат = Ядро.ТиповойМодуль_СоздатьДокумент(Параметры);
	
	Возврат Результат;
	
КонецФункции

Процедура ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, НеИспользуется_ТиповойМодуль = Неопределено) Экспорт
	
	Если Не ИспользуетсяИнтеграционныйМодуль() Тогда
		
		КолонкиТаблицы = Новый Массив;
		Для Каждого Колонка Из ТаблицаНоменклатурыДляСопоставления.Колонки Цикл
			КолонкиТаблицы.Добавить(Колонка.Имя);
		КонецЦикла;
		
		Контекст = Новый Структура;
		Контекст.Вставить("КоличествоСтрок", XMLСтрока(ТаблицаНоменклатурыДляСопоставления.Количество()));
		Контекст.Вставить("КолонкиТаблицы", КолонкиТаблицы);
		
		ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(
			"ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры",
			Контекст
		);
		
	КонецЕсли;
	
	Ядро.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления);
	
КонецПроцедуры

Процедура ТиповойМодуль_СопоставлениеНоменклатуры(НеИспользуется_ТиповойМодуль = Неопределено, ТаблицаНоменклатурыДляСопоставления) Экспорт
	
	Если Не ИспользуетсяИнтеграционныйМодуль() Тогда
		
		КолонкиТаблицы = Новый Массив;
		Для Каждого Колонка Из ТаблицаНоменклатурыДляСопоставления.Колонки Цикл
			КолонкиТаблицы.Добавить(Колонка.Имя);
		КонецЦикла;
		
		Контекст = Новый Структура;
		Контекст.Вставить("КоличествоСтрок", XMLСтрока(ТаблицаНоменклатурыДляСопоставления.Количество()));
		Контекст.Вставить("КолонкиТаблицы", КолонкиТаблицы);
		
		ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(
			"ТиповойМодуль_СопоставлениеНоменклатуры",
			Контекст
		);
		
	КонецЕсли;
	
	Ядро.ТиповойМодуль_ЗаписатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления);
	
КонецПроцедуры

Функция ТиповойМодуль_СписокТиповДокументовДляСоздания(НеИспользуется_ТиповойМодуль = Неопределено, НеИспользуется_РежимУправляемыхФорм = Неопределено, Параметры) Экспорт
	
	ТипЭлектронногоДокумента = Параметры.Документ.Тип;
	
	Если Не ИспользуетсяИнтеграционныйМодуль() Тогда
		
		Контекст = Новый Структура;
		Контекст.Вставить("ТипКонтента", ТипЭлектронногоДокумента.ТипКонтента);
		Контекст.Вставить("ТипДокумента", ТипЭлектронногоДокумента.ТипДокумента);
		Контекст.Вставить("ФункцияДокумента", ТипЭлектронногоДокумента.ФункцияДокумента);
		
		ОбработатьОшибку_ОтсутствуетИнтеграционныйМодуль(
			"ТиповойМодуль_СписокТиповДокументовДляСоздания",
			Контекст
		);
		
	КонецЕсли;
	
	Результат = Ядро.МенеджерИнтеграции_ПравилаСозданияДокументовУчета(ТипЭлектронногоДокумента);
	
	Возврат Результат;
	
КонецФункции

//}		ТИПОВОЙ МОДУЛЬ


//{		ДЕЙСТВИЯ НА СЕРВЕРЕ ДИАДОКА

Функция ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументЭДО, ОшибокНет = Неопределено) Экспорт
	
	Результат = Ядро.Документы_ВариантыОтветныхДействий(ДокументЭДО, ОшибокНет);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ОтправитьСогласующуюПодпись(ДокументЭДО, ОтпечатокСертификата = "") Экспорт
	
	Действие = Ядро.Перечисление_ДействияЭДО().ПодписатьСогласующейПодписью;
	
	Результат = ВыполнитьДействиеСДокументомЭДО(ДокументЭДО, Действие, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_СписокМаршрутовСогласованияВДиадоке(BoxId) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ResolutionChains", Новый Структура);
	
	ПараметрыСервиса = Ядро.ПараметрыСервиса_Диадок(BoxId);
	
	МаршрутыСогласованияВДиадоке = Ядро.МаршрутыСогласования(ПараметрыСервиса, BoxId);
	
	ResolutionChains = Новый Массив;
	
	Для Каждого КлючЗначение Из МаршрутыСогласованияВДиадоке Цикл
		
		Маршрут = Новый Структура("ChainId, Name", КлючЗначение.Ключ, КлючЗначение.Значение);
		ResolutionChains.Добавить(Маршрут);
		
	КонецЦикла;
	
	Результат.ResolutionChains = ResolutionChains;
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ОтправитьMessagePatchToPostДляВыбранныхСтрокСпискаДокументов(ДанныеДляОбработки, Параметры) Экспорт
	
	ПараметрыМаршрутизации = ПараметрыМаршрутизации(Параметры);
	
	ДокументыЭДО = Новый Массив;
	
	Для Каждого Стр Из ДанныеДляОбработки Цикл
		ДокументыЭДО.Добавить(Стр.ДокументДД);
	КонецЦикла;
	
	МассивДокументов = Ядро.Документы_МассивДокументовДляМаршрутизации(ДокументыЭДО, ПараметрыМаршрутизации);
	
	Пакеты = Ядро.СгруппироватьДокументыПоПакетам(МассивДокументов);
	Для Каждого Пакет Из Пакеты Цикл
		Ядро.Пакеты_МаршрутизироватьДокументы(Пакет);
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыМаршрутизации(Параметры)
	
	Результат = Ядро.Контракт_Маршрутизация();
	
	Результат.Действие		= Параметры.Действие;
	Результат.UserId		= Ядро.СвойствоСтруктуры(Параметры,	"ИдентификаторСотрудника",		"");
	Результат.DepartmentId	= Ядро.СвойствоСтруктуры(Параметры,	"ИдентификаторПодразделения",	"");
	Результат.RouteId		= Ядро.СвойствоСтруктуры(Параметры,	"ИдентификаторМаршрута",		"");
	Результат.Комментарий	= Ядро.СвойствоСтруктуры(Параметры,	"Комментарий",					"");
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ПереместитьМассивДокументовВПодразделение(BoxId, ToDepartmentId, МассивДокументов) Экспорт
	
	БуферныйМассив = Новый Массив;
	
	Ключ = "ДокументДД";
		
	Для Каждого ЭлементМассива Из МассивДокументов Цикл
		
		// Для обеспечения совместимости с ПМ предыдущих версий приведем
		// элементы коллекции МассивДокументов к виду контракта "Контракт_Документ".
		// Сам МассивДокументов не преобразуем для возможности дальнейшего использования его первоначальных данных в ПМ. 
		
		ЭлементБуфера = ЭлементМассива;
		
		Если ЭлементБуфера.Свойство(Ключ) Тогда
			ДокументДД = ЭлементБуфера[Ключ];
			ЭлементБуфера = Ядро.Документы_СохраненныйДокумент(ДокументДД);
		КонецЕсли;
		
		БуферныйМассив.Добавить(ЭлементБуфера);
				
	КонецЦикла;
	
	Ядро.Документы_ПереместитьМассивДокументовВПодразделение(BoxId, ToDepartmentId, БуферныйМассив);
	
	БуферныйМассив = Неопределено;
	
КонецПроцедуры	

Процедура ЭДО_ОтправитьОтветНаПакет(ПакетЭДО, ДанныеПоДокументам = Неопределено) Экспорт
	
	Пакет = Ядро.Пакеты_СохраненныйПакет(ПакетЭДО);
	Ядро.Пакеты_ОтправитьОтветНаВходящий(Пакет);
	
КонецПроцедуры

Процедура ЭДО_ПодготовитьИОтправитьОтветНаДокумент(ДокументЭДО, ПакетЭДО = Неопределено) Экспорт
	
	Документ = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	Ядро.Документы_ОтправитьОтветНаВходящий(Документ);
	
КонецПроцедуры

Функция ЭДО_ОтправитьОтветНаДокумент(ДанныеОтправки, ДвоичныеДанныеТитула, ДвоичныеДанныеПодписи) Экспорт 
	
	Результат = Истина;
	
	Документ = Ядро.Документы_СохраненныйДокумент(ДанныеОтправки.ДокументДД);
	Документ.СлужебнаяИнформация.Вставить("КонтентОтвета", ДвоичныеДанныеТитула);
	Документ.СлужебнаяИнформация.Вставить("ПодписьОтвета", ДвоичныеДанныеПодписи);
	
	ДокументыДляОбработки = Новый Массив;
	ДокументыДляОбработки.Добавить(Документ);	
	
	ПодготовленныеДанные = Ядро.Документы_ДанныеДляMessagePatchToPost(ДокументыДляОбработки, ДанныеОтправки.Вердикт);
	
	Попытка
		Ядро.Документы_ОтправитьДанныеДляMessagePatchToPost(ПодготовленныеДанные);
	Исключение
		
		ВидОперации		 		= "Отправка ответа на документ";
		ТекстОшибки		 		= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ПредставлениеДокумента	= Ядро.Документы_ПредставлениеДокумента(Документ);
		ДопИнформация			= "Документ: " + ПредставлениеДокумента;
		ТекстСообщения			= Ядро.Общее_ПодставитьПараметрыВСтроку("Не удалось отправить документ %1", ПредставлениеДокумента);
		Ядро.Ошибка_Обработать(ВидОперации, ТекстОшибки, ДопИнформация, ТекстСообщения);
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ПодготовитьИОтправитьПакет(СтрокаСписка) Экспорт
	
	ПорцияДанных = Новый Массив;
	ПорцияДанных.Добавить(СтрокаСписка);
	
	Ядро.Пакеты_ПодготовитьИОтправитьПакеты(ПорцияДанных);
	
КонецПроцедуры

Процедура ЭДО_ПодготовитьИОтправитьПакетыВФоне(СписокДокументовДляОтправки) Экспорт
	
	Ядро.Пакеты_ПодготовитьИОтправитьПакетыВФоне(СписокДокументовДляОтправки);
	
КонецПроцедуры

Функция ЭДО_ПодготовитьПакетКОтправке(СтрокаСписка) Экспорт
	
	Результат = СобратьПакетПоСтрокеСписка(СтрокаСписка);
	
	Возврат Результат;
	
КонецФункции

Функция СобратьПакетПоСтрокеСписка(СтрокаСписка) Экспорт
	
	Пакет = Ядро.Пакеты_ПодготовитьПакет(СтрокаСписка, Ложь);
	
	Результат = Ядро.ПодключаемыйМодуль_УстаревшийПакет(Пакет);
	
	Результат.Вставить("ИсходныйПакет", Пакет);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_СохранитьИОтправитьПакет(Пакет) Экспорт
	
	Если Пакет.Свойство("ИсходныйПакет") Тогда		
		
		ПакетДляОтправки = Пакет.ИсходныйПакет;
		
		Для Каждого Документ Из Пакет.Документы Цикл
			
			Для Каждого ДокументДляОтправки Из ПакетДляОтправки.Документы Цикл
				
				Если Документ.Ключ = ДокументДляОтправки.Ключ 
					И ЗначениеЗаполнено(Документ.ПараметрыСогласования) Тогда
						
						ПараметрыМаршрутизации = ПараметрыМаршрутизации(Документ.ПараметрыСогласования);
						ДокументДляОтправки.СлужебнаяИнформация.Вставить("Маршрутизация", ПараметрыМаршрутизации);
						Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		ПакетДляОтправки = Пакет;
	КонецЕсли;
	
	Результат = Ядро.Пакеты_ОтправитьИСохранить(ПакетДляОтправки);
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ОтправитьСохраненныйПакетНаСогласование(ПакетСсылка) Экспорт
	
	// Маршрутизация выполняется при вызове ЭДО_СохранитьИОтправитьПакет
	
КонецПроцедуры

// Выполняет аннулирование или отказ в аннулировании документов
//
// Параметры:
//  ДокументЭДО - ДокументСсылка - ссылка на документ ЭДО
//  Действие    - Строка - может принимать значения: "Аннулировать" или "ОтказатьВАннулировании"
//  Комментарий - Строка - комментарий аннулирования
//
Процедура ВыполнитьДействиеПоАннулированию(ДокументЭДО, Действие, Комментарий) Экспорт 
	
	СохраненныйДокумент = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	СохраненныйДокумент.СлужебнаяИнформация.Вставить("КонтентОтвета", Комментарий);
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(СохраненныйДокумент);
	
	МассивДокументов = Ядро.Документы_ДоступныеДляАннулированияДокументы(МассивДокументов, Действие);
	Если МассивДокументов.Количество() > 0 Тогда
		Ядро.Документы_ВыполнитьДействиеСДокументами(МассивДокументов, Действие);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет подписание промежуточной подписью
//
// Параметры:
//  ДокументЭДО	 - ДокументСсылка - ссылка на документ ЭДО
//
Процедура ВыполнитьПодписаниеПромежуточнойПодписью(ДокументЭДО) Экспорт
	
	Действие = Ядро.Перечисление_ДействияЭДО().ПодписатьПромежуточнойПодписью;
	
	Результат = ВыполнитьДействиеСДокументомЭДО(ДокументЭДО, Действие);
	
КонецПроцедуры

Функция ЭДО_ПолучитьМаршрутизациюДокумента(ПараметрыСервиса, Идентификаторы) Экспорт
	
	ТаблицаСобытийДО = Документы_СобытияДО(ПараметрыСервиса, Идентификаторы);
	
	ResolutionAttachmentTypes = Новый Структура;
	ResolutionAttachmentTypes.Вставить("Resolution", "ResolutionInfo");
	ResolutionAttachmentTypes.Вставить("ResolutionRequest", "ResolutionRequestInfo");
	ResolutionAttachmentTypes.Вставить("ResolutionRequestDenial", "ResolutionRequestDenialInfo");
	ResolutionAttachmentTypes.Вставить("ResolutionRouteAssignment", "ResolutionRouteAssignmentInfo");
	ResolutionAttachmentTypes.Вставить("ResolutionRouteRemoval", "ResolutionRouteRemovalInfo");
	ResolutionAttachmentTypes.Вставить("ResolutionRouteAssignmentAttachment", "ResolutionRouteAssignmentInfo");
	ResolutionAttachmentTypes.Вставить("ResolutionRouteRemovalAttachment", "ResolutionRouteRemovalInfo");
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТаблицаСобытийДО Цикл
		Если НЕ ResolutionAttachmentTypes.Свойство(СтрокаТЗ.AttachmentType) Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ Из МассивСтрокДляУдаления Цикл
		ТаблицаСобытийДО.Удалить(СтрокаТЗ);
	КонецЦикла;
	
	Результат = Ядро.ТаблицаЗначенийВМассивСтруктур(ТаблицаСобытийДО);
	
	Возврат Результат;
	
КонецФункции

Функция Документы_СобытияДО(ПараметрыСервиса, Идентификаторы)
	
	Результат = Новый_ТаблицаСобытийИсторииДО();
	
	ТаблицаСобытийДО = Ядро.Документы_СобытияДО(ПараметрыСервиса, Идентификаторы);
	
	Для Каждого ЭлементСобытия Из ТаблицаСобытийДО Цикл
		
		НоваяСтрокаСобытия = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСобытия, ЭлементСобытия);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ТаблицаСобытийИсторииДО()
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТипаДата = Новый ОписаниеТипов("Дата");
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("EntityId", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("RawCreationDate", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("AttachmentType", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("ParentAttachmentType", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("IsApprovementSignature", ОписаниеТипаБулево);
	Результат.Колонки.Добавить("ResolutionType", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("RequestType", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("User", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("UserId", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Department", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("DepartmentId", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Маршрут", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Дата", ОписаниеТипаДата);
	Результат.Колонки.Добавить("BoxId", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Организация", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Подписант", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Должность", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Описание", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Комментарий", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Шаблон", ОписаниеТипаБулево);
	Результат.Колонки.Добавить("ДокументURL", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("ШаблонДокументаURL", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("СохранятьКонтент", ОписаниеТипаБулево);
	Результат.Колонки.Добавить("ПодписанСРазногласиями", ОписаниеТипаБулево);
	Результат.Колонки.Добавить("ОтказаноВПодписи", ОписаниеТипаБулево);
	Результат.Колонки.Добавить("ДанныеПодписи", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("ТипСобытия", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("DocflowNamedId", ОписаниеТипаСтрока);
	Результат.Колонки.Добавить("Детализация", ОписаниеТипаСтрока);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьАрхивДокументооборота(boxId, letterId, documentId) Экспорт

	Идентификаторы = Новый_Идентификаторы(, , boxId, letterId, documentId);
	Результат = Ядро.Сохранение_ПолучитьАрхивДокументооборота(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

Функция ПодписатьДанныеНаСервере(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера = "") Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ОписаниеОшибки", "");
	
	ДвоичныеДанныеПодписи = Ядро.ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
	
	Если ДвоичныеДанныеПодписи <> Неопределено Тогда
		Результат.Вставить("ДвоичныеДанныеПодписи", ДвоичныеДанныеПодписи);
		Результат.Успешно = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи) Экспорт
	
	Результат = Ядро.ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_МожноЗапроситьУточнениеВходящегоДокумента(ДокументЭДО) Экспорт 
	
	Документ	= Ядро.Документы_СохраненныйДокумент(ДокументЭДО); 
	Результат	= Ядро.Документы_МожноЗапроситьУточнениеВходящегоДокумента(Документ);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьДвоичныйКонтентАннулированияОтказаВАннулировании(МассивИдентификаторов, Комментарий, Действие) Экспорт 
	
	Для Каждого Идентификаторы Из МассивИдентификаторов Цикл
		
		Для Каждого СтруктураДокумента Из Идентификаторы.Documents Цикл
			
			Документ1С	= СтруктураДокумента.Документ1С;
			Документ	= Документы_СохраненныйДокумент(Документ1С);
			
			Если Действие = "Отказать"
				ИЛИ Действие = "ОтказатьВАннулировании" Тогда				
				
				Документ.СлужебнаяИнформация.Вставить("КонтентОтвета", Комментарий);
				
				ОтказОтПредложения = Ядро.Документы_ОтказОтПредложенияОбАннулировании(Документ);
				
				EntityId	= ОтказОтПредложения.ЭлементКоллекции.Attachment.ParentEntityId;
				Content		= ОтказОтПредложения.ЭлементКоллекции.Данные;
				
			ИначеЕсли СтруктураДокумента.Статус = "Требуется аннулирование" Тогда
				
				ПредложениеОбАннулировании = Ядро.Документы_ПредложениеОбАннулировании(Документ);
				
				EntityId	= ПредложениеОбАннулировании.Описание;
				Content		= ПредложениеОбАннулировании.Данные;
				
			Иначе
				
				Документ.СлужебнаяИнформация.Вставить("КонтентОтвета", Комментарий);
				
				НовоеПредложениеОбАннулировании = Ядро.Документы_НовоеПредложениеОбАннулировании(Документ);
				
				EntityId	= СтруктураДокумента.DocumentId;
				Content		= НовоеПредложениеОбАннулировании.ЭлементКоллекции.Данные;
				
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(EntityId) Тогда
				ТекстОшибки = НСтр("ru = 'Не удалось найти предложение об аннулировании для документа %1'");
				ТекстОшибки = ЭДО_Служебные_ПодставитьПараметрыВСтроку(ТекстОшибки, Документ1С);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			Если Content = Неопределено Тогда
				ТекстОшибки = НСтр("ru = 'Не удалось найти предложение об аннулировании для документа %1'");
				ТекстОшибки = ЭДО_Служебные_ПодставитьПараметрыВСтроку(ТекстОшибки, Документ1С);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
				
			СтруктураДокумента.Вставить("Content",		Base64Строка(Content));
			СтруктураДокумента.Вставить("ТекстОшибки",	ТекстОшибки);
			СтруктураДокумента.Вставить("EntityId",		EntityId);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЭДО_АннулироватьОтказатьВАннулировании(МассивИдентификаторов, Действие) Экспорт 
	
	Для Каждого СтруктураИдентификаторов Из МассивИдентификаторов Цикл
		
		BoxId		 = СтруктураИдентификаторов.BoxId;
		MessageId	 = СтруктураИдентификаторов.LetterId;
		
		ПодготовленныеСтруктуры = Новый Структура;

		Signatures				 = Новый Массив;
		RevocationRequests		 = Новый Массив;
		XmlSignatureRejections	 = Новый Массив;
		
		Для Каждого СтруктураДокумента Из СтруктураИдентификаторов.Documents Цикл
			
			Если ЗначениеЗаполнено(СтруктураДокумента.ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;
			
			КонтрактМЧД = МЧДСлужебный_ТекущаяДоверенность(BoxId);
			PowerOfAttorney = Ядро.АПИ_Новый_PowerOfAttorneyToPost(КонтрактМЧД);
			
			ДанныеКонтента = Ядро.СвойствоСтруктуры(СтруктураДокумента, "Content", Неопределено);
			ДанныеКонтента = ?(ТипЗнч(ДанныеКонтента) <> Тип("ДвоичныеДанные"), Base64Значение(ДанныеКонтента), ДанныеКонтента);
			
			ДанныеПодписи = Ядро.СвойствоСтруктуры(СтруктураДокумента, "Signature", Неопределено);
			ДанныеПодписи = ?(ТипЗнч(ДанныеПодписи) <> Тип("ДвоичныеДанные"), Base64Значение(ДанныеПодписи), ДанныеПодписи);
			
			Если Действие = "Аннулировать" Тогда
				
				Если СтруктураДокумента.Статус = "Требуется аннулирование" Тогда
					
					DocumentSignature = Ядро.АПИ_Новый_DocumentSignature(СтруктураДокумента.EntityId, СтруктураДокумента.Signature, , , PowerOfAttorney);
					
					Signatures.Добавить(DocumentSignature);
					
				Иначе
					
					
					NameOnShelf = Ядро.АПИ_ЗагрузитьКонтентНаПолку(
						BoxId,
						ДанныеКонтента);
					
					SignatureNameOnShelf = Ядро.АПИ_ЗагрузитьКонтентНаПолку(
						BoxId,
						ДанныеПодписи);
						
					SignedContent = Ядро.АПИ_Новый_SignedContent(, , NameOnShelf, SignatureNameOnShelf, PowerOfAttorney);
					RevocationRequestAttachment = Ядро.АПИ_Новый_RevocationRequestAttachment(СтруктураДокумента.DocumentId, SignedContent);
					
					RevocationRequests.Добавить(RevocationRequestAttachment);
					
				КонецЕсли;
				
			Иначе
				
				NameOnShelf = Ядро.АПИ_ЗагрузитьКонтентНаПолку(
					BoxId,
					ДанныеКонтента);
					
				SignatureNameOnShelf = Ядро.АПИ_ЗагрузитьКонтентНаПолку(
					BoxId,
					ДанныеПодписи);
		
				SignedContent = Ядро.АПИ_Новый_SignedContent(, , NameOnShelf, SignatureNameOnShelf, PowerOfAttorney);
				XmlSignatureRejectionAttachment = Ядро.АПИ_Новый_XmlSignatureRejectionAttachment(СтруктураДокумента.EntityId, SignedContent);
				
				XmlSignatureRejections.Добавить(XmlSignatureRejectionAttachment);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Идентификаторы = Новый_Идентификаторы(, , BoxId, MessageId); 
		
		Если Signatures.Количество() Тогда
			
			ИмяКоллекции = "Signatures";
			ПодготовленныеСтруктуры.Вставить(ИмяКоллекции, Signatures);
			
		КонецЕсли;
		
		Если RevocationRequests.Количество() Тогда
			
			ИмяКоллекции = "RevocationRequests";
			ПодготовленныеСтруктуры.Вставить(ИмяКоллекции, RevocationRequests);
			
		КонецЕсли;
		
		Если XmlSignatureRejections.Количество() Тогда
			
			ИмяКоллекции = "XmlSignatureRejections";
			ПодготовленныеСтруктуры.Вставить(ИмяКоллекции, XmlSignatureRejections);
			
		КонецЕсли;
		
		РезультатОтправки = Ядро.РезультатPostMessagePatch(Идентификаторы, ПодготовленныеСтруктуры);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыполнитьДействиеСДокументомЭДО(ДокументЭДО, Действие, Знач ОтпечатокСертификата = "")
	
	Результат = Неопределено;
	
	Идентификаторы = ДокументЭДО;
	Если ТипЗнч(ДокументЭДО) <> Тип("Структура") Тогда
		Идентификаторы = Новый_Идентификаторы(, , ДокументЭДО.BoxId, ДокументЭДО.LetterId, ДокументЭДО.DocumentId);
	КонецЕсли;
	СохраненныйДокумент = Ядро.ХранениеДанных_ДанныеДокумента(Идентификаторы);
	
	МассивДокументов = Ядро.ЗначениеВМассив(СохраненныйДокумент);
	
	Если МассивДокументов.Количество() > 0 Тогда
		Результат = Ядро.Документы_ВыполнитьДействиеСДокументами(МассивДокументов, Действие, ОтпечатокСертификата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ДЕЙСТВИЯ НА СЕРВЕРЕ ДИАДОКА


//{		ДЕЙСТВИЯ В 1С

Процедура СохранитьРезультатАнализа(ДокументЭДО, РезультатАнализа) Экспорт
	
	Идентификаторы = Новый Структура("ДокументЭДО", ДокументЭДО);
	
	Ядро.Документы_СохранитьРезультатАнализа(Идентификаторы, РезультатАнализа);
	
КонецПроцедуры

Функция ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(Организация, МаксимальноеКоличествоЦиклов = Неопределено, DepartmentId = "") Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ИспользоватьПодсистемуДиадока() Тогда
		
		ТекстОшибки = НСтр("ru='Метод работает только на объектах подсистемы Диадок (ЭДО_Модуль_ОбработатьНовыеСобытияДокументов)'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ОписаниеОрганизации = Ядро.Организации_ЗаполненныеРеквизиты(Организация.Ссылка);
	
	Результат = Ядро.Лента_ОбработатьНовыеСобытияДокументов(
		ОписаниеОрганизации,
		МаксимальноеКоличествоЦиклов,
		DepartmentId);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_НовыйРезультатАнализаВходящегоДокумента() Экспорт
	
	Результат = Ядро.Новый_РезультатАнализаВходящегоДокумента();
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_Модуль_ОбновитьСписокДокументов(ПараметрыОбновленияСписка) Экспорт
	
	СписокДокументов.Очистить();
	
	ДокументыДляСписка = Ядро.СписокДокументов_Документы(ПараметрыОбновленияСписка);
	
	Ядро.СписокДокументов_ПоместитьВЛокальныйКэш(ДокументыДляСписка);
	
	НомерСтроки = 1;
	
	РежимыПостроенияСписка = Ядро.Перечисление_РежимыПостроенияСпискаДокументов();
	ЭтоСписокДокументовНаОтправку = (ПараметрыОбновленияСписка.Режим = РежимыПостроенияСписка.ОтправкаПакетов);
	
	Для Каждого СтрокаСписка Из ДокументыДляСписка Цикл
		
		Если ЭтоСписокДокументовНаОтправку
			И Ядро.СписокДокументов_ЭтоСтрокаВложенногоПакета(СтрокаСписка) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СписокДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСписка);
		НоваяСтрока.НомерСтроки = НомерСтроки;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("СписокДокументов",	СписокДокументов);
	ПараметрыПМ.Вставить("Режим",				ПараметрыОбновленияСписка.Режим);
	
	Ядро.ПодключаемыйМодуль_ОбработатьСобытие("ПослеОбновленияСпискаДокументов", ПараметрыПМ);
	
КонецПроцедуры

Процедура НайтиИСопоставитьДокументДД(ДокументЭДО, ПакетЭДО) Экспорт
	
	Документ = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	Ядро.Документы_СопоставитьДокумент(Документ);
	
КонецПроцедуры

// Типовой обработчик события "НайтиСопоставлениеДокумента"
//
// Параметры:
//  ДокументЭДО - Структура - электронный документ (см. Контракт_Документ)
//
// Возвращаемое значение:
//  Массив - коллекция документов учкета 1С
//
Функция НайтиСопоставлениеДокумента(ДокументЭДО) Экспорт
	
	Результат = Ядро.Интеграция_НайтиСопоставлениеДокумента(ДокументЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПровестиАнализВходящегоДокумента(ДокументЭДО, ПакетЭДО = Неопределено) Экспорт
	
	Документ	= Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	Результат	= Ядро.Документы_ПровестиАнализВходящегоДокумента(Документ);
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ПровестиАнализВходящегоПакета(ПакетЭДО) Экспорт
	
	Ядро.Документы_ПровестиАнализВходящегоПакета(ПакетЭДО);
	
КонецПроцедуры

Процедура ЭДО_ЗаполнитьХранилищеОтвета(ДокументОбъект, Данные) Экспорт
		
	ДокументОбъект.ХранилищеОтвета = Новый ХранилищеЗначения(Данные);

КонецПроцедуры

Процедура ЭДО_СохранитьОтветПоДокументу(ДокументЭДО, Вердикт, Ответ) Экспорт
	
	ДокументОбъект = ДокументЭДО.ПолучитьОбъект();
	
	ДокументОбъект.ТребуемоеДействиеВДД	= Вердикт;
	ДокументОбъект.ХранилищеОтвета = Новый ХранилищеЗначения(Ответ);
	
	ДокументОбъект.Записать();
	
КонецПроцедуры

Процедура ЭДО_УстановитьСтатусДокумента(ДокументЭДО, Статус) Экспорт
	
	Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	
	СтруктураРеквизитов = Новый Структура("Статус", Статус);
	
	Ядро.ХранениеДанных_ОбновлениеРеквизитовДокумента(Идентификаторы, СтруктураРеквизитов);
	
КонецПроцедуры

Процедура ЭДО_УстановитьДополнительныйСтатусДокумента(ДокументЭДО, ДополнительныйСтатус) Экспорт
	
	Идентификаторы = Новый_Идентификаторы(ДокументЭДО);
	
	СтруктураРеквизитов = Новый Структура("ДополнительныйСтатус", ДополнительныйСтатус);
	
	Ядро.ХранениеДанных_ОбновлениеРеквизитовДокумента(Идентификаторы, СтруктураРеквизитов);
	
КонецПроцедуры

Функция ЭДО_Перечисление_ВариантыОтветаПоДокументу() Экспорт
	
	Результат = Ядро.Перечисление_ВариантыОтветаПоДокументу();

	Возврат Результат;
	
КонецФункции

Функция ЭДО_Перечисление_СтатусыДокументов() Экспорт
	
	Результат = Ядро.Перечисление_СтатусыДокументов();

	Возврат Результат;
	
КонецФункции

Функция ЭДО_Перечисление_Направления() Экспорт
	
	Результат = Ядро.Перечисление_Направления();

	Возврат Результат;
	
КонецФункции

Функция СоздатьИСопоставитьДокументДД(ДокументЭДО, ПакетЭДО) Экспорт 
	
	Документ = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	
	ДокументыДляОбработки = Новый Массив;
	ДокументыДляОбработки.Добавить(Документ);
	
	ИдентификаторОперации = Неопределено;
	
	Результат = Ядро.Документы_СоздатьДокументы(ДокументыДляОбработки, ИдентификаторОперации);
	
	Возврат Результат;
	
КонецФункции

//}		ДЕЙСТВИЯ В 1С


//{		АВТОРИЗАЦИЯ

// Получает авторизационный токен по указанным логину и паролю
//
// Параметры:
//  Логин - Строка - логина пользователя
//  Пароль - Строка - пароль пользователя
// 
// Возвращаемое значение:
//  Строка - авторизационный токен.
//
Функция ЭДО_АвторизоватьсяПодЛогином(Логин, Пароль) Экспорт
	
	Результат = Ядро.Авторизация_ПоПаролю(Логин, Пароль);
	
	ОбработатьСобытияПослеАвторизации();
	
	Возврат Результат;
	
КонецФункции

// Авторизуется во всех ящиках, в настройках которых указан отпечаток сертификата, и заполняет контекст сеанса.
// Сертификаты должны быть доступны пользователю ОС, от имени которого запущено приложение (сервер приложений).
// 
// Возвращаемое значение:
//  Неопределено - метод объявлен как функция только для совместимости со старыми ПМ.
//
Функция ЭДО_АвторизоватьсяПодСертификатомНаСервере1С() Экспорт
	
	Ядро.Авторизация_ПодСертификатомНаСервере1С();
	
	ОбработатьСобытияПослеАвторизации();
	
	Возврат Неопределено;
	
КонецФункции

// Авторизуется по логину и паролю служебной учетной записи, указанными в
// настройках модуля, и заполняет контекст сеанса. Заполненный контекст
// можно получить методом ЭДО_КонтекстСеансаКлиентСервер.
// 
// Возвращаемое значение:
//  Булево - Истина, если в контекст сеанса добавлен хотя бы один ящик.
//           Ложь, если контекст не заполнен (у служебной учетки нет доступа ни в один ящик).
//
Функция ЭДО_ЗаполнитьКонтекстСеансаДляСлужебнойУчетнойЗаписи() Экспорт
	
	ОбщиеНастройки = Ядро.ХранениеДанных_ОбщиеНастройки();
	
	Логин = ОбщиеНастройки.СлужебнаяУчетнаяЗаписьЛогин;
	Пароль = ОбщиеНастройки.СлужебнаяУчетнаяЗаписьПароль;
	
	Токен = Ядро.Авторизация_ПоПаролю(Логин, Пароль);
	
	ОбработатьСобытияПослеАвторизации();
	
	КонтекстЗаполнен = Ядро.КонтекстСеанса_ДляСлужебнойУчетнойЗаписи();
	
	Возврат КонтекстЗаполнен;
	
КонецФункции

// Получает информацию о ящиках из контекста сеанса пользователя.
//
// Параметры:
//  ДобавитьНеоплаченные - Булево - Истина, если следует добавить сведения о ящиках без оплаченного тарифа.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - контекст сеанса:
//    * Ключ - Строка - адрес ящика (в формате <...@diadoc.ru>)
//    * Значение - ФиксированнаяСтруктура - см. Контракт_СтрокаКонтекстаСеанса
//
Функция ЭДО_КонтекстСеансаКлиентСервер(ДобавитьНеоплаченные = Ложь) Экспорт
	
	СлужебныйКонтекст = Ядро.КонтекстСеанса_СтрокиКонтекста(ДобавитьНеоплаченные);
	КонтекстСеанса = Новый Соответствие;
	
	Для Каждого КлючЗначение Из СлужебныйКонтекст Цикл
		
		Модель = Новый_СтрокаКонтекстаСеанса(КлючЗначение.Значение);
		АдресЯщика = ЭДО_Служебные_АдресЯщикаКонтрагента(КлючЗначение.Ключ);
		КонтекстСеанса.Вставить(АдресЯщика, Модель);
		
	КонецЦикла;
	
	Результат = ФиксированныеДанныеЛок(КонтекстСеанса);
	
	Возврат Результат;
	
КонецФункции

// Выполняет авторизацию в указанном ящике по сертификату и заполняет контекст сеанса.
// Сертификат должен быть установлен на сервере приложений и быть доступен пользователю ОС,
// от имени которого запущен рабочий процесс сервера приложений.
//
// Параметры:
//  BoxId - Строка - адрес или идентификатор ящика
//  Thumbprint - Строка - отпечаток сертификата
//
Процедура ЭДО_КонтекстСеансаКлиентСервер_Установить(Знач BoxId, Знач Thumbprint) Экспорт
	
	Ядро.КонтекстСеанса_Установить(BoxId, Thumbprint);
	
КонецПроцедуры

// Возвращает список локальных сертификатов пользователя ОС,
// от имени которого запущено приложение (сервер приложений)
// 
// Возвращаемое значение:
//  ФиксированныйМассив из Контракт_ОписаниеСертификата - список сертификатов.
//
Функция Сертификаты_СписокСертификатов() Экспорт
	
	Данные = Ядро.Сертификаты_СписокСертификатов();
	
	Ответ = Новый Массив;
	
	Для Каждого Элемент Из Данные Цикл
		
		Модель = Контракт_ОписаниеСертификата();
		ЗаполнитьЗначенияСвойств(Модель, Элемент);
		
		Ответ.Добавить(Модель);
		
	КонецЦикла;
	
	Результат = ФиксированныеДанныеЛок(Ответ);
	
	Возврат Результат;
	
КонецФункции

// Получает описание сессии текущего пользователя в указанном ящике.
// Если адрес ящика не указан, возвращается описание сессии служебной учетной записи.
//
// Параметры:
//  BoxId - Строка - идентификатор ящика или пустая строка для служебной учетной записи.
//  ВызыватьИсключение - Булево - Истина, если при отсутствии информации о сессии следует сгенерировать исключение.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. Контракт_СтрокаКонтекстаСеанса
//
Функция ЭДО_СтрокаКонтекстаСеанса(Знач BoxId, Знач ВызыватьИсключение = Ложь) Экспорт
	
	Данные = Ядро.КонтекстСеанса_СтрокаКонтекста(BoxId, ВызыватьИсключение);
	Модель = Новый_СтрокаКонтекстаСеанса(Данные);
	Результат = ФиксированныеДанныеЛок(Модель);
	
	Возврат Результат;
	
КонецФункции

// Формирует публичный контракт строки контекста сеанса
//
// Параметры:
//  Данные - Структура - см. Ядро.МодельСтрокаКонтекстаСеанса
// 
// Возвращаемое значение:
//  Структура - см. Контракт_СтрокаКонтекстаСеанса
//
Функция Новый_СтрокаКонтекстаСеанса(Данные)
	
	ИменаВложенныхСтруктур = Новый Массив;
	ИменаВложенныхСтруктур.Добавить("Box");
	ИменаВложенныхСтруктур.Добавить("Сертификат");
	ИменаВложенныхСтруктур.Добавить("ОписаниеПользователя");
	ИменаВложенныхСтруктур.Добавить("ДополнительныеФункции");
	ИменаВложенныхСтруктур.Добавить("СервисПодпискиНаМодуль");
	ИменаВложенныхСтруктур.Добавить("ЛицевыеСчета");
	
	ИсключаемыеСвойства = Общее_СоединитьСтроку(ИменаВложенныхСтруктур, ",");
	
	Модель = Контракт_СтрокаКонтекстаСеанса();
	ЗаполнитьЗначенияСвойств(Модель, Данные, , ИсключаемыеСвойства);
	
	Если ЗначениеЗаполнено(Данные.Box) Тогда
		Модель.Box = Контракт_ЯщикДиадока();
		ЗаполнитьЗначенияСвойств(Модель.Box, Данные.Box);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Сертификат) Тогда
		Модель.Сертификат = Контракт_ОписаниеСертификата();
		ЗаполнитьЗначенияСвойств(Модель.Сертификат, Данные.Сертификат);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ОписаниеПользователя) Тогда
		Модель.ОписаниеПользователя = Контракт_ОписаниеПользователяДиадока();
		ЗаполнитьЗначенияСвойств(Модель.ОписаниеПользователя, Данные.ОписаниеПользователя);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ДополнительныеФункции) Тогда
		Модель.ДополнительныеФункции = Контракт_НастройкиЯщикаДиадока();
		ЗаполнитьЗначенияСвойств(Модель.ДополнительныеФункции, Данные.ДополнительныеФункции);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.СервисПодпискиНаМодуль) Тогда
		Модель.СервисПодпискиНаМодуль = Новый_ДоступныйСервис(Данные.СервисПодпискиНаМодуль);
	КонецЕсли;
	
	ДанныеЛицевыхСчетов = Неопределено;
	Данные.Свойство("ЛицевыеСчета", ДанныеЛицевыхСчетов);
	
	Если ЗначениеЗаполнено(ДанныеЛицевыхСчетов) Тогда
		
		Для Каждого ДанныеЛицевогоСчета Из ДанныеЛицевыхСчетов Цикл
			
			НовыйЛицевойСчет = Контракт_ЛицевойСчет();
			
			НовыйЛицевойСчет.ЛицевойСчет = ДанныеЛицевогоСчета.ЛицевойСчет;
			НовыйЛицевойСчет.КодПродукта = ДанныеЛицевогоСчета.КодПродукта;
			
			Для Каждого ДанныеДоступногоСервиса Из ДанныеЛицевогоСчета.ДоступныеСервисы Цикл
				
				ДоступныйСервис = Новый_ДоступныйСервис(ДанныеДоступногоСервиса);
				НовыйЛицевойСчет.ДоступныеСервисы.Добавить(ДоступныйСервис);
				
			КонецЦикла;
			
			Модель.ЛицевыеСчета.Добавить(НовыйЛицевойСчет);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Модель;
	
КонецФункции

// Инициализирует описание сессии в ящике организации и добавляет его в контекст сеанса.
// Имена ключей структуры СтрокаКонтекстаСеанса должны соответствовать именам ключей
// публичной модели строки контекста сеанса (см .Контракт_СтрокаКонтекстаСеанса).
// Используемые ключи перечислены в описании параметров метода.
// Остальные ключи игнорируются.
//
// Параметры:
//  АдресЯщика - Строка - Адрес ящика в формате <...@diadoc.ru>.
//                        Для служебной учетной записи допускается пустая строка.
//  СтрокаКонтекстаСеанса - Структура, ФиксированнаяСтруктура - Параметры инициализации контекста
//   * Токен - Строка - Авторизационный токен (поддерживаются только токены DiadocAuth)
//   * Сертификат - Структура - (Необязательный) см. Контракт_ОписаниеСертификата
//
Процедура ЭДО_КонтекстСеансаКлиентСервер_Добавить(АдресЯщика, СтрокаКонтекстаСеанса) Экспорт
	
	Перем ТокенДоступа;
	Перем Сертификат;
	
	Если ТипЗнч(АдресЯщика) <> Тип("Строка") Тогда
		Ошибка =
		"Несоответствие типов: Параметр 'АдресЯщика' должен быть строкой!
		|Адрес ящика должен быть в формате <...@diadoc.ru> или пустой строкой (для служебной учетной записи)";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаКонтекстаСеанса) <> Тип("Структура")
		И ТипЗнч(СтрокаКонтекстаСеанса) <> Тип("ФиксированнаяСтруктура") Тогда
		Ошибка = "Несоответствие типов: Параметр 'СтрокаКонтекстаСеанса' должен быть структурой";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Если Не СтрокаКонтекстаСеанса.Свойство("Токен", ТокенДоступа) Тогда
		Ошибка = "Отсутствует обязательное поле 'СтрокаКонтекстаСеанса.Токен'";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТокенДоступа) Тогда
		Ошибка = "Не указан авторизационный токен (СтрокаКонтекстаСеанса.Токен)";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	СтрокаКонтекстаСеанса.Свойство("Сертификат", Сертификат);
	
	Сессия = Ядро.Новый_СессияДиадокНеизвестнаяСхема(ТокенДоступа);
	
	КонтекстЯщика = Ядро.СоздатьСтрокуКонтекстаСеанса(АдресЯщика, Сессия, Сертификат);
	
	Ядро.КонтекстСеанса_ДобавитьСтроку(АдресЯщика, КонтекстЯщика);
	
КонецПроцедуры

// Получает сведения о пользователях Диадока в указанном ящике
//
// Параметры:
//  BoxId - Строка - адрес или идентификатор ящика
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - содержит ключи:
//    * CurrentUserId - Строка - идентификатор текущего пользователя
//    * Users - ФиксированныйМассив из ФиксированнаяСтруктура - список пользователей:
//      ** Id - Строка - идентификатор пользователя
//      ** Name - Строка - ФИО пользователя
//      ** Position - Строка - должность пользователя
//      ** Permissions - ФиксированнаяСтруктура - права пользователя (см. OrganizationUserPermissions)
//
Функция ЭДО_СписокПользователейДиадока(BoxId) Экспорт
	
	// Устаревший метод GetOrganizationUsers (в сыром виде)
	Данные = Ядро.ПользователиОрганизации(BoxId);
	
	СписокПользователей = Новый Массив;
	
	Для Каждого Элемент Из Данные.Users Цикл
		
		Модель = Новый Структура;
		Модель.Вставить("Id", Элемент.Id);
		Модель.Вставить("Name", Элемент.Name);
		Модель.Вставить("Position", Элемент.Position);
		Модель.Вставить("Permissions", Элемент.Permissions); // OrganizationUserPermissions
		
		СписокПользователей.Добавить(Модель);
		
	КонецЦикла;
	
	Ответ = Новый Структура;
	Ответ.Вставить("CurrentUserId", Данные.CurrentUserId);
	Ответ.Вставить("Users", СписокПользователей);
	
	Результат = ФиксированныеДанныеЛок(Ответ);
	
	Возврат Результат;
	
КонецФункции

// (Устарела) Получает авторизационный токен по отпечатку сертификата и возвращает сведения о соединении.
// Сертификат должен быть установлен на сервере приложений и быть доступен пользователю ОС,
// от имени которого запущен рабочий процесс сервера приложений.
//
// Параметры:
//  ОтпечатокСертификата - Строка - отпечаток сертификата
//  НаименованиеОрганизации - Строка - (Необязательный) представление организации, в ящик которой предоставляется доступ
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - содержит ключи:
//   * Токен - Строка - токен доступа
//   * ТипАвторизации - Строка - значение "Сертификат"
//   * ОтпечатокСертификата - Строка - отпечаток сертификата
//   * Сертификат - ФиксированнаяСтруктура - см. Контракт_ОписаниеСертификата
//   * СертификатBase64 - Строка - двоичные данные сертификата в формате Base64
//   * Логин - Строка - всегда пустая строка (для совместимости)
//
Функция ЭДО_СоздатьОбъектСоединенияПоСертификату(Знач ОтпечатокСертификата, Знач НаименованиеОрганизации = "") Экспорт
	
	ОтпечатокСертификата = ВРег(ОтпечатокСертификата);
	
	Токен = Ядро.Авторизация_СоединенияПоСертификату(ОтпечатокСертификата, НаименованиеОрганизации);
	
	ДанныеСертификата = Ядро.Сертификаты_ДанныеСертификата(ОтпечатокСертификата);
	
	ОписаниеСертификата = Ядро.Сертификаты_ОписаниеСертификата(ДанныеСертификата);
	Сертификат = Контракт_ОписаниеСертификата();
	ЗаполнитьЗначенияСвойств(Сертификат, ОписаниеСертификата);
	
	Модель = Новый Структура;
	Модель.Вставить("Токен", Токен);
	Модель.Вставить("ТипАвторизации", "Сертификат");
	Модель.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
	Модель.Вставить("Сертификат", Сертификат);
	Модель.Вставить("СертификатBase64", Base64Строка(ДанныеСертификата.ДвоичныеДанные));
	Модель.Вставить("Логин", "");
	
	Результат = ФиксированныеДанныеЛок(Модель);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьСобытияПослеАвторизации()
	
	Ядро.ТипыДокументовAPI_ПроверитьНаличие();
	
	Если ИспользоватьПодсистемуДиадока() Тогда
		Ядро.ВнешнееХранение_ВыполнитьОчисткуУстаревшихДокументов();
	КонецЕсли;
	
КонецПроцедуры

//}		АВТОРИЗАЦИЯ


//{		МЧД

// Контракт данных МЧД
//
// Возвращаемое значение:
//  Структура:
//    * Идентификатор - Строка - Регистрационный номер МЧД.
//    * ДоверительИНН - Строка - ИНН организации, которая выдала доверенность
//    * ПредставительИНН - Строка - ИНН уполномоченного лица на которого выдана доверенность
//
Функция Контракт_МЧД() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ДоверительИНН", "");
	Результат.Вставить("ПредставительИНН", "");
	
	Возврат Результат;
	
КонецФункции

// Заполняет служебный контекст МЧД для подписания документов.
// ВАЖНО после выполнения необходимых действий НЕ ЗАБЫТЬ выполнить метод ОчиститьДанныеМЧД()
//
// Параметры:
//  BoxId - Строка - Идентификатор ящика
//  ДанныеМЧД - Структура - см. функцию Контракт_МЧД()
//
Процедура ЗаполнитьДанныеМЧД(BoxId, ДанныеМЧД) Экспорт
	
	Ядро.МЧД_ЗаполнитьДанныеМЧДИзПодключаемогоМодуля(BoxId, ДанныеМЧД);
	
КонецПроцедуры

// Очищает служебный контекст МЧД для подписания документов
//
Процедура ОчиститьДанныеМЧД() Экспорт
	
	Ядро.МЧД_ОчиститьДанныеМЧДИзПодключаемогоМодуля();
	
КонецПроцедуры

//}		МЧД


//{		ДЕЙСТВИЯ API

Функция API_GetDocument(BoxId, LetterId, DocumentId) Экспорт
	
	ПараметрыСервиса = Ядро.ПараметрыСервиса_Диадок(BoxId);
	Результат = Ядро.АПИ_GetDocument(ПараметрыСервиса, BoxId, LetterId, DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Транспорт_ВызватьМетодAPI(АдресМетода,
										Метод,
										ТелоЗапроса = "",
										ОтветВДвоичныхДанных = Ложь,
										boxId = "",
										ТолькоРезультатОтвета = Истина,
										Параметры = Неопределено) Экспорт
	
	Модуль_ВнешниеСервисы = Ядро.Модуль_ВнешниеСервисы(Ядро);
	ПараметрыЗапроса = Модуль_ВнешниеСервисы.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = Метод;
	ПараметрыЗапроса.АдресМетода = АдресМетода;
	ПараметрыЗапроса.ТелоЗапроса = ТелоЗапроса;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = ОтветВДвоичныхДанных;
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		Для Каждого Параметр Из Параметры Цикл
			ПараметрыЗапроса.Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыСервиса = Ядро.ПараметрыСервиса_Диадок(BoxId);
	ТекстЗаголовка = Ядро.Модуль_МетодыAPI(ЭтотОбъект).ЗаголовокАвторизацииДиадок(ПараметрыСервиса);
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", ТекстЗаголовка);
	
	ОтветHTTP = Модуль_ВнешниеСервисы.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ТипЗнч(ОтветHTTP) = Тип("Структура")
		И ОтветHTTP.Свойство("ТелоОтвета") Тогда
		Результат = ОтветHTTP.ТелоОтвета;
	Иначе
		Результат = ОтветHTTP;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Транспорт_РазобратьОтветAPI(ОтветHTTP) Экспорт
	
	Модуль_ПарсерJSON = Ядро.Модуль_ПарсерJSON(Ядро);
	Результат = Модуль_ПарсерJSON.Прочитать(ОтветHTTP);
	
	Если ТипЗнч(Результат) <> Тип("Строка")
		И ТипЗнч(Результат) <> Тип("Структура") Тогда
		Результат = ОтветHTTP;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Транспорт_КлючРазработчикаAPI() Экспорт
	
	Результат = Ядро.ОбщийКонтекстКлиентСервер.КлючРазработчика;
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Транспорт_АдресAPI() Экспорт
	
	Результат = Ядро.АПИ_АдресDiadocAPI();
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetBox(BoxId) Экспорт
	
	ПараметрыСервиса	= Ядро.ПараметрыСервиса_Диадок(BoxId);
	Результат			= Ядро.АПИ_GetBox(ПараметрыСервиса, BoxId);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetOrganizationUsers(orgId, BoxId) Экспорт
	
	Результат = Ядро.ПользователиОрганизации(BoxId);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetResolutionRoutesForOrganization(OrgId, BoxId) Экспорт
	
	ПараметрыСервиса	= Ядро.ПараметрыСервиса_Диадок(BoxId);
	Результат			= Ядро.АПИ_GetResolutionRoutesForOrganization2(ПараметрыСервиса, OrgId);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_Gettoken(РежимАвторизации, Логин = "", Пароль = "", Сертификат = Неопределено) Экспорт
	
	Если НРег(РежимАвторизации) = НРег("Пароль") Тогда
		
		Результат = Ядро.Авторизация_ПоПаролю(Логин, Пароль);
		
	ИначеЕсли НРег(РежимАвторизации) = НРег("Сертификат") Тогда
		
		Результат = Ядро.Авторизация_ПоСертификату(Сертификат);
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_ПолучитьПолномочияПодписанта(BoxID, ВидДокумента, ПокупательПродавец, Знач ОтпечатокСертификата = Неопределено) Экспорт
	
	ОписаниеПолномочийПодписанта = Ядро.ПолномочияПодписанта_Получить(BoxID, ВидДокумента, ПокупательПродавец, ОтпечатокСертификата);
	
	Результат = ОписаниеПолномочийПодписанта.Данные;
	
	Возврат Результат;
	
КонецФункции
  
// Сохраняет полномочия подписанта получателя
//
// Параметры:
//  BoxID				 - Строка	 - Идентификатор ящика
//  ВидДокумента		 - Строка	 - Utd, Utd820, Ucd, Ucd736, TovTorg551, AccCert552
//  ПолномочияПодписанта - Структура - описание полномочией подписанта (см. https://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSignerDetailsToPost.html)
//		* SignerType 				- Строка - Тип подписанта. Обязательное (варианты значений см. в документации)
//		* SignerPowers 				- Строка - Область полномочий. Обязательное (варианты значений см. в документации)
//		* SignerStatus 				- Строка - Статус подписанта. Обязательное (варианты значений см. в документации)
//		* JobTitle	 				- Строка - Должность
//		* SignerPowersBase  		- Строка - Основание полномочий (доверия)
//		* SignerOrgPowersBase  		- Строка - Основание полномочий (доверия) организации
//		* SignerInfo  				- Строка - Иные сведения, идентифицирующие физическое лицо
//		* RegistrationCertificate	- Строка - Реквизиты свидетельства о гос. регистрации индивидуального предпринимателя
//  ОтпечатокСертификата - Строка	 - Отпечаток сертификата. Необязательный. Если не указан, берется отпечаток сертификата, указанный в настройках модуля
// 
// Пример:
//
//	ОсновнойМодуль.DD_API_СохранитьПолномочияПодписантаПолучателя(BoxID, "TovTorg551", НовыеПолномочия, ОтпечатокСертификата)...	
// 
Процедура DD_API_СохранитьПолномочияПодписантаПолучателя(BoxID, ВидДокумента, ПолномочияПодписанта, Знач ОтпечатокСертификата = Неопределено) Экспорт
	
	ПокупательИлиПродавец = "Покупатель";
	
	Ядро.ПолномочияПодписанта_Сохранить(BoxID, ВидДокумента, ПокупательИлиПродавец, ПолномочияПодписанта, ОтпечатокСертификата);
	
КонецПроцедуры

// Сохраняет полномочия подписанта отправителя
//
// Параметры:
//  BoxID				 - Строка	 - Идентификатор ящика
//  ВидДокумента		 - Строка	 - Utd, Utd820, Ucd, Ucd736, TovTorg551, AccCert552
//  ПолномочияПодписанта - Структура - описание полномочией подписанта (см. https://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSignerDetailsToPost.html)
//		* SignerType 				- Строка - Тип подписанта. Обязательное (варианты значений см. в документации)
//		* SignerPowers 				- Строка - Область полномочий. Обязательное (варианты значений см. в документации)
//		* SignerStatus 				- Строка - Статус подписанта. Обязательное (варианты значений см. в документации)
//		* JobTitle	 				- Строка - Должность
//		* SignerPowersBase  		- Строка - Основание полномочий (доверия)
//		* SignerOrgPowersBase  		- Строка - Основание полномочий (доверия) организации
//		* SignerInfo  				- Строка - Иные сведения, идентифицирующие физическое лицо
//		* RegistrationCertificate	- Строка - Реквизиты свидетельства о гос. регистрации индивидуального предпринимателя
//  ОтпечатокСертификата - Строка	 - Отпечаток сертификата. Необязательный. Если не указан, берется отпечаток сертификата, указанный в настройках модуля
// 
// Пример:
//
//	ОсновнойМодуль.DD_API_СохранитьПолномочияПодписантаПолучателя(BoxID, "TovTorg551", НовыеПолномочия, ОтпечатокСертификата)...	
// 
Процедура DD_API_СохранитьПолномочияПодписантаОтправителя(BoxID, ВидДокумента, ПолномочияПодписанта, Знач ОтпечатокСертификата = Неопределено) Экспорт
	
	ПокупательИлиПродавец = "Продавец";
	
	Ядро.ПолномочияПодписанта_Сохранить(BoxID, ВидДокумента, ПокупательИлиПродавец, ПолномочияПодписанта, ОтпечатокСертификата);
	
КонецПроцедуры

//}		ДЕЙСТВИЯ API


//{		ПЕЧАТНАЯ ФОРМА
	
Функция ЭДО_ПолучитьПечатнуюФормуЭлектронногоДокумента(ДокументЭДО) Экспорт
	
	Документ = Ядро.Документы_СохраненныйДокумент(ДокументЭДО);
	
	Результат = Ядро.Документы_ПечатнаяФормаПоДокументу(Документ);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьПечатнуюФормуПоКонтенту(ПротоКонтент, ТипКонтента, ТипДокумента) Экспорт
	
	Документ = Ядро.Контракт_Документ();
	
	Документ.Тип.ТипДокумента	= ТипДокумента;
	Документ.Тип.ТипКонтента	= ТипКонтента;
	
	Документ.СлужебнаяИнформация.Вставить("Контент", ПротоКонтент);
	
	Результат = Ядро.Документы_ПечатнаяФормаПоКонтенту(Документ);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьПечатнуюФормуДокументаПоСсылке(ДокументЭДО) Экспорт
	
	Результат = ЭДО_ПолучитьПечатнуюФормуДокумента(ДокументЭДО.BoxId, ДокументЭДО.LetterId, ДокументЭДО.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ПолучитьПечатнуюФормуДокумента(BoxId, LetterId, DocumentId) Экспорт
	
	Идентификаторы = Новый_Идентификаторы(, , BoxId, LetterId, DocumentId);
	
	Результат = Ядро.Документы_ПечатнаяФормаСервераДиадок(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

//}		ПЕЧАТНАЯ ФОРМА


//{		ИоПы

Функция ЭДО_ПодготовитьИзвещенияОПолучении() Экспорт
	
	Результат = Ядро.ИоП_ПодготовитьИзвещенияОПолучении();
	
	Возврат Результат;
	
КонецФункции

Процедура ЭДО_ПодписатьИзвещенияОПолучении(ИоПы) Экспорт
	
	Ядро.ИоП_ПодписатьИзвещенияОПолучении(ИоПы);
	
КонецПроцедуры

Процедура ЭДО_ОтправитьПодписанныеИзвещенияОПолучении(ИоПы) Экспорт
	
	Ядро.ИоП_ОтправитьИзвещенияОПолучении(ИоПы);
	
КонецПроцедуры

//}		ИоПы

//{		Универсальные сообщения

// Получает двоичные данные xml-файл отказа в подписании документа или предложения для аннулирования.
//
// Параметры:
//  Идентификаторы	 - Структура	- содержит идентификаторы сущности, для которой генерируется отказ
//  ПричинаОтказа	 - Строка	 	- причина отказа в подписи
//  Отправитель		 - Структура	- данные отправителя (Фамилия, Имя, Отчество)
// 
// Возвращаемое значение:
//   - ДвоичныеДанные
//
Функция ЭДО_СгенерироватьФайлОтказа(Идентификаторы, ПричинаОтказа = Неопределено, Отправитель = Неопределено) Экспорт
	
	BoxId = Идентификаторы.BoxId;
	MessageId = Идентификаторы.MessageId;
	EntityId = Идентификаторы.EntityId;
	
	ФормироватьУС = Ядро.УС_ДоступноФормированиеУниверсальныхСообщений(BoxId);
	
	Если ФормироватьУС = Неопределено Тогда
		
		ОтпечатокСертификата = Идентификаторы.ОтпечатокСертификата;
		Результат = Ядро.Документы_ДанныеОтказаВПодписании(Идентификаторы, ОтпечатокСертификата, ПричинаОтказа);
		
	ИначеЕсли ФормироватьУС = Истина Тогда
		
		ДанныеСообщения = Ядро.Контракт_ДанныеУниверсальногоСообщения();
		
		ДанныеСообщения.Код = Ядро.Перечисление_КодыУниверсальногоСообщения().ОтказВПодписи;
		ДанныеСообщения.ТекстСообщения = ПричинаОтказа;
		
		Если ТипЗнч(Отправитель) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ДанныеСообщения.Отправитель, Отправитель);
		Иначе
			Ядро.УС_ЗаполнитьДанныеОтправителяПоКонтексту(BoxId, ДанныеСообщения);
		КонецЕсли;
		
		Результат = Ядро.УС_УниверсальноеСообщение(BoxId, MessageId, EntityId, ДанныеСообщения);
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает контракт участника обмена универсальными сообщениями
// 
// Возвращаемое значение:
//   - Структура
//
Функция Контракт_УчастникОбменаУниверсальнымиСообщениями() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Фамилия");
	Результат.Вставить("Имя");
	Результат.Вставить("Отчество");
	Результат.Вставить("Должность");
	
	Возврат Результат;
	
КонецФункции

//}		Универсальные сообщения

//{		ОБЕРТКИ

Функция ИспользоватьПодсистемуДиадока() Экспорт
	
	Результат = Ядро.ИспользоватьПодсистемуДиадока();
	
	Возврат Результат;
	
КонецФункции

Функция Пакеты_ДокументыПакетов(Идентификаторы) Экспорт
	
	ИдентификаторыПакетов = Новый Массив;
	ИдентификаторыПакетов.Добавить(Идентификаторы);
	
	Результат = Ядро.Пакеты_ДокументыПакетов(ИдентификаторыПакетов);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновлениеРеквизитовДокумента(Идентификаторы, Документ1С) Экспорт
	
	ОбновляемыеРеквизиты = Новый Структура("ДокументУчета", Документ1С);
	
	Ядро.ХранениеДанных_ОбновлениеРеквизитовДокумента(Идентификаторы, ОбновляемыеРеквизиты);
	
КонецПроцедуры	

Функция СопоставленнаяОрганизацияВ1С(BoxId) Экспорт
	
	Идентификаторы	= Ядро.Новый_ИдентификаторыСправочника(, BoxId);
	Результат		= Ядро.ХранениеДанных_СопоставленнаяОрганизацияВ1С(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции	

Процедура Пакеты_Маршрутизация(СтрокаСписка, ПараметрыСогласования) Экспорт
	
	Пакет = Ядро.Пакеты_ПодготовитьПакетДляОтправки(СтрокаСписка);
	
	Для Каждого ОписаниеДокумента Из Пакет.Документы Цикл
		ОписаниеДокумента.СлужебнаяИнформация.Вставить("Маршрутизация", ПараметрыСогласования);
	КонецЦикла;
	
	Ядро.Пакеты_ОтправитьИСохранить(Пакет);
	
КонецПроцедуры

Процедура Документы_ОтправитьОтветНаВходящий(Документ) Экспорт
	
	Ядро.Документы_ОтправитьОтветНаВходящий(Документ);
	
КонецПроцедуры	

Функция ДокументИзДанныхСтрокиТЧ(СтрокаСписка) Экспорт
	
	Результат = Ядро.Документ_ДокументИзДанныхСтрокиСписка(СтрокаСписка);
	
	Возврат Результат;
	
КонецФункции

Процедура Сохранение_СохранитьДокументы(ДокументыДляОбработки) Экспорт
	
	Ядро.Сохранение_СохранитьДокументы(ДокументыДляОбработки, Истина);
	
КонецПроцедуры	

Функция Организации_ЗаполненныеРеквизиты(Ссылка = Неопределено, BoxId = "") Экспорт
	
	Идентификаторы = Ядро.Новый_ИдентификаторыСправочника(Ссылка, BoxId);
	
	Результат = Ядро.Организации_ЗаполненныеРеквизиты(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

Функция Контрагенты_ЗаполненныеРеквизиты(Ссылка = Неопределено, BoxId = "") Экспорт
	
	Идентификаторы = Ядро.Новый_ИдентификаторыСправочника(Ссылка, BoxId);
	
	Результат = Ядро.Контрагенты_ЗаполненныеРеквизиты(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

Функция Лента_ОбработатьНовыеСобытияДокументов_v3(Организация, МаксимальноеКоличествоЦиклов = 1) Экспорт
	
	Результат = Ядро.Лента_ОбработатьНовыеСобытияДокументов(Организация, МаксимальноеКоличествоЦиклов);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_НастройкиСертификатовНаСервере1С() Экспорт 
	
	Результат = Ядро.ХранениеДанных_НастройкиСертификатовНаСервере1С();
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Служебные_КонтурПлагин() Экспорт 
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата) Экспорт 
	
	Модуль_ВнешниеСервисы = Ядро.Модуль_ВнешниеСервисы(Ядро);
	Результат = Модуль_ВнешниеСервисы.Плагин_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	Возврат Результат;
	
КонецФункции

// Возвращает информацию о подписанте из двоичных данных подписи
//
// Параметры:
//  ДвоичныеДанныеПодписи	 - 	ДвоичныеДанные - двоичные данные подписи
// 
// Возвращаемое значение:
//  Структура:
//   *Организация	 - Строка
//   *Подписант		 - Строка
//   *Должность		 - Строка
//
Функция ДанныеПодписантаИзПодписи(ДвоичныеДанныеПодписи) Экспорт 
	
	Результат = Ядро.ДанныеПодписантаИзПодписи(Base64Строка(ДвоичныеДанныеПодписи));
	Возврат Результат;
	
КонецФункции
        
Процедура ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий) Экспорт
	
	Ядро.ХранениеДанных_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);
	
КонецПроцедуры
  
Процедура ЭДО_ОбновитьКомментарийДокументаУчета(Документ, Документ1СОбъект = Неопределено) Экспорт
	
	Ядро.Документы_ОбновитьКомментарийДокументаУчета(Документ, Документ1СОбъект);
	
КонецПроцедуры

Функция ЭДО_Новый_ИдентификаторыСправочника(Ссылка = Неопределено, ID = "") Экспорт
	
	Результат = Ядро.Новый_ИдентификаторыСправочника(Ссылка, ID);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Организации_СопоставленныеВ1С(Идентификаторы) Экспорт
	
	Результат = Ядро.Организации_СопоставленныеВ1С(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы) Экспорт
	
	Результат = Ядро.Контрагенты_СопоставленныеВ1С(Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Значение тега НалСт из XML
//  или значение TaxRate (см. ГенерацияXML.Перечисление_TaxRate)
// 
// Возвращаемое значение:
//  СправочникСсылка, ПеречислениеСсылка, Неопределено - Прикладное значение ставки НДС
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция ЭДО_ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	ЕстьИнтеграционныйМодуль = ИспользуетсяИнтеграционныйМодуль();
	
	ИспользоватьПеречислениеСтавокДиадок = (НЕ ЕстьИнтеграционныйМодуль
		И Метаданные.Перечисления.Найти("СтавкиНДС") <> Неопределено
		И Метаданные.Справочники.Найти("СтавкиНДС") = Неопределено);
	
	TaxRate = ЗначениеTaxRate(ПредставлениеСтавки);
	
	Если ЗначениеЗаполнено(TaxRate)
		И ЕстьИнтеграционныйМодуль Тогда
		
		Результат = Ядро.МенеджерИнтеграции_ЗначениеСтавкиНДС(TaxRate);
		
	ИначеЕсли ЗначениеЗаполнено(TaxRate)
		И ИспользоватьПеречислениеСтавокДиадок Тогда
		
		Результат = ЗначениеСтавкиНДСИзПеречисления(TaxRate);
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - СправочникСсылка, ПеречислениеСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка, Неопределено - Представление ставки НДС (возможные значения см. ГенерацияXML.Перечисление_TaxRate)
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция ЭДО_ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	ЕстьИнтеграционныйМодуль = ИспользуетсяИнтеграционныйМодуль();
	
	ИспользоватьПеречислениеСтавокДиадок = (НЕ ЕстьИнтеграционныйМодуль
		И Метаданные.Перечисления.Найти("СтавкиНДС") <> Неопределено
		И Метаданные.Справочники.Найти("СтавкиНДС") = Неопределено);
	
	Если ЕстьИнтеграционныйМодуль Тогда
		
		Результат = Ядро.МенеджерИнтеграции_ПредставлениеСтавкиНДС(ЗначениеСтавки);
		
	ИначеЕсли ИспользоватьПеречислениеСтавокДиадок Тогда
		
		Результат = ПредставлениеСтавкиНДСИзПеречисления(ЗначениеСтавки);
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеСтавкиНДСИзПеречисления(ПредставлениеСтавки)
	
	СтавкиНДСДиадок = Новый Соответствие;
	
	СтавкиНДСДиадок.Вставить(НРег("ИсчНалАг"), "НДС исчисляется налоговым агентом");
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС0") Тогда
		СтавкиНДСДиадок.Вставить("0", Перечисления.СтавкиНДС.НДС0);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		СтавкиНДСДиадок.Вставить("5", Перечисления.СтавкиНДС.НДС5);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		СтавкиНДСДиадок.Вставить("7", Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС10") Тогда
		СтавкиНДСДиадок.Вставить("10", Перечисления.СтавкиНДС.НДС10);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС18") Тогда
		СтавкиНДСДиадок.Вставить("18", Перечисления.СтавкиНДС.НДС18);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС20") Тогда
		СтавкиНДСДиадок.Вставить("20", Перечисления.СтавкиНДС.НДС20);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		СтавкиНДСДиадок.Вставить("22", Перечисления.СтавкиНДС.НДС22);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		СтавкиНДСДиадок.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		СтавкиНДСДиадок.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС10_110") Тогда
		СтавкиНДСДиадок.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС18_118") Тогда
		СтавкиНДСДиадок.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС20_120") Тогда
		СтавкиНДСДиадок.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		СтавкиНДСДиадок.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("БезНДС") Тогда
		СтавкиНДСДиадок.Вставить(НРег("БезНДС"), Перечисления.СтавкиНДС.БезНДС);
	КонецЕсли;
	
	Результат = СтавкиНДСДиадок.Получить(ПредставлениеСтавки);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиНДСИзПеречисления(СтавкаНДС)
	
	НаименованияСтавок = Новый Соответствие;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС0") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС0, "0");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС10") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС10, "10");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС18") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС18, "18");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС20") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС20, "20");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС10_110") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС18_118") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС20_120") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("БезНДС") Тогда
		НаименованияСтавок.Вставить(Перечисления.СтавкиНДС.БезНДС, "без НДС");
	КонецЕсли;
	
	Результат = НаименованияСтавок.Получить(СтавкаНДС);
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетЗначениеПеречисленияСтавкиНДС(ИмяЗначенияСтавкаНДС)
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	Результат = (ЗначенияПеречисления.Найти(ИмяЗначенияСтавкаНДС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеTaxRate(Знач ПредставлениеСтавкиНДС)
	
	ПредставлениеСтавкиНДС = ВРег(ПредставлениеСтавкиНДС);
	
	СтавкиTaxRate = Перечисление_TaxRate();
	
	// BSLLS:DeprecatedFind-off
	Если ПредставлениеСтавкиНДС = "0" ИЛИ ПредставлениеСтавкиНДС = "0%" Тогда
		Результат = СтавкиTaxRate.TaxRate_0;
	ИначеЕсли Найти("5#5%", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_5;
	ИначеЕсли Найти("7#7%", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_7;
	ИначеЕсли Найти("10#10%", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_10;
	ИначеЕсли Найти("18#18%", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_18;
	ИначеЕсли Найти("20#20%", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_20;
	ИначеЕсли Найти("22#22%", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_22;
	ИначеЕсли Найти("5/105", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_5_105;
	ИначеЕсли Найти("7/107", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_7_107;
	ИначеЕсли Найти("10/110", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_10_110;
	ИначеЕсли Найти("18/118", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_18_118;
	ИначеЕсли Найти("20/120", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_20_120;
	ИначеЕсли Найти("22/122", ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.TaxRate_22_122;
	ИначеЕсли Найти(ВРег("без НДС"), ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.БезНДС;
	ИначеЕсли Найти(ВРег("НДС исчисляется налоговым агентом#ИсчНалАг"), ПредставлениеСтавкиНДС) > 0 Тогда
		Результат = СтавкиTaxRate.ИсчНалАг;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	// BSLLS:DeprecatedFind-on
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_TaxRate()
	
	ЗначенияСтавок = Новый Структура;
	ЗначенияСтавок.Вставить("TaxRate_0", "0");
	ЗначенияСтавок.Вставить("TaxRate_5", "5");
	ЗначенияСтавок.Вставить("TaxRate_7", "7");
	ЗначенияСтавок.Вставить("TaxRate_10", "10");
	ЗначенияСтавок.Вставить("TaxRate_18", "18");
	ЗначенияСтавок.Вставить("TaxRate_20", "20");
	ЗначенияСтавок.Вставить("TaxRate_22", "22");
	ЗначенияСтавок.Вставить("TaxRate_5_105", "5/105");
	ЗначенияСтавок.Вставить("TaxRate_7_107", "7/107");
	ЗначенияСтавок.Вставить("TaxRate_10_110", "10/110");
	ЗначенияСтавок.Вставить("TaxRate_18_118", "18/118");
	ЗначенияСтавок.Вставить("TaxRate_20_120", "20/120");
	ЗначенияСтавок.Вставить("TaxRate_22_122", "22/122");
	ЗначенияСтавок.Вставить("БезНДС", "без НДС");
	ЗначенияСтавок.Вставить("ИсчНалАг", "ИсчНалАг");
	
	Результат = Новый ФиксированнаяСтруктура(ЗначенияСтавок);
	
	Возврат Результат;
	
КонецФункции

// Заполняет данные маркировки в контенте электронного документа.
// Использование подсистемы ИСМП или КонтурМаркировка определяется настройкой "КонтурДиадокРаботаСМаркировкой".
// 
// Использование продукта КонтурМаркировка поддержано для конфигураций, с которыми совместим продукт
// КонтурМаркировка. Минимальная совместимая версия продукта КонтурМаркировка 1.10.
// 
// Использование подсистемы ИСМП поддержано для типовых конфигураций, с которыми совместим модуль.
// Исключение: конфигурации без подсистемы ИСПМ (например, Автосалон+Автосервис+Автозапчасти).
//
// Параметры:
//  Контент - Структура, ОбъектXDTO - Контент электронного документа
//  ОписаниеТипаКонтента - Структура, ФиксированнаяСтруктура - см. Контракт_ТипЭлектронногоДокумента
//                                                             или Контракт_ВидЭлектронногоДокумента
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура Маркировка_ЗаполнитьКоды(Контент, ОписаниеТипаКонтента) Экспорт
	
	ИмяМетода = "Маркировка_ЗаполнитьКоды";
	
	ТипыЗначенийКонтентаЭД = Новый Массив;
	ТипыЗначенийКонтентаЭД.Добавить(Тип("Структура"));
	ТипыЗначенийКонтентаЭД.Добавить(Тип("ОбъектXDTO"));
	
	ТипыЗначенийОписанияКонтентаЭД = Новый Массив;
	ТипыЗначенийОписанияКонтентаЭД.Добавить(Тип("Структура"));
	ТипыЗначенийОписанияКонтентаЭД.Добавить(Тип("ФиксированнаяСтруктура"));
	
	_ПроверитьПараметр(
		ИмяМетода,
		"Контент",
		Контент,
		ТипыЗначенийКонтентаЭД
	);
	
	_ПроверитьПараметр(
		ИмяМетода,
		"ОписаниеТипаКонтента",
		ОписаниеТипаКонтента,
		ТипыЗначенийОписанияКонтентаЭД
	);
	
	ЭтоКонтентXDTO = Ложь;
	КонтентСтруктура = Контент;
	Если ТипЗнч(Контент) = Тип("ОбъектXDTO") Тогда
		
		ЭтоКонтентXDTO = Истина;
		
		КонтентСтруктура = ОбъектXDTOВСтруктуру(Контент);
		
	КонецЕсли;
	
	МодульРаботаСМаркировкой = Ядро.Модуль_РаботаСМаркировкой();
	
	ТипЭД = ФорматыЭД_ТипЭлектронногоДокумента(ОписаниеТипаКонтента);
	ТипыКонтента = Ядро.Перечисление_ТипыКонтентов();
	
	Если ТипЭД.ТипКонтента = ТипыКонтента.utd970 Тогда
		
		СтрокиКонтента = КонтентСтруктура.Table.Items;
		ПроверитьСлужебнуюИнформациюТоварнойЧасти(СтрокиКонтента);
		
		МодульРаботаСМаркировкой.ЗаполнитьСведенияОМаркировке970(КонтентСтруктура);
		
		Если ЭтоКонтентXDTO Тогда
			
			Контент.Table.Items.Очистить();
			
			Для Каждого СтрокаКонтента Из КонтентСтруктура.Table.Items Цикл
				
				НовыйItems970 = НовыйЭлементСпискаXDTO(Контент.Table.Items);
				ЗаполнитьКонтентXDTOПоСтруктуре(НовыйItems970, СтрокаКонтента);
				
			КонецЦикла;
			
			ВидыТоваровДокументаПослеМаркировки = КонтентСтруктура.СлужебнаяИнформация.ContentsDocumentProductsType;
			
			ВидыТоваровДокумента = Контент.СлужебнаяИнформация.ContentsDocumentProductsType;
			
			ВидыТоваровДокумента.ContainsMarkedProducts = ВидыТоваровДокументаПослеМаркировки.ContainsMarkedProducts;
			ВидыТоваровДокумента.ContainsAlcoholeProducts = ВидыТоваровДокументаПослеМаркировки.ContainsAlcoholeProducts;
			ВидыТоваровДокумента.ContainsTobaccoProducts = ВидыТоваровДокументаПослеМаркировки.ContainsTobaccoProducts;
			
		КонецЕсли;
		
	Иначе
		
		ШаблонОшибки = НСтр("ru='Тип контента %1 не поддержан в библиотеке работы с маркировкой'");
		ТекстОшибки = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
			ШаблонОшибки,
			ОписаниеТипаКонтента.ТипКонтента
		);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСлужебнуюИнформациюТоварнойЧасти(СтрокиКонтента)
	
	НомерСтроки = 1;
	Для Каждого СтрокаКонтента Из СтрокиКонтента Цикл
		
		ЕстьДокументОтгрузки = ЗначениеЗаполнено(СтрокаКонтента.СлужебнаяИнформация.ДокументОтгрузки);
		ЕстьНоменклатура = ЗначениеЗаполнено(СтрокаКонтента.СлужебнаяИнформация.Номенклатура);
		
		Если НЕ ЕстьДокументОтгрузки
			ИЛИ НЕ ЕстьНоменклатура Тогда
			
			ШаблонОшибки = НСтр("ru='Нет ссылки на документ отгрузки или номенклатуру в строке %1 товарной части контента'");
			ТекстОшибки = ЭДО_Служебные_ПодставитьПараметрыВСтроку(
				ШаблонОшибки,
				НомерСтроки
			);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполнет паузу в секундах
//
// Параметры:
//  ДлительностьВСекундах - Число - количество секунд паузы.
//
// @ПубличныйПрограммныйИнтерфейс
//
Процедура ЭДО_Служебные_ТаймаутЛок(ДлительностьВСекундах) Экспорт
	
	Ядро.Таймаут(ДлительностьВСекундах);
	
КонецПроцедуры

// Получает сведения о машиночитаемой доверенности, выбранной для указанного ящика.
//
// Параметры:
//  BoxId - Строка - адрес или идентификатор ящика.
// 
// Возвращаемое значение:
//  Структура - описание доверенности (см. Контракт_МЧД)
//  Неопределено - если МЧД нет или она не требуется
//
Функция МЧДСлужебный_ТекущаяДоверенность(Знач BoxId)
	
	Результат = Ядро.МЧД_ДанныеМЧДИзПодключаемогоМодуля(BoxId);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		ДанныеМЧД = Ядро.МЧД_ДанныеПоИспользованиюДоверенностей(BoxId);
		Если ДанныеМЧД.ТребуетсяМЧД И ЗначениеЗаполнено(ДанныеМЧД.МЧД) Тогда
			Результат = ДанныеМЧД.СписокМЧД.Получить(ДанныеМЧД.МЧД);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		ОБЕРТКИ
