
&НаКлиенте
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	///////////// КРИПТОГРАФИЯ /////////////
	
	Если ИмяСобытия = "ПолучитьСписокЛокальныхСертификатов" Тогда
		
		Возврат ПолучитьСписокЛокальныхСертификатов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатВBase64" Тогда
		
		Возврат ПолучитьСертификатВBase64(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьОтпечатокСертификатаДляBoxId" Тогда
		
		Возврат ПолучитьОтпечатокСертификатаДляBoxId(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов(Параметры)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатВBase64(Параметры)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОтпечатокСертификатаДляBoxId(Параметры)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПодписатьДанные(Параметры)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ЗашифроватьДанные(Параметры)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция РасшифроватьДанные(Параметры)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПроверитьПодпись(Параметры)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Возврат Неопределено;
	
КонецФункции


///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////

&НаКлиенте
Функция НажатиеДополнительнойКнопки(Параметры)
	
	Результат = Неопределено;
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки в форме пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
