////////////////////////////////////////////////////////////////////////////////
// Шлюз авторизации: Получение данных Биллинга и предложений для покупки из KStore
//
////////////////////////////////////////////////////////////////////////////////

// BSLLS:UnusedLocalVariable-off

// Коллекция категорий ошибок
Перем КатегорииОшибок;

// Служебный конекст
Перем _Сессия, _Локация, _Коннектор;

// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Инициализирует объект библиотеки
//
// Параметры:
//   Параметры - Структура - см. ПараметрыИнициализации
//
// Возвращаемое значение:
//   ОбработкаОбъект - Инициализированный объект библиотеки
//
Функция Инит(Параметры = Неопределено) Экспорт
	
	ПараметрыИнициализации = ПараметрыИнициализации();
	Если Параметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыИнициализации, Параметры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыИнициализации.Локация) Тогда
		_Локация = ПараметрыИнициализации.Локация;
	КонецЕсли;
	
	Если ПараметрыИнициализации.HTTP = Неопределено Тогда
		_Коннектор = Новый(___HTTP);
	Иначе
		_Коннектор = ПараметрыИнициализации.HTTP;
	КонецЕсли;
	
	Сессия = ША_Сессия();
	
	Если ЗначениеЗаполнено(ПараметрыИнициализации.ЗаголовокАвторизации) Тогда
		Сессия.Заголовки.Вставить("Authorization", ПараметрыИнициализации.ЗаголовокАвторизации);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Описание параметров инициализации библиотеки
//
// Возвращаемое значение:
//  Структура - Параметры клиента
//     * Локация - Строка - (необязательный) Локация сервиса
//     * ЗаголовокАвторизации - Строка - (необязательный) Authorization
//
Функция ПараметрыИнициализации() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Локация", "https://api.kontur.ru/1c/auth-proxy");
	Модель.Вставить("ЗаголовокАвторизации");
	Модель.Вставить("HTTP");
	
	Возврат Модель;
	
КонецФункции

// Запрашивает авторизацию на текущий момент времени
//
// Параметры:
//  Продукт - Строка - Имя продукта в сервисе Шлюза авторизации
//
// Возвращаемое значение:
//  Структура - см. Контракт_ДанныеБиллинга
//
Функция АвторизацияБиллинга(Продукт) Экспорт
	
	АдресМетода = "/subscriptions";
		
	Возврат ША_ДанныеБиллинга(АдресМетода, Продукт);
	
КонецФункции

// Запрашивает все активированные подписки
//
// Параметры:
//  Продукт - Строка - Имя продукта в сервисе Шлюза авторизации
//
// Возвращаемое значение:
//  Структура - см. Контракт_ДанныеБиллинга
//
Функция АктивныеПодпискиБиллинга(Продукт) Экспорт
	
	АдресМетода = "/subscriptions-search";	
		
	Возврат ША_ДанныеБиллинга(АдресМетода, Продукт);
	
КонецФункции

// Запрашивает доступные предложения KStore для покупки
//
// Параметры:
//  Продукт - Строка - Имя продукта в сервисе Шлюза авторизации
//  ЛицевойСчет - Строка - Идентификатор лицевого счета
//
// Возвращаемое значение:
//  Структура - см. Контракт_ПредложенияДляПокупки
//
Функция ПредложенияДляПокупки(Продукт, ЛицевойСчет) Экспорт
	
	ША_ПроверитьПараметры(ША_НесоответствиеТипов(Продукт, "Строка"));
	
	ША_ПроверитьПараметры(ША_НеЗаполнено(Продукт));
	
	Возврат ША_ПредложенияДляПокупки(Продукт, ЛицевойСчет);
	
КонецФункции

// Возвращает контракт результа функции АвторизацияБиллинга().
// Может использоваться для обработки исключений в других библиотеках.
//
// Возвращаемое значение:
//  Соответствие - Контейнер для данных Билинга
//
Функция Контракт_ДанныеБиллинга() Экспорт
	
	Результат = Новый Соответствие;
	
	Возврат Результат;
	
КонецФункции

// Возвращает контракт результа функции ПредложенияДляПокупки().
// Может использоваться для обработки исключений в других библиотеках.
//
// Возвращаемое значение:
//  Массив - Контейнер для предложений для покупки от KStore
//
Функция Контракт_ПредложенияДляПокупки() Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

// Обработка данных Биллинга

Функция ША_ДанныеБиллинга(АдресМетода, Продукт)
	
	ОшибкаОтсутствияЗначения = ША_НеЗаполнено(Продукт);
	ОшибкаНесоответствияТипов = ША_НесоответствиеТипов(Продукт, "Строка");
	
	ША_ПроверитьПараметры(ОшибкаОтсутствияЗначения, ОшибкаНесоответствияТипов);
		
	Ответ = ША_PostJson(АдресМетода, ША_ТелоЗапросаДанныхБиллинга(Продукт));
	
	Если НЕ ША_ПроверитьСостояние(Ответ) Тогда
		ВызватьИсключение ША_ТелоОписаниеОшибки(Ответ);
	КонецЕсли;
	
	Данные = ША_ТелоJson(Ответ);
	Модель = ША_РазобратьОтветДанныхБиллинга(Данные);
	
	Результат = ША_ФиксированныеДанные(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция ША_ТелоЗапросаДанныхБиллинга(Продукт)
	
	Запрос = Новый Соответствие;
	Запрос.Вставить("product-id", Продукт);
	
	Возврат Запрос;
	
КонецФункции

Функция ША_РазобратьОтветДанныхБиллинга(Данные)
	
	Результат = Контракт_ДанныеБиллинга();
	
	Accounts = Данные.Получить("accounts");
	
	НастройкиОплатПлательщикомДляЛС = ША_НастройкиОплатПлательщикомДляЛС(Accounts);
	
	Для Каждого Account_data Из Accounts Цикл
		
		Account = Account_data.Получить("account");
		
		ИдентификаторЛС = Account.Получить("recipient-id");
		КодПродуктаЛС = Account.Получить("product-code");
		
		Subscriptions = Account_data.Получить("subscriptions");
		ПодпискиЛС = ША_ДанныеПодпискиБиллинга(Subscriptions);
		
		Client_ids = Account_data.Получить("client-ids");
		
		Для Каждого Client_id Из Client_ids Цикл
			
			ЛицевыеСчетаКлиента = Результат.Получить(Client_id);
			
			Если ЛицевыеСчетаКлиента = Неопределено Тогда
				
				ЛицевыеСчетаКлиента = Новый Массив;
				Результат.Вставить(Client_id, ЛицевыеСчетаКлиента);
				
			КонецЕсли;
			
			НастройкаОплатыДляЛС = НастройкиОплатПлательщикомДляЛС.Получить(Client_id);
			
			ЛицевойСчет = Контракт_ЛицевойСчетИзСервиса();
			
			ЛицевойСчет.Идентификатор = ИдентификаторЛС;
			ЛицевойСчет.КодПродукта = КодПродуктаЛС;
			ЛицевойСчет.ОплатаПлательщиком = ША_ПризнакОплатыПлательщикомЗаКлиента(ИдентификаторЛС, НастройкаОплатыДляЛС);
			ЛицевойСчет.Подписки = ША_ПодпискиЛицевогоСчетаКлиента(ИдентификаторЛС, ПодпискиЛС, НастройкаОплатыДляЛС);
			
			ЛицевыеСчетаКлиента.Добавить(ЛицевойСчет);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ША_НастройкиОплатПлательщикомДляЛС(Accounts)
	
	Результат = Новый Соответствие;
	
	Для Каждого Account_data Из Accounts Цикл
		
		Account = Account_data.Получить("account");
		
		Clients = Account.Получить("clients");
		
		Если Clients = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторЛС = Account.Получить("recipient-id");
		
		Для Каждого Client Из Clients Цикл
			
			Client_id = Client.Получить("id");
			
			Если Client_id = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОплатаДокументовПлательщиком = Ложь;
			ОплатаМаршрутовПлательщиком = Ложь;
			
			Client_paid_functionality = Client.Получить("paid-functionality");
			
			Если ЗначениеЗаполнено(Client_paid_functionality) Тогда
				
				Client_paid_documents = Client_paid_functionality.Получить("documents");
				Client_paid_routes = Client_paid_functionality.Получить("routes");
				
				ОплатаДокументовПлательщиком = (Client_paid_documents = Истина);
				ОплатаМаршрутовПлательщиком = (Client_paid_routes = Истина);
				
			КонецЕсли;
			
			ОплатаПлательщиком = (ОплатаДокументовПлательщиком ИЛИ ОплатаМаршрутовПлательщиком);
			
			Если ОплатаПлательщиком Тогда
				
				НастройкаЛицевогоСчета = Новый Структура;
				
				НастройкаЛицевогоСчета.Вставить("ИдентификаторЛС", ИдентификаторЛС);
				НастройкаЛицевогоСчета.Вставить("ОплатаДокументовПлательщиком", ОплатаДокументовПлательщиком);
				НастройкаЛицевогоСчета.Вставить("ОплатаМаршрутовПлательщиком", ОплатаМаршрутовПлательщиком);
				
				Результат.Вставить(Client_id, НастройкаЛицевогоСчета);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ДанныеПодпискиБиллинга(Subscriptions)
	
	Результат = Новый Массив;
	
	Для Каждого Subscription_data Из Subscriptions Цикл
		
		ДанныеПодписки = Контракт_Подписка();
		
		ТипыПодписки = ША_ТипыПодписки();
		
		ДанныеПодписки.Идентификатор = Subscription_data.Получить("id");
		ДанныеПодписки.ИдентификаторОсновнойПодписки = Subscription_data.Получить("parent-id");
		ДанныеПодписки.КодПродукта = Subscription_data.Получить("product-code");
		ДанныеПодписки.Тип = ТипыПодписки.Получить(Subscription_data.Получить("type"));
		ДанныеПодписки.Активна = ША_ПодпискаАктивна(Subscription_data.Получить("state"));
		
		ДатаНачала = ША_ПриведеннаяДатаИзТиков(Subscription_data.Получить("begin-utc-date-ticks"));
		ДатаОкончания = ША_ПриведеннаяДатаИзТиков(Subscription_data.Получить("end-utc-date-ticks"));
		
		ДанныеПодписки.ДатаНачала = ША_ПриведеннаяЛокальнаяДата(ДатаНачала);
		ДанныеПодписки.ДатаОкончания = ША_ПриведеннаяЛокальнаяДата(ДатаОкончания);
		
		Services = Subscription_data.Получить("services");
		ДанныеПодписки.Сервисы = ША_ДоступныеСервисыБиллинга(Services);
		
		Результат.Добавить(ДанныеПодписки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ДоступныеСервисыБиллинга(Services)
	
	Результат = Новый Массив;
	
	ТипыТрафикаРесурса = ША_ТипыТрафикаРесурса();
	ТипыОграниченийРесурса = ША_ТипыОграниченийРесурса();
	
	Для Каждого Service_data Из Services Цикл
		
		ДанныеСервиса = Контракт_Сервис();
		
		ДанныеСервиса.Имя = Service_data.Получить("named-id");
		ДанныеСервиса.Представление = Service_data.Получить("name");
		
		Resources = Service_data.Получить("resources");
		
		Для Каждого Resource_data Из Resources Цикл
			
			ДанныеРесурса = Контракт_Ресурс();
			
			ДанныеРесурса.Имя = Resource_data.Получить("named-id");
			ДанныеРесурса.Представление = Resource_data.Получить("name");
			ДанныеРесурса.ТипТрафика = ТипыТрафикаРесурса.Получить(Resource_data.Получить("traffic-type"));
			ДанныеРесурса.Ограничение = ТипыОграниченийРесурса.Получить(Resource_data.Получить("limitation"));
			ДанныеРесурса.Количество = ША_ПриведенноеЧислоИзСтроки(Resource_data.Получить("count"));
			ДанныеРесурса.Использовано = ША_ПриведенноеЧислоИзСтроки(Resource_data.Получить("spent-count"));
			
			ДанныеСервиса.Ресурсы.Добавить(ДанныеРесурса);
			
		КонецЦикла;
		
		Результат.Добавить(ДанныеСервиса);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ПризнакОплатыПлательщикомЗаКлиента(ИдентификаторЛС, НастройкаОплатыДляЛС)
	
	Результат = Ложь;
	
	Если НастройкаОплатыДляЛС <> Неопределено
		И НастройкаОплатыДляЛС.ИдентификаторЛС = ИдентификаторЛС Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ПодпискиЛицевогоСчетаКлиента(ИдентификаторЛС, ПодпискиЛС, НастройкаОплатыДляЛС)
	
	Результат = Новый Массив;
	
	Если НастройкаОплатыДляЛС = Неопределено Тогда
		Возврат ПодпискиЛС;
	КонецЕсли;
	
	Для Каждого ПодпискаЛС Из ПодпискиЛС Цикл
		
		ДобавитьПодписку = Ложь;
		
		Для Каждого ДоступныйСервис Из ПодпискаЛС.Сервисы Цикл
			
			ДобавитьПодписку = ША_ТребуетсяДобавитьПодпискуПоСервису(ИдентификаторЛС, ДоступныйСервис, НастройкаОплатыДляЛС);
			
			Если ДобавитьПодписку Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДобавитьПодписку Тогда
			Результат.Добавить(ПодпискаЛС);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ТребуетсяДобавитьПодпискуПоСервису(ИдентификаторЛС, ДоступныйСервис, НастройкаОплатыДляЛС)
	
	Результат = Ложь;
	
	ЭтоЛицевойСчетПлательщика = (ИдентификаторЛС = НастройкаОплатыДляЛС.ИдентификаторЛС);
	ОплатаДокументовПлательщиком = НастройкаОплатыДляЛС.ОплатаДокументовПлательщиком;
	ОплатаМаршрутовПлательщиком = НастройкаОплатыДляЛС.ОплатаМаршрутовПлательщиком;
	
	Сервис_Документы = "exchange";
	Сервис_Маршруты = "route";
	
	ИмяСервиса = НРег(ДоступныйСервис.Имя);
	ЭтоПодпискаНаДокументы = (ИмяСервиса = Сервис_Документы);
	ЭтоПодпискаНаМаршруты = (ИмяСервиса = Сервис_Маршруты);
	
	Если ЭтоЛицевойСчетПлательщика Тогда
		
		ЭтоПодпискаПлательщика = ЭтоПодпискаНаДокументы И ОплатаДокументовПлательщиком
							ИЛИ ЭтоПодпискаНаМаршруты И ОплатаМаршрутовПлательщиком;
		
		Если ЭтоПодпискаПлательщика Тогда
			Результат = Истина;
		КонецЕсли;
		
	Иначе
		
		ЭтоПерсональнаяПодписка = НЕ ЭтоПодпискаНаДокументы И НЕ ЭтоПодпискаНаМаршруты
								ИЛИ ЭтоПодпискаНаДокументы И НЕ ОплатаДокументовПлательщиком
								ИЛИ ЭтоПодпискаНаМаршруты И НЕ ОплатаМаршрутовПлательщиком;
		
		Если ЭтоПерсональнаяПодписка Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ПодпискаАктивна(state)
	
	Результат = (state = 1);
	
	Возврат Результат;
	
КонецФункции

Функция ША_ТипыПодписки()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(0, "Demo");
	Результат.Вставить(1, "Promo");
	Результат.Вставить(2, "Normal");
	
	Возврат Результат;
	
КонецФункции

Функция ША_ТипыТрафикаРесурса()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(0, "Unknown");
	Результат.Вставить(1, "Outgoing");
	Результат.Вставить(2, "Incoming");
	Результат.Вставить(3, "Any");
	
	Возврат Результат;
	
КонецФункции

Функция ША_ТипыОграниченийРесурса()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(0, "Unknown");
	Результат.Вставить(1, "Limit");
	Результат.Вставить(2, "Unlimit");
	
	Возврат Результат;
	
КонецФункции

Функция ША_ПриведеннаяДатаИзТиков(Ticks)
	
	Если ЗначениеЗаполнено(Ticks) Тогда
		Результат = XMLЗначение(Тип("Дата"), XMLСтрока('00010101' + Ticks / 1000 / 1000 / 10));
	Иначе
		Результат = Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ЛицевойСчетИзСервиса()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор");
	Результат.Вставить("КодПродукта");
	Результат.Вставить("ОплатаПлательщиком", Ложь);
	Результат.Вставить("Подписки", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Подписка()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор");
	Результат.Вставить("ИдентификаторОсновнойПодписки");
	Результат.Вставить("КодПродукта");
	Результат.Вставить("Тип");
	Результат.Вставить("Активна");
	Результат.Вставить("ДатаНачала");
	Результат.Вставить("ДатаОкончания");
	Результат.Вставить("Сервисы", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Сервис()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Имя");
	Результат.Вставить("Представление");
	Результат.Вставить("Ресурсы", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Ресурс()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Имя");
	Результат.Вставить("Представление");
	Результат.Вставить("ТипТрафика");
	Результат.Вставить("Ограничение");
	Результат.Вставить("Количество");
	Результат.Вставить("Использовано");
	
	Возврат Результат;
	
КонецФункции

// Обработка данных предложений для покупки из KStore

Функция ША_ПредложенияДляПокупки(Продукт, ЛицевойСчет)
	
	Адрес = "/offers";
	Ответ = ША_PostJson(Адрес, ША_ЗапросПредложений(Продукт, ЛицевойСчет));
	
	Если НЕ ША_ПроверитьСостояние(Ответ) Тогда
		ВызватьИсключение ША_ТелоОписаниеОшибки(Ответ);
	КонецЕсли;
	
	Данные = ША_ТелоJson(Ответ);
	Модель = ША_РазобратьОтветПредложений(Данные);
	
	Результат = ША_ФиксированныеДанные(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция ША_ЗапросПредложений(Продукт, ЛицевойСчет)
	
	ДанныеДляЗапроса = Новый Соответствие;
	ДанныеДляЗапроса.Вставить("productId", Продукт);
	ДанныеДляЗапроса.Вставить("accountId", ЛицевойСчет);
	
	Запрос = Новый Соответствие;
	Запрос.Вставить("clientAttributes", ДанныеДляЗапроса);
	
	Возврат Запрос;
	
КонецФункции

Функция ША_РазобратьОтветПредложений(Данные)
	
	Результат = Контракт_ПредложенияДляПокупки();
	
	Для Каждого ТекущееПредложение Из Данные Цикл
		
		ПредложениеДляПокупки = Контракт_ПредложениеДляПокупкиИзСервиса();
		
		ДопИнформация = ТекущееПредложение.Получить("creationInfo");
		ПредложениеДляПокупки.ДопИнформация = ДопИнформация;
		
		СсылкаНаПредложение = ТекущееПредложение.Получить("link");
		
		ПредложениеДляПокупки.Ссылка = СсылкаНаПредложение;
		ПредложениеДляПокупки.Сценарий = ДопИнформация.Получить("scenarioId");
		ПредложениеДляПокупки.ПодпискаПродления = ША_ЗначениеПараметраСсылки(СсылкаНаПредложение, "entityId");
		ПредложениеДляПокупки.Тариф = ША_ЗначениеПараметраСсылки(СсылкаНаПредложение, "tariffId");
		ПредложениеДляПокупки.Тип = ДопИнформация.Получить("activity");
		
		Если НЕ ЗначениеЗаполнено(ПредложениеДляПокупки.Тип) Тогда
			ПредложениеДляПокупки.Тип = "";
		КонецЕсли;
		
		ОстатокТрафика = ДопИнформация.Получить("remainingTraffic");
		
		Если ЗначениеЗаполнено(ОстатокТрафика)
			И НРег(ОстатокТрафика) <> "null" Тогда
			ПредложениеДляПокупки.ОстатокТрафика = Число(ОстатокТрафика);
		Иначе
			ПредложениеДляПокупки.ОстатокТрафика = Неопределено;
		КонецЕсли;
		
		ДатаОкончания = ША_ПриведеннаяДатаИзСтроки(ДопИнформация.Получить("endDate"));
		ПредложениеДляПокупки.ДатаОкончания = ДатаОкончания;
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			
			ЧасовойПоясМосквы = "Europe/Moscow";
			УниверсальнаяДатаОкончания = УниверсальноеВремя(ДатаОкончания, ЧасовойПоясМосквы);
			
			ПредложениеДляПокупки.ДатаОкончания = ША_ПриведеннаяЛокальнаяДата(УниверсальнаяДатаОкончания);
			
			Если УниверсальнаяДатаОкончания <= ТекущаяУниверсальнаяДата() Тогда
				ПредложениеДляПокупки.СрокДействияИстек = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Результат.Добавить(ПредложениеДляПокупки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ЗначениеПараметраСсылки(Ссылка, ИмяПараметра)
	
	Результат = "";
	
	МеткаДляПоиска = ИмяПараметра + "=";
	
	ДлинаМеткиДляПоиска = СтрДлина(МеткаДляПоиска);
	
	// BSLLS:DeprecatedFind-off
	ПозицияНачалаСтрокиПараметров = Найти(Ссылка, "?") + 1;
	// BSLLS:DeprecatedFind-on
	
	СтрокаПараметровСсылки = Сред(Ссылка, ПозицияНачалаСтрокиПараметров);
	
	КоллекцияПараметров = ША_СтрРазделить(СтрокаПараметровСсылки, "&");
	
	Для Каждого ЧастьСсылки Из КоллекцияПараметров Цикл
		
		Если Лев(ЧастьСсылки, ДлинаМеткиДляПоиска) = МеткаДляПоиска Тогда
			
			Результат = СтрЗаменить(ЧастьСсылки, МеткаДляПоиска, "");
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Конвертирует значение из строкового представления даты 
//
// Параметры:
//   ДатаСтрокой - Строка - Представление даты в формате "MM/DD/YYYY hh:mm:ss AM/PM"
//
// Возвращаемое значение:
//   Дата, Неопределено - Сконвертированная дата. Если дата не заполнена, то возвращается Неопределено.
//
Функция ША_ПриведеннаяДатаИзСтроки(ДатаСтрокой)    
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ДатаСтрокой) Тогда
		
		СоставПолнойДаты = ША_СтрРазделить(ДатаСтрокой, " ");
		
		Если СоставПолнойДаты.Количество() > 1 Тогда
			
			СоставДаты = ША_СтрРазделить(СоставПолнойДаты[0], "/");
			СоставВремени = ША_СтрРазделить(СоставПолнойДаты[1], ":");
			
			Если СоставДаты.Количество() = 3
				И СоставВремени.Количество() = 3 Тогда
				
				Если СоставПолнойДаты.Количество() = 3
					И СоставПолнойДаты[2] = "PM"
					И Число(СоставВремени[0]) < 12 Тогда
					СоставВремени[0] = 12 + СоставВремени[0];
				КонецЕсли;
				
				Результат = Дата(СоставДаты[2], СоставДаты[0], СоставДаты[1], СоставВремени[0], СоставВремени[1], СоставВремени[2]);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ША_ПриведеннаяЛокальнаяДата(УниверсальнаяДатаДляПриведения)
	
	Если ЗначениеЗаполнено(УниверсальнаяДатаДляПриведения) Тогда
		
		ПоправкаДляЛокальногоВремени = ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата();
		Результат = УниверсальнаяДатаДляПриведения + ПоправкаДляЛокальногоВремени;
		
	Иначе
		Результат = УниверсальнаяДатаДляПриведения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ША_ПриведенноеЧислоИзСтроки(Знач Строка)
	
	Результат = Неопределено;
	
	ПредставлениеЗначенияNULL = "null";
	
	Если ЗначениеЗаполнено(Строка)
		И Нрег(Строка) <> ПредставлениеЗначенияNULL Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("Число");
		Результат = ОписаниеТипа.ПривестиЗначение(Строка);

		Если НЕ ЗначениеЗаполнено(Результат) Тогда	
			
			Строка = СтрЗаменить(Строка, ",", ".");
			Строка = СтрЗаменить(Строка, " ", "");
			Строка = СтрЗаменить(Строка, Символы.НПП, "");
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат = Число(Строка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ПредложениеДляПокупкиИзСервиса()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("Тип");
	Результат.Вставить("Сценарий");
	Результат.Вставить("ПодпискаПродления");
	Результат.Вставить("Тариф");
	Результат.Вставить("ОстатокТрафика");
	Результат.Вставить("ДатаОкончания");
	Результат.Вставить("СрокДействияИстек", Ложь);
	Результат.Вставить("ДопИнформация");
	
	Возврат Результат;
	
КонецФункции

// HTTP

Процедура ША_УдалитьНедопустимыеСимволыXML(Строка)
	
	Если ТипЗнч(Строка) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Сдвиг = 1;
	НедопустимыйСимвол = НайтиНедопустимыеСимволыXML(Строка, Сдвиг);
	
	Пока НедопустимыйСимвол <> 0 Цикл
		
		Символ = Сред(Строка, НедопустимыйСимвол, 1);
		Строка = СтрЗаменить(Строка, Символ, "");
		Сдвиг = НедопустимыйСимвол - 1;
		НедопустимыйСимвол = НайтиНедопустимыеСимволыXML(Строка, Сдвиг);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ША_URL(URL)
	
	Если Найти(URL, "http") ИЛИ Найти(URL, "https") Тогда
		Возврат URL;
	Иначе
		Возврат _Локация + URL;
	КонецЕсли;
	
КонецФункции

Функция ША_PostJson(Ресурс, Json, ПараметрыЗапроса = Неопределено, ЗаголовкиЗапроса = Неопределено)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Заголовки", Новый Соответствие);
	ДопПараметры.Вставить("Json", Json);
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		ДопПараметры.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	КонецЕсли;
	
	Ответ = _Коннектор.Post(ША_URL(Ресурс), Неопределено, ДопПараметры, ША_Сессия());
	
	Возврат Ответ;
	
КонецФункции

Функция ША_ТелоJson(Ответ)
	
	Возврат _Коннектор.КакJson(Ответ);
	
КонецФункции

Функция ША_ТелоОписаниеОшибки(Ответ, ПодробныеИсключения = Истина)
	
	КраткоеОписание = КатегорииОшибок.ОшибкаСостояния + " "
		+ Строка(Ответ.КодСостояния) + " "
		+ Строка(Ответ.URL);
	Если ПодробныеИсключения = Ложь Тогда
		Возврат КраткоеОписание;
	КонецЕсли;
	
	Подробно = Новый Массив;
	Подробно.Добавить(КраткоеОписание);
	
	Для Каждого Элемент Из Ответ.Заголовки Цикл
		Подробно.Добавить(Строка(Элемент.Ключ) + ": " + Строка(Элемент.Значение));
	КонецЦикла;
	
	Если ТипЗнч(Ответ.Тело) = Тип("ДвоичныеДанные") И Ответ.Тело.Размер() Тогда
		Подробно.Добавить(_Коннектор.КакТекст(Ответ, "utf-8"));
	КонецЕсли;
	
	Результат = ША_СтрСоединить(Подробно, Символы.ПС);
	
	ША_УдалитьНедопустимыеСимволыXML(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ША_ПроверитьСостояние(Ответ)
	
	НегативноеСостояние = Ответ.КодСостояния >= _Коннектор.КодыСостоянияHTTP().ПеремещеноНавсегда_301;
	
	Результат = НЕ НегативноеСостояние;
	
	Возврат Результат;
	
КонецФункции

Функция ША_Сессия()
	
	Если _Сессия = Неопределено Тогда
		_Сессия = _Коннектор.СоздатьСессию();
	КонецЕсли;
	
	Результат = _Сессия;
	
	Возврат Результат;
	
КонецФункции

// Проверка параметров

Процедура ША_ПроверитьПараметры(Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено)
	
	Ошибка = ША_ОшибкаПараметра(Параметр1, Параметр2, Параметр3);
	
	Если Ошибка <> Неопределено Тогда
		ВызватьИсключение Ошибка.Описание;
	КонецЕсли;
	
КонецПроцедуры

Функция ША_НесоответствиеТипов(Значение, ОписаниеТипов)
	
	Если ТипЗнч(ОписаниеТипов) = Тип("Строка") Тогда
		ОписаниеТипов_ = Новый ОписаниеТипов(ОписаниеТипов);
	Иначе
		ОписаниеТипов_ = ОписаниеТипов;
	КонецЕсли;
	
	Если НЕ ОписаниеТипов_.СодержитТип(ТипЗнч(Значение)) Тогда
		Результат = ША_ОшибкаТипа();
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ША_НеЗаполнено(Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Результат = ША_ОшибкаЗначения();
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Ошибки

Функция ША_Ошибка()
	
	Результат = Новый Структура("Описание");
	
	Возврат Результат;
	
КонецФункции

Функция ША_ОшибкаТипа()
	
	Результат = ША_Ошибка();
	Результат.Описание = НСтр("ru = 'Несоответствие типов'");
	
	Возврат Результат;
	
КонецФункции

Функция ША_ОшибкаЗначения()
	
	Результат = ША_Ошибка();
	Результат.Описание = НСтр("ru = 'Недопустимое значение параметра'");
	
	Возврат Результат;
	
КонецФункции

Функция ША_ОшибкаПараметра(Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено)
	
	Параметры = Новый Массив;
	Параметры.Добавить(Параметр1);
	Параметры.Добавить(Параметр2);
	Параметры.Добавить(Параметр3);
	
	Шаблон = "ru = ' (параметр номер %1)'";
	
	Для Сч = 0 По Параметры.ВГраница() Цикл
		
		Параметр = Параметры[Сч];
		Если Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Параметр.Описание = Параметр.Описание + НСтр(СтрЗаменить(Шаблон, "%1", Строка(Сч + 1)));
		
		Возврат Параметр;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Прочие

Функция ША_СтрСоединить(Строки, Разделитель = "")
	
	Попытка
		
		Результат = Вычислить("СтрСоединить(Строки, Разделитель)");
		
	Исключение
		
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		
		ЭтоПерваяСтрока = Истина;
		Для Каждого Элемент Из Строки Цикл
			
			Строка = Элемент;
			Если ЭтоПерваяСтрока Тогда
				Запись.ЗаписатьБезОбработки(Строка);
				ЭтоПерваяСтрока = Ложь;
			Иначе
				Запись.ЗаписатьБезОбработки(Разделитель);
				Запись.ЗаписатьБезОбработки(Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		Результат = Запись.Закрыть();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ША_СтрРазделить(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Фиксирует Данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// BSLLS:CyclomaticComplexity-off
// BSLLS:CognitiveComplexity-off
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - коллекции, значения которых являются примитивными типами,
//           хранилищем значения или не могут быть изменены. Поддерживаются типы значений:
//           Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//           ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//           ЛюбаяСсылка.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
//
Функция ША_ФиксированныеДанные(Данные)
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		
		Массив = Новый Массив;
		
		Для Каждого Значение Из Данные Цикл
			Если ТипЗнч(Значение) = Тип("Структура")
				ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
				ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				Массив.Добавить(ША_ФиксированныеДанные(Значение));
			Иначе
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		Результат = Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		ИЛИ ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Коллекция = Новый Структура;
		Иначе
			Коллекция = Новый Соответствие;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из Данные Цикл
			
			Значение = КлючИЗначение.Значение;
			Если ТипЗнч(Значение) = Тип("Структура")
				ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
				ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				Коллекция.Вставить(КлючИЗначение.Ключ, ША_ФиксированныеДанные(Значение));
			Иначе
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Результат = Новый ФиксированнаяСтруктура(Коллекция);
		Иначе
			Результат = Новый ФиксированноеСоответствие(Коллекция);
		КонецЕсли;
		
	Иначе
		Результат = Данные;
	КонецЕсли;
	
	Возврат Результат;
	
	// BSLLS:CyclomaticComplexity-on
	// BSLLS:CognitiveComplexity-on
	
КонецФункции

Процедура __Инит__(Мета)
	
	КатегорииОшибок = Новый Структура;
	КатегорииОшибок.Вставить("ОшибкаСостояния", "Ошибка состояния HTTP:");
	КатегорииОшибок.Вставить("ОшибкаСостояния404", КатегорииОшибок.ОшибкаСостояния + " 404");
	
	___HTTP = Мета.Реквизиты.___HTTP.Комментарий;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Описание сведений о внешней обработке

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование", Метаданные().Синоним);
	Результат.Вставить("Информация", Метаданные().Комментарий);
	Результат.Вставить("Версия", ВерсияОбработки());
	Результат.Вставить("Команды", НоваяТаблицаКоманд());
	Результат.Вставить("Вид", "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
Функция ВерсияОбработки()
	
	Результат = "1.1.7";
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаКоманд()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

__Инит__(Метаданные());
