Перем ОсновнойМодуль Экспорт;

Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт

	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда

		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);

	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхПакетов" Тогда

		Возврат ПолучитьТаблицуИспользуемыхПакетов(Параметры);

	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда

		Возврат ПодготовитьПакет(Параметры);

	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда

		Возврат ПодготовитьЭлектронныйДокумент(Параметры);

	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда

		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		// ШХ
		// т1к Гирфанов Р.Э., 2023.07.17 Доработка по обработке Контур Диадок: e1cib/data/Справочник.Карточка?ref=861a005056b60a3c11ee20d6073ba6b3 {
		
		Если ТипЗнч(Параметры.ВнешняяПечатнаяФорма) = Тип("Строка") Тогда
			
			ИмяПечатнойФормы = Параметры.ВнешняяПечатнаяФорма;
			
			ИменаПечатнойФормы = СтрРазделить(ИмяПечатнойФормы,"[]", Ложь);
			
			Если ИменаПечатнойФормы.Количество() <> 3 Тогда
				Параметры.Документ.ИмяФайла = "Неверные параметры печатной формы: " + Параметры.ВнешняяПечатнаяФорма;
				Возврат Истина;
			КонецЕсли;
			
			// ШХ
			// Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
			// Флаг требования подписи
			
			Попытка
				ТекДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Документ.ДокументУчета, "Договор");
			Исключение
				ТекДоговор = Неопределено;
			КонецПопытки;
			ИтоговыйИД = ПолучитьИДСУчетомБазового(Параметры.Документ.ИдентификаторВида);
			НастройкаПодписания =
					т1кДиадокСервер.НастройкаПодписания(
						ИтоговыйИД,
						Параметры.ВнешняяПечатнаяФорма,
						Параметры.Документ.Отправитель.ОрганизацияЭДО,
						Параметры.Документ.Получатель.ОрганизацияЭДО,
						ТекДоговор);
			Если НастройкаПодписания = Истина ИЛИ НастройкаПодписания = Ложь Тогда
				Параметры.Документ.СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = НастройкаПодписания;
			Иначе
				Параметры.Документ.СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = НЕ т1кДиадокСервер.ЭтоВидДокументаБезЗапросаПодписиПоУмолчанию(
						Новый Структура("ИдентификаторВида,ТипДокумента,ТипКонтента,Формлизованный,ФункцияДокумента",
							Параметры.Документ.ИдентификаторВида,
							Параметры.Документ.Тип.ТипДокумента,
							Параметры.Документ.Тип.ТипКонтента,
							Параметры.Документ.Тип.Формализованный,
							Параметры.Документ.Тип.ФункцияДокумента));
			КонецЕсли;
			// --
			// Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
		
			ИмяПечатнойФормы = СокрЛП(ИменаПечатнойФормы[0]);
			
			мСсылкиДляОбработки = Новый Массив;
			мСсылкиДляОбработки.Добавить(Параметры.Документ.ДокументУчета);
			Если ТипЗнч(Параметры.Документ.ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
				мСсылкиДляОбработки.Добавить(Параметры.Документ.ДокументУчета.ДокументОснование);
			КонецЕсли;
			
			// Как в форме НастройкаПечатныхФормУправляемая
			#Область ОбщиеКомандыПечати
			
			ОбщиеКомандыПечати = Неопределено;
			Для каждого Документ1ССсылка Из мСсылкиДляОбработки Цикл
				МетаданныеДОК = Документ1ССсылка.Метаданные();
				КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(МетаданныеДОК, Ложь);
				
				Объекты = Новый СписокЗначений;
				Объекты.Добавить(Документ1ССсылка);
				
				КомандыПечати.Колонки.Добавить("Имя");
				КомандыПечати.ЗагрузитьКолонку(КомандыПечати.ВыгрузитьКолонку("Идентификатор"), "Имя");
				КомандыПечати.Колонки.Добавить("Документ1ССсылка");
				КомандыПечати.ЗаполнитьЗначения(Документ1ССсылка, "Документ1ССсылка");
				//РегистрыСведений.НастройкиПечатиОбъектов.т1кИсправитьСоставКомплектаПоКонтекстуСсылок(КомандыПечати, Объекты);
				
				Если ОбщиеКомандыПечати = Неопределено Тогда
					
					ОбщиеКомандыПечати = КомандыПечати.Скопировать();
					
				Иначе
					
					Для каждого КП Из КомандыПечати Цикл
						
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Идентификатор", КП.Идентификатор);
						ПараметрыОтбора.Вставить("МенеджерПечати", КП.МенеджерПечати);
						ПараметрыОтбора.Вставить("Представление", КП.Представление);
						ПараметрыОтбора.Вставить("УникальныйИдентификатор", КП.УникальныйИдентификатор);
						НайденныеСтроки = ОбщиеКомандыПечати.НайтиСтроки(ПараметрыОтбора);
						
						Если НайденныеСтроки.Количество() = 0 Тогда
							
							ЗаполнитьЗначенияСвойств(ОбщиеКомандыПечати.Добавить(), КП);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокиНаУдаление = Новый Массив;
			Для каждого А Из ОбщиеКомандыПечати Цикл
				Если ПустаяСтрока(А.МенеджерПечати)
					ИЛИ А.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
					
					СтрокиНаУдаление.Добавить(А);
					
				КонецЕсли;
			КонецЦикла;
			Для каждого СтрокаНаУдаление Из СтрокиНаУдаление Цикл
				ОбщиеКомандыПечати.Удалить(СтрокаНаУдаление);
			КонецЦикла;
			
			ОбщиеКомандыПечати.Колонки.Вставить(0,"ПредставлениеВРЕГ");
			ОбщиеКомандыПечати.Колонки.Вставить(1,"ИдентификаторВРЕГ");
			ОбщиеКомандыПечати.Колонки.Вставить(2,"УникальныйИдентификаторВРЕГ");
			Для каждого Строка_ТЗ Из ОбщиеКомандыПечати Цикл
				Строка_ТЗ.ПредставлениеВРЕГ = ВРег(Строка_ТЗ.Представление);
				Строка_ТЗ.ИдентификаторВРЕГ = ВРег(Строка_ТЗ.Идентификатор);
				Строка_ТЗ.УникальныйИдентификаторВРЕГ= ВРег(Строка_ТЗ.УникальныйИдентификатор);
			КонецЦикла;
			
			#КонецОбласти
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ПредставлениеВРЕГ", ВРег(СокрЛП(ИменаПечатнойФормы[0])));
			ПараметрыОтбора.Вставить("ИдентификаторВРЕГ", ВРег(ИменаПечатнойФормы[1]));
			ПараметрыОтбора.Вставить("УникальныйИдентификаторВРЕГ", ВРег(ИменаПечатнойФормы[2]));
			СтрокаКомандыПечати = ОбщиеКомандыПечати.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокаКомандыПечати.Количество() = 0 Тогда 
				Параметры.Документ.ИмяФайла = "Нет данных для печати: " + ИмяПечатнойФормы;
				Возврат Истина;
			КонецЕсли; 
			
			КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(СтрокаКомандыПечати[0].Идентификатор);
			ПараметрыПечати = Новый Структура;
			ПараметрыПечати.Вставить("ПечатьВВалюте", Ложь);
			Если ВРег(ИменаПечатнойФормы[1])= "ТОРГ12БЕЗУСЛУГ" Тогда
				ПараметрыПечати.Вставить("ВыводитьУслуги", Ложь);
			// + шх Калашников АН, 12.01.2024 - Не формируется печатная форма ТОРГ12 в пакете в ДИАДОК: e1cib/data/Справочник.Карточка?ref=b923005056bcf87311eeb07bb93d8bb8
			Иначе
				ПараметрыПечати.Вставить("ВыводитьУслуги", Истина);
			// - шх Калашников АН, 12.01.2024 - Не формируется печатная форма ТОРГ12 в пакете в ДИАДОК: e1cib/data/Справочник.Карточка?ref=b923005056bcf87311eeb07bb93d8bb8
			КонецЕсли;
			ОбъектыПечати = Новый СписокЗначений;
			ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
			
			МассивДокументов = Новый Массив;
			МассивДокументов.Добавить(СтрокаКомандыПечати[0].Документ1ССсылка);
			МенеждерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрокаКомандыПечати[0].МенеджерПечати); 
			МенеждерПечати.Печать(МассивДокументов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
			// {т1к Персианов М.С. 10.08.2023 14:06:01
			// Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
			// Выполнение обработчиков подсистемы Печать
			ИнтеграцияПодсистемБСП.ПриПечати(МассивДокументов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
			УправлениеПечатьюПереопределяемый.ПриПечати(МассивДокументов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
			// } Персианов - 10.08.2023 14:06:01

			ТабличныйДокумент = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
			
			Если НЕ ТипЗнч(ТабличныйДокумент) = Тип("ТабличныйДокумент")
				ИЛИ ТабличныйДокумент.ВысотаТаблицы = 0
				ИЛИ ТабличныйДокумент.Области.Количество()= 0 Тогда
				
				Параметры.Документ.ИмяФайла = "Нет данных для печати: " + ИмяПечатнойФормы;
				Возврат Истина;
				
			КонецЕсли;
			
			// Добавил Excel
			ИмяВремФайла = ПолучитьИмяВременногоФайла();
			Параметры.Документ.ДокументУчета = СтрокаКомандыПечати[0].Документ1ССсылка;
			Если НЕ СтрНайти(ВРег(СокрЛП(ИменаПечатнойФормы[0])), "РЕЕСТР ДЛЯ ЭДО") > 0 Тогда 
				ТабличныйДокумент.Записать(ИмяВремФайла, ТипФайлаТабличногоДокумента.PDF);
				ИмяФайла = ИмяПечатнойФормы + ".pdf";
			Иначе
				// т1к Островский Р. 2023.08.13. Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d{
				ДокументОснованиеСверка = ДокументОснованиеИзМассиваДокументов(МассивДокументов);
				Если ТипЗнч(ДокументОснованиеСверка) = Тип("ДокументСсылка.т1кСверкаОказанныхУслуг") 
						И ЗначениеЗаполнено(ДокументОснованиеСверка)Тогда
					ИмяФайлаПоНомеруСверки = ИмяФайлаПоНомеруСверки(ДокументОснованиеСверка);
					ИмяФайла = ?(ПустаяСтрока(ИмяФайлаПоНомеруСверки), ИмяПечатнойФормы, ИмяФайлаПоНомеруСверки) + ".xlsx";
				Иначе
					ИмяФайла = ИмяПечатнойФормы + ".xlsx";
				КонецЕсли;
				
				Если ПараметрыПечати.Свойство("ДанныеДляПакетаОтображаемыхДокументов") Тогда
					СтруктураТабличногоДокумента = ПараметрыПечати.ДанныеДляПакетаОтображаемыхДокументов;
					ФайлExcel = Новый ПакетОтображаемыхДокументов;
					Для Каждого КиЗ Из СтруктураТабличногоДокумента Цикл
						Если КиЗ.Ключ = "ДокументРезультат" Тогда
							Продолжить;
						КонецЕсли;	
						ЛистФайла = ФайлExcel.Состав.Добавить();
						ЛистФайла.Данные = ПоместитьВоВременноеХранилище(КиЗ.Значение);
						ЛистФайла.Наименование = Киз.Ключ;
					КонецЦикла;	
					ФайлExcel.Записать(ИмяВремФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
					
				Иначе
					ТабличныйДокумент.Записать(ИмяВремФайла, ТипФайлаТабличногоДокумента.XLSX);
				КонецЕсли;
				// }т1к Островский Р. 2023.08.13. Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d			
			КонецЕсли;			
			
			Документ				= Параметры.Документ;
			//РеквизитыДокумента		= Документ.Реквизиты;
			//ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
			ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
			
			Документ.ИмяФайла = ИмяФайла;
			
			Документ.Метаданные.FileName		= ИмяФайла;
			Документ.Метаданные.DocumentDate	= СтрокаКомандыПечати[0].Документ1ССсылка.Дата;
			Документ.Метаданные.DocumentNumber	= СтрокаКомандыПечати[0].Документ1ССсылка.Номер;
			
			ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
			ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ИмяВремФайла);
			ХранилищеКонтента.ИмяФайла = ИмяФайла;
			
			//СлужебнаяИнформация = Документ.СлужебнаяИнформация;
			//СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
			//
			УдалитьФайлы(ИмяВремФайла);
			
			Возврат Истина;
			
		КонецЕсли;
		
		// }т1к Гирфанов Р.Э., 2023.07.17 Доработка по обработке Контур Диадок: e1cib/data/Справочник.Карточка?ref=861a005056b60a3c11ee20d6073ba6b3
		// - ШХ
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда
		КонецЕсли; 
		
	// + ШХ
	// т1к О.Н.Кошелев, 2023-11-03{ Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb 
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
    	//ВыполнитьРегламентныеДействия(Параметры);
		Возврат Неопределено; // Выполняем стандартные действия "обновления ленты сообщений"
		
	ИначеЕсли ИмяСобытия = "ВыполнитьФормированиеДокументов" Тогда
    	ВыполнитьСозданиеДокументов(Параметры);
		Возврат Истина; 
		
	ИначеЕсли ИмяСобытия = "СопоставитьНоменклатуруПоставщика" Тогда
		
		Возврат СопоставитьНоменклатуруПоставщика(Параметры);
	
	// }т1к О.Н.Кошелев, 2023-11-03
	// - ШХ
	
	КонецЕсли;
	
КонецФункции

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ПОДКЛЮЧАЕМОГО_МОДУЛЯ
	
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	// Текст запроса построения списка пакетов на отправку (УТ 11)
	Возврат ТекстЗапросаПостроенияСпискаПакетовНаОтправку(Параметры);

КонецФункции

Функция ПолучитьТаблицуИспользуемыхПакетов(Параметры)

	// Удаление типовых пакетов и добавление нового пакета
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда

		ТЗ = Параметры.Результат_ИМ;
		
//{т1к Персианов М.С. 02.09.2023 15:55:27
//Карточка: e1cib/list/Справочник.Карточка
// Получается, что не нужны только  ID_УПД_НаАванс, ID_СчетФормализованный, ID_ИУПД_НаАванс, ID_ИСФ_НаАванс и ID_ТОРГ12_Акт_БезНДС.
		#Область КОММЕНТАРИЙ_ВСЕ_ПАКЕТЫ
			//И плюс добавляемые в обновлениях будут удаляться. Поэтому убираю эту процедуру
			//УдалитьЛишниеПакеты(ТЗ);
			
			//ИТОГО пакеты типовые (плюс добавленные ниже = все пакеты):	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД",								"ID_УПД",											ОсновнойПакет);
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ОсновнойПакет",		"СФ + ТОРГ12/Акт",					"ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура",	ОсновнойПакет);
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_раздельно",		"УПД СЧФ + УПД ДОП",				"ID_УПД_СЧФ, ID_УПД_ДОП",							ОсновнойПакет);
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД",								"ID_УКД",											КорректировочныйПакет);
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_раздельно",		"УКД КСЧФ + УКД ДИС",				"ID_УКД_КСЧФ, ID_УКД_ДИС",							КорректировочныйПакет);
			//ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ",								"ID_КСФ",											КорректировочныйПакет);
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_СФ_НаАванс",			"СФ (на аванс)",					"ID_СчетФактура",									СчетФактураНаАванс);
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_НаАванс",			"УПД СЧФ (на аванс)",				"ID_УПД_СЧФ",										СчетФактураНаАванс);
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет",								"ID_Счет",											СчетНаОплату);
			//ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",	"Счет (формализованный)",			"ID_СчетФормализованный",							СчетНаОплату);
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки",						"ID_АктСверки",										АктCверки);
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)",				"ID_ИУПД");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_раздельно",		"УПД СЧФ + УПД ДОП (исправление)",	"ID_ИУПД_СЧФ, ID_УПД_ДОП");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)",					"ID_ИСФ");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)",				"ID_ИУКД");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ (исправление)",			"ID_ИУКД_КСЧФ");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)",				"ID_ИКСФ");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_НаАванс",			"УПД (исправление на аванс)",		"ID_ИУПД_СЧФ");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ_НаАванс",			"СФ (исправление на аванс)",		"ID_ИСФ");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12_Акт_БезНДС",	"ТОРГ12/Акт (без СФ)",				"ID_АктФормализованный, ID_ТОРГ12");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_БезНДС",			"УПД ДОП (без СФ)",					"ID_УПД_ДОП");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_БезНДС",			"УПД ДОП (исправление без СФ)",	"ID_ИУПД_ДОП");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_БезНДС",			"УКД ДИС (без СФ)",				"ID_УКД_ДИС");
		#КонецОбласти
//} Персианов - 02.09.2023 15:55:27",
//Карточка: e1cib/list/Справочник.Карточка
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ПакетДляАгента", "СФ + Отчет агента", "ID_СчетФактура, ID_ОтчётАгента", "ПакетДляАгента", "Пакет для агента");
		// т1к П.В.Малыгин, 2023-04-12  {
		// https://developer.kontur.ru/Docs/Diadoc_UM/proc/pm/Podgotovka_Paketa_Dlya_Otpravki.html
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_т1кСверка", "Сверка (ШХ)", "т1кПечатьСверкиДиадок", "т1кСверка", "Сверка оказанных услуг");
		// т1к П.В.Малыгин, 2023-04-12  }
//{т1к Персианов М.С. 11.08.2023 11:43:40
//Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
//Добавляю УПД 1 и 2
		//ID, НаименованиеПакета, СоставПакета, КатегорияПакета, НаиемнованиеКатегории, Шаблон
		//ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД1", "УПД статус 1", "UniversalTransferDocument", "utd820", "СЧФ");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД_1", "УПД статус_1", "ID_УПД_СЧФ", "ОсновнойПакет", "Первичные документы");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД_2", "УПД статус_2", "ID_УПД_ДОП", "ОсновнойПакет", "Первичные документы");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ИУПД_1", "Испр.УПД статус_1", "ID_ИУПД_СЧФ");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ИУПД_2", "Испр.УПД статус_2", "ID_ИУПД_ДОП");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УКД_1", "УКД статус_1", "ID_УКД_КСЧФ", "КорректировочныйПакет");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УКД_2", "УКД статус_2", "ID_УКД_ДИС", "КорректировочныйПакет");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ИУКД_1", "Испр.УКД статус_1", "ID_ИУКД_КСЧФ");
		//В типовой ИУКД2 есть, но не используется. в т.ч. в пакете Раздельно. Добавил только в этот пакет и сообщил аналитику.
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ИУКД_2", "Испр.УКД статус_2", "ID_ИУКД_ДИС");
		#Область УПД_РАЗДЕЛЬНО
			//230909 есть требование добавить и в этот пакет
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ (исправление)",			"ID_ИУКД_КСЧФ");
			ТекСтрока = ТЗ.Найти("ID_ИУПД_раздельно", "ID");
			НовыйСостав = "ID_ИУПД_СЧФ, ID_ИУПД_ДОП";
			Если ТекСтрока = Неопределено Тогда
				ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ИУПД_раздельно",		"УПД СЧФ + УПД ДОП (исправление)",			НовыйСостав);
			Иначе
				ТекСтрока.СоставПакета = НовыйСостав;
			КонецЕсли;
		#КонецОбласти
		#Область УКД_РАЗДЕЛЬНО
			//230909 есть требование добавить и в этот пакет
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ (исправление)",			"ID_ИУКД_КСЧФ");
			ТекСтрока = ТЗ.Найти("ID_ИУКД_раздельно", "ID");
			НовыйСостав = "ID_ИУКД_КСЧФ, ID_ИУКД_ДИС";
			Если ТекСтрока = Неопределено Тогда
				ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ (исправление)",			НовыйСостав);
			Иначе
				ТекСтрока.СоставПакета = НовыйСостав;
			КонецЕсли;
		#КонецОбласти
//} Персианов - 11.08.2023 11:43:40",
//Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
		Возврат ТЗ;

	КонецЕсли;

КонецФункции

Функция ПодготовитьПакет(Параметры)

	// Формирование своего пакета
	// {т1к Персианов М.С. 11.08.2023 11:43:40
	// Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
	// Добавляю УПД 1 и 2, исправление неоптимальностей и непредусмотренных типов
	
	Если ТипЗнч(Параметры) = Тип("Структура") И (Параметры.Свойство("Результат_ИМ") ИЛИ (Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно")) Тогда
		
		Если Параметры.ВидПакетаРазвернутый.ID = "ID_ПакетДляАгента" Тогда
			#Область ПАКЕТ
				Документ1С = Параметры.СтрокаСписка.Документ;
				// ???Надо проверять тип или в этом пакете только сф???
				Д_О = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ1С, "ДокументОснование");
				
				ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Параметры.Пакет, Документ1С, "ID_СчетФактура");
				
				ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Параметры.Пакет, Д_О, "ID_ОтчётАгента");
			#КонецОбласти
		ИначеЕсли Параметры.ВидПакетаРазвернутый.ID = "ID_УПД_1"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_УПД_2"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_1"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_2" Тогда
			#Область УПД12
				Документ1С = Параметры.СтрокаСписка.Документ;
				// а здесь вроде д.б. только сф
				Если Параметры.ВидПакетаРазвернутый.ID = "ID_УПД_1"
						ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно"
						ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_1" Тогда
					Автопакет(Параметры.Пакет, Документ1С, Параметры.ВидПакетаРазвернутый.СоставПакета, 0);
				КонецЕсли;
				// В типовом было так, т1 сделано иначе, почему - не знаю. Вернул вариант типовой, но без условия
				// ДобавлятьВПакетНакладныеПоДокументу(Документ1С), т.к. ни в т1, ни в типовом ИУПД этого условия нет
				// Д_О = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ1С, "ДокументОснование");
				// ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Параметры.Пакет, Д_О, "ID_УПД_ДОП");
				// КонецЕсли;
				Если Параметры.ВидПакетаРазвернутый.ID = "ID_УПД_2"
						ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно"
						ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_2" Тогда
					Индекс = ?(Параметры.ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно", 1, Неопределено);
					ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
					Пока ДокументыОснования.Следующий() Цикл
						Автопакет(Параметры.Пакет, ДокументыОснования.ДокументОснование, Параметры.ВидПакетаРазвернутый.СоставПакета, Индекс);
					КонецЦикла;
				КонецЕсли;
			#КонецОбласти
		ИначеЕсли Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_1"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_2"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_раздельно"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУКД_1"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУКД_2"
				ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
			#Область УКД12
				// Док = только СФ
				Документ1С = Параметры.СтрокаСписка.Документ;
				// В эти пакеты добавляет типовой - совсем типовой
				// ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_раздельно"
				// ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" 
				Если Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_1"
						Или Параметры.ВидПакетаРазвернутый.ID = "ID_ИУКД_1" Тогда
					Автопакет(Параметры.Пакет, Документ1С, Параметры.ВидПакетаРазвернутый.СоставПакета);
				КонецЕсли;
				// В типовом было так, т1 сделано иначе, почему - не знаю. Вернул вариант типовой, но без условия
				// ДобавлятьВПакетНакладныеПоДокументу(Документ1С), т.к. ни в т1, ни в типовом ИУПД этого условия нет
				// Д_О = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ1С, "ДокументОснование");
				// ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Параметры.Пакет, Д_О, "ID_УПД_ДОП");
				// КонецЕсли;
				
				// В эти добавляет типовой - с помощью изменения пакета
				// ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_раздельно"
				// ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно"
				Если Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_2"
						ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_ИУКД_2" Тогда
					ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
					ИД_Дока = ?(Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_2"
							ИЛИ Параметры.ВидПакетаРазвернутый.ID = "ID_УКД_раздельно", "ID_УКД_ДИС", "ID_ИУКД_ДИС");
					Пока ДокументыОснования.Следующий() Цикл
						ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Параметры.Пакет, ДокументыОснования.ДокументОснование, ИД_Дока);
					КонецЦикла;
				КонецЕсли;
			#КонецОбласти
		ИначеЕсли ТипЗнч(Параметры.СтрокаСписка.Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			#Область СФ
				// Сделано так, поскольку стандартный печатный механизм умеет готовить только PDF
				Документ1С = Параметры.СтрокаСписка.Документ;
				Д_О = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ1С, "ДокументОснование");
				т1кТребуетсяДобавитьСверку = т1кТребуетсяДобавитьКОтправкеСверку(Д_О);
				ТипДО = ТипЗнч(Д_О);
				Д_О = ?(ТипДО = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипДО = Тип("ДокументСсылка.КорректировкаРеализации"),
						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Д_О, "т1кОснование"), Документы.т1кСверкаОказанныхУслуг.ПустаяСсылка());
				
				Если т1кТребуетсяДобавитьСверку Тогда
					ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Параметры.Пакет, Д_О, "ID_т1кСверка");
				КонецЕсли;
			#КонецОбласти
		КонецЕсли;
	// } Персианов - 11.08.2023 11:43:40",
	// Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
		
		Возврат Истина;
		
	КонецЕсли;

КонецФункции

Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	// ТП Договор
	// {т1к Персианов М.С. 12.08.2023 14:21:17
	// При выгрузке УПД из 1С в Контур Диадок задваивается номер и дата договора: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e40cb30feb
	// Подмена дубля
	
	Если Параметры.Свойство("Результат") И Параметры.Свойство("Результат_ИМ") Тогда
		Если ЗначениеЗаполнено(Параметры.Результат) И Параметры.Результат.Свойство("Content")
				И ТипЗнч(Параметры.Результат.Content) = Тип("ОбъектXDTO") И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры.Результат.Content, "TransferInfo")
				И Параметры.Результат.Content.Установлено("TransferInfo") И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры.Результат.Content.TransferInfo, "TransferBases")
				И Параметры.Результат.Content.TransferInfo.Установлено("TransferBases") Тогда
				
			Для Каждого ОснованиеПередачи Из Параметры.Результат.Content.TransferInfo.TransferBases Цикл
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОснованиеПередачи, "Name") Тогда		
					Если ОснованиеПередачи.Name = "Без документа-основания" Тогда
						Если ЗначениеЗаполнено(ОснованиеПередачи.Number) И  ЗначениеЗаполнено(ОснованиеПередачи.Date) Тогда
							ОснованиеПередачи.Name = "Договор №";
						ИначеЕсли ЗначениеЗаполнено(Параметры.Результат.Документ1С) Тогда
							ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Результат.Документ1С, "ДокументОснование");
							Если ЗначениеЗаполнено(ДокументОснование) Тогда
								
								ИменаРеквизитов = Новый Структура("Дата, Номер", "Договор.Дата", "Договор.Номер");
								ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Результат.Документ1С, ИменаРеквизитов);
								
								ОснованиеПередачи.Name = "Договор";
								ОснованиеПередачи.Number = "" + ЗначенияРеквизитов.Номер;
								ОснованиеПередачи.Date = ЗначенияРеквизитов.Дата;
							КонецЕсли;
						КонецЕсли;	
					ИначеЕсли Лев("" + ОснованиеПередачи.Number + " от " + ОснованиеПередачи.Date, СтрДлина(ОснованиеПередачи.Name)) = ОснованиеПередачи.Name Тогда
						// Пустышки и непечатки не проходят
						ОснованиеПередачи.Name = ?(СтрНайти(ОснованиеПередачи.Number, "Договор") = 0, "Договор", ".");
					ИначеЕсли (СтрНайти(ОснованиеПередачи.Name, Формат(ОснованиеПередачи.Date, "ДФ=dd.MM.yyyy")) > 0 
						ИЛИ СтрНайти(ОснованиеПередачи.Name, ОснованиеПередачи.Number) > 0) 
						И ЗначениеЗаполнено(Параметры.Результат.Документ1С) Тогда 
						
						ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Результат.Документ1С, "ДокументОснование");
						Если ЗначениеЗаполнено(ДокументОснование) Тогда
							
							Если ТипЗнч(Параметры.Результат.Документ1С) = Тип("ДокументСсылка.СчетФактураВыданныйАванс") Тогда
								ИменаРеквизитов = Новый Структура("Дата, Номер", "ДокументОснование.Договор.Дата", "ДокументОснование.Договор.Номер");
							Иначе
								ИменаРеквизитов = Новый Структура("Дата, Номер", "Договор.Дата", "Договор.Номер");
							КонецЕсли;
							ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Результат.Документ1С, ИменаРеквизитов);
							
							ОснованиеПередачи.Name = "Договор";
							ОснованиеПередачи.Number = "" + ЗначенияРеквизитов.Номер;
							ОснованиеПередачи.Date = ЗначенияРеквизитов.Дата;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;		
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// } Персианов - 12.08.2023 14:21:17
	

	Результат = Неопределено;
	ВидДокументаРазвернутый = Параметры.ВидДокументаРазвернутый;

	// {т1к Персианов М.С. 27.08.2023 11:58:26
	// Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
	// Включение настройки подписания
	
	ДокЗаполнен = Параметры.Свойство("Результат_ИМ");
	Если ДокЗаполнен Тогда
		Попытка
			ТекДоговор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Результат.Документ1С, "Договор");
		Исключение
			ТекДоговор = Неопределено;
		КонецПопытки;
		ИтоговыйИД = ПолучитьИДСУчетомБазового(ВидДокументаРазвернутый.ID);
		НастройкаПодписания =
				т1кДиадокСервер.НастройкаПодписания(
					ИтоговыйИД,,

					Параметры.Результат.т1кОтправитель.ОрганизацияЭДО,
					Параметры.Результат.т1кПолучатель.ОрганизацияЭДО,
					ТекДоговор);
		Если НастройкаПодписания = Истина ИЛИ НастройкаПодписания = Ложь Тогда
			Параметры.Результат.ЗапрашиватьОтветнуюПодпись = НастройкаПодписания;
		Иначе
			Параметры.Результат.ЗапрашиватьОтветнуюПодпись = НЕ т1кДиадокСервер.ЭтоВидДокументаБезЗапросаПодписиПоУмолчанию(
					Новый Структура("ИдентификаторВида,ТипДокумента,ТипКонтента,Формлизованный,ФункцияДокумента",
						Параметры.ВидДокументаРазвернутый.ID,
						Параметры.ВидДокументаРазвернутый.TypeNamedId,
						Параметры.ВидДокументаРазвернутый.ТипКонтента,
						Параметры.Результат.ОписаниеФорматаКонтента.Формализованный,
						Параметры.ВидДокументаРазвернутый.FunctionName));
		КонецЕсли;
	КонецЕсли;
	// }т1к Персианов М.С. 27.08.2023 11:58:26

	Если ВидДокументаРазвернутый.ID = "ID_ОтчётАгента" Тогда
		ПодготовитьОтчетАгента(Параметры);
		Результат = Истина;
	ИначеЕсли ВидДокументаРазвернутый.ID = "ID_т1кСверка" Тогда
		ПодготовитьСверкаОказанныхУслуг(Параметры);
		Результат = Истина;
    ИначеЕсли ТипЗнч(Параметры) = Тип("Структура") И ДокЗаполнен Тогда
		Content		= Параметры.Результат.Content;
		Документ1С 	= Параметры.Результат.Документ1С;

		ТипКонтента_XDTO = ВидДокументаРазвернутый.ТипКонтента;
		
		//https://diadoc-docs.readthedocs.io/ru/latest/proto/utd/UniversalCorrectionDocumentSellerTitleInfo.html
		ЭтоУКД820 = ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UcdSellerContent");
		ЭтоУПД820 = ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("Utd820SellerContent"); 
	// + шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15	
		ЭтоУПД970 = ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("Utd970SellerContent");
	// - шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15
		
		Если ЭтоУКД820 ИЛИ ЭтоУПД820 ИЛИ ЭтоУПД970 Тогда // Добавлен ЭтоУПД970 // шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15
			// После добавдения процедур на прод убрать попытку и всё, что в исключении
			Попытка
				ЗапросДоработокПечаток = т1кУправлениеПечатью.ЗапросПечатокУПД_УКД_СФ(Документ1С);
			Исключение
				#Область ТЕКСТ_ЗАПРОСА
					ЗапросДоработокПечаток.Текст =
							"ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	СчетФактураВыданный.Ссылка КАК СФ,
							|	ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.РеализацияТоваровУслуг) КАК ДокументОснование
							|ПОМЕСТИТЬ ВТ_РТУ
							|ИЗ
							|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
							|ГДЕ
							|	СчетФактураВыданный.Ссылка В(&ОбъектыПечати)
							|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
							|	И (ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
							|
							|ОБЪЕДИНИТЬ
							|
							|ВЫБРАТЬ
							|	СчетФактураВыданныйДокументыОснования.Ссылка,
							|	ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)
							|ИЗ
							|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
							|ГДЕ
							|	СчетФактураВыданныйДокументыОснования.Ссылка В(&ОбъектыПечати)
							|	И СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
							|	И (ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	СчетФактураВыданный.Ссылка КАК СФ,
							|	ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.ОтчетКомитенту) КАК ДокументОснование
							|ПОМЕСТИТЬ ВТ_ОКомит
							|ИЗ
							|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
							|ГДЕ
							|	СчетФактураВыданный.Ссылка В(&ОбъектыПечати)
							|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
							|	И (ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.ОтчетКомитенту)) <> ЗНАЧЕНИЕ(Документ.ОтчетКомитенту.ПустаяСсылка)
							|
							|ОБЪЕДИНИТЬ
							|
							|ВЫБРАТЬ
							|	СчетФактураВыданныйДокументыОснования.Ссылка,
							|	ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомитенту)
							|ИЗ
							|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
							|ГДЕ
							|	СчетФактураВыданныйДокументыОснования.Ссылка В(&ОбъектыПечати)
							|	И СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
							|	И (ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомитенту)) <> ЗНАЧЕНИЕ(Документ.ОтчетКомитенту.ПустаяСсылка)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	СчетФактураВыданный.Ссылка КАК СФ,
							|	ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.КорректировкаРеализации) КАК ДокументОснование
							|ПОМЕСТИТЬ ВТ_Корр
							|ИЗ
							|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
							|ГДЕ
							|	СчетФактураВыданный.Ссылка В(&ОбъектыПечати)
							|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
							|	И (ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.КорректировкаРеализации)) <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
							|
							|ОБЪЕДИНИТЬ
							|
							|ВЫБРАТЬ
							|	СчетФактураВыданныйДокументыОснования.Ссылка,
							|	ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации)
							|ИЗ
							|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
							|ГДЕ
							|	СчетФактураВыданныйДокументыОснования.Ссылка В(&ОбъектыПечати)
							|	И СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
							|	И (ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации)) <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВТ_РТУ.СФ КАК СФ,
							|	ВТ_РТУ.ДокументОснование КАК ДокументОснование,
							|	""РТУ"" КАК ВидКорректировки
							|ПОМЕСТИТЬ ВТ_СФ
							|ИЗ
							|	ВТ_РТУ КАК ВТ_РТУ
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|
							|ВЫБРАТЬ
							|	ВТ_Корр.СФ,
							|	КорректировкаРеализации.ДокументОснование,
							|	ВЫБОР
							|		КОГДА КорректировкаРеализации.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)
							|			ТОГДА ""ИСПР""
							|		ИНАЧЕ ""КОРР""
							|	КОНЕЦ
							|ИЗ
							|	ВТ_Корр КАК ВТ_Корр
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
							|		ПО ВТ_Корр.ДокументОснование = КорректировкаРеализации.Ссылка
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|
							|ВЫБРАТЬ
							|	РеализацияТоваровУслуг.Ссылка,
							|	РеализацияТоваровУслуг.Ссылка,
							|	""РТУ""
							|ИЗ
							|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
							|ГДЕ
							|	РеализацияТоваровУслуг.Ссылка В(&ОбъектыПечати)
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|
							|ВЫБРАТЬ
							|	КорректировкаРеализации.Ссылка,
							|	КорректировкаРеализации.ДокументОснование,
							|	ВЫБОР
							|		КОГДА КорректировкаРеализации.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)
							|			ТОГДА ""ИСПР""
							|		ИНАЧЕ ""КОРР""
							|	КОНЕЦ
							|ИЗ
							|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
							|ГДЕ
							|	КорректировкаРеализации.Ссылка В(&ОбъектыПечати)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВТ_РТУ.СФ КАК СчетФактура,
							|	ВТ_РТУ.ДокументОснование КАК РТУ,
							|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
							|	РеализацияТоваровУслугТовары.т1кДоговорСПринципалом КАК т1кДоговорСПринципалом
							|ПОМЕСТИТЬ ВтТЧТоварыРТУ
							|ИЗ
							|	ВТ_РТУ КАК ВТ_РТУ
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
							|		ПО ВТ_РТУ.ДокументОснование = РеализацияТоваровУслугТовары.Ссылка
							|ГДЕ
							|	НЕ РеализацияТоваровУслугТовары.т1кДоговорСПринципалом = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВтТЧТоварыРТУ.РТУ КАК РТУ,
							|	МИНИМУМ(ВтТЧТоварыРТУ.НомерСтроки) КАК НомерСтроки
							|ПОМЕСТИТЬ ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала
							|ИЗ
							|	ВтТЧТоварыРТУ КАК ВтТЧТоварыРТУ
							|
							|СГРУППИРОВАТЬ ПО
							|	ВтТЧТоварыРТУ.РТУ
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВтТЧТоварыРТУ.СчетФактура КАК СчетФактура,
							|	ВтТЧТоварыРТУ.РТУ КАК РТУ,
							|	ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод КАК ОтчетныйПериод
							|ПОМЕСТИТЬ ВтОтчетныеПериодыДоговоровПринципалов
							|ИЗ
							|	ВтТЧТоварыРТУ КАК ВтТЧТоварыРТУ
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала КАК ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала
							|		ПО ВтТЧТоварыРТУ.РТУ = ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала.РТУ
							|			И ВтТЧТоварыРТУ.НомерСтроки = ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала.НомерСтроки
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
							|		ПО ((ВЫРАЗИТЬ(ВтТЧТоварыРТУ.т1кДоговорСПринципалом.ВерсияСоглашения КАК Документ.ВерсияСоглашенияКоммерческийДоговор)) = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВтТЧТоварыРТУ
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВТ_РТУ
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВТ_Корр
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВТ_СФ.СФ КАК СФ,
							|	РеализацияТоваровУслуг.Ссылка КАК РТУ,
							|	РеализацияТоваровУслуг.т1кОснование КАК Сверка,
							|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
							|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
							|	ЕСТЬNULL(ВтОтчетныеПериодыДоговоровПринципалов.ОтчетныйПериод, ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод) КАК т1кОтчетныйПериод,
							|	ВЫБОР
							|		КОГДА РеализацияТоваровУслуг.т1кРеализацияПрошлогоПериода
							|			ТОГДА РеализацияТоваровУслуг.т1кФактическаяДатаРеализации
							|		ИНАЧЕ РеализацияТоваровУслуг.Дата
							|	КОНЕЦ КАК ДатаДокумента,
							|	ВТ_СФ.ВидКорректировки КАК ВидКорректировки,
							|	РеализацияТоваровУслуг.Номер КАК НомерРТУ,
							|	РеализацияТоваровУслуг.Дата КАК ДатаРТУ,
							|	ЛОЖЬ КАК ЭтоАгентскоеВознаграждение,
							|	ЛОЖЬ КАК ЭтоОтчетКомитенту,
							|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоПериода,
							|	ДАТАВРЕМЯ(1, 1, 1) КАК КонецПериода
							|ПОМЕСТИТЬ Сверки
							|ИЗ
							|	ВТ_СФ КАК ВТ_СФ
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
							|		ПО ВТ_СФ.ДокументОснование = РеализацияТоваровУслуг.Ссылка
							|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
							|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
							|		ПО ((ВЫРАЗИТЬ(ДоговорыКонтрагентов.ВерсияСоглашения КАК Документ.ВерсияСоглашенияКоммерческийДоговор)) = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
							|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОтчетныеПериодыДоговоровПринципалов КАК ВтОтчетныеПериодыДоговоровПринципалов
							|		ПО ВТ_СФ.СФ = ВтОтчетныеПериодыДоговоровПринципалов.СчетФактура
							|			И ВТ_СФ.ДокументОснование = ВтОтчетныеПериодыДоговоровПринципалов.РТУ
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|
							|ВЫБРАТЬ
							|	ВТ_ОКомит.СФ,
							|	ОтчетКомитенту.Ссылка,
							|	NULL,
							|	ДоговорыКонтрагентов.Номер,
							|	ДоговорыКонтрагентов.Дата,
							|	ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод,
							|	ОтчетКомитенту.Дата,
							|	""ОКомит"",
							|	ОтчетКомитенту.Номер,
							|	ОтчетКомитенту.Дата,
							|	ОтчетКомитенту.Услуга В (&АгентскоеВознаграждение),
							|	ИСТИНА,
							|	ОтчетКомитенту.НачалоПериода,
							|	ОтчетКомитенту.КонецПериода
							|ИЗ
							|	ВТ_ОКомит КАК ВТ_ОКомит
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК ОтчетКомитенту
							|		ПО ВТ_ОКомит.ДокументОснование = ОтчетКомитенту.Ссылка
							|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
							|		ПО (ОтчетКомитенту.Договор = ДоговорыКонтрагентов.Ссылка)
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
							|		ПО ((ВЫРАЗИТЬ(ДоговорыКонтрагентов.ВерсияСоглашения КАК Документ.ВерсияСоглашенияКоммерческийДоговор)) = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВТ_ОКомит
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВТ_СФ
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	Сверки.РТУ КАК РТУ,
							|	Сверки.СФ КАК СФ,
							|	ВЫБОР
							|		КОГДА МАКСИМУМ(ТЧУслуги.Терминал) = МИНИМУМ(ТЧУслуги.Терминал)
							|			ТОГДА МАКСИМУМ(ТЧУслуги.Терминал)
							|		ИНАЧЕ """"
							|	КОНЕЦ КАК Терминал,
							|	Сверки.ЭтоОтчетКомитенту КАК ЭтоОтчетКомитенту,
							|	ВЫБОР
							|		КОГДА Сверки.ЭтоОтчетКомитенту
							|			ТОГДА Сверки.НачалоПериода
							|		ИНАЧЕ ЕСТЬNULL(т1кСверкаОказанныхУслуг.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))
							|	КОНЕЦ КАК ДатаНачала,
							|	ВЫБОР
							|		КОГДА Сверки.ЭтоОтчетКомитенту
							|			ТОГДА Сверки.КонецПериода
							|		ИНАЧЕ ЕСТЬNULL(т1кСверкаОказанныхУслуг.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))
							|	КОНЕЦ КАК ДатаОкончания,
							|	Сверки.НомерДоговора КАК НомерДоговора,
							|	Сверки.ДатаДоговора КАК ДатаДоговора,
							|	Сверки.т1кОтчетныйПериод КАК т1КотЧетныйПериод,
							|	Сверки.ДатаДокумента КАК ДатаДокумента,
							|	Сверки.ВидКорректировки КАК ВидКорректировки,
							|	ЕСТЬNULL(т1кСверкаОказанныхУслуг.УкрупнятьНоменклатуру, ЛОЖЬ) КАК УкрупнятьНоменклатуру,
							|	Сверки.НомерРТУ КАК НомерРТУ,
							|	Сверки.ДатаРТУ КАК ДатаРТУ,
							|	Сверки.ЭтоАгентскоеВознаграждение КАК ЭтоАгентскоеВознаграждение
							|ИЗ
							|	Сверки КАК Сверки
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.т1кСверкаОказанныхУслуг КАК т1кСверкаОказанныхУслуг
							|		ПО Сверки.Сверка = т1кСверкаОказанныхУслуг.Ссылка
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.т1кСверкаОказанныхУслуг.Услуги КАК ТЧУслуги
							|		ПО Сверки.Сверка = ТЧУслуги.Ссылка
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК ОтчетКомитентуТ
							|		ПО Сверки.РТУ = ОтчетКомитентуТ.Ссылка
							|
							|СГРУППИРОВАТЬ ПО
							|	Сверки.РТУ,
							|	Сверки.ЭтоОтчетКомитенту,
							|	Сверки.ЭтоАгентскоеВознаграждение,
							|	т1кСверкаОказанныхУслуг.ДатаНачала,
							|	т1кСверкаОказанныхУслуг.ДатаОкончания,
							|	Сверки.НомерДоговора,
							|	Сверки.СФ,
							|	Сверки.ДатаДоговора,
							|	Сверки.т1кОтчетныйПериод,
							|	Сверки.ДатаДокумента,
							|	Сверки.ВидКорректировки,
							|	Сверки.НачалоПериода,
							|	Сверки.КонецПериода,
							|	Сверки.НомерРТУ,
							|	Сверки.ДатаРТУ,
							|	ЕСТЬNULL(т1кСверкаОказанныхУслуг.УкрупнятьНоменклатуру, ЛОЖЬ)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ Сверки";
				#КонецОбласти 
				УслугиАгентскогоВознаграждения = РегистрыСведений.т1кЗначенияПроизвольныхПараметров.ПолучитьЗначенияПараметров("НоменклатураАгентскогоВознаграждения")["НоменклатураАгентскогоВознаграждения"];
				ЗапросДоработокПечаток.УстановитьПараметр("АгентскоеВознаграждение", УслугиАгентскогоВознаграждения);
				ЗапросДоработокПечаток.УстановитьПараметр("ОбъектыПечати", Документ1С);
			КонецПопытки;
			ДанныеЗапроса = ЗапросДоработокПечаток.ВыполнитьПакет(); 
			ВыборкаСверок = ДанныеЗапроса[ДанныеЗапроса.ВГраница() - 1].Выбрать();
			ПолученыДанныеДоработок = ВыборкаСверок.Следующий();
			Если ПолученыДанныеДоработок Тогда
				Графа12 = т1кУправлениеПечатью.Графа12УПД(ВыборкаСверок);
				ПозДвоеточия = СтрНайти(Графа12, ":");
				Если ПозДвоеточия > 0 Тогда
					Если ЭтоУПД820 или ЭтоУПД970 Тогда // Добавлен ЭтоУПД970 // шх Красавин А.А. 13.03.2025 (00-00012906) Изменение формата счета-фактуры, УПД в соответствии с приказом № ЕД-7-26/970@: e1cib/data/Справочник.Карточка?ref=b933005056bcf87311eeecfe9d671e15
						КлючПараметра = Лев(Графа12, ПозДвоеточия - 1);
						Графа12 = Сред(Графа12, ПозДвоеточия + 1);
						ОсновнойМодуль.ДобавитьИнформационноеПоле(Content.AdditionalInfoId, КлючПараметра, Графа12);
					ИначеЕсли ЭтоУКД820 Тогда
						Content.EventContent.CostChangeInfo = Графа12;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)

	// Формирование своего пакета
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда

		ТЗ  = Параметры.Результат_ИМ;
		
		// порядок параметров: ТЗ, ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента
		#Область КОММЕНТ_СПИСОК_ТИПОВЫХ_ДОКУМЕНТОВ
			//ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd820");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd820");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd820");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd820",	Неопределено,	"ID_СчетФактура");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd820",	"СЧФДОП");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd820",	"СЧФ");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd820",	"ДОП");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd820",	"СЧФДОП",		"ID_УПД");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd820",	"СЧФ",			"ID_УПД_СЧФ");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd820",	"ДОП",			"ID_УПД_ДОП");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет", 							"ProformaInvoice", 						"");
			//ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",	"Счет (формализованный)", 			"ProformaInvoice", 						"xmlproformainvoice");
			//
			//ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");
		#КонецОбласти
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ОтчётАгента", "Отчёт агента", "Nonformalized", "");
		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_т1кСверка", "Сверка оказанных услуг", "Nonformalized", "");
		#Область УДАЛИТЬ
			////{т1к Персианов М.С. 11.08.2023 11:43:40
			////Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
			////Добавляю УПД 1 и 2
			//		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД_СЧФ", "УПД статус_1", "UniversalTransferDocument", "utd820", "СЧФ");
			//		ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД_ДОП", "УПД статус_2", "UniversalTransferDocument", "utd820", "ДОП");
			//		//Почему-то было так:ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД_БезНДС", "УПД статус_2", "UniversalTransferDocument", "utd820", "ДОП");
			////} Персианов - 11.08.2023 11:43:40",
			////Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
		#КонецОбласти
		Возврат ТЗ;

	КонецЕсли;

КонецФункции

#КонецОбласти //Обработчики событий подключаемого модуля

#Область СЛУЖЕБНЫЕ

// Автоматически добавляет документы в пакет
// Параметры:
//  Пакет  - Структура - Формируемыйпакет
//  Документ1С  - ДокументСсылка - Основание пакета
//  Состав  - Строка - ИД документов через запятую
Процедура Автопакет(Пакет, Документ1С, Состав, Индекс = Неопределено)
	мИД = СтрРазделить(Состав, ",", Ложь);
	Если Индекс = Неопределено Тогда
		Для каждого ИД_Документа Из мИД Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, СокрЛП(ИД_Документа));
		КонецЦикла;
	Иначе
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, СокрЛП(мИД[Индекс]));
	КонецЕсли;
КонецПроцедуры // Автопакет

Функция ДокументОснованиеИзМассиваДокументов(МассивДокументов)
	
	Результат = Неопределено;
	
	Если МассивДокументов.Количество() > 0 
			ИЛИ ТипЗнч(МассивДокументов[0]) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МассивДокументов[0], "т1кОснование");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьДокументПередачаТоваровХранителю()
    
    Результат = Ложь;
    
    Если Метаданные.Документы.Найти("ПередачаТоваровХранителю") <> Неопределено Тогда
        Результат = Истина;
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции 

Функция ИмяФайлаПоНомеруСверки(ДокументОснованиеСверка)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснованиеСверка, "НомерРеестра");
	
КонецФункции

Функция ПечатьДобавленаВПакетДокументов(Договор)
	Результат = Ложь;
	ТипОбъекта = "Документ.РеализацияТоваровУслуг";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПечатиОбъектов.Настройки КАК Настройки
		|ИЗ
		|	РегистрСведений.НастройкиПечатиОбъектов КАК НастройкиПечатиОбъектов
		|ГДЕ
		|	НастройкиПечатиОбъектов.ТипОбъекта = &ТипОбъекта
		|	И НастройкиПечатиОбъектов.Организация = &Организация
		|	И НастройкиПечатиОбъектов.Партнер = &Партнер
		|	И НастройкиПечатиОбъектов.т1кДоговор = &т1кДоговор";
	
	Запрос.УстановитьПараметр("Организация", Договор.Организация);
	Запрос.УстановитьПараметр("Партнер", Договор.Партнер);
	Запрос.УстановитьПараметр("т1кДоговор", Договор);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Результат = Выборка.Следующий();
	
	Если Результат Тогда
		ПечатныеФормы = Выборка.Настройки.Получить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Имя", "ВнешняяПечатнаяФорма.т1кПечатьСверкиДиадок");
		Отбор.Вставить("Печатать", Истина);
		
		НайденныеСтроки = ПечатныеФормы.НайтиСтроки(Отбор);
		Результат = НайденныеСтроки.Количество() <> 0;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ПодготовитьОтчетАгента(Параметры)
	
	Результат = Параметры.Результат;
	
	Документ1С					= Результат.Документ1С;
	
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
		
	ПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами");
	ПараметрыПечати.ДополнитьКомплектВнешнимиПечатнымиФормами = Ложь;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Документ1С);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ПараметрыВывода = Новый Структура("ДоступнаПечатьПоКомплектно, ЗаголовокФормы, КодЯзыка, ПараметрыОтправки");
	ПараметрыВывода.ДоступнаПечатьПоКомплектно 	= Ложь;
	ПараметрыВывода.ЗаголовокФормы 				= "";
	ПараметрыВывода.КодЯзыка					= "ru";
	ПараметрыВывода.ПараметрыОтправки 			= Новый Структура("Получатель, Текст, Тема");
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ОтчетКомиссионера");
	
	Обработки.ПечатьОтчетовПоКомиссии.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	ТабличныйДокумент = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
					
	ТабличныйДокумент.Записать(ИмяВремФайла,ТипФайлаТабличногоДокумента.PDF);
		
	Результат.Content.Date		= Документ1С.Дата;
	Результат.Content.Number	= Документ1С.Номер;
	Результат.ИмяФайла			= "Отчет Агента №" + Документ1С.Номер + " от " + Формат(Документ1С.Дата, "ДЛФ=Д") + ".pdf";
    
	Результат.ДвоичныеДанные	= Новый ДвоичныеДанные(ИмяВремФайла);
		
	УдалитьФайлы(ИмяВремФайла);
		
КонецПроцедуры	

Процедура ПодготовитьСверкаОказанныхУслуг(Параметры)
	
	Результат = Параметры.Результат;
	
	Документ1С					= Результат.Документ1С;
	
	АдресДвоичныеДанные = Документы.т1кСверкаОказанныхУслуг.СформироватьXML(Документ1С);
	
	Результат.Content.Date		= Документ1С.Дата;
	Результат.Content.Number	= Документ1С.Номер;
	Результат.ИмяФайла			= "Сверка №" + Документ1С.Номер + " от " + Формат(Документ1С.Дата, "ДЛФ=Д") + ".xml";
    
	Результат.ДвоичныеДанные	= ПолучитьИзВременногоХранилища(АдресДвоичныеДанные);
		
	УдалитьФайлы(АдресДвоичныеДанные);
		
КонецПроцедуры

// Возвращает ИД документа для получения настроек с учётом базового документа
// Параметры:
//  ИсходныйИД  - Строка - Исходный ИД документа
// Возвращаемое значение:
//   Строка   - ИД с учётом базового
Функция ПолучитьИДСУчетомБазового(ИсходныйИД)
	ВидДокумента = ОсновнойМодуль.Ядро.Списки_ОписаниеВидаДокумента(ИсходныйИД);
	ЕстьБазовыйВидДокумента = ЗначениеЗаполнено(ВидДокумента.БазовыйВидДокумента);
	Если ЕстьБазовыйВидДокумента Тогда
        Результат = ВидДокумента.БазовыйВидДокумента;
    Иначе
        Результат = ИсходныйИД;
    КонецЕсли;
	Возврат Результат
КонецФункции // ПолучитьИДСУчетомБазового

Функция  т1кТребуетсяДобавитьКОтправкеСверку(ДокументОснование)
	ТипОснования = ТипЗнч(ДокументОснование);
	Если Не ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			и Не ТипОснования = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование.т1кОснование) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПечатьДобавленаВПакетДокументов(ДокументОснование.Договор) Тогда 
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

#Область ТЕКСТЫ_ЗАПРОСОВ

#Область КОРРЕКТИРОВКА_ТЕКСТОВ

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь", Корректировка = "Ложь")
	
	ТЧ	= "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;

	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК ЭтоИсправление,
	|	&Корректировка КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	Результат = СтрЗаменить(Результат, "&Корректировка", Корректировка);
		
	Если Метаданные.Справочники.Найти("СтавкиНДС") <> Неопределено Тогда
		Результат = СтрЗаменить(Результат, "Перечисление.СтавкиНДС", "Справочник.СтавкиНДС");
	КонецЕсли;

	ДобавитьТекстЗапросаВПакет(Запросы, Результат);
			
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПередачаТоваровХранителю(Запросы)
	
	Результат =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	0 КАК ВсегоПозиций,
	|	0 КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления 
	|   И Док.ХозяйственнаяОперация = Значение(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
                	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);
			
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоДаннымТЧПоУсловию(Запросы, ВидДокумента, ТабличнаяЧасть, Условие)
	
	ТЧ = "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;
	
	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.Ссылка КАК Документ,
		|	0 КАК ВсегоПозиций,
		|	0 КАК ПозицийБезНДС,
		|	Ложь КАК ЭтоИсправление,
		|	Ложь КАК ЭтоКорректировка
		|ИЗ
		|	&Таблица КАК ТабличнаяЧасть
		|ГДЕ
		|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
		|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
	
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);
	
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоОтчетуКомитентуОПродажах(Запросы)
		
	Результат =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	0 КАК ВсегоПозиций,
	|	0 КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.ОтчетКомитенту КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
                	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);
			
КонецПроцедуры

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета, Исправление = Ложь, БезНДС = Ложь)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	ПодстрокаПоиска = "ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета";
	
	Если ОсновнойМодуль.ИспользоватьПодсистемуДиадока()
		И НЕ Исправление 
		И НЕ БезНДС Тогда
		
		Если ЗначениеЗаполнено(КатегорияПакета) Тогда
			ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """";
		Иначе
			ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID;
		КонецЕсли;
		
	Иначе
		ПодстрокаЗамены = "ИСТИНА";
	КонецЕсли;

	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#Область ТЕКСТЫ_ОБЩЕГО_НАЗНАЧЕНИЯ
	
Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Процедура ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса)
	
	Если Запросы.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

#КонецОбласти

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	 
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктВыполненныхРабот", "Услуги");
	
	ТекстОтбораДокументов = " И НЕ ТабличнаяЧасть.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)";
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Товары", ТекстОтбораДокументов);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПрочихАктивов", "Доходы");
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ВозвратТоваровПоставщику", "Товары");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, "Истина");

	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, ,"Истина");

	ТекстОтбораДокументов = " И ТабличнаяЧасть.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)";
	ДокументыБезСФ_ДобавитьТекстЗапросаПоДаннымТЧПоУсловию(Запросы, "РеализацияТоваровУслуг", "Товары", ТекстОтбораДокументов);
	
	ДокументыБезСФ_ДобавитьТекстЗапросаПоОтчетуКомитентуОПродажах(Запросы); 
	
	Если ЕстьДокументПередачаТоваровХранителю() Тогда
		ДокументыБезСФ_ДобавитьТекстЗапросаПередачаТоваровХранителю(Запросы);
	КонецЕсли;
	
	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидКорректировки = 
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидКорректировки = 
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
	|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
	|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СверкаВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И АктСверкиВзаиморасчетов.Проведен
	|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка,
	|	АктСверкиВзаиморасчетов.Номер,
	|	АктСверкиВзаиморасчетов.Дата,
	|	АктСверкиВзаиморасчетов.Контрагент,
	|	АктСверкиВзаиморасчетов.Организация,
	|	0,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СверкаВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Если ОсновнойМодуль.ИспользоватьПодсистемуДиадока() Тогда
		Результат =  ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_Диадок();
	Иначе
		Результат = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_1С();
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_Диадок()
	
//{т1к Персианов М.С. 27.08.2023 11:58:26
//Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
//Добавлены ПакетыДоговоров

	Результат = 
	"ВЫБРАТЬ
	|	ВидыПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВидыПакетов.ID КАК ВидПакетаID,
	|	ВидыПакетов.ПоУмолчанию КАК ПоУмолчанию
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетов
	|ИЗ
	|	&ТаблицаВидовПакетов КАК ВидыПакетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшВидовПакетов.ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетовПоУмолчанию
	|ИЗ
	|	ВТ_КэшВидовПакетов КАК ВТ_КэшВидовПакетов
	|ГДЕ
	|	ВТ_КэшВидовПакетов.ПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Ссылка КАК ВидПакета,
	|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Значение КАК ВидПакетаID,
	|	ВТ_КэшВидовПакетов.КатегорияПакета КАК КатегорияПакета
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетовИзСправочника
	|ИЗ
	|	Справочник.Диадок_ДополнительныеСправочники.ДополнительныеРеквизиты КАК Диадок_ДополнительныеСправочникиДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетов КАК ВТ_КэшВидовПакетов
	|		ПО Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Значение = ВТ_КэшВидовПакетов.ВидПакетаID
	|ГДЕ
	|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Ссылка.ИмяСправочника = ""ВидыПакетов""
	|	И Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.ИмяРеквизита = ""ID""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_НастройкиКонтрагентов.Организация КАК Организация,
	|	Диадок_НастройкиКонтрагентов.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_МоиКонтрагентыЭДО
	|ИЗ
	|	РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
	|ГДЕ
	|	Диадок_НастройкиКонтрагентов.ИмяСвойства = ""Статус""
	|	И Диадок_НастройкиКонтрагентов.Значение = ""IsMyCounteragent""
	|	И Диадок_НастройкиКонтрагентов.Организация.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|	И Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Диадок_НастройкиКонтрагентов.Организация,
	|	Диадок_НастройкиКонтрагентов.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация КАК Организация,
	|	ВТ_МоиКонтрагенты.Контрагент КАК Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК СвязанныйСправочник
	|ПОМЕСТИТЬ ВТ_СопоставленныеОрганизации
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛица.Ссылка
	|			И (Диадок_ЮрФизЛица.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник2
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛица.Ссылка
	|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 <> НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник3
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛица.Ссылка
	|			И (Диадок_ЮрФизЛица.СвязанныйСправочник3 <> НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	ВЫРАЗИТЬ(Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение КАК Справочник.Организации)
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица.ДополнительныеРеквизиты КАК Диадок_ЮрФизЛицаДополнительныеРеквизиты
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛицаДополнительныеРеквизиты.Ссылка
	|			И (Диадок_ЮрФизЛицаДополнительныеРеквизиты.ИмяРеквизита ПОДОБНО &ШаблонИмениРеквизита_СвязанныйСправочник)
	|			И (Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация КАК Организация,
	|	ВТ_МоиКонтрагенты.Контрагент КАК Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК СвязанныйСправочник
	|ПОМЕСТИТЬ ВТ_СопоставленныеКонтрагенты
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛица.Ссылка
	|			И (Диадок_ЮрФизЛица.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник2
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛица.Ссылка
	|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 <> НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник3
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛица.Ссылка
	|			И (Диадок_ЮрФизЛица.СвязанныйСправочник3 <> НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	ВЫРАЗИТЬ(Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение КАК Справочник.Контрагенты)
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица.ДополнительныеРеквизиты КАК Диадок_ЮрФизЛицаДополнительныеРеквизиты
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛицаДополнительныеРеквизиты.Ссылка
	|			И (Диадок_ЮрФизЛицаДополнительныеРеквизиты.ИмяРеквизита ПОДОБНО &ШаблонИмениРеквизита_СвязанныйСправочник)
	|			И (Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СопоставленныеОрганизации.СвязанныйСправочник КАК Организация1С,
	|	ВТ_СопоставленныеКонтрагенты.СвязанныйСправочник КАК Контрагент1С,
	|	ВТ_МоиКонтрагенты.Организация КАК Организация,
	|	ВТ_МоиКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентов
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СопоставленныеОрганизации КАК ВТ_СопоставленныеОрганизации
	|		ПО ВТ_МоиКонтрагенты.Организация = ВТ_СопоставленныеОрганизации.Организация
	|			И ВТ_МоиКонтрагенты.Контрагент = ВТ_СопоставленныеОрганизации.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СопоставленныеКонтрагенты КАК ВТ_СопоставленныеКонтрагенты
	|		ПО ВТ_МоиКонтрагенты.Контрагент = ВТ_СопоставленныеКонтрагенты.Контрагент
	|			И ВТ_МоиКонтрагенты.Организация = ВТ_СопоставленныеКонтрагенты.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентов.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентов.Контрагент1С КАК Контрагент1С,
	|	ВТ_КэшКонтрагентов.Организация КАК Организация,
	|	ВТ_КэшКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшВидовПакетовПоУмолчанию.ВидПакетаID КАК ПоУмолчаниюВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоКатегориям
	|ИЗ
	|	ВТ_КэшКонтрагентов КАК ВТ_КэшКонтрагентов,
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Диадок_ЮрФизЛица_ДопРеквизиты.Ссылка КАК Организация,
	|	ВЫРАЗИТЬ(Диадок_ЮрФизЛица_ДопРеквизиты.Значение КАК БУЛЕВО) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшНастроекОтправкиНепроведенных
	|ИЗ
	|	Справочник.Диадок_ЮрФизЛица.ДополнительныеРеквизиты КАК Диадок_ЮрФизЛица_ДопРеквизиты
	|ГДЕ
	|	Диадок_ЮрФизЛица_ДопРеквизиты.Ссылка.ИмяСправочника = ""Организации""
	|	И Диадок_ЮрФизЛица_ДопРеквизиты.Ссылка.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|	И Диадок_ЮрФизЛица_ДопРеквизиты.ИмяРеквизита = ""ОтправлятьНепроведенныеДокументы""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_НастройкиДоговоров.Договор КАК Договор,
	|	Диадок_НастройкиДоговоров.ИмяСвойства КАК КатегорияПакета,
	|	ЕСТЬNULL(ВТ_КэшВидовПакетовИзСправочника.ВидПакетаID, НЕОПРЕДЕЛЕНО) КАК ВидПакетаID,
	|	Диадок_НастройкиДоговоров.Значение КАК Значение,
	|	ЕСТЬNULL(ВТ_КэшНастроекОтправкиНепроведенных.ОтправлятьНепроведенные, ЛОЖЬ) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ПакетыДоговоров
	|ИЗ
	|	РегистрСведений.т1кДиадок_НастройкиДоговоров КАК Диадок_НастройкиДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетовИзСправочника КАК ВТ_КэшВидовПакетовИзСправочника
	|		ПО Диадок_НастройкиДоговоров.Значение = ВТ_КэшВидовПакетовИзСправочника.ВидПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекОтправкиНепроведенных КАК ВТ_КэшНастроекОтправкиНепроведенных
	|		ПО Диадок_НастройкиДоговоров.Организация = ВТ_КэшНастроекОтправкиНепроведенных.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_НастройкиКонтрагентов.Организация КАК Организация,
	|	Диадок_НастройкиКонтрагентов.Контрагент КАК Контрагент,
	|	Диадок_НастройкиКонтрагентов.ИмяСвойства КАК КатегорияПакета,
	|	Диадок_НастройкиКонтрагентов.Значение КАК ВидПакета,
	|	ЕСТЬNULL(ВТ_КэшВидовПакетовИзСправочника.ВидПакетаID, НЕОПРЕДЕЛЕНО) КАК ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов
	|ИЗ
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
	|		ПО ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета = Диадок_НастройкиКонтрагентов.ИмяСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетовИзСправочника КАК ВТ_КэшВидовПакетовИзСправочника
	|		ПО (Диадок_НастройкиКонтрагентов.Значение = ВТ_КэшВидовПакетовИзСправочника.ВидПакета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.Организация КАК Организация,
	|	ВТ_КэшНастроекВидовПакетов.Контрагент КАК Контрагент,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет1
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.Организация <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|	И ВТ_КэшНастроекВидовПакетов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.Контрагент КАК Контрагент,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет2
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.Организация = ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|	И ВТ_КэшНастроекВидовПакетов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.Организация КАК Организация,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет3
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.Организация <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|	И ВТ_КэшНастроекВидовПакетов.Контрагент = ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентовПоКатегориям.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентовПоКатегориям.Контрагент1С КАК Контрагент1С,
	|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ВТ_КэшНастроекВидовПакетов_Приоритет1.ВидПакетаID, ВТ_КэшНастроекВидовПакетов_Приоритет2.ВидПакетаID), ВТ_КэшНастроекВидовПакетов_Приоритет3.ВидПакетаID), ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID) КАК ВидПакетаID,
	|	ВТ_КэшКонтрагентовПоКатегориям.Организация КАК Организация,
	|	ВТ_КэшКонтрагентовПоКатегориям.Контрагент КАК Контрагент,
	|	ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID КАК ПоУмолчаниюВидПакетаID,
	|	ЕСТЬNULL(ВТ_КэшНастроекОтправкиНепроведенных.ОтправлятьНепроведенные, ЛОЖЬ) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоВидамПакетов
	|ИЗ
	|	ВТ_КэшКонтрагентовПоКатегориям КАК ВТ_КэшКонтрагентовПоКатегориям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет1 КАК ВТ_КэшНастроекВидовПакетов_Приоритет1
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация = ВТ_КэшНастроекВидовПакетов_Приоритет1.Организация
	|			И ВТ_КэшКонтрагентовПоКатегориям.Контрагент = ВТ_КэшНастроекВидовПакетов_Приоритет1.Контрагент
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет1.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет2 КАК ВТ_КэшНастроекВидовПакетов_Приоритет2
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Контрагент = ВТ_КэшНастроекВидовПакетов_Приоритет2.Контрагент
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет2.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет3 КАК ВТ_КэшНастроекВидовПакетов_Приоритет3
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация = ВТ_КэшНастроекВидовПакетов_Приоритет3.Организация
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет3.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекОтправкиНепроведенных КАК ВТ_КэшНастроекОтправкиНепроведенных
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация = ВТ_КэшНастроекОтправкиНепроведенных.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_ПакетыДокументов.Ссылка КАК Ссылка,
	|	Диадок_ПакетыДокументов.Документ КАК Документ,
	|	Диадок_ПакетыДокументов.ВидПакета КАК ВидПакета,
	|	ВТ_КэшВидовПакетов.ВидПакетаID КАК ВидПакетаID,
	|	ВТ_КэшВидовПакетов.КатегорияПакета КАК КатегорияПакета
	|ПОМЕСТИТЬ ВТ_ОтправленныеДокументы
	|ИЗ
	|	Справочник.Диадок_ПакетыДокументов КАК Диадок_ПакетыДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетовИзСправочника КАК ВТ_КэшВидовПакетов
	|		ПО Диадок_ПакетыДокументов.ВидПакета = ВТ_КэшВидовПакетов.ВидПакета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	КатегорияПакета,
	|	ВидПакета";
	
	Возврат Результат;
			
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_1С()
	
	Результат = 
	"ВЫБРАТЬ
	|	ВидыПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВидыПакетов.КатегорияПакетаСсылка КАК КатегорияПакетаСсылка,
	|	ВидыПакетов.ID КАК ВидПакетаID,
	|	ВидыПакетов.ПоУмолчанию КАК ПоУмолчанию
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетов
	|ИЗ
	|	&ТаблицаВидовПакетов КАК ВидыПакетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшВидовПакетов.КатегорияПакета,
	|	ВТ_КэшВидовПакетов.КатегорияПакетаСсылка,
	|	ВТ_КэшВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетовПоУмолчанию
	|ИЗ
	|	ВТ_КэшВидовПакетов КАК ВТ_КэшВидовПакетов
	|ГДЕ
	|	ВТ_КэшВидовПакетов.ПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКонтрагентов.Организация1С КАК Организация1С,
	|	ТаблицаКонтрагентов.Контрагент1С КАК Контрагент1С
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентов
	|ИЗ
	|	&ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентов.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентов.Контрагент1С КАК Контрагент1С,
	|	ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшВидовПакетовПоУмолчанию.ВидПакетаID КАК ПоУмолчаниюВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоКатегориям
	|ИЗ
	|	ВТ_КэшКонтрагентов КАК ВТ_КэшКонтрагентов,
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Организация1С,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияСвойствОбъектов.Значение) = ТИП(СТРОКА)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗначенияСвойствОбъектов.Значение = ""Да""
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК БУЛЕВО)
	|	КОНЕЦ КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшНастроекОтправкиНепроведенных
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЗначенияСвойствОбъектов.Объект) = ТИП(Справочник.Организации)
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство_ОтправлятьНепроведенныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК ЮрЛицо,
	|	ЗначенияСвойствОбъектов.Значение КАК ВидПакетаID,
	|	ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета КАК КатегорияПакета
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов
	|ИЗ
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов
	|		ПО ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакетаСсылка = ЗначенияСвойствОбъектов.Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо КАК Контрагент1С,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет1
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо ССЫЛКА Справочник.Контрагенты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо КАК Организация1С,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет2
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо ССЫЛКА Справочник.Организации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентовПоКатегориям.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентовПоКатегориям.Контрагент1С КАК Контрагент1С,
	|	ЕСТЬNULL(ЕСТЬNULL(ВТ_КэшНастроекВидовПакетов_Приоритет1.ВидПакетаID, ВТ_КэшНастроекВидовПакетов_Приоритет2.ВидПакетаID), ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID) КАК ВидПакетаID,
	|	ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета,
	|	ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID,
	|	ЕСТЬNULL(ВТ_КэшНастроекОтправкиНепроведенных.ОтправлятьНепроведенные, ЛОЖЬ) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоВидамПакетов
	|ИЗ
	|	ВТ_КэшКонтрагентовПоКатегориям КАК ВТ_КэшКонтрагентовПоКатегориям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет1 КАК ВТ_КэшНастроекВидовПакетов_Приоритет1
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Контрагент1С = ВТ_КэшНастроекВидовПакетов_Приоритет1.Контрагент1С
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет1.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет2 КАК ВТ_КэшНастроекВидовПакетов_Приоритет2
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация1С = ВТ_КэшНастроекВидовПакетов_Приоритет2.Организация1С
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет2.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекОтправкиНепроведенных КАК ВТ_КэшНастроекОтправкиНепроведенных
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация1С = ВТ_КэшНастроекОтправкиНепроведенных.Организация1С
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Документ
	|ПОМЕСТИТЬ ВТ_ОтправленныеДокументы
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство В(&СвойстваИдентификаторовДокументов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ";
	
	Возврат Результат;
			
КонецФункции

Функция ТекстЗапроса_ВТДокументыБезНДС()
	
	Результат = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.ЭтоИсправление,
	|	ВТ_ПодходящиеДокументы.ЭтоКорректировка,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL"; 
	
	Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);	
	
	Возврат Результат;
			
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	   		    	        	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;

	Результат =
	"ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
	|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И ВТ_ДокументыБезНДС.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
	|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";	
	    	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(Результат, "И (ВТ_ДокументыБезНДС.ЭтоИсправление)", "И (НЕ ВТ_ДокументыБезНДС.ЭтоИсправление)");
	КонецЕсли;
	
	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		Результат = СтрЗаменить(Результат, "И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)", "И (ВТ_ДокументыБезНДС.ЭтоКорректировка)");
	КонецЕсли;

	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
										   
	Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
									   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
										   
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета,, Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
	|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
	|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
	|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
	|	СчетНаОплатуПокупателю.Организация КАК Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетНаОплатуПокупателю.Проведен
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка,
	|	СчетНаОплатуПокупателю.Номер,
	|	СчетНаОплатуПокупателю.Дата,
	|	СчетНаОплатуПокупателю.Контрагент,
	|	СчетНаОплатуПокупателю.Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат =
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Документ,
	|	СчетФактура.Номер КАК НомерДокумента,
	|	СчетФактура.Дата КАК ДатаДокумента,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетФактура.Проведен
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ОтчетКомиссионера)
	|	И НЕ СчетФактура.Корректировочный
	|	И НЕ СчетФактура.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка,
	|	СчетФактура.Номер,
	|	СчетФактура.Дата,
	|	СчетФактура.Контрагент,
	|	СчетФактура.Организация,
	|	0,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И НЕ СчетФактура.ПометкаУдаления
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ОтчетКомиссионера)
	|	И НЕ СчетФактура.Корректировочный
	|	И НЕ СчетФактура.Исправление";
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
										   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Исправление", "СчетФактура.Исправление");
		
	КонецЕсли;
	
	Если ВидСчетаФактуры = "Корректировочный" Тогда
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Корректировочный", "СчетФактура.Корректировочный");
		
	ИначеЕсли ВидСчетаФактуры = "НаАванс" Тогда	
		
		Результат = СтрЗаменить(Результат, "Документ.СчетФактураВыданный", "Документ.СчетФактураВыданныйАванс");
		Результат = СтрЗаменить(Результат, "И НЕ СчетФактура.Исправление", "");
		Результат = СтрЗаменить(Результат, "И НЕ СчетФактура.Корректировочный", "");
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "НаРеализацию",	ВидСчетаФактуры);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета, Исправление);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаФактурыАгенту(ОписаниеВидаПакета)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат =
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Документ,
	|	СчетФактура.Номер КАК НомерДокумента,
	|	СчетФактура.Дата КАК ДатаДокумента,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураКомиссионеру КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетФактура.Проведен
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ОтчетКомиссионера)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка,
	|	СчетФактура.Номер,
	|	СчетФактура.Дата,
	|	СчетФактура.Контрагент,
	|	СчетФактура.Организация,
	|	0,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураКомиссионеру КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И НЕ СчетФактура.ПометкаУдаления
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ОтчетКомиссионера)";
		
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета, Ложь);
	
	Возврат Результат;
	
КонецФункции
	
Функция ТекстЗапросаПостроенияСпискаПакетовНаОтправку(Параметры)
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";

	НужнаВТДокументыБезНДС = Ложь;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ВидПакетаID		= ОписаниеВидаПакета.ID;
		КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
		
		Если 		ВидПакетаID = "ID_ОсновнойПакет" 
				ИЛИ ВидПакетаID = "ID_УПД"
//{т1к Персианов М.С. 10.08.2023 14:06:01
//Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
////Выполнение обработчиков подсистемы Печать
				ИЛИ ВидПакетаID = "ID_УПД_1"
				ИЛИ ВидПакетаID = "ID_УПД_2"
//} Персианов - 10.08.2023 14:06:01",
//Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d			
				ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Ложь);
			
		ИначеЕсли 	ВидПакетаID = "ID_ПакетДляАгента" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактурыАгенту(ОписаниеВидаПакета);
			
		ИначеЕсли 	ВидПакетаID = "ID_УКД" 
				ИЛИ ВидПакетаID = "ID_УКД_раздельно"
				ИЛИ ВидПакетаID = "ID_УКД_1"
				ИЛИ ВидПакетаID = "ID_УКД_2"
				ИЛИ ВидПакетаID = "ID_КСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Ложь);
			
		ИначеЕсли	ВидПакетаID = "ID_УПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Ложь);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД" 
				ИЛИ ВидПакетаID = "ID_ИУПД_раздельно"
//{т1к Персианов М.С. 01.09.2023 15:57:18
//После формирования реализации для исправления № 1 документы не выходят для отправки по Контур Диадок: e1cib/data/Справочник.Карточка?ref=8652005056b60a3c11ee4731827bc077
//Для новых пакетов УПД нужны исправляемые
				ИЛИ ВидПакетаID = "ID_ИУПД12"
				ИЛИ ВидПакетаID = "ID_ИУПД_2"
				ИЛИ ВидПакетаID = "ID_ИУПД_1"
//} Персианов - 01.09.2023 15:57:18",
//После формирования реализации для исправления № 1 документы не выходят для отправки по Контур Диадок: e1cib/data/Справочник.Карточка?ref=8652005056b60a3c11ee4731827bc077
				ИЛИ ВидПакетаID = "ID_ИСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУКД" 
				ИЛИ ВидПакетаID = "ID_ИУКД_1"
				ИЛИ ВидПакетаID = "ID_ИУКД_2"
				ИЛИ ВидПакетаID = "ID_ИУКД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИКСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_ИСФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" 
				ИЛИ ВидПакетаID = "ID_УПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_ИУПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_УКД_БезНДС" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
			
			НужнаВТДокументыБезНДС = Истина;
			
		ИначеЕсли	ВидПакетаID = "ID_Счет" 
				ИЛИ ВидПакетаID = "ID_СчетФормализованный" Тогда
		
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
			
        ИначеЕсли	ВидПакетаID = "ID_АктСверки" Тогда
						
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
//{т1к Персианов М.С. 27.08.2023 11:58:26

	Если ЗначениеЗаполнено(Результат) Тогда
		
//Настроить в пакете документов на отправку по эдо статус запрашивать подпись контрагента : e1cib/data/Справочник.Карточка?ref=8c95005056bcd6f011ee3dc600931b8f
//Добавлены соединения с ПакетыДоговоров
		т1кДиадокСервер.ДобавитьСоединениеСПакетамиДоговоров(Результат);
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область БСП_ДОПОЛНИТЕЛЬНЫЕ_ОБРАБОТКИ

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ВыполнитьРегламентныеДействияПМ", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции
	
#КонецОбласти

#Область СПЕЦФУНКЦИИ_ДИАДОК
// общие функции подключаемого модуля (БСП и взаимодействие с основным модулем)

Процедура ВыполнитьРегламентныеДействияПМ(Параметры)
	// Регламентные действия, НЕ требующие инициализации основного модуля
КонецПроцедуры

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4;
	
КонецФункции

Процедура ЭДО_СлужебнаяИнформацияГенератораШаблона()

	// Данный метод не выполняет кода и содержит только настройки построителя ПМ в момент генерации кода.
	// Предназначен для облегчения анализа изменений реального кода относительно шаблона.
	
	// ВерсияПостроителя: 0.13.1
	//{ Сценарии
	// Текст запроса построения списка пакетов на отправку (УТ 11)
	// Удаление типовых пакетов
	// Формирование своего пакета
	// Добавление ИнфПолФХЖ1, значения реквизитов
	//} Сценарии

КонецПроцедуры
	
#КонецОбласти

#Область КАРАНТИН

Процедура Удалить_УдалитьЛишниеПакеты(ТЗ)
	
	ИндексСтроки = ТЗ.Количество() - 1;
	
	НужныеID = Новый Массив;
	НужныеID.Добавить("ID_УПД");
	НужныеID.Добавить("ID_ОсновнойПакет");
	
	НужныеID.Добавить("ID_УКД");
	НужныеID.Добавить("ID_КСФ");
	НужныеID.Добавить("ID_ИУПД");
	НужныеID.Добавить("ID_ИСФ");
	
	НужныеID.Добавить("ID_Счет");
	НужныеID.Добавить("ID_АктСверки");

//{т1к Персианов М.С. 02.09.2023 15:55:27
//Карточка: e1cib/list/Справочник.Карточка
//Исправительные нужны. И УПД тоже.
	//НужныеID.Добавить("ID_УПД_раздельно");
	//НужныеID.Добавить("ID_УКД_раздельно");
	//НужныеID.Добавить("ID_ИУПД_раздельно");
	//НужныеID.Добавить("ID_ИУКД_раздельно");
	//НужныеID.Добавить("ID_ИКСФ");
	//НужныеID.Добавить("ID_ИСФ");
	//НужныеID.Добавить("ID_ИУКД");
	//НужныеID.Добавить("ID_УПД_БезНДС");
	//НужныеID.Добавить("ID_ИУПД_БезНДС");
	//НужныеID.Добавить("ID_УКД_БезНДС");
	
	// Получается, что не нужны только  ID_УПД_НаАванс, ID_СчетФормализованный, ID_ИУПД_НаАванс, ID_ИСФ_НаАванс и ID_ТОРГ12_Акт_БезНДС.
	//И плюс добавляемые в обновлениях будут удаляться. Поэтому убираю эту процедуру
//} Персианов - 02.09.2023 15:55:27",
//Карточка: e1cib/list/Справочник.Карточка
	Пока ИндексСтроки >= 0 Цикл
		
		СтрокаТЗ = ТЗ.Получить(ИндексСтроки);
		
		Если НужныеID.Найти(СтрокаТЗ.ID) = Неопределено Тогда
			ТЗ.Удалить(ИндексСтроки);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки - 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Удалить_УПД_ДобавитьИнфПолФХЖ1_ЗначенияРеквизитов(Content, Документ1С, ВыборкаИсточник)
//	
//	//Если ЗначениеЗаполнено(ВыборкаИсточник.НомерДоговора) Тогда
//	//	ОсновнойМодуль.ДобавитьИнформационноеПоле(Content.AdditionalInfoId, "ДОГОВОР", ВыборкаИсточник.НомерДоговора);
//	//КонецЕсли;
//////{т1к Персианов М.С. 10.08.2023 14:06:01
//////Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
////////Исправление ошибки неучтённых типов
////	Д_О = Неопределено;
////	Если ТипЗнч(Документ1С) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
////		т1кОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ1С, "т1кОснование");
////	ИначеЕсли ТипЗнч(Документ1С) <> Тип("ДокументСсылка.СчетФактураВыданный") Тогда
////		т1кОснование = Документы.т1кСверкаОказанныхУслуг.ПустаяСсылка();
//////} Персианов - 10.08.2023 14:06:01",
//////Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d			
////	Иначе
////		Д_О = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ1С, "ДокументОснование");
////		Если ТипЗнч(Д_О) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
////			т1кОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Д_О, "т1кОснование");
////		Иначе
////			т1кОснование = Документы.т1кСверкаОказанныхУслуг.ПустаяСсылка();
////		КонецЕсли;
////	КонецЕсли;
//	//ЗначениеТерминал = ВыборкаИсточник.Терминал;
//	//ЗначениеПериод = "";
//	////// т1к П.В.Малыгин, 2023-03-29 СТ.Интеграции.Интеграция 1С:ERP УХ и Контур Диадок: e1cib/data/Справочник.Карточка?ref=a319005056b64c7311ed9be665643811 {
//	////Выборка = т1кПолучитьЗначениеТерминала(т1кОснование);
//	//	
////	Если Не Выборка = Неопределено Тогда
////		ЗначениеТерминал = Выборка.Терминал;
////		ЗначениеПериод = т1кПолучитьПериодДат(Выборка.ДатаНачала, Выборка.ДатаОкончания);
////	Иначе
//////{т1к Персианов М.С. 16.08.2023 11:59:50
//////Период в сф/УПД на вознаграждение по услугам оформления билетов/багажа: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35b1482f17f3
//////Добавил параметр
////		ЗначениеПериод = т1кПолучитьЗначениеПериодаРТУ(Документ1С, Д_О);
////	КонецЕсли;
//	//
//	//Если ЗначениеЗаполнено(ВыборкаИсточник.Терминал) Тогда 
//	//	ОсновнойМодуль.ДобавитьИнформационноеПоле(Content.AdditionalInfoId, "ТЕРМИНАЛ", ВыборкаИсточник.Терминал);
//	//КонецЕсли;
//	//
//	//Если ЗначениеЗаполнено(ЗначениеПериод) Тогда 
//	//	ОсновнойМодуль.ДобавитьИнформационноеПоле(Content.AdditionalInfoId, "ПЕРИОД", ЗначениеПериод);
//	//КонецЕсли;
//	
//	// Код, написанный сотрудником Диадок
//	//Если ЗначениеЗаполнено(Договор.ВерсияСоглашения.т1кОтчетныйПериод) Тогда
//	//	
//	//	Период = Формат(Документ1С.Дата, "ДФ=ММММ") + " " + Формат(Документ1С.Дата, "ДФ=гггг") + ", " + Договор.ВерсияСоглашения.т1кОтчетныйПериод;
//	//	
//	//	ОсновнойМодуль.ДобавитьИнформационноеПоле(Content.AdditionalInfoId, "ПЕРИОД", Период);
//	//	
//	//Иначе
//	//	
//	//	Период = Формат(Документ1С.Дата, "ДФ=ММММ") + " " + Формат(Документ1С.Дата, "ДФ=гггг");
//	//	
//	//	ОсновнойМодуль.ДобавитьИнформационноеПоле(Content.AdditionalInfoId, "ПЕРИОД", Период);
//	//	
//	//КонецЕсли;
//	
//	// т1к П.В.Малыгин, 2023-03-29 СТ.Интеграции.Интеграция 1С:ERP УХ и Контур Диадок: e1cib/data/Справочник.Карточка?ref=a319005056b64c7311ed9be665643811 }
//		
КонецПроцедуры

Процедура Удалить_УКД_ДобавитьИныеСвИзмСтоим_ЗначенияРеквизитов(Content, Документ1С)
	
	////https://diadoc-docs.readthedocs.io/ru/latest/proto/utd/UniversalCorrectionDocumentSellerTitleInfo.html
	//
	//Договор = Документ1С.Договор;
	//
	//
	//Если ТипЗнч(Документ1С.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	//	т1кОснование = Документ1С.ДокументОснование.т1кОснование;
	//Иначе
	//	т1кОснование = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	//КонецЕсли;
	//
	//ЗначениеТерминал = "";
	//ЗначениеПериод = "";
	//ЗначениеДоговор = "";
	//
	//Если ЗначениеЗаполнено(Договор.Номер) Тогда
	//	ЗначениеДоговор = Договор.Номер;
	//КонецЕсли;

	//
	////Выборка = т1кПолучитьЗначениеТерминала(т1кОснование);
	//	
	//Если Не Выборка = Неопределено Тогда
	//	ЗначениеТерминал = Выборка.Терминал;
	//	ЗначениеПериод = т1кПолучитьПериодДат(Выборка.ДатаНачала, Выборка.ДатаОкончания);
	//Иначе
	//	ЗначениеПериод = т1кПолучитьЗначениеПериодаРТУ(Документ1С);
	//КонецЕсли;

	//МассивСтрок = Новый Массив;
	//
	//Если ЗначениеЗаполнено(ЗначениеДоговор) Тогда
	//	МассивСтрок.Добавить("ДОГОВОР: " + ЗначениеДоговор);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ЗначениеТерминал) Тогда
	//	МассивСтрок.Добавить("ТЕРМИНАЛ: " + ЗначениеТерминал);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ЗначениеПериод) Тогда
	//	МассивСтрок.Добавить("ПЕРИОД: " + ЗначениеПериод);
	//КонецЕсли;
	//
	//ТекстПоля = СтрСоединить(МассивСтрок, ", ");
	//
	//Content.EventContent.CostChangeInfo = ТекстПоля;

КонецПроцедуры

Функция Удалить_т1кПолучитьЗначениеПериодаРТУ(т1кДокумент, ОснованиеСФ = Неопределено)

//	//{т1к Персианов М.С. 16.08.2023 12:34:37
//	//Период в сф/УПД на вознаграждение по услугам оформления билетов/багажа: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35b1482f17f3
//	//НАДО ПЕРЕДЕЛАТЬ В ЕДИНУЮ ПРОЦ с печатками И ПРОВЕРИТЬ ПЕЧАТЬ РТУ!!!
//	
//	//} Персианов - 16.08.2023 12:34:37",
//	//Период в сф/УПД на вознаграждение по услугам оформления билетов/багажа: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35b1482f17f3
////{т1к Персианов М.С. 10.08.2023 14:06:01
////Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d
//////Добавил РТУ
////А вообще может надо т1кУправлениеПечатью.ПериодУПД(ВыбРезультат.ДатаНачала, ВыбРезультат.ДатаОкончания, ВыбРезультат.т1КотЧетныйПериод, ВыбРезультат.ДатаДокумента, НЕ ВыбРезультат.ЭтоОтчетКомитенту)???
//	ТекТип = ТипЗнч(т1кДокумент);
//	ДатаНачала    = Дата(1,1,1);
//	ДатаОкончания = Дата(1,1,1);

//	Если ТекТип = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
//		#Область ЗАТЫЧКА
//			 //Персианов: Надо переделать в единую процедуру с печатью (см. Доработки.УправлениеПечатьюПереопределяемый.ПриПечати)
//			#Область ТЕКСТ_ЗАПРОСА
//				Запрос = Новый Запрос(
//						"ВЫБРАТЬ РАЗЛИЧНЫЕ
//						|	СчетФактураВыданный.Ссылка КАК СФ,
//						|	ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.РеализацияТоваровУслуг) КАК ДокументОснование
//						|ПОМЕСТИТЬ ВТ_РТУ
//						|ИЗ
//						|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
//						|ГДЕ
//						|	СчетФактураВыданный.Ссылка В(&ОбъектыПечати)
//						|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
//						|	И (ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
//						|
//						|ОБЪЕДИНИТЬ
//						|
//						|ВЫБРАТЬ
//						|	СчетФактураВыданныйДокументыОснования.Ссылка,
//						|	ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)
//						|ИЗ
//						|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
//						|ГДЕ
//						|	СчетФактураВыданныйДокументыОснования.Ссылка В(&ОбъектыПечати)
//						|	И СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
//						|	И (ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ РАЗЛИЧНЫЕ
//						|	СчетФактураВыданный.Ссылка КАК СФ,
//						|	ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.ОтчетКомитенту) КАК ДокументОснование
//						|ПОМЕСТИТЬ ВТ_ОКомит
//						|ИЗ
//						|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
//						|ГДЕ
//						|	СчетФактураВыданный.Ссылка В(&ОбъектыПечати)
//						|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
//						|	И (ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.ОтчетКомитенту)) <> ЗНАЧЕНИЕ(Документ.ОтчетКомитенту.ПустаяСсылка)
//						|
//						|ОБЪЕДИНИТЬ
//						|
//						|ВЫБРАТЬ
//						|	СчетФактураВыданныйДокументыОснования.Ссылка,
//						|	ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомитенту)
//						|ИЗ
//						|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
//						|ГДЕ
//						|	СчетФактураВыданныйДокументыОснования.Ссылка В(&ОбъектыПечати)
//						|	И СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
//						|	И (ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомитенту)) <> ЗНАЧЕНИЕ(Документ.ОтчетКомитенту.ПустаяСсылка)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ РАЗЛИЧНЫЕ
//						|	СчетФактураВыданный.Ссылка КАК СФ,
//						|	ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.КорректировкаРеализации) КАК ДокументОснование
//						|ПОМЕСТИТЬ ВТ_Корр
//						|ИЗ
//						|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
//						|ГДЕ
//						|	СчетФактураВыданный.Ссылка В(&ОбъектыПечати)
//						|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
//						|	И (ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.КорректировкаРеализации)) <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
//						|
//						|ОБЪЕДИНИТЬ
//						|
//						|ВЫБРАТЬ
//						|	СчетФактураВыданныйДокументыОснования.Ссылка,
//						|	ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации)
//						|ИЗ
//						|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
//						|ГДЕ
//						|	СчетФактураВыданныйДокументыОснования.Ссылка В(&ОбъектыПечати)
//						|	И СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
//						|	И (ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации)) <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ
//						|	ВТ_РТУ.СФ КАК СФ,
//						|	ВТ_РТУ.ДокументОснование КАК ДокументОснование,
//						|	""РТУ"" КАК ВидКорректировки
//						|ПОМЕСТИТЬ ВТ_СФ
//						|ИЗ
//						|	ВТ_РТУ КАК ВТ_РТУ
//						|
//						|ОБЪЕДИНИТЬ ВСЕ
//						|
//						|ВЫБРАТЬ
//						|	ВТ_Корр.СФ,
//						|	КорректировкаРеализации.ДокументОснование,
//						|	ВЫБОР
//						|		КОГДА КорректировкаРеализации.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)
//						|			ТОГДА ""ИСПР""
//						|		ИНАЧЕ ""КОРР""
//						|	КОНЕЦ
//						|ИЗ
//						|	ВТ_Корр КАК ВТ_Корр
//						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
//						|		ПО ВТ_Корр.ДокументОснование = КорректировкаРеализации.Ссылка
//						|
//						|ОБЪЕДИНИТЬ ВСЕ
//						|
//						|ВЫБРАТЬ
//						|	РеализацияТоваровУслуг.Ссылка,
//						|	РеализацияТоваровУслуг.Ссылка,
//						|	""РТУ""
//						|ИЗ
//						|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//						|ГДЕ
//						|	РеализацияТоваровУслуг.Ссылка В(&ОбъектыПечати)
//						|
//						|ОБЪЕДИНИТЬ ВСЕ
//						|
//						|ВЫБРАТЬ
//						|	КорректировкаРеализации.Ссылка,
//						|	КорректировкаРеализации.ДокументОснование,
//						|	ВЫБОР
//						|		КОГДА КорректировкаРеализации.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)
//						|			ТОГДА ""ИСПР""
//						|		ИНАЧЕ ""КОРР""
//						|	КОНЕЦ
//						|ИЗ
//						|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
//						|ГДЕ
//						|	КорректировкаРеализации.Ссылка В(&ОбъектыПечати)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ
//						|	ВТ_РТУ.СФ КАК СчетФактура,
//						|	ВТ_РТУ.ДокументОснование КАК РТУ,
//						|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
//						|	РеализацияТоваровУслугТовары.т1кДоговорСПринципалом КАК т1кДоговорСПринципалом
//						|ПОМЕСТИТЬ ВтТЧТоварыРТУ
//						|ИЗ
//						|	ВТ_РТУ КАК ВТ_РТУ
//						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
//						|		ПО ВТ_РТУ.ДокументОснование = РеализацияТоваровУслугТовары.Ссылка
//						|ГДЕ
//						|	НЕ РеализацияТоваровУслугТовары.т1кДоговорСПринципалом = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ
//						|	ВтТЧТоварыРТУ.РТУ КАК РТУ,
//						|	МИНИМУМ(ВтТЧТоварыРТУ.НомерСтроки) КАК НомерСтроки
//						|ПОМЕСТИТЬ ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала
//						|ИЗ
//						|	ВтТЧТоварыРТУ КАК ВтТЧТоварыРТУ
//						|
//						|СГРУППИРОВАТЬ ПО
//						|	ВтТЧТоварыРТУ.РТУ
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ
//						|	ВтТЧТоварыРТУ.СчетФактура КАК СчетФактура,
//						|	ВтТЧТоварыРТУ.РТУ КАК РТУ,
//						|	ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод КАК ОтчетныйПериод
//						|ПОМЕСТИТЬ ВтОтчетныеПериодыДоговоровПринципалов
//						|ИЗ
//						|	ВтТЧТоварыРТУ КАК ВтТЧТоварыРТУ
//						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала КАК ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала
//						|		ПО ВтТЧТоварыРТУ.РТУ = ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала.РТУ
//						|			И ВтТЧТоварыРТУ.НомерСтроки = ВтНомераСтрокТЧТоварыРТУДляДоговораПринципала.НомерСтроки
//						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
//						|		ПО ((ВЫРАЗИТЬ(ВтТЧТоварыРТУ.т1кДоговорСПринципалом.ВерсияСоглашения КАК Документ.ВерсияСоглашенияКоммерческийДоговор)) = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|УНИЧТОЖИТЬ ВтТЧТоварыРТУ
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|УНИЧТОЖИТЬ ВТ_РТУ
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|УНИЧТОЖИТЬ ВТ_Корр
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ
//						|	ВТ_СФ.СФ КАК СФ,
//						|	РеализацияТоваровУслуг.Ссылка КАК РТУ,
//						|	РеализацияТоваровУслуг.т1кОснование КАК Сверка,
//						|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
//						|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
//						|	ЕСТЬNULL(ВтОтчетныеПериодыДоговоровПринципалов.ОтчетныйПериод, ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод) КАК т1кОтчетныйПериод,
//						|	ВЫБОР
//						|		КОГДА РеализацияТоваровУслуг.т1кРеализацияПрошлогоПериода
//						|			ТОГДА РеализацияТоваровУслуг.т1кФактическаяДатаРеализации
//						|		ИНАЧЕ РеализацияТоваровУслуг.Дата
//						|	КОНЕЦ КАК ДатаДокумента,
//						|	ВТ_СФ.ВидКорректировки КАК ВидКорректировки,
//						|	РеализацияТоваровУслуг.Номер КАК НомерРТУ,
//						|	РеализацияТоваровУслуг.Дата КАК ДатаРТУ,
//						|	ЛОЖЬ КАК ЭтоАгентскоеВознаграждение
//						|ПОМЕСТИТЬ Сверки
//						|ИЗ
//						|	ВТ_СФ КАК ВТ_СФ
//						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//						|		ПО ВТ_СФ.ДокументОснование = РеализацияТоваровУслуг.Ссылка
//						|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//						|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
//						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
//						|		ПО ((ВЫРАЗИТЬ(ДоговорыКонтрагентов.ВерсияСоглашения КАК Документ.ВерсияСоглашенияКоммерческийДоговор)) = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
//						|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОтчетныеПериодыДоговоровПринципалов КАК ВтОтчетныеПериодыДоговоровПринципалов
//						|		ПО ВТ_СФ.СФ = ВтОтчетныеПериодыДоговоровПринципалов.СчетФактура
//						|			И ВТ_СФ.ДокументОснование = ВтОтчетныеПериодыДоговоровПринципалов.РТУ
//						|
//						|ОБЪЕДИНИТЬ ВСЕ
//						|
//						|ВЫБРАТЬ
//						|	ВТ_ОКомит.СФ,
//						|	ОтчетКомитенту.Ссылка,
//						|	NULL,
//						|	ДоговорыКонтрагентов.Номер,
//						|	ДоговорыКонтрагентов.Дата,
//						|	ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод,
//						|	ОтчетКомитенту.Дата,
//						|	""ОКомит"",
//						|	ОтчетКомитенту.Номер,
//						|	ОтчетКомитенту.Дата,
//						|	ОтчетКомитенту.Услуга В (&АгентскоеВознаграждение)
//						|ИЗ
//						|	ВТ_ОКомит КАК ВТ_ОКомит
//						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК ОтчетКомитенту
//						|		ПО ВТ_ОКомит.ДокументОснование = ОтчетКомитенту.Ссылка
//						|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//						|		ПО (ОтчетКомитенту.Договор = ДоговорыКонтрагентов.Ссылка)
//						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
//						|		ПО ((ВЫРАЗИТЬ(ДоговорыКонтрагентов.ВерсияСоглашения КАК Документ.ВерсияСоглашенияКоммерческийДоговор)) = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|УНИЧТОЖИТЬ ВТ_ОКомит
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|УНИЧТОЖИТЬ ВТ_СФ
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|ВЫБРАТЬ
//						|	Сверки.РТУ КАК РТУ,
//						|	Сверки.СФ КАК СФ,
//						|	ВЫБОР
//						|		КОГДА МАКСИМУМ(ТЧУслуги.Терминал) = МИНИМУМ(ТЧУслуги.Терминал)
//						|			ТОГДА МАКСИМУМ(ТЧУслуги.Терминал)
//						|		ИНАЧЕ """"
//						|	КОНЕЦ КАК Терминал,
//						|	Сверки.РТУ ССЫЛКА Документ.ОтчетКомитенту КАК ЭтоОтчетКомитенту,
//						|	ВЫБОР
//						|		КОГДА Сверки.РТУ ССЫЛКА Документ.ОтчетКомитенту
//						|			ТОГДА ОтчетКомитентуТ.НачалоПериода
//						|		ИНАЧЕ ЕСТЬNULL(т1кСверкаОказанныхУслуг.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))
//						|	КОНЕЦ КАК ДатаНачала,
//						|	ВЫБОР
//						|		КОГДА Сверки.РТУ ССЫЛКА Документ.ОтчетКомитенту
//						|			ТОГДА ОтчетКомитентуТ.КонецПериода
//						|		ИНАЧЕ ЕСТЬNULL(т1кСверкаОказанныхУслуг.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))
//						|	КОНЕЦ КАК ДатаОкончания,
//						|	Сверки.НомерДоговора КАК НомерДоговора,
//						|	Сверки.ДатаДоговора КАК ДатаДоговора,
//						|	Сверки.т1кОтчетныйПериод КАК т1КотЧетныйПериод,
//						|	Сверки.ДатаДокумента КАК ДатаДокумента,
//						|	ТЧУслуги.Номенклатура КАК Номенклатура,
//						|	Сверки.ВидКорректировки КАК ВидКорректировки,
//						|	ЕСТЬNULL(т1кСверкаОказанныхУслуг.УкрупнятьНоменклатуру, ЛОЖЬ) КАК УкрупнятьНоменклатуру,
//						|	Сверки.НомерРТУ КАК НомерРТУ,
//						|	Сверки.ДатаРТУ КАК ДатаРТУ,
//						|	Сверки.ЭтоАгентскоеВознаграждение КАК ЭтоАгентскоеВознаграждение
//						|ИЗ
//						|	Сверки КАК Сверки
//						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.т1кСверкаОказанныхУслуг КАК т1кСверкаОказанныхУслуг
//						|		ПО Сверки.Сверка = т1кСверкаОказанныхУслуг.Ссылка
//						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.т1кСверкаОказанныхУслуг.Услуги КАК ТЧУслуги
//						|		ПО Сверки.Сверка = ТЧУслуги.Ссылка
//						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК ОтчетКомитентуТ
//						|		ПО Сверки.РТУ = ОтчетКомитентуТ.Ссылка
//						|
//						|СГРУППИРОВАТЬ ПО
//						|	Сверки.РТУ,
//						|	Сверки.РТУ ССЫЛКА Документ.ОтчетКомитенту,
//						|	Сверки.ЭтоАгентскоеВознаграждение,
//						|	ВЫБОР
//						|		КОГДА Сверки.РТУ ССЫЛКА Документ.ОтчетКомитенту
//						|			ТОГДА ОтчетКомитентуТ.НачалоПериода
//						|		ИНАЧЕ ЕСТЬNULL(т1кСверкаОказанныхУслуг.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))
//						|	КОНЕЦ,
//						|	ВЫБОР
//						|		КОГДА Сверки.РТУ ССЫЛКА Документ.ОтчетКомитенту
//						|			ТОГДА ОтчетКомитентуТ.КонецПериода
//						|		ИНАЧЕ ЕСТЬNULL(т1кСверкаОказанныхУслуг.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))
//						|	КОНЕЦ,
//						|	Сверки.НомерДоговора,
//						|	Сверки.СФ,
//						|	Сверки.ДатаДоговора,
//						|	Сверки.т1кОтчетныйПериод,
//						|	Сверки.ДатаДокумента,
//						|	ТЧУслуги.Терминал,
//						|	ТЧУслуги.Номенклатура,
//						|	Сверки.ВидКорректировки,
//						|	Сверки.НомерРТУ,
//						|	Сверки.ДатаРТУ,
//						|	ЕСТЬNULL(т1кСверкаОказанныхУслуг.УкрупнятьНоменклатуру, ЛОЖЬ)
//						|;
//						|
//						|////////////////////////////////////////////////////////////////////////////////
//						|УНИЧТОЖИТЬ Сверки");
//						// т1к Назаров А.Ю. 2023-06-22  Печать комплекта к корректировке реализации (техническая): e1cib/data/Справочник.Карточка?ref=8c82005056bcd6f011ee0c15f4a7ab17 { 
//						//Обработка номенклатуры ТД перенесена в механизм исходного формирования ТД
//						//|;
//						//|
//						//|////////////////////////////////////////////////////////////////////////////////
//						//|ВЫБРАТЬ
//						//|	Сверки.СФ КАК СФ,
//						//|	Сверки.РТУ КАК РТУ,
//						//|	Сверки.Сверка КАК Сверка,
//						//|	НоменклатураСпр.т1кУчетПоТерминалам КАК т1кУчетПоТерминалам,
//						//|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
//						//|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
//						//|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика
//						//|ПОМЕСТИТЬ ВТ_ТЧНоменклатураРасчетная
//						//|ИЗ
//						//|	Сверки КАК Сверки
//						//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
//						//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
//						//|			ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураСпр.Ссылка
//						//|		ПО Сверки.РТУ = РеализацияТоваровУслугТовары.Ссылка
//						//|;
//						//|
//						//|////////////////////////////////////////////////////////////////////////////////
//						//|ВЫБРАТЬ
//						//|	ТЧНоменклатура.СФ КАК СФ,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ТЧНоменклатура.НомерСтроки, т1кСверкаОказанныхУслугУслуги.НомерСтроки)) КАК НомерСтроки,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ТЧНоменклатура.Номенклатура, т1кСверкаОказанныхУслугУслуги.Номенклатура)) КАК Номенклатура,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ТЧНоменклатура.Характеристика, т1кСверкаОказанныхУслугУслуги.Характеристика)) КАК Характеристика,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ТЧНоменклатура.т1кУчетПоТерминалам, ЛОЖЬ)) КАК т1кУчетПоТерминалам,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(т1кСверкаОказанныхУслугУслуги.Терминал, """")) КАК Терминал,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(т1кСверкаОказанныхУслугУслуги.НаправлениеПерелета, """")) КАК НаправлениеПерелета,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(т1кСверкаОказанныхУслугУслуги.ЭлементыВСПредставление, """")) КАК ЭлементыВСПредставление,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(т1кСверкаОказанныхУслугУслуги.ВремяСопровожденияЧасов, """")) КАК ВремяСопровожденияЧасов,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(т1кСверкаОказанныхУслугУслуги.ТипВозврата, """")) КАК ТипВозврата,
//						//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(т1кСверкаОказанныхУслугУслуги.ТипОтказа, """")) КАК ТипОтказа
//						//|ИЗ
//						//|	ВТ_ТЧНоменклатураРасчетная КАК ТЧНоменклатура
//						//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.т1кСверкаОказанныхУслуг.Услуги КАК т1кСверкаОказанныхУслугУслуги
//						//|		ПО ТЧНоменклатура.Сверка = т1кСверкаОказанныхУслугУслуги.Ссылка
//						//|			И ТЧНоменклатура.НомерСтроки = т1кСверкаОказанныхУслугУслуги.НомерСтроки
//						//|
//						//|УПОРЯДОЧИТЬ ПО
//						//|	СФ
//						//|;
//						//|
//						//|////////////////////////////////////////////////////////////////////////////////
//						//|УНИЧТОЖИТЬ Сверки" );
//						// }т1к Назаров А.Ю. 2023-06-22  Печать комплекта к корректировке реализации (техническая): e1cib/data/Справочник.Карточка?ref=8c82005056bcd6f011ee0c15f4a7ab17
//			#КонецОбласти 
//			
//			УслугиАгентскогоВознаграждения = РегистрыСведений.т1кЗначенияПроизвольныхПараметров.ПолучитьЗначенияПараметров("НоменклатураАгентскогоВознаграждения")["НоменклатураАгентскогоВознаграждения"];
//			
//			Запрос.УстановитьПараметр("АгентскоеВознаграждение", УслугиАгентскогоВознаграждения);
//			Запрос.УстановитьПараметр("ОбъектыПечати", т1кДокумент);
//			
//			ДанныеЗапроса = Запрос.ВыполнитьПакет(); 
//			ВыборкаСверок = ДанныеЗапроса[ДанныеЗапроса.ВГраница() - 1].Выбрать();
//			ВыборкаСверок.Следующий();
//		#КонецОбласти
//		#Область ЗАКОММЕНТИРОВАНО
//			//Запрос = Новый Запрос;
//			//Запрос.Текст = 
//			//	"ВЫБРАТЬ ПЕРВЫЕ 1
//			//	|	СчетФактураВыданный.Ссылка КАК Ссылка,
//			//	|	ВЫБОР
//			//	|		КОГДА СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
//			//	|			ТОГДА ВЫБОР
//			//	|					КОГДА СчетФактураВыданный.ДокументОснование.т1кРеализацияПрошлогоПериода
//			//	|						ТОГДА СчетФактураВыданный.ДокументОснование.т1кФактическаяДатаРеализации
//			//	|					ИНАЧЕ СчетФактураВыданный.ДокументОснование.Дата
//			//	|				КОНЕЦ
//			//	|		КОГДА СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
//			//	| Тогда СчетФактураВыданный.ДокументОснование.НачалоПериода
//			//	|		ИНАЧЕ СчетФактураВыданный.ДокументОснование.Дата
//			//	|	КОНЕЦ КАК ДатаДокумента,
//			//	|	ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод КАК ОтчетныйПериод
//			//	|ИЗ
//			//	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
//			//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//			//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
//			//	|			ПО ДоговорыКонтрагентов.ВерсияСоглашения = ВерсияСоглашенияКоммерческийДоговор.Ссылка
//			//	|		ПО СчетФактураВыданный.Договор = ДоговорыКонтрагентов.Ссылка
//			//	|ГДЕ
//			//	|	СчетФактураВыданный.Ссылка = &СчетФактура";
//			//
//			//Запрос.УстановитьПараметр("СчетФактура", т1кДокумент);
//		#КонецОбласти
//	Иначе
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//			"ВЫБРАТЬ ПЕРВЫЕ 1
//			|	NULL КАК Ссылка,
//			|	ВЫБОР
//			|		КОГДА РТУ.т1кРеализацияПрошлогоПериода
//			|			ТОГДА РТУ.т1кФактическаяДатаРеализации
//			|		ИНАЧЕ РТУ.Дата
//			|	КОНЕЦ КАК ДатаДокумента,
//			|	ВЫБОР
//			|		КОГДА РТУ.т1кРеализацияПрошлогоПериода
//			|			ТОГДА РТУ.т1кФактическаяДатаРеализации
//			|		ИНАЧЕ РТУ.Дата
//			|	КОНЕЦ КАК ДатаНачала,
//			|	НЕОПРЕДЕЛЕНО КАК ДатаОкончания,
//			|	ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод КАК т1кОтчетныйПериод
//			|ИЗ
//			|	Документ.РеализацияТоваровУслуг КАК РТУ
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//			|		ПО РТУ.Договор = ДоговорыКонтрагентов.Ссылка
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
//			|		ПО (ДоговорыКонтрагентов.ВерсияСоглашения = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
//			|ГДЕ
//			|	РТУ.Ссылка = &РТУ
//			|
//			|ОБЪЕДИНИТЬ ВСЕ
//			|
//			|ВЫБРАТЬ ПЕРВЫЕ 1
//			|	NULL,
//			|	РТУ.Дата,
//			|	РТУ.НачалоПериода,
//			|	РТУ.КонецПериода,
//			|	ВерсияСоглашенияКоммерческийДоговор.т1кОтчетныйПериод
//			|ИЗ
//			|	Документ.ОтчетКомитенту КАК РТУ
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//			|		ПО РТУ.Договор = ДоговорыКонтрагентов.Ссылка
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
//			|		ПО (ДоговорыКонтрагентов.ВерсияСоглашения = ВерсияСоглашенияКоммерческийДоговор.Ссылка)
//			|ГДЕ
//			|	РТУ.Ссылка = &РТУ";
//		
//		Запрос.УстановитьПараметр("РТУ", т1кДокумент);
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		ВыборкаСверок = РезультатЗапроса.Выбрать();
//		ВыборкаСверок.Следующий();
//	КонецЕсли;
////} Персианов - 10.08.2023 14:06:01",
////Некорректная форма УПД1 при выгрузке в ЭДО: e1cib/data/Справочник.Карточка?ref=8c8f005056bcd6f011ee35e3cfac325d			
//	//Сообщить("" + ВыборкаСверок.ДатаНачала + "/" + ВыборкаСверок.Количество() + "/" + т1кДокумент + "/" + ТипЗнч(т1кДокумент) + ЗначениеЗаполнено(т1кДокумент) + "/"
//	//		 + ТипЗнч(УслугиАгентскогоВознаграждения) + ЗначениеЗаполнено(УслугиАгентскогоВознаграждения)); 	
//	Возврат т1кУправлениеПечатью.ПериодУПД(
//					ВыборкаСверок.ДатаНачала,
//					ВыборкаСверок.ДатаОкончания,
//					ВыборкаСверок.т1КотЧетныйПериод,
//					ВыборкаСверок.ДатаДокумента,
//					Ложь);
//	
//	ДатаДокумента = ВыборкаСверок.ДатаДокумента;
//	
//	Если ВыборкаСверок.ОтчетныйПериод = Перечисления.Периодичность.Декада Тогда
//		
//		ГодПериода = Год(ДатаДокумента);
//		МесяцПериода = Месяц(ДатаДокумента);
//		ДеньДо = 1;
//		ДеньПосле = 1;
//		
//		Если День(ДатаДокумента) < 11 Тогда
//			ДеньДо = 1;
//			ДеньПосле = 10;
//		ИначеЕсли День(ДатаДокумента) < 21 Тогда
//			ДеньДо = 11;
//			ДеньПосле = 20;
//		Иначе
//			ДеньДо = 21;
//			ДеньПосле = День(КонецМесяца(ДатаДокумента));
//		КонецЕсли;
//		
//		ДатаНачала    = Дата(ГодПериода, МесяцПериода, ДеньДо);
//		ДатаОкончания = Дата(ГодПериода, МесяцПериода, ДеньПосле);
//		
//	Иначе
//		ДатаНачала = НачалоМесяца(ДатаДокумента);
//		ДатаОкончания = КонецМесяца(ДатаДокумента);
//		
//	КонецЕсли;
//	
//	Возврат т1кПолучитьПериодДат(ДатаНачала, ДатаОкончания);
	
КонецФункции

Функция Удалить_т1кПолучитьЗначениеТерминала(т1кОснование)
	
	//Если Не ЗначениеЗаполнено(т1кОснование) Тогда 
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	т1кСверкаОказанныхУслугУслуги.Ссылка КАК Документ,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ т1кСверкаОказанныхУслугУслуги.Терминал) КАК Количество,
	//|	т1кСверкаОказанныхУслугУслуги.Терминал КАК Терминал
	//|ПОМЕСТИТЬ ВТ_КоличествоСрок
	//|ИЗ
	//|	Документ.т1кСверкаОказанныхУслуг.Услуги КАК т1кСверкаОказанныхУслугУслуги
	//|ГДЕ
	//|	т1кСверкаОказанныхУслугУслуги.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	т1кСверкаОказанныхУслугУслуги.Ссылка,
	//|	т1кСверкаОказанныхУслугУслуги.Терминал
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_КоличествоСрок.Документ КАК Документ,
	//|	МАКСИМУМ(ВТ_КоличествоСрок.Терминал) КАК Терминал
	//|ПОМЕСТИТЬ ВТ_Терминал
	//|ИЗ
	//|	ВТ_КоличествоСрок КАК ВТ_КоличествоСрок
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_КоличествоСрок.Документ
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ВТ_КоличествоСрок.Количество) = 1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	т1кСверкаОказанныхУслуг.Ссылка КАК Ссылка,
	//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТ_Терминал.Терминал, ЗНАЧЕНИЕ(Справочник.т1кТерминалыАэропорта.ПустаяСсылка))) КАК Терминал,
	//|	т1кСверкаОказанныхУслуг.ДатаНачала КАК ДатаНачала,
	//|	т1кСверкаОказанныхУслуг.ДатаОкончания КАК ДатаОкончания
	//|ИЗ
	//|	Документ.т1кСверкаОказанныхУслуг КАК т1кСверкаОказанныхУслуг
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Терминал КАК ВТ_Терминал
	//|		ПО (ВТ_Терминал.Документ = т1кСверкаОказанныхУслуг.Ссылка)
	//|ГДЕ
	//|	т1кСверкаОказанныхУслуг.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	т1кСверкаОказанныхУслуг.Ссылка,
	//|	т1кСверкаОказанныхУслуг.ДатаНачала,
	//|	т1кСверкаОказанныхУслуг.ДатаОкончания,
	//|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТ_Терминал.Терминал, ЗНАЧЕНИЕ(Справочник.т1кТерминалыАэропорта.ПустаяСсылка)))";
	//
	//Запрос.УстановитьПараметр("Ссылка", т1кОснование);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Следующий() Тогда 
	//	Результат = Выборка;
	//Иначе
	//	Результат = Неопределено;
	//КонецЕсли;
	//
	//Возврат Результат;
	
КонецФункции

Функция Удалить_т1кПолучитьПериодДат(ДатаНачала, ДатаОкончания)
	
	//Если ДатаОкончания = Неопределено Тогда
	//	Возврат Формат(ДатаНачала,"ДЛФ=D");
	//КонецЕсли;
	//
	//Возврат СтрШаблон("%1-%2", Формат(ДатаНачала,"ДЛФ=D") ,Формат(ДатаОкончания,"ДЛФ=D"));
	
КонецФункции

#КонецОбласти

#Область РегЗадание // + ШХ
// т1к О.Н.Кошелев, 2023-11-03{ Автоматизация ЭДО: e1cib/data/Справочник.Карточка?ref=b90f005056bc8d5011ee78923fc51ecb
// создавать сф и пту в рег. задании
// стартовать ух согласование для пту

Процедура ВыполнитьРегламентныеДействия(Параметры)
	
КонецПроцедуры

Процедура ВыполнитьСозданиеДокументов(Параметры)
	
	АвтоматическоеСозданиеСвязывание = РегистрыСведений.т1кЗначенияПроизвольныхПараметров.ПолучитьЗначенияПараметров(ПланыВидовХарактеристик.т1кПроизвольныеПараметры.ДиадокАвтоматическоеСозданиеСвязываниеДокументов, Ложь);
	Если Не АвтоматическоеСозданиеСвязывание.ДиадокАвтоматическоеСозданиеСвязываниеДокументов Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыДляСоздания = ОбщегоНазначенияКлиентСервер.МассивЗначений( Метаданные.Документы.ПриобретениеТоваровУслуг.имя);
	метаДокументыДляСоздания = ОбщегоНазначенияКлиентСервер.МассивЗначений( Метаданные.Документы.ПриобретениеТоваровУслуг);

	
	Ядро = Ядро();
	ВидыДокументов = Ядро.ПодключаемыйМодуль_ОбработатьСобытие("ПолучитьТаблицуИспользуемыхВидовДокументов", Новый Структура("")).ВыгрузитьКолонку("ТипДокументаAPI");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВидыДокументов);
	ВидыДокументов = ОбщегоНазначенияКлиентСервер.СократитьМассив(ВидыДокументов, ОбщегоНазначенияКлиентСервер.МассивЗначений("Nonformalized"));
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	т1кДиадокДоговора.Контрагент КАК Контрагент,
	               |	т1кДиадокДоговора.Организация КАК Организация,
	               |	т1кДиадокДоговора.Договор КАК Договор,
	               |	т1кДиадокДоговора.Договор.Номер КАК Номер,
	               |	т1кДиадокДоговора.Договор.Дата КАК Дата,
	               |	т1кДиадокДоговора.Склад КАК Склад,
	               |	т1кДиадокДоговора.Договор.Подразделение КАК ДоговорПодразделение,
	               |	т1кДиадокДоговора.ПериодАнализа КАК ПериодАнализа,
	               |	т1кДиадокДоговора.СоздаватьАвтоматически КАК СоздаватьАвтоматически,
	               |	т1кДиадокДоговора.НомерДоговора КАК НомерДоговораДиадок
	               |ПОМЕСТИТЬ втДоговора
	               |ИЗ
	               |	РегистрСведений.т1кДиадокДоговора КАК т1кДиадокДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДоговора.Контрагент КАК Контрагент,
	               |	втДоговора.Организация КАК Организация,
	               |	МАКСИМУМ(втДоговора.ПериодАнализа) КАК ПериодАнализа
	               |ПОМЕСТИТЬ втПериодАнализа
	               |ИЗ
	               |	втДоговора КАК втДоговора
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДоговора.Контрагент,
	               |	втДоговора.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДоговора.Контрагент КАК Контрагент,
	               |	втДоговора.Организация КАК Организация,
	               |	втДоговора.Договор КАК Договор,
	               |	втДоговора.Номер КАК Номер,
	               |	втДоговора.Дата КАК Дата,
	               |	втДоговора.Склад КАК Склад,
	               |	втДоговора.НомерДоговораДиадок КАК НомерДоговораДиадок,
	               |	втДоговора.СоздаватьАвтоматически КАК СоздаватьАвтоматически,
	               |	втДоговора.ПериодАнализа КАК ПериодАнализа
	               |ИЗ
	               |	втДоговора КАК втДоговора";
	РезультатЗапроса = Запрос.Выполнить();
	Договора = РезультатЗапроса.Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Диадок_Документы.Ссылка КАК Ссылка,
				   |	Диадок_Документы.ДатаЗагрузки КАК ДатаЗагрузки,
	               |	Диадок_Документы.Организация КАК Организация,
	               |	Диадок_Документы.Контрагент КАК Контрагент
	               |ИЗ
	               |	Справочник.Диадок_Документы КАК Диадок_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериодАнализа КАК втПериодАнализа
	               |		ПО Диадок_Документы.Контрагент = втПериодАнализа.Контрагент
	               |			И Диадок_Документы.Организация = втПериодАнализа.Организация
	               |ГДЕ
	               |	НЕ Диадок_Документы.ПометкаУдаления
	               |	И Диадок_Документы.Направление = &Направление
	               |	И Диадок_Документы.Документ = &Документ
	               |	И Диадок_Документы.ТипДокумента В(&ВидыДокументов)
	               |	И Диадок_Документы.ДатаЗагрузки >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -втПериодАнализа.ПериодАнализа), ДЕНЬ)
				   |";
				   
	Запрос.УстановитьПараметр("Направление", "Входящее");
	Запрос.УстановитьПараметр("Документ", Неопределено);
	Запрос.УстановитьПараметр("ВидыДокументов", ВидыДокументов);
	Запрос.УстановитьПараметр("ТипДокумента", Неопределено);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	Сутки = 3600*24;
		
	Пока Выборка.Следующий() Цикл
		
		Документ = Выборка.Ссылка;
		ДокументДД = Ядро.Документ_ДокументИзДанныхСтрокиСписка(Новый Структура("ДокументЭДО", Выборка.Ссылка));
		
		Если НЕ ПроверитьПоТипамДокуметовДиадок(ДокументДД,ДокументыДляСоздания)  ТОгда
			Продолжить;
		КонецЕсли;
		
		ДоговорРеквизиты = РеквизитыДоговораДиадок(ДокументДД);
		Если ДоговорРеквизиты = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыНастройкиПоДоговор = ПолучитьПараметрыНастройкиПоДоговору(Договора, ДоговорРеквизиты, Выборка.Организация, Выборка.Контрагент, Выборка.Ссылка);
		Если ПараметрыНастройкиПоДоговор = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыНастройкиПоДоговор.СоздаватьАвтоматически Тогда 
			
			Если Выборка.ДатаЗагрузки < ТекущаяДата - Сутки * ПараметрыНастройкиПоДоговор.ПериодАнализа Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыПМ = Новый Структура;
			ПараметрыПМ.Вставить("Документ", ДокументДД);
			ПараметрыПМ.Вставить("ИдентификаторОперации", Неопределено);
			ПараметрыПМ.Вставить("ДополнительныеПараметры", Новый Структура("т1кПараметры", ПараметрыНастройкиПоДоговор));
			ПараметрыПМ.Вставить("СоздаватьСчетаФактуры", Ложь);
			РезультатПМ = Ядро.ПодключаемыйМодуль_ОбработатьСобытие("ПолучитьЗаполненныйОбъектДокумента1С", ПараметрыПМ); 
			Если РезультатПМ.ОсновнойОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли; 				
			Если метаДокументыДляСоздания.Найти(РезультатПМ.ОсновнойОбъект.Метаданные()) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатПМ.ОсновнойОбъект.ДополнительныеСвойства, "т1кЕстьОшибкиЗаполнения", Ложь);
			
			Если ЕстьОшибки Тогда
				Успех = Истина;
				Попытка
					РезультатПМ.ОсновнойОбъект.Записать(РежимЗаписиДокумента.Запись); 
				Исключение
					Успех = Ложь;
				КонецПопытки;
				
				Если Успех Тогда
					ДиадокДокумент = Выборка.Ссылка.ПолучитьОбъект();			
					ДиадокДокумент.Документ = РезультатПМ.ОсновнойОбъект.ссылка;
					ДиадокДокумент.Записать();
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			ДокументДД.ДокументУчета = Неопределено;
			
			РезультатСоздания = РезультатСозданияДокументаИБ(ДокументДД, ПараметрыПМ.ДополнительныеПараметры);
			
			Если РезультатСоздания.Ошибка Тогда
				Продолжить;		
			КонецЕсли;
			
			ДокументУчета = РезультатСоздания.Ссылка;
			
		Иначе
			ДокументУчета = РезультатСопоставленияИБ(ДокументДД);
		КонецЕсли;
							
		Если ЗначениеЗаполнено(ДокументУчета) Тогда 
			СтартПроцессовСогласованияУХ(ДокументУчета);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатСопоставленияИБ(ДокументДД)
	
	Ядро = ОсновнойМодуль.Ядро;
	ДокументУчета = Ядро.Документы_СопоставитьДокумент(ДокументДД);
	
	Возврат ДокументУчета;
	
КонецФункции 

Функция РезультатСозданияДокументаИБ(ДокументДД, ДополнительныеПараметры)
	
	Ядро = Ядро(); 
			
	Результат = Новый Структура("Ошибка,Ссылка", Ложь);
	
	ДокументыДД = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументДД);
	Попытка
		Ядро.Документы_СоздатьДокументы(ДокументыДД, Неопределено, ДополнительныеПараметры);
	Исключение
	КонецПопытки;
	Результат.Ошибка = Не ЗначениеЗаполнено(ДокументыДД[0].ДокументУчета);
	Результат.Ссылка = ДокументыДД[0].ДокументУчета;
	
	Возврат Результат;
	
КонецФункции

Процедура СтартПроцессовСогласованияУХ(Ссылка)

	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		Проведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Проведен");
		
		Если Не Проведен Тогда
			Проведен = ПроведениеДокумента(Ссылка);
		КонецЕсли;
		
		Если Проведен Тогда
		
			СостояниеЗаявки = МодульУправленияПроцессамиУХ.ПолучитьОбщийСтатусДляСогласования(Ссылка);
			Если (НЕ СостояниеЗаявки = "Утвержден") И (НЕ СостояниеЗаявки = "НаУтверждении") Тогда
				ИмяСобытия = МодульУправленияПроцессамиУХ.ПринятьКОбработке(, Ссылка);
				Если ИмяСобытия = "ОшибкаИнициализацииМаршрута" Тогда
					Ядро = Ядро();
					ИнформацияОбОшибке = "Ошибка инициализации маршрута согласования";
					//Ядро.Документы_ОшибкаПриСоздании(Ссылка, ИнформацияОбОшибке);
					Ядро.Ошибка_Обработать("Регламентное создание документов Диадок", ИнформацияОбОшибке,, "Ошибка при старте процесса согласования документа " + Ссылка);	
				КонецЕсли;
			Иначе
				// Согласование уже запущено.
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры 

Функция РеквизитыДоговораДиадок(ДокументДД)
	
	Ядро = Ядро();
	ДанныеДокументаЯдро = Ядро.ХранениеДанных_ДанныеХранилища(ДокументДД.Идентификаторы, "ХранилищеКонтента");
	ДанныеДокументаДиадок = Ядро.ГенерацияXML_XML_В_ОбъектXDTO(ДанныеДокументаЯдро.Данные);
	
	////СвПродПер.СвПер.ОснПер.ДатаОсн
	Если СвойствоXDTO(ДанныеДокументаДиадок,"Документ") и СвойствоXDTO(ДанныеДокументаДиадок.Документ,"СвПродПер") и СвойствоXDTO(ДанныеДокументаДиадок.Документ.СвПродПер,"СвПер") и СвойствоXDTO(ДанныеДокументаДиадок.Документ.СвПродПер.СвПер, "ОснПер") Тогда
		
		ДанныеДоговора = ДанныеДокументаДиадок.Документ.СвПродПер.СвПер.ОснПер; 
		Данные = Новый Структура("ДатаОсн, НомОсн, НаимОсн");
		ЗаполнитьЗначенияСвойств(Данные, ДанныеДоговора);
		Результат = Новый Структура("Дата,Номер,Наименование" , Данные.ДатаОсн, Данные.НомОсн, Данные.НаимОсн);
		Если ЗначениеЗаполнено(Результат.Дата) ТОгда
			Результат.Дата = ОбщегоНазначенияКлиентСервер.СтрокаВДату(Результат.Дата);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыНастройкиПоДоговору(Договора, ДоговорРеквизиты, Организация, Контрагент, ДокументДиадок)
	
	СтруктураПоиска = Новый Структура("Организация,Контрагент,НомерДоговораДиадок,Дата", Организация, Контрагент, СокрЛП(ДоговорРеквизиты.Номер), ДоговорРеквизиты.Дата);
	НайденныеДоговора = Договора.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеДоговора.Количество() = 1 Тогда
		Результат = Новый Структура("т1кЭтоРегламентноеСоздание, Договор, Склад, СоздаватьАвтоматически, ПериодАнализа", Истина);
		ЗаполнитьЗначенияСвойств(Результат, НайденныеДоговора[0]);
		Возврат Результат;
	ИначеЕсли НайденныеДоговора.Количество() > 1 Тогда
		ТекстСообщения = СтрШаблон("По документу %1 неоднозначно заведены настройки договора", ДокументДиадок);
		Ядро().Ошибка_Обработать("Регламентное создание документов Диадок", ТекстСообщения,, "Ошибка при определении настройки по документу" + ДокументДиадок);
	КонецЕсли;
	
КонецФункции 

Функция СвойствоXDTO(ДанныеДокументаДиадок,Имя)
	
	Свойство = Новый Структура(Имя);
	ЗаполнитьЗначенияСвойств(Свойство, ДанныеДокументаДиадок);
	Возврат Свойство[Имя] <> Неопределено
КонецФункции

Функция ПроведениеДокумента(Ссылка)
	
	ДокОбъект = Ссылка.ПолучитьОбъект();
	
	Если Не ДокОбъект.ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ДокОбъект.Заблокировать();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Ядро = Ядро();
		Ядро.Ошибка_Обработать("Регламентное создание документов Диадок", ИнформацияОбОшибке,, "Ошибка при проведении документа " + Ссылка);
		//Ядро.Документы_ОшибкаПриСоздании(ДокОбъект, ИнформацияОбОшибке);	
	КонецПопытки;
	
	ДокОбъект.Разблокировать();
	Возврат ДокОбъект.Проведен;
	
КонецФункции 

Функция ПроверитьПоТипамДокуметовДиадок(ДокументДД, ДокументыДляСоздания)

	ПродолжитьАнализ = Ложь;
	Ядро = Ядро();
	СписокТиповДокумента = Ядро.ПодключаемыйМодуль_ОбработатьСобытие("СписокТиповДокументовДляСоздания", Новый Структура("Документ",ДокументДД));
	Для Каждого Док из ДокументыДляСоздания Цикл
		Если СписокТиповДокумента.НайтиПозначению(Док) <> Неопределено Тогда
			ПродолжитьАнализ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПродолжитьАнализ;
	
КонецФункции

Функция Ядро()
	Возврат ОсновнойМодуль.Ядро;
КонецФункции

Функция СопоставитьНоменклатуруПоставщика(Параметры)
	
КонецФункции

#КонецОбласти

