//@strict-types
//@skip-check bsl-variable-name-invalid
//@skip-check method-too-many-params
//@skip-check use-non-recommended-method

////////////////////////////////////////////////////////////////////////////////
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Разработано на базе Коннектор (https://github.com/vbondarevsky/Connector),
// разработанного Vladimir Bondarevskiy. Программный продукт распространяется
// по лицензии Apache 2.0 (http://www.apache.org/licenses/LICENSE-2.0).
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Отправляет GET запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  ПараметрыЗапроса - Неопределено, Соответствие из Строка, Структура - параметры, которые будут отправлены в URL
//  (часть после ?):
//  * Ключ - Строка - ключ параметра в URL.
//  * Значение - Строка, Массив из Строка - значение параметра URL, массив сформирует строку из нескольких
//  параметров: key=value1&key=value2 и т.д.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - Сессия
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция Get(URL, ПараметрыЗапроса = Неопределено, ДополнительныеПараметры = Неопределено,
	Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(ПараметрыЗапроса, Неопределено, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "GET", URL, Параметры);

КонецФункции

// Отправляет OPTIONS запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  ДополнительныеПараметры	 - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - Сессия
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция Options(URL, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Неопределено, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "OPTIONS", URL, Параметры);

КонецФункции

// Отправляет HEAD запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция Head(URL, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Неопределено, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "HEAD", URL, Параметры);

КонецФункции

// Отправляет POST запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Данные - Неопределено, Строка, ДвоичныеДанные - НовыеПараметры.Данные.
//  ДополнительныеПараметры	 - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет
//
Функция Post(URL, Данные = Неопределено, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Данные, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "POST", URL, Параметры);

КонецФункции

// Отправляет PUT запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Данные - Неопределено, Строка, ДвоичныеДанные - НовыеПараметры.Данные.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция Put(URL, Данные = Неопределено, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Данные, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "PUT", URL, Параметры);

КонецФункции

// Отправляет PATCH запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Данные - Неопределено, Строка, ДвоичныеДанные - НовыеПараметры.Данные.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция Patch(URL, Данные = Неопределено, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Данные, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "PATCH", URL, Параметры);

КонецФункции

// Отправляет DELETE запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Данные - Неопределено, Строка, ДвоичныеДанные - НовыеПараметры.Данные.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция Delete(URL, Данные = Неопределено, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Данные, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "DELETE", URL, Параметры);

КонецФункции

// Отправляет данные на указанный адрес для обработки с использованием указанного HTTP-метода.
//
// Параметры:
//  Метод - Строка - имя HTTP-метода для запроса.
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция ВызватьМетод(Метод, URL, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Неопределено, Неопределено));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, Метод, URL, Параметры);

КонецФункции

// Отправляет GET запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  ПараметрыЗапроса - Неопределено, Структура, Соответствие из Строка: См. СоздатьСессию.ПараметрыЗапроса - параметры,
//   которые будут отправлены в URL (часть после ?).
//  ДополнительныеПараметры	 - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Соответствие из Произвольный, Структура - ответ, десериализованный из JSON.
//
Функция GetJson(URL, ПараметрыЗапроса = Неопределено, ДополнительныеПараметры = Неопределено,
	Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(ПараметрыЗапроса, Неопределено, Неопределено));

	ПараметрыПреобразованияJSON = ВыбратьЗначение(Неопределено, Параметры, "ПараметрыПреобразованияJSON",
	Неопределено);

	Возврат КакJson(ВызватьHTTPМетод(ТекущаяСессия, "GET", URL, Параметры), ПараметрыПреобразованияJSON);

КонецФункции

// Отправляет POST запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Json - Структура, Соответствие из Произвольный	 - данные, которые необходимо сериализовать в JSON.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Соответствие из Произвольный, Структура - ответ, десериализованный из JSON.
//
Функция PostJson(URL, Json, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Неопределено, Json));

	ПараметрыПреобразованияJSON = ВыбратьЗначение(Неопределено, Параметры, "ПараметрыПреобразованияJSON",
	Неопределено);

	Возврат КакJson(ВызватьHTTPМетод(ТекущаяСессия, "POST", URL, Параметры), ПараметрыПреобразованияJSON);

КонецФункции

// Отправляет POST запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Json - Структура, Соответствие из Произвольный	 - данные, которые необходимо сериализовать в JSON.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - 
//
Функция PostJsonБезПреобразованияОтвета(URL, Json, ДополнительныеПараметры = Неопределено,
	Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Неопределено, Json));

	Возврат ВызватьHTTPМетод(ТекущаяСессия, "POST", URL, Параметры);

КонецФункции

// Отправляет PUT запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Json - Структура, Соответствие из Произвольный - данные, которые необходимо сериализовать в JSON.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Соответствие из Произвольный, Структура - ответ, десериализованный из JSON.
//
Функция PutJson(URL, Json, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Неопределено, Json));

	ПараметрыПреобразованияJSON = ВыбратьЗначение(Неопределено, Параметры, "ПараметрыПреобразованияJSON",
	Неопределено);
	
	Возврат КакJson(ВызватьHTTPМетод(ТекущаяСессия, "PUT", URL, Параметры), ПараметрыПреобразованияJSON);

КонецФункции

// Отправляет DELETE запрос
//
// Параметры:
//  URL - Строка - URL ресурса, к которому будет отправлен запрос.
//  Json - Структура, Соответствие из Произвольный	 - данные, которые необходимо сериализовать в JSON.
//  ДополнительныеПараметры - Неопределено, Структура: См. НовыеПараметры - 
//  Сессия - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Соответствие из Произвольный, Структура - ответ, десериализованный из JSON.
//
Функция DeleteJson(URL, Json, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ТекущаяСессия = ТекущаяСессия(Сессия);

	Параметры = НовыеПараметры();
	ДополнитьЛок(Параметры, ДополнительныеПараметры);
	ДополнитьЛок(Параметры, ПараметрыИзАргументов(Неопределено, Неопределено, Json));

	ПараметрыПреобразованияJSON = ВыбратьЗначение(Неопределено, Параметры, "ПараметрыПреобразованияJSON",
	Неопределено);
	
	Возврат КакJson(ВызватьHTTPМетод(ТекущаяСессия, "DELETE", URL, Параметры), ПараметрыПреобразованияJSON);

КонецФункции

// Конструктор параметров.
// 
// Возвращаемое значение:
//  Структура - позволяет задать дополнительные параметры:
//  * Заголовки - Соответствие из Строка: См. ЗаголовкиПоУмолчанию - 
//  * Аутентификация - Неопределено, Структура: См. СоздатьСессию.Аутентификация - 
//  * Прокси - Неопределено, ИнтернетПрокси: См. СоздатьСессию.Прокси - 
//  * ПараметрыЗапроса - Неопределено, Структура, Соответствие из Строка -  СоздатьСессию.ПараметрыЗапроса.
//  * ПроверятьSSL - Булево , СертификатыУдостоверяющихЦентровФайл - СоздатьСессию.ПроверятьSSL.
//  * КлиентскийСертификатSSL - СертификатКлиентаФайл, СертификатКлиентаWindows, Неопределено -
//  Значение по умолчанию: Неопределено.
//  * Cookies - Соответствие из Строка: См. СоздатьСессию.Cookies.
//  * Таймаут - Число -
//      время ожидания осуществляемого соединения и операций, в секундах.
//      Значение по умолчанию - 30 сек.
//  * РазрешитьПеренаправление - Булево - 
//      Истина = редиректы будут автоматически разрешены,
//      Ложь = будет выполнен только один запрос к серверу.
//  * Json - Неопределено, Структура, Соответствие из Произвольный - данные, которые необходимо сериализовать в JSON.
//  * ПараметрыПреобразованияJSON - Структура - См. ПолучитьПараметрыПреобразованияJSONПоУмолчанию
//  * Данные - Неопределено, Строка, ДвоичныеДанные - произвольные данные, которые необходимо отправить в запросе.
//  * Файлы - Массив из Структура - файлы, к отправке
//  * МаксимальноеКоличествоПовторов - Число -
//      количество повторных попыток соединения/отправки запроса.
//      Между попытками выполняется задержка, растущая по экспоненте.
//      Но если код состояния один из 413, 429, 503
//      и в ответе есть заголовок Retry-After,
//      то время задержки формируется из значения этого заголовка
//      Значение по умолчанию: 0 - повторы не выполняются.
//  * МаксимальноеВремяПовторов - Число -
//      максимальное общее время (в секундах) отправки запроса с учетом повторов.
//      Значение по умолчанию: 600.
//  * КоэффициентЭкспоненциальнойЗадержки - Число -
//      коэффициент изменения экспоненциальной задержки.
//      1 формирует последовательность задержек: 1, 2, 4, 8 и т.д.
//      2 формируется последовательность задержек: 2, 4, 8, 16 и т.д.
//      Значение по умолчанию: 1.
//  * ПовторятьДляКодовСостояний - Неопределено, Массив из Число -
//      повторы будут выполняться для кодов состояний >= 500.
//      Значение по умолчанию: Неопределено.
//
Функция НовыеПараметры() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("Заголовки", Новый Соответствие);
	Параметры.Вставить("Аутентификация", Неопределено);
	Параметры.Вставить("Прокси", Неопределено);
	Параметры.Вставить("ПараметрыЗапроса", Неопределено);
	Параметры.Вставить("ПроверятьSSL", Истина);
	Параметры.Вставить("КлиентскийСертификатSSL", Неопределено);
	Параметры.Вставить("Cookies", Новый Соответствие);
	Параметры.Вставить("Таймаут", СтандартныйТаймаут());
	Параметры.Вставить("РазрешитьПеренаправление", Истина);
	Параметры.Вставить("Json", Неопределено);
	Параметры.Вставить("ПараметрыПреобразованияJSON", ПолучитьПараметрыПреобразованияJSONПоУмолчанию());
	Параметры.Вставить("Данные", Неопределено);
	Параметры.Вставить("Файлы", Новый Массив);
	Параметры.Вставить("МаксимальноеКоличествоПовторов", 0);
	Параметры.Вставить("МаксимальноеВремяПовторов", 600);
	Параметры.Вставить("КоэффициентЭкспоненциальнойЗадержки", 1);
	Параметры.Вставить("ПовторятьДляКодовСостояний", Неопределено);

	Возврат Параметры;

КонецФункции

// Конструктор описания отправляемого файла.
//
// Параметры:
//  Имя - Строка - имя поля формы.
//  ИмяФайла - Строка - имя файла.
//  Данные - ДвоичныеДанные - двоичные данные файла.
//  Тип - Строка - MIME-тип файла
// 
// Возвращаемое значение:
//  Структура - Новый отправляемый файл:
//  * Имя - Строка - имя поля формы.
//  * ИмяФайла - Строка - имя файла.
//  * Данные - ДвоичныеДанные - двоичные данные файла.
//  * Тип - Строка, Неопределено - MIME-тип файла.
//  * Заголовки - Соответствие из Строка - HTTP заголовки запроса.
//
Функция НовыйОтправляемыйФайл(Имя, ИмяФайла, Данные = Неопределено, Тип = Неопределено) Экспорт

	Файл = Новый Структура;
	Файл.Вставить("Имя", Имя);
	Файл.Вставить("ИмяФайла", ИмяФайла);
	Файл.Вставить("Данные", ?(Данные = Неопределено, Base64Значение(""), Данные));
	Файл.Вставить("Тип", Тип);
	Файл.Вставить("Заголовки", Новый Соответствие);

	Возврат Файл;

КонецФункции

// Создает объект для хранения параметров сессии.
// 
// Возвращаемое значение:
//  Структура - параметры сессии:
//  * Заголовки - Соответствие из Строка - HTTP заголовки запроса.
//  * Аутентификация - Неопределено, Структура - параметры аутентификации запроса:
//  ** ИспользоватьАутентификациюОС - Булево - включает использование аутентификации NTLM или Negotiate.
//  Значение по умолчанию: Ложь.
//  ** Тип - Строка - тип аутентификации. Для Basic Тип можно не указывать.
//  Если Тип = Digest или Basic тогда.
//  ** Пользователь - Строка - имя пользователя.
//  ** Пароль - Строка - пароль пользователя.
//  * Прокси - ИнтернетПрокси, Неопределено - параметры прокси, которые будут использованы при отправке запроса.
//  Значение по умолчанию: Неопределено. При этом если в конфигурации используется БСП,
//  то значения прокси будет взято из БСП.
//  * ПараметрыЗапроса - Структура, Соответствие из Строка - параметры, которые будут отправлены в URL (часть после ?):
//  ** Ключ - Строка - ключ параметра в URL.
//  ** Значение - Строка, Число, Булево, Дата - значение параметра URL
//  * ПроверятьSSL - Булево, СертификатыУдостоверяющихЦентровФайл - Ложь - проверка сертификата сервера не выполняется.
//  * КлиентскийСертификатSSL - СертификатКлиентаФайл, СертификатКлиентаWindows, Неопределено -
//  Значение по умолчанию: Неопределено.
//  * МаксимальноеКоличествоПеренаправлений - Число - максимальное количество редиректов. Защита от зацикливания.
//  Значение по умолчанию = 30.
//  * Cookies - Соответствие из Строка - хранилище cookies:
//  ** Ключ - Строка - Имя cookie
//  ** Значение - Строка - значение cookie
//  * СлужебныеДанные - Структура: см. СоздатьСлужебныеДанные - Служебные данные
//  * Лог - Неопределено, ТекстовыйДокумент - Текстовый документ, куда будет писаться Лог.
//  Если Неопределено, то лог не ведется.
//	* NELПолитика - Структура: см. NEL_СоздатьПолитику - Политика NEL
//
Функция СоздатьСессию() Экспорт

	Сессия = Новый Структура;
	Сессия.Вставить("Заголовки", ЗаголовкиПоУмолчанию());
	Сессия.Вставить("Аутентификация", Неопределено);
	Сессия.Вставить("Прокси", Неопределено);
	Сессия.Вставить("ПараметрыЗапроса", Новый Соответствие);
	Сессия.Вставить("ПроверятьSSL", Истина);
	Сессия.Вставить("КлиентскийСертификатSSL", Неопределено);
	Сессия.Вставить("МаксимальноеКоличествоПеренаправлений", МаксимальноеКоличествоПеренаправлений());
	Сессия.Вставить("Cookies", Новый Соответствие);
	Сессия.Вставить("СлужебныеДанные", СоздатьСлужебныеДанные());
	Сессия.Вставить("Лог", Неопределено);
	Сессия.Вставить("NELПолитика", NEL_СоздатьПолитикуПоУмолчанию());

	Возврат Сессия;

КонецФункции

// Создать индивидуальные настройки прокси для протокола.
// 
// Возвращаемое значение:
//  Структура - настройки прокси для протокола:
// * Сервер - Строка - Сервер прокси
// * Порт - Неопределено, Число - Порт прокси сервера. Пустая строка - порт по-умолчанию
// * Пользователь - Строка - Логин пользователя прокси сервера
// * Пароль - Строка - Пароль пользователя прокси сервера
// * ИспользоватьАутентификациюОС - Булево - использование NTLM-аутентификации
//
Функция СоздатьНастройкиПроксиДляПротокола() Экспорт
	
	ПроксиПротокола = Новый Структура;
	
	ПроксиПротокола.Вставить("Сервер", "");
	ПроксиПротокола.Вставить("Порт", Неопределено);
	ПроксиПротокола.Вставить("Пользователь", "");
	ПроксиПротокола.Вставить("Пароль", "");
	ПроксиПротокола.Вставить("ИспользоватьАутентификациюОС", Истина);
	
	Возврат ПроксиПротокола;
	
КонецФункции

// Создать прокси.
// 
// Возвращаемое значение:
//  Структура - Создать прокси:
// * ИспользоватьСистемныеНастройки - Булево - Использовать системные настройки. Подробности в документации
// * НеИспользоватьПроксиДляЛокальныхАдресов - Булево - Для локальных адресов прокси не используется
// * НеИспользоватьПроксиДляАдресов - Неопределено, Массив из Строка - Массив адресов для которых не используется прокси
// * ПротоколОбщий - Структура - 
// * ПротоколHTTP - Неопределено, Структура - Особые настройки для http
// * ПротоколHTTPS - Неопределено, Структура - Особые настройки для https
//
Функция СоздатьНастройкиПрокси() Экспорт
	
	НастройкиПрокси = Новый Структура;
	НастройкиПрокси.Вставить("ИспользоватьСистемныеНастройки", Истина);
	НастройкиПрокси.Вставить("НеИспользоватьПроксиДляЛокальныхАдресов", Истина);
	НастройкиПрокси.Вставить("НеИспользоватьПроксиДляАдресов", Неопределено);
	
	НастройкиПрокси.Вставить("ПротоколОбщий", СоздатьНастройкиПроксиДляПротокола());
	НастройкиПрокси.Вставить("ПротоколHTTP", Неопределено);
	НастройкиПрокси.Вставить("ПротоколHTTPS", Неопределено);
	
	Возврат НастройкиПрокси;
	
КонецФункции

// Новый ИнтернетПрокси. Создает объект ИнтернетПрокси на основании контракта СоздатьПрокси.
// 
// Параметры:
// НастройкиПрокси - Структура: см. СоздатьНастройкиПрокси - 
// 
// Возвращаемое значение:
//  ИнтернетПрокси, Неопределено - Создать параметры прокси
//
Функция НовыйИнтернетПрокси(НастройкиПрокси) Экспорт
	
	Если НастройкиПрокси.ИспользоватьСистемныеНастройки Тогда
		
		Возврат Новый ИнтернетПрокси(Истина);
		
	КонецЕсли;
	
	Результат = Новый ИнтернетПрокси;
	
	Результат.НеИспользоватьПроксиДляЛокальныхАдресов = НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов;
	
	Если Не НастройкиПрокси.ПротоколОбщий = Неопределено Тогда
		
		МассивПротоколов = Новый Массив(); // Массив из Строка
		МассивПротоколов.Добавить("http");
		МассивПротоколов.Добавить("https");
		
		Для Каждого ПротоколПрокси Из МассивПротоколов Цикл
			
			ЗаполнитьНастройкиПроксиДляПротокола(ПротоколПрокси, НастройкиПрокси.ПротоколОбщий, Результат);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не НастройкиПрокси.ПротоколHTTP = Неопределено Тогда
		
		ЗаполнитьНастройкиПроксиДляПротокола("http", НастройкиПрокси.ПротоколHTTP, Результат);
	
	КонецЕсли;
	
	Если Не НастройкиПрокси.ПротоколHTTPS = Неопределено Тогда
		
		ЗаполнитьНастройкиПроксиДляПротокола("https", НастройкиПрокси.ПротоколHTTPS, Результат);
	
	КонецЕсли;
	
	Если НастройкиПрокси.Свойство("НеИспользоватьПроксиДляАдресов")
		И Не НастройкиПрокси.НеИспользоватьПроксиДляАдресов = Неопределено Тогда
			Для Каждого АдресИсключения Из НастройкиПрокси.НеИспользоватьПроксиДляАдресов Цикл
				
				//@skip-check typed-value-adding-to-untyped-collection
				Результат.НеИспользоватьПроксиДляАдресов.Добавить(АдресИсключения);
				
			КонецЦикла;
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции

// Заполнить настройки прокси для протокола.
// 
// Параметры:
//  ПротоколПрокси - Строка - Протокол прокси
//  НастройкиПроксиПротокола - Структура: см. СоздатьНастройкиПроксиДляПротокола - Настройки прокси протокола
//  ИнтернетПрокси - ИнтернетПрокси - Интернет прокси
//
Процедура ЗаполнитьНастройкиПроксиДляПротокола(ПротоколПрокси, НастройкиПроксиПротокола, ИнтернетПрокси)

	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавноЛок("8.3.7") Тогда
		
		Если ЗначениеЗаполнено(НастройкиПроксиПротокола.Пользователь) Тогда
			
			ИнтернетПрокси.Установить(ПротоколПрокси, НастройкиПроксиПротокола.Сервер, НастройкиПроксиПротокола.Порт,
				НастройкиПроксиПротокола.Пользователь, НастройкиПроксиПротокола.Пароль, Ложь);
			
		Иначе
			
			ИнтернетПрокси.Установить(ПротоколПрокси, НастройкиПроксиПротокола.Сервер, НастройкиПроксиПротокола.Порт,
				 , , НастройкиПроксиПротокола.ИспользоватьАутентификациюОС);
			
		КонецЕсли;
		
	Иначе
		
		ИнтернетПрокси.Установить(ПротоколПрокси, НастройкиПроксиПротокола.Сервер, НастройкиПроксиПротокола.Порт);
		
		Если ЗначениеЗаполнено(НастройкиПроксиПротокола.Пользователь) Тогда
		
			ИнтернетПрокси.Пользователь = НастройкиПроксиПротокола.Пользователь;
			ИнтернетПрокси.Пароль = НастройкиПроксиПротокола.Пароль;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция NEL_СоздатьПолитику()
	
	NEL_Политика = Новый Структура;
	NEL_Политика.Вставить("NEL", NEL_СоздатьЭндпоинтОтчетов());
	NEL_Политика.Вставить("NEL_Домен", "");
	NEL_Политика.Вставить("report_to", NEL_СоздатьГруппуЭндпоинтов()); 
	NEL_Политика.Вставить("NEL_Сессия", Неопределено); 
	NEL_Политика.Вставить("NEL_НеОтправлять", Ложь);
	
	Возврат NEL_Политика;
	
КонецФункции

Функция NEL_СоздатьПолитикуПоУмолчанию()
	
	NEL_ПолитикаПоУмолчанию = NEL_СоздатьПолитику();
	NEL_ПолитикаПоУмолчанию.NEL = NEL_ЭндпоинтОтчетовПоУмолчанию();
	NEL_ПолитикаПоУмолчанию.NEL_Домен = NEL_ДоменПоУмолчанию();
	NEL_ПолитикаПоУмолчанию.report_to = NEL_ГруппаЭндпоинтовПоУмолчанию(); 
	NEL_ПолитикаПоУмолчанию.NEL_НеОтправлять = Ложь;
	
	Возврат NEL_ПолитикаПоУмолчанию;
	
КонецФункции

// Создать служебные данные.
// 
// Возвращаемое значение:
//  Структура - Создать служебные данные:
// * ПараметрыDigest - Неопределено - 
Функция СоздатьСлужебныеДанные()
	
	СлужебныеДанныеЛок = Новый Структура;
	СлужебныеДанныеЛок.Вставить("ПараметрыDigest", Неопределено);
	
	Возврат СлужебныеДанныеЛок
	
КонецФункции

// Создать эндпоинт отчетов.
// 
// Возвращаемое значение:
//  Структура - Создать эндпоинт отчетов:
// * report_to - Строка - Имя группы эндпоит
// * max_age - Число - Время жизни политики NEL, сек.
// * include_subdomains - Булево - (Опционально) Включая поддомены
// * success_fraction - Число - (Опционально) Частота выборки успешных ответов 0-1
// * failure_fraction - Число - (Опционально) Частота выборки ошибочных ответов 0-1
// * request_headers - Соответствие из Строка - (Опционально) Заголовки запроса для отчета
// * response_headers - Соответствие из Строка - (Опционально) Заголовки ответа для отчета
//
Функция NEL_СоздатьЭндпоинтОтчетов()
	
	NEL_ЭндпоинтОтчетов = Новый Структура;
	
	NEL_ЭндпоинтОтчетов.Вставить("report_to", "");
	NEL_ЭндпоинтОтчетов.Вставить("max_age", 0);
	NEL_ЭндпоинтОтчетов.Вставить("include_subdomains", Ложь);
	NEL_ЭндпоинтОтчетов.Вставить("success_fraction", 0);
	NEL_ЭндпоинтОтчетов.Вставить("failure_fraction", 0);
	NEL_ЭндпоинтОтчетов.Вставить("request_headers", Новый Соответствие);
	NEL_ЭндпоинтОтчетов.Вставить("response_headers", Новый Соответствие);
	
	Возврат NEL_ЭндпоинтОтчетов;
	
КонецФункции

// Создать группу эндпоинтов. Report-To
// 
// Возвращаемое значение:
//  Структура - Группа эндпоинтов:
// * group - Строка - (Опционально) Название группы
// * max_age - Число - Время жизни конфигурации, сек.
// * include_subdomains - Булево - (Опционально) Включая поддомены
// * success_fraction - Число - (Опционально) Частота выборки успешных ответов 0-1
// * failure_fraction - Число - (Опционально) Частота выборки ошибочных ответов 0-1
// * request_headers - Соответствие из Строка - (Опционально) Заголовки запроса для отчета
// * response_headers - Соответствие из Строка - (Опционально) Заголовки ответа для отчета
// * endpoints - Массив из Структура:см. NEL_СоздатьЭндпоинт - массив url эндпоинтов
//
Функция NEL_СоздатьГруппуЭндпоинтов()
	
	NEL_ГруппаЭндпоинтов = Новый Структура;
	
	NEL_ГруппаЭндпоинтов.Вставить("group", "");
	NEL_ГруппаЭндпоинтов.Вставить("max_age", 0);
	NEL_ГруппаЭндпоинтов.Вставить("include_subdomains", Ложь);
	NEL_ГруппаЭндпоинтов.Вставить("success_fraction", 0);
	NEL_ГруппаЭндпоинтов.Вставить("failure_fraction", 1);
	NEL_ГруппаЭндпоинтов.Вставить("request_headers", Новый Соответствие);
	NEL_ГруппаЭндпоинтов.Вставить("response_headers", Новый Соответствие);
	NEL_ГруппаЭндпоинтов.Вставить("endpoints", Новый Массив);
	
	Возврат NEL_ГруппаЭндпоинтов;
	
КонецФункции

Функция NEL_ДоменПоУмолчанию()
	
	Возврат "kontur.ru";
	
КонецФункции

Функция NEL_ЭндпоинтОтчетовПоУмолчанию()
	
	NELПоУмолчанию = NEL_СоздатьЭндпоинтОтчетов();
	NELПоУмолчанию.report_to = "nel-poc";
	NELПоУмолчанию.include_subdomains = Истина;
	NELПоУмолчанию.max_age = 86400;
	
	Возврат NELПоУмолчанию;
	
КонецФункции

Функция NEL_ГруппаЭндпоинтовПоУмолчанию()
	
	ГруппаЭндпоинтовПоУмолчанию = NEL_СоздатьГруппуЭндпоинтов();
	ГруппаЭндпоинтовПоУмолчанию.group = "nel-poc";
	ГруппаЭндпоинтовПоУмолчанию.max_age = 86400;
	
	ЭндпоинтПоУмолчанию = NEL_СоздатьЭндпоинт();
	//ЭндпоинтПоУмолчанию.url = "https://nel-reports-poc.kontur.host/network-error";
	ЭндпоинтПоУмолчанию.url = "https://nel.kontur-report.ru/network-error";
	
	ГруппаЭндпоинтовПоУмолчанию.endpoints.Добавить(ЭндпоинтПоУмолчанию);
	
	Возврат ГруппаЭндпоинтовПоУмолчанию;
	
КонецФункции

// NEL создать эндпоинт.
// 
// Возвращаемое значение:
//  Структура - NEL создать эндпоинт:
// * name - Строка - 
// * url - Строка - 
// * failures - Число - 
// * priority - Число - 
// * weight - Число - 
// * retry_after - Null, Число - 
//
Функция NEL_СоздатьЭндпоинт()
	
	NEL_Эндпоинт = Новый Структура;
	
	NEL_Эндпоинт.Вставить("name", "");
	NEL_Эндпоинт.Вставить("url", "");
	NEL_Эндпоинт.Вставить("failures", 0);
	NEL_Эндпоинт.Вставить("priority", 1);
	NEL_Эндпоинт.Вставить("weight", 1);
	NEL_Эндпоинт.Вставить("retry_after", NULL);
	
	Возврат NEL_Эндпоинт;
	
КонецФункции

// NEL создать отчет.
// 
// Возвращаемое значение:
//  Структура - NEL создать отчет:
// * age - Число - 
// * type - Строка - 
// * url - Строка - 
// * user_agent - Строка - 
// * body -  Неопределено
//  - Структура: см. NEL_СоздатьТелоОтчетаDns
//  - Структура: см. NEL_СоздатьТелоОтчетаConnection
//  - Структура: см. NEL_СоздатьТелоОтчетаАpplication
//  - Структура: см. NEL_СоздатьТелоОтчетаOk
//
Функция NEL_СоздатьОтчет()
	
	NEL_Отчет = Новый Структура;
	
	NEL_Отчет.Вставить("age", 0);
	NEL_Отчет.Вставить("type", "network-error");
	NEL_Отчет.Вставить("url", "");
	NEL_Отчет.Вставить("user_agent", Сформировать_user_agent());
	NEL_Отчет.Вставить("body", Неопределено);
	
	Возврат NEL_Отчет;
	
КонецФункции

// NEL создать тело отчета dns.
// 
// Возвращаемое значение:
//  Структура - NEL создать тело отчета dns:
// * sampling_fraction - Число - 
// * elapsed_time - Число - 
// * phase - Строка - 
// * type - Строка: см. NEL_ДопустимыеОшибки_dns - 
// 
Функция NEL_СоздатьТелоОтчетаDns()
	
	NEL_ТелоОтчетаDns = Новый Структура;
	NEL_ТелоОтчетаDns.Вставить("sampling_fraction", 0);
	NEL_ТелоОтчетаDns.Вставить("elapsed_time", 0);
	
	NEL_ТелоОтчетаDns.Вставить("phase", "dns");
	NEL_ТелоОтчетаDns.Вставить("type", "");
	
	Возврат NEL_ТелоОтчетаDns;
	
КонецФункции

// NEL создать тело отчета connection.
// 
// Возвращаемое значение:
//  Структура - NEL создать тело отчета connection:
// * sampling_fraction - Число - 
// * elapsed_time - Число - 
// * phase - Строка - 
// * type - Строка: см. NEL_ДопустимыеОшибки_connection - 
// * server_ip - Строка - 
// * protocol - Строка - 
// 
Функция NEL_СоздатьТелоОтчетаConnection()
	
	NEL_ТелоОтчетаConnection = Новый Структура;
	NEL_ТелоОтчетаConnection.Вставить("sampling_fraction", 0);
	NEL_ТелоОтчетаConnection.Вставить("elapsed_time", 0);

	NEL_ТелоОтчетаConnection.Вставить("phase", "connection");
	NEL_ТелоОтчетаConnection.Вставить("type", "");

	NEL_ТелоОтчетаConnection.Вставить("server_ip", ""); 
	NEL_ТелоОтчетаConnection.Вставить("protocol", "http/1.1"); 
	
	Возврат NEL_ТелоОтчетаConnection;
	
КонецФункции

// NEL создать тело отчета application.
// 
// Возвращаемое значение:
//  Структура - NEL создать тело отчета application:
// * sampling_fraction - Число - 
// * elapsed_time - Число - 
// * phase - Строка - 
// * type - Строка: см. NEL_ДопустимыеОшибки_application - 
// * server_ip - Строка - 
// * protocol - Строка - 
// * referrer - Строка - 
// * method - Строка - 
// * request_headers - Строка - 
// * response_headers - Строка - 
// * status_code - Число - 
// 
Функция NEL_СоздатьТелоОтчетаАpplication()
	
	NEL_ТелоОтчетаApplication = Новый Структура;
	
	NEL_ТелоОтчетаApplication.Вставить("sampling_fraction", 0);
	NEL_ТелоОтчетаApplication.Вставить("elapsed_time", 0);

	NEL_ТелоОтчетаApplication.Вставить("phase", "application");
	NEL_ТелоОтчетаApplication.Вставить("type", "");

	NEL_ТелоОтчетаApplication.Вставить("server_ip", ""); 
	NEL_ТелоОтчетаApplication.Вставить("protocol", "http/1.1");
	 
	NEL_ТелоОтчетаApplication.Вставить("referrer", ""); 
	NEL_ТелоОтчетаApplication.Вставить("method", ""); 
	NEL_ТелоОтчетаApplication.Вставить("request_headers", ""); 
	NEL_ТелоОтчетаApplication.Вставить("response_headers", ""); 
	NEL_ТелоОтчетаApplication.Вставить("status_code", 0); 
	
	Возврат NEL_ТелоОтчетаApplication;
	
КонецФункции

Функция NEL_СоздатьТелоОтчетаOk()
	
	NEL_ТелоОтчетаOk = Новый Структура;
	
	NEL_ТелоОтчетаOk.Вставить("sampling_fraction", 0);
	NEL_ТелоОтчетаOk.Вставить("elapsed_time", 0);

	NEL_ТелоОтчетаOk.Вставить("phase", "application");
	NEL_ТелоОтчетаOk.Вставить("type", "ok");

	NEL_ТелоОтчетаOk.Вставить("server_ip", ""); 
	NEL_ТелоОтчетаOk.Вставить("protocol", "http/1.1"); 
	
	NEL_ТелоОтчетаOk.Вставить("referrer", ""); 
	NEL_ТелоОтчетаOk.Вставить("method", ""); 
	NEL_ТелоОтчетаOk.Вставить("request_headers", ""); 
	NEL_ТелоОтчетаOk.Вставить("response_headers", ""); 
	NEL_ТелоОтчетаOk.Вставить("status_code", 0);
	 
	Возврат NEL_ТелоОтчетаOk;
	
КонецФункции

// NEL допустимые фазы отчета.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из Строка - NEL допустимые фазы отчета:
// * Ключ - Строка - Фаза отчета
// * Значение - Строка - Тип отчета
// 
Функция NEL_ДопустимыеФазыОтчета()
	
	ДопустимыеФазыОтчета = Новый Соответствие; // Соответствие из Строка
	
	ДопустимыеФазыОтчета.Вставить("dns", "dns");
	ДопустимыеФазыОтчета.Вставить("connection", "connection");
	ДопустимыеФазыОтчета.Вставить("application", "application");
	ДопустимыеФазыОтчета.Вставить("application_ok", "application");
	
	Возврат Новый ФиксированноеСоответствие(ДопустимыеФазыОтчета);
	
КонецФункции

Функция NEL_ДопустимыеОшибкиDns()
	
	ДопустимыеОшибкиDns = Новый Массив; // Массив из Строка
	
	ДопустимыеОшибкиDns.Добавить("dns.unreachable");
	ДопустимыеОшибкиDns.Добавить("dns.name_not_resolved");
	ДопустимыеОшибкиDns.Добавить("dns.failed");
	ДопустимыеОшибкиDns.Добавить("dns.address_changed");
	
	Возврат Новый ФиксированныйМассив(ДопустимыеОшибкиDns);
	
КонецФункции

Функция NEL_ДопустимыеОшибкиConnection()
	
	ДопустимыеОшибкиConnection = Новый Массив; // Массив из Строка
	
	ДопустимыеОшибкиConnection.Добавить("tcp.timed_out");
	ДопустимыеОшибкиConnection.Добавить("tcp.closed");
	ДопустимыеОшибкиConnection.Добавить("tcp.reset");
	ДопустимыеОшибкиConnection.Добавить("tcp.refused");
	ДопустимыеОшибкиConnection.Добавить("tcp.aborted");
	ДопустимыеОшибкиConnection.Добавить("tcp.address_invalid");
	ДопустимыеОшибкиConnection.Добавить("tcp.address_unreachable");
	ДопустимыеОшибкиConnection.Добавить("tcp.failed");
	
	ДопустимыеОшибкиConnection.Добавить("tls.version_or_cipher_mismatch");
	ДопустимыеОшибкиConnection.Добавить("tls.bad_client_auth_cert");
	ДопустимыеОшибкиConnection.Добавить("tls.cert.name_invalid");
	ДопустимыеОшибкиConnection.Добавить("tls.cert.date_invalid");
	ДопустимыеОшибкиConnection.Добавить("tls.cert.authority_invalid");
	ДопустимыеОшибкиConnection.Добавить("tls.cert.invalid");
	ДопустимыеОшибкиConnection.Добавить("tls.cert.revoked");
	ДопустимыеОшибкиConnection.Добавить("tls.cert.pinned_key_not_in_cert_chain");
	ДопустимыеОшибкиConnection.Добавить("tls.protocol.error");
	ДопустимыеОшибкиConnection.Добавить("tls.failed");
	
	Возврат Новый ФиксированныйМассив(ДопустимыеОшибкиConnection);
	
КонецФункции

Функция NEL_ДопустимыеОшибкиApplication()
	
	ДопустимыеОшибкиApplication = Новый Массив; // Массив из Строка
	
	ДопустимыеОшибкиApplication.Добавить("http.error");
	ДопустимыеОшибкиApplication.Добавить("http.protocol.error");
	ДопустимыеОшибкиApplication.Добавить("http.response.invalid");
	ДопустимыеОшибкиApplication.Добавить("http.response.redirect_loop");
	ДопустимыеОшибкиApplication.Добавить("http.failed");
	ДопустимыеОшибкиApplication.Добавить("abandoned");
	ДопустимыеОшибкиApplication.Добавить("unknown");
	
	Возврат Новый ФиксированныйМассив(ДопустимыеОшибкиApplication);
	
КонецФункции

// Пакет ответа результата вызова метода HTTP.
// 
// Возвращаемое значение:
//  Структура - пакет ответа:
//  * Метод - Строка - имя HTTP-метода запроса
//  * URL - Строка - итоговый URL, по которому был выполнен запрос.
//  * КодСостояния - Число - Код состояния ответа..
//  * Заголовки - Соответствие из Строка - Заголовки ответа.
//  * ТелоКакДвоичныеДанные - ДвоичныеДанные - Тело ответа двоичные данные.
//  * Кодировка - Строка, КодировкаТекста - код кодировки ответа.
//  * ВремяВыполнения - Число, Неопределено - время выполнения запроса в миллисекундах.
//  * ЭтоПостоянныйРедирект - Булево - указывает что это постоянный редирект.
//  * ЭтоРедирект - Булево - указывает что это редирект.
//  * Cookies - Соответствие из Строка - хранилище cookies:
//  ** Ключ - Строка - Имя cookie
//  ** Значение - Строка - значение cookie
//  * Ошибки - Массив из Строка - Список ошибок возникших в ходе выполнения запроса.
//  
Функция НовыйОтвет() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Метод", "GET");
	Результат.Вставить("URL", "");
	Результат.Вставить("КодСостояния", 600); // Сетевая ошибка (>500)
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("ТелоКакДвоичныеДанные", Base64Значение(""));
	Результат.Вставить("Кодировка", "UTF-8");
	Результат.Вставить("ВремяВыполнения", Неопределено);
	Результат.Вставить("ЭтоПостоянныйРедирект", Ложь);
	Результат.Вставить("ЭтоРедирект", Ложь);
	Результат.Вставить("Cookies", Новый Соответствие);
	Результат.Вставить("Ошибки", Новый Массив);

	Возврат Результат;

КонецФункции

// Возвращает ответ сервера в виде десериализованного значения JSON.
//
// Параметры:
//  Ответ						 - Структура: См. НовыйОтвет
//  ПараметрыПреобразованияJSON	 - Неопределено, Структура: См. ПолучитьПараметрыПреобразованияJSONПоУмолчанию - задает параметры преобразования JSON:
// 
// Возвращаемое значение:
//  Соответствие из Строка - ответ сервера в виде десериализованного значения JSON.
//  Если ПараметрыПреобразования.ПрочитатьВСоответствие = Истина (по умолчанию).
//
Функция КакJson(Ответ, ПараметрыПреобразованияJSON = Неопределено) Экспорт

	Попытка
		
		Возврат JsonВОбъект(РаспаковатьОтвет(Ответ), Ответ.Кодировка, ПараметрыПреобразованияJSON);
		
	Исключение
		
		ВызватьИсключение КакИсключение(Ответ,
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Ошибка при десериализации JSON. Описание: %1'"),
				ОписаниеОшибки()
			)
		);
		
	КонецПопытки;

КонецФункции

// Возвращает ответ сервера в виде текста.
//
// Параметры:
//  Ответ		 - Структура			 - См. НовыйОтвет
//  Кодировка	 - Строка, КодировкаТекста	 - определяет кодировку текста.
//  	Если значение не задано, то кодировка извлекается из Ответ.Кодировка.
// 
// Возвращаемое значение:
//  Строка - ответ сервера в виде текста.
//
Функция КакТекст(Ответ, Кодировка = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Кодировка) Тогда
		
		Кодировка = Ответ.Кодировка;
		
	КонецЕсли;

	Возврат ПолучитьСтрокуИзДвоичныхДанныхЛок(РаспаковатьОтвет(Ответ), Кодировка);
	
КонецФункции

// Возвращает ответ сервера в двоичных данных.
//
// Параметры:
//  Ответ	 - Структура - См. НовыйОтвет
// 
// Возвращаемое значение:
//  ДвоичныеДанные - ответ сервера в виде двоичных данных.
//
Функция КакДвоичныеДанные(Ответ) Экспорт

	Возврат РаспаковатьОтвет(Ответ);

КонецФункции

// Возвращает ответ сервера в XDTO.
//
// Параметры:
//  Ответ - Структура: См. НовыйОтвет - 
//  ПараметрыЧтенияXML - ПараметрыЧтенияXML - Параметры чтения, которые будут использованы при чтении данных XML
//  НаборСхемXML - НаборСхемXML - Набор схем XML, используемых при проверке читаемого документа XML
//  Если набор схем указан, но не проверен и включена проверка документа XML, то будет выполнена проверка набора схем.
//  Кодировка - Строка, КодировкаТекста, Неопределено - Позволяет задать кодировку.
// 
// Возвращаемое значение:
//  ОбъектXDTO, СписокXDTO - тип возвращаемого значения может быть любым из поддерживаемых сериализацию в XDTO.
//
Функция КакXDTO(Ответ, ПараметрыЧтенияXML = Неопределено, НаборСхемXML = Неопределено,
	Кодировка = Неопределено) Экспорт

	Попытка
		
		ДвоичныеДанные = РаспаковатьОтвет(Ответ);

		ПотокДляЧтения = ДвоичныеДанные.ОткрытьПотокДляЧтения();

		Если Не ЗначениеЗаполнено(Кодировка) Тогда
			
			Кодировка = Ответ.Кодировка;
			
		КонецЕсли;

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьПоток(ПотокДляЧтения, ПараметрыЧтенияXML, НаборСхемXML, Кодировка);

		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		
	Исключение
		
		ВызватьИсключение КакИсключение(Ответ, НСтр("ru = 'Ошибка при десериализации XDTO.'"));
		
	КонецПопытки;

	Возврат ОбъектXDTO;

КонецФункции

// Возвращает ответ сервера в виде текста предназначенного для использования в ВызватьИсключение.
//
// Параметры:
//  Ответ - Структура: См. НовыйОтвет - 
//  ТекстДляПользователя - Строка	 - Текст пояснения причины для пользователя.
// 
// Возвращаемое значение:
//  Строка - ответ сервера в виде текста исключения.
//
Функция КакИсключение(Ответ, Знач ТекстДляПользователя = "") Экспорт

	ТекстИсключения = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
		НСтр("ru = 'HTTP %1 %2 %3'"),
		Ответ.Метод,
		Ответ.URL,
		ПредставлениеКодаСостоянияHTTP(Ответ.КодСостояния)
	);

	ТелоОтвета = ВырезатьТекст(КакТекст(Ответ));

	Если Не ПустаяСтрока(ТелоОтвета) Тогда
		
		ТекстИсключения = ТекстИсключения + Символы.ПС
			+ КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Тело ответа: %1'"),
				ТелоОтвета
			);
		
	КонецЕсли;

	Если Ответ.Ошибки.Количество() Тогда
		
		ТекстИсключения = ТекстИсключения + Символы.ПС + Символы.ПС
			+ КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Ответ.Ошибки, Символы.ПС + Символы.ПС);
		
	КонецЕсли;

	Если Не ПустаяСтрока(ТекстДляПользователя) Тогда
		
		ТекстИсключения = ТекстДляПользователя + Символы.ПС + Символы.ПС + ТекстИсключения;
		
	КонецЕсли;

	Возврат ТекстИсключения;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебный программный интерфейс

Функция ЧислоИзСтрокиЛок(Знач Строка) Экспорт

	ОписаниеТипа = Новый ОписаниеТипов("Число");
	Возврат ОписаниеТипа.ПривестиЗначение(Строка);

КонецФункции

Функция ДатаИзСтрокиЛок(Знач Строка) Экспорт

	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	ОписаниеТипа = Новый ОписаниеТипов("Дата", Неопределено, Неопределено, КвалификаторДаты);
	Возврат ОписаниеТипа.ПривестиЗначение(Строка);

КонецФункции

// Дата из строки RFC7231.
// 
// Параметры:
//  СтрокаДаты - Строка - Строка даты формата RFC7231
// 
// Возвращаемое значение:
//  Дата - Дата из строки RFC7231
//  
Функция ДатаИзСтрокиRFC7231(Знач СтрокаДаты) Экспорт

	Разделители = ",-:/\.";
	
	Для Индекс = 1 По СтрДлина(Разделители) Цикл
		
		Разделитель = Сред(Разделители, Индекс, 1);
		СтрокаДаты = СтрЗаменить(СтрокаДаты, Разделитель, " ");
		
	КонецЦикла;
	
	СтрокаДаты = СтрЗаменить(СтрокаДаты, "  ", " ");

	СоставляющиеДаты = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(СтрокаДаты, " ");
	
	МесяцСтр = СоставляющиеДаты[2];

	Месяцы = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок("Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec", ",");
	
	Месяц = Месяцы.Найти(МесяцСтр);
	
	Если Месяц = Неопределено Тогда
		
		Возврат '00010101';
		
	КонецЕсли;

	Дата = СоставляющиеДаты[3] + Формат(Месяц + 1, "ЧЦ=2; ЧВН=;") + СоставляющиеДаты[1];
	Время = СоставляющиеДаты[4] + СоставляющиеДаты[5] + СоставляющиеДаты[6];

	Возврат ДатаИзСтрокиЛок(Дата + Время);

КонецФункции

// Преобразует значение типа к типу, сериализация которого поддерживается.
//
// Параметры:
//  Свойство				 - Строка		 - имя свойства, если выполняется запись структуры или соответствия.
//  Значение				 - Произвольный	 - исходное значение.
//  ДополнительныеПараметры	 - Произвольный	 - дополнительные параметры, которые указаны в вызове метода ЗаписатьJSON.
//  Отказ					 - Булево		 - отказ от записи свойства.
// 
// Возвращаемое значение:
//  Строка - 
//
Функция ПреобразованиеJson(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт

	Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		
		Возврат Строка(Значение);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		
		Возврат Base64Строка(Значение);
		
	Иначе
		
		// Если значение не поддерживает сериализацию в JSON, то будет выброшено исключение
		Возврат Значение;
		
	КонецЕсли;

КонецФункции

// Восстанавливает значение типа, десериализация которого не поддерживается.
//
// Параметры:
//  Свойство	 - Строка		 - имя свойства, значение которого нужно восстановить.
//  Значение	 - Строка		 - значение, которое нужно восстановить.
//  ТипыСвойств	 - Соответствие из Строка	 - типы свойств, которые нужно восстановить:
//  	* Ключ - Строка - имя свойства. Равно значению параметра Свойство.
//  	* Значение - Тип - исходный тип значения.
// 
// Возвращаемое значение:
//  Произвольный - восстановленное значение.
//
Функция ВосстановлениеJson(Свойство, Значение, ТипыСвойств) Экспорт

	ТипСвойства = ТипыСвойств.Получить(Свойство);
	
	Если ТипСвойства = Тип("УникальныйИдентификатор") Тогда
		
		Возврат Новый УникальныйИдентификатор(Значение);
		
	ИначеЕсли ТипСвойства = Тип("ДвоичныеДанные") Тогда
		
		Возврат Base64Значение(Значение);
		
	Иначе
		
		Возврат Значение;
		
	КонецЕсли;

КонецФункции

// Получить строку из двоичных данных.
//
// Параметры:
//  ВходящиеДвоичныеДанные	 - ДвоичныеДанные			 - Входящие Двоичные данные
//  Кодировка				 - Строка, КодировкаТекста, Неопределено - Кодировка текста файла
// 
// Возвращаемое значение:
//  Строка - Строка из двоичных данных
//
Функция ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Кодировка = Неопределено) Экспорт
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Кодировка);
		
	Иначе
		
		Возврат КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Кодировка);
		
	КонецЕсли;
	
КонецФункции

// Получить двоичные данные из строки.
//
// Параметры:
//  ВходящаяСтрока	 - Строка			 - Входящая строка
//  Кодировка		 - Строка, КодировкаТекста	 - Кодировка текста
//  ЗаписатьBOM		 - Булево					 - Записать BOM
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Двоичные данные из строки
//
Функция ПолучитьДвоичныеДанныеИзСтрокиЛок(ВходящаяСтрока, Кодировка = "UTF-8", ЗаписатьBOM = Ложь) Экспорт
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.ПолучитьДвоичныеДанныеИзСтрокиЛок(ВходящаяСтрока, Кодировка, ЗаписатьBOM);
		
	Иначе
		
		Возврат КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПолучитьДвоичныеДанныеИзСтрокиЛок(ВходящаяСтрока, Кодировка, ЗаписатьBOM);
		
	КонецЕсли;

КонецФункции

// Возвращает структурированное представление URL.
//
// Параметры:
//  URL	 - Строка	 - URL ресурса, к которому будет отправлен запрос.
// 
// Возвращаемое значение:
//  Структура - структура URL:
//  * Схема - Строка - схема обращения к серверу (http, https).
//  * Аутентификация - Структура - параметры аутентификации:
//  ** Пользователь - Строка - имя пользователя.
//  ** Пароль - Строка - пароль пользователя.
//  * Сервер - Строка - адрес сервера.
//  * Порт - Число - порт сервера.
//  * Путь - Строка - адрес ресурса на сервере.
//  * ПараметрыЗапроса - Соответствие из Строка - параметры запроса передаваемые на сервер в URL (часть после ?):
//  ** Ключ - Строка - ключ параметра в URL.
//  ** Значение - Строка, Массив из Строка - значение параметра URL;
//  * Фрагмент - Строка - часть URL после #.
//
Функция РазобратьURL(Знач URL) Экспорт

	Схема = "";
	Путь = "";
	Аутентификация = Новый Структура("Пользователь, Пароль", "", "");
	Сервер = "";
	ПортСтрока = "";
	Фрагмент = "";

	ДопустимыеСхемы = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок("http,https", ",");

	URLБезСхемы = URL;
	РазбитьСтрокуПоРазделителюЛок(Схема, URLБезСхемы, "://");
	
	Если ДопустимыеСхемы.Найти(НРег(Схема)) <> Неопределено Тогда
		
		URL = URLБезСхемы;
		
	Иначе
		
		Схема = "";
		
	КонецЕсли;

	URLВМассиве = РазделитьПоПервомуНайденномуРазделителюЛок(URL, КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок("/,?,#", ","));
	
	URL = URLВМассиве[0];
	
	Если ЗначениеЗаполнено(URLВМассиве[2]) Тогда
		
		Путь = URLВМассиве[2] + URLВМассиве[1];
		
	КонецЕсли;

	АутентификацияСтрока = "";
	РазбитьСтрокуПоРазделителюЛок(АутентификацияСтрока, URL, "@");
	
	Если ЗначениеЗаполнено(АутентификацияСтрока) Тогда
		
		АутентификацияЧасти = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(АутентификацияСтрока, ":");
		
		Аутентификация.Пользователь = АутентификацияЧасти[0];
		
		Если АутентификацияЧасти.Количество() > 1 Тогда
			
			Аутентификация.Пароль = АутентификацияЧасти[1];
			
		КонецЕсли;
		
	КонецЕсли;

	// IPv6
	РазбитьСтрокуПоРазделителюЛок(Сервер, URL, "]");
	
	Если ЗначениеЗаполнено(Сервер) Тогда
		
		Сервер = Сервер + "]";
		
	КонецЕсли;

	URL = СтрЗаменить(URL, "/", "");

	РазбитьСтрокуПоРазделителюЛок(ПортСтрока, URL, ":", Истина);

	Если Не ЗначениеЗаполнено(Сервер) Тогда
		
		Сервер = URL;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ПортСтрока) Тогда
		
		Порт = Число(ПортСтрока);
		
	Иначе
		
		Порт = 0;
		
	КонецЕсли;

	РазбитьСтрокуПоРазделителюЛок(Фрагмент, Путь, "#", Истина);

	ПараметрыЗапроса = ЗаполнитьПараметрыЗапросаЛок(Путь);

	Если Не ЗначениеЗаполнено(Схема) Тогда
		
		Схема = "http";
		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Путь) Тогда
		
		Путь = "/";
		
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Аутентификация", Аутентификация);
	Результат.Вставить("Сервер", Сервер);
	Результат.Вставить("Порт", Порт);
	Результат.Вставить("Путь", Путь);
	Результат.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	Результат.Вставить("Фрагмент", Фрагмент);

	Возврат Результат;

КонецФункции

// Возвращает структуру именованных кодов состояний HTTP.
// 
// Возвращаемое значение:
//  Структура - именованные коды состояний HTTP:
//  * Ключ - Строка -
//  * Значение - Число -
//
Функция КодыСостоянияHTTP() Экспорт

	КодыСостояния = Новый Структура;
	
	Для Каждого Описание Из ОписанияКодовСостоянийHTTP() Цикл
		
		КодыСостояния.Вставить(Описание.Ключ, Описание.Код);
		
	КонецЦикла;

	Возврат КодыСостояния;
	
КонецФункции

// Возвращает текстовое представление переданного кода состояния HTTP.
//
// Параметры:
//  КодСостояния - Число - код состояния HTTP, для которого нужно получить текстовое представление.
// 
// Возвращаемое значение:
//  Строка - текстовое представление кода состояния HTTP.
//
Функция ПредставлениеКодаСостоянияHTTP(КодСостояния) Экспорт

	ОписаниеКодаСостояния = Неопределено;
	
	Для Каждого Описание Из ОписанияКодовСостоянийHTTP() Цикл
		
		Если Описание.Код = КодСостояния Тогда
			
			ОписаниеКодаСостояния = Описание;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

	Если ОписаниеКодаСостояния = Неопределено Тогда
		
		Возврат КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = '%1: Неизвестный код состояния HTTP'"),
			ПолучитьПредставлениеЧислаЛок(КодСостояния)
		);
		
	Иначе
		
		Возврат КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			"%1: %2",
			ПолучитьПредставлениеЧислаЛок(ОписаниеКодаСостояния.Код),
			ОписаниеКодаСостояния.Описание
		);
		
	КонецЕсли;

КонецФункции

// Выполняет чтение данных из архива GZip.
//
// Параметры:
//  СжатыеДанные - ДвоичныеДанные	 - данные упакованные GZip.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - распакованные данные.
//
Функция ПрочитатьGZip(СжатыеДанные) Экспорт
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.ПрочитатьGZipЛок(СжатыеДанные);
		
	Иначе
		
		Возврат ПрочитатьGZipЛок(СжатыеДанные);
		
	КонецЕсли;
	
КонецФункции

// Выполняет запись данных в архив GZip.
//
// Параметры:
//  Данные	 - ДвоичныеДанные	 - исходные данные.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - данные упакованные GZip.
//
Функция ЗаписатьGZip(Данные) Экспорт
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.ЗаписатьGZipЛок(Данные);
		
	Иначе
		
		Возврат ЗаписатьGZipЛок(Данные);
		
	КонецЕсли;
	
КонецФункции

// Подготовить запрос.
//
// Параметры:
//  Сессия - Структура: См.  СоздатьСессию - 
//  Метод - Строка - Метод
//  URL - Строка - URL
//  ДополнительныеПараметры - Произвольный, Структура: см. НовыеПараметры - Дополнительные параметры
// 
// Возвращаемое значение:
//  Структура - Подготовленный запрос:
//  * Cookies - Соответствие из Строка -
//  * Аутентификация - Произвольный, Структура -
//  * Метод - Строка -
//  * Заголовки - Соответствие из Строка: См. ЗаголовкиПоУмолчанию -
//  * ПараметрыЗапроса - Структура, Произвольный -
//  * URL - Строка -
//  * ПараметрыПреобразованияJSON - Структура: См. ПолучитьПараметрыПреобразованияJSONПоУмолчанию - 
//
Функция ПодготовитьЗапрос(Сессия, Метод, URL, ДополнительныеПараметры) Экспорт

	Cookies = ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "Cookies", Новый Массив);
	Cookies = ОбъединитьCookies(ДозаполнитьCookie(Сессия.Cookies, URL), ДозаполнитьCookie(Cookies, URL));

	АутентификацияИзДополнительныхПараметров =
	ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "Аутентификация", Новый Структура);
	
	ПараметрыЗапросаИзДополнительныхПараметров =
	ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "ПараметрыЗапроса", Новый Соответствие);
	
	ЗаголовкиИзДополнительныхПараметров =
	ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "Заголовки", Новый Соответствие);

	ПараметрыПреобразованияJSON =
	ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "ПараметрыПреобразованияJSON", Неопределено);
	
	Аутентификация = Объединить(Скопировать(АутентификацияИзДополнительныхПараметров), Сессия.Аутентификация);
	ПараметрыЗапроса = Объединить(Скопировать(ПараметрыЗапросаИзДополнительныхПараметров), Сессия.ПараметрыЗапроса);
	Заголовки = Объединить(Скопировать(Сессия.Заголовки), ЗаголовкиИзДополнительныхПараметров);
	
	ПодготовленныйЗапрос = Новый Структура;
	ПодготовленныйЗапрос.Вставить("Cookies", Cookies);
	ПодготовленныйЗапрос.Вставить("Аутентификация", Аутентификация);
	ПодготовленныйЗапрос.Вставить("Метод", Метод);
	ПодготовленныйЗапрос.Вставить("Заголовки", Заголовки);
	ПодготовленныйЗапрос.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	ПодготовленныйЗапрос.Вставить("URL", ПодготовитьURL(URL, ПараметрыЗапроса));
	ПодготовленныйЗапрос.Вставить("ПараметрыПреобразованияJSON", ПараметрыПреобразованияJSON);

	ПодготовитьCookies(ПодготовленныйЗапрос);

	Данные = ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "Данные", Новый Структура);
	Файлы = ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "Файлы", Новый Массив);
	JsonЛок = ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "Json", Неопределено);
	ПараметрыЗаписиJSON = ВыбратьЗначение(Неопределено, ДополнительныеПараметры, "ПараметрыЗаписиJSON", Неопределено);

	ПодготовитьТелоЗапроса(ПодготовленныйЗапрос, Данные, Файлы, JsonЛок, ПараметрыЗаписиJSON);
	ПодготовитьАутентификацию(ПодготовленныйЗапрос);

	Возврат ПодготовленныйЗапрос;

КонецФункции

// Преобразование Объекта в JSON.
//
// Параметры:
//  Объект	 - Произвольный	 - данные, которые необходимо преобразовать в JSON.
// 
// Возвращаемое значение:
//  Строка - объект в формате JSON.
//
Функция ОбъектВJson(Объект) Экспорт
	
	Возврат КонтурДиадокСтдJSONКлиентСервер.ЗаписатьЗначение(Объект);
	
КонецФункции

// Преобразование JSON в Объект.
//
// Параметры:
//  Json					 - ДвоичныеДанные, Строка	 - данные в формате JSON.
//  Кодировка				 - Строка, КодировкаТекста	 - кодировка текста JSON. Значение по умолчанию = utf-8.
//  ПараметрыПреобразования	 - Неопределено, Структура	 - См. ПолучитьПараметрыПреобразованияJSONПоУмолчаниюпреобразования
// 
// Возвращаемое значение:
//  Произвольный - значение, десериализованное из JSON.
//
Функция JsonВОбъект(Json, Кодировка = "UTF-8", ПараметрыПреобразования = Неопределено) Экспорт
	
	ПараметрыПреобразованияJSON = Объединить(ПолучитьПараметрыПреобразованияJSONПоУмолчанию(), ПараметрыПреобразования);
	
	Если ТипЗнч(Json) = Тип("ДвоичныеДанные") Тогда
		
		СтрокаJSON = ПолучитьСтрокуИзДвоичныхДанныхЛок(Json, Кодировка);
		
	Иначе
		
		СтрокаJSON = Json;
		
	КонецЕсли;

	Возврат КонтурДиадокСтдJSONКлиентСервер.ПрочитатьЗначение(
		СтрокаJSON,
		ПараметрыПреобразованияJSON.ПрочитатьВСоответствие,
		ПараметрыПреобразованияJSON.ИменаСвойствСоЗначениямиДата,
		ПараметрыПреобразованияJSON.ФорматДатыJSON,
		ПараметрыПреобразованияJSON.ИмяФункцииВосстановления,
		ПараметрыПреобразованияJSON.МодульФункцииВосстановления,
		ПараметрыПреобразованияJSON.ДополнительныеПараметрыФункцииВосстановления,
		ПараметрыПреобразованияJSON.ИменаСвойствДляОбработкиВосстановления
	);
	
КонецФункции

// Хеширование данных.
//
// Параметры:
//  Алгоритм - Строка				 - Алгоритм
//  Данные	 - Строка, ДвоичныеДанные	 - Данные
// 
// Возвращаемое значение:
//  Строка - Хеш данных
//
Функция ХешированиеДанныхЛок(Знач Алгоритм, Знач Данные) Экспорт

	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавноЛок("8.3.10") Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.ХешированиеДанныхЛок(Алгоритм, Данные);
		
	Иначе
		
		Если Не ВРег(Алгоритм) = ВРег("MD5") Тогда
			
			ВызватьИсключение
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Алгоритм хеширования %1 не поддерживается на платформе версии ниже 8.3.6'"),
				Алгоритм
			);
			
		КонецЕсли;

		Возврат КонтурДиадокКоннекторHTTPХешMD5КлиентСервер.MD5Лок(Данные);
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Функция ПараметрыИзАргументов(ПараметрыЗапроса, Данные, Json)

	Результат = Новый Структура;
	Результат.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	Результат.Вставить("Данные", Данные);
	Результат.Вставить("Json", Json);

	Возврат Результат;

КонецФункции

// Вызвать HTTPМетод соединения.
//
// Параметры:
//  Соединение			 - HTTPСоединение	 - Соединение
//  HTTPМетод			 - Строка			 - HTTPМетод
//  HTTPЗапрос			 - HTTPЗапрос		 - 
//  ИмяВыходногоФайла	 - Строка, Неопределено	 - Имя выходного файла
// 
// Возвращаемое значение:
//  HTTPОтвет - Результат вызова HTTPМетод
//
Функция ВызватьHTTPМетодЛок(Соединение, HTTPМетод, HTTPЗапрос, ИмяВыходногоФайла = Неопределено)

	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.ВызватьHTTPМетодЛок(Соединение, HTTPМетод, HTTPЗапрос, ИмяВыходногоФайла);
		
	Иначе
		
		Если ВРег(HTTPМетод) = ВРег("Put") Тогда
			
			Возврат Соединение.Записать(HTTPЗапрос);
			
		ИначеЕсли ВРег(HTTPМетод) = ВРег("Post") Тогда
			
			Возврат Соединение.ОтправитьДляОбработки(HTTPЗапрос, ИмяВыходногоФайла);
			
		ИначеЕсли ВРег(HTTPМетод) = ВРег("Get") Тогда
			
			Возврат Соединение.Получить(HTTPЗапрос, ИмяВыходногоФайла);
			
		ИначеЕсли ВРег(HTTPМетод) = ВРег("Delete") Тогда
			
			Возврат Соединение.Удалить(HTTPЗапрос);
			
		Иначе
			
			ВызватьИсключение
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Метод %1 не поддерживается в платформе версии ниже 8.3.6'"),
				HTTPМетод
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Вызвать HTTPМетод.
//
// Параметры:
//  Сессия - Структура: См. СоздатьСессию - 
//  Метод - Строка - Метод
//  URL - Строка - URL
//  ДополнительныеПараметры - Структура, Произвольный - Дополнительные параметры
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет
//
Функция ВызватьHTTPМетод(Сессия, Метод, URL, ДополнительныеПараметры)

	ПодготовленныйЗапрос = ПодготовитьЗапрос(Сессия, Метод, URL, ДополнительныеПараметры);

	НастройкиПодключения = НастройкиПодключения(Метод, URL, ДополнительныеПараметры, Сессия);

	Ответ = ОтправитьЗапрос(Сессия, ПодготовленныйЗапрос, НастройкиПодключения);

	Если НастройкиПодключения.РазрешитьПеренаправление И Ответ.ЭтоРедирект Тогда
		
		// INFO: по хорошему аутентификацию нужно привести к новым параметрам, но пока будем игнорировать.
		Ответ = ПеренаправитьЗапрос(Сессия, НастройкиПодключения, ПодготовленныйЗапрос, Ответ);
		
	КонецЕсли;

	Возврат Ответ;

КонецФункции

// Перенаправить запрос.
// 
// Параметры:
//  Сессия - Структура: См. СоздатьСессию() -
//  НастройкиПодключения - Структура: см. НастройкиПодключения() - Настройки подключения
//  ПодготовленныйЗапрос - Структура: см. ПодготовитьЗапрос(() - Подготовленный запрос
//  ПеренаправленныйОтвет - Структура: см. НовыйОтвет- Перенаправленный ответ
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет - Ответ из перенаправления 
//  
Функция ПеренаправитьЗапрос(Сессия, НастройкиПодключения, ПодготовленныйЗапрос, ПеренаправленныйОтвет)

	Перенаправление = 0;

	Пока ПеренаправленныйОтвет.ЭтоРедирект Цикл

		ПодготовитьЗапросДляРедиректа(Сессия, ПодготовленныйЗапрос, ПеренаправленныйОтвет);

		ПеренаправленныйОтвет = ОтправитьЗапрос(Сессия, ПодготовленныйЗапрос, НастройкиПодключения);

		Перенаправление = Перенаправление + 1;

		Если Перенаправление > Сессия.МаксимальноеКоличествоПеренаправлений Тогда
			
			ОписаниеОшибкиПеренаправлений = "СлишкомМногоПеренаправлений";
			
			ПричинаОшибкиВыполненияЗапроса = ИнформацияОбОшибкеЛок();
			ПричинаОшибкиВыполненияЗапроса.Описание = ОписаниеОшибкиПеренаправлений;
			
			ОшибкаВыполненияЗапроса = ИнформацияОбОшибкеЛок();
			ОшибкаВыполненияЗапроса.Причина = ПричинаОшибкиВыполненияЗапроса;
			
			NEL_ОтправитьОтчет(Сессия, ПодготовленныйЗапрос, ОшибкаВыполненияЗапроса, ПеренаправленныйОтвет);
			
			ВызватьИсключение (ОписаниеОшибкиПеренаправлений);
			
		КонецЕсли;

	КонецЦикла;

	Возврат ПеренаправленныйОтвет;

КонецФункции

// Информация об ошибке структурв для генерации своих ошибок.
// 
// Возвращаемое значение:
//  Структура - Информация об ошибке:
// * ДополнительнаяИнформация - Строка - 
// * ИмяМодуля - Строка - 
// * ИсходнаяСтрока - Строка - 
// * Код - Строка - 
// * НомерСтроки - Число - 
// * Описание - Строка - 
// * Причина - Неопределено, Структура: см. ИнформацияОбОшибкеЛок() - 
// 
Функция ИнформацияОбОшибкеЛок()
	
	ИнформацияОбОшибкеСтруктура = Новый Структура;
	ИнформацияОбОшибкеСтруктура.Вставить("ДополнительнаяИнформация", "");
	ИнформацияОбОшибкеСтруктура.Вставить("ИмяМодуля", "");
	ИнформацияОбОшибкеСтруктура.Вставить("ИсходнаяСтрока", "");
	ИнформацияОбОшибкеСтруктура.Вставить("Код", "");
	ИнформацияОбОшибкеСтруктура.Вставить("НомерСтроки", 0);
	ИнформацияОбОшибкеСтруктура.Вставить("Описание", "");
	ИнформацияОбОшибкеСтруктура.Вставить("Причина", Неопределено);
	
	Возврат ИнформацияОбОшибкеСтруктура;
	
КонецФункции

Процедура ПодготовитьЗапросДляРедиректа(Сессия, ПодготовленныйЗапрос, ПеренаправленныйОтвет)

	КодыСостоянияHTTP = КодыСостоянияHTTP();

	НовыйURL = СформироватьНовыйURLПриПеренаправлении(ПеренаправленныйОтвет);

	ПодготовленныйЗапрос.URL = КодироватьСтрокуЛок(НовыйURL, "URLВКодировкеURL");
	НовыйHTTPЗапрос = Новый HTTPЗапрос(СобратьАдресРесурса(РазобратьURL(НовыйURL), Новый Соответствие));
	ПереопределитьМетод(ПодготовленныйЗапрос, ПеренаправленныйОтвет);

	Если ПеренаправленныйОтвет.КодСостояния <> КодыСостоянияHTTP.ВременноеПеренаправление_307
		И ПеренаправленныйОтвет.КодСостояния <> КодыСостоянияHTTP.ПостоянноеПеренаправление_308 Тогда
		
		УдалитьЗаголовки(ПодготовленныйЗапрос.Заголовки, "content-length,content-type,transfer-encoding");
		НовыйHTTPЗапрос.Заголовки = ПодготовленныйЗапрос.Заголовки;
		
	Иначе
		
		ИсходныеДвоичныеДанные = ПодготовленныйЗапрос.HTTPЗапрос.ПолучитьТелоКакДвоичныеДанные();
		
		Если Не ИсходныеДвоичныеДанные = Неопределено Тогда
			
			НовыйHTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ИсходныеДвоичныеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПодготовленныйЗапрос.HTTPЗапрос = НовыйHTTPЗапрос;
	УдалитьЗаголовки(ПодготовленныйЗапрос.Заголовки, "cookies");

	ПодготовленныйЗапрос.Cookies = ОбъединитьCookies(ПодготовленныйЗапрос.Cookies, Сессия.Cookies);
	ПодготовитьCookies(ПодготовленныйЗапрос);

КонецПроцедуры

Процедура ПодготовитьАутентификацию(ПодготовленныйЗапрос)

	ПодготовленныйЗапрос.Вставить("СобытияНаОтвет", Новый Массив);
	
	Если Не ЗначениеЗаполнено(ПодготовленныйЗапрос.Аутентификация) Тогда
		
		СтруктураURL = РазобратьURL(ПодготовленныйЗапрос.URL);
		
		Если ЗначениеЗаполнено(СтруктураURL.Аутентификация) Тогда
			
			ПодготовленныйЗапрос.Аутентификация = СтруктураURL.Аутентификация;
			
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ПодготовленныйЗапрос.Аутентификация) Тогда
		
		Если ПодготовленныйЗапрос.Аутентификация.Свойство("Тип") Тогда
			
			ТипАутентификации = НРег(ПодготовленныйЗапрос.Аутентификация.Тип);
			
			Если ТипАутентификации = "digest" Тогда
				
				ПодготовленныйЗапрос.СобытияНаОтвет.Добавить("ОбработкаОтветаСКодом401");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПодготовитьТелоЗапроса(ПодготовленныйЗапрос, Данные, Файлы, Json, ПараметрыЗаписиJSON)

	СтруктураURL = РазобратьURL(ПодготовленныйЗапрос.URL);

	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = СобратьАдресРесурса(СтруктураURL, ПодготовленныйЗапрос.ПараметрыЗапроса);
	
	Если ЗначениеЗаполнено(Файлы) Тогда
		
		ContentType = ЗакодироватьФайлы(HTTPЗапрос, Файлы, Данные);
		
	ИначеЕсли ЗначениеЗаполнено(Данные) Тогда
		
		ContentType = "application/x-www-form-urlencoded";
		
		Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
			
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(Данные);
			
		Иначе
			
			Если ТипЗнч(Данные) = Тип("Строка") Тогда
				
				Тело = Данные;
				
			Иначе
				
				Тело = КодироватьПараметрыЗапроса(Данные);
				
			КонецЕсли;
			
			ContentType = "application/x-www-form-urlencoded; charset=utf-8";
			HTTPЗапрос.УстановитьТелоИзСтроки(Тело, "CESU-8");
			
		КонецЕсли;
		
	ИначеЕсли Json <> Неопределено Тогда
		
		ContentType = "application/json; charset=utf-8";
		СтрокаJson = ОбъектВJson(Json);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJson, "CESU-8");
		
	Иначе
		
		ContentType = Неопределено;
		
	КонецЕсли;
	
	ЗначениеЗаголовка = ЗначениеЗаголовка("content-type", ПодготовленныйЗапрос.Заголовки);
	
	Если ЗначениеЗаголовка = Ложь И ЗначениеЗаполнено(ContentType) Тогда
		
		ПодготовленныйЗапрос.Заголовки.Вставить("Content-Type", ContentType);
		
	КонецЕсли;

	HTTPЗапрос.Заголовки = ПодготовленныйЗапрос.Заголовки;

	УпаковатьЗапрос(HTTPЗапрос);

	ПодготовленныйЗапрос.Вставить("HTTPЗапрос", HTTPЗапрос);

КонецПроцедуры

Функция ЗакодироватьФайлы(HTTPЗапрос, Файлы, Данные)

	Части = Новый Массив;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		
		Для Каждого Поле Из Данные Цикл
			
			Части.Добавить(СоздатьПолеФормы(Новый Структура("Имя,Данные", Поле.Ключ, Поле.Значение)));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Файлы) = Тип("Массив") Тогда
		
		Для Каждого Файл Из Файлы Цикл
			
			Части.Добавить(СоздатьПолеФормы(Файл));
			
		КонецЦикла;
		
	Иначе
		
		Части.Добавить(СоздатьПолеФормы(Файлы));
		
	КонецЕсли;

	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");

	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		ДвоичныеДанныеТела = КонтурДиадокКоннекторHTTPСлужебный83.ПолучитьДвоичныеДанныеТела(Части, Разделитель);
		
	Иначе
		
		ДвоичныеДанныеТела = ПолучитьДвоичныеДанныеТела(Части, Разделитель);
		
	КонецЕсли;
	
	HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанныеТела);

	Возврат КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
		"multipart/form-data; boundary=%1",
		Разделитель
	);
	
КонецФункции

Функция ПолучитьДвоичныеДанныеТела(Части, Разделитель)
	
	РазделительСтрок = Символы.ВК + Символы.ПС;

	ПотокТелаЗапроса = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Поток();
	
	ЗаписьДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписьДанных(ПотокТелаЗапроса, КодировкаТекста.UTF8, "LittleEndian", "", "", Ложь);
	
	Для Каждого Часть Из Части Цикл
		
		КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, "--" + Разделитель);
		КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, РазделительСтрок);
		КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, ЗаголовкиВСтроку(Часть.Заголовки));
		КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, РазделительСтрок);
		КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, РазделительСтрок);
		
		Если ТипЗнч(Часть.Данные) = Тип("ДвоичныеДанные") Тогда
			
			КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЗаписьДанных(ЗаписьДанных, Часть.Данные);
			
		Иначе
			
			КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, Часть.Данные);
			
		КонецЕсли;
		
		КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, РазделительСтрок);
		
	КонецЦикла;

	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьСтрокуЗаписьДанных(ЗаписьДанных, "--" + Разделитель + "--");
	
	Возврат КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗакрытьИПолучитьДвоичныеДанныеПоток(ПотокТелаЗапроса);
	
КонецФункции

Функция СоздатьПолеФормы(ИсходныеПараметры)

	Поле = Новый Структура;
	Поле.Вставить("Имя", ИсходныеПараметры.Имя);
	Поле.Вставить("ИмяФайла", ЗначениеПоКлючу(ИсходныеПараметры, "ИмяФайла"));
	Поле.Вставить("Данные", ИсходныеПараметры.Данные);
	Поле.Вставить("Тип", ЗначениеПоКлючу(ИсходныеПараметры, "Тип"));
	Поле.Вставить("Заголовки", ЗначениеПоКлючу(ИсходныеПараметры, "Заголовки", Новый Соответствие));

	Ключ = "Content-Disposition";
	
	Если ЗначениеЗаголовка("content-disposition", Поле.Заголовки, Ключ) = Ложь Тогда
		
		Поле.Заголовки.Вставить("Content-Disposition", "form-data");
		
	КонецЕсли;

	Части = Новый Массив; // Массив из Строка
	Части.Добавить(Поле.Заголовки[Ключ]);
	Части.Добавить(КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			"name=""%1""",
			Поле.Имя
		)
	);
	
	Если ЗначениеЗаполнено(Поле.ИмяФайла) Тогда
		
		Части.Добавить(КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				"filename=""%1""",
				Поле.ИмяФайла
			)
		);
		
	КонецЕсли;

	Поле.Заголовки[Ключ] = КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Части, "; ");
	Поле.Заголовки["Content-Type"] = Поле.Тип;

	Возврат Поле;

КонецФункции

Функция ЗаполнитьПараметрыЗапросаЛок(Путь)

	ПараметрыЗапроса = Новый Соответствие;

	Запрос = "";
	РазбитьСтрокуПоРазделителюЛок(Запрос, Путь, "?", Истина);
	МассивПоРазделителю = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Запрос, "&", Ложь);
	
	Для Каждого СтрокаКлючРавноПараметр Из МассивПоРазделителю Цикл
		
		СтрокаКлючРавноПараметр = РаскодироватьСтрокуЛок(СтрокаКлючРавноПараметр, "URLВКодировкеURL");

		ПозицияРавно = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(СтрокаКлючРавноПараметр, "=");
		
		Если ПозицияРавно = 0 Тогда
			
			Ключ = СтрокаКлючРавноПараметр;
			Значение = Неопределено;
			
		Иначе
			
			Ключ = Лев(СтрокаКлючРавноПараметр, ПозицияРавно - 1);
			Значение = Сред(СтрокаКлючРавноПараметр, ПозицияРавно + 1);
			
		КонецЕсли;

		Если ПараметрыЗапроса.Получить(Ключ) <> Неопределено Тогда
			
			Если ТипЗнч(ПараметрыЗапроса[Ключ]) = Тип("Массив") Тогда
				
				ПараметрыЗапроса[Ключ].Добавить(Значение);
				
			Иначе
				
				Значения = Новый Массив;
				Значения.Добавить(ПараметрыЗапроса[Ключ]);
				Значения.Добавить(Значение);
				ПараметрыЗапроса[Ключ] = Значения;
				
			КонецЕсли;
			
		Иначе
			
			ПараметрыЗапроса.Вставить(Ключ, Значение);
			
		КонецЕсли;

	КонецЦикла;

	Возврат ПараметрыЗапроса;

КонецФункции

Функция КодироватьПараметрыЗапроса(ПараметрыЗапроса)

	ЧастиПараметрыЗапроса = Новый Массив;
	
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда
			
			Значения = Параметр.Значение;
			
		Иначе
			
			Значения = Новый Массив;
			Значения.Добавить(Параметр.Значение);
			
		КонецЕсли;

		Если Параметр.Значение = Неопределено Тогда
			
			ЧастиПараметрыЗапроса.Добавить(Параметр.Ключ);
			
		Иначе
			
			Для Каждого Значение Из Значения Цикл
				
				ЗначениеПараметра = КодироватьСтрокуЛок(XMLСтрока(Значение), "КодировкаURL");
				ЧастиПараметрыЗапроса.Добавить(КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
						"%1=%2",
						Параметр.Ключ,
						ЗначениеПараметра
					)
				);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(ЧастиПараметрыЗапроса, "&");
	
КонецФункции

Процедура ПереопределитьМетод(ПодготовленныйЗапрос, Ответ)

	КодыСостоянияHTTP = КодыСостоянияHTTP();

	Метод = ПодготовленныйЗапрос.Метод;

	// http://tools.ietf.org/html/rfc7231#section-6.4.4
	Если Ответ.КодСостояния = КодыСостоянияHTTP.СмотретьДругое_303 И Метод <> "HEAD" Тогда
		
		Метод = "GET";
		
	КонецЕсли;

	// Поведение браузеров
	Если Ответ.КодСостояния = КодыСостоянияHTTP.ПеремещеноВременно_302 И Метод <> "HEAD" Тогда
		
		Метод = "GET";
		
	КонецЕсли;

	ПодготовленныйЗапрос.Метод = Метод;

КонецПроцедуры

// Отправить запрос.
//
// Параметры:
//  Сессия				 - Структура: См. СоздатьСессию - 
//  ПодготовленныйЗапрос - Структура: См. ПодготовитьЗапрос - Подготовленный запрос
//  Настройки			 - Структура: См. НастройкиПодключения - Настройки
// 
// Возвращаемое значение:
//  Структура: См. НовыйОтвет() - 
//
Функция ОтправитьЗапрос(Сессия, ПодготовленныйЗапрос, Настройки)

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НачалоДата = ТекущаяДатаСеанса();
	МиллисекундВСекунде = 1000;

	Повтор = 0;
	Длительность = 0;
	Ошибки = Новый Массив; // Массив из Строка

	Пока Истина Цикл
		
		ТекстОшибки = "";

		Ответ = Неопределено;
		ОшибкаВыполненияЗапроса = Неопределено;

		Попытка
			
			Ответ = ОтправитьHTTPЗапрос(Сессия, ПодготовленныйЗапрос, Настройки);
			
		Исключение
			
			ОшибкаВыполненияЗапроса = ИнформацияОбОшибке();

			ТекстОшибки = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'HTTP %1 %2
					|Network error:
					| %3'"),
					ПодготовленныйЗапрос.Метод,
					ПодготовленныйЗапрос.URL,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()
				)
			);
					
			Ошибки.Добавить(ТекстОшибки);
			
		КонецПопытки;

		Повтор = Повтор + 1;
		Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ДлительностьМс = Конец - Начало;
		Длительность = ДлительностьМс / МиллисекундВСекунде;

		Если Не Сессия.Лог = Неопределено Тогда
			
			СтрокаЛог = "[%1] ""%2 %3"" %4 %5";
			СтрокаЛог = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				СтрокаЛог,
				Формат(НачалоДата, "ДФ='yyyy.MM.dd HH:mm:ss'"), // 1
				ПодготовленныйЗапрос.Метод, // 2
				ПодготовленныйЗапрос.URL, // 3
				?(Ответ = Неопределено, ТекстОшибки, Ответ.КодСостояния), // 4
				XMLСтрока(Длительность) // 5
			);
			
			Сессия.Лог.ДобавитьСтроку(СтрокаЛог);
			
		КонецЕсли;

		Если Не НеобходимоПовторитьЗапрос(Ответ, Настройки, ОшибкаВыполненияЗапроса) Тогда
			
			Прервать;
			
		КонецЕсли;

		Если Повтор > Настройки.МаксимальноеКоличествоПовторов
			Или Длительность > Настройки.МаксимальноеВремяПовторов Тогда
			
			Прервать;
			
		КонецЕсли;

		Если ОшибкаВыполненияЗапроса <> Неопределено
			Или Не ЭтоКодСостоянияПриКоторомНужноУчитыватьЗаголовокRetryAfter(Ответ.КодСостояния) Тогда
			
			ЗаголовокRetryAfter = Ложь;
			
		Иначе
			
			ЗаголовокRetryAfter = ЗначениеЗаголовка("retry-after", Ответ.Заголовки);
			
		КонецЕсли;

		ДлительностьПриостановки = РассчитатьДлительностьПриостановки(
			Повтор,
			Настройки.КоэффициентЭкспоненциальнойЗадержки,
			ЗаголовокRetryAfter,
			Настройки.МаксимальноеВремяПовторов - Длительность);
			
		Приостановить(ДлительностьПриостановки);
		
	КонецЦикла;
	
	Если Не Ответ = Неопределено Тогда
		
		ЗаголовокNEL = ЗначениеЗаголовка("NEL", Ответ.Заголовки); // Строка
		ЗаголовокReportTo = ЗначениеЗаголовка("report-to", Ответ.Заголовки); // Строка
		
		Если Не ЗаголовокNEL = Ложь
			И Не ЗаголовокReportTo = Ложь Тогда
				
			NEL_ЗаполнитьСтруктуруNELИReportTo(Сессия, ЗаголовокNEL, ЗаголовокReportTo);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ОшибкаВыполненияЗапроса <> Неопределено Тогда
		
		NEL_ОтправитьОтчет(Сессия, ПодготовленныйЗапрос, ОшибкаВыполненияЗапроса, , ДлительностьМс);

		ВызватьИсключение (ПодробноеПредставлениеОшибки(ОшибкаВыполненияЗапроса));
		
	КонецЕсли;

	ЗаголовокContentType = ЗначениеЗаголовка("content-type", Ответ.Заголовки);
	
	Если ЗаголовокContentType = Ложь Тогда
		
		ЗаголовокContentType = "";
		
	КонецЕсли;

	ПодготовленныйОтвет = НовыйОтвет();
	ПодготовленныйОтвет.Метод = ПодготовленныйЗапрос.Метод;
	ПодготовленныйОтвет.URL = ПодготовленныйЗапрос.URL;
	ПодготовленныйОтвет.КодСостояния = Ответ.КодСостояния;
	ПодготовленныйОтвет.Заголовки = Ответ.Заголовки;
	ПодготовленныйОтвет.ТелоКакДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	ПодготовленныйОтвет.Кодировка = КодировкаИзЗаголовка(ЗаголовокContentType);
	ПодготовленныйОтвет.ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	ПодготовленныйОтвет.ЭтоПостоянныйРедирект = ЭтоПостоянныйРедирект(Ответ.КодСостояния, Ответ.Заголовки);
	ПодготовленныйОтвет.ЭтоРедирект = ЭтоРедирект(Ответ.КодСостояния, Ответ.Заголовки);
	ПодготовленныйОтвет.Cookies = ИзвлечьCookies(Ответ.Заголовки, ПодготовленныйЗапрос.URL);
	ПодготовленныйОтвет.Ошибки = Ошибки;

	Сессия.Cookies = ОбъединитьCookies(Сессия.Cookies, ПодготовленныйОтвет.Cookies);

	NEL_ОтправитьОтчет(Сессия, ПодготовленныйЗапрос, , ПодготовленныйОтвет, ДлительностьМс);
	
	Возврат ПодготовленныйОтвет;

КонецФункции

// NEL отправить отчет.
// 
// Параметры:
//  Сессия - Структура: См. СоздатьСессию - Сессия
//  ПодготовленныйЗапрос - Структура: см. ПодготовитьЗапрос()- Подготовленный запрос
//  ОшибкаВыполненияЗапроса - ИнформацияОбОшибке, Неопределено - Ошибка выполнения запроса
//  ПодготовленныйОтвет - Неопределено, Структура: См. НовыйОтвет() - Подготовленный ответ
//  ДлительностьМс - Число - Длительность запроса милисекунд
//  
Процедура NEL_ОтправитьОтчет(Сессия, ПодготовленныйЗапрос, ОшибкаВыполненияЗапроса = Неопределено,
	ПодготовленныйОтвет = Неопределено, ДлительностьМс = 0)
	
	NEL_ОписаниеОшибки = Неопределено;
	
	NELПолитика = Сессия.NELПолитика;
	Структура_NEL = NELПолитика.NEL;
	Структура_report_to = NELПолитика.report_to;
	NEL_Отправлять = Не NELПолитика.NEL_НеОтправлять;
	ФлагОтправкиОтчета = ЗначениеЗаполнено(Структура_NEL) И ЗначениеЗаполнено(Структура_report_to) И NEL_Отправлять;
	СтруктураURL = РазобратьURL(ПодготовленныйЗапрос.URL);

	Если ФлагОтправкиОтчета Тогда
		
		// Проверяем что энпоинт есть в группе
		
		Если Не Структура_report_to.Свойство("group") Тогда
			
			ФлагОтправкиОтчета = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФлагОтправкиОтчета Тогда
		
		Если Не Структура_report_to.group = Структура_NEL.report_to Тогда
			
			ФлагОтправкиОтчета = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФлагОтправкиОтчета Тогда
		
		Если NELПолитика.NEL_Сессия = Неопределено Тогда
			
			NEL_СоздатьСессию(NELПолитика, СтруктураURL.Сервер, Сессия.Прокси);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФлагОтправкиОтчета Тогда
		
		Если Структура_report_to.failure_fraction > 0 Тогда
			
			Если Не ОшибкаВыполненияЗапроса = Неопределено Тогда
				
				// ошибка на этапе отправки
				Если NEL_ЭтоDnsNameNotResolved(ОшибкаВыполненияЗапроса.Причина.Описание) Тогда
					
					Если Не Структура_report_to.include_subdomains Тогда
						
						Если ДоменЯвляетсяПоддоменом(СтруктураURL.Сервер, NELПолитика.NEL_Домен) Тогда
							
							NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиDnsNameNotResolved(ПодготовленныйЗапрос, ДлительностьМс);
							
						КонецЕсли;
						
					Иначе
						
						NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиDnsNameNotResolved(ПодготовленныйЗапрос, ДлительностьМс);
						
					КонецЕсли;
					
				ИначеЕсли NEL_ЭтоHttpResponseInvalid(ОшибкаВыполненияЗапроса.Причина.Описание) Тогда
					
					NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиHttpResponseInvalid(ПодготовленныйЗапрос, ДлительностьМс);
					
				ИначеЕсли NEL_ЭтоСлишкомМногоПеренаправлений(ОшибкаВыполненияЗапроса.Причина.Описание) Тогда
					
					NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиСлишкомМногоПеренаправлений(ПодготовленныйЗапрос, ДлительностьМс);
					
				ИначеЕсли NEL_ЭтоУдаленныйУзелНеПрошелПроверку(ОшибкаВыполненияЗапроса.Причина.Описание) Тогда
					
					NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиУдаленныйУзелНеПрошелПроверку(ПодготовленныйЗапрос, ДлительностьМс);

				ИначеЕсли NEL_ЭтоПревышенТаймаут(ОшибкаВыполненияЗапроса.Причина.Описание) Тогда
					
					NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиПревышенТаймаут(ПодготовленныйЗапрос, ДлительностьМс);

				Иначе
					
					NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиНеизвестнаяОшибка(ПодготовленныйЗапрос, ДлительностьМс);

				КонецЕсли;
				
			ИначеЕсли Не ПодготовленныйОтвет = Неопределено
				И Не ПодготовленныйОтвет.ЭтоРедирект
				И NEL_КодСостоянияДляОтправкиОшибки(ПодготовленныйОтвет.КодСостояния) Тогда
				
				NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиОшибкаВОтвете(ПодготовленныйЗапрос, ПодготовленныйОтвет, ДлительностьМс);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Структура_report_to.success_fraction > 0 Тогда
			
			Если ОшибкаВыполненияЗапроса = Неопределено
				И Не ПодготовленныйОтвет = Неопределено
				И NEL_КодСостоянияДляОтправкиУспеха(ПодготовленныйОтвет.КодСостояния) Тогда
				
				NEL_ОписаниеОшибки = NEL_ПолучитьОписаниеОшибкиОшибокНет(ПодготовленныйЗапрос, ПодготовленныйОтвет, ДлительностьМс);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не NEL_ОписаниеОшибки = Неопределено Тогда
		
		NEL_ОтправитьОписаниеОшибки(NEL_ОписаниеОшибки, NELПолитика);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура NEL_СоздатьСессию(NELПолитика, NEL_Сервер, НастройкиПрокси)
	
	NEL_Сессия = СоздатьСессию();
	NEL_Сессия.ПроверятьSSL = Ложь;
	NEL_Сессия.Заголовки = NEL_ЗаголовкиПоУмолчанию();
	NEL_Сессия.NELПолитика.NEL_НеОтправлять = Истина;
	NEL_Сессия.Прокси = НастройкиПрокси;
	
	NELПолитика.NEL_Домен = NEL_Сервер;
	
	NELПолитика.NEL_Сессия = NEL_Сессия;
	
КонецПроцедуры

// NEL отправить описание ошибки.
// 
// Параметры:
//  NEL_ОписаниеОшибки - Структура: см. NEL_СоздатьОтчет -NEL описание ошибки
//  NELПолитика - Структура: см. NEL_СоздатьПолитику - Политика NEL
//  
Процедура NEL_ОтправитьОписаниеОшибки(NEL_ОписаниеОшибки, NELПолитика)
	
	NEL_ДополнительныеПараметры = NEL_СоздатьДополнительныеПараметры();

	Структура_report_to = NELПолитика.report_to;
	
	Для Каждого Эндпоинт Из Структура_report_to.endpoints Цикл
		
		ОтветПолучен = Истина;
		Эндпоинт_url = ЗначениеПоКлючу(Эндпоинт, "url", "");
		
		Попытка
			
			Ответ = PostJsonБезПреобразованияОтвета(Эндпоинт_url, NEL_ОписаниеОшибки, NEL_ДополнительныеПараметры, NELПолитика.NEL_Сессия);
			
		Исключение
			
			ОтветПолучен = Ложь;
			
		КонецПопытки;

		Если ОтветПолучен Тогда
			
			Если NEL_КодСостоянияДляОтправкиУспеха(Ответ.КодСостояния) Тогда
				
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// NEL создать дополнительные параметры.
// 
// Возвращаемое значение:
//  Структура: см. НовыеПараметры - NEL дополнительные параметры:
Функция NEL_СоздатьДополнительныеПараметры()
	
	NEL_ДополнительныеПараметры = НовыеПараметры();
	NEL_ДополнительныеПараметры.Таймаут = 1;
	NEL_ДополнительныеПараметры.ПроверятьSSL = Ложь;
	
	Возврат NEL_ДополнительныеПараметры;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиОшибокНет(ПодготовленныйЗапрос, ПодготовленныйОтвет, ДлительностьМс)
	
	// ошибок нет
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйОтвет.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаOk();
	ТелоОтчета.method = ПодготовленныйЗапрос.Метод;
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.status_code = ПодготовленныйОтвет.КодСостояния;
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиОшибкаВОтвете(ПодготовленныйЗапрос, ПодготовленныйОтвет, ДлительностьМс)
	
	// ошибка в ответе
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйОтвет.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаАpplication();
	ТелоОтчета.method = ПодготовленныйЗапрос.Метод;
	ТелоОтчета.status_code = ПодготовленныйОтвет.КодСостояния;
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.type = "http.error";
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиНеизвестнаяОшибка(ПодготовленныйЗапрос, ДлительностьМс)
	
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйЗапрос.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаАpplication();
	ТелоОтчета.method = ПодготовленныйЗапрос.Метод;
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.type = "unknown";
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиПревышенТаймаут(ПодготовленныйЗапрос, ДлительностьМс)
	
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйЗапрос.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаConnection();
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.type = "tcp.timed_out";
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиУдаленныйУзелНеПрошелПроверку(ПодготовленныйЗапрос, ДлительностьМс)
	
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйЗапрос.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаConnection();
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.type = "tls.cert.invalid";
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиСлишкомМногоПеренаправлений(ПодготовленныйЗапрос, ДлительностьМс)
	
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйЗапрос.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаАpplication();
	ТелоОтчета.method = ПодготовленныйЗапрос.Метод;
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.type = "http.response.redirect_loop";
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиHttpResponseInvalid(ПодготовленныйЗапрос, ДлительностьМс)
	
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйЗапрос.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаАpplication();
	ТелоОтчета.method = ПодготовленныйЗапрос.Метод;
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.type = "http.response.invalid";
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

Функция NEL_ПолучитьОписаниеОшибкиDnsNameNotResolved(ПодготовленныйЗапрос, ДлительностьМс)
	
	NEL_ОписаниеОшибки = NEL_СоздатьОтчет();
	NEL_ОписаниеОшибки.url = NEL_ПодготовитьURL(ПодготовленныйЗапрос.URL);
	
	ТелоОтчета = NEL_СоздатьТелоОтчетаDns();
	ТелоОтчета.elapsed_time = ДлительностьМс;
	ТелоОтчета.type = "dns.name_not_resolved";
	
	NEL_ОписаниеОшибки.body = ТелоОтчета;
	
	Возврат NEL_ОписаниеОшибки;
	
КонецФункции

// Домен является поддоменом.
// ДоменЯвляетсяПоддоменом("diadoc.kontur.ru", "kontur.ru") = Истина
// 
// Параметры:
//  ДоменСПоддоменом - Строка - Домен с поддоменом
//  Домен - Строка - Домен
// 
// Возвращаемое значение:
//  Булево - Домен является поддоменом
//  
Функция ДоменЯвляетсяПоддоменом(Знач ДоменСПоддоменом, Знач Домен)
	
	Домен = ДобавитьЛидирующуюТочку(Домен);

	Возврат КонтурДиадокСтдСтрКлиентСервер.СтрЗаканчиваетсяНаЛок(ДоменСПоддоменом, Домен);
	
КонецФункции

// NEL dns name not resolved.
// 
// Параметры:
//  СтрокаОписания - Строка - Строка описания
// 
// Возвращаемое значение:
//  Булево - NEL dns name not resolved
//  
Функция NEL_ЭтоDnsNameNotResolved(СтрокаОписания)
	
	Возврат Найти(СтрокаОписания, "Couldn't resolve host name") > 0;
	
КонецФункции

// NEL это http response invalid.
// 
// Параметры:
//  СтрокаОписания - Строка - Строка описания
// 
// Возвращаемое значение:
//  Булево - NEL это http response invalid
//  
Функция NEL_ЭтоHttpResponseInvalid(СтрокаОписания)
	
	Возврат Найти(СтрокаОписания, "Server returned nothing") > 0;
	
КонецФункции

// NEL это слишком много перенаправлений.
// 
// Параметры:
//  СтрокаОписания - Строка - Строка описания
// 
// Возвращаемое значение:
//  Булево - NEL это слишком много перенаправлений
//  
Функция NEL_ЭтоСлишкомМногоПеренаправлений(СтрокаОписания)
	
	Возврат Найти(СтрокаОписания, "СлишкомМногоПеренаправлений") > 0;
	
КонецФункции

// NEL это Удаленный узел не прошел проверку.
// 
// Параметры:
//  СтрокаОписания - Строка - Строка описания
// 
// Возвращаемое значение:
//  Булево - NEL это Удаленный узел не прошел проверку
//  
Функция NEL_ЭтоУдаленныйУзелНеПрошелПроверку(СтрокаОписания)
	
	ЭтоУдаленныйУзелНеПрошелПроверку = Ложь;
	
	МассивСтрокОшибок = Новый Массив; //Массив Из Строка
	МассивСтрокОшибок.Добавить("Удаленный узел не прошел проверку");
	
	Для Каждого СтрокаОшибки Из МассивСтрокОшибок Цикл
		
		ЭтоУдаленныйУзелНеПрошелПроверку = ЭтоУдаленныйУзелНеПрошелПроверку Или Найти(СтрокаОписания, СтрокаОшибки) > 0;
		
	КонецЦикла;
	
	Возврат ЭтоУдаленныйУзелНеПрошелПроверку;
	
КонецФункции

// NEL это Превышен таймаут.
// 
// Параметры:
//  СтрокаОписания - Строка - Строка описания
// 
// Возвращаемое значение:
//  Булево - NEL это Превышен таймаут
//  
Функция NEL_ЭтоПревышенТаймаут(СтрокаОписания)
	
	ЭтоПревышенТаймаут = Ложь;
	
	МассивСтрокОшибок = Новый Массив; //Массив Из Строка
	МассивСтрокОшибок.Добавить("Timed out");
	МассивСтрокОшибок.Добавить("Превышен таймаут");
	
	Для Каждого СтрокаОшибки Из МассивСтрокОшибок Цикл
		
		ЭтоПревышенТаймаут = ЭтоПревышенТаймаут Или Найти(СтрокаОписания, СтрокаОшибки) > 0;
		
	КонецЦикла;
	
	Возврат ЭтоПревышенТаймаут;
	
КонецФункции

Функция NEL_ПодготовитьURL(URL)
	
	СтруктураURL = РазобратьURL(URL);

	ПодготовленныйURL = СтруктураURL.Схема + "://";
	ПодготовленныйURL = ПодготовленныйURL + СтруктураURL.Сервер;
	
	Если ЗначениеЗаполнено(СтруктураURL.Порт) Тогда
		
		ПодготовленныйURL = ПодготовленныйURL + ":" + ПолучитьПредставлениеЧислаЛок(СтруктураURL.Порт);
		
	КонецЕсли;

	ПодготовленныйURL = ПодготовленныйURL + СтруктураURL.Путь;

	Возврат ПодготовленныйURL;
	
КонецФункции

// NEL код состояния для отправки ошибки.
// 
// Параметры:
//  КодСостояния - Число - Код состояния
// 
// Возвращаемое значение:
//  Булево - NEL код состояния для отправки ошибки
//  
Функция NEL_КодСостоянияДляОтправкиОшибки(КодСостояния)
	
	Если КодСостояния >= 400
		И КодСостояния <= 599 Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// NEL код состояния для отправки успеха.
// 
// Параметры:
//  КодСостояния - Число - Код состояния
// 
// Возвращаемое значение:
//  Булево - NEL код состояния для отправки успеха
//  
Функция NEL_КодСостоянияДляОтправкиУспеха(КодСостояния)
	
	Если КодСостояния >= 200
		И КодСостояния <= 299 Тогда
			
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция Сформировать_user_agent()
	
	Возврат "1C+Enterprise/" + КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияПриложенияЛок();
	
КонецФункции

// NEL заполнить Структуру NEL.
// 
// Параметры:
//  Сессия - Структура: См. СоздатьСессию - 
//  ЗначениеNEL - Строка - Значение NEL - 
//  ЗначениеReportTo - Строка - Значение report-to
//  
Процедура NEL_ЗаполнитьСтруктуруNELИReportTo(Сессия, ЗначениеNEL, ЗначениеReportTo)
	
	СтруктураNEL = NEL_СоздатьЭндпоинтОтчетов();
	СтруктураReportTo = NEL_СоздатьГруппуЭндпоинтов();
	ФлагЗаполнения = Истина;
	
	Попытка
		
		ОбъектNEL = JsonВОбъект(ЗначениеNEL);
		
	Исключение
		
		// Ошибка разбора ЗначениеNEL
		ФлагЗаполнения = Ложь;
		
	КонецПопытки;
	
	Если ФлагЗаполнения Тогда
		
		Попытка
			
			ОбъектReportTo = JsonВОбъект(ЗначениеReportTo);
			
		Исключение
			
			// Ошибка разбора ЗначениеReportTo
			ФлагЗаполнения = Ложь;
			
		КонецПопытки;
		
	КонецЕсли;

	Если ФлагЗаполнения Тогда
		
		КонтурДиадокСтдКоллекцииКлиентСервер.ДополнитьСтруктуруЛок(СтруктураNEL, ОбъектNEL, Истина);
		
		Сессия.NELПолитика.NEL = СтруктураNEL;
		
		КонтурДиадокСтдКоллекцииКлиентСервер.ДополнитьСтруктуруЛок(СтруктураReportTo, ОбъектReportTo, Истина);
		
		Сессия.NELПолитика.report_to = СтруктураReportTo;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправитьHTTPЗапрос(Сессия, ПодготовленныйЗапрос, Настройки)

	СтруктураURL = РазобратьURL(ПодготовленныйЗапрос.URL);
	Соединение = Соединение(СтруктураURL, ПодготовленныйЗапрос.Аутентификация, Настройки, Сессия);

	Ответ = ВызватьHTTPМетодЛок(Соединение, ПодготовленныйЗапрос.Метод, ПодготовленныйЗапрос.HTTPЗапрос);

	Для Каждого Обработчик Из ПодготовленныйЗапрос.СобытияНаОтвет Цикл
		
		Если Обработчик = "ОбработкаОтветаСКодом401" Тогда
			
			ОбработкаОтветаСКодом401(Сессия, ПодготовленныйЗапрос, Настройки, Ответ);
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Ответ;

КонецФункции

Функция НеобходимоПовторитьЗапрос(Ответ, Настройки, ОшибкаВыполненияЗапроса)

	Если Настройки.МаксимальноеКоличествоПовторов < 1 Тогда
		
		ПовторитьЗапрос = Ложь;
		
	ИначеЕсли ОшибкаВыполненияЗапроса <> Неопределено
		Или ПовторятьПриКодеСостояния(Ответ.КодСостояния, Настройки) Тогда
		
		ПовторитьЗапрос = Истина;
		
	Иначе
		
		ЗаголовокRetryAfter = ЗначениеЗаголовка("retry-after", Ответ.Заголовки);
		
		ПовторитьЗапрос = ЗаголовокRetryAfter <> Ложь 
			И ЭтоКодСостоянияПриКоторомНужноУчитыватьЗаголовокRetryAfter(Ответ.КодСостояния);
		
	КонецЕсли;

	Возврат ПовторитьЗапрос;

КонецФункции

Функция ПовторятьПриКодеСостояния(КодСостояния, Настройки)

	ПовторПриЛюбомКодеСостоянияБольшеИлиРавным500 = Настройки.ПовторятьДляКодовСостояний = Неопределено
		И КодСостояния >= КодыСостоянияHTTP().ВнутренняяОшибкаСервера_500;
	
	КодСостоянияСоответствуетКодуСостоянияПовтора = ТипЗнч(Настройки.ПовторятьДляКодовСостояний) = Тип("Массив")
		И Настройки.ПовторятьДляКодовСостояний.Найти(КодСостояния) <> Неопределено;

	Возврат ПовторПриЛюбомКодеСостоянияБольшеИлиРавным500 Или КодСостоянияСоответствуетКодуСостоянияПовтора;
	
КонецФункции

Функция ЭтоПостоянныйРедирект(КодСостояния, Заголовки)

	КодыСостоянияHTTP = КодыСостоянияHTTP();

	Возврат ЕстьЗаголовокLocation(Заголовки) И (КодСостояния = КодыСостоянияHTTP.ПеремещеноНавсегда_301
		Или КодСостояния = КодыСостоянияHTTP.ПостоянноеПеренаправление_308);

КонецФункции

Функция ЭтоРедирект(КодСостояния, Заголовки)

	КодыСостоянияHTTP = КодыСостоянияHTTP();

	СостоянияРедиректа = Новый Массив;
	СостоянияРедиректа.Добавить(КодыСостоянияHTTP.ПеремещеноНавсегда_301);
	СостоянияРедиректа.Добавить(КодыСостоянияHTTP.ПеремещеноВременно_302);
	СостоянияРедиректа.Добавить(КодыСостоянияHTTP.СмотретьДругое_303);
	СостоянияРедиректа.Добавить(КодыСостоянияHTTP.ВременноеПеренаправление_307);
	СостоянияРедиректа.Добавить(КодыСостоянияHTTP.ПостоянноеПеренаправление_308);

	Возврат ЕстьЗаголовокLocation(Заголовки) И СостоянияРедиректа.Найти(КодСостояния) <> Неопределено;

КонецФункции

Процедура УпаковатьЗапрос(Запрос)

	Заголовок = ЗначениеЗаголовка("content-encoding", Запрос.Заголовки);
	
	Если Заголовок <> Ложь Тогда
		
		Если НРег(Заголовок) = "gzip" Тогда
			
			Запрос.УстановитьТелоИзДвоичныхДанных(ЗаписатьGZip(Запрос.ПолучитьТелоКакДвоичныеДанные()));
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Распаковать ответ.
//
// Параметры:
//  Ответ	 - Структура - См. НовыйОтвет
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Распакованный ответ
//
Функция РаспаковатьОтвет(Ответ)

	Заголовок = ЗначениеЗаголовка("content-encoding", Ответ.Заголовки);
	
	Если Заголовок <> Ложь Тогда
		
		Если НРег(Заголовок) = "gzip" Тогда
			
			Возврат ПрочитатьGZip(Ответ.ТелоКакДвоичныеДанные);
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Ответ.ТелоКакДвоичныеДанные;

КонецФункции

Процедура ОбработкаОтветаСКодом401(Сессия, ПодготовленныйЗапрос, Настройки, Ответ)

	Если ЭтоРедирект(Ответ.КодСостояния, Ответ.Заголовки) Тогда
		
		Возврат;
		
	КонецЕсли;

	КодыСостоянияHTTP = КодыСостоянияHTTP();
	
	Если Ответ.КодСостояния < КодыСостоянияHTTP.НеверныйЗапрос_400
		Или Ответ.КодСостояния >= КодыСостоянияHTTP.ВнутренняяОшибкаСервера_500 Тогда
		
		Возврат;
		
	КонецЕсли;

	Значение = ЗначениеЗаголовка("www-authenticate", Ответ.Заголовки);

	Позиция = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(НРег(Значение), "digest");

	Если Значение <> Ложь И Позиция Тогда
		
		Значение = Сред(Значение, Позиция + СтрДлина("digest") + 1);
		Значение = СтрЗаменить(Значение, """", "");
		Значение = СтрЗаменить(Значение, Символы.ПС, "");

		ПараметрыDigest = Новый Структура("algorithm,realm,nonce,qop,opaque");
		
		Для Каждого Часть Из РазбитьСтрокуПоСтроке(Значение, ", ") Цикл
			
			КлючЗначение = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Часть, "=");
			ПараметрыDigest.Вставить(КлючЗначение[0], КлючЗначение[1]);
			
		КонецЦикла;

		Сессия.СлужебныеДанные.ПараметрыDigest = ПараметрыDigest;

		ПодготовленныйЗапрос.Заголовки.Вставить("Authorization",
			ПодготовитьЗаголовокDigest(Сессия, ПодготовленныйЗапрос));
		ПодготовленныйЗапрос.HTTPЗапрос.Заголовки = ПодготовленныйЗапрос.Заголовки;

		Ответ = ОтправитьHTTPЗапрос(Сессия, ПодготовленныйЗапрос, Настройки);
		
	КонецЕсли;

КонецПроцедуры

Функция ПодготовитьURL(Знач URL, ПараметрыЗапроса = Неопределено)

	URL = СокрЛ(URL);

	СтруктураURL = РазобратьURL(URL);

	ПодготовленныйURL = СтруктураURL.Схема + "://";
	
	Если ЗначениеЗаполнено(СтруктураURL.Аутентификация.Пользователь) Тогда
		
		ПодготовленныйURL = ПодготовленныйURL + СтруктураURL.Аутентификация.Пользователь + ":"
			+ СтруктураURL.Аутентификация.Пароль + "@";
			
	КонецЕсли;
	
	ПодготовленныйURL = ПодготовленныйURL + СтруктураURL.Сервер;
	
	Если ЗначениеЗаполнено(СтруктураURL.Порт) Тогда
		
		ПодготовленныйURL = ПодготовленныйURL + ":" + ПолучитьПредставлениеЧислаЛок(СтруктураURL.Порт);
		
	КонецЕсли;

	ПодготовленныйURL = ПодготовленныйURL + СобратьАдресРесурса(СтруктураURL, ПараметрыЗапроса);

	Возврат ПодготовленныйURL;

КонецФункции

Функция СобратьАдресРесурса(СтруктураURL, ПараметрыЗапроса)

	АдресРесурса = СтруктураURL.Путь;

	ОбъединенныеПараметрыЗапроса = Объединить(Скопировать(ПараметрыЗапроса), СтруктураURL.ПараметрыЗапроса);
	
	Если ЗначениеЗаполнено(ОбъединенныеПараметрыЗапроса) Тогда
		
		АдресРесурса = АдресРесурса + "?" + КодироватьПараметрыЗапроса(ОбъединенныеПараметрыЗапроса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураURL.Фрагмент) Тогда
		
		АдресРесурса = АдресРесурса + "#" + СтруктураURL.Фрагмент;
		
	КонецЕсли;

	Возврат АдресРесурса;

КонецФункции

Функция СформироватьНовыйURLПриПеренаправлении(Ответ)

	НовыйURL = ЗначениеЗаголовка("location", Ответ.Заголовки);
	НовыйURL = РаскодироватьСтрокуЛок(НовыйURL, "URLВКодировкеURL");

	// Редирект без схемы
	Если КонтурДиадокСтдСтрКлиентСервер.СтрНачинаетсяСЛок(НовыйURL, "//") Тогда
		
		СтруктураURL = РазобратьURL(Ответ.URL);
		НовыйURL = СтруктураURL.Схема + ":" + НовыйURL;
		
	КонецЕсли;

	СтруктураURL = РазобратьURL(НовыйURL);
	
	Если РазбитьСтрокуПоСтроке(НовыйURL, "://").Количество() < 2 Тогда
		
		СтруктураURLОтвета = РазобратьURL(Ответ.URL);
		БазовыйURL = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			"%1://%2",
			СтруктураURLОтвета.Схема,
			СтруктураURLОтвета.Сервер
		);
		
		Если ЗначениеЗаполнено(СтруктураURLОтвета.Порт) Тогда
			
			БазовыйURL = БазовыйURL + ":" + ПолучитьПредставлениеЧислаЛок(СтруктураURLОтвета.Порт);
			
		КонецЕсли;
		
		Если КонтурДиадокСтдСтрКлиентСервер.СтрНачинаетсяСЛок(НовыйURL, "/") Тогда
			
			НовыйURL = БазовыйURL + НовыйURL;
			
		Иначе
			
			ИндексПоследнегоСлеша = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(СтруктураURLОтвета.Путь, "/", "СКонца");
			РодительскаяДиректория = Лев(СтруктураURLОтвета.Путь, ИндексПоследнегоСлеша);
			НовыйURL = БазовыйURL + РодительскаяДиректория + НовыйURL;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат НовыйURL;

КонецФункции

// Настройки подключения.
//
// Параметры:
//  Метод					 - Строка					 - Метод
//  URL						 - Строка					 - URL
//  ДополнительныеПараметры	 - Структура, Произвольный	 - Дополнительные параметры
//  Сессия	 - Структура: см. НоваяСессия - Дополнительные параметры
// 
// Возвращаемое значение:
//  Структура - Настройки подключения:
//  * Таймаут - Число -
//  * РазрешитьПеренаправление - Булево -
//  * ПроверятьSSL - Булево -
//  * КлиентскийСертификатSSL - Булево, СертификатКлиентаФайл, СертификатКлиентаWindows -
//  * Прокси - Неопределено, ИнтернетПрокси -
//  * МаксимальноеКоличествоПовторов - Число -
//  * ПовторятьДляКодовСостояний - Булево -
//  * КоэффициентЭкспоненциальнойЗадержки - Число -
//  * МаксимальноеВремяПовторов - Число -
//
Функция НастройкиПодключения(Метод, URL, ДополнительныеПараметры, Сессия)

	РазрешитьПеренаправление = ЗначениеПоКлючу(ДополнительныеПараметры, "РазрешитьПеренаправление", ВРег(Метод) <> "HEAD");
	ПроверятьSSL = ЗначениеПоКлючу(ДополнительныеПараметры, "ПроверятьSSL", Истина);
	КлиентскийСертификатSSL = ЗначениеПоКлючу(ДополнительныеПараметры, "КлиентскийСертификатSSL");
	Прокси = ЗначениеПоКлючу(ДополнительныеПараметры, "Прокси", ЗначениеПоКлючу(Сессия, "Прокси", ПроксиПоУмолчанию(URL)));
	МаксимальноеКоличествоПовторов = ЗначениеПоКлючу(ДополнительныеПараметры, "МаксимальноеКоличествоПовторов", 0);
	ПовторятьДляКодовСостояний = ЗначениеПоКлючу(ДополнительныеПараметры, "ПовторятьДляКодовСостояний", Неопределено);
	КоэффициентЭкспоненциальнойЗадержки = ЗначениеПоКлючу(ДополнительныеПараметры, "КоэффициентЭкспоненциальнойЗадержки", 1);
	МаксимальноеВремяПовторов = ЗначениеПоКлючу(ДополнительныеПараметры, "МаксимальноеВремяПовторов", 600);

	Настройки = Новый Структура;
	Настройки.Вставить("Таймаут", Таймаут(ДополнительныеПараметры));
	Настройки.Вставить("РазрешитьПеренаправление", РазрешитьПеренаправление);
	Настройки.Вставить("ПроверятьSSL", ПроверятьSSL);
	Настройки.Вставить("КлиентскийСертификатSSL", КлиентскийСертификатSSL);
	Настройки.Вставить("Прокси", Прокси);
	Настройки.Вставить("МаксимальноеКоличествоПовторов", МаксимальноеКоличествоПовторов);
	Настройки.Вставить("ПовторятьДляКодовСостояний", ПовторятьДляКодовСостояний);
	Настройки.Вставить("КоэффициентЭкспоненциальнойЗадержки", КоэффициентЭкспоненциальнойЗадержки);
	Настройки.Вставить("МаксимальноеВремяПовторов", МаксимальноеВремяПовторов);

	Возврат Настройки;

КонецФункции

// Соединение.
//
// Параметры:
//  ПараметрыСоединения		 - Структура: см. РазобратьURL - Параметры соединения
//  Аутентификация			 - Неопределено, Структура	 - Аутентификация:
//  	* ИспользоватьАутентификациюОС - Булево - включает использование аутентификации NTLM или Negotiate.
//  	Значение по умолчанию = Ложь.
//  	* Тип - Строка - тип аутентификации. Для Basic Тип можно не указывать.
//  	Если Тип = Digest или Basic
//  	* Пользователь - Строка - имя пользователя.
//  	* Пароль - Строка - пароль пользователя.
//  ДополнительныеПараметры	 - Структура				 - Дополнительные параметры
//  Сессия					 - Структура				 - См. СоздатьСессию
// 
// Возвращаемое значение:
//  HTTPСоединение - Соединение
//
Функция Соединение(ПараметрыСоединения, Аутентификация, ДополнительныеПараметры, Сессия)

	Если Не ЗначениеЗаполнено(ПараметрыСоединения.Порт) Тогда
		
		Если ПараметрыСоединения.Схема = "https" Тогда
			
			ПараметрыСоединения.Порт = 443;
			
		Иначе
			
			ПараметрыСоединения.Порт = 80;
			
		КонецЕсли;
		
	КонецЕсли;

	ЗащищенноеСоединение = Неопределено;
	
	Если ПараметрыСоединения.Схема = "https" Тогда
		
		ЗащищенноеСоединение = ОбъектЗащищенногоСоединения(ДополнительныеПараметры);
		
	КонецЕсли;

	Пользователь = "";
	Пароль = "";
	
	Если ЗначениеЗаполнено(Аутентификация) Тогда
		
		Если Аутентификация.Свойство("Пользователь") И Аутентификация.Свойство("Пароль") Тогда
			
			Пользователь = Аутентификация.Пользователь;
			Пароль = Аутентификация.Пароль;
			
		КонецЕсли;
		
	КонецЕсли;

	ИспользоватьАутентификациюОС = Аутентификация.Свойство("ИспользоватьАутентификациюОС")
		И Аутентификация.ИспользоватьАутентификациюОС = Истина;

	ПараметрыДляРасчетаИдентификатора = Новый Массив; // Массив из Произвольный
	ПараметрыДляРасчетаИдентификатора.Добавить(ПараметрыСоединения.Сервер);
	ПараметрыДляРасчетаИдентификатора.Добавить(ПараметрыСоединения.Порт);
	ПараметрыДляРасчетаИдентификатора.Добавить(Пользователь);
	ПараметрыДляРасчетаИдентификатора.Добавить(Пароль);
	ПараметрыДляРасчетаИдентификатора.Добавить(ДополнительныеПараметры.Таймаут);
	ПараметрыДляРасчетаИдентификатора.Добавить(ИспользоватьАутентификациюОС);
	ПараметрыДляРасчетаИдентификатора.Добавить(ЗащищенноеСоединение);
	ПараметрыДляРасчетаИдентификатора.Добавить(ДополнительныеПараметры.Прокси);

	Если Не Сессия.Свойство("СлужебныеДанные") Или ТипЗнч(Сессия.СлужебныеДанные) <> Тип("Структура") Тогда
		
		Сессия.Вставить("СлужебныеДанные", Новый Структура);
		
	КонецЕсли;
	
	Если Не Сессия.СлужебныеДанные.Свойство("ПулСоединений") Тогда
		
		Сессия.СлужебныеДанные.Вставить("ПулСоединений", Новый Соответствие);
		
	КонецЕсли;
	
	ПулСоединений = Сессия.СлужебныеДанные.ПулСоединений;

	ИдентификаторСоединения = ИдентификаторСоединения(ПараметрыДляРасчетаИдентификатора);

	Если ПулСоединений.Получить(ИдентификаторСоединения) = Неопределено Тогда
		
		Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
			
			Если Не КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавноЛок("8.3.7") Тогда
				
				ИспользоватьАутентификациюОС = Неопределено;
				
			КонецЕсли;

			НовоеСоединение = КонтурДиадокКоннекторHTTPСлужебный83.HTTPСоединениеЛок(
				ПараметрыСоединения.Сервер,
				ПараметрыСоединения.Порт,
				Пользователь,
				Пароль,
				ДополнительныеПараметры.Прокси,
				ДополнительныеПараметры.Таймаут,
				ЗащищенноеСоединение,
				ИспользоватьАутентификациюОС
			);
			
		Иначе
			
			НовоеСоединение = Новый HTTPСоединение(
				ПараметрыСоединения.Сервер,
				ПараметрыСоединения.Порт,
				Пользователь,
				Пароль,
				ДополнительныеПараметры.Прокси,
				ДополнительныеПараметры.Таймаут,
				ЗащищенноеСоединение
			);
			
		КонецЕсли;
		
		ПулСоединений.Вставить(ИдентификаторСоединения, НовоеСоединение);
		
	КонецЕсли;

	Возврат ПулСоединений[ИдентификаторСоединения];

КонецФункции

Функция ИдентификаторСоединения(ПараметрыСоединения)

	ПараметрыДляРасчетаИдентификатора = Новый Массив; // Массив из Строка

	Для Каждого Элемент Из ПараметрыСоединения Цикл
		
		ТипЭлемента = ТипЗнч(Элемент);
		
		Если ТипЭлемента = Тип("ИнтернетПрокси") Тогда
			
			ПараметрыДляРасчетаИдентификатора.Добавить(
				КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Элемент.НеИспользоватьПроксиДляАдресов, "")
			);
			
			ПараметрыДляРасчетаИдентификатора.Добавить(XMLСтрока(Элемент.НеИспользоватьПроксиДляЛокальныхАдресов));
			ПараметрыДляРасчетаИдентификатора.Добавить(Элемент.Пользователь);
			ПараметрыДляРасчетаИдентификатора.Добавить(Элемент.Пароль);
			
		ИначеЕсли ТипЭлемента = Тип("ЗащищенноеСоединениеOpenSSL") Тогда
			
			Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
				
				// Для упрощения будет считать, что сертификаты в рамках сессии не меняются
				Если Элемент.СертификатКлиента = Неопределено Тогда
					
					ПараметрыДляРасчетаИдентификатора.Добавить("");
					
				Иначе
					
					ПараметрыДляРасчетаИдентификатора.Добавить(Строка(ТипЗнч(Элемент.СертификатКлиента)));
					
				КонецЕсли;
				
				Если Элемент.СертификатыУдостоверяющихЦентров = Неопределено Тогда
					
					ПараметрыДляРасчетаИдентификатора.Добавить("");
					
				Иначе
					
					ПараметрыДляРасчетаИдентификатора.Добавить(Строка(ТипЗнч(Элемент.СертификатыУдостоверяющихЦентров)));
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ПараметрыДляРасчетаИдентификатора.Добавить(XMLСтрока(Элемент));
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат ПростойХэшЛок(КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(ПараметрыДляРасчетаИдентификатора, ""));

КонецФункции

// Расчет простого хеша строки
// Ссылки:
// https://www.strchr.com/hash_functions
// https://infostart.ru/1c/tools/70030/
// 
// Параметры:
//  СтрокаХэш - Строка - исходный текст
//  hash - Число - начальное значение hash начальное значение hash
//  M - Число - множитель (влияет накачество хэш и производительность)
//  по умолчанию M = 31; Умножитель
//  TABLE_SIZE - Число - - размер получаемого ключа, как Максимальная величина + 1
//  по умолчанию TABLE_SIZE = 18446744073709551615 (64 бита)
// 
// Возвращаемое значение:
//  Число - Простой хэш лок
//  
Функция ПростойХэшЛок(СтрокаХэш, hash = 0, M = 31, TABLE_SIZE = 18446744073709551616)
	 
	ДлинаСтроки = СтрДлина(СтрокаХэш);
	
	Для Инд = 1 По ДлинаСтроки Цикл
		
		hash = M * hash + КодСимвола(Сред(СтрокаХэш, Инд, 1));
		
	КонецЦикла;
	
	Возврат hash % TABLE_SIZE;
	
КонецФункции

Функция ОбъектЗащищенногоСоединения(ДополнительныеПараметры)
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавноЛок("8.3.8") Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.ОбъектЗащищенногоСоединенияЛок(ДополнительныеПараметры);
		
	Иначе
		
		Возврат Новый ЗащищенноеСоединениеOpenSSL;
		
	КонецЕсли;
	
КонецФункции

Функция Таймаут(ДополнительныеПараметры)

	Если ДополнительныеПараметры.Свойство("Таймаут") И ЗначениеЗаполнено(ДополнительныеПараметры.Таймаут) Тогда
		
		Таймаут = ДополнительныеПараметры.Таймаут;
		
	Иначе
		
		Таймаут = СтандартныйТаймаут();
		
	КонецЕсли;

	Возврат Таймаут;

КонецФункции

// Прокси по умолчанию.
//
// Параметры:
//  URL	 - Строка - URL
// 
// Возвращаемое значение:
//  ИнтернетПрокси - Прокси по умолчанию
//
Функция ПроксиПоУмолчанию(URL)

	ПроксиПоУмолчанию = Новый ИнтернетПрокси;
	ИмяОМПолученияФайловБСП = "ПолучениеФайловИзИнтернета";
	
	Попытка
		
		Модуль = КонтурДиадокСтдОбщегоНазначения.ОбщийМодульЛок(ИмяОМПолученияФайловБСП);
		СтруктураURL = РазобратьURL(URL);
		ПроксиПоУмолчанию = Модуль.ПолучитьПрокси(СтруктураURL.Схема); // - ИнтернетПрокси
		
	Исключение
		;
	КонецПопытки;

	Возврат ПроксиПоУмолчанию;

КонецФункции

// Текущая сессия.
//
// Параметры:
//  Сессия	 - Неопределено, Структура: См. СоздатьСессию - 
// 
// Возвращаемое значение:
//  Структура: См. СоздатьСессию
//
Функция ТекущаяСессия(Сессия)

	Если Сессия = Неопределено Тогда
		
		Сессия = СоздатьСессию();
		
	КонецЕсли;

	Возврат Сессия;

КонецФункции

Функция ЗаголовкиВСтроку(Заголовки)

	РазделительСтрок = Символы.ВК + Символы.ПС;
	Строки = Новый Массив;

	СортированныеЗаголовки = "Content-Disposition, Content-Type, Content-Location";
	МассивСортированныеЗаголовки = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(СортированныеЗаголовки, ",");
	
	Для Каждого Ключ Из МассивСортированныеЗаголовки Цикл
		
		Значение = ЗначениеЗаголовка(Ключ, Заголовки);
		
		Если Значение <> Ложь И ЗначениеЗаполнено(Значение) Тогда
			
			Строки.Добавить(
				КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
					"%1: %2",
					Ключ,
					Значение
				)
			);
			
		КонецЕсли;
		
	КонецЦикла;

	Ключи = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(ВРег(СортированныеЗаголовки), ",");
	
	Для Каждого Заголовок Из Заголовки Цикл
		
		Если Ключи.Найти(ВРег(Заголовок.Ключ)) = Неопределено Тогда
			
			Строки.Добавить(
				КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
					"%1: %2",
					Заголовок.Ключ,
					Заголовок.Значение
				)
			);
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Строки, РазделительСтрок);

КонецФункции

Процедура УдалитьЗаголовки(Заголовки, СписокЗаголовковСтрокой)

	ЗаголовкиДляУдаления = Новый Массив;
	СписокЗаголовков = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(СписокЗаголовковСтрокой, ",", Ложь);
	
	Для Каждого Заголовок Из Заголовки Цикл
		
		Если СписокЗаголовков.Найти(НРег(Заголовок.Ключ)) <> Неопределено Тогда
			
			ЗаголовкиДляУдаления.Добавить(Заголовок.Ключ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЗаголовокДляУдаления Из ЗаголовкиДляУдаления Цикл
		
		Заголовки.Удалить(ЗаголовокДляУдаления);
		
	КонецЦикла;

КонецПроцедуры

Функция ЕстьЗаголовокLocation(Заголовки)

	Возврат ЗначениеЗаголовка("location", Заголовки) <> Ложь;

КонецФункции

Функция КодировкаИзЗаголовка(Знач Заголовок)

	Кодировка = Неопределено;

	Заголовок = НРег(СокрЛП(Заголовок));
	ИндексРазделителя = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(Заголовок, ";");
	
	Если ИндексРазделителя Тогда
		
		ТипСодержимого = СокрЛП(Лев(Заголовок, ИндексРазделителя - 1));
		КлючКодировки = "charset=";
		ИндексКодировки = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(Заголовок, КлючКодировки);
		
		Если ИндексКодировки Тогда
			
			ИндексРазделителя = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(Заголовок, ";", "СНачала", ИндексКодировки);
			
			НачальнаяПозиция = ИндексКодировки + СтрДлина(КлючКодировки);
			
			Если ИндексРазделителя Тогда
				
				ДлинаКодировки = ИндексРазделителя - НачальнаяПозиция;
				
			Иначе
				
				ДлинаКодировки = СтрДлина(Заголовок);
				
			КонецЕсли;
			
			Кодировка = Сред(Заголовок, НачальнаяПозиция, ДлинаКодировки);
			Кодировка = СтрЗаменить(Кодировка, """", "");
			Кодировка = СтрЗаменить(Кодировка, "'", "");
			
		КонецЕсли;
		
	Иначе
		
		ТипСодержимого = Заголовок;
		
	КонецЕсли;

	Если Кодировка = Неопределено И КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(ТипСодержимого, "text") Тогда
		
		Кодировка = "iso-8859-1";
		
	КонецЕсли;

	Возврат Кодировка;

КонецФункции

Функция ЗначениеЗаголовка(Заголовок, ВсеЗаголовки, Ключ = Неопределено)

	Для Каждого ОчереднойЗаголовок Из ВсеЗаголовки Цикл
		
		Если НРег(ОчереднойЗаголовок.Ключ) = НРег(Заголовок) Тогда
			
			Ключ = ОчереднойЗаголовок.Ключ;
			
			Возврат ОчереднойЗаголовок.Значение;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ПодготовитьЗаголовокDigest(Сессия, ПодготовленныйЗапрос)

	ПараметрыDigest = Сессия.СлужебныеДанные.ПараметрыDigest;

	Алгоритм = ОпределитьХешФункцию(ПараметрыDigest.algorithm);
	
	Если Алгоритм = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;

	СтруктураURL = РазобратьURL(ПодготовленныйЗапрос.URL);
	Путь = СтруктураURL.Путь;
	
	Если ЗначениеЗаполнено(СтруктураURL.ПараметрыЗапроса) Тогда
		
		Путь = Путь + "?" + КодироватьПараметрыЗапроса(СтруктураURL.ПараметрыЗапроса);
		
	КонецЕсли;

	A1 = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
		"%1:%2:%3",
		ПодготовленныйЗапрос.Аутентификация.Пользователь,
		ПараметрыDigest.realm,
		ПодготовленныйЗапрос.Аутентификация.Пароль
	);

	A2 = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
		"%1:%2",
		ПодготовленныйЗапрос.Метод,
		Путь
	);

	HA1 = ХешированиеДанныхЛок(Алгоритм, A1);
	HA2 = ХешированиеДанныхЛок(Алгоритм, A2);

	Если Не ПараметрыDigest.Свойство("last_nonce") Тогда
		
		ПараметрыDigest.Вставить("last_nonce");
		
	КонецЕсли;

	Если ПараметрыDigest.nonce = ПараметрыDigest.last_nonce Тогда
		
		ПараметрыDigest.nonce_count = ПараметрыDigest.nonce_count + 1;
		
	Иначе
		
		ПараметрыDigest.Вставить("nonce_count", 1);
		
	КонецЕсли;

	ЗначениеNC = Формат(ПараметрыDigest.nonce_count, "ЧЦ=8; ЧВН=; ЧГ=");
	ЗначениеNonce = Лев(СтрЗаменить(НРег(Новый УникальныйИдентификатор), "-", ""), 16);

	Если Алгоритм = "MD5-SESS" Тогда
		
		HA1 = ХешированиеДанныхЛок(Алгоритм,
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				"%1:%2:%3",
				HA1,
				ПараметрыDigest.nonce,
				ЗначениеNonce
			)
		);
		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПараметрыDigest.qop) Тогда
		
		ЗначениеResponse = ХешированиеДанныхЛок(Алгоритм,
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				"%1:%2:%3",
				HA1,
				ПараметрыDigest.nonce,
				HA2
			)
		);
		
	ИначеЕсли ПараметрыDigest.qop = "auth"
		Или КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(
			ПараметрыDigest.qop, ",", Ложь).Найти("auth") <> Неопределено Тогда
			
		ЗначениеNonceBit = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			"%1:%2:%3:%4:%5",
			ПараметрыDigest.nonce,
			ЗначениеNC,
			ЗначениеNonce,
			"auth",
			HA2
		);
		
		ЗначениеResponse = ХешированиеДанныхЛок(Алгоритм,
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				"%1:%2",
				HA1,
				ЗначениеNonceBit
			)
		);
		
	Иначе
		
		// INFO: auth-int не реализовано
		Возврат Неопределено;
		
	КонецЕсли;

	ПараметрыDigest.last_nonce = ПараметрыDigest.nonce;

	База = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
		"username=""%1"", realm=""%2"", nonce=""%3"", uri=""%4"", response=""%5""",
		ПодготовленныйЗапрос.Аутентификация.Пользователь,
		ПараметрыDigest.realm,
		ПараметрыDigest.nonce,
		Путь,
		ЗначениеResponse
		);
		
	Строки = Новый Массив; // Массив из Строка
	Строки.Добавить(База);

	Если ЗначениеЗаполнено(ПараметрыDigest.opaque) Тогда
		
		Строки.Добавить(
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				", opaque=""%1""",
				ПараметрыDigest.opaque
			)
		);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыDigest.algorithm) Тогда
		
		Строки.Добавить(
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				", algorithm=""%1""",
				ПараметрыDigest.algorithm
			)
		);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыDigest.qop) Тогда
		
		Строки.Добавить(
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				", qop=""auth"", nc=%1, cnonce=""%2""",
				ЗначениеNC,
				ЗначениеNonce
			)
		);
		
	КонецЕсли;

	Возврат КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
		"Digest %1",
		КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Строки, "")
	);

КонецФункции

Процедура ПодготовитьCookies(ПодготовленныйЗапрос)

	ЗаголовокCookie = ПодготовитьЗаголовокCookie(ПодготовленныйЗапрос);
	
	Если ЗначениеЗаполнено(ЗаголовокCookie) Тогда
		
		ПодготовленныйЗапрос.Заголовки["Cookie"] = ЗаголовокCookie;
		
	КонецЕсли;

КонецПроцедуры

Функция ПодготовитьЗаголовокCookie(ПодготовленныйЗапрос)

	СтруктураURL = РазобратьURL(ПодготовленныйЗапрос.URL);

	Cookies = Новый Массив;
	
	Для Каждого Cookie Из ОтобратьCookiesДляЗапроса(СтруктураURL, ПодготовленныйЗапрос.Cookies) Цикл
		
		Cookies.Добавить(
			КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				"%1=%2",
				Cookie.Наименование,
				Cookie.Значение
			)
		);
		
	КонецЦикла;

	Возврат КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Cookies, "; ");
	
КонецФункции

Функция ОбъединитьCookies(ГлавныйИсточник, ДополнительныйИсточник)

	Cookies = Новый Соответствие;
	
	Для Каждого Cookie Из ПреобразоватьХранилищеCookiesВМассивCookies(ГлавныйИсточник) Цикл
		
		ДобавитьCookieВХранилище(Cookies, Cookie, Истина);
		
	КонецЦикла;
	
	Для Каждого Cookie Из ПреобразоватьХранилищеCookiesВМассивCookies(ДополнительныйИсточник) Цикл
		
		ДобавитьCookieВХранилище(Cookies, Cookie, Истина);
		
	КонецЦикла;

	Возврат Cookies;

КонецФункции

Функция ПреобразоватьХранилищеCookiesВМассивCookies(ХранилищеCookies)

	Cookies = Новый Массив; // Массив из Строка
	
	Если ТипЗнч(ХранилищеCookies) = Тип("Массив") Тогда
		
		Для Каждого Cookie Из ХранилищеCookies Цикл
			
			НоваяCookie = КонструкторCookie();
			ЗаполнитьЗначенияСвойств(НоваяCookie, Cookie);
			Cookies.Добавить(НоваяCookie);
			
		КонецЦикла;

		Возврат Cookies;
		
	КонецЕсли;

	Для Каждого Домен Из ХранилищеCookies Цикл
		
		Для Каждого Путь Из Домен.Значение Цикл
			
			Для Каждого Наименование Из Путь.Значение Цикл
				
				Cookies.Добавить(Наименование.Значение);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

	Возврат Cookies;

КонецФункции

Функция ОтобратьCookiesДляЗапроса(СтруктураURL, Cookies)

	СерверВЗапросе = ДобавитьЛидирующуюТочку(СтруктураURL.Сервер);

	Результат = Новый Массив;
	
	Для Каждого Домен Из Cookies Цикл
		
		Если Не КонтурДиадокСтдСтрКлиентСервер.СтрЗаканчиваетсяНаЛок(СерверВЗапросе, Домен.Ключ) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого Путь Из Домен.Значение Цикл
			
			Если Не КонтурДиадокСтдСтрКлиентСервер.СтрНачинаетсяСЛок(СтруктураURL.Путь, Путь.Ключ) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЗаполнитьСписокОтфильтрованнымиCookies(Путь.Значение, СтруктураURL, Результат);
			
		КонецЦикла;
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ЗаполнитьСписокОтфильтрованнымиCookies(Cookies, СтруктураURL, Список)

	Для Каждого Cookie Из Cookies Цикл
		
		Если Cookie.Значение.ТолькоБезопасноеСоединение = Истина И СтруктураURL.Схема <> "https" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		// INFO: проверка срока действия игнорируется (Cookie.Значение.СрокДействия)
		// INFO: проверка порта игнорируется

		Список.Добавить(Cookie.Значение);
		
	КонецЦикла;

КонецПроцедуры

Функция ДозаполнитьCookie(Cookies, URL)

	СтруктураURL = РазобратьURL(URL);
	НовыеCookies = Новый Массив;
	
	Если ТипЗнч(Cookies) = Тип("Массив") Тогда
		
		Для Каждого Cookie Из Cookies Цикл
			
			НовыйCookie = КонструкторCookie(Cookie.Наименование, Cookie.Значение);
			ЗаполнитьЗначенияСвойств(НовыйCookie, Cookie);

			Если Не ЗначениеЗаполнено(НовыйCookie.Домен) Тогда
				
				НовыйCookie.Домен = СтруктураURL.Сервер;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НовыйCookie.Путь) Тогда
				
				НовыйCookie.Путь = "/";
				
			КонецЕсли;

			НовыеCookies.Добавить(НовыйCookie);
			
		КонецЦикла;
		
		Возврат НовыеCookies;
		
	КонецЕсли;

	Возврат Cookies;

КонецФункции

Функция ИзвлечьCookies(Заголовки, URL)

	ТекущееВремя = ТекущаяУниверсальнаяДата();
	Cookies = Новый Соответствие;
	
	Для Каждого ОчереднойЗаголовок Из Заголовки Цикл
		
		Если НРег(ОчереднойЗаголовок.Ключ) = "set-cookie" Тогда
			
			Для Каждого ЗаголовокCookie Из РазбитьНаОтдельныеЗаголовкиCookies(ОчереднойЗаголовок.Значение) Цикл
				
				Cookie = РаспарситьCookie(ЗаголовокCookie, URL, ТекущееВремя);
				
				Если Cookie = Неопределено Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если Cookie.СрокДействия <= ТекущееВремя Тогда
					
					УдалитьCookieИзХранилища(Cookies, Cookie);
					
				Иначе
					
					ДобавитьCookieВХранилище(Cookies, Cookie);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Cookies;

КонецФункции

Функция РазбитьНаОтдельныеЗаголовкиCookies(Знач Заголовок)

	Заголовки = Новый Массив; // Массив из Строка

	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		
		Возврат Заголовки;
		
	КонецЕсли;

	ЗапчастиЗаголовков = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Заголовок, ",", Ложь);

	ОтдельныйЗаголовок = ЗапчастиЗаголовков[0];
	
	Для Индекс = 1 По ЗапчастиЗаголовков.ВГраница() Цикл
		
		ТочкаСЗапятой = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(ЗапчастиЗаголовков[Индекс], ";");
		Равно = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(ЗапчастиЗаголовков[Индекс], "=");
		
		Если ТочкаСЗапятой И Равно И Равно < ТочкаСЗапятой Тогда
			
			Заголовки.Добавить(ОтдельныйЗаголовок);
			ОтдельныйЗаголовок = ЗапчастиЗаголовков[Индекс];
			
		Иначе
			
			ОтдельныйЗаголовок = ОтдельныйЗаголовок + ЗапчастиЗаголовков[Индекс];
			
		КонецЕсли;
		
	КонецЦикла;
	
	Заголовки.Добавить(ОтдельныйЗаголовок);

	Возврат Заголовки;
	
КонецФункции

Процедура ДобавитьCookieВХранилище(ХранилищеCookies, Cookie, Замещать = Ложь)

	Если ХранилищеCookies.Получить(Cookie.Домен) = Неопределено Тогда
		
		ХранилищеCookies[Cookie.Домен] = Новый Соответствие;
		
	КонецЕсли;
	
	Если ХранилищеCookies[Cookie.Домен].Получить(Cookie.Путь) = Неопределено Тогда
		
		ХранилищеCookies[Cookie.Домен][Cookie.Путь] = Новый Соответствие;
		
	КонецЕсли;
	
	Если ХранилищеCookies[Cookie.Домен][Cookie.Путь].Получить(Cookie.Наименование) = Неопределено Или Замещать Тогда
		
		ХранилищеCookies[Cookie.Домен][Cookie.Путь][Cookie.Наименование] = Cookie;
		
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьCookieИзХранилища(ХранилищеCookies, Cookie)

	Если ХранилищеCookies.Получить(Cookie.Домен) <> Неопределено
		И ХранилищеCookies[Cookie.Домен].Получить(Cookie.Путь) <> Неопределено
		И ХранилищеCookies[Cookie.Домен][Cookie.Путь].Получить(Cookie.Наименование) <> Неопределено Тогда
			
		ХранилищеCookies[Cookie.Домен][Cookie.Путь].Удалить(Cookie.Наименование);
		
	КонецЕсли;

КонецПроцедуры

Функция РаспарситьCookie(Заголовок, URL, ТекущееВремя)

	Cookie = Неопределено;
	Индекс = 0;
	МассивПараметров = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Заголовок, ";", Ложь);
	
	Для Каждого Параметр Из МассивПараметров Цикл
		
		Индекс = Индекс + 1;
		Параметр = СокрЛП(Параметр);

		Если Индекс = 1 Тогда
			
			Cookie = СоздатьCookieИЗаполнитьОсновныеПараметры(Параметр);
			Продолжить;
			
		КонецЕсли;

		Части = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Параметр, "=", Ложь);
		
		Ключ = НРег(Части[0]);
		
		Если Части.Количество() > 1 Тогда
			
			Значение = Части[1];
			
		КонецЕсли;

		Если Ключ = "domain" Тогда
			
			Cookie.Домен = Значение;
			
		ИначеЕсли Ключ = "path" Тогда
			
			Cookie.Путь = Значение;
			
		ИначеЕсли Ключ = "secure" Тогда
			
			Cookie.ТолькоБезопасноеСоединение = Истина;
			
		ИначеЕсли Ключ = "max-age" Тогда
			
			СрокДействияMaxAge = ТекущееВремя + ЧислоИзСтрокиЛок(Значение);
			
		ИначеЕсли Ключ = "expires" Тогда
			
			Cookie.СрокДействия = ДатаИзСтрокиRFC7231(Значение);
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Cookie) И ЗначениеЗаполнено(СрокДействияMaxAge) Тогда
		
		Cookie.СрокДействия = СрокДействияMaxAge;
		
	КонецЕсли;

	ДозаполнитьCookieНеявнымиЗначениями(Cookie, URL);

	Возврат Cookie;

КонецФункции

Функция СоздатьCookieИЗаполнитьОсновныеПараметры(Параметр)

	Части = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Параметр, "=", Ложь);
	
	Наименование = Части[0];
	
	Если Части.Количество() > 1 Тогда
		
		Значение = Сред(Параметр, СтрДлина(Наименование) + 2);
		
	КонецЕсли;

	Возврат КонструкторCookie(Наименование, Значение);

КонецФункции

Процедура ДозаполнитьCookieНеявнымиЗначениями(Cookie, URL)

	Если Cookie = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;

	СтруктураURL = РазобратьURL(URL);
	
	Если Не ЗначениеЗаполнено(Cookie.Домен) Тогда
		
		Cookie.Домен = СтруктураURL.Сервер;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Cookie.Порт) И ЗначениеЗаполнено(СтруктураURL.Порт) Тогда
		
		Cookie.Порт = СтруктураURL.Порт;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Cookie.Путь) Тогда
		
		ПозицияПоследнегоСлеша = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(СтруктураURL.Путь, "/", "СКонца");
		
		Если ПозицияПоследнегоСлеша <= 1 Тогда
			
			Cookie.Путь = "/";
			
		Иначе
			
			Cookie.Путь = Лев(СтруктураURL.Путь, ПозицияПоследнегоСлеша - 1);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция КонструкторCookie(Наименование = "", Значение = Неопределено)

	НовыйCookie = Новый Структура;
	НовыйCookie.Вставить("Наименование", Наименование);
	НовыйCookie.Вставить("Значение", Значение);
	НовыйCookie.Вставить("Домен", "");
	НовыйCookie.Вставить("Путь", "");
	НовыйCookie.Вставить("Порт");
	НовыйCookie.Вставить("СрокДействия", '39990101');
	НовыйCookie.Вставить("ТолькоБезопасноеСоединение");

	Возврат НовыйCookie;

КонецФункции

// Заголовки по умолчанию.
// 
// Возвращаемое значение:
//  Соответствие из Строка - Заголовки по умолчанию:
//  * Ключ - Строка - ключ заголовка.
//  * Значение - Строка - значение заголовка
//
Функция ЗаголовкиПоУмолчанию()

	Заголовки = Новый Соответствие;
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Заголовки.Вставить("Accept-Encoding", "gzip");
		
	Иначе
		
		Заголовки.Вставить("Accept-Encoding", "identity");
		
	КонецЕсли;
	
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Connection", "keep-alive");

	Возврат Заголовки;

КонецФункции

Функция NEL_ЗаголовкиПоУмолчанию()

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/reports+json");

	Возврат Заголовки;

КонецФункции

// Максимальное количество перенаправлений.
// 
// Возвращаемое значение:
//  Число - Максимальное количество перенаправлений
//
Функция МаксимальноеКоличествоПеренаправлений()

	Возврат 30;

КонецФункции

Функция СтандартныйТаймаут()

	Возврат 30;

КонецФункции

// Описания кодов состояний HTTP.
// 
// Возвращаемое значение:
//  Массив из Структура: См. НовыйКодHTTP - 
//
Функция ОписанияКодовСостоянийHTTP()

	Коды = Новый Массив; // Массив из Структура
	Коды.Добавить(НовыйКодHTTP(100, "Продолжай_100", "Continue"));
	Коды.Добавить(НовыйКодHTTP(101, "ПереключениеПротокола_101", "Switching Protocols"));
	Коды.Добавить(НовыйКодHTTP(102, "ИдетОбработка_102", "Processing"));
	Коды.Добавить(НовыйКодHTTP(103, "РанняяМетаинформация_103", "Early Hints"));

	Коды.Добавить(НовыйКодHTTP(200, "ОК_200", "OK"));
	Коды.Добавить(НовыйКодHTTP(201, "Создано_201", "Created"));
	Коды.Добавить(НовыйКодHTTP(202, "Принято_202", "Accepted"));
	Коды.Добавить(НовыйКодHTTP(203, "ИнформацияНеАвторитетна_203", "Non-Authoritative Information"));
	Коды.Добавить(НовыйКодHTTP(204, "НетСодержимого_204", "No Content"));
	Коды.Добавить(НовыйКодHTTP(205, "СброситьСодержимое_205", "Reset Content"));
	Коды.Добавить(НовыйКодHTTP(206, "ЧастичноеСодержимое_206", "Partial Content"));
	Коды.Добавить(НовыйКодHTTP(207, "Многостатусный_207", "Multi-Status"));
	Коды.Добавить(НовыйКодHTTP(208, "УжеСообщалось_208", "Already Reported"));
	Коды.Добавить(НовыйКодHTTP(226, "ИспользованоIM_226", "IM Used"));

	Коды.Добавить(НовыйКодHTTP(300, "МножествоВыборов_300", "Multiple Choices"));
	Коды.Добавить(НовыйКодHTTP(301, "ПеремещеноНавсегда_301", "Moved Permanently"));
	Коды.Добавить(НовыйКодHTTP(302, "ПеремещеноВременно_302", "Moved Temporarily"));
	Коды.Добавить(НовыйКодHTTP(303, "СмотретьДругое_303", "See Other"));
	Коды.Добавить(НовыйКодHTTP(304, "НеИзменялось_304", "Not Modified"));
	Коды.Добавить(НовыйКодHTTP(305, "ИспользоватьПрокси_305", "Use Proxy"));
	Коды.Добавить(НовыйКодHTTP(307, "ВременноеПеренаправление_307", "Temporary Redirect"));
	Коды.Добавить(НовыйКодHTTP(308, "ПостоянноеПеренаправление_308", "Permanent Redirect"));

	Коды.Добавить(НовыйКодHTTP(400, "НеверныйЗапрос_400", "Bad Request"));
	Коды.Добавить(НовыйКодHTTP(401, "НеАвторизован_401", "Unauthorized"));
	Коды.Добавить(НовыйКодHTTP(402, "НеобходимаОплата_402", "Payment Required"));
	Коды.Добавить(НовыйКодHTTP(403, "Запрещено_403", "Forbidden"));
	Коды.Добавить(НовыйКодHTTP(404, "НеНайдено_404", "Not Found"));
	Коды.Добавить(НовыйКодHTTP(405, "МетодНеПоддерживается_405", "Method Not Allowed"));
	Коды.Добавить(НовыйКодHTTP(406, "Неприемлемо_406", "Not Acceptable"));
	Коды.Добавить(НовыйКодHTTP(407, "НеобходимаАутентификацияПрокси_407", "Proxy Authentication Required"));
	Коды.Добавить(НовыйКодHTTP(408, "ИстеклоВремяОжидания_408", "Request Timeout"));
	Коды.Добавить(НовыйКодHTTP(409, "Конфликт_409", "Conflict"));
	Коды.Добавить(НовыйКодHTTP(410, "Удален_410", "Gone"));
	Коды.Добавить(НовыйКодHTTP(411, "НеобходимаДлина_411", "Length Required"));
	Коды.Добавить(НовыйКодHTTP(412, "УсловиеЛожно_412", "Precondition Failed"));
	Коды.Добавить(НовыйКодHTTP(413, "ПолезнаяНагрузкаСлишкомВелика_413", "Payload Too Large"));
	Коды.Добавить(НовыйКодHTTP(414, "СлишкомДлинныйURI_414", "URI Too Long"));
	Коды.Добавить(НовыйКодHTTP(415, "НеподдерживаемыйТипДанных_415", "Unsupported Media Type"));
	Коды.Добавить(НовыйКодHTTP(416, "ДиапазонНеДостижим_416", "Range Not Satisfiable"));
	Коды.Добавить(НовыйКодHTTP(417, "ОжиданиеНеУдалось_417", "Expectation Failed"));
	Коды.Добавить(НовыйКодHTTP(419, "ОшибкаПроверкиCSRF_419", "Authentication Timeout"));
	Коды.Добавить(НовыйКодHTTP(421, "НеправильноНаправленныйЗапрос_421", "Misdirected Request"));
	Коды.Добавить(НовыйКодHTTP(422, "НеобрабатываемыйЭкземпляр_422", "Unprocessable Entity"));
	Коды.Добавить(НовыйКодHTTP(423, "Заблокировано_423", "Locked"));
	Коды.Добавить(НовыйКодHTTP(424, "НевыполненнаяЗависимость_424", "Failed Dependency"));
	Коды.Добавить(НовыйКодHTTP(425, "СлишкомРано_425", "Too Early"));
	Коды.Добавить(НовыйКодHTTP(426, "НеобходимоОбновление_426", "Upgrade Required"));
	Коды.Добавить(НовыйКодHTTP(428, "НеобходимоПредусловие_428", "Precondition Required"));
	Коды.Добавить(НовыйКодHTTP(429, "СлишкомМногоЗапросов_429", "Too Many Requests"));
	Коды.Добавить(НовыйКодHTTP(431, "ПоляЗаголовкаЗапросаСлишкомБольшие_431", "Request Header Fields Too Large"));
	Коды.Добавить(НовыйКодHTTP(449, "ПовторитьС_449", "Retry With"));
	Коды.Добавить(НовыйКодHTTP(451, "НедоступноПоЮридическимПричинам_451", "Unavailable For Legal Reasons"));
	Коды.Добавить(НовыйКодHTTP(499, "КлиентЗакрылСоединение_499", "Client Closed Request"));

	Коды.Добавить(НовыйКодHTTP(500, "ВнутренняяОшибкаСервера_500", "Internal Server Error"));
	Коды.Добавить(НовыйКодHTTP(501, "НеРеализовано_501", "Not Implemented"));
	Коды.Добавить(НовыйКодHTTP(502, "ОшибочныйШлюз_502", "Bad Gateway"));
	Коды.Добавить(НовыйКодHTTP(503, "СервисНедоступен_503", "Service Unavailable"));
	Коды.Добавить(НовыйКодHTTP(504, "ШлюзНеОтвечает_504", "Gateway Timeout"));
	Коды.Добавить(НовыйКодHTTP(505, "ВерсияHTTPНеПоддерживается_505", "HTTP Version Not Supported"));
	Коды.Добавить(НовыйКодHTTP(506, "ВариантТожеПроводитСогласование_506", "Variant Also Negotiates"));
	Коды.Добавить(НовыйКодHTTP(507, "ПереполнениеХранилища_507", "Insufficient Storage"));
	Коды.Добавить(НовыйКодHTTP(508, "ОбнаруженоБесконечноеПеренаправление_508", "Loop Detected"));
	Коды.Добавить(НовыйКодHTTP(509, "ИсчерпанаПропускнаяШиринаКанала_509", "Bandwidth Limit Exceeded"));
	Коды.Добавить(НовыйКодHTTP(510, "НеРасширено_510", "Not Extended"));
	Коды.Добавить(НовыйКодHTTP(511, "ТребуетсяСетеваяАутентификация_511", "Network Authentication Required"));
	Коды.Добавить(НовыйКодHTTP(520, "НеизвестнаяОшибка_520", "Unknown Error"));
	Коды.Добавить(НовыйКодHTTP(521, "ВебСерверНеРаботает_521", "Web Server Is Down"));
	Коды.Добавить(НовыйКодHTTP(522, "СоединениеНеОтвечает_522", "Connection Timed Out"));
	Коды.Добавить(НовыйКодHTTP(523, "ИсточникНедоступен_523", "Origin Is Unreachable"));
	Коды.Добавить(НовыйКодHTTP(524, "ВремяОжиданияИстекло_524", "A Timeout Occurred"));
	Коды.Добавить(НовыйКодHTTP(525, "КвитированиеSSНеУдалось_525", "SSL Handshake Failed"));
	Коды.Добавить(НовыйКодHTTP(526, "НедействительныйСертификатSSL_526", "Invalid SSL Certificate"));

	Возврат Коды;

КонецФункции

// Структура кода ответа HTTP.
//
// Параметры:
//  Код		 - Число	 - Код
//  Ключ	 - Строка	 - Ключ
//  Описание - Строка	 - Описание
// 
// Возвращаемое значение:
//  Структура - Новый код HTTP:
//  * Код - Число -
//  * Ключ - Строка -
//  * Описание - Строка -
//
Функция НовыйКодHTTP(Код, Ключ, Описание)

	Возврат Новый Структура("Код, Ключ, Описание", Код, Ключ, Описание);

КонецФункции

Функция ЭтоКодСостоянияПриКоторомНужноУчитыватьЗаголовокRetryAfter(КодСостояния)

	Коды = КодыСостоянияHTTP();
	Возврат КодСостояния = Коды.ПолезнаяНагрузкаСлишкомВелика_413
		Или КодСостояния = Коды.СлишкомМногоЗапросов_429
		Или КодСостояния = Коды.СервисНедоступен_503;

КонецФункции

// Определить хеш функцию.
//
// Параметры:
//  Алгоритм - Строка	 - Алгоритм
// 
// Возвращаемое значение:
//  Неопределено, Строка - Определить хеш функцию
//
Функция ОпределитьХешФункцию(Знач Алгоритм)

	Алгоритм = ВРег(Алгоритм);
	
	Если Не ЗначениеЗаполнено(Алгоритм) Или Алгоритм = "MD5" Или Алгоритм = "MD5-SESS" Тогда
		
		АлгоритмХеширования = "MD5";
		
	ИначеЕсли Алгоритм = "SHA" Тогда
		
		АлгоритмХеширования = "SHA1";
		
	ИначеЕсли Алгоритм = "SHA-256" Тогда
		
		АлгоритмХеширования = "SHA256";
		
	Иначе
		
		АлгоритмХеширования = Неопределено;
		
	КонецЕсли;

	Возврат АлгоритмХеширования;

КонецФункции

Процедура Приостановить(ДлительностьОстановкиВСекундах)

	// Когда-нибудь в платформе сделают паузу и это можно будет выкинуть

	Если ДлительностьОстановкиВСекундах < 1 Тогда
		
		Возврат;
		
	КонецЕсли;

	ТекущаяДата = ТекущаяУниверсальнаяДата();
	ЖдатьДо = ТекущаяДата + ДлительностьОстановкиВСекундах;

	// BSLLS:UsingHardcodeNetworkAddress-off
	ЛокальныйХост = "127.0.0.0";
	КакойНибудьСвободныйПорт = 56476;
	// BSLLS:UsingHardcodeNetworkAddress-on
	
	Пока ТекущаяДата < ЖдатьДо Цикл
		
		Таймаут = ЖдатьДо - ТекущаяДата;
		Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Попытка
			
			Соединение = Новый HTTPСоединение(
				ЛокальныйХост,
				КакойНибудьСвободныйПорт,
				Неопределено,
				Неопределено,
				Новый ИнтернетПрокси(Ложь),
				Таймаут);
				
			Соединение.Получить(Новый HTTPЗапрос("/does_not_matter"));
			
		Исключение
			
			РеальныйТаймаут = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
			
		КонецПопытки;
		
		МинимальныйТаймаутВМиллисекундах = 1000;
		
		Если РеальныйТаймаут < МинимальныйТаймаутВМиллисекундах Тогда
			
			ВызватьИсключение (НСтр("ru = 'Процедура Приостановить не работает должным образом'"));
			
		КонецЕсли;
		
		ТекущаяДата = ТекущаяУниверсальнаяДата();
		
	КонецЦикла;

КонецПроцедуры

Функция РассчитатьДлительностьПриостановки(Повтор, КоэффициентЭкспоненциальнойЗадержки, ЗаголовокRetryAfter, Остаток)

	Если ЗаголовокRetryAfter <> Ложь Тогда
		
		Длительность = ЧислоИзСтрокиЛок(ЗаголовокRetryAfter);

		Если Длительность = 0 Тогда
			
			Дата = ДатаИзСтрокиRFC7231(ЗаголовокRetryAfter);
			
			Если ЗначениеЗаполнено(Дата) Тогда
				
				Длительность = Дата - ТекущаяУниверсальнаяДата();
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Длительность = КоэффициентЭкспоненциальнойЗадержки * Pow(2, Повтор - 1);
		
	КонецЕсли;

	Длительность = Мин(Длительность, Остаток);

	Если Длительность < 0 Тогда
		
		Длительность = 0;
		
	КонецЕсли;

	Возврат Длительность;

КонецФункции

// Выбрать значение.
//
// Параметры:
//  ОсновноеЗначение		 - Неопределено			 - Основное значение
//  ДополнительныеЗначения	 - Структура, Произвольный	 - Дополнительные значения
//  Ключ					 - Строка					 - Ключ
//  ЗначениеПоУмолчанию		 - Произвольный				 - Значение по умолчанию
// 
// Возвращаемое значение:
//  Произвольный - Выбрать значение
//
Функция ВыбратьЗначение(ОсновноеЗначение, ДополнительныеЗначения, Ключ, ЗначениеПоУмолчанию)

	Если ОсновноеЗначение <> Неопределено Тогда
		
		Возврат ОсновноеЗначение;
		
	КонецЕсли;

	Значение = ЗначениеПоКлючу(ДополнительныеЗначения, Ключ);
	
	Если Значение <> Неопределено Тогда
		
		Возврат Значение;
		
	КонецЕсли;

	Возврат ЗначениеПоУмолчанию;

КонецФункции

// Значение по ключу.
//
// Параметры:
//  Структура			 - Произвольный, Структура, Соответствие - Структура
//  Ключ				 - Строка								 - Ключ
//  ЗначениеПоУмолчанию	 - Произвольный							 - Значение по умолчанию
// 
// Возвращаемое значение:
//  Произвольный, Структура, Соответствие - Значение по ключу
//
Функция ЗначениеПоКлючу(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)

	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Ключ) И Структура[Ключ] <> Неопределено Тогда
		
		Значение = Структура[Ключ]; // - Произвольный
		
	ИначеЕсли ТипЗнч(Структура) = Тип("Соответствие") И Структура.Получить(Ключ) <> Неопределено Тогда
		
		Значение = Структура.Получить(Ключ);
		
	Иначе
		
		Значение = ЗначениеПоУмолчанию;
		
	КонецЕсли;

	Возврат Значение;

КонецФункции

Процедура РазбитьСтрокуПоРазделителюЛок(ИзвлекаемаяЧасть, ОстальнаяЧасть, Разделитель, Инверсия = Ложь)

	Индекс = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(ОстальнаяЧасть, Разделитель);
	
	Если Индекс Тогда
		
		ИзвлекаемаяЧасть = Лев(ОстальнаяЧасть, Индекс - 1);
		ОстальнаяЧасть = Сред(ОстальнаяЧасть, Индекс + СтрДлина(Разделитель));
		
		Если Инверсия Тогда
			
			ДляОбменаЛок = ИзвлекаемаяЧасть;
			ИзвлекаемаяЧасть = ОстальнаяЧасть;
			ОстальнаяЧасть = ДляОбменаЛок;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Разделить по первому найденному разделителю.
//
// Параметры:
//  Строка		 - Строка	 - Строка
//  Разделители	 - Массив из Строка - Разделители
// 
// Возвращаемое значение:
//  Массив из Строка - Разделить по первому найденному разделителю
//
Функция РазделитьПоПервомуНайденномуРазделителюЛок(Строка, Разделители)

	МинимальныйИндекс = СтрДлина(Строка);
	ПервыйРазделитель = "";

	Для Каждого Разделитель Из Разделители Цикл
		
		Индекс = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(Строка, Разделитель);
		
		Если Индекс = 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Индекс < МинимальныйИндекс Тогда
			
			МинимальныйИндекс = Индекс;
			ПервыйРазделитель = Разделитель;
			
		КонецЕсли;
		
	КонецЦикла;

	Результат = Новый Массив; // Массив из Строка, Неопределено
	
	Если ЗначениеЗаполнено(ПервыйРазделитель) Тогда
		
		Результат.Добавить(Лев(Строка, МинимальныйИндекс - 1));
		Результат.Добавить(Сред(Строка, МинимальныйИндекс + СтрДлина(ПервыйРазделитель)));
		Результат.Добавить(ПервыйРазделитель);
		
	Иначе
		
		Результат.Добавить(Строка);
		Результат.Добавить("");
		Результат.Добавить(Неопределено);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция РазбитьСтрокуПоСтроке(Знач Строка, Разделитель)

	Результат = Новый Массив; // Массив из Строка
	
	Пока Истина Цикл
		
		Позиция = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(Строка, Разделитель);
		
		Если Позиция = 0 И ЗначениеЗаполнено(Строка) Тогда
			
			Результат.Добавить(Строка);
			Прервать;
			
		КонецЕсли;

		ПерваяЧасть = Лев(Строка, Позиция - СтрДлина(Разделитель) + 1);
		Результат.Добавить(ПерваяЧасть);
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ДобавитьЛидирующуюТочку(Знач Домен)

	Если Не КонтурДиадокСтдСтрКлиентСервер.СтрНачинаетсяСЛок(Домен, ".") Тогда
		
		Домен = "." + Домен;
		
	КонецЕсли;

	Возврат Домен;

КонецФункции

Функция ВырезатьТекст(Текст, МаксимальнаяДлинаТекста = 1000)

	Если НайтиНедопустимыеСимволыXML(Текст) Тогда
		
		Возврат НСтр("ru ='<Данные>'");
		
	КонецЕсли;

	Если СтрДлина(Текст) <= МаксимальнаяДлинаТекста Тогда
		
		Результат = Текст;
		
	Иначе
		
		ПоловинаМаксимальнойДлиныТекста = МаксимальнаяДлинаТекста / 2;
		Результат = Лев(Текст, ПоловинаМаксимальнойДлиныТекста);
		Результат = Результат + Символы.ПС + "..." + Символы.ПС;
		Результат = Результат + Прав(Текст, ПоловинаМаксимальнойДлиныТекста);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция Объединить(ГлавныйИсточник, ДополнительныйИсточник)

	Результат = ГлавныйИсточник;
	ДополнитьЛок(ГлавныйИсточник, ДополнительныйИсточник);
	
	Возврат Результат;

КонецФункции

Функция Скопировать(Источник)

	Возврат ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(Источник));

КонецФункции

Процедура ДополнитьЛок(Приемник, Источник)

	Если Источник = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;

	Для Каждого ЭлементИсточника Из Источник Цикл
		
		ПараметрНайден = Ложь;

		Если ТипЗнч(Приемник) = Тип("Соответствие") Тогда
			
			ПараметрНайден = Приемник.Получить(ЭлементИсточника.Ключ) <> Неопределено;
			
		КонецЕсли;

		Если ТипЗнч(Приемник) = Тип("Структура") Тогда
			
			ПараметрНайден = Приемник.Свойство(ЭлементИсточника.Ключ);
			
		КонецЕсли;

		Если Не ПараметрНайден Или ПараметрНайден И ЭлементИсточника.Значение <> Неопределено Тогда
			
			Приемник.Вставить(ЭлементИсточника.Ключ, ЭлементИсточника.Значение);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Получить параметры преобразования JSON по умолчанию.
// 
// Возвращаемое значение:
//  Структура - Параметры преобразования JSON по умолчанию:
// * ПрочитатьВСоответствие - Булево - Если Истина, чтение объекта JSON будет выполнено в Соответствие.
//   Если Ложь, объекты будут считываться в объект типа Структура.
// * ИменаСвойствСоЗначениямиДата - Неопределено, Строка, Массив из Строка - имена свойств JSON, для которых нужно вызывать
//   восстановление даты из строки.
// * ФорматДатыJSON - ФорматДатыJSON, Неопределено - формат, в котором представлена дата в строке, подлежащей преобразованию
// * ИмяФункцииВосстановления - Строка, Неопределено - определяет имя функции, которая будет вызывается при чтении каждого свойства
//   и должна иметь следующие параметры
//   Свойство - Строка - указывается только при чтении объектов JSON
//   Значение - Произвольный - значение допустимого для сериализации типа
//   ДополнительныеПараметры - Произвольный -
// * МодульФункцииВосстановления - Произвольный, Неопределено - определяет модуль, процедура которого будет использована для
//   восстановления значения.
// * ДополнительныеПараметрыФункцииВосстановления - Произвольный, Неопределено - определяет дополнительные параметры, которые
//   будут переданы в функцию восстановления значений.
// * ИменаСвойствДляОбработкиВосстановления - Неопределено, Массив из Строка - определяет массив имен свойств JSON, для которых
//   будет вызвана функция восстановления.
// * ИмяФункцииПреобразования - Строка, Неопределено - определяет имя функции, которая будет вызывается для всех свойств,
//   тип которых не поддерживает преобразование в формат JSON напрямую.
// * МодульФункцииПреобразования - Произвольный, Неопределено - Указывает модуль, в котором реализована функция преобразования
//   значения в значение формата JSON.
// * ДополнительныеПараметрыФункцииПреобразования - Произвольный, Неопределено - Дополнительные параметры, которые будут
//   переданы в функцию преобразования
// * ВариантЗаписиДатыJSON - Строка, ВариантЗаписиДатыJSON  - Вариант записи даты JSON
//   
// * МаксимальнаяВложенность - Число - определяет максимальный уровень вложенности объекта JSON.
// 
Функция ПолучитьПараметрыПреобразованияJSONПоУмолчанию()

	ПараметрыПреобразованияПоУмолчанию = Новый Структура;
	ПараметрыПреобразованияПоУмолчанию.Вставить("ПрочитатьВСоответствие", Истина);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИменаСвойствСоЗначениямиДата", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ФорматДатыJSON", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИмяФункцииВосстановления", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("МодульФункцииВосстановления", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ДополнительныеПараметрыФункцииВосстановления", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИменаСвойствДляОбработкиВосстановления", Неопределено);

	// для записи. не используется
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИмяФункцииПреобразования", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("МодульФункцииПреобразования", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ДополнительныеПараметрыФункцииПреобразования", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ВариантЗаписиДатыJSON", "ЛокальнаяДата");

	// не используется
	ПараметрыПреобразованияПоУмолчанию.Вставить("МаксимальнаяВложенность", 500);
	
	Возврат ПараметрыПреобразованияПоУмолчанию;
	
КонецФункции

// Раскодировать строку.
// 
// Параметры:
//  ЗакодированнаяСтрока - Строка - Закодированная строка
//  СпособКодирования - Строка - Способ кодирования URLВКодировкеURL или КодировкаURL
// 
// Возвращаемое значение:
//  Строка - Раскодированая строка
//  
Функция РаскодироватьСтрокуЛок(ЗакодированнаяСтрока, СпособКодирования) Экспорт
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.РаскодироватьСтрокуЛок(ЗакодированнаяСтрока, СпособКодирования);
		
	Иначе
		
		Возврат РаскодироватьСтроку82(ЗакодированнаяСтрока, СпособКодирования);
		
	КонецЕсли;
	
КонецФункции

// Кодировать строку.
// 
// Параметры:
//  НекодированнаяСтрока - Строка - Некодированная строка
//  СпособКодирования - Строка - Способ кодирования URLВКодировкеURL или КодировкаURL
// 
// Возвращаемое значение:
//  Строка - Кодированная строка
//  
Функция КодироватьСтрокуЛок(НекодированнаяСтрока, СпособКодирования) Экспорт
	
	Если КонтурДиадокКоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавно8_3_6Лок() Тогда
		
		Возврат КонтурДиадокКоннекторHTTPСлужебный83.КодироватьСтрокуЛок(НекодированнаяСтрока, СпособКодирования);
		
	Иначе
		
		Возврат КодироватьСтроку82(НекодированнаяСтрока, СпособКодирования);
		
	КонецЕсли;
	
КонецФункции

// Раскодировать строку для 8.2. Аналог РаскодироватьСтроку().
// 
// Параметры:
//  КодированнаяСтрока - Строка - Кодированная строка
//  СпособКодирования - Строка - Способ кодирования URLВКодировкеURL или КодировкаURL
// 
// Возвращаемое значение:
//  Строка - Раскодированная строка
//  
Функция РаскодироватьСтроку82(КодированнаяСтрока, СпособКодирования)
	
	ДлинаСтроки = СтрДлина(КодированнаяСтрока);
	Инд = 1;
	НекодированнаяСтрока = "";
	ПолныйКод = 0;
	ОсталосьСимволов = 0;

	Пока Инд <= ДлинаСтроки Цикл

		Код = КодСимвола(КодированнаяСтрока, Инд);

		Если Код = 37 Тогда
			
			Попытка
				
				// Символ(37) = "%"
				Код = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Hex2Dec(Сред(КодированнаяСтрока, Инд + 1, 2));
				Инд = Инд + 2;
				
			Исключение
				
				НекодированнаяСтрока = НекодированнаяСтрока + Символ(Код);
				Инд = Инд + 1;
				Продолжить;
				
			КонецПопытки;

		ИначеЕсли ОсталосьСимволов = 0 Тогда
			
			НекодированнаяСтрока = НекодированнаяСтрока + Символ(Код);
			Инд = Инд + 1;
			Продолжить;
			
		КонецЕсли;

		Если Код <= 127 Тогда
			
			// Код = 0b0ххххххх
			НекодированнаяСтрока = НекодированнаяСтрока + Символ(Код);
			
		ИначеЕсли Код <= 191 Тогда
			
			// Код = 0b10хххххх
			ПолныйКод = (ПолныйКод * 64) + (Код % 64); // shl(ПолныйКод, 6) + (Код & 0x3F)
			ОсталосьСимволов = ОсталосьСимволов - 1;
			
			Если ОсталосьСимволов = 0 Тогда
				
				НекодированнаяСтрока = НекодированнаяСтрока + Символ(ПолныйКод);
				
			КонецЕсли;
			
		ИначеЕсли Код <= 223 Тогда
			
			// Код = 0b110ххххх
			ПолныйКод = Код % 32; // Код & 0x1F
			ОсталосьСимволов = 1;
			
		ИначеЕсли Код <= 239 Тогда
			
			// Код = 0b1110хххх
			ПолныйКод = Код % 16; // Код & 0x0F
			ОсталосьСимволов = 2;
			
		ИначеЕсли Код <= 247 Тогда
			
			// Код = 0b11110ххх
			ПолныйКод = Код % 8; // Код & 0x07
			ОсталосьСимволов = 3;
			
		ИначеЕсли Код <= 251 Тогда
			
			// Код = 0b111110хх
			ПолныйКод = Код % 4; // Код & 0x03
			ОсталосьСимволов = 4;
			
		ИначеЕсли Код <= 253 Тогда
			
			// Код = 0b1111110х
			ПолныйКод = Код % 2; // Код & 0x01
			ОсталосьСимволов = 5;
			
		КонецЕсли;

		Инд = Инд + 1;
		
	КонецЦикла;

	Возврат НекодированнаяСтрока;
	
КонецФункции

// Кодировать строку для 8.2. Аналог КодироватьСтроку().
// 
// Параметры:
//  НекодированнаяСтрока - Строка - Некодированная строка
//  СпособКодирования - Строка - Способ кодирования URLВКодировкеURL или КодировкаURL
// 
// Возвращаемое значение:
//  Строка - Кодировнная строка
//  
Функция КодироватьСтроку82(НекодированнаяСтрока, СпособКодирования)
	
	КодированнаяСтрока = "";
	ДлинаСтроки = СтрДлина(НекодированнаяСтрока);
	СпецСимволыURL = "!#$%'()*+,/:;=?@[].&";

	Для Сч = 1 По ДлинаСтроки Цикл

		СимволСтроки = Сред(НекодированнаяСтрока, Сч, 1);
		КодСимволаСтроки = КодСимвола(СимволСтроки);
		
		Если НРег(СпособКодирования) = НРег("URLВКодировкеURL") Тогда
			
			// URLВКодировкеURL Спецсимволы URL ( !#$%'()*+,/:;=?@[]. ) не кодируются.
			
			Если Найти(СпецСимволыURL, СимволСтроки) > 0 Тогда
				
				КодированнаяСтрока = КодированнаяСтрока + СимволСтроки;
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;

		Если ("A" <= СимволСтроки И СимволСтроки <= "Z") // "A".."Z"
			Или ("a" <= СимволСтроки И СимволСтроки <= "z") // "a".."z"
			Или ("0" <= СимволСтроки И СимволСтроки <= "9") // "0".."9"
			Или (СимволСтроки = "-")
			Или (СимволСтроки = "_")
			Или (СимволСтроки = ".") Тогда
				
			КодированнаяСтрока = КодированнаяСтрока + СимволСтроки;
			
		ИначеЕсли (КодСимволаСтроки <= 127) Тогда
			
			// other ASCII
			КодированнаяСтрока = КодированнаяСтрока + "%"
				+ КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Dec2Hex(КодСимволаСтроки, 2);
			
		ИначеЕсли (КодСимволаСтроки <= 2047) Тогда
			
			// non-ASCII <= 0x07FF
			КодированнаяСтрока = КодированнаяСтрока + "%"
				+ КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Dec2Hex(192 + Цел(КодСимволаСтроки / 64), 2);
			
			КодированнаяСтрока = КодированнаяСтрока + "%"
				+ КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Dec2Hex(128 + (КодСимволаСтроки % 64), 2);
			
		Иначе
			
			// 0x07FF < ch <= 0xFFFF
			КодированнаяСтрока = КодированнаяСтрока + "%"
				+ КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Dec2Hex(224 + Цел(КодСимволаСтроки / 4096), 2);
			
			КодированнаяСтрока = КодированнаяСтрока + "%"
				+ КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Dec2Hex(128 + (Цел(КодСимволаСтроки / 64) % 64), 2);
			
			КодированнаяСтрока = КодированнаяСтрока + "%"
				+ КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Dec2Hex(128 + (КодСимволаСтроки % 64), 2);
			
		КонецЕсли;

	КонецЦикла;

	Возврат КодированнаяСтрока;
	
КонецФункции

// Выполняет чтение данных из архива GZip.
//
// Параметры:
//  СжатыеДанные - ДвоичныеДанные	 - данные упакованные GZip.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - распакованные данные.
//
Функция ПрочитатьGZipЛок(СжатыеДанные)

	РазмерПрефиксаGZip = 10;
	РазмерПостфиксаGZip = 8;

	ЧтениеДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЧтениеДанных(СжатыеДанные);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПропуститьЧтениеДанных(ЧтениеДанных, РазмерПрефиксаGZip);
	
	ИсходныйПоток = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ИсходныйПотокЧтениеДанных(ЧтениеДанных);

	РазмерСжатыхДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.РазмерПотока(ИсходныйПоток) - РазмерПрефиксаGZip - РазмерПостфиксаGZip;

	ПотокZip = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Поток();
	
	ЗаписьДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписьДанных(ПотокZip);
	
	ZipLFH(ЗаписьДанных);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.КопироватьВЧтениеДанных(ЧтениеДанных, ЗаписьДанных, РазмерСжатыхДанных);

	ЗаписьДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписьДанных(ПотокZip);

	CRC32 = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПрочитатьЦелое32ЧтениеДанных(ЧтениеДанных);
	
	РазмерНесжатыхДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПрочитатьЦелое32ЧтениеДанных(ЧтениеДанных);

	ZipDD(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных);
	ZipCDH(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных);
	ZipEOCD(ЗаписьДанных, РазмерСжатыхДанных);

	Возврат ПрочитатьZip(КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный	.ЗакрытьИПолучитьДвоичныеДанныеПоток(ПотокZip));

КонецФункции

Процедура ZipLFH(ЗаписьДанных)
	
	// Local file header

	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 67324752);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 20);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 10);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 8);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 4);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЗаписьДанных(ЗаписьДанных,
		ПолучитьДвоичныеДанныеИзСтрокиЛок("data", "ascii", Ложь));
	
КонецПроцедуры

Процедура ZipDD(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных)
	
	// Data descriptor

	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 134695760);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, CRC32);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, РазмерСжатыхДанных);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, РазмерНесжатыхДанных);
	
КонецПроцедуры

Процедура ZipCDH(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных)
	
	// Central directory header

	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 33639248);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 798);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 20);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 10);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 8);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, CRC32);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, РазмерСжатыхДанных);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, РазмерНесжатыхДанных);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 4);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 2176057344);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЗаписьДанных(ЗаписьДанных,
		ПолучитьДвоичныеДанныеИзСтрокиЛок("data", "ascii", Ложь));
	
КонецПроцедуры

Процедура ZipEOCD(ЗаписьДанных, РазмерСжатыхДанных)
	
	// End of central directory

	РазмерCDH = 50;
	ZipРазмерLFH = 34;
	ZipРазмерDD = 16;
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 101010256);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 1);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 1);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, РазмерCDH);
	
	// offset of start of central directory with respect to the starting disk number
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных,
		ZipРазмерLFH + РазмерСжатыхДанных + ZipРазмерDD);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое16ЗаписьДанных(ЗаписьДанных, 0);
	
КонецПроцедуры

Функция ПрочитатьZip(СжатыеДанные, ТекстОшибки = Неопределено)

	Каталог = ПолучитьИмяВременногоФайла();
	СжатыйФайл = ПолучитьИмяВременногоФайла();
	СжатыеДанные.Записать(СжатыйФайл);
	ЧтениеZip = Новый ЧтениеZipФайла(СжатыйФайл);
	ИмяФайла = ЧтениеZip.Элементы[0].Имя;
	
	Попытка
		
		ЧтениеZip.Извлечь(ЧтениеZip.Элементы[0], Каталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		
	Исключение
		
		// Игнорируем проверку целостности архива, просто читаем результат
		ТекстОшибки = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Ошибка при разархивации . Описание: %1'"),
			ОписаниеОшибки()
		);
		
	КонецПопытки;
	
	ЧтениеZip.Закрыть();

	Результат = Новый ДвоичныеДанные(Каталог + КонтурДиадокСтдОСКлиентСервер.ПолучитьРазделительПутиЛок() + ИмяФайла);
	
	Попытка
		
		УдалитьФайлы(Каталог);
		
	Исключение
		
		;
		
	КонецПопытки;

	Попытка
		
		УдалитьФайлы(СжатыйФайл);
		
	Исключение
		
		;
		
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Выполняет запись данных в архив GZip.
//
// Параметры:
//  Данные	 - ДвоичныеДанные	 - исходные данные.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - данные упакованные GZip.
//
Функция ЗаписатьGZipЛок(Данные)
	
	ЧтениеДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЧтениеДанных(ЗаписатьZip(Данные));
	
	НачальноеСмещение = 14;
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПропуститьЧтениеДанных(ЧтениеДанных, НачальноеСмещение);
	
	CRC32 = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПрочитатьЦелое32ЧтениеДанных(ЧтениеДанных);
	
	РазмерСжатыхДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПрочитатьЦелое32ЧтениеДанных(ЧтениеДанных);
	
	РазмерИсходныхДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПрочитатьЦелое32ЧтениеДанных(ЧтениеДанных);
	
	РазмерИмениФайла = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПрочитатьЦелое16ЧтениеДанных(ЧтениеДанных);
	
	РазмерДополнительногоПоля = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПрочитатьЦелое16ЧтениеДанных(ЧтениеДанных);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ПропуститьЧтениеДанных(ЧтениеДанных, РазмерИмениФайла + РазмерДополнительногоПоля);
	
	ПотокGZip = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.Поток();
	
	ЗаписьДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписьДанных(ПотокGZip);
	
	GZipHeader(ЗаписьДанных);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.КопироватьВЧтениеДанных(ЧтениеДанных, ЗаписьДанных, РазмерСжатыхДанных);
	
	ЗаписьДанных = КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписьДанных(ПотокGZip);
	
	GZipFooter(ЗаписьДанных, CRC32, РазмерИсходныхДанных);
	
	Возврат КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗакрытьИПолучитьДвоичныеДанныеПоток(ПотокGZip);
	
КонецФункции

Функция ЗаписатьZip(Данные)

	ВременныйФайл = ПолучитьИмяВременногоФайла(".bin");
	ВременныйФайлАрхив = ПолучитьИмяВременногоФайла();
	Данные.Записать(ВременныйФайл);
	ЗаписьZip = Новый ЗаписьZipФайла(ВременныйФайлАрхив);
	ЗаписьZip.Добавить(ВременныйФайл);
	ЗаписьZip.Записать();
	Результат = Новый ДвоичныеДанные(ВременныйФайлАрхив);

	Попытка
		
		УдалитьФайлы(ВременныйФайл);
		
	Исключение
		
		;
		
	КонецПопытки;

	Попытка
		
		УдалитьФайлы(ВременныйФайлАрхив);
		
	Исключение
		
		;
		
	КонецПопытки;

	Возврат Результат;

КонецФункции

Процедура GZipHeader(ЗаписьДанных)
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьБайтЗаписьДанных(ЗаписьДанных, 31);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьБайтЗаписьДанных(ЗаписьДанных, 139);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьБайтЗаписьДанных(ЗаписьДанных, 8);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьБайтЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьБайтЗаписьДанных(ЗаписьДанных, 0);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьБайтЗаписьДанных(ЗаписьДанных, 255);
	
КонецПроцедуры

Процедура GZipFooter(ЗаписьДанных, CRC32, РазмерИсходныхДанных)
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, CRC32);
	
	КонтурДиадокКоннекторHTTPДвоичныеДанные82Служебный.ЗаписатьЦелое32ЗаписьДанных(ЗаписьДанных, РазмерИсходныхДанных);
	
КонецПроцедуры

Функция ПолучитьПредставлениеЧислаЛок(ЧислоДляПредставления)
	
	Возврат Формат(ЧислоДляПредставления, "ЧРГ=; ЧГ=")
	
КонецФункции
