// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Ядро Экспорт;
Перем _СессияЛок;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//**************************************
//{		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Истина);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Версия = "0.1.1";
	
	Результат = Версия + "." + НомерСборки();
	
	Возврат Результат;
	
КонецФункции

// Сквозной номер сборки, обновляется автоматически
//
Функция НомерСборки()
	
	Возврат "10";
	
КонецФункции

//}		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

//**************************************
//{		МЕТОДЫ СЕРВИСА ОБНОВЛЕНИЙ (АВТООБНОВЛЕНИЕ)

// Проверяет наличие новой версии и возвращает её описание
//   
// Параметры:
//  ПараметрыСервиса 			- Структура - см. функцию ПараметрыСервиса();
//  ПараметрыОкруженияМодуля	- Структура - см. функцию ПараметрыОкруженияМодуля() модуля объекта Ядро.epf
// 
// Возвращаемое значение:
//  Строка - описание новой версии в формате JSON
//
Функция UpdateServise_API_Check(ПараметрыСервиса, ПараметрыОкруженияМодуля) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/1c/v3/diadoc_um/check";
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(ПараметрыОкруженияМодуля);
	
	РезультатВыполнения = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = РезультатВыполнения.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Скачивает и возвращает файл новой версии модуля
//
// Параметры:
//  ПараметрыСервиса 	- Структура - см. функцию ПараметрыСервиса();
//  ПутьКФайлуНаСервере	- Строка 	- имя ресурса файла на сервере
// 
// Возвращаемое значение:
//  ДвоичныеДанные - файл новой версии модуля
//
Функция UpdateServise_API_DownloadFile(ПараметрыСервиса, ПутьКФайлуНаСервере) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "GET";
	ПараметрыЗапроса.АдресМетода = ПутьКФайлуНаСервере;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	РезультатВыполнения = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = РезультатВыполнения.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание контента из сервиса обновлений
//
// Параметры:
//  ПараметрыСервиса - Структура - см. Модуль_Ядро.ПараметрыСервиса_СервисОбновлений
//  ProductVersion	 - Строка	 - версия модуля в формате РР.{П|ПП}.ЗЗ
//  ContentType		 - Строка	 - тип контента (программное перечисление, см. метод UpdateServiсe_API_ENUM_ContentsType)
// 
// Возвращаемое значение:
//  Строка - описание контента или ошибки в формате JSON
//		Поля описания контента:
//          name - Строка - тип контента (Например: extension, data-processor) см. UpdateServiсe_API_ENUM_ContentsType 
//          filename - Строка - исходное имя загруженного файла
//			md4hash - Строка - хеш-сумма загруженного файла
//		Поля описания ошибки:
//			status-code - Число - код HTTP ошибки
//			message		- Строка - текст ошибки
//
Функция UpdateServiсe_API_Content(ПараметрыСервиса, ProductVersion, ContentType) Экспорт
	
	Результат = Неопределено;
	
	ШаблонАдресаМетода = "/1c/v4/products/diadoc_um/versions/%1/contents/%2";
	
	АдресМетода = СтрШаблонЛок(ШаблонАдресаМетода, ProductVersion, ContentType);
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "GET";
	ПараметрыЗапроса.АдресМетода = АдресМетода;
	
	РезультатВыполнения = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = РезультатВыполнения.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Программное перечисление типов контента сервиса обновлений
// 
// Возвращаемое значение:
//	Структура 
//
Функция UpdateServiсe_API_ENUM_ContentsType() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("epf", "data-processor");
	Результат.Вставить("cfe", "extension");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возвращает коллекцию версий продукта
//
// Параметры:
//  ПараметрыСервиса 			- Структура - см. функцию ПараметрыСервиса();
// 
// Возвращаемое значение:
//  Строка - Описание новой версий модуля в формате JSON
//
Функция UpdateService_API_Versions(ПараметрыСервиса) Экспорт
	
	Результат = Неопределено;
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "GET";
	ПараметрыЗапроса.АдресМетода = "/1c/v4/products/diadoc_um/versions";
	
	ПараметрыЗапроса.Параметры.Вставить("order", "desc");
	
	РезультатВыполнения = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = РезультатВыполнения.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

//}		МЕТОДЫ СЕРВИСА ОБНОВЛЕНИЙ (АВТООБНОВЛЕНИЕ)

//**************************************
//{		МЕТОДЫ DIADOC API

Функция DD_API_AcquireCounteragent(ПараметрыСервиса, myOrgId, AcquireCounteragentRequest) Экспорт 

	//http://api-docs.diadoc.ru/ru/latest/http/AcquireCounteragent.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/AcquireCounteragent";
	
	ПараметрыЗапроса.Параметры.Вставить("myOrgId", myOrgId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(AcquireCounteragentRequest);
	
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(409);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета = Ответ.КодОтвета;
	
	Если КодОтвета = 200 Тогда
		
		AsyncMethodResult = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
		
		РезультатОтвета = AsyncMethodResult.taskId;
		
	ИначеЕсли КодОтвета = 409 Тогда
		
		РезультатОтвета = НСтр("ru='Требуется заявка на роуминг для отправки приглашения роуминговому контрагенту (подробнее см. https://www.diadoc.ru/roaming).'");
		
	Иначе
		
		ТелоОтвета = Ответ.ТелоОтвета;
		
		Если ТипЗнч(ТелоОтвета) = Тип("ДвоичныеДанные") Тогда
			РезультатОтвета = СтрокаИзДвоичныхДанных(ТелоОтвета);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета", КодОтвета);
	Результат.Вставить("РезультатОтвета", РезультатОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_AcquireCounteragentResult(ПараметрыСервиса, taskId) Экспорт 

	//http://api-docs.diadoc.ru/ru/latest/http/AcquireCounteragentResult.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/AcquireCounteragentResult";
	
	ПараметрыЗапроса.Параметры.Вставить("taskId", taskId);
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(204); //операция еще выполняется на сервере
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 200 Тогда
	
		AcquireCounteragentResult = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
		OrgId = СвойствоСтруктуры(AcquireCounteragentResult, "orgId");
	
	КонецЕсли; 
	
	ВремяОжидания = Ответ.Заголовки["Retry-After"];
	ВремяОжидания = ЧислоИзСтрокиЛок(ВремяОжидания);
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяОжидания"	, ВремяОжидания);
	Результат.Вставить("OrgId"			, OrgId);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_Authenticate(ПараметрыСервиса, Сертификат = Неопределено, Логин = Неопределено, Пароль = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(Сертификат) Тогда
		
		ТипАутентификации = ТипАутентификацииСертификат();
		ТелоЗапроса = Сертификат;
		МедиаТип = МедиаТипБинарныеДанные();
		ТелоОтветаКакДвоичныеДанные = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Логин) Тогда
		
		ТипАутентификации = ТипАутентификацииПароль();
		ТелоЗапроса = ТелоЗапросаЛогинПароль(Логин, Пароль);
		МедиаТип = МедиаТипJSON();
		ТелоОтветаКакДвоичныеДанные = Ложь;
		
	Иначе
		
		Ошибка = "Некорректные параметры аутентификации! Должен быть указан сертификат или логин и пароль.";
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V3/Authenticate";
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = ТелоОтветаКакДвоичныеДанные;
	
	ПараметрыЗапроса.Параметры.Вставить("type", ТипАутентификации);
	
	ДобавитьТелоЗапроса(ПараметрыЗапроса, ТелоЗапроса, МедиаТип);
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	// BadRequest: данные в запросе имеют неверный формат или отсутствуют обязательные параметры
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(400);
	
	// Unauthorized: 
	// - в запросе отсутствует HTTP-заголовок Authorization
	// - или в этом заголовке отсутствует параметр ddauth_api_client_id
	// - или переданный в нем ключ разработчика не зарегистрирован в Диадоке;
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(401);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета <> 200 Тогда
		
		Ошибка = ОшибкаСостоянияHTTP(Ответ.КодОтвета, Ответ);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_AuthenticateConfirm(ПараметрыСервиса, РасшифрованныйТокен, ОтпечатокСертификата) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/AuthenticateConfirm";
	
	ПараметрыЗапроса.Параметры.Вставить("token", РасшифрованныйТокен);
	ПараметрыЗапроса.Параметры.Вставить("saveBinding", "false");
	ПараметрыЗапроса.Параметры.Вставить("thumbprint", ОтпечатокСертификата);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_BreakWithCounteragent(ПараметрыСервиса, myOrgId, counteragentOrgId, comment = Неопределено) Экспорт 

	//http://api-docs.diadoc.ru/ru/latest/http/BreakWithCounteragent.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/BreakWithCounteragent";
	
	ПараметрыЗапроса.Параметры.Вставить("myOrgId"			, myOrgId);
	ПараметрыЗапроса.Параметры.Вставить("counteragentOrgId"	, counteragentOrgId);
	
	Если ЗначениеЗаполнено(comment) Тогда
		ПараметрыЗапроса.Параметры.Вставить("comment", comment);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Истина;
	
КонецФункции

Функция DD_API_CanSendInvoice(ПараметрыСервиса, boxId, CertBase64) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/CanSendInvoice.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/CanSendInvoice";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ПараметрыЗапроса.ТелоЗапроса = CertBase64;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Истина;
	
КонецФункции

Функция DD_API_Delete(ПараметрыСервиса, boxId, messageId, documentId = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/Delete.html
	
	// Если параметр documentId не задан, то сообщение messageId удаляется целиком,
	// и все документы в нем автоматически помечаются как удаленные.
	// Когда из сообщения удаляется последний документ,
	// само сообщение также помечается как удаленное.
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/Delete";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId"	, messageId);
	
	Если ЗначениеЗаполнено(documentId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("documentId", documentId);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Истина;
	
КонецФункции

Функция DD_API_ExtendedSignerDetails(ПараметрыСервиса, boxId, thumbprint, documentTitleType, ExtendedSignerDetailsToPost = Неопределено) Экспорт 
	
	//http://api-docs.diadoc.ru/ru/latest/http/utd/ExtendedSignerDetailsV2.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V2/ExtendedSignerDetails";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"				, boxId);
	ПараметрыЗапроса.Параметры.Вставить("thumbprint"		, thumbprint);
	ПараметрыЗапроса.Параметры.Вставить("documentTitleType"	, documentTitleType);
	
	Если ЗначениеЗаполнено(ExtendedSignerDetailsToPost) Тогда
		ПараметрыЗапроса.Метод = "POST";
		ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(ExtendedSignerDetailsToPost);
	Иначе
		
		// Полномочия в Диадоке не указаны.
		ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(404);
		
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 200 Тогда
		Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	Иначе
		Результат = Неопределено
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateAcceptanceCertificateXmlForBuyer(ПараметрыСервиса, BoxId, sellerTitleMessageId, sellerTitleAttachmentId, documentVersion = Неопределено, BuyerTitleInfo) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GenerateAcceptanceCertificateXmlForBuyer.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/GenerateAcceptanceCertificateXmlForBuyer";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"						, boxId);
	ПараметрыЗапроса.Параметры.Вставить("sellerTitleMessageId"		, sellerTitleMessageId);
	ПараметрыЗапроса.Параметры.Вставить("sellerTitleAttachmentId"	, sellerTitleAttachmentId);
	
	// Если documentVersion не указан,
	// то используется версия из титула продавца.
	Если ЗначениеЗаполнено(documentVersion) Тогда
		ПараметрыЗапроса.Параметры.Вставить("documentVersion", documentVersion);
	КонецЕсли;
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(BuyerTitleInfo);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateInvoiceCorrectionRequestXml(ПараметрыСервиса, boxId, InvoiceCorrectionRequestGenerationRequestV2) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GenerateInvoiceCorrectionRequestXml.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/GenerateInvoiceCorrectionRequestXml";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(InvoiceCorrectionRequestGenerationRequestV2);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateReceiptXml(ПараметрыСервиса, boxId, ReceiptGenerationRequestV2) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GenerateReceiptXml.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/GenerateReceiptXml";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(ReceiptGenerationRequestV2);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateUniversalMessage(ПараметрыСервиса, boxId, messageId, attachmentId,
										UniversalMessageGenerationRequest) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GenerateUniversalMessage.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/GenerateUniversalMessage";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId", messageId);
	ПараметрыЗапроса.Параметры.Вставить("attachmentId", attachmentId);
	
	ПараметрыЗапроса.ТелоЗапроса = UniversalMessageGenerationRequest;
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GeneratePrintForm(ПараметрыСервиса, boxId, messageId, documentId) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/GeneratePrintForm.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GeneratePrintForm";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId"	, messageId);
	ПараметрыЗапроса.Параметры.Вставить("documentId", documentId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	ИмяФайла = Ответ.Заголовки["Content-Disposition"];
	
	ВремяОжидания = Ответ.Заголовки["Retry-After"];
	ВремяОжидания = ЧислоИзСтрокиЛок(ВремяОжидания);
	
	ДвоичныеДанныеФайла = Ответ.ТелоОтвета;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФайла"			, ИмяФайла);
	Результат.Вставить("ВремяОжидания"		, ВремяОжидания);
	Результат.Вставить("ДвоичныеДанныеФайла", ДвоичныеДанныеФайла);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateRevocationRequestXml(ПараметрыСервиса, boxId, messageId, attachmentId, RevocationRequestInfo) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GenerateRevocationRequestXml.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		= "POST";
	ПараметрыЗапроса.АдресМетода 	= "/V2/GenerateRevocationRequestXml";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"			, boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId"		, messageId);
	ПараметрыЗапроса.Параметры.Вставить("attachmentId"	, attachmentId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(RevocationRequestInfo);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;

	// Api.RevocationRequestNotAvailableForRoamingOperator: 
	// - Оператор контрагента не поддерживает аннулирование;
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(400);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета <> 200 Тогда
		
		ТекстОшибки = "";
		
		КодОшибки = Ответ.Заголовки.Получить("X-Diadoc-ErrorCode");
		Если ЗначениеЗаполнено(КодОшибки) И Найти(КодОшибки, "RevocationRequestNotAvailableForRoamingOperator") > 0 Тогда
			ТекстОшибки = "Оператор контрагента не поддерживает аннулирование";
		КонецЕсли;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateSignatureRejectionXml(ПараметрыСервиса, boxId, SignatureRejectionGenerationRequestV2) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GenerateRevocationRequestXml.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/GenerateSignatureRejectionXml";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(SignatureRejectionGenerationRequestV2);
	
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(409);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateTorg12XmlForBuyer(ПараметрыСервиса, BoxId, sellerTitleMessageId, sellerTitleAttachmentId, documentVersion = Неопределено, BuyerTitleInfo) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GenerateTorg12XmlForBuyer.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/GenerateTorg12XmlForBuyer";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"						, boxId);
	ПараметрыЗапроса.Параметры.Вставить("sellerTitleMessageId"		, sellerTitleMessageId);
	ПараметрыЗапроса.Параметры.Вставить("sellerTitleAttachmentId"	, sellerTitleAttachmentId);
	
	// Если documentVersion не указан,
	// то используется версия из титула продавца.
	Если ЗначениеЗаполнено(documentVersion) Тогда
		ПараметрыЗапроса.Параметры.Вставить("documentVersion", documentVersion);
	КонецЕсли;
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(BuyerTitleInfo);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GenerateUniversalTransferDocumentXmlForBuyer(ПараметрыСервиса, BoxId, sellerTitleMessageId, sellerTitleAttachmentId, BuyerTitleInfo) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/utd/GenerateUniversalTransferDocumentXmlForBuyer.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/GenerateUniversalTransferDocumentXmlForBuyer";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"						, boxId);
	ПараметрыЗапроса.Параметры.Вставить("sellerTitleMessageId"		, sellerTitleMessageId);
	ПараметрыЗапроса.Параметры.Вставить("sellerTitleAttachmentId"	, sellerTitleAttachmentId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(BuyerTitleInfo);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetBox2(ПараметрыСервиса, boxId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetBox.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetBox";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	// "Unknown box: boxId" - удаленная организация
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(404);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 404 Тогда
		НаименованиеЯщика = "Unknown box: " + boxId;
		Результат = DD_API_DS_Box(boxId, НаименованиеЯщика, Истина);
	Иначе
		Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetCounteragent(ПараметрыСервиса, myOrgId, counteragentOrgId) Экспорт 
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetCounteragent.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V2/GetCounteragent";
	
	ПараметрыЗапроса.Параметры.Вставить("myOrgId"			, myOrgId);
	ПараметрыЗапроса.Параметры.Вставить("counteragentOrgId"	, counteragentOrgId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetCounteragentV3(ПараметрыСервиса, myBoxId, counteragentBoxId) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetCounteragent.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V3/GetCounteragent";
	
	ПараметрыЗапроса.Параметры.Вставить("myBoxId", myBoxId);
	ПараметрыЗапроса.Параметры.Вставить("counteragentBoxId", counteragentBoxId);
	
	// "404 Not Found" - партнерские отношения между организациями
	// myBoxId и counteragentBoxId не установлены.
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(404);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтветаПустаяСтраница = 404;
	
	Если Ответ.КодОтвета = КодОтветаПустаяСтраница Тогда
		CounteragentStatus = "NotInCounteragentList";
		
		Результат = DD_API_DS_Counteragent(myBoxId, CounteragentStatus);
	Иначе
		Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetCounteragentEvents(ПараметрыСервиса, boxId, МеткаВремени = "", ИндексСобытия = "") Экспорт
	
	// https://developer.kontur.ru/docs/diadoc-api/http/GetCounteragentEvents.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V1/GetCounteragentEvents";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	Если ЗначениеЗаполнено(МеткаВремени) Тогда
		ПараметрыЗапроса.Параметры.Вставить("timestampFromTicks", МеткаВремени);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИндексСобытия) Тогда
		ПараметрыЗапроса.Параметры.Вставить("afterIndexKey", ИндексСобытия);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetCounteragentCertificates(ПараметрыСервиса, myOrgId, counteragentOrgId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetCounteragentCertificates.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetCounteragentCertificates";
	
	ПараметрыЗапроса.Параметры.Вставить("myOrgId"			, myOrgId);
	ПараметрыЗапроса.Параметры.Вставить("counteragentOrgId"	, counteragentOrgId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetCounteragents(ПараметрыСервиса, myOrgId, counteragentStatus = Неопределено, afterIndexKey = Неопределено) Экспорт 
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetCounteragents.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V2/GetCounteragents";
	
	ПараметрыЗапроса.Параметры.Вставить("myOrgId", myOrgId);
	
	Если ЗначениеЗаполнено(counteragentStatus) Тогда
		ПараметрыЗапроса.Параметры.Вставить("counteragentStatus", counteragentStatus);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(afterIndexKey) Тогда
		ПараметрыЗапроса.Параметры.Вставить("afterIndexKey", afterIndexKey);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Возвращает список событий, произошедших с документами (появление нового, изменение текущего)
//
// Параметры:
//  ПараметрыСервиса	 - Структура 	- см. ПараметрыСервиса()
//  boxId				 - Строка 		- идентификатор ящика
//  DocflowEventsRequest - Структура	- см. DD_API_DS_GetDocflowEventsRequest()
// 
// Возвращаемое значение:
//  Структура - список событий по документам
//
Функция DD_API_GetDocflowEvents4(ПараметрыСервиса, boxId, DocflowEventsRequest) Экспорт
	
	// https://developer.kontur.ru/docs/diadoc-api/ru/latest/http/GetDocflowEvents_V4.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V4/GetDocflowEvents";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(DocflowEventsRequest);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetDocument(ПараметрыСервиса, boxId, messageId, entityId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetDocument.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V3/GetDocument";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId"	, messageId);
	ПараметрыЗапроса.Параметры.Вставить("entityId"	, entityId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetDocuments(ПараметрыСервиса, boxId, filterCategory
	, counteragentBoxId		 = Неопределено
	, toDepartmentId		 = Неопределено
	, timestampFromTicks	 = Неопределено
	, timestampToTicks		 = Неопределено
	, fromDocumentDate		 = Неопределено
	, toDocumentDate		 = Неопределено
	, departmentId			 = Неопределено
	, excludeSubdepartments	 = Неопределено
	, afterIndexKey			 = Неопределено
	, sortDirection			 = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetDocuments.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V3/GetDocuments";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"			, boxId);
	ПараметрыЗапроса.Параметры.Вставить("filterCategory", filterCategory);
	
	Если ЗначениеЗаполнено(counteragentBoxId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("counteragentBoxId", counteragentBoxId);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(toDepartmentId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("toDepartmentId", toDepartmentId);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(timestampFromTicks) Тогда
		ПараметрыЗапроса.Параметры.Вставить("timestampFromTicks", timestampFromTicks);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(timestampToTicks) Тогда
		ПараметрыЗапроса.Параметры.Вставить("timestampToTicks", timestampToTicks);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(fromDocumentDate) Тогда
		ПараметрыЗапроса.Параметры.Вставить("fromDocumentDate", fromDocumentDate);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(toDocumentDate) Тогда
		ПараметрыЗапроса.Параметры.Вставить("toDocumentDate", toDocumentDate);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(departmentId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("departmentId", departmentId);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(excludeSubdepartments) Тогда
		ПараметрыЗапроса.Параметры.Вставить("excludeSubdepartments", excludeSubdepartments);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(afterIndexKey) Тогда
		ПараметрыЗапроса.Параметры.Вставить("afterIndexKey", afterIndexKey);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(sortDirection) Тогда
		ПараметрыЗапроса.Параметры.Вставить("sortDirection", sortDirection);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetDocumentsByMessageId(ПараметрыСервиса, boxId, messageId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetDocumentsByMessageId.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetDocumentsByMessageId";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId"	, messageId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetDocumentTypes(ПараметрыСервиса, boxId) Экспорт 
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetDocumentTypes.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V2/GetDocumentTypes";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetWorkflowsSettings(ПараметрыСервиса, boxId) Экспорт 
	
	//https://diadoc-sdk.readthedocs.io/ru/workflow/http/GetWorkflowsSettings.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetWorkflowsSettings";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetEntityContent(ПараметрыСервиса, boxId, messageId, entityId) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetEntityContent.html
	
	ПараметрыСервиса.Таймаут = 150;
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V4/GetEntityContent";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	ПараметрыЗапроса.Параметры.Вставить("entityId", entityId);
	ПараметрыЗапроса.Параметры.Вставить("messageId", messageId);
	
	// "Entity ID not found in message" - если сущность невалидна, то она тоже не будет найдена.
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(404);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 404 Тогда
		Результат = Неопределено;
	Иначе
		Результат = Ответ.ТелоОтвета;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные сообщения по указанному идентификатору.
//
// Параметры:
//  ПараметрыСервиса	 - Структура - см. ПараметрыСервиса
//  boxId				 - Строка - идентификатор ящика
//  messageId			 - Строка - идентификатор сообщения
//  entityId			 - Строка - идентификатор документа в сообщении (необезательный)
//  originalSignature	 - Булево - если Истина, то возвращается оригинальная подпись, иначе подпись в формате CADES-T
//  injectEntityContent	 - Булево - если Истина, то в результат включается содержимое документа в поле Content.Data,
// 
// Возвращаемое значение:
//  Структура - данные сообщения
//
Функция DD_API_GetMessage(
	ПараметрыСервиса,
	boxId,
	messageId,
	entityId = Неопределено,
	originalSignature = Неопределено,
	injectEntityContent = Неопределено) Экспорт
	
	// https://developer.kontur.ru/docs/diadoc-api/ru/latest/http/GetMessage_V6.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V6/GetMessage";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId", messageId);
	
	Если ЗначениеЗаполнено(entityId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("entityId", entityId);
	КонецЕсли;
	
	Если Не originalSignature = Неопределено Тогда
		ПараметрыЗапроса.Параметры.Вставить("originalSignature", XMLСтрока(originalSignature));
	КонецЕсли;
	
	Если Не injectEntityContent = Неопределено Тогда
		ПараметрыЗапроса.Параметры.Вставить("injectEntityContent", XMLСтрока(injectEntityContent));
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetSignatureInfo(ПараметрыСервиса, boxId, messageId, entityId) Экспорт
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetSignatureInfo.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetSignatureInfo";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId", messageId);
	ПараметрыЗапроса.Параметры.Вставить("entityId", entityId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetMyOrganizations(ПараметрыСервиса) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetMyOrganizations.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetMyOrganizations";
	
	ПараметрыЗапроса.Параметры.Вставить("autoRegister", "false");
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetMyCertificates(ПараметрыСервиса, BoxId) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetMyCertificates.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetMyCertificates";
	ПараметрыЗапроса.Параметры.Вставить("boxId", BoxId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetMyPermissions(ПараметрыСервиса, orgId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetMyPermissions.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetMyPermissions";
	
	ПараметрыЗапроса.Параметры.Вставить("orgId", orgId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат ответа метода GetMyEmployee
//
// Параметры:
//  ПараметрыСервиса - Структура	- см. ПараметрыСервиса() 
//  boxId			 - Строка		- идентификатор ящика
// 
// Возвращаемое значение:
//   - Структура
//
Функция DD_API_GetMyEmployee(ПараметрыСервиса, boxId) Экспорт 
	
	// https://developer.kontur.ru/Docs/diadoc-api/http/GetMyEmployee.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetMyEmployee";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetMyUserV2(ПараметрыСервиса) Экспорт 
	
	// https://developer.kontur.ru/docs/diadoc-api/http/GetMyUser.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V2/GetMyUser";
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetMyUser(ПараметрыСервиса) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetMyUser.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetMyUser";
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetOrganization(ПараметрыСервиса, boxId = Неопределено, orgId = Неопределено, fnsParticipantId = Неопределено, inn = Неопределено, kpp = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetOrganization.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetOrganization";
	
	Если ЗначениеЗаполнено(boxId) Тогда
		
		ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
		
	ИначеЕсли ЗначениеЗаполнено(orgId) Тогда
		
		ПараметрыЗапроса.Параметры.Вставить("orgId", orgId);
		
	ИначеЕсли ЗначениеЗаполнено(fnsParticipantId) Тогда
		
		ПараметрыЗапроса.Параметры.Вставить("fnsParticipantId", fnsParticipantId);
		
	ИначеЕсли ЗначениеЗаполнено(inn) Тогда
		
		ПараметрыЗапроса.Параметры.Вставить("inn", inn);
		
		Если ЗначениеЗаполнено(kpp) Тогда
			ПараметрыЗапроса.Параметры.Вставить("kpp", kpp);
		КонецЕсли;
			
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetOrganizationsByInnList(ПараметрыСервиса, InnList, myOrgId = Неопределено) Экспорт 
	
	//http://api-docs.diadoc.ru/ru/latest/http/GetOrganizationsByInnList.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/GetOrganizationsByInnList";
	
	Если ЗначениеЗаполнено(myOrgId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("myOrgId", myOrgId);
	КонецЕсли;
	
	GetOrganizationsByInnListRequest = Новый Структура;
	GetOrganizationsByInnListRequest.Вставить("InnList", InnList);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(GetOrganizationsByInnListRequest);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetOrganizationUsers(ПараметрыСервиса, orgId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetOrganizationUsers.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetOrganizationUsers";
	
	ПараметрыЗапроса.Параметры.Вставить("orgId", orgId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetResolutionRoutesForOrganization2(ПараметрыСервиса, orgId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/GetResolutionRoutesForOrganization.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetResolutionRoutesForOrganization";
	
	ПараметрыЗапроса.Параметры.Вставить("orgId", orgId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetOrganizationFeatures(ПараметрыСервиса, boxId) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/Organizations/GetOrganizationFeatures.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetOrganizationFeatures";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;

КонецФункции

Функция DD_API_GenerateDocumentZip(ПараметрыСервиса, boxId, letterId, documentId) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/GenerateDocumentZip.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GenerateDocumentZip";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	ПараметрыЗапроса.Параметры.Вставить("messageId"	, letterId);
	ПараметрыЗапроса.Параметры.Вставить("documentId", documentId);
	ПараметрыЗапроса.Параметры.Вставить("fullDocFlow", "true");
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	ВремяОжидания = Ответ.Заголовки["Retry-After"];
	ВремяОжидания = ЧислоИзСтрокиЛок(ВремяОжидания);
	
	ПутьКФайлуАрхива = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяОжидания", ВремяОжидания);
	Результат.Вставить("ПутьКФайлуАрхива",	ПутьКФайлуАрхива);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_ShelfDownload(ПараметрыСервиса, nameOnShelf) Экспорт
	
	//http://api-docs.diadoc.ru/ru/latest/http/ShelfDownload.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/ShelfDownload";
	
	ПараметрыЗапроса.Параметры.Вставить("nameOnShelf", nameOnShelf);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_ShelfUploadPartInit(ПараметрыСервиса, Data, fileExtension = "", isLastPart = Ложь) Экспорт
	
	// https://developer.kontur.ru/docs/diadoc-api/http/ShelfUploadPartInit.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/ShelfUploadPartInit";
	
	ПараметрыЗапроса.Параметры.Вставить("fileExtension", fileExtension);
	ПараметрыЗапроса.Параметры.Вставить("isLastPart", Формат(isLastPart, "БЛ=false; БИ=true"));
	ПараметрыЗапроса.ТелоЗапроса = Data;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_ShelfUploadPart(ПараметрыСервиса, Data, fileName, partIndex = 1, isLastPart = Ложь) Экспорт
	
	// https://developer.kontur.ru/docs/diadoc-api/http/ShelfUploadPartInit.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/ShelfUploadPart";
	
	ПараметрыЗапроса.Параметры.Вставить("fileName", fileName);
	ПараметрыЗапроса.Параметры.Вставить("partIndex", partIndex);
	ПараметрыЗапроса.Параметры.Вставить("isLastPart", Формат(isLastPart, "БЛ=false; БИ=true"));
	ПараметрыЗапроса.ТелоЗапроса = Data;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_MoveDocuments(ПараметрыСервиса, DocumentsMoveOperation) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/MoveDocuments.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/MoveDocuments";
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(DocumentsMoveOperation);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Истина;
	
КонецФункции

Функция DD_API_PostMessage(ПараметрыСервиса, MessageToPost, OperationId = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/PostMessage.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V3/PostMessage";
	
	ДобавитьИдентификаторОперации(ПараметрыЗапроса, OperationId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(MessageToPost);
	
	// BSLLS:MagicNumber-off
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(400);
	// BSLLS:MagicNumber-on
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	// BSLLS:MagicNumber-off
	Если Ответ.КодОтвета <> 200 Тогда
	// BSLLS:MagicNumber-on
		
		Ошибка = ОшибкаСостоянияHTTP(Ответ.КодОтвета, Ответ);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Message = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	ВремяОжидания = Ответ.Заголовки["Retry-After"];
	ВремяОжидания = ЧислоИзСтрокиЛок(ВремяОжидания);
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяОжидания"	, ВремяОжидания);
	Результат.Вставить("Message"		, Message);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_PostMessagePatch(ПараметрыСервиса, MessagePatchToPost, OperationId = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/PostMessagePatch.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V4/PostMessagePatch";
	
	ДобавитьИдентификаторОперации(ПараметрыЗапроса, OperationId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(MessagePatchToPost);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	MessagePatch = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	ВремяОжидания = Ответ.Заголовки["Retry-After"];
	ВремяОжидания = ЧислоИзСтрокиЛок(ВремяОжидания);
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяОжидания"	, ВремяОжидания);
	Результат.Вставить("MessagePatch"	, MessagePatch);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_PrepareDocumentsToSign(ПараметрыСервиса, PrepareDocumentsToSignRequest) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/PrepareDocumentsToSign.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/PrepareDocumentsToSign";
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(PrepareDocumentsToSignRequest);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_SendFnsRegistrationMessage(ПараметрыСервиса, boxId, CertBase64) Экспорт
	
	// http://api-docs.diadoc.ru/ru/latest/http/SendFnsRegistrationMessage.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/SendFnsRegistrationMessage";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	FnsRegistrationMessageInfo = Новый Структура;
	FnsRegistrationMessageInfo.Вставить("Certificates", ЗначениеВМассив(CertBase64));
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(FnsRegistrationMessageInfo);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Истина;
	
КонецФункции

// Выполняет отправку сообщения с шаблонами
// http://api-docs.diadoc.ru/ru/latest/http/PostTemplate.html
//
// Параметры:
//  ПараметрыСервиса - Структура - см. функцию ПараметрыСервиса();
//  TemplateToPost   - Структура - см. функцию DD_API_DS_TemplateToPost();
//  OperationId      - Строка    - уникальный идентификатор операции;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Template      - Структура    - отправленное сообщение, содержащее шаблоны документов;
//                   - Неопределено - если сообщение еще отправляется;
//   * ВремяОжидания - Число        - время (в секундах), через которое можно повторно
//                                    выполнить метод с тем же OperationId,
//                                    чтобы получить Template;
//
Функция DD_API_PostTemplate(ПараметрыСервиса, TemplateToPost, OperationId = Неопределено) Экспорт 
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/PostTemplate";
	
	ДобавитьИдентификаторОперации(ПараметрыЗапроса, OperationId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(TemplateToPost);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Template = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	ВремяОжидания = Ответ.Заголовки["Retry-After"];
	ВремяОжидания = ЧислоИзСтрокиЛок(ВремяОжидания);
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяОжидания"	, ВремяОжидания);
	Результат.Вставить("Template"		, Template);
	
	Возврат Результат;
	
КонецФункции

// Отправляет дополнение к сообщению с шаблонами документов
// https://api-docs.diadoc.ru/ru/latest/http/PostTemplatePatch.html
//
// Параметры:
//  ПараметрыСервиса    - Структура - см. функцию ПараметрыСервиса();
//  TemplatePatchToPost - Структура - см. функцию DD_API_DS_TemplatePatchToPost();
//  BoxId               - Строка    - идентификатор ящика в сервисе;
//  templateId          - Строка    - идентификатор сообщения с шаблонами;
//  OperationId         - Строка    - уникальный идентификатор операции;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * MessagePatch  - Структура    - отправленное сообщение, содержащее дополнения;
//                   - Неопределено - если сообщение еще отправляется;
//   * ВремяОжидания - Число        - время (в секундах), через которое можно повторно
//                                    выполнить метод с тем же OperationId,
//                                    чтобы получить MessagePatch;
//
Функция DD_API_PostTemplatePatch(ПараметрыСервиса, TemplatePatchToPost, BoxId, TemplateId, OperationId = Неопределено) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/PostTemplatePatch";
	
	ПараметрыЗапроса.Параметры.Вставить("BoxId"		, BoxId);
	ПараметрыЗапроса.Параметры.Вставить("TemplateId", TemplateId);
	
	ДобавитьИдентификаторОперации(ПараметрыЗапроса, OperationId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(TemplatePatchToPost);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	MessagePatch = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	ВремяОжидания = Ответ.Заголовки["Retry-After"];
	ВремяОжидания = ЧислоИзСтрокиЛок(ВремяОжидания);
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяОжидания"	, ВремяОжидания);
	Результат.Вставить("MessagePatch"	, MessagePatch);
	
	Возврат Результат;
	
КонецФункции

// Данные об аккаунтах на сервисе билллинга
//
// Параметры:
//  ПараметрыСервиса - Структура - Контракт из Ядра ПараметрыСервиса_Диадок
//  BoxId			 - Строка - Идентификатор ящика организации
// 
// Возвращаемое значение:
//  Массив - Данные об аккаунтах на сервисе биллинга
//
Функция DD_API_GetBillingAccounts(ПараметрыСервиса, BoxId) Экспорт

	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "GET";
	ПараметрыЗапроса.АдресМетода = "/GetBillingAccounts";
	
	Если ЗначениеЗаполнено(boxId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;

КонецФункции

// Список роуминговых операторов и их функции
//
// Параметры:
//  ПараметрыСервиса - Структура	- Контракт из Ядра ПараметрыСервиса_Диадок
//  BoxId			 - Строка		- Идентификатор ящика организации
// 
// Возвращаемое значение:
//  Структура с ключами:
//		* RoamingOperator - Массив - информация о роуминговых операторах и о функциях, которые они поддерживают
//
Функция DD_API_GetRoamingOperators(ПараметрыСервиса, BoxId) Экспорт
	
	// https://developer.kontur.ru/Docs/diadoc-api/http/GetRoamingOperators.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetRoamingOperators";
	ПараметрыЗапроса.Параметры.Вставить("BoxId", BoxId);
		
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
			
КонецФункции

// Выполняет проверку сертификата на КЭП
//
// Параметры:
//  ПараметрыСервиса 	- Структура - Контракт ПараметрыСервиса_Контур
//  BoxId				- Строка	- Идентификатор ящика организации
//  CertificateVerificationRequest	- Структура - см. DD_API_DS_CertificateVerificationRequest()
// 
// Возвращаемое значение:
//  Структура - результат проверки, Строка - если при вызове метода произошла ошибка (содержит текст ошибки)
//
Функция DD_API_VerifyCertificate(ПараметрыСервиса, BoxId, CertificateVerificationRequest) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/VerifyCertificate";
	
	ПараметрыЗапроса.Параметры.Вставить("BoxId", BoxId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(CertificateVerificationRequest);
	
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(400);
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(401);
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(402);
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(403);
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(404);
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(405);
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(500);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 200 Тогда
		Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	Иначе
		Результат = Ответ.ТелоОтвета;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список идентификаторов баз, в которых запрещено обновление ПМ
//
// Параметры:
//   ПараметрыСервиса - Структура - см. Ядро.ПараметрыСервиса_Диадок
// 
// Возвращаемое значение:
//  ДвоичныеДанные, Неопределено - двоичные данные файла 
//
Функция DD_API_NonUpgradableClientPM(ПараметрыСервиса) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	АдресМетода = "/1c-addin/non_upgradable_clients_pm_diadoc_um.json";
	
	ПараметрыЗапроса.Метод 							= "GET";
	ПараметрыЗапроса.АдресМетода					= АдресМетода;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные 	= Ложь;

	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);

	Возврат Ответ.ТелоОтвета;
	
КонецФункции

//{		МЧД

Функция DD_API_GetEmployeePowersOfAttorney(ПараметрыСервиса, boxId, userid, OnlyActual) Экспорт
	
	// https://diadoc-sdk.readthedocs.io/ru/latest/http/GetEmployeePowersOfAttorney.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetEmployeePowersOfAttorney";

	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	ПараметрыЗапроса.Параметры.Вставить("userid"	, userid);
	ПараметрыЗапроса.Параметры.Вставить("OnlyActual", Формат(OnlyActual, "БЛ=false; БИ=true"));
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_UpdateEmployeePowerOfAttorney(
		Знач ПараметрыСервиса,
		Знач boxId,
		Знач UserId,
		Знач registrationNumber,
		Знач issuerInn,
		Знач RepresentativeInn,
		Знач IsDefault) Экспорт
	
	// https://diadoc-sdk.readthedocs.io/ru/latest/http/UpdateEmployeePowerOfAttorney.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/UpdateEmployeePowerOfAttorney";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	ПараметрыЗапроса.Параметры.Вставить("UserId", UserId);
	
	PowerOfAttorneyFullId = DD_API_DS_PowerOfAttorneyFullId(
			RegistrationNumber,
			IssuerInn,
			RepresentativeInn);
	
	Запрос = Новый Структура;
	Запрос.Вставить("PowerOfAttorneyFullId", PowerOfAttorneyFullId);
	Запрос.Вставить("IsDefaultPatch", Новый Структура);
	Запрос.IsDefaultPatch.Вставить("IsDefault", XMLСтрока(IsDefault));
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(Запрос);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_PostVerifyPowerOfAttorney(ПараметрыСервиса, DS_PostVerifyPowerOfAttorney) Экспорт
	
	// https://diadoc-sdk.readthedocs.io/ru/latest/http/VerifyPowerOfAttorney.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/VerifyPowerOfAttorney";
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(DS_PostVerifyPowerOfAttorney);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetPowerOfAttorneyInfo(ПараметрыСервиса, BoxId, MessageId, EntityId) Экспорт
	
	// https://diadoc-sdk.readthedocs.io/ru/latest/http/GetPowerOfAttorneyInfo.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetPowerOfAttorneyInfo";

	ПараметрыЗапроса.Параметры.Вставить("BoxId"		, BoxId);
	ПараметрыЗапроса.Параметры.Вставить("MessageId"	, MessageId);
	ПараметрыЗапроса.Параметры.Вставить("EntityId"	, EntityId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_GetPowerOfAttorneyContent(ПараметрыСервиса, BoxId, MessageId, EntityId) Экспорт
	
	// https://developer.kontur.ru/Docs/diadoc-api/http/GetPowerOfAttorneyContent.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/V2/GetPowerOfAttorneyContent";

	ПараметрыЗапроса.Параметры.Вставить("BoxId"		, BoxId);
	ПараметрыЗапроса.Параметры.Вставить("MessageId"	, MessageId);
	ПараметрыЗапроса.Параметры.Вставить("EntityId"	, EntityId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_PostPrevalidatePowerOfAttorney(
		Знач ПараметрыСервиса,
		Знач boxId,
		Знач registrationNumber,
		Знач issuerInn,
		Знач RepresentativeInn,
		Знач Thumbprint) Экспорт
	
	// https://developer.kontur.ru/docs/diadoc-api/http/PrevalidatePowerOfAttorney_V2.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/PrevalidatePowerOfAttorney";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	Запрос = Новый Структура;
	Запрос.Вставить("FullId", DD_API_DS_PowerOfAttorneyFullId(RegistrationNumber, IssuerInn, RepresentativeInn));
	Запрос.Вставить("ConfidantCertificate", Новый Структура);
	Запрос.ConfidantCertificate.Вставить("Thumbprint", Thumbprint);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(Запрос);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Процедура DD_API_PostAddEmployeePowerOfAttorney(
		Знач ПараметрыСервиса,
		Знач boxId,
		Знач UserId,
		Знач registrationNumber,
		Знач issuerInn,
		Знач RepresentativeInn) Экспорт
	
	// https://developer.kontur.ru/docs/diadoc-api/http/AddEmployeePowerOfAttorney.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/AddEmployeePowerOfAttorney";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	ПараметрыЗапроса.Параметры.Вставить("UserId", UserId);
	
	PowerOfAttorneyFullId = DD_API_DS_PowerOfAttorneyFullId(RegistrationNumber, IssuerInn, RepresentativeInn);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(PowerOfAttorneyFullId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
КонецПроцедуры

// Отправляет запрос на регистрацию машиночитаемой доверенности (МЧД)
//
// Параметры
//  ПараметрыСервиса			- Структура	 - см. Контракт ПараметрыСервиса_Контур
//  boxId						- Строка	 - идентификатор ящика в сервисе
//  PowerOfAttorneyToRegister	- Структура	 - см. DD_API_DS_PowerOfAttorneyToRegister
//
// Возвращаемое значение:
//  Строка - идентификатор операции taskId. По этому идентификатору с помощью метода RegisterPowerOfAttorneyResult можно узнать результат регистрации МЧД. 
//
Функция DD_API_PostRegisterPowerOfAttorney(ПараметрыСервиса, boxId, PowerOfAttorneyToRegister) Экспорт
	
	// https://diadoc.github.io/doc/ru/latest/http/RegisterPowerOfAttorney.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/RegisterPowerOfAttorney";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(PowerOfAttorneyToRegister);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;

КонецФункции

// Получает результат регистрации машиночитаемой доверенности (МЧД).
//
// Параметры
//  ПараметрыСервиса			- Структура	 - см. Контракт ПараметрыСервиса_Контур
//  boxId						- Строка	 - идентификатор ящика в сервисе
//  taskId						- Структура	 - идентификатор операции, полученный методом DD_API_PostRegisterPowerOfAttorney
//
// Возвращаемое значение:
//  Структура - данные о результате регистрации машиночитаемой доверенности (МЧД)
//
Функция DD_API_GetRegisterPowerOfAttorneyResult(ПараметрыСервиса, boxId, taskId) Экспорт
	
	// https://diadoc.github.io/doc/ru/latest/http/RegisterPowerOfAttorneyResult.html
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/RegisterPowerOfAttorneyResult";

	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	ПараметрыЗапроса.Параметры.Вставить("taskId"	, taskId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;

КонецФункции // ()

//}		МЧД

//{		Подписание без носителя (госключ)

// Запускает операцию подписания файлов сертификатом без носителя.
//
// Параметры:
//  ПараметрыСервиса - Структура - см. Контракт ПараметрыСервиса_Контур
//  boxId			 - Строка	 - идентификатор ящика в сервисе
//  DssSignRequestV2 - Структура - см. DD_API_DS_DssSignRequestV2. Структура запроса на
//  подписание файлов сертификатом без носителя
// 
// Возвращаемое значение:
//  Строка - идентификатор операции taskId. По этому идентификатору с помощью метода DssSignResult
//  можно узнать результат обработки запроса.
//
Функция DD_API_DssSignV2(ПараметрыСервиса, boxId, DssSignRequestV2) Экспорт 
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/V2/DssSign";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId"		, boxId);
	
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(DssSignRequestV2);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат операции подписания файлов сертификатом без носителя.
//
// Параметры:
//  ПараметрыСервиса - Структура - см. Контракт ПараметрыСервиса_Контур
//  boxId			 - Строка	 - идентификатор ящика в сервисе
//  taskId			 - Структура - идентификатор операции, полученный методом DD_API_DssSignV2
// 
// Возвращаемое значение:
//  Структура - Результат подписания файлов сертификатом без носителя методом DssSign.
//  * OperationStatus - Строка - статус подписания
//  * FileSigningResults - Массив -список результатов подписания каждого файла
//  * ConfirmType - Строка - способ подтверждения
//  * DssOperator - Строка - оператор сертификата без носителя
//  * PhoneLastNumbers - Строка - четыре последние цифры номера телефона, используемого для подтверждения
//
Функция DD_API_DssSignResult(ПараметрыСервиса, boxId, taskId) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("OperationStatus");
	Результат.Вставить("FileSigningResults");
	Результат.Вставить("ConfirmType");
	Результат.Вставить("DssOperator");
	Результат.Вставить("PhoneLastNumbers");
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/DssSignResult";

	ПараметрыЗапроса.Параметры.Вставить("boxId" , boxId);
	ПараметрыЗапроса.Параметры.Вставить("taskId" , taskId);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	// BSLLS:MagicNumber-off
	Если Ответ.КодОтвета = 200 Тогда
	// BSLLS:MagicNumber-on
	
		РезультатОтвета = ПарсерJSON_Прочитать(Ответ.ТелоОтвета);
		
		ЗаполнитьЗначенияСвойств(Результат, РезультатОтвета);
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//}		Подписание без носителя (госключ)

//}		МЕТОДЫ DIADOC API

//{		ВЫСОКОУРОВНЕВЫЕ ОБЕРТКИ DIADOC API

Функция ПараметрыСервиса() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Токен", "");
	Результат.Вставить("ИспользоватьПротоколOIDC", Ложь);
	Результат.Вставить("ИспользоватьНовоеСоединение", Ложь);
	
	Результат.Вставить("Схема"				, "");
	Результат.Вставить("АдресВебСервиса"	, "");
	Результат.Вставить("КлючРазработчика"	, "");
	Результат.Вставить("Порт"				, "");
	
	Результат.Вставить("Таймаут"			, 60);
	
	НастройкиПрокси = НовыйНастройкиПрокси();
	
	Результат.Вставить("НастройкиПрокси", НастройкиПрокси);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьОплатуСервиса(ПараметрыСервиса, OrgId) Экспорт 
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetMyPermissions";
	
	ПараметрыЗапроса.Параметры.Вставить("OrgId", OrgId);
	
	// 402 - Необходима оплата тарифа АПИ.
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(402);
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = (Ответ.КодОтвета = 402);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьРегистрациюСертификатаВФНСЧерезДиадок(ПараметрыСервиса, BoxId, Сертификат) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/CanSendInvoice.html
	
	Результат = Истина;
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/CanSendInvoice";
	
	ПараметрыЗапроса.Параметры.Вставить("boxId", boxId);
	
	// 403 - Сертификат не может использоваться для подписания ЭСФ
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(403);
	
	ПараметрыЗапроса.ТелоЗапроса = Сертификат;
	
	ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 403 Тогда
		
		ТекстОшибки = Ответ.ТелоОтвета;
		
		ЭтоОшибкаРегистрацииСертификатаВФНС = Ложь
		Или Найти(ТекстОшибки, "FNS reg message was not sent for box") > 0
		Или Найти(ТекстОшибки, "is not registered in FNS for box") > 0
		Или Найти(ТекстОшибки, "No registration message to FNS found for boxId") > 0
		Или Найти(ТекстОшибки, "Unknown FnsRegStatus") > 0;
		
		Если ЭтоОшибкаРегистрацииСертификатаВФНС Тогда
			
			Результат = Ложь;
			
		ИначеЕсли Найти(ТекстОшибки, "Сертификат подписанта не является квалифицированным") = 0 Тогда
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьСоединение(ПараметрыСервиса) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/GetBox";
	
	// 401 - нет заголовка авторизации в Диадоке. 
	// Этого кода достаточно для проверки соединения с API.
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(401);
	
	Результат = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Результат;
	
КонецФункции

// Конструктор настроек прокси сервера
//
// Параметры:
//  Режим		 - Строка	 		- См. РежимыИспользованияПрокси()
//  Сервер		 - Строка	 		- Адрес прокси-сервера.
//  Порт		 - Строка, Число	- Порт прокси-сервера.
//  Логин		 - Строка	 		- Логин для авторизации на прокси-сервере.
//  Пароль		 - Строка	 		- Пароль для авторизации на прокси-сервере.
// 
// Возвращаемое значение:
//  Структура - настройки прокси
//   * РежимПрокси	 		- Строка - См. РежимыИспользованияПрокси(). Значение по умолчанию - "NoProxy"
//   * АдресПроксиСервера 	- Строка - Адрес прокси-сервера. Значение по умолчанию - пустая строка.
//   * ЛогинПроксиСервера	- Строка - Логин для авторизации на прокси-сервере. Значение по умолчанию - пустая строка.
//   * ПарольПроксиСервера	- Строка - Пароль для авторизации на прокси-сервере. Значение по умолчанию - пустая строка.
//   * ПортПроксиСервера	- Число	 - Порт прокси-сервера. Значение по умолчанию - 0.
//
//&НаКлиенте
Функция НовыйНастройкиПрокси(Режим = "",
							 Сервер = "",
							 Порт = 0,
							 Логин = "",
							 Пароль = "") Экспорт
		
	Если Не ЗначениеЗаполнено(Режим) Тогда
		Режим = РежимыИспользованияПрокси().БезПрокси;
	КонецЕсли;
	
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	ПортЧислом = ОписаниеТипов.ПривестиЗначение(Порт);
	
	НастройкиПрокси = Новый Структура;
	НастройкиПрокси.Вставить("РежимПрокси"			, Режим);
	НастройкиПрокси.Вставить("АдресПроксиСервера"	, Сервер);
	НастройкиПрокси.Вставить("ЛогинПроксиСервера"	, Логин);
	НастройкиПрокси.Вставить("ПарольПроксиСервера"	, Пароль);
	НастройкиПрокси.Вставить("ПортПроксиСервера"	, ПортЧислом);
	
	Возврат НастройкиПрокси;
	
КонецФункции

// Режимы использования прокси сервера
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - перечень режимов
//	 * БезПрокси 						- Строка - NoProxy
//	 * ИспользоватьНастройкиМодуля 		- Строка - UseProxy
//	 * ИспользоватьСистемныеНастройки 	- Строка - UseDefaultProxy
//
//&НаКлиенте
Функция РежимыИспользованияПрокси() Экспорт

	РежимыПрокси = Новый Структура;
	РежимыПрокси.Вставить("БезПрокси"						, "NoProxy");
	РежимыПрокси.Вставить("ИспользоватьНастройкиМодуля"		, "UseProxy");
	РежимыПрокси.Вставить("ИспользоватьСистемныеНастройки"	, "UseDefaultProxy");
	
	Возврат Новый ФиксированнаяСтруктура(РежимыПрокси);
	
КонецФункции

//}		ВЫСОКОУРОВНЕВЫЕ ОБЕРТКИ DIADOC API


//**************************************
//{		СТРУКТУРЫ ДАННЫХ DIADOC API

// Возвращает структуру для отправки титула покупателя акта 552
//
// Параметры
//  DocumentCreator		 - Строка	 - Составитель файла информации покупателя
//  DocumentName		 - Строка	 - Наименование первичного документа, определенное организацией
//  OperationContent	 - Строка	 - Содержание операции
//
Функция DD_API_DS_AcceptanceCertificate552BuyerTitleInfo(DocumentCreator, DocumentName, OperationContent) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/AcceptanceCertificate552Info.html?highlight=acceptancecertificate552buyertitleinfo
	
	Результат = Новый Структура;
	Результат.Вставить("Signers",			Новый Массив); // для коллекции структур, см. функцию DD_API_DS_ExtendedSigner
	Результат.Вставить("DocumentCreator",	DocumentCreator);
	Результат.Вставить("DocumentName",		DocumentName);
	Результат.Вставить("OperationContent",	OperationContent);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для отправки титула покупателя акта
//
// Параметры
//  Signature	 - Структура	 - Сведения о подписи акта, см. функцию DD_API_DS_AcceptanceCertificateSignatureInfo
//  Signer		 - Структура	 - Подписант, см. функцию DD_API_DS_Signer
//
Функция DD_API_DS_AcceptanceCertificateBuyerTitleInfo(Signature, Signer) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/AcceptanceCertificateInfo.html?highlight=acceptancecertificatebuyertitleinfo
	
	Результат = Новый Структура;
	Результат.Вставить("Signature",	Signature);
	Результат.Вставить("Signer",	Signer);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для представление реквизитов подписи одной из сторон в акте
//
// Параметры
//  SignatureDate	 - Строка		 - Дата подписи акта исполнителем / заказчиком
//  Official		 - Структура	 - Лицо, подписывающее со стороны исполнителя / заказчика, см. функцию DD_API_DS_Official
//  Attorney		 - Структура	 - Сведения о доверенности подписывающего со стороны исполнителя / заказчика, см. функцию DD_API_DS_Attorney
//
Функция DD_API_DS_AcceptanceCertificateSignatureInfo(SignatureDate = Неопределено,
													 Official = Неопределено,
													 Attorney = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/AcceptanceCertificateInfo.html?highlight=acceptancecertificatesignatureinfo
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(SignatureDate) Тогда
		Результат.Вставить("SignatureDate", SignatureDate);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Official) Тогда
		Результат.Вставить("Official", Official);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Attorney) Тогда
		Результат.Вставить("Attorney", Attorney);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для добавления организации в список контрагентов
//
// Параметры
//  OrgId	 - Строка	 - Идентификатор организации-контрагента, указывается если не заполнен параметр Inn
//  Inn		 - Строка	 - ИНН организации-контрагента, указывается если не заполнен параметр OrgId
//
Функция DD_API_DS_AcquireCounteragentRequest(OrgId = Неопределено, MessageToCounteragent =  Неопределено, InvitationDocument = Неопределено, Inn = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/http/AcquireCounteragent.html?highlight=acquirecounteragentrequest
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(OrgId) Тогда
		Результат.Вставить("OrgId", OrgId);
	Иначе
		Результат.Вставить("Inn", Inn);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(MessageToCounteragent) Тогда
		Результат.Вставить("MessageToCounteragent", MessageToCounteragent);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(InvitationDocument) Тогда
		Результат.Вставить("InvitationDocument", InvitationDocument);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для представления информации о доверенности
//
Функция DD_API_DS_Attorney() Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/Official.html?highlight=attorney
	
	Результат = Новый Структура;
	Результат.Вставить("Date");
	Результат.Вставить("Number");
	Результат.Вставить("IssuerOrganizationName");
	Результат.Вставить("IssuerPerson"); // см. функцию DD_API_DS_Official
	Результат.Вставить("IssuerAdditionalInfo");
	Результат.Вставить("RecipientPerson"); // см. функцию DD_API_DS_Official
	Результат.Вставить("RecipientAdditionalInfo");
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру данных, содержащую информацию об одном ящике в Диадоке: его идентификатор, понятное имя и информацию об организации-владельце ящика.
//
// Параметры
//  BoxId					 - Строка	 - Идентификатор ящика в Диадоке
//  Title					 - Строка	 - Понятное имя ящика
//  ЗаполнятьОрганизацию	 - Булево	 - Признак заполнения поля Organization
//                                         Поле Box.Organization заполняется в том и только в том случае, когда структура Box формируется методом GetBox.
//                                         В остальных случаях Box выдается в составе структуры Organization и там поле Box.Organization
//                                         представляло бы циклическую ссылку.
//
Функция DD_API_DS_Box(BoxId, Title = "", ЗаполнятьОрганизацию = Ложь)
	
	// https://api-docs.diadoc.ru/ru/latest/proto/Organization.html?highlight=Box
	Результат = Новый Структура;
	Результат.Вставить("BoxId", BoxId);
	Результат.Вставить("Title", Title);
	
	Если ЗаполнятьОрганизацию Тогда
		Результат.Вставить("Organization", DD_API_DS_Organization(, , Title, BoxId));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для патчинга
//
// Параметры
//  TypeNamedId	 - Строка	 - Тип документа
//  _Function	 - Строка	 - Функция документа
//  Version		 - Строка	 - Версия документа
//  Content		 - Строка	 - Содержимое документа, см. функцию DD_API_DS_UnsignedContent
//
Функция DD_API_DS_ContentToPatch(TypeNamedId, _Function, Version, Content) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/PrepareDocumentsToSignRequest.html?highlight=ContentToPatch
	
	Результат = Новый Структура;
	Результат.Вставить("TypeNamedId",	 TypeNamedId);
	Результат.Вставить("Function",		 _Function);
	Результат.Вставить("Version",		 Version);
	Результат.Вставить("Content",		 Content);
	Результат.Вставить("ExtendedSigner", Новый Массив); // для коллекции структур, см. функцию DD_API_DS_ExtendedSigner
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру вида "ключ-значение", для указания в документе пользовательских данных
//
// Параметры
//  Ключ		 - Строка	 - Произвольный непустой регистронезависимый ключ.
//							   Может содержать только буквы латинского и русского алфавита, цифры и символы «-» и «_».
//							   Длина не может превышать 60 символов
//  Значение	 - Строка	 - Произвольное регистронезависимое значение, соответствующее ключу Key.
//							   Длина не может превышать 200 символа.
//
Функция DD_API_DS_CustomDataItem(Key, Value) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/CustomDataItem.html
	
	Результат = Новый Структура;
	Результат.Вставить("Key",	 Лев(Key, 60));
	Результат.Вставить("Value",	 Лев(Value, 200));
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для изменения пользовательских данных, привязанных к документу
//
// Параметры:
//  ParentEntityId	 - 	Строка	 - Идентификатор родительской сущности
//  Operation		 - 	Число	 - Тип операции. Возможные значениея:
//								   0 - добавить ключ или изменить уже существующий
//								   1 - удалить ключ, если он есть. Значение поля Value при этом игнорируется.
//  Key				 - 	Строка	 - Произвольный непустой регистронезависимый ключ.
//								   Может содержать только буквы латинского и русского алфавита, цифры и символы «-» и «_».
//								   Длина не может превышать 60 символов
//  Value			 - 	Строка	 - Произвольное регистронезависимое значение, соответствующее ключу Key.
//								   Длина не может превышать 200 символа.
//
Функция DD_API_DS_CustomDataPatch(ParentEntityId, Operation, Key, Value = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/CustomDataPatch.html
	
	Результат = Новый Структура;
	Результат.Вставить("ParentEntityId", ParentEntityId);
	Результат.Вставить("Operation", Operation);
	Результат.Вставить("Key", Key);
	
	Если ЗначениеЗаполнено(Value) Тогда
		Результат.Вставить("Value", Value);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру документа любого типа для отправки
//
// Параметры
//  SignedContent	 - Структура	 - содержимое файла вместе с ЭП, см. функцию DD_API_DS_SignedContent
//  TypeNamedId		 - Строка		 - строковый идентификатор типа документа, доступные типы можно получить http://api-docs.diadoc.ru/ru/latest/http/GetDocumentTypes.html
//
Функция DD_API_DS_DocumentAttachment(SignedContent, TypeNamedId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/DocumentAttachment.html
	
	Результат = Новый Структура;
	Результат.Вставить("SignedContent",			 SignedContent);
	Результат.Вставить("InitialDocumentIds",	 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_DocumentId
	Результат.Вставить("SubordinateDocumentIds", Новый Массив); // для коллекции структур, см. функцию DD_API_DS_DocumentId
	Результат.Вставить("CustomData",			 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_CustomDataItem
	Результат.Вставить("TypeNamedId",			 TypeNamedId);
	Результат.Вставить("Metadata",				 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_MetadataItem
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру идентификатора документа
//
// Параметры
//  MessageId	 - Строка	 - Идентификатор сообщения
//  EntityId	 - Строка	 - Идентификатор сущности
//
Функция DD_API_DS_DocumentId(MessageId, EntityId) Экспорт
	
	// http://api-docs.diadoc.ru/ru/latest/proto/DocumentId.html
	
	Результат = Новый Структура;
	Результат.Вставить("MessageId",	 MessageId);
	Результат.Вставить("EntityId",	 EntityId);
	
	Возврат Результат;
	
КонецФункции

// Возвращает список документов
//
Функция DD_API_DS_DocumentList() Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("TotalCount", 0);
	Результат.Вставить("Documents", Новый Массив);
	Результат.Вставить("HasMoreResults", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру ЭП к данным в отправляемом сообщении
//
// Параметры
//  ParentEntityId	 - Строка	 - Идентификатор подписываемых данных
//
Функция DD_API_DS_DocumentSignature(ParentEntityId, 
									Signature = Неопределено, 
									PatchedContentId = Неопределено, 
									IsApprovementSignature = Ложь,
									PowerOfAttorney = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/DocumentSignature.html
	
	Результат = Новый Структура;
	Результат.Вставить("ParentEntityId",	 ParentEntityId);
	Результат.Вставить("Labels",			 Новый Массив); // для коллекции строк, см. http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
	
	Если Signature <> Неопределено Тогда
		
		Если ТипЗнч(Signature) = Тип("ДвоичныеДанные") Тогда
			SignatureBase64 = Base64Строка(Signature);
		Иначе
			SignatureBase64 = Signature;
		КонецЕсли;
		
		Результат.Вставить("Signature",	SignatureBase64);
		
	КонецЕсли;
	
	Если PatchedContentId <> Неопределено Тогда
		Результат.Вставить("PatchedContentId", PatchedContentId);
	КонецЕсли;
	
	Если IsApprovementSignature Тогда
		Результат.Вставить("IsApprovementSignature", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(PowerOfAttorney) Тогда
		Результат.Вставить("PowerOfAttorney", PowerOfAttorney);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает структуру для перемещения документов между подразделениями организации
//
// Параметры
//  BoxId	 -  Строка	 - Идентификатор ящика
//
Функция DD_API_DS_DocumentsMoveOperation(BoxId, ToDepartmentId = Неопределено) Экспорт
	
	// http://api-docs.diadoc.ru/ru/latest/proto/DocumentsMoveOperation.html
	
	Результат = Новый Структура;
	Результат.Вставить("BoxId",			 BoxId);
	Результат.Вставить("DocumentIds",	 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_DocumentId
	
	Если ToDepartmentId <> Неопределено Тогда
		Результат.Вставить("ToDepartmentId", ToDepartmentId);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру содержащую ссылку на документ, который нужно пропатчить в Диадоке
//
// Параметры
//  DocumentId	 - Структура	 - Идентификатор черновика документа, который надо подготовить к подписанию и отправке.
//								   См. функцию DD_API_DS_DocumentId
//
Функция DD_API_DS_DocumentToPatch(DocumentId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/PrepareDocumentsToSignRequest.html?highlight=documenttopatch
	
	Результат = Новый Структура;
	Результат.Вставить("DocumentId",	 DocumentId);
	Результат.Вставить("ExtendedSigner", Новый Массив); // для коллекции структур, см. функцию DD_API_DS_ExtendedSigner
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для указания ссылки на черновик документа, а также информацию о подписанте
//
// Параметры
//  DocumentId	 - Структура	 - Идентификатор черновика документа, который надо подготовить к подписанию и отправке.
//								   См. функцию DD_API_DS_DocumentId
//
Функция DD_API_DS_DraftDocumentToPatch(DocumentId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/PrepareDocumentsToSignRequest.html?highlight=DraftDocumentToPatch
	
	Результат = Новый Структура;
	Результат.Вставить("DocumentId",	 DocumentId);
	Результат.Вставить("ExtendedSigner", Новый Массив); // для коллекции структур, см. функцию DD_API_DS_ExtendedSigner
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для заполнения реквизитов подписанта
//
// Параметры
//  BoxId						 - Строка		 - Идентификатор ящика
//  SignerCertificate			 - Строка		 - Двоичные данные сертификата закодированные по алгоритму base64
//  SignerCertificateThumbprint	 - Строка		 - Отпечаток сертификата
//  SignerDetails				 - Структура	 - см. функцию DD_API_DS_ExtendedSignerDetails
//
// Если передан параметр BoxId, то с ним необходимо передать один из параметров SignerCertificate или SignerCertificateThumbprint
// Если передан параметр SignerDetails, то остальные параметры являются не обязательными
//
Функция DD_API_DS_ExtendedSigner(BoxId = Неопределено,
								 SignerCertificate = Неопределено,
								 SignerCertificateThumbprint = Неопределено,
								 SignerDetails = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSigner.html
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(BoxId) И ЗначениеЗаполнено(SignerCertificate) Тогда
		Результат.Вставить("BoxId",				 BoxId);
		Результат.Вставить("SignerCertificate",	 SignerCertificate);
	ИначеЕсли ЗначениеЗаполнено(BoxId) И ЗначениеЗаполнено(SignerCertificateThumbprint) Тогда
		Результат.Вставить("BoxId",							 BoxId);
		Результат.Вставить("SignerCertificateThumbprint",	 SignerCertificateThumbprint);
	ИначеЕсли ЗначениеЗаполнено(SignerDetails) Тогда
		Результат.Вставить("SignerDetails", SignerDetails);
	Иначе
		ВызватьИсключение "Указаны неверные параметры при инициализации структуры ExtendedSigner";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для заполнения детальных данных о подписанте
//
// Параметры
//  Surname			 - Строка	 - Фамилия
//  FirstName		 - Строка	 - Имя
//  SignerType		 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSigner.html?highlight=SignerType
//  SignerPowers	 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSigner.html?highlight=SignerPowers
//  SignerStatus	 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSigner.html?highlight=SignerStatus
//
Функция DD_API_DS_ExtendedSignerDetails(Surname, FirstName, SignerType, SignerPowers, SignerStatus) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSigner.html?highlight=ExtendedSignerDetails
	
	Результат = Новый Структура;
	Результат.Вставить("Surname",		 Surname);
	Результат.Вставить("FirstName",		 FirstName);
	Результат.Вставить("SignerType",	 SignerType);
	Результат.Вставить("SignerPowers",	 SignerPowers);
	Результат.Вставить("SignerStatus",	 SignerStatus);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для заполнения детальных данных о подписанте в Диадоке (кроме УПД 970)
//
// Параметры
//  SignerType		 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/utd820/ExtendedSignerDetailsToPost.html?highlight=SignerType
//  SignerPowers	 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSignerDetailsToPost.html?highlight=SignerPowers
//  SignerStatus	 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSignerDetailsToPost.html?highlight=SignerStatus
//
Функция DD_API_DS_ExtendedSignerDetailsToPost(SignerType = Неопределено,
											  SignerPowers = Неопределено,
											  SignerStatus = Неопределено,
											  JobTitle = Неопределено,
											  SignerInfo = Неопределено,
											  SignerPowersBase = Неопределено,
											  SignerOrgPowersBase = Неопределено,
											  RegistrationCertificate = Неопределено) Экспорт
	
	// http://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSignerDetailsToPost.html?highlight=ExtendedSignerToPost
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(SignerType) Тогда
		Результат.Вставить("SignerType", SignerType);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SignerPowers) Тогда
		Результат.Вставить("SignerPowers", SignerPowers);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SignerStatus) Тогда
		Результат.Вставить("SignerStatus", SignerStatus);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(JobTitle) Тогда
		Результат.Вставить("JobTitle", JobTitle);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SignerInfo) Тогда
		Результат.Вставить("SignerInfo", SignerInfo);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SignerPowersBase) Тогда
		Результат.Вставить("SignerPowersBase", SignerPowersBase);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SignerOrgPowersBase) Тогда
		Результат.Вставить("SignerOrgPowersBase", SignerOrgPowersBase);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(RegistrationCertificate) Тогда
		Результат.Вставить("RegistrationCertificate", RegistrationCertificate);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для получения списка событий
//
// Параметры
//  Filter	 - Структура	 - см. функцию DD_API_DS_TimeBasedFilter
//
Функция DD_API_DS_GetDocflowEventsRequest(Filter, 
											AfterIndexKey = "", 
											PopulateDocuments = false, 
											InjectEntityContent = false, 
											PopulatePreviousDocumentStates = false,
											DepartmentId = "") Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/GetDocflowEventsRequest.html
	
	Результат = Новый Структура;
	Результат.Вставить("Filter", Filter);
	
	Если ЗначениеЗаполнено(AfterIndexKey) Тогда
		Результат.Вставить("AfterIndexKey", AfterIndexKey);
	КонецЕсли;
	
	Если PopulateDocuments = Истина Тогда
		Результат.Вставить("PopulateDocuments", Истина);
	КонецЕсли;
	
	Если InjectEntityContent = Истина Тогда
		Результат.Вставить("InjectEntityContent", Истина);
	КонецЕсли;
	
	Если PopulatePreviousDocumentStates = Истина Тогда
		Результат.Вставить("PopulatePreviousDocumentStates", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(DepartmentId) Тогда
		Результат.Вставить("DepartmentId", DepartmentId);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с вложенным файлом приглашения
//
// Параметры:
//  SignedContent - Структура - см. функцию DD_API_DS_SignedContent
//  FileName - Строка - имя файла с приглашением
//  SignatureRequested - Булево	 - запрос подписи контрагента (по умолчанию Ложь)
// 
// Возвращаемое значение:
//  Структура - DS_InvitationDocument
//
Функция DD_API_DS_InvitationDocument(SignedContent, FileName, SignatureRequested = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("SignedContent", SignedContent);
	Результат.Вставить("FileName", FileName);
	
	Если SignatureRequested Тогда
		Результат.Вставить("SignatureRequested", Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для формирования уведомления об уточнении счета-фактуры
//
// Параметры
//  ErrorMessage	 - Строка		 - Текст уведомления об уточнении
//  Signer			 - Структура	 - см. функцию DD_API_DS_Signer
//
Функция DD_API_DS_InvoiceCorrectionRequestInfo(ErrorMessage, Signer) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/InvoiceCorrectionRequestInfo.html
	
	Результат = Новый Структура;
	Результат.Вставить("ErrorMessage",	 ErrorMessage);
	Результат.Вставить("Signer",		 Signer);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру патча сообщения
//
// Параметры
//  BoxId		 - Строка	 - Идентификатор ящика
//  MessageId	 - Строка	 - Идентификатор сообщения
//
Функция DD_API_DS_MessagePatchToPost(BoxId, MessageId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/MessagePatchToPost.html
	
	Результат = Новый Структура;
	Результат.Вставить("BoxId",		 BoxId);
	Результат.Вставить("MessageId",	 MessageId);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру сообщения
//
// Параметры
//  FromBoxId	 - Строка	 - Идентификатор ящика отправителя
//
Функция DD_API_DS_MessageToPost(FromBoxId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/MessageToPost.html
	
	Результат = Новый Структура;
	Результат.Вставить("FromBoxId", FromBoxId);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру "ключ-значение", для указания метаданных документа
//
// Параметры
//  Key		 - Строка	 - Должен быть валидным ключом метаданных для данного типа документа.
//						   Список доступных метаданных для типа можно получить через метод GetDocumentTypes
//  Value	 - Строка	 - Значение ключа
//
Функция DD_API_DS_MetadataItem(Key, Value) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/MetadataItem.html
	
	Результат = Новый Структура;
	Результат.Вставить("Key",	 Key);
	Результат.Вставить("Value",	 Value);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для заполнения информации о должностном лице
//
// Параметры
//  Surname		 - Строка	 - Фамилия
//  FirstName	 - Строка	 - Имя
//
Функция DD_API_DS_Official(Surname, FirstName) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/Official.html?highlight=official
	
	Результат = Новый Структура;
	Результат.Вставить("Surname",	 Surname);
	Результат.Вставить("FirstName",	 FirstName);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру данных содержащую информацию об одной организации в Диадоке:
//
// Параметры
//  OrgId		 - Строка	 - Идентификатор организации
//  Inn			 - Строка	 - ИНН
//  FullName	 - Строка	 - Полное наименование
//  BoxId		 - Строка	 - Идентификатор ящика
//  Sociability	 - Строка	 - Поле Sociability регулирует прием документов организацией от контрагентов.
//                             Значение AllOrganizations говорит о том, что организация готова получать документы от всех контрагентов,
//                             даже если приглашение не было принято (кроме заблокированных контрагентов).
//                             Значение CounteragentsOnly показывает, что организация принимает документы только от своих контрагентов,
//                             иначе отправка документов невозможна.
//
Функция DD_API_DS_Organization(OrgId = "", Inn = "", FullName = "", BoxId = "", Sociability = "AllOrganizations")
	
	// https://api-docs.diadoc.ru/ru/latest/proto/Organization.html
	
	Результат = Новый Структура;
	Результат.Вставить("OrgId", OrgId);
	Результат.Вставить("Inn", Inn);
	Результат.Вставить("FullName", FullName);
	Результат.Вставить("Boxes", Новый Массив);
	Результат.Вставить("Department", Новый Массив);
	Результат.Вставить("Sociability", Sociability);
	
	Результат.Boxes.Добавить(DD_API_DS_Box(BoxId, FullName));
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для подготовки запроса к подписанию документов
//
// Параметры
//  BoxId	 - Строка	 - Идентификатор ящика
//
Функция DD_API_DS_PrepareDocumentsToSignRequest(BoxId) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/PrepareDocumentsToSignRequest.html?highlight=preparedocumentstosignrequest
	
	Результат = Новый Структура;
	Результат.Вставить("BoxId",			 BoxId);
	Результат.Вставить("DraftDocuments", Новый Массив); // для коллекции структур, см. функцию DD_API_DS_DraftDocumentToPatch
	Результат.Вставить("Documents",		 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_DocumentToPatch
	Результат.Вставить("Contents",		 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_ContentToPatch
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру извещения о получении документа
//
// Параметры
//  ParentEntityId	 - Строка		 - Идентификатор документ, к которому относится данное извещение
//  SignedContent	 - Структура	 - см. функцию DD_API_DS_SignedContent
//
Функция DD_API_DS_ReceiptAttachment(ParentEntityId, SignedContent) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/MessagePatchToPost.html?highlight=ReceiptAttachment
	
	Результат = Новый Структура;
	Результат.Вставить("ParentEntityId", ParentEntityId);
	Результат.Вставить("SignedContent",	 SignedContent);
	Результат.Вставить("Labels",		 Новый Массив); // для коллекции строк, см. http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру UniversalMessageAttachment для Универсального сообщения
//
// Параметры:
//  ParentEntityId			- Строка	- Идентификатор документ, к которому относится Универсальное сообщение
//  UniversalMessageContent	- Структура	- см. функцию DD_API_DS_UnsignedContent
//  CodeGroup				- Число	 	- код группы Универсального сообщения (enum UniversalMessageCodeGroup)
// 
// Возвращаемое значение:
//   - Структура
//
Функция DD_API_DS_UniversalMessageAttachment(ParentEntityId, UniversalMessageContent, CodeGroup) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/MessagePatchToPost.html?highlight=UniversalMessageAttachment
	
	Результат = Новый Структура;
	Результат.Вставить("ParentEntityId", ParentEntityId);
	Результат.Вставить("UniversalMessageContent", UniversalMessageContent);
	Результат.Вставить("CodeGroup ", CodeGroup);
	Результат.Вставить("Labels", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру отмены фиксации для документа
//
// Параметры:
//  DocumentId		 - Строка - Идентификатор документ, к которому относится данное извещение
//  SignedContent	 - Структура - см. функцию DD_API_DS_SignedContent
// 
// Возвращаемое значение:
// Структура - Структура данных для MessagePatchToPost 
//
Функция DD_API_DS_TtGisFixationCancellationRequestAttachment(DocumentId, SignedContent) Экспорт
	
	// http://api-docs.diadoc.ru/ru/latest/proto/
	// MessagePatchToPost.html?highlight=TtGisFixationCancellationRequestAttachment
	
	Результат = Новый Структура;
	Результат.Вставить("DocumentId", DocumentId);
	Результат.Вставить("SignedContent", SignedContent);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для указания информации о согласовании
//
// Параметры
//  InitialDocumentId	 - Строка	 - Идентификатор согласуемого документа
//  ResolutionType		 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/Resolution.html?highlight=ResolutionType
//
Функция DD_API_DS_ResolutionAttachment(InitialDocumentId, ResolutionType, Comment = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/Resolution.html?highlight=ResolutionAttachment
	
	Результат = Новый Структура;
	Результат.Вставить("InitialDocumentId",	InitialDocumentId);
	Результат.Вставить("ResolutionType",	ResolutionType);
	Результат.Вставить("Labels",			Новый Массив); // для коллекции строк, см. http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
	
	Если Comment <> Неопределено Тогда
		Результат.Вставить("Comment", Comment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для подготовки запроса на согласование (подписи) документа
//
// Параметры
//  InitialDocumentId	 - Строка	 - Идентификатор документа, для которого формируется запрос на согласование
//  Type				 - Строка	 - см. http://api-docs.diadoc.ru/ru/latest/proto/ResolutionRequest.html?highlight=ResolutionRequestType
//
Функция DD_API_DS_ResolutionRequestAttachment(InitialDocumentId, Type, TargetUserId = Неопределено, TargetDepartmentId = Неопределено, Comment = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/ResolutionRequest.html?highlight=resolutionrequestattachment
	
	Результат = Новый Структура;
	Результат.Вставить("InitialDocumentId",	 InitialDocumentId);
	Результат.Вставить("Type",				 Type);
	Результат.Вставить("Labels",			 Новый Массив); // для коллекции строк, см. http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
	
	Если TargetUserId <> Неопределено Тогда
		Результат.Вставить("TargetUserId", TargetUserId);
	КонецЕсли;
	
	Если TargetDepartmentId <> Неопределено Тогда
		Результат.Вставить("TargetDepartmentId", TargetDepartmentId);
	КонецЕсли;
	
	Если Comment <> Неопределено Тогда
		Результат.Вставить("Comment", Comment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для постановки документа на маршрут согласования
//
// Параметры
//  InitialDocumentId	 - Строка	 - Идентификатор документа, который нужно поставить на маршрут согласования
//  RouteId				 - Строка	 - Идентификатор маршрута согласования, на который нужно поставить документ
//
Функция DD_API_DS_ResolutionRouteAssignment(InitialDocumentId, RouteId, Comment = Неопределено) Экспорт 

	// http://api-docs.diadoc.ru/ru/latest/proto/MessagePatchToPost.html?highlight=resolutionrouteassignment
	
	Результат = Новый Структура;
	Результат.Вставить("InitialDocumentId",	 InitialDocumentId);
	Результат.Вставить("RouteId",			 RouteId);
	Результат.Вставить("Labels",			 Новый Массив); // для коллекции строк, см. http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
	
	Если Comment <> Неопределено Тогда
		Результат.Вставить("Comment", Comment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_DS_ResolutionRequestDenialAttachment(InitialDocumentId, InitialResolutionRequestId, Comment = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("InitialDocumentId",				InitialDocumentId);
	Результат.Вставить("InitialResolutionRequestId",	InitialResolutionRequestId);
	
	Если Comment <> Неопределено Тогда
		Результат.Вставить("Comment", Comment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру предложения об аннулировании документа
//
// Параметры
//  ParentEntityId	 - Строка		 - Идентификатор документа, к которому относится данное предложение
//  SignedContent	 - Структура	 - см. функцию DD_API_DS_SignedContent
//
Функция DD_API_DS_RevocationRequestAttachment(ParentEntityId, SignedContent) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/MessagePatchToPost.html?highlight=revocationrequestattachment
	
	Результат = Новый Структура;
	Результат.Вставить("ParentEntityId",	 ParentEntityId);
	Результат.Вставить("SignedContent",		 SignedContent);
	Результат.Вставить("Labels",			 Новый Массив); // для коллекции строк, см. http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для формирования предложения об аннулировании документа
//
// Параметры
//  Comment	 - Строка		 - Необязательный текст комментария к предложению об аннулировании документа
//  Signer	 - Структура	 - Необязательная информация о подписанте предложения, см. функцию DD_API_DS_Signer
//
Функция DD_API_DS_RevocationRequestInfo(Comment = Неопределено, Signer = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/RevocationRequestInfo.html
	
	Результат = Новый Структура;
	
	Если Comment <> Неопределено Тогда
		Результат.Вставить("Comment", Comment);
	КонецЕсли;
	
	Если Signer <> Неопределено Тогда
		Результат.Вставить("Signer", Signer);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для формирования отказа в подписи документа, либо отказа
// от предложения об аннулировании документа
//
// Параметры
//  Signer	 - Структура	 - Обязательная информация о подписанте отказа
//
Функция DD_API_DS_SignatureRejectionInfo(ErrorMessage = Неопределено, Signer) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/SignatureRejectionInfo.html
	
	Результат = Новый Структура;
	Результат.Вставить("Signer", Signer);
	
	Если ErrorMessage <> Неопределено Тогда
		Результат.Вставить("ErrorMessage", ErrorMessage);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для представления данных и ЭП к ним
//
// Параметры
//  Content					 - Строка	 - Двоичные данные закодированные по алгоритму base64
//  Signature				 - Строка	 - Двоичные данные электронной подписи  закодированные по алгоритму base64
//  NameOnShelf				 - Строка	 - Имя файла с подписываемыми данными на «полке документов»
//  SignatureNameOnShelf	 - Строка	 - Имя подписи на «полке документов»
//  PowerOfAttornеy	 		 - Структура - см. DD_API_DS_PowerOfAttorneyToPost()
//
// Если переданы параметры Content и Signature, параметры NameOnShelf и SignatureNameOnShelf не указываются
// Если переданы параметры NameOnShelf и SignatureNameOnShelf, параметры Content и Signature не указываются
//
Функция DD_API_DS_SignedContent(Content = Неопределено,
								Signature = Неопределено,
								NameOnShelf = "",
								SignatureNameOnShelf = "",
								PowerOfAttorneyToPost = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/SignedContent.html
	
	Результат = Новый Структура;
	Результат.Вставить("Content", Content);
	Результат.Вставить("Signature", Signature);
	Результат.Вставить("NameOnShelf",	NameOnShelf);
	Результат.Вставить("SignatureNameOnShelf", SignatureNameOnShelf);
	
	Если ЗначениеЗаполнено(PowerOfAttorneyToPost) Тогда
		Результат.Вставить("PowerOfAttorney",	 PowerOfAttorneyToPost);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для представления информации о подписанте документа
//
// Параметры
//  SignerCertificate			 - Строка		 - Двоичные данные сертификата закодированные по алгоритму base64
//  SignerDetails				 - Структура	 - См. функцию DD_API_DS_SignerDetails
//  SignerCertificateThumbprint	 - Строка		 - Отпечаток сертификата
//
// Обязательно должен быть указан один из параметров
//
Функция DD_API_DS_Signer(SignerCertificate = Неопределено,
						 SignerDetails = Неопределено,
						 SignerCertificateThumbprint = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/Signer.html
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(SignerCertificate) Тогда
		Результат.Вставить("SignerCertificate", SignerCertificate);
	ИначеЕсли ЗначениеЗаполнено(SignerDetails) Тогда
		Результат.Вставить("SignerDetails", SignerDetails);
	ИначеЕсли ЗначениеЗаполнено(SignerCertificateThumbprint) Тогда
		Результат.Вставить("SignerCertificateThumbprint", SignerCertificateThumbprint);
	Иначе
		ВызватьИсключение "Указаны неверные параметры при инициализации структуры Signer";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру реквизитов подписанта
//
// Параметры
//  Surname		 - Строка	 - Фамилия
//  FirstName	 - Строка	 - Имя
//  Inn			 - Строка	 - ИНН
//
Функция DD_API_DS_SignerDetails(Surname = "",
								FirstName = "",
								Patronymic = "",
								JobTitle = "",
								Inn = "",
								SoleProprietorRegistrationCertificate = "") Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/Signer.html
	
	Результат = Новый Структура;
	Результат.Вставить("Surname"	, Surname);
	Результат.Вставить("FirstName"	, FirstName);
	Результат.Вставить("Patronymic"	, Patronymic);
	Результат.Вставить("JobTitle"	, JobTitle);
	Результат.Вставить("Inn"		, Inn);
	Результат.Вставить("SoleProprietorRegistrationCertificate", SoleProprietorRegistrationCertificate);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру фильтра для метода GetDocflowEvents
//
// Параметры
//  FromTimestamp	 - Структура	 - Нижняя граница, см. функцию DD_API_DS_Timestamp
//  ToTimestamp		 - Структура	 - Верхняя граница, см. функцию DD_API_DS_Timestamp
//  SortDirection	 - Строка		 - Порядок сортировки событий, см. http://api-docs.diadoc.ru/ru/latest/proto/SortDirection.html
//
Функция DD_API_DS_TimeBasedFilter(FromTimestamp = Неопределено,
								  ToTimestamp = Неопределено,
								  SortDirection = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/TimeBasedFilter.html
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(FromTimestamp) Тогда
		Результат.Вставить("FromTimestamp", FromTimestamp);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ToTimestamp) Тогда
		Результат.Вставить("ToTimestamp", ToTimestamp);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SortDirection) Тогда
		Результат.Вставить("SortDirection", SortDirection);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для представления момента времени
//
// Параметры
//  Ticks	 - Число	 - Целое число тиков (100-наносекундных интервалов), прошедших с момента времени 00:00:00 01.01.0001.
//
Функция DD_API_DS_Timestamp(Ticks) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/Timestamp.html
	
	Результат = Новый Структура;
	Результат.Вставить("Ticks", Ticks);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для формирования титула покупателя товарной накладной
//
// Параметры
//  ShipmentReceiptDate	 - Строка		 - Дата получения груза
//  Signer				 - Структура	 - См. функцию DD_API_DS_Signer
//
Функция DD_API_DS_Torg12BuyerTitleInfo(ShipmentReceiptDate, Signer) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/Torg12Info.html?highlight=Torg12BuyerTitleInfo
	
	Результат = Новый Структура;
	Результат.Вставить("ShipmentReceiptDate",	 ShipmentReceiptDate);
	Результат.Вставить("Signer",				 Signer);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для формирования титула покупателя товарной накладной
//
// Параметры
//  DocumentCreator		 - Строка	 - Наименование экономического субъекта - составителя файла обмена информации покупателя
//  OperationContent	 - Строка	 - Содержание операции
//
Функция DD_API_DS_TovTorgBuyerTitleInfo(DocumentCreator, OperationContent) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/TovTorgInfo.html?highlight=tovtorgbuyertitleinfo
	
	Результат = Новый Структура;
	Результат.Вставить("DocumentCreator",	 DocumentCreator);
	Результат.Вставить("OperationContent",	 OperationContent);
	Результат.Вставить("Signers",			 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_ExtendedSigner
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для формирования титула покупателя в форматах УПД, УКД
//
// Параметры
//  DocumentCreator		 - Строка	 - Наименование экономического субъекта - составителя файла обмена информации покупателя
//  OperationContent	 - Строка	 - Содержание операции
//
Функция DD_API_DS_UniversalTransferDocumentBuyerTitleInfo(DocumentCreator, OperationContent) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/utd/UniversalTransferDocumentBuyerTitleInfo.html
	
	Результат = Новый Структура;
	Результат.Вставить("DocumentCreator",	 DocumentCreator);
	Результат.Вставить("OperationContent",	 OperationContent);
	Результат.Вставить("Signers",			 Новый Массив); // для коллекции структур, см. функцию DD_API_DS_ExtendedSigner
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для представления подписанных ЭП данных в отправляемом сообщении
//
// Параметры
//  Content		 - Строка	 - Двоичные данные закодированные по алгоритму base64
//  NameOnShelf	 - Строка	 - Имя файла с подписываемыми данными на «полке документов»
//
Функция DD_API_DS_UnsignedContent(Content = Неопределено, NameOnShelf = Неопределено) Экспорт 
	
	// http://api-docs.diadoc.ru/ru/latest/proto/UnsignedContent.html
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(Content) Тогда
		Результат.Вставить("Content", Content);
	ИначеЕсли ЗначениеЗаполнено(NameOnShelf) Тогда
		Результат.Вставить("NameOnShelf", NameOnShelf);
	Иначе
		ВызватьИсключение "Указаны неверные параметры при инициализации структуры UnsignedContent";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для отказа от предложения об аннулировании или отказа от подписи документа
//
// Параметры
//  ParentEntityId	 - Строка	 - Идентификатор предложения об аннулировании, либо документа, к которому относится данное действие
//  SignedContent	 - Строка	 - Содержимое файла отказа вместе с ЭП под ним, см. функцию DD_API_DS_SignedContent
//
Функция DD_API_DS_XmlSignatureRejectionAttachment(ParentEntityId, SignedContent) Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("ParentEntityId",	 ParentEntityId);
	Результат.Вставить("SignedContent",		 SignedContent);
	Результат.Вставить("Labels",			 Новый Массив); // для коллекции строк, см. http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
	
	Возврат Результат
	
КонецФункции

// Возвращает структуру сообщения для отправки шаблонов
// http://api-docs.diadoc.ru/ru/latest/proto/TemplateToPost.html
//
// Параметры:
//  FromBoxId        - Строка - отправитель шаблонов
//  ToBoxId          - Строка - получатель шаблонов
//  MessageFromBoxId - Строка - отправитель документов, которые будут созданы по шаблону
//  MessageToBoxId   - Строка - получатель документов, которые будут созданы по шаблону
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * FromBoxId                - Строка - отправитель шаблонов
//   * ToBoxId                  - Строка - получатель шаблонов
//   * FromDepartmentId         - Строка - подразделение отправителя шаблонов
//   * ToDepartmentId           - Строка - подразделение получателя шаблонов
//   * MessageFromBoxId         - Строка - отправитель документов, которые будут созданы по шаблону
//   * MessageToBoxId           - Строка - получатель документов, которые будут созданы по шаблону
//   * MessageToDepartmentId    - Строка - подразделение получателя документов, которые будут созданы по шаблону
//   * DocumentAttachments      - Массив - содержит структуры, см. функцию DD_API_DS_TemplateDocumentAttachment()
//   * MessageProxyBoxId        - Строка - идентификатор ящика промежуточного получателя документов, созданных на основе шаблонов
//   * MessageProxyDepartmentId - Строка - идентификатор подразделения промежуточного получателя сообщения, которое будет создано
//                                         на основе отправляемого шаблона
//
Функция DD_API_DS_TemplateToPost(FromBoxId, ToBoxId, MessageFromBoxId, MessageToBoxId) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("FromBoxId"			, FromBoxId);
	Результат.Вставить("ToBoxId"			, ToBoxId);
	Результат.Вставить("MessageFromBoxId"	, MessageFromBoxId);
	Результат.Вставить("MessageToBoxId"		, MessageToBoxId);
	Результат.Вставить("DocumentAttachments", Новый Массив);
	
	Результат.Вставить("LockMode"					, "None");
	Результат.Вставить("FromDepartmentId"			, "");
	Результат.Вставить("ToDepartmentId"				, "");
	Результат.Вставить("MessageToDepartmentId"		, "");
	Результат.Вставить("MessageProxyBoxId"			, "");
	Результат.Вставить("MessageProxyDepartmentId"	, "");
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру шаблона документа для отправки
// http://api-docs.diadoc.ru/ru/latest/proto/TemplateDocumentAttachment.html
//
// Параметры:
//  UnsignedContent - Структура - содержимое файла, см. функцию DD_API_DS_UnsignedContent()
//  TypeNamedId     - Строка    - идентификатор типа документа, список допустимых типов:
//                                http://api-docs.diadoc.ru/ru/latest/http/GetDocumentTypes.html
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * UnsignedContent - Структура - параметр UnsignedContent
//   * TypeNamedId     - Строка    - параметр TypeNamedId
//   * Metadata        - Массив    - содержит структуры, см. функцию DD_API_DS_MetadataItem()
//
Функция DD_API_DS_TemplateDocumentAttachment(UnsignedContent, TypeNamedId) Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("UnsignedContent", UnsignedContent);
	Результат.Вставить("TypeNamedId"	, TypeNamedId);
	Результат.Вставить("Metadata"		, Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для отправки дополнений к сообщению с шаблонами документов
// http://api-docs.diadoc.ru/ru/latest/proto/TemplatePatchToPost.html
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Refusals - Массив - содержит структуры, см. DD_API_DS_TemplateRefusalAttachment()
//
Функция DD_API_DS_TemplatePatchToPost() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Refusals", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру отклонения или отзыва шаблона документа
// https://api-docs.diadoc.ru/ru/latest/proto/TemplatePatchToPost.html?highlight=TemplateRefusalAttachment
//
// Параметры:
//  DocumentId - Строка - идентификатор шаблона документа
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * DocumentId - Строка - идентификатор шаблона документа;
//   * Comment    - Строка - комментарий к отклонению или отзыву;
//   * Labels     - Массив - см. DD_API_DS_Labels();
//
Функция DD_API_DS_TemplateRefusalAttachment(DocumentId) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("DocumentId"	, DocumentId);
	Результат.Вставить("Comment"	, "");
	Результат.Вставить("Labels"		, DD_API_DS_Labels());
	
	Возврат Результат;
	
КонецФункции

// Метки, которые передаются в ящик другой стороны вместе с сущностью
// http://api-docs.diadoc.ru/ru/latest/proto/Labels.html
//
// Возвращаемое значение:
//  Массив - содержит строки с ограничениями:
//   * длиной не более 20 символов;
//   * содержит латинские буквы, цифры и дефисы, может начинаться с символа подчеркивания;
//   * только предопределенные метки начинаются с символа подчеркивания;
//   * регистр букв не имеет значения;
//   * к одной сущности можно добавить не более 30 меток;
//
Функция DD_API_DS_Labels()
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

// Возвращает заполненный контракт МЧД для постинга
// Признак UseDefault всегда Ложь, поскольку нельзя одновременное заполненное свойство FullId и UseDefault = True.
//
// Параметры:
//  RegistrationNumber	 - Строка	 - идентификатор МЧД
//  IssuerInn			 - Строка	 - ИНН доверителя
//  RepresentativeInn	 - Строка	 - ИНН уполномоченного
//	SendAsFile			 - Булево	 - признак передачи МЧД файлом (по умолчанию - Ложь)
//
// Возвращаемое значение:
//  Структура - конракт МЧД для постинга документов
//
Функция DD_API_DS_PowerOfAttorneyToPost(RegistrationNumber, IssuerInn, RepresentativeInn, SendAsFile = Ложь) Экспорт
	
	PowerOfAttorneyFullId = Новый Структура;
	PowerOfAttorneyFullId.Вставить("RegistrationNumber", RegistrationNumber);
	PowerOfAttorneyFullId.Вставить("IssuerInn", IssuerInn);
	PowerOfAttorneyFullId.Вставить("RepresentativeInn", RepresentativeInn);
	
	Результат = Новый Структура;
	Результат.Вставить("FullId", PowerOfAttorneyFullId);
	Результат.Вставить("UseDefault", Ложь);
	Результат.Вставить("SendAsFile", SendAsFile);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возвращает заполненный контракт МЧД для постинга
//
// Параметры:
//  RegistrationNumber	 - Строка - идентификатор МЧД
//  IssuerInn			 - Строка - ИНН доверителя
//  RepresentativeInn	 - Строка - ИНН уполномоченного
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   	* RegistrationNumber
//   	* IssuerInn
//   	* RepresentativeInn
//
Функция DD_API_DS_PowerOfAttorneyFullId(RegistrationNumber, IssuerInn, RepresentativeInn) Экспорт
	
	// https://diadoc.github.io/doc/ru/latest/proto/PowerOfAttorneyFullId.html
	
	Результат = Новый Структура;
	Результат.Вставить("RegistrationNumber", RegistrationNumber);
	Результат.Вставить("IssuerInn", IssuerInn);
	Результат.Вставить("RepresentativeInn", RepresentativeInn);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру которая хранит данные для регистрации машиночитаемой доверенности (МЧД)
//
// Параметры
//  FullId		- Структура	 - см. DD_API_DS_PowerOfAttorneyFullId
//  Signature	- Структура	 - см. DD_API_DS_PowerOfAttorneySignedContent
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * FullId	- Структура
//              - Неопределено - если FullId не задан;
//   * Content	- Структура
//              - Неопределено - если SignedContent не задан;
//
Функция DD_API_DS_PowerOfAttorneyToRegister(FullId = Неопределено, SignedContent = Неопределено) Экспорт
	
	// https://diadoc.github.io/doc/ru/latest/proto/PowerOfAttorneyToRegister.html
	
	Результат = Новый Структура;
	Результат.Вставить("FullId"		, FullId);
	Результат.Вставить("Content"	, SignedContent);
	
	Возврат Результат; 
	
КонецФункции

// Возвращает структуру для представления подписанных ЭП данных в отправляемом МЧД
//
// Параметры
//  Content        - Строка     - Двоичные данные доверенности закодированные по алгоритму base64
//  Signature    - Строка     - Двоичные данные подписи закодированные по алгоритму base64
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Content
//   * Signature
//
Функция DD_API_DS_PowerOfAttorneySignedContent(Content, Signature) Экспорт
	
	ВложенныйContent = Новый Структура;
	ВложенныйContent.Вставить("Content", Content);
	
	ВложенныйSignature = Новый Структура;
	ВложенныйSignature.Вставить("Content", Signature);
	
	Результат = Новый Структура;
	Результат.Вставить("Content"	, ВложенныйContent);
	Результат.Вставить("Signature"	, ВложенныйSignature);
	
	Возврат Результат; 
	
КонецФункции

// Возвращает структуру для проверки сертификата на КЭП 
//
// Параметры
//  CertificateContent    - Строка     - Двоичные данные подписи закодированные по алгоритму base64
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * CertificateVerificationRequest
//
Функция DD_API_DS_CertificateVerificationRequest(CertificateContent) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("CertificateContent", CertificateContent);
	
	Возврат Результат; 
	
КонецФункции

Функция DD_API_DS_ReceiptGenerationRequestV2(MessageId, AttachmentId, SignerContent) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("MessageId", messageId);
	Результат.Вставить("AttachmentId", attachmentId);
	Результат.Вставить("SignerContent", SignerContent);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_DS_InvoiceCorrectionRequestGenerationRequestV2(messageId, attachmentId, SignerContent, ErrorMessage) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ErrorMessage", ErrorMessage);
	Результат.Вставить("messageId", messageId);
	Результат.Вставить("attachmentId", attachmentId);
	Результат.Вставить("SignerContent", SignerContent);
	
	Возврат Результат;
	
КонецФункции

Функция DD_API_DS_SignatureRejectionGenerationRequestV2(messageId, attachmentId, SignerContent, ErrorMessage) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ErrorMessage", ErrorMessage);
	Результат.Вставить("messageId", messageId);
	Результат.Вставить("attachmentId", attachmentId);
	Результат.Вставить("SignerContent", SignerContent);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру данных содержащую информацию об одном контрагенте в Диадоке
//
// Параметры
//  BoxId - Строка - Идентификатор ящика в Диадоке
//  CounteragentStatus - Строка - см. Ядро.Перечисление_СтатусыКонтрагентов()
//
Функция DD_API_DS_Counteragent(BoxId, CounteragentStatus)
	
	// https://api-docs.diadoc.ru/ru/latest/proto/Counteragent.html
	
	Результат = Новый Структура;
	Результат.Вставить("Organization", DD_API_DS_Organization(, , , BoxId));
	Результат.Вставить("CounteragentStatus", CounteragentStatus);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру данных для подписания файлов сертификатом без носителя
//
// Параметры:
//  Files			 - Массив					 - из Структура см. DD_API_DS_DssSignFile список файлов для подписания
//  SignDataSource	 - Строка					 - параметр, указывающий, какими данными должен быть подписан файл
//  CertificateData	 - Структура, Неопределено	 - см. DD_API_DS_CertificateData. Данные для подписания файла
//  	с помощью сертификата без носителя
//  GosKeyData		 - Структура, Неопределено	 - см. DD_API_DS_GosKeyData. Данные для подписания файла
//  	с помощью Госключа
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//  * DssSignFile		- Массив из Структура - см. DD_API_DS_DssSignFile список файлов для подписания
//  * SignDataSource	- Строка	- параметр, указывающий, какими данными должен быть подписан файл.
//  если CertificateSign то подписание сертификатом без носителя; если выбран этот параметр,
//  для подписания используется значение поля CertificateData;
//  если GosKeySign то подписание с помощью Госключа; если выбран этот параметр,
//  для подписания используется значение поля GosKeyData.
//  * CertificateData	- Структура, Неопределено -данные для подписания файла с помощью сертификата
//  * GosKeyData		- Структура, Неопределено -данные для подписания файла с помощью Госключа
//
Функция DD_API_DS_DssSignRequestV2(Files, SignDataSource, CertificateData = Неопределено,
	GosKeyData = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Files", Files);
	Результат.Вставить("SignDataSource", SignDataSource);
	Если SignDataSource = "CertificateSign" Тогда
		
		Если ЗначениеЗаполнено(CertificateData) Тогда
			Результат.Вставить("CertificateData", CertificateData);
		Иначе
			ВызватьИсключение "ru = 'Указаны неверные параметры CertificateData при инициализации структуры DssSignRequestV2'";
		КонецЕсли;
		
	ИначеЕсли SignDataSource = "GosKeySign" Тогда
		
		Если ЗначениеЗаполнено(GosKeyData) Тогда
			Результат.Вставить("GosKeyData", GosKeyData);
		Иначе
			ВызватьИсключение "ru = 'Указаны неверные параметры GosKeyData при инициализации структуры DssSignRequestV2'";
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение "ru = 'Указаны неверные параметры при инициализации структуры DssSignRequestV2'";
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Возвращает структуру данных для подписания файла с помощью Госключа
//
// Параметры:
//  Snils	 - Строка, Неопредедлено - СНИЛС пользователя в формате 000-000-000 00
//  Oid		 - Строка, Неопределено	 - идентификатор oid пользователя в ЕСИА.
// 
// Возвращаемое значение:
//  Структура - структура данных для подписания файла с помощью Госключа
//
Функция DD_API_DS_GosKeyData(Snils = Неопределено, Oid = Неопределено) Экспорт
	
	Результат = Новый Структура;
		
	Если ЗначениеЗаполнено(Snils) Тогда
		Результат.Вставить("Snils", Snils);
	ИначеЕсли ЗначениеЗаполнено(Oid) Тогда
		Результат.Вставить("Oid", Oid);
	Иначе
		ВызватьИсключение НСтр("ru = 'Указаны неверные параметры при инициализации структуры GosKeyData'");
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Возвращает структуру данных для подписания файла с помощью сертификата без носителя
//
// Параметры:
//  Thumbprint - Строка, Неопредедлено - отпечаток сертификата без носителя
// 
// Возвращаемое значение:
//  Структура - структура данных для подписания файла с помощью сертификата без носителя
//
Функция DD_API_DS_CertificateData(Thumbprint = Неопределено) Экспорт
	
	Результат = Новый Структура;
		
	Если ЗначениеЗаполнено(Thumbprint) Тогда
		Результат.Вставить("Thumbprint", Thumbprint);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Возвращает структуру данных файла для подписания
//
// Параметры:
//  Content	 - Структура			 - см. DD_API_DS_Content_v3 содержимое файла
//  FileName - Строка, Неопределено	 - Имя файла
// 
// Возвращаемое значение:
//  Структура - содержимое файла
//  * Content - Строка - Контент файла
//  * FileName - Строка - Имя файла
//
Функция DD_API_DS_DssSignFile(Content, FileName = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Content", Content);
	Если ЗначениеЗаполнено(FileName) Тогда
		Результат.Вставить("FileName", FileName);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// BSLLS:NumberOfOptionalParams-off
// Возвращает структуру содержимого файла
//
// Параметры:
//  Content			 - Строка, Неопределено	 - Двоичные данные файла, закодированные по алгоритму base64
//  NameOnShelf		 - Строка, Неопределено	 - имя файла на полке документов
//  EntityId		 - Строка, Неопределено	 - идентификатор сущности, представленный структурой DocumentId.
//  PatchedContentId - Строка, Неопределено	 - идентификатор содержимого, подготовленного к отправке
//  	методом PrepareDocumentsToSign.
// 
// Возвращаемое значение:
//  Структура - содержимое файла
//
Функция DD_API_DS_Content_v3(
	Content = Неопределено,
	NameOnShelf = Неопределено,
	EntityId = Неопределено,
	PatchedContentId  = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Если ЗначениеЗаполнено(Content) Тогда
		Результат.Вставить("Content", Content);
	ИначеЕсли ЗначениеЗаполнено(NameOnShelf) Тогда
		Результат.Вставить("NameOnShelf", NameOnShelf);
	ИначеЕсли ЗначениеЗаполнено(EntityId) Тогда
		Результат.Вставить("EntityId", EntityId);
	ИначеЕсли ЗначениеЗаполнено(PatchedContentId) Тогда
		Результат.Вставить("PatchedContentId", PatchedContentId);
	Иначе
		ВызватьИсключение "ru = 'Указаны неверные параметры при инициализации структуры Content_v3'";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// BSLLS:NumberOfOptionalParams-on

//}		СТРУКТУРЫ ДАННЫХ DIADOC API


//**************************************
//{		ПЕРЕЧИСЛЕНИЯ DIADOC API

// Возвращает структуру с перечислением значений AttachmentType для Entity
// https://developer.kontur.ru/docs/diadoc-api/ru/latest/proto/Entity%20message.html
//
// Возвращаемое значение:
//  Структура - содержит свойства, которые соответствуют значениям перечисления
//
Функция DD_API_ENUM_AttachmentType() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("UnknownAttachmentType"		, "UnknownAttachmentType"); 	// неизвестный тип документа
	Результат.Вставить("Nonformalized"				, "Nonformalized");				// неформализованный документ
	Результат.Вставить("Invoice"					, "Invoice");					// счет-фактура
	Результат.Вставить("InvoiceRevision"			, "InvoiceRevision");			// исправление счета-фактуры
	Результат.Вставить("InvoiceCorrection"			, "InvoiceCorrection");			// корректировочный счет-фактура
	Результат.Вставить("InvoiceCorrectionRevision"	, "InvoiceCorrectionRevision");	// исправление корректировочного счета-фактуры
	Результат.Вставить("InvoiceReceipt"				, "InvoiceReceipt");			// извещение о получении счета-фактуры
	Результат.Вставить("InvoiceConfirmation"		, "InvoiceConfirmation");		// подтверждение оператора электронного ДО
	Результат.Вставить("InvoiceCorrectionRequest"	, "InvoiceCorrectionRequest");	// уведомление об уточнении счета-фактуры
	Результат.Вставить("RoamingConfirmation"		, "RoamingConfirmation");		// подтверждение оператора электронного ДО в роуминге
	Результат.Вставить("AttachmentComment"			, "AttachmentComment");			// текстовый комментарий к другой сущности-вложению
	
	Результат.Вставить("DeliveryFailureNotification", "DeliveryFailureNotification");	// уведомление о невозможности доставки сообщения
	Результат.Вставить("SignatureRequestRejection"	, "SignatureRequestRejection");		// отказ от формирования запрошенной подписи
	Результат.Вставить("SignatureVerificationReport", "SignatureVerificationReport");	// протокол проверки подписи, сформированный Диадоком
	Результат.Вставить("TrustConnectionRequest"		, "TrustConnectionRequest");	// запрос на инициализацию канала обмена документами через Диадок
	Результат.Вставить("ProformaInvoice"			, "ProformaInvoice");			// счет на оплату
	Результат.Вставить("Torg12"						, "Torg12");					// товарная накладная ТОРГ-12
	Результат.Вставить("AcceptanceCertificate"		, "AcceptanceCertificate");		// акт о выполнении работ / оказании услуг
	Результат.Вставить("XmlTorg12"					, "XmlTorg12");					// формализованная товарная накладная, титул продавца
	Результат.Вставить("XmlTorg12BuyerTitle"		, "XmlTorg12BuyerTitle");		// формализованная товарная накладная, титул покупателя 
	Результат.Вставить("XmlAcceptanceCertificate"	, "XmlAcceptanceCertificate");	// формализованный акт о выполнении работ, титул исполнителя
	
	Результат.Вставить("XmlAcceptanceCertificateBuyerTitle", "XmlAcceptanceCertificateBuyerTitle");	// формализованный акт о выполнении работ, титул заказчика 
	Результат.Вставить("StructuredData"		, "StructuredData");		// произвольный файл со структурированными данными
	Результат.Вставить("Resolution"			, "Resolution");			// информация о статусе согласования документа
	Результат.Вставить("ResolutionRequest"	, "ResolutionRequest");		// запрос согласования документа
	Результат.Вставить("ResolutionRequestDenial", "ResolutionRequestDenial");	// отказ в запросе подписи документа
	Результат.Вставить("PriceList"			, "PriceList");				// ценовой лист
	Результат.Вставить("PriceListAgreement"	, "PriceListAgreement");	// протокол согласования цены
	Результат.Вставить("CertificateRegistry", "CertificateRegistry");	// реестр сертификатов
	Результат.Вставить("ReconciliationAct"	, "ReconciliationAct");		// акт сверки
	Результат.Вставить("Contract"			, "Contract");				// договор
	
	Результат.Вставить("Torg13"					, "Torg13");				// накладная ТОРГ-13
	Результат.Вставить("ServiceDetails"			, "ServiceDetails");		// детализация 
	Результат.Вставить("Receipt"				, "Receipt");				// извещение о получении
	Результат.Вставить("UniversalMessage"		, "UniversalMessage");		// универсальное сообщение
	Результат.Вставить("XmlSignatureRejection"	, "XmlSignatureRejection");	// формализованный отказ в подписи
	Результат.Вставить("RevocationRequest"		, "RevocationRequest");		// предложени об аннулировании
	Результат.Вставить("RoamingNotification"	, "RoamingNotification");	// роуминговая квитанция
	Результат.Вставить("SupplementaryAgreement"	, "SupplementaryAgreement"); // дополнительное соглашение к договору
	Результат.Вставить("CustomData"				, "CustomData");			// произвольные данные к документу
	Результат.Вставить("MoveDocument"			, "MoveDocument");			// информация о перемещении документа в подразделение
	Результат.Вставить("ResolutionRouteAssignment", "ResolutionRouteAssignment");	// информация о запуске документа по маршруту согласования 
	
	Результат.Вставить("ResolutionRouteRemoval"	, "ResolutionRouteRemoval");	// информация о снятии документа с маршрута согласования
	Результат.Вставить("Title"					, "Title");				// титул документа 
	Результат.Вставить("Cancellation"			, "Cancellation");		// информация об отмене сущности, которая указана родительской по отношению к данной
	Результат.Вставить("Edition"				, "Edition");			// информация о редактировании контента документа, который указан родительским по отношению к данной сущности
	Результат.Вставить("DeletionRestoration"	, "DeletionRestoration");	// восстановление удалённого документа
	Результат.Вставить("TemplateTransformation"	, "TemplateTransformation"); // информация о трансформации
	Результат.Вставить("TemplateRefusal"		, "TemplateRefusal");		// информация об отклонении или отзыве шаблона
	Результат.Вставить("OuterDocflow"			, "OuterDocflow");			// Информация о внешнем документообороте
	
	Результат.Вставить("PowerOfAttorney"		, "PowerOfAttorney");		// соответствует информации о МЧД
	Результат.Вставить("PowerOfAttorneyStatus"	, "PowerOfAttorneyStatus");	// соответствует статусу проверки МЧД
	
	Результат.Вставить("UniversalTransferDocumentBuyerTitle", "UniversalTransferDocumentBuyerTitle");
	Результат.Вставить("UniversalCorrectionDocumentBuyerTitle", "UniversalCorrectionDocumentBuyerTitle");
	Результат.Вставить("TtGisFixationCancellationRequest", "TtGisFixationCancellationRequest");

	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с перечислением значений SignerType
// https://api-docs.diadoc.ru/ru/latest/proto/utd/ExtendedSigner.html
//
// Возвращаемое значение:
//  Структура - содержит свойства, которые соответствуют значениям перечисления
//
Функция DD_API_ENUM_SignerType() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("LegalEntity",		"LegalEntity");      // Представитель юридического лица
    Результат.Вставить("IndividualEntity",	"IndividualEntity"); // Индивидуальный предприниматель
    Результат.Вставить("PhysicalPerson",	"PhysicalPerson");   // Физическое лицо
		
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с перечислением значений ParticipantType
// https://diadoc-sdk.readthedocs.io/ru/workflow/proto/DocumentWorkflowSettings.html
//
// Возвращаемое значение:
//  Структура - содержит свойства, которые соответствуют значениям перечисления
//
Функция DD_API_ENUM_ParticipantType() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Sender",	"Sender");		// Отправитель
    Результат.Вставить("Proxy",		"Proxy"); 		// Промежуточный получатель
    Результат.Вставить("Recipient",	"Recipient");	// Конечный получатель
		
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с перечислением значений ParticipantAction
// https://diadoc-sdk.readthedocs.io/ru/workflow/proto/DocumentWorkflowSettings.html
//
// Возвращаемое значение:
//  Структура - содержит свойства, которые соответствуют значениям перечисления
//
Функция DD_API_ENUM_ParticipantAction() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Title",				"Title");				// Титул
    Результат.Вставить("Signature",			"Signature");			// Подпись
    Результат.Вставить("OptionalSignature",	"OptionalSignature");	// Подпись по запросу
		
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с перечислением значений PowerOfAttorneyRepresentativeType
// https://developer.kontur.ru/Docs/diadoc-api/proto/PowerOfAttorney.html#powerofattorneyrepresentativetype
//
// Возвращаемое значение:
//  Структура - содержит свойства, которые соответствуют значениям перечисления
//
Функция DD_API_ENUM_PowerOfAttorneyRepresentativeType() Экспорт
	
	Результат = Новый Структура;
	
	// Зарезервированное значение
	Результат.Вставить("UnknownRepresentativeType", "UnknownRepresentativeType");
	// Юридическое лицо
	Результат.Вставить("RepresentativeLegalEntity", "RepresentativeLegalEntity");
	// Индивидуальный предприниматель
	Результат.Вставить("RepresentativeIndividualEntity", "RepresentativeIndividualEntity");
	// Физическое лицо
	Результат.Вставить("RepresentativePhysicalEntity", "RepresentativePhysicalEntity");
	// Филиал юридического лица (обособленное подразделение)
	Результат.Вставить("RepresentativeLegalSubsidiaryEntity", "RepresentativeLegalSubsidiaryEntity");
	// Филиал иностранного юридического лица (аккредитованное представительство)
	Результат.Вставить("RepresentativeForeignLegalSubsidiaryEntity", "RepresentativeForeignLegalSubsidiaryEntity");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

//}		ПЕРЕЧИСЛЕНИЯ DIADOC API


//**************************************
//{		МЕТОДЫ KONTUR API

Функция Kontur_API_ОтправитьСобытияМетрики(ПараметрыСервиса, АдресМетода, МассивСобытий) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = АдресМетода;
	ПараметрыЗапроса.ТелоЗапроса = ПарсерJSON_Записать(МассивСобытий);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция Kontur_API_АктуальнойВерсииМодуля(ПараметрыСервиса) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Заголовки		= Новый Соответствие;
	ПараметрыЗапроса.АдресМетода	= "/1c-addin/versionDD.xml";
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
		
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции	

Функция Kontur_API_ФайлАктуальнойВерсииМодуля(ПараметрыСервиса, ИмяФайлаОбновления) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Заголовки		= Новый Соответствие;
	ПараметрыЗапроса.АдресМетода	= "/1c-addin/update/" + ИмяФайлаОбновления;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
		
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции	

Функция Kontur_API_ЛицевыеСчетаБезПодпискиНаМодуль(ПараметрыСервиса) Экспорт
	
	АдресМетода = "/1c-addin/accounts_without_subscription_dd_integration.json";
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Заголовки = Новый Соответствие;
	ПараметрыЗапроса.АдресМетода = АдресМетода;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Ложь;
		
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Сырой ответ от АПИ Контур по онлайн счетам
//
// Параметры:
//  ПараметрыСервиса - Структура - Контракт ПараметрыСервиса_Контур
//  AccountId		 - Строка - Идентификатор лицевого счета Диадок
// 
// Возвращаемое значение:
//  Строка - не сериализованый JSON
//
Функция Kontur_API_GetPortalBills(ПараметрыСервиса, AccountId) Экспорт
	
	Результат = "[]";

	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/relevant-offers/v1/sources/diadoc/accounts/" + AccountId;

	ДобавитьЗаголовокАвторизацииКонтурАпи(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 200 Тогда
		Результат = Ответ.ТелоОтвета;
	КонецЕсли;

	Возврат Результат;
КонецФункции

// Двоичные данные счета на оплату Диадок в формате PDF
//
// Параметры:
//  ПараметрыСервиса - Структура - Контракт ПараметрыСервиса_Контур
//  АдресФайла		 - Строка - Ссылка на файл полученный от КонтурАПИ_GetPortalBills
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Данные счета в формате PDF
//
Функция Kontur_API_GetPortalBillsContent(ПараметрыСервиса, АдресФайла) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/relevant-offers/v1/offers/" + АдресФайла;
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизацииКонтурАпи(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;

КонецФункции

//}		МЕТОДЫ KONTUR API


//**************************************
//{		МЕТОДЫ ПМ API

// Программное перечисление типов плагинов (подключаемых модулей) в API
// 
// Возвращаемое значение:
//  Структура - перечисление типов плагинов
//
Функция Plugins_API_ENUM_ТипыПлагинов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПМУниверсальногоМодуля"	, "pm");
	Результат.Вставить("ПМСтандарта"			, "pm-standard");
	
	Возврат Результат;	
	
КонецФункции

// Контракт с описанием плагина для выгрузки в сервис
//
// Параметры:
//  content_data - ДвоичныеДанные  	- двоичные данные выгружаемого файла 
//  plugin_type	 - Строка	 		- тип плагина API (см. Plugins_API_ENUM_ТипыПлагинов)
//  filename	 - Строка			- произвольное имя файла
//  description	 - Строка			- произвольный текст
// 
// Возвращаемое значение:
//  Структура - контракт
//  	- content_data 	- Строка - данные выгружаемого файла строкой в base64
//  	- plugin_type	- Строка - тип плагина API (см. Plugins_API_ENUM_ТипыПлагинов)
//  	- filename		- Строка - имя файла
//  	- description	- Строка - произвольный текст
//
Функция Plugins_API_DS_ContentToPost(content_data, plugin_type, filename, description) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("content_data"	, Base64Строка(content_data));
	Результат.Вставить("plugin_type"	, plugin_type);
	Результат.Вставить("filename"		, filename);
	Результат.Вставить("description"	, description);
	
	Возврат Результат;	
	
КонецФункции

// Возвращает адрес сервиса подключаемых модулей
//
Функция Plugins_АдресМетода(customer_id)
	
	ШаблонАдресаМетода = "/1c/v4/products/diadoc_um/customers/%1/plugins";
	
	Результат = СтрШаблонЛок(ШаблонАдресаМетода, customer_id);
	
	Возврат Результат;
	
КонецФункции

Функция Plugins_ВыгрузитьВСервис(ПараметрыСервиса, ТелоЗапроса, customer_id) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.ТелоЗапроса = ТелоЗапроса;
	
	АдресМетода = Plugins_АдресМетода(customer_id);
	
	ПараметрыЗапроса.Метод 			= "POST";
	ПараметрыЗапроса.АдресМетода	= АдресМетода;
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

// Обнолвяет сведения о плагине в сервисе
//
// Параметры:
//  ПараметрыСервиса - Структура - см. Ядро.ПараметрыСервиса_СервисУправленияПМ 
//  ТелоЗапроса		 - Строка	 - 
//  customer_id		 - Строка	 - идентификатор ИБ в виде GUID 
//  plugin_id		 - Строка	 - идентификатор плагина в сервисе
// 
// Возвращаемое значение:
//  Структура - сведения о плагине (см. Plugins_ПолучитьСведения)
//
Функция Plugins_ОбновитьВСервисе(ПараметрыСервиса, ТелоЗапроса, customer_id, plugin_id) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.ТелоЗапроса = ТелоЗапроса;
	
	АдресМетода = Plugins_АдресМетода(customer_id);
	АдресМетода = АдресМетода + "/" + plugin_id;
	
	ПараметрыЗапроса.Метод 			= "POST";
	ПараметрыЗапроса.АдресМетода	= АдресМетода;
	
	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

// Возвращает сведения о выгруженных в сервис ПМ
//
// Параметры:
//  ПараметрыСервиса - Структура - см. Ядро.ПараметрыСервиса_СервисУправленияПМ
//  plugin_type		 - Строка	 - см. Plugins_API_ENUM_ТипыПлагинов
//  customer_id		 - Строка	 - идентификатор ИБ в виде GUID
// 
// Возвращаемое значение:
//  Структура - сведения о ПМ из сервиса (все значения полей строковые)
//		id				- идентификатор плагина в сервисе
//		plugin_type 	- тип плагина
//		filename 		- имя файла
//		description 	- описание
//		hash_md5 		- хэш сумма файла
//		parent_md5hash 	- хэш сумма файла (для обновлений)
//		update 			- последняя дата изменения
//		create 			- дата создания
//
Функция Plugins_ПолучитьСведения(ПараметрыСервиса, customer_id, plugin_type, count = 1, parent_md5hash = Неопределено) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("order"			, "updated desc");
	ПараметрыЗапроса.Параметры.Вставить("plugin_type"	, plugin_type);
	ПараметрыЗапроса.Параметры.Вставить("count"			, count);
	
	Если ЗначениеЗаполнено(parent_md5hash) Тогда
		ПараметрыЗапроса.Параметры.Вставить("parent_md5hash", parent_md5hash);
	КонецЕсли;
	
	АдресМетода = Plugins_АдресМетода(customer_id);
	
	ПараметрыЗапроса.Метод 							= "GET";
	ПараметрыЗапроса.АдресМетода					= АдресМетода;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные 	= Ложь;

	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

// Загружает из сервиса файл
//
// Параметры:
//  ПараметрыСервиса - Структура - см. Ядро.ПараметрыСервиса_СервисУправленияПМ
//  customer_id		 - Строка	 - идентификатор информационной базы
//  plugin_id		 - Строка	 - идентификатор плагина в сервисе
// 
// Возвращаемое значение:
//  ДвоичныеДанные, Неопределено - двоичные данные файла
//
Функция Plugins_ЗагрузитьФайл(ПараметрыСервиса, customer_id, plugin_id) Экспорт
	
	ПараметрыЗапроса = ВнешниеСервисы_ПараметрыHTTPЗапроса();
	
	АдресМетода = Plugins_АдресМетода(customer_id);
	АдресМетода = АдресМетода + "/" + plugin_id + "/download";
	
	ПараметрыЗапроса.Метод 							= "GET";
	ПараметрыЗапроса.АдресМетода					= АдресМетода;
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные 	= Истина;

	Ответ = ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

// Возвращает сведения о файле ПМ обновления
//
// Параметры:
//  ПараметрыСервиса - Структура - см. Ядро.ПараметрыСервиса_СервисУправленияПМ
//  customer_id		 - Строка	 - идентификатор информационной базы
//  plugin_type		 - Строка	 - тип плагина (см. Plugins_API_DS_ТипПлагинаОбновлений)
//  parent_md5hash	 - Строка	 - хэш-сумма файла ПМ, для которого необходимо получить сведения об обновлении
// 
// Возвращаемое значение:
//  Структура - описание полей см. Plugins_ПолучитьСведения
//
Функция Plugins_ПолучитьОбновление(ПараметрыСервиса, customer_id, plugin_type, parent_md5hash) Экспорт
	
	update_plugin_type 	= Plugins_API_DS_ТипПлагинаОбновлений(plugin_type);
	count 				= 1;

	Результат = Plugins_ПолучитьСведения(ПараметрыСервиса, customer_id, update_plugin_type, count, parent_md5hash);
	
	Возврат Результат;
	
КонецФункции

// Маппинг типов плагинов. Возвращает тип плагина-обновление.
// Плагины для обновления имеют отличный от выгружаемых типы. 
// Нельзя добавлять или изменять плагины с такими типами без авторизации
//
// Параметры:
//  plugin_type	 - Строка - тип плагина, используемый для выгрузки и чтения без авторизации
// 
// Возвращаемое значение:
//  Строка - тип плагина обновлений
//
Функция Plugins_API_DS_ТипПлагинаОбновлений(plugin_type)
	
	ТипыПлагинов = Plugins_API_ENUM_ТипыПлагинов();
	
	Если plugin_type = ТипыПлагинов.ПМСтандарта Тогда
		Результат = "plugin-dd-standard";	
	Иначе
		Результат = "plugin-dd";	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//}		МЕТОДЫ ПМ API

//{		ВНЕШНИЕ СЕРВИСЫ

Функция ВнешниеСервисы_ПараметрыHTTPЗапроса()
	
	Модуль = Ядро.Модуль_ВнешниеСервисы(ЭтотОбъект);
	Результат = Модуль.ПараметрыHTTPЗапроса();
	Возврат Результат;
	
КонецФункции

Функция ВнешниеСервисы_ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса)
	
	СессияЛок = Сессия();
	Если ЗначениеЗаполнено(СессияЛок.Заголовки) Тогда
		Для Каждого КлючЗначение Из СессияЛок.Заголовки Цикл
			ПараметрыЗапроса.Заголовки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Модуль = Ядро.Модуль_ВнешниеСервисы(ЭтотОбъект);
	Результат = Модуль.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Результат;
	
КонецФункции

Функция Сессия() Экспорт
	
	Если _СессияЛок = Неопределено Тогда
		_СессияЛок = Новый Структура;
		_СессияЛок.Вставить("Заголовки", Новый Соответствие);
	КонецЕсли;
	
	Возврат _СессияЛок;
	
КонецФункции

//}		ВНЕШНИЕ СЕРВИСЫ


//**********************************************
//{		ПАРСЕР JSON

Функция ПарсерJSON_Записать(Значение)
	
	Модуль = Ядро.Модуль_ПарсерJSON(ЭтотОбъект);
	Результат = Модуль.Записать(Значение);
	Возврат Результат;
	
КонецФункции

Функция ПарсерJSON_Прочитать(СтрокаJSON)
	
	Модуль = Ядро.Модуль_ПарсерJSON(ЭтотОбъект);
	Результат = Модуль.Прочитать(СтрокаJSON);
	Возврат Результат;
	
КонецФункции

//{		ПАРСЕР JSON


//{		СЛУЖЕБНЫЕ

Процедура ДобавитьЗаголовокАвторизацииДиадок(ПараметрыСервиса, ПараметрыЗапроса)
	
	Заголовки = ПараметрыЗапроса.Заголовки;
	
	ЗаголовокАвторизации = ЗаголовокАвторизацииДиадок(ПараметрыСервиса);
	
	Заголовки.Вставить("Authorization", ЗаголовокАвторизации);
	
КонецПроцедуры

Функция ЗаголовокАвторизацииДиадок(ПараметрыСервиса) Экспорт
	
	Токен			 = ПараметрыСервиса.Токен;
	КлючРазработчика = ПараметрыСервиса.КлючРазработчика;
	
	Если ПараметрыСервиса.ИспользоватьПротоколOIDC Тогда
		Результат = _ЗаголовокАвторизацииBearer(Токен);
	Иначе
		Результат = _ЗаголовокАвторизацииDiadocAuth(КлючРазработчика, Токен);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция _ЗаголовокАвторизацииBearer(Знач access_token)
	
	Если Не ЗначениеЗаполнено(access_token) Тогда
		Ошибка = "ValueError: Не указан access_token";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Результат = "Bearer " + access_token;
	Возврат Результат;
	
КонецФункции

Функция _ЗаголовокАвторизацииDiadocAuth(Знач ddauth_api_client_id, Знач ddauth_token)
	
	Если Не ЗначениеЗаполнено(ddauth_api_client_id) Тогда
		Ошибка = "ValueError: Не указан ddauth_api_client_id";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Результат = "DiadocAuth ddauth_api_client_id=" + ddauth_api_client_id;
	
	Если ЗначениеЗаполнено(ddauth_token) Тогда
		Результат = Результат + ",ddauth_token=" + ddauth_token;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // _ЗаголовокАвторизацииДиадок

Процедура ДобавитьЗаголовокАвторизацииКонтурАпи(ПараметрыСервиса, ПараметрыЗапроса)
	
	Токен		 = ПараметрыСервиса.Токен;
	Заголовки	 = ПараметрыЗапроса.Заголовки;
	
	Заголовки.Вставить("x-Auth-ddToken", Токен);
	
КонецПроцедуры

Процедура ДобавитьИдентификаторОперации(ПараметрыЗапроса, OperationId)
	
	Если Не ЗначениеЗаполнено(OperationId) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса.Параметры.Вставить("OperationId", OperationId);
	
КонецПроцедуры

Процедура ДобавитьТелоЗапроса(ПараметрыЗапроса, ТелоЗапроса, МедиаТип)
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", МедиаТип);
	ПараметрыЗапроса.ТелоЗапроса = ТелоЗапроса;
	
КонецПроцедуры

Функция МедиаТипБинарныеДанные()
	Возврат "application/octet-stream";
КонецФункции

Функция МедиаТипJSON()
	Возврат "application/json";
КонецФункции

Функция МедиаТипТекстUTF8()
	Возврат "text/plain; charset=utf-8";
КонецФункции

Функция ТипАутентификацииПароль()
	Возврат "password";
КонецФункции

Функция ТипАутентификацииСертификат()
	Возврат "certificate";
КонецФункции

Функция ТелоЗапросаЛогинПароль(Логин, Пароль)
	
	Объект = Новый Структура;
	Объект.Вставить("login", Строка(Логин));
	Объект.Вставить("password", Строка(Пароль));
	
	Результат = ПарсерJSON_Записать(Объект);
	
	Возврат Результат;
	
КонецФункции

// Формирует текстовое описание HTTP-ошибки, включая в него код состояния и служебные данные.
//
// Параметры:
//  КодСостояния - Число - Код ответа HTTP
//  Ответ - Структура - см. ВнешниеСервисы.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Строка - описание HTTP-ошибки.
//
Функция ОшибкаСостоянияHTTP(Знач КодСостояния, Знач Ответ = Неопределено)
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(СтрШаблонЛок("Код состояния: %1", XMLСтрока(КодСостояния)));
	
	Если Ответ <> Неопределено Тогда
		
		TraceId = Ответ.Заголовки.Получить("X-Kontur-Trace-Id");
		Если ЗначениеЗаполнено(TraceId) Тогда
			Подстроки.Добавить(СтрШаблонЛок("TraceId: %1", TraceId));
		КонецЕсли;
		
		DiadocErrorCode = Ответ.Заголовки.Получить("X-Diadoc-ErrorCode");
		Если ЗначениеЗаполнено(DiadocErrorCode) Тогда
			Подстроки.Добавить(СтрШаблонЛок("DiadocErrorCode: %1", DiadocErrorCode));
		КонецЕсли;
		
		ТипДанных = Ответ.Заголовки.Получить("Content-Type");
		ТелоОтвета = Ответ.ТелоОтвета;
		
		Если ТипДанных = МедиаТипТекстUTF8() Тогда
			
			Если ТипЗнч(ТелоОтвета) = Тип("ДвоичныеДанные") Тогда
				Описание = СтрокаИзДвоичныхДанных(ТелоОтвета);
			Иначе
				Описание = ТелоОтвета;
			КонецЕсли;
			
			Подстроки.Добавить(СтрШаблонЛок("Описание: %1", Описание));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрСоединитьЛок(Подстроки, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

//}		СЛУЖЕБНЫЕ


//{		ОБЩЕГО НАЗНАЧЕНИЯ

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
// 
// Возвращаемое значение:
//  Массив - массив со строками, которые получились в результате разделения исходной строки.
//
//&НаКлиенте
Функция РазделитьСтрокуЛок(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем
//
// Параметры:
//  Строки - Массив, ФиксированныйМассив - Массив, содержащий объединяемые строки
//  Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом
// Возвращаемое значение:
//  Строка - Строка, содержащая соединенные исходные строки с разделителем между ними
//
Функция СтрСоединитьЛок(Знач Строки, Знач Разделитель = "")
	
	Результат = "";
	ТекРазделитель = "";
	
	Для Каждого Строка Из Строки Цикл
		
		Если ЗначениеЗаполнено(Строка) Тогда
			Результат = Результат + ТекРазделитель + Строка;
			ТекРазделитель = Разделитель;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку по номеру.
//
// Параметры:
//  ШаблонСтроки - Строка - Строка, содержащая маркеры подстановки вида "%N", где N от 1 до 6
//  Параметр1 - Строка - (Необязательный) значение подставляемого параметра
//  Параметр2 - Строка - (Необязательный) значение подставляемого параметра
//  Параметр3 - Строка - (Необязательный) значение подставляемого параметра
//  Параметр4 - Строка - (Необязательный) значение подставляемого параметра
//  Параметр5 - Строка - (Необязательный) значение подставляемого параметра
//  Параметр6 - Строка - (Необязательный) значение подставляемого параметра
// 
// Возвращаемое значение:
//  Строка - Строка шаблона с подставленными параметрами.
//
Функция СтрШаблонЛок(Знач ШаблонСтроки, Знач Параметр1
	, Знач Параметр2 = Неопределено
	, Знач Параметр3 = Неопределено
	, Знач Параметр4 = Неопределено
	, Знач Параметр5 = Неопределено
	, Знач Параметр6 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	Результат = СтрЗаменить(Результат	, "%6", Параметр6);
	
	Возврат Результат;
	
КонецФункции

Функция ЧислоИзСтрокиЛок(Знач Строка)
	
	Результат = 0;
	
	Если ЗначениеЗаполнено(Строка) Тогда
		
		Строка = СтрЗаменить(Строка, ",", ".");
		Строка = СтрЗаменить(Строка, " ", "");
		Строка = СтрЗаменить(Строка, Символы.НПП, "");
		
		Если ЗначениеЗаполнено(Строка) Тогда
			Результат = Число(Строка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сравнивает текущую версию приложения с переданной версией.
// Параметры:
//  СтрокаВерсии1 - Строка - номер версии
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция ПриложениеСтаршеВерсии(Версия)
	
	РезультатыФункции = Ядро.Кэш_Прочитать("РезультатыФункции_ПриложениеСтаршеВерсии");
	
	Если РезультатыФункции = Неопределено Тогда
		РезультатыФункции = Новый Соответствие;
	КонецЕсли;
	
	Результат = РезультатыФункции[Версия];
	
	Если Результат = Неопределено Тогда
		
		СисИнфо = Новый СистемнаяИнформация;
		
		Результат = (СравнитьВерсии(СисИнфо.ВерсияПриложения, Версия) < 0);
		
		РезультатыФункции.Вставить(Версия, Результат);
		
		Ядро.Кэш_Поместить("РезультатыФункции_ПриложениеСтаршеВерсии", РезультатыФункции);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Версии типа "1.0.1b" сравнивать нельзя.
//
// Параметры
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
//&НаКлиенте
Функция СравнитьВерсии(Знач ПерваяВерсия, Знач ВтораяВерсия, Разделитель = ".")
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(ПерваяВерсия) ИЛИ НЕ ПустаяСтрока(ВтораяВерсия) Цикл
		
		Поз = Найти(ПерваяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(ПерваяВерсия, Поз - 1));
			ПерваяВерсия = Сред(ПерваяВерсия, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(ПерваяВерсия), 0, Число(ПерваяВерсия));
			ПерваяВерсия = "";
		КонецЕсли;
		
		Поз = Найти(ВтораяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(ВтораяВерсия, Поз - 1));
			ВтораяВерсия = Сред(ВтораяВерсия, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(ВтораяВерсия), 0, Число(ВтораяВерсия));
			ВтораяВерсия = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		Результат.Добавить(Значение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает строку из двоичных данных
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - двоичные данные которые содержат текст
//  Кодировка - КодировкаТекста, Строка - (необязательный) кодировка текста;
// 
// Возвращаемое значение:
//  Строка
//
Функция СтрокаИзДвоичныхДанных(ДвоичныеДанные, Кодировка = "UTF-8")
	
	Результат = Ядро.СтрокаИзДвоичныхДанных(ДвоичныеДанные, Кодировка);
	
	Возврат Результат;
	
КонецФункции

//}		ОБЩЕГО НАЗНАЧЕНИЯ

