
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид"				, "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование"	, Представление());
	ПараметрыРегистрации.Вставить("БезопасныйРежим"	, Истина);
	ПараметрыРегистрации.Вставить("Версия"			, Версия());
	ПараметрыРегистрации.Вставить("Информация"		, "Модуль для работы с центром поддержки");
	
	ПараметрыРегистрации.Вставить("Команды", Новый ТаблицаЗначений);
	ПараметрыРегистрации.Команды.Колонки.Добавить("Представление"		, Новый ОписаниеТипов("Строка")); 
	ПараметрыРегистрации.Команды.Колонки.Добавить("Идентификатор"		, Новый ОписаниеТипов("Строка"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("Использование"		, Новый ОписаниеТипов("Строка"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ПараметрыРегистрации.Команды.Колонки.Добавить("Модификатор"		 	, Новый ОписаниеТипов("Строка"));
	
	Возврат ПараметрыРегистрации;
	
КонецФункции     

Функция Представление() Экспорт
	Возврат Заголовок() + ", версия: " + Версия();	
КонецФункции

Функция Заголовок() Экспорт
	Возврат "(СКБ Контур): Центр поддержки";	
КонецФункции

Функция Версия() Экспорт
	Возврат "1.1.4";	
КонецФункции
