// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем ОсновнойМодуль Экспорт;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

Функция ПолучитьАвтомобильПоVIN(Наименование) Экспорт
	стПрофильКонфигурации = ПолучитьПрофильКонфигурации();
	Если стПрофильКонфигурации.ХранениеНастроекПользователей.Вариант = "Рарус" Тогда
		
		АвтомобильVIN = НайтиVINВНаименовании(Наименование);
		
		Если НЕ ПустаяСтрока(АвтомобильVIN) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Автомобили.Ссылка
				|ИЗ
				|	Справочник.Автомобили КАК Автомобили
				|ГДЕ
				|	Автомобили.VIN = &АвтомобильVIN";
			
			Запрос.УстановитьПараметр("АвтомобильVIN", АвтомобильVIN);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция СимволРазрешенВVIN(СимволVIN)
	ШаблонПоиска = "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-";
	Возврат Найти(ШаблонПоиска, СимволVIN) > 0;
КонецФункции

Функция НайтиVINВНаименовании(Наименование) Экспорт
	НачалоVIN = НайтиVIN(Наименование);
	Для К = (НачалоVIN + 3) По СтрДлина(Наименование) Цикл
		Если СимволРазрешенВVIN(Сред(Наименование, К, 1)) Тогда
			Возврат Сред(Наименование, К, 17);
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция НайтиVIN(НаименованиеПар)
	Наименование = ВРег(НаименованиеПар);
	Если ПустаяСтрока(Наименование) Тогда
		Возврат 0;
	КонецЕсли;
	
	Разделители = ":;-.,"" " + Символы.ВК + Символы.ВТаб + Символы.НПП + Символы.ПС + Символы.ПФ + Символы.Таб;
	ИндексVIN = 0;
	Пока НЕ ПустаяСтрока(Наименование) Цикл
		СтрокаVIN = Найти(Наименование, "VIN");
		Если СтрокаVIN = 0 Тогда
			Возврат 0;
		КонецЕсли;
		СлеваСимвол = ?(СтрокаVIN = 1, "", Сред(Наименование, СтрокаVIN - 1, 1));
		СправаСимвол = Сред(Наименование, СтрокаVIN + 3, 1);
		Если (СтрокаVIN = 1 ИЛИ (Найти(Разделители, СлеваСимвол) > 0)) И (Найти(Разделители, СправаСимвол) > 0) Тогда
			Возврат СтрокаVIN + ИндексVIN;
		КонецЕсли;
		Наименование = Сред(Наименование, СтрокаVIN + 3);
		ИндексVIN = ИндексVIN + СтрокаVIN + 2;
	КонецЦикла;
	
	Возврат 0;
КонецФункции

// {Обертки

Функция ПолучитьПрофильКонфигурации()
	Возврат ОсновнойМодуль.ПолучитьПрофильКонфигурации();
КонецФункции

// }Обертки