// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_РежимУправляемыхФорм;
Перем НеИспользуется_ТиповойМодуль;

Перем Ядро;
Перем ОсновнойМодуль;
Перем ГенерацияXML;
Перем ПечатныеФормы;
Перем РаботаСМаркировкой;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормы = Модуль_ПечатныеФормы;
	РаботаСМаркировкой = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормы = Неопределено;
	РаботаСМаркировкой = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html
    
	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		Возврат ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);
		
		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
		
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "УстановитьУсловноеОформление" Тогда
		
		Возврат УстановитьУсловноеОформление(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd970",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd970",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd970",	"ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)", 		"ProformaInvoice", 						"");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");

	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	
	КатегорииПакетов = КатегорииПакетов();

	НужнаВТДокументыБезНДС = Ложь;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ВидПакетаID		= ОписаниеВидаПакета.ID;
		КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
		
		Если 		ВидПакетаID = "ID_ОсновнойПакет" 
				ИЛИ ВидПакетаID = "ID_УПД"
				ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
				
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета);
			
		ИначеЕсли	ВидПакетаID = "ID_УПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
				
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактурыНаАванс(ОписаниеВидаПакета);
			
		ИначеЕсли   ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" 
				ИЛИ ВидПакетаID = "ID_УПД_БезНДС" Тогда
				
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
			
			НужнаВТДокументыБезНДС = Истина;
			
		ИначеЕсли	ВидПакетаID = "ID_Счет" Тогда
			
			ИспользуютсяТолькоОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
			
			Если ИспользуютсяТолькоОснованияПоУмолчанию Тогда
			
				Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
				
			Иначе
				
				ТипОснования_СчетНаОплату		= ТипОснованияСчетаНаОплату_СчетНаОплату();
				ТипОснования_ДокументПродажи	= ТипОснованияСчетаНаОплату_ДокументПродажи();
				
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "СчетНаОплату", ТипОснования_СчетНаОплату);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "АктОбОказанииУслуг", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "НакладнаяНаРеализациюТорг12", ТипОснования_ДокументПродажи);
				
			КонецЕсли;
			
		ИначеЕсли	ВидПакетаID = "ID_АктСверки" Тогда
						
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию()
	
	Результат = Ядро.Настройки_ОснованияВидовДокументов_ИспользуютсяНастройкиПоУмолчанию();
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;
	
	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, Документ1С.ДокументОснование);
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С.ДокументОснование);
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
	
	// Прочие документы
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");		
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");	
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html

	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый		 = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры		 = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника			 = Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый) Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД"	, УказыватьОтсутствиеОснованияУПД);
		ДополнительныеПараметры.Вставить("ПараметрыСогласования"			, Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"					, ДанныеСотрудника); // Графа 10 (РабОргПрод)
		ДополнительныеПараметры.Вставить("ФИОПодписанта"					, " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД"						, ФункцияУПД);
		ДополнительныеПараметры.Вставить("FormatVersion"					, FormatVersion);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(
			НеИспользуется_ТиповойМодуль,
			НеИспользуется_РежимУправляемыхФорм,
			Документ1С,
			ТипКонтента_XDTO,
			ДополнительныеПараметры);
		
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" Тогда
		
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(
			НеИспользуется_ТиповойМодуль,
			НеИспользуется_РежимУправляемыхФорм,
			Документ1С,
			"АктСверки");
		
		Результат.Метаданные.DocumentNumber = ДанныеПечатнойФормы.Номер;
		Результат.Метаданные.DocumentDate = ДанныеПечатнойФормы.Дата;
		Результат.Метаданные.FileName = ДанныеПечатнойФормы.ИмяФайла;
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
	ИначеЕсли ID = "ID_АктСверки" ИЛИ ID = "ID_Счет" Тогда
		
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(
			НеИспользуется_ТиповойМодуль,
			НеИспользуется_РежимУправляемыхФорм,
			Документ1С,
			"СчетНаОплату");
		
		Результат.Метаданные.DocumentNumber = ДанныеПечатнойФормы.Номер;
		Результат.Метаданные.DocumentDate = ДанныеПечатнойФормы.Дата;
		Результат.Метаданные.CurrencyCode = ДанныеПечатнойФормы.КодВалюты;
		Результат.Метаданные.FileName = ДанныеПечатнойФормы.ИмяФайла;
		Результат.Метаданные.TotalSum = ДанныеПечатнойФормы.Сумма;
		Результат.Метаданные.TotalVat = ДанныеПечатнойФормы.СуммаНДС;
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры)
	
	ЗаполнитьРеквизитыДокумента(Параметры);
	
	Документ				= Параметры.Документ;
	РеквизитыДокумента		= Документ.Реквизиты;
	ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
	ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
	
	ДанныеПечатнойФормы = СформироватьВнешнююПечатнуюФорму(Документ.ДокументУчета, ВнешняяПечатнаяФорма, ИдентификаторКоманды);
	
	Документ.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	Документ.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
	Документ.Метаданные.DocumentDate	= РеквизитыДокумента.Дата;
	Документ.Метаданные.DocumentNumber	= РеквизитыДокумента.Номер;
	
	Если Документ.Метаданные.Свойство("TotalSum") Тогда
		Документ.Метаданные.TotalSum = РеквизитыДокумента.Сумма;
	КонецЕсли;
	
	Если Документ.Метаданные.Свойство("TotalVat") Тогда
		Документ.Метаданные.TotalVat = РеквизитыДокумента.СуммаНДС;
	КонецЕсли;
	
	ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
	ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
	ХранилищеКонтента.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	СлужебнаяИнформация = Документ.СлужебнаяИнформация;
	СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
	
	УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html

	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЕстьСуммаДокумента = ДокументУчета.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено;
	
	Если ЕстьСуммаДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаДокумента";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОсновнойМодуль.Общее_ЗначенияРеквизитовОбъекта(ДокументУчета, ИменаРеквизитов);
	
	Реквизиты.Номер	= СокрЛП(ЗначенияРеквизитов.Номер);
	Реквизиты.Дата = ЗначенияРеквизитов.Дата;
	
	Если ЕстьСуммаДокумента Тогда
		Реквизиты.Сумма	= ЗначенияРеквизитов.СуммаДокумента;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html
	
	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента = Документ.Тип;
	ФункцияДокумента = Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента",	Документ.Реквизиты.Номер);
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеМЗ");
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеУслугРабот");
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеОС");
		КонецЕсли;
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетНаОплату(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетНаОплатуОтПоставщика");
		
	ИначеЕсли ЭтоФормализованныйАктСверки405(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		НачалоПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.BeginDate);
		ОкончаниеПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.EndDate);
		
		Результат = НайтиАктыСверкиВзаиморасчетов(
			Организация,
			Контрагент,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктСверки405(ТипЭД)
	
	Результат = НРег(ТипЭД.ТипДокумента) = НРег("ReconciliationAct")
				И НРег(ТипЭД.ТипКонтента) = НРег("reconciliationact405");
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументАктСверки.Ссылка
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ДокументАктСверки
	|ГДЕ
	|	НЕ ДокументАктСверки.ПометкаУдаления
	|	И ДокументАктСверки.Организация = &Организация
	|	И ДокументАктСверки.Контрагент = &Контрагент
	|	И ДокументАктСверки.ДатаНачала = &ДатаНачала
	|	И ДокументАктСверки.ДатаОкончания = &ДатаОкончания";
	
	Возврат Результат;
	
КонецФункции

Функция НайтиАктыСверкиВзаиморасчетов(Организация, Контрагент, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериодаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	ПроверитьЗаполнитьИдентификаторОперации(Параметры);
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Документ = Параметры.Документ;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Документ.Тип.ФункцияДокумента) Тогда
		Результат.ОписаниеОшибки = "Не задана операция для создания учетного документа!";
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторОперации = Параметры.ИдентификаторОперации;
	
	РезультатПроверки = ПроверкаДокументаОснования(Документ, ИдентификаторОперации);
	
	Если ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки) Тогда
		
		Результат.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	Параметры.ДополнительныеПараметры.Вставить("ДокументОснование", РезультатПроверки.ОсновнойОбъект);
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Если ИспользоватьДатуЭД
		И НЕ ЭтоФормализованныйАктСверки405(Документ.Тип) Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаНоменклатурыДляСопоставления = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html

	//Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда
    //
	//
	//КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html
	
	//Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда
	//	
	//		
	//КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html
	
	//Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Результат_ИМ") Тогда
	//	
	//	
	//КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
		
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеМЗ", Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеУслугРабот", Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетНаОплатуОтПоставщика", Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			Элемент
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции



///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html

	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НакладнаяНаРеализациюТорг12.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НакладнаяНаРеализациюТорг12.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12 КАК НакладнаяНаРеализациюТорг12
	|ГДЕ
	|	НакладнаяНаРеализациюТорг12.Проведен = ИСТИНА
	|	И НакладнаяНаРеализациюТорг12.Организация = &Организация
	|	И НакладнаяНаРеализациюТорг12.Дата >= &ДатаНачала
	|	И НакладнаяНаРеализациюТорг12.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	НакладнаяНаРеализациюТорг12.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбОказанииУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктОбОказанииУслуг.Ссылка)
	|ИЗ
	|	Документ.АктОбОказанииУслуг КАК АктОбОказанииУслуг
	|ГДЕ
	|	АктОбОказанииУслуг.Проведен = ИСТИНА
	|	И АктОбОказанииУслуг.Организация = &Организация
	|	И АктОбОказанииУслуг.Дата >= &ДатаНачала
	|	И АктОбОказанииУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОбОказанииУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗ.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеМЗ.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Проведен = ИСТИНА
	|	И ПоступлениеМЗ.Организация = &Организация
	|	И ПоступлениеМЗ.Дата >= &ДатаНачала
	|	И ПоступлениеМЗ.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеМЗ.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеУслугРабот.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеУслугРабот.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеУслугРабот КАК ПоступлениеУслугРабот
	|ГДЕ
	|	ПоступлениеУслугРабот.Проведен = ИСТИНА
	|	И ПоступлениеУслугРабот.Организация = &Организация
	|	И ПоступлениеУслугРабот.Дата >= &ДатаНачала
	|	И ПоступлениеУслугРабот.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеУслугРабот.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьУсловноеОформление(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Ustanovit%27_Uslovnoye_Oformleniye.html
	
	Форма = Параметры.Форма;
	
	//входящие документ на подпись
	//ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокДокументов");
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Направление");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение 	= "Входящее";
	//
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.СписокДокументов.Статус");
	//ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Содержит;
	//ОтборЭлемента.ПравоеЗначение 	= "Требуется подпись";
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	Возврат Истина;

КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
	КатегорииПакетов = КатегорииПакетов();
	
	ОсновнойПакет			= КатегорииПакетов.ОсновнойПакет;
	СчетФактураНаАванс		= КатегорииПакетов.СчетФактураНаАванс;
	СчетНаОплату			= КатегорииПакетов.СчетНаОплату;
	АктCверки				= КатегорииПакетов.АктCверки;
	БезКатегории			= КатегорииПакетов.БезКатегории;
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД",								"ID_УПД, ID_УПД_ДОП",								ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ОсновнойПакет",		"СФ + ТОРГ12/Акт",					"ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура",	ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_раздельно",		"УПД СЧФ + УПД ДОП",				"ID_УПД_СЧФ, ID_УПД_ДОП",							ОсновнойПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СФ_НаАванс",			"СФ (на аванс)",					"ID_СчетФактура",									СчетФактураНаАванс);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_НаАванс",			"УПД СЧФ (на аванс)",				"ID_УПД_СЧФ",										СчетФактураНаАванс);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)",			"ID_Счет",											СчетНаОплату);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки",						"ID_АктСверки",										АктCверки);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12_Акт_БезНДС",	"ТОРГ12/Акт (без СФ)",				"ID_АктФормализованный, ID_ТОРГ12",					БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_БезНДС",			"УПД ДОП (без СФ)",					"ID_УПД_ДОП",										БезКатегории);
	
	ЗаполнитьНаименованияКатегорийПакетов(ТЗ);
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	МетаданныеДокумента1С = Документ1С.Метаданные();
	
	ЕстьРеквизитПодразделение	= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "Подразделение");
	ЕстьРеквизитОрганизация		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "Организация");
	ЕстьРеквизитКонтрагент		= Ядро.Общее_ЕстьРеквизитМетаданных(МетаданныеДокумента1С, "Контрагент");
	
	ИменаРеквизитов = Новый Массив;
		
	Если ЕстьРеквизитПодразделение Тогда
		ИменаРеквизитов.Добавить("Подразделение");
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
		
	Разделитель 		= ",";
	ТребуемыеРеквизиты 	= Ядро.СоединитьСтроку(ИменаРеквизитов, Разделитель);
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		Реквизиты = Ядро.Общее_ЗначенияРеквизитовОбъекта(Документ1С, ТребуемыеРеквизиты);
	КонецЕсли;
		
	// В коллекции ПоляОтправителя и ПоляПолучателя индекс элементов соответствует приоритету этих элементов.
	// Чем меньше индекс, тем выше приоритет.
	
	Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(Реквизиты.Подразделение) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Подразделение);
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Организация);
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ПоляПолучателя.Добавить(Реквизиты.Контрагент);
	КонецЕсли;
		
КонецПроцедуры

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	ИспользуемыйМенеджерПечати = "Документ.СчетНаОплату";
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИспользуемыйМенеджерПечати);
	
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= "Счет";
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт
	
	ПараметрыСчета = ПолучитьМетуСчетаНаОплату(СчетНаОплату);
	
	Мета.Сумма = ПараметрыСчета.Сумма;
	Мета.СуммаНДС = ПараметрыСчета.СуммаНДС;
	
КонецПроцедуры

Функция ПолучитьМетуСчетаНаОплату(СчетНаОплату)
	
	Результат = Новый Структура;
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("СуммаНДС", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ТЧ.Всего) КАК Сумма,
		|	СУММА(ТЧ.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ВТ_СумовыеПоказатели
		|ИЗ
		|	Документ.АктОбОказанииУслуг.УслугиОказанные КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ТЧ.Всего),
		|	СУММА(ТЧ.СуммаНДС)
		|ИЗ
		|	Документ.НакладнаяНаРеализациюТорг12.Номенклатура КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ТЧ.Всего),
		|	СУММА(ТЧ.СуммаНДС)
		|ИЗ
		|	Документ.СчетНаОплату.Материалы КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ТЧ.Всего),
		|	СУММА(ТЧ.СуммаНДС)
		|ИЗ
		|	Документ.СчетНаОплату.ОсновныеСредства КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ТЧ.Всего),
		|	СУММА(ТЧ.СуммаНДС)
		|ИЗ
		|	Документ.СчетНаОплату.Услуги КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_СумовыеПоказатели.Сумма) КАК Сумма,
		|	СУММА(ВТ_СумовыеПоказатели.СуммаНДС) КАК СуммаНДС
		|ИЗ
		|	ВТ_СумовыеПоказатели КАК ВТ_СумовыеПоказатели";
	
	Запрос.УстановитьПараметр("Ссылка", СчетНаОплату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Результат = ПредставлениеНомера(Документ.Номер);
	
	Возврат Результат;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
	
	СписокОснований.Добавить("СчетНаОплату", "Счета на оплату");
	СписокОснований.Добавить("ДокументПродажи", "Документов продажи");
	
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетНаОплату"));
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	СоответствияРеквизитов.Номер = "НомерПервичногоДокумента";
	СоответствияРеквизитов.дата = "ДатаПервичногоДокумента";
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  КоллекцияДокументов - Массив - коллекция документов учета
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Организация");	
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеЭлемента) Тогда
		Реквизиты.Добавить("Контрагент");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(КоллекцияДокументов, Реквизиты, Истина);
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив ссылок на связанные документы учета 1С.
// Для получения подчиненных документов используется критерии отбора СвязанныеДокументы.
//
// Параметры:
//  ДокументУчета	 - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(Документ) Экспорт
	
	Результат = Новый Массив;
	
	СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, Документ);

	Результат.Добавить(Документ);	

	Возврат Результат;	
	
КонецФункции

Процедура СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, Документ)
	
	СвязанныеДокументы = СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ);
	
	Для Каждого СсылкаНаОбъект Из СвязанныеДокументы Цикл

		Если КоллекцияПриемник.Найти(СсылкаНаОбъект) = Неопределено Тогда
			КоллекцияПриемник.Добавить(СсылкаНаОбъект); 
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, СсылкаНаОбъект)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  Документ - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ)
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;	
	
КонецФункции

// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка - счет-фактура, основание которой нужно найти;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "ДокументОснование");
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И Результат.Найти(ДокументОснование) = Неопределено Тогда
		Результат.Добавить(ДокументОснование);
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
	
	Если НЕ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КоллекцияОснований = ДокументыОснованияСчетаФактуры(ДокументУчета);
	
КонецПроцедуры

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  ПеречислениеСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = ПредставлениеСтавкиБезНДС();
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - ПеречислениеСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			
			// Представление ставки НДС получить не удалось,
			// поэтому возвращаем признак ошибки через зарезервированную строку "##".
			// Такую строку умеет обрабатывать валидация контента.
			Результат = "##";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("0", Перечисления.СтавкиНДС.НДС0);
	Результат.Вставить("10", Перечисления.СтавкиНДС.НДС10);
	Результат.Вставить("18", Перечисления.СтавкиНДС.НДС18);
	Результат.Вставить("20", Перечисления.СтавкиНДС.НДС20);
	Результат.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
	Результат.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
	Результат.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
	Результат.Вставить(ПредставлениеСтавкиБезНДС(), Перечисления.СтавкиНДС.БезНДС);
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентом(), СтавкаНДСИсчисляетсяНалоговымАгентомПредставление());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить("5", Перечисления.СтавкиНДС.НДС5);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить("7", Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить("22", Перечисления.СтавкиНДС.НДС22);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
	КонецЕсли;
	
	Результат.Вставить(Перечисления.СтавкиНДС.НДС0, "0");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10, "10");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18, "18");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20, "20");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
	Результат.Вставить(Перечисления.СтавкиНДС.БезНДС, ПредставлениеСтавкиБезНДС());
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентомПредставление(), СтавкаНДСИсчисляетсяНалоговымАгентом());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетЗначениеПеречисленияСтавкиНДС(ИмяЗначенияСтавкаНДС)
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	Результат = (ЗначенияПеречисления.Найти(ИмяЗначенияСтавкаНДС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом()
	
	Возврат "ИсчНалАг";
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентомПредставление()
	
	Возврат "НДС исчисляется налоговым агентом";
	
КонецФункции

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	ДокументыКонфигурации = Метаданные.Документы;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументыКонфигурации.АктОбОказанииУслуг);
	Результат.Добавить(ДокументыКонфигурации.АктСверкиВзаиморасчетов);
	Результат.Добавить(ДокументыКонфигурации.СчетНаОплату);
	
	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ

//*****************************************************************************
//{ СБОР КОНТЕНТА УПД970

//{ УПД970. Программный интерфейс

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка - ДокументСсылка - ссылка на учетный документ 1С,
//                               по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаПродавца(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры) Экспорт
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ЭтоСчетФактураНаАванс(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураНаАванс(ДокСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуСчетФактура(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры
		);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииУслуг") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуАктОбОказанииУслуг(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры
		);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		
		Результат = УПД970_КонтентТитулаПродавцаПоДокументуНакладнаяНаРеализациюТорг12(
			ДокСсылка,
			ФункцияДокумента,
			ДополнительныеПараметры
		);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ДокСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//} УПД970. Программный интерфейс

//{ УПД970. Заполнение протоструктуры по документам

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактура(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(
		Контент,
		ДанныеПоДокументу.СведенияОДокументахОплаты
	);
	
	ДокументыОснования = ДанныеПоДокументу.ДокументыОснования;
	ДокументОснование = ДокументыОснования[0];
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата, ДокСсылка);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	
	ДанныеПоДокументуОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументОснование, ДокСсылка);
	
	Если ЗначениеЗаполнено(ДанныеПоДокументуОснования) Тогда
		
		ДанныеДляЗаполнения = ДанныеПоДокументуОснования;
		
	Иначе
		
		ДанныеДляЗаполнения = ДанныеПоДокументу;
		
	КонецЕсли;
		
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеДляЗаполнения,
		ДополнительныеПараметры); 
			
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО_ТолькоУслуги(ДанныеДляЗаполнения);
		
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(
		Контент, 
		СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(
		Контент,
		ДокументыОснования,
		ДанныеПоДокументу.СведенияОДокументахОтгрузки,
		ФункцияДокумента
	);
	
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеДляЗаполнения.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_СведенияОбУчастникахЭДО_ТолькоУслуги(ДанныеДляЗаполнения)
	
	Результат = ДанныеДляЗаполнения.СведенияОбУчастникахЭДО;
	
	ТабличныеДанные = ДанныеДляЗаполнения.ТабличныеДанные;
	
	ЕстьТовары = ТабличныеДанные.Найти("Товар", "ТипНоменклатуры") <> Неопределено
	ИЛИ ТабличныеДанные.Найти("Имущество", "ТипНоменклатуры") <> Неопределено;
	
	Если Не ЕстьТовары Тогда
		Результат.Грузоотправитель = Неопределено;
		Результат.Грузополучатель = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуСчетФактураНаАванс(ДокСсылка)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный();
	ТекстЗапросаТаблицаТоваров = УПД970_ТекстЗапросаСчетФактура_СоставНФА();
	ТекстЗапросаДанныхОДокументахОплаты = УПД970_ТекстЗапросаСчетФактура_ПлатежноРасчетныеДокументы();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблицаТоваров);
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхОДокументахОплаты);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	СведенияОДокументахОплаты = РезультатыЗапроса[2].Выгрузить();
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	Контент = Контракт_ПротоструктураУПД970();
	Контент.Function = "СЧФ";
	Контент.CircumFormatInvoice = "2";
	Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата, ДокСсылка);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, СведенияОбУчастникахЭДО);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, СведенияОДокументахОплаты);
	УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(Контент, ТабличныеДанные);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуАктОбОказанииУслуг(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаАктОбОказанииУслуг(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата, ДокСсылка);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДанныеШапки.Ссылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, Неопределено, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавцаПоДокументуНакладнаяНаРеализациюТорг12(
	ДокСсылка,
	ФункцияДокумента,
	ДополнительныеПараметры)
	
	Контент = Контракт_ПротоструктураУПД970();
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеДокументаНакладнаяНаРеализациюТорг12(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.ДанныеШапки;
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента);
	
	УПД970_ЗаполнитьДатуНомер(Контент, ДанныеШапки.Номер, ДанныеШапки.Дата, ДокСсылка);
	УПД970_ЗаполнитьВалюту(Контент, ДанныеШапки.ВалютаДокументаКод);
	УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, ДанныеПоДокументу.СведенияОбУчастникахЭДО);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(
		Контент,
		ДанныеПоДокументу,
		ДополнительныеПараметры
	);
	
	ДокументыОтгрузки = ЗначениеВМассив(ДанныеШапки.Ссылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, Неопределено, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
		Контент,
		ДанныеПоДокументу.ОснованияПередачиТоваров,
		ДополнительныеПараметры
	);
	УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ДополнительныеПараметры.ИспользоватьСервисКонтурМаркировка);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Возврат Контент;
	
КонецФункции

//{ УПД970. Заполнение протоструктуры по документам. Общее

Процедура УПД970_ЗаполнитьДатуНомер(Контент, НомерДокумента, ДатаДокумента, ДокСсылка)
	
	Контент.DocumentNumber = УПД970_ПредставлениеНомера(НомерДокумента, ДокСсылка);
	Контент.DocumentDate = ДатаДокумента;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВалюту(Контент, ВалютаКод)
	
	Контент.Currency = ВалютаКод;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, СведенияОДокументахОплаты)
	
	Для Каждого СтрокаТаблицы Из СведенияОДокументахОплаты Цикл
		
		PaymentDocument = Контракт_PaymentDocumentInfo();
		
		PaymentDocument.Number = СтрокаТаблицы.НомерДокумента;
		PaymentDocument.Date = СтрокаТаблицы.ДатаДокумента;
		
		Контент.PaymentDocuments.Добавить(PaymentDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбУчастникахЭДО(Контент, СведенияОбУчастникахЭДО)
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОбУчастникахЭДО.Организация);
	Seller.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОбУчастникахЭДО.Контрагент);
	Buyer.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Контрагент.Ссылка;
	
	Грузоотправитель = СведенияОбУчастникахЭДО.Грузоотправитель;
	Если Грузоотправитель <> Неопределено Тогда
		
		Shipper = Контракт_Shipper970();
		Shipper.SameAsSeller = Ложь;
		
		Контент.Shippers.Добавить(Shipper);
		
		Если Грузоотправитель.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка Тогда
			
			Shipper.SameAsSeller = Истина;
			
		Иначе
			
			ShipperInfo = Контракт_ExtendedOrganizationInfo970();
			Shipper.OrganizationInfo = ShipperInfo;
			УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, Грузоотправитель);
			ShipperInfo.СлужебнаяИнформация.Ссылка = Грузоотправитель.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СведенияОбУчастникахЭДО.Грузополучатель <> Неопределено Тогда
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		Контент.Consignees.Добавить(Consignee);
		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, СведенияОбУчастникахЭДО.Грузополучатель);
		Consignee.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Грузополучатель.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьExtendedOrganizationInfo(Content, ДанныеУчастникаЭДО)
	
	Content.Type = УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО);
	
	Content.Name = ДанныеУчастникаЭДО.Наименование;
	
	Content.Inn = ДанныеУчастникаЭДО.ИНН;
	Content.Kpp = ДанныеУчастникаЭДО.КПП;
	Content.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	Content.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
	
	Content.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРНИП;
	Content.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаОГРНИП;
	
	Content.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	
	Content.Country = ДанныеУчастникаЭДО.СтранаНаименование;
	Content.CountryCode = ДанныеУчастникаЭДО.СтранаКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		Content.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.ЭлектроннаяПочта) Тогда
		Content.Email.Добавить(ДанныеУчастникаЭДО.ЭлектроннаяПочта);
	КонецЕсли;
	
	Content.BankName = ДанныеУчастникаЭДО.НаименованиеБанка;
	Content.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	Content.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	Content.BankId = ДанныеУчастникаЭДО.БИК;
	
	УПД970_ЗаполнитьAddressInfo(Content, ДанныеУчастникаЭДО.Адрес);
	
	Content.СлужебнаяИнформация.Ссылка = ДанныеУчастникаЭДО.Ссылка;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьAddressInfo(OrganizationInfo, СведенияОбАдресе)
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат;
	КонецЕсли;
	
	AddressInfo = Контракт_AddressInfo970();
	OrganizationInfo.Address = AddressInfo;
	
	ВидыАдресов = ГенерацияXML.Перечисление_ВидыАдресов();
	
	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		AddressSAR = УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе);
		
		AddressInfo.AddressSAR = AddressSAR;
		AddressInfo.Type = ВидыАдресов.АдресГАР;
		
	ИначеЕсли ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		AddressRF = УПД970_ЗаполненныйAddressRF(СведенияОбАдресе);
		
		AddressInfo.AddressRF = AddressRF;
		AddressInfo.Type = ВидыАдресов.АдресРФ;
		
	Иначе
		
		AddressText = УПД970_ЗаполненныйAddressText(СведенияОбАдресе);
		
		AddressInfo.AddressText = AddressText;
		AddressInfo.Type = ВидыАдресов.АдресСтрокой;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ТипыПомещенийКвартиры()
	
	ТипыАпартаментовВПорядкеПриоритета = Новый Массив;
	ТипыАпартаментовВПорядкеПриоритета.Добавить("Комната");
	ТипыАпартаментовВПорядкеПриоритета.Добавить("Бокс");
	ТипыАпартаментовВПорядкеПриоритета.Добавить("А/Я");
	ТипыАпартаментовВПорядкеПриоритета.Добавить("В/Ч");
	ТипыАпартаментовВПорядкеПриоритета.Добавить("П/О");
	
	Возврат ТипыАпартаментовВПорядкеПриоритета;
	
КонецФункции

Функция УПД970_ТипыПомещенийЗдания()
	
	ТипыПомещенийВПорядкеПриоритета = Новый Массив;
	ТипыПомещенийВПорядкеПриоритета.Добавить("Офис");
	ТипыПомещенийВПорядкеПриоритета.Добавить("Квартира");
	ТипыПомещенийВПорядкеПриоритета.Добавить("Помещение");
	ТипыПомещенийВПорядкеПриоритета.Добавить("Этаж");
	
	Возврат ТипыПомещенийВПорядкеПриоритета;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе)
	
	Результат = Контракт_AddressSARInfo();
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома) Тогда
		Результат.ID = СведенияОбАдресе.ИдентификаторДома;
	Иначе
		Результат.ID = СведенияОбАдресе.ИдентификаторАдресногоОбъекта;
	КонецЕсли;
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = УПД970_ПредставлениеРегиона(СведенияОбАдресе);
	
	Результат.MunicipalDistrict = СведенияОбАдресе.МуниципальныйРайон;
	Результат.MunicipalDistrictCode = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
	
	УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОНаселенномПункте(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОТерритории(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОУлице(Результат, СведенияОбАдресе);
	
	Результат.LandPlot = СведенияОбАдресе.НомерЗемельногоУчастка;
	
	УПД970_ЗаполнитьСведенияОЗданиях(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииЗдания(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииКвартиры(Результат, СведенияОбАдресе);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КодМуниципальногоРайона(ТипМуниципальногоРайона)
	
	Результат = "";
	
	Если ВРег(ТипМуниципальногоРайона) = ВРег("м.р-н") Тогда
		
		Результат = "1";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("г.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("ф.т.") Тогда
		
		Результат = "2";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер. г.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.г.") Тогда
		
		Результат = "3";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("мун. окр.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("м.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("мун.окр.") Тогда
		
		Результат = "4";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressRF(СведенияОбАдресе)
	
	Результат = Контракт_AddressRFInfo();
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = СведенияОбАдресе.Регион;
	Результат.Territory = СведенияОбАдресе.Район;
	
	Результат.City = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Город,
		СведенияОбАдресе.ГородСокращение);
	
	Результат.Locality = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.НаселенныйПункт,
		СведенияОбАдресе.НаселенныйПунктСокращение);
		
	Результат.Street = СоединитьЭлементыАдресногоОбъекта(
		СведенияОбАдресе.Улица,
		СведенияОбАдресе.УлицаСокращение);
	
	ИмяПоляНомер = "Номер";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание) Тогда 
		СведенияОбАдресе.Здание.Свойство(ИмяПоляНомер, Результат.Building);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса) Тогда 
		СведенияОбАдресе.Корпуса[0].Свойство(ИмяПоляНомер, Результат.Block);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда 
		СведенияОбАдресе.Помещения[0].Свойство(ИмяПоляНомер, Результат.Apartment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressText(СведенияОбАдресе)
	
	Результат = Контракт_AddressTextInfo();
	
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	Если СведенияОбАдресе.ТипАдреса = РаботаСАдресамиКлиентСервер.МуниципальныйАдрес()
		И ЗначениеЗаполнено(СведенияОбАдресе.МуниципальноеПредставление) Тогда
		
		ПредставлениеАдреса = СведенияОбАдресе.МуниципальноеПредставление;
		
	КонецЕсли;
	
	Результат.AddressText = ПредставлениеАдреса;
	Результат.CountryCode = СведенияОбАдресе.КодСтраны;
	Результат.Country = СведенияОбАдресе.Страна;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеРегиона(СведенияОбАдресе)
	
	КодыРегионов = ГенерацияXML_КодыРегионов();
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		Результат = КодыРегионов.Получить(XMLЗначение(Тип("Число"), СведенияОбАдресе.КодРегиона));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		ЧастиРегиона = Новый Массив;
		ЧастиРегиона.Добавить(СокрЛП(СведенияОбАдресе.Регион));
		ЧастиРегиона.Добавить(НРег(СведенияОбАдресе.РегионТипКраткий));
		
		Результат = СтрСоединить(ЧастиРегиона, " ");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Поселение) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.Поселение;
		AddressSAR.SettlementCode = СведенияОбАдресе.КодПоселения;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.ВнутригородскойРайон) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.ВнутригородскойРайон;
		AddressSAR.SettlementCode = "4";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОНаселенномПункте(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.НаселенныйПункт) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.НаселенныйПункт;
		AddressSAR.LocalityType = СведенияОбАдресе.НаселенныйПунктТипКраткий;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.Город) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.Город;
		AddressSAR.LocalityType = СведенияОбАдресе.ГородТипКраткий;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТерритории(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Территория) Тогда
		AddressSAR.PlanningElement = СведенияОбАдресе.Территория;
		AddressSAR.PlanningElementType = СведенияОбАдресе.ТерриторияТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОУлице(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Улица) Тогда
		AddressSAR.StreetElement = СведенияОбАдресе.Улица;
		AddressSAR.StreetElementType = СведенияОбАдресе.УлицаТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОЗданиях(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание.Номер)
		И ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания) Тогда
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = СведенияОбАдресе.Здание.Номер;
		AddressObject.Type = СведенияОбАдресе.Здание.ТипЗдания;
		
	КонецЕсли;
	
	Для Каждого Корпус Из СведенияОбАдресе.Корпуса Цикл
		
		Если Не ЗначениеЗаполнено(Корпус.Номер)
			И Не ЗначениеЗаполнено(Корпус.ТипКорпуса) Тогда
			Продолжить;
		КонецЕсли;
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = Корпус.Номер;
		AddressObject.Type = Корпус.ТипКорпуса;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииЗдания(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыПомещенийВПорядкеПриоритета = УПД970_ТипыПомещенийЗдания();
	
	Для Каждого ТипПомещения Из ТипыПомещенийВПорядкеПриоритета Цикл
		
		ПомещениеЗдания = Ядро.МассивСтруктур_Найти(Помещения, ТипПомещения, "ТипПомещения");
		Если ПомещениеЗдания <> Неопределено Тогда
			
			AddressSAR.House = ПомещениеЗдания.Номер;
			AddressSAR.HouseType = ПомещениеЗдания.ТипПомещения;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииКвартиры(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ПомещениеКвартиры = УПД970_ПолучитьПомещениеКвартиры(Помещения);
	
	Если ПомещениеКвартиры = Неопределено Тогда
		ПомещениеКвартиры = УПД970_ПолучитьНеклассифицированноеПомещение(Помещения);
	КонецЕсли;
	
	Если ПомещениеКвартиры <> Неопределено Тогда
		AddressSAR.Apartment = ПомещениеКвартиры.Номер;
		AddressSAR.ApartmentType = ПомещениеКвартиры.ТипПомещения;
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ПолучитьПомещениеКвартиры(СписокПомещений)
	
	ПомещениеКвартиры = Неопределено;
	
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	Для Каждого ИмяТипаПомещения Из ТипыПомещенийКвартиры Цикл
		
		ПомещениеКвартиры = Ядро.МассивСтруктур_Найти(СписокПомещений, ИмяТипаПомещения, "ТипПомещения");
		
		Если ПомещениеКвартиры <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПомещениеКвартиры;
	
КонецФункции

Функция УПД970_ПолучитьНеклассифицированноеПомещение(СписокПомещений)
	
	Результат = Неопределено;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	
	Для Каждого Помещение Из СписокПомещений Цикл
		
		ТипПомещения = Помещение.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		Если Не ЭтоПомещениеЗдания
			И Не ЭтоПомещениеКвартиры Тогда
			Результат = Помещение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокумента(Контент, ДанныеПоДокументу, ДополнительныеПараметры)
	
	Перем СведенияПрослеживаемости;
	
	ТабличныеДанные = ДанныеПоДокументу.ТабличныеДанные;
	ДанныеПоДокументу.Свойство("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	
	ВсеСтрокиБезНДС = Истина;
	
	Если Контент.Table = Неопределено Тогда
		Контент.Table = Контракт_InvoiceTable970();
	КонецЕсли;
	
	ФункцияДокументаУПД_ДОП = ФункцияДокументаУПД_ДОП();
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Если Контент.Function <> ФункцияДокументаУПД_ДОП()
			И СтрокаТаблицы.ТипНоменклатуры = УПД970_ТипНоменклатурыВозвратнаяТара() Тогда
			Продолжить;
		КонецЕсли;
		
		Item = Контракт_Item970();
		
		УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы);
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			Item.Quantity = Окр(СтрокаТаблицы.Количество, ТочностьКоличества);
		КонецЕсли;
		
		ПредставлениеСтавки = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		
		Item.TaxRate = ПредставлениеСтавки;
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		Item.SubtotalWithVatExcluded = СтрокаТаблицы.СуммаБезНДС;
		
		Item.Price = УПД970_ЦенаБезНДС(Item, СтрокаТаблицы.Цена, ТочностьЦены);
		
		УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(
			Item,
			СтрокаТаблицы,
			СведенияПрослеживаемости);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Контент.Table.Items.Добавить(Item);
		
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		УПД970_ПересчитатьИтоговыеЗначенияТаблицы(Контент.Table, Item);
		
	КонецЦикла;
	
	Контент.Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуКонтентаПоДаннымСчетФактураНаАванс(Контент, ТабличныеДанные)
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;
	
	ВсеСтрокиБезНДС = Истина;
	
	Для Каждого СтрокаТаблицы Из ТабличныеДанные Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = СтрокаТаблицы.ТоварНаименование;
		Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
		Item.ItemVendorCode = СтрокаТаблицы.КодИлиАртикулНоменклатуры;
		Item.TaxRate = ПредставлениеСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		Item.Vat = СтрокаТаблицы.СуммаНДС;
		Item.Subtotal = СтрокаТаблицы.СуммаВсего;
		
		ЭтоСтавкаБезНДС = (Item.TaxRate = ПредставлениеСтавкиБезНДС());
		Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы);
		
		Table.Items.Добавить(Item);
		
		Если НЕ ЭтоСтавкаБезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Table.Vat = ТабличныеДанные.Итог("СуммаНДС");
	Table.Total = ТабличныеДанные.Итог("СуммаВсего");
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	
КонецПроцедуры

Процедура УПД970_ПересчитатьИтоговыеЗначенияТаблицы(Table, Item)
	
	Если Table.TotalNet = Неопределено Тогда
		Table.TotalNet = 0;
	КонецЕсли;
	
	Если Table.TotalWithVatExcluded = Неопределено Тогда
		Table.TotalWithVatExcluded = 0;
	КонецЕсли;
	
	Если Table.Vat = Неопределено Тогда
		Table.Vat = 0;
	КонецЕсли;
	
	Если Table.Total = Неопределено Тогда
		Table.Total = 0;
	КонецЕсли;
	
	Если Item.Quantity <> Неопределено Тогда
		Table.TotalNet = Table.TotalNet + Item.Quantity;
	КонецЕсли;
	
	Table.Vat = Table.Vat + Item.Vat;
	Table.TotalWithVatExcluded = Table.TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
	Table.Total = Table.Total + Item.Subtotal;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьОсновныеСведенияОНоменклатуре(Item, СтрокаТаблицы)
	
	Item.Product = СтрокаТаблицы.ТоварНаименование;
	Item.ItemMark = УПД970_ТипНоменклатурыВТерминахПрото(СтрокаТаблицы.ТипНоменклатуры);
	
	Item.ItemVendorCode = СтрокаТаблицы.КодИлиАртикулНоменклатуры;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
		
		КодЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмеренияКод);
		ИмяЕИ = СокрЛП(СтрокаТаблицы.ЕдиницаИзмерения);
		
		Item.Unit = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕИ);
		Item.UnitName = ИмяЕИ;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ТипНоменклатурыВТерминахПрото(ТипНоменклатуры)
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Если ТипНоменклатуры = УПД970_ТипНоменклатурыУслуга() Тогда
		Результат = ТипыНоменклатуры.Услуга;
	ИначеЕсли ТипНоменклатуры = УПД970_ТипНоменклатурыРабота() Тогда
		Результат = ТипыНоменклатуры.Работа;
	Иначе
		Результат = ТипыНоменклатуры.Имущество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДополнительныеСведенияОНоменклатуре(Item, СтрокаТаблицы, СведенияПрослеживаемости)
	
	Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
		
		УПД970_ЗаполнитьСведенияПрослеживаемости(
			Item,
			СведенияПрослеживаемости,
			СтрокаТаблицы.ИдентификаторСтроки,
			СтрокаТаблицы.СтранаПроисхожденияКод,
			СтрокаТаблицы.НоменклатураТНВЭД
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияПрослеживаемости(
		Item,
		СведенияПрослеживаемостиДокумента,
		ИдентификаторСтроки,
		СтранаСтроки,
		ТНВЭДСтроки)
	
	Если СведенияПрослеживаемостиДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Item.CustomDeclarations.Очистить();
	
	ТаблицаСведенийГТД = Новый ТаблицаЗначений;
	ТаблицаСведенийГТД.Колонки.Добавить("СтранаПроисхожденияКод");
	ТаблицаСведенийГТД.Колонки.Добавить("НомерГТД");
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	СтрокиПрослеживаемости = СведенияПрослеживаемостиДокумента.НайтиСтроки(Отбор);
	
	ДляСтрокиКонтентаНесколькоСтрокПрослеживаемости = (СтрокиПрослеживаемости.Количество() > 1);
	
	Для Каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
		
		ItemTracingInfo = Контракт_ItemTracingInfo970();
		
		ItemTracingInfo.RegNumberUnit = СокрЛП(СтрокаПрослеживаемости.НомерРНПТ);
		ItemTracingInfo.Quantity = СтрокаПрослеживаемости.КоличествоПрослеживаемости;
		
		Если ДляСтрокиКонтентаНесколькоСтрокПрослеживаемости Тогда
			ItemTracingInfo.SumWithoutVat = СтрокаПрослеживаемости.КоличествоПрослеживаемости * Item.Price;
		Иначе
			ItemTracingInfo.SumWithoutVat = Item.SubtotalWithVatExcluded;
		КонецЕсли;
		
		ДанныеЕдиницыИзмерения = УПД_ДанныеЕдиницыИзмеренияТНВЭД(ТНВЭДСтроки);
		
		ItemTracingInfo.Unit = ДанныеЕдиницыИзмерения.Код;
		ItemTracingInfo.UnitName = ДанныеЕдиницыИзмерения.Наименование;
		
		Если НЕ ЗначениеЗаполнено(ItemTracingInfo.Unit) Тогда
			ItemTracingInfo.Unit = Item.Unit;
			ItemTracingInfo.UnitName = Item.UnitName;
		КонецЕсли;
		
		Item.ItemTracingInfos.Добавить(ItemTracingInfo);
		
		СтрокаСведенийГТД = ТаблицаСведенийГТД.Добавить();
		СтрокаСведенийГТД.НомерГТД = СтрокаПрослеживаемости.НомерГТД;
		СтрокаСведенийГТД.СтранаПроисхожденияКод = СтранаСтроки;
		
	КонецЦикла;
	
	ТаблицаСведенийГТД.Свернуть("СтранаПроисхожденияКод, НомерГТД");
	
	Для Каждого СтрокаСведенийГТД Из ТаблицаСведенийГТД Цикл
		УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаСведенийГТД);
	КонецЦикла;
	
КонецПроцедуры

Функция УПД_ДанныеЕдиницыИзмеренияТНВЭД(ТоварнаяНоменклатураВЭД)
	
	Результат = Новый Структура("Код, Наименование", "", "");
	
	Если НЕ ЗначениеЗаполнено(ТоварнаяНоменклатураВЭД) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК Код,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК Наименование
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО КлассификаторТНВЭД.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	КлассификаторТНВЭД.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ТоварнаяНоменклатураВЭД);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Следующий() Тогда
		Результат.Код = СокрЛП(ВыборкаЗапроса.Код);
		Результат.Наименование = СокрЛП(ВыборкаЗапроса.Наименование);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОТаможеннойДекларации(Item, СтрокаТаблицы)
	
	ЭтоСтранаПроисхожденияРоссия = СтрокаТаблицы.СтранаПроисхожденияКод = ОсновнаяСтрана().Код;
	Если ЭтоСтранаПроисхожденияРоссия Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД)
		И (Не ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхожденияКод)
			Или СтрокаТаблицы.СтранаПроисхожденияУчастникЕАЭС) Тогда
		Возврат;
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = СтрокаТаблицы.СтранаПроисхожденияКод;
	CustomDeclaration.DeclarationNumber = СокрЛП(СтрокаТаблицы.НомерГТД);
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	Результат.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	Результат.Номенклатура = СтрокаТаблицы.Товар;
	Результат.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
	Результат.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
	Результат.НомерГТД = СтрокаТаблицы.НомерГТД;
	Результат.ПрослеживаемыйТовар = СтрокаТаблицы.ПрослеживаемыйТовар;
	Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, КоллекцияДокументов, СведенияОДокументахОтгрузки, ФункцияДокумента)
	
	ДокументыОтгрузки = УПД970_ДокументыОтгрузки(КоллекцияДокументов);
	
	СтрокиТаблицы = Контент.Table.Items;
	
	НаименованиеДокумента = УПД970_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		УПД970_ЗаполнитьСведенияДокументовОбОтгрузкеДляФункцииУПДСЧФ(
			Контент,
			ДокументыОтгрузки,
			НаименованиеДокумента,
			СведенияОДокументахОтгрузки);
		
	Иначе
		
		НомерДокумента = Контент.DocumentNumber;
		ДатаДокумента = Контент.DocumentDate;
		
		DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
		Контент.DocumentShipments.Добавить(DocumentShipment);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузкеДляФункцииУПДСЧФ(
	Контент,
	ДокументыОтгрузки,
	НаименованиеДокумента,
	СведенияОДокументахОтгрузки)
	
	Если ЗначениеЗаполнено(СведенияОДокументахОтгрузки) Тогда
		
		Для Каждого СведенияОДокументе Из СведенияОДокументахОтгрузки Цикл
			
			DocumentShipment = УПД970_НовыйDocumentShipments970(
				СведенияОДокументе.НаименованиеДокумента,
				СведенияОДокументе.НомерДокумента,
				СведенияОДокументе.ДатаДокумента
			);
			
			Контент.DocumentShipments.Добавить(DocumentShipment);
			
		КонецЦикла;
		
	Иначе
		
		РеквизитыДокументовОтгрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДокументыОтгрузки, "Номер,Дата");
		
		Для Каждого КлючЗначение Из РеквизитыДокументовОтгрузки Цикл
			
			РеквизитыДокумента = КлючЗначение.Значение;
			
			НомерДокумента = УПД970_ПредставлениеНомера(РеквизитыДокумента.Номер, КлючЗначение.Ключ);
			ДатаДокумента = РеквизитыДокумента.Дата;
			
			DocumentShipment = УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
			Контент.DocumentShipments.Добавить(DocumentShipment);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_НовыйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента)
	
	Результат = Контракт_DocumentShipments970();
	
	Результат.Name = НаименованиеДокумента;
	Результат.Number = НомерДокумента;
	Результат.Date = ДатаДокумента;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьРеквизитыОснованияПередачиТоваров(
	Контент,
	ОснованияПередачиТоваров,
	ДополнительныеПараметры)
	
	Перем УказыватьОтсутствиеОснованияУПД;
	
	TransferInfo = Контракт_TransferInfo970();
	Контент.TransferInfo = TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	ДополнительныеПараметры.Свойство("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
	
	Для Каждого РеквизитыОснования Из ОснованияПередачиТоваров Цикл
		
		РеквизитыЗаполнены = УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования);
		
		Если Не РеквизитыЗаполнены
			И УказыватьОтсутствиеОснованияУПД = Истина Тогда
			
			TransferInfo.TransferBases.Очистить();
			Прервать;
			
		Иначе
			
			TransferBase = УПД970_НовыйTransferBase(РеквизитыОснования);
			TransferInfo.TransferBases.Добавить(TransferBase);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если TransferInfo.TransferBases.Количество() = 0 Тогда
		TransferInfo.WithoutTransferBase = Истина;
	КонецЕсли;
	
	УПД970_ЗаполнитьДатуОтгрузки(Контент);
	
КонецПроцедуры

Функция УПД970_НовыйTransferBase(РеквизитыОснования)
	
	Результат = Контракт_TransferBases970();
	
	Результат.Name = РеквизитыОснования.Наименование;
	Результат.Number = РеквизитыОснования.Номер;
	Результат.Date = РеквизитыОснования.Дата;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДатуОтгрузки(Контент)
	
	Если Контент.Function <> ФункцияДокументаУПД_СЧФ() Тогда
		
		ДатаОтгрузки = Контент.DocumentDate;
		
		Для Каждого DocumentShipment Из Контент.DocumentShipments Цикл
			ДатаОтгрузки = DocumentShipment.Date;
			Прервать;
		КонецЦикла;
		
		Контент.TransferInfo.TransferDate = ДатаОтгрузки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьНаименованиеДокумента(Контент, ФункцияДокумента)
	
	Если ФункцияДокумента <> ФункцияДокументаУПД_СЧФ()
		И Контент.DocumentShipments.Количество() > 0 Тогда
		Контент.DocumentName = Контент.DocumentShipments[0].Name;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент)
	
	Контент.DocumentCreator = "";
	Контент.DocumentCreatorBase = "";
	
	Если Контент.Sellers.Количество() > 0 Тогда
		
		ПродавецИнфо = Контент.Sellers[0];
		Контент.DocumentCreator = НаименованиеИННКПП(ПродавецИнфо.Name, ПродавецИнфо.Inn, ПродавецИнфо.Kpp);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры)
	
	Перем ДанныеСотрудника;
	
	ДополнительныеПараметры.Свойство("ДанныеСотрудника", ДанныеСотрудника);
		
	ЕстьТовары = УПД970_ВДокументеЕстьТовары(Контент.Table.Items);
	
	НеобходимоЗаполнитьСведения = (ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность)
		И Контент.Function <> ФункцияДокументаУПД_СЧФ()
		И ЕстьТовары);
	
	Если НеобходимоЗаполнитьСведения Тогда
		
		Employee = Контракт_Employee970();
		
		Employee.Surname = ДанныеСотрудника.Фамилия;
		Employee.FirstName = ДанныеСотрудника.Имя;
		Employee.Patronymic = ДанныеСотрудника.Отчество;
		Employee.EmployeePosition = ДанныеСотрудника.Должность;
		
		Контент.TransferInfo.Employee = Employee;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка, ИспользоватьСервисКонтурМаркировка)
	
	Если НЕ ИспользоватьСервисКонтурМаркировка Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		РаботаСМаркировкой.ЗаполнитьСведенияОМаркировке970(Контент);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ПодробнаяОшибка = Ядро.Общее_ПодставитьПараметрыВСтроку(
			"Не удалось заполнить сведения о маркировке по причине:
			|%1",
			ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
			"Диадок.РаботаСМаркировкой",
			УровеньЖурналаРегистрации.Ошибка,
			ДокСсылка.Метаданные(),
			ДокСсылка,
			ПодробнаяОшибка);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент)
	
	ЕстьПрослеживаемыеТовары = Ложь;
	
	Для Каждого Item Из Контент.Table.Items Цикл
		Если Item.ItemTracingInfos.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТовары = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПризнакиТоваров = ГенерацияXML.Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваровУПД970(ЕстьПрослеживаемыеТовары);
	
	ГенерацияXML.Заполнить_ПризнакиПрослеживаемыхИМаркируемыхТоваровДокументаУПД970(Контент, ПризнакиТоваров);

КонецПроцедуры

//} УПД970. Заполнение протоструктуры по документам. Общее

//} УПД970. Заполнение протоструктуры по документам

//{ УПД970. Исходные данные по документам

Функция УПД970_ИсходныеДанныеДокументаСчетФактураВыданный(ДокСсылка)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный();
	ТекстЗапросаТаблицаТоваров = УПД970_ТекстЗапросаСчетФактура_СоставНФА();
	ТекстЗапросаДанныхОДокументахОплаты = УПД970_ТекстЗапросаСчетФактура_ПлатежноРасчетныеДокументы();
	ТекстЗапросаДанныхДокументовОбОтгрузке = УПД970_ТекстЗапросаСчетФактура_ДокументыОбОтгрузке();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблицаТоваров);
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхОДокументахОплаты);
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхДокументовОбОтгрузке);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТабДанныеШапки = РезультатыЗапроса[0].Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТабДанныеШапки[0]);
	
	ТабличныеДанные = РезультатыЗапроса[1].Выгрузить();
	СведенияОДокументахОплаты = РезультатыЗапроса[2].Выгрузить();
	СведенияОДокументахОтгрузки = РезультатыЗапроса[3].Выгрузить();
	
	ДокументОснование = ДанныеШапки.ДокументОснование;
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваровПоОснованию(
		ДокументОснование
	);
		
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	
	Результат = УПД970_Контракт_ДанныеСчетФактура();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.ДокументыОснования = ЗначениеВМассив(ДанныеШапки.ДокументОснование);
	Результат.СведенияОДокументахОтгрузки = СведенияОДокументахОтгрузки;
	Результат.СведенияОДокументахОплаты = СведенияОДокументахОплаты;
	Результат.ЭтоСчетФактураНаАванс = Ложь;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.ОснованияПередачиТоваров = ОснованияПередачиТоваров;
	Результат.КодВидаОперации = ДанныеШапки.КодВидаОперации;
	Результат.СведенияОбУчастникахЭДО = СведенияОбУчастникахЭДО;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокСсылка, СчетФактура)
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.АктОбОказанииУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаАктОбОказанииУслуг(ДокСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		
		Результат = УПД970_ИсходныеДанныеДокументаНакладнаяНаРеализациюТорг12(ДокСсылка, СчетФактура);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаАктОбОказанииУслуг(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаАктОбОказанииУслуг();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаАктОбОказанииУслуг();
	ТекстЗапросаСведенийПрослеживаемости = Неопределено;
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		СчетФактура,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаСведенийПрослеживаемости
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеДокументаНакладнаяНаРеализациюТорг12(ДокСсылка, СчетФактура = Неопределено)
	
	ТекстЗапросаДанныхШапки = УПД970_ТекстЗапросаДанныхШапкиДокументаНакладнаяНаРеализациюТорг12();
	ТекстЗапросаТабличныхДанных = УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаНакладнаяНаРеализациюТорг12();
	ТекстЗапросаПрослеживаемость = УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаНакладнаяНаРеализациюТорг12();
	
	Результат = УПД970_ИсходныеДанныеПервичногоДокумента(
		ДокСсылка,
		СчетФактура,
		ТекстЗапросаДанныхШапки,
		ТекстЗапросаТабличныхДанных,
		ТекстЗапросаПрослеживаемость
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеПервичногоДокумента(
	ДокСсылка,
	СчетФактура,
	ТекстЗапросаДанныхШапки,
	ТекстЗапросаТабличныхДанных,
	ТекстЗапросаСведенийПрослеживаемости)
	
	ЕстьСведенияПрослеживаемости = ЗначениеЗаполнено(ТекстЗапросаСведенийПрослеживаемости);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаДанныхШапки);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныхДанных);
	
	Если ЕстьСведенияПрослеживаемости Тогда
		ТекстыЗапросов.Добавить(ТекстЗапросаСведенийПрослеживаемости);
	КонецЕсли;
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПоШапке = РезультатыЗапроса[0];
	РезультатЗапросаПоТаблицам = РезультатыЗапроса[1];
	
	Если ЕстьСведенияПрослеживаемости Тогда
		РезультатЗапросаПоПрослеживаемости = РезультатыЗапроса[2];
	Иначе
		РезультатЗапросаПоПрослеживаемости = Неопределено;
	КонецЕсли;
	
	Результат = УПД970_ОбработатьДанныеПервичногоДокумента(
		РезультатЗапросаПоШапке,
		РезультатЗапросаПоТаблицам,
		РезультатЗапросаПоПрослеживаемости,
		СчетФактура
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбработатьДанныеПервичногоДокумента(
	РезультатЗапросаПоШапке,
	РезультатЗапросаПоТаблицам,
	РезультатЗапросаПоПрослеживаемости,
	СчетФактура)
	
	ДанныеШапкиТаблица = РезультатЗапросаПоШапке.Выгрузить();
	ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеШапкиТаблица[0]);
	
	ТабличныеДанные = РезультатЗапросаПоТаблицам.Выгрузить();
	
	Если РезультатЗапросаПоПрослеживаемости = Неопределено Тогда
		СведенияПрослеживаемости = Неопределено;
	Иначе
		СведенияПрослеживаемости = РезультатЗапросаПоПрослеживаемости.Выгрузить();
	КонецЕсли;
	
	ЭтоДоговорСКомитентом = (ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахЭДО(ДанныеШапки);
	
	Если УПД970_ВТабличныхДанныхДокументаНетТоваров(ТабличныеДанные) Тогда
		СведенияОбУчастникахЭДО.Грузоотправитель = Неопределено;
		СведенияОбУчастникахЭДО.Грузополучатель = Неопределено;
	КонецЕсли;
	
	ОснованияПередачиТоваров = УПД970_РеквизитыОснованияПередачиТоваров(
		ДанныеШапки.ДоговорНомер,
		ДанныеШапки.ДоговорДата
	);
	
	Результат = УПД970_Контракт_ДанныеПервичногоДокумента();
	
	Результат.ДанныеШапки = ДанныеШапки;
	Результат.ТабличныеДанные = ТабличныеДанные;
	Результат.СведенияПрослеживаемости = СведенияПрослеживаемости;
	Результат.ЭтоДоговорСКомитентом = ЭтоДоговорСКомитентом;
	Результат.СчетФактура = СчетФактура;
	Результат.СведенияОбУчастникахЭДО = СведенияОбУчастникахЭДО;
	Результат.ОснованияПередачиТоваров = ОснованияПередачиТоваров;
	
	Возврат Результат;
	
КонецФункции

//{ УПД970. Исходные данные по документам. Тексты запросов

Функция УПД970_ТекстЗапросаСчетФактура_ПлатежноРасчетныеДокументы()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежноРасчетныеДокументы.ДатаДокумента КАК ДатаДокумента,
	|	ПлатежноРасчетныеДокументы.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК ПлатежноРасчетныеДокументы
	|ГДЕ
	|	ПлатежноРасчетныеДокументы.Ссылка = &Ссылка
	|	И ПлатежноРасчетныеДокументы.ДатаДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ПлатежноРасчетныеДокументы.НомерДокумента <> """"";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСчетФактура_ДокументыОбОтгрузке()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыОбОтгрузке.НаименованиеДокумента КАК НаименованиеДокумента,
	|	ДокументыОбОтгрузке.НомерДокумента КАК НомерДокумента,
	|	ДокументыОбОтгрузке.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОбОтгрузке КАК ДокументыОбОтгрузке
	|ГДЕ
	|	ДокументыОбОтгрузке.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактура.Ссылка КАК Ссылка,
	|	СчетФактура.Номер КАК Номер,
	|	СчетФактура.Дата КАК Дата,
	|	СчетФактура.КодВидаОперации КАК КодВидаОперации,
	|	СчетФактура.ДокументОснование КАК ДокументОснование,
	|	СчетФактура.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетФактура.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СчетФактура.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	СчетФактура.Договор КАК ДоговорКонтрагента,
	|	СчетФактура.Организация КАК Организация,
	|	СчетФактура.Организация.КПП КАК ОрганизацияКПП,
	|	СчетФактура.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ЛОЖЬ КАК ОбособленноеПодразделение,
	|	"""" КАК ПодразделениеКПП,
	|	"""" КАК ПодразделениеНаименование,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СпрКонтрагенты.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(СпрКонтрагенты.КПП, """") КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА СчетФактура.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		КОГДА СчетФактура.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактура.Организация
	|		ИНАЧЕ СчетФактура.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА СчетФактура.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		КОГДА СчетФактура.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактура.Контрагент
	|		ИНАЧЕ СчетФактура.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетГрузополучателя,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетГрузоотправителя,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	ЕСТЬNULL(СпрДоговоры.ДатаДоговора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДоговорДата,
	|	ЕСТЬNULL(СпрДоговоры.НомерДоговора, """") КАК ДоговорНомер,
	|	ЕСТЬNULL(СпрДоговоры.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка)) КАК ВидДоговора
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК СпрДоговоры
	|		ПО СчетФактура.Договор = СпрДоговоры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК СпрПодразделения
	|		ПО СчетФактура.Подразделение = СпрПодразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрКонтрагенты
	|		ПО СчетФактура.Контрагент = СпрКонтрагенты.Ссылка
	|ГДЕ
	|	СчетФактура.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСчетФактура_СоставНФА()
	
	Результат =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ДанныеШапки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|			ТОГДА ""Услуга""
	|		КОГДА ТИПЗНАЧЕНИЯ(ТабСоставНФА.НФА) = ТИП(СТРОКА)
	|			ТОГДА ""Имущество""
	|		КОГДА ТабСоставНФА.НФА ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ""Имущество""
	|		КОГДА ТабСоставНФА.НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ""Работа""
	|		КОГДА ТабСоставНФА.НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ ТабСоставНФА.НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.УслугиАренды)
	|				ИЛИ ТабСоставНФА.НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Госуслуга)
	|				ИЛИ ТабСоставНФА.НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ГруппаУслуг)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	1 КАК Порядок,
	|	ТабСоставНФА.НФА КАК Товар,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ТабСоставНФА.СодержаниеУслуги КАК СТРОКА(1000))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(ТабСоставНФА.СодержаниеУслуги КАК СТРОКА(1000))
	|		КОГДА ТабСоставНФА.НФА ССЫЛКА Справочник.Номенклатура
	|				И (ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000))) <> """"
	|			ТОГДА СпрНоменклатура.НаименованиеПолное
	|		КОГДА ТабСоставНФА.НФА ССЫЛКА Справочник.Номенклатура
	|				И (ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000))) <> """"
	|			ТОГДА СпрНоменклатура.Наименование
	|		КОГДА ТабСоставНФА.НФА ССЫЛКА Справочник.ОсновныеСредства
	|				И (ВЫРАЗИТЬ(ОсновныеСредства.НаименованиеПолное КАК СТРОКА(1000))) <> """"
	|			ТОГДА ОсновныеСредства.НаименованиеПолное
	|		КОГДА ТабСоставНФА.НФА ССЫЛКА Справочник.ОсновныеСредства
	|				И (ВЫРАЗИТЬ(ОсновныеСредства.Наименование КАК СТРОКА(1000))) <> """"
	|			ТОГДА ОсновныеСредства.Наименование
	|		ИНАЧЕ ТабСоставНФА.НФА
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА ТабСоставНФА.НФА ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ОсновныеСредства.Код
	|		КОГДА ТИПЗНАЧЕНИЯ(ТабСоставНФА.НФА) = ТИП(СТРОКА)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СпрНоменклатура.Код
	|	КОНЕЦ КАК КодИлиАртикулНоменклатуры,
	|	СтраныМира.Ссылка КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СтраныМира.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(СтраныМира.УчастникЕАЭС, ИСТИНА) КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТабСоставНФА.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕИ.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕИ.Код, """") КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТабСоставНФА.Количество КАК Количество,
	|	ТабСоставНФА.Цена КАК Цена,
	|	ТабСоставНФА.СтавкаНДС КАК СтавкаНДС,
	|	ТабСоставНФА.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|			ТОГДА 0
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабСоставНФА.Сумма - ТабСоставНФА.СуммаНДС
	|		ИНАЧЕ ТабСоставНФА.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТабСоставНФА.Сумма + ТабСоставНФА.СуммаНДС
	|		ИНАЧЕ ТабСоставНФА.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	ТабСоставНФА.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТабСоставНФА.НФА) = ТИП(СТРОКА)
	|			ТОГДА """"
	|		КОГДА ТабСоставНФА.НФА ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ОсновныеСредства.КодТНВЭД
	|		ИНАЧЕ СпрНоменклатура.КодТНВЭД
	|	КОНЕЦ КАК НоменклатураТНВЭД,
	|	ТабСоставНФА.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТабСоставНФА.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.СоставНФА КАК ТабСоставНФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ДанныеШапки
	|		ПО ТабСоставНФА.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабСоставНФА.НФА = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО ТабСоставНФА.НФА = ОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕИ
	|		ПО ТабСоставНФА.ЕдиницаИзмерения = КлассификаторЕИ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = СтраныМира.Ссылка
	|				ИЛИ ОсновныеСредства.СтранаПроисхождения = СтраныМира.Ссылка)
	|ГДЕ
	|	ТабСоставНФА.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаАктОбОказанииУслуг()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ЛОЖЬ КАК ОбособленноеПодразделение,
	|	"""" КАК ПодразделениеКПП,
	|	"""" КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СпрКонтрагенты.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(СпрКонтрагенты.КПП, """") КАК КонтрагентКПП,
	|	ЕСТЬNULL(СпрПодразделения.ЦифровойИндекс, """") КАК ЦифровойИндексОП,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.РеквизитыЛицевогоСчета КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.РасчетныйСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетГрузополучателя,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетГрузоотправителя,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(СпрДоговоры.ДатаДоговора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДоговорДата,
	|	ЕСТЬNULL(СпрДоговоры.НомерДоговора, """") КАК ДоговорНомер,
	|	ЕСТЬNULL(СпрДоговоры.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка)) КАК ВидДоговора
	|ИЗ
	|	Документ.АктОбОказанииУслуг КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК СпрДоговоры
	|		ПО ДанныеШапки.Договор = СпрДоговоры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК СпрПодразделения
	|		ПО ДанныеШапки.Подразделение = СпрПодразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрКонтрагенты
	|		ПО ДанныеШапки.Контрагент = СпрКонтрагенты.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаАктОбОказанииУслуг()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТчУслуги.Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ""Работа""
	|		ИНАЧЕ ""Услуга""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	1 КАК Порядок,
	|	ТчУслуги.Номенклатура КАК Товар,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ТчУслуги.СодержаниеУслуги КАК СТРОКА(1000)) <> """"
	|			ТОГДА ВЫРАЗИТЬ(ТчУслуги.СодержаниеУслуги КАК СТРОКА(1000))
	|		КОГДА ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) <> """"
	|			ТОГДА ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) 
	|		ИНАЧЕ СпрНоменклатура.Наименование
	|	КОНЕЦ КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК КодИлиАртикулНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ИСТИНА КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ВЫБОР
	|		КОГДА ТчУслуги.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТчУслуги.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчУслуги.ЕдиницаИзмерения.НаименованиеПолное
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.НаименованиеПолное
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ТчУслуги.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТчУслуги.ЕдиницаИзмерения.Код
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТчУслуги.Количество КАК Количество,
	|	ТчУслуги.Цена КАК Цена,
	|	ТчУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТчУслуги.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчУслуги.Сумма - ТчУслуги.СуммаНДС
	|		ИНАЧЕ ТчУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчУслуги.Сумма + ТчУслуги.СуммаНДС
	|		ИНАЧЕ ТчУслуги.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	ТчУслуги.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	"""" КАК ИдентификаторСтроки,
	|	ТчУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктОбОказанииУслуг.УслугиОказанные КАК ТчУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктОбОказанииУслуг КАК ДанныеШапки
	|		ПО ТчУслуги.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчУслуги.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ТчУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиДокументаНакладнаяНаРеализациюТорг12()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Номер КАК Номер,
	|	ДанныеШапки.Дата КАК Дата,
	|	ДанныеШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеШапки.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ДанныеШапки.ВалютаДокумента.НаименованиеПолное КАК ВалютаДокументаНаименование,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Организация.КПП КАК ОрганизацияКПП,
	|	ДанныеШапки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ЛОЖЬ КАК ОбособленноеПодразделение,
	|	"""" КАК ПодразделениеКПП,
	|	"""" КАК ПодразделениеНаименование,
	|	ДанныеШапки.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(СпрКонтрагенты.ГоловнаяОрганизация, НЕОПРЕДЕЛЕНО) КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(СпрКонтрагенты.КПП, """") КАК КонтрагентКПП,
	|	ЕСТЬNULL(СпрПодразделения.ЦифровойИндекс, """") КАК ЦифровойИндексОП,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Организация
	|		ИНАЧЕ ДанныеШапки.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ДанныеШапки.Контрагент
	|		ИНАЧЕ ДанныеШапки.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ДанныеШапки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеШапки.РеквизитыЛицевогоСчета КАК БанковскийСчетОрганизации,
	|	ДанныеШапки.РасчетныйСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ДанныеШапки.РасчетныйСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	ДанныеШапки.РасчетныйСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	ДанныеШапки.Договор КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(СпрДоговоры.ДатаДоговора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДоговорДата,
	|	ЕСТЬNULL(СпрДоговоры.НомерДоговора, """") КАК ДоговорНомер,
	|	ЕСТЬNULL(СпрДоговоры.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка)) КАК ВидДоговора
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12 КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК СпрДоговоры
	|		ПО ДанныеШапки.Договор = СпрДоговоры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК СпрПодразделения
	|		ПО ДанныеШапки.Подразделение = СпрПодразделения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрКонтрагенты
	|		ПО ДанныеШапки.Контрагент = СпрКонтрагенты.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейДокументаНакладнаяНаРеализациюТорг12()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТчНоменклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ""Работа""
	|		КОГДА ТчНоменклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ ТчНоменклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.УслугиАренды)
	|				ИЛИ ТчНоменклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Госуслуга)
	|				ИЛИ ТчНоменклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ГруппаУслуг)
	|			ТОГДА ""Услуга""
	|		ИНАЧЕ ""Товар""
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	1 КАК Порядок,
	|	ТчНоменклатура.Номенклатура КАК Товар,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ СпрНоменклатура.Наименование
	|	КОНЕЦ КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК КодИлиАртикулНоменклатуры,
	|	ТчНоменклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЕСТЬNULL(СтраныМира.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(СтраныМира.УчастникЕАЭС, ИСТИНА) КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕИ.НаименованиеПолное, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕИ.Код, """") КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	ТчНоменклатура.Количество КАК Количество,
	|	ТчНоменклатура.Цена КАК Цена,
	|	ТчНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	ТчНоменклатура.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчНоменклатура.Сумма - ТчНоменклатура.СуммаНДС
	|		ИНАЧЕ ТчНоменклатура.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеШапки.СуммаВключаетНДС
	|			ТОГДА ТчНоменклатура.Сумма + ТчНоменклатура.СуммаНДС
	|		ИНАЧЕ ТчНоменклатура.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	ТчНоменклатура.НомерСтроки КАК НомерСтроки,
	|	ТчНоменклатура.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	СпрНоменклатура.КодТНВЭД КАК НоменклатураТНВЭД,
	|	ТчНоменклатура.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12.Номенклатура КАК ТчНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НакладнаяНаРеализациюТорг12 КАК ДанныеШапки
	|		ПО ТчНоменклатура.Ссылка = ДанныеШапки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТчНоменклатура.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕИ
	|		ПО (СпрНоменклатура.ЕдиницаИзмерения = КлассификаторЕИ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО ТчНоменклатура.СтранаПроисхождения = СтраныМира.Ссылка
	|ГДЕ
	|	ТчНоменклатура.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВозвратнаяТара"",
	|	2,
	|	ВозвратнаяТара.Номенклатура,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ СпрНоменклатура.Наименование
	|	КОНЕЦ,
	|	СпрНоменклатура.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ИСТИНА,
	|	СпрНоменклатура.ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕИ.НаименованиеПолное, """"),
	|	ЕСТЬNULL(КлассификаторЕИ.Код, """"),
	|	"""",
	|	ВозвратнаяТара.Количество,
	|	ОКР(ВозвратнаяТара.Сумма / ВозвратнаяТара.Количество, 2),
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
	|	0,
	|	ВозвратнаяТара.Сумма,
	|	ВозвратнаяТара.Сумма,
	|	ВозвратнаяТара.НомерСтроки,
	|	ЛОЖЬ,
	|	СпрНоменклатура.КодТНВЭД,
	|	ВозвратнаяТара.НомерСтроки,
	|	ВозвратнаяТара.Ссылка
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12.ВозвратнаяТара КАК ВозвратнаяТара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕИ
	|		ПО (СпрНоменклатура.ЕдиницаИзмерения = КлассификаторЕИ.Ссылка)
	|ГДЕ
	|	ВозвратнаяТара.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиДокументаНакладнаяНаРеализациюТорг12()
	
	Результат =
	"ВЫБРАТЬ
	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СведенияПрослеживаемости.Количество КАК Количество,
	|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НомераГТД.Код КАК НомерРНПТ,
	|	""Прослеж"" КАК НомерГТД
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12.СведенияПрослеживаемости КАК СведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
	|
	|ГДЕ
	|	СведенияПрослеживаемости.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Исходные данные по документам. Тексты запросов

//} УПД970. Исходные данные по документам

//{ УПД970. Служебные процедуры и функции

Функция УПД970_ОбстоятельстваФормированияДокумента(ДанныеПоДокументу, ФункцияДокумента)
	
	Результат = Неопределено;
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		Результат = УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу);
		
	Иначе
		
		Результат = УПД970_ОбстоятельстваФормированияУПД(ДанныеПоДокументу);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияУПД(ДанныеПоДокументу)
	
	Результат = Неопределено;
	
	Если ДанныеПоДокументу.ЭтоДоговорСКомитентом Тогда
		Результат = "00007";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОбстоятельстваФормированияСчетФактуры(ДанныеПоДокументу)
	
	Если ДанныеПоДокументу.КодВидаОперации = "01" И ДанныеПоДокументу.ЭтоДоговорСКомитентом Тогда
		Результат = "1";
	ИначеЕсли ДанныеПоДокументу.КодВидаОперации = "02" Тогда
		Результат = "2";
	ИначеЕсли ДанныеПоДокументу.КодВидаОперации = "27" Тогда
		Результат = "3";
	ИначеЕсли ДанныеПоДокументу.КодВидаОперации = "06" Тогда
		Результат = "4";
	ИначеЕсли ДанныеПоДокументу.КодВидаОперации = "34"
		Или (ДанныеПоДокументу.КодВидаОперации = "33" И ДанныеПоДокументу.ЭтоСчетФактураНаАванс) Тогда
		Результат = "5";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияПередачиТоваровПоОснованию(СсылкаНаОбъект)
	
	Результат = Новый Массив;
	
	ЕстьРеквизитДоговор = ЗначениеЗаполнено(СсылкаНаОбъект) 
		И Ядро.Общее_ЕстьРеквизитМетаданных(СсылкаНаОбъект.Метаданные(), "Договор");
		
	Если Не ЕстьРеквизитДоговор Тогда
		Возврат Результат;
	КонецЕсли;
	
	РеквизитыДокумента = "Договор.НомерДоговора, Договор.ДатаДоговора";
	
	ЗначенияРеквизитовДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, РеквизитыДокумента);
	
	Результат = УПД970_РеквизитыОснованияПередачиТоваров(
		ЗначенияРеквизитовДокумента.ДоговорНомерДоговора,
		ЗначенияРеквизитовДокумента.ДоговорДатаДоговора
	);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияПередачиТоваров(НомерДоговора, ДатаДоговора)
	
	Результат = Новый Массив;
	
	РеквизитыОснования = Новый Структура;
	РеквизитыОснования.Вставить("Наименование", "Договор");
	РеквизитыОснования.Вставить("Номер", НомерДоговора);
	РеквизитыОснования.Вставить("Дата", ДатаДоговора);
	
	Результат.Добавить(РеквизитыОснования);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбУчастникахЭДО(ДанныеШапки)
	
	ЭтоОПНаОтдельномБалансе = УПД970_ЭтоОПНаОтдельномБалансе(ДанныеШапки.Организация, ДанныеШапки.ГоловнаяОрганизация);
	ЭтоОПНаОбщемБалансе = ДанныеШапки.ОбособленноеПодразделение;
	
	СведенияОбОрганизации = УПД970_СведенияОбОрганизации(ДанныеШапки, ЭтоОПНаОтдельномБалансе, ЭтоОПНаОбщемБалансе);
	
	СведенияОКонтрагенте = УПД970_СведенияОКонтрагенте(ДанныеШапки);
	
	СведенияОГрузоотправителе = УПД970_СведенияОГрузоотправителе(
		ДанныеШапки,
		ЭтоОПНаОтдельномБалансе,
		ЭтоОПНаОбщемБалансе
	);
	
	СведенияОГрузополучателе = УПД970_СведенияОГрузополучателе(ДанныеШапки);
	
	Результат = УПД970_Контракт_УчастникиЭДО();
	Результат.Организация = СведенияОбОрганизации;
	Результат.Контрагент = СведенияОКонтрагенте;
	Результат.Грузоотправитель = СведенияОГрузоотправителе;
	Результат.Грузополучатель = СведенияОГрузополучателе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбОрганизации(ДанныеШапки, ЭтоОПНаОтдельномБалансе, ЭтоОПНаОбщемБалансе)
	
	Если ЭтоОПНаОтдельномБалансе Тогда
		Организация = ДанныеШапки.ГоловнаяОрганизация;
	Иначе
		Организация = ДанныеШапки.Организация;
	КонецЕсли;
	
	Результат = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Организация,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетОрганизации
	);
	
	Если ЭтоОПНаОтдельномБалансе Тогда
		
		КПППродавца = ДанныеШапки.ОрганизацияКПП;
		
		Если НЕ ЗначениеЗаполнено(ДанныеШапки.БанковскийСчетОрганизации) Тогда
			УПД970_ЗаполнитьДанныеБанка(Результат, ДанныеШапки.Организация, Неопределено);
		КонецЕсли;
		
	ИначеЕсли ЭтоОПНаОбщемБалансе Тогда
		КПППродавца = ДанныеШапки.ПодразделениеКПП;
	Иначе
		КПППродавца = Результат.КПП;
	КонецЕсли;
	
	Результат.КПП = КПППродавца;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОКонтрагенте(ДанныеШапки)
	
	Если ЗначениеЗаполнено(ДанныеШапки.ГоловнойКонтрагент) Тогда
		Контрагент = ДанныеШапки.ГоловнойКонтрагент;
	Иначе
		Контрагент = ДанныеШапки.Контрагент;
	КонецЕсли;
	
	Результат = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Контрагент,
		ДанныеШапки.Дата,
		ДанныеШапки.БанковскийСчетКонтрагента
	);
	
	Если ЗначениеЗаполнено(ДанныеШапки.ГоловнойКонтрагент) Тогда
		Результат.КПП = ДанныеШапки.КонтрагентКПП;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОГрузоотправителе(ДанныеШапки, ЭтоОПНаОтдельномБалансе, ЭтоОПНаОбщемБалансе)
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
		
		Результат = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузоотправитель,
			ДанныеШапки.Дата,
			ДанныеШапки.БанковскийСчетГрузоотправителя
		);
		
	ИначеЕсли ЭтоОПНаОтдельномБалансе Тогда
		
		Результат = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Организация,
			ДанныеШапки.Дата,
			ДанныеШапки.БанковскийСчетОрганизации
		);
		
	ИначеЕсли ЭтоОПНаОбщемБалансе Тогда
		
		Результат = УПД970_ДанныеУчастникаЭДО(ДанныеШапки.Организация, ДанныеШапки.Дата);
		
		Результат.Ссылка = ДанныеШапки.Подразделение;
		Результат.Адрес = УПД970_СведенияОФактическомАдресе(ДанныеШапки.Подразделение, ДанныеШапки.Дата, Истина);
		Результат.Наименование = ДанныеШапки.ПодразделениеНаименование;
		Результат.КПП = ДанныеШапки.ПодразделениеКПП;
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОГрузополучателе(ДанныеШапки)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		
		Результат = УПД970_ДанныеУчастникаЭДОсФактАдресом(
			ДанныеШапки.Грузополучатель,
			ДанныеШапки.Дата,
			ДанныеШапки.БанковскийСчетГрузополучателя
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЭтоОПНаОтдельномБалансе(Организация, ГоловнаяОрганизация)
	
	Если ЗначениеЗаполнено(ГоловнаяОрганизация)
		И Организация <> ГоловнаяОрганизация Тогда
		
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсЮрАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений, Результат.ЭтоЮрЛицо);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсФактАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений, Результат.ЭтоЮрЛицо);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_Контракт_ДанныеУчастникаЭДО();
	
	СведенияОЮрФизЛице = Новый Структура;
	
	МодульЭлектронныеДокументы = ОбщегоНазначения.ОбщийМодуль("ЭлектронныеДокументыБГУ");
	МодульЭлектронныеДокументы.ПолучитьДанныеЮрФизЛица(Ссылка, СведенияОЮрФизЛице, ДатаСведений);
	
	Результат.Ссылка = Ссылка;
	Результат.Наименование = УПД970_НаименованиеУчастникаЭДО(СведенияОЮрФизЛице);
	Результат.ИНН = СведенияОЮрФизЛице.ИНН;
	Результат.КПП = СведенияОЮрФизЛице.КПП;
	Результат.КодПоОКПО = СведенияОЮрФизЛице.КодПоОКПО;
	Результат.Телефоны = СведенияОЮрФизЛице.Телефоны;
	Результат.ЭлектроннаяПочта = СведенияОЮрФизЛице.ЭлектроннаяПочта;
	Результат.ЭтоЮрЛицо = (СведенияОЮрФизЛице.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо);
	Результат.ЭтоФизЛицо = (СведенияОЮрФизЛице.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо);
	
	УПД970_ЗаполнитьДанныеБанка(Результат, Ссылка, БанковскийСчет);
	
	Если СведенияОЮрФизЛице.ИП Тогда
		
		ДатаОГРНИП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЮридическоеФизическоеЛицо.ДатаРегистрации");
		
		Результат.ОГРНИП = СведенияОЮрФизЛице.ОГРНИП;
		Результат.ДатаОГРНИП = ДатаОГРНИП;
		Результат.ЭтоФизЛицо = Ложь;
		
		СвидетельствоДатаВыдачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Ссылка,
			"ЮридическоеФизическоеЛицо.СвидетельствоДата"
		);
		
		Результат.Свидетельство = УПД970_СвидетельствоОГосРегистрации(
			СведенияОЮрФизЛице.СвидетельствоСерияНомер,
			СвидетельствоДатаВыдачи
		);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОЮрФизЛице.СтранаРегистрации) Тогда
		ДанныеСтраны = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СведенияОЮрФизЛице.СтранаРегистрации, "Код, Наименование");
		
		Результат.СтранаКод = ДанныеСтраны.Код;
		Результат.СтранаНаименование = ДанныеСтраны.Наименование;
	Иначе
		Результат.СтранаКод = ОсновнаяСтрана().Код;
		Результат.СтранаНаименование = ОсновнаяСтрана().Наименование;
	КонецЕсли;
	
	Результат.Нерезидент = (Результат.СтранаКод <> ОсновнаяСтрана().Код);
	
	Если Результат.Нерезидент Тогда
		Результат.НалоговыйНомерВСтранеРегистрации = СведенияОЮрФизЛице.НалоговыйНомерВСтранеРегистрации;
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиОрганизации(Результат, Ссылка, СведенияОЮрФизЛице);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НаименованиеУчастникаЭДО(СведенияОЮрФизЛице)
	
	Результат = СведенияОЮрФизЛице.ПолноеНаименование;
	
	Если СведенияОЮрФизЛице.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		ФИОУчастникаЭДО = Новый Массив;
		ФИОУчастникаЭДО.Добавить(СведенияОЮрФизЛице.Фамилия);
		ФИОУчастникаЭДО.Добавить(СведенияОЮрФизЛице.Имя);
		ФИОУчастникаЭДО.Добавить(СведенияОЮрФизЛице.Отчество);
		
		РазделительФИО = " ";
		Результат = СтрСоединить(ФИОУчастникаЭДО, РазделительФИО);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьДанныеБанка(Результат, ЮрФизЛицо, БанковскийСчет)
	
	БанковскийСчетЮрФизЛица = БанковскийСчет;
	
	Если НЕ ЗначениеЗаполнено(БанковскийСчетЮрФизЛица) Тогда
		БанковскийСчетЮрФизЛица = УПД970_БанковскийСчетПоУмолчанию(ЮрФизЛицо);
	КонецЕсли;
	
	РеквизитыРасчетногоСчета = БанковскиеРеквизитыРасчетногоСчета(БанковскийСчетЮрФизЛица);
	
	Результат.НаименованиеБанка = РеквизитыРасчетногоСчета.НаименованиеБанкаПолучателя;
	Результат.НомерСчета = РеквизитыРасчетногоСчета.НомерСчетаПолучателя;
	Результат.БИК = РеквизитыРасчетногоСчета.БикБанкаПолучателя;
	Результат.КоррСчет = РеквизитыРасчетногоСчета.СчетБанкаПолучателя;
	
КонецПроцедуры

Функция УПД970_БанковскийСчетПоУмолчанию(ЮрФизЛицо)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ЮрФизЛицо);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеИКазначейскиеСчета.Ссылка КАК Ссылка,
	|	БанковскиеИКазначейскиеСчета.Код КАК НомерСчета
	|ИЗ
	|	Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеИКазначейскиеСчета
	|ГДЕ
	|	БанковскиеИКазначейскиеСчета.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыЛицевыхСчетов.Ссылка,
	|	РеквизитыЛицевыхСчетов.Владелец.Код
	|ИЗ
	|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|ГДЕ
	|	РеквизитыЛицевыхСчетов.Владелец.Владелец = &Владелец";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			Результат = Справочники.БанковскиеИКазначейскиеСчета.ПустаяСсылка();
		Иначе
			Результат = Справочники.ЛицевыеСчета.ПустаяСсылка();
		КонецЕсли;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиОрганизации(Результат, Ссылка, СведенияОЮрФизЛице)
	
	ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Ссылка,
		"ИспользоватьВПлатежныхДокументахСокращенноеНаименование, СвидетельствоСерияНомер, СвидетельствоДатаВыдачи"
	);
	
	Если ДанныеОрганизации.ИспользоватьВПлатежныхДокументахСокращенноеНаименование Тогда
		Результат.Наименование = СведенияОЮрФизЛице.СокращенноеНаименование;
	КонецЕсли;
	
	Результат.Свидетельство = УПД970_СвидетельствоОГосРегистрации(
		ДанныеОрганизации.СвидетельствоСерияНомер,
		ДанныеОрганизации.СвидетельствоДатаВыдачи
	);
	
КонецПроцедуры

Функция УПД970_СвидетельствоОГосРегистрации(СвидетельствоСерияНомер, СвидетельствоДатаВыдачи)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СвидетельствоСерияНомер) Тогда
		Результат = "свидетельство " + СвидетельствоСерияНомер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвидетельствоДатаВыдачи) Тогда
		Результат = Результат + " от " + Формат(СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбЮридическомАдресе(Ссылка, ДатаСведений, ЭтоЮрЛицо)
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	Результат = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ЮридическийАдрес, ДатаСведений, ЭтоЮрЛицо);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОФактическомАдресе(Ссылка, ДатаСведений, ЭтоЮрЛицо)
	
	ВидыКИ = Перечисление_ВидыКонтактнойИнформации();
	
	Результат = УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидыКИ.ФактическийАдрес, ДатаСведений, ЭтоЮрЛицо);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресИзКонтактнойИнформации(Ссылка, ВидАдреса, ДатаСведений, ЭтоЮрЛицо)
	
	Результат = Неопределено;
	
	ВидКИ = ВидАдресаЮрФизЛица(Ссылка, ВидАдреса, ЭтоЮрЛицо);
	ТолькоПредставлениеКИ = Ложь;
	
	МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	
	КонтактнаяИнформация = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Ссылка,
		ВидКИ,
		ДатаСведений,
		ТолькоПредставлениеКИ
	);
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
		
		АдресСтрокойJSON = КонтактнаяИнформация[0].Значение;
		
		Результат = СведенияОбАдресеЛок(АдресСтрокойJSON);
		
		СохраненноеПредставление = ПредставлениеАдреса(АдресСтрокойJSON);
		Результат.Вставить("СохраненноеПредставление", СохраненноеПредставление);
		
		ЭтоАдминистративноТерриториальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressRF(Результат);
		
		ЭтоМуниципальныйАдрес = Ложь;
		Если Не ЭтоАдминистративноТерриториальныйАдрес Тогда
			ЭтоМуниципальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressSAR(Результат);
		КонецЕсли;
		
		Если Не ЭтоМуниципальныйАдрес
			И Не ЭтоАдминистративноТерриториальныйАдрес Тогда
			
			Результат.Представление = Результат.СохраненноеПредставление;
			Результат.ТипАдреса = ТипАдресаВСвободнойФорме();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressRF(СведенияОбАдресе)
	
	Результат = Ложь;
	
	Если Не ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	
	ПомещенияНеЗаполнены = (СведенияОбАдресе.Помещения.Количество() = 0);
	ТипПомещенияСоответствуетАдрРФ = (СведенияОбАдресе.Помещения.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Помещения[0].ТипПомещения) = ВРЕГ(ТипПомещенияАдрРФ()));
		
	ПомещенияСоответствуютАдрРФ = (ПомещенияНеЗаполнены Или ТипПомещенияСоответствуетАдрРФ);
	
	КорпусаНеЗаполнены = (СведенияОбАдресе.Корпуса.Количество() = 0);
	ТипКорпусаСоответствуетАдрРФ = (СведенияОбАдресе.Корпуса.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Корпуса[0].ТипКорпуса) = ВРЕГ(ТипКорпусаАдрРФ()));
		
	КорпусаСоответствуютАдрРФ = (КорпусаНеЗаполнены Или ТипКорпусаСоответствуетАдрРФ);
		
	ТипЗданияСоответствуетАдрРФ = Не ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания)
		Или ВРЕГ(СведенияОбАдресе.Здание.ТипЗдания) = ВРЕГ(ТипЗданияАдрРФ());
		
	ЕстьНесоответствующиеСтруктуреАдрРФПоля = ЕстьНесоответствующиеСтруктуреАдрРФПоля(СведенияОбАдресе);
		
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	ПредставленияАдресаСовпадают = (ПредставлениеАдреса = СведенияОбАдресе.СохраненноеПредставление);
	
	Результат = ЕстьКодРегиона
		И ПомещенияСоответствуютАдрРФ
		И КорпусаСоответствуютАдрРФ
		И ТипЗданияСоответствуетАдрРФ
		И ПредставленияАдресаСовпадают
		И Не ЕстьНесоответствующиеСтруктуреАдрРФПоля;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressSAR(СведенияОбАдресе)
	
	Результат = Ложь;
	
	Если Не ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	ЕстьНаименованиеМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.МуниципальныйРайон);
	
	ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.КодМуниципальногоРайона);
	Если Не ЕстьКодМуниципальногоРайона Тогда
		КодМуниципальногоРайона = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
		ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(КодМуниципальногоРайона);
	КонецЕсли;
	
	ЕстьИдентификаторАдресногоОбъекта = ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторАдресногоОбъекта);
	
	ЕстьНесколькоТиповПомещений = УПД970_АдресСодержитНесколькоТиповПомещений(СведенияОбАдресе);
	ЕстьНесколькоТиповАпартаментов = УПД970_АдресСодержитНесколькоТиповАпартаментов(СведенияОбАдресе);
	
	МуниципальноеПредставление = СвойствоСтруктурыЛок(СведенияОбАдресе, "МуниципальноеПредставление");
	ПредставленияАдресаСовпадают = (МуниципальноеПредставление = СведенияОбАдресе.СохраненноеПредставление);
	
	Результат = ЕстьКодРегиона
		И ЕстьНаименованиеМуниципальногоРайона
		И ЕстьКодМуниципальногоРайона
		И ЕстьИдентификаторАдресногоОбъекта
		И ПредставленияАдресаСовпадают
		И Не ЕстьНесколькоТиповПомещений
		И Не ЕстьНесколькоТиповАпартаментов;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповПомещений(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	
	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		Если ТипыПомещенийЗдания.Найти(Элемент.ТипПомещения) <> Неопределено Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповАпартаментов(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	
	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		ТипПомещения = Элемент.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		ЭтоНеклассифицированноеПомещениеКвартиры = (Не ЭтоПомещениеЗдания И Не ЭтоПомещениеКвартиры);
		
		Если ЭтоПомещениеКвартиры Или ЭтоНеклассифицированноеПомещениеКвартиры Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипНоменклатурыТовар()
	Возврат "Товар";
КонецФункции

Функция УПД970_ТипНоменклатурыУслуга()
	Возврат "Услуга";
КонецФункции

Функция УПД970_ТипНоменклатурыРабота()
	Возврат "Работа";
КонецФункции

Функция УПД970_ТипНоменклатурыВозвратнаяТара()
	Возврат "ВозвратнаяТара";
КонецФункции

Функция УПД970_ДокументыОтгрузки(ИсходныеДокументы)
	
	Результат = Новый Массив;
	
	Для Каждого ИсходныйДокумент Из ИсходныеДокументы Цикл
		
		ДокументОтгрузки = УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент);
		
		Результат.Добавить(ДокументОтгрузки);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент)
	
	Если ЗначениеЗаполнено(ИсходныйДокумент)
		И ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		
		РеквизитыКорректировки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ИсходныйДокумент,
			"ЭтоКорректировка, ДокументОснование"
		);
		
		Если РеквизитыКорректировки.ЭтоКорректировка
			И ТипЗнч(РеквизитыКорректировки.ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
			
			Результат = УПД970_ИсправляемыйДокументОтгрузки(РеквизитыКорректировки.ДокументОснование);
			
		Иначе
			Результат = ИсходныйДокумент;
		КонецЕсли;
		
	Иначе
		
		Результат = ИсходныйДокумент;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция УПД970_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФДОП() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьТовары(СтрокиТаблицы)
	
	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы)
	
	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВТабличныхДанныхДокументаНетТоваров(ТабличныеДанные)
	
	ОтборСтрок = Новый Структура("ТипНоменклатуры", УПД970_ТипНоменклатурыТовар());
	СтрокиСТоварами = ТабличныеДанные.НайтиСтроки(ОтборСтрок);
	
	Результат = (СтрокиСТоварами.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО)
	
	ВидыЮрФизЛиц = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	ЭтоРезидент = НЕ ДанныеУчастникаЭДО.Нерезидент;
	
	Если НЕ ДанныеУчастникаЭДО.ЭтоЮрЛицо
		И НЕ ДанныеУчастникаЭДО.ЭтоФизЛицо
		И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИндивидуальныйПредприниматель;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо И ЭтоРезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ЮридическоеЛицо;
		
	ИначеЕсли НЕ ДанныеУчастникаЭДО.ЭтоЮрЛицо И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностранныйГражданин;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоЮрЛицо
		И ДанныеУчастникаЭДО.Нерезидент Тогда
		
		Результат = ВидыЮрФизЛиц.ИностраннаяОрганизация;
		
	ИначеЕсли ДанныеУчастникаЭДО.ЭтоФизЛицо Тогда
		
		Результат = ВидыЮрФизЛиц.ФизическоеЛицо;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Не удалось определить тип участника ЭДО.
				|Заполните корректные реквизиты участников ЭДО в базе 1С 
				|(организация, грузоотправитель, контрагент, грузополучатель)'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЦенаБезНДС(Item, ЦенаИзДокумента, Разрядность)
	
	ДопустимоеОтклонение = 0.03;
	
	Если Item.Quantity = 0 Тогда
		
		Результат = 0;
		
	Иначе
		
		Результат = Окр(Item.SubtotalWithVatExcluded / Item.Quantity, Разрядность);
		ОтклонениеВЦене = (Результат - ЦенаИзДокумента) * Item.Quantity;
		
		ОтклонениеВЦенеПоМодулю = Макс(ОтклонениеВЦене, -ОтклонениеВЦене);
		
		Если ОтклонениеВЦенеПоМодулю <= ДопустимоеОтклонение Тогда
			Результат = Окр(ЦенаИзДокумента, Разрядность);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования)
	
	ОбязательныеРеквизитыЗаполнены = (РеквизитыОснования <> Неопределено
		И ЗначениеЗаполнено(РеквизитыОснования.Наименование)
		И ЗначениеЗаполнено(РеквизитыОснования.Номер)
		И ЗначениеЗаполнено(РеквизитыОснования.Дата));
	
	Возврат ОбязательныеРеквизитыЗаполнены;
	
КонецФункции

Функция УПД970_Контракт_ДанныеПервичногоДокумента()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("СведенияПрослеживаемости");
	
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("СчетФактура");
	Результат.Вставить("СведенияОбУчастникахЭДО");
	Результат.Вставить("ОснованияПередачиТоваров");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеСчетФактура()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеШапки");
	Результат.Вставить("ТабличныеДанные");
	Результат.Вставить("ДокументыОснования");
	Результат.Вставить("СведенияОДокументахОтгрузки");
	Результат.Вставить("СведенияОДокументахОплаты");
	Результат.Вставить("СведенияОбУчастникахЭДО");
	
	Результат.Вставить("ЭтоСчетФактураНаАванс");
	Результат.Вставить("ЭтоДоговорСКомитентом");
	Результат.Вставить("КодВидаОперации");
	Результат.Вставить("ОснованияПередачиТоваров");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_УчастникиЭДО()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Грузоотправитель");
	Результат.Вставить("Грузополучатель");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_ДанныеУчастникаЭДО()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("Наименование");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("ЭтоЮрЛицо");
	Результат.Вставить("ЭтоФизЛицо");
	Результат.Вставить("КодПоОКПО");
	Результат.Вставить("ОГРНИП");
	Результат.Вставить("ДатаОГРНИП");
	Результат.Вставить("Телефоны");
	Результат.Вставить("ЭлектроннаяПочта");
	Результат.Вставить("СтранаНаименование");
	Результат.Вставить("СтранаКод");
	Результат.Вставить("Нерезидент");
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации");
	Результат.Вставить("Свидетельство");
	Результат.Вставить("НаименованиеБанка");
	Результат.Вставить("НомерСчета");
	Результат.Вставить("КоррСчет");
	Результат.Вставить("БИК");
	Результат.Вставить("Адрес");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеНомера(НомерДокумента, ДокСсылка)
	
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДокСсылка));
	
	МодульФункцииОбменаПовтИсп = ОбщийМодульПоИмениЛок("БиблиотекаФункцийОбменаПовтИсп");
	УдалитьПрефиксИБ = МодульФункцииОбменаПовтИсп.ПолучитьЗначениеНастройкиПечатиПрефиксаНомераИдентификатораОбъектаМетаданных(ИдентификаторОбъекта);
	
	Если УдалитьПрефиксИБ Тогда
		
		УдалитьПользовательскийПрефикс = Ложь;
		
		МодульПрефиксацияОбъектов = ОбщийМодульПоИмениЛок("ПрефиксацияОбъектовКлиентСервер");
		Результат = МодульПрефиксацияОбъектов.НомерНаПечать(НомерДокумента, УдалитьПрефиксИБ, УдалитьПользовательскийПрефикс);
		
	Иначе
		
		Результат = СокрЛП(НомерДокумента);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} УПД970. Служебные процедуры и функции

//{ УПД970. Контракты протоструктуры

Функция Контракт_ПротоструктураУПД970()
	
	ИмяТипа = "Utd970SellerContent";
	
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформация();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформация()
	
	ИмяТипа = "СлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.ContentsDocumentProductsType = Контракт_ContentsDocumentProductsType();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ContentsDocumentProductsType()
	
	ИмяТипа = "ContentsDocumentProductsType";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ExtendedOrganizationInfo970()

	ИмяТипа = "ExtendedOrganizationInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияОрганизации();
	
	Возврат Результат;

КонецФункции

Функция Контракт_Shipper970()

	ИмяТипа = "Shipper970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_СлужебнаяИнформацияОрганизации()
	
	ИмяТипа = "OrganizationСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressInfo970()

	ИмяТипа = "AddressInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressRFInfo()

	ИмяТипа = "AddressRFInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressSARInfo()

	ИмяТипа = "AddressSARInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressTextInfo()

	ИмяТипа = "AddressTextInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressObjectNumberInfo()

	ИмяТипа = "AddressObjectNumberInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentShipments970()

	ИмяТипа = "DocumentShipment970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferInfo970()

	ИмяТипа = "TransferInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferBases970()

	ИмяТипа = "TransferBase970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_Employee970()
	
	ИмяТипа = "Employee970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_InvoiceTable970()
	
	ИмяТипа = "InvoiceTable970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemTracingInfo970()
	
	ИмяТипа = "ItemTracingInfo970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_CustomDeclarations()

	ИмяТипа = "CustomDeclaration";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияСтроки()
	
	ИмяТипа = "ItemСлужебнаяИнформация";
	Результат = Новый_ЭлементПрото(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Item970()
	
	ИмяТипа = "Item970";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_PaymentDocumentInfo()

	ИмяТипа = "PaymentDocumentInfo";
	Результат = Новый_ЭлементПрото(ИмяТипа);

	Возврат Результат;

КонецФункции

//} УПД970. Контракты протоструктуры

//} СБОР КОНТЕНТА УПД970

//{ СЧЕТ НА ОПЛАТУ

// Формирует типовую печатную форму счета на оплату.
//
// Параметры:
//  СсылкаНаОбъект - ДокументСсылка.СчетНаОплату - счет на оплату
// 
// Возвращаемое значение:
//  ТабличныйДокумент - стандартная печатная форма.
//
Функция СчетаНаОплату_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	Если ТипЗнч(СсылкаНаОбъект) <> Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		ШаблонТекстаОшибки = НСтр("ru='СчетаНаОплату_ПечатнаяФорма1С: Неожиданный тип документа (%1)'");
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(СсылкаНаОбъект));
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ДокументПечати = Новый Массив;
	ДокументПечати.Добавить(СсылкаНаОбъект);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	КоллекцияПечатныхФорм = НовыйКоллекцияПечатныхФормДляПечатиДокумента();
	ОписаниеПФ = КоллекцияПечатныхФорм.Добавить();
	ОписаниеПФ.ИмяМакета = "Счет";
	ОписаниеПФ.ИмяВРЕГ = ВРег(ОписаниеПФ.ИмяМакета);
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Новый Структура;
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.СчетНаОплату");
	
	МенеджерПечати.Печать(
		ДокументПечати,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода
	);
	
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			ТабличныйДокумент = Стр.ТабличныйДокумент;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет модель данных электронного счета на оплату.
//
// Параметры:
//  Шапка - Структура - Контракт шапки неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - ТаблицаЗначений - Контракт табличной части неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату())
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанные(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета) Экспорт
	
	ТипОснования = ТипЗнч(ОснованиеЭлектронногоСчета);
	
	Если ТипОснования = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоСчетуНаОплату(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.АктОбОказанииУслуг") Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоАктуОбОказанииУслуг(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		
		СчетаНаОплату_ЗаполнитьДанныеПоНакладной(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа: %1'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет модель данных электронного счета на оплату на основании счета на оплату.
//
// Параметры:
//  Шапка - Структура - Контракт шапки неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату()
//  ТабличнаяЧасть - ТаблицаЗначений - Контракт табличной части неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату()
//  ОснованиеЭлектронногоСчета - ДокументСсылка.СчетНаОплату - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанныеПоСчетуНаОплату(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.ВалютаДокумента.Код КАК ВалютаКод,
	|	Т.Организация КАК Организация,
	|	Т.ЛицевойСчет КАК ЛицевойСчет,
	|	Т.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	Т.Контрагент КАК Контрагент,
	|	Т.СчетПлательщика КАК СчетПлательщика,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	Т.Руководитель КАК Руководитель,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СчетНаОплату КАК Т
	|ГДЕ
	|	Т.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТЧ.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПОДСТРОКА(ТЧ.Содержание, 1, 1000)
	|		КОГДА ПОДСТРОКА(ТЧ.Содержание, 1, 1000) <> """"
	|			ТОГДА ПОДСТРОКА(ТЧ.Содержание, 1, 1000)
	|		КОГДА ТЧ.Номенклатура.НаименованиеПолное <> """"
	|			ТОГДА ТЧ.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ТЧ.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	ЕСТЬNULL(ТЧ.Номенклатура.НоменклатурныйНомер, """") КАК НоменклатураАртикул,
	|	ВЫБОР
	|		КОГДА ТЧ.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТЧ.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТЧ.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияПредставление,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Сумма КАК Сумма,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	1 КАК НомерТабличнойЧасти,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.СчетНаОплату.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТЧ.Номенклатура.НаименованиеПолное <> """"
	|			ТОГДА ТЧ.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ТЧ.Номенклатура.Наименование
	|	КОНЕЦ,
	|	ТЧ.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ТЧ.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТЧ.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТЧ.ЕдиницаИзмерения.Представление
	|	КОНЕЦ,
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.Сумма,
	|	ТЧ.СуммаНДС,
	|	2,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.СчетНаОплату.Материалы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.ОС,
	|	ВЫБОР
	|		КОГДА ТЧ.ОС.НаименованиеПолное <> """"
	|			ТОГДА ТЧ.ОС.НаименованиеПолное
	|		ИНАЧЕ ТЧ.ОС.Наименование
	|	КОНЕЦ,
	|	ТЧ.ОС.НоменклатурныйНомер,
	|	""шт."",
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	ТЧ.СтавкаНДС,
	|	ТЧ.Сумма,
	|	ТЧ.СуммаНДС,
	|	3,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.СчетНаОплату.ОсновныеСредства КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТЧ.Номенклатура.НаименованиеПолное <> """"
	|			ТОГДА ТЧ.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ТЧ.Номенклатура.Наименование
	|	КОНЕЦ,
	|	ТЧ.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ТЧ.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТЧ.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТЧ.ЕдиницаИзмерения.Представление
	|	КОНЕЦ,
	|	ТЧ.Количество,
	|	ТЧ.Цена,
	|	&СтавкаБезНДС,
	|	ТЧ.Сумма,
	|	0,
	|	4,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.СчетНаОплату.ВозвратнаяТара КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьНДС
	|ИЗ
	|	Документ.СчетНаОплату.Материалы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СтавкаНДС <> &СтавкаБезНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.СчетНаОплату.Услуги КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СтавкаНДС <> &СтавкаБезНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Документ.СчетНаОплату.ОсновныеСредства КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СтавкаНДС <> &СтавкаБезНДС";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ОснованиеЭлектронногоСчета);
	Запрос.УстановитьПараметр("СтавкаБезНДС", Перечисления.СтавкиНДС.БезНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выбрать();
	
	Если Не ДанныеШапки.Следующий() Тогда
		Ошибка = СтрШаблон("СчетаНаОплату_Данные: Не удалось получить сведения по %1", Строка(ОснованиеЭлектронногоСчета));
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ДанныеШапки.Номер;
	
	СведенияОбОрганизации = СчетаНаОплату_РеквизитыЮрФизЛица(ДанныеШапки.Организация);
	СведенияОКонтрагенте = СчетаНаОплату_РеквизитыЮрФизЛица(ДанныеШапки.Контрагент);
	СчетПлательщика = СчетаНаОплату_РеквизитыСчетаКонтрагента(ДанныеШапки.СчетПлательщика);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не РезультатыЗапроса[2].Пустой();
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = ДанныеШапки.ВалютаКод;
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте, СчетПлательщика);
	
	Шапка.РуководительФИО = Справочники.Сотрудники.ФамилияИО(ДанныеШапки.Руководитель, Истина);
	
	СчетПолучателя = СчетаНаОплату_РеквизитыСчетаОрганизации(ДанныеШапки.ЛицевойСчет, ДанныеШапки.РеквизитыЛицевогоСчета);
	Если ЗначениеЗаполнено(СчетПолучателя) Тогда
		Шапка.ПродавецБанкБИК = СчетПолучателя.БИК;
		Шапка.ПродавецБанкПредставление = СчетПолучателя.Банк;
		Шапка.ПродавецБанковскийСчетНомер = СчетПолучателя.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = СчетПолучателя.КоррСчет;
	КонецЕсли;
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = ТабличнаяЧасть.Добавить();
		Запись.Номенклатура = Выборка.Номенклатура;
		Запись.Характеристика = Неопределено;
		Запись.НоменклатураАртикул = Выборка.НоменклатураАртикул;
		Запись.НоменклатураПредставление = Выборка.НоменклатураПредставление;
		Запись.Количество = Выборка.Количество;
		Запись.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияПредставление;
		Запись.Упаковка = Неопределено;
		Запись.Цена = Выборка.Цена;
		Запись.Сумма = Выборка.Сумма;
		Запись.СуммаНДС = Выборка.СуммаНДС;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет модель данных электронного счета на оплату на основании накладной.
//
// Параметры:
//  Шапка - Структура - Контракт шапки неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - ТаблицаЗначений - Контракт табличной части неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату())
//  ОснованиеЭлектронногоСчета - Документ.НакладнаяНаРеализациюТорг12 - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанныеПоНакладной(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.ВалютаДокумента.Код КАК ВалютаКод,
	|	Т.Организация КАК Организация,
	|	Т.РеквизитыЛицевогоСчета.Владелец КАК ЛицевойСчет,
	|	Т.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	Т.Контрагент КАК Контрагент,
	|	Т.РасчетныйСчетКонтрагента КАК СчетПлательщика,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	Т.Руководитель КАК Руководитель,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12 КАК Т
	|ГДЕ
	|	Т.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТЧ.Номенклатура.НаименованиеПолное <> """"
	|			ТОГДА ТЧ.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ТЧ.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	ТЧ.Номенклатура.Код КАК НоменклатураАртикул,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияПредставление,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Сумма КАК Сумма,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	1 КАК НомерТабличнойЧасти,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12.Номенклатура КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТЧ.Номенклатура.НаименованиеПолное <> """"
	|			ТОГДА ТЧ.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ТЧ.Номенклатура.Наименование
	|	КОНЕЦ,
	|	ТЧ.Номенклатура.НоменклатурныйНомер,
	|	ТЧ.Номенклатура.ЕдиницаИзмерения.Представление,
	|	ТЧ.Количество,
	|	ВЫБОР
	|		КОГДА ТЧ.Количество > 0
	|			ТОГДА ТЧ.Сумма / ТЧ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	&СтавкаБезНДС,
	|	ТЧ.Сумма,
	|	0,
	|	4,
	|	ТЧ.НомерСтроки
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12.ВозвратнаяТара КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьНДС
	|ИЗ
	|	Документ.НакладнаяНаРеализациюТорг12.Номенклатура КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СтавкаНДС <> &СтавкаБезНДС";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ОснованиеЭлектронногоСчета);
	Запрос.УстановитьПараметр("СтавкаБезНДС", Перечисления.СтавкиНДС.БезНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выбрать();
	
	Если Не ДанныеШапки.Следующий() Тогда
		Ошибка = СтрШаблон("СчетаНаОплату_Данные: Не удалось получить сведения по %1", Строка(ОснованиеЭлектронногоСчета));
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ДанныеШапки.Номер;
	
	СведенияОбОрганизации = СчетаНаОплату_РеквизитыЮрФизЛица(ДанныеШапки.Организация);
	СчетПолучателя = СчетаНаОплату_РеквизитыСчетаОрганизации(ДанныеШапки.ЛицевойСчет, ДанныеШапки.РеквизитыЛицевогоСчета);
	
	СведенияОКонтрагенте = СчетаНаОплату_РеквизитыЮрФизЛица(ДанныеШапки.Контрагент);
	СчетПлательщика = СчетаНаОплату_РеквизитыСчетаКонтрагента(ДанныеШапки.СчетПлательщика);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не РезультатыЗапроса[2].Пустой();
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = ДанныеШапки.ВалютаКод;
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте, СчетПлательщика);
	
	Шапка.РуководительФИО = Справочники.Сотрудники.ФамилияИО(ДанныеШапки.Руководитель, Истина);
	
	Если ЗначениеЗаполнено(СчетПолучателя) Тогда
		Шапка.ПродавецБанкБИК = СчетПолучателя.БИК;
		Шапка.ПродавецБанкПредставление = СчетПолучателя.Банк;
		Шапка.ПродавецБанковскийСчетНомер = СчетПолучателя.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = СчетПолучателя.КоррСчет;
	КонецЕсли;
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = ТабличнаяЧасть.Добавить();
		Запись.Номенклатура = Выборка.Номенклатура;
		Запись.Характеристика = Неопределено;
		Запись.НоменклатураАртикул = Выборка.НоменклатураАртикул;
		Запись.НоменклатураПредставление = Выборка.НоменклатураПредставление;
		Запись.Количество = Выборка.Количество;
		Запись.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияПредставление;
		Запись.Упаковка = Неопределено;
		Запись.Цена = Выборка.Цена;
		Запись.Сумма = Выборка.Сумма;
		Запись.СуммаНДС = Выборка.СуммаНДС;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет модель данных электронного счета на оплату на основании акта об оказание услуг.
//
// Параметры:
//  Шапка - Структура - Контракт шапки неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату())
//  ТабличнаяЧасть - ТаблицаЗначений - Контракт табличной части неформализованного счета на оплату по форме ДД
//  		(см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату())
//  ОснованиеЭлектронногоСчета - ДокументСсылка.АктОбОказанииУслуг - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанныеПоАктуОбОказанииУслуг(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номер КАК Номер,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК Валюта,
	|	Т.ВалютаДокумента.Код КАК ВалютаКод,
	|	Т.Организация КАК Организация,
	|	Т.РеквизитыЛицевогоСчета.Владелец КАК ЛицевойСчет,
	|	Т.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	Т.Контрагент КАК Контрагент,
	|	Т.РасчетныйСчетКонтрагента КАК СчетПлательщика,
	|	ЛОЖЬ КАК УчетАгентскогоНДС,
	|	Т.Руководитель КАК Руководитель,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.АктОбОказанииУслуг КАК Т
	|ГДЕ
	|	Т.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Номенклатура.Код КАК НоменклатураАртикул,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ТЧ.СодержаниеУслуги КАК СТРОКА(1000))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(ТЧ.СодержаниеУслуги КАК СТРОКА(1000))
	|		КОГДА (ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ ТЧ.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураПредставление,
	|	ВЫБОР
	|		КОГДА ТЧ.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТЧ.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ ТЧ.ЕдиницаИзмерения.Представление
	|	КОНЕЦ КАК ЕдиницаИзмеренияПредставление,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.Сумма КАК Сумма,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	1 КАК НомерТабличнойЧасти,
	|	ТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.АктОбОказанииУслуг.УслугиОказанные КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьНДС
	|ИЗ
	|	Документ.АктОбОказанииУслуг.УслугиОказанные КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СтавкаНДС <> &СтавкаБезНДС";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ОснованиеЭлектронногоСчета);
	Запрос.УстановитьПараметр("СтавкаБезНДС", Перечисления.СтавкиНДС.БезНДС);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапки = РезультатыЗапроса[0].Выбрать();
	
	Если Не ДанныеШапки.Следующий() Тогда
		Ошибка = СтрШаблон("СчетаНаОплату_Данные: Не удалось получить сведения по %1", Строка(ОснованиеЭлектронногоСчета));
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ДатаДокумента = ДанныеШапки.Дата;
	НомерДокумента = ДанныеШапки.Номер;
	
	СведенияОбОрганизации = СчетаНаОплату_РеквизитыЮрФизЛица(ДанныеШапки.Организация);
	СчетПолучателя = СчетаНаОплату_РеквизитыСчетаОрганизации(ДанныеШапки.ЛицевойСчет, ДанныеШапки.РеквизитыЛицевогоСчета);
	
	СведенияОКонтрагенте = СчетаНаОплату_РеквизитыЮрФизЛица(ДанныеШапки.Контрагент);
	СчетПлательщика = СчетаНаОплату_РеквизитыСчетаКонтрагента(ДанныеШапки.СчетПлательщика);
	
	Шапка.Номер = НомерДокумента;
	Шапка.Дата = ДатаДокумента;
	Шапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	Шапка.УчитыватьНДС = Не РезультатыЗапроса[2].Пустой();
	Шапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	Шапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	Шапка.Валюта = ДанныеШапки.Валюта;
	Шапка.ВалютаКод = ДанныеШапки.ВалютаКод;
	
	Шапка.Продавец = ДанныеШапки.Организация;
	Шапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	Шапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	Шапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	Шапка.Покупатель = ДанныеШапки.Контрагент;
	Шапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	Шапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте, СчетПлательщика);
	
	Шапка.РуководительФИО = Справочники.Сотрудники.ФамилияИО(ДанныеШапки.Руководитель, Истина);
	
	Если ЗначениеЗаполнено(СчетПолучателя) Тогда
		Шапка.ПродавецБанкБИК = СчетПолучателя.БИК;
		Шапка.ПродавецБанкПредставление = СчетПолучателя.Банк;
		Шапка.ПродавецБанковскийСчетНомер = СчетПолучателя.НомерСчета;
		Шапка.ПродавецБанковскийСчетКорСчет = СчетПолучателя.КоррСчет;
	КонецЕсли;
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = ТабличнаяЧасть.Добавить();
		Запись.Номенклатура = Выборка.Номенклатура;
		Запись.Характеристика = Неопределено;
		Запись.НоменклатураАртикул = Выборка.НоменклатураАртикул;
		Запись.НоменклатураПредставление = Выборка.НоменклатураПредставление;
		Запись.Количество = Выборка.Количество;
		Запись.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияПредставление;
		Запись.Упаковка = Неопределено;
		Запись.Цена = Выборка.Цена;
		Запись.Сумма = Выборка.Сумма;
		Запись.СуммаНДС = Выборка.СуммаНДС;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет адреса, телефон и факт в сведениях о юр./физ. лице
//
// Параметры:
//  Сведения - Структура - см. СчетаНаОплату_РеквизитыЮрФизЛица
//  ЮрФизЛицо - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - источник сведений
//
Процедура СчетаНаОплату_ЗаполнитьКонтактнуюИнформациюЮрФизЛица(Сведения, ЮрФизЛицо)
	
	ТипПараметра = ТипЗнч(ЮрФизЛицо);
	
	ВидыКИ = Справочники.ВидыКонтактнойИнформации;
	
	Если ТипПараметра = Тип("СправочникСсылка.Организации") Тогда
		
		ВладелецКИ = ЮрФизЛицо;
		ВидАдресЮридический = ВидыКИ.ЮрАдресОрганизации;
		ВидАдресФактический = ВидыКИ.ФактАдресОрганизации;
		ВидТелефон = ВидыКИ.ТелефонОрганизации;
		
	ИначеЕсли ТипПараметра = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Реквизиты = ЗначенияРеквизитовОбъектаЛок(ЮрФизЛицо, "ЮридическоеФизическоеЛицо, ВидКонтрагента");
		ВладелецКИ = Реквизиты.ЮридическоеФизическоеЛицо;
		
		Если Реквизиты.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			
			ВидАдресЮридический = ВидыКИ.ЮридическийАдресКонтрагенты;
			ВидАдресФактический = ВидыКИ.ФактическийАдресКонтрагенты;
			ВидТелефон = ВидыКИ.ТелефонКонтрагенты;
			
		Иначе
			
			ВидАдресЮридический = ВидыКИ.АдресПоПропискеФизическиеЛица;
			ВидАдресФактический = ВидыКИ.АдресМестаПроживанияФизическиеЛица;
			ВидТелефон = ВидыКИ.ТелефонДомашнийФизическиеЛица;
			
		КонецЕсли;
		
	Иначе
		
		Ошибка = СтрШаблон("Неожиданный тип параметра (ЮрФизЛицо = %1, Тип = %2)", Строка(ЮрФизЛицо), Строка(ТипПараметра));
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	МодульКонтактнаяИнформация = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	
	Сведения.ЮридическийАдрес = МодульКонтактнаяИнформация.КонтактнаяИнформацияОбъекта(ВладелецКИ, ВидАдресЮридический);
	Сведения.ФактическийАдрес = МодульКонтактнаяИнформация.КонтактнаяИнформацияОбъекта(ВладелецКИ, ВидАдресФактический);
	Сведения.Телефоны = МодульКонтактнаяИнформация.КонтактнаяИнформацияОбъекта(ВладелецКИ, ВидТелефон);
	Сведения.Факс = "";
	
КонецПроцедуры

// Получает реквизиты банковского счета организации.
//
// Параметры:
//  ЛицевойСчет - СправочникСсылка.ЛицевыеСчета - лицевой счет организации.
//  РеквизитыЛицевогоСчета - СправочникСсылка.РеквизитыЛицевыхСчетов - Реквизиты лицевого счета организации.
// 
// Возвращаемое значение:
//  Структура - реквизиты счета для оплаты.
//
Функция СчетаНаОплату_РеквизитыСчетаОрганизации(ЛицевойСчет, РеквизитыЛицевогоСчета)
	
	Если Не ЗначениеЗаполнено(ЛицевойСчет)
		Или Не ЗначениеЗаполнено(РеквизитыЛицевогоСчета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ИНН", "ИНН");
	Реквизиты.Вставить("КПП", "КПП");
	Реквизиты.Вставить("Корреспондент", "Корреспондент");
	Реквизиты.Вставить("НомерСчета", "СчетНомер");
	Реквизиты.Вставить("Банк", "Банк");
	Реквизиты.Вставить("Бик", "БИК");
	Реквизиты.Вставить("КоррСчет", "КоррСчет");
	
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ЛицевойСчет, РеквизитыЛицевогоСчета, Реквизиты, Истина);
	
	Возврат Реквизиты;
	
КонецФункции

// Получает реквизиты банковского счета контрагента.
//
// Параметры:
//  СчетПлательщика - СправочникСсылка.БанковскиеИКазначейскиеСчета - счет контрагента.
// 
// Возвращаемое значение:
//  Структура - реквизиты счета контрагента.
//
Функция СчетаНаОплату_РеквизитыСчетаКонтрагента(СчетПлательщика)
	
	Если Не ЗначениеЗаполнено(СчетПлательщика) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Корреспондент", "Корреспондент");
	Реквизиты.Вставить("НомерСчета", "СчетНомер");
	Реквизиты.Вставить("Банк", "Банк");
	Реквизиты.Вставить("БИК", "БИК");
	Реквизиты.Вставить("КоррСчет", "КоррСчет");
	
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(СчетПлательщика, СчетПлательщика, Реквизиты, Истина);
	
	Возврат Реквизиты;
	
КонецФункции

// Получает значения реквизитов юридического или физического лица.
//
// Параметры:
//  ЮрФизЛицо - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - юр./физ. лицо.
// 
// Возвращаемое значение:
//  Структура - реквизиты юр./физ. лица.
//
Функция СчетаНаОплату_РеквизитыЮрФизЛица(Знач ЮрФизЛицо)
	
	Сведения = Новый Структура;
	Сведения.Вставить("Представление", "");
	Сведения.Вставить("ПолноеНаименование", "");
	Сведения.Вставить("СокращенноеНаименование", "");
	Сведения.Вставить("НаименованиеДляПечатныхФорм", "");
	Сведения.Вставить("ФИОПБОЮЛ", "");
	Сведения.Вставить("КодПоОКПО", "");
	Сведения.Вставить("Свидетельство", "");
	Сведения.Вставить("ИНН", "");
	Сведения.Вставить("КПП", "");
	Сведения.Вставить("Телефоны", "");
	Сведения.Вставить("ЮридическийАдрес", "");
	Сведения.Вставить("ФактическийАдрес", "");
	Сведения.Вставить("Факс", "");
	
	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат Сведения;
	КонецЕсли;
	
	ЗапросПоОсновнымСведениям = Новый Запрос;
	
	ЗапросПоОсновнымСведениям.Текст = 
	"ВЫБРАТЬ
	|	Организации.Представление КАК Наименование,
	|	Организации.НаименованиеПолное КАК ПолноеНаименование,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	Организации.КодОКПО КАК КодПоОКПО,
	|	Организации.НаименованиеСокращенное КАК СокращенноеНаименование,
	|	ВЫБОР
	|		КОГДА Организации.ИспользоватьВПлатежныхДокументахСокращенноеНаименование
	|			ТОГДА Организации.НаименованиеСокращенное
	|		ИНАЧЕ Организации.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеДляПечатныхФорм,
	|	Организации.НаименованиеПолное КАК ИндивидуальныйПредприниматель,
	|	Организации.СвидетельствоСерияНомер КАК СвидетельствоСерияНомер,
	|	Организации.СвидетельствоДатаВыдачи КАК СвидетельствоДатаВыдачи
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &ЮрФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Представление,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ,
	|	Контрагенты.ЮридическоеФизическоеЛицо.ИНН,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.КПП
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Контрагенты.НаименованиеСокращенное,
	|	Контрагенты.НаименованиеСокращенное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФИзЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	"""",
	|	""""
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &ЮрФизЛицо";
	
	ЗапросПоОсновнымСведениям.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);
	
	РезультатЗапросаПоОсновнымСведениям = ЗапросПоОсновнымСведениям.Выполнить();
	Если РезультатЗапросаПоОсновнымСведениям.Пустой() Тогда
		Ошибка = СтрШаблон("Не удалось получить сведения о юр./физ. лице (%1)", ЮрФизЛицо);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Выборка = РезультатЗапросаПоОсновнымСведениям.Выбрать();
	Выборка.Следующий();
	
	Сведения.ПолноеНаименование = СокрЛП(Выборка.ПолноеНаименование);
	Если НЕ ЗначениеЗаполнено(Сведения.ПолноеНаименование) Тогда
		Сведения.ПолноеНаименование = СокрЛП(Выборка.Наименование);
	КонецЕсли;
	
	Сведения.СокращенноеНаименование = СокрЛП(Выборка.СокращенноеНаименование);
	Сведения.НаименованиеДляПечатныхФорм = СокрЛП(Выборка.НаименованиеДляПечатныхФорм);
	Сведения.Представление = СокрЛП(Выборка.Наименование);
	Сведения.ИНН = Выборка.ИНН;
	Сведения.КПП = Выборка.КПП;
	Сведения.ФИОПБОЮЛ = "";
	Сведения.КодПоОКПО = Выборка.КодПоОКПО;
	
	Если НЕ ПустаяСтрока(Выборка.СвидетельствоСерияНомер) Тогда
		Сведения.Свидетельство = СтрШаблон("свидетельство %1 от %2",
			СокрЛП(Выборка.СвидетельствоСерияНомер),
			Формат(Выборка.СвидетельствоДатаВыдачи, "ДЛФ=D")
		);
	КонецЕсли;
	
	СчетаНаОплату_ЗаполнитьКонтактнуюИнформациюЮрФизЛица(Сведения, ЮрФизЛицо);
	
	Возврат Сведения;
	
КонецФункции

Функция ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления)
	
	Перем Префикс, СтрокаДополнения;
	
	СоответствиеПараметров = Новый Структура;
	СоответствиеПараметров.Вставить("ПолноеНаименование", " ");
	СоответствиеПараметров.Вставить("СокращенноеНаименование", " ");
	СоответствиеПараметров.Вставить("НаименованиеДляПечатныхФорм", " ");
	СоответствиеПараметров.Вставить("ИНН", " ИНН ");
	СоответствиеПараметров.Вставить("КПП", " КПП ");
	СоответствиеПараметров.Вставить("Свидетельство", " ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи", " от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес", " ");
	СоответствиеПараметров.Вставить("ФактическийАдрес", " ");
	СоответствиеПараметров.Вставить("Телефоны", " тел.: ");
	СоответствиеПараметров.Вставить("Факс", " факс: ");
	СоответствиеПараметров.Вставить("НомерСчета", " р/с ");
	СоответствиеПараметров.Вставить("Банк", " в банке ");
	СоответствиеПараметров.Вставить("БИК", " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет", " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО", " Код по ОКПО ");
	
	ПропускатьПустыеСтроки = Истина;
	Разделитель = ",";
	СписокПараметров = СтрРазделить(
		ШаблонПредставления,
		Разделитель,
		ПропускатьПустыеСтроки
	);
	
	Результат = Новый Массив;
	
	Для Каждого ИмяПараметра Из СписокПараметров Цикл
		
		Если Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения) Тогда
			
			Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения);
			Если ПустаяСтрока(СтрокаДополнения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СоответствиеПараметров.Свойство(ИмяПараметра, Префикс) Тогда
				Результат.Добавить(Префикс + СтрокаДополнения);
			Иначе
				Результат.Добавить(СтрокаДополнения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаРезультата = СтрСоединить(Результат, ",");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "  ", " ");
	
	Возврат СокрЛП(СтрокаРезультата);
	
КонецФункции

// Формирует строку с наименованием и реквизитами юридического или физического лица.
//
// Параметры:
//  РеквизитыЮрФизЛица - Структура - см. СчетаНаОплату_РеквизитыЮрФизЛица
//  РеквизитыСчета - Структура - (Необязательный) реквизиты счета
// 
// Возвращаемое значение:
//  Строка - строковое представление реквизитов.
//
Функция СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(Знач РеквизитыЮрФизЛица, Знач РеквизитыСчета = Неопределено)
	
	ШаблонПредставления = "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны";
	
	Если ЗначениеЗаполнено(РеквизитыСчета) Тогда
		
		ШаблонПредставления = ШаблонПредставления + ",НомерСчета,Банк,БИК,КоррСчет";
		
		Для Каждого Элемент Из РеквизитыСчета Цикл
			РеквизитыЮрФизЛица.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = ПредставлениеЮрФизЛицаСлужебный(РеквизитыЮрФизЛица, ШаблонПредставления);
	
	Возврат Результат;
	
КонецФункции

// Получает представление юр./физ. лица для вывода в печатной форме счета.
//
// Параметры:
//  РеквизитыЮрФизЛица - Структура - см. СчетаНаОплату_РеквизитыЮрФизЛица
// 
// Возвращаемое значение:
//  Строка - наименование юридического или физического лица для печати.
//
Функция СчетаНаОплату_ПредставлениеЮрФизЛица(РеквизитыЮрФизЛица)
	
	Результат = РеквизитыЮрФизЛица.СокращенноеНаименование;
	
	Если РеквизитыЮрФизЛица.Свойство("НаименованиеДляПечатныхФорм") Тогда
		Результат = РеквизитыЮрФизЛица.НаименованиеДляПечатныхФорм;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ЗаголовокПечатнойФормы(Знач НомерДокумента, Знач ДатаДокумента)
	
	ДатаСтрокой = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	Результат = СтрШаблон(
		"Счет на оплату № %1 от %2",
		НомерДокумента,
		ДатаСтрокой
	);
	
	Возврат Результат;
	
КонецФункции

//} СЧЕТ НА ОПЛАТУ

//*****************************************************************************
//{ СБОР КОНТЕНТА ФНС29

Функция СчетФНС29(СсылкаНаОбъект) Экспорт
	Ошибка = "ИнтеграцияБГУ20: формирование электронных счетов в формате ФНС 29@ не реализовано";
	ВызватьИсключение Ошибка;
КонецФункции

//} СБОР КОНТЕНТА ФНС29
//*****************************************************************************

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция ИспользуетсяНоменклатураКонтрагентовБЭД()
	
	Результат = Истина;
	
	Если Метаданные.РегистрыСведений.Найти("НоменклатураКонтрагентовБЭД") = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	Если ИспользуетсяНоменклатураКонтрагентовБЭД() Тогда
		
		МетаданныеНоменклатурыКонтрагентов = Метаданные.РегистрыСведений.НоменклатураКонтрагентовБЭД;
		
		ВладелецТип = Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип;
		
		НоменклатураТип = Новый_ТипНоменклатурыБЭДДляСопоставления(Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип);
		
		УпаковкаТип = Метаданные.ОпределяемыеТипы.УпаковкаНоменклатурыБЭД.Тип;
		НаименованиеТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыКонтрагентов.Ресурсы.Артикул.Тип;
		КодТип = АртикулТип; // поля "Код" в регистре нет
		
	Иначе
		
		МетаданныеНоменклатурыПоставщиков = Метаданные.Справочники.НоменклатураКонтрагентов;
		
		ВладелецТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Владелец.Тип;
		
		НоменклатураТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Номенклатура.Тип;
		
		УпаковкаТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Упаковка.Тип;
		НаименованиеТип = МетаданныеНоменклатурыПоставщиков.СтандартныеРеквизиты.Наименование.Тип;
		АртикулТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Артикул.Тип;
		КодТип = МетаданныеНоменклатурыПоставщиков.Реквизиты.Идентификатор.Тип;
		
	КонецЕсли;
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	Результат.Колонки.Добавить("Упаковка"				, УпаковкаТип);
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ТипНоменклатурыБЭДДляСопоставления(ОписаниеТипаНоменклатураБЭД)
	
	Результат = ОписаниеТипаНоменклатураБЭД;
	
	ИмяОбъектаМетаданных = "Справочник.Номенклатура";
	Если Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданных) <> Неопределено Тогда
		
		ИмяТипа			 = "СправочникСсылка.Номенклатура";
		ТипНоменклатура	 = Тип(ИмяТипа);
		
		Если ОписаниеТипаНоменклатураБЭД.СодержитТип(ТипНоменклатура) Тогда
			Результат = Новый ОписаниеТипов(ИмяТипа);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, НоменклатураКонтрагента)
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент				= Контрагент;
	НоваяСтрока.Наименование			= НоменклатураКонтрагента.Наименование;
	НоваяСтрока.Код						= НоменклатураКонтрагента.Код;
	НоваяСтрока.Артикул					= НоменклатураКонтрагента.Артикул;
	НоваяСтрока.НоменклатураКонтрагента = НоменклатураКонтрагента;
	
КонецПроцедуры

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеМЗ" Тогда				
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеМЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
		|ГДЕ
		|	НЕ ПоступлениеМЗ.ПометкаУдаления
		|	И ПоступлениеМЗ.Организация = &Организация
		|	И ПоступлениеМЗ.Контрагент = &Контрагент
		|	И ПоступлениеМЗ.ДатаПервичногоДокумента = &ДатаДокумента
		|	И ПоступлениеМЗ.НомерПервичногоДокумента = &НомерДокумента";
	
	ИначеЕсли ВидДокумента1С = "ПоступлениеУслугРабот" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеУслугРабот.Ссылка
		|ИЗ
		|	Документ.ПоступлениеУслугРабот КАК ПоступлениеУслугРабот
		|ГДЕ
		|	НЕ ПоступлениеУслугРабот.ПометкаУдаления
		|	И ПоступлениеУслугРабот.Организация = &Организация
		|	И ПоступлениеУслугРабот.Контрагент = &Контрагент
		|	И ПоступлениеУслугРабот.ДатаПервичногоДокумента = &ДатаДокумента
		|	И ПоступлениеУслугРабот.НомерПервичногоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ДатаПервичногоДокумента = &ДатаДокумента
		|	И СчетФактураПолученный.НомерПервичногоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетНаОплатуОтПоставщика" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплатуОтПоставщика.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуОтПоставщика КАК СчетНаОплатуОтПоставщика
		|ГДЕ
		|	НЕ СчетНаОплатуОтПоставщика.ПометкаУдаления
		|	И СчетНаОплатуОтПоставщика.Организация = &Организация
		|	И СчетНаОплатуОтПоставщика.Контрагент = &Контрагент
		|	И СчетНаОплатуОтПоставщика.ДатаПервичногоДокумента = &ДатаДокумента
		|	И СчетНаОплатуОтПоставщика.НомерПервичногоДокумента = &НомерДокумента";		
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_ПоступлениеТоваровУслуг();
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД) Тогда
		
		Результат = ИдентификаторОперации_СчетФактураПолученный();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторОперации_ПоступлениеТоваровУслуг()
	Возврат "ПоступлениеМЗ";
КонецФункции

Функция ИдентификаторОперации_СчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия)
	
	Если ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭД = ПараметрыСобытия.Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
КонецПроцедуры

Функция ПроверкаДокументаОснования(Документ, ВыбранныйВид)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Если ВыбранныйВид = "КорректировкаПоступления" Тогда
		
		Результат.ОписаниеОшибки = "Не поддерживается";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции			

Функция ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных)
	
	МетаданныеОснованийСФ = Метаданные.Документы.СчетФактураПолученный.ВводитсяНаОсновании;
	Результат = МетаданныеОснованийСФ.Содержит(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	Результат = Ложь;
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Если ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных) Тогда
		
		Результат = (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.СчетФактураПолученный"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		ИЛИ НЕ ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйСФ)
		ИЛИ ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	ДатаДокумента = ТекущаяДатаСеанса();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ДокументСФ, ДокументОбъект);
	
	ДокументСФ.ДатаПервичногоДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	ДокументСФ.НомерПервичногоДокумента = ЭлектронныйСФ.Реквизиты.Номер;
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.КодСпособаВыставления = 2;
	
	НоваяСтрока = ДокументСФ.ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснование = ДокументОбъект.Ссылка;
	
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.Записать();
	
	Если НЕ ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД = ФункцияДокумента = "СЧФДОП"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД И ЭтоСФ Тогда
		
		Если ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ДокументыОснования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументУчета.ДокументОснование);
		Иначе
			ДокументыОснования = ОбщегоНазначения.ВыгрузитьКолонку(ДокументУчета.ДокументыОснования, "ДокументОснование"); 
		КонецЕсли;
		
		Для Каждого ДокументОснование Из ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(ДокументОснование, ДобавляемыйКомментарий);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, Реквизиты)
	
	ВыбиратьРазрешенные = Истина;
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СсылкаНаОбъект,
		Реквизиты,
		ВыбиратьРазрешенные
	);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеРеквизитаОбъектаЛок(СсылкаНаОбъект, ИмяРеквизита)
	
	ВыбиратьРазрешенные = Истина;
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СсылкаНаОбъект,
		ИмяРеквизита,
		ВыбиратьРазрешенные
	);
	
	Возврат Результат;
	
КонецФункции

Функция Общее_СтрокаВДату(Значение)
	
	Результат = СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция АктыСверок_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	Если ТипОбъекта <> Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда
		
		Ошибка = СтрШаблон(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ДокументПечати = Новый Массив;
	ДокументПечати.Добавить(СсылкаНаОбъект);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	КоллекцияПечатныхФорм = НовыйКоллекцияПечатныхФормДляПечатиДокумента();
	
	АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм);
	
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = Новый Структура;
	
	МенеджерПечати = Документы.АктСверкиВзаиморасчетов;
	МенеджерПечати.Печать(
		ДокументПечати,
		ПараметрыПечати,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода
	);
	
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			
			ТабличныйДокумент = Стр.ТабличныйДокумент;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура АктыСверок_ЗаполнитьКоллекциюПечатныхФорм(КоллекцияПечатныхФорм)
	
	НовыйЭлементТаблицы = КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета = "АктСверки";
	НовыйЭлементТаблицы.ИмяВРЕГ = ВРег(НовыйЭлементТаблицы.ИмяМакета);
	НовыйЭлементТаблицы.Экземпляров = 1;

КонецПроцедуры

// Метод является констркутором служебной коллекции "КоллекцияПечатныхФорм"
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция НовыйКоллекцияПечатныхФормДляПечатиДокумента()
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции 

Функция ЭтоСчетФактураНаАванс(СФ)
	
	Результат = Ложь;
	
	Если ТипЗнч(СФ) = Тип("ДокументСсылка.СчетФактураВыданный")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СФ, "ВидЦенности") = Перечисления.ВидыЦенностейНДС.Аванс Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	Возврат "без НДС";
КонецФункции

Функция БанковскиеРеквизитыРасчетногоСчета(РасчетныйСчет)
	
	ЛицевойСчет = РасчетныйСчет;
	РеквизитыСчета = РасчетныйСчет;
	
	Если ТипЗнч(РасчетныйСчет) = Тип("СправочникСсылка.РеквизитыЛицевыхСчетов") Тогда
		ЛицевойСчет = РасчетныйСчет.Владелец;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("НомерСчетаПолучателя", "СчетНомер");
	Результат.Вставить("НаименованиеБанкаПолучателя", "Банк");
	Результат.Вставить("БикБанкаПолучателя", "БИК");
	Результат.Вставить("СчетБанкаПолучателя", "КоррСчет");
	
	ИнтерфейсБГУ = ОбщийМодульПоИмениЛок("ПлатежноРасчетныеДокументы");
	ИнтерфейсБГУ.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ЛицевойСчет, РеквизитыСчета, Результат);
	
	Возврат Результат;
	
КонецФункции

// Заполняет мету электронных актов и накладных
//
// Параметры:
//  Мета - Структура - модель меты передаточного документа
//  УчетныйДокумент - ЛюбаяСсылка - основание электронного акта или накладной
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартный обработчик заполнения меты
//
Процедура ПередаточныеДокументы_ЗаполнитьМету(Мета, УчетныйДокумент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Истина;
	
КонецПроцедуры

Функция СведенияОбАдресеЛок(АдресСтрокойJSON)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПроверитьАдрес", Ложь);
	ДопПараметры.Вставить("КодыАдреса", Истина);
	
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("РаботаСАдресами");
	
	Результат = ИнтерфейсБСП.СведенияОбАдресе(АдресСтрокойJSON, ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМуниципальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Муниципальный"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоАдминистративноТерриториальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Административно-территориальный"));
	Возврат Результат;
	
КонецФункции

Функция ЕстьНесоответствующиеСтруктуреАдрРФПоля(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ПоляНеПоАдресРФ = Новый Массив;
	ПоляНеПоАдресРФ.Добавить("Округ");
	ПоляНеПоАдресРФ.Добавить("Поселение");
	ПоляНеПоАдресРФ.Добавить("ВнутригородскойРайон");
	ПоляНеПоАдресРФ.Добавить("Территория");
	ПоляНеПоАдресРФ.Добавить("ДополнительнаяТерритория");
	ПоляНеПоАдресРФ.Добавить("ЭлементДополнительнойТерритории");
	ПоляНеПоАдресРФ.Добавить("НомерЗемельногоУчастка");
	
	Для Каждого ИмяПоля Из ПоляНеПоАдресРФ Цикл 
		
		ЗначениеПоля = СвойствоСтруктурыЛок(СведенияОбАдресе, ИмяПоля);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТипКорпусаАдрРФ()
	
	Возврат "Корпус";
	
КонецФункции

Функция ТипПомещенияАдрРФ()
	
	Возврат "Квартира";
	
КонецФункции

Функция ТипЗданияАдрРФ()
	
	Возврат "Дом";
	
КонецФункции

// ВАЖНО! Возвращает сохраненное представление адреса из строки JSON, если оно заполнено.
// В противном случае представление составляется по данным полей JSON и полученное таким образом
// представления аналогично тому, что возвращается в поле Представление структуры, полученнной
// в результате вызова метода РаботаСАдресами.СведенияОбАдресе()
//
// Параметры:
//  АдресСтрокойJSON - Строка - строка JSON с данными адреса
// 
// Возвращаемое значение:
//  Строка - представление адреса
//
Функция ПредставлениеАдреса(АдресСтрокойJSON)
	
	МодульУправленияКИ = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	Результат = МодульУправленияКИ.ПредставлениеКонтактнойИнформации(АдресСтрокойJSON);
	
	Возврат Результат;
	
КонецФункции

Функция ТипАдресаВСвободнойФорме()
	Возврат "ВСвободнойФорме";
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//{ Взаимодействие с библиотекой ГенерацияXML

Функция ФункцияДокументаУПД_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции

Функция ФункцияДокументаУПД_ДОП()
	Возврат ГенерацияXML_ФункцииУПД().ДОП;
КонецФункции

Функция ФункцияДокументаУПД_СЧФДОП()
	Возврат ГенерацияXML_ФункцииУПД().СЧФДОП;
КонецФункции

Функция ГенерацияXML_ФункцииУПД()
	Результат = ГенерацияXML.Перечисление_ФункцииУПД();
	Возврат Результат;	
КонецФункции

Функция ГенерацияXML_Перечисление_ВидыЮрФизЛиц()
	
	Результат = ГенерацияXML.Перечисление_ВидыЮрФизЛиц();
	Возврат Результат;
	
КонецФункции

Функция ГенерацияXML_КодыРегионов()
	
	Результат = ГенерацияXML.КодыРегионов();
	Возврат Результат;
	
КонецФункции

Функция Новый_ЭлементПрото(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы);
	
	Возврат Результат;
	
КонецФункции

//} Взаимодействие с библиотекой ГенерацияXML

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

// Возвращает описания всех библиотек конфигурации, включая
// описание самой конфигурации.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка - имя подсистемы, например, "СтандартныеПодсистемы".
//   * Значение - Структура - описание подсистемы:
//     ** Имя - Строка - имя подсистемы.
//     ** Версия - Строка - версия подсистемы.
//     ** ЭтоКонфигурация - Булево - Истина, если данная подсистема является основной конфигурацией.
//     ** ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах интернет-поддержки.
//
Функция ОписанияПодсистемКонфигурации()
	
	// Используем служебный интерфейс БСП, т.к. метод ОписанияПодсистем добавлен в
	// программный интерфейс модуля ОбщегоНазначения только в версии БСП 3.0.2 и выше
	Результат = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияПодсистемыБГУ()
	
	ИмяПодсистемы = "БухгалтерияГосударственногоУчреждения";
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда 
		ИмяПодсистемы = ИмяПодсистемы + "Базовая";
	КонецЕсли;
	
	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
	
	Результат = ОписаниеПодсистемы.Версия;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность = "")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция КатегорииПакетов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"ОсновнойПакет");
	Результат.Вставить("КорректировочныйПакет", "КорректировочныйПакет");
	Результат.Вставить("СчетФактураНаАванс", 	"СчетФактураНаАванс");
	Результат.Вставить("СчетНаОплату", 			"СчетНаОплату");
	Результат.Вставить("АктCверки", 			"АктCверки");
	Результат.Вставить("БезКатегории", 			"БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКатегории()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"Первичные документы");
	Результат.Вставить("КорректировочныйПакет", "Корректировочные документы");
	Результат.Вставить("СчетФактураНаАванс", 	"Счет-фактура на аванс");
	Результат.Вставить("СчетНаОплату", 			"Счет на оплату");
	Результат.Вставить("АктCверки", 			"Акт сверки");
	Результат.Вставить("БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНаименованияКатегорийПакетов(ТЗ)
	
	НаименованиеКатегории = НаименованиеКатегории();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.КатегорияПакета) Тогда
			СтрокаТЗ.НаименованиеКатегории = НаименованиеКатегории[СтрокаТЗ.КатегорияПакета];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, Документ1С)
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(
		Пакет,
		Документ1С,
		"ID_УПД_ДОП"
	);
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С)
	
	ДокументПроверки = Документ1С;
	
	ЕстьТовары = ДокументПроверки.Метаданные().ТабличныеЧасти.Найти("Номенклатура") <> Неопределено;
	
	Если ЕстьТовары Тогда		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ТОРГ12");
	Иначе
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктФормализованный");
	КонецЕсли;

КонецПроцедуры

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета)
	
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	ТекстУсловия 	= ТекстУсловияЗапроса_ВидыЦенностиНДСКромеНаАванс();
	
	Результат = ШаблонТекстаЗапроса_СчетаФактура();
	
	Результат = СтрЗаменить(Результат, "//ДОП_УСЛОВИЯ", ТекстУсловия);
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаФактурыНаАванс(ОписаниеВидаПакета)

	ВидПакетаID		= ОписаниеВидаПакета.ID;
	ТекстУсловия 	= ТекстУсловияЗапроса_ВидЦенностиНДСНаАванс();
	
	Результат = ШаблонТекстаЗапроса_СчетаФактура();
	
	Результат = СтрЗаменить(Результат, "//ДОП_УСЛОВИЯ", ТекстУсловия);
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	   		    	        	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;

	Результат =
	"ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И ВТ_ДокументыБезНДС.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";	
	    	
	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПакетаID, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
										   
	Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
									   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
										   
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
	|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
	|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
	|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
	|	СчетНаОплатуПокупателю.Организация КАК Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетНаОплатуПокупателю.Проведен
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка,
	|	СчетНаОплатуПокупателю.Номер,
	|	СчетНаОплатуПокупателю.Дата,
	|	СчетНаОплатуПокупателю.Контрагент,
	|	СчетНаОплатуПокупателю.Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, ИмяТаблицыМетаданных, ЗначениеОснования)
	
	ВидПакетаID	= ОписаниеВидаПакета.ID;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумент.Ссылка 			КАК Документ,
	|	ТаблицаДокумент.Номер 			КАК НомерДокумента,
	|	ТаблицаДокумент.Дата 			КАК ДатаДокумента,
	|	ТаблицаДокумент.Контрагент 		КАК Контрагент,
	|	ТаблицаДокумент.Организация 	КАК Организация,
	|	ТаблицаДокумент.СуммаДокумента 	КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
	|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
	|	И ТаблицаДокумент.Проведен
	|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТаблицаДокумент.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумент.Ссылка,
	|	ТаблицаДокумент.Номер,
	|	ТаблицаДокумент.Дата,
	|	ТаблицаДокумент.Контрагент,
	|	ТаблицаДокумент.Организация,
	|	ТаблицаДокумент.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
	|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
	|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТаблицаДокумент.ПометкаУдаления";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыМетаданных", "Документ." + ИмяТаблицыМетаданных);
	
	ВидДокументаID = ВидДокументаIDПоВидуПакетаID(ВидПакетаID);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДокументаID", """" + ВидДокументаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеНастройкиФормироватьНаОсновании", """" + ЗначениеОснования + """");
	
	ТекстЗапроса = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета);
	
	Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса;
	
КонецПроцедуры

Функция ВидДокументаIDПоВидуПакетаID(ВидПакетаID)
	
	Результат = "";
	
	Если 	ВидПакетаID = "ID_Счет"
		Или ВидПакетаID = "ID_СчетФормализованный" Тогда
		
		Результат = ВидПакетаID;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
	|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
	|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И АктСверкиВзаиморасчетов.Проведен
	|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	&ЭтоДокументКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка,
	|	АктСверкиВзаиморасчетов.Номер,
	|	АктСверкиВзаиморасчетов.Дата,
	|	АктСверкиВзаиморасчетов.Контрагент,
	|	АктСверкиВзаиморасчетов.Организация,
	|	0,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	|	&ЭтоДокументКонтрагента";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов2_0_90(Результат);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов2_0_90(ТекстЗапроса)
	
	ЭтоДокументКонтрагента = "";
	Если ИспользуетсяАктСверкиВзаиморасчетов2_0_90() Тогда
		ЭтоДокументКонтрагента = "И НЕ АктСверкиВзаиморасчетов.ЭтоДокументКонтрагента";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоДокументКонтрагента", ЭтоДокументКонтрагента);
	
КонецПроцедуры

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	КатегорииПакетов = КатегорииПакетов();
	ОсновнойПакет = КатегорииПакетов.ОсновнойПакет;
	
	ПодстрокаПоиска = "&УсловиеСвязиПоКатегорииПакета";
	
	Если ЗначениеЗаполнено(КатегорияПакета) Тогда
		ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """"
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета ЕСТЬ NULL";
	Иначе
		ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID
			+ " ИЛИ ОтправленныеДокументы.ВидПакета ЕСТЬ NULL";
	КонецЕсли;
	
	Если КатегорияПакета = КатегорииПакетов.СчетНаОплату Тогда
		
		ПодстрокаЗамены = ПодстрокаЗамены
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета = """ + ОсновнойПакет + """";
		
		ИспользоватьСХ2 = НЕ ОсновнойМодуль.ИспользоватьПодсистемуДиадока();
		ОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
		
		Если ИспользоватьСХ2 И ОснованияПоУмолчанию Тогда
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Результат = Ядро.СписокНаОтправку_ТекстЗапроса_ВременныеТаблицы();
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВТДокументыБезНДС()
			
	Результат = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.Исправление
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.Исправление
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.Исправление,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданный.Ссылка ЕСТЬ NULL"; 
	
	Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);	
	
	Возврат Результат;
			
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ШаблонТекстаЗапроса_СчетаФактура()
	
	Результат =
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Документ,
	|	СчетФактура.Номер КАК НомерДокумента,
	|	СчетФактура.Дата КАК ДатаДокумента,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.Организация КАК Организация,
	|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетФактура.Проведен
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	//ДОП_УСЛОВИЯ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка,
	|	СчетФактура.Номер,
	|	СчетФактура.Дата,
	|	СчетФактура.Контрагент,
	|	СчетФактура.Организация,
	|	СчетФактура.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И НЕ СчетФактура.ПометкаУдаления
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	//ДОП_УСЛОВИЯ";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстУсловияЗапроса_ВидЦенностиНДСНаАванс()
	
	Результат = "	И СчетФактура.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)";
	Возврат Результат;
	
КонецФункции

Функция ТекстУсловияЗапроса_ВидыЦенностиНДСКромеНаАванс()
	
	Результат = "	И СчетФактура.ВидЦенности <> ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)";
	Возврат Результат;
	
КонецФункции

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	 
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктОбОказанииУслуг", "УслугиОказанные");
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "НакладнаяНаРеализациюТорг12", "Номенклатура");
	
	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь")
	
	ТЧ	= "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;

	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК Исправление
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
			
КонецПроцедуры

Функция ТекстыЗапросов_ВыборкаДокументовЗаПериод(ИмяОбъектаМетаданных)

	Результат = 
	"ВЫБРАТЬ
	|	Док.Ссылка 	КАК Документ,
	|	0 			КАК ВсегоПозиций,
	|	0 			КАК ПозицийБезНДС,
	|	Ложь 		КАК Исправление
	|ИЗ
	|	&Таблица КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Результат = СтрЗаменить(Результат, "&Таблица", ИмяОбъектаМетаданных);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса)
	
	Если Запросы.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоШапке(Запросы, ВидДокумента, Условие = "", Исправление = "Ложь")
	
	Таблица	= "Документ" + "." + ВидДокумента;

	Если Метаданные.НайтиПоПолномуИмени(Таблица) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА Док.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК Исправление
	|ИЗ
	|	&Таблица КАК Док
	|ГДЕ
	|	НЕ Док.Ссылка.ПометкаУдаления
	|	И Док.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
			
КонецПроцедуры

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ, ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы = Неопределено, ДопПараметры = Неопределено)
			
	РезультатПечати 	= Неопределено;	
	ПараметрыВывода 	= Неопределено;	
	ОбъектыНазначения 	= Новый Массив;
	ПараметрыИсточника 	= Новый Структура("ИдентификаторКоманды, ОбъектыНазначения", ИдентификаторКомандыПечатнойФормы, ОбъектыНазначения);
	ОбъектыПечати 		= Новый СписокЗначений;
	
	ОбъектыНазначения.Добавить(Документ);
	
	МодульДополнительныеОтчетыИОбработки = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
	МодульДополнительныеОтчетыИОбработки.ПечатьПоВнешнемуИсточнику(ВнешняяПечатнаяФорма, ПараметрыИсточника, РезультатПечати, ОбъектыПечати, ПараметрыВывода);
		
	Если ТипЗнч(РезультатПечати) <> Тип("ТаблицаЗначений") ИЛИ РезультатПечати.Количество() <> 1 Тогда
		ВызватьИсключение "Не удалось сформировать печатную форму """ + ВнешняяПечатнаяФорма + """ для документа " + Документ;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ИмяФайла = РезультатПечати[0].СинонимМакета + " № " + Документ.Номер + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy") + ".pdf";
	
	ИмяФайла = ЗаменитьНедопустимыеСимволы(ИмяФайла);
	
	РезультатПечати[0].ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);		
		
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(НомерДокумента)
		
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(НомерДокумента, ТекСимвол) <> 0 Тогда
			НомерДокумента = СтрЗаменить(НомерДокумента, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат НомерДокумента;
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Функция ИспользуетсяАктСверкиВзаиморасчетов2_0_90()
	
	МинимальнаяВерсия = "2.0.90.00";
	ВерсияБГУ = ВерсияПодсистемыБГУ();
	Результат = ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияБГУ, МинимальнаяВерсия) >= 0;
	
	Возврат Результат;
	
КонецФункции

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  НомерДокумента - Строка - Номер документа учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПредставлениеНомера(НомерДокумента)
	
	УдалитьПрефиксИнформационнойБазы	= Истина;
	УдалитьПользовательскийПрефикс		= Ложь;
	
	МодульПрефиксацияОбъектов = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
	Результат = МодульПрефиксацияОбъектов.НомерНаПечать(НомерДокумента, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа СчетНаОплату
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_СчетНаОплату()
	
	Возврат "СчетНаОплату";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документов продажи
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ДокументПродажи()
	
	Возврат "ДокументПродажи";
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

Функция ОсновнаяСтрана()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "РОССИЯ");
	Результат.Вставить("Код", "643");
	
	Возврат Результат;
	
КонецФункции

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКонтактнойИнформации()
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес", "ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	Результат.Вставить("Телефон", "Телефон");
	Результат.Вставить("Факс", "Факс");
	
	Возврат Результат;
	
КонецФункции

Функция ВидАдресаЮрФизЛица(Ссылка, ТипАдреса, ЭтоЮрЛицо)
	
	Перем Результат, ИмяВладельца;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		ИмяВладельца = "Организации";
		ПрефиксВидаЮр = "ЮрАдрес";
		ПрефиксВидаФакт = "ФактАдрес";
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Если ЭтоЮрЛицо Тогда
			ИмяВладельца = "Контрагенты";
			ПрефиксВидаЮр = "ЮридическийАдрес";
			ПрефиксВидаФакт = "ФактическийАдрес";
		Иначе
			ИмяВладельца = "ФизическиеЛица";
			ПрефиксВидаЮр = "АдресПоПрописке";
			ПрефиксВидаФакт = "АдресМестаПроживания";
		КонецЕсли;
		
	Иначе
		ИмяВладельца = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВладельца) Тогда
		
		ВидыКИЮридическийАдрес = Перечисление_ВидыКонтактнойИнформации().ЮридическийАдрес;
		
		Если ТипАдреса = ВидыКИЮридическийАдрес Тогда
			ИмяВида = ПрефиксВидаЮр;
		Иначе
			ИмяВида = ПрефиксВидаФакт;
		КонецЕсли;
		
		ВидЭлементаКИ = ИмяВида + ИмяВладельца;
		
		Результат = Справочники.ВидыКонтактнойИнформации[ВидЭлементаКИ];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)
	
	ЭлементыАдресногоОбъекта = Новый Массив;
	ЭлементыАдресногоОбъекта.Добавить(Элемент1);
	ЭлементыАдресногоОбъекта.Добавить(Элемент2);
	
	Результат = СокрЛП(СтрСоединить(ЭлементыАдресногоОбъекта, " "));
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблон("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Результат = Ядро.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	Возврат Результат;
КонецФункции

Функция НаименованиеИННКПП(Наименование, ИНН, КПП)
	
	Если ЗначениеЗаполнено(КПП) Тогда
		Результат = СтрШаблон("%1, ИНН/КПП %2/%3", Наименование, ИНН, КПП);
	Иначе
		Результат = СтрШаблон("%1, ИНН %2", Наименование, ИНН);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

НеИспользуется_РежимУправляемыхФорм = Истина; // Определяет версию типового модуля: ОФ / УФ

