
&НаКлиенте
Функция Модуль_КонтурПлагин()
	
	Возврат ПолучитьФорму("ВнешняяОбработка.Модуль_КонтурПлагин.Форма.КлиентскиеВызовы");
	
КонецФункции

&НаСервере
Функция Модуль_КонтурПлагинСервер()
	
	Модуль_КонтурПлагин = РеквизитФормыВЗначение("Объект");
	
	Возврат Модуль_КонтурПлагин;
	
КонецФункции

&НаКлиенте
Процедура Тест_НачатьУстановкуПлагина(Команда)
	
	Модуль = Модуль_КонтурПлагин();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Тест_НачатьУстановкуПлагина_Завершение", ЭтаФорма);
	
	Модуль.НачатьУстановкуПлагинаВебКлиент(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_НачатьУстановкуПлагина_Завершение(П1, П2) Экспорт
	
	Сообщить("Плагин успешно установлен");
	
КонецПроцедуры

&НаСервере
Функция Тест_GetBox_Сервер(КлючРазработчика)
	
	Возврат Модуль_КонтурПлагинСервер().DD_API_GetBox(КлючРазработчика, BoxId);
	
КонецФункции

&НаКлиенте
Функция Тест_GetBox_Клиент(КлючРазработчика)
	
	Возврат Модуль_КонтурПлагин().DD_API_GetBox(КлючРазработчика, BoxId);
	
КонецФункции

&НаКлиенте
Процедура Тест_GetBox(Команда)
	
	КлючРазработчика = "1C-DDPro-v1-2-26113adb-9bda-4547-a8b2-c26caf8d60d3";
	
	Box = Модуль_КонтурПлагин().DD_API_GetBox(КлючРазработчика, BoxId);
	
	Сообщить("Box с клиента" + Символы.ПС + Тест_GetBox_Сервер(КлючРазработчика));
	
	Сообщить("Box с сервера" + Символы.ПС + Тест_GetBox_Клиент(КлючРазработчика));
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_НачатьВызов_GetBox(Команда)
	
	КлючРазработчика = "1C-DDPro-v1-2-26113adb-9bda-4547-a8b2-c26caf8d60d3";
	
	Box = Модуль_КонтурПлагин().DD_API_GetBox(КлючРазработчика, BoxId);
	
	Сообщить("Box с клиента" + Символы.ПС + Тест_GetBox_Сервер(КлючРазработчика));
	
	Сообщить("Box с сервера" + Символы.ПС + Тест_GetBox_Клиент(КлючРазработчика));
	
КонецПроцедуры

&НаКлиенте
Функция Тест_НачатьВызов_cert_search(Элемент = Неопределено)
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("РасположениеХранилища", "user");
	ПараметрыПоиска.Вставить("ЕстьЗакрытыйКлюч"		, Истина);
	
	СвойстваСертификата = ВсеСвойстваСертификата();
	СвойстваСертификата.Удалить(СвойстваСертификата.Найти("ДвоичныеДанные"));
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("Тест_ЗавершитьВызов_cert_search", ЭтаФорма);
	Результат = Модуль_КонтурПлагин().ПолучитьСписокСертификатов_НачатьВызов(ОбработчикЗавершения, ПараметрыПоиска, СвойстваСертификата);
	
	//ПараметрыПоиска = Новый Структура;
	//ПараметрыПоиска.Вставить("Отпечаток", ОтпечатокСертификата);
	//Результат = ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	//
	//ПараметрыПоиска = Новый Структура;
	//ПараметрыПоиска.Вставить("ТипХранилища", "My");
	//ПараметрыПоиска.Вставить("РасположениеХранилища", "user");
	//ПараметрыПоиска.Вставить("Отпечаток", ОтпечатокСертификата);
	//ПараметрыПоиска.Вставить("ЕстьЗакрытыйКлюч", Истина);
	//
	//Результат = ПолучитьСписокСертификатов(ПараметрыПоиска, ВсеСвойстваСертификата());
	
	Сообщить("Тест_cert_search" + Символы.ПС + Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Тест_ЗавершитьВызов_cert_search(ОтветПлагина, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	Результат = Модуль_КонтурПлагин().РазобратьОтветПлагина(ОтветПлагина);
	
	Сообщить("Тест_cert_search" + Символы.ПС + Результат);
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Функция ВсеСвойстваСертификата()
	
	Результат = Новый Массив;
	Результат.Добавить("СерийныйНомер");
	Результат.Добавить("ДвоичныеДанные");
	Результат.Добавить("Издатель");
	Результат.Добавить("Субъект");
	Результат.Добавить("ДатаНачала");
	Результат.Добавить("ДатаОкончания");
	Результат.Добавить("ЕстьЗакрытыйКлюч");
	
	Возврат Результат;
	
КонецФункции

