#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОсновнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, ПослеВыполненияКоманды) Экспорт
	
	ДокументУчета = КонтурИнтеграцияМодульДиадокКлиентСервер.ДокументУчетаИзФормыДокумента(Форма);
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета)
		Или Форма.Модифицированность Тогда
		
		ОписаниеИсключенияЛок = НСтр("ru = 'Для продолжения необходимо записать документ.'");
		
		ВызватьИсключение ОписаниеИсключенияЛок;
		
	КонецЕсли;
	
	ОсновныеКомандыМодуля = КонтурИнтеграцияМодульДиадокКлиентСервер.ОсновныеКомандыМодуля();
	
	Если Команда.Имя = ОсновныеКомандыМодуля.Отправить.Имя Тогда
		
		ВыполнитьКомандуОтправитьЭД(ДокументУчета, ПослеВыполненияКоманды);
		
	ИначеЕсли Команда.Имя = ОсновныеКомандыМодуля.Открыть.Имя Тогда
		
		ВыполнитьКомандуОткрытьЭД(ДокументУчета, ПослеВыполненияКоманды);
		
	Иначе
		
		ОписаниеИсключенияЛок = НСтр("ru = 'Попытка выполнить неизвестную команду для модуля Диадок. %1'");
		
		ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(ОписаниеИсключенияЛок, Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОсновнуюКомандуКонтурИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьКомандыФормыДокумента(ДополнительныеПараметры.Форма, ДополнительныеПараметры.ИмяМодуля);
	
	ВладелецФормыДокумента = ДополнительныеПараметры.Форма.ВладелецФормы;
	Если ВладелецФормыДокумента <> Неопределено Тогда
		
		Если ТипЗнч(ВладелецФормыДокумента) <> Тип("ФормаКлиентскогоПриложения") Тогда
			Возврат;
		КонецЕсли;
		
		ОбновитьКомандыФормыДокумента(ВладелецФормыДокумента, ДополнительныеПараметры.ИмяМодуля);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, Оповещение) Экспорт
	
	ДокументУчета = КонтурИнтеграцияМодульДиадокКлиентСервер.ДокументУчетаИзФормыДокумента(Форма);
	
	КонтурДиадокКлиент.Открыть(ДокументУчета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьКомандуОтправитьЭД(ДокументУчета, ПослеВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументУчета", ДокументУчета);
	ДополнительныеПараметры.Вставить("ПослеВыполненияКоманды", ПослеВыполненияКоманды);
	
	ПослеЗакрытияДокументаУчета = Новый ОписаниеОповещения(
		"СлужебныйОбработчик_ПослеЗакрытияДокументаУчета",
		ЭтотОбъект,
		ПослеВыполненияКоманды
	);
	
	КонтурДиадокКлиент.ОтправитьДокументУчета(ДокументУчета, ПослеЗакрытияДокументаУчета);
	
КонецПроцедуры

Процедура ВыполнитьКомандуОткрытьЭД(ДокументУчета, ПослеВыполненияКоманды)
	
	ПослеЗакрытияДокументаУчета = Новый ОписаниеОповещения(
		"СлужебныйОбработчик_ПослеЗакрытияДокументаУчета",
		ЭтотОбъект,
		ПослеВыполненияКоманды
	);
	
	КонтурДиадокКлиент.ОткрытьДокументУчета(ДокументУчета, ПослеЗакрытияДокументаУчета);
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ПослеЗакрытияДокументаУчета(Результат, ПослеВыполненияКоманды) Экспорт
	
	ВыполнитьОбработкуОповещения(ПослеВыполненияКоманды);
	
КонецПроцедуры

Процедура ОбновитьКомандыФормыДокумента(ФормаДокумента, ИмяМодуля)
	
	ДокументУчета = КонтурИнтеграцияМодульДиадокКлиентСервер.ДокументУчетаИзФормыДокумента(ФормаДокумента);
	АктивнаяКоманда = КонтурИнтеграцияМодульДиадокВызовСервера.АктивнаяКоманда(ДокументУчета);
	
	Если АктивнаяКоманда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновляемыеКоманды = Новый Массив;
	МодульКонтурИнтеграцияКлиентСервер =
		КонтурДиадокСтдОбщегоНазначенияКлиент.ОбщийМодульЛок("КонтурИнтеграцияКлиентСервер");
	ОсновныеКомандыМодуля = КонтурИнтеграцияМодульДиадокКлиентСервер.ОсновныеКомандыМодуля();
	
	Для Каждого ЭлементКомандыМодуля Из ОсновныеКомандыМодуля Цикл
		
		ОсновнаяКомандаМодуля = ЭлементКомандыМодуля.Значение;
		
		ОписаниеКоманды = МодульКонтурИнтеграцияКлиентСервер.ОписаниеКоманды("Диадок", ОсновнаяКомандаМодуля.НомерКоманды);
		ОписаниеКоманды.Заголовок = ОсновнаяКомандаМодуля.Заголовок;
		ОписаниеКоманды.Видимость = ОсновнаяКомандаМодуля.Имя = АктивнаяКоманда.Имя;
		ОписаниеКоманды.Доступность = Истина;
		
		ОбновляемыеКоманды.Добавить(ОписаниеКоманды);
		
	КонецЦикла;
	
	МодульКонтурИнтеграцияКлиент = КонтурДиадокСтдОбщегоНазначенияКлиент.ОбщийМодульЛок("КонтурИнтеграцияКлиент");
	МодульКонтурИнтеграцияКлиент.ОбновитьОсновныеКоманды(ФормаДокумента, ОбновляемыеКоманды);
	
КонецПроцедуры

#КонецОбласти