////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции по работе с диалогами для 1С:Предприятие 8.3.3
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ПоказатьВводДатыЛок(ОписаниеОповещенияОЗавершении, Дата = Неопределено,
		Подсказка = "", ЧастьДаты = Неопределено) Экспорт
	
	Если ЧастьДаты = Неопределено Тогда
		ЧастьДатыСлужебный = ЧастиДаты.ДатаВремя;
	Иначе
		ЧастьДатыСлужебный = ЧастьДаты;
	КонецЕсли;
	
	ПоказатьВводДаты(ОписаниеОповещенияОЗавершении, Дата, Подсказка, ЧастьДатыСлужебный);
	
КонецПроцедуры // ПоказатьВводДатыЛок

Процедура ПоказатьВводЗначенияЛок(ОписаниеОповещенияОЗавершении, Значение, Подсказка = "", Тип = Неопределено) Экспорт
	
	ПоказатьВводЗначения(ОписаниеОповещенияОЗавершении, Значение, Подсказка, Тип);
	
КонецПроцедуры // ПоказатьВводЗначенияЛок

Процедура ПоказатьВводСтрокиЛок(ОписаниеОповещенияОЗавершении, Строка = "", Подсказка = "",
		Длина = 0, Многострочность = Ложь) Экспорт
	
	ПоказатьВводСтроки(ОписаниеОповещенияОЗавершении, Строка, Подсказка, Длина, Многострочность);
	
КонецПроцедуры // ПоказатьВводСтрокиЛок

Процедура ПоказатьВводЧислаЛок(ОписаниеОповещенияОЗавершении, Число, Подсказка = "", Длина = 0, Точность = 0) Экспорт
	
	ПоказатьВводЧисла(ОписаниеОповещенияОЗавершении, Число, Подсказка, Длина, Точность);
	
КонецПроцедуры // ПоказатьВводЧислаЛок

Процедура ПоказатьВопросЛок(ОписаниеОповещенияОЗавершении, ТекстВопроса, Кнопки, Таймаут = 0,
		КнопкаДиалогаПоУмолчанию = Неопределено, ЗаголовокДиалога = "", КнопкаТаймаута = Неопределено) Экспорт
	
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении,
		ТекстВопроса, Кнопки, Таймаут, КнопкаДиалогаПоУмолчанию, ЗаголовокДиалога, КнопкаТаймаута);
	
КонецПроцедуры // ПоказатьВопросЛок

Процедура ПоказатьПредупреждениеЛок(ОписаниеОповещенияОЗавершении = Неопределено, // BSLLS:OrderOfParams-off
		ТекстПредупреждения, Таймаут = 0, ЗаголовокДиалога = "") Экспорт
	
	ПоказатьПредупреждение(ОписаниеОповещенияОЗавершении, ТекстПредупреждения, Таймаут, ЗаголовокДиалога);
	
КонецПроцедуры // ПоказатьПредупреждениеЛок

Процедура ПоказатьОповещениеПользователяЛок(Текст = "", ДействиеПриНажатии = Неопределено, Пояснение = "",
		Картинка = Неопределено, СтатусОповещенияПользователя = Неопределено, КлючУникальности = "") Экспорт
	
	ПоказатьОповещениеПользователя(Текст, ДействиеПриНажатии, Пояснение, Картинка,
			СтатусОповещенияПользователя, КлючУникальности);
	
КонецПроцедуры // ПоказатьОповещениеПользователяЛок

Процедура ПоказатьЗначениеЛок(ОписаниеОповещенияОЗавершении = Неопределено, Значение) Экспорт // BSLLS:OrderOfParams-off
	
	ПоказатьЗначение(ОписаниеОповещенияОЗавершении, Значение);
	
КонецПроцедуры // ПоказатьЗначениеЛок