#Область ПрограммныйИнтерфейс

// Добавляет команды Диадока в панель команд Контура
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, на которую необходимо добавить команды Диадока
//
Процедура ДокументПриСозданииНаСервереПосле(Форма) Экспорт
	
	ДобавитьОсновныеКоманды(Форма);
	ДобавитьДополнительнуюКоманду(Форма);
	
КонецПроцедуры

// Определяет команду, которую надо показать для документа 1С, если тип документа не поддерживается, то Неопределено
//
// Параметры:
//  ДокументУчета - ДокументСсылка - документ 1С для которого необходимо определить активную команду
//
// Возвращаемое значение:
//  Структура, Неопределено - см. КонтурИнтеграцияМодульДиадокКлиентСервер.ОсновныеКомандыМодуля()
//
Функция АктивнаяКоманда(ДокументУчета) Экспорт
	
	Результат = Неопределено;
	
	ДанныеДляОткрытияПакета = КонтурДиадокСервер.ДанныеДляОткрытияПакета(ДокументУчета);
	
	Если НЕ ДанныеДляОткрытияПакета.ТипДокументаПоддерживается Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДокументДляПакета = ДанныеДляОткрытияПакета.ДокументДляПакета;
	
	Если ЗначениеЗаполнено(ДокументДляПакета) Тогда
		ЕстьЭлектронныйДокумент = КонтурДиадокСервер.ЕстьЭлектронныйДокументПоДокументу1С(ДокументДляПакета);
	Иначе
		ЕстьЭлектронныйДокумент = Ложь;
	КонецЕсли;
	
	ОсновныеКомандыМодуля = КонтурИнтеграцияМодульДиадокКлиентСервер.ОсновныеКомандыМодуля();
	
	Если ЕстьЭлектронныйДокумент Тогда
		Результат = ОсновныеКомандыМодуля.Открыть;
	Иначе
		Результат = ОсновныеКомандыМодуля.Отправить;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОсновныеКоманды(Форма)
	
	ДокументУчета = КонтурИнтеграцияМодульДиадокКлиентСервер.ДокументУчетаИзФормыДокумента(Форма);
	АктивнаяКоманда = АктивнаяКоманда(ДокументУчета);
	
	Если АктивнаяКоманда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсновныеКоманды = Новый Массив;
	МодульКонтурИнтеграцияКлиентСервер = КонтурДиадокСтдОбщегоНазначения.ОбщийМодульЛок("КонтурИнтеграцияКлиентСервер");
	ОсновныеКомандыМодуля = КонтурИнтеграцияМодульДиадокКлиентСервер.ОсновныеКомандыМодуля();
	
	Для Каждого ЭлементКомандыМодуля Из ОсновныеКомандыМодуля Цикл
		
		ОсновнаяКомандаМодуля = ЭлементКомандыМодуля.Значение;
		
		ОписаниеКоманды = МодульКонтурИнтеграцияКлиентСервер.ОписаниеКоманды("Диадок", ОсновнаяКомандаМодуля.НомерКоманды);
		ОписаниеКоманды.Заголовок = ОсновнаяКомандаМодуля.Заголовок;
		ОписаниеКоманды.Видимость = ОсновнаяКомандаМодуля.Имя = АктивнаяКоманда.Имя;
		ОписаниеКоманды.Доступность = Истина;
		
		ОсновныеКоманды.Добавить(ОписаниеКоманды);
		
	КонецЦикла;
	
	МодульКонтурИнтеграция = КонтурДиадокСтдОбщегоНазначения.ОбщийМодульЛок("КонтурИнтеграция");
	МодульКонтурИнтеграция.ДобавитьОсновныеКоманды(Форма, ОсновныеКоманды);
	
КонецПроцедуры

Процедура ДобавитьДополнительнуюКоманду(Форма)
	
	МодульКонтурИнтеграцияКлиентСервер = КонтурДиадокСтдОбщегоНазначения.ОбщийМодульЛок("КонтурИнтеграцияКлиентСервер");
	ДополнительнаяКомандаМодуля = КонтурИнтеграцияМодульДиадокКлиентСервер.ДополнительнаяКомандаМодуля();
	
	ОписаниеКоманды = МодульКонтурИнтеграцияКлиентСервер.ОписаниеКоманды(
		"Диадок",
		ДополнительнаяКомандаМодуля.НомерКоманды
	);
	ОписаниеКоманды.Заголовок = ДополнительнаяКомандаМодуля.Заголовок;
	ОписаниеКоманды.Видимость = Истина;
	ОписаниеКоманды.Доступность = Истина;
	
	МодульКонтурИнтеграция = КонтурДиадокСтдОбщегоНазначения.ОбщийМодульЛок("КонтурИнтеграция");
	МодульКонтурИнтеграция.ДобавитьДополнительнуюКоманду(Форма, ОписаниеКоманды);
	
КонецПроцедуры

#КонецОбласти