#Область ПрограммныйИнтерфейс

// Получает текущий контекст сеанса пользователя
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - контекст сеанса пользователя:
//   * Ключ - Строка - адрес ящика
//   * Значение - ФиксированнаяСтруктура - см. КонтурДиадокЯдро.МодельСтрокаКонтекстаСеанса()
//
Функция КонтекстСеанса() Экспорт
	
	Результат = ПараметрыСеанса.КонтурДиадокКонтекстСеанса;
	Возврат Результат;
	
КонецФункции

// Устанавливает контекст сеанса пользователя на время работы клиентского приложения.
//
// Параметры:
//  КонтекстСеанса - ФиксированноеСоответствие - см. КонтекстСеанса()
//
Процедура КонтекстСеансаУстановить(КонтекстСеанса) Экспорт
	
	ПараметрыСеанса.КонтурДиадокКонтекстСеанса = КонтурДиадокСтдКоллекцииКлиентСервер.ФиксированныеДанныеЛок(КонтекстСеанса);
	
КонецПроцедуры

Функция ЕстьЭлектронныйДокументПоДокументу1С(ДокументУчета) Экспорт
	
	Результат = МодульЯдро().ДокументыУчета_ДокументОтправлен(ДокументУчета);
	
	Возврат Результат;
	
КонецФункции

// Определяет по указанному документу 1С данные для формарования доступных команд
//
// Параметры:
//  ДокументУчета - ДокументСсылка - документ 1С для которого необходимо подготовить данные
//
// Возвращаемое значение:
//  Структура:
//    * ТипДокументаПоддерживается - Булево - поддерживает модуль ДД работу с данным типом документов или нет
//    * ДокументДляПакета - ДокументСсылка - документ 1С, который используется для открытия пакета
//
Функция ДанныеДляОткрытияПакета(ДокументУчета) Экспорт
	
	РеквизитыДокумента = МодульЯдро().ДокументыУчета_РеквизитыДокументаУчетаДляПакетаНаОтправку(ДокументУчета);
	
	Результат = МодельДанныеДляОткрытияПакета();
	Результат.ТипДокументаПоддерживается = РеквизитыДокумента.ТипДокументаПоддерживается;
	Результат.ДокументДляПакета = РеквизитыДокумента.Документ;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(Знач ИмяСобытия, Знач ПодробноеПредставлениеОшибки) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка, , ,
		ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Для вызова из одноименного обработчика модуля сеанса.
//
// Параметры:
//  ИменаПараметровСеанса - Массив из Строка, Неопределено - имена параметров сеанса, которые нужно инициализировать.
//
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	Если ИменаПараметровСеанса = Неопределено
		Или ИменаПараметровСеанса.Найти("КонтурДиадокКонтекстСеанса") <> Неопределено Тогда
		
		ПараметрыСеанса.КонтурДиадокКонтекстСеанса = Новый ФиксированноеСоответствие(Новый Соответствие);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульЯдро()
	
	ОсновнойМодуль = Обработки.КонтурЭДО.Создать();
	ОсновнойМодуль.ИнициализироватьОбщийКонтекст();
	
	Результат = ОсновнойМодуль.Модуль_Ядро();
	
	Возврат Результат;
	
КонецФункции

Функция МодельДанныеДляОткрытияПакета()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипДокументаПоддерживается", Ложь);
	Результат.Вставить("ДокументДляПакета", Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти