
////////////////////////////////////////////////////////////////////////////////
// API для работы с формой

&НаКлиенте
Процедура фОткрытьФорму() Экспорт 
	
	Если Открыта() Тогда
		Активизировать();
	Иначе
		Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура фЗакрытьФорму() Экспорт 
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокВыполненнойОчереди(Знач стрЗаголовок) Экспорт 
	
	ЗаголовокВыполненнойОчереди = стрЗаголовок;
	УстановитьНадписиПриОтправкеПакетов(0, 0);
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМаксимальноеЗначение(Знач чМаксимальноеЗначение) Экспорт 
	
	Элементы.ИндикаторПрогресса.МаксимальноеЗначение = чМаксимальноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовок(Знач стрЗаголовок) Экспорт 
	
	Элементы.ИндикаторПрогресса.Заголовок = стрЗаголовок;
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПрогресса(Знач чЗначение) Экспорт 
	
	ТекущееЗначениеПрогресса = чЗначение;
	фОткрытьФорму();
	ОбновитьОтображениеДанных();
		
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьЗначениеПрогресса(Знач чЗначение = 1) Экспорт 
	
	Если МассоваяОбработка Тогда
		ТекущееЗначениеПрогресса = ТекущееЗначениеПрогресса + чЗначение;
		ОбновитьОтображениеДанных();
	КонецЕсли;
		
КонецПроцедуры

Функция ПрогрессВыполнен() Экспорт 
	
	Возврат (ТекущееЗначениеПрогресса = Элементы.ИндикаторПрогресса.МаксимальноеЗначение)
			Или (РазмерОчередиПодготовленныхПакетов = 0 И РазмерОчередиОтправленныхПакетов = 0);  
			// костыль на подписание входящих - та неправильно отрабатывает счетчик по документам, ответы на которые еще не готовы или уже отправлены
	
КонецФункции

// API для работы с формой
////////////////////////////////////////////////////////////////////////////////


&НаКлиенте
Процедура УстановитьНадписиПриОтправкеПакетов(парРазмерОчередиПодготовленныхПакетов, парРазмерОчередиОтправленныхПакетов) Экспорт
	
	//ЭтаФорма.Заголовок = "Обработано пакетов для отправки: " + ТекущееЗначениеПрогресса + " из " + Элементы.ИндикаторПрогресса.МаксимальноеЗначение;
	РазмерОчередиПодготовленныхПакетов	= парРазмерОчередиПодготовленныхПакетов;
	РазмерОчередиОтправленныхПакетов	= парРазмерОчередиОтправленныхПакетов;
	
	Элементы.НадписьКомментарий1.Заголовок = "Очередь подготовленных данных: " + РазмерОчередиПодготовленныхПакетов;
	Элементы.НадписьКомментарий2.Заголовок = ЗаголовокВыполненнойОчереди + ": " + РазмерОчередиОтправленныхПакетов;
	ОбновитьОтображениеДанных();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассоваяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНадписи() Экспорт
	
	Элементы.НадписьКомментарий1.Заголовок = "";
	Элементы.НадписьКомментарий2.Заголовок = "";
	
КонецПроцедуры
