// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем ОсновнойМодуль Экспорт;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//{ СлужебныйПрограммныйИнтерфейс

// Событие возникает при определении фактического места хранения контактной информации объекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Организации")
//			И СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
//			
//			СтандартнаяОбработка = Ложь;
//			ХранилищеКИ = СсылкаНаОбъект.ИндивидуальныйПредприниматель;
//			
//		КонецЕсли;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие позволяет переопределить алгоритм вычисления вида контактной информации,
// соответствующего юр./физ. лицу и указанному типу контактной информации.
//
// Параметры:
//  ВидКИ - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации;
//  ЮрФизЛицо - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  ТипКИ - Строка - тип контактной информации (см. Перечисление_ВидыКИ);
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//		
//		Если ТипКИ = Перечисление_ВидыКИ().ЮридическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
//		ИначеЕсли ТипКИ = Перечисление_ВидыКИ().ФактическийАдрес Тогда
//			ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресФактический;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ВидКИ) Тогда
//			СтандартнаяОбработка = Ложь;
//		КонецЕсли;
//
Процедура ПриПолученииВидаКонтактнойИнформации(ВидКИ, ЮрФизЛицо, ТипКИ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Событие возникает при получении сведений об организации, контрагенте или физическом лице.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Загружает сведения о маркировке из товарной части ЭД в информационную базу.
//
// Параметры:
//  ДокументОбъект - ЛюбойОбъект - документ-владелец штрихкодов.
//  ТоварнаяЧасть - ТаблицаЗначений - данные товарной части электронного документа.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить загрузку средствами библиотеки интеграции ИС МП.
//
Процедура ЗагрузитьКодыМаркировки(ДокументОбъект, ТоварнаяЧасть, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет список правил создания и заполнения документов учета.
//
// Параметры:
//  ПравилаСоздания - СписокЗначений - (возвращаемый параметр) идентификаторы правил создания и их представления.
//  ФорматЭД - Структура - см. ОсновнойМодуль.НовоеОписаниеФорматаЭлектронногоДокумента.
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения правил.
//
Процедура ПриЗаполненииПравилСозданияДокументовУчета(ПравилаСоздания, ФорматЭД, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Обработка создания и заполнения документа учета по указанному правилу.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - (возвращаемый параметр) Заполняемый объект.
//  ИдентификаторОпераци - Строка - идентификатор правила создания и заполнения документа учета.
//  ПараметрыСоздания - Структура - см. ОсновнойМодуль.ПараметрыСозданияДокументаИнформационнойБазы.
//  ДанныеЭД - Структура - разобранное содержимое электронного документа (см. ОсновнойМодуль.ДанныеЭлектронногоДокумента)
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку заполнения объекта.
//
Процедура ПриСозданииДокументаУчета(ДокументОбъект, ИдентификаторОперации, ПараметрыСоздания, ДанныеЭД, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента 
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы переопределить стандартный обработчик
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. НовыеСвойстваНоменклатурыИБ.
//  НаборНоменклатуры - Массив из ЛюбаяСсылка - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(СвойстваНоменклатурИБ, НаборНоменклатуры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Возвращает признак применения Федерального Закона 
// который вводит понятие прослеживаемости для определенных групп товаров
// Параметры:
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ применяется
//           Ложь   - ФЗ не применяется
Функция ИспользуетсяУчетПрослеживаемыхТоваров(Дата) Экспорт
	
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальнаяЛогика.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура	- ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат = Неопределено;
	
	Возврат Результат;
	
КонецФункции

//} СлужебныйПрограммныйИнтерфейс

Функция ПолучитьМодульПрог(ИмяМодуля)
	
	Возврат ОсновнойМодуль.ПолучитьМодульПрог(ИмяМодуля);
	
КонецФункции 

Функция ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, дляСФ = Истина) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьПредставлениеСтавкиНДС(СтавкаНДС, дляСФ);
	
КонецФункции 

Функция ИдентификаторСвойстваИдентификаторДокументаВДиадок(DocumentType) Экспорт
	
	Если DocumentType = "NonformalizedProforma" Тогда
		Возврат "ИдентификаторДокументаВДиадокСч";
	ИначеЕсли DocumentType = "Invoice" Тогда
		Возврат "ИдентификаторДокументаВДиадокСФ";
	Иначе
		Возврат "ИдентификаторДокументаВДиадок";
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторСвойстваИдентификаторЯщикДокументаВДиадок(DocumentType) Экспорт
	
	Если DocumentType = "NonformalizedProforma" Тогда
		Возврат "ИдентификаторЯщикДокументаВДиадокСч"
	ИначеЕсли DocumentType = "Invoice" Тогда
		Возврат "ИдентификаторЯщикДокументаВДиадокСФ"
	Иначе	
		Возврат "ИдентификаторЯщикДокументаВДиадок"
	КонецЕсли;	
	
КонецФункции 

Функция ПустаяСсылкаНаНомерГТД() Экспорт
		
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПустаяСсылкаНаНомерГТД(); 
		
КонецФункции

Функция НДСПоДокументуИсчисляетсяНалоговымАгентом(ДокументСсылка) Экспорт
	
	Возврат Ложь;  // не поддерживается в данной конфигурации
	
КонецФункции // НДСПоДокументуИсчисляетсяНалоговымАгентом()

Функция ПолучитьВалютуРегламентированногоУчета() Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьВалютуРегламентированногоУчета();
	
КонецФункции


/////////////////////////////////////////////////////////////
// функции создания новых доков на основании данных ДД
/////////////////////////////////////////////////////////////

Функция ПолучитьСписокВидовДоговоров(ВидОперации = Неопределено) Экспорт
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	
	Если ВидОперации = "ВозвратОтПокупателя" Тогда
		СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	КонецЕсли;
	
	Возврат СписокВидовДоговоров;
КонецФункции

Процедура ЗаполнениеТабличнойЧасти(ДокОбъект, ТабличнаяЧасть, ВидОперации)
	
	Для каждого стр Из ТабличнаяЧасть Цикл
			ИмяТЧ = "";
			Если (видОперации = "ВозвратОтПокупателя") Или (стр.Тип = "Товар") Тогда
				стрОбъект = ДокОбъект.Товары.Добавить();
				ИмяТЧ = "Товары";
				Если   (видОперации <> "ВозвратОтПокупателя") Тогда
					стрОбъект.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
					стрОбъект.Коэффициент = 1;
				КонецЕсли;	
			ИначеЕсли стр.Тип = "Оборудование" Тогда
				стрОбъект = ДокОбъект.Оборудование.Добавить();
				ИмяТЧ = "Оборудование";
				стрОбъект.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
				стрОбъект.Коэффициент = 1;
			ИначеЕсли стр.Тип = "Объект стр" Тогда 	
				стрОбъект = ДокОбъект.ОбъектыСтроительства.Добавить();
				ИмяТЧ = "ОбъектыСтроительства";
			ИначеЕсли стр.Тип = "НМА" Тогда	
				стрОбъект = ДокОбъект.НематериальныеАктивы.Добавить();
				ИмяТЧ = "НематериальныеАктивы";
	
			Иначе
				стрОбъект = ДокОбъект.Услуги.Добавить();
				ИмяТЧ = "Услуги";

				стрОбъект.Содержание = стр.НоменклатураИзЭД;
				стрОбъект.Номенклатура = стр.Номенклатура;
				
				Если НЕ ЗначениеЗаполнено(стрОбъект.СтатьяЗатрат) Тогда
					стрОбъект.СтатьяЗатрат = стрОбъект.Номенклатура.СтатьяЗатрат;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(стрОбъект.НоменклатурнаяГруппа) Тогда
					стрОбъект.НоменклатурнаяГруппа = стрОбъект.Номенклатура.НоменклатурнаяГруппаЗатрат;
				КонецЕсли;
				
				Если ДокОбъект.Метаданные().Реквизиты.найти("ПодразделениеОрганизации")<>Неопределено Тогда 
					стрОбъект.ПодразделениеОрганизации = ДокОбъект.ПодразделениеОрганизации;
				КонецЕсли;
				
				Если ДокОбъект.Метаданные().Реквизиты.найти("Подразделение")<>Неопределено Тогда 
					стрОбъект.Подразделение = ДокОбъект.Подразделение;
				КонецЕсли;
				
				
			КонецЕсли;
			
			Если стр.Тип =  "Объект стр" Тогда 
				стрОбъект.ОбъектСтроительства =   стр.Номенклатура;
			ИначеЕсли стр.Тип =  "НМА" Тогда 
				стрОбъект.НематериальныйАктив =   стр.Номенклатура;				
			Иначе 	
				стрОбъект.Номенклатура = стр.Номенклатура;
				стрОбъект.Количество = стр.Количество;
				стрОбъект.Цена = стр.Цена;
				Если ТабличнаяЧасть.Колонки.Найти("Серия") <> Неопределено Тогда
					стрОбъект.СерияНоменклатуры = Стр.Серия;
				КонецЕсли;
			КонецЕсли;	
			стрОбъект.Сумма = стр.Сумма;
			стрОбъект.СуммаНДС = стр.СуммаНДС;
			стрОбъект.СтавкаНДС = стр.СтавкаНДС;
			
		КонецЦикла;
	
	КонецПроцедуры
	
Функция СоздатьДокументПоступлениеТоваровУслуг(параметры, стВероятныеПоля, ЭДОбъект, ТабличнаяЧасть = Неопределено, СуммаВключаетНДС = Истина, ВидОперации, ЗаполнениеГТД = Ложь) Экспорт
	
	Если ВидОперации = "ВозвратОтПокупателя" Тогда 
		НовыйДокумент = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
	Иначе 	
		НовыйДокумент = Документы.ПриходнаяНакладная.СоздатьДокумент();
		НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.НаСклад;
	КонецЕсли;	
	
	НовыйДокумент.ДоговорКонтрагента= Параметры.ДоговорКонтрагента;
	НовыйДокумент.ВалютаДокумента= НовыйДокумент.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	НовыйДокумент.КратностьВзаиморасчетов= 1;
	НовыйДокумент.Склад= Параметры.Склад;
	
	Если ВидОперации <> "ВозвратОтПокупателя" Тогда
		НовыйДокумент.ДатаСчетаФактуры = параметры.ДатаВходящегоДокумента;
		НовыйДокумент.ВходящийНомер = параметры.НомерВходящегоДокумента;
	КонецЕсли;
	    
	// Заполнение возможных полей
	Если стВероятныеПоля.Организация = Неопределено Тогда
		Сообщить("Организация в системе Диадок: """ + ЭДОбъект.Organization.Name + """, ИНН/КПП: " + ЭДОбъект.Organization.Inn + "/" + ЭДОбъект.Organization.Kpp + " не ассоциирована с организацияей в 1С");
	Иначе
		НовыйДокумент.Фирма = стВероятныеПоля.Организация;
	КонецЕсли;
	Если стВероятныеПоля.Контрагент = Неопределено Тогда
		Сообщить("Контрагент в системе Диадок: """ + ЭДОбъект.counterAgent.Name + """, ИНН/КПП: " + ЭДОбъект.counterAgent.Inn + "/" + ЭДОбъект.counterAgent.Kpp + " не ассоциирован с контрагентом в 1С");
	Иначе
		НовыйДокумент.Контрагент = стВероятныеПоля.Контрагент;
		ПриИзмененииЗначенияДоговора(НовыйДокумент, Неопределено, ПолучитьВалютуРегламентированногоУчета(), ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(НовыйДокумент), "Покупка", "Товары");
	КонецЕсли;
	
	Если ТабличнаяЧасть <> Неопределено Тогда
		ЗаполнениетабличнойЧасти(НовыйДокумент, ТабличнаяЧасть, ВидОперации);
	КонецЕсли;
	
	НовыйДокумент.СуммаВключаетНДС = СуммаВключаетНДС;
	НовыйДокумент.УчитыватьНДС = Истина;
	
	Возврат НовыйДокумент;
	
КонецФункции

Процедура ЗаполнитьРеквизиты_СчетФактураПолученный(ДокументОбъект, Document, ПараметрыЗаполнения) Экспорт
	
	ДокументОбъект.НомерСчетаФактуры= СокрЛП(Document.DocumentNumber);
	
КонецПроцедуры

Функция СоздатьДокумент_СчетФактураПолученный(Document, ДокументОснование, ПараметрыЗаполнения) Экспорт
	
	Если ТипЗнч(ДокументОснование) = Тип("Массив") Тогда
		ДокументыОснования= ДокументОснование;
	Иначе
		ДокументыОснования= Новый Массив;
		ДокументыОснования.Добавить(ДокументОснование);
	КонецЕсли;
	
	ДокументОбъект= ДокументыОснования[0].ПолучитьОбъект();
	
	ДокументОбъект.НомерСчетаФактуры= СокрЛП(Document.DocumentNumber);
	
	Возврат ДокументОбъект;
	
КонецФункции

Функция ДиадокПолучитьОсновнойДоговорКонтрагента(Контрагент, Организация, СписокВидовДоговоров) Экспорт
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.ОсновнойДоговорКонтрагента КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Контрагенты.ОсновнойДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|			И (ДоговорыКонтрагентов.Фирма = &Организация)
	|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|			И (ДоговорыКонтрагентов.ВидДоговора В (&СписокДоговоров))
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокВидовДоговоров);
	
	РезультатЗапроса= Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка
	КонецЕсли;
		
КонецФункции



/////////////////////////////////////////////////////////////
// Связи объектов
/////////////////////////////////////////////////////////////

Функция ПолучитьСтавкуНДСДиадок(TaxRate) Экспорт
	
	Если TaxRate = "10" ИЛИ TaxRate = "10.00" Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли TaxRate = "18" ИЛИ TaxRate = "18.00" Тогда
		Возврат Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли TaxRate = "20" ИЛИ TaxRate = "20.00" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");	
	ИначеЕсли TaxRate = "0" Тогда
		Возврат перечисления.СтавкиНДС.НДС0
	ИначеЕсли (TaxRate = "") Тогда
		Возврат Перечисления.СтавкиНДС.БезНДС;
	Иначе 
		Возврат "";
	КонецЕсли;

КонецФункции

Функция ПолучитьЕдиницуИзмерения(КодЕИ, НаименованиеЕИ, Номенклатура) Экспорт
	
	//перебираем все ИЕ для номенклатуры, и ищем по полному совпадению, либо по наличию коэффициента пересчета
	
	ПодходящаяЕИ = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЕИ.Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения ЕИ
		|ГДЕ
		|	ЕИ.Владелец = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока  Выборка.Следующий() Цикл
			ЕИ_ПоКлассификатору =  Выборка.Ссылка.ЕдиницаПоКлассификатору;
			Если (ЕИ_ПоКлассификатору.код = КодЕИ) или (ЕИ_ПоКлассификатору.наименование = НаименованиеЕИ) Тогда 
				Возврат  Выборка.Ссылка;
			КонецЕсли;	
            Коэф = ОсновнойМодуль.ПолучитьКоэффициентПересчета(КодЕИ, ЕИ_ПоКлассификатору.Код);
			Если коэф <> Неопределено Тогда 
				ПодходящаяЕИ = выборка.ссылка;
			КонецЕсли;	
		КонецЦикла;
		
		Возврат ?(ПодходящаяЕИ = Неопределено, справочники.ЕдиницыИзмерения.ПустаяСсылка(), ПодходящаяЕИ);
	
КонецФункции

Функция ПолучитьКоэффициентПересчета(КодЕИ, НаименованиеЕИ, НоваяЕдиницаИзмерения) Экспорт
	Если (НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.код = КодЕИ) или (НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.наименование = НаименованиеЕИ) Тогда 
		Возврат 1;
	КонецЕсли;
	
	Коэф = ОсновнойМодуль.ПолучитьКоэффициентПересчета(КодЕИ, НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору.код);
	Возврат ?(коэф = Неопределено, 1, коэф);
	
КонецФункции

Функция ЕстьВозможностьЗаполненияГТД(Видоперации, ЭДОбъект) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЕстьВозможностьЗаполненияГТД(Видоперации, ЭДОбъект);	
КонецФункции

Функция ЕстьВозможностьЗаполненияСерий(Видоперации, ЭДОбъект) Экспорт
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЕстьВозможностьЗаполненияСерий(Видоперации, ЭДОбъект);	
КонецФункции

Функция Документ_Организация(Документ) Экспорт

	Возврат Документ.Фирма

КонецФункции

Функция Организация_КПП(Организация) Экспорт

	Возврат ПолучитьЗначениеПериодическогоРеквизита(Организация, "КПП", '00010101')

КонецФункции

Функция ПолучитьДатуНомерВходящейНакладной(ДокСсылка) Экспорт 
	
	Результат= Новый Структура("ДатаВходящегоДокумента, НомерВходящегоДокумента");
	
	Результат.ДатаВходящегоДокумента=  ДокСсылка.ДатаСчетаФактуры;
	Результат.НомерВходящегоДокумента= ДокСсылка.ВходящийНомер;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуНомерВходящегоСчетаФактуры(ДокСсылка) Экспорт 
	
	Результат= Новый Структура("ДатаВходящегоДокумента, НомерВходящегоДокумента");
	
	Результат.ДатаВходящегоДокумента=  ДокСсылка.ДатаСчетаФактуры;
	Результат.НомерВходящегоДокумента= ДокСсылка.НомерСчетаФактуры;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьДатуНомерВходящейНакладной(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	Если ДокСсылка.ДатаСчетаФактуры <> ДатаВходящегоДокумента ИЛИ ДокСсылка.ВходящийНомер <> НомерВходящегоДокумента Тогда
		
		Объект = ДокСсылка.ПолучитьОбъект();
		Объект.ДатаСчетаФактуры = ДатаВходящегоДокумента;
		Объект.ВходящийНомер = 	 НомерВходящегоДокумента;
		
		Попытка
			Объект.Записать();
			Сообщить("Изменены следующие реквизиты: " + СписокОтличающихсяРеквизитов + " 
			|у документа: " + докСсылка);
		Исключение
			Сообщить("Не удалось изменить следующие реквизиты: " + СписокОтличающихсяРеквизитов + "
			|у документа: " + докСсылка);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатуНомерВходящегоСчетаФактуры(ДокСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
	
	Если ДокСсылка.ДатаСчетаФактуры <> ДатаВходящегоДокумента ИЛИ ДокСсылка.НомерСчетаФактуры <> НомерВходящегоДокумента Тогда
		
		Объект = ДокСсылка.ПолучитьОбъект();
		Объект.ДатаСчетаФактуры = ДатаВходящегоДокумента;
		Объект.НомерСчетаФактуры = НомерВходящегоДокумента;
		
		Попытка
			Объект.Записать();
			Сообщить("Изменены следующие реквизиты: " + СписокОтличающихсяРеквизитов + " 
			|у документа: " + докСсылка);
		Исключение
			Сообщить("Не удалось изменить следующие реквизиты: " + СписокОтличающихсяРеквизитов + "
			|у документа: " + докСсылка);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_НомерИДатаВходящегоДокумента"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Структура			- коллекция переопределяемых реквизитов 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента(Результат, ДокСсылка) Экспорт
	
	//По умолчанию используем результат из "Модуль_ИнтеграцияУниверсальнаяЛогика" 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_НомерИДатаВходящегоДокумента()

//Позволяет переопределить имена реквизитов документа. Вызывается из метода "ИменаРеквизитов_КодСпособаПолучения"
//в "Модуль_ИнтеграцияУниверсальнаяЛогика"
//
//Параметры:
//	Результат 	- Строка			- имя переопределяемого реквизита 
//	ДокСсылка	- ДокументСсылка	- документ, имена реквизитов которого проверяем
Процедура ПереопределитьИменаРеквизитов_КодСпособаПолучения(Результат, ДокСсылка) Экспорт
	
	//По умолчанию используем результат из "Модуль_ИнтеграцияУниверсальнаяЛогика" 
	
КонецПроцедуры //ПереопределитьИменаРеквизитов_КодСпособаПолучения()

//Возвращает именя реквизита "Склад" у документа поступления
//так как оно заданно в текущей конфигурации
//
//Возвращаемое значение:
//	Строка
Функция ИменаРеквизитов_Склад() Экспорт

	Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ИменаРеквизитов_Склад();
	
	Возврат Результат;
	
КонецФункции //ИменаРеквизитов_Склад()

//////////////////////////////////////////////////////////
// функции для работы с формами 1С
//////////////////////////////////////////////////////////

Функция ПолучитьФормуВыбораДоговораКонтрагента(Элемент, Организация, ДатаДокумента, Контрагент, ВидыДоговоров, ДоговорКонтрагента) Экспорт
	
	ФрмВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(, Элемент);
	ФрмВыбора.ПараметрОтборПоВладельцу = Контрагент;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.ВидСравнения                    = ВидСравнения.ВСписке;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Значение                            = ВидыДоговоров;
	ФрмВыбора.СправочникСписок.Отбор.ВидДоговора.Использование                       = Истина;
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидДоговора.Доступность = Ложь;
	
	ФрмВыбора.СправочникСписок.Отбор.Фирма.Установить(Организация);
	ФрмВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Фирма.Доступность = Ложь;

	ФрмВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ДоговорКонтрагента;
	ФрмВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
	Возврат ФрмВыбора;	
КонецФункции

//{ СвязиМеждуДокументами
	 
	Функция НайтиПодходящийСчетФактуруИзРНК(МассивСсылокРНК) Экспорт
		
		МассивСодержитРТУ= Ложь;
		Для Каждого СсылкаРНК Из МассивСсылокРНК Цикл
			Если ТипЗнч(СсылкаРНК) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
				МассивСодержитРТУ= Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСодержитРТУ Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка 
			|ИЗ
			|	Документ.СчетФактура
			|ГДЕ
			|	ДокументОснование В (&МассивСсылокРНК)");
			
			Запрос.УстановитьПараметр("МассивСсылокРНК", МассивСсылокРНК);
			
			РезультатЗапроса= Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Выборка= РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				Возврат Выборка.Ссылка; 
			КонецЕсли;
			
		Иначе
			
			Возврат СсылкаРНК; // СсылкаРНК - последняя ссылка из МассивСсылокРНК
			
		КонецЕсли;
		
	КонецФункции

	Функция ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьМассивСсылокРНКПоСчетуФактуреВыданному(СсылкаНаОбъект);
		
	КонецФункции

	Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект);
		
	КонецФункции

	Функция ПолучитьМассивСсылокРТУПоСчетуНаОплату(СсылкаНаОбъект) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьМассивСсылокРТУПоСчетуНаОплату(СсылкаНаОбъект);
		
	КонецФункции

	Функция ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект);
		
	КонецФункции

	Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьИсправляемыйДокументРеализации(ДокРеализации);
		
	КонецФункции
	
	Функция СФПоМассивуДокументовОснованийИдентичны(МассивСсылок) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").СФПоМассивуДокументовОснованийИдентичны(МассивСсылок);
		
	КонецФункции
	
//} СвязиМеждуДокументами

//{ ИдентификацияДокументов

	Функция ЭтоЗаказПокупателя(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоЗаказПокупателя(ДокументСсылка);
		
	КонецФункции	

	Функция ЭтоКорректировкаРеализации(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКорректировкаРеализации(ДокументСсылка);
		
	КонецФункции
	
	Функция ЭтоКСФ(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоКСФ(ДокументСсылка);
		
	КонецФункции
	
	Функция ЭтоРТУ_ДД(ДокументСсылка) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоРТУ_ДД(ДокументСсылка);
		
	КонецФункции 
	
	Функция ЭтоСФ(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФ(ДокументСсылка);
		
	КонецФункции	
	
	Функция ЭтоСФПолученный(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСФПолученный(ДокументСсылка);
		
	КонецФункции	
	
	Функция ЭтоСчетНаОплату(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ЭтоСчетНаОплату(ДокументСсылка);
		
	КонецФункции	
	
//} ИдентификацияДокументов

//{ ОтправкаДокументов

	Функция ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьТаблицуЗначенийДокументовДляОтправкиДиадок(ДатаНачала, ДатаОкончания, ТипыДокументов, Организация, Контрагент);
		
	КонецФункции	
	
	Процедура УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок) Экспорт 
		
		ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьПризнакВыставленияСФ(ДокументСсылка, ТекстКомментарияДиадок);
		
	КонецПроцедуры
		
//} ОтправкаДокументов

//{ ПолучениеДанныхДляФУФ
    	
	Функция ГрузополучательПоДокументу(ДокументСсылка) Экспорт 
		
		Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ГрузополучательПоДокументу(ДокументСсылка);
		
		Возврат Результат;
		
	КонецФункции
	
	Функция КонтрагентПоДокументу(ДокументСсылка) Экспорт
		
		Результат = ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").КонтрагентПоДокументу(ДокументСсылка);
						
		Возврат Результат;
		
	КонецФункции
	
	Функция ПолучитьДоговорПоДокументу(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДоговорПоДокументу(ДокументСсылка);
		
	КонецФункции	
	
	Функция ПолучитьСуммуДокумента(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуДокумента(ДокументСсылка);
		
	КонецФункции	
	
	Функция ПолучитьСуммуНДС(ДокументСсылка) Экспорт 
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСуммуНДС(ДокументСсылка);
		
	КонецФункции	
	
//} ПолучениеДанныхДляФУФ

//{ СвязиМеждуДокументами

Функция ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПервыйДокументСсылаетсяНаВторой(ПервыйДокумент, ВторойДокумент);
	
КонецФункции

Функция ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка) Экспорт 
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьДокОснованиеКорректировкиРеализациии(ДокументСсылка);
	
КонецФункции

Функция ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента) Экспорт
	
	Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ПолучитьСсылкиДляСозданияКорректировкиРеализации(КорректировкаРеализацииОснование, ТипНовогоДокумента);
	
КонецФункции

//} СвязиМеждуДокументами

	Функция ТекстЗапросаПодборНакладных(Direction) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборНакладных(Direction);
		
	КонецФункции
	
	Функция ТекстЗапросаПодборСчетовФактур(Direction) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ТекстЗапросаПодборСчетовФактур(Direction);
		
	КонецФункции
	
	Процедура УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов) Экспорт 
		
		ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").УстановитьДатуНомерВходящегоДокумента(докСсылка, ДатаВходящегоДокумента, НомерВходящегоДокумента, СписокОтличающихсяРеквизитов);
		
	КонецПроцедуры	

//{Внешние печатные формы

	Функция ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Печать(СсылкаНаОбъект, ИдентификаторВПФ);
		
	КонецФункции
	
	Функция ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_РезультатФункции(ИдентификаторВПФ, ИмяФункции, ПараметрыФункции);
		
	КонецФункции

	Функция ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_Идентификатор(СсылкаНаОбъект, ВПФ);
		
	КонецФункции

	Функция ВПФ_ДополнительныеПараметры(ИдентификаторВПФ) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_ДополнительныеПараметры(ИдентификаторВПФ);
		
	КонецФункции

	Функция ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ) Экспорт
		
		Возврат ПолучитьМодульПрог("Модуль_ИнтеграцияУниверсальнаяЛогика").ВПФ_СсылкаНомерСтроки(ИдентификаторВПФ);
		
	КонецФункции

//}Внешние печатные формы

// Устаревшие

//Устарел в релизе 5.30.01. Необходимо использовать метод "ГрузополучательПоДокументу"
Функция ПолучитьГрузополучателяПоДокументу(ДокументСсылка) Экспорт 
	
	Результат = ГрузополучательПоДокументу(ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции
