////////////////////////////////////////////////////////////////////////////////
// Методы общего назначения:
// - Значение реквизитов объектов;
// - Получение общих модулей;
// - Проверка существования подсистем;
// - прочее.
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Модуль содержит процедуры и функции из Библиотеки стандартных подсистем,
// распространяемой под лицензией Attribution 4.0 International (CC BY 4.0)
// https://creativecommons.org/licenses/by/4.0/legalcode производны от нее
// или вдохновлены ею, является ООО 1С-Софт (https://1c.ru/).
// Авторские права 2024 г. принадлежат ООО 1С-Софт. Все права защищены.
//
// Процедуры и функции из Библиотеки стандартных подсистем:
// - ЗначенияРеквизитовОбъектаЛок
// - ЗначениеРеквизитаОбъектаЛок
// - ЗначенияРеквизитовОбъектовЛок
// - ЗначениеРеквизитаОбъектовЛок
// - КодОсновногоЯзыкаЛок
// - ВерсияРежимаСовместимостиЛок
// - ОбщийМодульЛок
// - ПодсистемаСуществуетЛок
// - ЭтоWindowsСерверЛок
// - ЭтоLinuxСерверЛок
// - ДополнитьТаблицуЛок
// - ДополнитьМассивЛок
// - ДополнитьСтруктуруЛок
// - ДополнитьСоответствиеЛок
// - УдалитьВсеВхожденияЗначенияИзМассиваЛок
// - УдалитьЗначениеИзМассиваЛок
// - ФиксированныеДанныеЛок
// - СкопироватьРекурсивноЛок
// - СвернутьМассивЛок
// - ЗначениеВМассивеЛок
// - СвойствоСтруктурыЛок
// - ЕстьРеквизитИлиСвойствоОбъектаЛок
// - СравнитьВерсииЛок
// - СравнитьВерсииБезНомераСборкиЛок
// - ВерсияКонфигурацииБезНомераСборкиЛок
// - АдресаЭлектроннойПочтыИзСтрокиЛок
// - АдресЭлектроннойПочтыСоответствуетТребованиямЛок
// - РазобратьСтрокуСПочтовымиАдресамиЛок
// - СтрокаВДатуЛок
// - СообщитьПользователюЛок
// - ОбъектМетаданныхПоПолномуИмениЛок
// - ВставитьИменаПодчиненныхПодсистемЛок
// - ИменаКоллекцийПоИменамБазовыхТиповЛок
// - ПолеИсточникаСхемыЗапросаДоступноЛок
// - СерверныйМодульМенеджераЛок
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
Перем СтдСтрЛок, СтдКоллекцииЛок, СтдОСЛок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// БСП: БАЗА ДАННЫХ

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура,
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка),
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъектаЛок(
		Знач Ссылка,
		Знач Реквизиты,
		Знач ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	Перем ПолноеИмяОбъектаМетаданных;
	Перем СтруктураПолей;
	
	ЗаполнитьПолноеИмяОбъектаМетаданныхЗначенияРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Ссылка);
	ЗаполнитьСтруктуруПолейЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты);
	
	// Подготовка результата (после выполнения запроса переопределится).
	Результат = Новый Структура;
	
	// Формирование текста запроса к выбираемым полям.
	ТекстЗапросаПолей = "";
	Для Каждого КлючИЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
				КлючИЗначение.Значение,
				КлючИЗначение.Ключ);
		ПсевдонимПоля = КлючИЗначение.Ключ;
		
		ТекстЗапросаПолей =
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + ПсевдонимПоля;
		
		// Предварительное добавление поля по псевдониму в возвращаемый результат.
		Результат.Вставить(ПсевдонимПоля);
		
	КонецЦикла;
	
	// Если предопределенного нет в ИБ.
	// - приведение результата к отсутствию объекта в ИБ или передаче пустой ссылки.
	Если Ссылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	// BSLLS:AssignAliasFieldsInQuery-off
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|&ТекстЗапросаПолей
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка";
	// BSLLS:AssignAliasFieldsInQuery-on
	Если НЕ ВыбратьРазрешенные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей", ТекстЗапросаПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	// Выполнение запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	// Заполнение реквизитов.
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗначенияРеквизитовОбъектаЛок

// Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует".
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//                                Допускается указание имени реквизита через точку, но при этом параметр КодЯзыка для
//                                такого реквизита учитываться не будет.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то возвращается Неопределено;
//                                если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Произвольный - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//                 Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка),
//                 то возвращается Неопределено.
//
Функция ЗначениеРеквизитаОбъектаЛок(
		Ссылка,
		ИмяРеквизита,
		ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ВызватьИсключение СтдСтр().ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Имя реквизита должно быть заполнено.'"), "ИмяРеквизита", "ЗначениеРеквизитаОбъекта");
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъектаЛок(Ссылка, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции // ЗначениеРеквизитаОбъектаЛок

// Возвращает значения реквизитов, прочитанные из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует".
//
// Параметры:
//  Ссылки - Массив из ЛюбаяСсылка
//         - ФиксированныйМассив из ЛюбаяСсылка - ссылки на объекты.
//           Если массив пуст, то результатом будет пустое соответствие.
//  Реквизиты - Строка - имена реквизитов перечисленные через запятую, в формате требований к свойствам
//                       структуры. Например, "Код, Наименование, Родитель".
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект;
//   * Значение - Структура:
//    ** Ключ - Строка - имя реквизита;
//    ** Значение - Произвольный - значение реквизита.
//
Функция ЗначенияРеквизитовОбъектовЛок(
		Знач Ссылки,
		Знач Реквизиты,
		Знач ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	ОбработатьПараметрыЗначенияРеквизитовОбъектов(Реквизиты, КодЯзыка);
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если Ссылки.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	РеквизитыТекстЗапроса = Реквизиты;
	
	СсылкиПоТипам = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		Тип = ТипЗнч(Ссылка);
		Если СсылкиПоТипам[Тип] = Неопределено Тогда
			СсылкиПоТипам[Тип] = Новый Массив;
		КонецЕсли;
		ЭлементПоТипу = СсылкиПоТипам[Тип]; // Массив
		ЭлементПоТипу.Добавить(Ссылка);
	КонецЦикла;
	
	ТекстыЗапросов = Новый Массив;
	ПараметрыЗапроса = Новый Структура;
	
	ИменаОбъектовМетаданных = Новый Массив;
	
	Для Каждого СсылкиПоТипу Из СсылкиПоТипам Цикл
		Тип = СсылкиПоТипу.Ключ;
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Неверный первый параметр Ссылки в функции ЗначенияРеквизитовОбъектовЛок: 
				|Значения массива должны быть ссылками.'");
		КонецЕсли;
		
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		ИменаОбъектовМетаданных.Добавить(ПолноеИмяОбъектаМетаданных);
		// BSLLS:AssignAliasFieldsInQuery-off
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ссылка,
			|	&Реквизиты
			|ИЗ
			|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
			|ГДЕ
			|	ПсевдонимЗаданнойТаблицы.Ссылка В (&Ссылки)";
		// BSLLS:AssignAliasFieldsInQuery-on
		Если НЕ ВыбратьРазрешенные ИЛИ ТекстыЗапросов.Количество() > 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизиты", РеквизитыТекстЗапроса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
		ИмяПараметра = "Ссылки" + СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ссылки", "&" + ИмяПараметра);
		ПараметрыЗапроса.Вставить(ИмяПараметра, СсылкиПоТипу.Значение);
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ТекстЗапроса = СтдСтр().СтрСоединитьЛок(
			ТекстыЗапросов,
			Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КодЯзыка", КодЯзыка);
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(Реквизиты);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции // ЗначенияРеквизитовОбъектовЛок

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует".
//
// Параметры:
//  МассивСсылок       - Массив из ЛюбаяСсылка
//                     - ФиксированныйМассив из ЛюбаяСсылка
//  ИмяРеквизита       - Строка - например, "Код".
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//      * Ключ     - ЛюбаяСсылка  - ссылка на объект,
//      * Значение - Произвольный - значение прочитанного реквизита.
//
Функция ЗначениеРеквизитаОбъектовЛок(
		МассивСсылок,
		ИмяРеквизита,
		ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ВызватьИсключение СтдСтр().ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Имя реквизита должно быть заполнено.'"),
			"ИмяРеквизита",
			"ЗначенияРеквизитовОбъектовЛок");
		
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектовЛок(
			МассивСсылок,
			ИмяРеквизита,
			ВыбратьРазрешенные,
			КодЯзыка);
	
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции // ЗначениеРеквизитаОбъектовЛок

// Возвращает код основного языка
//
// Возвращаемое значение:
//   Строка - Код основного языка например "ru"
//
Функция КодОсновногоЯзыкаЛок() Экспорт
	
	Возврат Метаданные.ОсновнойЯзык.КодЯзыка;
	
КонецФункции // КодОсновногоЯзыкаЛок

// Возвращает версию режима совместимости в формате нумерации редакций и версий, например, 8.3.14.0.
//
// Возвращаемое значение:
//   Строка - версия режима совместимости в формате нумерации редакций и версий.
//
Функция ВерсияРежимаСовместимостиЛок() Экспорт
	
	Если Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		
		Инфо = Новый СистемнаяИнформация;
		Возврат Инфо.ВерсияПриложения;
		
	КонецЕсли;
	
	НомерРедакции = "8";
	
	Подстроки = СтдСтр().СтрРазделитьЛок(Метаданные.РежимСовместимости, "_");
	Подстроки[0] = НомерРедакции;
	
	МаксИндекс = 3;
	Пока Подстроки.ВГраница() < МаксИндекс Цикл
		Подстроки.Добавить("0");
	КонецЦикла;
	
	Возврат СтдСтр().СтрСоединитьЛок(Подстроки, ".");
	
КонецФункции // ВерсияРежимаСовместимостиЛок

// БСП: НЕОБЯЗАТЕЛЬНЫЕ ПОДСИСТЕМЫ

// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//   ОбщийМодуль
//   МодульМенеджераОбъекта
//
// Пример:
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодульЛок(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		// BSLLS:ExecuteExternalCodeInCommonModule-off
		// BSLLS:ExecuteExternalCode-off
		// перед вычислением алгоритма выполняется проверка, что значение переменной
		// является объектом метаданных
		УстановитьБезопасныйРежим(Истина);
		Модуль = Вычислить(Имя);
		// BSLLS:ExecuteExternalCodeInCommonModule-on
		// BSLLS:ExecuteExternalCode-on
	ИначеЕсли СтрЧислоВхождений(Имя, ".") = 1 Тогда
		Возврат СерверныйМодульМенеджераЛок(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтдСтр().ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Общий модуль ""%1"" не существует.'"),
			Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции // ОбщийМодульЛок

// Возвращает Истина, если функциональная подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
// У функциональной подсистемы снят флажок "Включать в командный интерфейс".
// См. также ОбщегоНазначенияПереопределяемый.ПриОпределенииОтключенныхПодсистем
// и ОбщегоНазначенияКлиент.ПодсистемаСуществует для вызова из клиентского кода.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево - Истина, если подсистема существует.
//
Функция ПодсистемаСуществуетЛок(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = ИменаПодсистемЛок();
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции // ПодсистемаСуществуетЛок

// БСП: СРЕДА ИСПОЛНЕНИЯ

// Позволяет на клиенте получить данные об ОС на Сервере
// Возвращает Истина, если приложение запущено под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Windows
//
Функция ЭтоWindowsСерверЛок() Экспорт
	
	Возврат СтдОС().ЭтоWindows();
	
КонецФункции // ЭтоWindowsСерверЛок

// Позволяет на клиенте получить данные об ОС на Сервере
// Возвращает Истина, если приложение запущено под управлением ОС Linux.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Linux
//
Функция ЭтоLinuxСерверЛок() Экспорт
	
	Возврат СтдОС().ЭтоLinux();
	
КонецФункции // ЭтоLinuxСерверЛок

// БСП: КОЛЛЕКЦИИ

// Добавляет в таблицу приемник строки из таблицы источника
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой нужно взять строки
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую нужно добавить строки
//
Процедура ДополнитьТаблицуЛок(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	СтдКоллекции().ДополнитьТаблицуЛок(ТаблицаИсточник, ТаблицаПриемник);
	
КонецПроцедуры // ДополнитьТаблицуЛок

// Дополняет массив значениями из другого массива
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник - Массив - массив, из которого нужно взять значения;
//  ТолькоНовые - Булево - (необязательный) Истина, если в приемник
//					нужно добавить только те значения, которых там еще нет;
//
Процедура ДополнитьМассивЛок(МассивПриемник, МассивИсточник, ТолькоНовые = Ложь) Экспорт
	
	СтдКоллекции().ДополнитьМассивЛок(МассивПриемник, МассивИсточник, ТолькоНовые);
	
КонецПроцедуры // ДополнитьМассивЛок

// Дополняет структуру значениями из другой структуры.
//
// Параметры:
//   СтруктураПриемник - Структура - коллекция, в которую будут добавляться новые значения.
//   СтруктураИсточник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь   - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
Процедура ДополнитьСтруктуруЛок(СтруктураПриемник, СтруктураИсточник, Заменять = Неопределено) Экспорт
	
	СтдКоллекции().ДополнитьСтруктуруЛок(СтруктураПриемник, СтруктураИсточник, Заменять);
	
КонецПроцедуры // ДополнитьСтруктуруЛок

// Дополняет соответствие значениями из другой соответствия.
//
// Параметры:
//   СоответствиеПриемник - Соответствие - коллекция, в которую будут добавляться новые значения.
//   СоответствиеИсточник - Соответствие - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - что делать в местах пересечения ключей источника и приемника:
//                                     Истина - заменять значения приемника (самый быстрый способ),
//                                     Ложь - не заменять значения приемника (пропускать),
//                                     Неопределено - значение по умолчанию. Бросать исключение
//
Процедура ДополнитьСоответствиеЛок(СоответствиеПриемник, СоответствиеИсточник, Заменять = Неопределено) Экспорт
	
	СтдКоллекции().ДополнитьСоответствиеЛок(СоответствиеПриемник, СоответствиеИсточник, Заменять);
	
КонецПроцедуры // ДополнитьСоответствиеЛок

// Удаляет все вхождения переданного значения из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Произвольный - удаляемое значение из массива.
//
Процедура УдалитьВсеВхожденияЗначенияИзМассиваЛок(Массив, Значение) Экспорт
	
	СтдКоллекции().УдалитьВсеВхожденияЗначенияИзМассиваЛок(Массив, Значение);
	
КонецПроцедуры // УдалитьВсеВхожденияЗначенияИзМассиваЛок

// Удаляет одно значение из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Массив - удаляемое значение из массива.
//
Процедура УдалитьЗначениеИзМассиваЛок(Массив, Значение) Экспорт
	
	СтдКоллекции().УдалитьЗначениеИзМассиваЛок(Массив, Значение);
	
КонецПроцедуры // УдалитьЗначениеИзМассиваЛок

// Фиксирует данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - коллекции, значения которых являются примитивными типами,
//           хранилищем значения или не могут быть изменены. Поддерживаются типы значений:
//           Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//           ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//           ЛюбаяСсылка.
//
//  ВызыватьИсключение - Булево - начальное значение Истина. Когда установлено Ложь, тогда в случае наличия
//                                нефиксируемых данных исключение не будет вызвано, при этом данные будут
//                                зафиксированы на сколько возможно.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
//
Функция ФиксированныеДанныеЛок(Данные, ВызыватьИсключение = Истина) Экспорт
	
	Возврат СтдКоллекции().ФиксированныеДанныеЛок(Данные, ВызыватьИсключение);
	
КонецФункции // ФиксированныеДанныеЛок

// Создает полную копию структуры, соответствия, массива, таблицы значений или списка, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// Параметры:
//  Источник - Структура, ФиксированнаяСтруктура - объект, который необходимо скопировать
//           - Соответствие, ФиксированноеСоответствие - объект, который необходимо скопировать
//           - Массив, ФиксированныйМассив - объект, который необходимо скопировать
//           - ТаблицаЗначений - объект, который необходимо скопировать
//           - ДеревоЗначений - объект, который необходимо скопировать
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево - Истина/Ложь Зафиксировать/снять фиксацию
//                    - Неопределено - Не изменять (По умолчанию)
//
// Возвращаемое значение:
//  - Структура, ФиксированнаяСтруктура - Копия объекта, переданного в параметре Источник
//  - Соответствие, ФиксированноеСоответствие - Копия объекта, переданного в параметре Источник
//  - Массив, ФиксированныйМассив - Копия объекта, переданного в параметре Источник
//  - ДеревоЗначений - Копия объекта, переданного в параметре Источник
//  - ТаблицаЗначений - Копия объекта, переданного в параметре Источник
//  - СписокЗначений - Копия объекта, переданного в параметре Источник
//
Функция СкопироватьРекурсивноЛок(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Возврат СтдКоллекции().СкопироватьРекурсивноЛок(Источник, ФиксироватьДанные);
	
КонецФункции // СкопироватьРекурсивноЛок

// Возвращает массив уникальных значений (аналогия множества)
//
// Параметры:
//  Массив - Массив, ФиксированныйМассив - массив, который необходимо свернуть;
//
// Возвращаемое значение:
//  Массив, ФиксированныйМассив - свернутый массив
//
Функция СвернутьМассивЛок(Знач Массив) Экспорт
	
	Возврат СтдКоллекции().СвернутьМассивЛок(Массив);
	
КонецФункции // СвернутьМассивЛок

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив - массив из одного элемента.
//
Функция ЗначениеВМассивеЛок(Знач Значение) Экспорт
	
	Возврат СтдКоллекции().ЗначениеВМассивеЛок(Значение);
	
КонецФункции // ЗначениеВМассивеЛок

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
//
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в
//                                       структуре нет указанного свойства.
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Возврат СтдКоллекции().СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции // СвойствоСтруктурыЛок

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции // ЕстьРеквизитИлиСвойствоОбъектаЛок

// БСП: ВЕРСИОНИРОВАНИЕ

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсия1  - Строка - номер версии.
//  СтрокаВерсия2  - Строка - номер сравниваемой версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
Функция СравнитьВерсииЛок(Знач СтрокаВерсия1, Знач СтрокаВерсия2) Экспорт
	
	Возврат СтдСтр().СравнитьВерсииЛок(СтрокаВерсия1, СтрокаВерсия2);
	
КонецФункции // СравнитьВерсииЛок

// Сравнить две строки версий. Номером сборки считается 4 разряд версии
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - 1, если СтрокаВерсия1 > СтрокаВерсия2; -1, если СтрокаВерсия1 < СтрокаВерсия2;0, если версии равны.
//
Функция СравнитьВерсииБезНомераСборкиЛок(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Возврат СтдСтр().СравнитьВерсииБезНомераСборкиЛок(СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции // СравнитьВерсииБезНомераСборкиЛок

// Получает номер версии конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС - номер сборки, который будет удален.
//
// Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
Функция ВерсияКонфигурацииБезНомераСборкиЛок(Знач Версия) Экспорт
	
	Возврат СтдСтр().ВерсияКонфигурацииБезНомераСборкиЛок(Версия);
	
КонецФункции // ВерсияКонфигурацииБезНомераСборкиЛок

// БСП: EMAIL АДРЕСА

// Разбирает строку с адресами электронной почты. При разборе проверяет корректность адресов.
//
// Параметры:
//  СписокАдресов - Строка - адреса электронной почты, разделитель - запятая, либо точка с запятой:
//                           Получатель1 <Адрес1>, Получатель 2 <Адрес2>,...
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Псевдоним      - Строка - представление адресата.
//   * Адрес          - Строка - найденный и соответствующий требованиям почтовый адрес.
//                               Если текст, похожий на адрес найден, но не соответствует требованиям
//                               стандартов, то такой текст записывается в поле "Псевдоним".
//   * ОписаниеОшибки - Строка - текстовое представление ошибки, либо пустая строка, если ошибок нет.
//
Функция АдресаЭлектроннойПочтыИзСтрокиЛок(Знач СписокАдресов) Экспорт
	
	Возврат СтдСтр().АдресаЭлектроннойПочтыИзСтрокиЛок(СписокАдресов);
	
КонецФункции // АдресаЭлектроннойПочтыИзСтрокиЛок

// Проверяет email-адрес на соответствие требованиям стандартов RFC 5321, RFC 5322,
// а также RFC 5335, RFC 5336 и RFC 3696.
// Кроме того, функция ограничивает использование спецсимволов.
//
// Параметры:
//  Адрес - Строка - проверяемый email.
//  РазрешитьЛокальныеАдреса - Булево - не выдавать ошибку в случае отсутствия зоны домена в адресе.
//
// Возвращаемое значение:
//  Булево - Истина, если ошибок нет.
//
Функция АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Знач Адрес, РазрешитьЛокальныеАдреса = Ложь) Экспорт
	
	Возврат СтдСтр().АдресЭлектроннойПочтыСоответствуетТребованиямЛок(Адрес, РазрешитьЛокальныеАдреса);
	
КонецФункции // АдресЭлектроннойПочтыСоответствуетТребованиямЛок

// Проверяет, что введенная строка с email-адресами введена правильно.
//
// Формат строки:
//  Z = ИмяПользователя|[Имя Пользователя] [<]пользователь@почтовый_сервер[>], Строка = Z[<разделитель*>Z].
//
//  Прим.: разделитель* - имеется ввиду любой разделитель адресов.
//
// Параметры:
//  СтрокаПереданныхАдресов - Строка - правильная строка с почтовыми адресами.
//  ВызыватьИсключение - Булево - передать Ложь, чтобы в случае неуспешного разбора не выдавалось исключение.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Адрес - Строка - e-mail получателя.
//   * Представление - Строка - имя получателя.
//
Функция РазобратьСтрокуСПочтовымиАдресамиЛок(Знач СтрокаПереданныхАдресов, ВызыватьИсключение = Истина) Экспорт
	
	Возврат СтдСтр().РазобратьСтрокуСПочтовымиАдресамиЛок(СтрокаПереданныхАдресов, ВызыватьИсключение);
	
КонецФункции // РазобратьСтрокуСПочтовымиАдресамиЛок

// БСП: ПРИВЕДЕНИЕ ЗНАЧЕНИЙ

// Приводит строковое значение к дате.
//
// Параметры:
//  Значение - Строка - строковое значение, которое приводится к дате.
//
// Возвращаемое значение:
//   Дата - приведенное значение.
//
Функция СтрокаВДатуЛок(Знач Значение) Экспорт
	
	Возврат СтдСтр().СтрокаВДатуЛок(Значение);
	
КонецФункции // СтрокаВДатуЛок

// БСП: ОПОВЕЩЕНИЯ ПОЛЬЗОВАТЕЛЕЙ

// Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// В фоновом задании длительной операции, если вызов выполнен вне транзакции,
// сообщение записывается в служебный регистр и отправляется сразу на клиент,
// если подключена система взаимодействия.
// В конце фонового задания длительной операции, а также при отправке прогресса,
// все сообщения извлекаются из очереди сообщений фонового задания,
// записываются в служебный регистр и отправляются сразу на клиент,
// если подключена система взаимодействия.
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимого.
//   3. Установка ссылки без установки поля (и/или пути к данным).
//
Процедура СообщитьПользователюЛок(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	ЭтоОбъект = Ложь;
	
	Если КлючДанных <> Неопределено
		И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = СтдСтр().СтрНайтиЛок(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
	
	Сообщение = СообщениеПользователюЛок(ТекстСообщенияПользователю,
			КлючДанных, Поле, ПутьКДанным, Отказ, ЭтоОбъект);
	
	Сообщение.Сообщить();
	
КонецПроцедуры // СообщитьПользователюЛок

// БСП: МЕТАДАННЫЕ

// Возвращает ОбъектМетаданных, быстро найденный по полному имени.
// Более производительный аналог метода платформы Метаданные.НайтиПоПолномуИмени
// для корневых объектов метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, например, Справочник.Организации
//
// Возвращаемое значение:
//  ОбъектМетаданных - когда найден
//  Неопределено - когда не найден
//
Функция ОбъектМетаданныхПоПолномуИмениЛок(ПолноеИмя) Экспорт
	
	ПозицияТочки = СтдСтр().СтрНайтиЛок(ПолноеИмя, ".");
	ИмяБазовогоТипа = Лев(ПолноеИмя, ПозицияТочки - 1);
	
	ИменаКоллекций = ИменаКоллекцийПоИменамБазовыхТиповЛок();
	Коллекция = ИменаКоллекций.Получить(ВРег(ИмяБазовогоТипа));
	
	Если Коллекция = Неопределено Тогда
		Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	Если Коллекция <> "Подсистемы" Тогда
		ИмяОбъекта = Сред(ПолноеИмя, ПозицияТочки + 1);
		ОбъектМетаданных = Метаданные[Коллекция].Найти(ИмяОбъекта);
	Иначе
		ИменаПодсистем = СтдСтр().СтрРазделитьЛок(ВРег(ПолноеИмя), ".");
		Количество = ИменаПодсистем.Количество();
		Подсистема = Метаданные;
		ОбъектМетаданных = Неопределено;
		Индекс = 0;
		Пока Истина Цикл
			Индекс = Индекс + 1;
			Если Индекс >= Количество Тогда
				Прервать;
			КонецЕсли;
			ИмяПодсистемы = ИменаПодсистем[Индекс];
			Подсистема = Подсистема.Подсистемы.Найти(ИмяПодсистемы);
			Если Подсистема = Неопределено Тогда
				Прервать;
			КонецЕсли;
			Индекс = Индекс + 1;
			Если Индекс = Количество Тогда
				ОбъектМетаданных = Подсистема;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	Возврат ОбъектМетаданных;
	
КонецФункции // ОбъектМетаданныхПоПолномуИмениЛок

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// БСП

Процедура ВставитьИменаПодчиненныхПодсистемЛок(Имена, РодительскаяПодсистема, ИмяРодительскойПодсистемы = "")
	
	Для Каждого ТекущаяПодсистема Из РодительскаяПодсистема.Подсистемы Цикл
		
		Если ТекущаяПодсистема.ВключатьВКомандныйИнтерфейс Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТекущейПодсистемы = ИмяРодительскойПодсистемы + ТекущаяПодсистема.Имя;
		Имена.Вставить(ИмяТекущейПодсистемы, Истина);
		
		Если ТекущаяПодсистема.Подсистемы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВставитьИменаПодчиненныхПодсистемЛок(
			Имена,
			ТекущаяПодсистема,
			ИмяТекущейПодсистемы + ".");
		
	КонецЦикла;
	
КонецПроцедуры // ВставитьИменаПодчиненныхПодсистемЛок

Функция ИменаКоллекцийПоИменамБазовыхТиповЛок()
	
	ИменаКоллекций = Новый Соответствие;
	ИменаКоллекций.Вставить(ВРег("Подсистема"), "Подсистемы");
	ИменаКоллекций.Вставить(ВРег("ОбщийМодуль"), "ОбщиеМодули");
	ИменаКоллекций.Вставить(ВРег("ПараметрСеанса"), "ПараметрыСеанса");
	ИменаКоллекций.Вставить(ВРег("Роль"), "Роли");
	ИменаКоллекций.Вставить(ВРег("ОбщийРеквизит"), "ОбщиеРеквизиты");
	ИменаКоллекций.Вставить(ВРег("ПланОбмена"), "ПланыОбмена");
	ИменаКоллекций.Вставить(ВРег("КритерийОтбора"), "КритерииОтбора");
	ИменаКоллекций.Вставить(ВРег("ПодпискаНаСобытие"), "ПодпискиНаСобытия");
	ИменаКоллекций.Вставить(ВРег("РегламентноеЗадание"), "РегламентныеЗадания");
	ИменаКоллекций.Вставить(ВРег("ФункциональнаяОпция"), "ФункциональныеОпции");
	ИменаКоллекций.Вставить(ВРег("ПараметрФункциональныхОпций"), "ПараметрыФункциональныхОпций");
	ИменаКоллекций.Вставить(ВРег("ОпределяемыйТип"), "ОпределяемыеТипы");
	ИменаКоллекций.Вставить(ВРег("ХранилищеНастроек"), "ХранилищаНастроек");
	ИменаКоллекций.Вставить(ВРег("ОбщаяФорма"), "ОбщиеФормы");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКоманда"), "ОбщиеКоманды");
	ИменаКоллекций.Вставить(ВРег("ГруппаКоманд"), "ГруппыКоманд");
	ИменаКоллекций.Вставить(ВРег("ОбщийМакет"), "ОбщиеМакеты");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКартинка"), "ОбщиеКартинки");
	ИменаКоллекций.Вставить(ВРег("ПакетXDTO"), "ПакетыXDTO");
	ИменаКоллекций.Вставить(ВРег("WebСервис"), "WebСервисы");
	ИменаКоллекций.Вставить(ВРег("HTTPСервис"), "HTTPСервисы");
	ИменаКоллекций.Вставить(ВРег("WSСсылка"), "WSСсылки");
	ИменаКоллекций.Вставить(ВРег("СервисИнтеграции"), "СервисыИнтеграции");
	ИменаКоллекций.Вставить(ВРег("ЭлементСтиля"), "ЭлементыСтиля");
	ИменаКоллекций.Вставить(ВРег("Стиль"), "Стили");
	ИменаКоллекций.Вставить(ВРег("Язык"), "Языки");
	ИменаКоллекций.Вставить(ВРег("Константа"), "Константы");
	ИменаКоллекций.Вставить(ВРег("Справочник"), "Справочники");
	ИменаКоллекций.Вставить(ВРег("Документ"), "Документы");
	ИменаКоллекций.Вставить(ВРег("Последовательность"), "Последовательности");
	ИменаКоллекций.Вставить(ВРег("ЖурналДокументов"), "ЖурналыДокументов");
	ИменаКоллекций.Вставить(ВРег("Перечисление"), "Перечисления");
	ИменаКоллекций.Вставить(ВРег("Отчет"), "Отчеты");
	ИменаКоллекций.Вставить(ВРег("Обработка"), "Обработки");
	ИменаКоллекций.Вставить(ВРег("ПланВидовХарактеристик"), "ПланыВидовХарактеристик");
	ИменаКоллекций.Вставить(ВРег("ПланСчетов"), "ПланыСчетов");
	ИменаКоллекций.Вставить(ВРег("ПланВидовРасчета"), "ПланыВидовРасчета");
	ИменаКоллекций.Вставить(ВРег("РегистрСведений"), "РегистрыСведений");
	ИменаКоллекций.Вставить(ВРег("РегистрНакопления"), "РегистрыНакопления");
	ИменаКоллекций.Вставить(ВРег("РегистрБухгалтерии"), "РегистрыБухгалтерии");
	ИменаКоллекций.Вставить(ВРег("РегистрРасчета"), "РегистрыРасчета");
	ИменаКоллекций.Вставить(ВРег("БизнесПроцесс"), "БизнесПроцессы");
	ИменаКоллекций.Вставить(ВРег("Задача"), "Задачи");
	ИменаКоллекций.Вставить(ВРег("ВнешниеИсточникиДанных"), "ВнешнийИсточникДанных");
	
	Возврат Новый ФиксированноеСоответствие(ИменаКоллекций);
	
КонецФункции // ИменаКоллекцийПоИменамБазовыхТиповЛок

Функция ИменаПодсистемЛок()
	
	Имена = Новый Соответствие;
	ВставитьИменаПодчиненныхПодсистемЛок(Имена, Метаданные);
	
	Возврат Новый ФиксированноеСоответствие(Имена);
	
КонецФункции // ИменаПодсистемЛок

Функция СообщениеПользователюЛок(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных,
		Знач Поле,
		Знач ПутьКДанным = "",
		Отказ = Ложь,
		ЭтоОбъект = Ложь)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Отказ = Истина;
	
	Возврат Сообщение;
	
КонецФункции // СообщениеПользователюЛок

Функция ПолеИсточникаСхемыЗапросаДоступноЛок(КомпоновщикНастроекСКДНастройки, ПроверяемоеВыражение)
	
	ЧастиИмениПоля = СтдСтр().СтрРазделитьЛок(ПроверяемоеВыражение, ".");
	ДоступныеПоля = КомпоновщикНастроекСКДНастройки.ДоступныеПоляВыбора.Элементы;
	
	ИмяПоля = "";
	ТекущаяЧастьИмениПоля = 0;
	Пока ТекущаяЧастьИмениПоля < ЧастиИмениПоля.Количество() Цикл
		
		Если НЕ ЗначениеЗаполнено(ИмяПоля) Тогда
			ИмяПоля = ИмяПоля + ЧастиИмениПоля.Получить(ТекущаяЧастьИмениПоля);
		Иначе
			ИмяПоля = ИмяПоля + "." + ЧастиИмениПоля.Получить(ТекущаяЧастьИмениПоля);
		КонецЕсли;
		
		ТекущееПоле = ДоступныеПоля.Найти(Новый ПолеКомпоновкиДанных(ИмяПоля));
		
		Если ТекущееПоле = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Инкрементация следующей части имени поля и соответствующего списка доступности полей.
		ТекущаяЧастьИмениПоля = ТекущаяЧастьИмениПоля + 1;
		ДоступныеПоля = ТекущееПоле.Элементы;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ПолеИсточникаСхемыЗапросаДоступноЛок

Функция СерверныйМодульМенеджераЛок(Имя)
	
	ОбъектНайден = Ложь;
	КоличествоЧастейИмен = 2;
	ЧастиИмени = СтдСтр().СтрРазделитьЛок(Имя, ".");
	Если ЧастиИмени.Количество() = КоличествоЧастейИмен Тогда
		ОбъектНайден = Метаданные[ЧастиИмени[0]].Найти(ЧастиИмени[1]) <> Неопределено;
	КонецЕсли;
	
	Если НЕ ОбъектНайден Тогда
		ВызватьИсключение СтдСтр().ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Объект метаданных ""%1"" не существует.'"), Имя);
	КонецЕсли;
	
	// BSLLS:ExecuteExternalCodeInCommonModule-off
	// BSLLS:ExecuteExternalCode-off
	// перед вычислением алгоритма выполняется проверка, что значение переменной
	// является объектом метаданных
	УстановитьБезопасныйРежим(Истина);
	Модуль = Вычислить(Имя);
	// BSLLS:ExecuteExternalCodeInCommonModule-on
	// BSLLS:ExecuteExternalCode-on
	
	Возврат Модуль;
	
КонецФункции // СерверныйМодульМенеджераЛок

// ПРОЧЕЕ

Процедура ЗаполнитьПолноеИмяОбъектаМетаданныхЗначенияРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Ссылка)
	
	// Если передано имя предопределенного
	
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		
		ПолноеИмяПредопределенногоЭлемента = Ссылка;
		
		// Вычисление ссылки по имени предопределенного.
		// - дополнительно выполняет проверку метаданных предопределенного, выполняется предварительно.
		Попытка
			Ссылка = ПредопределенноеЗначение(ПолноеИмяПредопределенногоЭлемента);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ТекстОшибки = СтдСтр().ПодставитьПараметрыВСтрокуЛок(
					НСтр("ru = 'Неверный первый параметр Ссылка в функции ЗначенияРеквизитовОбъектаЛок:
						|%1'"),
					КраткоеПредставлениеОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		// Разбор полного имени предопределенного.
		ЧастиПолногоИмени = СтдСтр().СтрРазделитьЛок(
				ПолноеИмяПредопределенногоЭлемента,
				".");
		ПолноеИмяОбъектаМетаданных = ЧастиПолногоИмени[0]
			+ "."
			+ ЧастиПолногоИмени[1];
		
		// Если предопределенный не создан в ИБ, то требуется выполнить проверку доступа к объекту.
		// В других сценариях проверка доступа выполняется в момент исполнения запроса.
		Если Ссылка = Неопределено Тогда
			МетаданныеОбъекта = ОбъектМетаданныхПоПолномуИмениЛок(ПолноеИмяОбъектаМетаданных);
			Если НЕ ПравоДоступа("Чтение", МетаданныеОбъекта) Тогда
				ВызватьИсключение СтдСтр().ПодставитьПараметрыВСтрокуЛок(
					НСтр("ru = 'Недостаточно прав для работы с таблицей ""%1""'"),
					ПолноеИмяОбъектаМетаданных);
			КонецЕсли;
		КонецЕсли;
		
	Иначе // Если передана ссылка.
		
		Попытка
			ПолноеИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя();
		Исключение
			ВызватьИсключение СтдСтр().ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Неверный первый параметр %1 в функции ЗначенияРеквизитовОбъектаЛок: 
					|Значение должно быть ссылкой или именем предопределенного элемента.'"),
				"Ссылка");
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПолноеИмяОбъектаМетаданныхЗначенияРеквизитовОбъекта

Процедура ЗаполнитьСтруктуруПолейЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты)
	
	// Разбор реквизитов, если второй параметр Строка.
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			СтруктураПолей = Новый Структура;
		КонецЕсли;
		
		Реквизиты = СтдСтр().СтрРазделитьЛок(Реквизиты, ",", Ложь);
		Для Индекс = 0 По Реквизиты.ВГраница() Цикл
			Реквизиты[Индекс] = СокрЛП(Реквизиты[Индекс]);
		КонецЦикла;
	КонецЕсли;
	
	// Приведение реквизитов к единому формату.
	СтруктураПолей = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		Для Каждого КлючИЗначение Из Реквизиты Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ, СокрЛП(КлючИЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		ЗаполнитьСтруктуруПолейИзМассиваЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты);
		
	Иначе
		ВызватьИсключение СтдСтр().ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Неверный тип второго параметра %1 в функции ЗначенияРеквизитовОбъектаЛок: %2.'"),
			"Реквизиты", Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтруктуруПолейЗначенияРеквизитовОбъекта

Процедура ЗаполнитьСтруктуруПолейИзМассиваЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты)
	
	Для Каждого Реквизит Из Реквизиты Цикл
		Реквизит = СокрЛП(Реквизит);
		Попытка
			ПсевдонимПоля = СтрЗаменить(Реквизит, ".", "");
			СтруктураПолей.Вставить(ПсевдонимПоля, Реквизит);
		Исключение
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСтруктуруПолейИзМассиваЗначенияРеквизитовОбъекта

Процедура ОбработатьПараметрыЗначенияРеквизитовОбъектов(Реквизиты, КодЯзыка)
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Реквизиты = СтдСтр().СтрСоединитьЛок(Реквизиты, ",");
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизиты) Тогда
		ВызватьИсключение НСтр("ru = 'Неверный второй параметр Реквизиты в функции ЗначенияРеквизитовОбъектовЛок: 
			|Поле объекта должно быть указано.'");
	КонецЕсли;
	
	Если СтдСтр().СтрНайтиЛок(Реквизиты, ".") <> 0 Тогда
		ВызватьИсключение НСтр("ru = 'Неверный второй параметр Реквизиты в функции ЗначенияРеквизитовОбъектовЛок: 
			|Обращение через точку не поддерживается.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодЯзыка) Тогда
		КодЯзыка = СтдСтр().СтрРазделитьЛок(КодЯзыка, "_", Истина)[0];
	КонецЕсли;
	
КонецПроцедуры // ОбработатьПараметрыЗначенияРеквизитовОбъектов

Функция ЭтоВнешняяОбработка()
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
	Если ПараметрыПроверки.ИспользуемоеИмяФайла = Неопределено Тогда
		ЭтоВнешняяОбработка = Ложь;
	Иначе
		ЭтоВнешняяОбработка = Истина;
	КонецЕсли;
	
	Возврат ЭтоВнешняяОбработка;
	
КонецФункции // ЭтоВнешняяОбработка

Функция СтдКоллекции()
	
	Если СтдКоллекцииЛок = Неопределено Тогда
		Если ЭтоВнешняяОбработка() Тогда
			СтдКоллекцииЛок = Новый("ExternalDataProcessorObject.КонтурДиадокСтдКоллекции");
		Иначе
			СтдКоллекцииЛок = Новый("DataProcessorObject.КонтурДиадокСтдКоллекции");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтдКоллекцииЛок;
	
КонецФункции // СтдКоллекции

Функция СтдОС()
	
	Если СтдСтрЛок = Неопределено Тогда
		Если ЭтоВнешняяОбработка() Тогда
			СтдСтрЛок = Новый("ExternalDataProcessorObject.КонтурДиадокСтдОС");
		Иначе
			СтдСтрЛок = Новый("DataProcessorObject.КонтурДиадокСтдОС");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтдСтрЛок;
	
КонецФункции // СтдОС

Функция СтдСтр()
	
	Если СтдСтрЛок = Неопределено Тогда
		Если ЭтоВнешняяОбработка() Тогда
			СтдСтрЛок = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтр");
		Иначе
			СтдСтрЛок = Новый("DataProcessorObject.КонтурДиадокСтдСтр");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтдСтрЛок;
	
КонецФункции // СтдСтр