////////////////////////////////////////////////////////////////////////////////
// Методы общего назначения:
// - Значение реквизитов объектов;
// - Получение общих модулей;
// - Проверка существования подсистем;
// - прочее.
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
//
// Модуль содержит процедуры и функции из Библиотеки стандартных подсистем,
// распространяемой под лицензией Attribution 4.0 International (CC BY 4.0)
// https://creativecommons.org/licenses/by/4.0/legalcode производны от нее
// или вдохновлены ею, является ООО 1С-Софт (https://1c.ru/).
// Авторские права 2024 г. принадлежат ООО 1С-Софт. Все права защищены.
//
// Процедуры и функции из Библиотеки стандартных подсистем:
// - ЗначенияРеквизитовОбъектаЛок
// - ЗначениеРеквизитаОбъектаЛок
// - ЗначенияРеквизитовОбъектовЛок
// - ЗначениеРеквизитаОбъектовЛок
// - ЕстьРеквизитИлиСвойствоОбъектаЛок
// - КодОсновногоЯзыкаЛок
// - ВерсияРежимаСовместимостиЛок
// - ФиксированныеДанныеЛок
// - СкопироватьРекурсивноЛок
// - ОбщийМодульЛок
// - ПодсистемаСуществуетЛок
// - СообщитьПользователюЛок
// - ОбъектМетаданныхПоПолномуИмениЛок
// - ЭтоWindowsСерверЛок
// - ЭтоLinuxСерверЛок
// - ПолеИсточникаСхемыЗапросаДоступноЛок
// - СообщениеПользователюЛок
// - СерверныйМодульМенеджераЛок
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// БСП: БАЗА ДАННЫХ

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура,
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка),
//              то все реквизиты вернутся со значением Неопределено.
Функция ЗначенияРеквизитовОбъектаЛок(
		Знач Ссылка,
		Знач Реквизиты,
		Знач ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	Перем ПолноеИмяОбъектаМетаданных;
	Перем СтруктураПолей;
	
	ЗаполнитьПолноеИмяОбъектаМетаданныхЗначенияРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Ссылка);
	ЗаполнитьСтруктуруПолейЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты);
	
	// Подготовка результата (после выполнения запроса переопределится).
	Результат = Новый Структура;
	
	// Формирование текста запроса к выбираемым полям.
	ТекстЗапросаПолей = "";
	Для Каждого КлючИЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
				КлючИЗначение.Значение,
				КлючИЗначение.Ключ);
		ПсевдонимПоля = КлючИЗначение.Ключ;
		
		ТекстЗапросаПолей =
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + ПсевдонимПоля;
		
		// Предварительное добавление поля по псевдониму в возвращаемый результат.
		Результат.Вставить(ПсевдонимПоля);
		
	КонецЦикла;
	
	// Если предопределенного нет в ИБ.
	// - приведение результата к отсутствию объекта в ИБ или передаче пустой ссылки.
	Если Ссылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	// BSLLS:AssignAliasFieldsInQuery-off
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|&ТекстЗапросаПолей
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка";
	// BSLLS:AssignAliasFieldsInQuery-on
	Если НЕ ВыбратьРазрешенные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей", ТекстЗапросаПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	// Выполнение запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	// Заполнение реквизитов.
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗначенияРеквизитовОбъектаЛок

// Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует".
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//                                Допускается указание имени реквизита через точку, но при этом параметр КодЯзыка для
//                                такого реквизита учитываться не будет.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то возвращается Неопределено;
//                                если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Произвольный - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//                 Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка),
//                 то возвращается Неопределено.
//
Функция ЗначениеРеквизитаОбъектаЛок(
		Знач Ссылка,
		Знач ИмяРеквизита,
		Знач ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Имя реквизита должно быть заполнено.'"), "ИмяРеквизита", "ЗначениеРеквизитаОбъекта");
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъектаЛок(Ссылка, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции // ЗначениеРеквизитаОбъектаЛок

// Возвращает значения реквизитов, прочитанные из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует".
//
// Параметры:
//  Ссылки - Массив из ЛюбаяСсылка
//         - ФиксированныйМассив из ЛюбаяСсылка - ссылки на объекты.
//           Если массив пуст, то результатом будет пустое соответствие.
//  Реквизиты - Строка - имена реквизитов перечисленные через запятую, в формате требований к свойствам
//                       структуры. Например, "Код, Наименование, Родитель".
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект;
//   * Значение - Структура:
//    ** Ключ - Строка - имя реквизита;
//    ** Значение - Произвольный - значение реквизита.
//
Функция ЗначенияРеквизитовОбъектовЛок(
		Знач Ссылки,
		Знач Реквизиты,
		Знач ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	ОбработатьПараметрыЗначенияРеквизитовОбъектов(Реквизиты, КодЯзыка);
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если Ссылки.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	РеквизитыТекстЗапроса = Реквизиты;
	
	СсылкиПоТипам = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		Тип = ТипЗнч(Ссылка);
		Если СсылкиПоТипам[Тип] = Неопределено Тогда
			СсылкиПоТипам[Тип] = Новый Массив;
		КонецЕсли;
		ЭлементПоТипу = СсылкиПоТипам[Тип]; // Массив
		ЭлементПоТипу.Добавить(Ссылка);
	КонецЦикла;
	
	ТекстыЗапросов = Новый Массив;
	ПараметрыЗапроса = Новый Структура;
	
	ИменаОбъектовМетаданных = Новый Массив;
	
	Для Каждого СсылкиПоТипу Из СсылкиПоТипам Цикл
		Тип = СсылкиПоТипу.Ключ;
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Неверный первый параметр Ссылки в функции ЗначенияРеквизитовОбъектовЛок: 
				|Значения массива должны быть ссылками.'");
		КонецЕсли;
		
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		ИменаОбъектовМетаданных.Добавить(ПолноеИмяОбъектаМетаданных);
		// BSLLS:AssignAliasFieldsInQuery-off
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ссылка,
			|	&Реквизиты
			|ИЗ
			|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
			|ГДЕ
			|	ПсевдонимЗаданнойТаблицы.Ссылка В (&Ссылки)";
		// BSLLS:AssignAliasFieldsInQuery-on
		Если НЕ ВыбратьРазрешенные ИЛИ ТекстыЗапросов.Количество() > 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизиты", РеквизитыТекстЗапроса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
		ИмяПараметра = "Ссылки" + СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ссылки", "&" + ИмяПараметра);
		ПараметрыЗапроса.Вставить(ИмяПараметра, СсылкиПоТипу.Значение);
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ТекстЗапроса = КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(
			ТекстыЗапросов,
			Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КодЯзыка", КодЯзыка);
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(Реквизиты);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции // ЗначенияРеквизитовОбъектовЛок

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует".
//
// Параметры:
//  МассивСсылок       - Массив из ЛюбаяСсылка
//                     - ФиксированныйМассив из ЛюбаяСсылка
//  ИмяРеквизита       - Строка - например, "Код".
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//      * Ключ     - ЛюбаяСсылка  - ссылка на объект,
//      * Значение - Произвольный - значение прочитанного реквизита.
//
Функция ЗначениеРеквизитаОбъектовЛок(
		Знач МассивСсылок,
		Знач ИмяРеквизита,
		Знач ВыбратьРазрешенные = Ложь,
		Знач КодЯзыка = Неопределено) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Имя реквизита должно быть заполнено.'"),
			"ИмяРеквизита",
			"ЗначениеРеквизитаОбъектов");
		
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектовЛок(
			МассивСсылок,
			ИмяРеквизита,
			ВыбратьРазрешенные,
			КодЯзыка);
	
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции // ЗначениеРеквизитаОбъектовЛок

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции // ЕстьРеквизитИлиСвойствоОбъектаЛок

// Возвращает код основного языка
//
// Возвращаемое значение:
//   Строка - Код основного языка например "ru"
//
Функция КодОсновногоЯзыкаЛок() Экспорт
	
	Возврат Метаданные.ОсновнойЯзык.КодЯзыка;
	
КонецФункции // КодОсновногоЯзыкаЛок

// Возвращает версию режима совместимости в формате нумерации редакций и версий, например, 8.3.14.0.
//
// Возвращаемое значение:
//   Строка - версия режима совместимости в формате нумерации редакций и версий.
//
Функция ВерсияРежимаСовместимостиЛок() Экспорт
	
	Если Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		
		Инфо = Новый СистемнаяИнформация;
		Возврат Инфо.ВерсияПриложения;
		
	КонецЕсли;
	
	НомерРедакции = "8";
	
	Подстроки = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Метаданные.РежимСовместимости, "_");
	Подстроки[0] = НомерРедакции;
	
	МаксИндекс = 3;
	Пока Подстроки.ВГраница() < МаксИндекс Цикл
		Подстроки.Добавить("0");
	КонецЦикла;
	
	Возврат КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Подстроки, ".");
	
КонецФункции // ВерсияРежимаСовместимостиЛок

// БСП: СРЕДА ИСПОЛНЕНИЯ

// Позволяет на клиенте получить данные об ОС на Сервере
// Возвращает Истина, если приложение запущено под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Windows
//
Функция ЭтоWindowsСерверЛок() Экспорт
	
	Возврат КонтурДиадокСтдОСКлиентСервер.ЭтоWindows();
	
КонецФункции // ЭтоWindowsСерверЛок

// Позволяет на клиенте получить данные об ОС на Сервере
// Возвращает Истина, если приложение запущено под управлением ОС Linux.
//
// Возвращаемое значение:
//  Булево - запущено ли под управлением ОС Linux
//
Функция ЭтоLinuxСерверЛок() Экспорт
	
	Возврат КонтурДиадокСтдОСКлиентСервер.ЭтоLinux();
	
КонецФункции // ЭтоLinuxСерверЛок

// БСП: КОЛЛЕКЦИИ

// Фиксирует данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - коллекции, значения которых являются примитивными типами,
//           хранилищем значения или не могут быть изменены. Поддерживаются типы значений:
//           Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//           ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//           ЛюбаяСсылка.
//
//  ВызыватьИсключение - Булево - начальное значение Истина. Когда установлено Ложь, тогда в случае наличия
//                                нефиксируемых данных исключение не будет вызвано, при этом данные будут
//                                зафиксированы на сколько возможно.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
//
Функция ФиксированныеДанныеЛок(Данные, ВызыватьИсключение = Истина) Экспорт
	
	Возврат КонтурДиадокСтдКоллекцииКлиентСервер.ФиксированныеДанныеЛок(Данные, ВызыватьИсключение);
	
КонецФункции // ФиксированныеДанныеЛок

// Создает полную копию структуры, соответствия, массива, таблицы значений или списка, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// Параметры:
//  Источник - Структура, ФиксированнаяСтруктура - объект, который необходимо скопировать
//           - Соответствие, ФиксированноеСоответствие - объект, который необходимо скопировать
//           - Массив, ФиксированныйМассив - объект, который необходимо скопировать
//           - ТаблицаЗначений - объект, который необходимо скопировать
//           - ДеревоЗначений - объект, который необходимо скопировать
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево - Истина/Ложь Зафиксировать/снять фиксацию
//                    - Неопределено - Не изменять (По умолчанию)
//
// Возвращаемое значение:
//  - Структура, ФиксированнаяСтруктура - Копия объекта, переданного в параметре Источник
//  - Соответствие, ФиксированноеСоответствие - Копия объекта, переданного в параметре Источник
//  - Массив, ФиксированныйМассив - Копия объекта, переданного в параметре Источник
//  - ДеревоЗначений - Копия объекта, переданного в параметре Источник
//  - ТаблицаЗначений - Копия объекта, переданного в параметре Источник
//  - СписокЗначений - Копия объекта, переданного в параметре Источник
//
Функция СкопироватьРекурсивноЛок(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Возврат КонтурДиадокСтдКоллекцииКлиентСервер.СкопироватьРекурсивноЛок(Источник, ФиксироватьДанные);
	
КонецФункции // СкопироватьРекурсивноЛок

// БСП: НЕОБЯЗАТЕЛЬНЫЕ ПОДСИСТЕМЫ

// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//   ОбщийМодуль
//   МодульМенеджераОбъекта
//
// Пример:
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодульЛок(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		// BSLLS:ExecuteExternalCodeInCommonModule-off
		// BSLLS:ExecuteExternalCode-off
		// перед вычислением алгоритма выполняется проверка, что значение переменной
		// является объектом метаданных
		УстановитьБезопасныйРежим(Истина);
		Модуль = Вычислить(Имя);
		// BSLLS:ExecuteExternalCodeInCommonModule-on
		// BSLLS:ExecuteExternalCode-on
	ИначеЕсли СтрЧислоВхождений(Имя, ".") = 1 Тогда
		Возврат СерверныйМодульМенеджераЛок(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Общий модуль ""%1"" не существует.'"),
			Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции // ОбщийМодульЛок

// Возвращает Истина, если функциональная подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
// У функциональной подсистемы снят флажок "Включать в командный интерфейс".
// См. также ОбщегоНазначенияПереопределяемый.ПриОпределенииОтключенныхПодсистем
// и ОбщегоНазначенияКлиент.ПодсистемаСуществует для вызова из клиентского кода.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если ПодсистемаСуществуетЛок("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево - Истина, если подсистема существует.
//
Функция ПодсистемаСуществуетЛок(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = КонтурДиадокСтдОбщегоНазначенияПовтИсп.ИменаПодсистемЛок();
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции // ПодсистемаСуществуетЛок

// БСП: ОПОВЕЩЕНИЯ ПОЛЬЗОВАТЕЛЕЙ

// Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// В фоновом задании длительной операции, если вызов выполнен вне транзакции,
// сообщение записывается в служебный регистр и отправляется сразу на клиент,
// если подключена система взаимодействия.
// В конце фонового задания длительной операции, а также при отправке прогресса,
// все сообщения извлекаются из очереди сообщений фонового задания,
// записываются в служебный регистр и отправляются сразу на клиент,
// если подключена система взаимодействия.
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  СообщитьПользователюЛок(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимого.
//   3. Установка ссылки без установки поля (и/или пути к данным).
Процедура СообщитьПользователюЛок(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	ЭтоОбъект = Ложь;
	
	Если КлючДанных <> Неопределено
		И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
	
	Сообщение = КонтурДиадокСтдОбщегоНазначенияКлиентСервер.СообщениеПользователюЛок(ТекстСообщенияПользователю,
			КлючДанных, Поле, ПутьКДанным, Отказ, ЭтоОбъект);
	
	Сообщение.Сообщить();
	
КонецПроцедуры // СообщитьПользователюЛок

// БСП: МЕТАДАННЫЕ

// Возвращает ОбъектМетаданных, быстро найденный по полному имени.
// Более производительный аналог метода платформы Метаданные.НайтиПоПолномуИмени
// для корневых объектов метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, например, Справочник.Организации
//
// Возвращаемое значение:
//  ОбъектМетаданных - когда найден
//  Неопределено - когда не найден
//
Функция ОбъектМетаданныхПоПолномуИмениЛок(ПолноеИмя) Экспорт
	
	ПозицияТочки = КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(ПолноеИмя, ".");
	ИмяБазовогоТипа = Лев(ПолноеИмя, ПозицияТочки - 1);
	
	ИменаКоллекций = КонтурДиадокСтдОбщегоНазначенияПовтИсп.ИменаКоллекцийПоИменамБазовыхТиповЛок();
	Коллекция = ИменаКоллекций.Получить(ВРег(ИмяБазовогоТипа));
	
	Если Коллекция = Неопределено Тогда
		Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	Если Коллекция <> "Подсистемы" Тогда
		ИмяОбъекта = Сред(ПолноеИмя, ПозицияТочки + 1);
		ОбъектМетаданных = Метаданные[Коллекция].Найти(ИмяОбъекта);
	Иначе
		ИменаПодсистем = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(ВРег(ПолноеИмя), ".");
		Количество = ИменаПодсистем.Количество();
		Подсистема = Метаданные;
		ОбъектМетаданных = Неопределено;
		Индекс = 0;
		Пока Истина Цикл
			Индекс = Индекс + 1;
			Если Индекс >= Количество Тогда
				Прервать;
			КонецЕсли;
			ИмяПодсистемы = ИменаПодсистем[Индекс];
			Подсистема = Подсистема.Подсистемы.Найти(ИмяПодсистемы);
			Если Подсистема = Неопределено Тогда
				Прервать;
			КонецЕсли;
			Индекс = Индекс + 1;
			Если Индекс = Количество Тогда
				ОбъектМетаданных = Подсистема;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	Возврат ОбъектМетаданных;
	
КонецФункции // ОбъектМетаданныхПоПолномуИмениЛок

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьПолноеИмяОбъектаМетаданныхЗначенияРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Ссылка)
	
	// Если передано имя предопределенного
	
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		
		ПолноеИмяПредопределенногоЭлемента = Ссылка;
		
		// Вычисление ссылки по имени предопределенного.
		// - дополнительно выполняет проверку метаданных предопределенного, выполняется предварительно.
		Попытка
			Ссылка = ПредопределенноеЗначение(ПолноеИмяПредопределенногоЭлемента);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ТекстОшибки = КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
					НСтр("ru = 'Неверный первый параметр Ссылка в функции ЗначенияРеквизитовОбъектаЛок:
						|%1'"),
					КраткоеПредставлениеОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		// Разбор полного имени предопределенного.
		ЧастиПолногоИмени = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(
				ПолноеИмяПредопределенногоЭлемента,
				".");
		ПолноеИмяОбъектаМетаданных = ЧастиПолногоИмени[0]
			+ "."
			+ ЧастиПолногоИмени[1];
		
		// Если предопределенный не создан в ИБ, то требуется выполнить проверку доступа к объекту.
		// В других сценариях проверка доступа выполняется в момент исполнения запроса.
		Если Ссылка = Неопределено Тогда
			МетаданныеОбъекта = ОбъектМетаданныхПоПолномуИмениЛок(ПолноеИмяОбъектаМетаданных);
			Если НЕ ПравоДоступа("Чтение", МетаданныеОбъекта) Тогда
				ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
					НСтр("ru = 'Недостаточно прав для работы с таблицей ""%1""'"),
					ПолноеИмяОбъектаМетаданных);
			КонецЕсли;
		КонецЕсли;
		
	Иначе // Если передана ссылка.
		
		Попытка
			ПолноеИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя();
		Исключение
			ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
				НСтр("ru = 'Неверный первый параметр %1 в функции ЗначенияРеквизитовОбъектаЛок: 
					|Значение должно быть ссылкой или именем предопределенного элемента.'"),
				"Ссылка");
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПолноеИмяОбъектаМетаданныхЗначенияРеквизитовОбъекта

Процедура ЗаполнитьСтруктуруПолейЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты)
	
	// Разбор реквизитов, если второй параметр Строка.
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			СтруктураПолей = Новый Структура;
		КонецЕсли;
		
		Реквизиты = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Реквизиты, ",", Ложь);
		Для Индекс = 0 По Реквизиты.ВГраница() Цикл
			Реквизиты[Индекс] = СокрЛП(Реквизиты[Индекс]);
		КонецЦикла;
	КонецЕсли;
	
	// Приведение реквизитов к единому формату.
	СтруктураПолей = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		Для Каждого КлючИЗначение Из Реквизиты Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ, СокрЛП(КлючИЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		ЗаполнитьСтруктуруПолейИзМассиваЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты);
		
	Иначе
		ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Неверный тип второго параметра %1 в функции ЗначенияРеквизитовОбъектаЛок: %2.'"),
			"Реквизиты", Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтруктуруПолейЗначенияРеквизитовОбъекта

Процедура ЗаполнитьСтруктуруПолейИзМассиваЗначенияРеквизитовОбъекта(СтруктураПолей, Реквизиты)
	
	Для Каждого Реквизит Из Реквизиты Цикл
		Реквизит = СокрЛП(Реквизит);
		Попытка
			ПсевдонимПоля = СтрЗаменить(Реквизит, ".", "");
			СтруктураПолей.Вставить(ПсевдонимПоля, Реквизит);
		Исключение
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСтруктуруПолейИзМассиваЗначенияРеквизитовОбъекта

Процедура ОбработатьПараметрыЗначенияРеквизитовОбъектов(Реквизиты, КодЯзыка)
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Реквизиты = КонтурДиадокСтдСтрКлиентСервер.СтрСоединитьЛок(Реквизиты, ",");
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизиты) Тогда
		ВызватьИсключение НСтр("ru = 'Неверный второй параметр Реквизиты в функции ЗначенияРеквизитовОбъектовЛок: 
			|Поле объекта должно быть указано.'");
	КонецЕсли;
	
	Если КонтурДиадокСтдСтрКлиентСервер.СтрНайтиЛок(Реквизиты, ".") <> 0 Тогда
		ВызватьИсключение НСтр("ru = 'Неверный второй параметр Реквизиты в функции ЗначенияРеквизитовОбъектовЛок: 
			|Обращение через точку не поддерживается.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодЯзыка) Тогда
		КодЯзыка = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(КодЯзыка, "_", Истина)[0];
	КонецЕсли;
	
КонецПроцедуры // ОбработатьПараметрыЗначенияРеквизитовОбъектов

Функция СерверныйМодульМенеджераЛок(Имя)
	
	ОбъектНайден = Ложь;
	КоличествоЧастейИмен = 2;
	ЧастиИмени = КонтурДиадокСтдСтрКлиентСервер.СтрРазделитьЛок(Имя, ".");
	Если ЧастиИмени.Количество() = КоличествоЧастейИмен Тогда
		ОбъектНайден = Метаданные[ЧастиИмени[0]].Найти(ЧастиИмени[1]) <> Неопределено;
	КонецЕсли;
	
	Если НЕ ОбъектНайден Тогда
		ВызватьИсключение КонтурДиадокСтдСтрКлиентСервер.ПодставитьПараметрыВСтрокуЛок(
			НСтр("ru = 'Объект метаданных ""%1"" не существует.'"), Имя);
	КонецЕсли;
	
	// BSLLS:ExecuteExternalCodeInCommonModule-off
	// BSLLS:ExecuteExternalCode-off
	// перед вычислением алгоритма выполняется проверка, что значение переменной
	// является объектом метаданных
	УстановитьБезопасныйРежим(Истина);
	Модуль = Вычислить(Имя);
	// BSLLS:ExecuteExternalCodeInCommonModule-on
	// BSLLS:ExecuteExternalCode-on
	
	Возврат Модуль;
	
КонецФункции // СерверныйМодульМенеджераЛок