//@strict-types
//@skip-check bsl-variable-name-invalid
//@skip-check method-too-many-params

////////////////////////////////////////////////////////////////////////////////
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Служебный программный интерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДвоичныеДанныеТела(Части, Разделитель) Экспорт

	РазделительСтрок = Символы.ВК + Символы.ПС;

	ТелоЗапроса = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ТелоЗапроса, КодировкаТекста.UTF8, ПорядокБайтов.LittleEndian, "", "", Ложь);
	
	Для Каждого Часть Из Части Цикл
		
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
		ЗаписьДанных.ЗаписатьСтроку(ЗаголовкиВСтроку(Часть.Заголовки));
		ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
		ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
		
		Если ТипЗнч(Часть.Данные) = Тип("ДвоичныеДанные") Тогда
			
			ЗаписьДанных.Записать(Часть.Данные);
			
		Иначе
			
			ЗаписьДанных.ЗаписатьСтроку(Часть.Данные);
			
		КонецЕсли;
		
		ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
		
	КонецЦикла;
	
	ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--");
	ЗаписьДанных.Закрыть();

	Возврат ТелоЗапроса.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

Функция ОбъектЗащищенногоСоединенияЛок(ДополнительныеПараметры) Экспорт

	Если ДополнительныеПараметры.ПроверятьSSL = Ложь Тогда
		
		СертификатыУЦ = Неопределено;
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры.ПроверятьSSL) = Тип("СертификатыУдостоверяющихЦентровФайл") Тогда
		
		СертификатыУЦ = ДополнительныеПараметры.ПроверятьSSL;
		
	Иначе
		
		СертификатыУЦ = Новый СертификатыУдостоверяющихЦентровОС;
		
	КонецЕсли;
	
	КлиентскийСертификат = Неопределено;
	
	Если ТипЗнч(ДополнительныеПараметры.КлиентскийСертификатSSL) = Тип("СертификатКлиентаФайл")
		Или ТипЗнч(ДополнительныеПараметры.КлиентскийСертификатSSL) = Тип("СертификатКлиентаWindows") Тогда
		
		КлиентскийСертификат = ДополнительныеПараметры.КлиентскийСертификатSSL;
		
	КонецЕсли;

	Возврат Новый ЗащищенноеСоединениеOpenSSL(КлиентскийСертификат, СертификатыУЦ);

КонецФункции

Функция HTTPСоединениеЛок(Сервер, Порт, Пользователь, Пароль, Прокси, Таймаут, ЗащищенноеСоединение,
	ИспользоватьАутентификациюОС) Экспорт
	
	Если ИспользоватьАутентификациюОС = Неопределено Тогда
	
		// Для совместимости с 8.3.6.
		// ИспользоватьАутентификациюОС появилась в 8.3.7
		Возврат Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль, Прокси, Таймаут, ЗащищенноеСоединение);
		
	Иначе
		
		Возврат Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль, Прокси, Таймаут, ЗащищенноеСоединение,
			ИспользоватьАутентификациюОС);
			
	КонецЕсли;
	
КонецФункции

Функция РаскодироватьСтрокуЛок(ЗакодированнаяСтрока, СпособКодирования) Экспорт
	
	Возврат РаскодироватьСтроку(ЗакодированнаяСтрока, СпособКодированияСтроки[СпособКодирования]);
	
КонецФункции

Функция КодироватьСтрокуЛок(НекодированнаяСтрока, СпособКодирования) Экспорт
	
	Возврат КодироватьСтроку(НекодированнаяСтрока, СпособКодированияСтроки[СпособКодирования]);
	
КонецФункции

// Вызвать HTTPМетод.
// 
// Параметры:
//  Соединение - HTTPСоединение  - Соединение
//  HTTPМетод - Строка - HTTPМетод
//  HTTPЗапрос - HTTPЗапрос -
//  ИмяВыходногоФайла - Строка, Неопределено - Имя выходного файла
// 
// Возвращаемое значение:
//  HTTPОтвет 
Функция ВызватьHTTPМетодЛок(Соединение, HTTPМетод, HTTPЗапрос, ИмяВыходногоФайла = Неопределено) Экспорт
	
	Возврат Соединение.ВызватьHTTPМетод(HTTPМетод, HTTPЗапрос, ИмяВыходногоФайла);
	
КонецФункции

// Хеширование данных.
// 
// Параметры:
//  Алгоритм - Строка - Алгоритм
//  Данные - ДвоичныеДанные, Строка - Данные
// 
// Возвращаемое значение:
//  Строка - Хеш
Функция ХешированиеДанныхЛок(Алгоритм, Данные) Экспорт

	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		
		Данные = ПолучитьДвоичныеДанныеИзСтроки(Данные, КодировкаТекста.UTF8, Ложь);
		
	КонецЕсли;

	Хеширование = Новый ХешированиеДанных(ХешФункция[Алгоритм]);
	Хеширование.Добавить(Данные);

	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));

КонецФункции

// Выполняет чтение данных из архива GZip.
// 
// Параметры:
//  СжатыеДанные - ДвоичныеДанные - данные упакованные GZip.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - распакованные данные.
Функция ПрочитатьGZipЛок(СжатыеДанные) Экспорт

	РазмерПрефиксаGZip = 10;
	РазмерПостфиксаGZip = 8;
	ZipРазмерLFH = 34;
	ZipРазмерDD = 16;
	ZipРазмерCDH = 50;
	ZipРазмерEOCD = 22;

	ЧтениеДанных = Новый ЧтениеДанных(СжатыеДанные);
	ЧтениеДанных.Пропустить(РазмерПрефиксаGZip);
	РазмерСжатыхДанных = ЧтениеДанных.ИсходныйПоток().Размер() - РазмерПрефиксаGZip - РазмерПостфиксаGZip;

	ПотокZip = Новый ПотокВПамяти(ZipРазмерLFH + РазмерСжатыхДанных + ZipРазмерDD + ZipРазмерCDH + ZipРазмерEOCD);
	ЗаписьДанных = Новый ЗаписьДанных(ПотокZip);
	ZipLFH(ЗаписьДанных);
	ЧтениеДанных.КопироватьВ(ЗаписьДанных, РазмерСжатыхДанных);

	ЗаписьДанных.Закрыть();
	ЗаписьДанных = Новый ЗаписьДанных(ПотокZip);

	CRC32 = ЧтениеДанных.ПрочитатьЦелое32();
	РазмерНесжатыхДанных = ЧтениеДанных.ПрочитатьЦелое32();
	ЧтениеДанных.Закрыть();

	ZipDD(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных);
	ZipCDH(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных);
	ZipEOCD(ЗаписьДанных, РазмерСжатыхДанных);
	ЗаписьДанных.Закрыть();

	Возврат ПрочитатьZip(ПотокZip);

КонецФункции

// Выполняет запись данных в архив GZip.
// 
// Параметры:
//  Данные - ДвоичныеДанные - исходные данные.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - данные упакованные GZip.
Функция ЗаписатьGZipЛок(Данные) Экспорт

	ЧтениеДанных = Новый ЧтениеДанных(ЗаписатьZip(Данные));

	НачальноеСмещение = 14;
	ЧтениеДанных.Пропустить(НачальноеСмещение);
	CRC32 = ЧтениеДанных.ПрочитатьЦелое32();

	РазмерСжатыхДанных = ЧтениеДанных.ПрочитатьЦелое32();
	РазмерИсходныхДанных = ЧтениеДанных.ПрочитатьЦелое32();

	РазмерИмениФайла = ЧтениеДанных.ПрочитатьЦелое16();
	РазмерДополнительногоПоля = ЧтениеДанных.ПрочитатьЦелое16();
	ЧтениеДанных.Пропустить(РазмерИмениФайла + РазмерДополнительногоПоля);

	ПотокGZip = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ПотокGZip);
	GZipHeader(ЗаписьДанных);
	ЧтениеДанных.КопироватьВ(ЗаписьДанных, РазмерСжатыхДанных);
	ЗаписьДанных.Закрыть();
	ЗаписьДанных = Новый ЗаписьДанных(ПотокGZip);

	GZipFooter(ЗаписьДанных, CRC32, РазмерИсходныхДанных);

	Возврат ПотокGZip.ЗакрытьИПолучитьДвоичныеДанные();

КонецФункции

// Двоичные данные из строки.
// 
// Параметры:
//  ВходящаяСтрока - Строка - Входящая строка
//  Кодировка - Строка, КодировкаТекста - Кодировка текста
//  ЗаписатьBOM - Булево - Записать BOM
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Двоичные данные строки
Функция ПолучитьДвоичныеДанныеИзСтрокиЛок(ВходящаяСтрока, Кодировка = "UTF-8", ЗаписатьBOM = Ложь) Экспорт
	
	Возврат ПолучитьДвоичныеДанныеИзСтроки(ВходящаяСтрока, Кодировка, ЗаписатьBOM);
	
КонецФункции

// Строка из двоичных данных.
// 
// Параметры:
//  ВходящиеДвоичныеДанные - ДвоичныеДанные - Входящие двоичные данные
//  Кодировка - Строка, КодировкаТекста - Кодировка текста
// 
// Возвращаемое значение:
//  Строка - Строка из двоичных данных
Функция ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Кодировка = "UTF-8") Экспорт
	
	Возврат ПолучитьСтрокуИзДвоичныхДанных(ВходящиеДвоичныеДанные, Кодировка);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Функция ПрочитатьZip(СжатыеДанные, ТекстОшибки = Неопределено)

	Каталог = ПолучитьИмяВременногоФайла();
	ЧтениеZip = Новый ЧтениеZipФайла(СжатыеДанные);
	ИмяФайла = ЧтениеZip.Элементы[0].Имя;
	
	Попытка
		
		ЧтениеZip.Извлечь(ЧтениеZip.Элементы[0], Каталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		
	Исключение
		
		// Игнорируем проверку целостности архива, просто читаем результат
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	ЧтениеZip.Закрыть();

	Результат = Новый ДвоичныеДанные(Каталог + ПолучитьРазделительПути() + ИмяФайла);
	УдалитьФайлы(Каталог);

	Возврат Результат;

КонецФункции

Функция ЗаписатьZip(Данные)

	ВременныйФайл = ПолучитьИмяВременногоФайла(".bin");
	Данные.Записать(ВременныйФайл);
	ПотокZip = Новый ПотокВПамяти;
	ЗаписьZip = Новый ЗаписьZipФайла(ПотокZip);
	ЗаписьZip.Добавить(ВременныйФайл);
	ЗаписьZip.Записать();
	УдалитьФайлы(ВременныйФайл);

	Возврат ПотокZip.ЗакрытьИПолучитьДвоичныеДанные();

КонецФункции

Процедура ZipLFH(ЗаписьДанных)

	// Local file header
//	Буфер = Новый БуферДвоичныхДанных(ZipРазмерLFH());
	ЗаписьДанных.ЗаписатьЦелое32(67324752); // signature 0x04034b50
	ЗаписьДанных.ЗаписатьЦелое16(20); // version
	ЗаписьДанных.ЗаписатьЦелое16(10); // bit flags
	ЗаписьДанных.ЗаписатьЦелое16(8); // compression method
	ЗаписьДанных.ЗаписатьЦелое16(0); // time
	ЗаписьДанных.ЗаписатьЦелое16(0); // date
	ЗаписьДанных.ЗаписатьЦелое32(0); // crc-32
	ЗаписьДанных.ЗаписатьЦелое32(0); // compressed size
	ЗаписьДанных.ЗаписатьЦелое32(0); // uncompressed size
	ЗаписьДанных.ЗаписатьЦелое16(4); // filename legth - "data"
	ЗаписьДанных.ЗаписатьЦелое16(0); // extra field length
	ЗаписьДанных.Записать(ПолучитьДвоичныеДанныеИзСтроки("data", "ascii", Ложь));
КонецПроцедуры

Процедура ZipDD(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных)

	// Data descriptor
//	Буфер = Новый БуферДвоичныхДанных(ZipРазмерDD());
	ЗаписьДанных.ЗаписатьЦелое32(134695760);
	ЗаписьДанных.ЗаписатьЦелое32(CRC32);
	ЗаписьДанных.ЗаписатьЦелое32(РазмерСжатыхДанных);
	ЗаписьДанных.ЗаписатьЦелое32(РазмерНесжатыхДанных);
	
КонецПроцедуры

Процедура ZipCDH(ЗаписьДанных, CRC32, РазмерСжатыхДанных, РазмерНесжатыхДанных)

	// Central directory header
//	ZipРазмерCDH = 50;
//	Буфер = Новый БуферДвоичныхДанных(ZipРазмерCDH);
	ЗаписьДанных.ЗаписатьЦелое32(33639248); // signature 0x02014b50
	ЗаписьДанных.ЗаписатьЦелое16(798); // version made by
	ЗаписьДанных.ЗаписатьЦелое16(20); // version needed to extract
	ЗаписьДанных.ЗаписатьЦелое16(10); // bit flags
	ЗаписьДанных.ЗаписатьЦелое16(8); // compression method
	ЗаписьДанных.ЗаписатьЦелое16(0); // time
	ЗаписьДанных.ЗаписатьЦелое16(0); // date
	ЗаписьДанных.ЗаписатьЦелое32(CRC32); // crc-32
	ЗаписьДанных.ЗаписатьЦелое32(РазмерСжатыхДанных); // compressed size
	ЗаписьДанных.ЗаписатьЦелое32(РазмерНесжатыхДанных); // uncompressed size
	ЗаписьДанных.ЗаписатьЦелое16(4); // file name length
	ЗаписьДанных.ЗаписатьЦелое16(0); // extra field length
	ЗаписьДанных.ЗаписатьЦелое16(0); // file comment length
	ЗаписьДанных.ЗаписатьЦелое16(0); // disk number start
	ЗаписьДанных.ЗаписатьЦелое16(0); // internal file attributes
	ЗаписьДанных.ЗаписатьЦелое32(2176057344); // external file attributes
	ЗаписьДанных.ЗаписатьЦелое32(0); // relative offset of local header
	ЗаписьДанных.Записать(ПолучитьДвоичныеДанныеИзСтроки("data", "ascii", Ложь));
	
КонецПроцедуры

Процедура ZipEOCD(ЗаписьДанных, РазмерСжатыхДанных)

	// End of central directory
	РазмерCDH = 50;
	ZipРазмерLFH = 34;
	ZipРазмерDD = 16;
//	ZipРазмерEOCD = 22;
//	Буфер = Новый БуферДвоичныхДанных(ZipРазмерEOCD);
	ЗаписьДанных.ЗаписатьЦелое32(101010256); // signature 0x06054b50
	ЗаписьДанных.ЗаписатьЦелое16(0); // number of this disk
	ЗаписьДанных.ЗаписатьЦелое16(0); // number of the disk with the start of the central directory
	ЗаписьДанных.ЗаписатьЦелое16(1); // total number of entries in the central directory on this disk
	ЗаписьДанных.ЗаписатьЦелое16(1); // total number of entries in the central directory
	ЗаписьДанных.ЗаписатьЦелое32(РазмерCDH); // size of the central directory
	// offset of start of central directory with respect to the starting disk number
	ЗаписьДанных.ЗаписатьЦелое32(ZipРазмерLFH + РазмерСжатыхДанных + ZipРазмерDD);
	ЗаписьДанных.ЗаписатьЦелое16(0); // the starting disk number
	
КонецПроцедуры

Процедура GZipHeader(ЗаписьДанных)
	
//	GZipРазмерHeader = 10;
//	Буфер = Новый БуферДвоичныхДанных(GZipРазмерHeader);
	ЗаписьДанных.ЗаписатьБайт(31); // ID1 0x1f
	ЗаписьДанных.ЗаписатьБайт(139); // ID2 0x8b
	ЗаписьДанных.ЗаписатьБайт(8); // compression method (08 for DEFLATE)
	ЗаписьДанных.ЗаписатьБайт(0); // header flags
	ЗаписьДанных.ЗаписатьЦелое32(0); // timestamp
	ЗаписьДанных.ЗаписатьБайт(0); // compression flags
	ЗаписьДанных.ЗаписатьБайт(255); // operating system ID
	
КонецПроцедуры

Процедура GZipFooter(ЗаписьДанных, CRC32, РазмерИсходныхДанных)
	
//	GZipРазмерFooter = 8;
//	Буфер = Новый БуферДвоичныхДанных(GZipРазмерFooter());
	ЗаписьДанных.ЗаписатьЦелое32(CRC32);
	ЗаписьДанных.ЗаписатьЦелое32(РазмерИсходныхДанных);
	
КонецПроцедуры

// Дубликаты
Функция ЗаголовкиВСтроку(Заголовки)

	РазделительСтрок = Символы.ВК + Символы.ПС;
	Строки = Новый Массив;

	СортированныеЗаголовки = "Content-Disposition, Content-Type, Content-Location";
	
	Для Каждого Ключ Из СтрРазделить(СортированныеЗаголовки, ",") Цикл
		
		Значение = ЗначениеЗаголовка(Ключ, Заголовки);
		
		Если Значение <> Ложь И ЗначениеЗаполнено(Значение) Тогда
			
			Строки.Добавить(СтрШаблон("%1: %2", Ключ, Значение));
			
		КонецЕсли;
		
	КонецЦикла;

	Ключи = СтрРазделить(ВРег(СортированныеЗаголовки), ",");
	
	Для Каждого Заголовок Из Заголовки Цикл
		
		Если Ключи.Найти(ВРег(Заголовок.Ключ)) = Неопределено Тогда
			
			Строки.Добавить(СтрШаблон("%1: %2", Заголовок.Ключ, Заголовок.Значение));
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат СтрСоединить(Строки, РазделительСтрок);

КонецФункции

Функция ЗначениеЗаголовка(Заголовок, ВсеЗаголовки, Ключ = Неопределено)

	Для Каждого ОчереднойЗаголовок Из ВсеЗаголовки Цикл
		
		Если НРег(ОчереднойЗаголовок.Ключ) = НРег(Заголовок) Тогда
			
			Ключ = ОчереднойЗаголовок.Ключ;
			Возврат ОчереднойЗаголовок.Значение;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Ложь;

КонецФункции

#КонецЕсли