// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем ИнтеграционныйМодуль;
Перем ТиповойМодуль;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//**************************************
//{		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки()); //* возможно тут целесообразнее использовать версию API подключаемого модуля как в интеграционниках
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Результат = "1.0.0";
	
	Возврат Результат;
	
КонецФункции

//}		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Интеграционник, Модуль_ТиповойМодуль) Экспорт
	
	ИнтеграционныйМодуль = Модуль_Интеграционник;
	ТиповойМодуль = Модуль_ТиповойМодуль;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	ИнтеграционныйМодуль 	= Неопределено;
	ТиповойМодуль	 		= Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//{		ПРОГРАММНЫЙ ИНТЕРФЕЙС


// Типовой обработчик события "ПолучитьЗаполненныйОбъектДокумента1С"
//
// Параметры:
//  Документ - Структура - электронный документ (см. Контракт_Документ)
//  ИдентификаторОперации - Строка, Неопределено - идентификатор операции по созданию учетного
//                          документа (см. Ядро.Документы_СписокТиповДокументовДляСоздания)
//  ДополнительныеПараметрыОбработчика - Структура, Неопределено - дополнительные параметры обработчика события
//  ПараметрыСоздания - Структура - (Необязательный) параметры создания
//									(см. ДополнительныеПараметрыСозданияУчетногоДокумента)
//
// Возвращаемое значение:
//  Структура:
//    * ОсновнойОбъект - ДокументОбъект, СправочникОбъект, Неопределено - заполненный объект ИБ
//						(Неопределено, если есть ошибки)
//    * ОписаниеОшибки - Строка - текст ошибки создания объекта
//
Функция ПолучитьЗаполненныйОбъектДокумента1С(
		Документ,
		ИдентификаторОперации,
		ДополнительныеПараметрыОбработчика,
		ПараметрыСоздания = Неопределено
	) Экспорт
	
	ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С";
	
	ИсполняемыеПараметры = ДополнительныеПараметрыСозданияУчетногоДокумента();
	Если ЗначениеЗаполнено(ПараметрыСоздания) Тогда
		ЗаполнитьЗначенияСвойств(ИсполняемыеПараметры, ПараметрыСоздания);
	КонецЕсли;
	
	ПараметрыИМ = Новый Структура;
	ПараметрыИМ.Вставить("Документ", Документ);
	ПараметрыИМ.Вставить("ИдентификаторОперации", ИдентификаторОперации);
	ПараметрыИМ.Вставить("ДополнительныеПараметры", ДополнительныеПараметрыОбработчика);
	ПараметрыИМ.Вставить("СоздаватьСчетаФактуры", ИсполняемыеПараметры.СоздаватьСчетаФактуры);
	ПараметрыИМ.Вставить("ИспользоватьДатуЭлектронногоДокумента", ИсполняемыеПараметры.ИспользоватьДатуЭлектронногоДокумента);
	ПараметрыИМ.Вставить("ОтключитьПроверкуСопоставленияНоменклатуры", ИсполняемыеПараметры.ОтключитьПроверкуСопоставленияНоменклатуры);
	
	Результат = ИнтеграционныйМодуль.ОбработатьСобытие(
			ИмяСобытия,
			ПараметрыИМ
		);
	
	Возврат Результат;
	
КонецФункции

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//  * ID - Строка - идентификатор вида пакета
//  * Наименование - Строка - пользовательское представление вида пакета
//  * СоставПакета - Строка - идентификаторы видов документов (через запятую)
//  * КатегорияПакета - Строка - идентификатор категории пакетов
//  * НаименованиеКатегории - Строка - пользовательское представление категории пакетов
//  * Шаблон - Булево - Истина, если пакет является шаблоном
//  * ВнутреннийДО - Булево - Истина, если пакет используется для внутреннего документооборота
//  * БазовыйВидПакета - Строка - Идентификатор вида пакета, который является основным для текущего вида.
//                                Заполняется для пакетов без категории.
//
Функция ПоставляемыеВидыПакетов() Экспорт
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ID", ТипСтрока, "Идентификатор");
	Результат.Колонки.Добавить("Наименование", ТипСтрока, "Представление");
	Результат.Колонки.Добавить("СоставПакета", ТипСтрока, "Состав пакета");
	Результат.Колонки.Добавить("КатегорияПакета", ТипСтрока, "Идентификатор категории");
	Результат.Колонки.Добавить("НаименованиеКатегории", ТипСтрока, "Представление категории");
	Результат.Колонки.Добавить("Шаблон", ТипБулево, "Это шаблон");
	Результат.Колонки.Добавить("ВнутреннийДО", ТипБулево, "Это внутренний ДО");
	Результат.Колонки.Добавить("БазовыйВидПакета", ТипСтрока, "Базовый вид пакета");
	
	ИнтеграционныйМодуль.ЗаполнитьСписокПоставляемыхПакетов(Результат);
	
	Возврат Результат;
	
КонецФункции

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхВидовДокументов"
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//    * ID - Строка - идентификатор вида документа
//    * Наименование - Строка - пользовательское представление вида документа
//    * ТипДокументаAPI - Строка - идентификатор типа документа (TypeNamedId)
//    * ТипКонтентаAPI - Строка - идентификатор формата вложения (FormatVersion)
//    * ФункцияДокументаAPI - Строка - идентификатор функции документа (пустая строка для значения "default")
//    * БазовыйВидДокумента - Строка - идентификатор базового вида документа
//
Функция ПоставляемыеВидыДокументов() Экспорт
	
	ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов";
	ПараметрыСобытия = Новый Структура;
	
	Результат = ИнтеграционныйМодуль.ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия);
	
	Возврат Результат;
	
КонецФункции

// Типовой обработчик события "НайтиСопоставлениеДокумента"
//
// Параметры:
//  Документ - Структура - электронный документ (см. Контракт_Документ)
//
// Возвращаемое значение:
//  Массив - коллекция документов учкета 1С
//
Функция НайтиСопоставлениеДокумента(Документ) Экспорт
	
	ИмяСобытия = "НайтиСопоставлениеДокумента";
	
	ПараметрыИМ = Новый Структура;
	ПараметрыИМ.Вставить("Документ", Документ);
	
	Результат = ИнтеграционныйМодуль.ОбработатьСобытие(
			ИмяСобытия,
			ПараметрыИМ);
	
	Возврат Результат;
	
КонецФункции

// Типовой обработчик события "ПодготовитьЭлектронныйДокумент"
//
Процедура ПодготовитьЭлектронныйДокумент(Результат, ДанныеСотрудника, ВидДокументаРазвернутый, ДополнительныеПараметры) Экспорт
	
	ПараметрыИМ = Новый Структура;
	ПараметрыИМ.Вставить("Результат", Результат);
	ПараметрыИМ.Вставить("ДанныеСотрудника", ДанныеСотрудника);
	ПараметрыИМ.Вставить("ВидДокументаРазвернутый", ВидДокументаРазвернутый);
	ПараметрыИМ.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	ИнтеграционныйМодуль.ОбработатьСобытие("ПодготовитьЭлектронныйДокумент", ПараметрыИМ);
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - хранилище временных таблиц
//  ВидПакета - Строка - идентификатор вида пакета
//  Период - СтандартныйПериод - Период выборки данных для отправки
// 
// Возвращаемое значение:
//  Массив из Строка - Имена временных таблиц с данными для отправки
//
Функция ВнутренниеДокументы_ПодготовитьДанныеДляОтправки(МенеджерВТ, Знач ВидПакета, Знач Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ВидПакетаID", ВидПакета);
	
	Результат = ИнтеграционныйМодуль.ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакета, Запрос);
	
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров создания учетных документов.
//
// Возвращаемое значение:
//  Структура:
//    * СоздаватьСчетаФактуры - Булево - Истина, если требуется создать комплект учетных документов.
//    * ИспользоватьДатуЭлектронногоДокумента - Булево - Истина, если требуется в документе 1С
//      заполнять дату из электронного документа
//
Функция ДополнительныеПараметрыСозданияУчетногоДокумента() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СоздаватьСчетаФактуры", Ложь);
	Результат.Вставить("ИспользоватьДатуЭлектронногоДокумента", Ложь);
	Результат.Вставить("ОтключитьПроверкуСопоставленияНоменклатуры", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает коллекцию ссылок на записи информационной базы, сопоставленные с подразделениями организации-отправителя
// и организации-получателя в системе Диадок.
//
// Параметры:
//  Документ1С - ДокументСсылка - Документ учета информационной базы, связанный с текущим пакетом электронных документов
//
// Возвращаемое значение:
//   Структура - Структура из массивов:
//    * Отправитель - Массив - Коллекция ссылок на сопоставленное подразделение-отправитель.
//    * Получатель	- Массив - Коллекция ссылок на сопоставленное подразделение-получатель.
//
Функция ЗначенияПолейМаршрутизацииПоПодразделениям(Документ1С) Экспорт
	
	ПоляОтправителя = Новый Массив;
	ПоляПолучателя = Новый Массив;
	
	ИнтеграционныйМодуль.ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С);
	
	Результат = Новый Структура;
	Результат.Вставить("Отправитель", ПоляОтправителя);
	Результат.Вставить("Получатель", ПоляПолучателя);
	
	Возврат Результат;
	
КонецФункции

// Собирает контент электронного документа, используя типовые методы текущей конфигурации 
//
// Параметры:
//	ДокументДиадок - Структура - описание электронного документа
//
Функция ПодготовитьЭлектронныйДокументСредствамиКонфигурации(ДокументДиадок) Экспорт
	
	Документ1С = ДокументДиадок.ДокументУчета;
	ИдентификаторВидаДокумента = ДокументДиадок.ИдентификаторВида;
	
	ТребуетсяПФСчета = ЭтоИдентификаторВидаНеформализованныйСчет(ИдентификаторВидаДокумента);
	
	ДанныеПечатнойФормы = Неопределено;
	
	Если ТребуетсяПФСчета Тогда
		
		ДанныеПечатнойФормы = РезультатВизуализацииСчетаНаОплатуСредствамиКонфигурации(Документ1С);
		
	КонецЕсли;
	
	Возврат ДанныеПечатнойФормы;
	
КонецФункции

// Возвращает список доступных оснований для заданного вида электронного документа в рамках используемой конфигурации
//
// Параметры:
//	ВидДокумента - Строка - идентификатор вида документа: "ID_АктФормализованный", "ID_ТОРГ12" и т.д.
//
// Возвращаемое значение:
//	СписокЗначений - список возможных оснований
//
Функция СписокОснованийВидаЭлектронногоДокумента(ВидДокумента) Экспорт
	
	Результат = Новый СписокЗначений;
	
	ЭтоФормализованныйСчет = ЭтоИдентификаторВидаФормализованныйСчет(ВидДокумента);
	ЭтоНеформализованныйСчет = ЭтоИдентификаторВидаНеформализованныйСчет(ВидДокумента);
	
	Если ЭтоФормализованныйСчет ИЛИ ЭтоНеформализованныйСчет Тогда
		
		ИнтеграционныйМодуль.ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение по умолчанию настройки "ТипОснования" для вида документа
//
// Параметры:
//	ВидДокумента - Строка - идентификатор вида документа: "ID_АктФормализованный", "ID_ТОРГ12" и т.д.
//
// Возвращаемое значение:
//	Строка
Функция ОснованияВидовДокументов_ЗначениеПоУмолчанию(ВидДокумента) Экспорт
	
	Результат = "";
	
	ЭтоФормализованныйСчет = ЭтоИдентификаторВидаФормализованныйСчет(ВидДокумента);
	ЭтоНеформализованныйСчет = ЭтоИдентификаторВидаНеформализованныйСчет(ВидДокумента);
	
	Если ЭтоФормализованныйСчет ИЛИ ЭтоНеформализованныйСчет Тогда
		
		Результат = ТипОснования_СчетНаОплату();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает флаг доступности использования типовой печатной формы
//
// Параметры:
//  ВидДокумента - Строка - идентификатор вида документа: "ID_АктФормализованный", "ID_ТОРГ12" и т.д.
//  ТипОснования - Строка - Типо основания для формирования документа 
// 
// Возвращаемое значение:
//   Булево - Возможность использования типовой ПФ
//
Функция ДоступнаТиповаяПечатнаяФорма(ВидДокумента, ТипОснования) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	Результат = Истина;
	
	ИнтеграционныйМодуль.ПроверитьДоступностьТиповойПечатнойФормы(
		Результат,
		ВидДокумента,
		ТипОснования,
		СтандартнаяОбработка
	);
	
	Если СтандартнаяОбработка Тогда
		
		Результат = ЭтоИдентификаторВидаНеформализованныйСчет(ВидДокумента)
					И (ТипОснования = ТипОснования_СчетНаОплату()
						ИЛИ ТипОснования = ТипОснования_ЗаказКлиента()
						ИЛИ ТипОснования = ТипОснования_ЗаказПокупателя());
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

// Функция - Виды электронных счетов на оплату
// 
// Возвращаемое значение:
//  Массив - коллекция видов идентификаторов электронных счетов
//
Функция ВидыЭлектронныхСчетовНаОплату() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ID_Счет");
	Результат.Добавить("ID_СчетФормализованный");
	Результат.Добавить("ID_СчетФормализованныйФНС");
	Результат.Добавить("ID_СчетОфертаФормализованныйФНС");
	
	Возврат Результат;
	
КонецФункции

// Определяет является ли переданный идентификатор вида документа идентификатором формализованного счета
//
// Параметры:
//	ВидДокумента - Строка - идентификатор вида документа: "ID_АктФормализованный", "ID_ТОРГ12" и т.д.
//
// Возвращаемое значение:
//	Булево - Истина, если это ID формализованного счета
Функция ЭтоИдентификаторВидаФормализованныйСчет(ИдентификаторВида) Экспорт
	
	ИдентификаторыВидаФормализованногоСчета = Новый Массив;
	ИдентификаторыВидаФормализованногоСчета.Добавить("ID_СчетФормализованный");
	ИдентификаторыВидаФормализованногоСчета.Добавить("ID_СчетФормализованныйФНС");
	ИдентификаторыВидаФормализованногоСчета.Добавить("ID_СчетОфертаФормализованныйФНС");
	
	Результат = (ИдентификаторыВидаФормализованногоСчета.Найти(ИдентификаторВида) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Определяет является ли переданный идентификатор вида документа идентификатором неформализованного счета
//
// Параметры:
//	ВидДокумента - Строка - идентификатор вида документа: "ID_АктФормализованный", "ID_ТОРГ12" и т.д.
//
// Возвращаемое значение:
//	Булево - Истина, если это ID неформализованного счета
Функция ЭтоИдентификаторВидаНеформализованныйСчет(ИдентификаторВида) Экспорт
	
	Результат = (ИдентификаторВида = "ID_Счет");
	
	Возврат Результат;
	
КонецФункции

// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = ИнтеграционныйМодуль.ЭтоДокументКонфигурацииСчетНаОплату(Документ1С);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизитов номер и дата документа учета
//
// Параметры:
//  Документ		 - Структура - см. Контракт_Документ
//  СсылкаНаОбъект	 - ДокументСсылка - Ссылка на документ учета
// 
// Возвращаемое значение:
// РеквизитыДокументаУчета - Структура - Коллекция в которой находятся реквизиты и их соответствия в случае отсутствия ИМ возвращает Неопределено
// 	- Номер - Строка - номер учетного документа
// 	- Дата - Дата - дата учетного документа
//
Функция ПолучитьРеквизитыДокументаУчета_НомерДата(СсылкаНаОбъект) Экспорт
	
	СоответствиеРеквизитов = СоответствиеРеквизитовПоУмолчанию();
	
	ИнтеграционныйМодуль.ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствиеРеквизитов, СсылкаНаОбъект);
	
	Результат = ЗаполненныеРеквизитыДокументаУчета(
			СоответствиеРеквизитов,
			СсылкаНаОбъект
		);
	
	Возврат Результат;
	
КонецФункции

// Заполняет значение реквизитов номер и дата документа учета
//
// Параметры:
//  СсылкаНаОбъект	 	- ДокументОбъект - Объект документа учета
//  Номер	 			- Строка - Номер документа учета для заполнения
//  Дата	 			- Дата - Дата документа учета для заполнения
//
Процедура ЗаполнитьРеквизитыДокументаУчета_НомерДата(СсылкаНаОбъект, Номер, Дата) Экспорт
	
	СоответствиеРеквизитов = СоответствиеРеквизитовПоУмолчанию();
	
	ИнтеграционныйМодуль.ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствиеРеквизитов, СсылкаНаОбъект);
	
	ИмяРеквизитаНомер = СоответствиеРеквизитов.Номер;
	ИмяРеквизитаДата = СоответствиеРеквизитов.Дата;

	Если Не ЕстьРеквизитыНомерИДатаВУчетномДокументе(СоответствиеРеквизитов, СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить(ИмяРеквизитаНомер, Номер);
	СтруктураЗаполнения.Вставить(ИмяРеквизитаДата, Дата);
	
	ЗаполнитьЗначенияСвойств(СсылкаНаОбъект, СтруктураЗаполнения);
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  КоллекцияДокументов - Массив - Коллекция документов по которым нужно получить реквизиты Организации и Контрагента
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент)
//
Функция ЗначенияРеквизитовДокументовУчета(КоллекцияДокументов) Экспорт
	
	Результат = Новый Соответствие;
	
	ДокументыПоТипам = Новый Соответствие;
	Для Каждого ДокументУчета Из КоллекцияДокументов Цикл
		
		Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипДокумента = ТипЗнч(ДокументУчета);
		Если ДокументыПоТипам.Получить(ТипДокумента) = Неопределено Тогда
			ДокументыПоТипам.Вставить(ТипДокумента, Новый Массив);
		КонецЕсли;
		
		ДокументыПоТипам[ТипДокумента].Добавить(ДокументУчета);
		
	КонецЦикла;
	
	Для Каждого Элемент Из ДокументыПоТипам Цикл
		
		ОбъектМД = Метаданные.НайтиПоТипу(Элемент.Ключ);
		Если Не ПравоДоступа("Чтение", ОбъектМД) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатФункции = ИнтеграционныйМодуль.ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(Элемент.Значение);
		Общее_ДополнитьСоответствие(Результат, РезультатФункции);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// см. ИнтеграционныйМодуль.СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора()
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(ОснованиеЭлектронногоСчета) Экспорт
	
	Результат = ИнтеграционныйМодуль.СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(ОснованиеЭлектронногоСчета);
	
	Возврат Результат;
	
КонецФункции

// см. ИнтеграционныйМодуль.СчетаНаОплату_СвязанныеДокументы()
//
Функция СчетаНаОплату_СвязанныеДокументы(ОснованиеЭлектронногоСчета) Экспорт
	
	Результат = ИнтеграционныйМодуль.СчетаНаОплату_СвязанныеДокументы(ОснованиеЭлектронногоСчета);
	
	Возврат Результат;
	
КонецФункции

// Получает список оснований учетного документа.
//
// Параметры:
//  ДокументУчета	 - ДокументСсылка - Ссылка на документ учета
// 
// Возвращаемое значение:
//  Массив - коллекция оснований документа учета
//
Функция ОснованияДокументаУчета(ДокументУчета) Экспорт
	
	Результат = Новый Массив;
	ИнтеграционныйМодуль.ПриПолученииОснованийДокументаУчета(Результат, ДокументУчета);
	
	Возврат Результат;
	
КонецФункции

// Возвращает свойства набора номенклатур информационной базы.
// Определяет обязательность использования характеристики и упаковки.
//
// Параметры:
//  СсылкаИлиМассив - Массив - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//                             Если передается ссылка, преобразуется в массив.
//
// Возвращаемое значение:
//  - Соответствие:
//     * Ключ - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//     * Значение - Структура - содержит свойства номенклатуры ИБ:
//        * ИспользоватьХарактеристики - Булево - Истина, если ведется учет по характеристикам.
//        * ИспользоватьУпаковки - Булево - Истина, если используются упаковки.
//        * ОбязательноеЗаполнениеХарактеристики - Булево - Истина, если требуется обязательно указывать характеристику
//  - Неопределено - если типовой не подключен или не указана номенклатура
//
Функция Номенклатура_СвойстваНоменклатурыИнформационнойБазы(СсылкаИлиМассив) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("Номенклатура_СвойстваНоменклатурыИнформационнойБазы");
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ТиповойМодуль.СвойстваНоменклатурыИнформационнойБазы(СсылкаИлиМассив);
	
	Возврат Результат;
	
КонецФункции

// Ищет варианты сопоставления номенклатуры по номенклатуре электронного документа.
//
// Параметры:
//  НоменклатураЭД - Структура - Номенклатура электронного документа
// 
// Возвращаемое значение:
//  Массив из Структура - см. Контракт_НоменклатураИнформационнойБазы
//
Функция Номенклатура_ВариантыСопоставленияНоменклатуры(Знач НоменклатураЭД) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("Номенклатура_ВариантыСопоставленияНоменклатуры");
		Возврат Новый Массив;
	КонецЕсли;
	
	ПустаяСтрока = "";
	
	// Подготовка контракта, используемого в типовом модуле
	НоменклатураКонтрагента = Новый Структура;
	НоменклатураКонтрагента.Вставить("Владелец", Неопределено);
	НоменклатураКонтрагента.Вставить("Идентификатор", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("Код", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("Артикул", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("Сорт", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("Наименование", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("Характеристика", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("СтавкаНДС", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("ЕдиницаИзмерения", ПустаяСтрока);
	НоменклатураКонтрагента.Вставить("ЕдиницаИзмеренияКод", ПустаяСтрока);
	
	ЗаполнитьЗначенияСвойств(НоменклатураКонтрагента, НоменклатураЭД);
	
	Результат = ТиповойМодуль.ВариантыСопоставленияНоменклатуры(НоменклатураКонтрагента);
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание и взаимосвязь объектов, составляющих номенклатуру информационной базы.
// Используется для типизации полей в мастере сопоставления номенклатуры и установки
// связей праметров выбора.
//
// Возвращаемое значение:
//  - Структура - данные о структуре номенклатуры информационной базы:
//     * ВладелецНоменклатурыПредставлениеОбъекта - Строка - представление единичного объекта владельца номенклатуры.
//     * НоменклатураПредставлениеОбъекта - Строка - представление единичного объекта номенклатуры.
//     * ХарактеристикаПредставлениеОбъекта - Строка - представление единичного объекта характеристики.
//     * УпаковкаПредставлениеОбъекта - Строка - представление единичного объекта упаковки.
//     * ИмяПараметраСвязиХарактеристики - Строка - имя параметра связи характеристики от номенклатуры.
//     * ИмяПараметраСвязиУпаковки - Строка - имя параметра связи упаковки от номенклатуры.
//  - Неопределено - если типовой модуль не подключен
//
Функция Номенклатура_МетаданныеСопоставленияНоменклатуры() Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("Номенклатура_МетаданныеСопоставленияНоменклатуры");
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ТиповойМодуль.МетаданныеСопоставленияНоменклатуры();
	
	Возврат Результат;
	
КонецФункции

// Получает номенклатуру информационной базы, соответствующую идентификаторам номенклатуры контрагента.
//
// Параметры:
//  ВладелецНоменклатуры - СправочникСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Строка, Массив из Строка - идентификаторы номенклатуры контрагента.
// 
// Возвращаемое значение:
//  Соответствие - содержит:
//    * Ключ - Строка - идентификатор номенклатуры контрагента.
//    * Значение - Структура - номенклатура информационной базы (см. Контракт_НоменклатураИнформационнойБазы)
//
Функция Номенклатура_СопоставлениеПрочитать(ВладелецНоменклатуры, ИдентификаторыНоменклатуры) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("Номенклатура_СопоставлениеПрочитать");
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Результат = ТиповойМодуль.ПрочитатьСопоставлениеНоменклатуры(
		ВладелецНоменклатуры,
		ИдентификаторыНоменклатуры
	);
	
	Возврат Результат;
	
КонецФункции

// Записывает сопоставление номенклатуры электронного документа с номенклатурой информационной базы.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - см. Контракт_НоменклатураКонтрагента
//  НоменклатураИБ - Структура - см. Контракт_НоменклатураИнформационнойБазы
//
Процедура Номенклатура_СопоставлениеЗаписать(НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("Номенклатура_СопоставлениеЗаписать");
		Возврат;
	КонецЕсли;
	
	ТиповойМодуль.ЗаписатьСопоставлениеНоменклатуры(
		НоменклатураКонтрагента,
		НоменклатураИБ
	);
	
КонецПроцедуры

// Получает список правил обработки (идентификаторов операций) электронных документов указанного типа.
//
// Параметры:
//  ФорматЭД - Структура - описание типа электронного документа (см. Контракт_ФорматЭлектронногоДокумента).
// 
// Возвращаемое значение:
//  СписокЗначений:
//    * Значение - Строка - идентификатор правила обработки электронного документа.
//    * Представление - Строка - пользовательское представление операции.
//
Функция СозданиеДокументов_ПравилаСозданияДокументовУчета(ФорматЭД) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("СозданиеДокументов_ПравилаСозданияДокументовУчета");
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Результат = ТиповойМодуль.ПравилаСозданияДокументовУчета(ФорматЭД);
	
	Возврат Результат;
	
КонецФункции

// Создает новый экземпляр документа информационной базы и заполняет его
// по данным электронного документа. Созданный объект при этом не записывается.
//
// Параметры:
//  Содержимое - ДвоичныеДанные - бинарные данные файла.
//             - ОбъектXDTO - объектная модель формализованного документа (ФНС).
//             - Строка - содержимое XML-файла.
//             - Строка - путь к файлу.
//             - Структура - протоструктура с описанием документа. ВАЖНО: при таком варианте вызова
//                           обязательно передавать описание формата через параметры.
//  ИдентификаторОперации - Строка - Идентификатор правила создания и заполнения документа ИБ.
//  ПараметрыЗаполнения - Структура - Значения заполнения документа ИБ (см. СозданиеДокументов_ПараметрыЗаполненияДокументаИнформационнойБазы).
//  ФорматЭД - Структура - описание типа электронного документа (см. Контракт_ФорматЭлектронногоДокумента).
// 
// Возвращаемое значение:
//  ДокументОбъект, СправочникОбъект - заполненный объект информационной базы.
//  Неопределено - если типовой модуль не подключен.
//
// Пример 1:
//  ПараметрыСоздания = СозданиеДокументов_ПараметрыЗаполненияДокументаИнформационнойБазы();
//  ПараметрыСоздания.Контрагент = Документ.Отправитель.Организация;
//  ПараметрыСоздания.ЦенаВключаетНДС = Истина;
//  НовыйДокумент = СозданиеДокументов_НовыйДокументИнформационнойБазы(ФайлXML, "ПоступлениеТоваровУслуг", ПараметрыСоздания);
//
// Пример 2:
//  НовыйДокумент = СозданиеДокументов_НовыйДокументИнформационнойБазы("C:\temp\УПД 1.xml", "ПоступлениеТоваровУслуг_Оборудование");
//
// Пример 3:
//  ПараметрыЗаполнения = СозданиеДокументов_ПараметрыЗаполненияДокументаИнформационнойБазы();
//  ПараметрыЗаполнения.ДокументОснование = СсылкаНаПТУ;
//  ФорматЭД = НовоеОписаниеФорматаЭлектронногоДокумента("Invoice", "default", "utd820_05_01_01_hyphen");
//  НовыйДокумент = СозданиеДокументов_НовыйДокументИнформационнойБазы(Utd820SellerContent, "СчетФактураПолученный", ПараметрыСоздания, ФорматЭД);
//
Функция СозданиеДокументов_НовыйДокументИнформационнойБазы(Содержимое, ИдентификаторОперации, ПараметрыЗаполнения, ФорматЭД = Неопределено) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("СозданиеДокументов_НовыйДокументИнформационнойБазы");
		Возврат Неопределено;
	КонецЕсли;
	
	СовместимыеПараметрыСоздания = ТиповойМодуль.ПараметрыСозданияДокументаИнформационнойБазы();
	СовместимыеПараметрыСоздания.Формат = ФорматЭД;
	СовместимыеПараметрыСоздания.Контрагент = ПараметрыЗаполнения.Контрагент;
	СовместимыеПараметрыСоздания.Организация = ПараметрыЗаполнения.Организация;
	СовместимыеПараметрыСоздания.ЦенаВключаетНДС = ПараметрыЗаполнения.ЦенаВключаетНДС;
	СовместимыеПараметрыСоздания.ДокументОснование = ПараметрыЗаполнения.ДокументОснование;
	
	Результат = ТиповойМодуль.НовыйДокументИнформационнойБазы(
		Содержимое,
		ИдентификаторОперации,
		СовместимыеПараметрыСоздания
	);
	
	Возврат Результат;
	
КонецФункции

// Конструктор параметров заполнения учетного документа.
// 
// Возвращаемое значение:
//  Структура:
//    * Контрагент - Произвольный - Ссылка на контрагента ИБ.
//    * Организация - Произвольный - Ссылка на организацию ИБ.
//    * ЦенаВключаетНДС - Булево - Истина, если нужно пересчитать цены и включить в них НДС.
//    * ДокументОснование - Произвольный - Ссылка на документ ИБ, который нужно использовать в качестве основания.
//
Функция СозданиеДокументов_ПараметрыЗаполненияДокументаИнформационнойБазы() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Контрагент");
	Результат.Вставить("Организация");
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ДокументОснование");
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя справочника машиночитаемых доверенностей ФНС.
// 
// Возвращаемое значение:
//  - Строка - имя справочника, как оно определено в метаданных.
//  - Неопределено - если типовой модуль не подключен или отсутствует справочник МЧД ФНС.
//
Функция МЧД_ИмяСправочникаВИнформационнойБазе() Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("МЧД_ИмяСправочникаВИнформационнойБазе");
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ТиповойМодуль.МЧД_ИмяСправочникаВИнформационнойБазе();
	
	Возврат Результат;
	
КонецФункции

// Получает сведения о машиночитаемой доверенности, сохраненной в информационной базе.
//
// Параметры:
//  СсылкаНаДоверенность - СправочникСсылка - ссылка на элемент справочника МЧД.
// 
// Возвращаемое значение:
//  - Структура - сведения о МЧД:
//      * Идентификатор - Строка - идентификатор или номер доверенности
//      * СрокДействия - Дата - срок действия доверенности
//      * Доверитель - Структура - сведения о доверителе:
//         ** Наименование - Строка
//         ** ИНН - Строка
//         ** КПП - Строка
//         ** ОГРН - Строка
//      * Представитель - Структура - сведения о представителе:
//         ** Наименование - Строка
//         ** ИНН - Строка
//         ** КПП - Строка
//         ** ОГРН - Строка
//         ** СНИЛС - Строка
//  - Неопределено - если типовой модуль не подключен или не удалось получить данные доверенности.
//
Функция МЧД_ДанныеДоверенностиИнформационнойБазы(СсылкаНаДоверенность) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("МЧД_ДанныеДоверенностиИнформационнойБазы");
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ТиповойМодуль.МЧД_ДанныеДоверенностиИнформационнойБазы(СсылкаНаДоверенность);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, есть ли в конфигурации справочник машиночитаемых доверенностей.
// 
// Возвращаемое значение:
//  Булево - Истина, если есть справочник МЧД.
//
Функция МЧД_ЕстьСправочникМашиночитаемыхДоверенностей() Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("МЧД_ЕстьСправочникМашиночитаемыхДоверенностей");
		Возврат Ложь;
	КонецЕсли;
	
	Результат = ТиповойМодуль.МЧД_ЕстьСправочникМашиночитаемыхДоверенностей();
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру дополнительных параметров для методов сбора контента ответного титула.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//    * ЗаполнитьТаблицуОтветногоТитула - Булево - Заполнять или нет таблицу ответного титула
//
Функция ДополнительныеПараметрыПолученияКонтентаОтветногоТитула() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаполнитьТаблицуОтветногоТитулаАктаСверки", Истина);
	
	Возврат Результат;
	
КонецФункции

// Формирует протоструктуру для отправки ответного титула электронного документа в заданном формате.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ТипКонтента	 - Структура - содержит свойства:
//    * ИмяТипа			 - Строка - имя типа документа (typeNameId);
//    * ФункцияДокумента - Строка - функция документа (Function);
//    * ВерсияФормата	 - Строка - версия формата контента (Version);
//  ДополнительныеПараметры - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентОтветногоТитула(СсылкаНаДокумент, ТипКонтента, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтентаОтветногоТитула();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	Если НРег(ТипКонтента) = НРег("reconciliationact405") Тогда
		
		Результат = КонтентФормализованногоАктаСверкиТитулПолучателя(СсылкаНаДокумент, ПараметрыФормирования);
		
	Иначе
		
		ТекстОшибки = ПараметрыВСтроку(НСтр("ru = 'Тип контента не поддерживается!
			|Тип контента: %1'")
			, ТипКонтента);
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации()
			, УровеньЖурналаРегистрации.Ошибка
			, СсылкаНаДокумент.Метаданные()
			, СсылкаНаДокумент
			, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует протоструктуру для отправки титула отправителя электронного документа в заданном формате.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ФорматЭД - Структура - описание типа электронного документа (см. Контракт_ФорматЭлектронногоДокумента);
//  ДополнительныеПараметры - Структура - см. ДополнительныеПараметрыПолученияКонтента.
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентТитулаОтправителя(СсылкаНаОбъект, ФорматЭД, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Ошибка = "КонтентТитулаОтправителя: Не заполнено значение параметра ""СсылкаНаОбъект"" (Тип = %1)";
		Ошибка = СтрЗаменить(Ошибка, "%1", Строка(ТипЗнч(СсылкаНаОбъект)));
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ПараметрыФормирования = ДополнительныеПараметрыПолученияКонтентаОтветногоТитула();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);
	КонецЕсли;
	
	ИмяТипа = ФорматЭД.ИмяТипа;
	ВерсияФорматаНРег = НРег(ФорматЭД.ВерсияФормата);
	
	Если НРег(ИмяТипа) = НРег("ReconciliationAct") Тогда
		
		Результат = КонтентФормализованногоАктаСверкиТитулОтправителя(СсылкаНаОбъект, ПараметрыФормирования);
		
	ИначеЕсли ВерсияФорматаНРег = "utd970" Тогда
		
		Результат = УПД970_КонтентТитулаПродавца(СсылкаНаОбъект, ФорматЭД.ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ВерсияФорматаНРег = "proformainvoice29" Тогда
		
		Результат = Счет29_КонтентТитулаПродавца(СсылкаНаОбъект);
		
	Иначе
		
		Если Не ТиповойМодульПодключен() Тогда
			ЛогироватьТиповойМодульНеПодключен("КонтентФормализованногоДокумента");
			Возврат Новый Структура;
		КонецЕсли;
		
		Результат = ТиповойМодуль.КонтентФормализованногоДокумента(
			СсылкаНаОбъект,
			ФорматЭД,
			ДополнительныеПараметры
		);
		
		Если СтрНачинаетсяСЛок(ВерсияФорматаНРег, "utd820") Тогда
			УПД820_ПроверитьИсправитьСтавкиНДС(Результат);
		ИначеЕсли СтрНачинаетсяСЛок(ВерсияФорматаНРег, "ucd") Тогда
			УКД736_ПроверитьИсправитьСтавкиНДС(Результат);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует стандартную печатную форму счета на оплату.
// Если для указанного документа в конфигурации не реализована печатная форма, будет вызвано исключение
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - учетный документ (основание электронного счета на оплату)
// 
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма счета на оплату.
//
Функция СчетаНаОплату_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	Результат = ИнтеграционныйМодуль.СчетаНаОплату_ПечатнаяФорма1С(СсылкаНаОбъект);
	
	ТабличныйДокумент_УбратьПодписьИПечать(Результат);
	
	Возврат Результат;
	
КонецФункции

// Получает сведения для заполнения меты неформализованного счета на оплату
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - учетный документ (основание электронного счета на оплату)
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - мета счета на оплату:
//    * Дата - Дата - дата электронного документа
//    * Номер - Строка - номер электронного документа
//    * Сумма - Число - Сумма электронного документа (только для счетов на оплату)
//    * СуммаНДС - Число - Сумма НДС электронного документа (только для счетов на оплату)
//    * ДокументБезНДС - Булево - Истина, если документ без НДС (только для счетов на оплату)
//    * ИмяФайлаВложения - Строка - Имя файла документа-вложения
//
Функция СчетаНаОплату_Метаданные(СсылкаНаОбъект) Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Дата", Дата(1, 1, 1));
	Данные.Вставить("Номер", "");
	Данные.Вставить("Сумма", 0);
	Данные.Вставить("СуммаНДС", 0);
	Данные.Вставить("ДокументБезНДС", Ложь);
	Данные.Вставить("ИмяФайлаВложения", "");
	Данные.Вставить("КодВалюты", "");
	
	Данные.Дата = СсылкаНаОбъект.Дата;
	Данные.Номер = ПредставлениеНомераДокументаУчета(СсылкаНаОбъект);
	
	ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СсылкаНаОбъект, Данные);
	
	Данные.ИмяФайлаВложения = ИмяФайлаВложенияPDF(
		"Счет",
		Данные.Номер,
		Данные.Дата
	);
	
	Результат = ФиксированныеДанные(Данные);
	
	Возврат Результат;
	
КонецФункции

// Формирует внутреннее представление счета на оплату
//
// Параметры:
//  ОснованиеЭлектронногоСчета - ЛюбаяСсылка - основание электронного счета
// 
// Возвращаемое значение:
//  Структура - представление счета на оплату:
//    * Шапка - Структура - поля шапки (см. Новый_ШапкаСчетаНаОплату)
//    * ТабличнаяЧасть - ТаблицаЗначений - товарная часть (см. Новый_ТабличнаяЧастьСчетаНаОплату)
//
Функция СчетаНаОплату_Данные(ОснованиеЭлектронногоСчета) Экспорт
	
	Шапка = Новый_ШапкаСчетаНаОплату();
	ТабличнаяЧасть = Новый_ТабличнаяЧастьСчетаНаОплату();
	
	ИнтеграционныйМодуль.СчетаНаОплату_ЗаполнитьДанные(Шапка, ТабличнаяЧасть, ОснованиеЭлектронногоСчета);
	
	Модель = Новый Структура;
	Модель.Вставить("Шапка", Шапка);
	Модель.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	
	Результат = ФиксированныеДанные(Модель);
	
	Возврат Результат;
	
КонецФункции

// Формирует стандартную печатную форму акта сверки взаиморасчетов.
// Если для указанного документа в конфигурации не реализована печатная форма, будет вызвано исключение
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - учетный документ (основание электронного акта сверки)
// 
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма акта сверки.
//
Функция АктыСверок_ПечатнаяФорма1С(СсылкаНаОбъект) Экспорт
	
	Результат = ИнтеграционныйМодуль.АктыСверок_ПечатнаяФорма1С(СсылкаНаОбъект);
	
	ТабличныйДокумент_УбратьПодписьИПечать(Результат);
	ТабличныйДокумент_УстановитьМасштабИПоля(Результат);
	
	Возврат Результат;
	
КонецФункции

// Получает сведения для заполнения меты неформализованного акта сверки
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - учетный документ (основание электронного акта сверки)
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - мета акта сверки:
//    * Дата - Дата - дата электронного документа
//    * Номер - Строка - номер электронного документа
//    * ИмяФайлаВложения - Строка - Имя файла документа-вложения
//
Функция АктыСверок_Метаданные(СсылкаНаОбъект) Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Дата", Дата(1, 1, 1));
	Данные.Вставить("Номер", "");
	Данные.Вставить("ИмяФайлаВложения", "");
	
	Данные.Дата = СсылкаНаОбъект.Дата;
	Данные.Номер = ПредставлениеНомераДокументаУчета(СсылкаНаОбъект);
	
	Данные.ИмяФайлаВложения = ИмяФайлаВложенияPDF(
		"Акт сверки",
		Данные.Номер,
		Данные.Дата
	);
	
	Результат = ФиксированныеДанные(Данные);
	
	Возврат Результат;
	
КонецФункции

// Формирует внутреннее представление акта сверки
//
// Параметры:
//  ОснованиеЭлектронногоАкта - ЛюбаяСсылка - основание электронного акта сверки
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - содержит ключи:
//   * Шапка - ФиксированнаяСтруктура - поля шапки (см. Новый_ШапкаАктаСверки)
//   * ДанныеОрганизации - ТаблицаЗначений - сведения по данным организации (см. Новый_ДеталиАктаСверки)
//   * ДанныеКонтрагента - ТаблицаЗначений - сведения по данным контрагента (см. Новый_ДеталиАктаСверки)
//
Функция АктыСверок_Данные(ОснованиеЭлектронногоАкта) Экспорт
	
	Модель = АктыСверок_МодельДанных();
	
	ИнтеграционныйМодуль.АктыСверок_ЗаполнитьДанные(Модель, ОснованиеЭлектронногоАкта);
	
	Результат = ФиксированныеДанные(Модель);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру, описывающую модель данных акта сверки.
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//   * Шапка - Структура - поля шапки (см. Новый_ШапкаАктаСверки)
//   * ДанныеОрганизации - ТаблицаЗначений - сведения по данным организации (см. Новый_ДеталиАктаСверки)
//   * ДанныеКонтрагента - ТаблицаЗначений - сведения по данным контрагента (см. Новый_ДеталиАктаСверки)
//
Функция АктыСверок_МодельДанных() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", Новый_ШапкаАктаСверки());
	Результат.Вставить("ДанныеОрганизации", Новый_ДеталиАктаСверки());
	Результат.Вставить("ДанныеКонтрагента", Новый_ДеталиАктаСверки());
	
	Возврат Результат;
	
КонецФункции

// Конструктор сведений о сверке
// 
// Возвращаемое значение:
//  Структура - см. тело функции
//
Функция Новый_ШапкаАктаСверки()
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", Дата(1, 1, 1));
	Результат.Вставить("НачалоПериода", Дата(1, 1, 1));
	Результат.Вставить("КонецПериода", Дата(1, 1, 1));
	Результат.Вставить("СверкаСогласована", Ложь);
	Результат.Вставить("ГруппироватьПоАналитике", Ложь);
	
	Результат.Вставить("СверкаПоДоговору", Ложь);
	Результат.Вставить("ДоговорПредставление", "");
	
	Результат.Вставить("ВалютаКод", "");
	Результат.Вставить("ВалютаПредставление", "");
	
	Результат.Вставить("ОстатокНаНачало", 0);
	
	Результат.Вставить("ОрганизацияПредставление", "");
	Результат.Вставить("ПредставительОрганизацииФИО", "");
	Результат.Вставить("ПредставительОрганизацииДолжность", "");
	
	Результат.Вставить("КонтрагентПредставление", "");
	Результат.Вставить("ПредставительКонтрагентаФИО", "");
	Результат.Вставить("ПредставительКонтрагентаДолжность", "");
	
	Возврат Результат;
	
КонецФункции

// Конструктор сведений об операциях сверки
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//    * Аналитика - Произвольный - Поле для группировки (например, договор)
//    * ДокументПредставление - Строка - представление документа/операции
//    * Дата - Дата - Дата документа/операции
//    * Дебет - Число - оборот по дебету
//    * Кредит - Число - оборот по кредиту
//
Функция Новый_ДеталиАктаСверки()
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Аналитика");
	Результат.Колонки.Добавить("ДокументПредставление", ТипСтрока);
	Результат.Колонки.Добавить("Дата", ТипДата);
	Результат.Колонки.Добавить("Дебет", ТипЧисло);
	Результат.Колонки.Добавить("Кредит", ТипЧисло);
	
	Результат.Индексы.Добавить("Аналитика");
	
	Возврат Результат;
	
КонецФункции

// Получает сведения для заполнения меты неформализованных накладных и актов
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - основание электронного документа.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - мета накладной/акта:
//    * Дата - Дата - дата электронного документа
//    * Номер - Строка - Номер электронного документа
//    * Сумма - Число - сумма электронного документа
//    * СуммаНДС - Число - сумма НДС
//    * ДокументБезНДС - Булево - Истина, если документ без НДС (только для счетов на оплату)
//    * КодВалюты - Строка - код валюты по ОКВ или пустая строка
//    * Основание - Строка - представление основания документа передачи
//
Функция ПередаточныеДокументы_Метаданные(СсылкаНаОбъект) Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Дата", Дата(1, 1, 1));
	Данные.Вставить("Номер", "");
	Данные.Вставить("Сумма", 0);
	Данные.Вставить("СуммаНДС", 0);
	Данные.Вставить("ДокументБезНДС", Ложь);
	Данные.Вставить("Основание", "");
	Данные.Вставить("КодВалюты", "");
	
	СтандартнаяОбработка = Истина;
	ИнтеграционныйМодуль.ПередаточныеДокументы_ЗаполнитьМету(Данные, СсылкаНаОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		ЗначенияРеквизитов = Новый Структура;
		ЗначенияРеквизитов.Вставить("Номер");
		ЗначенияРеквизитов.Вставить("Дата");
		
		ЕстьСуммаДокумента = (СсылкаНаОбъект.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено);
		Если ЕстьСуммаДокумента Тогда
			ЗначенияРеквизитов.Вставить("СуммаДокумента");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, СсылкаНаОбъект);
		
		Данные.Дата = ЗначенияРеквизитов.Дата;
		Данные.Номер = ПредставлениеНомераДокументаУчета(СсылкаНаОбъект);
		Если ЕстьСуммаДокумента Тогда
			Данные.Сумма = ЗначенияРеквизитов.СуммаДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = ФиксированныеДанные(Данные);
	
	Возврат Результат;
	
КонецФункции

// Контракт шапки неформализованного счета на оплату по форме ДД
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Заголовок - Строка - Заголовок счета с указанием номера и даты
//   * Продавец - ЛюбаяСсылка - Ссылка на организацию-продавца
//   * ПродавецПредставление - Строка - Наименование организации-продавца для печати
//   * ПродавецОписание -  Строка - Описание организации-продавца с указанием полного наименования и реквизитов организации, банковских реквизитов и адреса
//   * ПродавецИНН -  Строка - ИНН организации-продавца
//   * ПродавецКПП -  Строка - КПП организации-продавца
//   * ПродавецБанк - ЛюбаяСсылка - Ссылка на банк
//   * ПродавецБанкБИК - Строка - БИК банка организации-продавца
//   * ПродавецБанкПредставление - Строка - Наименование банка организации-продавца
//   * ПродавецБанковскийСчет - ЛюбаяСсылка - Ссылка на банковский счет организации-продавца
//   * ПродавецБанковскийСчетНомер - Строка - Банковский счет организации-продавца
//   * ПродавецБанковскийСчетКорСчет - Строка - КоррСчет организации-продавца
//   * Покупатель - ЛюбаяСсылка - Ссылка на организацию-покупателя
//   * ПокупательПредставление - Строка - Наименование организации-покупателя для печати
//   * ПокупательОписание -  Строка - Описание организации-покупателя с указанием полного наименования и реквизитов организации, банковских реквизитов и адреса
//   * Грузоотправитель - ЛюбаяСсылка - Ссылка на организацию-грузоотправителя
//   * ГрузоотправительПредставление - Строка - Наименование организации-грузоотправителя для печати
//   * Грузополучатель - ЛюбаяСсылка - Ссылкана организацию-грузополучателя
//   * ГрузополучательПредставление - Строка - Наименование организации-грузополучателя для печати
//   * Номер - Строка - Номер счета
//   * Дата - Дата - Дата счета
//   * РуководительФИО - Строка - Подписант счета
//   * ЦенаВключаетНДС -Булево - Истина, если НДС включен в цену
//   * ОблагаетсяНДСУПокупателя - Булево - Истина, если продажа облагается НДС у покупателя
//   * Валюта - ЛюбаяСсылка - Валюта документа
//   * ВалютаКод - Строка - Код валюты документа
//   * УчитыватьНДС - Булево - Истина, если налогообложение предполагает учет НДС
//
Функция Новый_ШапкаСчетаНаОплату()
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок");
	Результат.Вставить("Продавец"); // ссылка на организацию
	Результат.Вставить("ПродавецПредставление");
	Результат.Вставить("ПродавецОписание");
	Результат.Вставить("ПродавецИНН");
	Результат.Вставить("ПродавецКПП");
	Результат.Вставить("ПродавецБанк"); // Ссылка на банк
	Результат.Вставить("ПродавецБанкБИК");
	Результат.Вставить("ПродавецБанкПредставление");
	Результат.Вставить("ПродавецБанковскийСчет"); // ссылка на счет
	Результат.Вставить("ПродавецБанковскийСчетНомер"); // номер счета
	Результат.Вставить("ПродавецБанковскийСчетКорСчет"); // номер кор-счета
	Результат.Вставить("Покупатель"); // ссылка на контрагента
	Результат.Вставить("ПокупательПредставление");
	Результат.Вставить("ПокупательОписание");
	Результат.Вставить("Грузоотправитель"); // ссылка на ГО
	Результат.Вставить("ГрузоотправительПредставление");
	Результат.Вставить("Грузополучатель"); // ссылка на ГП
	Результат.Вставить("ГрузополучательПредставление");
	Результат.Вставить("Номер"); // номер счета на оплату
	Результат.Вставить("Дата"); // дата счета на оплату
	Результат.Вставить("РуководительФИО");
	Результат.Вставить("ЦенаВключаетНДС");
	Результат.Вставить("ОблагаетсяНДСУПокупателя");
	Результат.Вставить("Валюта");
	Результат.Вставить("ВалютаКод");
	Результат.Вставить("УчитыватьНДС");
	
	Возврат Результат;
	
КонецФункции

// Контракт табличной части неформализованного счета на оплату по форме ДД
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Номенклатура - ЛюбаяСсылка - Ссылка на номенклатуру
//   * Характеристика - ЛюбаяСсылка - Ссылка на характеристику номенклатуры
//   * НоменклатураКод - Строка - Код номенклатуры
//   * НоменклатураАртикул - Строка - Артикул номенклатуры
//   * НоменклатураПредставление - Строка - Представление номенклатуры для печати
//   * Количество - Число - Количество единиц номенклатуры в строке
//   * ЕдиницаИзмерения - ЛюбаяСсылка - Ссылка на единицы измерения номенклатуры
//   * Упаковка - ЛюбаяСсылка - Ссылка на упаковки номенклатуры
//   * СуммаСкидки - Число - Сумма скидки
//   * Цена - Число - Цена номенклатуры
//   * Сумма - Число - Сумма по строке (с учетом скидки)
//   * СуммаНДС - Число - СуммаНДС по строке (с учетом скидки)
//
Функция Новый_ТабличнаяЧастьСчетаНаОплату()
	
	КвалификаторыСуммы = Новый КвалификаторыЧисла(25, 2);
	ТипСумма = Новый ОписаниеТипов("Число", КвалификаторыСуммы);
	
	КвалификаторыКоличества = Новый КвалификаторыЧисла(15, 3);
	ТипКоличество = Новый ОписаниеТипов("Число", КвалификаторыКоличества);
	
	КвалификаторыСтроки = Новый КвалификаторыСтроки(1000, ДопустимаяДлина.Переменная);
	ТипСтрока = Новый ОписаниеТипов("Строка", , КвалификаторыСтроки);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура"); // Ссылка
	Результат.Колонки.Добавить("Характеристика"); // Ссылка
	Результат.Колонки.Добавить("НоменклатураАртикул", ТипСтрока);
	Результат.Колонки.Добавить("НоменклатураПредставление", ТипСтрока); // представление с учетом содержания, характеристик и прочего
	Результат.Колонки.Добавить("Количество", ТипКоличество);
	Результат.Колонки.Добавить("ЕдиницаИзмерения", ТипСтрока);
	Результат.Колонки.Добавить("Упаковка");
	Результат.Колонки.Добавить("Цена", ТипСумма); // как в документе
	Результат.Колонки.Добавить("Сумма", ТипСумма); // зависит от флага ЦенаВключаетНДС
	Результат.Колонки.Добавить("СуммаНДС", ТипСумма);
	Результат.Колонки.Добавить("СуммаСкидки", ТипСумма);
	
	Возврат Результат;
	
КонецФункции

// Получает данные для отправки неформализованных электронных документов
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ТипКонтента - Строка - допустимые значения: "АктСверки", "СчетНаОплату";
//  ДополнительныеПараметры - Структура - см. ДополнительныеПараметрыПолученияКонтента.
// 
// Возвращаемое значение:
//  * Структура - табличное представление и значения полей документа.
//  * Неопределено - если типовой модуль не подключен.
//
Функция НеформализованныйКонтент(СсылкаНаОбъект, ТипКонтента, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		ЛогироватьТиповойМодульНеПодключен("НеформализованныйКонтент");
		Возврат Неопределено;
	КонецЕсли;
	
	ТипКонтентаНРег = НРег(ТипКонтента);
	
	Если ТипКонтентаНРег = НРег("АктСверки") Тогда
		
		Результат = ТиповойМодуль.СформироватьПечатнуюФормуАктаСверки(СсылкаНаОбъект, ДополнительныеПараметры);
		
	ИначеЕсли ТипКонтентаНРег = НРег("СчетНаОплату") Тогда
		
		Результат = ТиповойМодуль.СформироватьПечатнуюФормуСчетаНаОплату(СсылкаНаОбъект, ДополнительныеПараметры);
		
	Иначе
		
		Ошибка = ПараметрыВСтроку(
			"Недопустимое значение параметра ""ТипКонтента"" (%1)",
			ТипКонтента
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	Результат = ИнтеграционныйМодуль.ВидыПредопределенныхДокументовДляПоискаВМодуле();
	
	Возврат Результат;
	
КонецФункции

// Вызывает обработчик события ПМ Стандарта "ПослеЗаполненияКонтента"
//
// Параметры:
//  Контент					 - Структура - заполняемая протоструктура
//  ТипКонтента				 - Строка - см. Ядро.ТипыКонтента()
//  СсылкаНаДокумент		 - ДокументСсылка - ссылка на исходный документ 1С
//  ДополнительныеПараметры	 - Структура - доп. параметры (см. Ядро.ДополнительныеПараметрыПолученияКонтента)
//
Процедура Конвертация970_СобытияПМСтандарта_ПослеЗаполненияКонтента(
	Контент,
	ТипКонтента,
	СсылкаНаДокумент,
	ДополнительныеПараметры) Экспорт
	
	Если Не ТиповойМодульПодключен() Тогда
		Возврат;
	КонецЕсли;
	
	ТиповойМодуль.ПМ_ПослеЗаполненияКонтента(
		Контент,
		ТипКонтента,
		СсылкаНаДокумент,
		ДополнительныеПараметры);
		
КонецПроцедуры

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  СправочникСсылка, ПеречислениеСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	Результат = ИнтеграционныйМодуль.ЗначениеСтавкиНДС(ПредставлениеСтавки);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - ПеречислениеСсылка - Прикладное значение ставки НДС
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки) Экспорт
	
	Результат = ИнтеграционныйМодуль.ПредставлениеСтавкиНДС(ЗначениеСтавки);
	
	Возврат Результат;
	
КонецФункции

//}		ПРОГРАММНЫЙ ИНТЕРФЕЙС


//{		СБОР ПРОТОКОНТЕНТА

// Формирует и заполняет структуру ReconciliationActRecipientTitle по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентФормализованногоАктаСверкиТитулПолучателя(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = ИнтеграционныйМодуль.АктСверки405_ИнформацияПолучателя(
		СсылкаНаДокумент,
		ПараметрыФормирования
	);
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(
		Результат,
		СсылкаНаДокумент
	);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру ReconciliationActSenderTitle по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ПараметрыФормирования - Структура - см. ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура.
//
Функция КонтентФормализованногоАктаСверкиТитулОтправителя(СсылкаНаДокумент, ПараметрыФормирования)
	
	Результат = ИнтеграционныйМодуль.АктСверки405_ИнформацияОтправителя(СсылкаНаДокумент);
	
	ДополнитьКонтентДокументаСлужебнойИнформацией(
		Результат,
		СсылкаНаДокумент
	);
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет структуру Utd970SellerContent по данным учетного документа.
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на объект информационной базы, по которому необходимо создать электронный документ;
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ПараметрыФормирования - Структура - см. Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента;
// 
// Возвращаемое значение:
//  Структура
//
Функция УПД970_КонтентТитулаПродавца(СсылкаНаДокумент, ФункцияДокумента, ДополнительныеПараметры = Неопределено)
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Результат = ИнтеграционныйМодуль.УПД970_КонтентТитулаПродавца(СсылкаНаДокумент, ФункцияДокумента, ДополнительныеПараметры);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	УПД970_ПроверитьИсправитьСтавкиНДС(Результат);
	
	УПД970_ОкруглитьСтТовБезНДСПрослеж(Результат);
	
	УПД970_ДобавитьИнфПолФХЖ1(Результат);
	
	Возврат Результат;
	
КонецФункции

// округляет СтТовБезНДСПрослеж по требованиям формата 5.03. или 5.02.
// 
// Параметры:
//  Контент970 - Структура - Utd970SellerContent.
//
Процедура УПД970_ОкруглитьСтТовБезНДСПрослеж(Контент970)
	
	ДатаФормата5_03 = Дата("20250122");
	
	Точность = 0;
	Если ТекущаяУниверсальнаяДата() + 3 * 60 * 60 >= ДатаФормата5_03 Тогда
		Точность = 2;
	КонецЕсли;
	
	Для Каждого Item Из Контент970.Table.Items Цикл
		
		Для Каждого ItemTracingInfo Из Item.ItemTracingInfos Цикл
		
			ItemTracingInfo.SumWithoutVat = Окр(ItemTracingInfo.SumWithoutVat, Точность);
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет ставки НДС в структуре Utd970SellerContent и обрабатывает некоторые
// частные случаи, когда указано значение, которое отсутствует в программном 
// перечислении ГенерацияXML.Перечисление_TaxRate.
// 
// Если в интеграционном модуле не удалось определить валидное значение TaxRate,
// используется представление прикладной ставки НДС, которое содержит символ "%".
//
// Параметры:
//  Контент970 - Структура - Utd970SellerContent.
//
Процедура УПД970_ПроверитьИсправитьСтавкиНДС(Контент970)
	
	Для Каждого Item Из Контент970.Table.Items Цикл
		Item.TaxRate = НормализоватьTaxRate(Item.TaxRate);
	КонецЦикла;
	
КонецПроцедуры

// Добавляет значения ИнфПолФХЖ1 в соответствии с требованиями
// системы маркировки "Честный знак" для алкогольной продукции
// 
// Параметры:
//  Контент970 - Структура - Utd970SellerContent.
//
Процедура УПД970_ДобавитьИнфПолФХЖ1(Контент970)
	
	ВидыТоваровДокумента = Контент970.СлужебнаяИнформация.ContentsDocumentProductsType;
	
	Если ВидыТоваровДокумента.ContainsAlcoholeProducts Тогда
		
		ДанныеГрузоотправителя = Контент970.Sellers[0];
		Если НЕ Контент970.Shippers[0].SameAsSeller Тогда
			ДанныеГрузоотправителя = Контент970.Shippers[0].OrganizationInfo;
		КонецЕсли;
		ДанныеГрузополучателя = Контент970.Consignees[0];
		
		ЗначениеПоУмолчаниюДефис = "-";
		
		Если ДанныеГрузоотправителя.Type = "IndividualEntity" Тогда
			
			Продавец_ФиасИД = ФиасИДУчастникаДокументооборота(ДанныеГрузоотправителя);
			ДобавитьAdditionalInfoItem(Контент970, "Продавец_ФиасИД", Продавец_ФиасИД);
			
		КонецЕсли;
		
		Если ДанныеГрузополучателя.Type = "IndividualEntity" Тогда
			
			Покупатель_ФиасИД = ФиасИДУчастникаДокументооборота(ДанныеГрузополучателя);
			ДобавитьAdditionalInfoItem(Контент970, "Покупатель_ФиасИД", Покупатель_ФиасИД);
			
		КонецЕсли;
		
		ДобавитьAdditionalInfoItem(Контент970, "НомерПеревозДок", ЗначениеПоУмолчаниюДефис);
		ДобавитьAdditionalInfoItem(Контент970, "ДатаПеревозДок", ЗначениеПоУмолчаниюДефис);
		ДобавитьAdditionalInfoItem(Контент970, "РегНомер", ЗначениеПоУмолчаниюДефис);
		ДобавитьAdditionalInfoItem(Контент970, "НомерПеревозЭлДок", ЗначениеПоУмолчаниюДефис);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует титул продавца для счета на оплату в формате ФНС 29@
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - основание электронного счета
// 
// Возвращаемое значение:
//  Структура - см. тип ProformaInvoice29SellerContent
//
Функция Счет29_КонтентТитулаПродавца(Знач СсылкаНаОбъект)
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Ошибка = "ФНС29_СчетНаОплату: Не заполнено значение параметра 'СсылкаНаОбъект' (Тип = '%1')";
		Ошибка = СтрЗаменить(Ошибка, "%1", Строка(ТипЗнч(СсылкаНаОбъект)));
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Контент = ИнтеграционныйМодуль.СчетФНС29(СсылкаНаОбъект);
	
	Возврат Контент;
	
КонецФункции

Функция ФиасИДУчастникаДокументооборота(ExtendedOrganizationInfo)
	
	Результат = "-";
	
	Если ЕстьАдресГАРУчастникаДокументооборота(ExtendedOrganizationInfo) Тогда
		Результат = ExtendedOrganizationInfo.Address.AddressSAR.ID;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьАдресГАРУчастникаДокументооборота(ExtendedOrganizationInfo)
	
	Результат = Ложь;
	
	ЕстьAddressInfo = ЗначениеЗаполнено(ExtendedOrganizationInfo)
		И ЗначениеЗаполнено(ExtendedOrganizationInfo.Address);
	
	Если ЕстьAddressInfo Тогда
		Результат = (ExtendedOrganizationInfo.Address.Type = "AddressSAR");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьAdditionalInfoItem(Контент970, Key, Value)
	
	StructedAdditionalInfo = Новый_AdditionalInfoItem();
	StructedAdditionalInfo.Key = Key;
	StructedAdditionalInfo.Value = Value;
	
	Контент970.AdditionalInfoId.StructedAdditionalInfos.Добавить(StructedAdditionalInfo);
	
КонецПроцедуры

Функция Новый_AdditionalInfoItem()
	
	Результат = Новый Структура();
	Результат.Вставить("Key");
	Результат.Вставить("Value");
	
	Возврат Результат;
	
КонецФункции

// См. описание УПД970_ПроверитьИсправитьСтавкиНДС
//
// Параметры:
//  Контент820 - Структура - Utd820SellerContent.
//
Процедура УПД820_ПроверитьИсправитьСтавкиНДС(Контент820)
	
	Для Каждого Item Из Контент820.Table.Items Цикл
		Item.TaxRate = НормализоватьTaxRate(Item.TaxRate);
	КонецЦикла;
	
КонецПроцедуры

// См. описание УПД970_ПроверитьИсправитьСтавкиНДС
//
// Параметры:
//  Контент736 - Структура - UcdSellerContent.
//
Процедура УКД736_ПроверитьИсправитьСтавкиНДС(Контент736)
	
	Для Каждого Item Из Контент736.InvoiceCorrectionTable.Items Цикл
		Item.OriginalValues.TaxRate = НормализоватьTaxRate(Item.OriginalValues.TaxRate);
		Item.CorrectedValues.TaxRate = НормализоватьTaxRate(Item.CorrectedValues.TaxRate);
	КонецЦикла;
	
КонецПроцедуры

Функция НормализоватьTaxRate(Знач TaxRate)
	
	Результат = TaxRate;
	Если СтрЗаканчиваетсяНаЛок(TaxRate, "%") Тогда
		Результат = Лев(TaxRate, СтрДлина(TaxRate) - 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НоваяСлужебнаяИнформацияШапки()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	
	Возврат Результат;
	
КонецФункции

// Возвращает зарезервированное имя свойства для передачи произвольных данных в структуру контента.
// 
// Возвращаемое значение:
//  Строка.
//
Функция ИмяСвойстваСлужебнаяИнформация()
	
	Возврат "СлужебнаяИнформация";
	
КонецФункции

// Дополняет структуру контента документа служебной информацией об источнике заполнения контента:
// ссылками на сам документ, контрагента, организацию.
//
// Параметры:
//  Контент - Структура - формируемый контент документа;
//  СсылкаНаДокумент - ДокументСсылка - Ссылка на документ информационной базы.
//
Процедура ДополнитьКонтентДокументаСлужебнойИнформацией(Контент, СсылкаНаДокумент)
	
	СлужебнаяИнформация = НоваяСлужебнаяИнформацияШапки();
	ЗаполнитьЗначенияСвойств(СлужебнаяИнформация, СсылкаНаДокумент);
	СлужебнаяИнформация.Ссылка = СсылкаНаДокумент;
	
	Контент.Вставить(ИмяСвойстваСлужебнаяИнформация(), СлужебнаяИнформация);
	
КонецПроцедуры

//}		СБОР ПРОТОКОНТЕНТА



//{		СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Дополняет соответствие значениями из другого соответствия.
//
// Параметры:
//   Приемник - Соответствие - коллекция, в которую будут добавляться новые значения.
//   Источник - Соответствие - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - Что делать в местах пересечения ключей источника и приемника:
//                                       Истина - Заменять значения приемника (самый быстрый способ),
//                                       Ложь   - Не заменять значения приемника (пропускать),
//                                       Неопределено - Значение по умолчанию. Бросать исключение.
//
Процедура Общее_ДополнитьСоответствие(Приемник, Источник, Заменять = Неопределено)
	
	Для Каждого Элемент Из Источник Цикл
		Если Заменять <> Истина И Приемник[Элемент.Ключ] <> Неопределено Тогда
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ВызватьИсключение ПараметрыВСтроку(НСтр("ru = 'Пересечение ключей источника и приемника: ""%1"".'"), "%1", Элемент.Ключ);
			КонецЕсли
		КонецЕсли;
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// ВАЖНО: В результирующую строку добавляются только непустые значения!
// Платформенный метод СтрСоединить объединяет строки безусловно.
// Нужно это учитывать, если в качестве разделителя задана непустая строка.
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - коллекция объединяемых строк.
//  Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
// Пример:
//   
//   Строки = Новый Массив;
//   Строки.Добавить("Элемент0");
//   Строки.Добавить("");
//   Строки.Добавить("Элемент2");
//   
//   СоединитьСтроку(Строки, "#") = "Элемент0#Элемент2"
//   СтрСоединить(Строки, "#") = "Элемент0##Элемент2"
//   СоединитьСтроку(Строки, "") = СтрСоединить(Строки, "") = "Элемент0Элемент2"
//
Функция Общее_СоединитьСтроку(Строки, Знач Разделитель = "")
	
	Результат = "";
	ТекРазделитель = "";
	
	Для Каждого Строка Из Строки Цикл
		
		Если Не ЗначениеЗаполнено(Строка) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + ТекРазделитель + Строка;
		ТекРазделитель = Разделитель;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, заканчивается ли строка указанной подстрокой.
//
// Параметры:
//  Строка - Строка - Проверяемая строка
//  СтрокаПоиска - Строка - Искомое окончание строки
// 
// Возвращаемое значение:
//  Булево - Истина, если строка зкаканчивается указанной подстрокой
//
Функция СтрЗаканчиваетсяНаЛок(Знач Строка, Знач СтрокаПоиска)
	
	Результат = (Прав(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска);
	Возврат Результат;
	
КонецФункции

// Определяет, что строка начинается с указанной подстроки. Определение выполняется с учетом регистра, аналогично функции Найти
//
// Параметры:
//  Строка - Строка - Строка, начало которой проверяется на совпадение с подстрокой поиска
//  СтрокаПоиска - Строка - Строка, содержащая предполагаемое начало строки
//
// Возвращаемое значение:
//  Булево - Истина, начинается с указанной подстроки.
//
Функция СтрНачинаетсяСЛок(Знач Строка, Знач СтрокаПоиска)
	
	Результат = (Лев(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска);
	Возврат Результат;
	
КонецФункции

// Фиксирует Данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// BSLLS:TooManyReturns-off
// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:IfElseIfEndsWithElse-off
// BSLLS:IfConditionComplexity-off
// BSLLS:DuplicateStringLiteral-off
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - коллекции, значения которых являются примитивными типами,
//           хранилищем значения или не могут быть изменены. Поддерживаются типы значений:
//           Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//           ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//           ЛюбаяСсылка.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
// 
Функция ФиксированныеДанные(Данные)
	
	Если ТипЗнч(Данные) = Тип("Массив")
		Или ТипЗнч(Данные) = Тип("ФиксированныйМассив") Тогда
		Массив = Новый Массив;
		
		Для Каждого Значение Из Данные Цикл
			
			Если ТипЗнч(Значение) = Тип("Структура")
				Или ТипЗнч(Значение) = Тип("Соответствие")
				Или ТипЗнч(Значение) = Тип("Массив")
				Или ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
				
				Массив.Добавить(ФиксированныеДанные(Значение));
				
			Иначе
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		Или ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Коллекция = Новый Структура;
		Иначе
			Коллекция = Новый Соответствие;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из Данные Цикл
			Значение = КлючИЗначение.Значение;
			
			Если ТипЗнч(Значение) = Тип("Структура")
			 ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			 ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Коллекция.Вставить(
					КлючИЗначение.Ключ, ФиксированныеДанные(Значение));
			Иначе
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Возврат Новый ФиксированнаяСтруктура(Коллекция);
		Иначе
			Возврат Новый ФиксированноеСоответствие(Коллекция);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Данные;
	
	// BSLLS:TooManyReturns-on
	// BSLLS:CognitiveComplexity-on
	// BSLLS:CyclomaticComplexity-on
	// BSLLS:IfElseIfEndsWithElse-on
	// BSLLS:IfConditionComplexity-on
	// BSLLS:DuplicateStringLiteral-on
	
КонецФункции // ФиксированныеДанные

// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату.
// Табличный документ формируется типовым механизмом конфигурации.
//
// Параметры:
//  СчетНаОплату - ДокументСсылка	- документ, на основании которого формируем печатную форму
//
// Возвращаемое значение:
//   Структура - см. НовыйРезультатВизуализацииСчетаНаОплату
//
Функция РезультатВизуализацииСчетаНаОплатуСредствамиКонфигурации(СчетНаОплату)
	
	Перем МенеджерПечати;
	
	Результат = НовыйРезультатВизуализацииСчетаНаОплату();
	
	ПараметрыМетодаПечати = НовыйПараметрыТиповогоМетодаПечати();
	ПараметрыМетодаПечати.МассивОбъектов.Добавить(СчетНаОплату);
	
	ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати);
	ПриФормированииПечатнойФормыСчетаНаОплату(Результат, МенеджерПечати, ПараметрыМетодаПечати, СчетНаОплату);
	ИнтеграционныйМодуль.ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура ПриФормированииПечатнойФормыСчетаНаОплату(Результат, МенеджерПечати, ПараметрыМетодаПечати, СчетНаОплату)
	
	Если МенеджерПечати = Неопределено Тогда
		ВызватьИсключение "Не удалось определить менеджер печати для формирования печатной формы счета на оплату по документу " + СчетНаОплату;
	КонецЕсли;
	
	МенеджерПечати.Печать(
		ПараметрыМетодаПечати.МассивОбъектов,
		ПараметрыМетодаПечати.ПараметрыПечати,
		ПараметрыМетодаПечати.КоллекцияПечатныхФорм,
		ПараметрыМетодаПечати.ОбъектыПечати,
		ПараметрыМетодаПечати.ПараметрыВывода);
	
	Для Каждого Стр Из ПараметрыМетодаПечати.КоллекцияПечатныхФорм Цикл
		Если ТипЗнч(Стр.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			ТабличныйДокумент = Стр.ТабличныйДокумент;
		КонецЕсли;
	КонецЦикла;
	
	Если ТабличныйДокумент = Неопределено Тогда
		ВызватьИсключение "Не удалось сформировать печатную форму счета на оплату по документу " + СчетНаОплату;
	КонецЕсли;
	
	ТабличныйДокумент.Автомасштаб = Истина;
	
	НомерДокумента = ПредставлениеНомераДокументаУчета(СчетНаОплату);
	
	Результат.Таблица = ТабличныйДокумент;
	Результат.Дата = СчетНаОплату.Дата;
	Результат.Номер = СокрЛП(НомерДокумента);
	Результат.СписокОшибок = "";
	Результат.ИмяФайла = ИмяФайлаВложенияPDF("Счет", НомерДокумента, СчетНаОплату.Дата);
	
	ТабличныйДокумент_УбратьПодписьИПечать(Результат.Таблица);
	
КонецПроцедуры

Процедура ТабличныйДокумент_УбратьПодписьИПечать(ТабличныйДокумент)
	
	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
		Если Рисунок.ТипРисунка = ТипРисункаТабличногоДокумента.Картинка
			И Найти(Рисунок.Имя, "_Документ_") > 0 Тогда
			Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Включает автоматическое масштабирование и устанавливает поля табличного документа.
//
// Параметры:
//  ТабДокумент - ТабличныйДокумент - печатная форма документа.
//
Процедура ТабличныйДокумент_УстановитьМасштабИПоля(ТабДокумент)
	
	Если ТипЗнч(ТабДокумент) <> Тип("ТабличныйДокумент") Тогда
		Возврат;
	КонецЕсли;
	
	ШиринаПолей = 5;
	ТабДокумент.ПолеСверху = ШиринаПолей;
	ТабДокумент.ПолеСлева = ШиринаПолей;
	ТабДокумент.ПолеСнизу = ШиринаПолей;
	ТабДокумент.ПолеСправа = ШиринаПолей;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры

// Возвращает структуру, в которой Ключ - наименование параметра типового метода печати, 
// а Значение - значение параметра типового метода печати
//
// Возвращаемое значение:
//   Структура
//
Функция НовыйПараметрыТиповогоМетодаПечати()
	
	Результат = Новый Структура();
	
	Результат.Вставить("МассивОбъектов"			, Новый Массив);
	Результат.Вставить("ПараметрыПечати"		, Новый Структура);
	Результат.Вставить("КоллекцияПечатныхФорм"	, НовыйКоллекцияПечатныхФормДляПечатиДокумента());
	Результат.Вставить("ОбъектыПечати"			, Новый СписокЗначений);
	Результат.Вставить("ПараметрыВывода"		, НовыйПараметрыВывода());
	
	Возврат Результат;
	
КонецФункции

// Метод является констркутором служебной коллекции "ПараметрыВывода"
// 
// Возвращаемое значение:
//   - Структура
//
Функция НовыйПараметрыВывода()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПараметрыОтправки", НовыйПараметрыОтправки());
	Результат.Вставить("ДоступнаПечатьПоКомплектно", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Метод является констркутором служебной коллекции "ПараметрыОтправки"
// 
// Возвращаемое значение:
//   - Структура
//
Функция НовыйПараметрыОтправки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Тема");
	Результат.Вставить("Текст");
	Результат.Вставить("Получатель");
	
	Возврат Результат;
	
КонецФункции

// Метод является констркутором служебной коллекции "КоллекцияПечатныхФорм"
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция НовыйКоллекцияПечатныхФормДляПечатиДокумента()
	
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции

// Определяет содержимое результата визуализации счета на оплату для всех интеграционных модулей
// 
// Возвращаемое значение:
//   Структура 
//
Функция НовыйРезультатВизуализацииСчетаНаОплату()
	
	Результат = Новый Структура();
	
	Результат.Вставить("Таблица");
	Результат.Вставить("СписокОшибок");
	Результат.Вставить("ИмяФайла");
	Результат.Вставить("Дата");
	Результат.Вставить("Номер");
	Результат.Вставить("Сумма");
	Результат.Вставить("СуммаНДС");
	Результат.Вставить("ДокументБезНДС");
	Результат.Вставить("КодВалюты");
	
	Возврат Результат;
	
КонецФункции

// Определяет менеждер печати и значения параметров метода печати, характерные для конкретной конфигурации 1С
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- См. метод "НовыйПараметрыТиповогоМетодаПечати"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати)
	
	ИнтеграционныйМодуль.ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати);
			
КонецПроцедуры

// Дозаполняет мету неформализованного счета на оплату по данным интеграционного модуля
//
// Параметры:
//  СчетНаОплату - ДокументСсылка	- документ, на основании которого формируем печатную форму 
//  Мета		 - Структура		- см. метод "НовыйРезультатВизуализацииСчетаНаОплату"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета)
	
	Данные = СчетаНаОплату_Данные(СчетНаОплату);
	
	Шапка = Данные.Шапка;
	ТабличнаяЧасть = Данные.ТабличнаяЧасть;
	
	Мета.Номер = Шапка.Номер;
	Мета.ДокументБезНДС = Не Шапка.УчитыватьНДС;
	Мета.КодВалюты = Шапка.ВалютаКод;
	Мета.СуммаНДС = ТабличнаяЧасть.Итог("СуммаНДС");
	Мета.Сумма = ТабличнаяЧасть.Итог("Сумма");
	
	Если Не Шапка.ЦенаВключаетНДС Тогда
		Мета.Сумма = Мета.Сумма + Мета.СуммаНДС;
	КонецЕсли;

КонецПроцедуры

Функция ПредставлениеНомераДокументаУчета(Документ1С)
	
	Результат = ИнтеграционныйМодуль.ПриПолученииПредставленияНомераДокументаУчета(Документ1С);
		
	Возврат Результат;
	
КонецФункции

// Формирует имя файла в формате PDF по его названию, номеру и дате.
// При этом в имени файла символы, не поддерживаемые файловой системой,
// заменяются на "_"
//
// Параметры:
//  ИмяДокумента - Строка - название документа
//  НомерДокумента - Строка - номер документа
//  ДатаДокумента - Дата - дата документа
// 
// Возвращаемое значение:
//  Строка - имя файла вида "<Название> №<Номер> от <Дата>.pdf"
//
Функция ИмяФайлаВложенияPDF(ИмяДокумента, НомерДокумента, ДатаДокумента)
	
	ДатаСтрокой = Формат(ДатаДокумента, "ДЛФ=Д");
	
	ЧастиИмени = Новый Массив;
	ЧастиИмени.Добавить(ИмяДокумента);
	ЧастиИмени.Добавить(" №");
	ЧастиИмени.Добавить(НомерДокумента);
	ЧастиИмени.Добавить(" от ");
	ЧастиИмени.Добавить(ДатаСтрокой);
	ЧастиИмени.Добавить(".pdf");
	
	ИмяФайла = Общее_СоединитьСтроку(ЧастиИмени, "");
	
	Результат = ФС_ЗаменитьНедопустимыеСимволыВПути(ИмяФайла);
	
	Возврат Результат;
	
КонецФункции

// Заменяет символы, которые не допускаются в путях файловой системы, на "_"
//
// Параметры:
//  ИсходнаяСтрока - Строка - любая строка
// 
// Возвращаемое значение:
//  Строка.
//
Функция ФС_ЗаменитьНедопустимыеСимволыВПути(Знач Путь)
	
	Результат = Путь;
	
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(Результат, ТекСимвол) <> 0 Тогда
			Результат = СтрЗаменить(Результат, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьРеквизитыНомерИДатаВУчетномДокументе(СоответствиеРеквизитов, СсылкаНаОбъект)
	
	Результат = Истина;
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	РеквизитыМетаданных = МетаданныеОбъекта.Реквизиты;
	
	ИмяРеквизитаНомер = СоответствиеРеквизитов.Номер;
	ИмяРеквизитаДата = СоответствиеРеквизитов.Дата;
	
	Если РеквизитыМетаданных.Найти(ИмяРеквизитаНомер) = Неопределено 
		И РеквизитыМетаданных.Найти(ИмяРеквизитаДата) = Неопределено Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЗаполненныеРеквизитыДокументаУчета(СоответствиеРеквизитов, СсылкаНаОбъект)
	
	Результат = Неопределено;
	
	ИмяРеквизитаНомер = СоответствиеРеквизитов.Номер;
	ИмяРеквизитаДата = СоответствиеРеквизитов.Дата;
	
	Если Не ЕстьРеквизитыНомерИДатаВУчетномДокументе(СоответствиеРеквизитов, СсылкаНаОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтруктураПолучения = Новый Структура;
	СтруктураПолучения.Вставить(ИмяРеквизитаНомер);
	СтруктураПолучения.Вставить(ИмяРеквизитаДата);
	
	ЗаполнитьЗначенияСвойств(СтруктураПолучения, СсылкаНаОбъект);
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", СтруктураПолучения[ИмяРеквизитаНомер]);
	Результат.Вставить("Дата", СтруктураПолучения[ИмяРеквизитаДата]);

	Возврат Результат;

КонецФункции

Функция СоответствиеРеквизитовПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", "НомерВходящегоДокумента");
	Результат.Вставить("Дата", "ДатаВходящегоДокумента");
	
	Возврат Результат;
	
КонецФункции

Функция ТипОснования_СчетНаОплату()
	
	Возврат "СчетНаОплату";

КонецФункции

Функция ТипОснования_ЗаказКлиента()
	
	Возврат "ЗаказКлиента";
	
КонецФункции

Функция ТипОснования_ЗаказПокупателя()
	
	Возврат "ЗаказПокупателя";
	
КонецФункции

Функция ТиповойМодульПодключен()
	
	Результат = (ТиповойМодуль <> Неопределено);
	Возврат Результат;
	
КонецФункции

Процедура ЛогироватьТиповойМодульНеПодключен(Знач ВызывающийМетод)
	
	ЖурналРегистрации_ЗаписатьОшибку(
		ВызывающийМетод,
		"Библиотека ""ТиповойМодуль"" не подключена"
	);
	
КонецПроцедуры

Процедура ЖурналРегистрации_ЗаписатьОшибку(Знач ИмяСобытия, Знач Комментарий)
	
	ИдентификаторСобытия = ЖурналРегистрации_ИдентификаторСобытия(ИмяСобытия);
	
	ЗаписьЖурналаРегистрации(
		ИдентификаторСобытия,
		УровеньЖурналаРегистрации.Предупреждение,
		Неопределено,
		Неопределено,
		Комментарий
	);
	
КонецПроцедуры

Функция ЖурналРегистрации_ИдентификаторСобытия(ИмяСобытия)
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(ЖурналРегистрации_ИдентификаторПродукта());
	Подстроки.Добавить(ЖурналРегистрации_ИмяМодуля());
	Подстроки.Добавить(ИмяСобытия);
	
	Разделитель = ".";
	
	Результат = Общее_СоединитьСтроку(Подстроки, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция ЖурналРегистрации_ИдентификаторПродукта()
	Возврат "КонтурДиадок";
КонецФункции

Функция ЖурналРегистрации_ИмяМодуля()
	Возврат "МенеджерИнтеграции";
КонецФункции

// Имя события для записи в журнал регистрации.
//
Функция СобытиеЖурналаРегистрации()
	
	Результат = НСтр("ru = 'Диадок'; en = 'Diadoc'", КодОсновногоЯзыка());
	
	Возврат Результат;
	
КонецФункции

// Возвращает код основного языка конфигурации, например "ru".
//
// Возвращаемое значение:
//  Строка - код языка.
//
Функция КодОсновногоЯзыка()
	
	Результат = "ru";
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон строки с параметрами;
//  Параметр<n>	 - Строка - подставляемый параметр.
//
// Пример:
//  ПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
// 
// Возвращаемое значение:
//  Строка - строка с подставленными параметрами.
//
Функция ПараметрыВСтроку(ШаблонСтроки
						, Параметр1
						, Параметр2 = Неопределено
						, Параметр3 = Неопределено
						, Параметр4 = Неопределено
						, Параметр5 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

//}		СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
