//#Область ОписаниеПеременных

Перем ОсновнойМодуль;
Перем СчетчикВызовов;
Перем КэшНаСервере;
Перем Контекст;
Перем TraceId;

//#КонецОбласти // ОписаниеПеременных


//#Область ПрограммныйИнтерфейс

// Открывает основную форму библиотеки плагинов.
//
// Параметры:
//  КонтекстИлиВызвающийМодуль - Структура, ФормаКлиентскогоПриложения - см. НовыйКонтекстВызывающегоМодуля
//  ПараметрВладелец - ФормаКлиентскогоПриложения - форма или элемент управления другой формы.
//
Процедура ОткрытьОсновнуюФорму(КонтекстИлиВызвающийМодуль, ПараметрВладелец) Экспорт
	
	Если ТипЗнч(КонтекстИлиВызвающийМодуль) = Тип("Структура") Тогда
		Контекст = КонтекстИлиВызвающийМодуль;
	Иначе
		Контекст = НовыйКонтекстВызывающегоМодуля(КонтекстИлиВызвающийМодуль);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ИмяОсновнойФормы = "Форма_Обычная";
	
	ПараметрКлючУникальности = Неопределено;
	ПараметрЗакрыватьПриЗакрытииВладельца = Истина;
	
	ФормаОбработки = ПолучитьФормуОбработки(
		ИмяОсновнойФормы,
		ПараметрВладелец,
		ПараметрыФормы,
		ПараметрКлючУникальности,
		ПараметрЗакрыватьПриЗакрытииВладельца
	);
	
	ФормаОбработки.Инициализировать(Контекст);
	ФормаОбработки.Открыть();
	
КонецПроцедуры

Процедура ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, КонтекстИлиВызвающийМодуль) Экспорт
	
	ПриНачалеВызоваБиблиотеки(КонтекстИлиВызвающийМодуль);
	
	СоответствиеСобытийПлагинам = СоответствиеСобытийПлагинам_Получить();
	
	МассивПлагинов = СоответствиеСобытийПлагинам.Получить(ИмяСобытия);
	
	Если НЕ МассивПлагинов = Неопределено Тогда
		Для Каждого Плагин ИЗ МассивПлагинов Цикл
			
			Плагин_ОбработатьСобытие(
				Плагин,
				ИмяСобытия,
				ПараметрыСобытия
			);
			
		КонецЦикла;
	КонецЕсли;

	ПриОкончанииВызоваБиблиотеки();
	
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Конструктор сведений о плагине.
//
// Параметры:
//  Идентификатор - Строка - идентификатор (имя) плагина;
//  Версия - Строка - версия плагина;
//  Включен - Булево - (необязательный) Истина, если плагин включен;
//  Представление - Строка - (Необязательный) Пользовательское представление плагина. Если не заполнено, используется Идентификатор.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. Контракт_СведенияОПлагине.
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Новый_СведенияОПлагине(Знач Идентификатор, Знач Версия, Знач Включен = Истина, Знач Представление = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = Идентификатор;
	КонецЕсли;
	
	Результат = Контракт_СведенияОПлагине();
	Результат.Идентификатор = Идентификатор;
	Результат.Представление = Представление;
	Результат.Включен = Включен;
	Результат.Версия = Версия;
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает список установленных плагинов (загруженных в информационную базу)
// 
// Возвращаемое значение:
//  Массив из Структура:
//   * Идентификатор - Строка - идентификатор (имя) плагина;
//   * Версия - Строка - версия плагина;
//   * Состояние - Строка - представление состояния плагина;
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция УстановленныеПлагины(КонтекстИлиВызвающийМодуль) Экспорт
	
	ПриНачалеВызоваБиблиотеки(КонтекстИлиВызвающийМодуль);
	
	Результат = Новый Массив;
	
	ЗагруженныеПлагины = СписокЗагруженныхПлагинов();
	
	Для Каждого ВнутреннийКонтракт Из ЗагруженныеПлагины Цикл
		
		ПубличныйКонтракт = Новый Структура;
		ПубличныйКонтракт.Вставить("Идентификатор", ВнутреннийКонтракт.Идентификатор);
		ПубличныйКонтракт.Вставить("Состояние", ВнутреннийКонтракт.Состояние);
		ПубличныйКонтракт.Вставить("Версия", ВнутреннийКонтракт.Версия);
		
		Результат.Добавить(ПубличныйКонтракт);
		
	КонецЦикла;
	
	ПриОкончанииВызоваБиблиотеки();
	
	Возврат Результат;
	
КонецФункции


// Возвращает признак возможности хранения плагинов в стандартном хранилище.
// 
// Возвращаемое значение:
//  Булево - Истина, если определено стандартное хранилище плагинов.
//
Функция ДоступноСтандартноеХранилищеПлагинов() Экспорт
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Результат = ЗначениеЗаполнено(ВариантХранения);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти // ПрограммныйИнтерфейс


//#Область ПубличныеКонтракты

// Публичный контракт описания плагина.
// 
// Возвращаемое значение:
//  Стурктура:
//    * Идентификатор - Строка - идентификатор (имя) плагина;
//    * Представление - Строка - пользовательское представление плагина;
//    * Версия - Строка - Версия плагина (по умолчанию "0.0.0");
//    * Включен - Булево - Истина, если плагин включен;
//
// @ПубличныйПрограммныйИнтерфейс
//
Функция Контракт_СведенияОПлагине()
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Представление");
	Результат.Вставить("Включен");
	Результат.Вставить("Версия");
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти // ПубличныеКонтракты


//#Область СлужебныйПрограммныйИнтерфейс

// Открывает список опубликованных плагинов.
//
// Параметры:
//  ПараметрВладелец - ФормаКлиентскогоПриложения - форма или элемент управления другой формы.
//
Процедура ОткрытьБиблиотекуПлагинов(ПараметрВладелец) Экспорт
	
	ИмяФормыБиблиотеки = "Форма_БиблиотекаПлагинов_Обычная";
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрКлючУникальности = Неопределено;
	ПараметрЗакрыватьПриЗакрытииВладельца = Истина;
	
	ФормаОбработки = ПолучитьФормуОбработки(
		ИмяФормыБиблиотеки,
		ПараметрВладелец,
		ПараметрыФормы,
		ПараметрКлючУникальности,
		ПараметрЗакрыватьПриЗакрытииВладельца
	);
	
	ФормаОбработки.Открыть();
	
КонецПроцедуры

Процедура ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды, КонтекстИлиВызвающийМодуль) Экспорт
	
	ПриНачалеВызоваБиблиотеки(КонтекстИлиВызвающийМодуль);
	
	Если ИмяКоманды = КомандаПолучитьСписокТиповых() Тогда 
		
		ОбработатьКоманду_ПолучитьСписокТиповых(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаПолучитьСписокЗагруженных() Тогда
		
		ОбработатьКоманду_ПолучитьСписокЗагруженных(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаПолучитьСписокПлагинов() Тогда
		
		ОбработатьКоманду_ПолучитьСписокПлагинов(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаПроверитьНаличиеОбновлений() Тогда
		
		ОбработатьКоманду_ПроверитьНаличиеОбновлений(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаПроверитьВозможностьНастройки() Тогда
		
		ОбработатьКоманду_ПроверитьВозможностьНастройки(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаЗагрузитьПлагин() Тогда
		
		ОбработатьКоманду_ЗагрузитьПлагин(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаПолучитьФайл() Тогда
		
		ОбработатьКоманду_ПолучитьФайл(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаВключитьПлагин() Тогда
		
		ОбработатьКоманду_ВключитьПлагин(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаОтключитьПлагин() Тогда
		
		ОбработатьКоманду_ОтключитьПлагин(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаУдалитьПлагин() Тогда
		
		ОбработатьКоманду_УдалитьПлагин(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаОткрытьНастройкиПлагина() Тогда
		
		ОбработатьКоманду_ОткрытьНастройкиПлагина(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаПолучитьНастройки() Тогда
		
		ОбработатьКоманду_ПолучитьНастройки(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаСохранитьНастройки() Тогда
		
		ОбработатьКоманду_СохранитьНастройкиПлагина(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаЗафиксироватьОшибкуПлагина() Тогда
		
		ОбработатьКоманду_ПлагинЗафиксироватьОшибку(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаМетрики_ЗаписатьОшибку() Тогда
		
		ОбработатьКоманду_Метрики_ЗаписатьОшибку(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаМетрики_ЗаписатьСтатистику() Тогда
		
		ОбработатьКоманду_Метрики_ЗаписатьСтатистику(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаМетрики_ЗаписатьПоведение() Тогда
		
		ОбработатьКоманду_Метрики_ЗаписатьПоведение(ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = КомандаМетрики_ЗаписатьЗамер() Тогда
		
		ОбработатьКоманду_Метрики_ЗаписатьЗамер(ПараметрыКоманды);
		
	Иначе
		
		ТекстОшибки = НСтр("ru = 'Неизвестная команда (%1)'");
		ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ИмяКоманды);
		
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ОбработатьСлужебнуюКоманду");
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ПриОкончанииВызоваБиблиотеки();
	
КонецПроцедуры

//#КонецОбласти // СлужебныйПрограммныйИнтерфейс


//#Область СлужебныеКонтракты

// Конструктор сведений о плагине.
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//    * Идентификатор - Строка - идентификатор плагина
//    * Представление - Строка - представление плагина для пользователя
//    * Состояние - Строка - текущее состояние плагина (см. Перечисление_СостоянияПлагинов)
//    * Версия - Строка - номер версии МАЖОРНАЯ.МИНОРНАЯ.ПАТЧ (см. https://semver.org/lang/ru/)
//
Функция Новый_КонтрактХранения()
	
	СостояниеПоУмолчанию = СостояниеПлагинаВключен();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Представление");
	Результат.Вставить("Состояние", СостояниеПоУмолчанию);
	Результат.Вставить("Версия");
	Результат.Вставить("ПутьКФайлу");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ТиповойПлагин()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Представление");
	Результат.Вставить("ДатаОбновления");
	Результат.Вставить("Версия");
	Результат.Вставить("Описание");
	Результат.Вставить("СсылкаНаСправку");
	Результат.Вставить("Автообновление", Ложь);
	
	Возврат Результат;
	
КонецФункции

//#КонецОбласти // СлужебныеКонтракты


//#Область СлужебныеПроцедурыИФункции

Функция СоответствиеСобытийПлагинам_Получить()
	
	// TODO: помещать в кэш основного модуля через Плагины_ПоместитьКэш?
	
	КлючКэш = "СоответствиеСобытийПлагинам";
	
	Результат = Кэш_Прочитать(КлючКэш);
	Если НЕ Результат = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СоответствиеСобытийПлагинам = Новый Соответствие;
	
	ВсеПлагины = СписокПлагинов();
	
	Для Каждого Плагин ИЗ ВсеПлагины Цикл
		
		Если Плагин.Состояние <> СостояниеПлагинаВключен() Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатМанифеста = МанифестПлагина(Плагин.Идентификатор);
		
		Если РезультатМанифеста.Успешно Тогда
			
			Для Каждого ИмяСобытия ИЗ РезультатМанифеста.Данные.События Цикл
				
				МассивПлагинов = СоответствиеСобытийПлагинам.Получить(ИмяСобытия);
				Если МассивПлагинов = Неопределено Тогда
					МассивПлагинов = Новый Массив;
				КонецЕсли;
				
				КонтрактХранения = Новый_КонтрактХранения();
				ЗаполнитьЗначенияСвойств(КонтрактХранения, Плагин);
				МассивПлагинов.Добавить(КонтрактХранения);
				
				СоответствиеСобытийПлагинам.Вставить(ИмяСобытия,МассивПлагинов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Кэш_Поместить(КлючКэш, СоответствиеСобытийПлагинам);
	
	Возврат СоответствиеСобытийПлагинам;
	
КонецФункции

Процедура СброситьКэш()

	// TODO: помещать в кэш основного модуля через Плагины_ПоместитьКэш? 
	КэшПлагинов_Очистить();
	
	Кэш_Поместить("СоответствиеСобытийПлагинам", Неопределено);
	
КонецПроцедуры

Функция НовыйКонтекстВызывающегоМодуля(ВызывающийМодуль)
	
	Результат = Новый Структура;
	Результат.Вставить("ВызывающийМодуль", ВызывающийМодуль);
	Результат.Вставить("РежимОтладки", Ложь);
	Результат.Вставить("КаталогОтладки", "");
	
	Возврат Результат;
	
КонецФункции

// Обертка для более удобного получения результата служебных событий
Функция ПолучитьРезультатСлужебногоСобытия(ИмяКоманды, ПараметрыКоманды = Неопределено)
	
	Если ПараметрыКоманды = Неопределено Тогда
		ПараметрыКоманды = Новый Структура;
	КонецЕсли;
	
	ПараметрыКоманды.Вставить("Результат");
	
	ОбработатьСлужебнуюКоманду(ИмяКоманды, ПараметрыКоманды, Контекст);
	
	Возврат ПараметрыКоманды.Результат;
	
КонецФункции

Процедура ЗавершитьРаботуМодуля()
	
	КешПлагинов = КэшПлагинов();
	КэшПлагинов = Неопределено;
	
	ОсновнойМодуль = Неопределено;
	СчетчикВызовов = Неопределено;
	КэшНаСервере = Неопределено;
	Контекст = Неопределено;
	
КонецПроцедуры

//********************************************************
//
//		ОБРАБОТЧИКИ СЛУЖЕБНЫХ КОМАНД
//

Процедура ОбработатьКоманду_ПроверитьВозможностьНастройки(ПараметрыСобытия)
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Истина, "");
	
	СтандартнаяОбработка = Истина;
	
	ОсновнойМодуль_ПриПроверкеВозможностиНастройки(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка_ПриПроверкеВозможностиНастройки(Результат);
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
КонецПроцедуры

// Получает из сервиса список доступных плагинов
Процедура ОбработатьКоманду_ПолучитьСписокТиповых(ПараметрыСобытия)
	
	Если ПараметрыСобытия = Неопределено Тогда 
		ПараметрыСобытия = Новый Структура;
	КонецЕсли; 
	
	Результат = СписокТиповыхПлагинов();
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
КонецПроцедуры 

Процедура ОбработатьКоманду_ПлагинЗафиксироватьОшибку(ПараметрыСобытия)
	
	Плагин = Неопределено;
	ИмяСобытия = Неопределено;
	ТекстОшибки = Неопределено;
	
	ПараметрыСобытия.Свойство("Плагин", Плагин);
	ПараметрыСобытия.Свойство("ИмяСобытия", ИмяСобытия);
	ПараметрыСобытия.Свойство("ТекстОшибки", ТекстОшибки);
	
	ЗафиксироватьОшибкуПлагина(Плагин, ИмяСобытия, ТекстОшибки);
	
КонецПроцедуры 

Процедура ОбработатьКоманду_Метрики_ЗаписатьОшибку(ПараметрыСобытия)
	
	ТипСобытия = Метрики_ТипСобытияОшибка();
	
	Действие = ПараметрыСобытия.Действие;
	ТекстОшибки = ПараметрыСобытия.ТекстОшибки;
	ИдентификаторПлагина = ПараметрыСобытия.ИдентификаторПлагина;
	ВерсияПлагина = ВерсияЗагруженногоПлагина(ИдентификаторПлагина);
	ИдентификаторТрассировки = ПараметрыСобытия.ИдентификаторТрассировки;
	
	НовоеСобытиеМетрики = НовоеСобытиеМетрики(ТипСобытия, Действие, ИдентификаторПлагина, ВерсияПлагина,, ТекстОшибки, ИдентификаторТрассировки);
	
	Метрики_ЗарегистрироватьСобытие(НовоеСобытиеМетрики);
	
КонецПроцедуры

Процедура ОбработатьКоманду_Метрики_ЗаписатьСтатистику(ПараметрыСобытия)
	
	ТипСобытия = Метрики_ТипСобытияСтатистика();
	
	Действие = ПараметрыСобытия.Действие;
	Переменные = ПараметрыСобытия.Переменные;
	ИдентификаторПлагина = ПараметрыСобытия.ИдентификаторПлагина;
	ВерсияПлагина = ВерсияЗагруженногоПлагина(ИдентификаторПлагина);
	ИдентификаторТрассировки = ПараметрыСобытия.ИдентификаторТрассировки;
	
	НовоеСобытиеМетрики = НовоеСобытиеМетрики(ТипСобытия,Действие, ИдентификаторПлагина, ВерсияПлагина, Переменные,, ИдентификаторТрассировки);
	
	Метрики_ЗарегистрироватьСобытие(НовоеСобытиеМетрики);
	
КонецПроцедуры

Процедура ОбработатьКоманду_Метрики_ЗаписатьПоведение(ПараметрыСобытия)
	
	ТипСобытия = Метрики_ТипСобытияПоведение();
	
	Действие = ПараметрыСобытия.Действие;
	Переменные = ПараметрыСобытия.Переменные;
	ИдентификаторПлагина = ПараметрыСобытия.ИдентификаторПлагина;
	ВерсияПлагина = ВерсияЗагруженногоПлагина(ИдентификаторПлагина);
	ИдентификаторТрассировки = ПараметрыСобытия.ИдентификаторТрассировки;
	
	НовоеСобытиеМетрики = НовоеСобытиеМетрики(ТипСобытия, Действие, ИдентификаторПлагина, ВерсияПлагина, Переменные,, ИдентификаторТрассировки);
	
	Метрики_ЗарегистрироватьСобытие(НовоеСобытиеМетрики);
	
КонецПроцедуры

Процедура ОбработатьКоманду_Метрики_ЗаписатьЗамер(ПараметрыСобытия)
	
	ТипСобытия = Метрики_ТипСобытияЗамер();
	
	Действие = ПараметрыСобытия.Действие;
	Переменные = ПараметрыСобытия.Переменные;
	ИдентификаторПлагина = ПараметрыСобытия.ИдентификаторПлагина;
	ВерсияПлагина = ВерсияЗагруженногоПлагина(ИдентификаторПлагина);
	ИдентификаторТрассировки = ПараметрыСобытия.ИдентификаторТрассировки;
	
	НовоеСобытиеМетрики = НовоеСобытиеМетрики(ТипСобытия,Действие, ИдентификаторПлагина, ВерсияПлагина, Переменные,, ИдентификаторТрассировки);
	
	Метрики_ЗарегистрироватьСобытие(НовоеСобытиеМетрики);
	
КонецПроцедуры

Процедура ОбработатьКоманду_ПолучитьСписокЗагруженных(ПараметрыСобытия) 
	
	Результат = СписокЗагруженныхПлагинов();
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
КонецПроцедуры

Процедура ОбработатьКоманду_ПроверитьНаличиеОбновлений(ПараметрыСобытия)
	
	Результат = Новый Структура("Успешно, Данные, ОписаниеОшибки", Ложь, ,"");
	
	СписокЗагруженных = СписокЗагруженныхПлагинов();
	СписокТиповых = СписокТиповыхПлагинов();
	
	СоответствиеПлагинов = Новый Соответствие;
	
	Для Каждого СтрТиповой ИЗ СписокТиповых Цикл
		
		СтруктураПлагина = Новый Структура();
		СтруктураПлагина.Вставить("Идентификатор",		СтрТиповой.Идентификатор);
		СтруктураПлагина.Вставить("Версия",				СтрТиповой.Версия);
		СтруктураПлагина.Вставить("Автообновление", 	СтрТиповой.Автообновление);
		СтруктураПлагина.Вставить("Описание",			СтрТиповой.Описание);
		СтруктураПлагина.Вставить("СсылкаНаСправку",	СтрТиповой.СсылкаНаСправку);
		
		СоответствиеПлагинов.Вставить(СтрТиповой.Идентификатор,СтруктураПлагина);
			
	КонецЦикла;
	
	МассивОбновлений = Новый Массив; 
	
	Для Каждого Плагин Из СписокЗагруженных Цикл
		
		АктуальнаяВерсия = СоответствиеПлагинов.Получить(Плагин.Идентификатор);
		Если НЕ АктуальнаяВерсия = Неопределено Тогда
			Если СравнитьВерсии(АктуальнаяВерсия.Версия, Плагин.Версия)>0 Тогда
				
				МассивОбновлений.Добавить(АктуальнаяВерсия);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Успешно	= Истина;
	Результат.Данные	= МассивОбновлений;
	
	ПараметрыСобытия.Вставить("Результат",Результат);
	
КонецПроцедуры

Процедура ОбработатьКоманду_ВыполнитьАвтоматическоеОбновление(ПараметрыСобытия)
	
	СписокАктуальныхВерсий = ПолучитьРезультатСлужебногоСобытия(КомандаПроверитьНаличиеОбновлений());
	
	Для Каждого АктуальнаяВерсия Из СписокАктуальныхВерсий Цикл
		Если АктуальнаяВерсия.Автообновление Тогда
			
			ПараметрыОбновления = Новый Структура();
			ПараметрыОбновления.Вставить("Идентификатор",	АктуальнаяВерсия.Идентификатор);
			ПараметрыОбновления.Вставить("ВариантЗагрузки",	"Обновление");
			
			Результат = ПолучитьРезультатСлужебногоСобытия(КомандаЗагрузитьПлагин(), ПараметрыОбновления);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьКоманду_ПолучитьСписокПлагинов(ПараметрыСобытия)
	
	// Список неиспользуемых
	НеиспользуемыеПлагины = Новый Соответствие;
	МассивНеиспользуемых = СписокНеиспользуемыхПлагинов();
	Для Каждого Эл ИЗ МассивНеиспользуемых Цикл
		НеиспользуемыеПлагины.Вставить(Эл,Истина);
	КонецЦикла;
	
	СписокЗагруженных = СписокЗагруженныхПлагинов();
	
	МассивСписка = Новый Массив;
	
	Для Каждого Плагин Из СписокЗагруженных Цикл
		
		НовыйЭлемент = Новый_МанифестПлагина();
		НовыйЭлемент.Вставить("ЕстьОбновление");
		НовыйЭлемент.Вставить("Состояние");
		НовыйЭлемент.Вставить("ОписаниеОшибки");
		НовыйЭлемент.Вставить("ПутьКФайлу");
		
		// заполним основные поля
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Плагин);
		
		// заполним поля из манифеста
		
		РезультатМанифеста = МанифестПлагина(Плагин.Идентификатор);
		
		Если РезультатМанифеста.Успешно Тогда
			
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, РезультатМанифеста.Данные);
			
		Иначе
			
			Если НовыйЭлемент.Состояние = СостояниеПлагинаВключен() Тогда
				НовыйЭлемент.Состояние = СостояниеПлагинаЕстьОшибки();
			КонецЕсли;
			
			НовыйЭлемент.ОписаниеОшибки = РезультатМанифеста.ОписаниеОшибки;
			
		КонецЕсли;
		
		// протестируем плагин, если он включен
		
		Если НовыйЭлемент.Состояние = СостояниеПлагинаВключен() Тогда
			
			РезультатТестирования = ПротестироватьПлагин(Плагин.Идентификатор);
			
			Если НЕ РезультатТестирования.Успешно Тогда
				
				НовыйЭлемент.Состояние		= СостояниеПлагинаЕстьОшибки();
				НовыйЭлемент.ОписаниеОшибки	= РезультатТестирования.ОписаниеОшибки;
				
			ИначеЕсли РезультатТестирования.ТребуетсяНастройка Тогда
				
				НовыйЭлемент.Состояние		= СостояниеПлагинаТребуетсяНастройка();
				
			КонецЕсли;
				
		КонецЕсли;
		
		// сбросим состояние в "Не используется", если он есть в перечне неиспользуемых плагинов основного модуля
		
		Если НеиспользуемыеПлагины.Получить(Плагин.Идентификатор) = Истина Тогда
			
			НовыйЭлемент.Состояние = СостояниеПлагинаНеИспользуется();
			
		КонецЕсли;
		
		МассивСписка.Добавить(НовыйЭлемент);
		
	КонецЦикла;
	
	ПараметрыСобытия.Результат = МассивСписка;
	
КонецПроцедуры

Процедура ОбработатьКоманду_ЗагрузитьПлагин(ПараметрыСобытия)
	
	Действие = "Загрузить";
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Истина, "");
	
	ИмяПроекта = ИдентификаторПроекта();
	ИмяПлагина = ПараметрыСобытия.Идентификатор;
	
	Плагин = Новый_КонтрактХранения();
	Плагин.Идентификатор = ИмяПлагина;
	Плагин.Представление = ПараметрыСобытия.Представление;
	Плагин.Версия = ПараметрыСобытия.Версия;
	
	Файл = ПараметрыСобытия.ДвоичныеДанные;
	
	Если Файл = Неопределено Тогда
		Файл = Сервис_ФайлПлагина(ИмяПроекта, ИмяПлагина);
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	
	Попытка
		
		ОсновнойМодуль_ПриЗагрузкеПлагина(Файл, Плагин, СтандартнаяОбработка);
		
		Если СтандартнаяОбработка Тогда
			СтандартнаяОбработка_ПриЗагрузкеПлагина(Файл, Плагин);
		КонецЕсли;
		
		Метрики_ЗаписатьДействиеПлагинов(
			Плагин.Идентификатор,
			Плагин.Версия,
			Действие
		);

		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ЖурналРегистрации_ЗаписатьОшибку(
			КомандаЗагрузитьПлагин(),
			ПодробноеПредставлениеОшибки
		);
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(Ошибка);
		
		Метрики_ЗаписатьОшибкуПлагинов(
			Плагин.Идентификатор,
			Плагин.Версия,
			Действие,
			ПодробноеПредставлениеОшибки
		);
		
	КонецПопытки;
	
	СброситьКэш();
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
КонецПроцедуры

Процедура ОбработатьКоманду_ПолучитьФайл(ПараметрыСобытия)
	
	ИмяПроекта = ИдентификаторПроекта();
	
	Файл = Сервис_ФайлПлагина(ИмяПроекта, ПараметрыСобытия.Идентификатор);
	
	ПараметрыСобытия.Вставить("Результат", Файл);
	
КонецПроцедуры

Процедура ОбработатьКоманду_ПолучитьМанифест(ПараметрыСобытия)
	
	Манифест = МанифестПлагина(ПараметрыСобытия.Идентификатор);
	
	ПараметрыСобытия.Вставить("Результат", Манифест);
	
КонецПроцедуры

Процедура ОбработатьКоманду_ВключитьПлагин(ПараметрыСобытия)
	
	Действие = "Включить";
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Ложь, "");
	
	ИмяПлагина = ПараметрыСобытия.Идентификатор;
	ВерсияПлагина = ВерсияЗагруженногоПлагина(ИмяПлагина);
	
	РезультатТестирования = ПротестироватьПлагин(ИмяПлагина);
	
	Если РезультатТестирования.Успешно Тогда
		
		СтандартнаяОбработка = Истина;
		
		ОсновнойМодуль_ПриВключенииПлагина(Результат, ИмяПлагина, СтандартнаяОбработка);
		
		Если СтандартнаяОбработка Тогда
			СтандартнаяОбработка_ПриВключенииПлагина(Результат, ИмяПлагина);
		КонецЕсли;
		
		СброситьКэш();
		
		Результат.Успешно = Истина;
		
		Метрики_ЗаписатьДействиеПлагинов(
			ИмяПлагина,
			ВерсияПлагина,
			Действие
		);

		
	Иначе
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = РезультатТестирования.ОписаниеОшибки;
		
		Метрики_ЗаписатьОшибкуПлагинов(
			ИмяПлагина,
			ВерсияПлагина,
			Действие,
			РезультатТестирования.ОписаниеОшибки
		);
		
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
КонецПроцедуры

Процедура ОбработатьКоманду_ОтключитьПлагин(ПараметрыСобытия)
	
	Действие = "Отключить";
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Ложь, "");
	
	СтандартнаяОбработка = Истина;
	
	ОсновнойМодуль_ПриОтключенииПлагина(Результат, ПараметрыСобытия.Идентификатор, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка_ПриОтключенииПлагина(Результат, ПараметрыСобытия.Идентификатор);
	КонецЕсли;
	
	ВерсияПлагина = ВерсияЗагруженногоПлагина(ПараметрыСобытия.Идентификатор);
	
	СброситьКэш();
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
	Если Результат.Успешно Тогда
		
		Метрики_ЗаписатьДействиеПлагинов(
			ПараметрыСобытия.Идентификатор,
			ВерсияПлагина,
			Действие
		);
		
	Иначе
		
		Метрики_ЗаписатьОшибкуПлагинов(
			ПараметрыСобытия.Идентификатор,
			ВерсияПлагина,
			Действие,
			Результат.ОписаниеОшибки
		);
		
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОбработатьКоманду_УдалитьПлагин(ПараметрыСобытия)
	
	Действие = "Удалить";
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Ложь, "");
	
	СтандартнаяОбработка = Истина;
	
	ВерсияПлагина = ВерсияЗагруженногоПлагина(ПараметрыСобытия.Идентификатор);
	
	ОсновнойМодуль_ПриУдаленииПлагина(Результат, ПараметрыСобытия.Идентификатор, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка_ПриУдаленииПлагина(Результат, ПараметрыСобытия.Идентификатор);
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("Результат", Результат);
	
	Если Результат.Успешно Тогда
		
		Метрики_ЗаписатьДействиеПлагинов(
			ПараметрыСобытия.Идентификатор,
			ВерсияПлагина,
			Действие
		);
		
	Иначе
		
		Метрики_ЗаписатьОшибкуПлагинов(
			ПараметрыСобытия.Идентификатор,
			ВерсияПлагина,
			Действие,
			Результат.ОписаниеОшибки
		);
		
	КонецЕсли;
	
	СброситьКэш();
	
КонецПроцедуры

Процедура ОбработатьКоманду_СохранитьНастройкиПлагина(ПараметрыСобытия)
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Ложь, "");
	
	СтандартнаяОбработка = Истина;
	
	ОсновнойМодуль_ПриСохраненииНастроекПлагина(Результат, ПараметрыСобытия.Идентификатор, ПараметрыСобытия.Настройки,  СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка_ПриСохраненииНастроекПлагина(Результат, ПараметрыСобытия.Идентификатор, ПараметрыСобытия.Настройки);
	КонецЕсли;
	
	Результат.Успешно = Истина;
	
КонецПроцедуры

Процедура ОбработатьКоманду_ПолучитьНастройки(ПараметрыСобытия)
	
	Результат = Новый Структура("Успешно, Данные, ОписаниеОшибки", Ложь, ,"");
	
	СтандартнаяОбработка = Истина;
	
	ОсновнойМодуль_ПриПолученииНастроекПлагина(Результат, ПараметрыСобытия.Идентификатор, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка_ПриПолученииНастроекПлагина(Результат, ПараметрыСобытия.Идентификатор);
	КонецЕсли;
	
	Результат.Успешно = Истина;
	
	ПараметрыСобытия.Результат = Результат;
	
КонецПроцедуры

Процедура ОбработатьКоманду_ОткрытьНастройкиПлагина(ПараметрыСобытия)
	
	ОбъектПлагина = Плагин_СоздатьОбъект(ПараметрыСобытия.Идентификатор);
	ОбъектПлагина.ОткрытьФормуНастроек(ПараметрыСобытия.ВызывающийМодуль);
	
КонецПроцедуры


//********************************************************
//
//		ИДЕНТИФИКАТОРЫ СЛУЖЕБНЫХ КОМАНД
//

Функция КомандаПолучитьСписокТиповых()
	Возврат "Плагины_ПолучитьСписокТиповых";
КонецФункции

Функция КомандаПолучитьСписокЗагруженных()
	Возврат "Плагины_ПолучитьСписокЗагруженных";
КонецФункции

Функция КомандаПолучитьСписокПлагинов()
	Возврат "Плагины_ПолучитьСписок";
КонецФункции

Функция КомандаПолучитьНастройки()
	Возврат "Плагин_ПолучитьНастройки";
КонецФункции

Функция КомандаСохранитьНастройки()
	Возврат "Плагин_СохранитьНастройки";
КонецФункции

Функция КомандаПроверитьНаличиеОбновлений()
	Возврат "Плагины_ПроверитьНаличиеОбновлений";
КонецФункции

Функция КомандаПроверитьВозможностьНастройки()
	Возврат "Плагины_ПроверитьВозможностьНастройки";
КонецФункции

Функция КомандаЗагрузитьПлагин()
	Возврат "Плагин_Загрузить";
КонецФункции

Функция КомандаПолучитьФайл()
	Возврат "Плагин_ПолучитьФайл";
КонецФункции

Функция КомандаВключитьПлагин()
	Возврат "Плагин_Включить";
КонецФункции

Функция КомандаОтключитьПлагин()
	Возврат "Плагин_Отключить";
КонецФункции

Функция КомандаУдалитьПлагин()
	Возврат "Плагин_Удалить";
КонецФункции

Функция КомандаЗафиксироватьОшибкуПлагина()
	Возврат "Плагин_ЗафиксироватьОшибку";
КонецФункции

Функция КомандаМетрики_ЗаписатьОшибку()
	Возврат "Метрики_ЗаписатьОшибку";
КонецФункции

Функция КомандаМетрики_ЗаписатьСтатистику()
	Возврат "Метрики_ЗаписатьСтатистику";
КонецФункции

Функция КомандаМетрики_ЗаписатьПоведение()
	Возврат "Метрики_ЗаписатьПоведение";
КонецФункции

Функция КомандаМетрики_ЗаписатьЗамер()
	Возврат "Метрики_ЗаписатьЗамер";
КонецФункции

Функция КомандаОткрытьНастройкиПлагина()
	Возврат "Плагин_ОткрытьФормуНастроек";
КонецФункции


//********************************************************
//
//		ПЕРЕЧИСЛЕНИЯ
//

Функция Перечисление_СостоянияПлагинов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Включен",				СостояниеПлагинаВключен());
	Результат.Вставить("Отключен",				СостояниеПлагинаОтключен());
	Результат.Вставить("НеИспользуется",		СостояниеПлагинаНеИспользуется());
	Результат.Вставить("ЕстьОшибки",			СостояниеПлагинаЕстьОшибки());
	Результат.Вставить("ТребуетсяНастройка",	СостояниеПлагинаТребуетсяНастройка());
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция СостояниеПлагинаВключен()
	Возврат "Включен";
КонецФункции

Функция СостояниеПлагинаОтключен()
	Возврат "Отключен";
КонецФункции

Функция СостояниеПлагинаТребуетсяНастройка()
	Возврат "Требуется настройка";
КонецФункции

Функция СостояниеПлагинаЕстьОшибки()
	Возврат "Есть ошибки";
КонецФункции

Функция СостояниеПлагинаНеИспользуется()
	Возврат "Не используется";
КонецФункции

// Добавляет ошибку плагина в массив ошибок и запись в журнал регистрации
//
// Параметры:
//  ОписаниеПлагина - Структура - см. Новый_ОписаниеПлагина();
//  ИмяСобытия - Строка - имя события;
//  ТекстОшибки - Строка - текст ошибки;
//
Процедура ЗафиксироватьОшибкуПлагина(Плагин, ИмяСобытия, ТекстОшибки) 
	
	Идентификатор = Плагин.Идентификатор;
	
	СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияПлагина(Идентификатор, ИмяСобытия);
	ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
	
КонецПроцедуры

// внутренние методы плагинов

Процедура Плагин_ОбработатьСобытие(Плагин, ИмяСобытия, ПараметрыСобытия)
	
	НастройкиПлагина = Неопределено;
	
	РезультатНастроек = ПолучитьРезультатСлужебногоСобытия("Плагин_ПолучитьНастройки", 
															Новый Структура("Идентификатор", Плагин.Идентификатор));
	
	Если РезультатНастроек.Успешно Тогда
		НастройкиПлагина = РезультатНастроек.Данные;	
	КонецЕсли;
	
	Попытка
		
		МодульПлагина = Плагин_СоздатьОбъект(Плагин.Идентификатор);
		МодульПлагина.ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, НастройкиПлагина);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ЗафиксироватьОшибкуПлагина(Плагин, ИмяСобытия, ТекстОшибки);
		
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

Функция Плагин_СоздатьОбъект(Идентификатор)
	
	Результат = Кэш_ПолучитьПлагин(Идентификатор);
	
	Если Не Результат = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ФайлПлагина = ПрочитатьФайлПлагина(Идентификатор);
	
	ИмяВнешнейОбработки = Идентификатор;
	
	ЭтоИмяФайла = ТипЗнч(ФайлПлагина) = Тип("Строка");
	
	Если ЭтоИмяФайла Или ЭтоОбычноеПриложение() Тогда
		
		Если ЭтоИмяФайла Тогда
			
			Результат = ВнешниеОбработки_Создать(ФайлПлагина);
			
		Иначе
			
			ИмяВремФайла = ПолучитьИмяВременногоФайла("epf");
			
			ФайлПлагина.Записать(ИмяВремФайла);
			
			Результат = ВнешниеОбработки_Создать(ИмяВремФайла);
			
			УдалитьФайлы(ИмяВремФайла);
			
		КонецЕсли;
		
	Иначе
		
		АдресОбработки	 = ПоместитьВоВременноеХранилище(ФайлПлагина);
		ИмяОбработки	 = ВнешниеОбработки_Подключить(АдресОбработки, ИмяВнешнейОбработки);
		Результат		 = ВнешниеОбработки.Создать(ИмяОбработки, Ложь);
		УдалитьИзВременногоХранилища(АдресОбработки);
		
	КонецЕсли;
	
	Плагин_ИнициализироватьПеременные(Результат);
	Кэш_ПоместитьПлагин(Идентификатор, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура Плагин_ИнициализироватьПеременные(ОбъектПлагина)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ОсновнойМодуль", ОсновнойМодуль);
	ЗначенияЗаполнения.Вставить("ВерсияМенеджера", ВерсияОбработки());
	ЗначенияЗаполнения.Вставить("ИспользоватьМетрики", Истина);
	ЗаполнитьЗначенияСвойств(ОбъектПлагина, ЗначенияЗаполнения);

КонецПроцедуры 

//********************************************************
//
//		КОНТРАКТЫ
//

Функция Новый_МанифестПлагина()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Представление");
	Результат.Вставить("Проект");
	Результат.Вставить("Версия");
	Результат.Вставить("Описание",			"");
	Результат.Вставить("СсылкаНаСправку",	"");
	Результат.Вставить("События",			Новый Массив);
	Результат.Вставить("ЕстьНастройки",		Ложь);
	
	Возврат Результат;
	
КонецФункции

// Описание ошибки которая возникла в плагине
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ТекстОшибки - Строка - текст ошибки;
//   * ИмяСобытия - Строка - событие связанное с ошибкой;
//   * Дата - Дата - дата возникновения ошибки;
//
Функция Новый_ОшибкаПлагина(ИмяПлагина, ИмяСобытия, ТекстОшибки)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяПлагина",	ИмяПлагина);
	Результат.Вставить("ИмяСобытия",	ИмяСобытия);
	Результат.Вставить("ТекстОшибки",	ТекстОшибки);
	Результат.Вставить("Дата",			ТекущаяДатаСеанса());
	
	Возврат Результат;
	
КонецФункции

//********************************************************
//
//		СТАНДАРТНАЯ ОБРАБОТКА СЛУЖЕБНЫХ СОБЫТИЙ
//

// Стандартная обработка получения списка установленных плагинов.
//
// Параметры:
//  Результат - Массив из Новый_КонтрактХранения() - список установленных плагинов
//
Процедура СтандартнаяОбработка_ПриПолученииСпискаЗагруженныхПлагинов(Результат)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонтурПлагин_ID",		ХранениеДанных_СвойствоОбъекта("КонтурПлагин_ID"));
	Запрос.УстановитьПараметр("КонтурПлагин_Версия",	ХранениеДанных_СвойствоОбъекта("КонтурПлагин_Версия"));
	Запрос.УстановитьПараметр("КонтурПлагин_Проект",	ХранениеДанных_СвойствоОбъекта("КонтурПлагин_Проект"));
	Запрос.УстановитьПараметр("КонтурПлагин_Состояние",	ХранениеДанных_СвойствоОбъекта("КонтурПлагин_Состояние"));
	
	Запрос.УстановитьПараметр("СостояниеПоУмолчанию", СостояниеПлагинаВключен());
	Запрос.УстановитьПараметр("ПустаяВерсия", "");
	Запрос.УстановитьПараметр("Проект", ИдентификаторПроекта());
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Если ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		
		Запрос.Текст = ТекстЗапроса_СписокДополнительныеОтчетыИОбработки();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
		
		Запрос.Текст = ТекстЗапроса_СписокВнешниеПечатныеФормы();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		Запрос.Текст = ТекстЗапроса_СписокВнешниеОбработки();
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		НовыйПлагин = Новый_КонтрактХранения();
		ЗаполнитьЗначенияСвойств(НовыйПлагин, Выборка);
		
		Результат.Добавить(НовыйПлагин);
		
	КонецЦикла;
	
КонецПроцедуры 

Функция ТекстЗапроса_СписокДополнительныеОтчетыИОбработки()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Объект КАК Объект,
	|	Т.Свойство КАК Свойство,
	|	Т.Значение КАК Значение
	|ПОМЕСТИТЬ ТабСвойств
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК Т
	|ГДЕ
	|	Т.Объект ССЫЛКА Справочник.ДополнительныеОтчетыИОбработки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникОбработок.Наименование КАК Представление,
	|	ЕСТЬNULL(ТабСвойствИдентификатор.Значение, СправочникОбработок.ИмяОбъекта) КАК Идентификатор,
	|	ЕСТЬNULL(ТабСвойствСостояние.Значение, &СостояниеПоУмолчанию) КАК Состояние,
	|	ЕСТЬNULL(ТабСвойствВерсия.Значение, &ПустаяВерсия) КАК Версия
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК СправочникОбработок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствПроект
	|		ПО (ТабСвойствПроект.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствПроект.Свойство = &КонтурПлагин_Проект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствИдентификатор
	|		ПО (ТабСвойствИдентификатор.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствИдентификатор.Свойство = &КонтурПлагин_ID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствВерсия
	|		ПО (ТабСвойствВерсия.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствВерсия.Свойство = &КонтурПлагин_Версия)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствСостояние
	|		ПО (ТабСвойствСостояние.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствСостояние.Свойство = &КонтурПлагин_Состояние)
	|ГДЕ
	|	ТабСвойствПроект.Значение = &Проект
	|	И НЕ СправочникОбработок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	
	Возврат Результат;
	
КонецФункции 

Функция ТекстЗапроса_СписокВнешниеОбработки()
	
	Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(Т.Объект КАК Справочник.ВнешниеОбработки) КАК Объект,
	|	Т.Свойство,
	|	Т.Значение
	|ПОМЕСТИТЬ ТабСвойств
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК Т
	|ГДЕ
	|	Т.Объект ССЫЛКА Справочник.ВнешниеОбработки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникОбработок.Наименование КАК Представление,
	|	ТабСвойствИдентификатор.Значение КАК Идентификатор,
	|	ЕСТЬNULL(ТабСвойствСостояние.Значение, &СостояниеПоУмолчанию) КАК Состояние,
	|	ТабСвойствВерсия.Значение КАК Версия
	|ИЗ
	|	Справочник.ВнешниеОбработки КАК СправочникОбработок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствИдентификатор
	|		ПО (ТабСвойствИдентификатор.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствИдентификатор.Свойство = &КонтурПлагин_ID)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствВерсия
	|		ПО (ТабСвойствВерсия.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствВерсия.Свойство = &КонтурПлагин_Версия)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствПроект
	|		ПО (ТабСвойствПроект.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствПроект.Свойство = &КонтурПлагин_Проект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствСостояние
	|		ПО (ТабСвойствСостояние.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствСостояние.Свойство = &КонтурПлагин_Состояние)
	|ГДЕ
	|	ТабСвойствПроект.Значение = &Проект
	|	И НЕ СправочникОбработок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	
	Возврат Результат;
	
КонецФункции 

Функция ТекстЗапроса_СписокВнешниеПечатныеФормы()
	
	Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Объект,
	|	Т.ПредставлениеОбъекта КАК Свойство,
	|	Т.ИмяОбъекта КАК Значение
	|ПОМЕСТИТЬ ТабСвойств
	|ИЗ
	|	Справочник.ВнешниеПечатныеФормы.Принадлежность КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникОбработок.Наименование КАК Представление,
	|	ТабСвойствИдентификатор.Значение КАК Идентификатор,
	|	ЕСТЬNULL(ТабСвойствСостояние.Значение, &СостояниеПоУмолчанию) КАК Состояние,
	|	ТабСвойствВерсия.Значение КАК Версия
	|ИЗ
	|	Справочник.ВнешниеПечатныеФормы КАК СправочникОбработок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствИдентификатор
	|		ПО (ТабСвойствИдентификатор.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствИдентификатор.Свойство = &КонтурПлагин_ID)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствВерсия
	|		ПО (ТабСвойствВерсия.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствВерсия.Свойство = &КонтурПлагин_Версия)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствПроект
	|		ПО (ТабСвойствПроект.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствПроект.Свойство = &КонтурПлагин_Проект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСвойств КАК ТабСвойствСостояние
	|		ПО (ТабСвойствСостояние.Объект = СправочникОбработок.Ссылка)
	|			И (ТабСвойствСостояние.Свойство = &КонтурПлагин_Состояние)
	|ГДЕ
	|	ТабСвойствПроект.Значение = &Проект
	|	И НЕ СправочникОбработок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	
	Возврат Результат;
	
КонецФункции

// Стандартная обработка выполнения HTTPЗапроса
//
// Параметры:
//  ОписаниеОтвета - Структура - (возвращаемый параметр) описание ответа (см. Новый_ОписаниеHTTPОтвета())
//  ОписаниеЗапроса - Структура - Описание запроса (см. Новый_ОписаниеHTTPЗапроса)
//
Процедура СтандартнаяОбработка_ПриВыполненииHTTPЗапроса(ОписаниеОтвета, ОписаниеЗапроса)
	
	Ошибка = "Отсутствует обработчик события (ПриВыполненииHTTPЗапроса)";
	
	СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("HTTP");
	ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, Ошибка);
	
	ВызватьИсключение Ошибка;
	
КонецПроцедуры

// Стандартная обработка загрузки файла плагина в хранилище.
//
// Параметры:
//  Файл - ДвоичныеДанные - двоичные данные плагина.
//  Описание - Структура - описание плагина (см. Новый_КонтрактХранения())
// 
Процедура СтандартнаяОбработка_ПриЗагрузкеПлагина(Файл, Описание) 
	
	НачатьТранзакцию();
	
	Попытка
		
		СохраненныйПлагин = ХранениеДанных_ЗагрузитьФайлПлагина(Файл, Описание);
		
		
		ХранениеДанных_УстановитьЗначениеСвойства(СохраненныйПлагин.Ссылка, "КонтурПлагин_ID", 		Описание.Идентификатор);
		ХранениеДанных_УстановитьЗначениеСвойства(СохраненныйПлагин.Ссылка, "КонтурПлагин_Версия",	Описание.Версия);
		ХранениеДанных_УстановитьЗначениеСвойства(СохраненныйПлагин.Ссылка, "КонтурПлагин_Проект",	ИдентификаторПроекта());
		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ПриЗагрузкеПлагина");
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СтандартнаяОбработка_ПриПроверкеВозможностиНастройки(Результат)

	Если ХранениеДанных_ВариантХраненияПлагинов() = Неопределено Тогда
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Отсутствует возможность использовать механизм плагинов в вашей базе 1С";
		
	ИначеЕсли ХранениеДанных_ЕстьПраваНаИзменениеОбъектов() = Ложь Тогда
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Недостаточно прав для настройки плагинов. 
								|Запустите модуль с правами на изменение справочника дополнительных обработок.";
		
	КонецЕсли;
		
КонецПроцедуры

Процедура СтандартнаяОбработка_ПриВключенииПлагина(Результат, Идентификатор)

	СсылкаНаПлагин = ХранениеДанных_ПлагинПоИдентификатору(Идентификатор);
	НовоеСостояние = СостояниеПлагинаВключен();
	
	Если СсылкаНаПлагин = Неопределено Тогда
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Не найден плагин с идентификатором """+Идентификатор+"""";
	Иначе
		ХранениеДанных_УстановитьЗначениеСвойства(СсылкаНаПлагин, "КонтурПлагин_Состояние", НовоеСостояние);
		Результат.Успешно = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура СтандартнаяОбработка_ПриУдаленииПлагина(Результат, Идентификатор)

	НайденныйПлагин = ХранениеДанных_ПлагинПоИдентификатору(Идентификатор);
	
	Если НЕ НайденныйПлагин = Неопределено Тогда
		
		ОбъектПлагина = НайденныйПлагин.ПолучитьОбъект();
		ОбъектПлагина.УстановитьПометкуУдаления(Истина);
		
		Если ХранениеДанных_ВариантХраненияПлагинов() = ВариантХранения_ВнешниеПечатныеФормы() Тогда
			
			ОбъектПлагина.Принадлежность.Очистить();
			ОбъектПлагина.Записать();
			
		Иначе 
			
			ХранениеДанных_УдалитьЗначениеСвойства(НайденныйПлагин, "КонтурПлагин_ID");
			ХранениеДанных_УдалитьЗначениеСвойства(НайденныйПлагин, "КонтурПлагин_Версия");
			ХранениеДанных_УдалитьЗначениеСвойства(НайденныйПлагин, "КонтурПлагин_Проект");
			ХранениеДанных_УдалитьЗначениеСвойства(НайденныйПлагин, "КонтурПлагин_Состояние");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Успешно = Истина;
	
КонецПроцедуры

Процедура СтандартнаяОбработка_ПриОтключенииПлагина(Результат, Идентификатор)

	СсылкаНаПлагин = ХранениеДанных_ПлагинПоИдентификатору(Идентификатор);
	НовоеСостояние = СостояниеПлагинаОтключен();
	
	Если СсылкаНаПлагин = Неопределено Тогда
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Не найдет плагин с идентификатором """+Идентификатор+"""";
	Иначе
		ХранениеДанных_УстановитьЗначениеСвойства(СсылкаНаПлагин, "КонтурПлагин_Состояние", НовоеСостояние);
		Результат.Успешно = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура СтандартнаяОбработка_ПриСохраненииНастроекПлагина(Результат, Идентификатор, Настройки)

	СсылкаНаПлагин = ХранениеДанных_ПлагинПоИдентификатору(Идентификатор);
	
	Если СсылкаНаПлагин = Неопределено Тогда
		// TODO: вызывать исключение
	Иначе
		
		Плагин = СсылкаНаПлагин.ПолучитьОбъект();
		
		ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
		
		Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
			
			Если Плагин.Принадлежность.Количество() = 0 Тогда
				СтрокаНастроек = Плагин.Принадлежность.Добавить();
			Иначе
				СтрокаНастроек = Плагин.Принадлежность[0];
			КонецЕсли;
			
			СтрокаНастроек.ДополнительныеПараметрыОбработки = Новый ХранилищеЗначения(Настройки);
			
		ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
			
			СтрокаНастроек = Плагин.Принадлежность.Найти("Настройки", "ПредставлениеОбъекта");
			
			Если СтрокаНастроек = Неопределено Тогда 
				
				СтрокаНастроек = Плагин.Принадлежность.Добавить();
				СтрокаНастроек.ПредставлениеОбъекта = "Настройки";
				
			КонецЕсли;
			
			СтрокаНастроек.НастройкиПостроителяОтбор = Новый ХранилищеЗначения(Настройки);
			
		ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
			
			Плагин.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
			
		КонецЕсли;
		
		//Плагин.ОбменДанными.Загрузка = Истина;
		Плагин.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Стандартная обработка чтения настроек плагина.
//
// Параметры:
//  Настройки - Произвольный - (возвращаемый параметр) настройки плагина
//  Идентификатор - Строка - идентификатор плагина
//
Процедура СтандартнаяОбработка_ПриПолученииНастроекПлагина(Результат, Идентификатор)
	
	СсылкаНаПлагин = ХранениеДанных_ПлагинПоИдентификатору(Идентификатор);
	
	Если Не ЗначениеЗаполнено(СсылкаНаПлагин) Тогда
		Возврат;
	КонецЕсли;
	
	Плагин = СсылкаНаПлагин.ПолучитьОбъект();
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		Если Плагин.Принадлежность.Количество() > 0 Тогда
			СтрокаНастроек = Плагин.Принадлежность[0];
			Результат.Данные = СтрокаНастроек.ДополнительныеПараметрыОбработки.Получить();
		КонецЕсли;
		
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
		
		СтрокаНастроек = Плагин.Принадлежность.Найти("Настройки", "ПредставлениеОбъекта");
		
		Если Не СтрокаНастроек = Неопределено Тогда 
			
			Результат.Данные = СтрокаНастроек.НастройкиПостроителяОтбор.Получить();
			
		КонецЕсли;
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		
		Результат.Данные = Плагин.ХранилищеНастроек.Получить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СтандартнаяОбработка_ПрочитатьФайлПлагина(Идентификатор, ДвоичныеДанные)
	
	ДвоичныеДанные = ХранениеДанных_ПрочитатьФайлПлагина(Идентификатор);
	
КонецПроцедуры

//********************************************************
//
//		ХРАНЕНИЕ ДАННЫХ
//

// Проверяет наличие прав на изменение объектов хранения данных
Функция ХранениеДанных_ЕстьПраваНаИзменениеОбъектов()
	
	ЕстьПраваНаИзменениеОбъектов = Кэш_Прочитать("ЕстьПраваНаИзменениеОбъектов");	
	Если НЕ ЕстьПраваНаИзменениеОбъектов = Неопределено Тогда
		Возврат ЕстьПраваНаИзменениеОбъектов;
	КонецЕсли;
	
	ЕстьПраваНаИзменениеОбъектов = Ложь;
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		Если ПравоДоступа("Изменение", Метаданные.Справочники.ВнешниеОбработки) И
			 ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ЗначенияСвойствОбъектов) И
			 ПравоДоступа("Изменение", Метаданные.ПланыВидовХарактеристик.СвойстваОбъектов) Тогда
			 
			 ЕстьПраваНаИзменениеОбъектов = Истина;
			 
		 КонецЕсли;
		 
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
		
		Если ПравоДоступа("Изменение", Метаданные.Справочники.ВнешниеПечатныеФормы) И
			 ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ЗначенияСвойствОбъектов) Тогда
			 
			 ЕстьПраваНаИзменениеОбъектов = Истина;
			 
		КонецЕсли;
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		
		Если ПравоДоступа("Изменение", Метаданные.Справочники.ДополнительныеОтчетыИОбработки) И
			 ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДополнительныеСведения) И
			 ПравоДоступа("Изменение", Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения) Тогда
			 
			 ЕстьПраваНаИзменениеОбъектов = Истина;
			 
		КонецЕсли;
		
	КонецЕсли;
	
	Кэш_Поместить("ЕстьПраваНаИзменениеОбъектов", ЕстьПраваНаИзменениеОбъектов);
	
	Возврат ЕстьПраваНаИзменениеОбъектов;
	
КонецФункции

// Определяет вариант хранения плагинов: ВнешниеОбработки ИЛИ ДополнительныеОтчетыИОбработки
Функция ХранениеДанных_ВариантХраненияПлагинов()
	
	ВариантХранения = Кэш_Прочитать("ВариантХраненияДанных");	
	Если НЕ ВариантХранения = Неопределено Тогда
		Возврат ВариантХранения;
	КонецЕсли;
			 
	Если Служебные_ЕстьНеобходимыеМетаданные("Справочники.ДополнительныеОтчетыИОбработки.Реквизиты.ХранилищеОбработки") И
		 Служебные_ЕстьНеобходимыеМетаданные("Справочники.ДополнительныеОтчетыИОбработки.Реквизиты.ХранилищеНастроек") И 
		 Служебные_ЕстьНеобходимыеМетаданные("РегистрыСведений.ДополнительныеСведения") И 
		 Служебные_ЕстьНеобходимыеМетаданные("ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения") Тогда
		
		 ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки();
		 
	ИначеЕсли Служебные_ЕстьНеобходимыеМетаданные("Справочники.ВнешниеОбработки.Реквизиты.ХранилищеВнешнейОбработки") И
		 Служебные_ЕстьНеобходимыеМетаданные("Справочники.ВнешниеОбработки.ТабличныеЧасти.Принадлежность.Реквизиты.ДополнительныеПараметрыОбработки") И 
		 Служебные_ЕстьНеобходимыеМетаданные("РегистрыСведений.ЗначенияСвойствОбъектов") И 
		 Служебные_ЕстьНеобходимыеМетаданные("ПланыВидовХарактеристик.СвойстваОбъектов") Тогда
		 
		 ВариантХранения = ВариантХранения_ВнешниеОбработки();
		 
    ИначеЕсли Служебные_ЕстьНеобходимыеМетаданные("Справочники.ВнешниеПечатныеФормы.Реквизиты.Хранилище") И
		 Служебные_ЕстьНеобходимыеМетаданные("Справочники.ВнешниеПечатныеФормы.ТабличныеЧасти.Принадлежность.Реквизиты.НастройкиПостроителяОтбор") Тогда
		 
		 ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы();
		 
	Иначе
		
		ВариантХранения = Неопределено;
		
	КонецЕсли;
		
	Кэш_Поместить("ВариантХраненияДанных", ВариантХранения);
	
	Возврат ВариантХранения;
	
КонецФункции

Функция ВариантХранения_ВнешниеОбработки()
	Возврат "ВнешниеОбработки";
КонецФункции

Функция ВариантХранения_ДополнительныеОтчетыИОбработки()
	Возврат "ДополнительныеОтчетыИОбработки";
КонецФункции

Функция ВариантХранения_ВнешниеПечатныеФормы()
	Возврат "ВнешниеПечатныеФормы";
КонецФункции

// Возвращает имя каталога справочника доп. обработок, в который будут сохраняться все плагины
Функция ХранениеДанных_ИмяКаталогаПлагинов()
	
	Возврат "Контур.Плагины";
	
КонецФункции

// Находит и создает в случае необходимости каталог в справочнике доп. обработок
Функция ХранениеДанных_КаталогПлагинов()
	
	КаталогПлагинов = Кэш_Прочитать("КаталогПлагинов");
	Если НЕ КаталогПлагинов = Неопределено Тогда
		Возврат КаталогПлагинов;
	КонецЕсли;
	
	ВариантХранения		= ХранениеДанных_ВариантХраненияПлагинов();
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		ИмяСправочникаПлагинов = "ВнешниеОбработки";
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		ИмяСправочникаПлагинов = "ДополнительныеОтчетыИОбработки";
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
		ИмяСправочникаПлагинов = "ВнешниеПечатныеФормы";
	Иначе
		// TODO: вызвать исключение
	КонецЕсли;
	
	ИмяКаталогаПлагина	= ХранениеДанных_ИмяКаталогаПлагинов();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Справочник."+ИмяСправочникаПлагинов+" КАК Т
	|ГДЕ
	|	Т.ЭтоГруппа
	|	И НЕ Т.ПометкаУдаления
	|	И Т.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ИмяКаталогаПлагина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		КаталогПлагинов = Выборка.Ссылка;
		
	Иначе
		
		НовыйКаталог = Справочники[ИмяСправочникаПлагинов].СоздатьГруппу();
		НовыйКаталог.Наименование = ИмяКаталогаПлагина;
		НовыйКаталог.ОбменДанными.Загрузка = Истина;
		НовыйКаталог.Записать();
		
		КаталогПлагинов = НовыйКаталог.Ссылка;
		
	КонецЕсли;
	
	Кэш_Поместить("КаталогПлагинов", КаталогПлагинов);
	
	Возврат КаталогПлагинов;
	
КонецФункции

// Сохраняет двоичные данные плагина в справочник доп. обработок
//
// Параметры:
//  Файл - ДвоичныеДанные - двоичные данные плагина.
//  Описание - Структура - описание плагина (см. Новый_КонтрактХранения())
// 
Функция ХранениеДанных_ЗагрузитьФайлПлагина(Файл, Описание)
	
	ВариантХранения	= ХранениеДанных_ВариантХраненияПлагинов();
	КаталогПлагинов = ХранениеДанных_КаталогПлагинов();
	
	НайденныйПлагин = ХранениеДанных_ПлагинПоИдентификатору(Описание.Идентификатор);
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		Если НайденныйПлагин = Неопределено Тогда	
			СохраненныйПлагин = Справочники.ВнешниеОбработки.СоздатьЭлемент();
		Иначе
			СохраненныйПлагин = НайденныйПлагин.ПолучитьОбъект();
		КонецЕсли;	
		
		СохраненныйПлагин.Родитель = КаталогПлагинов;
		СохраненныйПлагин.Наименование = Описание.Представление;
		СохраненныйПлагин.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма;
		СохраненныйПлагин.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Файл);
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
			
		Если НайденныйПлагин = Неопределено Тогда	
			СохраненныйПлагин = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		Иначе
			СохраненныйПлагин = НайденныйПлагин.ПолучитьОбъект();
		КонецЕсли;	
		
		// TODO: публикация - понять насколько стоит смешивать состояние и публикацию
		
		СохраненныйПлагин.Родитель				= КаталогПлагинов;
		СохраненныйПлагин.Вид                   = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка;
		СохраненныйПлагин.Наименование			= Описание.Представление;
		СохраненныйПлагин.Публикация			= Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		СохраненныйПлагин.ИмяОбъекта			= Описание.Идентификатор;
		СохраненныйПлагин.ХранилищеОбработки	= Новый ХранилищеЗначения(Файл);
		СохраненныйПлагин.Версия				= Описание.Версия;
		
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
		
		Если НайденныйПлагин = Неопределено Тогда	
			СохраненныйПлагин = Справочники.ВнешниеПечатныеФормы.СоздатьЭлемент();
		Иначе
			СохраненныйПлагин = НайденныйПлагин.ПолучитьОбъект();
		КонецЕсли;	
		
		СохраненныйПлагин.Родитель					= КаталогПлагинов;
		СохраненныйПлагин.Наименование				= Описание.Представление;
		СохраненныйПлагин.ВидОбработки				= Перечисления.ВидыВнешнихОбработок.Обработка;
		СохраненныйПлагин.Хранилище					= Новый ХранилищеЗначения(Файл);
			
	Иначе
			
		// TODO: вызвать исключение
			
	КонецЕсли;
	
	//СохраненныйПлагин.ОбменДанными.Загрузка = Истина;
	
	СохраненныйПлагин.Записать();
	
	Возврат СохраненныйПлагин.Ссылка;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон содержащий маркеры подстановки вида: "%1..%N"
//                        . Нумерация маркеров начинается с 1.
//                          N не может быть более 6.
//  Параметр<n>  - Строка - подставляемые параметры.
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
Функция СтроковыеУтилиты_ПодставитьПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено
	, Параметр6 = Неопределено) Экспорт
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	Результат = СтрЗаменить(Результат	, "%6", Параметр6);
	
	Возврат Результат;
	
КонецФункции

// Объединяет части пути через разделитель
//
Функция ФайловаяСистема_ОбъединитьПути(П1, П2, П3 = Неопределено, П4 = Неопределено)
	
	Результат = П1;
	
	РазделительПути = ФайловаяСистема_РазделительПути();
	
	ЧастиПути = Новый Массив;
	ЧастиПути.Добавить(П2);
	ЧастиПути.Добавить(П3);
	ЧастиПути.Добавить(П4);
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> РазделительПути Тогда
			Результат = Результат + РазделительПути;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает разделитель пути, используемого в операционной системе
// 
// Возвращаемое значение:
//  Строка
//
Функция ФайловаяСистема_РазделительПути()
	
	Если ВерсияПлатформыНиже("8.3.3") Тогда
		
		Результат = "/";
		
		Если ЭтоПлатформаWindows() Тогда
			Результат = "\";
		КонецЕсли;
		
	Иначе
		Результат = Вычислить("ПолучитьРазделительПути()");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ФайловаяСистема_ПроверитьСоздатьКаталог(Знач Каталог)
	
	Если ТипЗнч(Каталог) = Тип("Строка") Тогда
		Каталог = Новый Файл(Каталог);
	КонецЕсли;
	
	Если Не Каталог.Существует() Тогда 
		
		СоздатьКаталог(Каталог.ПолноеИмя);
		
	ИначеЕсли Не Каталог.ЭтоКаталог() Тогда 
		
		ОписаниеОш = СтроковыеУтилиты_ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Невозможно создать каталог ""%1"" по причине: 
				|%2'"),
			Каталог.ПолноеИмя,
			НСтр("ru = 'Имя каталога занято файлом'")
		);
		
		ВызватьИсключение ОписаниеОш;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПрочитатьФайлПлагина(Идентификатор)
	
	ДвоичныеДанные = Неопределено;
	СтандартнаяОбработка = Истина;
	
	ОсновнойМодуль_ПрочитатьФайлПлагина(Идентификатор, ДвоичныеДанные, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка_ПрочитатьФайлПлагина(Идентификатор, ДвоичныеДанные);
	КонецЕсли;
	
	Если Отладка_РежимОтладки() Тогда
		
		ФайловаяСистема_ПроверитьСоздатьКаталог(Отладка_КаталогОтладки());
		
		ФайлПуть = Отладка_ПутьКФайлуПлагина(Идентификатор);
		
		Файл = Новый Файл(ФайлПуть);
		
		Если Не Файл.Существует() Тогда
			ДвоичныеДанные.Записать(Файл.ПолноеИмя);
		КонецЕсли;
		
		Результат = Файл.ПолноеИмя;
		
	Иначе
		
		Результат = ДвоичныеДанные;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ХранениеДанных_ПрочитатьФайлПлагина(Идентификатор)
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	НайденныйПлагин = ХранениеДанных_ПлагинПоИдентификатору(Идентификатор);
	
	Если Не ЗначениеЗаполнено(НайденныйПлагин) Тогда
		
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ХранениеДанных.ПрочитатьФайлПлагина");
		ТекстОшибки = ПараметрыВСтроку("Плагин не найден (идентификатор = %1)", Идентификатор);
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		Возврат НайденныйПлагин.ХранилищеВнешнейОбработки.Получить();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
			
		Возврат НайденныйПлагин.ХранилищеОбработки.Получить();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
			
		Возврат НайденныйПлагин.Хранилище.Получить();
			
	Иначе
			
		// TODO: вызвать исключение
				
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

// Находит объект по значению свойства
//
// Параметры:
//  ИмяСвойства - Строка - наименование свойства.
//  Значение - Строка - значение свойства
// 
Функция ХранениеДанных_НайтиОбъектПоЗначениюСвойства(ИмяСвойства, Значение)
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Запрос = Новый Запрос;
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		Запрос.Текст = ТекстЗапроса_КаталогВнешниеОбработки();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		
		Запрос.Текст = ТекстЗапроса_КаталогДополнительныеОтчетыиОбработки();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
		
		Запрос.Текст = ТекстЗапроса_КаталогВнешниеПечатныеформы();
		
	Иначе
		// TODO: вызвать исключение
	КонецЕсли;
	
	Свойство = ХранениеДанных_СвойствоОбъекта(ИмяСвойства);
	
	Запрос.УстановитьПараметр("Свойство",		Свойство);
	Запрос.УстановитьПараметр("Значение",		Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Объект;
		
	КонецЕсли;
	
КонецФункции 

Функция ТекстЗапроса_КаталогДополнительныеОтчетыиОбработки()
	
	Результат = "ВЫБРАТЬ
	|	Т.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК Т
	|ГДЕ
	|	Т.Свойство = &Свойство
	|	И Т.Значение = &Значение";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КаталогВнешниеОбработки()
	
	Результат = "ВЫБРАТЬ
	|	Т.Объект
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК Т
	|ГДЕ
	|	Т.Свойство = &Свойство
	|	И Т.Значение = &Значение";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КаталогВнешниеПечатныеформы()
	
	Результат = "ВЫБРАТЬ
	|	Т.Ссылка Как Объект
	|ИЗ
	|	Справочник.ВнешниеПечатныеФормы.Принадлежность КАК Т
	|ГДЕ
	|	Т.ПредставлениеОбъекта = &Свойство
	|	И Т.ИмяОбъекта = &Значение";
	
	Возврат Результат;
	
КонецФункции

// Находит или создает свойство объекта в плане видов характеристик типовых объектов
//
// Параметры:
//  ИмяСвойства - Строка - наименование свойства.
//
// ВозвращаемоеЗначение: ссылка на элемент плана видов характеристик нужного свойства
// 
Функция ХранениеДанных_СвойствоОбъекта(ИмяСвойства) 
	
	Свойство = Кэш_Прочитать("Свойство_"+ИмяСвойства);	
	Если НЕ Свойство = Неопределено Тогда
		Возврат Свойство;
	КонецЕсли;
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		ИмяПВХ = "СвойстваОбъектов";
		Свойство = ХранениеДанных_НайтиСоздатьСвойство(ИмяПВХ, ИмяСвойства, ВариантХранения);
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		
		ИмяПВХ = "ДополнительныеРеквизитыИСведения"; 
		Свойство = ХранениеДанных_НайтиСоздатьСвойство(ИмяПВХ, ИмяСвойства, ВариантХранения);
		
	ИначеЕсли ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда 
		
		Свойство = ИмяСвойства;
		
	Иначе
		
		// TODO: вызвать исключение
		
	КонецЕсли;
	
	Кэш_Поместить("Свойство_"+ИмяСвойства, Свойство);
	
	Возврат Свойство;
	
КонецФункции 

Функция ХранениеДанных_НайтиСоздатьСвойство(ИмяПВХ, ИмяСвойства, ВариантХранения)
	
	Свойство = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Т.Ссылка
					|ИЗ
					|	ПланВидовХарактеристик."+ИмяПВХ+" КАК Т
					|ГДЕ
					|	Т.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование",ИмяСвойства);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Свойство = Выборка.Ссылка;
		
	Иначе
		
		Свойство = ХранениеДанных_СоздатьСвойство(ИмяСвойства, ВариантХранения);
		
	КонецЕсли; 
	
	Возврат Свойство;
	
КонецФункции   

Функция ХранениеДанных_СоздатьСвойство(ИмяСвойства, ВариантХранения)
	
	Результат = Неопределено;
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		НовоеСвойство 						= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		НовоеСвойство.НазначениеСвойства	= ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочники;
	Иначе
		НовоеСвойство 						= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Имя"						, ИмяСвойства);
	СтруктураРеквизитов.Вставить("Заголовок"				, ИмяСвойства);
	СтруктураРеквизитов.Вставить("Наименование"				, ИмяСвойства);
	СтруктураРеквизитов.Вставить("ИдентификаторДляФормул"	, ИмяСвойства);
	СтруктураРеквизитов.Вставить("ТипЗначения"				, Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	
	ЗаполнитьЗначенияСвойств(НовоеСвойство, СтруктураРеквизитов); 
	
	НовоеСвойство.ОбменДанными.Загрузка = Истина;
	НовоеСвойство.Записать();
	
	Результат = НовоеСвойство.Ссылка;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает значение свойства объекта
//
// Параметры:
//  Объект - Ссылка - ссылка на объект
//  ИмяСвойства - Строка - наименование свойства
//  Значение - Строка - значение свойства
// 
Процедура ХранениеДанных_УстановитьЗначениеСвойства(Объект, ИмяСвойства, Значение) 
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Свойство = ХранениеДанных_СвойствоОбъекта(ИмяСвойства);
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		НоваяЗапись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		
		НоваяЗапись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		
	Иначе
		// TODO: вызвать исключение
	КонецЕсли; 
	
	Если ВариантХранения = ВариантХранения_ВнешниеПечатныеФормы() Тогда
		
		ОбъектПлагина = Объект.ПолучитьОбъект();
		
		МенеджерНастроек = ОбъектПлагина.Принадлежность;
		
		СтрокаПринадлежности = МенеджерНастроек.Найти(ИмяСвойства, "ПредставлениеОбъекта");
		
		Если СтрокаПринадлежности = Неопределено Тогда 
			
			СтрокаПринадлежности = МенеджерНастроек.Добавить();

		КонецЕсли;
		
		СтрокаПринадлежности.ПредставлениеОбъекта = ИмяСвойства;
		СтрокаПринадлежности.ИмяОбъекта = Значение;
		
		ОбъектПлагина.Записать();
		
	Иначе
		
		НоваяЗапись.Объект		= Объект.Ссылка;
		НоваяЗапись.Свойство	= Свойство;
		НоваяЗапись.Значение	= Значение;
		
		НоваяЗапись.Записать();  
		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет значение свойства объекта
//
// Параметры:
//  Объект - Ссылка - ссылка на объект
//  ИмяСвойства - Строка - наименование свойства
// 
Процедура ХранениеДанных_УдалитьЗначениеСвойства(Объект, ИмяСвойства)
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Свойство = ХранениеДанных_СвойствоОбъекта(ИмяСвойства);
	
	ВариантХранения = ХранениеДанных_ВариантХраненияПлагинов();
	
	Если ВариантХранения = ВариантХранения_ВнешниеОбработки() Тогда
		
		НоваяЗапись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		
	ИначеЕсли ВариантХранения = ВариантХранения_ДополнительныеОтчетыИОбработки() Тогда
		
		НоваяЗапись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		
	Иначе
		// TODO: вызвать исключение
	КонецЕсли;
	
	НоваяЗапись.Объект		= Объект.Ссылка;
	НоваяЗапись.Свойство	= Свойство;
	
	НоваяЗапись.Прочитать();
	НоваяЗапись.Удалить();
	
КонецПроцедуры

Функция ХранениеДанных_ПлагинПоИдентификатору(Идентификатор)
	
	ИмяСвойства = "КонтурПлагин_ID";
	Результат = ХранениеДанных_НайтиОбъектПоЗначениюСвойства(ИмяСвойства, Идентификатор);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ХранениеДанных.ПлагинПоИдентификатору");
		ТекстОшибки = ПараметрыВСтроку("Плагин не найден (идентификатор = %1)", Идентификатор);
		ЖурналРегистрации_ЗаписатьПредупреждение(СобытиеЖР, ТекстОшибки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//********************************************************
//
//		ПЕРЕОПРЕДЕЛЕНИЕ СЛУЖЕБНЫХ СОБЫТИЙ В ОСНОВНОМ МОДУЛЕ
//

Процедура ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка)
	
	Попытка
		
		ОсновнойМодуль.КонтурПлагины_ОбработатьСлужебноеСобытие(
			ИмяСобытия,
			ПараметрыСобытия,
			СтандартнаяОбработка
		);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияПродукта(ИмяСобытия);
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Обработка записи плагина в хранилище текущей информационной базы.
// В свойство "ПараметрыСобытия.Описание" будем помещать Контракт_СведенияОПлагине.
//
// Параметры:
//  Файл - ДвоичныеДанные - двоичные данные плагина.
//  Описание - Структура - описание плагина (см. Новый_КонтрактХранения())
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку события.
//
Процедура ОсновнойМодуль_ПриЗагрузкеПлагина(Файл, Описание, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриЗагрузкеПлагина";
	
	Включен = Описание.Состояние = СостояниеПлагинаВключен();
	
	СведенияОПлагине = Новый_СведенияОПлагине(
		Описание.Идентификатор,
		Описание.Версия,
		Включен,
		Описание.Представление
	);
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Файл", Файл);
	ПараметрыСобытия.Вставить("Описание", СведенияОПлагине);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриПроверкеВозможностиНастройки(Результат, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриПроверкеВозможностиНастройки";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат",	Результат);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриПолученииМетрики(ПараметрыМетрики, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриПолученииМетрики";
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыМетрики, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриВключенииПлагина(Результат, Идентификатор, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриВключенииПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Идентификатор",	Идентификатор);
	ПараметрыСобытия.Вставить("Результат", 		Результат);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриОтключенииПлагина(Результат, Идентификатор, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриОтключенииПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Идентификатор",	Идентификатор);
	ПараметрыСобытия.Вставить("Результат", 		Результат);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриУдаленииПлагина(Результат, Идентификатор, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриУдаленииПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Идентификатор",	Идентификатор);
	ПараметрыСобытия.Вставить("Результат", 		Результат);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриСохраненииНастроекПлагина(Результат, Идентификатор, Настройки, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриСохраненииНастроекПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Идентификатор",	Идентификатор);
	ПараметрыСобытия.Вставить("Настройки",		Настройки);
	ПараметрыСобытия.Вставить("Результат", 		Результат);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриПолученииНастроекПлагина(Результат, Идентификатор, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриПолученииНастроекПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Идентификатор",	Идентификатор);
	ПараметрыСобытия.Вставить("Результат", 		Результат);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриПолученииСпискаЗагруженныхПлагинов(КоллекцияПлагинов, СтандартнаяОбработка)

	ИмяСобытия = "ПриПолученииСпискаЗагруженныхПлагинов";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат", Новый Массив);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
	Для Каждого СведенияОПлагине Из ПараметрыСобытия.Результат Цикл
		
		СостояниеПлагина = СостояниеПлагинаОтключен();
		Если СведенияОПлагине.Включен Тогда
			СостояниеПлагина = СостояниеПлагинаВключен();
		КонецЕсли;
		
		Описание = Новый_КонтрактХранения();
		Описание.Состояние = СостояниеПлагина;
		ЗаполнитьЗначенияСвойств(Описание, СведенияОПлагине);
		
		КоллекцияПлагинов.Добавить(Описание);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриПолученииСпискаНеиспользуемыхПлагинов(КоллекцияПлагинов, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриПолученииСпискаНеиспользуемыхПлагинов";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат", КоллекцияПлагинов);
	
	// Ожидаем массив идентификаторов неиспользуемых плагинов
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриСозданииОбъектаПлагина(ПлагинОбъект, ОписаниеПлагина, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриСозданииОбъектаПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат", ПлагинОбъект);
	ПараметрыСобытия.Вставить("Плагин", ОписаниеПлагина);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработка получения идентификатора проекта.
//
// Параметры:
//  Идентификатор - Строка - (возвращаемый парметр) идентификатор проекта
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку события.
//
Процедура ОсновнойМодуль_ПриПолученииИдентификатораПроекта(Идентификатор, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриПолученииИдентификатораПроекта";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат", Идентификатор);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
	Идентификатор = ПараметрыСобытия.Результат;
	
КонецПроцедуры

// Выполняет http запрос через основной модуль и заполняет описание ответа
//
// Параметры:
//  ОписаниеЗапроса - Структура - см. Новый_ОписаниеHTTPЗапроса();
//  ОписаниеОтвета - Структура - см. Новый_ОписаниеHTTPОтвета();
//  СтандартнаяОбработка - Булево - Ложь, если требуется отключить стандартную обработку события.
//
Процедура ОсновнойМодуль_ПриВыполненииHTTPЗапроса(ОписаниеОтвета, ОписаниеЗапроса, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриВыполненииHTTPЗапроса";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("ОписаниеЗапроса", ОписаниеЗапроса);
	ПараметрыСобытия.Вставить("ОписаниеОтвета", ОписаниеОтвета);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
	ОписаниеОтвета = ПараметрыСобытия.ОписаниеОтвета;
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриЗаписиНастроекПлагина(Настройки, Плагин, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриЗаписиНастроекПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Настройки", Настройки);
	ПараметрыСобытия.Вставить("Плагин", Плагин);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПриЧтенииНастроекПлагина(Настройки, Идентификатор, СтандартнаяОбработка)
	
	ИмяСобытия = "ПриЧтенииНастроекПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Настройки", Настройки);
	ПараметрыСобытия.Вставить("ИдентификаторПлагина", Идентификатор);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновнойМодуль_ПрочитатьФайлПлагина(Идентификатор, ДвоичныеДанные, СтандартнаяОбработка)
	
	ИмяСобытия = "ПрочитатьФайлПлагина";
	
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия.Вставить("Результат", Неопределено);
	ПараметрыСобытия.Вставить("Идентификатор", Идентификатор);
	
	ОсновнойМодуль_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
	ДвоичныеДанные = ПараметрыСобытия.Результат;
	
КонецПроцедуры

// Получает имя проекта основного модуля.
//
// Возвращаемое значение:
//  Строка.
//
Функция ИдентификаторПроекта()
	
	Результат = "";
	СтандартнаяОбработка = Истина;
	
	ОсновнойМодуль_ПриПолученииИдентификатораПроекта(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		Ошибка = "Отсутствует обработчик события (ПриПолученииИдентификатораПроекта)";
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ОпределитьИдентификаторПроекта");
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, Ошибка);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//********************************************************
//
//		ВНЕШНИЕ ОБРАБОТКИ
//

// Создает внешнюю обработку из файла.
//
// Параметры:
//  ИмяФайла - Строка - полное имя файла с учетом пути.
//
// Возвращаемое значение:
//   ОбработкаОбъект - объект созданной внешней обработки.
//
Функция ВнешниеОбработки_Создать(ИмяФайла)
	
	БезопасныйРежим			 = Ложь;
	ЗащитаОтОпасныхДействий	 = ОписаниеЗащитыБезПредупреждений();
	
	Если ВерсияПлатформыНиже("8.2") Тогда
		
		Результат = ВнешниеОбработки.Создать(ИмяФайла);
		
	ИначеЕсли ВерсияПлатформыНиже("8.3.11") Или ЗащитаОтОпасныхДействий = Неопределено Тогда
		
		Результат = ВнешниеОбработки.Создать(ИмяФайла, БезопасныйРежим);
		
	Иначе
		
		Результат = ВнешниеОбработки.Создать(ИмяФайла, БезопасныйРежим, ЗащитаОтОпасныхДействий);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подключает внешнюю обработку по адресу во временном хранилище
// или навигационной ссылке.
//
// Параметры:
//  АдресОбработки - Строка - адрес двоичных данных обработки во временном хранилище.
//
// Возвращаемое значение:
//   Строка - имя подключенной внешней обработки.
//
Функция ВнешниеОбработки_Подключить(АдресОбработки, ИмяВнешнейОбработки = Неопределено)
	
	БезопасныйРежим			 = Ложь;
	ЗащитаОтОпасныхДействий	 = ОписаниеЗащитыБезПредупреждений();
	
	Если ЗащитаОтОпасныхДействий = Неопределено Тогда
		
		Результат = ВнешниеОбработки.Подключить(АдресОбработки, ИмяВнешнейОбработки, БезопасныйРежим);
		
	Иначе
		
		Результат = ВнешниеОбработки.Подключить(АдресОбработки, ИмяВнешнейОбработки, БезопасныйРежим, ЗащитаОтОпасныхДействий);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//********************************************************
//
//		СЕРВИС
//

Функция Сервис_СписокПлагинов(ИмяПроекта)
	
	ИмяМетода = "PluginsList";
	
	ОписаниеМетода	= ОписаниеМетодаАПИ(ИмяПроекта, ИмяМетода);
	
	ОписаниеЗапроса = ОписаниеЗапросаПоОписаниюМетода(ОписаниеМетода);
	ОписаниеЗапроса.Параметры.Вставить("projectName", ИмяПроекта);
	ОписаниеЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ОписаниеОтвета = ВыполнитьHTTPЗапрос(ОписаниеЗапроса);
	
	ОбработатьОшибкуHTTP(ОписаниеОтвета, ОписаниеЗапроса);
	
	Результат = СтрокаИзДвоичныхДанных(ОписаниеОтвета.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция Сервис_СписокПлагиновXSLT(ИмяПроекта)
	
	ИмяМетода = "PluginsListXSLT";
	
	ОписаниеМетода	= ОписаниеМетодаАПИ(ИмяПроекта, ИмяМетода);
	
	ОписаниеЗапроса = ОписаниеЗапросаПоОписаниюМетода(ОписаниеМетода);
	ОписаниеЗапроса.Параметры.Вставить("projectName", ИмяПроекта);
    ОписаниеЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ОписаниеОтвета = ВыполнитьHTTPЗапрос(ОписаниеЗапроса);
	
	ОбработатьОшибкуHTTP(ОписаниеОтвета, ОписаниеЗапроса);
	
    Результат = СтрокаИзДвоичныхДанных(ОписаниеОтвета.ТелоОтвета);	
	
	Возврат Результат;
	
КонецФункции

Функция Сервис_ФайлПлагина(ИмяПроекта, ИмяПлагина)
	
	ИмяМетода = "Plugin";
	
	ОписаниеМетода	= ОписаниеМетодаАПИ(ИмяПроекта, ИмяМетода);
	
	ОписаниеЗапроса = ОписаниеЗапросаПоОписаниюМетода(ОписаниеМетода);
	ОписаниеЗапроса.Параметры.Вставить("projectName", ИмяПроекта);
	ОписаниеЗапроса.Параметры.Вставить("pluginName", ИмяПлагина + ".epf");
	ОписаниеЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ОписаниеОтвета = ВыполнитьHTTPЗапрос(ОписаниеЗапроса);
	
	ОбработатьОшибкуHTTP(ОписаниеОтвета, ОписаниеЗапроса);
	
	Возврат ОписаниеОтвета.ТелоОтвета;
	
КонецФункции

// Описание методов АПИ

// Получает описание всех доступных методов АПИ в проекте
// 
// Возвращаемое значение:
//  Структура:
//   * Ключ - Строка - имя проекта
//   * Значение - Массив из Структура - см. item в https://edi.kontur.ru/1c/Plugins/Demo/Settings/API/methods.json
//
Функция ДоступныеМетодыАПИ(ИмяПроекта)
	
	КлючКэш = "ДоступныеМетоды_" + ИмяПроекта;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписаниеМетодов = ОписаниеМетодовИзСервиса(ИмяПроекта);
	
	Результат = ОписаниеМетодов.item;
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание метода апи в проекте
//
// Параметры:
//  ИмяПроекта - Строка - имя проекта;
//  ИмяМетода - Строка - имя метода апи;
// 
// Возвращаемое значение:
//  Структура - см. Значение из ДоступныеМетодыАПИ();
//
Функция ОписаниеМетодаАПИ(ИмяПроекта, ИмяМетода)
	
	Результат = Неопределено;
	
	ДоступныеМетоды = ДоступныеМетодыАПИ(ИмяПроекта);
	Для каждого ОписаниеМетода Из ДоступныеМетоды Цикл
		Если НРег(ОписаниеМетода.name) = НРег(ИмяМетода) Тогда
			Результат = ОписаниеМетода;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = Неопределено Тогда
		
		ТекстОшибки = НСтр("ru = 'Не найдено описание метода апи: %1'");
		ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ИмяМетода);
		
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("API");
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает из сервиса описание доступных методов из methods.json
//
// Параметры:
//  ИмяПроекта - Строка - имя проекта
// 
// Возвращаемое значение:
//  Строка - 
//
Функция ОписаниеМетодовИзСервиса(ИмяПроекта)
	
	ИмяСервера = "edi.kontur.ru";
	ПутьНаСервере = "/1c/Plugins/{{projectName}}/Settings/API/methods.json";
	
	ОписаниеЗапроса = Новый_ОписаниеHTTPЗапроса();
	ОписаниеЗапроса.ИмяСервера = ИмяСервера;
	ОписаниеЗапроса.ПутьНаСервере = ПутьНаСервере;
	ОписаниеЗапроса.Параметры.Вставить("projectName", ИмяПроекта);
	
	ОписаниеОтвета = ВыполнитьHTTPЗапрос(ОписаниеЗапроса);
	
	ОбработатьОшибкуHTTP(ОписаниеОтвета, ОписаниеЗапроса);
	
	Результат = ЗначениеИзСтрокиJSON(ОписаниеОтвета.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Заполняет описание запроса по описанию метода из сервиса
//
// Параметры:
//  ОписаниеМетода - Структура - см. ОписаниеМетодаАПИ()
// 
// Возвращаемое значение:
//  Структура - см. Новый_ОписаниеHTTPЗапроса()
//
Функция ОписаниеЗапросаПоОписаниюМетода(ОписаниеМетода)
	
	Результат = Новый_ОписаниеHTTPЗапроса();
	Результат.Метод = ОписаниеМетода.request.method;
	
	Для каждого Элемент Из ОписаниеМетода.request.header Цикл
		Результат.Заголовки.Вставить(Элемент.key, Элемент.value);
	КонецЦикла;
	
	СтруктураURI = СтруктураURI(ОписаниеМетода.request.url.raw);
	
	ЗаполнитьЗначенияСвойств(Результат, СтруктураURI);
	
	Возврат Результат;
	
КонецФункции

//********************************************************
//
//		HTTP
//

// Выполняет http запрос через основной модуль и заполняет описание ответа
//
// Параметры:
//  ОписаниеЗапроса - Структура - см. Новый_ОписаниеHTTPЗапроса();
// 
// Возвращаемое значение:
//  Структура - см. Новый_ОписаниеHTTPОтвета()
//
Функция ВыполнитьHTTPЗапрос(ОписаниеЗапроса)
	
	ПутьНаСервере = ЗаполнитьПутьНаСервереПараметрамиАдреса(ОписаниеЗапроса.ПутьНаСервере, ОписаниеЗапроса.Параметры);
	
	Если Лев(ПутьНаСервере, 1) <> "/" Тогда
		ПутьНаСервере = "/" + ПутьНаСервере;  // для работы транспорта xmlhttp на платформе 8.2
	КонецЕсли;
	
	ОписаниеЗапроса.ПутьНаСервере = ПутьНаСервере;
	
	Результат = Новый_ОписаниеHTTPОтвета();
	СтандартнаяОбработка = Истина;
	ОсновнойМодуль_ПриВыполненииHTTPЗапроса(Результат, ОписаниеЗапроса, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		СтандартнаяОбработка_ПриВыполненииHTTPЗапроса(Результат, ОписаниеЗапроса);
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

// Проверяет на ошибки HTTP ответ
//
// Параметры:
//  ОписаниеОтвета - Структура - см. Новый_ОписаниеHTTPОтвета();
//  ОписаниеЗапроса - Структура - см. Новый_ОписаниеHTTPЗапроса();
//
Процедура ОбработатьОшибкуHTTP(ОписаниеОтвета, ОписаниеЗапроса)
	
	Если ОписаниеОтвета.КодОтвета = 200 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОписаниеОтвета.ТелоОтвета) = Тип("ДвоичныеДанные") Тогда
		ТекстОтвета = СтрокаИзДвоичныхДанных(ОписаниеОтвета.ТелоОтвета);
	Иначе
		ТекстОтвета = ОписаниеОтвета.ТелоОтвета;
	КонецЕсли;
	
	СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("HTTP");
	
	ТекстОшибки = НСтр(
	"ru = 'Метод: %1
	|Имя сервера: %2
	|Путь на сервере: %3
	|Код ответа: %4
	|%5'");
	
	ТекстОшибки = ПараметрыВСтроку(
		ТекстОшибки,
		ОписаниеЗапроса.Метод,
		ОписаниеЗапроса.ИмяСервера,
		ОписаниеЗапроса.ПутьНаСервере,
		ОписаниеОтвета.КодОтвета,
		ТекстОтвета
	);
	
	ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
	
	ТекстСообщения = "Недопустимый код ответа HTTP-запрос!";
	ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОшибки;
	
	ВызватьИсключение ТекстСообщения;
	
КонецПроцедуры

// Заполняет путь на сервере параметрами запроса в строке адреса
//
// Параметры:
//  ПутьНаСервере - Строка - путь метода на сервере;
//  ПараметрыЗапроса - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаполнитьПутьНаСервереПараметрамиАдреса(ПутьНаСервере, ПараметрыЗапроса = Неопределено)
	
	Если Не ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Возврат ПутьНаСервере;
	КонецЕсли;
	
	Результат = ПутьНаСервере;
	Результат = СтрЗаменить(Результат, "{{", "{");
	Результат = СтрЗаменить(Результат, "}}", "}");
	ПараметрыАдреса = Новый Массив;
	
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Ключ = Параметр.Ключ;
		Значение = Параметр.Значение;
		ПараметрАдреса = ПараметрыВСтроку("{%1}", Ключ);
		Если Найти(Результат, ПараметрАдреса) > 0 Тогда
			Результат = СтрЗаменить(Результат, ПараметрАдреса, Значение);
			ПараметрыАдреса.Добавить(Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяПараметра Из ПараметрыАдреса Цикл
		ПараметрыЗапроса.Удалить(ИмяПараметра);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Содержит необходимые параметры для http запроса
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * Метод - Строка - метод запроса (по умолчанию 'GET')
//   * ПутьНаСервере - Строка - конечный адрес запроса (без указания сервера)
//   * Заголовки - Соответствие - заголовки запроса
//   * Параметры - Соответствие - параметры запроса
//   * ТелоОтветаКакДвоичныеДанные - Булево - Истина, если необходимо получить тело ответа в виде двоичных данных
//   * ТелоЗапроса - Строка, ДвоичныеДанные - тело запроса
//   * Таймаут - Число - таймаут ожидания (по умолчанию 20 секунд)
//
Функция Новый_ОписаниеHTTPЗапроса()
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", "https");
	Результат.Вставить("ИмяСервера", "");
	Результат.Вставить("Метод", "GET");
	Результат.Вставить("ПутьНаСервере", "");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Параметры", Новый Структура);
	Результат.Вставить("ТелоОтветаКакДвоичныеДанные", Ложь);
	Результат.Вставить("ТелоЗапроса", Неопределено);
	Результат.Вставить("Таймаут", 20);
	
	Возврат Результат;
	
КонецФункции

// Содержит описание http ответа
// 
// Возвращаемое значение:
//  Структура:
//   * КодОтвета - Число - код http ответа;
//   * Заголовки - Соответствие - заголовки http ответа;
//   * ТелоОтвета - Строка, ДвоичныеДанные - зависит от ТелоОтветаКакДвоичныеДанные (см. Новый_ОписаниеHTTPЗапроса)
//
Функция Новый_ОписаниеHTTPОтвета()
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета");
	Результат.Вставить("ТелоОтвета");
	Результат.Вставить("Заголовки", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

//********************************************************
//
//		JSON
//

// Считывает данные из строки json
//
// Параметры:
//  Строка                 - Строка - строка json, которую нужно прочитать;
//  ПрочитатьВСоответствие - Булево - Истина, если json нужно прочитать в соответствие;
// 
// Возвращаемое значение:
//  Массив       - если текст json начинается с массива;
//  Структура    - если текст json начинается с пары ключ-значение;
//  Соответствие - если текст json начинается с пары ключ-значение и ПрочитатьВСоответствие = Истина;
//
Функция ЗначениеИзСтрокиJSON(Строка, ПрочитатьВСоответствие = Ложь)
	
	Если ВерсияПлатформыНиже("8.3.6") Тогда
		Результат = Парсер_ПрочитатьJSON(Строка);
	Иначе
		Результат = ПарсерJSON_Прочитать(Строка, ПрочитатьВСоответствие);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Чтение и запись JSON средствами платформы

Функция ПарсерJSON_Прочитать(Строка, ПрочитатьВСоответствие = Ложь)
	
	Чтение = Новый("ЧтениеJSON");
	Чтение.УстановитьСтроку(Строка);
	
	Попытка
		
		Результат = Вычислить("ПрочитатьJSON(Чтение, ПрочитатьВСоответствие)");
		ЧерезВременныйФайл = Ложь;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЧерезВременныйФайл = Истина;
		
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ПрочитатьJSON");
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		
	КонецПопытки;
	
	Чтение.Закрыть();
	
	Если ЧерезВременныйФайл Тогда
		
		ИмяВремФайла = ПолучитьИмяВременногоФайла();
		ТД = Новый ТекстовыйДокумент;
		ТД.УстановитьТекст(Строка);
		ТД.Записать(ИмяВремФайла);
		ТД = Неопределено;
		Чтение = Новый("ЧтениеJSON");
		Чтение.ОткрытьФайл(ИмяВремФайла);
		
		Попытка
			Результат = Вычислить("ПрочитатьJSON(Чтение, ПрочитатьВСоответствие)");
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ПрочитатьJSON");
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
			
		КонецПопытки;
		
		Чтение.Закрыть();
		
		УдалитьФайлы(ИмяВремФайла);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Чтение JSON на 8.2

Функция Парсер_ПрочитатьJSON(Знач Строка)
	
	// Выполним замену экранируемых символов.
	Замены = Новый Массив;
	Замены.Добавить(Новый Структура("До, ИД, После", "\\"	, "71769bf9-6d91-4bc6-9dbf-362c8fd37354", "\"));
	Замены.Добавить(Новый Структура("До, ИД, После", "\"""	, "ec0cd866-326b-497f-9612-9041e977653d", """"""));
	
	ВыполнитьЗаменыДоОбработки(Строка, Замены);
	
	// Нарежем строку на куски, так она будет быстрее обрабатываться
	СимволыДляПереноса = "{}[]:,";
	Для Сч=1 По СтрДлина(СимволыДляПереноса) Цикл
		ТекСимвол = Сред(СимволыДляПереноса, Сч, 1);
		Строка = СтрЗаменить(Строка, ТекСимвол, Символы.ПС + ТекСимвол + Символы.ПС);
	КонецЦикла;
	
	// Преобразуем строку в Массив строк, так обрабатывается гораздо быстрее
	МассивСтрок = ТекстВМассивСтрок(Строка);
	НомерТекущейСтроки = 1;
	
	// Распарсим
	Результат = ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки);
	
	// Вернем на место экранированные символы.
	ТекстСЗаменами = ЗначениеВСтрокуВнутр(Результат);
	ВыполнитьЗаменыПослеОбработки(ТекстСЗаменами, Замены);
	
	Результат = ЗначениеИзСтрокиВнутр(ТекстСЗаменами);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьЗаменыДоОбработки(Строка, Замены)
	
	Для Каждого Элемент Из Замены Цикл
		Строка = СтрЗаменить(Строка, Элемент.До, Элемент.ИД);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаменыПослеОбработки(Строка, Замены)
	
	Для Каждого Элемент Из Замены Цикл
		Строка = СтрЗаменить(Строка, Элемент.ИД, Элемент.После);
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки)
	
	ВсегоСтрок = МассивСтрок.Количество();
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		ТекСтрока = МассивСтрок[НомерТекущейСтроки];
	
		Если ПустаяСтрока(ТекСтрока) Тогда
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			Продолжить;
			
		ИначеЕсли СтрДлина(ТекСтрока) = 1 Тогда
			
			Если ТекСтрока = "{" Тогда
				
				// Начинается новая структура.
				Результат = ОбработатьНовуюСтруктуру(МассивСтрок, НомерТекущейСтроки);
				Возврат Результат;
				
			ИначеЕсли ТекСтрока = "[" Тогда
				
				// Начинается новый массив.
				Результат = ОбработатьНовыйМассив(МассивСтрок, НомерТекущейСтроки);
				Возврат Результат;
				
			ИначеЕсли ТекСтрока = "," или ТекСтрока = ":" Тогда
			//	или ТекСтрока="""" Тогда
				
				// пустота, идем дальше
				
			Иначе// Таки значение
				
				Результат = ОбработатьКонечноеЗначение(МассивСтрок, НомерТекущейСтроки);
				Возврат Результат;
				
				
			КонецЕсли;
			
				
		ИначеЕсли СокрЛП(ТекСтрока = "") Тогда
			
				// Пустота, идем дальше
				
		Иначе
			
			// Мы попадаем на конечное значение. Оно может быть в кавычках или без
			Результат = ОбработатьКонечноеЗначение(МассивСтрок, НомерТекущейСтроки);
			Возврат Результат;
			
		КонецЕсли;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
	КонецЦикла;
	
КонецФункции

Функция ОбработатьКонечноеЗначение(МассивСтрок, НомерТекущейСтроки)
	
	// В этой строке может быть: одна кавычка, две, ноль
	НачальнаяСтрока = СокрЛП(МассивСтрок[НомерТекущейСтроки]);
	КавычкаОткрыта = (Лев(НачальнаяСтрока, 1) = """");
	КавычкаЗакрыта = (Прав(НачальнаяСтрока, 1) = """") И СтрДлина(НачальнаяСтрока) > 1;
	ЧислоКавычек = 0;
	
	Если КавычкаОткрыта И КавычкаЗакрыта Тогда
		
		Результат = НачальнаяСтрока;
		Результат = СтрЗаменить(Результат, """", "");
		
	ИначеЕсли Не КавычкаЗакрыта И не КавычкаОткрыта Тогда
		
		// Тут еще будут преобразования: булево, числа, даты
		Результат = НачальнаяСтрока;
		
		Если Результат = "true" Тогда
			Возврат Истина;
		ИначеЕсли Результат = "false" Тогда
			Возврат Ложь;
		ИначеЕсли ВСтрокеТолькоЦифры(Результат) Тогда
			Возврат Число(Результат);
		КонецЕсли;
		
		Возврат Результат;
		
	Иначе// Многострочное значение, склеим
		//и оно началось с кавычки
		
		Результат	 = НачальнаяСтрока;
		ВсегоСтрок	 = МассивСтрок.Количество();
		
		Пока НомерТекущейСтроки < ВсегоСтрок Цикл
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
			ТекСтрока = МассивСтрок[НомерТекущейСтроки];
			
			Результат = Результат + ТекСтрока;
			
			Если Найти(ТекСтрока, """") > 0 Тогда 
				Результат = СокрЛП(Сред(Результат, 2, СтрДлина(Результат) - 2));// уберем левую и правую кавычку
				Возврат Результат;// Вернемся тогда, когда значение кончится, т.е. встретится кавычка (мы ведь все экранированные кавычки поменяли на гуиды)
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьНовуюСтруктуру(МассивСтрок, НомерТекущейСтроки)
	
	Результат	 = Новый Структура;
	ВсегоСтрок	 = МассивСтрок.Количество();
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
		ТекСтрока = МассивСтрок[НомерТекущейСтроки];
		
		Если ТекСтрока = "}" Тогда
			// Структура закончилась
			Возврат Результат;
			
		ИначеЕсли ТекСтрока = "," Тогда
			
			Продолжить;// Дальше должен быть еще одна пара ключ-значение
			
		ИначеЕсли СокрЛП(ТекСтрока) = "" Тогда//пробелы и т.д.
			
			Продолжить;
			
		Иначе// Будем считать, что началась пара ключ-значение
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			ТекЗначение = ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки);
			Результат.Вставить(СтрЗаменить(ТекСтрока, """", ""),ТекЗначение);

		КонецЕсли;
	
	КонецЦикла;
	
	НомерТекущейСтроки = НомерТекущейСтроки + 1;
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьНовыйМассив(МассивСтрок, НомерТекущейСтроки)
	
	Результат	 = Новый Массив;
	ВсегоСтрок	 = МассивСтрок.Количество();
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
		ТекСтрока = МассивСтрок[НомерТекущейСтроки];
		
		Если ТекСтрока = "]" Тогда
			// Массив кончился, выходим, оставаясь на текущей строке
			Возврат Результат;
			
		ИначеЕсли ТекСтрока = "," Тогда
			
			// Будет еще один элемент массива
			Продолжить;
			
		ИначеЕсли СокрЛП(ТекСтрока) = "" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Результат.Добавить(ОбработатьТекущееЗначение(МассивСтрок, НомерТекущейСтроки));
		
	КонецЦикла;
	
	//можно добавить проверку, что именно кончилось: массив или файл
	НомерТекущейСтроки = НомерТекущейСтроки + 1;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстВМассивСтрок(Знач мТекст)
	
	мТекст = Символы.ПС + мТекст + Символы.ПС;// Чтобы точно было больше 1 строки
	
	мЧислоСтрок = СтрЧислоСтрок(мТекст);
	
	мТекст = СтрЗаменить(мТекст, """", """"""); // Одинарные кавычки на двойные
	мТекст = СтрЗаменить(мТекст, Символы.ПС, """}," + Символы.ПС + "{""S"","""); 
	
	мТекст = "{""#"",51e7a0d2-530b-11d4-b98a-008048da3034,
	|{" + Формат(мЧислоСтрок + 1, "ЧГ=0") + ",
	|" //+ 1 фиктивный элемент
	+ "{""S"",""" 
	
	+ мТекст
	
	+ """}"// Фиктивный элемент массива в конце, чтоб избежать проблем с запятой
	+ "
	|}
	|}";
	
	Возврат ЗначениеИзСтрокиВнутр(мТекст);
	
КонецФункции

Функция ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат
	
КонецФункции

//********************************************************
//
//		КЭШ
//

// Возвращает значение из кэша на время вызова сервера
//
// Параметры:
//  Ключ - Строка - см. процедуру Кэш_Поместить
//
// Возвращаемое значение: 
//  Произвольный - см. процедуру Кэш_Поместить
//
Функция Кэш_Прочитать(Ключ)
	
	Если ЗначениеЗаполнено(КэшНаСервере) Тогда
		Результат = КэшНаСервере.Получить(Ключ);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Помещает значение в кэш на время вызова сервера
//
// Параметры:
//  Ключ     - Строка       - уникальный ключ помещаемого значения;
//  Значение - Произвольный - помещаемое значение;
//
Процедура Кэш_Поместить(Ключ, Значение)
	
	Если КэшНаСервере = Неопределено Тогда
		КэшНаСервере = Новый Соответствие;
	КонецЕсли;
	
	КэшНаСервере.Вставить(Ключ, Значение);
	
КонецПроцедуры

Функция Кэш_ПолучитьПлагин(Идентификатор)
	
	КэшПлагинов = КэшПлагинов();
	
	Результат = КэшПлагинов.Получить(Идентификатор);
	
	Возврат Результат;
	
КонецФункции

Процедура Кэш_ПоместитьПлагин(Идентификатор, Плагин)
	
	КэшПлагинов = КэшПлагинов();
	
	КэшПлагинов.Вставить(Идентификатор, Плагин);
	
КонецПроцедуры

Функция КэшПлагинов() Экспорт
	
	ИдентификаторКэша = "ПодключенныеПлагины";
	
	Результат = Кэш_Прочитать(ИдентификаторКэша);
	
	Если Результат = Неопределено Тогда 
		Результат = Новый Соответствие;
		Кэш_Поместить(ИдентификаторКэша, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура КэшПлагинов_Очистить() Экспорт
	
	ИдентификаторКэша = "ПодключенныеПлагины";
	
	Результат = Новый Соответствие;
	Кэш_Поместить(ИдентификаторКэша, Результат);
	
КонецПроцедуры

//********************************************************
//
//		СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

Функция ПолучитьФормуОбработки(ПараметрИмяФормы,
								парамВладелецФормы = Неопределено,
								ПараметрыФормы = Неопределено,
								КлючУникальности = Неопределено,
								ЗакрыватьПриЗакрытииВладельца = Ложь)
	
	//Если ПараметрыФормы = Неопределено Тогда
	//	ПараметрыФормы = Новый Структура;
	//КонецЕсли;
	//
	//Если НЕ ПараметрыФормы.Свойство("Объект") Тогда
	//	ПараметрыФормы.Вставить("Объект",	Объект);
	//КонецЕсли;
	
	//Если парамВладелецФормы = Неопределено Тогда
	//	парамВладелецФормы = ЭтаФорма;
	//КонецЕсли;
	
	//Если ЗакрыватьПриЗакрытииВладельца Тогда
	//	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ЗакрыватьПриЗакрытииВладельца);
	//КонецЕсли;
	
	
	ПолноеИмяОбработки = Метаданные().ПолноеИмя();

	Результат = ПолучитьФорму(
		ПараметрИмяФормы,
		парамВладелецФормы,
		КлючУникальности
	);
	
	Возврат Результат;
	
КонецФункции

Процедура ПриНачалеВызоваБиблиотеки(КонтекстИлиВызвающийМодуль)
	
	Если ТипЗнч(КонтекстИлиВызвающийМодуль) = Тип("Структура") Тогда
		Контекст = КонтекстИлиВызвающийМодуль;
	Иначе
		Контекст = НовыйКонтекстВызывающегоМодуля(КонтекстИлиВызвающийМодуль);
	КонецЕсли;
	
	ВызывающийМодуль = Контекст.ВызывающийМодуль;
	
	ПроверитьВызывающийМодуль(ВызывающийМодуль);
	
	Если СчетчикВызовов = Неопределено Тогда
		СчетчикВызовов = 0;
	КонецЕсли;
	
	СчетчикВызовов = СчетчикВызовов + 1;
	
	Если СчетчикВызовов = 1 Тогда
		ОсновнойМодуль = ВызывающийМодуль;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОкончанииВызоваБиблиотеки()
	
	СчетчикВызовов = СчетчикВызовов - 1;
	
	Если СчетчикВызовов = 0 Тогда
		ОсновнойМодуль = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВызывающийМодуль(ВызывающийМодуль)
	
	Если ВызывающийМодуль <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ПриНачалеВызоваБиблиотеки");
	Ошибка = "Отсутвует указатель на вызывающий модуль!";
	ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, Ошибка);
	
	ВызватьИсключение Ошибка;
	
КонецПроцедуры

// Возвращает полный путь к форме МодульКлиента
// Путь меняется, если модуль добавлен в состав конфигурации.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПутьКФормеМодуляКлиента() Экспорт
	
	ИмяОбработки = ЭтотОбъект.Метаданные().ПолноеИмя();
	
	Результат = ИмяОбработки + ".Форма.МодульКлиента";
	
	Возврат Результат;
	
КонецФункции

// Определяет в каком приложении запущена обработка.
//
// Возвращаемое значение:
//   Булево - Истина, если обработка запущена в толстом клиенте
//            в режиме обычного приложения.
//
Функция ЭтоОбычноеПриложение() Экспорт
	
	Результат = Истина;
	
	Если НЕ ВерсияПлатформыНиже("8.2") Тогда
		
		#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
			Результат = Ложь;
		#КонецЕсли
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает строку из двоичных данных
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - двоичные данные, в которых содержится строка;
//  Кодировка - КодировкаТекста, Строка - (необязательный) кодировка текста;
// 
// Возвращаемое значение:
//  Строка
//
Функция СтрокаИзДвоичныхДанных(ДвоичныеДанные, Кодировка = "UTF-8")
	
	Если Не ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ВерсияПлатформыНиже("8.3.10") Тогда
		
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные.Записать(ИмяФайла);
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(ИмяФайла, Кодировка);
		Результат = Текст.ПолучитьТекст();
		
		УдалитьФайлы(ИмяФайла);
		
	Иначе
		Результат = Вычислить("ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, Кодировка)");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьXMLпоXSL(СтрокаXML, СтрокаXSL)
	
	ПроцессорПреобразования = Новый ПреобразованиеXSL;
	
	Если ВерсияПлатформыНиже("8.3.10") Тогда
		ПроцессорПреобразования.ЗагрузитьИзСтроки(СтрокаXSL);
	Иначе
		ПроцессорПреобразования.ЗагрузитьТаблицуСтилейXSLИзСтроки(СтрокаXSL);
	КонецЕсли;
	
	Результат = ПроцессорПреобразования.ПреобразоватьИзСтроки(СтрокаXML);
	
	Возврат Результат;
	
КонецФункции

Функция СериализоватьXML(СтрокаXML)
	
	НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтрокаXML);
	
	Возврат НовыйСериализаторXDTO.ПрочитатьXML(Чтение);
	
КонецФункции

Функция СтруктураURI(Знач СтрокаURI)
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		Если Не ТолькоЦифрыВСтроке(Порт) Тогда
			Порт = "";
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  Устаревший       - Булево - устаревший параметр, не используется.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
// Пример:
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123"); // Истина
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123abc"); // Ложь
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("01 2 3",, Ложь); // Истина
//
Функция ТолькоЦифрыВСтроке(Знач Значение, Знач Устаревший = Истина, Знач ПробелыЗапрещены = Истина) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон с маркерами подстановки: "%1..%N";
//  Параметр<n>  - Строка - параметры, которые нужно подставить;
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
Функция ПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено) Экспорт
	
	ЕстьПараметрыСПроцентом =
	Найти(Параметр1, "%") > 0
	Или Найти(Параметр2, "%") > 0
	Или Найти(Параметр3, "%") > 0
	Или Найти(Параметр4, "%") > 0
	Или Найти(Параметр5, "%") > 0;
	
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПараметрыСПроцентомВСтроку(ШаблонСтроки
		, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	КонецЕсли;
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Вставляет параметры в строку, с учетом того что в параметрах
// могут использоваться подстановочные слова %1, %2, %3, %4, %5
//
Функция ПараметрыСПроцентомВСтроку(Знач ШаблонСтроки
	, Параметр1 = Неопределено
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	Результат = "";
	
	Пока Истина Цикл
		
		Поз = Найти(ШаблонСтроки, "%");
		
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Лев(ШаблонСтроки, Поз - 1);
		
		НомерПараметра = Сред(ШаблонСтроки, Поз + 1, 1);
		
		Если НомерПараметра = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли НомерПараметра = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли НомерПараметра = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли НомерПараметра = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли НомерПараметра = "5" Тогда
			ЗначениеПараметра = Параметр5;
		Иначе
			ЗначениеПараметра = Неопределено;
		КонецЕсли;
		
		Если ЗначениеПараметра = Неопределено Тогда
			Результат = Результат + "%";
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 1);
		Иначе
			Результат = Результат + ЗначениеПараметра;
			ШаблонСтроки = Сред(ШаблонСтроки, Поз + 2);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Результат + ШаблонСтроки;
	
	Возврат Результат;
	
КонецФункции

// Сравнивает версии между собой
// значения после дефиса или слэша не учитываются
//
// Параметры
//  Версия1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС;
//  Версия2 - Строка - второй сравниваемый номер версии;
//
// Возвращаемое значение:
//  Число - возможные значения:
//   * больше 0 - если Версия1 > Версия2;
//   * меньше 0 - если Версия1 < Версия2;
//   * 0 - если версии равны;
//
Функция СравнитьВерсии(Версия1, Версия2)
	
	// Для составных номеров версий берем только первую часть
	Строка1 = Сред(Версия1, 1, Найти(Версия1, "-") - 1);
	Строка2 = Сред(Версия2, 1, Найти(Версия2, "-") - 1);
	Строка1 = Сред(Строка1, 1, Найти(Строка1, "/") - 1);
	Строка2 = Сред(Строка2, 1, Найти(Строка2, "/") - 1);
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Результат = 0;
	
	Пока ЗначениеЗаполнено(Строка1)
		Или ЗначениеЗаполнено(Строка2) Цикл
		
		Поз = Найти(Строка1, ".");
		Если Поз = 0 Тогда
			Подстрока1 = СокрЛП(Строка1);
			Строка1 = "";
		Иначе
			Подстрока1 = СокрЛП(Лев(Строка1, Поз - 1));
			Строка1 = Сред(Строка1, Поз + 1);
		КонецЕсли;
		
		Поз = Найти(Строка2, ".");
		Если Поз = 0 Тогда
			Подстрока2 = СокрЛП(Строка2);
			Строка2 = "";
		Иначе
			Подстрока2 = СокрЛП(Лев(Строка2, Поз - 1));
			Строка2 = Сред(Строка2, Поз + 1);
		КонецЕсли;
		
		НомерВерсии1 = ОписаниеЧисла.ПривестиЗначение(Подстрока1);
		НомерВерсии2 = ОписаниеЧисла.ПривестиЗначение(Подстрока2);
		
		Результат = НомерВерсии1 - НомерВерсии2;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПлатформаWindows()
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Результат = СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 
		Или СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияПлатформы()
	
	СисИнфо = Новый СистемнаяИнформация;
	Результат = СисИнфо.ВерсияПриложения;
	
	Возврат Результат;
	
КонецФункции

// Сравнивает указанную версию с версией платформы
//
// Параметры:
//  Версия - Строка - версия, с которой нужно сравнить версию платформы;
// 
// Возвращаемое значение:
//  Булево - Истина, если версия платформы ниже указанной
//
Функция ВерсияПлатформыНиже(Версия)
	
	КлючКэш = "ВерсияПлатформыНиже " + Версия;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СисИнфо = Новый СистемнаяИнформация;
	Результат = (СравнитьВерсии(ВерсияПлатформы(), Версия) < 0);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание защиты от опасных действий
// с отключенным предупреждением об опасных действиях
// 
// Возвращаемое значение:
//  ОписаниеЗащитыОтОпасныхДействий
//
Функция ОписаниеЗащитыБезПредупреждений()
	
	Результат = Неопределено;
	
	Попытка
		Результат = Новый("ОписаниеЗащитыОтОпасныхДействий");
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияБиблиотеки("ПодключениеОбработок");
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		
		ЖурналРегистрации_ЗаписатьПредупреждение(СобытиеЖР, ТекстОшибки);
		
	КонецПопытки;
	
	Если Результат <> Неопределено Тогда
		Результат.ПредупреждатьОбОпасныхДействиях = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие механизма платформы, предупреждающего об опасных действиях.
//
// Возвращаемое значение:
//  Булево - Истина, если механизм предупреждений безопасности есть
//
Функция ЕстьЗащитаОтОпасныхДействий()
	
	Свойства = Новый Структура("ЗащитаОтОпасныхДействий, UnsafeOperationProtection");
	ЗаполнитьЗначенияСвойств(Свойства, ПользователиИнформационнойБазы.ТекущийПользователь());
	
	Если Свойства.ЗащитаОтОпасныхДействий <> Неопределено
		Или Свойства.UnsafeOperationProtection <> Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// ВАЖНО: В результирующую строку добавляются только непустые значения!
// Платформенный метод СтрСоединить объединяет строки безусловно.
// Нужно это учитывать, если в качестве разделителя задана непустая строка.
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - коллекция объединяемых строк.
//  Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
// Пример:
//   
//   Строки = Новый Массив;
//   Строки.Добавить("Элемент0");
//   Строки.Добавить("");
//   Строки.Добавить("Элемент2");
//   
//   СоединитьСтроку(Строки, "#") = "Элемент0#Элемент2"
//   СтрСоединить(Строки, "#") = "Элемент0##Элемент2"
//   СоединитьСтроку(Строки, "") = СтрСоединить(Строки, "") = "Элемент0Элемент2"
//
Функция Служебные_СоединитьСтроку(Строки, Разделитель = "")
	
	Результат = "";
	ТекРазделитель = "";
	
	Для Каждого Строка Из Строки Цикл
		
		Результат = Результат + ТекРазделитель + Строка;
		ТекРазделитель = Разделитель;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разделяет строку на части по указанным разделителям
// В отличие от СтрРазделить, в качестве разделителя используется вся строка
//
// Параметры:
//  Строка               - Строка - разделяемая строка;
//  МассивИлиРазделитель - Массив, Строка - строка разделителя или массив строк разделителей;
//  ВключатьПустые       - Булево - Ложь, если пустые части строки включать в результат не нужно;
// 
// Возвращаемое значение:
//  Массив - массив со строками, которые получились в результате разделения исходной строки
//
Функция Служебные_РазделитьСтроку(Строка, МассивИлиРазделитель = ",", ВключатьПустые = Истина)
	
	Если ТипЗнч(МассивИлиРазделитель) = Тип("Массив") Тогда
		МассивРазделителей = МассивИлиРазделитель;
	Иначе
		МассивРазделителей = Новый Массив;
		МассивРазделителей.Добавить(МассивИлиРазделитель);
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Для каждого Разделитель Из МассивРазделителей Цикл
		
		Результат.Очистить();
		
		СтрокаРазделена = Ложь;
		
		ТекСтрока = Строка;
		
		ДлинаРазделителя = СтрДлина(Разделитель);
		
		Пока Истина Цикл
			
			Поз = Найти(ТекСтрока, Разделитель);
			
			Если Поз > 0 Тогда
				СтрокаРазделена = Истина;
			КонецЕсли;
			
			Если Поз = 0 Тогда
				Подстрока = СокрЛП(ТекСтрока);
				ТекСтрока = "";
			Иначе
				Подстрока = СокрЛП(Лев(ТекСтрока, Поз - 1));
				ТекСтрока = Сред(ТекСтрока, Поз + ДлинаРазделителя);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Подстрока) Или ВключатьПустые Тогда
				Результат.Добавить(Подстрока);
			КонецЕсли;
			
			Если Поз = 0 Тогда
				Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаРазделена Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие метаданных (в т.ч. реквизитов) по строке
Функция Служебные_ЕстьНеобходимыеМетаданные(СтрокаМетаданных) 
	
	КлючКэш = "ЕстьМетаданные";
	
	РезультатыКэш = Кэш_Прочитать(КлючКэш);
	
	Если Не ЗначениеЗаполнено(РезультатыКэш) Тогда
		РезультатыКэш = Новый Соответствие;
		Кэш_Поместить(КлючКэш, РезультатыКэш);
	КонецЕсли;
	
	Результат = РезультатыКэш.Получить(СтрокаМетаданных);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Истина;
	
	МассивИмен = Служебные_РазделитьСтроку(СтрокаМетаданных, ".");
	
	КоличествоИмен = МассивИмен.Количество();
	
	// КоличествоИмен = 2 для проверки наличия объекта, например 					Справочники.КонтурEDI_Сообщения
	// КоличествоИмен = 4 для проверки наличия реквизита\ресурса и т.д., например	Справочники.КонтурEDI_Сообщения.Реквизиты.Организация
	// КоличествоИмен = 6 для проверки наличия реквизита таб. части, например		Справочники.КонтурEDI_Сообщения.ТабличныеЧасти.ДополнительныеРеквизиты.Реквизиты.ЗначениеСтрока
	
	Если КоличествоИмен <> 2 И КоличествоИмен <> 4 И КоличествоИмен <> 6 Тогда
		
		Результат = Ложь;
		
	Иначе
		
		ТекущиеМетаданные = Метаданные;
		
		КоличествоПоисков = КоличествоИмен / 2;
		
		Для Сч = 1 По КоличествоПоисков Цикл
			
			Владелец = МассивИмен[Сч * 2 - 2];
			Реквизит = МассивИмен[Сч * 2 - 1];
			
			ТекущиеМетаданные = ТекущиеМетаданные[Владелец].Найти(Реквизит);
			
			Если ТекущиеМетаданные = Неопределено Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатыКэш.Вставить(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторБиблиотеки()
	Возврат "КонтурПлагины";
КонецФункции

Функция РазделительУровнейЛога()
	Возврат ".";
КонецФункции

// Записывает в журнал регистрации событие с уровнем "Ошибка"
//
// Параметры:
//  Действие - Строка - идентификатор события журнала регистрации;
//  ТекстОшибки - Строка - текст ошибки;
//
Процедура ЖурналРегистрации_ЗаписатьОшибку(Действие, ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(
		Действие,
		УровеньЖурналаРегистрации.Ошибка,
		Неопределено,
		Неопределено,
		ТекстОшибки
	);
	
КонецПроцедуры

// Записывает в журнал регистрации событие с уровнем "Предупреждение"
//
// Параметры:
//  Действие - Строка - идентификатор события журнала регистрации;
//  ТекстОшибки - Строка - текст ошибки;
//
Процедура ЖурналРегистрации_ЗаписатьПредупреждение(Действие, ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(
		Действие,
		УровеньЖурналаРегистрации.Предупреждение,
		Неопределено,
		Неопределено,
		ТекстОшибки
	);
	
КонецПроцедуры

// Формирует полный идентификатор события журнала регистрации, относящегося к работе библиотеки.
//
// Параметры:
//  Действие - Строка - Действие, с которым связано событие.
// 
// Возвращаемое значение:
//  Строка - полный идентификатор события.
//
Функция ЖурналРегистрации_ИдентификаторСобытияБиблиотеки(Действие)
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(ИдентификаторБиблиотеки());
	Подстроки.Добавить(Действие);
	
	Разделитель = РазделительУровнейЛога();
	
	Результат = Служебные_СоединитьСтроку(Подстроки, Разделитель);
	
	Возврат Результат;
	
КонецФункции

// Формирует полный идентификатор события журнала регистрации, относящегося к работе плагина.
//
// Параметры:
//  ИдентификаторПлагина - Строка - Идентификатор плагина.
//  Действие - Строка - Действие, с которым связано событие.
// 
// Возвращаемое значение:
//  Строка - полный идентификатор события.
//
Функция ЖурналРегистрации_ИдентификаторСобытияПлагина(ИдентификаторПлагина, Действие)
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(ИдентификаторБиблиотеки());
	Подстроки.Добавить(ИдентификаторПлагина);
	Подстроки.Добавить(Действие);
	
	Разделитель = РазделительУровнейЛога();
	
	Результат = Служебные_СоединитьСтроку(Подстроки, Разделитель);
	
	Возврат Результат;
	
КонецФункции

// Формирует полный идентификатор события журнала регистрации, связанного с интеграцией с продуктом.
//
// Параметры:
//  Действие - Строка - Действие, с которым связано событие.
// 
// Возвращаемое значение:
//  Строка - полный идентификатор события.
//
Функция ЖурналРегистрации_ИдентификаторСобытияПродукта(Действие)
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(ИдентификаторБиблиотеки());
	Подстроки.Добавить(ИдентификаторПроекта());
	Подстроки.Добавить(Действие);
	
	Разделитель = РазделительУровнейЛога();
	
	Результат = Служебные_СоединитьСтроку(Подстроки, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция СписокТиповыхПлагинов()
	
	ИмяПроекта = ИдентификаторПроекта();
	
	СтрокаXML = Сервис_СписокПлагинов(ИмяПроекта);
	СтрокаXSL = Сервис_СписокПлагиновXSLT(ИмяПроекта);
	СтрокаXML = ПреобразоватьXMLпоXSL(СтрокаXML, СтрокаXSL);
	
	ТаблицаПлагинов = СериализоватьXML(СтрокаXML);
	
	Результат = Новый Массив;
	
	Для каждого Стр Из ТаблицаПлагинов Цикл
		
		НовыйПлагин = Новый_ТиповойПлагин();
		ЗаполнитьЗначенияСвойств(НовыйПлагин, Стр);
		
		Результат.Добавить(НовыйПлагин);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СписокЗагруженныхПлагинов()
	
	Результат = Новый Массив;
	
	СтандартнаяОбработка = Истина;
	
	ОсновнойМодуль_ПриПолученииСпискаЗагруженныхПлагинов(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка_ПриПолученииСпискаЗагруженныхПлагинов(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокНеиспользуемыхПлагинов()
	
	Результат = Новый Массив;
	
	СтандартнаяОбработка = Истина;
	ОсновнойМодуль_ПриПолученииСпискаНеиспользуемыхПлагинов(Результат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		// Отсутствует
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокПлагинов()
	
	ИмяКоманды = КомандаПолучитьСписокПлагинов();
	
	ПараметрыКоманды = Новый Структура;
	
	Результат = ПолучитьРезультатСлужебногоСобытия(ИмяКоманды, ПараметрыКоманды);
	
	Возврат Результат;
	
КонецФункции

Функция МанифестПлагина(Идентификатор)
	
	Результат = Новый Структура("Успешно, Данные, ОписаниеОшибки");
	
	Попытка
		
		ОбъектПлагина 		= Плагин_СоздатьОбъект(Идентификатор);
		Результат.Данные	= ОбъектПлагина.МанифестПлагина();
		Результат.Успешно	= Истина;
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияПлагина(Идентификатор, "ПолучитьМанифест");
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		
		Результат.Успешно			= Ложь;
		Результат.ОписаниеОшибки	= ТекстОшибки;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПротестироватьПлагин(Идентификатор)
	
	Результат = Новый Структура("Успешно, ТребуетсяНастройка, ОписаниеОшибки", Истина, Ложь, "");
	
	Попытка
		
		ОбъектПлагина	= Плагин_СоздатьОбъект(Идентификатор);
		
		РезультатТеста	= ОбъектПлагина.ПротестироватьПлагин();
		
		Результат.Успешно				= РезультатТеста.Успешно;
		Результат.ТребуетсяНастройка	= РезультатТеста.ТребуетсяНастройка;
		Результат.ОписаниеОшибки		= РезультатТеста.ОписаниеОшибки;

	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		СобытиеЖР = ЖурналРегистрации_ИдентификаторСобытияПлагина(Идентификатор, "Протестировать");
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		ЖурналРегистрации_ЗаписатьОшибку(СобытиеЖР, ТекстОшибки);
		
		Результат.Успешно			= Ложь;
		Результат.ОписаниеОшибки	= ПодробноеПредставлениеОшибки(Ошибка);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция Отладка_РежимОтладки()
	Возврат Контекст.РежимОтладки;
КонецФункции

Функция Отладка_КаталогОтладки()
	Возврат Контекст.КаталогОтладки;
КонецФункции

Функция Отладка_ПутьКФайлуПлагина(ИдентификаторПлагина)
	
	Результат = ФайловаяСистема_ОбъединитьПути(
		Отладка_КаталогОтладки(),
		ИдентификаторПлагина + ".epf"
	);
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияЗагруженногоПлагина(Идентификатор)
	
	Результат = "";
	
	СписокЗагруженныхПлагинов = СписокЗагруженныхПлагинов();
	Для Каждого ЗагруженныйПлагин Из СписокЗагруженныхПлагинов Цикл
		
		Если загруженныйПлагин.Идентификатор = Идентификатор Тогда
			Результат = ЗагруженныйПлагин.Версия;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НовоеСобытиеМетрики(ТипСобытия, Действие, ИдентификаторПлагина, ВерсияПлагина, Переменные = Неопределено, ТекстОшибки = Неопределено, ИдентификаторТрассировки = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("ТипСобытия", ТипСобытия);
	Результат.Вставить("Действие", Действие);
	Результат.Вставить("ИдентификаторПлагина", ИдентификаторПлагина);
	Результат.Вставить("ВерсияПлагина", ВерсияПлагина);
	Результат.Вставить("ИдентификаторТрассировки", ИдентификаторТрассировки);
	Результат.Вставить("Переменные", Переменные);
	Результат.Вставить("ТекстОшибки", ТекстОшибки);

	Возврат Результат;
	
КонецФункции

Процедура Метрики_ЗарегистрироватьСобытие(ОписаниеСобытия)
	
	СтандартнаяОбработка = Ложь;
	
	ОсновнойМодуль_ПриПолученииМетрики(ОписаниеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура Метрики_ЗаписатьДействиеПлагинов(ИдентификаторПлагина, ВерсияПлагина, Действие)
	
	ТипСобытия = Метрики_ТипСобытияСтатистика();
	
	ИдентификаторТрассировки = Метрика_ИдентификаторТрассировки();
	НовоеСобытиеМетрики = НовоеСобытиеМетрики(ТипСобытия, Действие, ИдентификаторПлагина, ВерсияПлагина, , , ИдентификаторТрассировки);
	
	Метрики_ЗарегистрироватьСобытие(НовоеСобытиеМетрики);
	
КонецПроцедуры

Процедура Метрики_ЗаписатьОшибкуПлагинов(ИдентификаторПлагина, ВерсияПлагина, Действие, ТекстОшибки)
	
	ТипСобытия = Метрики_ТипСобытияОшибка();
	
	Переменные = Новый Структура;
	Переменные.Вставить("Ошибка", ТекстОшибки); 
	
	НовоеСобытиеМетрики = НовоеСобытиеМетрики(ТипСобытия, Действие, ИдентификаторПлагина, ВерсияПлагина, Переменные);
	
	Метрики_ЗарегистрироватьСобытие(НовоеСобытиеМетрики);
	
КонецПроцедуры

Функция Метрики_ТипСобытияОшибка()
	Возврат "Ошибка";
КонецФункции

Функция Метрики_ТипСобытияСтатистика()
	Возврат "Статистика";
КонецФункции

Функция Метрики_ТипСобытияПоведение()
	Возврат "Поведение";
КонецФункции

Функция Метрики_ТипСобытияЗамер()
	Возврат "Замер";
КонецФункции

Функция Метрика_ИдентификаторТрассировки()
	
	Результат = TraceId;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		TraceId = "БиблиотекаПлагинов_" + Новый УникальныйИдентификатор;
		
		Результат = TraceId;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияОбработки()
	
	Возврат "3.2.3";
	
КонецФункции

//#КонецОбласти // СлужебныеПроцедурыИФункции
