
#Область ПЕРЕМЕННЫЕ_ПЛАТФОРМЫ
// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем Манифест 				Экспорт;
Перем ОбработкаОбъект 		Экспорт;
Перем ПараметрыКлиентСервер Экспорт;
Перем ЭтоРедакция6_1;

Перем НомерИтерацииВызоваМодуля;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on
#КонецОбласти

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ПЛАТФОРМЫ

Функция МетодСервера(ИмяМодуля = "", ИмяМетода, 
		Параметр0 = NULL, Параметр1 = NULL, Параметр2 = NULL, Параметр3 = NULL, Параметр4 = NULL, 
		Параметр5 = NULL, Параметр6 = NULL, Параметр7 = NULL, Параметр8 = NULL, Параметр9 = NULL)
	
	Возврат ОбработкаОбъект.МетодСервера(ИмяМодуля, ИмяМетода, 
	Параметр0, Параметр1, Параметр2, Параметр3, Параметр4, 
	Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	
КонецФункции

Процедура Инициализировать(ИмяМодуля) Экспорт
	
	Если НомерИтерацииВызоваМодуля = Неопределено Тогда
		НомерИтерацииВызоваМодуля = 0;
	КонецЕсли;
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля + 1;
	
	Если Манифест = Неопределено Тогда
		ОбработкаОбъект.ЗаполнитьМанифест(ЭтотОбъект, ИмяМодуля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПеременные() Экспорт
	
	// Разрывается циклическая ссылка, для того чтобы исключить утечку памяти.
	// Модуль может быть вызван повторно во вложенных методах,
	// поэтому очищаем переменные, ТОЛЬКО если это начальная итерация вызова модуля.
	
	НомерИтерацииВызоваМодуля = НомерИтерацииВызоваМодуля - 1;
	
	Если НомерИтерацииВызоваМодуля = 0 Тогда
		ОбработкаОбъект			= Неопределено;
		ПараметрыКлиентСервер	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриглашениеОтладки() Экспорт
	
	//// Удалите комментарий напротив оператора "ВызватьИсключение", чтобы получить приглашение для начала отладки модуля.
	// ВызватьИсключение "Нажмите кнопку ""Подробно"", а затем ""Конфигуратор"", чтобы начать отладку модуля!"; 
	
КонецПроцедуры

#КонецОбласти

#Область МАНИФЕСТ

// Все функции и процедуры тела модуля должны быть экспортными и добавлены в соответствующую структуру!

Функция ФункцииМодуля() Экспорт
	
	Результат = Новый Структура;
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПодготовитьВТДляСпискаОтправкиДокументов");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПараметрыСчетаФактуры");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоНакладная");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоСчетНаОплату");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоКорректировкаРеализации");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьСчетНаОплатуНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьЗаказПокупателяНаОснованииРТУ");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "РезультатВизуализацииСчетаНаОплатуСредствамиДиадок");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВозвратТоваровОтКлиента");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ЭтоВыбытиеИзОборотаМаркируемойПродукции");
	
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьВидКИ");
	
	// Машиночитаемые доверенности
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ИмяСправочникаВИнформационнойБазе");
	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "МЧД_ДанныеДоверенности");

	ОбработкаОбъект.ДобавитьФункциюВМанифест(Результат, "ПолучитьОбстоятельствоФормированияСчетФактуры");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента
//
// Параметры:
//  ТребуемыеРеквизиты	 - Структура	 - коллекция описаний полей запроса: ключ - имя поля, значение - выражение.
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - ссылка на объект, описание которого надо получить.
//
Процедура ПриПолученииОписанияПрикладногоДокумента(ТребуемыеРеквизиты, СсылкаНаОбъект) Экспорт
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	ПсевдонимОсновнойТаблицы = "";
	
	Если МетаданныеОбъекта = Метаданные.Документы.СчетФактураВыданный Тогда
		
		ТребуемыеРеквизиты.ЭтоКорректировка	= ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимОсновнойТаблицы);
		ТребуемыеРеквизиты.ЭтоИсправление	= ТекстЗапроса_СчетФактура_ЭтоИсправление(ПсевдонимОсновнойТаблицы);
		
	ИначеЕсли МетаданныеОбъекта = Метаданные.Документы.КорректировкаРеализации Тогда	
		
		ТребуемыеРеквизиты.ЭтоКорректировка	= ТекстЗапроса_КорректировкаРеализации_ЭтоКорректировка(ПсевдонимОсновнойТаблицы);
		ТребуемыеРеквизиты.ЭтоИсправление	= ТекстЗапроса_КорректировкаРеализации_ЭтоИсправление(ПсевдонимОсновнойТаблицы);
		
	ИначеЕсли МетаданныеОбъекта = Метаданные.Документы.КорректировкаРеализацииАвтомобилей Тогда
		
		ТребуемыеРеквизиты.ЭтоКорректировка	= ТекстЗапроса_КорректировкаРеализацииАвтомобилей_ЭтоКорректировка(ПсевдонимОсновнойТаблицы);
		ТребуемыеРеквизиты.ЭтоИсправление	= ТекстЗапроса_КорректировкаРеализацииАвтомобилей_ЭтоИсправление(ПсевдонимОсновнойТаблицы);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидДокументаИнформационнойБазы
//
// Параметры:
//  ВидДокумента	 - Строка - (возвращаемый параметр) вид документа с точки зрения ЭДО (см. ВидыЭлектронныхДокументов);
//  СсылкаНаОбъект	 - ЛюбаяСсылка - объект информационной базы, вид которого необходимо определить;
//  ЭтоКорректировка - Булево - Истина, если объект отражает операцию корректировки;
//
Процедура ОпределитьВидДокумента(ВидДокумента, СсылкаНаОбъект, ЭтоКорректировка) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	МетаданныеДокументов = Метаданные.Документы;
	
	Если МетаданныеОбъекта = МетаданныеДокументов.СчетФактураВыданный И Не ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.СчетФактура;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.СчетФактураВыданный И ЭтоКорректировка Тогда
		
		ВидДокумента = ВидыЭД.КорректировочныйСчетФактура;
		
	ИначеЕсли МетаданныеОбъекта = МетаданныеДокументов.КорректировкаРеализации 
		Или МетаданныеОбъекта = МетаданныеДокументов.КорректировкаРеализацииАвтомобилей Тогда
		
		Если ЭтоКорректировка Тогда
			ВидДокумента = ВидыЭД.СоглашениеОбИзмененииСтоимости;
		Иначе
			ВидДокумента = ВидыЭД.ТоварнаяНакладная;
		КонецЕсли;
		
	Иначе
		
		СоответствиеМетаданных = Новый Соответствие;
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.АктСверкиВзаиморасчетов, ВидыЭД.АктСверки);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.СчетНаОплату, ВидыЭД.СчетНаОплату);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.СчетНаОплатуЗаАвтомобили, ВидыЭД.СчетНаОплату);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.РеализацияАвтомобилей, ВидыЭД.ТоварнаяНакладная);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.РеализацияАктивов, ВидыЭД.ТоварнаяНакладная);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.РеализацияТоваров, ВидыЭД.ТоварнаяНакладная);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.ВозвратПоставщику, ВидыЭД.ТоварнаяНакладная);
		СоответствиеМетаданных.Вставить(МетаданныеДокументов.ВозвратПоставщикуАвтомобилей, ВидыЭД.ТоварнаяНакладная);
		
		ВидДокумента = СоответствиеМетаданных.Получить(МетаданныеОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт
	
	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Номер");
	РеквизитыДокумента.Вставить("Дата");
	
	Если ЭтоИсправление Тогда
		
		Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации")
			ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
			
			// Переопределим номер документа
			РеквизитыДокумента.Номер = "ДокументОснование.Номер";
			РеквизитыДокумента.Дата = "ДокументОснование.Дата";
			
			// И добавим получение номера и даты исправления
			РеквизитыДокумента.Вставить("НомерИсправления", "1");
			РеквизитыДокумента.Вставить("ДатаИсправления", "Дата");
			
		Иначе
			// Переопределим номер документа
			РеквизитыДокумента.Номер = "НомерИсходногоДокумента";
			РеквизитыДокумента.Дата = "ДатаИсходногоДокумента";
			
			// И добавим получение номера и даты исправления
			РеквизитыДокумента.Вставить("НомерИсправления");
			РеквизитыДокумента.Вставить("ДатаИсправления", "Дата");
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛокальная(СсылкаНаОбъект, РеквизитыДокумента);
	
	Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	Результат.ДатаДокумента = ЗначенияРеквизитов.Дата;
	
	Если ЭтоИсправление Тогда
		Результат.НомерИсправления = Формат(ЗначенияРеквизитов.НомерИсправления, "ЧГ=0");
		Результат.ДатаИсправления = ЗначенияРеквизитов.ДатаИсправления;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьСведенияОДокументахПодтверждающихОтгрузку820
//
// Параметры:
//  ДокументыОбОтгрузке	- Массив - (возвращаемый параметр) Массив элементов "Новый_DocumentShipment";
//  СсылкаНаОбъект		- ДокументСсылка.СчетФактураВыданный - СФ для которой определяем реквизиты документов отгрузки.
//
Процедура ПриПолученииДанныхДокументовОбОтгрузке(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДатаНомерДокумента
//
// Параметры:
//  Результат		 	- Структура - (возвращаемый параметр) сведения о дате и номере документа;
//  ОписаниеДокумента	- Структура - параметры объекта ИБ (см. Модуль_ИнтеграцияУниверсальный.ОписаниеПрикладногоДокумента);
//  ЦифровойИндексОП 	- Число 	- цифровой индекс обособленного подразделения;
//
Процедура ЗаполнитьСведенияОДатеИНомереКорректировочногоДокумента(Результат, ОписаниеДокумента, ЦифровойИндексОП) Экспорт
	
	СсылкаНаОбъект = ОписаниеДокумента.Ссылка;
	ЭтоИсправление = ОписаниеДокумента.ЭтоИсправление;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ЗначенияРеквизитов = РеквизитыКорректировочногоСчетаФактуры(СсылкаНаОбъект, ЭтоИсправление);
		УчитыватьИсправлениеИсходногоДокумента = ЗначенияРеквизитов.УчитыватьИсправлениеИсходногоДокумента;
	Иначе
		ЗначенияРеквизитов = РеквизитыКорректировкиРеализации(СсылкаНаОбъект, ЭтоИсправление);
		УчитыватьИсправлениеИсходногоДокумента = ЗначениеЗаполнено(ЗначенияРеквизитов.ДатаИсправленияИсходногоДокумента);
	КонецЕсли;
	
	Результат.НомерДокумента = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	Результат.ДатаДокумента = ЗначенияРеквизитов.Дата;
	
	Если ЭтоИсправление Тогда
		
		Результат.НомерИсправления = Формат(ЗначенияРеквизитов.НомерИсправления, "ЧГ=0");
		Результат.ДатаИсправления = ЗначенияРеквизитов.ДатаИсправления;
		
	КонецЕсли;
	
	ОписаниеРеквизитов = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ДатаНомерДокументаОснования");
	ОписаниеРеквизитов.НомерИсходногоДокумента = ПредставлениеНомера(ЗначенияРеквизитов.НомерИсходногоДокумента);
	ОписаниеРеквизитов.ДатаИсходногоДокумента = ЗначенияРеквизитов.ДатаИсходногоДокумента;
	ОписаниеРеквизитов.УчитыватьИсправлениеИсходногоДокумента = УчитыватьИсправлениеИсходногоДокумента;
	
	Если ОписаниеРеквизитов.УчитыватьИсправлениеИсходногоДокумента Тогда
		ОписаниеРеквизитов.НомерИсправленияИсходногоДокумента = Формат(ЗначенияРеквизитов.НомерИсправленияИсходногоДокумента, "ЧГ=0");
		ОписаниеРеквизитов.ДатаИсправленияИсходногоДокумента = ЗначенияРеквизитов.ДатаИсправленияИсходногоДокумента;
	КонецЕсли;
	
	Результат.ДатаНомерДокументовОснований.Добавить(ОписаниеРеквизитов);
	
КонецПроцедуры

Функция РеквизитыКорректировкиРеализации(СсылкаНаОбъект, ЭтоИсправление)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Номер");
	Реквизиты.Вставить("Дата");
	Реквизиты.Вставить("НомерИсходногоДокумента", "ДокументОснование.Номер");
	Реквизиты.Вставить("ДатаИсходногоДокумента", "ДокументОснование.Дата");
	Реквизиты.Вставить("НомерИсправленияИсходногоДокумента", "Неопределено");
	Реквизиты.Вставить("ДатаИсправленияИсходногоДокумента", "Неопределено");
	
	Если ЭтоИсправление Тогда
		
		// Переопределим номер документа
		Реквизиты.Номер	 = "ДокументОснование.Номер";
		Реквизиты.Дата	 = "ДокументОснование.Дата";
		
		// И добавим получение номера и даты исправления
		Реквизиты.Вставить("НомерИсправления","1");
		Реквизиты.Вставить("ДатаИсправления", "Дата");
		
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъектаЛокальная(СсылкаНаОбъект, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыКорректировочногоСчетаФактуры(СсылкаНаОбъект, ЭтоИсправление)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ПолеНомерДокумента КАК Номер,
	|	&ПолеДатаДокумента КАК Дата,
	|	&ПолеНомерИсправления КАК НомерИсправления,
	|	&ПолеДатаИсправления КАК ДатаИсправления,
	|	Таблица.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
	|	Таблица.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	Таблица.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	Таблица.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
	|	Таблица.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
	|	1 КАК НомерСтроки
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ПолеНомерДокумента = "Таблица.Номер";
	ПолеДатаДокумента = "Таблица.Дата";
	ПолеНомерИсправления = "НЕОПРЕДЕЛЕНО";
	ПолеДатаИсправления	 = "НЕОПРЕДЕЛЕНО";
	
	Если ЭтоИсправление Тогда
		
		ПолеНомерДокумента	 = "Таблица.НомерИсходногоДокумента";
		ПолеДатаДокумента	 = "Таблица.ДатаИсходногоДокумента";
		ПолеНомерИсправления = "Таблица.НомерИсправления";
		ПолеДатаИсправления	 = "Таблица.Дата";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерДокумента"	, ПолеНомерДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДатаДокумента" 	, ПолеДатаДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНомерИсправления", ПолеНомерИсправления);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДатаИсправления"	, ПолеДатаИсправления);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  МетаданныеОбъекта	 - ОбъектМетаданных - объект метаданных.
//  ТабличныеЧасти		 - Массив - массив, в который необходимо добавить имена табличных частей, из которых нужно получить данные.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииИменТабличныхЧастей(МетаданныеОбъекта, ТабличныеЧасти, СтандартнаяОбработка) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка				 - Структура - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки()
//  ИмяТабличнойЧасти	 - Строка	 - имя табличной части объекта.
//  РеквизитыТЧ			 - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                     псевдоним поля, а в качестве значения (опционально) фактическое имя поля в таблице.
//                                     Если значение не определено, то имя поля берется из ключа.
//  ПараметрыЗапроса	 - Структура - дополнительные параметры, будут переданы в исполняемый запрос.
//
Процедура ПриПодготовкеЗапросаПоТоварнойЧастиДокумента(Шапка, ИмяТабличнойЧасти, РеквизитыТЧ, ПараметрыЗапроса) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей()
//
// Параметры:
//  Шапка			 - Структура		 - см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки.
//  ТабличнаяЧасть	 - ТаблицаЗначений	 - см. Модуль_ИнтеграцияУниверсальный.ДанныеТабличныхЧастей.
//
Процедура ПослеПолученияТоварнойЧастиДокумента(Шапка, ТабличнаяЧасть) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РасчетноеПредставлениеНомера()
//
// Параметры:
//  НомерОбъекта		 - Строка - номер или код объекта, который преобразуется для вывода на печать.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	НомерОбъекта = ПредставлениеНомера(НомерОбъекта);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяКолонкиКодТовара()
//
// Параметры:
//  ИмяКолонки			 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриОпределенииДополнительнойКолонкиПечатныхФормДокументов(ИмяКолонки, СтандартнаяОбработка = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ИмяКолонки = ИмяКолонкиКодТовара();
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВалютаРегламентированногоУчета()
//
Процедура ПриОпределенииВалютыРегламентированногоУчета(ВалютаРеглУчета, СтандартнаяОбработка = Истина) Экспорт
	ВалютаРеглУчета = ВалютаРеглУчета();
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыЮрФизЛица.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  ЮрФизЛицо			 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период				 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет		 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                         Если не передан, будут включены реквизиты основного банковского счета.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовЮрФизЛица(Реквизиты, ЮрФизЛицо, Период, БанковскийСчет, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияРеквизитов = РеквизитыОрганизацииКонтрагента(ЮрФизЛицо, Период, БанковскийСчет);
	
	ЗаполнитьЗначенияСвойств(Реквизиты, ЗначенияРеквизитов);
	
	НаименованиеЮрФизЛица = СокрЛП(ЗначенияРеквизитов.НаименованиеПолное);
	Реквизиты.Представление = НаименованиеЮрФизЛица;
	Реквизиты.ПолноеНаименование = НаименованиеЮрФизЛица;
	Реквизиты.СокращенноеНаименование = НаименованиеЮрФизЛица;
	Реквизиты.НаименованиеДляПечатныхФорм = НаименованиеЮрФизЛица;
	
	Если ЗначенияРеквизитов.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель
		Или ЗначенияРеквизитов.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		Реквизиты.ТипЮрФизЛица = ТипЮрФизЛица_ФизическоеЛицо();
	Иначе
		Реквизиты.ТипЮрФизЛица = ТипЮрФизЛица_ЮридическоеЛицо();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет развернутую таблицу кодов маркировки штатными средствами конфигурации.
// В этой процедуре можно отключить стандартную обработку получения таблицы
// с помощью подсистемы БиблиотекаИнтеграцииИСМП.
//
// Параметры:
//  Результат - ТаблицаЗначений - Заполняемая таблица (см. МенеджерИнтеграции.НоваяРазвернутаяТаблицаУпаковок)
//  СсылкаНаДокумент - ЛюбаяСсылка - объект-владелец штрихкода
//  СтандартнаяОбработка - Булево - если установить Ложь, то заполнение таблицы кодов средствами
//                                  типовой библиотеки интеграции с ИС МП будет отключено.
//
Процедура ЗаполнитьРазвернутуюТаблицуКодов(Результат, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ДокументыПередачи = ДокументыВладельцыКодовМаркировки(СсылкаНаОбъект);
	
	Для Каждого ДокументПередачи Из ДокументыПередачи Цикл
		ДополнитьТаблицуКодовМаркировки(Результат, ДокументПередачи);
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументыВладельцыКодовМаркировки(СсылкаНаОбъект)
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ДокументПередачи = СсылкаНаОбъект.ДокументОснование;
	Иначе
		ДокументПередачи = СсылкаНаОбъект;
	КонецЕсли;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументПередачи);
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьТаблицуКодовМаркировки(ТаблицаКодов, ДокументПередачи)
	
	МетаданныеОбъекта = ДокументПередачи.Метаданные();
	
	Если Не ЕстьКодыМаркировки(МетаданныеОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыНоменклатуры = ПараметрыУчетаНоменклатуры();
	
	ТекстЗапроса = ТекстЗапросаРазвернутаяТаблицаКодов(МетаданныеОбъекта.ПолноеИмя());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументыПередачи", ДокументПередачи);
	Запрос.УстановитьПараметр("УпаковкаПотребительская", "Потребительская");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаКодов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ИспользоватьХарактеристики = ПараметрыНоменклатуры.ИспользоватьХарактеристики;
		НоваяСтрока.ИспользоватьСерии = ПараметрыНоменклатуры.ИспользоватьСерии;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, есть ли у объекта метаданных табличная часть с штрихкодами упаковок товаров.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - проверяемый объект метаданных.
// 
// Возвращаемое значение:
//  Булево - Истина, если у объекта есть табличная часть "КодыМаркировки".
//
Функция ЕстьКодыМаркировки(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("КодыМаркировки") <> Неопределено);
	Возврат Результат;
	
КонецФункции

// Возвращает параметры учета номенклатуры в текущей информационной базе.
// 
// Возвращаемое значение:
//  ФикисированнаяСтруктура - содержит ключи:
//    * ИспользоватьХарактеристики - Булево - Истина, если используются характеристики номенклатуры
//    * ИспользоватьСерии - Булево - Истина, если используются серии номенклатуры
//
Функция ПараметрыУчетаНоменклатуры()
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьХарактеристики", Ложь);
	Результат.Вставить("ИспользоватьСерии", Ложь);
	
	Если Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьХарактеристики = Истина;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("СерииНоменклатуры") <> Неопределено Тогда
		Результат.ИспользоватьСерии = Истина;
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция ТекстЗапросаРазвернутаяТаблицаКодов(ПолноеИмяТаблицы)
	
	Результат =
	"ВЫБРАТЬ
	|	КМ.Ссылка КАК Ссылка,
	|	КМ.ИдентификаторТовара КАК ИдентификаторТовара,
	|	КМ.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ КодыМаркировки
	|ИЗ
	|	&ТЧКодыМаркировки КАК КМ
	|ГДЕ
	|	КМ.Ссылка В(&ДокументыПередачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Т.ИдентификаторТовара КАК ИдентификаторТовара
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ТЧТовары КАК Т
	|ГДЕ
	|	Т.Ссылка В(&ДокументыПередачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	КодыМаркировки.КодМаркировки КАК ЗначениеШтрихкода,
	|	&УпаковкаПотребительская КАК ВидУпаковки
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодыМаркировки КАК КодыМаркировки
	|		ПО Товары.Ссылка = КодыМаркировки.Ссылка
	|			И Товары.ИдентификаторТовара = КодыМаркировки.ИдентификаторТовара";
	
	Результат = СтрЗаменить(Результат, "&ТЧКодыМаркировки", ПолноеИмяТаблицы + ".КодыМаркировки");
	Результат = СтрЗаменить(Результат, "&ТЧТовары", ПолноеИмяТаблицы + ".Товары");
	
	Возврат Результат;
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальный.РеквизитыДоговора.
//
// Параметры:
//  Реквизиты			 - Структура - возвращаемые сведения.
//  Шапка				 - Структура - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки).
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриПолученииРеквизитовДоговора(Реквизиты, Шапка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Представление"	, "ДоговорКонтрагента.Наименование");
	ТребуемыеРеквизиты.Вставить("Номер"			, "ДоговорКонтрагента.НомерДоговора");
	ТребуемыеРеквизиты.Вставить("Дата"			, "ДоговорКонтрагента.ДатаНачала");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛокальная(Шапка.ОписаниеДокумента.Ссылка, ТребуемыеРеквизиты);
	
	ЗаполнитьЗначенияСвойств(Реквизиты, ЗначенияРеквизитов);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЭтапыГрафикаОплатПоДокументу.
//
// Параметры:
//  ЭтапыОплаты			 - ТаблицаЗначений	 - возвращаемые сведения;
//  Шапка				 - Структура		 - реквизиты шапки документа (см. Модуль_ИнтеграцияУниверсальный.ДанныеШапки);
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииЭтаповГрафикаОплат(ЭтапыОплаты, Шапка, СтандартнаяОбработка) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПредставлениеНоменклатуры.
//
// Параметры:
//  Представление			 - Строка - параметр, в который возвращается полученное представление номенклатуры;
//  Номенклатура			 - Строка, СправочникСсылка.Номенклатура				 - ссылка на номенклатуру;
//  Характеристика			 - Строка, СправочникСсылка.ХарактеристикиНоменклатуры	 - характеристика номенклатуры;
//  ДополнительныеПараметры	 - Неопределено, Структура								 - см. функцию Модуль_ИнтеграцияУниверсальный.ДополнительныеПараметрыПредставленияНоменклатуры;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииПредставленияНоменклатуры(Представление, Номенклатура, Характеристика, ДополнительныеПараметры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Представление = ПредставлениеНоменклатуры(Номенклатура, Характеристика);
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыУчетаНоменклатуры.
//
// Параметры:
//  ПараметрыНоменклатуры	 - Структура - Коллекция параметров учета номенклатуры в текущей ИБ;
//  СтандартнаяОбработка	 - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииПараметровУчетаНоменклатуры(ПараметрыНоменклатуры, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ХранилищеКонтактнойИнформацииОбъекта.
//
// Параметры:
//  ХранилищеКИ			 - ЛюбаяСсылка	 - место хранения контактной информации;
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект-владелец контактной информации;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииМестаХраненияКонтактнойИнформацииОбъекта(ХранилищеКИ, СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыИсходящихДокументов;
//
Процедура ПриПолученииВидовИсходящихДокументов(ВидыДокументов) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов.
//
// Параметры:
//  ВидыДокументов - ТаблицаЗначений - см. функцию Модуль_ИнтеграцияУниверсальный.ВидыВходящихДокументов;
//
Процедура ПриПолученииВидовВходящихДокументов(ВидыДокументов) Экспорт
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеТоваров
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеТоваров
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);	
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеАвтомобилей
		, ВидыЭД.ТоварнаяНакладная
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.ПоступлениеДопРасходов
		, ВидыЭД.АктОбОказанииУслуг
		, Неопределено);	
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.СчетФактураПолученный
		, ВидыЭД.КорректировочныйСчетФактура
		, Неопределено);
	
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.КорректировкаПоступления
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, Неопределено);
		
	ДобавитьВидДокументаДляОбмена(ВидыДокументов
		, Метаданные.Документы.КорректировкаПоступленияАвтомобилей
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, Неопределено);	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПриПолученииВладельцаОбщихНастроекМодуля.
//
// Параметры:
//  СсылкаНаОбъект		 - ЛюбаяСсылка	 - объект, выступающий в качестве константы для хранения дополнительных свойств;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииВладельцаОбщихНастроекМодуля(СсылкаНаОбъект, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	СсылкаНаОбъект = ПараметрыМетодаПечати.МассивОбъектов[0];
	
	ИмяМакета = "ПФ_MXL_СчетНаОплату";
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили") Тогда
		ИмяМакета = "СчетНаОплатуЗаАвтомобили";
	КонецЕсли;
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект);
	
	НовыйЭлементТаблицы = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	НовыйЭлементТаблицы.ИмяМакета 	= ИмяМакета;
	НовыйЭлементТаблицы.ИмяВРЕГ 	= ВРег(НовыйЭлементТаблицы.ИмяМакета);
	
КонецПроцедуры //ПередФормированиемПечатнойФормыСчетаНаОплату()

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт
	
	ПараметрыСчета = МетаСчетаНаОплату(СчетНаОплату);
	
	Мета.Сумма = ПараметрыСчета.СуммаСНалогом;
	Мета.СуммаНДС = ПараметрыСчета.СуммаНалога;
	Мета.ДокументБезНДС = Не ПараметрыСчета.ЕстьНалог;
	
КонецПроцедуры // ПриЗаполненииМетыНеформализованногоСчетаНаОплату()

// См. метод "ПередФормированиемПечатнойФормыСверкиВзаиморасчетов" в "Модуль_ИнтеграцияУниверсальный"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "Модуль_ИнтеграцияУниверсальный"
//
Процедура ПередФормированиемПечатнойФормыСверкиВзаиморасчетов(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
	МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.АктСверкиВзаиморасчетов");
	
	НоваяПФ = ПараметрыМетодаПечати.КоллекцияПечатныхФорм.Добавить();
	
	НоваяПФ.ИмяМакета 	= "ПФ_MXL_АктСверки";
	НоваяПФ.ИмяВРЕГ		= ВРЕГ(НоваяПФ.ИмяМакета);
	НоваяПФ.Экземпляров	= 1;
	
КонецПроцедуры //ПередФормированиемПечатнойФормыСверкиВзаиморасчетов()


#Область СопоставлениеНоменклатуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СвойстваНоменклатурыИнформационнойБазы.
// Определяет свойства набора номенклатур информационной базы.
// Устанавливает обязательность использования характеристик и упаковок номенклатуры.
//
// Параметры:
//  НаборНоменклатуры - Массив из ОпределяемыйТип.НоменклатураБЭД - ссылки на номенклатуру ИБ, для которой требуется определить свойства.
//  СвойстваНоменклатурИБ - Соответствие - содержит:
//  * Ключ     - ОпределяемыйТип.НоменклатураБЭД - ссылка на номенклатуру ИБ.
//  * Значение - Структура                       - содержит свойства номенклатуры ИБ. См. Модуль_ИнтеграцияУниверсальный.НовыеСвойстваНоменклатурыИБ.
//
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(Знач НаборНоменклатуры, СвойстваНоменклатурИБ) Экспорт
	
	ВариантыИспользованияХарактестик = Новый Массив;
	ВариантыИспользованияХарактестик.Добавить(ВариантИспользованияХарактеристик_ОбщиеДляТипаНоменклатуры());
	ВариантыИспользованияХарактестик.Добавить(ВариантИспользованияХарактеристик_ИндивидуальныеДляНоменклатуры());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТипыНоменклатуры.ИспользованиеХарактеристик В (&ВариантыИспользованияХарактестик)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьХарактеристики,
	|	ИСТИНА КАК ИспользоватьУпаковки,
	|	ИСТИНА КАК ОбязательноеЗаполнениеХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыНоменклатуры КАК ТипыНоменклатуры
	|		ПО Номенклатура.ТипНоменклатуры = ТипыНоменклатуры.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка В(&НаборНоменклатуры)";
	
	Запрос.УстановитьПараметр("НаборНоменклатуры", НаборНоменклатуры);
	Запрос.УстановитьПараметр("ВариантыИспользованияХарактестик", ВариантыИспользованияХарактестик);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваНоменклатуры = МенеджерИнтеграции_НовыеСвойстваНоменклатурыИБ();
		ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, Выборка);
		
		СвойстваНоменклатурИБ.Вставить(Выборка.Номенклатура, СвойстваНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняется при подборе недостающих данных о номенклатуре информационной базы по уже имеющимся,
// а также номенклатуре контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//
Процедура ПриПодбореНоменклатурыИнформационнойБазы(Знач НоменклатураКонтрагента, НоменклатураИБ) Экспорт
	
	РеквизитыНоменклатуры = Новый Структура;
	РеквизитыНоменклатуры.Вставить("ОсновнаяЕдиницаИзмерения");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛокальная(НоменклатураИБ.Номенклатура, РеквизитыНоменклатуры);
	
	ЕдиницаИзмерения = РеквизитыНоменклатуры.ОсновнаяЕдиницаИзмерения;
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		НоменклатураИБ.Упаковка = ЕдиницаИзмерения;
	КонецЕсли;
	
КонецПроцедуры

// Выполяется при записи соответствия номенклатуры контрагента и номенклатуры информационной базы.
// Позволяет переопределить место хранения соответствия номенклатуры в текущей конфигурации.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - данные номенклатуры контрагента (см. НоваяНоменклатураКонтрагента)
//  НоменклатураИБ - Структура - данные о номенклатуре информационной базы (имеющиеся или требующие подбора).
//                               См. НоваяНоменклатураИнформационнойБазы.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаписиСоответствияНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоРедакция6_1() Тогда
		ЗаписатьСоответствиеНоменклатурыБЭД(НоменклатураКонтрагента, НоменклатураИБ);
	Иначе 
		ПриЗаписиСоответствияНоменклатуры_Редакция60(НоменклатураКонтрагента, НоменклатураИБ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиСоответствияНоменклатуры_Редакция60(НоменклатураКонтрагента, НоменклатураИБ)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Т.ЕдиницаИзмерения КАК Упаковка,
	|	Т.Идентификатор КАК Идентификатор,
	|	Т.Владелец КАК Владелец
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.Владелец = &Владелец
	|	И Т.Идентификатор = &Идентификатор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", НоменклатураКонтрагента.Владелец);
	Запрос.УстановитьПараметр("Идентификатор", НоменклатураКонтрагента.Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		Запись = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		Запись.УстановитьНовыйКод();
		
	ИначеЕсли Выборка.Количество() = 1 И Выборка.Следующий() Тогда
		
		Запись = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Запись.Владелец = НоменклатураКонтрагента.Владелец;
	Запись.Идентификатор = НоменклатураКонтрагента.Идентификатор;
	Запись.Наименование = НоменклатураКонтрагента.Наименование;
	Запись.Артикул = НоменклатураКонтрагента.Артикул;
	
	Запись.Номенклатура = НоменклатураИБ.Номенклатура;
	Запись.ХарактеристикаНоменклатуры = НоменклатураИБ.Характеристика;
	Запись.ЕдиницаИзмерения = НоменклатураИБ.Упаковка;
	
	Запись.ОбменДанными.Загрузка = Истина;
	
	Попытка
		
		Запись.Записать();
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Не удалось записать элемент справочника ""Номенклатура поставщиков"" по причине:
							|%1'");
		ТекстОшибки = КраткоеПредставлениеОшибки(Ошибка);
		
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаЗагрузка()
			, УровеньЖурналаРегистрации.Ошибка
			, Запись.Метаданные()
			,
			, ТекстОшибки);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Выполяется при чтении соответствия номенклатуры контрагента и номенклатуры информационной базы.
//
// Параметры:
//  Результат - Соответствие - (возвращаемый параметр) содержит элементы:
//    * Ключ - Строка - идентификатор номенклатуры контрагента;
//    * Значение - Структура - номенклатура информационной базы (см. НоваяНоменклатураИнформационнойБазы)
//  ВладелецНоменклатуры - ЛюбаяСсылка - Владелец номенклатуры (контрагент/партнер).
//  ИдентификаторыНоменклатуры - Массив из Строка - идентификаторы номенклатуры контрагентов.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЧтенииСоответствияНоменклатуры(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоРедакция6_1() Тогда
		
		ПриЧтенииСоответствияНоменклатуры_6_1(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры);
		
	Иначе
		
		ПриЧтенииСоответствияНоменклатуры_6_0(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЧтенииСоответствияНоменклатуры_6_0(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры)
	
	ТекстЗапроса = ПриЧтенииСоответствияНоменклатуры_ТекстЗапроса60();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("ИдентификаторыНоменклатуры", ИдентификаторыНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоменклатураИБ = МенеджерИнтеграции_НоваяНоменклатураИнформационнойБазы();
		ЗаполнитьЗначенияСвойств(НоменклатураИБ, Выборка);
		Результат.Вставить(Выборка.Идентификатор, НоменклатураИБ);
		
	КонецЦикла;

КонецПроцедуры

Процедура ПриЧтенииСоответствияНоменклатуры_6_1(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры)
	
	Результат = ПрочитатьСоответствиеНоменклатурыБЭД(ВладелецНоменклатуры, ИдентификаторыНоменклатуры);
	
	НесопоставленныеИдентификаторы = Новый Массив;
	Для Каждого Идентификатор Из ИдентификаторыНоменклатуры Цикл
		Если Результат.Получить(Идентификатор) = Неопределено Тогда
			НесопоставленныеИдентификаторы.Добавить(Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НесопоставленныеИдентификаторы) Тогда
		
		РезультатПереноса = ПеренестиСопоставлениеНоменклатуры_НоменклатураКонтрагентов(ВладелецНоменклатуры, НесопоставленныеИдентификаторы);
		
		Если ЗначениеЗаполнено(РезультатПереноса) Тогда
			Результат = ПрочитатьСоответствиеНоменклатурыБЭД(ВладелецНоменклатуры, ИдентификаторыНоменклатуры);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ПеренестиСопоставлениеНоменклатуры_НоменклатураКонтрагентов(ВладелецНоменклатуры, НесопоставленныеИдентификаторы)
	
	Результат = Новый Соответствие;
	
	ПриЧтенииСоответствияНоменклатуры_НоменклатураКонтрагентов(Результат, ВладелецНоменклатуры, НесопоставленныеИдентификаторы);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Для Каждого ЭлементЗаписи Из Результат Цикл 
			
			КлючевыеПоля = Новый Структура;
			КлючевыеПоля.Вставить("Владелец", ВладелецНоменклатуры);
			КлючевыеПоля.Вставить("Идентификатор", ЭлементЗаписи.Ключ);
			ЗаписатьСоответствиеНоменклатурыБЭД(КлючевыеПоля, ЭлементЗаписи.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат; 

КонецФункции

Процедура ПриЧтенииСоответствияНоменклатуры_НоменклатураКонтрагентов(Результат, ВладелецНоменклатуры, ИдентификаторыНоменклатуры)
	
	ТекстЗапроса = ПриЧтенииСоответствияНоменклатуры_ТекстЗапроса61();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("ИдентификаторыНоменклатуры", ИдентификаторыНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоменклатураИБ = МенеджерИнтеграции_НоваяНоменклатураИнформационнойБазы();
		ЗаполнитьЗначенияСвойств(НоменклатураИБ, Выборка);
		Результат.Вставить(Выборка.Идентификатор, НоменклатураИБ);
		
	КонецЦикла;

КонецПроцедуры

Функция ПриЧтенииСоответствияНоменклатуры_ТекстЗапроса60()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СопоставленнаяНоменклатура.Идентификатор КАК Идентификатор,
	|	СопоставленнаяНоменклатура.Номенклатура КАК Номенклатура,
	|	СопоставленнаяНоменклатура.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СопоставленнаяНоменклатура.ЕдиницаИзмерения КАК Упаковка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК СопоставленнаяНоменклатура
	|ГДЕ
	|	СопоставленнаяНоменклатура.Владелец = &Владелец
	|	И СопоставленнаяНоменклатура.Идентификатор В(&ИдентификаторыНоменклатуры)
	|	И НЕ СопоставленнаяНоменклатура.ПометкаУдаления";
	
	Возврат Результат;

КонецФункции

Функция ПриЧтенииСоответствияНоменклатуры_ТекстЗапроса61()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СопоставленнаяНоменклатура.ИдентификаторНоменклатуры КАК Идентификатор,
	|	СопоставленнаяНоменклатура.Номенклатура КАК Номенклатура,
	|	СопоставленнаяНоменклатура.Характеристика КАК Характеристика,
	|	СопоставленнаяНоменклатура.Упаковка КАК Упаковка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК СопоставленнаяНоменклатура
	|ГДЕ
	|	СопоставленнаяНоменклатура.ВладелецНоменклатуры = &Владелец
	|	И СопоставленнаяНоменклатура.ИдентификаторНоменклатуры В(&ИдентификаторыНоменклатуры)
	|	И НЕ СопоставленнаяНоменклатура.ПометкаУдаления";
	
	Возврат Результат;

КонецФункции

// Выполняется при заполнении описания и взаимосвязей объектов, составляющих номенклатуру информационной базы.
//
// Параметры:
//  МетаданныеСопоставления - Структура - метаданные и взаимосвязь объектов, составляющих номенклатуру ИБ.
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииМетаданныхСопоставленияНоменклатуры(МетаданныеСопоставления, СтандартнаяОбработка) Экспорт
	
	Если ЭтоРедакция6_1() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	МетаданныеСопоставления.ВладелецНоменклатурыТип = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	МетаданныеСопоставления.НоменклатураТип = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	МетаданныеСопоставления.ХарактеристикаТип = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
	МетаданныеСопоставления.УпаковкаТип = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
	
КонецПроцедуры

// Запоняет варианты сопоставления номенклатурыИБ по полям НоменклатураКонтрагента
//
// Параметры:
//  Результат				 - Массив - Используется для заполнения контрактами НоваяНоменклатураИнформационнойБазы
//  НоменклатураКонтрагента	 - Структура - Структура полей см. Контракт_НоменклатураКонтрагента
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПриЗаполненииВариантовСопоставленияНоменклатуры(Результат, НоменклатураКонтрагента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Функция МенеджерИнтеграции_НоваяНоменклатураИнформационнойБазы(Номенклатура = Неопределено, Характеристика = Неопределено, Упаковка = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяНоменклатураИнформационнойБазы"
		, Номенклатура
		, Характеристика
		, Упаковка);
	
	Возврат Результат;
	
КонецФункции

// Создает или обновляет запись в регистре сведений НоменклатураКонтрагентовБЭД.
//
// Параметры:
//  НоменклатураИБ					 - Структура - см. функцию НоваяНоменклатураИнформационнойБазы;
//  ВладелецНоменклатуры			 - СправочникСсылка	 - владелец номенклатуры (контрагент/партнер);
//  РеквизитыНоменклатурыКонтрагента - Структура - см. функцию НовыйКлючевыеСвойстваНоменклатураПоставщика;
//
Процедура ЗаписатьСоответствиеНоменклатурыБЭД(НоменклатураКонтрагента, НоменклатураИБ)
	
	Набор = РегистрыСведений.НоменклатураКонтрагентовБЭД.СоздатьНаборЗаписей();
	Набор.Отбор.Владелец.Установить(НоменклатураКонтрагента.Владелец);
	Набор.Отбор.Идентификатор.Установить(НоменклатураКонтрагента.Идентификатор);
	
	Запись = Набор.Добавить();
	
	ЗаполнитьЗначенияСвойств(Запись, НоменклатураКонтрагента);
	ЗаполнитьЗначенияСвойств(Запись, НоменклатураИБ);
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПрочитатьСоответствиеНоменклатурыБЭД(ВладелецНоменклатуры, ИдентификаторыНоменклатуры)
	
	Результат = Новый Соответствие;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СопоставленнаяНоменклатура.Идентификатор КАК Идентификатор,
	|	СопоставленнаяНоменклатура.Номенклатура КАК Номенклатура,
	|	СопоставленнаяНоменклатура.Характеристика КАК Характеристика,
	|	СопоставленнаяНоменклатура.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентовБЭД КАК СопоставленнаяНоменклатура
	|ГДЕ
	|	СопоставленнаяНоменклатура.Владелец = &Владелец
	|	И СопоставленнаяНоменклатура.Идентификатор В(&ИдентификаторыНоменклатуры)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("ИдентификаторыНоменклатуры", ИдентификаторыНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоменклатураИБ = МенеджерИнтеграции_НоваяНоменклатураИнформационнойБазы();
		ЗаполнитьЗначенияСвойств(НоменклатураИБ, Выборка);
		Результат.Вставить(Выборка.Идентификатор, НоменклатураИБ);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

Процедура ЗаполнитьСоответствиеПолейВходящегоДокумента(ОбъектМетаданных, ИменаПолей) Экспорт
	
	ИменаПолей.Номер = "ВхДокНомер";
	ИменаПолей.Дата	 = "ВхДокДата";
	
КонецПроцедуры

// Заполняет таблицу правил обработки входящих электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - правила обработки документов (см. ПравилаОбработкиВходящихДокументов);
//
// Пример:
//	Если ПолучитьФункциональнуюОпцию("ВедетсяПроизводственнаяДеятельность") Тогда
//		
//		ДобавитьПравилоОбработкиДокументов(ПравилоОбработки
//			, "ПоступлениеВПереработку" // Описание правила задается в процедуре ПриПолученииПравилаОбработкиЭлектронногоДокумента
//			, "ТоварнаяНакладная" 		// Используется для накладных
//			, Ложь); 					// Для исправлений не используется, только для первичных документов
//		
//	КонецЕсли;
//
Процедура ЗаполнитьПравилаОбработкиВходящихДокументов(ПравилаОбработки) Экспорт
	
	ЗаполнитьПравилаОбработкиПервичныхДокументов(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки);
	ЗаполнитьПравилаОбработкиАктовСверки(ПравилаОбработки);
	
КонецПроцедуры

// Обработчик получения правила отражения электронного документа в учетной системе.
// Вызывается из Модуль_ИнтеграцияУниверсальный.ПравилоОбработкиЭлектронныхДокументов.
//
// Параметры:
//  ПравилоОбработки	 - Структура - описание способа обработки электронного документа (см. ПравилоОбработкиЭлектронныхДокументов);
//  СтандартнаяОбработка - Булево - Истина, если специальная обработка не требуется,
//                                  а идентификатор совпадает с именем метаданных документа;
//
// Пример:
//
//	Если ПравилоОбработки.Идентификатор = "ПоступлениеВПереработку" Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		ДополнительныеПараметры = Новый Структура;
//		ДополнительныеПараметры.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
//		
//		ПравилоОбработки.Представление = "Поступление материалов в переработку";
//		ПравилоОбработки.ОбъектМетаданных = Метаданные.Документы.ПоступлениеТоваровУслуг.ПолноеИмя();
//		ПравилоОбработки.ДополнительныеПараметры = ДополнительныеПараметры;
//		
//	КонецЕсли;
//
Процедура ПриПолученииПравилаОбработкиЭлектронногоДокумента(ПравилоОбработки, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.НовыйДокументИнформационнойБазы.
//
// Параметры:
//  ДокументОбъект		 - ДокументОбъект	 - новый, еще не записанный, документ-объект;
//  ДанныеЭД			 - Структура		 - содержит данные электронного документа
//                                             (см. Модуль_ИнтеграцияУниверсальный.ДанныеЭлектронногоДокумента);
//  ПараметрыЗаполнения	 - Структура		 - содержит дополнительные параметры заполнения;
//  СтандартнаяОбработка - Булево			 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриСозданииДокументаИнформационнойБазы(ДокументОбъект, ДанныеЭД, ПараметрыЗаполнения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если МетаданныеДокумента = Метаданные.Документы.ПоступлениеТоваров Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияТоваров(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеТоваров(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ПоступлениеАвтомобилей Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияАвтомобилей(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеАвтомобилей(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ПоступлениеДопРасходов Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияПоступленияДопРасходов(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьПоступлениеДопРасходов(ДокументОбъект, СтруктураЗаполнения);	
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.ВозвратОтПокупателя Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияВозвратаОтПокупателя(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьВозвратОтПокупателя(ДокументОбъект, СтруктураЗаполнения);	
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.КорректировкаПоступления Тогда
		
		ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
		
		Если ФорматЭД.ЭтоКорректировка Тогда
			СтруктураЗаполнения = СтруктураЗаполненияКорректировкиПоступления(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьКорректировкуПоступления(ДокументОбъект, СтруктураЗаполнения);
		Иначе 
			СтруктураЗаполнения = СтруктураЗаполненияИсправленияПоступления(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьИсправлениеПоступления(ДокументОбъект, СтруктураЗаполнения);
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.КорректировкаПоступленияАвтомобилей Тогда
		
		ФорматЭД = ДанныеЭД.ЭлектронныйДокумент.Формат;
		
		Если ФорматЭД.ЭтоКорректировка Тогда
			СтруктураЗаполнения = СтруктураЗаполненияКорректировкиПоступленияАвтомобилей(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьКорректировкуПоступленияАвтомобилей(ДокументОбъект, СтруктураЗаполнения);
		Иначе
			СтруктураЗаполнения = СтруктураЗаполненияИсправлениеПоступленияАвтомобилей(ДанныеЭД, ПараметрыЗаполнения);
			ЗаполнитьИсправлениеПоступленияАвтомобилей(ДокументОбъект, СтруктураЗаполнения);
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.СчетФактураПолученный Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияСчетаФактурыПолученного(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьСчетФактуруПолученный(ДокументОбъект, СтруктураЗаполнения);
		
	ИначеЕсли МетаданныеДокумента = Метаданные.Документы.АктСверкиВзаиморасчетов Тогда
		
		СтруктураЗаполнения = СтруктураЗаполненияАктаСверкиВзаиморасчетов(ДанныеЭД, ПараметрыЗаполнения);
		ЗаполнитьАктСверкиВзаиморасчетов(ДокументОбъект, СтруктураЗаполнения);
		
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ИмяСправочникаВладельцаНоменклатуры.
//
// Параметры:
//  ИмяСправочника		 - Строка - имя справочника, которому подчинен справочник "НоменклатураКонтрагентов" или "НоменклатураПоставщиков" для редакции 6.1;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриОпределенииИмениСправочникаВладельцаНоменклатуры(ИмяСправочника, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.МетаданныеПрикладногоСправочника.
//
// Параметры:
//  СоответствиеСправочников - Соответствие - ключом является имя справочника в терминах сервиса, а значением - метаданные прикладного справочника;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСоответствияСправочников(СоответствиеСправочников, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СоответствиеСправочников.Вставить("Валюты"			, Метаданные.Справочники.Валюты);
	СоответствиеСправочников.Вставить("СтраныМира"		, Метаданные.Справочники.СтраныМира);
	СоответствиеСправочников.Вставить("ЕдиницыИзмерения", Метаданные.Справочники.КлассификаторЕдиницИзмерения);
	
	СоответствиеСправочников.Вставить("Организации"				, Метаданные.Справочники.Организации);
	СоответствиеСправочников.Вставить("Контрагенты"				, Метаданные.Справочники.Контрагенты);
	СоответствиеСправочников.Вставить("Партнеры"				, Неопределено);
	СоответствиеСправочников.Вставить("ДоговорыКонтрагентов"	, Метаданные.Справочники.ДоговорыВзаиморасчетов);
	СоответствиеСправочников.Вставить("Номенклатура"			, Метаданные.Справочники.Номенклатура);
	СоответствиеСправочников.Вставить("УпаковкиНоменклатуры"	, Метаданные.Справочники.КлассификаторЕдиницИзмерения);
	
	СоответствиеСправочников.Вставить("БанковскиеСчетаОрганизаций"	, Метаданные.Справочники.БанковскиеСчета);
	СоответствиеСправочников.Вставить("БанковскиеСчетаКонтрагентов"	, Метаданные.Справочники.БанковскиеСчета);
	
	Если ИспользуетсяСправочникКлассификаторБанков() Тогда
		СоответствиеСправочников.Вставить("Банки", Метаданные.Справочники.КлассификаторБанков);
	Иначе
		СоответствиеСправочников.Вставить("Банки", Метаданные.Справочники.КлассификаторБанковРФ);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СсылкаОбъектаПоПолямПоиска.
//
// Параметры:
//  СсылкаНаОбъект		 - Произвольный - ссылка на искомый объект;
//  ПоляПоиска			 - Структура - содержит параметры поиска;
//  ОбъектМетаданных	 - ОбъектМетаданных - метаданные искомого объекта;
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события;
//
// Пример:
//
//  НаименованиеПолное = Неопределено;
//  Если ПоляПоиска.Свойство("НаименованиеПолное", НаименованиеПолное) 
//      И Не ЕстьРеквизитМетаданных(ОбъектМетаданных, "НаименованиеПолное") 
//      И ЕстьРеквизитМетаданных(ОбъектМетаданных, "ПолноеНаименование") Тогда
//          
//          ПоляПоиска.Удалить("НаименованиеПолное");
//          ПоляПоиска.Вставить("ПолноеНаименование", НаименованиеПолное);
//          
//  КонецЕсли;
//
Процедура ПриПолученииСсылкиПоПолямПоиска(СсылкаНаОбъект, ПоляПоиска, ОбъектМетаданных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.СчетаФактурыПоОснованию.
//
// Параметры:
//  НайденныеДокументы	 - Массив	 - Ссылки на найденные счета-фактуры;
//  ПараметрыРегистрации - Структура - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  СтандартнаяОбработка - Булево	 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПолученииСчетовФактурПоОснованию(НайденныеДокументы, ПараметрыРегистрации, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СчетФактура = ПодчиненныйСчетФактура(ПараметрыРегистрации.Ссылка);
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		НайденныеДокументы.Добавить(СчетФактура);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактурыПоОснованию.
//
// Параметры:
//  ПараметрыРегистрации - Структура	 - см. Модуль_ИнтеграцияУниверсальный.ПараметрыРегистрацииСчетаФактуры();
//  ДокументОснование	 - ЛюбаяСсылка	 - документ, на основании которого необходимо получить параметры;
//  СтандартнаяОбработка - Булево		 - Ложь, чтобы отключить стандартную обработку события;
//
Процедура ПриПодготовкеПараметровРегистрацииСчетаФактуры(ПараметрыРегистрации, ДокументОснование, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СборПротоконтента

Процедура ЗаполнитьКонтентXmlUTD(Прото, СсылкаНаОбъект, ПараметрыФормирования) Экспорт
	
	ПараметрыФормированияXML = ПараметрыФормирования.ПараметрыФормированияФайла;
	Точность = ПараметрыФормированияXML.ТочностьЦены;
	
	ОписаниеФормата = ПараметрыФормирования.ФорматОтправки;
	
	МенеджерИнтеграции_ЗаполнитьНаименованиеФункцию155(Прото, ОписаниеФормата);
	
	ДанныеДокумента = ДанныеДляФормированияУПД(СсылкаНаОбъект);
	Шапка	= ДанныеДокумента.Шапка;
	Товары	= ДанныеДокумента.Товары;
	ПРД		= ДанныеДокумента.ПРД;
	
	ОписаниеДокумента	= Шапка.ОписаниеДокумента;
	ЭтоИсправление		= ОписаниеДокумента.ЭтоИсправление;
	
	ДатаНомер = Шапка.ДатаНомерДокумента;
	
	ЗаполнитьДатуНомер155(Прото, ДатаНомер, ЭтоИсправление);
		
	СтрокиСТоварами = Товары.НайтиСтроки(Новый Структура("НоменклатураТип", ТипНоменклатурыТовар()));
	ЕстьТовары = ЗначениеЗаполнено(СтрокиСТоварами);
	ЗаполнитьСведенияОбУчастниках155(Прото, Шапка, ЕстьТовары);
	
	ИдентификаторПродавца = ПараметрыФормирования.Отправитель_FnsParticipantId;
	УстановитьИдентификаторПродавца155(Прото, ИдентификаторПродавца);
	
	ИдентификаторПокупателя = ПараметрыФормирования.Получатель_FnsParticipantId;
	УстановитьИдентификаторПокупателя155(Прото, ИдентификаторПокупателя);
	
	ЗаполнитьСведенияОСоставителе155(Прото, Шапка);
	
	ЗаполнитьПлатежноРасчетныеДокументы155(Прото, ПРД);
	
	ЗаполнитьГосударственныйКонтракт155(Прото, Шапка);
	
	ЗаполнитьВалюту155(Прото, Шапка);
	
	ЗаполнитьСведенияОПередаче155(Прото, Шапка);
	
	ИспользоватьБезДокументаОснования = ПараметрыФормирования.УказыватьОтсутствиеОснованияУПД;
	ЗаполнитьОснованияПередачи155(Прото, Шапка, ИспользоватьБезДокументаОснования);
	
	ЗаполнитьStructedAdditionalInfos(Прото.AdditionalInfoId.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	ЗаполнитьТабличнуюЧасть155(Прото, Товары, Шапка.ЭтоАванс, Точность);
	
	ЕстьФункцияПД = (Прото.Function = "InvoiceAndBasic" ИЛИ Прото.Function = "Basic");
	
	Если ЕстьТовары И ЕстьФункцияПД Тогда
		Сотрудник = ПараметрыФормирования.ДанныеСотрудника;
		ЗаполнитьСведенияОЛицеПередавшемТовар155(Прото, Сотрудник);
	КонецЕсли;
	
	МенеджерИнтеграции_ДобавитьСлужебнуюИнформациюВШапку(Прото, Шапка);
	ДобавитьДокументыОснованияВСлужебнуюИнформацию(Прото);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlUCD(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ДанныеДляПечати = ДанныеДляФормированияУКД(ДокСсылка, Новый Структура("ФункцияУПД", ПараметрыФормирования.ФункцияДокумента));
	
	ШапкаУКД 		= ДанныеДляПечати.Шапка;
	ТаблицаТоваров  = ДанныеДляПечати.ТабличнаяЧасть;
	
	Content.Function = ШапкаУКД.Функция;
	
	Если ШапкаУКД.Функция = "InvoiceAndBasic" Тогда
		Content.Name = "Корректировочный счет-фактура и документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	ИначеЕсли ШапкаУКД.Функция = "Basic" Тогда
		Content.Name = "Документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
	КонецЕсли;
	
	ОписаниеДокумента	= ШапкаУКД.ОписаниеДокумента;
	ЭтоИсправление		= ОписаниеДокумента.ЭтоИсправление;
	
	ДатаНомер = ШапкаУКД.ДатаНомерДокумента;
	
	Content.Number	 = ДатаНомер.НомерДокумента;
	Content.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Content.RevisionNumber	 = ДатаНомер.НомерИсправления;
		Content.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
	Для каждого ДатаНомерДокументаОснования Из ДатаНомер.ДатаНомерДокументовОснований Цикл
		ЗаполнитьInvoiceForCorrectionInfo(Content.Invoices, ДатаНомерДокументаОснования);
	КонецЦикла;
	
	СтрокиСТоварами	= ТаблицаТоваров.НайтиСтроки(Новый Структура("НоменклатураТип", ТипНоменклатурыТовар()));
	ЕстьТовары		= ЗначениеЗаполнено(СтрокиСТоварами);
	
	ЗаполнитьСведенияОбУчастникахУКД(Content, ШапкаУКД, ЕстьТовары);
	
	ИдентификаторПродавца = ПараметрыФормирования.Отправитель_FnsParticipantId;
	УстановитьИдентификаторПродавца155(Content, ИдентификаторПродавца);
	
	ИдентификаторПокупателя = ПараметрыФормирования.Получатель_FnsParticipantId;
	УстановитьИдентификаторПокупателя155(Content, ИдентификаторПокупателя);
	
	ЗаполнитьСведенияОСоставителе155(Content, ШапкаУКД);
		
	ВалютаРеглУчета = ВалютаРеглУчета();
	
	Content.ВалютаСсылка 	= ?(ШапкаУКД.РасчетыВУсловныхЕдиницах, ВалютаРеглУчета, ШапкаУКД.Валюта);
	Content.Currency 		= ?(ЗначениеЗаполнено(Content.ВалютаСсылка), Строка(Content.ВалютаСсылка.Код), "");
	
	ШапкаУКД.Свойство("ИдентификаторГосконтракта", Content.GovernmentContractInfo);
	
	ЗаполнитьStructedAdditionalInfos(Content.AdditionalInfoId.StructedAdditionalInfos, ПараметрыФормирования.ДополнительныеСведенияСтрокой);
	
	ЗаполнитьInvoiceCorrectionTable(Content.InvoiceCorrectionTable, ТаблицаТоваров);
	
	ЗаполнитьEventContent(Content.EventContent, ШапкаУКД);
	
	МенеджерИнтеграции_ДобавитьСлужебнуюИнформациюВШапку(Content, ШапкаУКД);
	
	Content.СлужебнаяИнформация.Вставить("ПередаточныеДокументы", ШапкаУКД.ПередаточныеДокументы);
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlTorg12(Content, Знач ДокСсылка, ПараметрыФормирования) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

Процедура ЗаполнитьКонтентXmlAcceptanceCertificate(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoice(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

Процедура ЗаполнитьКонтентInvoiceCorrection(Content, ДокСсылка, ПараметрыФормирования) Экспорт
	
	ВызватьИсключение "TODO";
	
КонецПроцедуры

#КонецОбласти

Процедура ДобавитьДокументыОснованияВСлужебнуюИнформацию(Контент)
	
	СсылкаНаОбъект = Контент.СлужебнаяИнформация.Ссылка;
	
	Если НЕ ЭтоСчетФактура(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитов = ЗначенияРеквизитовОбъектаЛокальная(СсылкаНаОбъект, "ДокументОснование");
	ДокументОснование = СтруктураРеквизитов.ДокументОснование;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ЭтоАванс = ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекНаОплату")
				ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Выписка");
					
		Если НЕ ЭтоАванс Тогда
		
			ДокументыОснования = Новый Массив;
			ДокументыОснования.Добавить(ДокументОснование);
			Контент.СлужебнаяИнформация.Вставить("ДокументыОснования", ДокументыОснования);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоСчетФактура(СсылкаНаОбъект)
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	Результат = (ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНакладная(СсылкаНаОбъект) Экспорт
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(Тип("ДокументСсылка.РеализацияАвтомобилей"));
	ПодходящиеТипы.Добавить(Тип("ДокументСсылка.РеализацияАктивов"));
	ПодходящиеТипы.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	
	Результат = (ПодходящиеТипы.Найти(ТипСсылки) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетНаОплату(СсылкаНаОбъект) Экспорт
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(Тип("ДокументСсылка.СчетНаОплату"));
	ПодходящиеТипы.Добавить(Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили"));
	
	Результат = (ПодходящиеТипы.Найти(ТипСсылки) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКорректировкаРеализации(СсылкаНаОбъект) Экспорт
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ПодходящиеТипы.Добавить(Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей"));
	
	Результат = (ПодходящиеТипы.Найти(ТипСсылки) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВозвратТоваровОтКлиента(СсылкаНаОбъект) Экспорт
		
	Возврат (НЕ Метаданные.Документы.Найти("ВозвратОтПокупателя") = Неопределено
			  И ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ВозвратОтПокупателя"));
		
КонецФункции

Функция ЭтоВыбытиеИзОборотаМаркируемойПродукции(ДокументСсылка) Экспорт
		
	Возврат Неопределено;
		
КонецФункции

Функция ИспользуетсяСправочникКлассификаторБанков()
	
	Версия = ВерсияПодсистемыАА();
	Результат = (СравнитьВерсии(Версия, "6.1.20") >= 0);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(СсылкаНаОбъект) Экспорт
	
	Результат = Документы.СчетФактураВыданный.НайтиПоРеквизиту("ДокументОснование", СсылкаНаОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетНаОплатуНаОснованииРТУ(СсылкаНаОбъект) Экспорт
	Возврат Неопределено;
КонецФункции

Функция ПолучитьЗаказПокупателяНаОснованииРТУ(СсылкаНаОбъект) Экспорт
	Возврат Неопределено;
КонецФункции

// Формирует структуру с данными, которые необходимы для визуализации ПФ счета на оплату.
// Табличный документ формируется средствами Диадок.
//
// Параметры:
//  СсылкаНаОбъект - ДокументСсылка - документ, на основании которого формируем печатную форму.
// 
// Возвращаемое значение:
//   Структура
//
Функция РезультатВизуализацииСчетаНаОплатуСредствамиДиадок(СсылкаНаОбъект, ПараметрыОтправкиНаСогласование =  Неопределено, ФИОПодписанта = "") Экспорт
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "РезультатВизуализацииСчетаНаОплатуСредствамиКонфигурации", СсылкаНаОбъект);
	
	Возврат Результат;
	
КонецФункции

#Область МашиночитаемыеДоверенности
 
Функция МЧД_ИмяСправочникаВИнформационнойБазе(СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

Функция МЧД_ДанныеДоверенности(Ссылка, СтандартнаяОбработка) Экспорт
	
	Перем Результат;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтавкиНДС

Функция МенеджерИнтеграции_ОбщаяРасчетнаяСтавкаНДС(Дата = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОбщаяРасчетнаяСтавкаНДС", Дата);
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ЭтоСтавкаНДСИНА(Знач ПредставлениеСтавки)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЭтоСтавкаНДСИНА", ПредставлениеСтавки);
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_СтавкаБезНДС()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СтавкаБезНДС");
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСПоПредставлению(ПредставлениеСтавки, Дата = Неопределено)
	
	Если МенеджерИнтеграции_ЭтоСтавкаНДСИНА(ПредставлениеСтавки) Тогда
		Результат = МенеджерИнтеграции_ОбщаяРасчетнаяСтавкаНДС(Дата);
	Иначе 
		Результат = ЗначениеСтавкиНДС(ПредставлениеСтавки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	ЗначениеНДС = Неопределено;
	
	Если ПредставлениеСтавки = Неопределено
		ИЛИ СтрНайти("БЕЗ НДС", ВРег(ПредставлениеСтавки)) > 0 Тогда
		
		ЗначениеНДС = ПредставлениеСтавкиБезНДС();
		
	Иначе
		
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "%", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, " ", "");
		СтрСтавкаНДС = СтрЗаменить(ПредставлениеСтавки, "\", "/");
		
		Если СтрНайти("0", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "0";
		ИначеЕсли СтрНайти("5", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "5";
		ИначеЕсли СтрНайти("7", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "7";
		ИначеЕсли СтрНайти("10", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10";
		ИначеЕсли СтрНайти("18", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18";
		ИначеЕсли СтрНайти("20", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20";
		ИначеЕсли СтрНайти("22", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22";
		ИначеЕсли СтрНайти("10/110", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "10/110";
		ИначеЕсли СтрНайти("18/118", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "18/118";
		ИначеЕсли СтрНайти("20/120", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "20/120";
		ИначеЕсли СтрНайти("22/122", СтрСтавкаНДС) > 0 Тогда
			ЗначениеНДС = "22/122";
		Иначе
			ЗначениеНДС = ПредставлениеСтавки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтавкаНДСИзСоответствия(ЗначениеНДС);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтавкиНДС(ЗначениеСтавки)
	
	Если Не ЗначениеЗаполнено(ЗначениеСтавки) Тогда
		
		Результат = "";
		
	ИначеЕсли ЭтоСтавкаНДСИсчисляетсяНалоговымАгентом(ЗначениеСтавки) Тогда
		
		Результат = СтавкаНДСИсчисляетсяНалоговымАгентом();
		
	Иначе
		
		Результат = СтавкаНДСИзСоответствия(, ЗначениеСтавки);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "##";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено)
	
	Результат = Неопределено;
	
	ПеречислениеСтавокНДС = ЗаполнитьСоответствиеСтавокНДС();
	
	Если ЗначениеЗаполнено(ПредставлениеБЭД) Тогда
		
		Результат = ПеречислениеСтавокНДС.Получить(ПредставлениеБЭД);
		
	Иначе
		
		Для Каждого КлючИЗначение Из ПеречислениеСтавокНДС Цикл
			
			Если КлючИЗначение.Значение = ПрикладноеЗначение Тогда
				
				Результат = КлючИЗначение.Ключ;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСоответствиеСтавокНДС()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредставлениеСтавкиБезНДС(), Справочники.СтавкиНДС.БезНДС);
	Результат.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентом(), СтавкаНДСИсчисляетсяНалоговымАгентомПредставление());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиНДС.Наименование КАК Наименование,
	|	СтавкиНДС.Ставка КАК Ставка,
	|	СтавкиНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	НЕ СтавкиНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СтрЗаменить(Строка(Выборка.Наименование), "%", ""), Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом()
	
	Возврат "ИсчНалАг";
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентомПредставление()
	
	Возврат "НДС исчисляется налоговым агентом";
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	
	Возврат "без НДС";
	
КонецФункции

Функция ЭтоСтавкаНДСИсчисляетсяНалоговымАгентом(НалоговаяСтавка) 
	
	ПредставлениеСтавки = СтавкаНДСИзСоответствия(, НалоговаяСтавка);
	
	Возврат ПредставлениеСтавки = "НДС исчисляется налоговым агентом";
	
КонецФункции

#КонецОбласти

Функция НайтиНоменклатуруПоставщика(Владелец, Идентификатор)
	
	Если ЭтоРедакция6_1() Тогда
		
		ТекстЗапроса = НайтиНоменклатуруПоставщика_ТекстЗапроса61();
		
	Иначе 
		
		ТекстЗапроса = НайтиНоменклатуруПоставщика_ТекстЗапроса60();
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Результат = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  

Функция НайтиНоменклатуруПоставщика_ТекстЗапроса60()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Т.ЕдиницаИзмерения КАК Упаковка,
	|	Т.Идентификатор КАК Идентификатор,
	|	Т.Владелец КАК Владелец
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.Владелец = &Владелец
	|	И Т.Идентификатор = &Идентификатор";
	
	Возврат Результат;

КонецФункции

Функция НайтиНоменклатуруПоставщика_ТекстЗапроса61()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Упаковка КАК Упаковка,
	|	Т.ИдентификаторНоменклатуры КАК Идентификатор,
	|	Т.ВладелецНоменклатуры КАК Владелец
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.ВладелецНоменклатуры = &Владелец
	|	И Т.ИдентификаторНоменклатуры = &Идентификатор";
	
	Возврат Результат;

КонецФункции

Функция НайтиСоздатьНомерГТД(НомерТаможеннойДекларации, КодСтраны = Неопределено)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(НомерТаможеннойДекларации) Тогда
		
		СтранаПроисхождения = НайтиСтрану(КодСтраны);
		
		Результат = НайтиНомерГТД(НомерТаможеннойДекларации, СтранаПроисхождения);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = СоздатьНомерГТД(НомерТаможеннойДекларации, СтранаПроисхождения);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиНомерГТД(НомерТаможеннойДекларации, СтранаПроисхождения)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГТД КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.Наименование = &НомерТД
	|	И (&БезУчетаСтраны
	|			ИЛИ Т.Страна = &Страна)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НомерТД", НомерТаможеннойДекларации);
	Запрос.УстановитьПараметр("Страна", СтранаПроисхождения);
	Запрос.УстановитьПараметр("БезУчетаСтраны", Не ЗначениеЗаполнено(СтранаПроисхождения));
	
	Результат = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьНомерГТД(НомерТаможеннойДекларации, СтранаПроисхождения)
	
	Запись = Справочники.ГТД.СоздатьЭлемент();
	Запись.УстановитьНовыйКод();
	Запись.Наименование = НомерТаможеннойДекларации;
	Запись.Страна = СтранаПроисхождения;
	Запись.ОбменДанными.Загрузка = Истина;
	
	Попытка
		
		Запись.Записать();
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Не удалось записать элемент справочника ""ГТД"" по причине:
	                       |%1'");
		ТекстОшибки = КраткоеПредставлениеОшибки(Ошибка);
		
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаЗагрузка()
			, УровеньЖурналаРегистрации.Ошибка
			, Запись.Метаданные()
			,
			, ТекстОшибки);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Результат = Запись.Ссылка;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСтрану(КодСтраны)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(КодСтраны) Тогда
		
		Результат = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВариантИспользованияХарактеристик_ОбщиеДляТипаНоменклатуры()
	Возврат 1;
КонецФункции

Функция ВариантИспользованияХарактеристик_ИндивидуальныеДляНоменклатуры()
	Возврат 2;
КонецФункции

Функция ПервоеПодразделениеОрганизации(Организация)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПодразделенияКомпании.Ссылка КАК Подразделение
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	НЕ ПодразделенияКомпании.ПометкаУдаления
	|	И ПодразделенияКомпании.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение ИЕРАРХИЯ УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Неопределено;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Подразделение;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПервыйСкладОрганизации(Организация, Подразделение = Неопределено)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВсеСклады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.СкладыКомпании КАК ВсеСклады
	|ГДЕ
	|	НЕ ВсеСклады.ПометкаУдаления
	|	И ВсеСклады.Организация = &Организация
	|	И (&БезОтбораПоПодразделению
	|			ИЛИ ВсеСклады.ПодразделениеКомпании = &Подразделение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад ИЕРАРХИЯ УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("БезОтбораПоПодразделению", Не ЗначениеЗаполнено(Подразделение));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Неопределено;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Склад;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПервыйДоговорВзаиморасчетов(Контрагент, Организация, Подразделение = Неопределено)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВсеДоговоры.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ВсеДоговоры
	|ГДЕ
	|	НЕ ВсеДоговоры.ПометкаУдаления
	|	И ВсеДоговоры.Владелец = &Контрагент
	|	И ВсеДоговоры.Организация = &Организация
	|	И (&БезОтбораПоПодразделению
	|			ИЛИ ВсеДоговоры.ПодразделениеКомпании = &Подразделение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("БезОтбораПоПодразделению", Не ЗначениеЗаполнено(Подразделение));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Неопределено;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Договор;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНомера(НомерОбъекта)
	
	ВыводитьПолныйНомерНаПечать = Константы.ПолныйНомерДокументаВПечатныхФормах.Получить();
	
	Если ВыводитьПолныйНомерНаПечать Тогда
		
		Возврат НомерОбъекта;
		
	КонецЕсли;
	
	Если ЭтоРедакция6_1() Тогда
		
		МенеджерПрефиксации = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
		Результат = МенеджерПрефиксации.НомерНаПечать(НомерОбъекта, Истина, Истина);
		
	Иначе
		
		МенеджерПрефиксации = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовПлатформа");
		Результат = МенеджерПрефиксации.ПолучитьНомерНаПечать(НомерОбъекта, Истина, Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодчиненныйСчетФактура(ДокументОснование)
	
	Результат = Неопределено;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СФ.Ссылка КАК Ссылка,
	|	СФ.Проведен КАК Проведен,
	|	СФ.Номер КАК Номер,
	|	СФ.Дата КАК Дата
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СФ
	|ГДЕ
	|	СФ.ДокументОснование = &ДокументОснование
	|	И НЕ СФ.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Проведен УБЫВ,
	|	Дата УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МетаСчетаНаОплату(СсылкаНаОбъект)
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаСНалогом", 0);
	Результат.Вставить("СуммаНалога", 0);
	Результат.Вставить("СуммаБезНалога", 0);
	Результат.Вставить("ЕстьНалог", Ложь);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.СуммаВсего КАК СуммаСНалогом,
	|	ТЧ.СуммаНДС КАК СуммаНалога,
	|	ВЫБОР
	|		КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьНалог
	|ПОМЕСТИТЬ ПоказателиСчетаНаОплату
	|ИЗ
	|	Документ.СчетНаОплату.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.СуммаВсего,
	|	ТЧ.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетНаОплату.Автоработы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.СуммаВсего,
	|	ТЧ.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетНаОплатуЗаАвтомобили.Автомобили КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.СуммаВсего,
	|	ТЧ.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетНаОплатуЗаАвтомобили.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.СуммаСНалогом) КАК СуммаСНалогом,
	|	СУММА(ВТ.СуммаНалога) КАК СуммаНалога,
	|	МАКСИМУМ(ВТ.ЕстьНалог) КАК ЕстьНалог
	|ИЗ
	|	ПоказателиСчетаНаОплату КАК ВТ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		Результат.СуммаБезНалога = Результат.СуммаСНалогом - Результат.СуммаНалога;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазделительПакетаЗапросов()
	
	Возврат
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

Функция РазделительОбъединенияЗапросов()
	
	Результат = "
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Возврат Результат;
	
КонецФункции

Процедура ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы)
	
	ПодстрокаПоиска = "ПсевдонимТаблицы";
	Если Не ЗначениеЗаполнено(ПсевдонимТаблицы) Тогда
		ПодстрокаПоиска = ПодстрокаПоиска + ".";
	КонецЕсли;
	
	Выражение = СтрЗаменить(Выражение, ПодстрокаПоиска, ПсевдонимТаблицы);
	
КонецПроцедуры

#Область ПараметрыИНастройкиИнформационнойБазы

Функция ЕстьШтрихкодыУпаковок(ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ИмяКолонкиКодТовара()
	
	Результат = "Артикул";
	Возврат Результат;
	
КонецФункции

Функция ВалютаРеглУчета()
	
	Результат = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

#Область ПравилаОбработкиДокументов

// Список возможных идентификаторов правил обработки входящих документов.
// 
// Возвращаемое значение:
//  Структура - см. тело функции.
//
Функция ИдентификаторыПравилОбработкиДокументов()
	
	ЗначенияПеречисления = Новый Массив;
	ЗначенияПеречисления.Добавить("ВозвратОтПокупателя");
	ЗначенияПеречисления.Добавить("ПоступлениеТоваров");
	ЗначенияПеречисления.Добавить("ПоступлениеАвтомобилей");
	ЗначенияПеречисления.Добавить("ПоступлениеДопРасходов");
	ЗначенияПеречисления.Добавить("КорректировкаПоступления");
	ЗначенияПеречисления.Добавить("КорректировкаПоступленияАвтомобилей");
	ЗначенияПеречисления.Добавить("СчетФактураПолученный");
	ЗначенияПеречисления.Добавить("АктСверкиВзаиморасчетов");
	
	Результат = Новый Структура;
	
	Для Каждого Элемент Из ЗначенияПеречисления Цикл
		
		Результат.Вставить(Элемент, Элемент);
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Заполняет правила обработки входящих товарных накладных и актов об оказании услуг.
//
Процедура ЗаполнитьПравилаОбработкиПервичныхДокументов(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхДокументов = Ложь;
	ДляИсправительныхДокументов = Истина;
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Приобретение товаров, услуг, автомобилей
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеТоваров
		, ВидыЭД.ТоварнаяНакладная
		, ДляПервичныхДокументов);
		
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеАвтомобилей
		, ВидыЭД.ТоварнаяНакладная
		, ДляПервичныхДокументов);	
		
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеТоваров
		, ВидыЭД.АктОбОказанииУслуг
		, ДляПервичныхДокументов);
	
	// Приобретение услуг
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ПоступлениеДопРасходов
		, ВидыЭД.АктОбОказанииУслуг
		, ДляПервичныхДокументов);
	
	// Возврат товаров от клиента
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.ВозвратОтПокупателя
		, ВидыЭД.ТоварнаяНакладная
		, ДляПервичныхДокументов);
	
	// Исправление накладной, акта
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступления
		, ВидыЭД.ТоварнаяНакладная
		, ДляИсправительныхДокументов);
		
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступленияАвтомобилей
		, ВидыЭД.ТоварнаяНакладная
		, ДляИсправительныхДокументов);
		
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступления
		, ВидыЭД.АктОбОказанииУслуг
		, ДляИсправительныхДокументов);
	
	// Корректировка накладной, акта
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступления
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, ДляПервичныхИИсправительныхДокументов);
		
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.КорректировкаПоступленияАвтомобилей
		, ВидыЭД.СоглашениеОбИзмененииСтоимости
		, ДляПервичныхИИсправительныхДокументов);	
		
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.АктСверкиВзаиморасчетов
		, ВидыЭД.АктСверки
		, ДляПервичныхИИсправительныхДокументов);
		
КонецПроцедуры

// Дополняет таблицу правил обработки счетов-фактур и корректировочных счетов-фактур.
//
Процедура ЗаполнитьПравилаОбработкиСчетовФактур(ПравилаОбработки)
	
	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.СчетФактура
		, ДляПервичныхИИсправительныхДокументов);
	
	// Корректировочный счет-фактура
	ДобавитьПравилоОбработкиДокументов(ПравилаОбработки
		, ИдентификаторыПравил.СчетФактураПолученный
		, ВидыЭД.КорректировочныйСчетФактура
		, ДляПервичныхИИсправительныхДокументов);
	
КонецПроцедуры
	
Процедура ЗаполнитьПравилаОбработкиАктовСверки(ПравилаОбработки)

	ВидыЭД = ВидыЭлектронныхДокументов();
	ИдентификаторыПравил = ИдентификаторыПравилОбработкиДокументов();
	
	ДляПервичныхИИсправительныхДокументов = Неопределено;
	
	// Акт сверки
	ДобавитьПравилоОбработкиДокументов(
		ПравилаОбработки,
		ИдентификаторыПравил.АктСверкиВзаиморасчетов,
		ВидыЭД.АктСверки,
		ДляПервичныхИИсправительныхДокументов
	);
	
КонецПроцедуры

#КонецОбласти 

#Область ПоступлениеТоваров

Функция ХозяйственнаяОперацияПоступлениеТоваров()
	
	Результат = Справочники.ХозОперации.ПоступлениеТоваров;
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления товаров и услуг.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийПоступлениеТоваровУслуг - вид операции поступления.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияПоступленияТоваров()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияПоступлениеТоваров());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияПоступленияТоваров(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияПоступленияТоваров();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	Товары = Документы.ПоступлениеТоваров.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	КодыМаркировки = Документы.ПоступлениеТоваров.ПустаяСсылка().КодыМаркировки.ВыгрузитьКолонки();
	
	ЗаполнитьТабличныеЧасти(Товары, КодыМаркировки, ТоварнаяЧастьЭД);
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	ДанныеЗаполнения.Вставить("КодыМаркировки", КодыМаркировки);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьПоступлениеТоваров(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ЗаполнитьТабличныеЧастиПоступленияТоваров(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

// Заполняет табличные части "Товары" и "КодыМаркировки" в поступлении товаров.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.ПоступлениеТоваров - заполняемый документ
//  ДанныеЗаполнения - Структура - см. СтруктураЗаполненияПоступленияТоваров
//
Процедура ЗаполнитьТабличныеЧастиПоступленияТоваров(ДокументОбъект, ДанныеЗаполнения)
	
	ЦенаВключаетНДС = Истина;
	Если ЗначениеЗаполнено(ДокументОбъект.ТипЦен) Тогда
		ЦенаВключаетНДС = ДокументОбъект.ТипЦен.ЦенаВключаетНДС;
	КонецЕсли;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаДанных Из ДанныеЗаполнения.Товары Цикл
		
		НоваяСтрокаТЧ = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаДанных);
		
		Если ЦенаВключаетНДС Тогда
			ЗаполнитьЦенуСуммуСУчетомНДС(НоваяСтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.КодыМаркировки.Загрузить(ДанныеЗаполнения.КодыМаркировки);
	
КонецПроцедуры

// Перезаполняет цену и сумму в строке ТЧ "Товары" документа "ПоступлениеТоваров"
// с учетом флага "ЦенаВключаетНДС"
//
// Параметры:
//  СтрокаТовары - ДокументТабличнаяЧастьСтрока.ПоступлениеТоваров.Товары - строка поступления товаров.
//
Процедура ЗаполнитьЦенуСуммуСУчетомНДС(СтрокаТовары)
	
	Если Не ЗначениеЗаполнено(СтрокаТовары.СуммаНДС) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТовары.Сумма = СтрокаТовары.СуммаВсего;
	СтрокаТовары.Цена = СтрокаТовары.Сумма;
	Если ЗначениеЗаполнено(СтрокаТовары.Количество) Тогда
		СтрокаТовары.Цена = СтрокаТовары.Сумма / СтрокаТовары.Количество;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПоступлениеАвтомобилей

Функция ХозяйственнаяОперацияПоступлениеАвтомобилей()
	
	Результат = Справочники.ХозОперации.ПоступлениеАвтомобилей;
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления товаров и услуг.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийПоступлениеТоваровУслуг - вид операции поступления.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияПоступленияАвтомобилей()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияПоступлениеАвтомобилей());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияПоступленияАвтомобилей(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияПоступленияАвтомобилей();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
    ДанныеЗаполнения.Вставить("TradeIn", Ложь);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	ЗаказНаАвтомобиль = Новый Структура("Контрагент", ШапкаЭД.Продавец.Ссылка);
	ДанныеЗаполнения.Вставить("ЗаказНаАвтомобиль", ЗаказНаАвтомобиль);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьПоступлениеАвтомобилей(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область ПоступлениеДопРасходов

Функция ХозяйственнаяОперацияПоступлениеДопРасходов()
	
	Результат = Справочники.ХозОперации.ПоступлениеДопРасходов;
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления товаров и услуг.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийПоступлениеТоваровУслуг - вид операции поступления.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияПоступленияДопРасходов()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияПоступлениеДопРасходов());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияПоступленияДопРасходов(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияПоступленияДопРасходов();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьПоступлениеДопРасходов(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратОтПокупателя

Функция ХозяйственнаяОперацияВозвратОтПокупателя()
	
	Результат = Справочники.ХозОперации.ВозвратТоваровОтПокупателя;
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления товаров и услуг.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийПоступлениеТоваровУслуг - вид операции поступления.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияВозвратОтПокупателя()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияВозвратОтПокупателя());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияВозвратаОтПокупателя(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияВозвратОтПокупателя();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьВозвратОтПокупателя(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область КорректировкаПоступления

Функция ХозяйственнаяОперацияКорректировкаПоступления()
	
	Результат = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон;
	Возврат Результат;
	
КонецФункции

Функция ХозяйственнаяОперацияИсправлениеПоступления()
	
	Результат = Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах;
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления товаров и услуг.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийПоступлениеТоваровУслуг - вид операции поступления.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияКорректировкаПоступления()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияКорректировкаПоступления());
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаполненияИсправленияПоступления()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияИсправлениеПоступления());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияКорректировкиПоступления(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияКорректировкаПоступления();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	ДанныеЗаполнения.Вставить("ПервичныйДокумент", ШапкаЭД.КорректируемыйДокумент.ПервичныйДокумент);
	
	Товары = Документы.КорректировкаПоступления.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	КодыМаркировки = Документы.КорректировкаПоступления.ПустаяСсылка().КодыМаркировки.ВыгрузитьКолонки();
	
	ЗаполнитьТабличныеЧастиКорректировкиПоступления(Товары, КодыМаркировки, ТоварнаяЧастьЭД);
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	ДанныеЗаполнения.Вставить("КодыМаркировки", КодыМаркировки);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция СтруктураЗаполненияИсправленияПоступления(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияИсправленияПоступления();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	ДанныеЗаполнения.Вставить("ПервичныйДокумент", ДополнительныеПараметры.ДокументОснование);
	
	Товары = Документы.КорректировкаПоступления.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	КодыМаркировки = Документы.КорректировкаПоступления.ПустаяСсылка().КодыМаркировки.ВыгрузитьКолонки();
	
	ЗаполнитьТабличныеЧастиИсправленияПоступления(Товары, КодыМаркировки, ТоварнаяЧастьЭД);
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	ДанныеЗаполнения.Вставить("КодыМаркировки", КодыМаркировки);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьКорректировкуПоступления(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения.ПервичныйДокумент);
	
	СтруктураПоиска				= Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СтавкаНДС");
	СтруктураПоискаМаркировки	= Новый Структура("ИдентификаторТовара");
	
	РеквизитыТабличнойЧастиДляПерезаполнения = "Количество, КоличествоПоДокументуПоступления, КоличествоДоКорректировки, КоличествоРазница,												
												|СуммаНДС, СуммаНДСПоДокументуПоступления, СуммаНДСДоКорректировки, СуммаНДСРазница,
												|СуммаВсего, СуммаВсегоДоКорректировки, СуммаВсегоПоДокументуПоступления, СуммаВсегоРазница,
												|Цена, Сумма, СтавкаНДС";
	
	Для Каждого СтрокаДокумента Из ДокументОбъект.Товары Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
		РезультатПоискаДанныхЗаполнения = ДанныеЗаполнения.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если РезультатПоискаДанныхЗаполнения.Количество() > 0 Тогда
			
			СтрокаДанныхЗаполнения = РезультатПоискаДанныхЗаполнения[0];
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаДанныхЗаполнения, РеквизитыТабличнойЧастиДляПерезаполнения);
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаМаркировки, СтрокаДанныхЗаполнения);
			РезультатПоискаМаркировки = ДанныеЗаполнения.КодыМаркировки.НайтиСтроки(СтруктураПоискаМаркировки);
			Для Каждого СтрокаМаркировки Из РезультатПоискаМаркировки Цикл
				СтрокаМаркировки.ИдентификаторТовара = СтрокаДокумента.ИдентификаторТовара;
			КонецЦикла;
			
			// Удалим обработанную строку из данных заполнения
			ДанныеЗаполнения.Товары.Удалить(СтрокаДанныхЗаполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавим новые строки в документ
	Если ДанныеЗаполнения.Товары.Количество() > 0 Тогда
		
		Для Каждого СтрокаДанныхЗаполнения Из ДанныеЗаполнения.Товары Цикл
			
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхЗаполнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДокументОбъект.КодыМаркировки.Загрузить(ДанныеЗаполнения.КодыМаркировки);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьИсправлениеПоступления(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения.ПервичныйДокумент);
	
	СтруктураПоиска				= Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СтавкаНДС");
	СтруктураПоискаМаркировки	= Новый Структура("ИдентификаторТовара");
	
	РеквизитыТабличнойЧастиДляПерезаполнения = "Количество, СуммаНДС, СуммаВсего, Цена, Сумма, СтавкаНДС";
	
	Для Каждого СтрокаДокумента Из ДокументОбъект.Товары Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
		РезультатПоискаДанныхЗаполнения = ДанныеЗаполнения.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если РезультатПоискаДанныхЗаполнения.Количество() > 0 Тогда
			
			СтрокаДанныхЗаполнения = РезультатПоискаДанныхЗаполнения[0];
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаДанныхЗаполнения, РеквизитыТабличнойЧастиДляПерезаполнения);
			
			Документы.КорректировкаПоступления.РасчетРазницы(ДокументОбъект, СтрокаДокумента);
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаМаркировки, СтрокаДанныхЗаполнения);
			РезультатПоискаМаркировки = ДанныеЗаполнения.КодыМаркировки.НайтиСтроки(СтруктураПоискаМаркировки);
			Для Каждого СтрокаМаркировки Из РезультатПоискаМаркировки Цикл
				СтрокаМаркировки.ИдентификаторТовара = СтрокаДокумента.ИдентификаторТовара;
			КонецЦикла;
			
			// Удалим обработанную строку из данных заполнения
			ДанныеЗаполнения.Товары.Удалить(СтрокаДанныхЗаполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавим новые строки в документ
	Если ДанныеЗаполнения.Товары.Количество() > 0 Тогда
		
		Для Каждого СтрокаДанныхЗаполнения Из ДанныеЗаполнения.Товары Цикл
			
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныхЗаполнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДокументОбъект.КодыМаркировки.Загрузить(ДанныеЗаполнения.КодыМаркировки);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область КорректировкаПоступленияАвтомобилей

Функция ХозяйственнаяОперацияКорректировкаПоступленияАвтомобилей()
	
	Результат = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейКорректировкаПоСогласованиюСторон;
	Возврат Результат;
	
КонецФункции

Функция ХозяйственнаяОперацияИсправлениеПоступленияАвтомобилей()
	
	Результат = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейИсправлениеВПервичныхДокументах;
	Возврат Результат;
	
КонецФункции

// Конструктор дополнительных параметров заполнения поступления товаров и услуг.
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ВидОперации - ПеречислениСсылка.ВидыОперацийПоступлениеТоваровУслуг - вид операции поступления.
//   * ЦенаВключаетНДС - Булево - Истина, если цена включает НДС.
//
Функция ПараметрыЗаполненияКорректировкаПоступленияАвтомобилей()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияКорректировкаПоступленияАвтомобилей());
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаполненияИсправлениеПоступленияАвтомобилей()
	
	Результат = Новый Структура;
	Результат.Вставить("ЦенаВключаетНДС", Ложь);
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияИсправлениеПоступленияАвтомобилей());
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияКорректировкиПоступленияАвтомобилей(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияКорректировкаПоступленияАвтомобилей();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	ДанныеЗаполнения.Вставить("ПервичныйДокумент", ШапкаЭД.КорректируемыйДокумент.ПервичныйДокумент);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция СтруктураЗаполненияИсправлениеПоступленияАвтомобилей(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияИсправлениеПоступленияАвтомобилей();
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	ДанныеЗаполнения.Вставить("ПервичныйДокумент", ДополнительныеПараметры.ДокументОснование);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьКорректировкуПоступленияАвтомобилей(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения.ПервичныйДокумент);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьИсправлениеПоступленияАвтомобилей(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения.ПервичныйДокумент);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СчетФактураПолученный

Функция СтруктураЗаполненияСчетаФактурыПолученного(ДанныеЭД, ДополнительныеПараметры)
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТоварнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);
	
	ДобавитьВалюту(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьДатуНомерВходящего(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьРеквизитыИсправления(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьДоговорВзаиморасчетов(ДанныеЗаполнения);
	ДобавитьСкладКомпании(ДанныеЗаполнения);
	
	Товары = Документы.СчетФактураПолученный.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	КодыМаркировки = Неопределено;
	
	ЗаполнитьТабличныеЧасти(Товары, КодыМаркировки, ТоварнаяЧастьЭД);
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	ДанныеЗаполнения.Вставить("КодыМаркировки", Неопределено);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьСчетФактуруПолученный(ДокументОбъект, ДанныеЗаполнения)
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	ДокументОбъект.ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
	
	Основание = Неопределено;
	ДанныеЗаполнения.Свойство("Основание", Основание);
	ДокументОбъект.Заполнить(Основание);
	
	ДокументОбъект.Товары.Загрузить(ДанныеЗаполнения.Товары);
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	ДокументОбъект.УстановитьНовыйНомер();
	
	ОтключитьПроверкуЗаполненияОбъекта(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область АктСверкиВзаиморасчетов

Функция ХозяйственнаяОперацияАктСверкиВзаиморасчетов()
	
	Результат = Справочники.ХозОперации.АктСверкиВзаиморасчетов;
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаполненияАктСверкиВзаиморасчетов()
	
	Результат = Новый Структура;
	Результат.Вставить("ХозОперация", ХозяйственнаяОперацияАктСверкиВзаиморасчетов());
	
	Возврат Результат;
	
КонецФункции

Функция ДоговорПоСтрокеАктаСверки(ДанныеДокумента, РеквизитыДоговора)
	
	ВидДоговора = Неопределено;
	
	Если РеквизитыДоговора.Описание = "С покупателем" Тогда
		ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ИначеЕсли РеквизитыДоговора.Описание = "С поставщиком" Тогда
		ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	КонецЕсли;
		
	ДоговорКонтрагента = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Если ВидДоговора = Неопределено Тогда
		
		Возврат ДоговорКонтрагента;
		
	КонецЕсли;
		
	ДоговорКонтрагента = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(ДанныеДокумента.Контрагент, ВидДоговора);
		
	Возврат ДоговорКонтрагента;
	
КонецФункции

Функция ИспользоватьЗаполнениеАктаСверкиПоДаннымОрганизации()
	
	Версия = ВерсияПодсистемыАА();
	Результат = (СравнитьВерсии(Версия, "6.0.39.08") >= 0);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаполненияАктаСверкиВзаиморасчетов(ДанныеЭД, ДополнительныеПараметры)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияАктСверкиВзаиморасчетов();
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ШапкаЭД = ДанныеЭД.Шапка;
	ТабличнаяЧастьЭД = ДанныеЭД.ТоварнаяЧасть;
	ИтогиЭД = ДанныеЭД.Итоги;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСтуктуре", Истина);	
	ДанныеЗаполнения.Вставить("ХозОперация", ПараметрыЗаполнения.ХозОперация);
	
	// Стороны сверки
	ДобавитьОрганизацию(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьКонтрагента(ДанныеЗаполнения, ШапкаЭД);
	ДобавитьПодразделениеКомпании(ДанныеЗаполнения);
	ДобавитьДоговорВзаиморасчетов(ДанныеЗаполнения);
	
	//// Валюта
	ЗаполнитьДанныеВалютыАктСверки(ДанныеЗаполнения, ШапкаЭД);

	// Даты сверки, суммы
	ОстатокНаНачало = ИтогиЭД.СальдоНачДеб - ИтогиЭД.СальдоНачКр;
	
	ДанныеЗаполнения.Вставить("ДатаНачала", ШапкаЭД.ДатаНачала);
	ДанныеЗаполнения.Вставить("ДатаОкончания", ШапкаЭД.ДатаОкончания);
	ДанныеЗаполнения.Вставить("ОстатокНаНачало", ОстатокНаНачало);
	
	ТаблицаПоДаннымКонтрагента = Документы.АктСверкиВзаиморасчетов.ПустаяСсылка().ПоДаннымКонтрагента.ВыгрузитьКолонки();
	
	// Табличная часть ПоДаннымКонтрагента
	Для Каждого СтрокаДоговора Из ТабличнаяЧастьЭД.Договор Цикл
		Для Каждого СтрокаДокумента Из СтрокаДоговора.Документ Цикл
			Для Каждого СтрокаОперации Из СтрокаДокумента.Операция Цикл
				
				СтрокаПоДаннымКонтрагента = ТаблицаПоДаннымКонтрагента.Добавить();
				СтрокаПоДаннымКонтрагента.ДоговорВзаиморасчетов = ДоговорПоСтрокеАктаСверки(ДанныеЗаполнения, СтрокаДоговора);
				СтрокаПоДаннымКонтрагента.Дата = СтрокаОперации.Дата;
				СтрокаПоДаннымКонтрагента.Представление = СтрокаОперации.Наименование;
				СтрокаПоДаннымКонтрагента.УвеличениеДолга = СтрокаОперации.СуммаДебет;
				СтрокаПоДаннымКонтрагента.УменьшениеДолга = СтрокаОперации.СуммаКредит;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Шапка", ДанныеЗаполнения);
	ДанныеОбъекта.Вставить("ПоДаннымКонтрагента", ТаблицаПоДаннымКонтрагента);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция СформироватьПараметрыЗаполненияДокумента(ДокументОбъект)
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Организация", ДокументОбъект.Организация);
	ПараметрыВыполненияКоманды.Вставить("ДоговорВзаиморасчетов", ДокументОбъект.ДоговорВзаиморасчетов);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ОписаниеКоманды", ОписаниеКоманды);
	ПараметрыКоманды.Вставить("Источник", ДокументОбъект);
	
	Возврат ПараметрыКоманды;
	
КонецФункции

Процедура ЗаполнитьАктСверкиВзаиморасчетов(ДокументОбъект, ДанныеДокумента)
	
	Шапка = ДанныеДокумента.Шапка;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ДокументОбъект.ПоДаннымКонтрагента.Загрузить(ДанныеДокумента.ПоДаннымКонтрагента);
	
	ПараметрыКоманды = СформироватьПараметрыЗаполненияДокумента(ДокументОбъект);
	
	Если ИспользоватьЗаполнениеАктаСверкиПоДаннымОрганизации() Тогда
		
		ПараметрыКоманды.Вставить("ДоговорВзаиморасчетов", ДокументОбъект.ДоговорВзаиморасчетов);
		ПараметрыКоманды.Вставить("Организация", ДокументОбъект.Организация);
		
		Документы.АктСверкиВзаиморасчетов.ПоДаннымОрганизацииЗаполнитьПоВзаиморасчетам(ДокументОбъект, ПараметрыКоманды);
		
	КонецЕсли;
	
	ДокументОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

#КонецОбласти

#Область ПодготовкаДанныхЗаполнения

Процедура ДобавитьВалюту(ЗначенияЗаполнения, ШапкаЭД)
	
	ЗначенияЗаполнения.Вставить("ВалютаДокумента"	, ШапкаЭД.Валюта.Ссылка);
	ЗначенияЗаполнения.Вставить("Курс"			, ШапкаЭД.Курс);
	ЗначенияЗаполнения.Вставить("Кратность"		, ШапкаЭД.Кратность);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеВалютыАктСверки(ЗначенияЗаполнения, ШапкаЭД)
	
	Валюта = ШапкаЭД.Валюта.Ссылка;
	
	Курс = 1;
	
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ШапкаЭД.Дата);
	
	Если ЗначениеЗаполнено(КурсВалюты.Курс) Тогда
		Курс = КурсВалюты.Курс;
	КонецЕсли;
	
	ЗначенияЗаполнения.Вставить("ВалютаДокумента"	, Валюта);
	ЗначенияЗаполнения.Вставить("КурсДокумента", Курс);
	
КонецПроцедуры

Процедура ДобавитьДатуНомерВходящего(ЗначенияЗаполнения, ШапкаЭД)
	
	ЗначенияЗаполнения.Вставить("ВхДокНомер"	, ШапкаЭД.Номер);
	ЗначенияЗаполнения.Вставить("ВхДокДата"	, ШапкаЭД.Дата);
	
КонецПроцедуры

Процедура ДобавитьРеквизитыИсправления(ЗначенияЗаполнения, ШапкаЭД)
	
	ЗначенияЗаполнения.Вставить("Исправление", Ложь);
	
	НомерИсправления = СвойствоСтруктуры(ШапкаЭД, "НомерИсправления");
	
	Если ЗначениеЗаполнено(НомерИсправления) Тогда
		
		ЗначенияЗаполнения.Исправление = Истина;
		ЗначенияЗаполнения.Вставить("НомерИсправления", НомерИсправления);
		ЗначенияЗаполнения.Вставить("ДатаИсправления", ШапкаЭД.ДатаИсправления);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОрганизацию(ЗначенияЗаполнения, ШапкаЭД)
	
	Если ШапкаЭД.Свойство("Покупатель") Тогда
		
		ЗначенияЗаполнения.Вставить("Организация", ШапкаЭД.Покупатель.Ссылка);
		
	Иначе
		
		ЗначенияЗаполнения.Вставить("Организация", ШапкаЭД.Получатель.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКонтрагента(ЗначенияЗаполнения, ШапкаЭД)
	
	Если ШапкаЭД.Свойство("Продавец") Тогда
		
		ЗначенияЗаполнения.Вставить("Контрагент", ШапкаЭД.Продавец.Ссылка);
		
	Иначе
		
		ЗначенияЗаполнения.Вставить("Контрагент", ШапкаЭД.Отправитель.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПодразделениеКомпании(ЗначенияЗаполнения)
	
	ПодразделениеКомпании	 = Неопределено;
	Организация				 = ЗначенияЗаполнения.Организация;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ПодразделениеКомпании = ПервоеПодразделениеОрганизации(Организация);
	КонецЕсли;
	
	ЗначенияЗаполнения.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
	
КонецПроцедуры

Процедура ДобавитьСкладКомпании(ЗначенияЗаполнения)
	
	Организация = ЗначенияЗаполнения.Организация;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Подразделение = СвойствоСтруктуры(ЗначенияЗаполнения, "ПодразделениеКомпании");
	ЗначенияЗаполнения.Вставить("СкладКомпании", ПервыйСкладОрганизации(Организация, Подразделение));
	
КонецПроцедуры

Процедура ДобавитьДоговорВзаиморасчетов(ЗначенияЗаполнения)
	
	Контрагент = ЗначенияЗаполнения.Контрагент;
	Организация = ЗначенияЗаполнения.Организация;
	Подразделение = СвойствоСтруктуры(ЗначенияЗаполнения, "ПодразделениеКомпании");
	
	Договор = ПервыйДоговорВзаиморасчетов(Контрагент, Организация, Подразделение);
	
	ЗначенияЗаполнения.Вставить("ДоговорВзаиморасчетов", Договор);
	
КонецПроцедуры

Процедура ПерезаполнениеЗначенийРеквизитовШапки(ТекущийОбъект, ЗначенияЗаполнения)
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ОбъектМетаданных = ТекущийОбъект.Метаданные();
	
	Для Каждого Строка Из ЗначенияЗаполнения Цикл
		
		ЕстьРеквизит = ЕстьРеквизитМетаданных(ОбъектМетаданных, Строка.Ключ) Или ЕстьОбщийРеквизит(ОбъектМетаданных, Строка.Ключ);
		
		Если ЗначениеЗаполнено(Строка.Ключ) И ЕстьРеквизит Тогда
			Если ТекущийОбъект[Строка.Ключ] <> Строка.Значение Тогда
				ТекущийОбъект[Строка.Ключ] = Строка.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧасти(Товары, КодыМаркировки, ТоварнаяЧастьЭД)
	
	Для Каждого Стр Из ТоварнаяЧастьЭД Цикл
		
		НоваяСтрока = Товары.Добавить();
		
		ИдентификаторСтроки = НовыйИдентификаторСтроки();
		
		ЗаполнитьИдентификаторТовара(НоваяСтрока, ИдентификаторСтроки);
		
		ЗаполнитьНоменклатуруПоставщика(НоваяСтрока, Стр.НоменклатураКонтрагента);
		
		ЗаполнитьНоменклатуруИнформационнойБазы(НоваяСтрока, Стр.Номенклатура);
		
		ЗаполнитьНомерГТД(НоваяСтрока, Стр.ДанныеГТД);
		
		ЗаполнитьКоличествоЦенуСуммыНалоги(НоваяСтрока, Стр);
		
		ЗаполнитьКодыМаркировки(
			КодыМаркировки,
			ИдентификаторСтроки,
			Стр.СведенияОМаркировке,
			Стр.НоменклатураКонтрагента.GTIN)
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧастиКорректировкиПоступления(Товары, КодыМаркировки, ТоварнаяЧастьЭД)
	
	Для Каждого Стр Из ТоварнаяЧастьЭД Цикл
		
		НоваяСтрока = Товары.Добавить();
		
		ИдентификаторСтроки = НовыйИдентификаторСтроки();
		
		ЗаполнитьИдентификаторТовара(НоваяСтрока, ИдентификаторСтроки);
		
		ЗаполнитьНоменклатуруПоставщика(НоваяСтрока, Стр.НоменклатураКонтрагента);
		
		ЗаполнитьНоменклатуруИнформационнойБазы(НоваяСтрока, Стр.Номенклатура);
		
		ЗаполнитьНомерГТД(НоваяСтрока, Стр.ДанныеГТД);
		
		ЗаполнитьКоличествоЦенуСуммыНалогиКорректировкиПоступления(НоваяСтрока, Стр);
		
		ЗаполнитьКодыМаркировки(КодыМаркировки
			, ИдентификаторСтроки
			, Стр.СведенияОМаркировке)
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧастиИсправленияПоступления(Товары, КодыМаркировки, ТоварнаяЧастьЭД)
	
	Для Каждого Стр Из ТоварнаяЧастьЭД Цикл
		
		НоваяСтрока = Товары.Добавить();
		
		ИдентификаторСтроки = НовыйИдентификаторСтроки();
		
		ЗаполнитьИдентификаторТовара(НоваяСтрока, ИдентификаторСтроки);
		
		ЗаполнитьНоменклатуруПоставщика(НоваяСтрока, Стр.НоменклатураКонтрагента);
		
		ЗаполнитьНоменклатуруИнформационнойБазы(НоваяСтрока, Стр.Номенклатура);
		
		ЗаполнитьНомерГТД(НоваяСтрока, Стр.ДанныеГТД);
		
		ЗаполнитьКоличествоЦенуСуммыНалогиИсправленияПоступления(НоваяСтрока, Стр);
		
		ЗаполнитьКодыМаркировки(
			КодыМаркировки,
			ИдентификаторСтроки,
			Стр.СведенияОМаркировке,
			Стр.НоменклатураКонтрагента.GTIN)
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИдентификаторТовара(НоваяСтрока, ИдентификаторТовара)
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "ИдентификаторТовара") Тогда
		НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНоменклатуруПоставщика(НоваяСтрока, НоменклатураКонтрагента)
	
	Если Не ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "НоменклатураПоставщика") Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецНоменклатуры = НоменклатураКонтрагента.Владелец;
	ИдентификаторНоменклатуры = НоменклатураКонтрагента.Идентификатор;
	НоваяСтрока.НоменклатураПоставщика = НайтиНоменклатуруПоставщика(ВладелецНоменклатуры, ИдентификаторНоменклатуры);
	
КонецПроцедуры

Процедура ЗаполнитьНоменклатуруИнформационнойБазы(НоваяСтрока, НоменклатураИБ)
	
	Номенклатура = НоменклатураИБ.Номенклатура;
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыНоменклатуры = Новый Структура;
	РеквизитыНоменклатуры.Вставить("ЕдиницаИзмерения", "ОсновнаяЕдиницаИзмерения");
	РеквизитыНоменклатуры.Вставить("Коэффициент", "ОсновнаяЕдиницаИзмерения.Коэффициент");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛокальная(Номенклатура, РеквизитыНоменклатуры);
	
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.ХарактеристикаНоменклатуры = НоменклатураИБ.Характеристика;
	НоваяСтрока.ЕдиницаИзмерения = ЗначенияРеквизитов.ЕдиницаИзмерения;
	НоваяСтрока.Коэффициент = ЗначенияРеквизитов.Коэффициент;
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоЦенуСуммыНалогиКорректировкиПоступления(НоваяСтрока, СтрокаЭД)
	
	НоваяСтрока.Количество							= СтрокаЭД.Количество;
	НоваяСтрока.КоличествоДоКорректировки			= СтрокаЭД.Количество_До;
	НоваяСтрока.КоличествоПоДокументуПоступления	= ?(НоваяСтрока.КоличествоДоКорректировки > 0, НоваяСтрока.КоличествоДоКорректировки, 0);
	НоваяСтрока.КоличествоРазница					= НоваяСтрока.Количество - НоваяСтрока.КоличествоДоКорректировки;
	
	НоваяСтрока.Цена	= СтрокаЭД.Цена;
	НоваяСтрока.Сумма	= СтрокаЭД.СуммаБезНДС;
	
	НоваяСтрока.СуммаНДС						= СтрокаЭД.СуммаНДС;
	НоваяСтрока.СуммаНДСДоКорректировки			= СтрокаЭД.СуммаНДС_До;
	НоваяСтрока.СуммаНДСПоДокументуПоступления	= ?(НоваяСтрока.СуммаНДСДоКорректировки > 0, НоваяСтрока.СуммаНДСДоКорректировки, 0);
	НоваяСтрока.СуммаНДСРазница					= НоваяСтрока.СуммаНДС - НоваяСтрока.СуммаНДСДоКорректировки;
	
	НоваяСтрока.СуммаВсего							= СтрокаЭД.СуммаСНДС;
	НоваяСтрока.СуммаВсегоДоКорректировки			= СтрокаЭД.СуммаСНДС_До;
	НоваяСтрока.СуммаВсегоПоДокументуПоступления	= ?(НоваяСтрока.СуммаВсегоДоКорректировки>0, НоваяСтрока.СуммаВсегоДоКорректировки, 0);
	НоваяСтрока.СуммаВсегоРазница					= СтрокаЭД.СуммаСНДС - СтрокаЭД.СуммаСНДС_До;
	
	ПредставлениеСтавки = СтрокаЭД.НоменклатураКонтрагента.СтавкаНДС;
	НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
	
	Если НоваяСтрока.КоличествоПоДокументуПоступления > 0 Тогда
		ПредставлениеСтавкиДо = СтрокаЭД.НоменклатураКонтрагента_До.СтавкаНДС;
		НоваяСтрока.СтавкаНДСПоДокументуПоступления = ЗначениеСтавкиНДС(ПредставлениеСтавкиДо);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоЦенуСуммыНалогиИсправленияПоступления(НоваяСтрока, СтрокаЭД)
	
	НоваяСтрока.Количество	= СтрокаЭД.Количество;
	НоваяСтрока.Цена		= СтрокаЭД.Цена;
	НоваяСтрока.Сумма		= СтрокаЭД.СуммаБезНДС;	
	НоваяСтрока.СуммаНДС	= СтрокаЭД.СуммаНДС;
	НоваяСтрока.СуммаВсего	= СтрокаЭД.СуммаСНДС;

	ПредставлениеСтавки = СтрокаЭД.НоменклатураКонтрагента.СтавкаНДС;
	НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоЦенуСуммыНалоги(НоваяСтрока, СтрокаЭД)
	
	НоваяСтрока.Количество = СтрокаЭД.Количество;
	НоваяСтрока.Цена = СтрокаЭД.Цена;
	НоваяСтрока.Сумма = СтрокаЭД.СуммаБезНДС;
	НоваяСтрока.СуммаНДС = СтрокаЭД.СуммаНДС;
	НоваяСтрока.СуммаВсего = СтрокаЭД.СуммаСНДС;
	
	ПредставлениеСтавки = СтрокаЭД.НоменклатураКонтрагента.СтавкаНДС;
	НоваяСтрока.СтавкаНДС = ЗначениеСтавкиНДС(ПредставлениеСтавки);
	
КонецПроцедуры

Процедура ЗаполнитьКодыМаркировки(ШтрихкодыУпаковок, ИдентификаторТовара, СведенияОМаркировке, GTIN = "")
	
	Если ШтрихкодыУпаковок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СведенияОМаркировке) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(GTIN)
		И ЗначениеЗаполнено(СведенияОМаркировке.КоличествоТовараВУпаковке) Тогда
		
		КоличествоТовараВУпаковке = СведенияОМаркировке.КоличествоТовараВУпаковке;

		ЗначениеШтрихкода = НовыйКодОСУ(GTIN, КоличествоТовараВУпаковке);
		
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
		НоваяСтрока.КодМаркировки = ЗначениеШтрихкода;

	КонецЕсли;

	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
		НоваяСтрока.КодМаркировки		= ЗначениеШтрихкода;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
		НоваяСтрока.КодМаркировки		= ЗначениеШтрихкода;
	КонецЦикла;
	
	Для Каждого ЗначениеШтрихкода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
		НоваяСтрока.КодМаркировки		= ЗначениеШтрихкода;
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйКодОСУ(GTIN, Количество)
	
	КоличествоСтрокой = XMLСтрока(Цел(Количество));
	
	Результат = "02" + GTIN + "37"+КоличествоСтрокой;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНомерГТД(НоваяСтрока, ДанныеГТД)
	
	Если Не ЗначениеЗаполнено(ДанныеГТД) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЕстьРеквизитИлиСвойствоОбъектаЛок(НоваяСтрока, "ГТД") Тогда
		Возврат;
	КонецЕсли;
	
	СведенияТД = ДанныеГТД[0];
	
	НомерТаможеннойДекларации = СведенияТД.НомерГТД.РегистрационныйНомер;
	КодСтраны = СведенияТД.СтранаПроисхождения.Код;
	
	НоваяСтрока.ГТД = НайтиСоздатьНомерГТД(НомерТаможеннойДекларации, КодСтраны);
	
КонецПроцедуры

Функция НовыйИдентификаторСтроки()
	
	Результат = Строка(Новый УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ЕстьРеквизитИлиСвойствоОбъектаЛок(Объект, ИмяРеквизита)
	
	Результат = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ИмяСобытияЖурналаЗагрузка()
	
	Результат = НСтр("ru = 'Диадок'; en = 'Diadoc'");
	Возврат Результат;
	
КонецФункции

Процедура ОтключитьПроверкуЗаполненияОбъекта(Объект)
	
	РежимЗагрузки = Истина;
	Объект.ДополнительныеСвойства.Вставить("Загрузка", РежимЗагрузки);
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаДанных

Процедура ЗаполнитьДатуНомер155(Прото, ДатаНомер, ЭтоИсправление)
	
	Прото.Number = ДатаНомер.НомерДокумента;
	Прото.Date	 = ДатаНомер.ДатаДокумента;
	
	Если ЭтоИсправление Тогда
		Прото.RevisionNumber = ДатаНомер.НомерИсправления;
		Прото.RevisionDate	 = ДатаНомер.ДатаИсправления;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОбУчастниках155(Прото, Шапка, ЕстьТовары)
	
	ДатаДокумента = Шапка.Дата;
	
	Продавец = Шапка.ГоловнаяОрганизация;
	СчетПродавца = Шапка.БанковскийСчетОрганизации;
	Грузоотправитель = Шапка.Грузоотправитель;
	РеквизитыПродавца = МенеджерИнтеграции_РеквизитыЮрФизЛица(Продавец, ДатаДокумента, СчетПродавца, Грузоотправитель);
	ЗаполнитьИнформациюОбОрганизации155(Прото.Seller, РеквизитыПродавца, Продавец, ДатаДокумента);
	
	Покупатель = Шапка.ГоловнойКонтрагент;
	СчетПокупателя = Шапка.БанковскийСчетКонтрагента;
	РеквизитыПокупателя = МенеджерИнтеграции_РеквизитыЮрФизЛица(Покупатель, ДатаДокумента, СчетПокупателя);
	ЗаполнитьИнформациюОбОрганизации155(Прото.Buyer, РеквизитыПокупателя, Покупатель, ДатаДокумента);
	
	ЗаполнитьКППДляПокупателяОбособленноеПодразделение(Прото.Buyer, Шапка);
	
	Если ЕстьТовары Тогда
		
		Если ЕстьРеквизитИлиСвойствоОбъектаЛок(Шапка, "ГрузоотправительИзДанныхДляПечати") Тогда
			ГрузоотправительИзДанныхДляПечати = Шапка.ГрузоотправительИзДанныхДляПечати;
		Иначе
			ГрузоотправительИзДанныхДляПечати = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Грузоотправитель) И ГрузоотправительИзДанныхДляПечати Тогда
			
			Прото.Shipper.SameAsSeller = Ложь;
			СчетГрузоотправителя = Неопределено;
			РеквизитыГрузоотправителя = МенеджерИнтеграции_РеквизитыЮрФизЛица(Грузоотправитель, ДатаДокумента, СчетГрузоотправителя);
			
			Если НЕ ЗначениеЗаполнено(РеквизитыГрузоотправителя.ФактическийАдрес)
				И НЕ ЗначениеЗаполнено(РеквизитыГрузоотправителя.ЗначенияПолейФактическийАдрес) Тогда
				
				РеквизитыГрузоотправителя.ФактическийАдрес = РеквизитыПродавца.ФактическийАдрес;
				РеквизитыГрузоотправителя.ЗначенияПолейФактическийАдрес = РеквизитыПродавца.ЗначенияПолейФактическийАдрес;
				
			КонецЕсли;
			
			ЗаполнитьИнформациюОГрузоотправителеГрузополучателе(Прото.Shipper.OrganizationInfo, РеквизитыГрузоотправителя, Грузоотправитель);
			
		Иначе
			
			Прото.Shipper.SameAsSeller = Истина;
			
		КонецЕсли;
		
		Грузополучатель = Шапка.Грузополучатель;
		Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
			Грузополучатель = Покупатель;
		КонецЕсли;
		
		СчетГрузополучателя = Неопределено;
		РеквизитыГрузополучателя = МенеджерИнтеграции_РеквизитыЮрФизЛица(Грузополучатель, ДатаДокумента, СчетГрузополучателя);
		ЗаполнитьИнформациюОГрузоотправителеГрузополучателе(Прото.Consignee, РеквизитыГрузополучателя, Грузополучатель);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОрганизацияОбособленногоПодразделения(ОбособленноеПодразделение)
	
	Результат = ОбособленноеПодразделение;
	
	Если ТипЗнч(ОбособленноеПодразделение) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		Результат = ОбособленноеПодразделение.Организация;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции


Процедура ЗаполнитьКППДляПокупателяОбособленноеПодразделение(СведенияОПокупателе, ДанныеДокумента)

	Покупатель = ДанныеДокумента.Контрагент;
	
	Если ТипЗнч(Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Грузополучатель = ДанныеДокумента.Грузополучатель;
		
		Если Покупатель.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
			
			СведенияОПокупателе.Kpp = ?(ЗначениеЗаполнено(Покупатель.КПП), Покупатель.КПП, "--");
			
		ИначеЕсли ЗначениеЗаполнено(Грузополучатель)
			И ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Контрагенты")
			И Грузополучатель.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
			
			СведенияОПокупателе.Kpp = ?(ЗначениеЗаполнено(Грузополучатель.КПП), Грузополучатель.КПП, "--");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОбУчастникахУКД(Прото, Шапка, ЕстьТовары)
	
	ДатаДокумента = Шапка.Дата;
	
	Продавец = Шапка.ГоловнаяОрганизация;
	СчетПродавца = Шапка.БанковскийСчетОрганизации;
	Грузоотправитель = Шапка.Грузоотправитель;
	РеквизитыПродавца = МенеджерИнтеграции_РеквизитыЮрФизЛица(Продавец, ДатаДокумента, СчетПродавца, Грузоотправитель);
	ЗаполнитьИнформациюОбОрганизации155(Прото.Seller, РеквизитыПродавца, Продавец, ДатаДокумента);
	
	Покупатель = Шапка.ГоловнойКонтрагент;
	СчетПокупателя = Шапка.БанковскийСчетКонтрагента;
	РеквизитыПокупателя = МенеджерИнтеграции_РеквизитыЮрФизЛица(Покупатель, ДатаДокумента, СчетПокупателя);
	ЗаполнитьИнформациюОбОрганизации155(Прото.Buyer, РеквизитыПокупателя, Покупатель, ДатаДокумента);
	
КонецПроцедуры

Процедура УстановитьИдентификаторПродавца155(Прото, ИдентификаторУчастникаЭДО)
	
	Если ЗначениеЗаполнено(ИдентификаторУчастникаЭДО) Тогда
		Прото.Seller.FnsParticipantId = ИдентификаторУчастникаЭДО;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьИдентификаторПокупателя155(Прото, ИдентификаторУчастникаЭДО)
	
	Если ЗначениеЗаполнено(ИдентификаторУчастникаЭДО) Тогда
		Прото.Buyer.FnsParticipantId = ИдентификаторУчастникаЭДО;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСоставителе155(Прото, Шапка)
	
	ДатаДокумента = Шапка.Дата;
	Составитель = Шапка.ГоловнаяОрганизация;
	СчетСоставителя = Неопределено;
	Грузоотправитель = Шапка.Грузоотправитель;
	РеквизитыСоставителя = МенеджерИнтеграции_РеквизитыЮрФизЛица(Составитель, ДатаДокумента, СчетСоставителя, Грузоотправитель);
	
	Прочерк = "-";
	
	ИНН = СокрЛП(РеквизитыСоставителя.ИНН);
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		ИНН = Прочерк;
	КонецЕсли;
	
	КПП = СокрЛП(РеквизитыСоставителя.КПП);
	Если Не ЗначениеЗаполнено(КПП) Тогда
		КПП = Прочерк;
	КонецЕсли;
	
	Наименование = СокрЛП(РеквизитыСоставителя.НаименованиеДляПечатныхФорм);
	
	Прото.Creator = СтрШаблон("%1, ИНН/КПП: %2/%3",
		Наименование,
		ИНН,
		КПП);
	
КонецПроцедуры

Функция НоваяСтрокаПРД155(Дата = Неопределено, Номер = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_PaymentDocument");
	
	Результат.Date = Дата;
	Результат.Number = Номер;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПлатежноРасчетныеДокументы155(Прото, ПРД)
	
	Если Не ЗначениеЗаполнено(ПРД) Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого ПлатежныйДокумент Из ПРД Цикл
		
		СтрокаПРД = НоваяСтрокаПРД155(ПлатежныйДокумент.Дата, ПлатежныйДокумент.Номер);
		Прото.PaymentDocuments.Добавить(СтрокаПРД);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГосударственныйКонтракт155(Прото, Шапка)
	
	ИдентификаторГосударственногоКонтракта = Шапка.ИдентификаторГосударственногоКонтракта;
	
	Если ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта) Тогда
		Прото.GovernmentContractInfo = ИдентификаторГосударственногоКонтракта;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВалюту155(Прото, Шапка)
	
	Прото.Currency = Шапка.ВалютаКод;
	Прото.CurrencyRate = Шапка.Курс;
	
КонецПроцедуры

Процедура МенеджерИнтеграции_ЗаполнитьНаименованиеФункцию155(Прото, ФорматОтправки)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗаполнитьНаименованиеФункцию155",
		Прото,
		ФорматОтправки);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОЛицеПередавшемТовар155(Прото, Сотрудник)
	
	Если Не ЗначениеЗаполнено(Сотрудник)
		Или Не ЗначениеЗаполнено(Сотрудник.Должность) Тогда
		Возврат;
	КонецЕсли;
	
	РаботникОрганизацииПродавца = Прото.TransferInfo.Employee;
	
	РаботникОрганизацииПродавца.Surname	 = Сотрудник.Фамилия;
	РаботникОрганизацииПродавца.FirstName = Сотрудник.Имя;
	РаботникОрганизацииПродавца.Patronymic = Сотрудник.Отчество;
	РаботникОрганизацииПродавца.EmployeePosition = Сотрудник.Должность;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПередаче155(Прото, Шапка)
	
	СвПер = Прото.TransferInfo;
	
	СвПер.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	ДатаОтгрузки = Неопределено;
	ДатаДокумента = Шапка.Дата;
	
	Если Шапка.Свойство("ДатаОтгрузки", ДатаОтгрузки)
		И ЗначениеЗаполнено(ДатаОтгрузки)
		И НачалоДня(ДатаОтгрузки) <> НачалоДня(ДатаДокумента) Тогда
		СвПер.TransferDate = ДатаОтгрузки;
	КонецЕсли;
	
	Шапка.Свойство("СведенияОТранспортировкеИГрузе", СвПер.TransferTextInfo);
	
КонецПроцедуры

Процедура ЗаполнитьОснованияПередачи155(Прото, Шапка, УказыватьОтсутствиеОснованияУПД)
	
	TransferBase = НовоеОснованиеПередачи155();
	
	Если Не ЗначениеЗаполнено(Шапка.ОснованиеПередачиДата) И УказыватьОтсутствиеОснованияУПД Тогда
		
		TransferBase.DocumentName	= ОснованиеПередачиОтсутвует155();
		TransferBase.DocumentNumber	= "";
		TransferBase.DocumentDate	= Дата(1, 1, 1);
		TransferBase.DocumentInfo	= "";
		
	Иначе
		
		TransferBase.DocumentName	= Шапка.ОснованиеПередачиВид;
		TransferBase.DocumentNumber	= Шапка.ОснованиеПередачиНомер;
		TransferBase.DocumentDate	= Шапка.ОснованиеПередачиДата;
		TransferBase.DocumentInfo	= "";
		
	КонецЕсли;
	
	СлужебнаяИнформация = МенеджерИнтеграции_НоваяСлужебнаяИнформацияОснованияПередачи();
	СлужебнаяИнформация.ОснованиеСсылка = Шапка.ОснованиеПередачи;
	СлужебнаяИнформация.ПредставлениеВТекстеОшибки = "договоре";
	
	ИмяСвойства = МенеджерИнтеграции_ИмяСвойстваСлужебнаяИнформация();
	TransferBase.Вставить(ИмяСвойства, СлужебнаяИнформация);
	
	Прото.TransferInfo.TransferBases.Добавить(TransferBase);
	
КонецПроцедуры

Процедура ЗаполнитьStructedAdditionalInfos(StructedAdditionalInfos, ДопСведения)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗаполнитьStructedAdditionalInfos", StructedAdditionalInfos, ДопСведения);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть155(Прото, Товары, ЭтоАванс, ТочностьЦены = 2)
	
	ВсеСтроки_СтавкаНДС_БезНДС	 = Истина;
	ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
	
	ВсегоНДС = 0;
	ВсегоСНДС = 0;
	ВсегоБезНДС = 0;
	ВсегоКоличество = 0;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		ПрикладнаяСтавкаНДС = СтрокаТовары.СтавкаНДС;
		
		СтрокаНДСИНА = ЭтоСтавкаНДСИНА(ПрикладнаяСтавкаНДС);
		СтрокаБезНДС = ЭтоСтавкаБезНДС(ПрикладнаяСтавкаНДС);
		
		Если Не СтрокаБезНДС Тогда
			ВсеСтроки_СтавкаНДС_БезНДС = Ложь;
		КонецЕсли;
		
		Если Не СтрокаНДСИНА Тогда
			ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
		КонецЕсли;
		
		Item = НоваяСтрокаТовары155();
		МенеджерИнтеграции_ДобавитьСлужебнуюИнформациюВСтроку(Item, СтрокаТовары);
		
		Item.Product = ПредставлениеНоменклатуры(СтрокаТовары.НоменклатураНаименование, СтрокаТовары.ХарактеристикаНаименование);
		Item.ItemMark = ПризнакНоменклатуры155(СтрокаТовары.НоменклатураТип);
		Item.VendorCode = СокрЛП(СтрокаТовары.НоменклатураКод);
		
		Item.TaxRate = ПредставлениеСтавкиНДС(ПрикладнаяСтавкаНДС);
		
		Если СтрокаНДСИНА Тогда
			
			Item.Vat = 0;
			Item.Subtotal = 0;
			Item.SubtotalWithVatExcluded = СтрокаТовары.СуммаСНДС;
			
		Иначе
			
			Item.Vat = ?(СтрокаБезНДС, Неопределено, СтрокаТовары.СуммаНДС);
			Item.Subtotal = СтрокаТовары.СуммаСНДС;
			Item.SubtotalWithVatExcluded = ?(ЭтоАванс, Неопределено, СтрокаТовары.СуммаБезНДС);
			
		КонецЕсли;
		
		Количество = ?(ЭтоАванс, Неопределено, СтрокаТовары.Количество);
		Цена = Неопределено;
		ЕдиницаИзмерения = Неопределено;
		ЕдиницаИзмеренияКод = Неопределено;
		ЕдиницаИзмеренияНаименование = Неопределено;
		
		Если ЗначениеЗаполнено(Количество) Тогда
			
			ИсключитьИзЦеныНДС = СтрокаТовары.ЦенаВключаетНДС И ЗначениеЗаполнено(СтрокаТовары.СуммаНДС);
			
			Если ИсключитьИзЦеныНДС Тогда
				Цена = СтрокаТовары.СуммаБезНДС / Количество;
			Иначе
				Цена = СтрокаТовары.Цена;
			КонецЕсли;
			
			Цена = Окр(Цена, ТочностьЦены);
			
			Если ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) Тогда
				ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
				ЕдиницаИзмеренияКод = МетодСервера(, "XML_КодЕдиницыИзмерения", СокрЛП(СтрокаТовары.ЕдиницаИзмеренияКод));
				ЕдиницаИзмеренияНаименование = СокрЛП(СтрокаТовары.ЕдиницаИзмеренияНаименование);
			КонецЕсли;
			
		КонецЕсли;
		
		Item.Quantity = Количество;
		Item.Price = Цена;
		Item.UnitCode = ЕдиницаИзмеренияКод;
		Item.UnitName = ЕдиницаИзмеренияНаименование;
		Item.ЕдиницаИзмеренияСсылка = ЕдиницаИзмерения; // Для совместимости со старыми ПМ
		
		Если ЗначениеЗаполнено(СтрокаТовары.СтранаПроисхождения) Тогда
			
			CustomDeclaration = МенеджерИнтеграции_Новый_CustomDeclaration();
			
			CustomDeclaration.CountryCode = СокрЛП(СтрокаТовары.СтранаПроисхожденияКод);
			
			Если ЗначениеЗаполнено(СтрокаТовары.РегистрационныйНомерГТД) Тогда
				CustomDeclaration.DeclarationNumber = СтрокаТовары.РегистрационныйНомерГТД;
			КонецЕсли; 
			
			Item.CustomDeclarations.Добавить(CustomDeclaration);
			
		КонецЕсли;
		
		МенеджерИнтеграции_ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаТовары);
		Прото.InvoiceTable.Items.Добавить(Item);
		
		ВсегоНДС = ВсегоНДС + СтрокаТовары.СуммаНДС;
		ВсегоБезНДС = ВсегоБезНДС + СтрокаТовары.СуммаБезНДС;
		ВсегоСНДС = ВсегоСНДС + СтрокаТовары.СуммаСНДС;
		
	КонецЦикла;
	
	Если ВсеСтроки_СтавкаНДС_БезНДС Тогда
		ВсегоНДС = Неопределено;
	КонецЕсли;
	
	Если ВсеСтроки_СтавкаНДС_ИсчНалАг Тогда
		ВсегоНДС = 0;
		ВсегоСНДС = 0;
	КонецЕсли;
	
	Если ЭтоАванс Тогда
		ВсегоБезНДС = Неопределено;
	КонецЕсли;
	
	Прото.InvoiceTable.TotalWithVatExcluded = ВсегоБезНДС;
	Прото.InvoiceTable.TotalNet = ВсегоКоличество;
	Прото.InvoiceTable.Total = ВсегоСНДС;
	Прото.InvoiceTable.Vat = ВсегоНДС;
	
КонецПроцедуры

Функция НоваяСтрокаТовары155()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ExtendedInvoiceItem");
	Возврат Результат;
	
КонецФункции

Функция НовоеОснованиеПередачи155()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_TransferBase");
	Возврат Результат;
	
КонецФункции

Функция ОснованиеПередачиОтсутвует155()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДокументОснованиеОтгрузкиОтсутствует");
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_НоваяСлужебнаяИнформацияОснованияПередачи()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяСлужебнаяИнформацияОснованияПередачи");
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ИмяСвойстваСлужебнаяИнформация()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ИмяСвойстваСлужебнаяИнформация");
	Возврат Результат;
	
КонецФункции

Функция ЭтоСтавкаБезНДС(ПрикладнаяСтавкаНДС)
	
	Результат = (ПрикладнаяСтавкаНДС = Справочники.СтавкиНДС.БезНДС);
	Возврат Результат;
	
КонецФункции

Функция ЭтоСтавкаНДСИНА(ПрикладнаяСтавкаНДС)
	
	Результат = Ложь;
	Возврат Результат;
	
КонецФункции

Функция ПризнакНоменклатуры155(ТипНоменклатуры)
	
	ПризнакиНоменклатуры = Новый Соответствие;
	ПризнакиНоменклатуры.Вставить(ТипНоменклатурыТовар(), "Property");
	ПризнакиНоменклатуры.Вставить(ТипНоменклатурыУслуга(), "Service");
	ПризнакиНоменклатуры.Вставить(ТипНоменклатурыРабота(), "Job");
	
	Результат = ПризнакиНоменклатуры.Получить(ТипНоменклатуры);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "Other";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика)
	
	Если ТипЗнч(Номенклатура) = Тип("Строка") Тогда
		НаименованиеНоменклатуры = СокрЛП(Номенклатура);
	Иначе
		НаименованиеНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "НаименованиеПолное");
	КонецЕсли;
	
	НаименованиеХарактеристики = СокрЛП(Характеристика);
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Результат = СтрШаблон("%1 (%2)", НаименованиеНоменклатуры, НаименованиеХарактеристики);
	Иначе
		Результат = НаименованиеНоменклатуры;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕдиницаИзмеренияЧасКод()
	Возврат "356";
КонецФункции

Функция ЕдиницаИзмеренияЧасНаименование()
	Возврат "ч";
КонецФункции

Функция ТипНоменклатурыТовар()
	Возврат "Товар";
КонецФункции

Функция ТипНоменклатурыУслуга()
	Возврат "Услуга";
КонецФункции

Функция ТипНоменклатурыРабота()
	Возврат "Работа";
КонецФункции

Функция ТипЮрФизЛица_ЮридическоеЛицо()
	Возврат "ЮридическоеЛицо";
КонецФункции

Функция ТипЮрФизЛица_ФизическоеЛицо()
	Возврат "ФизическоеЛицо";
КонецФункции

Функция ТипЮрФизЛица_ИностраннаяКомпания()
	Возврат "ИностраннаяКомпания";
КонецФункции

Процедура ЗаполнитьИнформациюОбОрганизации155(СведенияОбОрганизации, РеквизитыОрганизации, Организация, ДатаДокумента)
	
	СведенияОбОрганизации.Ссылка = Организация;
	СведенияОбОрганизации.Name	 = РеквизитыОрганизации.НаименованиеДляПечатныхФорм;
	СведенияОбОрганизации.Inn	 = РеквизитыОрганизации.ИНН;
	СведенияОбОрганизации.Kpp	 = РеквизитыОрганизации.КПП;
	СведенияОбОрганизации.Okpo	 = РеквизитыОрганизации.КодПоОкпо;
	СведенияОбОрганизации.Phone	 = РеквизитыОрганизации.Телефоны;
	
	СведенияОбОрганизации.BankAccountNumber		 = СокрЛП(РеквизитыОрганизации.НомерСчета);
	СведенияОбОрганизации.BankId				 = СокрЛП(РеквизитыОрганизации.БИК);
	СведенияОбОрганизации.BankName				 = СокрЛП(РеквизитыОрганизации.Банк);
	
	СведенияОбОрганизации.CorrespondentAccount = РеквизитыОрганизации.КоррСчет;
	СведенияОбОрганизации.Email = РеквизитыОрганизации.Email;
	
	ТипЮрФизЛица = РеквизитыОрганизации.ТипЮрФизЛица;
	Если ТипЮрФизЛица = ТипЮрФизЛица_ЮридическоеЛицо() Тогда
		СведенияОбОрганизации.Type = "LegalEntity";
	ИначеЕсли ТипЮрФизЛица = ТипЮрФизЛица_ФизическоеЛицо() Тогда
		СведенияОбОрганизации.Type = "IndividualEntity";
	Иначе
		СведенияОбОрганизации.Type = "ForeignEntity";
	КонецЕсли;
	
	Если СведенияОбОрганизации.Type = "IndividualEntity" Тогда
		
		Если ДатаДокумента >= ДатаРедакции425() Тогда
			
			РеквизитыИП = ЗначенияРеквизитовОбъектаЛокальная(Организация, "ОГРН,ДатаРегистрации");
			
			СведенияОбОрганизации.IndividualEntityRegistrationCertificate = СтрокаНомерСВ_2026(
				РеквизитыИП.ОГРН,
				РеквизитыИП.ДатаРегистрации
			);
			
		Иначе
			СведенияОбОрганизации.IndividualEntityRegistrationCertificate = РеквизитыОрганизации.Свидетельство;
		КонецЕсли;
		
	КонецЕсли;
	
	ПредставлениеАдреса = РеквизитыОрганизации.ЮридическийАдрес;
	ЗначенияПолейАдреса = РеквизитыОрганизации.ЗначенияПолейЮридическийАдрес;
	
	МенеджерИнтеграции_ЗаполнитьАдресУчастникаЭДО(СведенияОбОрганизации.Address, ПредставлениеАдреса, ЗначенияПолейАдреса);
	
КонецПроцедуры

Функция ДатаРедакции425()
	
	Возврат '20260101';
	
КонецФункции

Функция СтрокаНомерСВ_2026(ОГРН, ДатаРегистрации)
	
	ШаблонСтрокиНомерСВ = "%1;%2";
	
	Результат = СтрШаблон(
		ШаблонСтрокиНомерСВ,
		ОГРН,
		ДатаСтрокойЛок(ДатаРегистрации)
	);
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСтрокойЛок(ДатаСтрока)
	
	ПустоеЗначение = "";
	
	Если ПустаяСтрока(ДатаСтрока) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Попытка
		Значение = Дата(ДатаСтрока);
	Исключение
		Значение = ДатаСтрока;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
	
КонецФункции

Процедура ЗаполнитьИнформациюОГрузоотправителеГрузополучателе(СведенияОбОрганизации, РеквизитыОрганизации, Организация)
	
	СведенияОбОрганизации.Ссылка = Организация;
	СведенияОбОрганизации.Name = РеквизитыОрганизации.НаименованиеДляПечатныхФорм;
	СведенияОбОрганизации.Inn = РеквизитыОрганизации.ИНН;
	СведенияОбОрганизации.Kpp = РеквизитыОрганизации.КПП;
	СведенияОбОрганизации.Okpo = РеквизитыОрганизации.КодПоОкпо;
	СведенияОбОрганизации.Phone = РеквизитыОрганизации.Телефоны;
	
	СведенияОбОрганизации.BankAccountNumber = СокрЛП(РеквизитыОрганизации.НомерСчета);
	СведенияОбОрганизации.BankId = СокрЛП(РеквизитыОрганизации.БИК);
	СведенияОбОрганизации.BankName = СокрЛП(РеквизитыОрганизации.Банк);
	
	СведенияОбОрганизации.CorrespondentAccount = РеквизитыОрганизации.КоррСчет;
	СведенияОбОрганизации.Email = РеквизитыОрганизации.Email;
	
	СведенияОбОрганизации.IndividualEntityRegistrationCertificate = РеквизитыОрганизации.Свидетельство;
	
	ТипЮрФизЛица = РеквизитыОрганизации.ТипЮрФизЛица;
	Если ТипЮрФизЛица = ТипЮрФизЛица_ЮридическоеЛицо() Тогда
		СведенияОбОрганизации.Type = "LegalEntity";
	ИначеЕсли ТипЮрФизЛица = ТипЮрФизЛица_ФизическоеЛицо() Тогда
		СведенияОбОрганизации.Type = "IndividualEntity";
	Иначе
		СведенияОбОрганизации.Type = "ForeignEntity";
	КонецЕсли;
	
	ПредставлениеАдреса = РеквизитыОрганизации.ФактическийАдрес;
	ЗначенияПолейАдреса = РеквизитыОрганизации.ЗначенияПолейФактическийАдрес;
	
	МенеджерИнтеграции_ЗаполнитьАдресУчастникаЭДО(СведенияОбОрганизации.Address, ПредставлениеАдреса, ЗначенияПолейАдреса);
	
КонецПроцедуры

Процедура МенеджерИнтеграции_ЗаполнитьАдресУчастникаЭДО(AddressInfo, ПредставлениеАдреса, ЗначенияПолейАдреса)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗаполнитьАдресУчастникаЭДО",
		AddressInfo,
		ПредставлениеАдреса,
		ЗначенияПолейАдреса);
	
КонецПроцедуры

Процедура МенеджерИнтеграции_ДобавитьСлужебнуюИнформациюВШапку(Контент, ДанныеШапки)
	
	МетодСервера(
		"Модуль_ИнтеграцияУниверсальный",
		"ДополнитьКонтентДокументаСлужебнойИнформацией",
		Контент,
		ДанныеШапки
	);
	
КонецПроцедуры

Процедура МенеджерИнтеграции_ДобавитьСлужебнуюИнформациюВСтроку(Контент, СтрокаТЧ)
	
	МетодСервера(
		"Модуль_ИнтеграцияУниверсальный",
		"ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией",
		Контент,
		СтрокаТЧ
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыраженияОбщихРеквизитов(Реквизиты)
	
	Реквизиты.ХозяйственнаяОперация = "ХозяйственнаяОперация";
	Реквизиты.ВалютаДокумента = "ВалютаДокумента";
	Реквизиты.ВалютаДокументаКод = "ВалютаДокумента.Код";
	Реквизиты.СуммаДокумента = "СуммаДокумента";
	
КонецПроцедуры

Процедура ПодготовитьЗапросПоШапкеСчетаФактурыВыданного(Реквизиты)
	
	ЗаполнитьВыраженияОбщихРеквизитов(Реквизиты);
	
КонецПроцедуры

Функция ВыражениеГоловнаяОрганизация(ПсевдонимТаблицы = "")
	
	Результат = "ПсевдонимТаблицы.Организация";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеГоловнойКонтрагент(ПсевдонимТаблицы = "")
	
	Результат =
	"ВЫБОР 
	|	КОГДА ПсевдонимТаблицы.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ОбособленноеПодразделение)
	|		ТОГДА ПсевдонимТаблицы.Контрагент.ГоловнойКонтрагент
	|	ИНАЧЕ ПсевдонимТаблицы.Контрагент
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеИдентификаторГосударственногоКонтракта(СсылкаНаОбъект)

	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
		Результат =	"НЕОПРЕДЕЛЕНО";
	Иначе	
		Результат =	"ИдентификаторГосударственногоКонтракта";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеНоменклатураТип(ПсевдонимТаблицы = "")
	
	ВидыТоваров = Новый Массив;
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар)");
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)");
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Шины)");
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Диски)");
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.НомерныеАгрегаты)");
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЛКМ)");
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Опции)");
	ВидыТоваров.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Автомобили)");
	
	ВидыТоваровСтрокой = СтрСоединить(ВидыТоваров, ",");
	
	Результат =
	"ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.Номенклатура) = ТИП(Справочник.Автомобили)
	|		ТОГДА &ТипНоменклатурыТовар
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.Номенклатура) = ТИП(Справочник.Автоработы)
	|		ТОГДА &ТипНоменклатурыРабота
	|	КОГДА ПсевдонимТаблицы.Номенклатура.ВидНоменклатуры В(&ВидыТоваров)
	|		ТОГДА &ТипНоменклатурыТовар
	|	ИНАЧЕ &ТипНоменклатурыУслуга
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидыТоваров", ВидыТоваровСтрокой);
	Результат = СтрЗаменить(Результат, "&ТипНоменклатурыТовар", """" + ТипНоменклатурыТовар() + """");
	Результат = СтрЗаменить(Результат, "&ТипНоменклатурыУслуга", """" + ТипНоменклатурыУслуга() + """");
	Результат = СтрЗаменить(Результат, "&ТипНоменклатурыРабота", """" + ТипНоменклатурыРабота() + """");
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеУпаковка(ПсевдонимТаблицы = "", ПсевдонимПоляЕдиница = "ЕдиницаИзмерения")
	
	Результат =
	"ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|		ТОГДА ПсевдонимТаблицы.ЕдиницаИзмерения
	|	ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "ПсевдонимТаблицы.ЕдиницаИзмерения", "ПсевдонимТаблицы." + ПсевдонимПоляЕдиница);
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеЕдиницаИзмерения(ПсевдонимТаблицы = "", ПсевдонимПоляЕдиница = "ЕдиницаИзмерения")
	
	Результат =
	"ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|		ТОГДА ПсевдонимТаблицы.ЕдиницаИзмерения
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|		ТОГДА ЕСТЬNULL(ПсевдонимТаблицы.ЕдиницаИзмерения.ЕдиницаПоКлассификатору, &ЕдиницаИзмеренияПустая)
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.Нормочасы)
	|		ТОГДА &ЕдиницаИзмеренияЧас
	|	ИНАЧЕ &ЕдиницаИзмеренияПустая
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "ПсевдонимТаблицы.ЕдиницаИзмерения", "ПсевдонимТаблицы." + ПсевдонимПоляЕдиница);
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияПустая", "ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)");
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияЧас", "ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Час)");
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеЕдиницаИзмеренияКод(ПсевдонимТаблицы = "")
	
	Результат =
	"ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|		ТОГДА ПсевдонимТаблицы.ЕдиницаИзмерения.Код
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|		ТОГДА ЕСТЬNULL(ПсевдонимТаблицы.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код, """")
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.Нормочасы)
	|		ТОГДА &ЕдиницаИзмеренияЧасКод
	|	ИНАЧЕ """"
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияЧасКод", """" + ЕдиницаИзмеренияЧасКод() + """");
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ВыражениеЕдиницаИзмеренияНаименование(ПсевдонимТаблицы = "")
	
	Результат =
	"ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|		ТОГДА ПсевдонимТаблицы.ЕдиницаИзмерения.Наименование
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерения)
	|		ТОГДА ЕСТЬNULL(ПсевдонимТаблицы.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование, """")
	|	КОГДА ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ЕдиницаИзмерения) = ТИП(Справочник.Нормочасы)
	|		ТОГДА &ЕдиницаИзмеренияЧасНаименование
	|	ИНАЧЕ """"
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияЧасНаименование", """" + ЕдиницаИзмеренияЧасНаименование() + """");
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыОрганизацииКонтрагента(ЮрФизЛицо, Знач Период = '00010101', Знач БанковскийСчет = Неопределено)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = БанковскийСчетПоУмолчанию(ЮрФизЛицо);
	КонецЕсли;
	
	ЭтоПодразделение = ЭтоПодразделениеКомпании(ЮрФизЛицо);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("НаименованиеПолное");
	Реквизиты.Вставить("ИНН");
	Реквизиты.Вставить("КПП");
	Реквизиты.Вставить("ФормаСобственности");
	
	Если ЭтоПодразделение Тогда
		Реквизиты.ИНН = "Организация.ИНН";
		Реквизиты.ФормаСобственности = "Организация.ФормаСобственности";
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъектаЛокальная( ЮрФизЛицо, Реквизиты); 
	
	Если ЭтоРедакция6_1() Тогда
		МенеджерРеквизитовИстории = ОбщегоНазначения.ОбщийМодуль("РеквизитыСИсторией");
	Иначе
		МенеджерРеквизитовИстории = ОбщегоНазначения;
	КонецЕсли;
	
	Результат.КПП = МенеджерРеквизитовИстории.ПолучитьКППНаДату(ЮрФизЛицо, Период);
	
	Если ЭтоПодразделение И Не ЗначениеЗаполнено(Результат.КПП) Тогда
		Результат.КПП = МенеджерРеквизитовИстории.ПолучитьКППНаДату(ЮрФизЛицо.Организация, Период);
	КонецЕсли;
	
	ЮрАдрес = ЮридическийАдресЮрФизЛица(ЮрФизЛицо, Период);
	Если ЗначениеЗаполнено(ЮрАдрес) Тогда
		Результат.Вставить("ЮридическийАдрес", ЮрАдрес.Представление);
		Результат.Вставить("ЗначенияПолейЮридическийАдрес", ЮрАдрес.ЗначенияПолей);
	КонецЕсли;
	
	ФактАдрес = ФактическийАдресЮрФизЛица(ЮрФизЛицо, Период);
	Если ЗначениеЗаполнено(ФактАдрес) Тогда
		Результат.Вставить("ФактическийАдрес", ФактАдрес.Представление);
		Результат.Вставить("ЗначенияПолейФактическийАдрес", ФактАдрес.ЗначенияПолей);
	КонецЕсли;
	
	// Реквизиты счета
	Результат.Вставить("НомерСчета", "");
	Результат.Вставить("БИК", "");
	Результат.Вставить("Банк", "");
	Результат.Вставить("АдресБанка", "");
	Результат.Вставить("КоррСчет", "");
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		ЗаполнитьЗначенияСвойств(Результат, РеквизитыСчета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйКонтактнаяИнформация(Представление = Неопределено, ЗначенияПолей = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Представление", Представление);
	Результат.Вставить("ЗначенияПолей", ЗначенияПолей);
	
	Возврат Результат;
	
КонецФункции

Функция КонтактнаяИнформацияОбъекта(СсылкаНаОбъект, ВидКИ, Знач НаДату = Неопределено)
	
	ОбъектыКИ = Новый Массив;
	ОбъектыКИ.Добавить(СсылкаНаОбъект);
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(ВидКИ);
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ОбъектыКИ, , ВидыКИ, НаДату);
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ТаблицаКИ) Тогда
		
		СтрокаКИ = ТаблицаКИ[0];
		Результат = НовыйКонтактнаяИнформация(СтрокаКИ.Представление, СтрокаКИ.ЗначенияПолей);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПодразделениеКомпании(ЮрФизЛицо)
	
	Результат = (ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.ПодразделенияКомпании"));
	Возврат Результат;
	
КонецФункции

Функция ЮридическийАдресЮрФизЛица(ЮрФизЛицо, Знач Период = Неопределено)
	
	ОбъектКИ = ЮрФизЛицо;
	ВидАдреса = ПолучитьВидКИ(ОбъектКИ, Истина);
	Результат = КонтактнаяИнформацияОбъекта(ОбъектКИ, ВидАдреса, Период);
	
	Если Не ЗначениеЗаполнено(Результат)
		И ЭтоПодразделениеКомпании(ЮрФизЛицо) Тогда
		
		ОбъектКИ = ЮрФизЛицо.Организация;
		ВидАдреса = ПолучитьВидКИ(ОбъектКИ, Истина);
		Результат = КонтактнаяИнформацияОбъекта(ОбъектКИ, ВидАдреса, Период);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ФактическийАдресЮрФизЛица(ЮрФизЛицо, Знач Период = Неопределено)
	
	ОбъектКИ = ЮрФизЛицо;
	ВидАдреса = ПолучитьВидКИ(ОбъектКИ, Ложь);
	Результат = КонтактнаяИнформацияОбъекта(ОбъектКИ, ВидАдреса, Период);
	
	Если Не ЗначениеЗаполнено(Результат)
		И ЭтоПодразделениеКомпании(ЮрФизЛицо) Тогда
		
		ОбъектКИ = ЮрФизЛицо.Организация;
		ВидАдреса = ПолучитьВидКИ(ОбъектКИ, Ложь);
		Результат = КонтактнаяИнформацияОбъекта(ОбъектКИ, ВидАдреса, Период);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТелефоныЮрФизЛица(ЮрФизЛицо)
	
	ТребуемыеПараметры = Новый Структура;
	ТребуемыеПараметры.Вставить("ТелефонРабочий", "");
	
	Результат = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ЮрФизЛицо, ТребуемыеПараметры);
	
	Возврат Результат;
	
КонецФункции

Функция БанковскийСчетПоУмолчанию(ЮрФизЛицо)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ОсновнойБанковскийСчет");
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыБанковскогоСчета(БанковскийСчет)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("НомерСчета");
	Реквизиты.Вставить("БИК", "Банк.Код");
	Реквизиты.Вставить("Банк", "Банк.Наименование");
	Реквизиты.Вставить("АдресБанка", "Банк.Адрес");
	Реквизиты.Вставить("КоррСчет", "Банк.КоррСчет");
	
	Результат = ЗначенияРеквизитовОбъектаЛокальная(БанковскийСчет, Реквизиты);
		
	Возврат Результат;
	
КонецФункции

Функция ШапкаУчетногоДокумента(СсылкаНаОбъект)
	
	ПсевдонимТаблицы = "";
	
	Реквизиты = Новый Структура;
	
	Реквизиты.Вставить("Организация");
	Реквизиты.Вставить("ГоловнаяОрганизация", ВыражениеГоловнаяОрганизация(ПсевдонимТаблицы));
	Реквизиты.Вставить("БанковскийСчетОрганизации", "НЕОПРЕДЕЛЕНО");
	
	Реквизиты.Вставить("Контрагент");
	Реквизиты.Вставить("ГоловнойКонтрагент", ВыражениеГоловнойКонтрагент(ПсевдонимТаблицы));
	Реквизиты.Вставить("БанковскийСчетКонтрагента", "НЕОПРЕДЕЛЕНО");
	
	Реквизиты.Вставить("ОснованиеПередачи", "ДоговорВзаиморасчетов");
	Реквизиты.Вставить("ОснованиеПередачиВид", """Договор""");
	Реквизиты.Вставить("ОснованиеПередачиДата", "ДоговорВзаиморасчетов.ДатаНачала");
	Реквизиты.Вставить("ОснованиеПередачиНомер", "ДоговорВзаиморасчетов.НомерДоговора");
	Реквизиты.Вставить("ОснованиеПередачиНаименование", "ДоговорВзаиморасчетов.Наименование");
	
	Реквизиты.Вставить("Валюта", "ВалютаДокумента");
	Реквизиты.Вставить("ВалютаКод", "ВалютаДокумента.Код");
	Реквизиты.Вставить("ВалютаНаименование", "ВалютаДокумента.Наименование");
	
	Реквизиты.Вставить("Курс", "КурсДокумента");
	Реквизиты.Вставить("РасчетыВУсловныхЕдиницах", "ЛОЖЬ");
	
	Реквизиты.Вставить("ИдентификаторГосударственногоКонтракта", ВыражениеИдентификаторГосударственногоКонтракта(СсылкаНаОбъект));
	
	Реквизиты.Вставить("Дата");
	Реквизиты.Вставить("Номер");
	
	Реквизиты.Вставить("ЭтоАванс", "ЛОЖЬ");
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Реквизиты.ЭтоАванс = ВыражениеЭтоСчетФактураНаАванс(ПсевдонимТаблицы);
	КонецЕсли;
	
	Результат  = ЗначенияРеквизитовОбъектаЛокальная(СсылкаНаОбъект, Реквизиты); 
	
	ДополнитьДополнительнымиРеквизитамиИСведениями(Результат, СсылкаНаОбъект);
	
	Результат.Вставить("ОписаниеДокумента"	, МенеджерИнтеграции_ОписаниеПрикладногоДокумента(СсылкаНаОбъект));
	Результат.Вставить("ДатаНомерДокумента"	, МенеджерИнтеграции_ДатаНомерДокумента(Результат.ОписаниеДокумента));
	
	Возврат Результат;

КонецФункции

Функция ДополнитьДополнительнымиРеквизитамиИСведениями(Шапка, СсылкаНаОбъект)
	
	Подразделение = СсылкаНаОбъект.ПодразделениеКомпании;
	Грузоотправитель = Неопределено;
	Грузополучатель = Неопределено;
	ГрузоотправительИзДанныхДляПечати = Ложь;
	
	СвойстваНеобходимыеПриВыгрузке = Новый Массив(4);
	СвойстваНеобходимыеПриВыгрузке[0] = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузоотправитель;
	СвойстваНеобходимыеПриВыгрузке[1] = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузополучатель;
	СвойстваНеобходимыеПриВыгрузке[2] = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Доверенность;
	СвойстваНеобходимыеПриВыгрузке[3] = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаОтгрузки;
	
	ЗначенияСвойств = УправлениеСвойствами.ПолучитьЗначенияСвойств(
			СсылкаНаОбъект,
			Истина,
			Истина,
			СвойстваНеобходимыеПриВыгрузке
		);
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СсылкаНаОбъект, "Грузоотправитель") Тогда
		Грузоотправитель = СсылкаНаОбъект.Грузоотправитель;
		ГрузоотправительИзДанныхДляПечати = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Грузоотправитель) Тогда
		Грузоотправитель = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства(
				"Грузоотправитель",
				ЗначенияСвойств,
				Подразделение);
		
		ГрузоотправительИзДанныхДляПечати = Ложь;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъектаЛок(СсылкаНаОбъект, "Грузополучатель") Тогда
		Грузополучатель = СсылкаНаОбъект.Грузополучатель;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда
		Грузополучатель = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства(
				"Грузополучатель",
				ЗначенияСвойств);
	КонецЕсли;
	
	ДатаОтгрузки = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("ДатаОтгрузки", ЗначенияСвойств);
	Доверенность = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("Доверенность", ЗначенияСвойств);
	
	ГлавныйБухгалтер = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "ГлавныйБухгалтер");
	Руководитель = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "Руководитель");
	Отпустил = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "Отпустил");
	Получил = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "ПолучилКонтрагент", "Получил");
	
	Шапка.Вставить("Грузоотправитель", Грузоотправитель);
	Шапка.Вставить("ГрузоотправительИзДанныхДляПечати", ГрузоотправительИзДанныхДляПечати);
	Шапка.Вставить("Грузополучатель", Грузополучатель);
	Шапка.Вставить("ДатаОтгрузки", ДатаОтгрузки);
	Шапка.Вставить("ГлавныйБухгалтер", ГлавныйБухгалтер);
	Шапка.Вставить("Руководитель", Руководитель);
	Шапка.Вставить("Отпустил", Отпустил);
	Шапка.Вставить("Получил", Получил);
	Если ЗначениеЗаполнено(Доверенность) Тогда
		Шапка.Вставить("Доверенность", Доверенность);
	КонецЕсли;
	
	Возврат Шапка;
	
КонецФункции

Функция ПолучитьВидКИ(СсылкаНаОбъект, ЮрАдрес = Истина) Экспорт
	
	ВидАдреса = Неопределено;
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	
	Если ТипОбъекта = Тип("СправочникСсылка.Организации") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "ЮрАдресОрганизации", "ФактАдресОрганизации");
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда 
		
		ВидАдреса = ?(ЮрАдрес, "ЮрАдресКонтрагента", "ФактАдресКонтрагента");
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		
		ВидАдреса = ?(ЮрАдрес, "ЮрАдресПодразделенияКомпании", "ФактАдресПодразделенияКомпании");
		
	Иначе 
		ВызватьИсключение НСтр("ru = 'Некорректный параметр функции ""ПолучитьВидКИ""'");
	КонецЕсли;
	
	Результат = Справочники.ВидыКонтактнойИнформации[ВидАдреса];
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляФормированияУПД(СсылкаНаОбъект)
	
	Шапка = ШапкаУчетногоДокумента(СсылкаНаОбъект);
	Товары = ТабличнаяЧастьДокумента(СсылкаНаОбъект);
	ДокументыОснования = Неопределено;
	ПРД = ПлатежноРасчетныеДокументы(СсылкаНаОбъект);
	КодыМаркировки = Неопределено;
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", Шапка);
	Результат.Вставить("Товары", Товары);
	Результат.Вставить("ДокументыОснования", ДокументыОснования);
	Результат.Вставить("ПРД", ПРД);
	Результат.Вставить("КодыМаркировки", КодыМаркировки);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляФормированияУКД(ДокСсылка, ДопПараметры)
		
	Если ДопПараметры.ФункцияУПД = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияУПД = "КСЧФ" Тогда
		
		СчетФактура 	 = ДокСсылка;
		ТаблицаНакладных = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокСсылка);
		Накладная		 = ТаблицаНакладных[0].Ссылка;
		
	Иначе
		
		СчетФактура = Неопределено;
		Накладная	= ДокСсылка;
		
		ТаблицаНакладных = Новый ТаблицаЗначений;
		ТаблицаНакладных.Колонки.Добавить("Ссылка");
		ТаблицаНакладных.Колонки.Добавить("Дата");
		ТаблицаНакладных.Колонки.Добавить("Договор");
		
		НоваяСтрока = ТаблицаНакладных.Добавить();
		НоваяСтрока.Ссылка  = Накладная;
		НоваяСтрока.Дата  	= Накладная.Дата;
		НоваяСтрока.Договор = Накладная.ДоговорВзаиморасчетов;

	КонецЕсли;
	
	Шапка = ШапкаУчетногоДокумента(ДокСсылка);
	ТабличнаяЧасть = ТабличнаяЧастьДокументаУКД(Накладная);
	ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть);
	
	Шапка.Вставить("Функция", ?(ДопПараметры.ФункцияУПД = "КСЧФДИС", "InvoiceAndBasic", ?(ДопПараметры.ФункцияУПД = "КСЧФ", "Invoice", "Basic")));
	
	Если ДопПараметры.ФункцияУПД = "КСЧФДИС" ИЛИ ДопПараметры.ФункцияУПД = "ДИС" Тогда
		ДатаУведомления = ТаблицаНакладных[0].Дата;
		Если ДатаУведомления <> Шапка.Дата Тогда
			Шапка.Вставить("ДатаУведомления", ДатаУведомления);
		КонецЕсли;
	КонецЕсли;
	
	Если МетодСервера(, "ЕстьРеквизитТипаОбъекта", ТипЗнч(Накладная), "СопроводительныеДокументы") Тогда
		Шапка.Вставить("ИныеСведенияОбИзмененииСтоимости", Накладная.СопроводительныеДокументы);
	КонецЕсли;
	
	РеквизитыПередаточныхДокументов 	= Новый Массив;
	ДобавленныеПередаточныеДокументы	= Новый Соответствие;
	
	ТипПередаточногоДокумента = "УПД "; 
	
	Шапка.Вставить("ОснованияПередачи", Новый Массив);
	Шапка.Вставить("ПередаточныеДокументы", Новый Массив);
	
	ДобавленныеОснования = Новый Соответствие;
	
	Для Каждого СтрокаТЗ Из ТаблицаНакладных Цикл
		
		СтруктураОснования = ЗаполнитьСтруктуруОснования(СтрокаТЗ.Договор, Истина);
	
		Если ЗначениеЗаполнено(СтруктураОснования.GroundDate) И ЗначениеЗаполнено(СтруктураОснования.GroundName) Тогда
			
			Если ДобавленныеОснования[СтруктураОснования.Основание] <> Истина Тогда
				
				ДобавленныеОснования.Вставить(СтруктураОснования.Основание, Истина);
				
				ItemCorrectionBases = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CorrectionBase");
				ItemCorrectionBases.BaseDocumentName   = СтруктураОснования.GroundName;
				ItemCorrectionBases.BaseDocumentNumber = СокрЛП(СтруктураОснования.GroundNumber);
				ItemCorrectionBases.BaseDocumentDate   = СтруктураОснования.GroundDate;
				
				Шапка.ОснованияПередачи.Добавить(ItemCorrectionBases);
				
			КонецЕсли;
			
		КонецЕсли;
	
		ИсправляемыйДокументРеализации = ПолучитьИсправляемыйДокументРеализации(СтрокаТЗ.Ссылка);
			
		Если ДопПараметры.ФункцияУПД = "КСЧФДИС" Или ДопПараметры.ФункцияУПД = "КСЧФ" Тогда 
			
			ПередаточныйДокумент = ПолучитьСсылкуСчетаФактурыВыданногоПоДокументуОснованию(ИсправляемыйДокументРеализации);
			
		Иначе
			ПередаточныйДокумент = ИсправляемыйДокументРеализации;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПередаточныйДокумент)
			Или ДобавленныеПередаточныеДокументы[ПередаточныйДокумент] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Шапка.ПередаточныеДокументы.Добавить(ПередаточныйДокумент);
		
		ДобавленныеПередаточныеДокументы.Вставить(ПередаточныйДокумент, Истина);
		
		Новый_BaseDocument = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_BaseDocumentName");
		
		Новый_BaseDocument.BaseDocumentName		= ТипПередаточногоДокумента;
		Новый_BaseDocument.BaseDocumentNumber 	= ПредставлениеНомераОбъекта(ПередаточныйДокумент);
		Новый_BaseDocument.BaseDocumentDate 	= Формат(ПередаточныйДокумент.Дата, "ДФ=dd.MM.yyyy");
		
		РеквизитыПередаточныхДокументов.Добавить(Новый_BaseDocument);
								
	КонецЦикла;
	
	Шапка.Вставить("РеквизитыПередаточныхДокументов", РеквизитыПередаточныхДокументов);
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", 			Шапка);
	Результат.Вставить("ТабличнаяЧасть", 	ТабличнаяЧасть);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНомераОбъекта(СсылкаНаОбъект)
	
	РеквизитыОбъекта = Новый Структура;
	РеквизитыОбъекта.Вставить("Номер");
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектаЛокальная(СсылкаНаОбъект, РеквизитыОбъекта);
	
	Результат = ПредставлениеНомера(ЗначенияРеквизитов.Номер);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСтруктуруОснования(ДоговорКонтрагента, ЭтоУПД)
	
	Ground = Новый Структура;
	Ground.Вставить("GroundName", 	"");
	Ground.Вставить("GroundNumber", "");
	Ground.Вставить("GroundDate", 	"");
	Ground.Вставить("Основание", 	"");
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			
		Если ЭтоУПД Тогда
			ПредставлениеДоговора= "Договор";
		Иначе
			ПредставлениеДоговора= ДоговорКонтрагента.Наименование;
		КонецЕсли;
			
		Ground.Вставить("GroundName", 	ПредставлениеДоговора);
		Ground.Вставить("GroundNumber", ДоговорКонтрагента.НомерДоговора);
		Ground.Вставить("GroundDate", 	ДоговорКонтрагента.ДатаНачала);
		Ground.Вставить("Основание", 	ДоговорКонтрагента);
		
	КонецЕсли;
	
	Возврат Ground;
	
КонецФункции

Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации)
	
	Если Не ЗначениеЗаполнено(ДокРеализации) Тогда 
		
		Результат = Неопределено;
		
	ИначеЕсли ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Результат = ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументОснование);
		
	ИначеЕсли ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.ВозвратОтПокупателя")
			И ТипЗнч(ДокРеализации.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		Результат = ДокРеализации.ДокументОснование;
					
	ИначеЕсли ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда 
		
		// Корректировка реализации может быть сформирована на основании счета-фактуры, 
		// если этот счет-фактура был выписан посредником (через отчет комиссионера о продажах)
		Накладные = ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(ДокРеализации);
		
		Если Накладные.Количество() > 0 Тогда 
			Результат = Накладные[0].Ссылка;
		КонецЕсли;
		
	Иначе
		
		Результат = ДокРеализации;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТабличнаяЧастьДокумента(СсылкаНаОбъект)
	
	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	ДокументОснование = Неопределено;
	
	ЧастиЗапроса = Новый Массив;
	ИндивидуальныйЗапрос = Ложь;
	
	Если ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОснование");
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_СчетФактураВыданный();
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_РеализацияТоваров();
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_РеализацияАвтомобилей();
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияАктивов") Тогда
		
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_РеализацияАктивов();
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_ЗаказНаряд();
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
		
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_ЧекНаОплату();
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда

		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОснование");
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_КорректировкаРеализации();
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОснование");
		ТекстЗапроса_ПоместитьДанныеТЧ = ТекстЗапросаТЧ_КорректировкаРеализацииАвтомобилей();	
		ИндивидуальныйЗапрос = Истина;
		
	Иначе
		
		Ошибка = СтрШаблон("Невозможно получить табличную часть документа (%1)", СсылкаНаОбъект);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;

	Если ИндивидуальныйЗапрос Тогда 
		ТекстЗапроса = ТекстЗапроса_ПоместитьДанныеТЧ;
	Иначе
		ЧастиЗапроса.Добавить(ТекстЗапроса_ПоместитьДанныеТЧ);
		ЧастиЗапроса.Добавить(РазделительПакетаЗапросов());
		ЧастиЗапроса.Добавить(ТекстЗапросаТЧ_ВыбратьДанныеТабличныхЧастей());
		ЧастиЗапроса.Добавить(РазделительПакетаЗапросов());
		ЧастиЗапроса.Добавить(ТекстЗапросаТЧ_УничтожитьДанныеТабличныхЧастей());
		
		ТекстЗапроса = СтрСоединить(ЧастиЗапроса);
	КонецЕсли;	
	
	ВалютаРегл = ВалютаРеглУчета();
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегл, СсылкаНаОбъект.Дата);
	КоэффициентПересчета = КурсВалюты.Курс / КурсВалюты.Кратность;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("КоэффициентПересчета", КоэффициентПересчета);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ТабличнаяЧастьДокументаУКД(СсылкаНаОбъект)

	ТипСсылки = ТипЗнч(СсылкаНаОбъект);
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ДокументОснование");
	
	Если ТипСсылки = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ТекстЗапроса = ТекстЗапросаТЧ_УКД_КорректировкаРеализации();
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		
		ТекстЗапроса = ТекстЗапросаТЧ_УКД_КорректировкаРеализацииАвтомобилей();
		
	Иначе
		
		Ошибка = СтрШаблон("Невозможно получить табличную часть документа (%1)", СсылкаНаОбъект);
		ВызватьИсключение Ошибка;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции	

Функция ТекстЗапросаТЧ_СчетФактураВыданный()
	
	Результат =
	"ВЫБРАТЬ
	|	ПередаточныйДокументТовары.Номенклатура КАК Номенклатура,
	|	ПередаточныйДокументТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ПередаточныйДокументТовары.ИдентификаторТовара КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ИдентификаторыНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК ПередаточныйДокументТовары
	|ГДЕ
	|	ПередаточныйДокументТовары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураТовары.Ссылка КАК Ссылка,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	СчетФактураТовары.НомерСтроки КАК НомерСтроки,
	|	СчетФактураТовары.Номенклатура КАК Номенклатура,
	|	СчетФактураТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СчетФактураТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СчетФактураТовары.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	СчетФактураТовары.ГТД КАК НомерГТД,
	|	СчетФактураТовары.Количество КАК Количество,
	|	ЕСТЬNULL(СчетФактураРеквизиты.ТипЦен.ЦенаВключаетНДС, ЛОЖЬ) КАК ЦенаВключаетНДС,
	|	СчетФактураТовары.Цена КАК Цена,
	|	СчетФактураТовары.СуммаВсего - СчетФактураТовары.СуммаНДС КАК СуммаБезНДС,
	|	СчетФактураТовары.СуммаНДС КАК СуммаНДС,
	|	СчетФактураТовары.СуммаВсего КАК СуммаСНДС,
	|	СчетФактураТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ИдентификаторСтроки, """") КАК ИдентификаторСтроки,
	|	&ДокументОснование КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ДанныеТабличныхЧастей
	|ИЗ
	|	Документ.СчетФактураВыданный.Товары КАК СчетФактураТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
	|		ПО СчетФактураТовары.Номенклатура = ИдентификаторыНоменклатуры.Номенклатура
	|			И СчетФактураТовары.ХарактеристикаНоменклатуры = ИдентификаторыНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураРеквизиты
	|		ПО СчетФактураТовары.Ссылка = СчетФактураРеквизиты.Ссылка
	|ГДЕ
	|	СчетФактураТовары.Ссылка = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИдентификаторыНоменклатуры";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_РеализацияТоваров()
	
	Результат =
	"ВЫБРАТЬ
	|	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(РеализацияТоваровТовары.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	РеализацияТоваровТовары.ГТД КАК НомерГТД,
	|	РеализацияТоваровТовары.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	РеализацияТоваровТовары.Цена КАК Цена,
	|	РеализацияТоваровТовары.СуммаВсего - РеализацияТоваровТовары.СуммаНДС КАК СуммаБезНДС,
	|	РеализацияТоваровТовары.СуммаНДС КАК СуммаНДС,
	|	РеализацияТоваровТовары.СуммаВсего КАК СуммаСНДС,
	|	РеализацияТоваровТовары.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровТовары.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	РеализацияТоваровТовары.Ссылка КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ДанныеТабличныхЧастей
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_УКД_КорректировкаРеализации()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередаточныйДокументТовары.Номенклатура КАК Номенклатура,
	|	ПередаточныйДокументТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ПередаточныйДокументТовары.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	ПередаточныйДокументТовары.ГТД КАК ГТД
	|ПОМЕСТИТЬ ИдентификаторыНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК ПередаточныйДокументТовары
	|ГДЕ
	|	ПередаточныйДокументТовары.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередаточныйДокументАвтоработы.Авторабота,
	|	НЕОПРЕДЕЛЕНО,
	|	ПередаточныйДокументАвтоработы.ИдентификаторРаботы,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ЗаказНаряд.Автоработы КАК ПередаточныйДокументАвтоработы
	|ГДЕ
	|	ПередаточныйДокументАвтоработы.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка КАК Ссылка,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Номенклатура.Код КАК НоменклатураКод,
	|	ТЧ.ХарактеристикаНоменклатуры КАК Характеристика,
	|	&УпаковкаСсылка КАК Упаковка,
	|	&ЕдиницаИзмеренияСсылка КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)) КАК ГТД,
	|	ТЧ.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаВсего - ТЧ.СуммаНДС КАК СуммаБезНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.СуммаВсего КАК СуммаСНДС,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	ТЧ.Ссылка КАК ДокументОтгрузки,
	|	ПРЕДСТАВЛЕНИЕ(ТЧ.Номенклатура) КАК НоменклатураПредставление,
	|	ТЧ.Номенклатура.Код КАК КодНоменклатуры,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ТЧ.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга) КАК ЭтоУслуга,
	|	ТЧ.ЕдиницаИзмерения.Вес * ТЧ.Количество КАК Масса,
	|	ТЧ.ЕдиницаИзмерения КАК ВидУпаковки,
	|	ТЧ.Коэффициент КАК КоличествоВОдномМесте,
	|	ТЧ.Количество КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА ТЧ.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|			ТОГДА ""Service""
	|		КОГДА ТЧ.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар)
	|			ТОГДА ""Property""
	|	КОНЕЦ КАК ПризнакТоварРаботаУслуга,
	|	ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК КодЕдиницыИзмерения,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхожденияДоИзменения,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)) КАК НомерГТДДоИзменения,
	|	ТЧ.КоличествоДоКорректировки КАК КоличествоДоИзменения,
	|	&УпаковкаДоИзмененияСсылка КАК УпаковкаДоИзменения,
	|	&ЕдиницаИзмеренияДоИзмененияСсылка КАК ЕдиницаИзмеренияДоИзменения,
	|	ВЫБОР
	|		КОГДА ТЧ.КоличествоДоКорректировки <> 0
	|			ТОГДА ТЧ.СуммаВсегоДоКорректировки / ТЧ.КоличествоДоКорректировки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаДоИзменения,
	|	ТЧ.СтавкаНДСПоДокументуРеализации КАК СтавкаНДСДоИзменения,
	|	ТЧ.СуммаНДСДоКорректировки КАК СуммаНДСДоИзменения,
	|	ТЧ.СуммаВсего КАК Сумма,
	|	ТЧ.СуммаВсегоДоКорректировки КАК СуммаДоИзменения,
	|	ТЧ.СуммаВсего КАК ВсегоВРубляхДоИзменения,
	|	ТЧ.СуммаНДСДоКорректировки КАК НДСВРубляхДоИзменения,
	|	ИСТИНА КАК СуществуютЗаписиРублевыхСумм,
	|	&НоменклатураТип КАК НоменклатураТип,
	|	ТЧ.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ТЧ.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ГТД.Страна.Код, """") КАК СтранаПроисхожденияКод,
	|	&ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	&ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	|	ТЧ.СуммаВсего КАК ВсегоВРублях
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
	|		ПО ТЧ.Номенклатура = ИдентификаторыНоменклатуры.Номенклатура
	|			И ТЧ.ХарактеристикаНоменклатуры = ИдентификаторыНоменклатуры.Характеристика
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СуммаВсегоРазница <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Ссылка,
	|	""Автоработы"",
	|	1,
	|	ТЧ.НомерСтроки,
	|	ТЧ.Авторабота,
	|	ТЧ.Авторабота.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Час),
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка),
	|	ТЧ.Количество,
	|	ЛОЖЬ,
	|	ТЧ.Цена,
	|	ТЧ.СуммаВсего - ТЧ.СуммаНДС,
	|	ТЧ.СуммаНДС,
	|	ТЧ.СуммаВсего,
	|	ТЧ.СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	ТЧ.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ТЧ.Авторабота),
	|	ТЧ.Авторабота.Код,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ТЧ.Количество,
	|	ТЧ.Нормочас,
	|	ТЧ.Коэффициент,
	|	ТЧ.Количество,
	|	""Service"",
	|	""356"",
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка),
	|	ТЧ.КоличествоДоКорректировки,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Час),
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Час),
	|	ВЫБОР
	|		КОГДА ТЧ.КоличествоДоКорректировки <> 0
	|			ТОГДА ТЧ.СуммаВсегоДоКорректировки / ТЧ.КоличествоДоКорректировки
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТЧ.СтавкаНДСПоДокументуРеализации,
	|	ТЧ.СуммаНДСДоКорректировки,
	|	ТЧ.СуммаВсего,
	|	ТЧ.СуммаВсегоДоКорректировки,
	|	ТЧ.СуммаВсего,
	|	ТЧ.СуммаНДСДоКорректировки,
	|	ИСТИНА,
	|	""Работа"",
	|	ТЧ.Авторабота.Артикул,
	|	ТЧ.Авторабота.НаименованиеПолное,
	|	"""",
	|	""356"",
	|	""ч"",
	|	ТЧ.СуммаВсего
	|ИЗ
	|	Документ.КорректировкаРеализации.Автоработы КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
	|		ПО ТЧ.Авторабота = ИдентификаторыНоменклатуры.Номенклатура
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СуммаВсегоРазница <> 0";
	
	ПсевдонимТаблицыТовары = "ТЧ";
	
	Результат = СтрЗаменить(Результат, "&НоменклатураТип", ВыражениеНоменклатураТип(ПсевдонимТаблицыТовары));
	
	Результат = СтрЗаменить(Результат, "&УпаковкаСсылка", ВыражениеУпаковка(ПсевдонимТаблицыТовары, "ЕдиницаИзмерения"));
	Результат = СтрЗаменить(Результат, "&УпаковкаДоИзмененияСсылка", ВыражениеУпаковка(ПсевдонимТаблицыТовары, "ЕдиницаИзмеренияПоДокументуРеализации"));
	
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияСсылка", ВыражениеЕдиницаИзмерения(ПсевдонимТаблицыТовары, "ЕдиницаИзмерения"));
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияДоИзмененияСсылка", ВыражениеЕдиницаИзмерения(ПсевдонимТаблицыТовары, "ЕдиницаИзмеренияПоДокументуРеализации"));
	
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияКод", ВыражениеЕдиницаИзмеренияКод(ПсевдонимТаблицыТовары));
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияНаименование", ВыражениеЕдиницаИзмеренияНаименование(ПсевдонимТаблицыТовары));
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_УКД_КорректировкаРеализацииАвтомобилей()
	
	Результат =
	"ВЫБРАТЬ
	|	ПередаточныйДокументТовары.Автомобиль КАК Автомобиль,	
	|	ПередаточныйДокументТовары.ИдентификаторАвтомобиля КАК ИдентификаторСтроки	
	|ПОМЕСТИТЬ ИдентификаторыНоменклатуры
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК ПередаточныйДокументТовары
	|ГДЕ
	|	ПередаточныйДокументТовары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Ссылка,
	|	""Автомобили"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Автомобиль КАК Номенклатура,
	|	ТЧ.Автомобиль.Код КАК НоменклатураКод,
	|	ТЧ.Автомобиль.Код КАК КодНоменклатуры,	
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.шт) КАК ЕдиницаИзмерения,	
	|	ТЧ.Автомобиль.ГТД КАК НомерГТД,
	|	ТЧ.Автомобиль.ГТД КАК ГТД,	
	|	ЕСТЬNULL(ТЧ.Автомобиль.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,	
	|	ТЧ.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаВсего - ТЧ.СуммаНДС КАК СуммаБезНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.СуммаВсего КАК СуммаСНДС,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ИдентификаторСтроки,"""") КАК ИдентификаторСтроки,
	|	ТЧ.Ссылка КАК ДокументОтгрузки,
	|	ПРЕДСТАВЛЕНИЕ(ТЧ.Автомобиль) КАК НоменклатураПредставление,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	Ложь КАК ЭтоУслуга,
	|	0 КАК Масса,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.шт) КАК ВидУпаковки,
	|	1 КАК КоличествоВОдномМесте,
	|	ТЧ.Количество КАК КоличествоМест,
	|	""Property"" КАК ПризнакТоварРаботаУслуга,
	|	""796"" КАК КодЕдиницыИзмерения,
	|	ЕСТЬNULL(ТЧ.Автомобиль.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхожденияДоИзменения,
	|	ТЧ.Автомобиль.ГТД КАК НомерГТДДоИзменения,
	|	ТЧ.КоличествоПоДокументуРеализации КАК КоличествоДоИзменения,
	|	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК УпаковкаДоИзменения,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.шт) КАК ЕдиницаИзмеренияДоИзменения,
	|	ВЫБОР
	|		КОГДА ТЧ.КоличествоПоДокументуРеализации <> 0
	|			ТОГДА ТЧ.СуммаВсегоДоКорректировки / ТЧ.КоличествоПоДокументуРеализации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаДоИзменения,
	|	ТЧ.СтавкаНДСПоДокументуРеализации КАК СтавкаНДСДоИзменения,
	|	ТЧ.СуммаНДСДоКорректировки КАК СуммаНДСДоИзменения,
	|	ТЧ.СуммаВсего КАК Сумма,
	|	ТЧ.СуммаВсегоДоКорректировки КАК СуммаДоИзменения,
	|	ТЧ.СуммаВсего КАК ВсегоВРубляхДоИзменения,
	|	ТЧ.СуммаНДСДоКорректировки КАК НДСВРубляхДоИзменения,
	|	ИСТИНА КАК СуществуютЗаписиРублевыхСумм,
	|	""Товар"" КАК НоменклатураТип,
	|	ТЧ.Автомобиль.VIN КАК НоменклатураАртикул,
	|	ТЧ.Автомобиль.НаименованиеПолное КАК НоменклатураНаименование,
	|	ЕСТЬNULL(ТЧ.Автомобиль.ГТД.Страна.Код, """") КАК СтранаПроисхожденияКод,
	|	""796"" КАК ЕдиницаИзмеренияКод,
	|	""шт"" КАК ЕдиницаИзмеренияНаименование,
	|	ТЧ.СуммаВсего КАК ВсегоВРублях
	|ИЗ
	|	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
	|		ПО ТЧ.Автомобиль = ИдентификаторыНоменклатуры.Автомобиль
	
	|ГДЕ
	|	ТЧ.Ссылка = &СсылкаНаОбъект
	|	И ТЧ.СуммаВсегоРазница <> 0";
	
	
	ПсевдонимТаблицыТовары = "ТЧ";
	
	Результат = СтрЗаменить(Результат, "&НоменклатураТип", ВыражениеНоменклатураТип(ПсевдонимТаблицыТовары));
	
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияКод", ВыражениеЕдиницаИзмеренияКод(ПсевдонимТаблицыТовары));
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияНаименование", ВыражениеЕдиницаИзмеренияНаименование(ПсевдонимТаблицыТовары));
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_КорректировкаРеализации()
	
	Результат =	
	"ВЫБРАТЬ
	|	ПередаточныйДокументТовары.Номенклатура КАК Номенклатура,
	|	ПередаточныйДокументТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ПередаточныйДокументТовары.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	ПередаточныйДокументТовары.ГТД КАК ГТД
	|ПОМЕСТИТЬ ИдентификаторыНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК ПередаточныйДокументТовары
	|ГДЕ
	|	ПередаточныйДокументТовары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ИдентификаторыНоменклатуры.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ИдентификаторыНоменклатуры.ГТД КАК НомерГТД,
	|	РеализацияТоваровТовары.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	РеализацияТоваровТовары.Цена КАК Цена,
	|	РеализацияТоваровТовары.СуммаВсего - РеализацияТоваровТовары.СуммаНДС КАК СуммаБезНДС,
	|	РеализацияТоваровТовары.СуммаНДС КАК СуммаНДС,
	|	РеализацияТоваровТовары.СуммаВсего КАК СуммаСНДС,
	|	РеализацияТоваровТовары.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровТовары.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	РеализацияТоваровТовары.Ссылка КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ДанныеТабличныхЧастей
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК РеализацияТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
	|		ПО РеализацияТоваровТовары.Номенклатура = ИдентификаторыНоменклатуры.Номенклатура
	|			И РеализацияТоваровТовары.ХарактеристикаНоменклатуры = ИдентификаторыНоменклатуры.Характеристика
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_КорректировкаРеализацииАвтомобилей()
	
	Результат =
	"ВЫБРАТЬ
	|	ПередаточныйДокументТовары.Автомобиль КАК Автомобиль,
	|	ПередаточныйДокументТовары.ИдентификаторАвтомобиля КАК ИдентификаторАвтомобиля
	|ПОМЕСТИТЬ ИдентификаторыНоменклатуры
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК ПередаточныйДокументТовары
	|ГДЕ
	|	ПередаточныйДокументТовары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	""Автомобили"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	РеализацияАвтомобилейАвтомобили.НомерСтроки КАК НомерСтроки,
	|	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
	|	""Товар"" Как НоменклатураТип,
	|	РеализацияАвтомобилейАвтомобили.Автомобиль.Код КАК НоменклатураКод,	
	|	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN КАК НоменклатураАртикул,
	|	РеализацияАвтомобилейАвтомобили.Автомобиль.НаименованиеПолное КАК НоменклатураНаименование,	
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	"""" КАК ХарактеристикаНаименование,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.шт) КАК ЕдиницаИзмерения,
	|	""796"" КАК ЕдиницаИзмеренияКод,
	|	""шт"" КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(РеализацияАвтомобилейАвтомобили.Автомобиль.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(РеализацияАвтомобилейАвтомобили.Автомобиль.ГТД.Страна.Код, """") КАК СтранаПроисхожденияКод,
	|	РеализацияАвтомобилейАвтомобили.Автомобиль.ГТД КАК НомерГТД,
	|	ЕСТЬNULL(РеализацияАвтомобилейАвтомобили.Автомобиль.ГТД.Наименование, """") КАК РегистрационныйНомерГТД,
	|	РеализацияАвтомобилейАвтомобили.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	РеализацияАвтомобилейАвтомобили.Цена КАК Цена,
	|	РеализацияАвтомобилейАвтомобили.СуммаВсего - РеализацияАвтомобилейАвтомобили.СуммаНДС КАК СуммаБезНДС,
	|	РеализацияАвтомобилейАвтомобили.СуммаНДС КАК СуммаНДС,
	|	РеализацияАвтомобилейАвтомобили.СуммаВсего КАК СуммаСНДС,
	|	РеализацияАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
	|	ИдентификаторыНоменклатуры.ИдентификаторАвтомобиля КАК ИдентификаторСтроки,
	|	РеализацияАвтомобилейАвтомобили.Ссылка КАК ДокументОтгрузки	
	|ИЗ
	|	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
	|		ПО РеализацияАвтомобилейАвтомобили.Автомобиль = ИдентификаторыНоменклатуры.Автомобиль
	|ГДЕ
	|	РеализацияАвтомобилейАвтомобили.Ссылка = &СсылкаНаОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТабличнойЧасти,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_РеализацияАвтомобилей()
	
	Результат =
	"ВЫБРАТЬ
	|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	""Автомобили"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	РеализацияАвтомобилейАвтомобили.НомерСтроки КАК НомерСтроки,
	|	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.шт) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(РеализацияАвтомобилейАвтомобили.Автомобиль.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	РеализацияАвтомобилейАвтомобили.Автомобиль.ГТД КАК НомерГТД,
	|	РеализацияАвтомобилейАвтомобили.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	РеализацияАвтомобилейАвтомобили.Цена КАК Цена,
	|	РеализацияАвтомобилейАвтомобили.СуммаВсего - РеализацияАвтомобилейАвтомобили.СуммаНДС КАК СуммаБезНДС,
	|	РеализацияАвтомобилейАвтомобили.СуммаНДС КАК СуммаНДС,
	|	РеализацияАвтомобилейАвтомобили.СуммаВсего КАК СуммаСНДС,
	|	РеализацияАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияАвтомобилейАвтомобили.ИдентификаторАвтомобиля КАК ИдентификаторСтроки,
	|	РеализацияАвтомобилейАвтомобили.Ссылка КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ДанныеТабличныхЧастей
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	|ГДЕ
	|	РеализацияАвтомобилейАвтомобили.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияАвтомобилейТовары.Ссылка,
	|	""Товары"",
	|	1,
	|	РеализацияАвтомобилейТовары.НомерСтроки,
	|	РеализацияАвтомобилейТовары.Номенклатура,
	|	РеализацияАвтомобилейТовары.ХарактеристикаНоменклатуры,
	|	РеализацияАвтомобилейТовары.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка),
	|	РеализацияАвтомобилейТовары.Количество,
	|	ЛОЖЬ,
	|	РеализацияАвтомобилейТовары.Цена,
	|	РеализацияАвтомобилейТовары.СуммаВсего - РеализацияАвтомобилейТовары.СуммаНДС,
	|	РеализацияАвтомобилейТовары.СуммаНДС,
	|	РеализацияАвтомобилейТовары.СуммаВсего,
	|	РеализацияАвтомобилейТовары.СтавкаНДС,
	|	РеализацияАвтомобилейТовары.ИдентификаторАвтомобиля,
	|	РеализацияАвтомобилейТовары.Ссылка
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Товары КАК РеализацияАвтомобилейТовары
	|ГДЕ
	|	РеализацияАвтомобилейТовары.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_РеализацияАктивов()
	
	Результат =
	"ВЫБРАТЬ
	|	Таб.Ссылка КАК Ссылка,
	|	""Активы"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	Таб.НомерСтроки КАК НомерСтроки,
	|	Таб.ПрочийАктив.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Таб.ПрочийАктив.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(Таб.ПрочийАктив.Номенклатура.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(Таб.ПрочийАктив.Номенклатура.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)) КАК НомерГТД,
	|	Таб.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА Таб.Количество > 0
	|			ТОГДА (Таб.Сумма - Таб.СуммаНДС) / Таб.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	Таб.Сумма - Таб.СуммаНДС КАК СуммаБезНДС,
	|	Таб.СуммаНДС КАК СуммаНДС,
	|	Таб.Сумма КАК СуммаСНДС,
	|	Таб.СтавкаНДС КАК СтавкаНДС,
	|	"""" КАК ИдентификаторСтроки,
	|	Таб.Ссылка КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ДанныеТабличныхЧастей
	|ИЗ
	|	Документ.РеализацияАктивов.Активы КАК Таб
	|ГДЕ
	|	Таб.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ЧекНаОплату()
	
	Результат =
	"ВЫБРАТЬ
	|	Таб.Ссылка КАК Ссылка,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	Таб.НомерСтроки КАК НомерСтроки,
	|	Таб.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Таб.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(Таб.ГТД.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(Таб.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)) КАК НомерГТД,
	|	Таб.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	Таб.Цена КАК Цена,
	|	Таб.СуммаВсего - Таб.СуммаНДС КАК СуммаБезНДС,
	|	Таб.СуммаНДС КАК СуммаНДС,
	|	Таб.СуммаВсего КАК СуммаСНДС,
	|	Таб.СтавкаНДС КАК СтавкаНДС,
	|	Таб.ИдентификаторТовара КАК ИдентификаторСтроки,
	|	Таб.Ссылка КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ДанныеТабличныхЧастей
	|ИЗ
	|	Документ.ЧекНаОплату.Товары КАК Таб
	|ГДЕ
	|	Таб.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ЗаказНаряд()
	
	Результат =
	"ВЫБРАТЬ
	|	ЗаказНарядТовары.Ссылка КАК Ссылка,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	0 КАК ПорядокТабличнойЧасти,
	|	ЗаказНарядТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНарядТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ЗаказНарядТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка) КАК НомерГТД,
	|	ЗаказНарядТовары.Количество КАК Количество,
	|	ЛОЖЬ КАК ЦенаВключаетНДС,
	|	ЗаказНарядТовары.Цена КАК Цена,
	|	ЗаказНарядТовары.СуммаВсего - ЗаказНарядТовары.СуммаНДС КАК СуммаБезНДС,
	|	ЗаказНарядТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказНарядТовары.СуммаВсего КАК СуммаСНДС,
	|	ЗаказНарядТовары.СтавкаНДС КАК СтавкаНДС,
	|	"""" КАК ИдентификаторСтроки,
	|	ЗаказНарядТовары.Ссылка КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ДанныеТабличныхЧастей
	|ИЗ
	|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|ГДЕ
	|	ЗаказНарядТовары.Ссылка = &СсылкаНаОбъект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНарядАвтоработы.Ссылка,
	|	""Автоработы"",
	|	1,
	|	ЗаказНарядАвтоработы.НомерСтроки,
	|	ЗаказНарядАвтоработы.Авторабота,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ЗаказНарядАвтоработы.Нормочас,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка),
	|	ЗаказНарядАвтоработы.Количество,
	|	ЛОЖЬ,
	|	ЗаказНарядАвтоработы.Цена,
	|	ЗаказНарядАвтоработы.СуммаВсего - ЗаказНарядАвтоработы.СуммаНДС,
	|	ЗаказНарядАвтоработы.СуммаНДС,
	|	ЗаказНарядАвтоработы.СуммаВсего,
	|	ЗаказНарядАвтоработы.СтавкаНДС,
	|	ЗаказНарядАвтоработы.ИдентификаторРаботы,
	|	ЗаказНарядАвтоработы.Ссылка
	|ИЗ
	|	Документ.ЗаказНаряд.Автоработы КАК ЗаказНарядАвтоработы
	|ГДЕ
	|	ЗаказНарядАвтоработы.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_ВыбратьДанныеТабличныхЧастей()
	
	Результат =
	"ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ТЧ.ПорядокТабличнойЧасти КАК ПорядокТабличнойЧасти,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&НоменклатураТип КАК НоменклатураТип,
	|	ТЧ.Номенклатура.Код КАК НоменклатураКод,
	|	ЕСТЬNULL(ТЧ.Номенклатура.Артикул, """") КАК НоменклатураАртикул,
	|	ТЧ.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ТЧ.Характеристика КАК Характеристика,
	|	ТЧ.Характеристика.Наименование КАК ХарактеристикаНаименование,
	|	&УпаковкаСсылка КАК Упаковка,
	|	&ЕдиницаИзмеренияСсылка КАК ЕдиницаИзмерения,
	|	&ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	&ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	|	ТЧ.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТЧ.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ТЧ.НомерГТД КАК НомерГТД,
	|	ТЧ.НомерГТД.Наименование КАК РегистрационныйНомерГТД,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.СуммаБезНДС КАК СуммаБезНДС,
	|	ТЧ.СуммаНДС КАК СуммаНДС,
	|	ТЧ.СуммаСНДС КАК СуммаСНДС,
	|	ТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТЧ.ДокументОтгрузки КАК ДокументОтгрузки
	|ИЗ
	|	ДанныеТабличныхЧастей КАК ТЧ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицыТовары = "ТЧ";
	
	Результат = СтрЗаменить(Результат, "&НоменклатураТип", ВыражениеНоменклатураТип(ПсевдонимТаблицыТовары));
	
	Результат = СтрЗаменить(Результат, "&УпаковкаСсылка", ВыражениеУпаковка(ПсевдонимТаблицыТовары));
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияСсылка", ВыражениеЕдиницаИзмерения(ПсевдонимТаблицыТовары));
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияКод", ВыражениеЕдиницаИзмеренияКод(ПсевдонимТаблицыТовары));
	Результат = СтрЗаменить(Результат, "&ЕдиницаИзмеренияНаименование", ВыражениеЕдиницаИзмеренияНаименование(ПсевдонимТаблицыТовары));
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТЧ_УничтожитьДанныеТабличныхЧастей()
	
	Результат = "УНИЧТОЖИТЬ ДанныеТабличныхЧастей";
	Возврат Результат;
	
КонецФункции

Функция ПлатежноРасчетныеДокументы(СсылкаНаОбъект)
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект)
		Или ТипЗнч(СсылкаНаОбъект) <> Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРД.Номер КАК Номер,
	|	ПРД.Дата КАК Дата
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК ПРД
	|ГДЕ
	|	ПРД.Ссылка = &СсылкаНаОбъект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьInvoiceForCorrectionInfo(Invoices, ДатаНомерДокумента)
				
	Item_InvoiceForCorrectionInfo = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceForCorrectionInfo");
	
	Item_InvoiceForCorrectionInfo.InvoiceNumber	 = ДатаНомерДокумента.НомерИсходногоДокумента;
	Item_InvoiceForCorrectionInfo.InvoiceDate	 = ДатаНомерДокумента.ДатаИсходногоДокумента;
	
	Если ДатаНомерДокумента.УчитыватьИсправлениеИсходногоДокумента Тогда 
		
		Item_InvoiceRevisionInfo = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceRevisionInfo");
		
		Item_InvoiceRevisionInfo.RevisionNumber	 = ДатаНомерДокумента.НомерИсправленияИсходногоДокумента;
		Item_InvoiceRevisionInfo.RevisionDate	 = ДатаНомерДокумента.ДатаИсправленияИсходногоДокумента;
		
		Item_InvoiceForCorrectionInfo.InvoiceRevisions.Добавить(Item_InvoiceRevisionInfo);
		
	КонецЕсли;
	
	Invoices.Добавить(Item_InvoiceForCorrectionInfo);
	
КонецПроцедуры

Процедура ЗаполнитьInvoiceCorrectionTable(InvoiceCorrectionTable, ТаблицаТоваров)
	
	ВсеСтроки_СтавкаНДС_БезНДС	 = Истина;
	ВсеСтроки_СтавкаНДС_ИсчНалАг = Истина;
	
	ЕстьУвеличение = Ложь;
	ЕстьУменьшение = Ложь;
	
	TotalsDec_Total 				= 0;
	TotalsDec_TotalWithVatExcluded 	= 0;
	TotalsDec_Vat 					= 0;
	
	TotalsInc_Total 				= 0;
	TotalsInc_TotalWithVatExcluded 	= 0;
	TotalsInc_Vat 					= 0;
	
	СтруктураItemInvoiceCorrection = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_ExtendedInvoiceCorrectionItem");
	
	СтавкаНДС_БезНДС   = МетодСервера(, "СтавкаНДС_БезНДС");
	СтавкаНДС_ИсчНалАг = МетодСервера(, "СтавкаНДС_ИсчНалАг");
	
	Для Каждого СтрокаДанных из ТаблицаТоваров Цикл 
		
		Item = СкопироватьСтруктуру(СтруктураItemInvoiceCorrection);
		МенеджерИнтеграции_ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Item, СтрокаДанных);
		InvoiceCorrectionTable.Items.Добавить(Item);
		
		Item.AmountsDec			= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.AmountsInc			= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_AmountsDiff");
		Item.OriginalValues		= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		Item.CorrectedValues	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_InvoiceItemFields");
		
		Item.Product		= СтрокаДанных.НоменклатураПредставление;
		Item.ItemVendorCode	= СокрЛП(СтрокаДанных.КодНоменклатуры);
		
		СтавкаДоИзменения = СтрокаДанных.СтавкаНДСДоИзменения;
		Если Не ЗначениеЗаполнено(СтавкаДоИзменения) Тогда
			СтавкаДоИзменения = СтрокаДанных.СтавкаНДС;
		КонецЕсли;
		
		Item.CorrectedValues.TaxRate = ПредставлениеСтавкиНДС(СтрокаДанных.СтавкаНДС);
		Item.OriginalValues.TaxRate  = ПредставлениеСтавкиНДС(СтавкаДоИзменения);
		
		Если Item.CorrectedValues.TaxRate <> СтавкаНДС_БезНДС Тогда
			ВсеСтроки_СтавкаНДС_БезНДС = Ложь;
		КонецЕсли;
		Если Item.CorrectedValues.TaxRate <> СтавкаНДС_ИсчНалАг Тогда
			ВсеСтроки_СтавкаНДС_ИсчНалАг = Ложь;
		КонецЕсли;
		
		Item.OriginalValues.TotalWithVatExcluded  = СтрокаДанных.СуммаДоИзменения - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДСДоИзменения, 0);
		Item.CorrectedValues.TotalWithVatExcluded = СтрокаДанных.Сумма - ?(СтрокаДанных.СуммаВключаетНДС, СтрокаДанных.СуммаНДС, 0);
		
		Если  ЗначениеЗаполнено(СтрокаДанных.КоличествоДоИзменения)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Код) Тогда
			
			Item.OriginalValues.Quantity = СтрокаДанных.КоличествоДоИзменения;
			Item.OriginalValues.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Код));
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Наименование) Тогда
				Item.OriginalValues.UnitName = СтрокаДанных.ЕдиницаИзмеренияДоИзменения.Наименование;
			Иначе
				Item.OriginalValues.UnitName = НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(Item.OriginalValues.UnitCode);
			КонецЕсли;
			
			Если Item.OriginalValues.TaxRate = СтавкаНДС_БезНДС Или Не СтрокаДанных.СуммаВключаетНДС Тогда
				// Без пересчета, т.к. цена уже без НДС
				Item.OriginalValues.Price = СтрокаДанных.ЦенаДоИзменения;
			Иначе
				// Расчет цены без НДС
				Item.OriginalValues.Price = ?(ЗначениеЗаполнено(Item.OriginalValues.Quantity), Окр(Item.OriginalValues.TotalWithVatExcluded / Item.OriginalValues.Quantity, 2), 0);
			КонецЕсли;
			
			Item.OriginalValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмеренияДоИзменения;
			
		Иначе
			//не инициируем поля UnitCode, UnitName, Quantity, Price, чтобы в печатной форме ЭД были прочерки   
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(СтрокаДанных.Количество)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения)
			И ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения.Код) Тогда
			
			Item.CorrectedValues.UnitCode = XML_КодЕдиницыИзмерения(СокрЛП(СтрокаДанных.ЕдиницаИзмерения.Код));
			
			Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения.Наименование) Тогда
				Item.CorrectedValues.UnitName = СтрокаДанных.ЕдиницаИзмерения.Наименование;
			Иначе
				Item.CorrectedValues.UnitName = НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(Item.CorrectedValues.UnitCode);
			КонецЕсли;
			
			// если до количество было, а теперь его не стало - заполняем 0, а не "-"!!!
			Если ЗначениеЗаполнено(СтрокаДанных.КоличествоДоИзменения) И Не ЗначениеЗаполнено(СтрокаДанных.Количество) Тогда
				
				Item.CorrectedValues.Quantity = 0;
				
			Иначе
				
				Item.CorrectedValues.Quantity = СтрокаДанных.Количество;
				
				Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Или Не СтрокаДанных.СуммаВключаетНДС Тогда
					// Без пересчета, т.к. цена уже без НДС
					Item.CorrectedValues.Price = СтрокаДанных.Цена;
				Иначе
					// Расчет цены без НДС
					Item.CorrectedValues.Price = ?(ЗначениеЗаполнено(Item.CorrectedValues.Quantity), Окр(Item.CorrectedValues.TotalWithVatExcluded / Item.CorrectedValues.Quantity, 2), 0);
				КонецЕсли;
				
			КонецЕсли;
			
			Item.CorrectedValues.ЕдиницаИзмеренияСсылка = СтрокаДанных.ЕдиницаИзмерения;
			
		Иначе
			//не инициируем поля UnitCode, UnitName, Quantity, Price, чтобы в печатной форме ЭД были прочерки   
		КонецЕсли;
		
		
		// НДС и сумма с НДС до изменения
		Если Item.OriginalValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.OriginalValues.Vat = 0;
			Item.OriginalValues.Total = 0;
		Иначе
			
			Если Item.OriginalValues.TaxRate = СтавкаНДС_БезНДС Тогда
				Item.OriginalValues.Vat = Неопределено;
			Иначе
				Item.OriginalValues.Vat = СтрокаДанных.СуммаНДСДоИзменения;
			КонецЕсли;
			
			Item.OriginalValues.Total   = СтрокаДанных.СуммаДоИзменения + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДСДоИзменения);
			
		КонецЕсли;
		
		// НДС и сумма с НДС после изменения
		Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
			Item.CorrectedValues.Vat = 0;
			Item.CorrectedValues.Total = 0;
		Иначе
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
				Item.CorrectedValues.Vat = Неопределено;
			Иначе
				Item.CorrectedValues.Vat = СтрокаДанных.СуммаНДС;
			КонецЕсли;
			
			Item.CorrectedValues.Total = СтрокаДанных.Сумма + ?(СтрокаДанных.СуммаВключаетНДС, 0, СтрокаДанных.СуммаНДС);
			
		КонецЕсли;
		
		
		Если Item.CorrectedValues.TotalWithVatExcluded >= Item.OriginalValues.TotalWithVatExcluded Тогда
			
			// Увеличение
			ЕстьУвеличение = Истина;
			
			Item.AmountsDec.TotalWithVatExcluded = Неопределено;
			Item.AmountsDec.Vat = Неопределено;
			Item.AmountsDec.Total = Неопределено;
			
			Item.AmountsInc.TotalWithVatExcluded = Item.CorrectedValues.TotalWithVatExcluded - Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsInc.Vat = Неопределено;
				Item.AmountsInc.Total = Неопределено;
			Иначе
				
				Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
					Item.AmountsInc.Vat = 0;
				Иначе
					Item.AmountsInc.Vat = МетодСервера(, "ПривестиКЧислу", Item.CorrectedValues.Vat) - МетодСервера(, "ПривестиКЧислу", Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsInc.Total = Item.CorrectedValues.Total - Item.OriginalValues.Total;
				
			КонецЕсли;
			
		Иначе
			
			// Уменьшение
			ЕстьУменьшение = Истина;
			
			Item.AmountsInc.TotalWithVatExcluded = Неопределено;
			Item.AmountsInc.Vat = Неопределено;
			Item.AmountsInc.Total = Неопределено;
			
			Item.AmountsDec.TotalWithVatExcluded = - Item.CorrectedValues.TotalWithVatExcluded + Item.OriginalValues.TotalWithVatExcluded;
			
			Если Item.CorrectedValues.TaxRate = СтавкаНДС_ИсчНалАг Тогда
				Item.AmountsDec.Vat = Неопределено;
				Item.AmountsDec.Total = Неопределено;
			Иначе
				
				Если Item.CorrectedValues.TaxRate = СтавкаНДС_БезНДС Тогда
					Item.AmountsDec.Vat = 0;
				Иначе
					Item.AmountsDec.Vat = - МетодСервера(, "ПривестиКЧислу", Item.CorrectedValues.Vat) + МетодСервера(, "ПривестиКЧислу", Item.OriginalValues.Vat);
				КонецЕсли;
				
				Item.AmountsDec.Total = -Item.CorrectedValues.Total + Item.OriginalValues.Total;
				
			КонецЕсли;
			
		КонецЕсли;
		
		TotalsDec_Total 				= TotalsDec_Total + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.Total);
		TotalsDec_TotalWithVatExcluded 	= TotalsDec_TotalWithVatExcluded + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.TotalWithVatExcluded);
		TotalsDec_Vat 					= TotalsDec_Vat + МетодСервера(, "ПривестиКЧислу", Item.AmountsDec.Vat);
		
		TotalsInc_Total 				= TotalsInc_Total + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.Total);
		TotalsInc_TotalWithVatExcluded 	= TotalsInc_TotalWithVatExcluded + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.TotalWithVatExcluded);
		TotalsInc_Vat 					= TotalsInc_Vat + МетодСервера(, "ПривестиКЧислу", Item.AmountsInc.Vat);
		
		СведенияОСтранеПроисхожденияТовара	= КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных);
		ДопИнформацияОСтранеПроисхождения	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "СведенияОСтранеПроисхожденияСтрокой", СведенияОСтранеПроисхожденияТовара);
		
		ЗаполнитьStructedAdditionalInfos(Item.StructedAdditionalInfos, ДопИнформацияОСтранеПроисхождения);
		
	КонецЦикла;	  
	
	Если ЕстьУвеличение Тогда
		InvoiceCorrectionTable.TotalsInc.Total 					= TotalsInc_Total; 
		InvoiceCorrectionTable.TotalsInc.TotalWithVatExcluded	= TotalsInc_TotalWithVatExcluded; 
		InvoiceCorrectionTable.TotalsInc.Vat 					= ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, TotalsInc_Vat)); 
	КонецЕсли;
	
	Если ЕстьУменьшение Тогда
		InvoiceCorrectionTable.TotalsDec.Total					= TotalsDec_Total; 
		InvoiceCorrectionTable.TotalsDec.TotalWithVatExcluded	= TotalsDec_TotalWithVatExcluded; 
		InvoiceCorrectionTable.TotalsDec.Vat 					= ?(ВсеСтроки_СтавкаНДС_БезНДС, Неопределено, ?(ВсеСтроки_СтавкаНДС_ИсчНалАг, 0, TotalsDec_Vat)); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьEventContent(EventContent, ШапкаУКД)
	
	Для Каждого ПередаточныйДокумент Из ШапкаУКД.РеквизитыПередаточныхДокументов Цикл	
		Новый_BaseDocument = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_BaseDocumentName");
		ЗаполнитьЗначенияСвойств(Новый_BaseDocument, ПередаточныйДокумент);
		EventContent.TransferDocDetails736.Добавить(Новый_BaseDocument);	
	КонецЦикла;
	Если ШапкаУКД.Свойство("ИныеСведенияОбИзмененииСтоимости") Тогда
		EventContent.CostChangeInfo = ШапкаУКД.ИныеСведенияОбИзмененииСтоимости;
	КонецЕсли;
	Если ШапкаУКД.Свойство("ДатаУведомления") Тогда
		EventContent.NotificationDate = ШапкаУКД.ДатаУведомления;
	КонецЕсли;
	
	EventContent.OperationContent = "Изменение стоимости товаров и услуг";
	
	CorrectionBases 				= Новый Массив;
	СтруктураItemCorrectionBases 	= МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CorrectionBase");
	
	ОснованияПередачи = ШапкаУКД.ОснованияПередачи;
	Если ОснованияПередачи.Количество() > 0 Тогда
		СкопироватьСтруктуру(СтруктураItemCorrectionBases);
		Для Каждого ОснованиеПередачи Из ОснованияПередачи Цикл
			ItemCorrectionBases = СкопироватьСтруктуру(СтруктураItemCorrectionBases);
			ЗаполнитьЗначенияСвойств(ItemCorrectionBases, ОснованиеПередачи);
			CorrectionBases.Добавить(ItemCorrectionBases);
		КонецЦикла;
	Иначе
		СтруктураItemCorrectionBases.BaseDocumentName = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОснованиеПередачи_БезДокументаОснования");
		CorrectionBases.Добавить(СтруктураItemCorrectionBases);
	КонецЕсли;
	
	EventContent.CorrectionBases = CorrectionBases;
	
КонецПроцедуры

Функция КоллекцияСведенийОСтранеПроисхождения(СтрокаДанных)
	
	Результат = Новый Структура;
	Результат.Вставить("СтранаПроисхождения"	, СтрокаДанных.ГТД.Страна);
	Результат.Вставить("НомерГТД"				, СтрокаДанных.ГТД);
	
	Возврат Результат;

КонецФункции


#КонецОбласти

#КонецОбласти

#Область ОберткиДляВызоваУниверсальныхМетодов

Функция ЕстьРеквизитМетаданных(ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты = Ложь)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьРеквизитМетаданных", ОбъектМетаданных, ИмяРеквизита, ПроверятьСтандартныеРеквизиты);
	
КонецФункции

Функция ЕстьОбщийРеквизит(ОбъектМетаданных, ИмяРеквизита)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЕстьОбщийРеквизит", ОбъектМетаданных, ИмяРеквизита);
	
КонецФункции

Функция ВидыЭлектронныхДокументов()
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ВидыЭлектронныхДокументов");
	
КонецФункции

Процедура ДобавитьВидДокументаДляОбмена(ВидыДокументов, ОбъектМетаданных, ВидЭД, Ограничения = Неопределено, ПравилоКонвертацииСвойств = Неопределено)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьВидДокументаДляОбмена"
				, ВидыДокументов
				, ОбъектМетаданных
				, ВидЭД
				, Ограничения
				, ПравилоКонвертацииСвойств);
	
КонецПроцедуры

Функция СвойствоСтруктуры(СложнаяСтруктура, ПолныйКлюч, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СвойствоСтруктуры"
					, СложнаяСтруктура
					, ПолныйКлюч
					, ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция СопоставленныеУчетныеДокументы(ИдентификаторЭД)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "СопоставленныеУчетныеДокументы", ИдентификаторЭД);
	
	Возврат Результат;
	
КонецФункции

// Добавляет новую запись в таблицу правил обработки электронных документов.
//
// Параметры:
//  ПравилаОбработки - ТаблицаЗначений - см. ПравилаОбработкиВходящихДокументов;
//  ИдентификаторПравила - Строка - идентификатор правила обработки документов;
//  ВидДокумента		 - Строка - вид документа, к которому относится правило (см. ВидыЭлектронныхДокументов);
//  ДляИсправлений		 - Булево, Неопределено - Ложь, если правило действует только для первичной версии документа;
//                                            Истина, если правило действует для только для исправленной версии документа;
//                                            Неопределено, если правило действует только для первичной и исправительной версий документа;
//
Процедура ДобавитьПравилоОбработкиДокументов(ПравилаОбработки, ИдентификаторПравила, ВидДокумента, ДляИсправлений)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДобавитьПравилоОбработкиДокументов"
		, ПравилаОбработки
		, ИдентификаторПравила
		, ВидДокумента
		, ДляИсправлений);
	
КонецПроцедуры

Функция НоваяТаблицаШтрихкодыУпаковок()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НоваяТаблицаШтрихкодыУпаковок");
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьТаблицуШтрихкодов(ШтрихкодыУпаковок, СведенияОМаркировке, GTIN = "")
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьТаблицуШтрихкодов"
		, ШтрихкодыУпаковок
		, СведенияОМаркировке
		, GTIN);
	
КонецПроцедуры

Функция МенеджерИнтеграции_НовыеСвойстваНоменклатурыИБ()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "НовыеСвойстваНоменклатурыИБ");
	
	Возврат Результат;
	
КонецФункции

Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Возврат МетодСервера(, "СравнитьВерсии", СтрокаВерсии1, СтрокаВерсии2);
	
КонецФункции

Функция ПустыеЗначенияРеквизита(ИмяРеквизита)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ПустыеЗначенияРеквизита", ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ОписаниеПрикладногоДокумента(СсылкаНаОбъект)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОписаниеПрикладногоДокумента",
		СсылкаНаОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ДатаНомерДокумента(ОписаниеДокумента, ИндексОП = "")
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДатаНомерДокумента",
		ОписаниеДокумента,
		ИндексОП);
	
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_РеквизитыЮрФизЛица(ЮрФизЛицо, Период = '00010101', БанковскийСчет = Неопределено, ОбособленноеПодразделение = Неопределено)
	
	Результат = РеквизитыЮрФизЛица(ЮрФизЛицо, Период, БанковскийСчет);
	
	ОрганизацияПодразделения = ОрганизацияОбособленногоПодразделения(ОбособленноеПодразделение);
		
	Если ОрганизацияПодразделения = ЮрФизЛицо Тогда
		
		РеквизитыПодразделения = РеквизитыЮрФизЛица(ОбособленноеПодразделение, Период);
		ПодразделениеКПП = РеквизитыПодразделения.КПП;
		
		Если ЗначениеЗаполнено(ПодразделениеКПП)
			И Результат.КПП <> ПодразделениеКПП Тогда
			
			Результат.КПП = ПодразделениеКПП;		
			ЗаполнитьЗначенияСвойств(Результат, РеквизитыПодразделения,	"Банк, БИК, АдресБанка, НомерСчета, КоррСчет");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыЮрФизЛица(ЮрФизЛицо, Период = '00010101', Знач БанковскийСчет = Неопределено)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "РеквизитыЮрФизЛица", ЮрФизЛицо, Период, БанковскийСчет);
	
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_Новый_CustomDeclaration()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "Новый_CustomDeclaration");
	Возврат Результат;
	
КонецФункции

Процедура МенеджерИнтеграции_ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией(Контент, СтрокаТЧ)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный"
				, "ДополнитьКонтентСтрокиДокументаСлужебнойИнформацией"
				, Контент
				, СтрокаТЧ);
	
КонецПроцедуры

Функция ЗначенияРеквизитовОбъектаЛокальная(Ссылка, Реквизиты)
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ЗначенияРеквизитовОбъектаЛокальная", Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеШапки(Ссылка)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеШапки", Ссылка);
	
КонецФункции

Функция ДанныеТабличныхЧастей(Шапка) 
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДанныеТабличныхЧастей", Шапка);
	
КонецФункции

Процедура ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти(Шапка, ТабличнаяЧасть)
	
	МетодСервера("Модуль_ИнтеграцияУниверсальный", "ДополнитьДанныеШапкиХарактеристикамиТабличнойЧасти", Шапка, ТабличнаяЧасть);
	
КонецПроцедуры

Функция СкопироватьСтруктуру(Знач СтруктураИсходник)
	
	Возврат МетодСервера("Модуль_ИнтеграцияУниверсальный", "СкопироватьСтруктуру", СтруктураИсходник);
	
КонецФункции

Функция XML_КодЕдиницыИзмерения(КодЕдиницыИзмерения)
	
	Результат = МетодСервера(, "XML_КодЕдиницыИзмерения", КодЕдиницыИзмерения);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеЕдиницыИзмеренияПоКодуОКЕИ(КодОКЕИ)
	
	Результат = МетодСервера(, "НаименованиеЕдиницыИзмеренияПоКодуОКЕИ", КодОКЕИ);
	
	Возврат Результат;
	
КонецФункции

Функция МенеджерИнтеграции_ОписанияПодсистемКонфигурации()
	
	Результат = МетодСервера("Модуль_ИнтеграцияУниверсальный", "ОписанияПодсистемКонфигурации");
	Возврат Результат;
	
КонецФункции

Функция ВерсияПодсистемыАА()
	
	Результат = "0.0.0.0";
	
	ВозможныеИменаПодсистем = Новый Массив;
	ВозможныеИменаПодсистем.Добавить("Автосалон6");
	ВозможныеИменаПодсистем.Добавить("Автосалон6Базовая");
	
	Для Каждого ИмяПодсистемы Из ВозможныеИменаПодсистем Цикл
		
		ПодсистемаАА = ОбновлениеИнформационнойБазы.ВерсияИБ(ИмяПодсистемы);
		Если ПодсистемаАА <> "0.0.0.0" Тогда
			Результат = ПодсистемаАА;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоРедакция6_1()
	
	Если ЭтоРедакция6_1 = Неопределено Тогда
		ВерсияАА = ВерсияПодсистемыАА();
		ЭтоРедакция6_1 = (СравнитьВерсии(ВерсияАА, "6.1") >= 0);
	КонецЕсли;

	Результат = ЭтоРедакция6_1;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПодготовкаСпискаИсходящихДокументов

Функция ПараметрыСчетаНаОплату(СсылкаНаОбъект) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЭтоСчетНаОплату(СсылкаНаОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МетаСчета = МетаСчетаНаОплату(СсылкаНаОбъект);
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаДокумента", МетаСчета.СуммаСНалогом);
	Результат.Вставить("СуммаНДСДокумента", МетаСчета.СуммаНалога);
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыСчетаФактуры(СчетФактура) Экспорт
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ТребуемыеРеквизиты = Новый Структура;
	
	ТребуемыеРеквизиты.Вставить("СуммаДокумента", "СуммаДокумента");
	ТребуемыеРеквизиты.Вставить("СуммаУвеличение", "0");
	ТребуемыеРеквизиты.Вставить("СуммаУменьшение", "0");
	
	ТребуемыеРеквизиты.Вставить("СуммаНДСДокумента", "СуммаНДСДокумента");
	ТребуемыеРеквизиты.Вставить("СуммаНДСУвеличение", "0");
	ТребуемыеРеквизиты.Вставить("СуммаНДСУменьшение", "0");
	
	Результат = ЗначенияРеквизитовОбъектаЛокальная(СчетФактура, ТребуемыеРеквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуНакладныхПоСчетуФактуреВыданному(СсылкаНаОбъект) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.ДокументОснование КАК Ссылка,
	|	Т.ДокументОснование.Дата КАК Дата,
	|	Т.ДокументОснование.ДоговорВзаиморасчетов КАК Договор
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Т
	|ГДЕ
	|	Т.Ссылка = &СчетФактура";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СчетФактура", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьВТДляСпискаОтправкиДокументов(ТипыДокументов, Запрос) Экспорт
	
	МассивВременныхТаблиц = Новый Массив;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" ИЛИ ТипыДокументов = "2" ИЛИ ТипыДокументов = "5" ИЛИ ТипыДокументов = "6" Тогда
		ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц);
		ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов);
		ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "1" Тогда
		ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "2" Тогда
		ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "3" Тогда
		ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "4" Тогда
		ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц);
	КонецЕсли;
	
	Возврат МассивВременныхТаблиц;
	
КонецФункции

Процедура ПодготовитьВТ_Накладные(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_Накладные_ЗаказНаряд(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_РеализацияАвтомобилей(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_РеализацияАктивов(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_Накладные_РеализацияТоваров(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_ЗаказНаряд(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ТребуетсяСФ КАК ТребуетсяСФ,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.ЗаказНаряд КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьНДС) КАК ЕстьНДС,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары) КАК ЕстьТовары,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги) КАК ЕстьУслуги,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		ВЫБОР
	|			КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ИСТИНА КАК ЕстьТовары,
	|		ЛОЖЬ КАК ЕстьУслуги,
	|		ТЧ.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		ВЫБОР
	|			КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ИСТИНА,
	|		ИСТИНА,
	|		0,
	|		ТЧ.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Автоработы КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.ДокументОснование КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_ЗаказНаряд
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	НЕ ВТ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_ЗаказНаряд
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ НЕ ВТ_Основная.ТребуетсяСФ
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТребуетсяСФ", ТекстЗапроса_Реализация_ТребуетсяСчетФактура());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование", ПустыеЗначенияРеквизита("Документ.ЗаказНаряд.Реквизит.ДокументОснование"));
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_ЗаказНаряд");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_ЗаказНаряд");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияАвтомобилей(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ТребуетсяСФ КАК ТребуетсяСФ,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РеализацияАвтомобилей КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьНДС) КАК ЕстьНДС,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары) КАК ЕстьТовары,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги) КАК ЕстьУслуги,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		ВЫБОР
	|			КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ИСТИНА КАК ЕстьТовары,
	|		ЛОЖЬ КАК ЕстьУслуги,
	|		ТЧ.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		ВЫБОР
	|			КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ИСТИНА,
	|		ИСТИНА,
	|		0,
	|		ТЧ.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Товары КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.ДокументОснование КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_РеализацияАвтомобилей
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	НЕ ВТ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РеализацияАвтомобилей
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ НЕ ВТ_Основная.ТребуетсяСФ
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТребуетсяСФ", ТекстЗапроса_Реализация_ТребуетсяСчетФактура());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование", ПустыеЗначенияРеквизита("Документ.РеализацияАвтомобилей.Реквизит.ДокументОснование"));
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияАвтомобилей");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_РеализацияАвтомобилей");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияАктивов(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ТребуетсяСФ КАК ТребуетсяСФ,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РеализацияАктивов КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьНДС) КАК ЕстьНДС,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары) КАК ЕстьТовары,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги) КАК ЕстьУслуги,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		ВЫБОР
	|			КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ИСТИНА КАК ЕстьТовары,
	|		ЛОЖЬ КАК ЕстьУслуги,
	|		ТЧ.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияАктивов.Активы КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.ДокументОснование КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_РеализацияАктивов
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	НЕ ВТ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РеализацияАктивов
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ НЕ ВТ_Основная.ТребуетсяСФ
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТребуетсяСФ", ТекстЗапроса_Реализация_ТребуетсяСчетФактура());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование", ПустыеЗначенияРеквизита("Документ.РеализацияАктивов.Реквизит.ДокументОснование"));
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияАктивов");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_РеализацияАктивов");
	
КонецПроцедуры

Процедура ПодготовитьВТ_Накладные_РеализацияТоваров(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	&ТребуетсяСФ КАК ТребуетсяСФ,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") КАК СостояниеОтправкиДополнительныхВПФ,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.РеализацияТоваров КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК СтатусОтправляемыхВПФ
	|		ПО Документ.Ссылка = СтатусОтправляемыхВПФ.Объект
	|			И (СтатусОтправляемыхВПФ.Свойство = &СвойствоДокументаСтатусОтправляемыхВПФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП_ДокументыОснования КАК УПД_СЧФДОП_ДокументыОснования
	|		ПО Документ.Ссылка = УПД_СЧФДОП_ДокументыОснования.ДокументОснование
	|ГДЕ
	|	УПД_СЧФДОП_ДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И (ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|			ИЛИ ЕСТЬNULL(СтатусОтправляемыхВПФ.Значение, """") ПОДОБНО ""%[НУ]%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьНДС) КАК ЕстьНДС,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьТовары) КАК ЕстьТовары,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьУслуги) КАК ЕстьУслуги,
	|	СУММА(ВложенныйЗапрос.СуммаНДСТовары) КАК СуммаНДСТовары,
	|	СУММА(ВложенныйЗапрос.СуммаНДСУслуги) КАК СуммаНДСУслуги
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		ВЫБОР
	|			КОГДА ТЧ.СтавкаНДС <> &Ставка_БезНДС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьНДС,
	|		ВЫБОР
	|			КОГДА НЕ ТЧ.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатурыУслуги)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьТовары,
	|		ВЫБОР
	|			КОГДА ТЧ.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатурыУслуги)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьУслуги,
	|		ТЧ.СуммаНДС КАК СуммаНДСТовары,
	|		0 КАК СуммаНДСУслуги
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + ТекстЗапросаВременнаяТаблица_ЕстьСЧФ();
	
	ТекстЗапроса = ТекстЗапроса + РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.ДокументОснование КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_Накладные_РеализацияТоваров
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|ГДЕ
	|	НЕ ВТ_Основная.ДокументОснование В (&ПустыеЗначенияДокументОснование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ,
	|	ВТ_Основная.Документ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьТовары, ЛОЖЬ)
	|			ТОГДА &ВидыЭД_АктОбОказанииУслуг
	|		ИНАЧЕ &ВидыЭД_ТоварнаяНакладная
	|	КОНЕЦ КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	ВТ_Основная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСТовары, 0) КАК СуммаНДСТовары,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДСУслуги, 0) КАК СуммаНДСУслуги,
	|	""РеализацияТоваровУслуг"" КАК Тип,
	|	&ФункцияДокумента КАК ФункцияУПД
	|ПОМЕСТИТЬ Накладные_РеализацияТоваров
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьСЧФ КАК ВТ_ЕстьСЧФ
	|		ПО ВТ_Основная.Документ = ВТ_ЕстьСЧФ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|ГДЕ
	|	(ВТ_ЕстьСЧФ.Документ ЕСТЬ НЕ NULL 
	|			ИЛИ НЕ ВТ_Основная.ТребуетсяСФ
	|			ИЛИ ВТ_Основная.ФормироватьУПД <> &КлючНастройки_СЧФДОП
	|			ИЛИ ВТ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|				И НЕ ЕСТЬNULL(СуммаНДСЗначение.ЕстьНДС, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕстьСЧФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФункцияДокумента", ТекстЗапроса_ФункцияПервичногоДокумента("ВТ_Основная"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТребуетсяСФ", ТекстЗапроса_Реализация_ТребуетсяСчетФактура());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ВидыНоменклатурыУслуги", ВидыНоменклатурыУслуги());
	Запрос.УстановитьПараметр("Ставка_БезНДС", МенеджерИнтеграции_СтавкаБезНДС());
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументОснование", ПустыеЗначенияРеквизита("Документ.РеализацияТоваров.Реквизит.ДокументОснование"));
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("Накладные_РеализацияТоваров");
	МассивВременныхТаблиц.Добавить("Связь_Накладные_РеализацияТоваров");
	
КонецПроцедуры

Функция ТекстЗапроса_Реализация_ТребуетсяСчетФактура(ПсевдонимТаблицы = "Документ")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ДоговорВзаиморасчетов.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СКомиссионером)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ФункцияПервичногоДокумента(ПсевдонимТаблицы = "ВТ_Основная")
	
	Результат = 
	"	ВЫБОР
	|		КОГДА ПсевдонимТаблицы.ЭтоКорректировка
	|				И ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДИС
	|		КОГДА ПсевдонимТаблицы.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_ДОП, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_ДОП
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблица_ЕстьСЧФ()
	
	Результат =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ЕстьСЧФ
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СЧФ
	|		ПО ВТ_Основная.Документ = СЧФ.ДокументОснование
	|ГДЕ
	|	СЧФ.Ссылка ЕСТЬ НЕ NULL 
	|	И НЕ СЧФ.ПометкаУдаления
	|	И (СЧФ.Проведен
	|			ИЛИ ВТ_Основная.ОтправлятьНепроведенные = ИСТИНА)";
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьВТ_СЧФ_Основная(Запрос, МассивВременныхТаблиц)
	
	Поместить_ВТ_Основная =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументов.Ссылка КАК Документ,
	|	&ЭтоИсправление КАК ЭтоИсправление,
	|	&ЭтоКорректировка КАК ЭтоКорректировка,
	|	&ЭтоАванс КАК ЭтоАванс,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.Контрагент КАК Контрагент,
	|	ДанныеДокументов.ВалютаДокумента КАК Валюта,
	|	ДанныеДокументов.СуммаДокумента КАК СуммаДокументаЗначение,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ДанныеДокументов.Проведен КАК Проведен,
	|	ДанныеДокументов.Дата КАК Дата,
	|	ДанныеДокументов.Номер КАК Номер,
	|	ДанныеДокументов.ДокументОснование КАК ДокументОснование,
	|	НастройкиЭДО.ФормироватьУПД КАК ФормироватьУПД,
	|	НастройкиЭДО.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета,
	|	НастройкиЭДО.ОтправлятьНепроведенные КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО ДанныеДокументов.Организация = НастройкиЭДО.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО ДанныеДокументов.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|ГДЕ
	|	ДанныеДокументов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|	И НЕ ДанныеДокументов.ПометкаУдаления
	|	И ДанныеДокументов.Контрагент = НастройкиЭДО.Контрагент
	|	И (ДанныеДокументов.Проведен
	|			ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент";
	
	Подзапросы = Новый Массив;
	Подзапросы.Добавить(Поместить_ВТ_Основная);
	Подзапросы.Добавить(ТекстЗапроса_Поместить_ДанныеДокументаИДокументыОснования());
	Подзапросы.Добавить(ТекстЗапроса_Поместить_СуммыДокОснованийЗначение());
	Подзапросы.Добавить(ТекстЗапроса_Поместить_СЧФ_Основная());
	Подзапросы.Добавить("УНИЧТОЖИТЬ ВТ_Основная");
	Подзапросы.Добавить("УНИЧТОЖИТЬ СуммыДокОснованийЗначение");
	Подзапросы.Добавить("УНИЧТОЖИТЬ ДанныеДокументаИДокументыОснования");
	
	ТекстЗапроса = СтрСоединить(Подзапросы, РазделительПакетаЗапросов());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоАванс", ВыражениеЭтоСчетФактураНаАванс());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоИсправление", ТекстЗапроса_СчетФактура_ЭтоИсправление());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКорректировка", ТекстЗапроса_СчетФактура_ЭтоКорректировка());
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВТ_УПД_СЧФДОП(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|	И НЕ СЧФ_Основная.ЭтоКорректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID_ = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетФактура КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоАванс
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_СЧФДОП
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УПД_СЧФДОП
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|ГДЕ
	|	НЕ СЧФ_Основная.ЭтоАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ УПД_СЧФДОП_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "5" Тогда
		МассивВременныхТаблиц.Добавить("УПД_СЧФДОП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_УКД_КСЧФДИС(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СЧФ_Основная.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_ПодходящиеСЧФ
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|ГДЕ
	|	СЧФ_Основная.ФормироватьУПД = &КлючНастройки_СЧФДОП
	|	И СЧФ_Основная.ЭтоКорректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	СЧФ_Основная.Документ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СЧФ_Основная.ID_ = СЧФ_Основная.ДокументОснованиеID
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	&ВидыЭД_КорректировочныйСчетФактура КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоАванс
	|			ТОГДА &ФункцияЭД_КСЧФ
	|		ИНАЧЕ &ФункцияЭД_КСЧФДИС
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ УКД_КСЧФДИС
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|ГДЕ
	|	НЕ СЧФ_Основная.ЭтоАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ УКД_КСЧФДИС_ДокументыОснования
	|ИЗ
	|	ВТ_ПодходящиеСЧФ КАК ВТ_ПодходящиеСЧФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СЧФ_Основная КАК СЧФ_Основная
	|		ПО ВТ_ПодходящиеСЧФ.Документ = СЧФ_Основная.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеСЧФ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Если ПустаяСтрока(ТипыДокументов) ИЛИ ТипыДокументов = "6" Тогда
		МассивВременныхТаблиц.Добавить("УКД_КСЧФДИС");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетаФактуры(Запрос, МассивВременныхТаблиц, ТипыДокументов)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СЧФ_Основная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	СЧФ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Основная.Организация КАК Организация,
	|	СЧФ_Основная.Контрагент КАК Контрагент,
	|	СЧФ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Основная.СуммаНДСТовары КАК СуммаНДСТовары,
	|	СЧФ_Основная.СуммаНДСУслуги КАК СуммаНДСУслуги,
	|	СЧФ_Основная.Валюта КАК Валюта,
	|	СЧФ_Основная.Проведен КАК Проведен,
	|	СЧФ_Основная.Дата КАК Дата,
	|	СЧФ_Основная.Номер КАК Номер,
	|	СЧФ_Основная.ID_ КАК ID_,
	|	ВЫБОР
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|				И СЧФ_Основная.ЭтоКорректировка
	|			ТОГДА &ФункцияЭД_КСЧФ
	|		КОГДА СЧФ_Основная.ФормироватьУПД В (&КлючНастройки_СЧФДОП, &КлючНастройки_СЧФ, &КлючНастройки_СЧФ_ДОП)
	|			ТОГДА &ФункцияЭД_СЧФ
	|		ИНАЧЕ &ФункцияЭД_ПоУмолчанию
	|	КОНЕЦ КАК ФункцияУПД,
	|	""СчетФактураВыданный"" КАК Тип,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ЛОЖЬ КАК ЭтоСчет
	|ПОМЕСТИТЬ СчетФактураВыданный
	|ИЗ
	|	СЧФ_Основная КАК СЧФ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД_СЧФДОП КАК УПД_СЧФДОП
	|		ПО СЧФ_Основная.Документ = УПД_СЧФДОП.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ УКД_КСЧФДИС КАК УКД_КСЧФДИС
	|		ПО СЧФ_Основная.Документ = УКД_КСЧФДИС.Документ
	|ГДЕ
	|	УПД_СЧФДОП.Документ ЕСТЬ NULL
	|	И УКД_КСЧФДИС.Документ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СЧФ_Основная";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетФактураВыданный");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату(Запрос, МассивВременныхТаблиц)
	
	ПодготовитьВТ_СчетНаОплату_СчетНаОплату(Запрос, МассивВременныхТаблиц);
	ПодготовитьВТ_СчетНаОплату_СчетНаОплатуЗаАвтомобили(Запрос, МассивВременныхТаблиц);
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_СчетНаОплату(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетНаОплату КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		Товары.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату.Товары КАК Товары
	|			ПО ВТ_Основная.Документ = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		Автоработы.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплату.Автоработы КАК Автоработы
	|			ПО ВТ_Основная.Документ = Автоработы.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_СчетНаОплату
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	""СчетНаОплату"" КАК Тип,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_СчетНаОплату
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_СчетНаОплату");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_СчетНаОплату");
	
КонецПроцедуры

Процедура ПодготовитьВТ_СчетНаОплату_СчетНаОплатуЗаАвтомобили(Запрос, МассивВременныхТаблиц)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.СуммаДокумента КАК СуммаДокументаЗначение,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.СчетНаОплатуЗаАвтомобили КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификаторСчета)
	|ГДЕ
	|	НастройкиЭДО.ОснованиеФормированияСчета = &ОснованиеСчета_Счет
	|	И ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммаНДСЗначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основная.Документ КАК Документ,
	|		ТЧ.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуЗаАвтомобили.Товары КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Основная.Документ,
	|		ТЧ.СуммаНДС
	|	ИЗ
	|		ВТ_Основная КАК ВТ_Основная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуЗаАвтомобили.Автомобили КАК ТЧ
	|			ПО ВТ_Основная.Документ = ТЧ.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	ВТ_Основная.Документ КАК ДокументСвязь
	|ПОМЕСТИТЬ Связь_СчетНаОплату_СчетНаОплатуЗаАвтомобили
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_СчетНаОплату КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	ВТ_Основная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	ЕСТЬNULL(СуммаНДСЗначение.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	""СчетНаОплату"" КАК Тип,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ СчетНаОплату_СчетНаОплатуЗаАвтомобили
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаНДСЗначение КАК СуммаНДСЗначение
	|		ПО ВТ_Основная.Документ = СуммаНДСЗначение.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммаНДСЗначение";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("СчетНаОплату_СчетНаОплатуЗаАвтомобили");
	МассивВременныхТаблиц.Добавить("Связь_СчетНаОплату_СчетНаОплатуЗаАвтомобили");
	
КонецПроцедуры

Процедура ПодготовитьВТ_АктСверкиВзаиморасчетов(Запрос, МассивВременныхТаблиц)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ID,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_Основная
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЭДО КАК НастройкиЭДО
	|		ПО (Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (НЕ Документ.ПометкаУдаления)
	|			И Документ.Организация = НастройкиЭДО.Организация
	|			И Документ.Контрагент = НастройкиЭДО.Контрагент
	|			И (Документ.Проведен
	|				ИЛИ НастройкиЭДО.ОтправлятьНепроведенные = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО Документ.Ссылка = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)
	|ГДЕ
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основная.Документ КАК Документ,
	|	&ВидыЭД_АктСверки КАК ВидЭД,
	|	ВТ_Основная.ЭтоИсправление КАК ЭтоИсправление,
	|	ВТ_Основная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	ВТ_Основная.Организация КАК Организация,
	|	ВТ_Основная.Контрагент КАК Контрагент,
	|	0 КАК СуммаДокументаЗначение,
	|	ВТ_Основная.Валюта КАК Валюта,
	|	ВТ_Основная.ID КАК ID_,
	|	"""" КАК СостояниеОтправкиДополнительныхВПФ,
	|	ВТ_Основная.Проведен КАК Проведен,
	|	ВТ_Основная.Дата КАК Дата,
	|	ВТ_Основная.Номер КАК Номер,
	|	0 КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""АктСверкиВзаиморасчетов"" КАК Тип,
	|	&ФункцияЭД_ПоУмолчанию КАК ФункцияУПД
	|ПОМЕСТИТЬ АктСверкиВзаиморасчетов
	|ИЗ
	|	ВТ_Основная КАК ВТ_Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Основная";
	
	Запрос.Выполнить();
	
	МассивВременныхТаблиц.Добавить("АктСверкиВзаиморасчетов");
	
КонецПроцедуры

Функция ВыражениеЭтоСчетФактураНаАванс(ПсевдонимТаблицы = "ДанныеДокументов")
	
	ТипыОснованийАвансовогоСФ = Новый Массив;
	ТипыОснованийАвансовогоСФ.Добавить("ТИП(Документ.Выписка)");
	ТипыОснованийАвансовогоСФ.Добавить("ТИП(Документ.ЧекНаОплату)");
	
	ШаблонУсловия = "ТИПЗНАЧЕНИЯ(ПсевдонимТаблицы.ДокументОснование) = &ТипДокумента";
	
	КоллекцияУсловий = Новый Массив;
	
	Для Каждого ТипОснования Из ТипыОснованийАвансовогоСФ Цикл
		
		Условие = СтрЗаменить(ШаблонУсловия, "&ТипДокумента", ТипОснования);
		КоллекцияУсловий.Добавить(Условие);
		
	КонецЦикла;
	
	Результат =
	"ВЫБОР
	|	КОГДА &ЭтоАванс
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ЭтоАванс", СтрСоединить(КоллекцияУсловий, " ИЛИ "));
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоИсправление(ПсевдонимТаблицы = "ДанныеДокументов")
	
	Результат = "ПсевдонимТаблицы.Исправление";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактура_ЭтоКорректировка(ПсевдонимТаблицы = "ДанныеДокументов")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданныйКорректировка)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КорректировкаРеализации_ЭтоИсправление(ПсевдонимТаблицы = "ДанныеДокументов")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КорректировкаРеализации_ЭтоКорректировка(ПсевдонимТаблицы = "ДанныеДокументов")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КорректировкаРеализацииАвтомобилей_ЭтоИсправление(ПсевдонимТаблицы = "ДанныеДокументов")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_КорректировкаРеализацииАвтомобилей_ЭтоКорректировка(ПсевдонимТаблицы = "ДанныеДокументов")
	
	Результат =
	"ВЫБОР
	|	КОГДА ПсевдонимТаблицы.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииАвтомобилейКорректировкаПоСогласованиюСторон)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Результат, ПсевдонимТаблицы);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_Поместить_ДанныеДокументаИДокументыОснования()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СчетаФактуры.Документ КАК Документ,
	|	СчетаФактуры.ЭтоИсправление КАК ЭтоИсправление,
	|	СчетаФактуры.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СчетаФактуры.ЭтоАванс КАК ЭтоАванс,
	|	СчетаФактуры.Организация КАК Организация,
	|	СчетаФактуры.Контрагент КАК Контрагент,
	|	СчетаФактуры.Валюта КАК Валюта,
	|	СчетаФактуры.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СчетаФактуры.ID КАК ID,
	|	СчетаФактуры.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	СчетаФактуры.Проведен КАК Проведен,
	|	СчетаФактуры.Дата КАК Дата,
	|	СчетаФактуры.Номер КАК Номер,
	|	СчетаФактуры.ФормироватьУПД КАК ФормироватьУПД,
	|	СчетаФактуры.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(ИдентификаторДокументаВДиадок.Значение, """") КАК ДокументОснованиеID,
	|	СчетаФактуры.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета
	|ПОМЕСТИТЬ ДанныеДокументаИДокументыОснования
	|ИЗ
	|	ВТ_Основная КАК СчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ИдентификаторДокументаВДиадок
	|		ПО СчетаФактуры.ДокументОснование = ИдентификаторДокументаВДиадок.Объект
	|			И (ИдентификаторДокументаВДиадок.Свойство = &СвойствоДокументаИдентификатор)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_Поместить_СуммыДокОснованийЗначение()
	
	ПолныеИменаТабличныхЧастей = ИменаТабличныхЧастейОснованийСчетаФактуры();
	
	ШаблонВложенногоЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеСФ.Документ КАК Документ,
	|	ТабличнаяЧастьОснованияСФ.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	ДанныеДокументаИДокументыОснования КАК ДанныеСФ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТабличнойЧасти КАК ТабличнаяЧастьОснованияСФ
	|		ПО ДанныеСФ.ДокументОснование = ТабличнаяЧастьОснованияСФ.Ссылка";
	
	ВложенныеЗапросы = Новый Массив;
	
	Для Каждого ИмяТЧ Из ПолныеИменаТабличныхЧастей Цикл
		ТекстЗапроса = СтрЗаменить(ШаблонВложенногоЗапроса, "ИмяТабличнойЧасти", ИмяТЧ);
		ВложенныеЗапросы.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ВложенныйЗапрос = СтрСоединить(ВложенныеЗапросы, РазделительОбъединенияЗапросов());
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ СуммыДокОснованийЗначение
	|ИЗ
	|	(ТекстВложенногоЗапроса) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Документ";
	
	Результат = СтрЗаменить(Результат, "ТекстВложенногоЗапроса", ВложенныйЗапрос);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_Поместить_СЧФ_Основная()
	
	Результат =
	"ВЫБРАТЬ
	|	СЧФ_Предварительная.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА СЧФ_Предварительная.ЭтоКорректировка
	|			ТОГДА &ВидыЭД_КорректировочныйСчетФактура
	|		ИНАЧЕ &ВидыЭД_СчетФактура
	|	КОНЕЦ КАК ВидЭД,
	|	СЧФ_Предварительная.ЭтоИсправление КАК ЭтоИсправление,
	|	СЧФ_Предварительная.ЭтоКорректировка КАК ЭтоКорректировка,
	|	СЧФ_Предварительная.ЭтоАванс КАК ЭтоАванс,
	|	СЧФ_Предварительная.Организация КАК Организация,
	|	СЧФ_Предварительная.Контрагент КАК Контрагент,
	|	СЧФ_Предварительная.СуммаДокументаЗначение КАК СуммаДокументаЗначение,
	|	СЧФ_Предварительная.Валюта КАК Валюта,
	|	СЧФ_Предварительная.ID КАК ID_,
	|	СЧФ_Предварительная.СостояниеОтправкиДополнительныхВПФ КАК СостояниеОтправкиДополнительныхВПФ,
	|	СЧФ_Предварительная.Проведен КАК Проведен,
	|	СЧФ_Предварительная.Дата КАК Дата,
	|	СЧФ_Предварительная.Номер КАК Номер,
	|	ЕСТЬNULL(ИтогиПоНДС.СуммаНДС, 0) КАК СуммаНДСТовары,
	|	0 КАК СуммаНДСУслуги,
	|	""СчетФактураВыданный"" КАК Тип,
	|	СЧФ_Предварительная.ФормироватьУПД КАК ФормироватьУПД,
	|	СЧФ_Предварительная.ДокументОснование КАК ДокументОснование,
	|	СЧФ_Предварительная.ДокументОснованиеID КАК ДокументОснованиеID,
	|	СЧФ_Предварительная.ОснованиеФормированияСчета КАК ОснованиеФормированияСчета
	|ПОМЕСТИТЬ СЧФ_Основная
	|ИЗ
	|	ДанныеДокументаИДокументыОснования КАК СЧФ_Предварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыДокОснованийЗначение КАК ИтогиПоНДС
	|		ПО СЧФ_Предварительная.Документ = ИтогиПоНДС.Документ";
	
	Возврат Результат;
	
КонецФункции

Функция ИменаТабличныхЧастейОснованийСчетаФактуры()
	
	Результат = Новый Массив;
	Результат.Добавить("Документ.РеализацияАвтомобилей.Автомобили");
	Результат.Добавить("Документ.РеализацияАвтомобилей.Товары");
	
	Результат.Добавить("Документ.РеализацияАктивов.Активы");
	
	Результат.Добавить("Документ.РеализацияТоваров.Товары");
	
	Результат.Добавить("Документ.КорректировкаРеализации.Товары");
	Результат.Добавить("Документ.КорректировкаРеализации.Автоработы");
	
	Результат.Добавить("Документ.КорректировкаРеализацииАвтомобилей.Автомобили");
	
	Результат.Добавить("Документ.ВозвратПоставщику.Товары");
	
	Результат.Добавить("Документ.ВозвратПоставщикуАвтомобилей.Автомобили");
	Результат.Добавить("Документ.ВозвратПоставщикуАвтомобилей.Товары");
	
	Возврат Результат;
	
КонецФункции

Функция ВидыНоменклатурыУслуги()
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ВидыНоменклатуры.Услуга);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПолучитьТекстЗапросаДокументыОснованияСчетаФактурыВыданного() Экспорт
	
	Результат =
	"ВЫБРАТЬ
	|	СФ.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СФ
	|ГДЕ
	|	СФ.Ссылка = &СсылкаНаОбъект";
	
	Возврат Результат;
	
КонецФункции

// Вызывается из Модуль_ИнтеграцияУниверсальный.ЗаполнитьОбстФормСЧФ820.
//
// Параметры:
//  СчетФактура			 - ДокументСсылка.СчетФактураВыданный	 - счет фактура на основании которой вычисляется ОбстФормСЧФ;
//
// Возвращаемое значение:
//  Строка - вычисленное значение ОбстФормСЧФ
//
Функция ПолучитьОбстоятельствоФормированияСчетФактуры(СчетФактура) Экспорт
	
	Результат		 = Неопределено;
	
	Возврат Результат;
	
КонецФункции
