////////////////////////////////////////////////////////////////////////////////
// Служебные методы для работы с файловой системой на клиенте
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
&НаКлиенте
Перем СтдКлиентЛок, СтдФССлужебный83Лок, СтдФССлужебный8315Лок;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// КОНСТРУКТОРЫ

&НаКлиенте
Функция ПараметрыДиалогаПомещенияФайлов(Заголовок = Неопределено,
		МножественныйВыбор = Ложь,
		Фильтр = Неопределено,
		ИндексФильтра = 0) Экспорт
	
	Попытка
		ПараметрыДиалога = Новый(Тип("ПараметрыДиалогаПомещенияФайлов"));
		ПараметрыДиалога.Заголовок = Заголовок;
		ПараметрыДиалога.МножественныйВыбор = МножественныйВыбор;
		ПараметрыДиалога.Фильтр = Фильтр;
		ПараметрыДиалога.ИндексФильтра = ИндексФильтра;
	Исключение
		ПараметрыДиалога = Новый Структура;
		ПараметрыДиалога.Вставить("Заголовок", Заголовок);
		ПараметрыДиалога.Вставить("МножественныйВыбор", МножественныйВыбор);
		ПараметрыДиалога.Вставить("Фильтр", Фильтр);
		ПараметрыДиалога.Вставить("ИндексФильтра", ИндексФильтра);
		ПараметрыДиалога = Новый ФиксированнаяСтруктура(ПараметрыДиалога);
	КонецПопытки;
	
	Возврат ПараметрыДиалога;
	
КонецФункции // ПараметрыДиалогаПомещенияФайлов

&НаКлиенте
Функция ПараметрыДиалогаПолученияФайлов(Заголовок = Неопределено,
		ВыборКаталога = Неопределено,
		Каталог = Неопределено) Экспорт
	
	Попытка
		ПараметрыДиалога = Новый(Тип("ПараметрыДиалогаПолученияФайлов"));
		ПараметрыДиалога.Заголовок = Заголовок;
		ПараметрыДиалога.ВыборКаталога = ВыборКаталога;
		ПараметрыДиалога.Каталог = Каталог;
	Исключение
		ПараметрыДиалога = Новый Структура(
				"Заголовок, ВыборКаталога, Каталог",
				Заголовок, ВыборКаталога, Каталог);
		ПараметрыДиалога = Новый ФиксированнаяСтруктура(ПараметрыДиалога);
	КонецПопытки;
	
	Возврат ПараметрыДиалога;
	
КонецФункции // ПараметрыДиалогаПолученияФайлов

&НаКлиенте
Функция ОписаниеПомещенногоФайла(Адрес, ПомещениеФайлаОтменено, СсылкаНаФайл) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Адрес", Адрес);
	Результат.Вставить("ПомещениеФайлаОтменено", ПомещениеФайлаОтменено);
	Результат.Вставить("СсылкаНаФайл", СсылкаНаФайл);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // ОписаниеПомещенногоФайла

&НаКлиенте
Функция ОписаниеПереданногоФайла(ПутьКФайлу, Адрес) Экспорт
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторФайла", Новый УникальныйИдентификатор);
	Результат.Вставить("Имя", Файл.Имя);
	Результат.Вставить("ПолноеИмя", Файл.ПолноеИмя);
	Результат.Вставить("Хранение", Адрес);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // ОписаниеПереданногоФайла

&НаКлиенте
Функция СсылкаНаФайл(Файл) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторФайла", Новый УникальныйИдентификатор());
	Результат.Вставить("Имя", Файл.Имя);
	Результат.Вставить("Расширение", Файл.Расширение);
	Результат.Вставить("Файл", Файл);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции // СсылкаНаФайл

// НачатьПолучениеКаталогаВременныхФайлов

&НаКлиенте
Процедура НачатьПолучениеКаталогаВременныхФайловЛок(ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов(); // BSLLS:TempFilesDir-off
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяКаталогаВременныхФайлов);
	Иначе
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПолучениеКаталогаВременныхФайловПослеПроверкиРасширения",
				ЭтаФорма, ИсходноеОповещение);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеКаталогаВременныхФайловЛок

&НаКлиенте
Процедура НачатьПолучениеКаталогаВременныхФайловПослеПроверкиРасширения(РасширениеПодключено,
		ИсходноеОповещение) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный83().НачатьПолучениеКаталогаВременныхФайловЛок(ИсходноеОповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеКаталогаВременныхФайловПослеПроверкиРасширения

// НачатьПолучениеИмениВременногоФайла

&НаКлиенте
Процедура НачатьПолучениеИмениВременногоФайлаЛок(ИсходноеОповещение, Расширение = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("Оповещение", ИсходноеОповещение);
	Контекст.Вставить("Расширение", Расширение);
	
	#Если ВебКлиент Тогда
	Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
			"НачатьПолучениеИмениВременногоФайлаПослеПроверкиРасширения", ЭтаФорма, Контекст);
	ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	#Иначе
	ИмяВремФайла = ПолучитьИмяВременногоФайла(Расширение); // BSLLS:MissingTemporaryFileDeletion-off файл не создается
	СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяВремФайла);
	#КонецЕсли
	
КонецПроцедуры // НачатьПолучениеИмениВременногоФайлаЛок

&НаКлиенте
Процедура НачатьПолучениеИмениВременногоФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПолучениеИмениВременногоФайлаПослеПолученияВременногоКаталога", ЭтаФорма, Контекст);
		НачатьПолучениеКаталогаВременныхФайловЛок(Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеИмениВременногоФайлаПослеПроверкиРасширения

&НаКлиенте
Процедура НачатьПолучениеИмениВременногоФайлаПослеПолученияВременногоКаталога(ИмяКаталогаВременныхФайлов,
		Контекст) Экспорт
	
	Оповещение = Контекст.Оповещение;
	Расширение = Контекст.Расширение;
	
	Если НЕ Прав(ИмяКаталогаВременныхФайлов, 1) = "\" Тогда
		ИмяКаталогаВременныхФайлов = ИмяКаталогаВременныхФайлов + "\";
	КонецЕсли;
	
	ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + Строка(Новый УникальныйИдентификатор);
	
	Если НЕ ПустаяСтрока(Расширение) Тогда
		Если НЕ Лев(Расширение, 1) = "." Тогда
			ИмяВременногоФайла = ИмяВременногоФайла + ".";
		КонецЕсли;
		ИмяВременногоФайла = ИмяВременногоФайла + Расширение;
	КонецЕсли;
	
	СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(Оповещение, ИмяВременногоФайла);
	
КонецПроцедуры // НачатьПолучениеИмениВременногоФайлаПослеПолученияВременногоКаталога

// НачатьЗаписьДвоичныхДанных

&НаКлиенте
Процедура НачатьЗаписьДвоичныхДанныхЛок(ДвоичныеДанные, ИсходноеОповещение, ИмяФайла) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ДвоичныеДанные.Записать(ИмяФайла);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ДвоичныеДанные", ДвоичныеДанные);
		Контекст.Вставить("ИмяФайла", ИмяФайла);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьЗаписьДвоичныхДанныхПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьЗаписьДвоичныхДанныхЛок

&НаКлиенте
Процедура НачатьЗаписьДвоичныхДанныхПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.ДвоичныеДанные.НачатьЗапись(Контекст.Оповещение, Контекст.ИмяФайла);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьЗаписьДвоичныхДанныхПослеПроверкиРасширения

// НачатьСозданиеДвоичныхДанныхИзФайла

&НаКлиенте
Процедура НачатьСозданиеДвоичныхДанныхИзФайлаЛок(ИсходноеОповещение, ИмяФайла) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ДвоичныеДанные);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяФайла", ИмяФайла);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьСозданиеДвоичныхДанныхИзФайлаПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеДвоичныхДанныхИзФайлаЛок

&НаКлиенте
Процедура НачатьСозданиеДвоичныхДанныхИзФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный83().НачатьСозданиеДвоичныхДанныхИзФайлаЛок(Контекст.Оповещение, Контекст.ИмяФайла);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеДвоичныхДанныхИзФайлаПослеПроверкиРасширения

// НачатьКопированиеФайла

&НаКлиенте
Процедура НачатьКопированиеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяФайлаПриемника);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяФайлаИсточника", ИмяФайлаИсточника);
		Контекст.Вставить("ИмяФайлаПриемника", ИмяФайлаПриемника);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьКопированиеФайлаПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьКопированиеФайлаЛок

&НаКлиенте
Процедура НачатьКопированиеФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный83().НачатьКопированиеФайлаЛок(Контекст.Оповещение,
			Контекст.ИмяФайлаИсточника, Контекст.ИмяФайлаПриемника);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьКопированиеФайлаПослеПроверкиРасширения

// НачатьПеремещениеФайла

&НаКлиенте
Процедура НачатьПеремещениеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		ПереместитьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, ИмяФайлаПриемника);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяФайлаИсточника", ИмяФайлаИсточника);
		Контекст.Вставить("ИмяФайлаПриемника", ИмяФайлаПриемника);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПеремещениеФайлаПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПеремещениеФайлаЛок

&НаКлиенте
Процедура НачатьПеремещениеФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный83().НачатьПеремещениеФайлаЛок(
			Контекст.Оповещение, Контекст.ИмяФайлаИсточника, Контекст.ИмяФайлаПриемника);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПеремещениеФайлаПослеПроверкиРасширения

// НачатьПоискФайлов

&НаКлиенте
Процедура НачатьПоискФайловЛок(ИсходноеОповещение, Путь, Маска = Неопределено, ИскатьВПодкаталогах = Ложь) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		НайденныеФайлы = НайтиФайлы(Путь, Маска, ИскатьВПодкаталогах);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, НайденныеФайлы);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Путь", Путь);
		Контекст.Вставить("Маска", Маска);
		Контекст.Вставить("ИскатьВПодкаталогах", ИскатьВПодкаталогах);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПоискФайловПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПоискФайловЛок

&НаКлиенте
Процедура НачатьПоискФайловПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный83().НачатьПоискФайловЛок(
			Контекст.Оповещение, Контекст.Путь, Контекст.Маска, Контекст.ИскатьВПодкаталогах);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПоискФайловПослеПроверкиРасширения

// НачатьСозданиеКаталога

&НаКлиенте
Процедура НачатьСозданиеКаталогаЛок(ИсходноеОповещение, ИмяКаталога) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		СоздатьКаталог(ИмяКаталога);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("ИмяКаталога", ИмяКаталога);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьСозданиеКаталогаПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеКаталогаЛок

&НаКлиенте
Процедура НачатьСозданиеКаталогаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный83().НачатьСозданиеКаталогаЛок(Контекст.Оповещение, Контекст.ИмяКаталога);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьСозданиеКаталогаПослеПроверкиРасширения

// НачатьУдалениеФайлов

&НаКлиенте
Процедура НачатьУдалениеФайловЛок(ИсходноеОповещение, Путь, Маска = Неопределено) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		УдалитьФайлы(Путь, Маска);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Путь", Путь);
		Контекст.Вставить("Маска", Маска);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьУдалениеФайловПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьУдалениеФайловЛок

&НаКлиенте
Процедура НачатьУдалениеФайловПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный83().НачатьУдалениеФайловЛок(Контекст.Оповещение, Контекст.Путь, Контекст.Маска);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУдалениеФайловПослеПроверкиРасширения

// НачатьПомещениеФайлаНаСервер

&НаКлиенте
Процедура НачатьПомещениеФайлаНаСерверЛок(ОписаниеОповещенияОЗавершении = Неопределено, // BSLLS:OrderOfParams-off
		ОписаниеОповещенияОХодеВыполнения = Неопределено, // Соответствует оригинальной сигнатуре
		ОписаниеОповещенияПередНачалом = Неопределено,
		Адрес = Неопределено,
		Знач ПутьКФайлуПараметрыДиалога,
		УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	// 8.2
	Если ТипЗнч(ОписаниеОповещенияОЗавершении) = Тип("ФиксированнаяСтруктура") Тогда
		
		ВыбранноеИмяФайла = Неопределено;
		
		НачатьПомещениеФайлаНаСерверОбработкаИсточникаФайла(ВыбранноеИмяФайла, ПутьКФайлуПараметрыДиалога);
		
		Если ВыбранноеИмяФайла = Неопределено Тогда
			ОтказОтПомещенияФайла = Истина;
		Иначе
			
			СсылкаНаФайл = СсылкаНаФайл(Новый Файл(ВыбранноеИмяФайла));
			
			ОтказОтПомещенияФайла = Ложь;
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(СсылкаНаФайл);
			МассивПараметров.Добавить(ОтказОтПомещенияФайла);
			
			СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияСлужебный(
				ОписаниеОповещенияПередНачалом, МассивПараметров);
			
			ОтказОтПомещенияФайла = МассивПараметров[1];
			
		КонецЕсли;
		
		Если НЕ ОтказОтПомещенияФайла = Истина Тогда
			
			Адрес = Неопределено;
			ПоместитьФайл(Адрес, ВыбранноеИмяФайла, , Ложь, УникальныйИдентификаторФормы);
			ПомещаемыйФайл = ОписаниеПомещенногоФайла(Адрес, ОтказОтПомещенияФайла, СсылкаНаФайл);
			
		Иначе
			ПомещаемыйФайл = Неопределено;
		КонецЕсли;
		
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияОЗавершении, ПомещаемыйФайл);
		
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
		Контекст.Вставить("ОписаниеОповещенияОХодеВыполнения", ОписаниеОповещенияОХодеВыполнения);
		Контекст.Вставить("ОписаниеОповещенияПередНачалом", ОписаниеОповещенияПередНачалом);
		Контекст.Вставить("Адрес", Адрес);
		Контекст.Вставить("ПутьКФайлуПараметрыДиалога", ПутьКФайлуПараметрыДиалога);
		Контекст.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПомещениеФайлаНаСерверПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверЛок

&НаКлиенте
Процедура НачатьПомещениеФайлаНаСерверПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	ПутьКФайлуПараметрыДиалога = Контекст.ПутьКФайлуПараметрыДиалога;
	
	Если СтдКлиентЛок.Стр().ВерсияПлатформыБольшеИлиРавна("8.3.15") Тогда
		
		СтдФССлужебный8315().НачатьПомещениеФайлаНаСерверЛок(Контекст.ОписаниеОповещенияОЗавершении,
			Контекст.ОписаниеОповещенияОХодеВыполнения,
			Контекст.ОписаниеОповещенияПередНачалом,
			Контекст.Адрес,
			ПутьКФайлуПараметрыДиалога,
			Контекст.УникальныйИдентификаторФормы);
		
	Иначе
		
		КонтекстЗавершения = Новый Структура;
		КонтекстЗавершения.Вставить("ОписаниеОповещенияОЗавершении", Контекст.ОписаниеОповещенияОЗавершении);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПомещениеФайлаНаСерверПослеПомещенияФайлаДо8_3_15", ЭтаФорма, КонтекстЗавершения);
		
		Если СтдКлиентЛок.Стр().ВерсияПлатформыБольшеИлиРавна("8.3.13") Тогда
			
			Если ТипЗнч(ПутьКФайлуПараметрыДиалога) = Тип("ФиксированнаяСтруктура") Тогда
				
				ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
				ДиалогОткрытияФайла.Заголовок = ПутьКФайлуПараметрыДиалога.Заголовок;
				ДиалогОткрытияФайла.МножественныйВыбор = ПутьКФайлуПараметрыДиалога.МножественныйВыбор;
				ДиалогОткрытияФайла.Фильтр = ПутьКФайлуПараметрыДиалога.Фильтр;
				
				ПутьКФайлуПараметрыДиалога = ДиалогОткрытияФайла;
				
				Интерактивно = Истина;
				
			Иначе
				Интерактивно = Ложь;
			КонецЕсли;
			
			СтдФССлужебный83().НачатьПомещениеФайлаЛок(Оповещение,
				Контекст.Адрес,
				ПутьКФайлуПараметрыДиалога,
				Интерактивно,
				Контекст.УникальныйИдентификаторФормы,
				Контекст.ОписаниеОповещенияПередНачалом);
			
			// от 8.3.6
		Иначе
			
			Интерактивно = Ложь;
			
			Если ТипЗнч(ПутьКФайлуПараметрыДиалога) = Тип("ФиксированнаяСтруктура") Тогда
				Интерактивно = Истина;
			КонецЕсли;
			
			СтдФССлужебный83().НачатьПомещениеФайлаЛок(Оповещение,
				Контекст.Адрес,
				ПутьКФайлуПараметрыДиалога,
				Интерактивно,
				Контекст.УникальныйИдентификаторФормы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверПослеПроверкиРасширения

&НаКлиенте
Процедура НачатьПомещениеФайлаНаСерверПослеПомещенияФайлаДо8_3_15(Результат, Адрес, ПомещаемыйФайл, Контекст) Экспорт
	
	Если Результат = Истина Тогда
		
		СсылкаНаФайл = СсылкаНаФайл(Новый Файл(ПомещаемыйФайл));
		ОтказОтПомещенияФайла = Ложь;
		
		ПомещаемыйФайл = ОписаниеПомещенногоФайла(Адрес, ОтказОтПомещенияФайла, СсылкаНаФайл);
		
	Иначе
		
		ПомещаемыйФайл = Неопределено;
		
	КонецЕсли;
	
	СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(Контекст.ОписаниеОповещенияОЗавершении,
		ПомещаемыйФайл);
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверПослеПомещенияФайлаДо8_3_15

// НачатьПолучениеФайлаССервераСДиалогом

&НаКлиенте
Процедура НачатьПолучениеФайлаССервераСДиалогомЛок(Адрес, ИмяФайла = Неопределено,
		ПараметрыДиалога = Неопределено) Экспорт
	
	Если НЕ СтдКлиентЛок.Стр().ВерсияПлатформыБольшеИлиРавна("8.3.15") Тогда
		
		ПолучитьФайл(Адрес, ИмяФайла, Истина);
		
	Иначе
		
		СтдФССлужебный8315().НачатьПолучениеФайлаССервераСДиалогом(Адрес, ИмяФайла, ПараметрыДиалога);
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеФайлаССервераСДиалогомЛок

// НачатьПолучениеФайлаССервераБезДиалога

&НаКлиенте
Процедура НачатьПолучениеФайлаССервераБезДиалогаЛок(// Сигнатура соответствует оригиналу
		ОписаниеОповещенияОЗавершении = Неопределено, Адрес, ПутьКФайлу) Экспорт // BSLLS:OrderOfParams-off
	
	Если НЕ СтдКлиентЛок.Стр().ВерсияПлатформыБольшеИлиРавна("8.3.15") Тогда
		
		#Если ВебКлиент Тогда
		ПолучитьФайл(Адрес, ПутьКФайлу, Истина); // В веб клиенте всегда Интерактивно = Истина
		
		#Иначе
		ПолучитьФайл(Адрес, ПутьКФайлу, Ложь);
		#КонецЕсли
		
		Если НЕ ОписаниеОповещенияОЗавершении = Неопределено Тогда
			ОписаниеФайла = ОписаниеПереданногоФайла(ПутьКФайлу, Адрес);
			СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ОписаниеОповещенияОЗавершении, ОписаниеФайла);
		КонецЕсли;
		
	Иначе
		
		#Если ВебКлиент Тогда
		Контекст = Новый Структура;
		Контекст.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
		Контекст.Вставить("Адрес", Адрес);
		Контекст.Вставить("ПутьКФайлу", ПутьКФайлу);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПолучениеФайлаССервераБезДиалогаПослеПроверкиРасширения", ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
		#Иначе
		СтдФССлужебный8315().НачатьПолучениеФайлаССервераБезДиалога(ОписаниеОповещенияОЗавершении, Адрес, ПутьКФайлу);
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеФайлаССервераБезДиалогаЛок

&НаКлиенте
Процедура НачатьПолучениеФайлаССервераБезДиалогаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		СтдФССлужебный8315().НачатьПолучениеФайлаССервераБезДиалога(Контекст.ОписаниеОповещенияОЗавершении,
			Контекст.Адрес,
			Контекст.ПутьКФайлу);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеФайлаССервераБезДиалогаПослеПроверкиРасширения

&НаКлиенте
Процедура НачатьЗапросРазрешенияПользователяЛок(ИсходноеОповещение, Вызовы)
	
	Возврат;
	
КонецПроцедуры // НачатьЗапросРазрешенияПользователяЛок

// НачатьПолучениеВремениИзмененияФайла

&НаКлиенте
Процедура НачатьПолучениеВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьВремяИзменения();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПолучениеВремениИзмененияФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеВремениИзмененияФайлаЛок

&НаКлиенте
Процедура НачатьПолучениеВремениИзмененияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеВремениИзменения(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеВремениИзмененияФайлаПослеПроверкиРасширения

// НачатьПолучениеНевидимостиФайла

&НаКлиенте
Процедура НачатьПолучениеНевидимостиФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьНевидимость();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПолучениеНевидимостиФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеНевидимостиФайлаЛок

&НаКлиенте
Процедура НачатьПолучениеНевидимостиФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеНевидимости(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеНевидимостиФайлаПослеПроверкиРасширения

// НачатьПолучениеРазмераФайла

&НаКлиенте
Процедура НачатьПолучениеРазмераФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.Размер();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения("НачатьПолучениеРазмераФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеРазмераФайлаЛок

&НаКлиенте
Процедура НачатьПолучениеРазмераФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеРазмера(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеРазмераФайлаПослеПроверкиРасширения

// НачатьПолучениеТолькоЧтенияФайла

&НаКлиенте
Процедура НачатьПолучениеТолькоЧтенияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьТолькоЧтение();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПолучениеТолькоЧтенияФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеТолькоЧтенияФайлаЛок

&НаКлиенте
Процедура НачатьПолучениеТолькоЧтенияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеТолькоЧтения(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеТолькоЧтенияФайлаПослеПроверкиРасширения

// НачатьПолучениеУниверсальногоВремениИзмененияФайла

&НаКлиенте
Процедура НачатьПолучениеУниверсальногоВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ПолучитьУниверсальноеВремяИзменения();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПолучениеУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеУниверсальногоВремениИзмененияФайлаЛок

&НаКлиенте
Процедура НачатьПолучениеУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения(РасширениеПодключено,
		Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПолучениеУниверсальногоВремениИзменения(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПолучениеУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения

// НачатьПроверкуСуществованияФайла

&НаКлиенте
Процедура НачатьПроверкуСуществованияФайлаЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.Существует();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьПроверкуСуществованияФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуСуществованияФайлаЛок

&НаКлиенте
Процедура НачатьПроверкуСуществованияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПроверкуСуществования(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуСуществованияФайлаПослеПроверкиРасширения

// НачатьПроверкуЭтоКаталогФайл

&НаКлиенте
Процедура НачатьПроверкуЭтоКаталогФайлЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ЭтоКаталог();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения("НачатьПроверкуЭтоКаталогФайлПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоКаталогФайлЛок

&НаКлиенте
Процедура НачатьПроверкуЭтоКаталогФайлПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПроверкуЭтоКаталог(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоКаталогФайлПослеПроверкиРасширения

// НачатьПроверкуЭтоФайлФайл

&НаКлиенте
Процедура НачатьПроверкуЭтоФайлФайлЛок(Файл, ИсходноеОповещение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Файл.ЭтоФайл();
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение, Результат);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения("НачатьПроверкуЭтоФайлФайлПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоФайлФайлЛок

&НаКлиенте
Процедура НачатьПроверкуЭтоФайлФайлПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьПроверкуЭтоФайл(Контекст.Оповещение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьПроверкуЭтоФайлФайлПослеПроверкиРасширения

// НачатьУстановкуВремениИзмененияФайла

&НаКлиенте
Процедура НачатьУстановкуВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение, ВремяИзменения) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьВремяИзменения(ВремяИзменения);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("ВремяИзменения", ВремяИзменения);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьУстановкуВремениИзмененияФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуВремениИзмененияФайлаЛок

&НаКлиенте
Процедура НачатьУстановкуВремениИзмененияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуВремениИзменения(Контекст.Оповещение, Контекст.ВремяИзменения);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуВремениИзмененияФайлаПослеПроверкиРасширения

// НачатьУстановкуНевидимостиФайла

&НаКлиенте
Процедура НачатьУстановкуНевидимостиФайлаЛок(Файл, ИсходноеОповещение, Невидимость) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьНевидимость(Невидимость);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("Невидимость", Невидимость);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьУстановкуНевидимостиФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуНевидимостиФайлаЛок

&НаКлиенте
Процедура НачатьУстановкуНевидимостиФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуНевидимости(Контекст.Оповещение, Контекст.Невидимость);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуНевидимостиФайлаПослеПроверкиРасширения

// НачатьУстановкуТолькоЧтенияФайла

&НаКлиенте
Процедура НачатьУстановкуТолькоЧтенияФайлаЛок(Файл, ИсходноеОповещение, ТолькоЧтение) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьТолькоЧтение(ТолькоЧтение);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("ТолькоЧтение", ТолькоЧтение);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьУстановкуТолькоЧтенияФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуТолькоЧтенияФайлаЛок

&НаКлиенте
Процедура НачатьУстановкуТолькоЧтенияФайлаПослеПроверкиРасширения(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуТолькоЧтения(Контекст.Оповещение, Контекст.ТолькоЧтение);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуТолькоЧтенияФайлаПослеПроверкиРасширения

// НачатьУстановкуУниверсальногоВремениИзмененияФайла

&НаКлиенте
Процедура НачатьУстановкуУниверсальногоВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение, ВремяИзменения) Экспорт
	
	Если ТипЗнч(ИсходноеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Файл.УстановитьУниверсальноеВремяИзменения(ВремяИзменения);
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(ИсходноеОповещение);
	Иначе
		
		Контекст = Новый Структура;
		Контекст.Вставить("Оповещение", ИсходноеОповещение);
		Контекст.Вставить("Файл", Файл);
		Контекст.Вставить("ВремяИзменения", ВремяИзменения);
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"НачатьУстановкуУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения",
				ЭтаФорма, Контекст);
		ПодключитьУстановитьРасширениеРаботыСФайлами(Оповещение);
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуУниверсальногоВремениИзмененияФайлаЛок

&НаКлиенте
Процедура НачатьУстановкуУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения(РасширениеПодключено,
		Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		Контекст.Файл.НачатьУстановкуУниверсальногоВремениИзменения(Контекст.Оповещение, Контекст.ВремяИзменения);
	Иначе
		ОбработатьОтсутствиеРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры // НачатьУстановкуУниверсальногоВремениИзмененияФайлаПослеПроверкиРасширения

// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПослеПодключенияРасширенияРаботыСФайлами(Подключено, ДопПараметры) Экспорт
	
	Если Подключено Тогда
		РасширениеПодключено = Истина;
		СтдКлиентЛок.ОбщегоНазначения().ВыполнитьОбработкуОповещенияЛок(
			ДопПараметры.ИсходноеОповещение, РасширениеПодключено);
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		
		Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
				"ПослеУстановкиРасширенияРаботыСФайлами",
				ЭтаФорма,
				ДопПараметры.ИсходноеОповещение);
		
		СтдФССлужебный83().НачатьУстановкуРасширенияРаботыСФайламиЛок(Оповещение);
		
	Иначе
		// не удалось подключить или установить расширение
		ВызватьИсключение("Не удалось подключить или установить расширение");
	КонецЕсли;
	
КонецПроцедуры // ПослеПодключенияРасширенияРаботыСФайлами

&НаКлиенте
Процедура ПослеУстановкиРасширенияРаботыСФайлами(ИсходноеОповещение) Экспорт
	
	ПодключитьУстановитьРасширениеРаботыСФайлами(ИсходноеОповещение, Ложь);
	
КонецПроцедуры // ПослеУстановкиРасширенияРаботыСФайлами

&НаКлиенте
Функция Инит(СтдКлиент) Экспорт
	
	СтдКлиентЛок = СтдКлиент;
	
	Возврат ЭтаФорма;
	
КонецФункции // Инит

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НачатьПомещениеФайлаНаСерверОбработкаИсточникаФайла(ВыбранноеИмяФайла, ПутьКФайлуПараметрыДиалога)
	
	ТипЗнчИсточника = ТипЗнч(ПутьКФайлуПараметрыДиалога);
	
	Если ТипЗнчИсточника = Тип("ФиксированнаяСтруктура")
		И ПутьКФайлуПараметрыДиалога.Свойство("Заголовок") Тогда
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Заголовок = ПутьКФайлуПараметрыДиалога.Заголовок;
		ДиалогОткрытияФайла.МножественныйВыбор = ПутьКФайлуПараметрыДиалога.МножественныйВыбор;
		ДиалогОткрытияФайла.Фильтр = ПутьКФайлуПараметрыДиалога.Фильтр;
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ВыбранноеИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнчИсточника = Тип("Строка") Тогда
		ВыбранноеИмяФайла = ПутьКФайлуПараметрыДиалога;
	Иначе
		ВызватьИсключение "Ошибка типа: " + ТипЗнчИсточника;
	КонецЕсли;
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверОбработкаИсточникаФайла

&НаКлиенте
Процедура ПодключитьУстановитьРасширениеРаботыСФайлами(ИсходноеОповещение, УстановитьЕслиНеПодключено = Истина)
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("УстановитьЕслиНеПодключено", УстановитьЕслиНеПодключено);
	ДопПараметры.Вставить("ИсходноеОповещение", ИсходноеОповещение);
	
	Оповещение = СтдКлиентЛок.ОбщегоНазначения().ОписаниеОповещения(
			"ПослеПодключенияРасширенияРаботыСФайлами",
			ЭтаФорма,
			ДопПараметры);
	
	СтдФССлужебный83().НачатьПодключениеРасширенияРаботыСФайламиЛок(Оповещение);
	
КонецПроцедуры // ПодключитьУстановитьРасширениеРаботыСФайлами

&НаКлиенте
Процедура ОбработатьОтсутствиеРасширенияРаботыСФайлами()
	
	ВызватьИсключение "Не подключено расширение работы с файлами";
	
КонецПроцедуры // ОбработатьОтсутствиеРасширенияРаботыСФайлами

&НаКлиенте
Функция СтдФССлужебный83()
	
	Если СтдФССлужебный83Лок = Неопределено Тогда
		СтдФССлужебный83Лок = ПолучитьФорму(ИмяФормы + "83");
	КонецЕсли;
	
	Возврат СтдФССлужебный83Лок;
	
КонецФункции // СтдФССлужебный83

&НаКлиенте
Функция СтдФССлужебный8315()
	
	Если СтдФССлужебный8315Лок = Неопределено Тогда
		СтдФССлужебный8315Лок = ПолучитьФорму(ИмяФормы + "8315");
	КонецЕсли;
	
	Возврат СтдФССлужебный8315Лок;
	
КонецФункции // СтдФССлужебный8315