#Область ОписаниеПеременных

&НаКлиенте
Перем 
ЦП_Сервис Экспорт; // Интерфейс 

#КонецОбласти

#Область Интерфейс

&НаКлиенте
Процедура ИнициализироватьЦентПоддержки() Экспорт
		
	МассивМодулей = Модули();
	ТипМетаданных = "ВнешняяОбработка";
	
	Для Каждого Модуль Из МассивМодулей Цикл	
		
		Если Вычислить(Модуль) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;

		Попытка
			Форма = ПолучитьФорму(ТипМетаданных + ".SupportCenter.Форма." + Модуль);	
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось подключить модуль: " + Модуль;
			Сообщение.Сообщить();
		КонецПопытки;
		
		Выполнить(Модуль + " = Форма");
		
	КонецЦикла;
	
	ИнтегрироватьМодули(МассивМодулей);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнтегрироватьМодули(МассивМодулей)
	
	Для Каждого Модуль Из МассивМодулей Цикл
		
		Попытка
			Зависимости = Вычислить(Модуль + ".Зависимости()");		
		Исключение
			Зависимости = Новый Массив;
		КонецПопытки;
				
		Для Каждого Зависимость Из Зависимости Цикл			
			Выполнить(Модуль + "." + Зависимость + " = " + Зависимость);			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция Модули()
	
	МассивФорм = Новый Массив;
	МассивФорм.Добавить("ЦП_Сервис");

	Возврат МассивФорм;
	
КонецФункции

#КонецОбласти

#Область ТелоМодуля

#Если Клиент И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	ИнициализироватьЦентПоддержки();
#КонецЕсли

#КонецОбласти
