
// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится "Команда выполняется..."
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, "0.1.0");
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

//{		ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает версию подсистемы Контур.Логистика
// 
// Возвращаемое значение:
//  Строка, Неопределено - Версия подсистемы Контур Логистики.
//                         Если подсистема установлена, но нельзя получить версию, то вернется 0.0.0.
//                         Если подсистема не найдена то возвращается Неопределено
//
Функция ВерсияПодсистемыКонтурЛогистика() Экспорт
	
	Результат = Неопределено;
	
	ОбщийМодульКонтурЛогистики = ОбщийМодульКонтурЛогистикиСервер();
	
	Если ОбщийМодульКонтурЛогистики <> Неопределено Тогда
		
		Попытка
			
			Результат = ОбщийМодульКонтурЛогистики.ТекущаяВерсияПодсистемыКонтурЛогистика();
			
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЖурналРегистрации_ЗаписатьОшибку("ТекущаяВерсияПодсистемыКонтурЛогистика", ТекстОшибки);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак наличия модуля Логистики, с которым доступна интеграция.
// Определение происходит через поиск интеграционного общего модуля из поставки Логистики.
// 
// Возвращаемое значение:
//  Булево - признак наличия модуля
//
Функция МодульДоступенДляИнтеграции() Экспорт
	
	ИмяМодуля = ИмяМодуляИнтеграцииСервер();
	
	Результат = (Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак наличия модуля Логистики любой версии.
// Определение происходит через поиск обработки рабочего стола Логистики.
// 
// Возвращаемое значение:
//  Булево - признак наличия модуля
//
Функция МодульУстановлен() Экспорт
	
	ИмяОбработки = "КонтурЛогистика_РабочийСтол";
	
	Результат = (Метаданные.Обработки.Найти(ИмяОбработки) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификатор модуля Мастера установки Логистики,
// который опубликован в Сервисе обновлений
// 
// Возвращаемое значение:
//  Строка - идентификатор
//
Функция ИдентификаторМодуляМастераУстановки() Экспорт
	
	Возврат "logist_installer";
	
КонецФункции

// Возвращает сводную информацию о перевозочных документах для коллекции учетных документов пакета
//
// Параметры:
//  ДокументыУчета	 - Массив	 - Коллекция ссылок на учетные документы пакета
// 
// Возвращаемое значение:
//  Структура - Сводная информация о перевозочных документах
//
Функция СостояниеПеревозочныхДокументов(ДокументыУчета) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидимостьКоманды", Ложь);
	Результат.Вставить("Заголовок");
	Результат.Вставить("ВведеноЭПД");
	Результат.Вставить("Незавершенных");
	Результат.Вставить("Задач");
	Результат.Вставить("Вводов");
	Результат.Вставить("Картинка");
	Результат.Вставить("Подсказка");
	Результат.Вставить("ТекстОшибки");
	
	ОбщийМодульКонтурЛогистики = ОбщийМодульКонтурЛогистикиСервер();
	
	Если ОбщийМодульКонтурЛогистики <> Неопределено Тогда
		
		Попытка
			
			ДанныеЭПД = ОбщийМодульКонтурЛогистики.СостояниеЭПД(ДокументыУчета);
			
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЖурналРегистрации_ЗаписатьОшибку("СостояниеЭПД", ТекстОшибки);
			
			Результат.ТекстОшибки = ТекстОшибки;
			
		КонецПопытки;
		
		Если ТипЗнч(ДанныеЭПД) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(Результат, ДанныеЭПД);
			
			Если НЕ ЗначениеЗаполнено(Результат.Заголовок) Тогда
				Результат.ВидимостьКоманды = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// BSLLS:MissingReturnedValueDescription-off
// Открывает Рабочий стол модуля Логистики (при вызове из ОФ)
//
// Параметры:
//  Период - СтандартныйПериод - Период для Рабочего стола
//
Функция ОткрытьРабочийСтол(Период) Экспорт
	
	Результат = "";
	
	ОбщийМодульКонтурЛогистики = ОбщийМодульКонтурЛогистикиКлиент();
	
	Попытка
		
		ОбщийМодульКонтурЛогистики.ОткрытьРабочийСтол(Период);
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЖурналРегистрации_ЗаписатьОшибку("ОткрытьРабочийСтол", ТекстОшибки);
		
		Результат = ТекстОшибки;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
// BSLLS:MissingReturnedValueDescription-on

// BSLLS:MissingReturnedValueDescription-off

// Открывает форму с перевозочными документами (при вызове из ОФ)
//
// Параметры:
//  ФормаВызова		 - Форма	 - Форма, из которой происходит вызов
//  ДокументыУчета	 - Массив	 - Коллекция ссылок на учетные документы пакета
//
Функция ОткрытьПеревозочныеДокументы(ФормаВызова, ДокументыУчета) Экспорт
	
	Результат = "";
	
	ОбщийМодульКонтурЛогистики = ОбщийМодульКонтурЛогистикиКлиент();
	
	Попытка
		
		ОбщийМодульКонтурЛогистики.ПеревозочныеНажатие(ФормаВызова, ДокументыУчета);
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЖурналРегистрации_ЗаписатьОшибку("ПеревозочныеНажатие", ТекстОшибки);
		
		Результат = ТекстОшибки;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
// BSLLS:MissingReturnedValueDescription-on

//}		ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ИмяМодуляИнтеграцииСервер()
	
	Возврат "КонтурЛогистика_ИнтеграцияКонтурСервер";
	
КонецФункции

Функция ИмяМодуляИнтеграцииКлиент()
	
	Возврат "КонтурЛогистика_ИнтеграцияКонтурКлиент";
	
КонецФункции

Функция ОбщийМодульКонтурЛогистикиСервер()
	
	ИмяМодуля = ИмяМодуляИнтеграцииСервер();
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Результат = Неопределено;
	Иначе
		Результат = Вычислить(ИмяМодуля);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульКонтурЛогистикиКлиент()
	
	ИмяМодуля = ИмяМодуляИнтеграцииКлиент();
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Результат = Неопределено;
	Иначе
		Результат = Вычислить(ИмяМодуля);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЖурналРегистрации_ЗаписатьОшибку(Знач ИмяСобытия, Знач Комментарий)
	
	ИдентификаторСобытия = "Диадок.ИнтеграцияСЛогистикой." + ИмяСобытия;
	
	ЗаписьЖурналаРегистрации(
		ИдентификаторСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		Неопределено,
		Неопределено,
		Комментарий
	);
	
КонецПроцедуры
