#Область СлужебныйПрограммныйИнтерфейс

Функция КонтекстСеанса() Экспорт
	
	Результат = КонтурДиадокСервер.КонтекстСеанса();
	Возврат Результат;
	
КонецФункции

Процедура КонтекстСеансаУстановить(Знач КонтекстСеанса) Экспорт
	
	КонтурДиадокСервер.КонтекстСеансаУстановить(КонтекстСеанса);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурналРегистрации(Знач ИмяСобытия, Знач ПодробноеПредставлениеОшибки) Экспорт
	
	КонтурДиадокСервер.ЗаписатьОшибкуВЖурналРегистрации(ИмяСобытия, ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

#КонецОбласти
