////////////////////////////////////////////////////////////////////////////////
// Служебные методы для работы со строками на клиенте:
// - Поиск, замена, разделения, соединения строк;
// - сравнения версий;
// - работа с почтовыми адресами;
// - прочее.
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызов метода СтрНайти, для совместимости, см. описание стандартного метода СтрНайти
//
// Параметры:
//  Строка				- Строка	- Исходная строка
//  Подстрока			- Строка	- Искомая подстрока
//  Направление			- Строка	- Направление поиска, СНачала или СКонца
//  НачальнаяПозиция	- Число		- Указывает позицию в строке, с которой начинается поиск.
//										По умолчанию 1 или СтрДлина(Строка)
//  НомерВхождения		- Число		- Указывает номер вхождения искомой подстроки в исходной строке. По умолчанию - 1
//
// Возвращаемое значение:
//
// Число - Позиция первого знака найденной подстроки. Если строка не содержит указанной подстроки, то возвращается 0.
//
Функция СтрНайтиЛок(Строка, Подстрока, Направление, НачальнаяПозиция, НомерВхождения) Экспорт
	
	Если ТипЗнч(Направление) = Тип("Строка") Тогда
		Направление_ = НаправлениеПоиска[Направление];
	Иначе
		Направление_ = Направление;
	КонецЕсли;
	
	Возврат СтрНайти(Строка, Подстрока, Направление_, НачальнаяПозиция, НомерВхождения);
	
КонецФункции // СтрНайтиЛок

// Вызов метода СтрШаблон, для совместимости, см. описание стандартного метода СтрШаблон
//
// Параметры:
//	Шаблон	- Строка		- Строка, содержащая маркеры подстановки вида: "%1..%N".
//								Нумерация маркеров начинается с 1. N не может быть больше 10.
//  Параметр1   - Строка 	- значение подставляемого параметра.
//  Параметр2   - Строка
//  Параметр3   - Строка
//  Параметр4   - Строка
//  Параметр5   - Строка
//  Параметр6   - Строка
//  Параметр7   - Строка
//  Параметр8   - Строка
//  Параметр9   - Строка
//  Параметр10	- Строка
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
Функция СтрШаблонЛок(Шаблон, Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено,
		Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено, Параметр8 = Неопределено,
		Параметр9 = Неопределено, Параметр10 = Неопределено) Экспорт
	
	Возврат СтрШаблон(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6,
		Параметр7, Параметр8, Параметр9, Параметр10);
	
КонецФункции // СтрШаблонЛок

// Вызов метода СтрСравнить, для совместимости, см. описание стандартного метода СтрСравнить
//
// Параметры:
// 	Строка1	-	Строка 	- Первая строка для сравнения
// 	Строка2	-	Строка	- Вторая строка для сравнения
//
// Возвращаемое значение:
// 	Число	-	1 - первая строка больше второй, -1 - первая строка меньше второй, 0 - первая строка равна второй
//
Функция СтрСравнитьЛок(Строка1, Строка2) Экспорт
	
	Возврат СтрСравнить(Строка1, Строка2);
	
КонецФункции // СтрСравнитьЛок

// Вызов метода СтрРазделить, для совместимости, см. описание стандартного метода СтрРазделить
//
// Параметры:
//  Строка			- Строка	- Исходная строка
//  Разделитель		- Строка	- Строка символов, каждый из которых является индивидуальным разделителем. По умолчанию = ","
//  ВключатьПустые	- Булево	- Указывает необходимость включать в результат пустые строки, которые могут образоваться в
//									результате разделения исходной строки. По умолчанию = Истина
//
// Возвращаемое значение:
// Массив - Массив со строками, которые получились в результате разделения исходной строки.
//
Функция СтрРазделитьЛок(Строка, Разделитель, ВключатьПустые) Экспорт
	
	Возврат СтрРазделить(Строка, Разделитель, ВключатьПустые);
	
КонецФункции // СтрРазделитьЛок

// Вызов метода СтрСоединить, для совместимости, см. описание стандартного метода СтрСоединить
//
// Параметры:
// 	Строки		- Массив	- Массив, содержащий объединяемые строки
//	Разделитель	- Строка	- Строка, которая будет вставлена между объединяемыми строками.
//								Если параметр не задан, строки будут объединены слитно друг с другом
// Возвращаемое значение:
// 	Строка - Строка, содержащая соединенные исходные строки с разделителем между ними
//
Функция СтрСоединитьЛок(Строки, Разделитель = "") Экспорт
	
	Возврат СтрСоединить(Строки, Разделитель);
	
КонецФункции // СтрСоединитьЛок